{"title": "Bloomberg: Volkswagen as the Next Tesla is firing up stock investors", "selftext": "(Re. VOW and VWAGY)\n\n[Bloomberg: Volkswagen as the next Tesla is firing up stock investors](https://www.bnnbloomberg.ca/volkswagen-as-the-next-tesla-is-firing-up-stock-investors-1.1581434)\n\nExcerpt:\n\n> The stock started taking off last week as investors bought into the Germany company’s plan to supplant Tesla Inc. as the global leader in electric cars. Chief Executive Officer Herbert Diess made a series of announcements on his strategy to beat his California-based rival, emulating his counterpart at Tesla, Elon Musk. In return, VW common shares picked up a bit of Tesla’s cult status, soaring 60 per cent so far this month.\n\nAlso:\n\n> Sell-side analysts tracked by Bloomberg factored the new prospects for the company’s EV plans into their models, leading to the average price target rising alongside shares. Yet for the moment only about 7.7 per cent upside is left in the preferred stock if the 12-month average target is any guide. Hence, no surprise that the number of analysts rating the stock a buy is right where it was when the rally began.\n\nAnd:\n\n> VW is a giant compared to Tesla when it comes to sales volume. The German carmaker sold more than 9 million cars last year versus just half a million for Tesla. And while VW is still trailing Tesla in terms of EV sales, the gap is closing fast with Volkswagen accelerating its growth from the low base. Yet Tesla’s market value is almost four times greater than Volkswagen’s after a stunning 743 per cent share price rally last year.", "id": "mdeq8x", "created_utc": 1616725938.0, "score": 18, "upvote_ratio": 0.71, "num_comments": 46, "comments": [{"body": "Has anyone factored in that the weakest part of VW has always been ironically.... the electric?", "score": 21, "replies": [{"body": "With the amount of times VW has had a lawsuit due to cutting corners as well I don't know if I can ever trust their cars if they did have a \"self driving\" or \"battery car\" I'd be fearful for battery starting fire or the self driving function breaking down.", "score": 4, "replies": []}, {"body": "Their ID.4 has not had a good showing. It's not a bad car, but it is the weakest of the new electric cars.", "score": 3, "replies": []}, {"body": "Owned two VWs. Can confirm both had electrical issues. They weren't expensive to fix or anything, but it does make me wonder.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "This is a problem with a lot of German companies when it comes to reliability.  \n\nOne of the reasons is that German companies keep engineering teams for different subsystems largely separate from each other.  The final prototyping team is supposed to work out the kinks instead of the original engineering teams.  It does reduce a lot of wasted meetings in the beginning of a building out a new car, but major oversights sometimes get through which would be caught by teams working more closely together.  Volkswagen also loves to re-use parts and sometimes it is better to redesign a part instead.  \n\nJapanese car engineers are the complete opposite.  Their entire crew works together from start to finish.", "score": 9, "replies": [{"body": "It's too bad that Japanese auto will be the last movers to the EV space.\n\nBut hey, let's keep profiting and growing ICE market share in India and Indonesia, right?", "score": 2, "replies": [{"body": "They might be right though on hydrogen.  \n\nDon't count them out.", "score": 2, "replies": [{"body": "Hydrogen fuel cell costs haven't been driven down yet, unlike what has happened to all-electric batteries.\n\nI do find the \"plug-in fuel cell\" electric vehicle concept interesting, as it combines the BEV and the FCEV.", "score": 1, "replies": []}]}, {"body": "Toyota has a partnership with a Chinese EV/battery company, they'll be able to ramp up quickly.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "You realize that German companies manufacture in the location of their market right? Audi, BMW, VW, Porsche, Merc all manufacture in Mexico and in close places globally with cheap labor ready.\n\nGermans work a 60 hour work week in 40 hours because they’re German and everything must be efficient and procedural.", "score": 10, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Primarily in Germany, there are facilities in NA and a few other countries though. Despite labor regulations, salaried workers tend to have the expectation to take their work home or find ways to get stuff done. Germany is a lot like the US in a lot of ways labor wise. There are loopholes surrounding their regulations, especially relating to limited contracts where labor laws aren’t always applicable.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is exactly what I thought when I read about VW becoming the next Tesla. Really? VW?", "score": 4, "replies": [{"body": "Yeah low quality car made by unskilled Labour. Fits the story", "score": 2, "replies": []}]}, {"body": "Yeah the Jetta is a breakdown machine.  I have a few friends that bought them and every single one of them said that car had problems.  I had very little problems with all my Toyota’s.", "score": 3, "replies": []}, {"body": ">all VW has is the German engineering name and the VW brand.\n\nWell, that and very deep pockets, a massive worldwide manufacturing and distribution network, the largest auto sales volume in Europe and China, and the 1st or 2nd largest sales volume worldwide for the past several years. After Dieselgate, VW made a massive pivot towards EVs and in the near short term they will eclipse Tesla as the largest EV manufacturer.", "score": 1, "replies": []}]}]}, {"body": "And GM is up near 100% in six months due to Mary Barra talking about electric cars and making Cadillac the premium EV mfg.   The momentum is great but at the end of the day there will be roughly the same number of cars sold globally it will just be a much larger % that will be EVs.  So I suspect if you are going to play this game, you do it as a trade rather than a life long investment.", "score": 7, "replies": [{"body": "The upside for GM is not much, given its previous bankruptcy dealings, and given that its announcements have not been very bold.\n\nVW, on the other hand, is a [$1.1 trillion enterprise in the making](https://www.reddit.com/r/stocks/comments/mb3y4s/tesla_tsla_could_be_worth_29_trillion_usd_by_2025/).", "score": -5, "replies": [{"body": "Actually its successful BK filing is what gives it the ability to become really valuable with little baggage.", "score": 6, "replies": []}]}]}, {"body": "EV bubble [pop](https://youtu.be/bw9CALKOvAI)", "score": 6, "replies": [{"body": "What matters a lot in the EV play is the fact is that AI is **throttled**. Even if we maintain exponential increases in computing ability fully autonomous vehicles are a long shot. Since that’s what Tesla’s business model is building to they’re fucked if tech holds fast and conventional auto can replicate them with less features.\n\nHowever with battery and charging breakthroughs, in the short term more affordable EVs have massive upside potential. VW doesn’t want Tesla’s prices and can out manufacture Tesla and deliver on a global scale. \n\nWhen it comes to auto engineering I will bet on the Germans every day of the week.", "score": 2, "replies": [{"body": "Its pretty clear you don't know anything about AI so please stop spreading misinformation.", "score": -4, "replies": [{"body": "You clearly know less. AI is throttled by exponential compute times. Even as GPU computation is improved Amdahl’s law holds and there’s a theoretic limit to how far we can go without algorithmic or quantum breakthroughs. Classifier visual and LISAR networks are not cheap computationally. The sensors are expensive and it requires even more compute power to conduct underlying functions. It’s doable with current technology but cost prohibitive.\n\nGoogle has proven the viability self driving cars, but do you know how much those prototypes cost? It’s purely because you have to spend a lot up front on stable system with sufficient hardware to hold for the longterm. The price point on these vehicles is $60k+ it’s not an iPhone. I’m just saying that EV’s are tied to Tesla hype, which isn’t coming for at least few more years.\n\nAI isn’t some entity which develops its successor. There have been several *AI winters* where expectations and understanding far supersede short term outsider benchmarks.\n\nI argue AI is in a great state of growth opportunities in select areas are leveled and balanced. Biggest areas for growth in present state are in NLP and biotech.\n\nPlease unless you’re a software engineer or actively research in AI stop spreading misinformation about an exaggerated state of AI. It’s a growth sector so unless you can empirically validate the state of growth don’t speculate.", "score": 5, "replies": [{"body": ">unless you’re a software engineer or actively research in AI stop spreading misinformation about an exaggerated state of AI.\n\nWell considering I have my MS in AI from an R1 uni, have been working on my PhD in AI for two years now (also R1 uni), actively publish my research in peer reviewed conferences, and work full time as a Data Scientist I think I'm qualified to speak on the subject.\n\n&#x200B;\n\n>You clearly know less.\n\nyeah... I'm pretty sure I don't.\n\n&#x200B;\n\nTo be clear, I don't think FSD is close and I would never think Tesla would be the first company to get there (my bet is google). However your justification is completely wrong. This is why I said you should stop talking about AI. If you knew anything about AI you'd know being compute throttled is not the problem.", "score": 0, "replies": [{"body": "I apologize for being condescending. You do know more than me. I’m finishing my MS (also at an R1 not an elite one), I began in ML but moved into HPC.\n\nAlso agree completely Google being the most viable. \n\nI’ll heed your advice. I am aware that’s not the only factor. I should have phrased differently. My concern is the hardware requirements. \n\nAs a serious follow up question, do you not see onboard systems being a limiting factor for an FSD? \n\nI’ll happily take any criticism or resources.", "score": 1, "replies": [{"body": ">As a serious follow up question, do you not see onboard systems being a limiting factor for an FSD?\n\nPotentially, but given the state of self-driving this doesn't seem to be the issue holding everyone back.\n\nI'd expect that if compute within the vehicle was a significant problem, we'd have at least seen a *prototype* EV with a very short range and a massive computer on board. Sure, it wouldn't be possible to bring that to market, but we could at least point to a single car and say 'yes, FSD is completely possible'. Instead we have several systems that each have their own limitations.\n\nThis is indicative of the complexity involved in creating several algorithms that all contribute to the decision making process. Seamlessly blending micro and macro level decision making processes that encompass every scenario is proving to be very difficult. As an example, we have good micro level decision making with lane assist, adaptive cruise control, etc. We also have good macro level decision making with google maps, waze, etc. But, the step where we need them both to work together has been a struggle for everyone since self-driving in city streets has been difficult. This is further exasperated by edge cases.\n\nLets say we have a car that does effectively blend *most* micro and macro decision making processes together (probably the current state of google's car). We still haven't defined how should the car should behave when one or more of its systems either can't be relied on or is unwittingly providing bad information. The macro system is saying turn left but they just repainted the road and got rid of that turn. Now what? Do we still follow the macro system's guidance? If not, we need some other system that sits between the micro (very short term decisions) and macro level (very long term decisions) systems to take over and provide mid term guidance on how to best proceed when one or more underlying systems can't be relied on.\n\nUp to this point we have discussed three systems (short, mid, long term decision making), but there are multiple ML systems under each of those decision making processes. We need multiple computer vision classifiers for identifying traffic signs, traffic lights, lines on the road, arrows on the road. We need an inference process to determine if that particular signal applies to our lane or the next lane over. We need an inference process to categorize that sign, signal, arrow into something meaningful for our system (is there a sign? Yes. what type of sign is it? yield sign. Does it apply to our car? No. If we move one lane to the right does it apply to us? Yes.). We need a system that determines how centered we are in our lane and correct when it is above a certain threshold (keep in mind we need a mechanism to ignore this stimuli when we are knowingly changing lanes). For LIDAR systems, we have this same situation. We need to identify where the objects are in the world around us. We need to categorize what the object is so we know what to expect as we approach it. We need a system that identifies when a sensor is malfunctioning so that we don't give bad inputs to our end-to-end decision making process (mud or snow on a LIDAR sensor could make our car think it needs to slam on the brakes immediately). These are just a *few* of the tasks that ML algos need to do as they pull data directly from sensors. Ultimately their signals feed into the micro level decision making process that combines all of the stimuli and makes short term decisions on how to drive. The complexity from an AI/ML perspective is colossal.\n\nTo come full circle, if a company had solved all of the complexity mentioned above, in addition to all edge cases, we'd have seen a prototype of it. Google is absolutely no stranger to literally throwing tens of millions of dollars at compute just for **academic** research. It goes without saying that they'd find a way to get enough compute into a car if compute was the concern.\n\n&#x200B;\n\n>I apologize for being condescending. You do know more than me. I’m  finishing my MS (also at an R1 not an elite one), I began in ML but  moved into HPC.\n\nNo worries. I think it made for a good conversation nonetheless. Good luck with the studies, i assure you it pays off :)\n\nAlso, I want to add that your \"unless you’re a software engineer or actively research in AI\" comment gave me a good laugh (in a good way). Its one of those things that would have been true if you were talking to literally 99.99% of the population, but by sheer horrible luck you just happened to be talking to someone in that 0.01%.", "score": 3, "replies": [{"body": "> This is indicative of the complexity involved in creating several algorithms that all contribute to the decision making process. Seamlessly blending micro and macro level decision making processes that encompass every scenario is proving to be very difficult.\n\nInteresting takeaway. There have been noticeably less proofs of concept. Which that would explain why there hasn’t been more expanded efforts to push testing to a larger bubble. \n\n> We still haven't defined how should the car should behave when one or more of its systems either can't be relied on or is unwittingly providing bad information.\n\nWorking in robotics this exact issue reoccurring. My bias on computational limits is sometimes these problems can overcome by introducing an additional classifier. Most of the time you’re 100% correct. It’s a complexity issue. Especially when the regulating algorithm fails.\n\nI appreciate your time. It was naive to only claim it’s a computation problem when it might simply not be presently even possible to interweave a whole network of classifiers a to make the process viable in a variable environment in the first place. But assuming you’re speaking to an audience that’s overselling Tesla’s fanboy rhetoric it’s easy to point out in present state an FSD would require a Titan X (if not a few in addition to a massive CPU and several other cost prohibitive sensor). Still will heed your advice and stay within my lane of research.\n\n> Its one of those things that would have been true if you were talking to literally 99.99% of the population, but by sheer horrible luck you just happened to be talking to someone in that 0.01%.\n\nHappy it did. Forced me to read a few more working papers. We all need to get humbled once in awhile.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "We will get to full autonomy one day.  Question is when.   AI is getting better and better.   Just need to train the computer to think like how a human would.  There’s too many situations and unknown to solve this problem procedurally.  It all have to be AI and adaptive learning.  There will still be accidents but I’m thinking less than with humans behind the wheel.", "score": 1, "replies": [{"body": "Agreed it will happen. It’s just a matter of the computational cost and how quickly we can get the hardware that can support it in mass production at cost efficient prices for manufacturers.", "score": 1, "replies": []}]}]}, {"body": "EV bubble runs on renewable energy, hence, no pop.", "score": 1, "replies": [{"body": "I think all ESG sectors r in danger at the moment. Blackrock made it worse. But if u look back and see how many EV companies went ipo via spac deal last year, i think it’s on bubble stat, and may be it’s about to get bigger or recent correction released some pressure, who knows. But i wont hold big position of EV sector", "score": 3, "replies": []}]}]}, {"body": "Is VW entering the residential solar market?", "score": 3, "replies": [{"body": "Not to my knowledge.  Nio, Li Auto, and Xpeng aren't, either.", "score": 1, "replies": [{"body": "That should answer the question of whether or not VW will be the next Tesla then", "score": 2, "replies": []}]}]}, {"body": "Porsche Automobil Holding SE is the better play. \n\nThat way you get the agricultural, long haul trucking, and bonuses like Lamborghini along with Volkswagen.", "score": 5, "replies": [{"body": "Lamborghini sits within the VW Group auspicies, not Porsche SE.", "score": 3, "replies": []}, {"body": "I'm in both POAHY and VWAGY.", "score": 2, "replies": []}]}, {"body": "No", "score": 5, "replies": []}, {"body": "Fundamental truth for VW: every electric car they sell replaces an ICE car sale and is less profitable, at least for now. This isn’t a recipe for growth. The stock surge is all hype and no meat", "score": 1, "replies": [{"body": "And then you realize that this is priced in since VW has a P/E of 13.", "score": 6, "replies": [{"body": "With a shrinking E", "score": 2, "replies": []}, {"body": "Huh?\n\nSorry, but EV plays are *not* valued based on P/E.  They shouldn't be.\n\nIt's VW's turn.", "score": 1, "replies": [{"body": "P/E is relevant when looking at VW, they are not primarily EV.\n\nAlso VW P/E is an argument in favor of them.", "score": 3, "replies": [{"body": "You said that VW is priced in, though.  That was what I was arguing against.", "score": 1, "replies": []}]}]}]}, {"body": "So?  The EV *pump* (not just \"hype\") works for Nio, Li Auto, and Xpeng, not just Tesla.\n\nIt's all about money-bleeding companies being in a position to raise capital with minimal dilution, if the *story* is good.\n\nThe story so far is:\n\n - Second mover advantage\n - Realistic shot at beating Tesla in two years\n - Willing to invest in EV infrastructure, unlike other legacy automakers", "score": 0, "replies": []}, {"body": "You're making a huge assumption that they're not stealing sales from other traditional auto makers. \n\nEvery Tesla sold is one less ICE sold too, spread among multiple companies. If VW eats into GM/Toyota sales with each sale they can grow, just like any other company selling EVs, they could lose 1 sale themselves while causing competitors to lose 2 for every 3 EV sales.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Plug Power doesn't have a charismatic CEO, yet PLUG outperformed TSLA in 2020.", "score": 0, "replies": []}]}]}
{"title": "Will Tesla need to change camera placement to achieve Level 5?", "selftext": "[deleted]", "id": "mdvpbu", "created_utc": 1616785072.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 55, "comments": [{"body": "This video was made by guessing the arcs of view based on the marketing image. It doesn’t have a basis in reality", "score": 10, "replies": [{"body": "Shouldn't the marketing image have some basis in reality? \n\nThis phenomenon is real regardless. Check out this FSD beta video: [https://www.youtube.com/watch?v=qj9t5GTeKNE](https://www.youtube.com/watch?v=qj9t5GTeKNE)\n\nThe real question is whether it's a deal breaker for lvl 5, or if it can be overcome somehow (AI vision imporvements, special positioning during corners, etc).", "score": -2, "replies": [{"body": "You are so desperate for this to be true", "score": 7, "replies": [{"body": "I am desperate for evidence that is not. Nobody here is giving any. Only snide remarks and insults.", "score": 0, "replies": [{"body": "Because you are asserting something is true with only an animation", "score": 3, "replies": [{"body": "I linked you a video of a real car with the real FSD beta with real cameras mounted in the exact spots.", "score": 1, "replies": [{"body": "And what? You contest it’s impossible?", "score": 1, "replies": [{"body": "I'm not sure what you mean by that. I'm just saying I posted real evidence, not \"only an animation.\"", "score": 1, "replies": [{"body": "What does beta mean to you?", "score": 5, "replies": [{"body": "[removed]", "score": -5, "replies": [{"body": "You are complaining that FSD beta isn’t FSD.....", "score": 4, "replies": [{"body": "No dude. I am positing that putting the camera in the B-Pillar makes situations harder for the car to see oncoming cars than putting it further forward. You're fundamentally misunderstanding my point. A point valid enough that a prominent FSD Beta tester actually rigged up some cameras on his car to experiment with. \nIt's not about FSD beta not being full FSD. It's about whether they might retrofit more cameras or radar. If you don't think so that's fine, but maybe explain why.", "score": 3, "replies": [{"body": ">\tIt’s about whether they might retrofit more cameras or radar. If you don’t think so that’s fine, but maybe explain why.\n\nMaybe they will maybe they won’t. Time will tell.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I think this is a video from totally uniformed people who are just grasping at straws for clicks and reasons FSD won’t work.\n\nI think at this point with new models released they would have changed it if needed.\n\nYou don’t need to see perfect every inch.  Humans don’t.  Things move and the cameras can see all the places at once.\n\nThis is just totally fabricated problem.", "score": 12, "replies": [{"body": "How is it a fabricated problem? Geometry doesn't lie. There are certain angles and corners that make it impossible for the current setup to see incoming traffic without sticking the nose of the car into the lane. It doesn't matter if \"the cameras can see all the places at once\" if they are blind to the one narrow area that matters most in that moment.\n\nHave you ever considered that people can be bullish on FSD and still search for problems and flaws in the current approach? That's how these things actually get solved.\n\nI have yet to hear any substantive argument as to why B-pillar cameras WILL be enough for level 5, rather than headlight cameras. Maybe they actually will! I desperately want somebody to convince me that's the case. But I don't take it as gospel just because that's what they're doing now.", "score": -3, "replies": [{"body": "You are assuming you need every inch to be covered to work.  Humans drive and don’t have that.\n\nYou are making unfounded assumptions and you have no insight into what is actually needed or what they need.", "score": 5, "replies": [{"body": "I am not assuming every inch need be covered. Only the inches where cars and trucks are coming towards the car. You are right that humans don't look everywhere all at once, but they do look very closely at the most important area at a time. If the car is in a situation where it can see everything EXCEPT that one area, where danger is coming from, then it is not an advantage to see everywhere. The current placement ensures great view most of the time except in these specific ugly corners, which the car must ALSO be able to handle if it is going to drive completely alone.\n\nAs for \"making unfounded assumptions and you have no insight into what is actually needed or what they need\". I drive a car, that gives me insight. I understand how line of sight works, that gives me insight. I am assuming that Tesla's \"vision only\" approach requires that the car... have vision. If it can't see around 1% of odd or badly contructed corners in the real world, it can't be fully 100% and still be safe.\n\nI really would love if you could give me your thoughts as to how this can actually be overcome. Like I said, maybe there is a way to solve this without more cameras. I don't know! I'm no expert. However you seem more interested in juvenile attacks than discussion.", "score": 5, "replies": [{"body": "Because humans can’t see every inch/area either.  But you can see between the inches/areas.\n\nBecause things move and as they move you see more.  Also you don’t have to drive the same way as a human.  If you have to make 3 rights to make a left or avoid certain streets...who cares if you can work or play the whole time doing it.\n\nAlso if you think the people at Tesla are so dumb they haven’t realized they have an issue after releasing the Y and new s/x this far down the line and some randoms on YouTube/reddit all of a sudden are smarter and know more, then you live in alternative reality.\n\nYou do realize Tesla wants this to work and it is worth trillions and the move to sustainable transport if they get this to work.   So they aren’t just going to stick with something as simple to fix as not enough sensors just because.", "score": 5, "replies": [{"body": "Thanks for actually laying your reasoning. I'll respond in two parts.\n\nFirst, I think we still are not on the same page with the visibility problem. I'm trying to say that there are scenarios (there's one right by my house), where the camera will be completely, fully blocked from seeing anything in the oncoming lane. In that scenario, it cannot \"see more\" as \"things move\". It can't see anything. At all. It doesn't matter how amazing the AI is if it cannot see at all because there is a wall blocking it.\n\nSecond, I do actually think it is possible for Tesla to have made an oversight on the hardware, despite having many very intelligent people. Intelligent people make mistakes too. The model 3 began development somewhere around 2015 or 2016. At the time Tesla had a very different approach to self driving. Since then, Andrej has come onboard. They have completely scrapped and rewritten how the system works at a foundational level. It is much easier to do that than to retool production, change parts, etc. Tesla is constantly iterating, and sometimes they hit a wall or a dead end and need to try something new.\n\nSo I do think they could be in a situation where hardware choices made years in the past may have them backed into a wall for certain scenarios. I'm not saying they are for sure, but to me it seems like it could be the case.\n\nNow, if they are, and the camera placement means there is a statistically significant amount of cases where the car will put people in danger, I don't think that's game over for FSD. Notice I haven't called into question the vision approach itself, the way that LiDar fans do. I just think the placement of the vision could cause problems. Thankfully, Tesla is flush with capital, and cameras are cheap. They have shown willingness to retrofit hardware for the sake of FSD before, meaning they could end up installing headlight cameras after the fact, or even just radar for cross traffic sensing.\n\nOf course it is also possible that this turns out to be a total non issue. Either way, discussion should not be so vitriolic.", "score": 1, "replies": [{"body": "I think we are on way separate places on this.   Tesla isn’t backed into a corner. They don’t function like that.  Not to mention the new approach was only in 2017 so it’s like they have so much legacy.  They change things all the time.  I don’t think you are thinking in realistic terms. \n\nHumans can’t see in all situations...but that’s why you move the vehicle so you can.", "score": 4, "replies": []}]}, {"body": "You just said that you agree that the current camera setup might be incapable of taking some turns, resulting in the car needing to take a different series of turns to make up for it.", "score": 0, "replies": [{"body": "What’s your point?   That doesn’t mean they need to change the camera setup.   Why does everyone have to think everything has to fit into a current box.  It’s new tech.  It can be handled totally different.   Cars couldn’t do what horses did...but that didn’t mean you had to change the car.  You just change expectations.", "score": 1, "replies": [{"body": "Level 5 =  \"They will be free from geofencing, able to go anywhere and do anything that an experienced human driver can do. \"\n\n\"do anything that an experienced human driver can do. \"\n\nYou said \"Also you don’t have to drive the same way as a human. If you have to make 3 rights to make a left or avoid certain streets...who cares if you can work or play the whole time doing it. \" which indicates you didn't know what something needs to be to be called 'level 5'.\n\nIt doesn't sound like you have the prerequisite knowledge about what level 5 is to be having this discussion. You should read first.", "score": -1, "replies": [{"body": "Are you trying to tell me that if the car doesn’t take you the exact same route to what a human driver would take then it’s not lvl 5?\n\nI think you are missing what that actually means.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "What geometry are you referring to though?", "score": 2, "replies": []}]}]}, {"body": "Not sure why there's so much snarkiness in this thread, it does certainly make sense to place the side cameras as close to the corners of the vehicle as possible.\n\nObviously the Tesla HW + vision teams have already done their homework on this, so it would be interesting to learn why they think the current camera placement is optimal for autonomous driving.", "score": 6, "replies": []}, {"body": "no", "score": 9, "replies": [{"body": "but why no", "score": -4, "replies": [{"body": "not sure if autonomy day or an earnings call, but was asked a pointed question about lidar/cameras, specifically answered that they had revaluated the sensor suite and each time determined that the current suite is enough for FSD.", "score": 4, "replies": [{"body": "I totally believe that the current suite is capable of getting very, very good. But, this issue with angles would still remain. Do you think there is a way to get around it without adding cameras further forward? Other than simply faith in what the company says. I understand that's often all we have to go off of, but it's concerning how often critical thinking is derided as lack of faith.", "score": -1, "replies": [{"body": "Tesla has some of the best if not best engineers dealing with computer vision and ai. Considering where they are and what they’ve already accomplished I think most of us have faith that they know what they’re doing.", "score": 5, "replies": []}, {"body": "Do you honestly think that Tesla would plan for FSD and design a car that can’t see oncoming traffic at an intersection? There are videos of FSD beta cars making plenty of left turns at intersections, what part of this video makes you think the car can’t see left?", "score": 3, "replies": []}]}]}, {"body": "Is this your channel? Didn't you post another one saying \"what do you think of this channel?\" A couple days ago?", "score": 2, "replies": [{"body": "No, it isn't my channel. You can check my post history.", "score": -1, "replies": [{"body": "Yoy sure are taking the comments pretty personally.", "score": 2, "replies": [{"body": "Conan, what is best in life!?\n\nARGUING ON THE INTERNET!!!", "score": 1, "replies": [{"body": "Can't argue with Conan. He's a treasure.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "It's a nice video, but I think your error is in the margin given between the cross traffic and the car's nose:\n\n>To get a full view of the traffic, Tesla would have to creep into the lane.\n\nIt just doesn't pass the sniff test in your video. You have more than a third of the car in the lane, being clipped by an entire half of the cross traffic vehicle.\n\nI just went out to play devil's advocate testing with my car and my driveway/street (occluded by the neighbor's bushes), and the nose of my car sticks out AT MOST 2 feet into the road when I give a generous line of sight (assuming I was on a road where cars were going 45mph). If I had a dollar for every time I (as the cross traffic) didn't hit someone sticking their nose out I'd have two teslas instead of one!\n\nIn his interview with Lex Friedman, Jim Keller talks about FSD being at its core a ballistics problem. In your example, it would take 2.3 seconds for a car to travel 46m going 72kph. The Tesla knows this, and it also knows how fast it can accelerate and the distance it needs to cover to get across traffic and make the left (less than 2.3 seconds).\n\nSo given the car can see incoming traffic, it knows how much time it has, it knows where it's going, and it knows how much time it needs, it can precisely calculate whether or not it's going to make it across without a collision. Or it can at least play a game of probabilities with fuzzy ballistics math and output a chance of success (32.333 repeating, of course, is all you need).\n\nCurrent sensor suite is just fine for FSD. Maybe they upgrade to HD cameras or something later on for extra safety 🤷‍♂️", "score": 3, "replies": []}, {"body": "This is stupid, every corner case now requires more cameras?? Do these people understand that more cameras require more processing power? And so they understand it's not the same as putting your eyes in that position?  Couch engineers!", "score": 4, "replies": [{"body": "Yes, more cameras would need more compute, which means it is something Tesla probably wants to avoid.\n\nI don't understand what you mean when you say \"every corner case now requires more cameras\". That's not what is implied here at all. It's that certain scenarios make the B-Pillar camera obscured until the nose of the car is in the lane. If the camera were simply on the nose, it may be able to see better.\n\nEDIT: And isn't solving for corner cases exactly what will make FSD safer than humans in the long run?", "score": 1, "replies": [{"body": "It's not so simple. People think it's the same as having a pair of eyes in that position. It's not.\nPlease see all videos. The problems are not on obscured b pillar cameras.", "score": 3, "replies": [{"body": "How is putting a camera somewhere not like having eyes there? And what do you mean by \"see all videos\"?", "score": 1, "replies": [{"body": "Because it's not how 3d video works", "score": 3, "replies": [{"body": "Go on, I'm interested.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It’s ok and helpful to question something, especially when it’s something you believe in. I think this is a good question, and I hope OP finds an informed answer because I would like to know too.", "score": 2, "replies": []}, {"body": "I still vote for one more pair of L/R cams on the front bumper. Minimize creeping into cross traffic. New line of sight if pillar cams obscured. Further improve vision beyond human driver capability.\n\nAnd I wonder if an improved (or second?) rear-facing cam could improve accident avoidance. Decide when to maximize stopping distance for the vehicle behind you, when to dip off the road/out of your lane to avoid an idiot driving through your rear bumper, etc.", "score": 2, "replies": [{"body": "I agree on the bumper side cams.\n\nThere is a left turn I take out of my chaotic neighborhood streets that would be very hard for the current hardware to navigate safely due to line of sight obstruction. I have to lean very far ahead of the wheel and still I'm taking a chance on that one.\n\nBumper cams would have even better line of sight than me leaning forward, and would facilitate the car being more capable of the \"superhuman\" level driving that real level 5 promises.", "score": 1, "replies": [{"body": "Wouldn't the side marker camera have the same view as you leaning forward?", "score": 2, "replies": [{"body": "Those are behind the driver's head. And incapable of leaning forward, of course. They are great for the height advantage and superior in most cases, but completely defeated by a tree, bush, or sign. That forces the car to creep further and further. Cams on the bumper eliminate that issue.\n\nEdit: chazman has good FSD videos on those cams and creeping.", "score": 2, "replies": [{"body": "Side marker ones were more reward facing than I thought. I assumed they had greater than 90 degree FoV.", "score": 1, "replies": []}]}, {"body": "If it were mounted near the headlights, it would be further forward than one could lean inside the cabin.", "score": 1, "replies": []}]}]}]}, {"body": "There aren’t enough cameras in the world to make car self-driving as safe as human driving.", "score": 0, "replies": []}, {"body": "Trying to avoid all the snarky comments.\n\nI’m pretty sure someone who earns more than you and me combined along with a wealth of knowledge has verified optimal camera positions for a large variety of reasons.\n\nSoftware just needs to catch up now.", "score": 1, "replies": []}, {"body": "I guess some yahoo on YouTube discovered a flaw in the sensor suite that the collective intelligence of the Tesla FSD engineering team was unable to see or predict.  Ya, I’ll buy that /s\n\nNot giving this a click.", "score": 1, "replies": []}, {"body": "Humans are able to drive by using 2 eyes with many blind spots. Yes, humans are definitely inferior to an AI driving, especially in conjunction with a network of AI driven cars. That being said, there aren’t a huge amount of crashes/fatalities per 100k daily.\n\nIf an AI were able to replicate what humans do, that would be remarkable, but Elon plans to perform so much better than we ever could. Theoretically, 1 camera pointing forwards would be enough. Any more than that will make the difference between human levels of driving and an AIs capabilities. Blindspots are not a major issue at all.", "score": 1, "replies": []}]}
