{"title": "PFIZER will win the COVID race", "selftext": "10/16 40C\n\nPfizer was just fast tracked from the FDA on approval for a Covid vaccine. Furthermore, the CEO, Albert Bourla, has given his company a deadline of producing a vaccine by October and has given his staff a full green light and line of credit to achieve that goal. To put it simply, they will produce a drug that will be on par with Advil.", "id": "hqehg7", "created_utc": 1594643782.0, "score": 142, "upvote_ratio": 0.87, "num_comments": 91, "comments": [{"body": "So what about my 7/17 39cs I yolod into 4 weeks ago?", "score": 126, "replies": [{"body": "Also a victim of these calls", "score": 57, "replies": [{"body": "they were just *so cheap*", "score": 34, "replies": [{"body": "Seems like they were cheap since if you averaged down a bit then you would be in the positive. If you didn't you are nearly at BEP.\n\nStop loss and if it goes up more on this hype, you reap, if it doesnt, you have minimal loss.", "score": 11, "replies": []}]}, {"body": "Same", "score": 2, "replies": []}]}, {"body": "I've also been in for a while on 7/17 38c\n\nThe 50 and 200 moving day averages are about current price so it needs to break through those first this week.", "score": 11, "replies": []}, {"body": "Fellow 7/17 38c victim checking in. I am 100% out. This stock barely moves on good news.", "score": 5, "replies": []}, {"body": "Might be a little premature but the COVID hype and FDA fast track will help. Biotech moves with results and they’ve had promising results", "score": 9, "replies": []}, {"body": "Same here. Giving me a bit of hope today just like last time when they announced the results. I will diamond hand it and slowly see it move back to it's level of 33.", "score": 2, "replies": []}, {"body": "I did this with you", "score": 1, "replies": []}]}, {"body": "This supports the bags I’m holding so I agree.", "score": 58, "replies": [{"body": "My in-law works at another biotech company and said Pfizer is the only competitor he would buy right now 👍", "score": 20, "replies": [{"body": "My in-law works for Santa Claus and said that you should buy that Axe deodorant for Christmas.", "score": 11, "replies": []}, {"body": "thanks OP i actually read this in bed before i checked news GLTA", "score": 3, "replies": []}]}]}, {"body": "Why is everyone trying to correlate \"a vaccine\" with \"a cure\"?", "score": 26, "replies": [{"body": "Because a vaccine will cure the economy. A cure won't completely.", "score": 28, "replies": []}, {"body": "Because that’s how the American public will treat it", "score": 7, "replies": []}, {"body": "It’s not a cure so much as it will be a drug that will treat the symptoms. IE taking Advil for a headache . You aren’t fixing the underlying reason you got the headache but treating the symptom. The hope\nIs that Pfizer will release a drug that will treat the symptoms of Covid.", "score": -55, "replies": [{"body": "It's not something you \"take to treat the symptoms\". That's not how vaccines work, not even close", "score": 71, "replies": [{"body": "I know this doesn't sound accurate, but I recently read an article that the \"vaccine\" they're fast tracking right now is going to do just that.  I didn't understand why they called it a vaccine either.  I can't find the article, but it had something to do with lower cases, so they were forced to kind of pivot to a vaccine that would simply control symptoms, not stop infection.", "score": 3, "replies": [{"body": "The only thing that spreads faster than COVID is fakenews", "score": 11, "replies": [{"body": "https://www.telegraph.co.uk/news/2020/07/01/fall-coronavirus-cases-lockdown-has-delayed-vaccine-oxford-professor/\n\nTLDR: Basically says the vaccine will only take the edge off symtoms.  \nMy apologies if telegraph is fake news.", "score": 3, "replies": []}]}]}]}, {"body": "This is exactly the kind of uninformed DD I've come to expect from this place, Bravo!", "score": 19, "replies": []}, {"body": "So it's not a vaccine", "score": 6, "replies": []}, {"body": "upvoting so everyone can see how retarded this DD is.", "score": 4, "replies": []}, {"body": "YIKES", "score": 3, "replies": []}, {"body": "Wow you are like 1000% a moron", "score": 2, "replies": []}, {"body": "Vaccines don't treat the symptoms. They facilitate your body to build up antibodies so when you do get the virus your immune system beats it before it actually impacts your body. It just takes a while to create the vaccine to do this properly.", "score": 6, "replies": []}]}]}, {"body": "Yeah, Robinhood will take this stock to the moon and beyond.", "score": 17, "replies": []}, {"body": "Keep in mind, PFE is a mammoth so it's harder to move.  It's not going to have the meme-tier price movement that some vaccine/treatment companies get just because a bunch of RH users bought.", "score": 30, "replies": [{"body": "elon secretly owns RH so he can sway the world", "score": 4, "replies": []}, {"body": "LUL", "score": -2, "replies": []}]}, {"body": "Lol I’m bag holding sept calls... this stock moves sideways for long periods of time... I found that out after I picked them up.\n\nEdit: I jumped on a similar thread 3 weeks ago and then it dropped 50-70% and SLOWLY climbed up. When I went back and looked at that thread I read the people who bet on it early regretted it.", "score": 15, "replies": [{"body": "Been holding the same bags for the last 6 weeks \n\n😃🔫\n\nEdit: WOOOH, I’ve crawled my way all the way back to -18%!", "score": 8, "replies": [{"body": "I was down 50% at one point... today sold at +20% it was only about $500 worth but I still don’t like loosing", "score": 3, "replies": [{"body": "Good for you. That's your money.", "score": 1, "replies": []}]}]}]}, {"body": "I've played PFE 3 times and lost money each time, and for that reason I'm out", "score": 18, "replies": [{"body": "Barbara, your thoughts?", "score": 16, "replies": []}]}, {"body": "Will they follow up with a HIV vaccine? Maybe some of the other viruses that need to a treatment too. So glad to hear they got the green light. I really thought they were stuck at the yellow light. Thanks for the DD", "score": 10, "replies": []}, {"body": "Last time PFIZER shot up on covid19 vaccine news, it decreased the following days..  \nMy advice, wait a bit and dont buy calls on MAX IV day but wait a few days.", "score": 4, "replies": []}, {"body": "Here we go again lol", "score": 9, "replies": []}, {"body": "This is the way.", "score": 5, "replies": []}, {"body": "AstraZeneca", "score": 4, "replies": []}, {"body": "Any chances of green for 38C 07/24 ? Bought it 3 weeks ago.", "score": 3, "replies": [{"body": "Boom baby", "score": 3, "replies": []}, {"body": "Winner winner", "score": 1, "replies": []}]}, {"body": "BNTX, Pfizer partner will deliver larger gains.", "score": 3, "replies": []}, {"body": "My leaps up 80% today LFG", "score": 3, "replies": []}, {"body": "PFE is the only legitimate Vaccine play IMO, I’m in", "score": 3, "replies": []}, {"body": "I bought september 37/38/39 calls last week. Dumped them near the top today for 200% gains. \n\nWe're going to see PFE go back down after this pump, then there will be another pump when their phase 2 results come out. \n\nIf you got gains today take them now", "score": 3, "replies": []}, {"body": "Covid would be gone in a week if we started using lysol like binaca.", "score": 6, "replies": [{"body": "in hindsight binaca is such a fucking weird product", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "They dont know about tamagachi's and fireball yoyos", "score": 2, "replies": []}]}]}, {"body": "Well done, a DD about a vaccine by someone who has no clue what a vaccine is.", "score": 5, "replies": []}, {"body": "Wrong,  ALT will win", "score": 2, "replies": []}, {"body": "haha my $44 jan 2020 calls is PWINTIN", "score": 2, "replies": []}, {"body": "I'll do you one better, 12/18 50C. Call me retarded but if they get a vaccine out it'll be huge.", "score": 2, "replies": []}, {"body": "I loaded up on August 37C's when the market took a dump today. Hoping the momentum keeps going.", "score": 2, "replies": []}, {"body": "All of you with 7/17 expirations... I feel you after today’s announcement.", "score": 2, "replies": []}, {"body": "Z", "score": 3, "replies": [{"body": "Hehe one of the most common pills in America !", "score": 0, "replies": [{"body": "Z", "score": 5, "replies": [{"body": "I do. It takes years of trials, testing, and more testing.....and more testing. The backing of a CEO for a full force effort along with FDA fast track is what I think will propel them forward.", "score": -1, "replies": []}]}]}]}, {"body": "Wrong. AZN will win the covid race.", "score": 4, "replies": [{"body": "AMZN\n\nFTFY", "score": -1, "replies": []}]}, {"body": "I'm a previous bagholder that somehow managed to get out with a profit last time during the pop. I aint going back to this", "score": 2, "replies": []}, {"body": "Fast track doesn't mean a whole lot.....they get an extra meeting or two and a bit more feedback from the FDA. The bar for FT designation is very low.  It's not the same as a breakthrough or a regenerative medicine designation.  Pharma press of course will hype it up, but just be clear about what it actually means.", "score": 2, "replies": []}, {"body": "Guy who I know that works there said their vaccine works very well. Will win the race 100%", "score": 2, "replies": []}, {"body": "Wow a month before the election... I'm sure that's just a coincidence 😑", "score": 1, "replies": []}, {"body": "Need a consensus, should I sell NIO shares so I can afford a lot of PFE shares?", "score": 1, "replies": []}, {"body": "NVAX BABY", "score": 1, "replies": []}, {"body": "Moderna will win first. \n\nModerna announced today that they will be included in Nasdaq 100 Index", "score": 1, "replies": []}, {"body": "The problem with these big name pharma companies is they grow in value by paying dividends. You make money in options when the stock moves.", "score": 1, "replies": []}, {"body": "Does anyone actually want to get a vaccine developed in less than a year? Previous record was 8 years!", "score": 1, "replies": []}, {"body": "Pfuck Pfizer", "score": 1, "replies": []}, {"body": "Bro we're going down together!", "score": 1, "replies": []}, {"body": "Astrazeneca with Oxford vaccine, or likely one of the Chinese vaccines (Sinopharm, Sinovac, CanSino). That's my bet.\nhttps://www.nytimes.com/interactive/2020/science/coronavirus-vaccine-tracker.html", "score": 1, "replies": []}, {"body": "Lysol already won", "score": 1, "replies": []}, {"body": "I sold my 36 7/17 calls a few weeks ago at a loss after the last good news. if it goes itm now I’m going to be pissed lol", "score": 1, "replies": []}, {"body": "Moderna got fast tracked 2 months ago. Moderna is the front-runner and they will be the first one to be granted Emergency Use and get the final approval.\n\nLook at my posting history. I have been saying buy buy buy Moderna and no one agreed. If you agreed, you would have made a lot of money and will make a lot more money going forward.\n\nWhoever gets the first approval matters a lot in this Covid-19 vaccine race and I agree that BNTX/PFE has a good technology but they will not be the first and they are more focused on oncology (cancer) and Moderna has been focused on infectious disease (virus) for years.\n\nAgree with me this time and you will make a lot of money. Its not too late!", "score": 1, "replies": []}, {"body": "The leaps were pretty cheap for $40 strike. Gone up a bit today. \n\nPfizer and AZN have both been stable, no pumps or dumps and they each have viable vaccine candidates.", "score": 1, "replies": []}, {"body": "Yeah I paid .42 for 10 contracts and they’re worth .04", "score": 1, "replies": []}, {"body": "10/16 46c squad reporting for duty, sir!", "score": 1, "replies": []}, {"body": "You’re welcome everyone :)", "score": 1, "replies": []}, {"body": "Sell PFE poots got it.", "score": 1, "replies": []}, {"body": "PFE is just not the vaccine play you think it is. It's a bloated, giant pharma with obscene market cap that's been dying for years. Play NVAX or MRNA, they both have huge room for growth.", "score": 1, "replies": [{"body": "VBIV", "score": 1, "replies": []}]}, {"body": "How is this bullshit, retarded *DD* still up and mods take down so many better others? Who's sucking who's dick here?", "score": 0, "replies": []}, {"body": "I got myself my share of Pfizer. No lets get this thing to the moon!", "score": 0, "replies": []}, {"body": "Other brand are WAY ahead of Pfizer. Look at China and Russia - they are basically mass producing the vaccine already lol", "score": -1, "replies": []}]}
{"title": "NIO to the Moon", "selftext": "NIO is WSB's next autist brainchild which we'll take to the fucking moon just like we did with SPCE. WSB autists who lost out on TSLA? Don't worry, we can unite and launch this sucker to the moon for some juicy tendies. NIO millionaires coming up...", "id": "hqg1u9", "created_utc": 1594649895.0, "score": 150, "upvote_ratio": 0.93, "num_comments": 95, "comments": [{"body": "NIO is for everyone who was late to Tesla.\n\nWhich is me.", "score": 102, "replies": [{"body": "Damn right. It is also for tesla holders to take profit and move to nio.", "score": 4, "replies": []}]}, {"body": "Shorted this bad boy and now I wanna suck on a bullet", "score": 114, "replies": [{"body": "Definitely not too late to get a good share of tendies off it if you invest now", "score": 21, "replies": [{"body": "Lol. ‘Invest’", "score": 25, "replies": [{"body": "Wot? You guys don’t invest in OTM FDs?", "score": 11, "replies": [{"body": "FDs are by definition OTM", "score": 6, "replies": [{"body": "[deleted]", "score": 6, "replies": []}]}, {"body": "0dte*", "score": 1, "replies": []}]}]}]}, {"body": "Bro you getting sucked now?", "score": 4, "replies": []}, {"body": "Same, hoping Tesla pulls back a bit and takes a breather. Nio will hopefully follow, down like 3/4k on my short at 13.7.\n\nMade 18k from papa Elon calls so that’s enough to cover it. Would’ve been like 30+ if I waited 10 more minutes but can’t really complain. Sold first at open, second I panicked on the first major pull back and sold the second", "score": 3, "replies": []}]}, {"body": "Bought shares like a nerd when it was at 8.50", "score": 46, "replies": [{"body": "$6.00 shares checking in.... selling covered calls which I might get taken of it passes $17.00... oopsies....", "score": 25, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "a lot of people believe it could be a $100 stock within the next 2-5 years, others think it's a china fraud company and wouldn't touch it with a barge pole", "score": 20, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "They also received a $1.5 Billion Dollar Credit line (As of Yesterday) from China, and China don't fuck around with their money.", "score": 5, "replies": [{"body": "[deleted]", "score": 36, "replies": [{"body": "Literally the only thing everyone should know for sure about China.", "score": 3, "replies": []}]}, {"body": "China fucking around with their money is literally the reason why there is a non-zero chance of all Chinese stocks getting delisted from US exchanges lmao", "score": 6, "replies": []}]}, {"body": "Temasek CEO is a god tier shitposter so idk", "score": 1, "replies": []}]}, {"body": "2-5 years ... come on that's too long for WSB it needs to be 5x in 2-5 days", "score": 6, "replies": []}]}, {"body": "Seems to have Meme stock status.... but stocks only go up so I guess it’s a buy?", "score": 4, "replies": []}, {"body": "I bought 15 shares at $15 a pop after selling like a dumbass for $7ish a couple weeks ago. Should've held", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Just bought another 5 shares totally up to 20 shares at $15.23 avg price. Can't wait for this baby to hit $100 a share in a year 😤", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lol I hate that feeling. When the market opened my equity for NIO was up $20 at one point when it hit $16 a share. \n\nIf there's anything I didn't learn , its that we need to buy the dip if we are confident for the stocks future", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah idk about NIO let’s hit $20 this week 🤷‍♂️", "score": 2, "replies": []}, {"body": "I bought at about $3.10 a year ago. Just sold today at $15.15. I think its going to sink short term and then rocket back later this year. I might buy some puts short term. Food luck though!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Why buy shares if there is no dividend. Leap calls!", "score": 1, "replies": []}, {"body": "You belong here.", "score": 1, "replies": []}, {"body": "I kinda think to hold, nio has lots of competition and was broke like a year ago", "score": 1, "replies": []}]}, {"body": "$4/share checking in! 😄", "score": 1, "replies": []}]}, {"body": "My first buy was September 2018 at $10. Averaged down to \\~$4.50 thank Elon", "score": 1, "replies": []}]}, {"body": "NIO has infinite potential in the hands of autists 8/28 27c", "score": 40, "replies": [{"body": "You son of a bitch I’m in!", "score": 8, "replies": []}, {"body": "You think this is the play?", "score": 3, "replies": [{"body": "hell yeah and they're still cheap at the moment", "score": 7, "replies": [{"body": "agreed. Market cap is so small for what it is", "score": 5, "replies": []}, {"body": "Hmm ok. I was thinking further out but I'll take a look", "score": 2, "replies": []}]}, {"body": "This is the way", "score": 1, "replies": []}]}, {"body": "I'm in", "score": 2, "replies": []}, {"body": "This is the way", "score": 2, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "Where you see that?", "score": 2, "replies": [{"body": "He is so autistic he see’s C’s as 2’s and one space before the 7. He’s full on rain man, maybe we should get him to pick stocks", "score": 11, "replies": [{"body": "rain man lol", "score": 2, "replies": []}]}]}]}]}, {"body": "Mom, can we get TSLA? \n\n Mom: We have TSLA at home. \n\n TSLA at home: NIO", "score": 54, "replies": []}, {"body": "21 8/21 calls for crispy tendies", "score": 14, "replies": []}, {"body": "Get the CEO to start tweeting and im in", "score": 13, "replies": [{"body": "Better yet do the Chinese equivalent and tik tok.", "score": 2, "replies": []}]}, {"body": "That's right, buy my calls", "score": 9, "replies": []}, {"body": "Me too. 8/7 $15p. Riding this fucking thing into the ground", "score": 7, "replies": []}, {"body": "I have NIO 17 C for 2022 and I'm not fucking selling until it makes me a millionaire.", "score": 22, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Ballsy.", "score": 4, "replies": []}]}]}, {"body": "Your return is higher out of the money", "score": 1, "replies": []}]}, {"body": "If nio goes back to ~$10 i am buying so many fucking calls", "score": 7, "replies": [{"body": "Get ready", "score": 3, "replies": []}]}, {"body": "Puts on discount now. China numba 1 gunna poopoo on American moneybags", "score": 5, "replies": []}, {"body": "Interested in starting theta plays on NIO since 100 shares are still pretty cheap. If the hype gets big enough, I'm hoping to sell weekly calls at ridiculous stakes and rank in the premiums.", "score": 6, "replies": [{"body": "Cover calls dont work.\n\nNio has over 25% growth for the last 2 weeks... I am very sure because both weeks my cover calls went ITM and have to buy back or lose shares... AKA lost money.\n\nLast week NIO started at 11.50... think 14 is safe? Nope, it closed 15 friday afternoon. This week, NIO open 16, do you think 20 will be is safe?", "score": 8, "replies": []}, {"body": "This is what I’m doing. Selling 10-20% OTM calls.... if it gets to close I’m rebuying and selling longer out.", "score": 2, "replies": []}, {"body": "Wait until this thing gets real toppy, crashes a little, and then short calls. You'll catch all the suckers who expect a second doubling.", "score": 2, "replies": []}]}, {"body": "WSB not letting any Apple $400 strike posts go through or where are the Apple posts? I'm seeing crap about all this other garbage, but not apple?", "score": 5, "replies": [{"body": "If you want to see apple, start one.\n\nApple earnings is eom, it will get attention next week.", "score": 2, "replies": []}]}, {"body": "I bet big on them already, just waiting for it to moon!", "score": 4, "replies": []}, {"body": "7/17 20c here, hoping to close and roll to August today if we get some more movement", "score": 5, "replies": [{"body": "That’s what I got too", "score": 3, "replies": [{"body": "Yeah... feel like I’m going to be eating these instead, theta not on our side", "score": 2, "replies": [{"body": "Yep not looking good", "score": 1, "replies": []}]}]}]}, {"body": "NIO is pure unadulterated FOMO to the ones who missed the boat on TSLA.\n\nAll of the slowpokes who were left behind are desperately latching to a copycat.", "score": 5, "replies": []}, {"body": "7/31 $21c. To the moon!!!", "score": 4, "replies": []}, {"body": "heres hoping", "score": 4, "replies": []}, {"body": "new options savant here, bought these last week\n\nALL IN 17c 7/17\n\nFirst ones free, right?", "score": 6, "replies": [{"body": "new savant here also, I have 19C 7/17, let's get those tendies on friday I am doing this right", "score": 2, "replies": [{"body": "i think we lost this one. lol. china.", "score": 6, "replies": []}]}, {"body": "first time speculator long time autist\n\n17.5c 7/17", "score": 2, "replies": []}]}, {"body": "NIO and BYD, HKG: 1211 going to the moon. \n\nIf Tesla can be $0.5T, then these boys can at least be $100 billion each.", "score": 3, "replies": []}, {"body": "Some of y’all retards tell me if I should throw more money into calls $17c 7/24", "score": 3, "replies": [{"body": "Fuck it", "score": 1, "replies": []}]}, {"body": "Does Fiskar have meme potential?", "score": 3, "replies": []}, {"body": "Take it you lost a shitload of money on the massive fall in price today and want everyone to buy in now to recoup some losses?", "score": 3, "replies": []}, {"body": "wheel this bitch", "score": 2, "replies": []}, {"body": "You should really look into the pattern fraudulence of this management and their talent for incinerating cash. This is a ticking time bomb", "score": 2, "replies": [{"body": "They offer mega premium customer service if that is what you meant by incinerating cash. Tesla customer service not even close.", "score": 2, "replies": [{"body": "Go on valueinvestorsclub.com, make a login and read all the posts and comments about Nio ADR", "score": 2, "replies": []}]}]}, {"body": "This thread is full of ccp pump and dumpers", "score": 2, "replies": []}, {"body": "11/20 18c x2", "score": 1, "replies": []}, {"body": "nio is not going to break $20. shit will get bought out by softbank or swept off the face of the earth by the chinese gov before it gets too expensive to make a stink over.\n\nI hold a 1000 share position bought at 1.50 a share, and also sold covered calls for $10 and $25 so im not coming from a place where I think this will do well obviously. I also hold sold puts for a 2.5 buy in price that I keep rolling", "score": 1, "replies": []}, {"body": "In NIO for 1000 shares and 20 contracts of 1/21 $20c idfk I don't see the pump and dump feel like it's just haters cuz China but idfk maybe I'll make money in a couple months", "score": 1, "replies": []}, {"body": "Def. holding this for the long term. \n\nFor recent news on this stock for those who are interested, check out this subreddit:  \n[https://www.reddit.com/r/NIO\\_Stock/](https://www.reddit.com/r/NIO_Stock/)", "score": 1, "replies": []}, {"body": "Come join us @ r/NIO_STOCK\n\nCheers fam!\n🍻", "score": 1, "replies": []}, {"body": "We should all petition keanu reeves to be nio spokeperson n tweet stuff like elon n we moon landing ezpz", "score": 1, "replies": []}, {"body": "Nice top call haha", "score": 1, "replies": []}, {"body": "You mean Fisker (SPAQ)", "score": 1, "replies": []}, {"body": "Fuck NIO. I'm a SPAQ boy.", "score": 0, "replies": []}, {"body": "\"NIO millionaires coming up..\" -> Puts not calls", "score": -5, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "What habbened?", "score": 1, "replies": [{"body": "rhymes with fuckin", "score": 2, "replies": []}]}]}]}
{"title": "This is why TSLA went down today", "selftext": "[deleted]", "id": "hqkyqp", "created_utc": 1594665409.0, "score": 153, "upvote_ratio": 0.88, "num_comments": 91, "comments": [{"body": "[deleted]", "score": 104, "replies": [{"body": "This is literally your ticket into Elon heaven. You need at least one share.... So don't get rid of your last one.", "score": 39, "replies": [{"body": "It's better to reign in tendie hell than serve in elon heaven.", "score": 8, "replies": []}]}, {"body": "Same lol but I'm still up over $200 on it so ima hold it amd see what happens", "score": 17, "replies": []}, {"body": "I can't even decide if now is the good time for me to buy or wait..", "score": 6, "replies": []}]}, {"body": "Still don’t know what this means. Tesla stonk go up or “down”", "score": 52, "replies": [{"body": "[deleted]", "score": 35, "replies": [{"body": "WoW", "score": 3, "replies": [{"body": "You got it $100k on Wold of Warcraft... #bilzzard! #ATVI!! #FULLRE!!!!", "score": 2, "replies": []}]}]}]}, {"body": "What about other stocks ? The whole Nasdaq 100 went 200 points down", "score": 33, "replies": [{"body": "Actually I think it's bc of the FED budget balance, like the US posted its worst ever budget deficit. No shit the stock market was going to go down", "score": 15, "replies": []}, {"body": "Same thing.", "score": 1, "replies": []}]}, {"body": "The stock went down because basically all the market went down. Amazon was also down 3% ($96).", "score": 14, "replies": []}, {"body": "Okay but I'm big autist and don't really understand what you're saying, will it recover quickly?", "score": 38, "replies": [{"body": "Yes. Selling will be heavy today because of the deadline and institutions will be buying this week.", "score": 38, "replies": [{"body": "I see", "score": 8, "replies": []}, {"body": "Why would institutions be buying this week?", "score": 5, "replies": [{"body": "Earnings", "score": 3, "replies": [{"body": "Earnings are the 22nd", "score": 7, "replies": [{"body": "Yeah in 7 business days. Do you think people were gonna just buy the day before lol?", "score": 17, "replies": [{"body": "Yea, nobody buy till I'm in in 7 days", "score": 17, "replies": []}, {"body": "i get it, but why wouldnt they buy the day before, or all in tomorrow?", "score": 1, "replies": [{"body": "Most stocks trending positive tend to have a run up to earnings. A lot of smart option traders just hold for runs, not the actual earnings. That's how you get buttfucked. Plus the chances of getting IV crushed are higher the closer you are to the earnings date.", "score": 3, "replies": [{"body": "IV works in your favor for calls buddy", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "So buy calls 1 month out?", "score": 2, "replies": []}, {"body": "Who is selling?", "score": 1, "replies": []}, {"body": "But when does the dip end, my bet tomorrow or Friday ready for the 22nd", "score": 0, "replies": []}]}, {"body": "You’re in 1st grade and have a cool toy your teacher let’s you play with at recess and that toy gets you all the chicken tendies you want at lunch, \n\nthe big kids that are super autistic in 5th grade want your toy because they see you eating some of the chicken tenders at lunch that they have and they don’t want you eating their tenders, so they need to stop you from getting the tendies, and they do that by taking your toy, \n\nbut they can’t take it from you without getting in trouble, so they get the teacher to punch you in the face and rip out your toy by making you”sell” it, and give your toy to the 5th graders who then get more chicken tenders bc the lunch ladies love the giant green Tesla Toy you guys let them borrow at lunch time. \n\nKey\n\nToy=Tesla stock retard \n\n5th graders= institutions /hedge funds \n\nYou/your= wsb degenerate\n\nTeacher= brokerage", "score": 16, "replies": [{"body": "I can’t help but think of Zoolander \n\n“But why male models?”", "score": 7, "replies": []}]}]}, {"body": "So pretty much rich ppl telling normal ppl to fuck off cause they want our money? Got it", "score": 27, "replies": [{"body": "That's how I read it too", "score": 10, "replies": []}]}, {"body": "Sold my Tesla calls at peak open today for $10k gains and just bought another $30k 1500 7/24 call at the absolute dip last minute at 12:59 PST. If it doesn't open green tomorrow then I will be holding on to Friday.", "score": 14, "replies": [{"body": "Think you will be fine. etrade showing it in mid 1500s in AH", "score": 6, "replies": []}, {"body": "You are too smart", "score": 2, "replies": []}]}, {"body": "Were you even watching everything else? Do you really think retail would be enough to dip Tesla by 18% from today's top? Keep dreaming son, I have a TSLA 2500C to sell to you expiring Friday, it's only $15, super discounted!", "score": 6, "replies": [{"body": "No what happened? Lol. And I’ll take it!", "score": -1, "replies": []}]}, {"body": "Translation: don't fold your paper hands, TSLA will be back this week", "score": 19, "replies": []}, {"body": "40k robinhooders disagree", "score": 9, "replies": []}, {"body": "So buy calls after this dip?", "score": 11, "replies": [{"body": "Ya", "score": 2, "replies": [{"body": "Rip my calls, I want my 2k back", "score": 15, "replies": []}, {"body": "How long will the dip last?", "score": 1, "replies": [{"body": "This dip is related to margin requirements so not long. You were just forced to sell because the brokerages are increasing margin requirements, so if you were on the edge of a margin call, even though Tesla went up and you should be fine the brokerage now raised the margin requirement so now you aren't and  HAVE to sell.  Then your brokerage or their friends pick it up on the cheap. Don't you like balanced markets?", "score": 5, "replies": [{"body": "Ok. Why did the entire market dip then?", "score": 3, "replies": [{"body": "People selling other shit so they can try to keep their Tesla shares... Obviously", "score": 3, "replies": []}]}]}, {"body": "Schools not opening in the fall along with the meme bubble finally popping this morning means we're on on a train to hell for the next few weeks.", "score": 6, "replies": [{"body": "Your crazy of you think the meme bubble popped", "score": 10, "replies": []}]}]}, {"body": "It's not going up chief wtf did you do?!?!", "score": 0, "replies": [{"body": "It’s going up", "score": 2, "replies": []}]}]}]}, {"body": "Let me clue you in\n\ntechnical take profit level was 1800\n\nIt came way faster than anticipated\n\nprofits were taken\n\nopportunity buy in lower is now in play\n\nJust think - how did buyers get stopped out by increased margin levels on a day it went up 20 % ?  It doesn't even make sense.", "score": 8, "replies": []}, {"body": "Wondering if it had more to do with [this](https://www.cnbc.com/2020/07/13/california-to-close-indoor-restaurants-movie-theaters-and-bars-statewide-as-coronavirus-cases-rise.html) - California shutting back down again.", "score": 10, "replies": [{"body": "Texas will follow soon", "score": 3, "replies": [{"body": "Florida: nah brah", "score": 9, "replies": []}, {"body": "I mean they certainly *should*, but Mango will probably threaten the governor with a mean tweet if he tries to.", "score": 7, "replies": [{"body": "15k cases a day and the 'tards open Disney\n\n\nFucking hilarious", "score": 9, "replies": [{"body": "Hey dude I managed to sell at 119.5 - now we can close down again so that I can buy again at 105", "score": 2, "replies": []}]}]}]}]}, {"body": "It went down because it was up like 25 percent in two sessions you fucking morons. IRRATIONAL EXUBERANCE.", "score": 5, "replies": []}, {"body": "praying it does go up yikes", "score": 2, "replies": []}, {"body": "it means BTD auties. buy that motherfucking dip so hard. i'm going in for 7/24 2500c tmr", "score": 2, "replies": []}, {"body": "Tesla went down because it is a meme stonk.  It went up also because it is a meme stonk.", "score": 2, "replies": []}, {"body": "So should I buy the dip?", "score": 6, "replies": [{"body": "Yep. Stocks go higher up until the 22nd. Then we wait for the earnings report. Profits means you are a millionaire, losses means the entirety of WSB is homeless", "score": 3, "replies": [{"body": "Nope, Vega will crush your greedy ass badly even if profits", "score": 1, "replies": [{"body": "I don’t think stocks permanently go up. That’t just foolish. There are ebbs and flows, you just have to know when to move your ass", "score": 1, "replies": []}]}]}, {"body": "Yes", "score": 4, "replies": []}]}, {"body": "The first explanation I’ve seen as to why tesla stocks dropped mid afternoon. Thanks!", "score": 3, "replies": []}, {"body": "Just buy the Nasdaq as it drops, it will go right back up.\n\nSPXL and TQQQ, grab them the lower they go. You will regret not buying as much as you can.\n\nEspecially after they announce a vaccine and things will \"get back to normal\" \n\nSpy will go right back up to 322 is what I feel.\n\nI'm going to sell some Puts on SPY if It goes lower too.\n\nMeanwhile I'll be watching the 322 calls to see if there is an opportunity for the next 4 days.", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/RADIO02118 don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[There you go retard](https://www.benzinga.com/node/16588999)", "score": -1, "replies": []}]}, {"body": "what's the margin requirements on TSLA options?", "score": 1, "replies": []}, {"body": "So do we think it’s going to head back up this week?", "score": 1, "replies": []}, {"body": "S and P inclusion is not going to happen any time soon .. that requirement was due to volatility, you are a dumbass", "score": 1, "replies": []}, {"body": "No. Margin requirement rise when volatility spikes. Shares don’t need to be “freed up”, they just increase in price due to demand.", "score": -2, "replies": [{"body": "Not according to Barrons and every other financial publication reporting on this story. Tesla volatility has been a lot higher in the past, would probably help if you spent a minute googling this instead of chiming in like a tard.", "score": 13, "replies": [{"body": "You’re a sheep to these financial publications. Be a good little sheep and do as they say.", "score": -17, "replies": []}]}]}, {"body": "Is this a sure sign the S&P thing is happening though? I know it seems a bit of a formality at this point but I'm the kind of über bear who still thinks there's a tiny chance Tesla won't post a profit in Q2 or that for some other weird reason, the S&P thing doesn't happen. Obviously I was too late today cause I could have already made 100% on puts if I bought this morning and sold an hour ago. But I guess that sort of means there still are some more retards out there on the same train of thought.", "score": 1, "replies": [{"body": "If they announce a real vaccine spy will go to $400. 322 will happen in a blip.", "score": 1, "replies": []}]}, {"body": "Correlation is not causation", "score": 1, "replies": []}, {"body": "It went down today because... I don’t know.... maybe cause the stock just ran 4 weeks of squeeze and shorts are done covering lmao. Has nothing to do with sp500 inclusion. You have to understand that even profitability does not guarantee sp500 inclusion. It’s not some automatic benchmark, you made it join the club shit lol. It’s gotta go through months of processing for inclusion and there is a process it must go through. It will only qualify, not guarantee.", "score": -5, "replies": [{"body": "yogi bearing chiming in.", "score": 6, "replies": []}, {"body": "Well your wrong. It’s because today is the deadline to sell your shares or post more margin. This is happening at all brokerages.", "score": 3, "replies": []}, {"body": "right but by market cap tesla would be like number 17 in the s&p 500 so it's a shoe in.", "score": 1, "replies": []}]}, {"body": "I bought $25 worth last week and was so excited to be up $5 earlier but now I am only up $3!! Should I sell?!?! Please halp!!!", "score": -4, "replies": [{"body": "What is this? Trading for ants?!?", "score": 4, "replies": [{"body": "It took me 1 month to save that!! I traded in all of my pogs and magic the gathering cards!", "score": 2, "replies": []}]}]}, {"body": "TSLA is up today you mouth breather", "score": -14, "replies": [{"body": "Maybe you missed when it went down $200", "score": 13, "replies": [{"body": "$300", "score": 1, "replies": []}]}]}]}
{"title": "Netflix 7/17 Call Holders", "selftext": "[deleted]", "id": "hql34r", "created_utc": 1594665764.0, "score": 19, "upvote_ratio": 0.89, "num_comments": 74, "comments": [{"body": "\"Sold at the peak\" bruh we might not have seen the peak yet.", "score": 18, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "This is the forum I needed rn lol I was up 1k down to negative 07/24 $680c didn’t think we saw the peak yet but everyone ran for the hills after peak", "score": 4, "replies": [{"body": "Playing with weeklys will make you feel that way. I know its hard, but buying a week or 2 out makes you feel a lot more comfortable holding. Sometimes having confidence in your play is key so you dont weakhand and sell off when you could have made more.", "score": 5, "replies": [{"body": "The edit: with mum I’m scared is how every NFLX bull is feeling rn", "score": 3, "replies": []}]}]}, {"body": "the peak he is speaking of will most likely be after your calls expire, so u missed the point.", "score": 3, "replies": []}, {"body": "You still have those diamond hands?", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I'm with you.  FOMO'd and bought 20 NFLX $570c for Sep 18.  Down about -$12k.  My plays:\n\n\\- will average down if tomorrow or Wed are below $500\n\n\\- will hold through earnings.  \n\nThey're going to crush earnings, but who the fuck knows what that means in this market.  Didn't they do well in April and the stock dumped?  I'm uneasy.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Good luck.   I'm gonna walk away like Mcfly should have and come back Friday. Fuck it", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "There is no mercy in this game.  I am fuk.", "score": 0, "replies": []}]}]}]}, {"body": "Its Thursday today and the stocks only 529.52 👀", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They beat their last earnings and dropped by premarket", "score": 2, "replies": []}, {"body": "They dropped pretty hard seeing 11% last I checked dam", "score": 2, "replies": []}]}]}]}, {"body": "500P 17JUL20 checking in. Felt the same thing friday morning and this morning.", "score": 6, "replies": [{"body": "Nice your back itm\n\nEdit: fuck you 🐻🌈", "score": 5, "replies": [{"body": "currently holding these since last thursday \n\nAMZN 3750C 31JUL20\n\nTSLA 1000P 21AUG20\n\nNFLX 500P 17JUL\n\nwe'll see how it goes", "score": 1, "replies": [{"body": "I like your AMZN play \n\nBut your wife’s boyfriend is gonna pump you’re wife to the moon 🌝 \nLike fuck u and that NFLX put you may be in the green rn but earning hype X theta will kill that contract if you don’t sell soon", "score": 5, "replies": []}, {"body": "Bruh- you must have just creamed your pants w/ NFLX after hours drop", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Meant what I said, bought puts last week and watched NFLX open +12% friday and this morning then adjust down. booty puckered", "score": 4, "replies": [{"body": "Ah I see. Yeah you gotta be fast, volatility is insane right now", "score": 1, "replies": []}]}]}]}, {"body": "I’m gonna hold em til Wednesday.", "score": 3, "replies": []}, {"body": "Holding at least until Wednesday", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Its not nflx its the entire nasdaq going down because of vix going up", "score": 5, "replies": [{"body": "Yes, but I always believe that NFLX was the exception, that is, with shit news about the pandemic, like CA today, it booms.  I'm feeling uneasy and have about $40k in call contracts.", "score": 4, "replies": []}]}, {"body": "Let’s say it hits $490 tomorrow what’s the plan?😂", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": []}, {"body": "Buying $40k worth of calls.  Dare me to drive?", "score": 2, "replies": [{"body": "You got more capital? Why not more? Think of the massive gains think of the good dogo’s", "score": 1, "replies": [{"body": "I'm 43, a business owner, and lean on the risky side. Yes, I have more capital.  But this isn't a sure thing, as you know.  AH is mooning.  I fully expect 600+ EOW.", "score": 1, "replies": [{"body": "NFLX $580close tomorrow", "score": 1, "replies": [{"body": "Hope so, God willing. What's your position?", "score": 1, "replies": [{"body": "$680c 07/24 I just posted some loss porn if you’d like to look nothing like your 40k but it’s honest work.", "score": 1, "replies": [{"body": "Tomorrow - Thur gonna be good for you.", "score": 2, "replies": [{"body": "It’ll be good for you to Zachary, you’ll be able to buy all of your kiddos Teslas I truly hope that btw", "score": 1, "replies": [{"body": "Thank you. They'll have to earn their Teslas, as spoiled kids make for lazy kids.  They need to work from zero, just like their dad.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "100% have to hold until Wed. Tues may be rough, but have to hold.  Close watch on eBay.", "score": 2, "replies": []}]}, {"body": "I am ready, I have bought a 32oz bottle of hypoallergenic, vegan lube.", "score": 3, "replies": []}, {"body": "i was late to the 🚀 i bought at 559 i completely shit myself when stocks went down but calling it now i get rich when they release their quarterly earnings report or whatever the fuck they’re doing on thursday, mark my words. if not, i’ll drink my own bathwater", "score": 3, "replies": [{"body": "That’s exactly where I bought! Waited for the dip like a dumbass", "score": 3, "replies": [{"body": "I'm with you guys,  Bought at around 560.  I think we'll see 600 before 500, so hang in there.  Godspeed.", "score": 3, "replies": [{"body": "When you have 40k In calls manifesting you’re reality is the only way to keep sane", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "if it goes tits up i’ll drown myself in the bath because aside from zoom it’s one of the best stocks in a pandemic when everyone’s stuck at home so i yolo’d on it", "score": 2, "replies": []}, {"body": "drowning myself", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "which is why i’m selling tomorrow or sometime after it goes back up", "score": 1, "replies": []}]}]}, {"body": "Glad I found this.  Good luck everyone.", "score": 3, "replies": [{"body": "Glad I found u", "score": 1, "replies": []}]}, {"body": "I have a feeling this mini sell off is profit taking before earnings. Do a google trends search for Netflix subscriptions worldwide. It was higher on average than the first quarter. I have a feeling they will kill earnings.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Diamond hands buddy", "score": 3, "replies": []}, {"body": "Bro I fucked up I bought 7/10 instead of 7/17 last week fml", "score": 2, "replies": [{"body": "Oof thats rough. Depending on how Thursday goes, you can also probably buy a call for next week as the stock will definitely rise if subscriber count is above Netflix execs' prediction. People will want in on it", "score": 1, "replies": []}]}, {"body": "My one 7/24 650C was up 30% today and down as much as 50%. I'm hovering at about -35/40%. I hope you're right. I just want to get my initial investment back at least. Gonna see what tomorrow brings. Hopefully green...", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Selling at $600 not getting greedy lmao will see what theta does to my call until then", "score": 2, "replies": []}]}]}, {"body": "goooooooooooooooood luck sunny", "score": 2, "replies": [{"body": "!remindme 3 days", "score": 2, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 3 days on [**2020-07-16 20:23:22 UTC**](http://www.wolframalpha.com/input/?i=2020-07-16%2020:23:22%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/hql34r/netflix_717_call_holders/fxyrrc1/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhql34r%2Fnetflix_717_call_holders%2Ffxyrrc1%2F%5D%0A%0ARemindMe%21%202020-07-16%2020%3A23%3A22%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20hql34r)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Literally just sold today for 3k. Rolled it over and bought 565c 7/24 in anticipation of earnings and it was going good at first, was up like 350 then next thing I know market tumbles. Currently down $1350 and not gonna lie I’m fucking scared but I’m glad I found this post so I know I’m not alone. Fuck I hope this shit pulls through", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks for the comforting words my man. Still hoping it goes back up by at least Thursday. May jaypow bless you", "score": 2, "replies": []}]}, {"body": "Down -$12k.  Bought 570c 9/18.  Earnings are gonna crush.  Not only is my family a new subscriber last quarter, but we quickly met our per person quota, and had to upgrade (my son watches on his devices).  Now extrapolate my family.", "score": 2, "replies": []}]}, {"body": "TSLA part deux?", "score": 2, "replies": []}, {"body": "I’m waiting on edit 4 and 5", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You okay ? *virtual hugz*", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I wish I could of bought puts", "score": 2, "replies": []}]}]}]}]}, {"body": "Netflix absolutely tanked the second after hours trading started. I got worried and was literally hovering over the sell button and I didnt realize it was market close and right before I clicked the market closed and completely tanked straight down.\n\nWhat does this mean for you guys with large positions and large calls? Is it the obvious that your fucked or what?", "score": 2, "replies": [{"body": "I have 9/18s 570c, so I guess I'm holding.  Feel like someone kicked me in the stomach.", "score": 3, "replies": [{"body": "My average cost is 527 but its a small position couple hundred bucks. just made me realize I have a LOT to learn and that you cant just jump into the market on a rally and buy at any price cause \"its going way up anyway so it doesnt matter what it costs.\"\n\n\n\n\nI think if I heard correctly there are 3x more calls than puts on netflix right now so hopefully we have a reversal tomorrow... Good luck everyone!", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Real question is why everything went down?", "score": 2, "replies": [{"body": "China. And BABA.", "score": 2, "replies": []}]}]}, {"body": "OK boys and girls, we're tanking today.  What are you all doing?", "score": 1, "replies": []}, {"body": "I caved and got out. #rekt", "score": 1, "replies": []}, {"body": "if you are holding 7/17s, you are in danger basically. earnings is on thursday so if it goes back up to 568 theta is still gonna eat yo ass with dijon mustard. you should have sold last week. lesson learned.", "score": 1, "replies": [{"body": "Have 14 9/18s at 570. Hold?", "score": 1, "replies": [{"body": "greeks will answer your question, and optionsprofitcalculator <---google that", "score": 2, "replies": []}]}]}]}
{"title": "WTF Happen today, No News, is everyone liquidating?", "selftext": "Everything was so perfect today, until about a hour after opening everything start to tank a bit. Everything went back up after another hour, but start to roll back down hill. Everything just dropped red afterwards close to closing. WTF happen? Did Mr Small hand catch Covid? Did Printer broke? AMZN went from positive 100 to negative 100, TSLA went from 14% gain to negative today. WTF Happend?", "id": "hqmnxo", "created_utc": 1594670762.0, "score": 35, "upvote_ratio": 0.85, "num_comments": 88, "comments": [{"body": "Think Stonks went down", "score": 98, "replies": [{"body": "thats unpossible!", "score": 24, "replies": []}, {"body": "Well , we might have been  screwed but at least they had a good end to the day in australia (Stonks always go up , just depends on your point of view)", "score": 0, "replies": [{"body": "Username checks out", "score": 1, "replies": []}]}]}, {"body": "I bought calls sorry guys", "score": 76, "replies": [{"body": "Same", "score": 22, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Same", "score": 18, "replies": [{"body": "Same", "score": 11, "replies": [{"body": "Same", "score": 7, "replies": [{"body": "Same", "score": 7, "replies": [{"body": "Same", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "My 0dte 320c were the beginning.", "score": 3, "replies": []}]}, {"body": "There is news .. California closed all restaurants bars and gyms", "score": 48, "replies": [{"body": "Other news is that Jack MA sold 35% of his alibaba holdings. China and US have been putting restrictions on each others Financial accounts for main party members.  Tech trading at 200% higher than analyst price points.  Plus everyone in San Diego is getting Corona virus because they opened up and retard restaurant owners refuse to follow guidelines.  Last week someone at my work called out sick with COVID symptoms, but they kept it hush hush because they didn't want to shut down.  2 days later I developed symptoms.  He confirmed he had it, and they didn't even tell anybody but I found out from him.  Now 4 people in my family have symptoms.", "score": 31, "replies": [{"body": "oof sorry bro hope everyone gets better quickly", "score": 7, "replies": []}]}, {"body": "This!  If other states follow then read my username", "score": 12, "replies": [{"body": "agreed. made 12k on todays drop lol", "score": 3, "replies": [{"body": "On what?", "score": 1, "replies": [{"body": "Bet u he shorted TSLA, easy 10K+ up or down today.", "score": 4, "replies": [{"body": "30k into 8/7 SPY 300P bought at 322 spy today", "score": 3, "replies": [{"body": "Fuck you, and gratz on making 50% today.", "score": 1, "replies": [{"body": "Gracias , diamond hands", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Until they send out another stimulus and jpow fires the printers up", "score": 3, "replies": []}]}, {"body": "yes, but there is always news. the only factor here is printer on and printer off. And that includes the law of unintended consequences with suddenly giving retail a billions dollars of fresh printed money and telling them to stay at home on their computers", "score": 1, "replies": []}]}, {"body": "Peirced previous high, people dumped. Not a strong sentiment in this market. People are just egging each other on higher and higher, until someone bails. Rich people musical chairs.", "score": 14, "replies": [{"body": "It really does feel like that doesn’t it.  Like the game Hot Potato. Don’t be left holding it when shit goes south.", "score": 2, "replies": []}]}, {"body": "There are enough studies to point out that news doesn't really correlate well to market events. For an individual stock, sure, but not broad strokes market. We as humans like to try and correlate news to make it have some form of sense. \n\nThere are a lot of behind the scenes machinations that cause the movement to accelerate if the algos sense something amiss. Everyone had been sensing that this was dot com bubble 2.0 and so there was some hair triggers ready for a pull back and a sell off if the pull back started. Could be as simple as some big player didn't like the margin change and exited their position which triggered a chain reaction. Whether or not it continues is to be determined but it has pretty much nothing to do with the news and almost everything to do with capital allocation and rates.", "score": 27, "replies": [{"body": "Yeah, not like news related to the massive global pandemic has had any over arching effects on the market as a whole in recent memory.", "score": 1, "replies": []}]}, {"body": "Maybe you should ask yourself whether Apple and microsoft are worth 3 TRILLION combined.", "score": 16, "replies": [{"body": "Apple, dont know.\n\nMicrosoft on the other hand is making a nice buck with Azure & Cloud as well as Office & Teams, which basically everyone needs now in this new age of home-office. Sitting somewhere around 200 is fair i guess. I mean hell, they can still pay a passing 1% dividend even at this valuation, and their revenue is independent from Covid. Its like a boomers wet dream safe-haven in this uncertain times.", "score": 6, "replies": []}, {"body": "No, but amazon is well worth its weight in gold atm. But  a tech sell off is a tech sell off. Also california closing doesnt help since many tech companies are sitting here.", "score": 6, "replies": []}, {"body": "Toss in TSLA to your over valued stonks list", "score": 2, "replies": []}]}, {"body": "My chegg calls got fucked, in 30 minutes", "score": 6, "replies": []}, {"body": "The question should be what is driving these prices up, not down.", "score": 13, "replies": [{"body": "This", "score": 2, "replies": []}, {"body": "AMZN maybe, TSLA you ok?", "score": 1, "replies": []}, {"body": "brrrrrr", "score": 1, "replies": []}, {"body": "Once everyone comes to their senses after they lockdown panic, they’ll probably look to online companies like AMZN. Time for AMZN calls!", "score": 1, "replies": [{"body": "Amazon is priced in until 2050. Save your money.", "score": 1, "replies": []}]}]}, {"body": "I suspect the banks will poo their pants tomorrow and big money knew.", "score": 8, "replies": [{"body": "That should be priced in. I'm thinking that big tech might poop it, but we don't know it yet. Expectations over there are pretty big.", "score": 5, "replies": [{"body": "You think tech earnings will be bad?! Name checks out.  Haha, j/k. I actually 100% agree.  I yolo'd 75% of my account into QQQ and Spy puts expiring Aug and Oct.  I think we will see weakness in tech earnings (specifically google, FB, amazon) and then the market will tank.", "score": 3, "replies": [{"body": "Not a weakness, but even if they are good, the market is expecting miracles from them. I actually dumped FB and Google a couple of weeks ago as their revenue comes mostly from adds. AMZN and Microsoft will be the next to go, I'm hoping to get rid of them just before earnings. Honestly Apple has the most retard strength, as they will be dropping an even cheaper iPhone and let's be honest, their users will spend their food money to get the latest toy.", "score": 3, "replies": []}]}]}]}, {"body": "Bull trap, classic pump and dump", "score": 8, "replies": [{"body": "I was thinking about this when TSLA mooned in pre market, but my stupid diamond hands didn't sell at the top. I tried to hold the line as much as I could ended with only a 37% gain when I could have made over 50%. Guess all the gay bears I mocked here put a curse on me.", "score": 5, "replies": [{"body": "Dude, 37% ain't no curse. Well done. \n\nDon't try to catch every penny. That's how people end up with nothing.", "score": 12, "replies": [{"body": "That's why I sold even though 10 more minutes would have got me 100$ a share more. But when you see the trend going down just hit sell. I thought about selling at open, the goddamn pump in pre market was too big, but I was hoping to keep them until they released financials. Too bad the market shat the bed, could've ballooned to 2000. :))", "score": 1, "replies": []}]}, {"body": "I ended with 0 % instead of 400% because my own target was no longer good enough and then I doubled down on it", "score": 1, "replies": [{"body": "Sorry to hear that man. It's weird how greed can really mess with our brains. I remember thinking that this is insanely high and that I should lock in profits, but then also thinking hey it might get to 2000.", "score": 1, "replies": []}]}]}]}, {"body": "Honestly, it’s a culmination of things happening at once, rising COVID cases/deaths and even more voracious speculation on house-hold name stocks. States possible reversing their re-openings, the jobless claims remaining flat. The total put/call ratio was extremely bullish the past week and signaled a correction may have been near. Low volume of trading relative to the increase in underlying price, typically signals a change in trend. Earnings week starts tomorrow, and not expected to bode well for airlines or banks. \n\nI personally think all traders should be thinking of the near/mid-term stock market in terms of consumer spending:\n\nWe are not likely to return to the magnitude of consumer spending for quite sometime, partly because of the tens of millions of people currently without jobs, and that COVID really killed the public’s desire to go out and spend. Job cuts are expected to rise especially in the struggling retail/travel industry. High unemployment (~11%) leads to less consumer spending, plain and simple. If consumers are worried about getting the virus, or if they’ll lose their job, or if they have enough money, they are going to SAVE money. Not spend it. \n\nAn era when consumers are afraid to spend money, means more pressure to think short term, not long term investments like stocks.", "score": 8, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Haha, since OP asked, I can only tell you what I think about when I make trades, not what trades you SHOULD make. You don’t have to listen to what I say lol. \n\nThat being said, didn’t something just feel off this whole past week? Even OP said today started off perfect.\n\nSPY was consistently pushing higher, FAANG, Tesla, and the broader tech stocks reaching for new highs, nearly everyday.\n\nEvery day, on its surface, was bright and sunny for large cap tech stocks. SPY was poised to break the June 8th high today. \n\nIt’s was oddly unnerving, considering the world seemingly crashing down all around us, kind of felt like things were too good to be true. I guess things are rarely ever as good as they appear to be.", "score": 1, "replies": []}]}, {"body": "Or, stonks went down", "score": 2, "replies": []}]}, {"body": "i bought tsla and nasdaq. so it went down", "score": 3, "replies": []}, {"body": "MM know banks are kill, so they started to quietly dump. Then they started to loudly dump. It was like battleshits.", "score": 3, "replies": []}, {"body": "California closing was just the catalyst. The real reason is tech is in a bubble and needed a reason to reverse. The big money knew this was happening. The VIX was bid up all morning even when the market was up 1%. I’d expect a few more days of sell side activity, possibly a pullback to about 245 in the QQQ", "score": 3, "replies": []}, {"body": "This is why I always put both UVXY and SPY on the watch list. SPY was going up until \\~1:30 pm. But UVXY also go straight up from open until \\~1:30 pm and keep going up until EOD. I bought five UVXY 7/17 33C in the morning today. I knew SPY is about to go down, I regret not getting SPY 0 DTE puts today.", "score": 4, "replies": [{"body": "Last time I looked at SPY it broke 320 then had to do shit and didn't watch them candles. :(", "score": 2, "replies": []}, {"body": "I saw this also and instead of being smart I bought SPYG calls", "score": 1, "replies": []}]}, {"body": "California shutdown\n\nBear gang", "score": 5, "replies": []}, {"body": "margin calls. pretty evident based on VIX. algos pulled all the bids when it happened.", "score": 2, "replies": [{"body": "Yeah big margin calls on Tesla last Friday caused a bunch of people to sell who didn’t want to sell. So could be part of it as that continues to happen. We’ll see where it goes short term, but TSLA is still a long term hold for me. Just wish I had more money to grab another share if it keeps going down.", "score": 2, "replies": []}]}, {"body": "You didn’t get the memo? It was sent out at 1:37 pm ET.", "score": 1, "replies": []}, {"body": "ALGOS operating in tandem that’s what happened", "score": 1, "replies": []}, {"body": "Standard correction was standard", "score": 1, "replies": []}, {"body": "ever heard of, \"the top is in\"?\n\nWSB overly confident and gains on tech bullish. clearly today was going to be red", "score": 1, "replies": []}, {"body": "China sanctions, lockdowns, profit taking and something about margin limits. But don't worry, it will go back higher by next week.", "score": 1, "replies": [{"body": "so 7/17 bag holder are fucked?.", "score": 1, "replies": []}]}, {"body": "The question you should be asking is why have we been climbing these last couple weeks.", "score": 1, "replies": []}, {"body": "If only people take 1 minute to read the news on the shutdown... There's nothing new, we still cannot eat indoors at restaurants, or visit attractions that are indoors.  Tech businesses are still running at the same pace. The way I see it, this afternoon was the last chance for late investors to jump on the STONKS train.", "score": 1, "replies": []}, {"body": "Yall acting like you never seen a red dildo before.", "score": 1, "replies": []}, {"body": "Someone asked for a dip to buy in. Here it is and now its go e.", "score": 1, "replies": []}, {"body": "China said it'll retaliate against US sanctions. Then California shut down again at around 2PM EST. C'mon assholes, how the fuck y'all trading and don't even know what the fuck is happening in the country. Has Pappa Powell made it that easy for you fucks to make money?", "score": 1, "replies": []}, {"body": "All banks are about to report earnings in the next 24 hours. That’s what I’m thinking..", "score": 1, "replies": [{"body": "Yet the bank stonks didn't tank.", "score": 5, "replies": [{"body": "Exactly. Nothing makes sense. Just ride the waves of nonsense.", "score": 6, "replies": []}]}, {"body": "I bought XLF puts at EOD. They better tank!", "score": 2, "replies": []}]}, {"body": "So the question is, does big money get back in for discounts tomorrow or later this week? Only they know...", "score": 1, "replies": []}, {"body": "\"No news\" lmfao", "score": 1, "replies": []}, {"body": "Kang Gang", "score": 1, "replies": []}, {"body": "Parabolic charts don't end well. \n\nTesla looks like a coin chart, or a beanie baby chart, or a tulip chart, South Sea Trading, there was a Mississippi company too maybe? Anyway... The only reason Tesla was going up was bc retards were buying it. \n\nEver do the Market Capitalization per car made ratio on various auto companies including Tesla? \n\nThe numbers aren't sustainable. \n\nThe \"Fed\"(private company btw...) doesn't want to help average Joe lol. Theyve been stealing from them since 1913...they'll continue to.", "score": 1, "replies": []}, {"body": "Is California shutting down again not news for you?", "score": 0, "replies": []}, {"body": "Finally ran out of buyers.", "score": 0, "replies": []}]}
