{"title": "I can’t be the only TSLA autist can I? RIP", "selftext": "[deleted]", "id": "hrflt5", "created_utc": 1594781287.0, "score": 120, "upvote_ratio": 0.93, "num_comments": 85, "comments": [{"body": "Bitch you have till next week - Imma 60% down with 3 days to go", "score": 56, "replies": [{"body": "Same", "score": 13, "replies": []}]}, {"body": "Meh, you still have a week and they just got the tax exemption for the Texas plant. Could still print.", "score": 80, "replies": [{"body": "Tbh they’re overpriced unless they reveal something groundbreaking at battery day.", "score": 29, "replies": [{"body": "I think every TSLA call holder should have been looking at 1700 support and 1650 support levels like a hawk. The moment they were breached, should have sold. \n\nI was actually chatting with a kid I met on WSB that day. He was asking if he should sell or not (up like $10k). I said if 1700 doesn't hold, probably. Didn't sell. I said normally a retracement is $100, so if it bounces at $1650 you might be fine, but if it goes lower, you should sell. Didn't sell. He messages me the next day crying.", "score": 40, "replies": []}, {"body": "even if they reveal something groundbreaking they still need to fucking produce and sell it.\n\nTeslas market share in the battery market is 0.2% if you round up, they are irrelevant in terms of production capacity.", "score": 1, "replies": [{"body": "Yeah but you invest based on where you think they’re heading, not where they are today.", "score": 2, "replies": []}]}]}, {"body": "Indeed. I am holding 2000C 07/24. ER fomo will help.", "score": 7, "replies": [{"body": "I held a dozen calls expiring the week of Q1 earnings.  I would have made $100k if I bought them expiring the week after.", "score": 5, "replies": []}]}, {"body": "Hold it until .1 to cash out", "score": 2, "replies": [{"body": "I would probably say watch 1500. If 1500 holds it will rally next week. If it really starts to crash, even if it rallies next week it wont be enough.", "score": 1, "replies": []}]}]}, {"body": "IT’S NOT OVER TIL EXPIRATION DAY", "score": 12, "replies": []}, {"body": "TSLA 1800 tomorrow @ 10:40", "score": 31, "replies": [{"body": "What about this? I bought 3 calls @ $2,000 7/17 for $12.58 avg cost and am down -23.97% at closing. Down -$901 with current price at $9.58 and the stock was at $1,511 at close. Now the stock is at $1,570.75. I’ll dump in the morning for hopefully a nice gain. Can’t see what the call is worth now though.", "score": 0, "replies": [{"body": "Why are you chasing 20 dollar bills playing Tesla? Insert your money and watch it work for you.", "score": 9, "replies": [{"body": "Because I got greedy after a really lucky 14k net profit Tuesday on 2 calls and then bought calls on dip. But they are eating shit. So happy to break even this morning.", "score": 1, "replies": []}]}, {"body": "🙄 \\[learn to\\] Read the chain\n\nIf TSLA opens up $60 your calls will be worth at most $12. But with overnight theta burn it'll be much lower", "score": 4, "replies": [{"body": "Thetaaaaaa burnnnnnnnn.", "score": 4, "replies": [{"body": "-7.01 Theta...assuming the higher the number the worst it is for the call", "score": 1, "replies": [{"body": "Yeah so each day your option would lose $7.01 in time decay.\n\nEdit wait. Lol that’s $701 a day. \n\nMultiply the Greek by 100.", "score": 1, "replies": []}]}]}]}, {"body": "I wouldn't hold a $2,000 call past today, peak is likely 9:45-10:45", "score": 4, "replies": [{"body": "I’m tempted to sell all 3 off right away. Haha!", "score": 0, "replies": []}]}]}]}, {"body": "Your strait fam! Papa Daddy Elon Musk Capt Save A Hoe coming through for you tomorrow. \n\nHe just announced Giga factory In Berlin - Updated renderings for the Berlin factory. Adding test track for you retard autists to test our new Tesla roadsters on. \n\nTesla to the moon!!!!\n7/24 4200c", "score": 10, "replies": []}, {"body": "I bought in at 19,000 today idgaf", "score": 21, "replies": []}, {"body": "My puts is bleeding too..theta fuck", "score": 6, "replies": [{"body": "Fuck you gay faggot", "score": -6, "replies": []}]}, {"body": "At least you are still in the green side. \n\nMy AMZN looks the same but the the red side. POWER BOTTOM!", "score": 5, "replies": [{"body": "+150 tomorrow", "score": 3, "replies": []}]}, {"body": "In TSLA time the 24th is weeks away. You’ll be fine.", "score": 9, "replies": [{"body": "It's next week dood. That covid-time rushes by it surely does.", "score": 5, "replies": [{"body": "He’s saying intraday tsla has movements that it takes the avg stock quarters if not years to make. So to have 8 more trading days before expiration. That’s like months/years for tsla.", "score": 3, "replies": [{"body": "Ah, ok thx. I mean fuck your whole ass.", "score": 2, "replies": [{"body": "It’s reserved for Elon sry 😕", "score": 2, "replies": []}]}]}]}]}, {"body": "you paid 19k for 1 contract?  Like a few weeks from expiry?", "score": 9, "replies": [{"body": "Look At the picture bro😑", "score": 0, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "Uh no.  He paid 19k.", "score": 5, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "that's the current price brah! he paid about 19k, lost 11.5k and is sitting at about 7.5k (current price)", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You said you bought spy puts 3 weeks ago. And kangaroos are badass.", "score": 3, "replies": []}]}]}, {"body": "You're reading it wrong. It's currently worth 7728. He paid 11K more than that. He paid 19k.", "score": 3, "replies": []}, {"body": "That's what it's worth now after losing over 11k in value.", "score": 2, "replies": []}]}]}]}]}, {"body": "Godspeed", "score": 4, "replies": []}, {"body": "Did you buy at the top yesterday? 😶 still has time to print but will probably need it to go up 200-300 to make a good profit from that entry point. Gl! My calls are rooting for you!", "score": 2, "replies": [{"body": "What about this? I bought 3 calls $2,000 7/17 for $12.58 avg cost and am down -23.97% at closing. Down -$901 with current price at $9.58 and the stock was at $1,511 at close. Now the stock is at $1,570.75. I’ll dump in the morning for hopefully a nice gain. Can’t see what the call is worth now though.", "score": 1, "replies": [{"body": "Daaaaang. That’s not bad! I’ve got 1980/2000c spreads at avg 2.25. Max gain at 2k per. Tryna pull 80-120% gain on em tomorrow or hold to expiration 😂 (7/17)", "score": 3, "replies": [{"body": "Those are great too! So you will probably print at opening if you sell off right away? \n\n\nIf I sold before SP $2,000 if it was +$, I would still keep the profits though, Correct? I doubt it’s getting to $2,000 by end of week.", "score": 1, "replies": [{"body": "You’d need it to go to 2012.58 for you to break even at close Friday. If the stock opens 1600+ you’ll probably be back in the green. I’m hoping for a retracement back to that 1794 resistance. Even if we double tap I’d sell probably when we break 1700 cuz paper hands and I’d wait for a chance to short into the afternoon. If we go for a breakout above 1800 though I’m buying calls and ghetto spreading the afternoon run up. And hope for it come back down so I can buy out of the sold calls for max gains on long calls!", "score": 3, "replies": []}]}]}, {"body": "If you’re lucky you’ll get out at even this morning.", "score": 2, "replies": []}]}]}, {"body": "It’s gonna come back. It’s fucking Tesla. Don’t sweat it. You’ve got plenty of time.", "score": 11, "replies": []}, {"body": "TSLA will be 1800 EOW at least. Especially with this Texas Cybertruck news. Don't sweat it, not only do you have this week but you have next week as well.", "score": 9, "replies": []}, {"body": "Tesla will probably go from 1500 up to 2200 back down to 1400 and then finish on 7/24 at 2250 so your calls will most likely print", "score": 7, "replies": [{"body": "That’s a very specific answer...  The odds are not in your favor of being right.", "score": 14, "replies": []}]}, {"body": "Right there with ya buddy. \n\nhttps://imgur.com/GjTAX6U", "score": 3, "replies": []}, {"body": "Listen up you autist. If you still think this shit is going to go back up to save you, here's how you make money out of your retarded FOMO timing.\n\nBagholding this till you get out even means waiting for this shit to go up past 1800, a $300+ move up. If you had sold your contract and bought 2 of the 7/17 1620 at 38 you'd earn back what you've already lost if this goes up $100-120 tomorrow.\n\nAfter that you can roll your original 19k again into whatever ER FOMO 7/24 YOLO that makes you happy", "score": 3, "replies": []}, {"body": "I have 1900c 7/17. Bought 2 of them for 65.00 each at the start of blood Monday. Hopefully with the new announcement of giga Berlin and india, this will bring it up to 1900 by Thursday", "score": 2, "replies": []}, {"body": "Dude you bought in at the peak. Everyone with a brain cell knows Tesla is always a 50/50 gamble. Especially at its ATH\n\nSell it and move on. It’ll be easier to earn 2x gain elsewhere.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I move against the current. Look at my last post 😂 I’m 10k down on TSLA puts.", "score": 1, "replies": []}]}]}, {"body": "Try getting to -100% like I did buying weekly puts when it hit 1300.", "score": 2, "replies": []}, {"body": "Shits green no need to panic bitch", "score": 4, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/penny_rogers the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "I’m very new to options and trying to understand why someone would do this. I have to be misunderstanding something. If Tesla were to go to say 1800 how much could this call possibly be worth?  It seems like for the price paid for this option the stock would have to hit quite a bit higher to be decently profitable and to get the money back. Am I retarded?", "score": 1, "replies": [{"body": "what op just did is called gambling, theres no reason why you would pick red or black", "score": 2, "replies": [{"body": "Fair point. It just seems like a tremendous amount to bet for a payoff that might be minimal unless it jumps through the roof.", "score": 1, "replies": [{"body": "Option holder don't need hold till expiry. \n\nThe buyer can sell when things look good, and have \"time\" when things are not healthy. If a crash like yesterday happen on a Thursday or Friday, those holding 0-1 DTE calls are mostly doomed, while those with high DTE can weather the blow to either roll, sell or wait it out.\n\nLet's say, IF tesla hits 1779 this Friday, even though OP's calls are not ITM, the high IV give enough time premium that, he'll get around 90-100% profit... assuming he sells. If not, he goes into danger zone next week, because if a crash happens again, there is no time left to run.", "score": 1, "replies": [{"body": "That last part is dead wrong. IF tesla hits 1780 this Friday his calls are going to be worth 130 tops ATM. Current ATM premium is 155, theta on those is -$8. Do the math.", "score": 1, "replies": [{"body": "Yes, I stand corrected... \n\nI got lazy and went with a 10% discount on the quoted price instead of doing the maths.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "FOMO", "score": 1, "replies": []}, {"body": "Stonks only go up", "score": 1, "replies": []}, {"body": "Umm I’m new to this stuff (and extremely autistic) what app is this?", "score": 1, "replies": [{"body": "Pornhub", "score": 1, "replies": []}]}, {"body": "I have a call for $1590 exp 7/24 and 1600c 7/24 exp.. I feel like I’m good and it’s gonna moon after earnings but I don’t know what the fuck to do with it? Anyone have any advice lol", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’m gonna wait till earnings am I crazy? Lol", "score": 3, "replies": []}]}]}, {"body": "it's okay Ramen tastes good", "score": 1, "replies": []}, {"body": "I have a 1600 call expiring next week, I feel pretty fucked rn.", "score": 1, "replies": []}, {"body": "I'm looking at Tesla call today but only have $1k :(", "score": 1, "replies": []}, {"body": "Anyone know how to play taps? We have a fallen autist", "score": 1, "replies": []}, {"body": "🤣", "score": 0, "replies": [{"body": "Bro you put that face on every post in this place. Why?", "score": 3, "replies": [{"body": "🤣", "score": 4, "replies": []}]}]}, {"body": "I think you have to be an idiot to buy options with IV that high", "score": 0, "replies": [{"body": "Youre not from around here, are you?", "score": 7, "replies": [{"body": "YOLO", "score": 4, "replies": []}]}]}, {"body": "Dude this is gonna print for sure I got Same shit", "score": 0, "replies": []}, {"body": "Let’s never doubt Tesla. Autistic bulls unite once more for Tesla pump prior to Earnings and S&P 500 inclusion hype. Don’t worry just yet Papa Elon’s got your back 🖤 I promise", "score": 0, "replies": []}]}
{"title": "Is it time to take profit and get out of the markets?", "selftext": "\n‘Fear’ is rising in the stock-market and so is ‘dumb money’ confidence as tech stocks reach an inflection point \nhttps://www.marketwatch.com/story/fear-is-rising-in-the-stock-market-and-so-is-dumb-money-confidence-as-tech-stocks-reach-an-inflection-point-11594815626\n\nCharts suggest the S&P 500 climb will stall out at the end of July, Jim Cramer warns\nhttps://www.cnbc.com/2020/07/14/jim-cramer-charts-suggest-sp-500-climb-will-stall-out-in-late-july.html\n\nBlackRock’s Rieder sold some Tesla, says it’s time to take chips off in some high-fliers\nhttps://www.cnbc.com/2020/07/15/blackrocks-rieder-sold-some-tesla-time-to-take-chips-off-in-some-high-fliers.html\n\n\nIs it time to take profit and get out of the markets?", "id": "hrt3bc", "created_utc": 1594837836.0, "score": 16, "upvote_ratio": 0.65, "num_comments": 90, "comments": [{"body": "Listing Cramer as a source invalidates this entire post", "score": 172, "replies": [{"body": "\"Lehman Brothers is looking CHEAP! I'm giving it a strong BUY rating\"\n\nThat guy hates us, but deep down, he is one of us.", "score": 22, "replies": [{"body": "Didn’t his fund lose money one year when the S&P and Dow gained like 20%? What a joke", "score": 7, "replies": [{"body": "a lot of hedge funds look like that", "score": 5, "replies": []}]}, {"body": "To be fair, Lehman's was cheap at that point. It wasn't a great value, but it was cheap. It had a tiny shot at enormous returns. It was to the stock market what FDs are to the options market.", "score": 7, "replies": []}]}, {"body": "Also means OP should be banned", "score": 68, "replies": [{"body": "And put into a cannon and fired into the sun.", "score": 25, "replies": []}]}, {"body": "People shit on Cramer, but he was either right about a lot of short term trades the past couple of months or drove retail to those trades to make himself right. Either way, I wouldn’t write him off and he’s speaks with Mnuchin regularly.", "score": 5, "replies": [{"body": "He bashed NVAX while my calls went from $550 to $5500 so I don’t give a shit what he says. You could say buy anything besides LK HTZ JCP and make money pretty much the last few months", "score": 6, "replies": []}]}, {"body": "That only means they go up. Thanks Jim", "score": 1, "replies": []}]}, {"body": "Of the rich boomers I know, all of them have gone liquid. Some of them have taken up gardening. Take this information as you will.", "score": 34, "replies": [{"body": "Calls on tomatoes.", "score": 17, "replies": [{"body": "You idiot. All these home grown tomatoes will dilute the tomato value.\n\nPuts on tomatoes, calls on farmers markets", "score": 19, "replies": [{"body": "Calls on organic dog shit manure", "score": 4, "replies": []}]}]}, {"body": "boomers money should mostly be in cash or bonds anyway because they're old as shit. and it does seem pretty likely that america is going to be in a recession for at least a couple years, but that doesn't mean there's not money to be made on stocks.", "score": 9, "replies": []}]}, {"body": "Look at this asshole with his “profits”", "score": 27, "replies": []}, {"body": "Profit taking is always a good idea. The best way to make money in the market is to not loose money.", "score": 25, "replies": [{"body": "Keep a tight butthole", "score": 21, "replies": []}, {"body": "Ever since I started taking about 50% of the profits and playing with the rest of it, I've finally been making money.  When I was playing and going all in all the time and keeping it in even after 300% gains, I always ended up with $0.    I think this week is the first time I've actually been able to enjoy winning and not stress out since I'm just playing with house money at this point in time.", "score": 9, "replies": []}]}, {"body": "It's time to give your profits to me and get out", "score": 36, "replies": []}, {"body": "This has been said for months, so who knows", "score": 21, "replies": []}, {"body": "Gotta have profit in order to take it", "score": 24, "replies": []}, {"body": "Friday will be fun", "score": 12, "replies": [{"body": "Why Friday specifically?", "score": 4, "replies": [{"body": "Same bro, im new in options and enjoy yolo my life saving, but what friday", "score": 4, "replies": [{"body": "If the market dumps hard in this last hour, then I can see tomorrow being green and Friday being red possibly. But if today ends where it is then I think tomorrow opens green and goes down. So I was curious why he though Friday specifically.", "score": 4, "replies": [{"body": "Definitely gonna be slight green in the open and red all day tmr base on chart. Only thing is if friday continue to red and bull all next week is my prediction", "score": 4, "replies": [{"body": "Yeah kinda looking that way to me too.", "score": 1, "replies": []}, {"body": "Yep", "score": 1, "replies": [{"body": "No", "score": 0, "replies": [{"body": "lol you ready for tomorrow? Dummy?", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Lots of options are expiring this Friday so market will move based on that.", "score": 7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Bet? See you Friday lol", "score": 5, "replies": []}, {"body": "You ready dummy?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Wait for it", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What are you talking about. Market opened red and tomorrow will be red again. Dummy.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "? Retard.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "And do what with my money? Put it in a CD or savings account like a jerkoff. They banned betting on Ukrainian ping pong.", "score": 12, "replies": [{"body": "😂", "score": 4, "replies": []}]}, {"body": "The market goes up and only up, that’s Newton’s 4th law I believe.", "score": 4, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}, {"body": "Man... how does Cramer still have a job? Dude is wrong a lot.", "score": 14, "replies": [{"body": "Because he's an entertainer, not a financial adviser", "score": 9, "replies": [{"body": "For real! I hope people keep listening to him.", "score": 2, "replies": []}]}, {"body": "Well, he predicted like 6969 market drops out of some dozen dips. That's something to aspire to.", "score": 4, "replies": [{"body": "I’m not a fan of his.", "score": 1, "replies": []}]}]}, {"body": "Gold above the $1800s\n\nBonds yields low\n\nVix 28\n\nOther than big tech the other sectors are still trading at a discount.\n\nThe market is much more rational if people look. I doubt there will be another market crash, probably more of a shift of cash from growth to cyclical stocks.", "score": 4, "replies": [{"body": "Why is gold pushing to ATH if things are rosy in marketland?", "score": 1, "replies": []}]}, {"body": "I read this post last month", "score": 4, "replies": []}, {"body": "idk", "score": 9, "replies": [{"body": "It's a strong maybe", "score": 3, "replies": []}]}, {"body": "You want yield or nah? Scared money dont make moneez", "score": 3, "replies": []}, {"body": "Take profits and put 10-20% of your cash into VXX calls expiring in September.", "score": 5, "replies": [{"body": "This sounds like the invention of diamond hands being plastered all over this sub.", "score": 6, "replies": []}]}, {"body": "Defense firms still need to pop. They're asking for COVID relief and will almost certainly get it, plus the Defense Authorization Bill(s) are supposed to move forward toward the end of this month. Unfortunately the option volume for these stonks is generally low. \n\nPosition: HII 170c & 195c  8/21.", "score": 2, "replies": [{"body": "that volume tho.  even the stock itself is like 200k daily volume", "score": 1, "replies": []}]}, {"body": "Ban", "score": 2, "replies": []}, {"body": "This rally will last through earnings season. Stonks only go up until at least mid August", "score": 3, "replies": []}, {"body": "We all know it's going to crash again.", "score": 4, "replies": [{"body": "Well no shit but is that tomorrow or is in 14 months when this bubble pops? Look at tech bubble.", "score": 8, "replies": []}, {"body": "Backstopped by the fed. No way. There will be ups and downs but no crash. Just keep buying the downs and sell the ups.", "score": 3, "replies": []}]}, {"body": "I don't get why p\\[eople are dumb enough to believe that this rally is legit with all the retail investors jumping in from mcdoanlds workers to grocery baggers.\n\nYou don't take profit out of the markets unless there's a legit drop coming and shaking out low class firms and retail doesn't count as a legit drop.", "score": 2, "replies": [{"body": "Facts my dude. I think you upset the retail investors because you worded it in their language", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I hope everything goes to shit and VXX moons until friday EOD, otherwise I'll be sad", "score": 1, "replies": []}, {"body": "Stonks only go up, don't be a   **🌈** 🐻", "score": 1, "replies": []}, {"body": "It's been that way for a while.\n\nBut stonks go up.\n\nCalls.", "score": 1, "replies": []}, {"body": "No. Dumb money gets burned - stimulus gets passed - market jumps", "score": 1, "replies": []}, {"body": "It's time to buy VXX calls", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Baskin Robbins has 31 spectrums of ice cream", "score": 2, "replies": []}]}, {"body": "Lol listening to news for direction ?", "score": 1, "replies": []}, {"body": "Bullish SPY 420", "score": 1, "replies": []}, {"body": "Its all predicated on JPow doing nothing by the end of the month. They won't do nothing. Its an election year.", "score": 1, "replies": [{"body": "The feds are doing overnight repo everyday for a month, if that is not a sign liquidity is f*cked, I don't know what is.\n\nThey have bought probably as many bonds as they can.  So purchasing junk ain't going to help the market either.", "score": 1, "replies": []}]}, {"body": "Lol once I read Jim Cramer you lost me.", "score": 1, "replies": [{"body": "Focus on what not on who. People like Warren Buffett have been wrong at times.", "score": 1, "replies": [{"body": "Lol what? Yea everyone makes wrong moves.  Cramer is a fucking twit. Remember when he said to pull whatever money you needed in the next 5 years out of the market and it went up 60%? At one point if you bet against his buy stocks you could make 25%. Not to mention the hundreds of other bad calls he made about banks. \n\nSo yes the source of information is pretty fucking relevant. \n\nIf you have a guy on your team batting 0.100 you don't throw him in during the bottom of the 9th with 2 outs down 1.", "score": 2, "replies": []}]}]}, {"body": "Never. If you are scared, put money into gold or short term treasuries, cash is depreciating", "score": 1, "replies": []}, {"body": "Inverse everything jim says end of next day.", "score": 1, "replies": []}, {"body": "Fill in the blank\n\nStonks only go \\_\\_", "score": 1, "replies": [{"body": "crazy, when gamble. lol", "score": 1, "replies": []}]}, {"body": "Yes please. GTFO so my puts can print", "score": 1, "replies": []}, {"body": "You're always investing in something. If you pull out of the market, you're investing in cash. The dollar is the one asset that is almost guaranteed to always lose value. Especially with money printer man.", "score": 1, "replies": []}, {"body": "nope", "score": 1, "replies": []}, {"body": "I think if AMZN is okay, you need not worry, my man\n\n$1.52 Trillion market capitalization lolllll", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Okkk\n\n\nEdit 1: for clarity\n\nGOOG + TSLA does not equal AMZN\n\nEdit 2: delete your comment before I can tag your user, love it (& downvoted too luv)", "score": 0, "replies": []}]}]}, {"body": "Not to be that guy but WSB wields more power than we admit. \n\nIf we coordinated we could single handedly start the correction and this sub would make billions.", "score": 0, "replies": [{"body": "Are you serious? Why not then?", "score": 3, "replies": [{"body": "Well it's illegal for one. But just getting everyone together would be almost impossible especially with how much shit everyone talks to eachother here.", "score": 6, "replies": [{"body": "Herding autistic cats", "score": 1, "replies": []}]}]}]}]}
