{"title": "Tesla share rally propels some early fan investors to riches", "selftext": "", "id": "hupzeh", "created_utc": 1595267578.0, "score": 153, "upvote_ratio": 0.95, "num_comments": 95, "comments": [{"body": "Interesting bias.  So people that bought Tesla shares early are “fans”.  With other stocks,  they would refer to them as “savvy investors”.   Sure I am a fan but my decision to buy was based on research and careful consideration.  \n\nIt’s interesting to see how the business community views Tesla investors.", "score": 160, "replies": [{"body": "It’s because Wall Street is a joke.  It’s a racket based on snatching fees at every turn.  Believe me I have worked at banks and hedge funds since 2006.  The vast majority is composed of sociopaths and egomaniacs who actually have very little critical thinking skills.  Just a bunch of lemmings.  What’s sauce for the goose is sauce for the gander.... but no... if Wall Street got Tesla right the analysts would be heralded as astute genius investors — yet retail investors are speculative gamblers and fanatics.", "score": 22, "replies": [{"body": "Probably not a fair question so please know I know that.\n\nIs a stock “worth” anything? I’ve bought a lot for never having extra money. I’ve been really lucky with Apple, Couer D’Alene mining, Tesla, Netflix, volcom and Hurco. I like the concept of stocks, but why are they worth anything. Is it just a collective delusion? Why is a share of Tesla worth more than an Apple?\n\nEdit: a literal Apple for eating.", "score": 3, "replies": [{"body": "At its core, owning a share of a company's stock is owning a share of the company.  After a company matures and stops needing capital to innovate (or is making so much money they can't spend it all, they might start paying dividends on those shares. Right now, because of the huge number of parallel disruptive technologies hitting the world stage at the same time, no company worth owning is paying dividends, because harnessing disruption takes capital.", "score": 7, "replies": []}, {"body": "A share is worth exactly the money you can sell it for at any given point in time. It gives you ownership of a percentage of a company, which in turn is worth a certain amount of money that depends on many factors, from revenues, to profits, profit margins, projections for it's future etc. You just own a part of the company's value.", "score": 1, "replies": [{"body": "Because other people *believe* it has value. Same as gold coin in world of Warcraft?", "score": 1, "replies": [{"body": "Not exactly. You can say US dollars have value because the government enforces it, and that makes people believe it has value and trust in that. But a company has actual value since it either provides a service or produces something that people want. This gives it inherent value. Since a share represents a share of the company, the share you own has actual value.", "score": 1, "replies": []}]}]}]}, {"body": "... yeah, I'm really getting that kind of vibe from that industry.", "score": 1, "replies": [{"body": "To be fair, there are talent-less, lazy, and useless people in all sorts of jobs.  But i think one big problem specific to wall street is it generates such huge fees because they are taking small percentages off billions of dollars in deals or money managed.  I think that attracts people that would otherwise not have talent or desire for the actual job but navigate their whole careers doing whatever it takes to just get the next paycheck.  It also gives people an undeserved feeling of grandiosity and intelligence when their big paychecks are just a result of so much money sloshing around.", "score": 3, "replies": [{"body": "Yeah, I think I get that.", "score": 1, "replies": []}]}]}]}, {"body": "Agreed I didn’t put my life savings in TSLA 4 years ago, go negative on my investment 9 months ago, but still buy more shares just because I’m a fan of Tesla. During this time everyone said they were overvalued, media, coworkers, friends, and family. \nClearly I’m “just a fan” that still holds the shares and will do so into the long term.\n\n\nBack in the day I was working the first aid booth at a convention center in 2007. I spoke to a woman about how she enjoyed the products and bought the stock of the company. She said her family thought it was silly her going to these type of events. The event I ended up working at was the launch of the very first iPhone. I got to be in the room when it was announced. I hope her early belief in the company continues to reward her in her investment even now.", "score": 46, "replies": [{"body": "I am an investor in AAPL and TSLA (along with a few others).  I am a “fan” of both companies, as I purchase products from them due to the value I perceive them having. I follow news about both companies religiously, partly due to curiosity, but also for the investment insight. The line gets blurry.\n\nI have to say I am a Tesla fan... buying a Model Y and Cybertruck even though I really don’t have any desire to own a car as it is easier for me to just rent one once a week if I need it.", "score": 4, "replies": []}, {"body": "I don't understand the argument your second paragraph is trying to make. I feel like it flows the other direction ?", "score": 5, "replies": [{"body": "I think there’s a distinction, a line you cross once you put your own money into the game. It’s not being a fan, it’s a belief in the success of the company. That belief could have also come from a product experience, but that doesn’t mean your investment decisions was based off fandom.", "score": 14, "replies": []}]}]}, {"body": "They are just selling whatever gets clicks.\n\nWish I bought shares back when I test road in a Tesla Roadster in 2010. Glad I started to buy in 2016 though.", "score": 9, "replies": []}, {"body": "Us being fans made it easy to do the dd on the company because we all watch the company daily", "score": 4, "replies": []}, {"body": "They can call me Suzy if it pleases them. I made bank on this investment. I bet the author missed out 😂", "score": 6, "replies": []}, {"body": "I find that whenever I buy something that goes down, people tell me that I was stupid to invest in it, but if I invest in something that goes up, they say I was lucky.\n\nThey never seen to entertain the idea that maybe I did my homework and made a smart investment.", "score": 2, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Totally", "score": 1, "replies": []}, {"body": "I'm the other hand, if you are an early investor in Tesla, Tesla being a very cool innovative brand from the start, you are pretty much bound to be a fan as well, right? The entire article is very objectively written with no seeming underline negative tone, or any bad intention. So I would  not read that much into the word fan in the title.", "score": 1, "replies": [{"body": "Of course you are a fan to some degree if you purchased Tesla stock from the start.   I just find that Tesla investors are painted with that brush more often than investors in other companies.  \n\nI rarely read about early investors being referred to as “Walmart fans” or even “Amazon fans”, they are more often referred to as early investors.", "score": 1, "replies": [{"body": "Sure I get it. Although I think it's also confirmation bias at play, at least a bit. Amazon or Walmart don't have \"fans\". Tesla is actually and extremely cool brand that has tons of actual fans with a CEO that is changing the world in many ways and has more followers on Twitter than most Hollywood superstars. If you consider this fact, it becomes much easier to see why it's ok for the article to refer to early investors in Tesla as fans and not mean anything negative by it. There is a huge part of the media that has extreme negative bias against Tesla due to big interests... I just don't see that this is such a case at all.", "score": 1, "replies": []}]}]}, {"body": "Why do you care? Enjoy your riches without bragging about it. If you were and are able to hold then you’re an investor. If you made 50% and sold then Tesla is a shoulda coulda woulda. \n\nAll good 😎", "score": -5, "replies": [{"body": "For the same reason people like, and deserve, to receive positive acknowledgement when they perform well at their job, even though they receive cash payment for their work.  Theres nothing wrong with being proud of a good accomplishment and questioning the motives of those that try to belittle that work.", "score": 3, "replies": [{"body": "Sorry - one fun thing. The # of negative votes on the top part is conducive to the % or people with no iron in their belly, isn’t it. Otherwise they would smile and go + , lol.", "score": 0, "replies": []}, {"body": "Ugh. Fine. Softy!", "score": -2, "replies": []}]}, {"body": "It’s not just one or the other.  In 2018 and 2019 I had 130% of my net worth in Tesla.  Now, I have 80%.  So, I’ve both sold some and held some, and I’ve massively decreased my risk.", "score": 1, "replies": []}]}, {"body": "They all fucking haters and bears, we don’t want them buying stock", "score": -1, "replies": []}]}, {"body": "“In South Korea, where Tesla has become the latest craze among tech-savvy professionals, the company is the most-traded overseas stock, with Koreans buying $3.2 billion worth of Tesla shares so far this year, up nearly 13-fold from all of 2019”", "score": 30, "replies": [{"body": "I'm waiting for it to turn into a Twitch Instagram YouTube... Tim tok? vlog mukbang makeup lifestyle live stream trend amongst the influencers in LA.", "score": 4, "replies": []}]}, {"body": "I grew up in a dumpy trailer park and started working my ass off in my early 20s. 29 now and I bought a condo, and I’m going to buy a home for my dad so he can also get out of the trailer park. At my peak was 180 shares. I’ve been buying since 2015. My life is changed. Thank you Elon.", "score": 28, "replies": [{"body": "Good on you! Elon and company have changed many of lives who first helped themselves. Keep up the hard work and smart money management! Sky is the limit.", "score": 3, "replies": []}]}, {"body": "Anyone whose been here since before 2020 is now a fatcat", "score": 18, "replies": [{"body": "For me a fat 🐈 is 5 mil. A mil in manhattan gets you a studio.", "score": 10, "replies": [{"body": "Same in Bay Area, CA 😀", "score": 8, "replies": [{"body": "Almost the same in Sydney", "score": 3, "replies": [{"body": "Same in Vancouver", "score": 3, "replies": [{"body": "Same in Singapore", "score": 2, "replies": [{"body": "This is why wealth inequality is out of control.", "score": 1, "replies": []}]}]}]}]}, {"body": "soon...", "score": 1, "replies": []}]}, {"body": "I've been around since the 100s but I'm not a fatcat because I started out too small. I live in flyover country and didn't have enough capital to invest to call myself a fatcat.", "score": 1, "replies": [{"body": "How many shares do you own now mate? If it's anything over 50 shares you'll be at the very least well-off in 10 years.", "score": 2, "replies": [{"body": "yeah, I expect it might be enough to retire on in 10 years but right now it isn't enough to do so.\n\nI just don't feel fatcat with my TSLA value still in 6 digits.", "score": 1, "replies": [{"body": "Agreed. If you don't have the ability to retire and live at your desired level indefinitely without ever again working you are just not fat for your standards yet. Neither am I. But we will be :)", "score": 1, "replies": []}]}]}, {"body": "Don't worry we ain't done yet", "score": 1, "replies": []}]}]}, {"body": "My question, those of you who were in Tesla stock from the beginning, what stock are you observing/trading right now?", "score": 13, "replies": [{"body": "I bought my shares in 2010 for $20. I bought it because it was the first new thing cars since the internal combustion engine. They only sold the original roadster at the time. Every article I read loved the car. On the other hand, the other \"EVs\" (Leaf,and Volt) were overpriced garbage. That is why I bought in. My investment was at best a bet that it could become my \"Apple in the 80s\" stock.\n\nI'm actively looking for the next thing, but I'm not finding anything similar. \n\nLots of people are investing in the other EV companies, but I think they are over valued and riding Teslas coattails. I would like to buy SpaceX if it ever becomes publicly traded, but it will be valued much higher than Tesla was in 2010.\n\nIt was like catching lightning in a bottle. It doesn't happen often.", "score": 27, "replies": [{"body": "Look into Illumina mate. Illumina, Square and Lemonade are three stocks I would be into if I weren't 100% all in on Tesla. \n\nHowever my suggestion would be to stay 100% Tesla. There still even a 100x+ upside withing the next 15-20 years.", "score": 2, "replies": []}, {"body": "I was wondering the same thing.  I started looking into graphene companies.   Applied Graphene Materials seemed interesting.   Financials suck.  Tho whatever company wins that race is gonna really well.", "score": 1, "replies": []}]}, {"body": "Still TSLA by far. Although I frequently buy calls for PTON SQ TWLO SHOP and sometimes LMND DKNG. Waiting for that Stripe IPO", "score": 10, "replies": [{"body": "PTON gives me some of the same feeling of Tesla in the early days. Tons of naysayers yet a great physical product with a cult following. Bought a bunch closer to the start of the lockdowns for ~$25.", "score": 3, "replies": []}]}, {"body": "I wasn't in from the beginning but my cost basis is pretty good and I've ridden the rollercoaster up and down many times where my conviction never waivered.\n\nRight now my new company is [Neoen] (https://www.google.com/search?rlz=1C1GCEB_enUS811US811&sxsrf=ALeKk02DeKNHWNCZq76mAzfGzG2wpsDeYA:1595297616599&q=EPA:+NEOEN&stick=H4sIAAAAAAAAAONgecRowS3w8sc9YSn9SWtOXmPU5OIKzsgvd80rySypFJLmYoOyBKX4uXj10_UNDdNSKgrLUgozeBaxcrkGOFop-Ln6u_oBAL9xOLZKAAAA&sa=X&ved=2ahUKEwiW__3dot3qAhU_hHIEHbalANYQsRUwD3oECBYQAw&biw=1707&bih=803&dpr=1.13). You might know the name as they installed and operate the [Hornsdale Power Reserve] (https://en.wikipedia.org/wiki/Hornsdale_Power_Reserve) which was built with Tesla Powerpacks. They have several other great projects in the works. I think they will be really well suited to take advantage of the transition to wind/solar/electrochemical batteries which I think is one of the best investment opportunities out there right now.", "score": 6, "replies": []}, {"body": "That's no easy, but has a very simple marker :\n\nYou cannot believe how much you would love to HAVE the product that company sells.\n\nIt happened with the PC, with the iPhone, and now with y Tesla.\n\nLook for things you love and put your money there.", "score": 5, "replies": []}, {"body": "BYND\n\nPut my money in a future I want to live in.", "score": 4, "replies": []}, {"body": "Possibly crypto. Might look at plays in BTC or SQ. Still too early to tell.", "score": 2, "replies": []}, {"body": "TSLA and Cash are the plays for the next 3 years for me. So much room for growth that far exceeds what I believe any other company has.", "score": 2, "replies": []}, {"body": "I’m holding TSLA @ $20 and I like what Cathie Wood is doing. Check out the companies in her Ark funds.", "score": 2, "replies": [{"body": "Or just invest in ARK and let her do the heavy lifting.", "score": 2, "replies": [{"body": "I love the idea of Ark, but her complete misunderstanding of Bitcoin deters me.", "score": 0, "replies": [{"body": ">her complete misunderstanding of Bitcoin deters me\n\nCan you elaborate?", "score": 1, "replies": [{"body": "Every single bitcoin transaction requires more energy (therefore cost) than the last.  It is completely unscaleable and therefore useless as a currency.  Its sole vale relies on people believing it has value.  At least gold is pretty and used in jewelry.", "score": 1, "replies": [{"body": "I have no background in computer science, but I asked a very intelligent comp sci friend about bitcoin, and this is exactly what he said as well. He was pushing another cryptocurrency called Iota.\n\nI believe the both of you, but I still have some questions: I understand the scaling problem, but isn't the fact that each bitcoin transaction requires more energy than the last precisely what gives it its value? If bitcoins cannot be mined without a large donation of energy, this is what gives it its inherent value, right?", "score": 1, "replies": [{"body": "Value as what?  What are you claiming Bitcoin is useful for?  If I understand you correctly, you’re saying bitcoin is so valuable now, because it will become more valuable in the future, even if it’s not used for anything?\n\nOwning a share of Tesla has value because you own a piece of a company on track to generate absolutely massive profits in the future.  A piece of farmland has value because it produces food...\n\nRead up on the Dutch Tulips.  Same reasoning.  People were buying Tulips, because the price was increasing, and so they thought they’d make more money by buying them.", "score": 1, "replies": [{"body": "I am not saying bitcoin is valuable, I am just trying to understand its value, that's all. Think of me as devil's advocate.\n\nMany others believe Bitcoin does hold value as a cryptocurrency, especially because it is the most widely used and the number of [Bitcoin users increase every day](https://www.statista.com/statistics/647374/worldwide-blockchain-wallet-users/). Clearly, its popularity is on an uptrend. As users of BTC increase, demand for BTC also increases. If demand goes up while supply stays relatively steady, price increases. This is simple economics.\n\nIf I am understand you correctly, the amount of energy needed to verify transactions (by mining a bitcoin) is becoming so expensive that eventually miners will stop verifying these transactions? And this is where the issue of scale comes into play?\n\nAlso do you support Iota as a cryptocurrency?", "score": 1, "replies": [{"body": "Yes, that’s basically it.  You understand my position.\n\nThe advantages of Cryptocurrency are great, but I can’t see how bitcoin could ever hit a high enough transaction volume to be useful as a currency.  I don’t believe the entire planet currently generates enough energy. Bitcoin is beyond so wasteful, it is just unbelievable.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "SPCE - Virgin Galactic\n\nCheck out Chamath. Back in the day he was one of the few believers in TSLA.. now he’s a major investor in SPCE.", "score": 1, "replies": []}]}, {"body": "Huh. I hope that guy Palampougioukis refinances his 7 % loan. My investment bank lets me borrow against up to 25 % of my holdings online at a 1 % interest, no questions asked.", "score": 7, "replies": [{"body": "Hey mate. I am the Orestis Palampougioukis guy. The profits mentioned in the article are wrong due to miss-communication with the very nice writer of the article, I have made about 80k profit due to the loan Ingot so far. \n\nI was planning to just pay off the loan overtime, however what you mention sounds interesting. Could you elaborate a bit on your refinancing suggestion? Are you just referring to investing in margin with my brokerage?\n\nThe reason I got the loan from an actual bank (ABN) is that I didn't have enough money to put into a brokerage (IB) and use margin, which would be cheaper. The problem now is that since I have all my money in Tesla stock the brokerage does not allow margin due to the volatility of Tesla.", "score": 2, "replies": [{"body": "Woa, nice to meet you. Basically, if you own around a hundred thousand worth of stock, you should be able to use that to back a cheaper loan. If your current brokerage doesn’t let you do that, shop around. \n\nHonestly, if everyone says no, you might want to sell a bit of your stock to pay off the loan as 7 % interest is quite steep.", "score": 1, "replies": [{"body": "Thanks for the tip mate. However because Tesla is very volatile brokerages seem not willing to allow margin on it. As for seeling stock to pay off the loan, it's not a good move. The interest on the loan is about 6.5% per year on a diminishing amount as I pay it off. Tesla stock will have given at least 4-7x returns on this amount withing the next 3-4 years that I will pay off the loan.", "score": 1, "replies": [{"body": "I owned TSLA on margin with Fidelity.  At the time though, I didn’t realize they could unilaterally change the margin requirements.\n\nI.e. if you owned $100k worth, originally they might let you borrow $100k more to purchase so that you have $200k worth of Tesla stock, with $100k worth of debt.  Also known as 50% equity.  They can just decide to change the rules such that you have to have 75% equity, immediately forcing you to sell $67k with of stock even if it’s at a low point.  In fact in the past month, several financial firms increased the equity requirement just for Tesla stock.", "score": 1, "replies": [{"body": "Yes exactly. I have half my portfolio in Degiro. Degiro says they don't even allow margin while the portfolio is 100% TSLA since it's very volatile. The other half is with  Interactive Brokers, where in general at least 50% margin is allowed, but I have not looked into whether they allow it on my 100% TSLA portfolio.\n\nIf I did go on margin I would go 50% max so that I won't get surprised by having to sell stocks due to unilateral changes like you mentioned.", "score": 1, "replies": [{"body": "I was more conservative at maybe 30% max, but it was very unsettling watching the stock dips in 2018 and 2019.  I even borrowed more to buy more in the dips, but it was quite nerve wracking.\n\nI had about 130% of my net worth in Tesla (and I was no longer working).  I was also borrowing on margin to live on.\n\nI gambled insanely, and have since de-risked myself by a large margin. I am still 75 to 80% Tesla, but I do miss the shares I sold :-)", "score": 1, "replies": [{"body": "Lol, I can imagine how nerve wracking it must have been mate. Glad it worked out well in the end.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Hell yes it has :)", "score": 9, "replies": [{"body": "Congrats!  Now what is your exit plan? I planed to hold for at least 5 years, but 1.5 year in now I’m scared.", "score": 5, "replies": [{"body": "The current plan is to hold until 10k then sell some here and there to diversify into real estate and get some passive income going. This could change if I come up with a better plan.", "score": 11, "replies": []}, {"body": "Tesla was a not so long term hold For me when I initially got it, unlike others in my portfolio like MSFT, NVDA and APPL which I knew were long longs 10 plus years, But a lot has changed in the last 6 years, now I have moved Tesla to a long long term hold 10-12 plus years or I might just keep it till I really “need”  to sell or retire.", "score": 3, "replies": []}]}]}, {"body": "I bought a big portion of shares during February spike at 700 and then at 900. It dropped after to 350. Yeah, the next month or two were so-so for me. Still thinking, what it would be now had I  bought them at 350 instead of 900...", "score": 4, "replies": [{"body": "Yeah buddy,  I bought 35 shares at $880 and then immediately watched it go to 350 twice.... very sad. Held through.", "score": 2, "replies": []}]}, {"body": "... at least they're not spreading 200X option gain instant millionaire stories...  (even if they're really out there)", "score": 5, "replies": [{"body": "I honestly expected to read about that. It’s an even stronger example of quick wealth transfer.", "score": 3, "replies": []}, {"body": "Best I could manage on OTM LEAPS was 61X. 200X seems truly autistic. But I don’t doubt they are out there. But hey, maybe if I hold till expiry I can be 200X retarded too.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I mean 900 is great but early? Early to me is sub 100. I got 200 chairs from 2014 up to 2019.", "score": 16, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I’m not gloating at all. I’m saying “early” is not $900. It’s a great position but anytime someone says early, that ain’t early.", "score": 11, "replies": [{"body": "I got in early when elon paid me $10 to open an x.com account. I just didnt get in big early. 6 years ago a friend strongly urged i take a test drive in the S to pick up some free swag, and i started following more closely. 3 years ago i thought there might be a play in getting a tesla referral code and getting youtubers to promote it. at $200 i decided it was worth getting back in the stock market, which i've avoided since getting wiped out in 2001, that i would buy one share in 2019 and 10 in 2020, and then see if was possible to get 100 in 2021. but i didnt follow through, and ended up with only 1 share in 2020. right now i'm sitting on cash to buy more, but it is out of a level i feel ok at buying in at; similarly the price of leaps went up too far by the time i had my options trading approved. i only just recently heard of this german thing of options on one share at a time; maybe i should look into that more. so i'm more of a fan than an investor.", "score": 1, "replies": [{"body": "**I found links in your comment that were not hyperlinked:**\n\n* [x.com](https://x.com)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20fyqjqtp&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3", "score": 1, "replies": []}, {"body": "Can u send me link to that german site, please?", "score": 1, "replies": [{"body": "i read about it here, in the daily thread, a few days ago but didnt save it and it didnt mention a specific site.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "You’re misunderstanding friend. I’m just saying I’ve been buying shares since 2014 at $200, $900 happened for the first time 4 months ago. That isn’t “early” - that’s all", "score": 5, "replies": []}, {"body": "What", "score": 3, "replies": []}]}]}]}]}, {"body": "That's envy, plain simple hatred on your wisdom.", "score": 1, "replies": []}]}, {"body": "For every man who leveraged his livelihood by taking out a loan to put on a stock and somehow won... there are a thousand men who lost everything to the bank.", "score": 1, "replies": []}, {"body": "Bought my shares for around $26 back in 2012. If only I had a time machine :)", "score": 1, "replies": []}]}
