{"title": "The tech bubble is a gay bear fantasy", "selftext": "Remember back early in 2020, back when people were complaining about some little fires in Australia and the bat flu was this funny chinese meme where people got forcibly locked in their homes? \n\nPeople said tech was a bubble and there was a general sense of \"this is too good to be true\" and the general expectation of some sort of recession. A recession just had to happen, man.\n\nThen the bat flu left the yellow shores of china and there was the cough heard round the world. By mid-march though, tech was back on the menu. And importantly, all that recession fear was gone, because the lockdown proved that tech is here to stay. \n\nCurrent tech is very different from dot com because people and companies actually use (and pay for--or get advertised via) a lot of these products like zoom, slack, office, spotify, uber, google, etc. Lockdown definitively proved it's sorta necessary and not just early adopter bs. So yeah, it makes sense that tech has rallied above pre-covid highs.\n\nHere's the other thing. A lot of people's habits have changed, and habits will take real time to reform and return. I know people who couldn't pour milk in cereal who are now broiling fish and veggies with fucking cumin. I attended a virtual fucking happy hour to network for a job (bat flu got my job). I would have pump-shottied myself in the jaw 6 months ago if I knew that future me would do that kind of faggot bs.\n\nAnyways, I'm coming out as a bull, motherfuckers. I don't think tech is overvalued. Shit is different now, I think Jimmy Buffet and his Omaha steak sauce pensieve was right. Sure, Jpow is printing, but he's really only filling in the relatively small-ish gap created from the bank's pullback on leverage (normally around $20T). Deflation could also be an issue, not just inflation.\n\nMSFT 220c 9/18, NET 40c 8/21, SE 115c 8/21\n\nAlso, I really hate ebay and hope it dies an ugly, fraud-filled death. When I get my portfolio past $50k I'll allow myself to buy some 2022 puts to fuel my hatred.", "id": "hj4tqj", "created_utc": 1593584268.0, "score": 92, "upvote_ratio": 0.85, "num_comments": 92, "comments": [{"body": "[deleted]", "score": 64, "replies": [{"body": "Add Uber and LYFT. You could have a 30 foot bonfire fueled by cash running 24/7 and it would less efficient burning money than those two.", "score": 16, "replies": [{"body": "That might actually literally be true for Uber. Im getting a burn rate around $4,700/minute. Thats probably not a 30 foot bonfire of singles but like you could have a sizeable party with a fire that big lol", "score": 5, "replies": []}]}, {"body": "Twitter? At 20 PE??", "score": 11, "replies": [{"body": "A 20 PE is pretty high for a company that’s not growing", "score": 13, "replies": [{"body": "Right I don’t think Twitter is the best growth play either but to even compare Twitter at 20x earnings and Zoom at 70+ EV/Sales is ridiculous", "score": 4, "replies": [{"body": "Agreed. Not exactly a fair comparison for sure", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Are bots traffic?", "score": 7, "replies": []}]}, {"body": "20 PE is pretty shit for a company that's shrinking and has around 90% of its userbase as bots.", "score": 17, "replies": [{"body": "No. No it’s not", "score": 3, "replies": []}, {"body": "90% fam you’re reaching", "score": 2, "replies": []}]}]}, {"body": "I agree. Seems some are good and some are bad. Do you think some big blow-ups on companies here would tank the rest of tech?\n\nAgree ZM will go down. I hear engineers love FSLY but don't know about long-term viability. I'm not sure about NKLA, think it's mostly a meme. There's so much VC money still flowing. People made so much money off FAANG and they continue to be very thirsty for more.\n\nAs for Twitter, I hope it dies a painful death. Those people live off of Trump but refuse to admit it. Once I realized that censoring donnie's tweets meant more engagement and a bump in ads, it clicked for me. I hope Twitter gets smaller and shriller, and eventually self-immolates in the white hot fury of self-absorbed righteousness that it is.", "score": 4, "replies": [{"body": "NKLA seemed sensible to me until I realized they're doing hydrogen fuel cells instead of lithium batteries. Like they're gonna have to roll out so many goddamn hydrogen fueling stations for people to buy a hydrogen fuel cell car instead of a battery electric car that they can just charge overnight in their garage with literally nothing other than a special cable.\n\nInfrastructure is already a huge problem for TSLA and all they have to do to install superchargers is like get a contract with a power company and a lease on part of a parking lot to throw down some chargybois. The most expensive part is gonna be running high power lines to the site and a special transformer.\n\nNKLA is gonna have to throw down nationwide production, storage, and distribution infrastructure for like ultra-volatile explosive hydrogen gas at every truck stop along any route thats gonna handle their trucks. TSLA is gonna need to pay a power company to run high voltage lines to the truckstop (which in like the worst possible case goes to the nearest substation) and to install a transformer.\n\nLike the TSLA hype is fucking insane as is, the NKLA hype is like full blown retard mode", "score": 6, "replies": [{"body": "Exactly. I think that's part of why I'm actually bullish on TSLA, they have demonstrated success in building out nation-wide infrastructure. That matters a lot and is really hard to do.\n\nI remember getting excited about hydrogen cars when BMW came out with one back in like 2003. It's not even new tech. Maybe in another 5-10 years we'll be ready.", "score": 2, "replies": [{"body": "Yeah like hydrogen cars and lithium battery-electric cars with VFD 3-phase motors we're both in research phases in the early 2000's. One of those things is actively ramping up to mass adoption as we speak and the other is still concept art. It just seems crazy to me that people are betting on hydrogen fuel cells in 2020", "score": 2, "replies": []}]}]}]}, {"body": "MAGA will dominate the future too. But garbage like Über won't and Tesla will never justify it's current valuation.", "score": 2, "replies": []}, {"body": "Come on, you can’t equate NKLA with the rest, Zoom is overvalued sure, but Shopify is a good Recession company, same goes with Etsy and Wix. That is because when people lose their jobs, they are forced to become entrepreneurs, selling shit online to make ends meet. I’m personally very bullish on Twitter, more so than FB, simply because ppl actually use Twitter actively to share important information. FB is entertainment, and it gets old fast, Twitter is more of a utility at this point. NKLA is a fucking scam, pretty sure they created their website using Wix or some shit haha.", "score": 1, "replies": []}, {"body": "Amzn is at ~1.5 tril market cap, they are barely making any money, they dilute their stock about 1% / year. Their revenues are significant, but they are not making money on a significant amount of their revenue growth. For every .90 cents of growth they spent a dollar in their e-commerce area. AWS is growing nicely, but that accounts for 20% of their revenue.\n\nGreat company, big fan, just don’t understand how their stock has gotten so expensive. What’s the growth story for them reaching 70 bil year in profit (20 PE) when they might pull 12 bil this year?", "score": 1, "replies": []}]}, {"body": "This one time at band camp, I stuck a trumpet in my ass and let these gay bears blow as hard as they could. Let me tell you.", "score": 36, "replies": [{"body": "Analbeads true to username", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 55, "replies": [{"body": "The reasoning seems to be that it’s based on future value, but the thing is the market as a whole will increase once we reach that point, so either tech is always valued at a future point or its value has to come in line with reality.", "score": 24, "replies": [{"body": "[deleted]", "score": 29, "replies": [{"body": "Nowhere near revenue mind you lmaoooo", "score": 28, "replies": [{"body": "Number of employees is listed as 4 on Robinhood", "score": 14, "replies": []}]}, {"body": "Don’t forget, SHOP is valued higher than it could be in 10 years... \n\nIn the corporate world, you’d get laughed at if you pitched an investment that had an NPV with a breakeven more than 10+ years in the future.", "score": 10, "replies": []}, {"body": "Honestly it’s the ones like NKLA that can’t afford to kick the can down the road. Nvidia at least looks to be able to deliver on the ai car chips that are driving it’s valuation, but a lot of these high value future looking stocks will either go sideways  or drop once people pull out for a large gain.", "score": 3, "replies": []}, {"body": "I think that what you’ll see is the stocks starting to trade sideways once we see them reach that value in 5 years. Right now it’s about getting on board, they will be worth that. Only a matter of time. Then they’ll just stay stagnant for a while. You sound like a bear.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lol okay... you’re betting against the digital economy growing & us having even more tech in our lives? Good luck.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "WHO DO YOU THINK IS THE MAJORITY OF THE MARKET IS?", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "If you're big money, where else do you put your capital? Say you were an autist risk taker with a $50B hedge looking to make some sick gainz for your saudi pensionaries, what other sectors are looking to do major growth over the next 10 years?", "score": 1, "replies": [{"body": "This right here. TINA. But what about when there is an alternative again? In the long (who knows how long...) term there should be a rotation out of equities into other markets. Right now there’s just no where else for the capital to go.", "score": 2, "replies": []}]}]}, {"body": "The bubble in tech today was Softbank money propping up a lot of useless startups. They're taking losses as that bursts. But the bastions of tech are the biggest forces in the world now. Too big to fail, not going anywhere, soaking up ever more fraction of economic output, basically trusts.", "score": 12, "replies": []}, {"body": "You are wrong, tech is overvalued specially FANG, I know some retards are saying those companies make shit of money and are here to stay. True. But that doesn't mean current valuation is fair, it's  outperforming spy by monster levels. Just one year ago those companies were as strong as now, yet highly correlated with spy price. Don't know when, but tech bubble will pop and it will be ugly", "score": 8, "replies": [{"body": "If you had an index of race horses at the start of the 20th century and as cars appeared and raced horses you would start to include cars into that index, would you be surprised that individual cars outperform the index?", "score": 4, "replies": [{"body": "It's not that simple, they don't grow that fast to justify valuation. Unfortunately, FANG index was only added a few years ago, but since then every time FANG outperformed Spy by a huge margin, there was a crash soon after. That shows how unhealthy the market is, all companies are unreliable except a few that are overbought as safe heaven, that is why I think they are overvalued.. it wasn't sustainable in the past", "score": 6, "replies": [{"body": "I see a lot of people here using the term tech as if it where a homogeneous blob. While both Cisco and Microsoft are tech companies they are as different as companies could be and that holds true for a lot of tech companies. What they do have in common is the use of technology (few actually make technology), but their businesses can differ so much among them that comparing them sometimes seems (too me at least) as apples and oranges. \n\n&#x200B;\n\nTheir valuations may not be based on past performance, but on a possible future. For many people it is hard to evaluate that future (for example you need a couple of PhDs to even come close to understanding some technologies like Machine Learning and even then it might be hard). But if you want to know why tech companies on average do better than traditional companies just take a look at DOW Chemical implementing SAP vs Cisco implementing SAP and you will get an idea why it's safer to bet a tech company will, in the long term, outperform a traditional company.", "score": 3, "replies": [{"body": "If we were in Oct 2019, we would see that both FANG and SPY grew ~30% since Fang index was created in 2017. Today in 2020 SPY is around same valuation (30% more than 2017) BUT FANG is over 100% growth. Now please tell me, what happen between 2019 Oct and now that make people think future valuation for those companies will grow so much to justify 100% growth in the current valuation? It's just insane", "score": 2, "replies": [{"body": "Fear happened. People feel that long term their money is safer with FANG.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Word. People who say this tech is anything like 2000 tech is retarded. I’m all in and bullish on TEC", "score": 22, "replies": [{"body": "Idiots are treating 2020 tech as if it were some monolith and comparing it to 2000 shit stocks like [Pets.com](https://Pets.com). Yea there are some questionable ones out there like Zoom but FANGMAN is here to stay.", "score": 13, "replies": [{"body": "Isn’t it FAGMAN? That’s the other N for", "score": 6, "replies": [{"body": "Agreed it's FAGMAN", "score": 6, "replies": []}, {"body": "Netflix and Nvidia.", "score": 4, "replies": [{"body": "Oh I didn’t know Nvidia was added to it", "score": 6, "replies": [{"body": "I mean it's not like an S&P index, people add what they want. But FANGMAN appears to be the latest popular iteration of FAANG.", "score": 7, "replies": [{"body": "I usually say FAGMAN and include Microsoft (200 3/20)", "score": 16, "replies": [{"body": "FAGMAN teases with the gay bears", "score": 5, "replies": []}]}, {"body": "Microsoft, Apple, Amazon, Adobe, Facebook, Netflix, NVidia, Google with strong considerations to Shopify and Salesforce. I gave up on acronymns for what I just described but colloquially we can call it “FANG+”", "score": 1, "replies": [{"body": "Spotted the salesforce investor", "score": 5, "replies": [{"body": "Future holder. I want a discount.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "missing tesla", "score": 1, "replies": []}]}]}, {"body": "Whole thing about the tech bubble is that it doesn’t matter solely on whether tech is used. If all other sectors lag behind, its chances keep rising. That being said, I’ve got my life savings in tech rn.", "score": 8, "replies": []}, {"body": "Look nobody is saying current Tech is = dotcom bubble. We are aware that these companies are generating crazy cash flows and sitting at a huge pile of cash etc. It's all good.\n\nMy problem with current tech, however is that apart from AMZN, these are not tech companies. Thinking about their business model they are so dependent on ad revenue - their product from a revenue perspective disappears if you remove ads from the equation. Now, I am not saying ads would magically disappear, but who knows, as time goes by, corporations might understand that this crazy money paid out for some stupid ad may not be worth that much..\n\nIf that happens, what's going to happen to the business model of these tech companies.\n\nI think a lot of people can't separate the products they use and love from the profitability of that business model. UBER is the best example. UBER is an amazing product that I love to use, makes my life easy and all great. Problem however, is that the business model is flawed fundamentally and so the company may never be able to make any money in the foreseeable future.", "score": 8, "replies": [{"body": "I wonder if Uber is really just trying to burn cash until automation becomes the norm. Then I think the model works better. Also I read that Uber is starting to be licensed by public transit agencies, which makes a ton of sense to me. Way, way cheaper per ride than some of the other public options.", "score": 1, "replies": []}, {"body": "This is too narrow and wrong. Yes, there are sectors like search and social media that rely on ad revenue. But there are many other tech sectors that rely on different types of revenue streams - cyber security, web services, content delivery networks, enterprise software, financial services, etc. These companies are are growing massively as covid has quickened the digital transformation and made them more necessary.\n\nAlso, UBER and LYFT are shit companies - if you're focusing on the consumer facing tech you're missing the boat.", "score": 1, "replies": [{"body": "Well those companies you mention are peanuts compared to big 5 and that's what I've been trying to allude to. If you look at the weights of ETFs such as TQQQ, majority is these big 5. And of course Aapl is different.\nOn top of this, most of the names that popped up in the last few weeks don't even make profit, which undermines my thesis further. when you have guys like SHOP trading at 60-70x revenue, it is hard to argue there is no overvaluation. This applies to ZMs and some cybersecurity companies. Tech is big, but not every company is worth this much. You have to think from a competitive advantage and moat perspective. And that's what it makes a bubble.", "score": 1, "replies": [{"body": "Yes, FAANG are the biggest companies, but look at the market caps for companies like SHOP, CRM, AKAM, OKTA, SQ, PYPL, CRWD, COUP etc. They're not as big as MSFT and FB but their still fucking huge and growing 30-40% a year. These are big companies with much different business models than you're describing", "score": 1, "replies": [{"body": "Sure but as I said..Growth is the driver of the valuation but it has to be realistic in some sense. When you have SHOP that is trading at 70x revenue multiple, then things start to get absurd.\n70x revenue multiple means you need to DOUBLE your revene for 6 straight years to break-even or 10 years if you grow your revenues 50% each year...", "score": 1, "replies": []}]}]}]}]}, {"body": "Your these is that this time it's different because people use the products and services tech companies offers now. Have you checked out Cisco's stock right before the dotcom bubble burst? They were and are a real company that made products many people use. The problem of the dotcom era wasn't fake companies (although it seems like that was an issue too), the issue was rampant speculation driving the share prices of those companies to levels beyond all reasonable justification. Just look at Zoom's SP vs. Actual revenue and tell me it's reasonable. \n\nI still think the bubble has a ways to go before popping, but I'd have a hedge if I were you.", "score": 6, "replies": []}, {"body": "Ok then sell a collar pussy, this is a normal safe investing to me. All in on tech", "score": 6, "replies": []}, {"body": "Tech valuation are in a bubble in early 2020. They still are. \n\nTell me this, would stock prices have collapsed from a stupid ass pandemic if they weren’t in a bubble? \n\nThe answer is NO, they would not have collapsed as they did in February and March if they were not in a bubble. All it took was a catalyst and pop, valuations collapsed because they had no basis in reality.\n\nWe are in a tech bubble. Many companies being bid up to billions of dollars i.e. DKNG, NKLA have no revenue. \n\nA lot of tech, such as Uber and Lyft, are loss making machines with no path to profitability. Or are so debt ridden, that they are just a ticking time bomb i.e. NFLX. Or companies who picked up bad habits that burned investors in the past are at it again (NVDA 👀)", "score": 12, "replies": [{"body": "What stocks didn't shoot down during the March sell-off? Or are you saying the whole S&P is a bubble? We're all just [bubble bois](https://gfycat.com/activedecimalbedlingtonterrier)?", "score": -1, "replies": [{"body": "The index is in a bubble, yes. Created by the extreme popularity in passive index investing and the Fed’s easy money policies. The thing with bubbles is that they can continue to inflate. \n\nHowever, this time the Fed is providing a lot more leverage so the bubble can re-inflate", "score": 2, "replies": [{"body": "> extreme popularity in passive index investing\n\nDude I mean... by popularity you mean all \"sound\" investment advice from the last 50 years??? lol!! this is wsb not investing", "score": -1, "replies": [{"body": "Indexing controls most of the assets in the market (now over 50%), something Bogle himself warned against multiple times (he believed max index funds should control 20-30% of the market), he even wrote a piece on it in WSJ before he died. Few listened obviously. In Bogle’s view, too much indexing prevents price discovery and defeats the purpose of letting investors do all the pricing work because the index drives everything.\n\nIt’s not exactly a sound investment when the benchmark continues to outperform almost everyone because everyone is buying into funds that mirror each other. That’s a bubble. All the “sound investment” and “beats active 90% of active management” is just marketing. Index providers and index fund managers are all in bed with each other. Because they are now so large, they not only dictate prices, but they also create pricing inefficiencies. This also allows larger stock components of the index continue to grow even larger.", "score": 6, "replies": [{"body": "List your positions, my bet is you're holding gold.", "score": 1, "replies": [{"body": "Too long to list, my long-term strategy is too buy growing small-mid cap companies, for example I’ve owned ETSY and MTCH since 2018, and hold. Index funds have mandates and drop companies when they get too big, an investor owning the stock directly doesn’t have to sell. This is one way you can take advantage of index fund inefficiency. \n\nAnother way to take advantage of the index pricing inefficiency, as I have before, just buy the largest components of the index. They will continue to outperform benchmarks if there is no structural shift in market asset management.\n\nBut I’m still sitting on a lot of cash primarily for options and waiting on another buying opportunity to come up. I’m always looking for another stock that will grow into a large cap", "score": 1, "replies": []}, {"body": "And sold MTCH. Rip", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "The IAC split up and I needed to more margin to exercise some calls I was still holding, so that is why I sold and the people they are putting on their board (Ryan Reynolds wtf?) seem really goddamn strange. I want to see their new business without daddy’s credit card to buy new dating networks... so I’m waiting for their next 10-Q or 10-K before I jump back in. That’s what I’m looking at from a long-term perspective in the business as an investor. I don’t care too much about the stock price if the business is solid, but I don’t like the uncertainty. \n\nI’ll happily jump back in if things are still the same or the split was beneficial, but they haven’t made any acquisitions that will keep money train going once Tinder eventually falls out of favor.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Looks at Cisco and Microsoft's stock from 2000. LOL if we get there it's definitely a bubble.", "score": 4, "replies": [{"body": "Microsoft is worth 4 times what it was during the dotcom bubble, while Cisco is worth about half. That is why these comparisons are dumb.", "score": -1, "replies": [{"body": "Check the share price of the two. Check Intel. Have you ever heard of dilution?", "score": 2, "replies": [{"body": "Have you ever heard of stating your point clearly?", "score": 0, "replies": []}]}]}]}, {"body": "It’s still a bubble, a huge one. Injecting 4 trillion in the market then call it healthy is fucking stupid. Now, some of them was and still a real legitimate businesses but a lot of them are house of fucking cards. What are they fucking selling exactly? Are they really a tech company or disguise as one for funding or capital. ARE THEY FUCKING PROFITABLE?! OR ONE OF THOSE FUCKING “UNICORNS”.\n\nI’m done rambling, now... I’ll see myself out...", "score": 5, "replies": [{"body": "the pandemic is shaping new needs and we just essentially loaned a bunch of money to failing businesses who have no future in this landscape. maybe i dont understand any of this though. or maybe everyone actually believes we'll see a vaccine in our lifetime and life will return to normal, and we'll all be glad CCL made it through the pandemic alive. but i doubt it. looks to me like we just subsidized CCL for a few months or a year before they are forced to claim bankruptcy. you cant continue to prop them up when they have zero value to anyone.", "score": 6, "replies": [{"body": "Your first sentence says it all. The writing was on the wall but Coronavirus made shit abundantly clear: only a handful of sectors are gonna make it out with a limited need to reconfigure. Tech, Healthcare, and Pharma are the big dogs. While there are some companies in other sectors holding their own, the Fed is propping up so much dead weight.", "score": 2, "replies": []}]}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**MSFT**|**$220**|**BUY CALL**|**2020-09-18**|**$4.7**|**$203.51**|**33749**|**1682**\n|**NET**|**$40**|**BUY CALL**|**2020-08-21**|**$3.33**|**$35.95**|**1944**|**845**\n|**SE**|**$115**|**BUY CALL**|**2020-08-21**|**$7.93**|**$107.24**|**394**|**107**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckc2z09rmxqlz0793fwqlipbj) | [Track Record](https://www.pickmojo.com/user/fastnlite/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 2, "replies": []}, {"body": "> there was the cough heard round the world\n\nI am stealing this phrase", "score": 2, "replies": []}, {"body": "There's a tech bubble but that excludes Amazon, Apple and Alphabet. Those companies have so much cash reserves and income they don't know what to do with.   \nTrying to time when those titans will implode is the finance equivalent of trying to time the Yellowstone eruption.", "score": 2, "replies": []}, {"body": "people make the mistake of conflating tech and dotcom.  big mistake, and easy to make, even warren buffet was scared off of tech for a long time because of lack of understanding.", "score": 3, "replies": [{"body": "Yes totally agreed", "score": 1, "replies": []}]}, {"body": "What's considered an overweight portfolio in \"tech\" now will be considered balanced 10 years from now. But keep waiting for doomsday. There are certainly some \"bubble\" stocks but there are shit companies levered up to their eyeballs with horrible P/E in practically  every sector.", "score": 1, "replies": []}, {"body": "this tech is way different from [dot.com](https://dot.com) bubble. its still overvalued though and is now even seen as a safe haven (like a store of value). But it neither has to go down now nor ever. It could just mean lower yield over the next 10 years.", "score": 1, "replies": []}, {"body": "If you think that widespread bankruptcies means tech booms you’re the clown 🤡. They have to have customers and there has to be demand. Those are going to hell in a handbasket", "score": 1, "replies": []}, {"body": "fuk ebay", "score": 1, "replies": []}, {"body": "Ebay is a the worst.", "score": 1, "replies": []}, {"body": "Why are people forgetting we’re pricing in earnings 3 years ahead of us", "score": 1, "replies": []}, {"body": "I don't think Tech is overvalued.  The world has changed, and especially changed rapidly in the wake of Covid.  I think it's the new market to be in.  When will it max out?  Who knows.  I just don't think we're near it yet.", "score": 1, "replies": []}, {"body": "But muh bubbles", "score": 1, "replies": []}, {"body": "Google money milkshake theory. Gay bears want to see stocks go off the deep end, if Amazon is a better bet than every other currency in the world than stonks go up. Tech is just lucky in the sense that Covid 19 pushes people to use it instead of shutting it down.", "score": 0, "replies": []}]}
{"title": "Pfizer stock jumps after it reports positive data in early-stage coronavirus vaccine trial", "selftext": "https://www.cnbc.com/2020/07/01/pfizer-stock-jumps-after-it-reports-positive-data-in-early-stage-coronavirus-vaccine-trial.html\n\nThis turd is finally moving boys!\n\nToo bad all of us are holding massive bags already\n\n9/18 $45c", "id": "hj9yol", "created_utc": 1593609404.0, "score": 185, "upvote_ratio": 0.94, "num_comments": 94, "comments": [{"body": "PFE $38c 7/17 are still trash and fuck whoever posted that original DD I bury that cockaroach", "score": 75, "replies": [{"body": "Yup still down a fuckload.", "score": 21, "replies": []}, {"body": "Bruh same", "score": 9, "replies": []}, {"body": "Ya I paid like 95c for the $37s when this was at $36.5 that are now 0dte. If this bitch doesn’t rocket tomorrow I lose it", "score": 11, "replies": [{"body": "Paid .57 and they’re currently worth .7", "score": 3, "replies": [{"body": "Mine are worth all of .02", "score": 8, "replies": []}]}]}, {"body": "Crazy because he was right...but forgot to factor in how massive PFE is and how little the news would move the stock vs something like INO that shot up 40%.", "score": 4, "replies": []}, {"body": "lol i saw that same DD. I mean was a reasonable DD, but timeframe was wrong. Would've been better with the September calls, but then you lose too much from theta.", "score": 1, "replies": []}, {"body": "The DD was alright, at least the fundamentals were right. I wasn’t convinced and just traded stocks instead and got precisely $1 out of it after a week...", "score": 1, "replies": []}, {"body": "Fuck that guy, I was going to jump in too but decided to just buy a ton of shares because I’m still traumatized from being gay bear last 2 months. Still down almost $200.", "score": 1, "replies": []}, {"body": "Got me too.", "score": 1, "replies": []}]}, {"body": "And yesterday I decided to cut my ties with this bag, but it just keeps pulling me back in", "score": 68, "replies": [{"body": "My 7/17 $38 calls doubled to .09\n\nNow I’m only down $4000", "score": 81, "replies": [{"body": "Makes me feel better, also holding 7/17 $38. I have little hope now, but praying for a miracle still.", "score": 10, "replies": []}, {"body": "I'm only 80% down on my 7/17 $38C.", "score": 5, "replies": []}, {"body": "I'm still holding on hope with mine too lmao", "score": 3, "replies": []}]}, {"body": "You're not alone. I bailed yesterday. Fuck me sideways.", "score": 1, "replies": []}]}, {"body": "So my 9/18 $35 calls I've held for a week at $.73 for funsies....are going to print?", "score": 27, "replies": [{"body": "define print", "score": 13, "replies": [{"body": "brrr", "score": 13, "replies": []}]}, {"body": "that's what i'm hoping", "score": 3, "replies": [{"body": "I sold at open for 120%, I'm not holding anything long-term in this retard market", "score": 4, "replies": []}]}, {"body": "They have printed!", "score": 4, "replies": [{"body": "case is closed!", "score": 2, "replies": []}]}]}, {"body": "Imagine trading options on a stock that is at the same price it was in 2004", "score": 15, "replies": [{"body": "4% boost from the vaccine! haha", "score": 5, "replies": []}]}, {"body": "Does this mean my PFE 7/17 38 and 40 calls are coming to life?", "score": 26, "replies": [{"body": "[deleted]", "score": 35, "replies": [{"body": "Hate to agree", "score": 15, "replies": []}, {"body": "You called it", "score": 2, "replies": []}, {"body": "hooray im gonna be poor", "score": 1, "replies": []}]}, {"body": "A man could dream", "score": 2, "replies": []}]}, {"body": "I got $35C expiring July 10th on June 26th for .10 a pop, so I grabbed 9. I feel like that should pay off. I'll probably cut out of 50% of the position and hold till next week.", "score": 8, "replies": []}, {"body": "Fly me to the moooooon\nLet me play among the starssss\nAnd let me see what spring is like 📈", "score": 7, "replies": [{"body": "\"I wanna talk to Samson! Fly me to the moon like that bitch Alice Kramden\"", "score": 2, "replies": []}]}, {"body": "That bitch should have jumped 3 weeks ago when i had calls and sold for a loss", "score": 5, "replies": []}, {"body": "lol 45 person study, pump pump pump", "score": 5, "replies": []}, {"body": "Swear to god if my JNJ calls get decapitated because of fucking pfizer I’m gonna take a silent ‘p’ all over own face. Fuck", "score": 4, "replies": []}, {"body": "$PFE suffered from severe ED\n\nBut this DD about early VAX R&D just inflated the ticker's PP\n\nThose of us without calls can still get in on $RTRD and $ROPE", "score": 5, "replies": []}, {"body": "Nice to finally see some postive numbers.\n\n93 fucking contracts and a dream...", "score": 4, "replies": [{"body": "Lol how many times did you double down on a dip ? I did 4 times. Still down 25% total return tho but way better then down 70%", "score": 4, "replies": [{"body": "Double down on a dip? Are you fuckin crazy?\n\nWe buy at the top and hold til broke buddy.\n\nLol jk but many many times. Ranging from 36 to 40 strike and fuck all expiration 7/17 to 8/21. Even bought more this morning.\n\nShould have stuck with 8/21 37c's. \n\nThose are doing the best right now. If i had only bought those i could cash out today for a solid profit.\n\nNo big deal tho. I think all 103 contracts were less than 1800. Very little risk compared to what I'll make if PFE moons to 37. \n\nDiamond hands. Let's go.", "score": 4, "replies": []}]}]}, {"body": "Sold off my 7/17 35c for double. Had a 7/17 38c I bought ages ago when it was higher at $77. Hoping to minimize some loss on that but I doubt it.", "score": 3, "replies": []}, {"body": "So do I buy calls or do I pay rent?\n\nI think this will print bigly. 👀", "score": 3, "replies": [{"body": "Literally me rn", "score": 1, "replies": []}]}, {"body": "I hate pfizer so much. I learned to never hold that blood bag filled with bile not even with a pair of low premium carrot stick.", "score": 3, "replies": [{"body": "Currently learning that lesson the hard way.", "score": 4, "replies": []}]}, {"body": "Yep, and it did nothing for my $39 calls haha fuk", "score": 3, "replies": []}, {"body": "Just looked at the paper. These results are actually pretty damn encouraging.\n\nhttps://www.medrxiv.org/content/10.1101/2020.06.30.20142570v1.full.pdf", "score": 3, "replies": [{"body": "It was never about the paper, always about the printer", "score": 3, "replies": [{"body": "Lol if I actually figured out how to make money trading options I'd gold you", "score": 1, "replies": []}]}]}, {"body": "Youve said enough, im in", "score": 2, "replies": []}, {"body": "25 points!?  Fucking MONSTER move \n\nPfuck Pfizer  https://i.imgur.com/s4GCuB7.jpg", "score": 2, "replies": []}, {"body": "Some solid +350% on my PFE $35c 7/17 today", "score": 2, "replies": []}, {"body": "34.5c 7/2  1*0.35\n\nI need PFE to get erect by tmrrw. Even a semi chub will do. I just want some lunch money for tmrrw.", "score": 2, "replies": []}, {"body": "Their solution will be a pill that gives you such a boner you forget about the virus.", "score": 2, "replies": []}, {"body": "My 7/17s are now only down 40%!", "score": 2, "replies": []}, {"body": "4%...UGH..MOVE...MORE?", "score": 2, "replies": []}, {"body": "Feeing extra retarded considering I’ve been bagholding 7/2 40c for like 2 months now", "score": 2, "replies": []}, {"body": "Pfizer, Merck, and all these companies have already said they would NOT profit from a vaccine for Covid 19. Are you people dumb, stupid, or both?", "score": 6, "replies": [{"body": "That was PR for the media. They will make money. That’s what drug companies do.", "score": 30, "replies": []}, {"body": "That’s just not true dude. Pfizer said they would price the vaccine at the same cost as similar vaccines. They also said explicitly that they will profit from the vaccine. Do better research before investing and/or commenting. Get your shit together or get out.", "score": 13, "replies": [{"body": "You people are so dumb it’s hurting my head. Making money (revenue) is not the same as net profit. There’s over 30 companies in an arms race to make a vaccine. Let’s say it takes them 18-24 months to make one, test, release data, and mass produce for BILLIONS. It’s not just going to be a single company. A single company will not on its own be able to scale a vaccine of this magnitude. A lot of these companies have received government funding as a boost to speed up the process and work on a vaccine. That funding will not cover the entire process. It takes a lot of money (m’s to b’s) to work on a vaccine and create one. Funding will run out, and these companies will reach into their wallets (investor money and cash) to reach the finish line. Once all this happens there will be a bidding war where these companies will fight each other for bids and of course these companies will go on a price war with each other lowering the cost of their vaccine to compete. So I don’t think you understand me when I’m telling you a lot of these companies have said the will not make a profit. That doesn’t mean they won’t make money selling a vaccine but companies do things all the time where they lose money but make it elsewhere. These drug companies will continue to PROFIT from their other drugs and streams of revenue. Also, there is a HUGE debate with lawmakers and others wanting this vaccine to be FREE TO EVERYONE. So again. They will NOT profit from a covid vaccine. Ya big dummy.", "score": -7, "replies": [{"body": "Alright so it’s clear you have not done any research on Pfizer and did not listen to anything that their CEO said on his JP Morgan call in June or in his meeting with fauci on Friday.", "score": 5, "replies": [{"body": "PFE isn’t going to do shit. Good luck holding those bags tho", "score": -6, "replies": [{"body": "Here’s two direct quotes from Albert Bourla the CEO - ‘we expect to profit off this vaccine’ and ‘we didn’t take any government funding because we don’t need any government funding’. \n\nBy the way, they’re set up to be able to mass produce millions of vaccine doses by October. They’ll start producing in July before their trials are even over. You really looked at no information and just shit on the stock didn’t you?", "score": 4, "replies": [{"body": "As I said, I’m done with this. Good luck holding your PFE bags. Let me know how that goes 😂", "score": -2, "replies": [{"body": "Went from - ~70% return to -26% today", "score": 1, "replies": [{"body": "Yay it’s up a whopping 6% this week 🤣🙏🏼", "score": -1, "replies": [{"body": "Sounds more  like you're just salty about bagholding PFE when it traded sky high for like $40.\n\nYou only have yourself to blame buddy.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Well Gilead did a nice FU to the American ppl by pricing the pos Remdesevir drug high, while the government subsidized the development.", "score": 4, "replies": []}, {"body": "Moderna already sold their vaccine to Israel. So they are already making money and they don't even have a working product. They will make money one way or another. Governments will be throwing money at them they are not going to refuse.", "score": 2, "replies": [{"body": "Moderna has never even produced a single vaccine or drug lmfao. They just burn through investors millions every year. Moderna hasn’t sold shit it just pumped up with vaccine hype just like the rest of them. As I stated, these biotech and big Pharma companies have been rising the vaccine fomo for a while, I don’t think there’s more room to run. Especially for PFE. Good luck tho", "score": 4, "replies": [{"body": "Ohhh....so it's not that they won't sell for a profit? It's because these companies won't be able to make a vaccine? Lol which one is it? way to move goalposts there, pal.", "score": 1, "replies": [{"body": "You’re obviously retarded so let me spell it out one more time. None of these companies plan to make a profit from a vaccine. So your bags will get heavier. The end.", "score": 0, "replies": [{"body": "I guarantee you they will make a profit. again... Countries will throw money at them. You really think they are going to turn it down? You've ever heard of PR before? It's a PR thing. That's all. You're naive to think these companies are doing this out of the good of their heart...that would be a first ever.", "score": 2, "replies": []}]}]}]}]}, {"body": "Not profiting is bullish", "score": 2, "replies": []}]}, {"body": "Also Mylan approved merger with Pfizer Upjohn unit. Both events and Pfizer cheap stock price will probably lead to analyst upgrades soon.", "score": 1, "replies": []}, {"body": "how early is early?", "score": 1, "replies": []}, {"body": "Wow this news makes me hard, and its not just the Viagra this time", "score": 1, "replies": []}, {"body": "Are yall locking in profits or letting these babies ride", "score": 1, "replies": [{"body": "Til death do us part", "score": 2, "replies": []}]}, {"body": "“Jumps” to not even 1M highs.", "score": 1, "replies": []}, {"body": "They're just gonna stay flat again for a month. Don't try to time this shit stock. Buy shares.", "score": 1, "replies": [{"body": "The shares are moving, but pretty damn slow.", "score": 1, "replies": []}]}, {"body": "My csP at daily rsi 27 were m$$ney", "score": 1, "replies": []}, {"body": "Lol I have 9/18 43c", "score": 1, "replies": []}, {"body": "Lol u/Viromen said they were warp speed for portfolios.", "score": 1, "replies": []}, {"body": "Wow my brother actually has 100x 38C for 7/31 - he didn't sell and said he has mad regrets now. Bought at 13 cents and he's just breaking even after holding for over 2 weeks LOL", "score": 1, "replies": []}, {"body": "Tendie city", "score": 1, "replies": []}, {"body": "Any thoughts on $60 calls for January? .25?? Thinking about grabbing 100.", "score": 1, "replies": []}, {"body": "It's the sloooooooowest mover there is!\n\nI have 10k in 2022 Calls at $37. \n\nEven with a vaccine, they'll probably barely crack it.... lmaaaoooo.", "score": 1, "replies": []}, {"body": "quit shilling this awful boomer stock", "score": 1, "replies": []}, {"body": "Holy fuck, virus vaccine stocks are STUPIDFUCKINGMOONING again premkt\n\nCODX is up like 50%\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/faahp8/daily_discussion_thread_february_27_2020/fiwu9qx/)*", "score": -1, "replies": []}]}
