{"title": "Silver will go to 30+", "selftext": "ATH price of gold, silver follows gold, historic graphs, industrial uses, crashing dollar, massive fear, bubble stock market, etc etc. You guys know the deal. \n\n\nLook, is it possible to make more money YOLO'ing on ERs? Sure. Is it possible to use some kind of gay GitHub scanner to detect 10 standard deviations of gay? Sure.\n\n\nBut why deal with all the stress? All this... it doesn't have to be so painful. Save yourself some grey hairs and understand that while nothing is a sure bet in the market, silver going to 30 and beyond is pretty much a guarantee. You don't have to stay up at night shaking and sweating over whether some dumb purple gimmicky mattress is selling well.\n\nJust take my hand, we'll float up into 1500% gains together, you and I :)\n\nSLV 25c 9/30 SLV 36c 1/15", "id": "i16yhc", "created_utc": 1596199834.0, "score": 166, "upvote_ratio": 0.91, "num_comments": 90, "comments": [{"body": "My SLV calls worth half my portfolio expire worthless today. SLV hits $30 on Monday. You’re welcome.", "score": 124, "replies": [{"body": "We thank you for your service", "score": 34, "replies": []}, {"body": "He sacrificed himself, that others may live.\n\nMay you rest in Valhalla, faggot.", "score": 26, "replies": []}, {"body": "Thanks for your sacrifice then", "score": 7, "replies": []}, {"body": "GUH!", "score": 5, "replies": []}, {"body": "We will erect a statue in your honor.", "score": 3, "replies": [{"body": "I hope it’s out of silver", "score": 3, "replies": [{"body": "Sorry, it will be too valuable by then.", "score": 4, "replies": []}]}]}, {"body": "Leaps on SLV dawg. I just learned this myself.", "score": 3, "replies": []}, {"body": "If you invest in SLV or GLD buy longer dates calls. This is not a lotto", "score": 3, "replies": [{"body": "Sir, this is a Wendy’s", "score": 4, "replies": []}]}, {"body": "my earliest expiry is 8/21..\n\nCan you just repeatedly buy 15% OTM FDs each week on monday?", "score": 2, "replies": []}, {"body": "Bro why?", "score": 1, "replies": []}, {"body": "Your wife and I would like to thank you for the cuckery", "score": 1, "replies": []}, {"body": "That was me on July 17th...  \n\nRolled the other half into GLD calls, then KL calls and ended up in a better place...", "score": 1, "replies": []}, {"body": "Please. Options have been on a \"fuck you\" streak against me for the past 3 weeks. My $30c contract is begging for it.", "score": 1, "replies": []}, {"body": "If it hits 30 on Monday you and your wife’s boyfriend can have dinner on me", "score": 1, "replies": []}, {"body": "the reddit silver award lmao", "score": 1, "replies": []}, {"body": "fucking idiot silvers going nowhere", "score": 1, "replies": []}, {"body": "So about $50", "score": 1, "replies": []}]}, {"body": "And I was just thinking how it’s been a few days since we heard from the silver boys", "score": 166, "replies": [{"body": "we're still here...barely hanging on...", "score": 45, "replies": [{"body": "Buy far out expiry instead of getting raped by theta gang. SLV CHADS RISE UP. I've been buying the dips and it feels great knowing I'm making money off of weak ass Parkinson hands .", "score": 20, "replies": [{"body": "My calls were 68 days out but were too far OTM. Did not print :)", "score": 0, "replies": [{"body": "Dawg, silver's been being used as a currency for 4,000+ years and you think 68 days is \"far out expiry\" ? This place is getting to your head...", "score": 11, "replies": [{"body": "Someone just told me that you should only buy puts and calls because this is “wallstreetBETS” and they said it without a hint of irony.", "score": 3, "replies": []}]}]}]}, {"body": "Why is WSB silver gang such a huge bunch of pussies? The price literally doesn’t matter right now. I hope SLV goes to $15 next week so I can buy at a discount.", "score": 38, "replies": [{"body": "Because we weren't smart or financially stable enuf to buy far out DTE calls", "score": 18, "replies": []}]}, {"body": "Don’t worry. It was just profit taking. Next move up coming", "score": 3, "replies": []}]}, {"body": "We have been hiding in r/silvergang\n\nBut today is a good day, so no need to hide.", "score": 3, "replies": []}]}, {"body": "Although I am bullish on metals, its posts like these that make my hands weak.", "score": 33, "replies": [{"body": "People said the same thing about AAPL when it was at 300 two months ago.", "score": 5, "replies": []}, {"body": "I am thinking of buying DXY calls just as a hedge", "score": 5, "replies": []}]}, {"body": "Pre market green and here come the SLV 30 posts.", "score": 52, "replies": [{"body": "Right I’ve been waiting to see silver break $23 for a week can’t even do that", "score": 20, "replies": [{"body": "Most of the gains were in a short sharp incline while the months before it were slow and steady \n\nDon’t know if it will happen again though\n\nPrecious metals are usually for security, hedge against inflation and as a preservation of wealth thing so it’s kinda slow", "score": 3, "replies": [{"body": "Yeah I was watching Silver and Gold for like a year and ended up removing them because the movement was so slow (relative to everything else)", "score": 3, "replies": [{"body": "My hypothesis is gold and silver have an easy 10%, possible 20-30% gain in the next year while the greater market is going to bounce around here for a year.", "score": 3, "replies": [{"body": "Stagflation babbbyyyy", "score": 2, "replies": []}]}]}]}, {"body": "Silver is 24.50 rn.", "score": 1, "replies": []}]}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**SLV**|**$25**|**BUY CALL**|**2020-09-30**|**$0.95**|**$21.76**|**43751**|**0**\n|**SLV**|**$36**|**BUY CALL**|**2021-01-15**|**$0.65**|**$21.76**|**70384**|**0**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckda8i8sjd09o0728dat2z6s1) | [Track Record](https://www.pickmojo.com/user/vegadust/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 7, "replies": []}, {"body": "My hairs are silver not grey sir, I'll have you know", "score": 6, "replies": []}, {"body": "SLV\n\n23c 10/16\n\n25c 11/20\n\n30c 1/15/21\n\nReally hoping to finally not be a loser.\n\nEdit - Im high af and cant figure out how to format this comment or why im typing it in the first place.", "score": 5, "replies": [{"body": "This man is doing it right.  Gotta buy these out a few months.", "score": 3, "replies": [{"body": "I'm holding SLV 23c 1/15/21 and I'm up 48% so far. Gonna let it ride a little while longer too.", "score": 1, "replies": [{"body": "This is me, what's your exit strat?", "score": 1, "replies": [{"body": "Idk try not to get greedy, then get greedy and let it expire worthless probably", "score": 3, "replies": [{"body": "One of us.\n\nEdit: for real though boys give silver a couple months before we sell everything off because we are all pussies. Future should be good for SLV.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thanks for posting after it's gone up. Appreciated!", "score": 3, "replies": []}, {"body": "Tanker gang 2.0, but not as bad..... lol", "score": 3, "replies": []}, {"body": "bruh wtf, i'm here for stress and anxiety 🥴  no one need that garbage safe play life is about yoloing.  📈🚀🚀🚀🚀", "score": 4, "replies": []}, {"body": "as somebody that bought 25c 12/21's when SLV was at $14 and sold sometime around $17, well...fuck me", "score": 2, "replies": []}, {"body": "If you like SLV, you love SILJ", "score": 2, "replies": []}, {"body": "I’m holding SLV 30C Jan 2022 LEAPs from when it was 15. Fun times", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "A bit over 200%", "score": 1, "replies": []}]}]}, {"body": "Why’d you have to personally attack me with that mattress comment 😂", "score": 2, "replies": []}, {"body": "I needed this to stay in it.... holding sept 27c.", "score": 2, "replies": []}, {"body": "No SLV. PRPL is the way.", "score": 3, "replies": [{"body": "Bro I'm with you! Purple is the first color to $40", "score": 6, "replies": [{"body": "I have both. One of them has to work out, right?", "score": 1, "replies": []}]}]}, {"body": "I got those leaps too, i havent seen many people with those tho. Potential for some disgusting tendies", "score": 1, "replies": []}, {"body": "So 25 would take us back to 2012 levels....will be interesting if it does hit that level.", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "I’m with you.  All in gold, silver, platinum, gold miners, and copper miners.", "score": 1, "replies": []}, {"body": "rip", "score": 1, "replies": []}, {"body": "Got ourselves a Bunker Hunt over here...", "score": 1, "replies": []}, {"body": "The gold silver ratio is looking bullish for a little bit. Although the general trend on silver is bullish short term calls are gonna go red so don't buy any otm calls short term yet. Silver to sub $20 by Friday next week.", "score": 1, "replies": []}, {"body": "My SIL calls exp October are 240% up (were 300% up)", "score": 1, "replies": []}, {"body": "what these stupid metals bugs fail to realize is gold was 1800 and silver was 50 back ten years ago. \n\nunless gold is 4-5k and silver $115 i couldn’t care less.", "score": 1, "replies": []}, {"body": "Buy actual silver with your profits, going moon Q3/4 2021", "score": 1, "replies": []}, {"body": " while nothing is a sure bet in the market, silver going to 30 and beyond is pretty much a guarantee. \n\nTalk about contradictory. NOTHING is a sure bet.", "score": -4, "replies": []}, {"body": "Buying silver after it's up 100%+ in a few months?  Yeahh, I'll pass.  OP doesn't understand how a debt-based monetary system works.", "score": -14, "replies": [{"body": "That’s precisely the point dumbass \n\nGold has always been a hedge against inflation or as a preservation of wealth so if silver follows gold, then it goes up\n\n\nNot to mention people have stated silver is massively undervalued right now compare to history", "score": 13, "replies": [{"body": "Why do you believe an inflationary environment is coming?", "score": 0, "replies": [{"body": "oh you know just some trillions that were thrown around recently", "score": 5, "replies": [{"body": "Didn't we do that from 2009-2015? Hasn't Japan been doing it since the 90's? Why no inflation from this?", "score": 0, "replies": [{"body": "You know how much a fucking jap dollar is worth?", "score": 1, "replies": [{"body": "So why is there stock market still down 40% from it's 90's highs? Shouldn't inflation have taken it to new highs because of currency debasement? Hasn't the BOJ even been buying stocks to try and make this happen?", "score": 1, "replies": [{"body": "Because aint nobody buying jap stocks everyone wants Americanos.", "score": 1, "replies": []}]}]}]}]}, {"body": "It's already here.  Stop looking at CPI.  It's bullshit.  PMs are finally going up because of asset inflation.  That's why the equities market is so goddamn high.  No one wants dollars because there's just more of them every goddamn day.  So, you buy something with dollars today that will be worth more dollars tomorrow.", "score": 2, "replies": [{"body": "I mean except for the probability that printing is to DECREASE deflation, as the velocity of money is equally, if not more important.  \n\nSadly, money in the market isn’t spent.  Fed also hedging against future crash, where trillions literally vanish.", "score": 1, "replies": []}, {"body": "Sure, Chapwood Index says inflation has been 5-8% past decade.  So there has definitely been inflation.  But why is it that during a panic people rush to USD as a safe haven?  Why not gold/silver?  \n\nIf it weren't for the Fed stepping in and threatening to literally print UNLIMITED dollars, we would endure a massive deflationary depression.", "score": 1, "replies": []}]}]}, {"body": ">people have stated silver is massively undervalued right now compare to history\n\npeople huh?", "score": 0, "replies": []}]}]}, {"body": "Wishful thinking. We’re at the top", "score": -17, "replies": [{"body": "Ha thanks for the laugh", "score": 17, "replies": []}, {"body": "Have you even seen the last peak? it was $29 in 2011. So we can expect it to at least go 30+", "score": 2, "replies": [{"body": "It actually went to $48 so imagine where it's going now.", "score": 1, "replies": [{"body": "sauce???", "score": 1, "replies": [{"body": "[goldprice.org](https://Goldprice.org), just zoom in on the candlestick chart. It even hit a hair below $50 apparently.", "score": 1, "replies": [{"body": "damn, my bad i was looking at the price history in £", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "Intel calls are a bargain currently", "selftext": "Intel not only consistently beat EPS estimates but they have a PE ratio of 8.55 while AMD has a PE ratio of 111.90. They were significantly beat down because of them delaying the 7nm chips. The market incredibly over reacted even at 50/share and now its trading at 47.10. This will easily come back to 55 dollars a share leaving you with some nice returns on options. \n\nMy recommended options:\n\nINTC $50C 8/28\n\nINTC $50C 9/4\n\nINTC $50C 9/11\n\nINTC $50C 9/18\n\nAlso I suggest holding these options halfway to expiration and then selling so they are still worth something, and if the position doesn't quite work out I would just take the losses that is what I am doing.\n\nEdit: to all the naysayers who love hating on intel here is a solid read for you guys\n\nhttps://www.google.com/amp/s/investorplace.com/2020/07/its-time-to-buy-the-dip-in-intel-stock/amp/\n\nLet’s not forget amd only has 2 percent market share and still FARRRRR behind intel. That’s my 2 cents peace. All be back when all these calls start printing", "id": "i1ayk6", "created_utc": 1596214275.0, "score": 12, "upvote_ratio": 0.65, "num_comments": 92, "comments": [{"body": "I thought they were cheap too a couple days ago and now I'm down 35%....abandon ship.", "score": 54, "replies": []}, {"body": "A dip that never ends dipping.", "score": 31, "replies": []}, {"body": "> This will easily come back to 55 dollars a share leaving you with some nice returns on options.    \n   \n  what i said last friday before i bought 100 expire today worthless.", "score": 15, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "1) cheap. 2) stocks that get kicked have tendency to pop, esp something like intc 3) i had free money from amd to burn", "score": -8, "replies": [{"body": "Lol", "score": 3, "replies": []}]}]}]}, {"body": "They are cheap for a reason.", "score": 11, "replies": [{"body": "The reason doesn’t justify intel’s current price", "score": 2, "replies": [{"body": "says who?", "score": 6, "replies": [{"body": "Says logic and reasoning. All the fundamentals point to a higher price. Also looking at the order book you can see there is a hard $47 resistance", "score": 0, "replies": [{"body": "> All the fundamentals point to a higher price. \n\n\nNo they dont. They are fucked. Their 7nm chips have been delayed and AMD has been selling their 7nm for some time now. Intel is still doing 15nm. AMD is so far ahead of them they are fucked in the long term and are going to continue to bleed out market share.", "score": 9, "replies": [{"body": "Oh no it’ll be 6 months till they have 7nm. Wow it’s the end of the world for intel 😨. Not like they the make much more revenue and profit compared to amd every year. Yeah intel is totally screwed. Gtfo", "score": -8, "replies": [{"body": "What happens as analysts continue to realize ARM is the future and x86's once absolutely dominant position continues to erode? What happens when TSMC gets their Arizona fab up and running and Intel is still left holding their dick? What happens when Intel is forced to sell their fab division by reality for massive losses? What happens when AMD continues to beat them black and blue?", "score": 7, "replies": []}, {"body": "AMD will have their 5nm chips out before intel even begins to roll out their 7nm. They are behind the game. Pretty much all the experts agree. Do some research.", "score": 7, "replies": []}, {"body": "Bobby Swan is in over his head and Lisa Su will be eating his lunch for years. Intel doesn't have a plan and couldn't execute it if they did.", "score": 3, "replies": [{"body": "Lol okay let’s see about that. They’ve been extremely beat down. I’m a trader here, I don’t care that you guys are amd fan boys apparently haha. Anyways intel still is the industry leader as I’ve said, makes more revenue and profit, and they have been beating earning estimated quarter after quarter. And it has a consensus price target of about $70. Go suck AMD’s dick cause clearly y’all like that", "score": -1, "replies": [{"body": "It’s all about growth and INTC won’t grow EPS until 2023 the earliest?  That’s a major headwind for a sector that gives amazing multiples for true growth", "score": 1, "replies": []}]}]}, {"body": "That's not what they said. Earliest launch date 2022 for 7nm. Given that they have been stuck on 14nm since I was a kid you should be sceptical. Intel cancelled all 10nm desktop CPUs. AMD is currently beating Intel on performance on  everything but single core, AMD has 50% of the TDP of Intel, AMD has massively better multi-core performance, Intel took garbage shortcuts to improve performance by introducing vulnerabilities to make it seem like their processors are faster, but it's just shit and every once in a while you get a security patch that reduces performance by 20%. Fuck intel.", "score": 4, "replies": []}, {"body": "I think it has more to do with their architecture.  Like AMD makes cores and then glues the good ones together. Where as Intel produces a wafer and if there is a problem with 1 core it is scrapped . \n\nThere is more to the story.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I was told this for the last week 😅", "score": 13, "replies": []}, {"body": "I never ever bought an AMD cpu or laptop in the past.\nI was randomly browsing the lenovo (NZ) website yesterday and something catched my attention.\n\nThinkpad x13 with intel i5 base price $2500. 256 ssd, 8gb ram.\nThinkpad x13 with AMD base price $1650? 512ssd, 8gb ram. Only other difference was no thunderbolt 3 and no backlit keyboard by default on it.\n\nI tried to find reviews, the AMD version is more than double the performance on the CPU, and the integrated graphics is also about double on AMD.\n\nThe ryzen 4650U is so powerful, the small x13 perform better than the i7 in the x1 extreme gen 2. The ryzen was throttling as well.\n\nLet that sink in. A 15w/25w chip, was outperforming a 45w chip even when it was throttling bad.\n\nJust let that sink in.\n\nThe next threat I see is that microsoft and apple are pushing for ARM adoption.\n\nThe surface pro X can run x86 32bit apps through an emulator. They are probably working on the 64bit emulator too.\n\nOnce apple and microsoft get around the emulator challenge, the paradigm of PC cpu will dramatically change.\n\nIntel is really not in a good position right now.\n\nIn a few more years, I believe there will be more premium laptop built on AMD zen. When that happens, it will be a no brainer to buy the AMD variant.\n\nI would have liked to be able to get an x1 carbon with the ryzen, but this is not happening for at least next gen..\n\nSo I bit the bullet and got myself the x13 instead, it’s 1k cheaper than x1 carbon, slightly smaller, 200g more, but the performance will be adequate for the next 10 years to come..", "score": 6, "replies": []}, {"body": "I've got Intel Calls for next week as thursday its their EX date.\n\nAlso have calls on ABBV as they're oversold as a motherfucker right now and reported good earnings.", "score": 5, "replies": [{"body": "Ex date is not supposed to have selling pressure? No logic is the best logic congrats sir.", "score": 3, "replies": [{"body": "Its fairly common for a stocks price to increase as dividend date approaches, as it creates demand for the stock and, as you mentioned, selling pressure is actually down. So it takes a higher price to move shares, therefore increasing the price if anyone does buy in. With INTC being so oversold I think its a great opportunity.", "score": 5, "replies": []}, {"body": "Ex date attracts buyers in a lot of cases", "score": 3, "replies": []}]}, {"body": "ABBV is such a good hold. I just buy up shares on every dip. I wish it had better option volume.", "score": 2, "replies": [{"body": "Definitely kicking myself for these calls right now. Should have just gone with a share instead tbh.", "score": 1, "replies": []}]}]}, {"body": "Intel is fundamentally fuked. I admire your courage, but there are less risky plays out there.", "score": 10, "replies": []}, {"body": "Intel is a dog shit company", "score": 4, "replies": [{"body": "Ummm not what the balance sheet says 🤔", "score": 0, "replies": [{"body": "Its losing market share rapidly to nvidia and will honestly probably lose to amd as well as sad as that sounds. Its basically like xerox of chips", "score": 2, "replies": [{"body": "https://www.google.com/amp/s/investorplace.com/2020/07/its-time-to-buy-the-dip-in-intel-stock/amp/", "score": 1, "replies": []}]}]}]}, {"body": "Long dated strangles before AMD earnings like I posted recently were the correct play.", "score": 3, "replies": [{"body": "Correct play? AMD soared your strangles would be screwed", "score": 1, "replies": [{"body": "Dude... do you know how strangles work? I recommended Intel 50c and 49p. https://www.reddit.com/r/wallstreetbets/comments/hzfq2k/intel_straddle_time/\n\nOptions on Intel were somewhat cheap at the time and either AMD would smash their earnings or fail. A major shift in AMD would effect Intel.\n\nI made about 15% overnight, so it was a decent fairly low risk play. If I held even longer I would probably be up slightly more now.", "score": 2, "replies": [{"body": "Oh shit you’re right. Strangle not straddle. My fucking brain thought the they were the same for a second.", "score": 0, "replies": [{"body": "Straddles worked too... They are very similar.", "score": 3, "replies": [{"body": "Yeah you’re right.", "score": 2, "replies": []}, {"body": "Iron condor would’ve been screwed", "score": 2, "replies": [{"body": "Uh... yeah, I wasn't advocating an Iron condor. A straddle is basically the exact opposite of an iron condor. An Iron condor is receiving a small premium if the price doesn't much move. A straddle is paying a large premium betting the price will move wildly.", "score": 2, "replies": [{"body": "Yeah I understand, my bad", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Cheap because there is no reason for it going up but it could go 10 down", "score": 5, "replies": [{"body": "This company still makes all the chips that run the world.", "score": 5, "replies": [{"body": "Not for much longer. Their technology is way behind.", "score": 3, "replies": []}]}, {"body": "Why would it go down 10? Going down to 37 a share would be completely unreasonable. Intel is a solid Blue chip stock that has been beat down because of an over reaction. Intel still remains the industry leader and I think it the next few weeks or so it will rebound to anywhere from 53-55 a share.", "score": -1, "replies": [{"body": "If you work in semiconductor then you know “solid blue chip” doesn’t mean shit when everyone is forced to keep pumping smaller, faster and more cost efficient products. If Intel can’t achieve this, then they will lose all market shares to someone who can, in this case, AMD", "score": 3, "replies": [{"body": "Of course intel can do it. What happened this week was an over reaction", "score": -2, "replies": [{"body": "You have a fundamental misunderstanding of how this works. AMD is not a flash in the pan knee jerk reaction they have been cannibalizing market share for 5 years and will continue to do so for the next 3-5 years", "score": 4, "replies": [{"body": "Dude that’s your opinion though. Intel is still the industry leader. That’s a fact, and oh noooo. It’ll take them 6 months to get 7nm. End of the world 😨😨😨", "score": -1, "replies": [{"body": "Hey smart boy.  I last was looking at Intel when it was dicking around between 14 and 21.  That was 2013.  Bad news had just come out; they had to go from tick-tock to node-process-optimization.  Oh no, that was going to push 7nm back - to 2017.  We wouldn't see 5 nm until 2019.  *That* was the time to make the argument that Intel is the industry leader and would weather this little setback.  The argument was made.  That's why the fucking stock isn't still 21 today.  \n\nBut where are the fucking chips?\n\nOh, you know what else?  There was a big void in the mobile chip market at that time.  Ripe for the plucking,   Intel spent something like $50B in capex to develop a mobile processor architecture and the chips to sell it with.  That was going to catalyze their 'recovery'. Meanwhile a little company called ARM sprang up and in the course of monopolizing that market nipped Intel's furry little scrotum off.   Intel recently abandoned their mobile architecture as worthless, a conclusion the world already reached years ago; as far as I know they never sold a single chip to a retail customer.\n\nYou need to understand the history of this fucking thing.  AMD took a little longer to get there than Intel's roadmap, but Intel didn't follow the roadmap at all; instead they drove their car straight off the map and into the ocean.  There is no reason to think they will ever recover.", "score": 2, "replies": [{"body": "Oh yeah not like they make billions more than and every year haha. Totally not 😂", "score": 1, "replies": [{"body": "I'll sell you a call.", "score": 1, "replies": [{"body": "Yep and I’m gladly buying them :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Intel is the ibm of chip makers why the fuck would you invest", "score": 5, "replies": [{"body": "Lemme guess you’re an amd clown", "score": 1, "replies": [{"body": "Na amd is overvalued imo intel has to get its shit together", "score": 1, "replies": [{"body": "Yeah man I’m not saying intel to the moon. I just think the recent sell off ran past the mark. And a rebound to 53 is very likely", "score": 2, "replies": []}]}]}]}, {"body": "I have 7x 55c January 2021 that I’m down 21% on but holding for a trump pump.", "score": 2, "replies": []}, {"body": "Intel is a sinking value trap. Their best process technology is already 5 years out of date and they just bought billions of dollars of 6nm wafers from TSMC while still having to spend money on upkeep and R&D at their fabs that only churn out 22nm and 14nm with good yield and 10nm at shitty yield. \n\nIt will go lower for a while.", "score": 3, "replies": [{"body": "It’s not like they’re the industry leader or anything 😂", "score": 1, "replies": []}]}, {"body": "waiting on intel to fade into irrelevency like ibm before buying some", "score": 3, "replies": []}, {"body": "DONT TELL HIM", "score": 4, "replies": [{"body": "Lol okay just wait buddy", "score": 0, "replies": [{"body": "You sound like you boutta cry homeboy", "score": 1, "replies": [{"body": "Ah and you can interpret exactly how I sound over written communication? You must be superhuman", "score": 1, "replies": []}]}]}]}, {"body": "No man. Wait. I’ve learned my lesson thinking a big gap down after ER would inevitably bounce. It generally doesn’t, at least not soon. It takes weeks for the selling to shake out and price to stabilize. Don’t try to catch this falling knife. If you must buy the dip, give it a couple more weeks.", "score": 3, "replies": []}, {"body": "I'm sure you're used to selling for a loss", "score": 2, "replies": [{"body": "Better than it expiring worthless. I am just saying it as an abandon ship if it doesn't work out", "score": 1, "replies": []}]}, {"body": "lol.  INTC puts all day.  If you follow the industry INTC is rotting from the inside out.", "score": 2, "replies": [{"body": "Yeah I do follow the industry and they really aren’t. Yeah gets those puts and send me the loss porn in a month, okay?", "score": 0, "replies": [{"body": "They absolutely are.  Intel’s advantage has always been due to their ability to do their own manufacturing and customize it for their own processor designs.  Speaking of processor designs, that has never actually been a huge strength of theirs.  They’ve hit on a few over the last 50 years, but they’ve largely been propped up by their vertical integration with manufacturing, which they are now behind the 8-ball on massively.  They may roll out their 10nm for server and PC parts eventually, but the yields are so god damned low, there is no way they are able to make a competitive part at a low enough cost to compete with AMD.  That’s not even to touch on their 7nm shit show, which as of now isn’t even functional.\n\nAssuming they ever do get 7nm to function, it will take them 6 months to a year to get yields to an acceptable level, and then another 2-ish years from that point to amortize the costs.  Even if intel somehow manages to get 7nm working, it would probably be by 2022 earliest, and at that point their cash position and balance sheet will not look nearly as rosy, as they’ll still be in the quagmire amortizing their 10nm shit show.\n\nTheir CFO-turned-CEO will turn some levers in the short term to make their balance sheet look ok, but it’s just a matter of time.\n\nKeep in mind, all of this is contingent upon them managing to fix their highly toxic internal culture and begin fostering innovation.  You don’t have to be a Jedi autist to know this is the case; just look into the numerous leaks regarding the power struggle internally between Raja, Murthy, and Jim Keller, who, by the way, was the best damn thing that could have happened to them and is now gone.\n\nYou are staring at an engineering company devoid of engineering leadership, with a C-staff and BoD who are all pencil-pushers and money managers, a toxic internal culture, and no real understanding of how to get out of the situation they are currently in.", "score": 1, "replies": [{"body": "Intel hasn’t the better profit margins by far. At the end of the day I don’t care whether you or anyone else thinks they’re screwed. Key word there “thinks”. The numbers say completely otherwise. And if you took on my position when I posted this you’d be up 30 percent already which is pretty good on options that have a longer expiry.", "score": 1, "replies": [{"body": "They have the better profit margins by far while they can still convince people to buy their 14nm++++++++++ crap, which their ability to do is rapidly dwindling.  AMD, ARM, and others are going to take their market share, and their profit margins go down by far once they start trying to sell their 10nm products, the cost of which has yet to be amortized.", "score": 1, "replies": [{"body": "Here we go another amd fuckboy. AMD market shares Is no where near intel’s. Y’all in wonder fucking land. And do you not realize intel could just as easily outsource to tsm and get all those chips just as fast. Intel isn’t stupid they will win the long game because they are gonna chose solid profit margins over the instant gratification of have 7nm a year or two earlier 😂.", "score": 1, "replies": [{"body": "Intel cannot just as easily outsource to TSMC because their capacity is limited and is contractually obligated to others already.  The earliest Intel could get into TSMC would be second half of 2021, and even then it would only be a small, limited batch.\n\nNone of this is even considering whether or not TSMC would want to do business with Intel, who could, in theory, go right back to competing with them once they sort out their fab problems (if they ever do)\n\nLastly, Intel’s processor architecture is very tightly coupled with their fabs.  They can’t just take their processor designs and port them over to TSMC at the drop of a hat.  Doesn’t work that way.  Even if they get to that point, they will likely be manufacturing processors that are so technologically inferior to what their competitors are doing because Intel’s processor design and architecture is, once again, not anything special.  Once again, Intel’s advantage has always been their manufacturing and fabrication, it’s tight coupling with their processors, and the higher margins they can generate.  Now that their fabs  are fucked, they aren’t going to take their same bullshit processor to TSMC and get anything that’s even remotely competitive.", "score": 1, "replies": [{"body": "Ay man look it at this way. Intel is nearly at its March low. Boomers are always gonna see this is a solid blue chip investment and that’s just a fact. Markets have rallied so far off the March lows, and not only that there is an immense fear of inflation in the markets. Intel is definitely a stock that really only stands to go up from here. Look we’re traders here, you can believe what you want about intel but at the end of the day that’s your speculation and the literal numbers say otherwise. The downside is so much more limited vs the upside intel has", "score": 1, "replies": []}, {"body": "Oh yeah I’m like up 50 percent on my options which is pretty good for the longer expirations I chose.", "score": 1, "replies": [{"body": "Look man, it’s probably my bad for misunderstanding your play.  You wanna do calls for the short term / 1 yr?  That’s probably ok.  Everything I’m talking about is probably in the time frame after that.", "score": 1, "replies": [{"body": "Yeah exactly. I’m not here saying buy and hold intel as a long term investment. Just liking that the price history on intel it’s beyond likely it’ll have a rally that brings it back to a 55/share level. Over the next few weeks and months", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/MillaShows don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**INTC**|**$50**|**BUY CALL**|**2020-08-28**|**$0.59**|**$47.2015**|**2942**|**841**\n|**INTC**|**$50**|**BUY CALL**|**2020-09-04**|**$0.76**|**$47.2015**|**2214**|**416**\n|**INTC**|**$50**|**BUY CALL**|**2020-09-11**|**$0.92**|**$47.2015**|**17**|**7**\n|**INTC**|**$50**|**BUY CALL**|**2020-09-18**|**$1.04**|**$47.2015**|**14937**|**3754**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckdah2vu7gyma0728xb1kmy2j) | [Track Record](https://www.pickmojo.com/user/MillaShows/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "Problem with your PE is that it is TTM and not FTM.", "score": 1, "replies": []}, {"body": "Intel is dying. They're bleeding talent and ARM will continue to advance their position against x86 for the foreseeable future. You're not buying the dip if you do this but rather you're catching a falling knife.", "score": 1, "replies": [{"body": "I mean I agree, but x86 will be the standard for servers for many more years, which still is a decent share of the CPU market", "score": 1, "replies": [{"body": "Don't underestimate how quickly new purchases could change to ARM or PowerPC even on the high performance compute side.", "score": 1, "replies": []}]}]}, {"body": "Their short term outlook doesn’t look good. I read they’re also changing the logo. That’s the kind of groundbreaking ‘innovation’ a CFO as CEO brings to the table.", "score": 1, "replies": [{"body": "Okay, what’s wrong with a updated look. Would show the company is heading for a positive direction", "score": 1, "replies": []}]}, {"body": "I do believe the reaction to INTC was an overreaction, but I am not so sure I would recommend getting straight up calls. Call debit spreads would be better to offset theta and minimize losses, plus I do not believe INTC is going to moon moon. \n\nI am looking to play put credit spreads on INTC. If we see some resistance around $47.5, I may open a 10/16 47.5/45 put credit spread for about $1.06 premium. This gives intel plenty of time to (hopefully) recover or stay flat. This obviously profits from theta as long as INTC stays above $47.5 during the duration, and still has between 9-14 delta between $47-52.", "score": 1, "replies": [{"body": "Yeah that’s sounds like a good strategy, to each their own. That’s definitely a safer plan", "score": 1, "replies": []}]}, {"body": "There is no good news on the horizon for them.  Intel could go sideways for a year or more.  I bought some leaps because they still make money and pay a nice dividend.  Some people and funds will rotate into it.  But it's not going anywhere for a while.  Wasted capital you could use for other plays.", "score": 1, "replies": [{"body": "I mean we will see, I don’t think it’s wasted capital. Intel seems set to rebound to low to mid 50s range next week", "score": 1, "replies": []}]}, {"body": "The article you mention talks about Intel long term. Yeah I think if they get their shit together they can be back. But nothing is going to move them until atleast next ER", "score": 1, "replies": []}]}
{"title": "Apple undervalued by 160 billion?", "selftext": "Did I miss something? Other than idiot Americans throwing stimulus checks into a new iPhone and a 4-1 split, what made this company $160,000,000,000 more valuable in a single day?", "id": "i1f0c2", "created_utc": 1596227599.0, "score": 37, "upvote_ratio": 0.8, "num_comments": 95, "comments": [{"body": "\nAn apple a day keeps the Rona away.", "score": 104, "replies": [{"body": "Solid fucking dd", "score": 13, "replies": []}]}, {"body": "Only 42% above the 200MA. What could go wrong", "score": 42, "replies": [{"body": "amazon is almost as far as well", "score": 6, "replies": []}, {"body": "I don’t know what it’s called... oh yeah, right... rug pull next week for sure.", "score": 5, "replies": [{"body": "Next week for sure\n\n-wsb last 25 weeks", "score": 54, "replies": [{"body": "You have two options.\n\nA. Rug pull next week\n\nB. The USD is worthless", "score": 2, "replies": [{"body": "Maybe mid August. I got the fuck out after that glorious 10% day. Felt like reeling in a 600lbs tuna or something lol.", "score": 2, "replies": [{"body": "You must feel bad today", "score": 1, "replies": [{"body": "Hell no son - I used the money to go into TQQQ and I'm going up a whole lot faster than apple now.", "score": 2, "replies": []}]}]}]}, {"body": "Top", "score": 0, "replies": []}]}, {"body": "No, this runs up to 450-500 before the split", "score": 8, "replies": [{"body": "I believe this, but when do people take profits u think?", "score": 1, "replies": [{"body": "never, it only goes up look at the chart", "score": 1, "replies": []}, {"body": "I’ll probably sell my 400s when it hits 450 or so. But people will take profit along the way depending on their risk level", "score": 1, "replies": []}]}]}, {"body": "Remind me! 1 week", "score": 2, "replies": [{"body": "There is a 2 hour delay fetching comments.\n\nI will be messaging you in 7 days on [**2020-08-07 21:02:36 UTC**](http://www.wolframalpha.com/input/?i=2020-08-07%2021:02:36%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/i1f0c2/apple_undervalued_by_160_billion/fzwugl0/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fi1f0c2%2Fapple_undervalued_by_160_billion%2Ffzwugl0%2F%5D%0A%0ARemindMe%21%202020-08-07%2021%3A02%3A36%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20i1f0c2)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "*👀 Remember to type kminder in the future for reminder to be picked up or your reminder confirmation will be delayed.*\n\n**standardalias** , kminder in **1 week** on [**2020-08-07 21:02:36Z**](https://www.reminddit.com/time?dt=2020-08-07 21:02:36Z&reminder_id=3306d8c747ba4b4eb9df359869a5e0a0&subreddit=wallstreetbets)\n\n> [**r/wallstreetbets: Apple_undervalued_by_160_billion**](/r/wallstreetbets/comments/i1f0c2/apple_undervalued_by_160_billion/fzwugl0/?context=3)\n\n> kminder 1 week\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-08-07T21%3A02%3A36%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Fi1f0c2%2Fapple_undervalued_by_160_billion%2Ffzwugl0%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Set timezone, Delete reminder and comment, and more options here**)](https://www.reminddit.com/time?dt=2020-08-07 21:02:36Z&reminder_id=3306d8c747ba4b4eb9df359869a5e0a0&subreddit=wallstreetbets)\n\n**Protip!** You can use the same reminderbot by email by sending email to bot @ bot.reminddit.com.\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21)", "score": 1, "replies": []}]}, {"body": "I was calling for a rug pull at 275 then went long at 375", "score": 2, "replies": [{"body": "this is the way", "score": 2, "replies": []}, {"body": "Did you get another position?", "score": 1, "replies": []}]}]}]}, {"body": "it was undervalued by $160b so we priced it in and we will keep pricing it in until it goes back to $400 AFTER the split.", "score": 28, "replies": [{"body": "It could hit 500 before the split. Same thing happened back in what...14’? When it was 650+ then did a 7:1. At todays price that’s like a free 4 shares and I think it will do it again by 2022/3", "score": 7, "replies": [{"body": "damn, you're giving me FOMO... fuck it, i'll buy ONE SHARE.", "score": 2, "replies": [{"body": "If you bought 1 share in the 70s you'd have around 200 shares now due to splits lol", "score": 12, "replies": [{"body": "Having the foresight to invest in apple then would be like investing in a Mars rock mining company right now. Who the hell knows.", "score": 9, "replies": [{"body": "Oh I totally agree. Just a fun fact\n\nGot the mars ticker though????", "score": 10, "replies": []}]}, {"body": "Can’t buy shares before you even born, retard", "score": 1, "replies": [{"body": "I said you fuckface not me", "score": 1, "replies": []}, {"body": "Thats where youre wrong, retard.", "score": 1, "replies": [{"body": "Actually, you're right! Just traveled to the past and now I am your dad. Being paper hands is in your genes, son🤗", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Appl is the market now.", "score": 22, "replies": []}, {"body": "[deleted]", "score": 24, "replies": [{"body": "AAPL really kissed my portfolio today, so I want to say thank you to all the retards that are buying their overpriced products during the biggest recession of our time.\n\nSent from an Android device 😁", "score": 33, "replies": [{"body": "I know right? The calls I bought in the morning brought my portfolio back to pre-covid levels!", "score": 6, "replies": []}, {"body": "Apple not only kissed my portfolio today, it’s gave me that 5* sloppy toppy. I’m rolling boomer Buffet style, 31% of my portfolio.", "score": 6, "replies": []}]}]}, {"body": "IPhone12 will be first 5G so the sales will be astronomical. Will upgrade first time since 6s.", "score": 9, "replies": [{"body": "Except people will not buy it because they think 5G transmits coronavirus", "score": 1, "replies": [{"body": "People who believe that can’t afford a new iPhone at launch.", "score": 13, "replies": []}]}]}, {"body": "aapl only goes up", "score": 8, "replies": []}, {"body": "[deleted]", "score": 19, "replies": [{"body": "The big retard energy will last longer than you can remain solvent.", "score": 9, "replies": []}, {"body": "World is a pretty big place. Not all have the rona at the same time. Plus if the boss needs to write blank checks for stay at home equipment what are you gonna buy? Not some cheap ass asus knock-off ipad", "score": 7, "replies": [{"body": ">if the boss needs to write blank checks for stay at home equipment\n\nmore like \"if the boss buys you the cheapest tablet on amazon\"", "score": 2, "replies": [{"body": "Quit your job mate!", "score": 3, "replies": []}]}]}, {"body": "Abso-fucking-lutely", "score": 4, "replies": [{"body": "OK well what's your time frame?", "score": 1, "replies": []}]}, {"body": "Not if you're apple", "score": 2, "replies": []}, {"body": "I agree but There’s still plenty of growth potential in Apple. India and China mainly and they could grow market share. Q1 showed them at 14% vs Samsung’s 21%. They could easily catch up and surpass but I think their main focus is services and wearables as well as lower price point entry models to get people hooked into the ecosystem and then upgrade later from there. Not to mention their margins will probably improve when they start making their own chips.", "score": 2, "replies": []}]}, {"body": "Tesla is so overvalued... cry... Tesla will fall back to 300 in a week...cry...\n\nApple is so overvalued..... cry... Apple will fall at least 20% next week... cry... \n\nHey 🏳️‍🌈bears, go buy some puts and shut the fuck up! \nApple 10/01 200C (After split)", "score": 18, "replies": [{"body": "I could see that number after all the new retail gets in", "score": 4, "replies": []}, {"body": "I like the way this guy thinks", "score": 3, "replies": []}]}, {"body": "Idk but my Amazon didn't go up as bigly and I'm sad", "score": 10, "replies": []}, {"body": "They sold iPhones when nobody thought they would.\n\nIf you watch Fast Money today, you can see all of the panelists wanted nothing to do with Apple. They know it's overvalued, but they also know that the market can keep its price up longer than they can keep their spot on the screen if they talk $#@& about it.", "score": 5, "replies": []}, {"body": "I dunno man. I bought the 2nd Gen SE yesterday, my first phone since their first SE came out. I’m sure many are in the same boat.", "score": 4, "replies": []}, {"body": "Stop thinking too much. Just get in the game to play, or sit on the sidelines.", "score": 10, "replies": []}, {"body": "These big stocks are like safe havens now. We're going to be in a weird twilight zone in the stock market where everything is red in the next year except these behemoths.", "score": 4, "replies": []}, {"body": "Who even knows anymore. It was overvalued at 200.\n\nI see some pretty nasty inflation headed our way.", "score": 6, "replies": []}, {"body": "If you had listened to the earnings call you would've loaded up on AAPL in extended hours, and loaded up on calls at open. \n\nApple's target market has disposable income. Most of those people still have a job, got a check that they didn't need, have kids that need devices to study from home, and have to spend more time at home than ever before. All of this is the perfect scenario for Apple. \n\nAll of the new devices will need apps and services, plus a new stimulus and holidays are coming. Apple will destroy earnings next quarter. Imagine if a vaccine or a treatment are found this year. \n\nI would not bet against Apple, unless we hit more massive unemployment and uncontrollable virus deaths.", "score": 6, "replies": [{"body": "I thought this was priced in with the massive stock gains this year.", "score": 1, "replies": [{"body": "I thought so, but I would say that the \"priced in\" thing is really deceiving. You could use it to confirm your biases. Just look at how stocks react to news and earnings. Not all things are priced in. \n\nI didn't buy Apple prior to earnings because I was expecting a dump and if I was wrong I was willing to let it go. As soon as Amazon and Facebook reported, I jumped in on Apple. Then the earnings call confirmed the trend, and the rest is history. Who knows what would happen next week, but the stimulus checks will certainly help.", "score": 2, "replies": []}]}]}, {"body": "Because the next two quarters alone will have revenue of over 160 billion. Simple economics market looks forward", "score": 2, "replies": []}, {"body": "FOMOs a bitch", "score": 2, "replies": []}, {"body": "I dont use any apple products but it is the greatest brand the world has ever seen. People fucking love apple", "score": 2, "replies": []}, {"body": "Let me put it this way, at the EOD Friday, the market cap reached 1.84 trillion.  AAPL has 4.33 billion outstanding shares.  If you devide 1.84 trillion by 4.33 billion, you get $425, which was the stock price EOD.\n\nEdit: this was meant to be be reply to another comment, but became a general comment instead", "score": 2, "replies": [{"body": "Market cap is what you get when you multiply outstanding shares by share price. Of course the price was $425 EOD. That’s what MADE the market cap 1.84 trillion.", "score": 1, "replies": [{"body": "Exactly, I didn’t mean to make it sound like the market cap is deriving the price.  I was just illustrating the math.", "score": 1, "replies": []}]}]}, {"body": "🌈🐻 alert 🚨!", "score": 3, "replies": []}, {"body": "Thats a lot of fruit.", "score": 2, "replies": []}, {"body": "It’s undervalued at least by 100 billion a day", "score": 2, "replies": []}, {"body": "$415P 8/7 \nGrew too much too fast. Adjusts this week when institutional investors begin to realize gains. \nConfirmed.", "score": 2, "replies": []}, {"body": "Nudes of your mom are only available on the next gen iPhone....", "score": 1, "replies": []}, {"body": "Fast forward to July 2021 when new Apple split stock costs $400 a piece and we bite elbows that we didn’t buy it a year ago at $100 a piece", "score": 1, "replies": [{"body": "Yeah this wont happen.", "score": 0, "replies": [{"body": "RemindMe! 1 year \"Is Apple back at $400?\"", "score": 1, "replies": []}]}]}, {"body": "Not all the shares are being traded. Market cap fluctuates everyday. Nobody spent 160B extra today.", "score": -3, "replies": [{"body": "Do you understand what market cap is?", "score": 6, "replies": [{"body": "To: OP\n\nWhat is your POV on this subject? (Apple)", "score": 2, "replies": []}, {"body": "Its calculated based on daily trading values. Its just a temporary number. Do you understand how that works?", "score": -1, "replies": [{"body": "\"What is Market Capitalization\n\nMarket capitalization refers to the total dollar market value of stock. Commonly referred to as \"market cap,\" it is calculated by multiplying the total number of a company's outstanding shares by the current market price of one share.\"\n\nI think you're retarded", "score": 2, "replies": [{"body": "Yes, by \"current market price of one share\"  which can change every day you fucking idiot. If everyone sold all their shares of apple the market would be near zero because there would be no one to buy.", "score": -1, "replies": [{"body": "/r/Robinhood is ---> way", "score": 1, "replies": [{"body": "Apples volume today is round 90 million. Assume all those are buys. Then 90 mil x 420 is only 38 billion dollars. Is that anywhere near 160 billion? No you fucking amatuer go back to r/investing", "score": -1, "replies": [{"body": "You do realize that ALL Apple shares are now valued at 420 (or w.e. it is now) not just the ones that were traded today???? Are you really that fucking autistic????", "score": 7, "replies": [{"body": "The bar for r/wallstreetbets is really low.\n\nNeed a new paper trading competition", "score": 2, "replies": []}, {"body": "You do realize that for ALL the apple shares to be worth 420 there has to be someone to BUY all those shares all at once at 420. Do you understand the basics of supply and demand? Only 90 Million volumes were traded today  and you can assume those are all buys. APPLE has 860 MILLION outstanding shares. retard", "score": 0, "replies": [{"body": "\"Market cap fluctuates every day\"\n\n*Proceeds to give the most aids ridden argument while having no fucking clue what hes talking about*\n\nAt this point you're either trolling or your mom and dad have the same mom and dad.", "score": 5, "replies": [{"body": "suck my dick you faggot", "score": -1, "replies": [{"body": "No thx, you clearly have aids.  Fucking inbred.", "score": 3, "replies": []}]}]}]}]}, {"body": "I’m afraid you’re wrong.  You multiply all the outstanding shares by the current price.  Not just the daily volume by the current price.", "score": 2, "replies": [{"body": "Im afraid you're a retard.", "score": 0, "replies": [{"body": "Look at what the current market cap for aapl is and try to make sense of it with your method.", "score": 2, "replies": [{"body": "what do you mean?", "score": 1, "replies": []}]}]}]}, {"body": "This is great. I'm getting this before you inevitably delete your comment", "score": 0, "replies": [{"body": "Both y'all need to chill.  Yes, market cap is the total dollar MARKET value of a stock.  However, there is not a 1:1 ratio of market cap to real dollars.  It is the market value.  So, if one day everyone in the World agreed to not trade any shares of Apple except for me and one other dude, I could offer to sell a share for $500, he could buy it, and with a daily volume of 1and a spread of $0-$500 Apple now has a market cap of more than $2tril, but we did not create an extra half a trillion in real money, we created an extra half trillion of implied value.  When the price goes back to normal the next day, that imaginary half a trillion goes away too.\n\nNow kiss and make up you faggautists.", "score": 3, "replies": [{"body": "Good lord, thank you.  I was reading thru this shit pile thinking - wow this sub is actually fucking retarded for real.", "score": 2, "replies": []}]}, {"body": "Big whoosh for my man Antslikecum", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "1000% AAPL $420 fd's bought on the dip today after open", "selftext": "", "id": "i1g2rx", "created_utc": 1596231220.0, "score": 476, "upvote_ratio": 0.96, "num_comments": 97, "comments": [{"body": "Sold too early it looks like ;)\n\nHaha well done!", "score": 131, "replies": [{"body": "I did haha.  It'd be like 3000% if i sold at close", "score": 105, "replies": [{"body": "They closed at 5.50ish", "score": 63, "replies": [{"body": "Holy fuck...", "score": 21, "replies": []}]}, {"body": "I fomo into these right before you sold or during one of the dip to 1.5 or so. Sold them at 1.85 and then at 3.4when I went back in at 1.8 again.\n\nImagine my surprise when they became deep in the fucking money in the last 25 mins.\n\nInsanity. Every OTM AAPL options was a 3-5 bagger starting at that 2:30pm run up into power hour. Almost zero selling pressure.", "score": 10, "replies": []}]}, {"body": "Good job. now imagine you had $ to kill and bought 300 contracts", "score": 19, "replies": [{"body": "Liquidity sucked a bit to be honest. Order book was not very deep at the top ask and bid. Anything over 100 contracts you would have had to scale out slowly— would have worked but probably not a 10 bagger holding all the way to close. I had a hard time getting rid of my last few contracts in the last 10 mins even at intrinsic value.", "score": 25, "replies": [{"body": "Then exercise it yourself.", "score": 14, "replies": []}, {"body": "i definitely noticed the spreads getting wider towards eod", "score": 2, "replies": [{"body": "Interesting for liquidity to be so low for the largest god damend fucking cap in the world. \n\nIsn't it? I thought banks were flush with liquidity rn. Assumed MM were. Liquidity stresses mean something\n\n&#x200B;\n\ni'm also way too idiotic to figure out what that means or how it plays out", "score": 4, "replies": [{"body": "Not a lot of people writing 0DTE options into the power hour— market makers provide liquidity to keep spreads narrow, but the depth of market is low. If you were holding 100 contracts or more going into close and trying to sell, the top bid size might have been 10-20 contracts, with the next bid down 5 contracts or less, and then lower and lower. Last 20 mins of close bid sizes were 1-2 contracts at each price starting at top and moving down. You could never get a good fill for a large block at the top bid b/c you would sink deep down the order book and be 50 cents to a dollar off from where you wanted to exit.", "score": 8, "replies": [{"body": "I was one of those poor tools tossing money in for EOD action with just a few contracts and I noticed it wouldn't fill fast at mid so I had to switch to market order and eat the spread difference and trust Fidelity.\n\nWhat strike and how many contracts we're you in towards EOD?", "score": 3, "replies": []}, {"body": "ahh gotcha", "score": 1, "replies": []}]}]}, {"body": "Yup", "score": 1, "replies": []}]}]}]}, {"body": "Same, sold mines early in morning; Profit is profit though.", "score": 5, "replies": []}]}, {"body": "Do this everyday and you will have a third of a million dollars by the end of the year.", "score": 82, "replies": [{"body": "That's it?  That sounds really easy, how come everyone doesn't do this?", "score": 56, "replies": [{"body": "Easy peasy lemon squeezey, cummy cummy on your tummy.", "score": 42, "replies": [{"body": "Shitty shitty on your titties", "score": 15, "replies": [{"body": "Throw'n up on yo grown ups", "score": 2, "replies": []}]}]}]}]}, {"body": "I too bought the dip at open.  However, I mainly scalp options and don't have the balls to hold throughout the day.  Today was a win, but a missed opportunity for me overall.\n\nCongratulations, by the way!", "score": 35, "replies": [{"body": "A man never went broke taking profits", "score": 19, "replies": [{"body": "I second to this.", "score": 3, "replies": []}]}, {"body": "Thanks bud!  Hey it sounds like you got your hustle down, can't be mad at that!", "score": 9, "replies": []}, {"body": "Stay longer like a man", "score": 2, "replies": [{"body": "Shit, one of these days, hopefully.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "True but the 0dte is pretty 😎", "score": 9, "replies": []}]}, {"body": "Nigga bought 6", "score": 37, "replies": [{"body": "15 would have been better.", "score": 13, "replies": [{"body": "1500*", "score": 13, "replies": [{"body": "150000\\*", "score": 2, "replies": []}]}]}]}, {"body": "Your entry was 16 cents in the AM and you held all the way down to 3 cents in the following hours? Through the sell off over lunch (EST)? I guess a congrats is still in order even though you bag held through a 90 pct loss haha. \n\nI entered during the break out in the afternoon at a cost of 30 cents and sold gradually all the way to close— average fill on exit around 2 bucks. 700 pct.\n\n\nhttps://imgur.com/a/IWP5S7D\n\nEdit; here is the min chart of the 420C. \n\nhttps://imgur.com/a/3QXeg6s", "score": 15, "replies": [{"body": "haha nice job my friend!  \n\nYes, if it wasn't for bagholding, I wouldn't be holding anything at all!", "score": 8, "replies": []}, {"body": "I had the balls in the AM, but in the afternoon I lost my nerve.  TBF it didn't get ITM until there was like 40 mins before close.  \n\nYou win the golden balls award.", "score": 2, "replies": [{"body": "Yeah true ...when I bought it was like 40 delta. Was just thinking I would catch the last part of a break out, but in the first twenty mins I was up 300 pct which is why I sold almost half. Who knew it would fire for that long all the way to close! well done.", "score": 2, "replies": []}, {"body": "Palladium* balls", "score": 2, "replies": []}, {"body": "I sold my $390c at open so dont feel bad my $1300 profit could have been $2500", "score": 1, "replies": [{"body": "Same here", "score": 2, "replies": []}]}]}]}, {"body": "Proof that stonks only go up.", "score": 5, "replies": []}, {"body": "NICE i was hoping someone here did this\n\nwould have been a shame if nobody took advantage of this 10-30x gains\n\ngrats, now imagine if you spent more than a hundred bucks", "score": 5, "replies": [{"body": "I wouldn't spend more than a hundred bucks on lottery tickets.", "score": 1, "replies": [{"body": "I just spent 2 grand on lottery tickets, it's for a good cause though and I could win a car, I dont even drive. idk maybe Im retarded.", "score": 1, "replies": [{"body": "Actual lottery tickets literally have their negative EV printed on the back, so yes. You're wasting your money.", "score": 1, "replies": [{"body": "Ya i know, only reason i buy it every year is because its for charity", "score": 1, "replies": []}]}]}]}]}, {"body": "Ha, congrats, I guess?\n\nNow imagine if you had bought 1000 contracts.", "score": 12, "replies": [{"body": "FUUUUUCK.", "score": 8, "replies": []}, {"body": "I was so close to hitting the send button on 5000 contracts when they were 0.05 at 1:30...", "score": 7, "replies": [{"body": "25k to 2.5M\n\nIts okay there's always next time\n\nWait, no there isn't. You don't place the order next time either.", "score": 23, "replies": [{"body": "Seriously, 99 out of 100 that is a loss.  The risk/reward is terrible.", "score": 13, "replies": [{"body": "99 out of a 100 is still generous, this guy hit a 1 in a million", "score": 5, "replies": []}]}]}, {"body": "shoulda lowered it to 1000 and hit the button", "score": 5, "replies": [{"body": "I will be replaying that moment in my head for a couple of days for sure...congrats on the gains man", "score": 2, "replies": [{"body": "dont kid urself\n\nyou would have sold them at 0.10 and be happy with 100% gains\n\nkappa", "score": 9, "replies": []}]}]}]}]}, {"body": "how did you get a contract at 0.16 today?", "score": 3, "replies": [{"body": "0DTE (same day) options are cheap. Specially when Apple started today at $405 it’s impossible for it to go to $420 same day but it did.", "score": 8, "replies": []}, {"body": "Because at the time it was way OTM, and AAPL hadn't hit that height yet, so it was a long shot, especially right after the morning dip.   I bought it and it expired today.  Do you know what an FD is?", "score": 5, "replies": []}]}, {"body": "Very similar or exact 0dte Friday play with TSLA 3 weeks ago that saw 100-200x", "score": 3, "replies": [{"body": "OMG that was YOU!  So nice, you're the champ bud!", "score": 5, "replies": []}]}, {"body": "THIS, along with many other reasons, makes me want to get out of RH. Wtg!", "score": 2, "replies": [{"body": "You need to swtich to TD, and use ToS.  It's the best.", "score": 6, "replies": [{"body": "i think ill do this. rh is retarded. can you bid/ask something like 0.61 on options on TD? rh only allows either 60 or 65", "score": 1, "replies": [{"body": "YES 100% you can do this.", "score": 2, "replies": []}]}]}]}, {"body": "Made 50% on 410c Aug 28 I bought last week right before the sell off. Also sold too early today. If I had held till end of day it would 130%. Profit is profit though. Good job!", "score": 2, "replies": [{"body": "Yes, I had other AAPL calls that did very handsomely as well, actually I made way more money on those (like 10 times as much money) but I was especially proud of this one move.", "score": 1, "replies": []}]}, {"body": "You’re in the cult aren’t you. This was almost exactly the same entry and exit as Josh", "score": 2, "replies": [{"body": "Hm.  So that's what someone meant when they said cult.  I thought they were just referring to like a generic AAPL cult.  No, I'm not familiar.  What's the youtube channel so I can see what this Josh is all about.", "score": 1, "replies": [{"body": "Dang that’s a weird coincidence. His YouTube channel is called the trading fraternity and he streams the entire day open to close M-F on another channel called Stock Market Live. There’s usually about 6k people watching so you get news fast as fuck if you watch", "score": 3, "replies": [{"body": "sweet, i'm going to check it out.", "score": 2, "replies": []}]}]}]}, {"body": "Congrats and fuck you. Had Aug 7 405cs, sold right now at that bottom at 404 for 7.10. By end of day they were in 20s.. fuck my life.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Damnnnnnn, well done!", "score": 1, "replies": []}, {"body": "Nice work, shoulda bought 50 contracts though for some real tendies", "score": 1, "replies": [{"body": "Easy to say when it's not your money and after it's already in the green", "score": 7, "replies": [{"body": "Just messing with you", "score": 1, "replies": [{"body": "Just FYI that wasn't me (OP) that you replied to.  So yes, I understood you were just messing with me :)", "score": 2, "replies": []}]}]}]}, {"body": "Congrats!", "score": 1, "replies": [{"body": "Thank you Mr. Doughnut.", "score": 2, "replies": []}]}, {"body": "Damn nice work!", "score": 1, "replies": []}, {"body": "Congrats and fuck you", "score": 1, "replies": []}, {"body": "got lucky. I bet on my boyfriend's boyfriend's dick that this won'thappen again.", "score": 1, "replies": []}, {"body": "Nice flex. Well done.", "score": 1, "replies": []}, {"body": "Good job bitch. The 425 we’re going for a penny then jumped to 1.00", "score": 1, "replies": []}, {"body": "The real question is, how far does aapl start/fall on Monday", "score": 1, "replies": [{"body": "if there's any dip at all, i'm buying september $500 calls.", "score": 1, "replies": []}]}, {"body": "Are you a part of the cult", "score": 1, "replies": []}, {"body": "I bought in at $406 today for a 7/31 $410 call this morning at 1.10 and sold it at 11.20. Only issue was I only bought one contract...", "score": 1, "replies": [{"body": "Nice friend!  Gainz are gainz.  Anything over $1k is nothing to sneeze at!", "score": 2, "replies": []}]}, {"body": "I want be u", "score": 1, "replies": []}, {"body": "Your poor mans investment and great returns makes me feel 3” smaller.", "score": 1, "replies": []}, {"body": "Fuck you\n\n\nAlso congrats", "score": 1, "replies": []}, {"body": "Coulda had 1100% on my spy calls today not diamond hands enough", "score": 0, "replies": []}, {"body": "Legit question here, how can I make Robinhood not sell my options early. For example today I took 40% losses on my spy calls and 30 minutes later at market close they were worth 400%.  I literally feel like I got cucked", "score": 0, "replies": [{"body": "Did you buy them on margin?  Why would Robinhood sell your options so early?", "score": 1, "replies": [{"body": "Because I dont have the money to exercise so it says they sell them ~1 hour before close automatically. I’d like to do it manually or take my chances and sell them closer to eod. Also, I thought you could let them expire and the OCC would exercise them and sell the shares for you and give you the profit or something???", "score": 1, "replies": []}]}]}]}
