{"title": "What's happening in the market...", "selftext": "There is a likely recession occurring that could be mitigated with a soft landing. If there is a recession, it will occur in two parts:\n\n* First phase: The fed indicates rate hikes. Increased rates results in the market demanding a higher return on equities to compensate for the additional risk, which results in a contraction in the overall market P/E ratio. But, while this is happening, the underlying performance (earnings) of equities generally remains strong. Unemployment remains low, consumers continue to spend as they have jobs and money in their pocket, and companies can pass along inflationary impacts to the customer through higher prices. I think we are at the end of this first phase.\n* Second phase: Prices continue to increase to a point where demand begins to slow. As demand slows, companies have a harder time passing along increased costs to their customers. Companies tighten the belt, resulting in layoffs, which increases unemployment (obv) and reduces overall demand. At this time, the underlying performance of equities is impacted and the market falls into a death spiral. Less demand -> less earnings -> layoffs -> less demand, etc. This death spiral is only stopped by the fed stepping in, usually through an injection of cash and lowered interest rates, to spur demand. The bottom of the market is right before this happens.\n\nI think we are at the end of the first phase. The second phase won't start until consumers stop spending. I see a few factors that could contribute to this starting in Q3/Q4 this year:\n\n* Consumers dip into savings this Summer to enjoy the warm weather. They will come out of the Summer with less savings available.\n* Inflation on mandatory goods remains strong and outpaces salary increases. After accounting for mandatory goods, house hold budgets have very little money remaining, and the summer spending blitz extinguishes their savings. The result is less discretionary spending.\n* Freeze on student debt ends in September, further tightening household budgets.\n* Increased mortgage rates further tighten household budgets for any new home buyer. This will have a slower impact on demand but still contributes.\n\nSo, what would have to happen for this not to occur? It all depends on if supply can recover and meet the demand of the market, and how quickly this occurs. If this happens quick enough, the inflation on mandatory goods will stabilize, consumer discretionary spending flatlines or contracts slowly, companies manage costs without large layoffs, the market slows/stalls for a bit but then continues with moderate growth as supply/demand are back in line with each other. This is what the soft landing would look like.\n\nMy best guess is that this soft landing won't be achieved. Due to the Ukraine conflict and COVID lockdown in China, supply is disrupted long enough for us to begin the death spiral. Supply will only recover to meet demand once demand is decimated, and around this time we will see the bottom and the fed intervene.\n\nMarket prediction: Market rallies on the back of strong earnings until \\~3Q of this year. At this time, people will start to talk about FOMO since they missed the bottom. At the same time, consumer demand begins to contract and the death spiral begins. This will result in a strong recession in 2023 and we will see the bottom only when the fed steps in.\n\n&#x200B;\n\nDisclaimer: I'm likely wrong as no one knows what's going to happen.\n\nEdit: Formatting.", "id": "uzurrf", "created_utc": 1653767433.0, "score": 107, "upvote_ratio": 0.77, "num_comments": 103, "comments": [{"body": "You literally just described what’s happened/happening as if it’s some textbook recession playbook to lend credence to your phase two and overall conclusion. \n\nMacro is far too complex and dynamic a system to forecast consistently accurately. Don’t let price action/market sentiment drive your decision making. It’s the classic retail investor mistake and will cost you in the long run.", "score": 111, "replies": [{"body": "I agree with you. But the foundation of his post is valid.\n\nThe key to the market direction, at least since GFC, has been the FED.\n\nThe FED is now anxious to make the \"FED put\" and waiting for any inflationary data improvement to do so betting that inflation has or is about to peak. And the market is pricing in a FED rate hikes pause this September.", "score": 11, "replies": [{"body": "what is the fed put/what does it mean? like a put option?", "score": 1, "replies": []}, {"body": "Except the fed won't put, they want to see a recession.", "score": 1, "replies": [{"body": "Fed is writing a call on the market now, the fed put is over\n\nOr another way to say it is that it’s still writing a put but at a lower strike. Semantics", "score": 3, "replies": []}]}]}, {"body": "So what then? All you're saying it's too complex to know which is almost gatekeeping of finding knowledge.", "score": 0, "replies": [{"body": "Macro is too complex to make accurate predictions of the future consistently, yes. It is counterproductive and potentially harmful to long-term wealth creation. \n\nThe most intelligent investors with decades of experience make inaccurate macro forecasts more often than not. It is a fool’s game. The sooner you learn this, the better off you’ll be.\n\nOk so what is an investor to do then? My advice would be to construct a target asset allocation based on your time horizon, risk tolerance, liquidity needs, return expectations, etc. and stick to it through cycles, rebalancing periodically (I’d suggest quarterly). Take the emotion out of the equation entirely and manage the portfolio systematically with a focus on your long-term goals.", "score": 1, "replies": [{"body": "Should I buy into a chain of bakeries? Can't say anything macro about wheat right? Or moex? Uber since gas prices aren't going to hurt them at all? Imma go all in spy. The economy seems too complex to know so I'm not gonna weigh in all the troubles brewing and just buy because things are going up again. \n\nThere's things to be said dude.", "score": -2, "replies": [{"body": "Good luck.\n\nEdit: To add to this discussion (for others since it appears your mind is made up), you could make the right call on a macro variable and the market may respond the exact opposite to what you expected. \n\nSo to review, to have a positive outcome from a macro call, you have to 1) get the call right, 2) get the call right in the right time frame, 3) the market has to move as you expected, and 4) to reap the full benefits expected, the market has to move in the direction you expected and at the magnitude you expected.\n\nIf you want to play that game, by all means go for it. I’m just telling you the odds of success over any reasonable time frame are low.\n\nEdit2: Last point, OP is not even trying to just forecast 1 variable. He is attempting to forecast 5-10 variables, in a certain order of succession and magnitudes. The odds of him being accurate are slim to none. Like 0.000001% prob if that.", "score": 0, "replies": []}]}]}]}]}, {"body": "> Freeze on student debt ends in September, further tightening household budgets.\n\nI doubt Biden is dumb enough to let that freeze expire 1-2 months before mid-term elections.", "score": 44, "replies": [{"body": "He is supposed to finally make a decision on student loan forgiveness before then..... but he has had ample time to do that so I am not holding my breath.", "score": 14, "replies": [{"body": "I just hope he finally does it since that buys us a lot of votes we need.", "score": -15, "replies": [{"body": "No it doesn't. If he forgives student loans, it's the last straw and I'll go Republican again. It's the only reasonable way he could lose my vote.  There are millions like me.", "score": 1, "replies": [{"body": "Fuck everybody else mentality huh, perfect for a Republican.\n\nHaving the majority of the working population burdened by student debt will be a significant drag for the long term, but fuck them all as long as I get mine.", "score": 2, "replies": [{"body": "Oh stop it. I never \"got mine\". I paid my college bills. You just want free money.  That's all this is. You're making a bunch of excuses, but it all boils down to you wanting money for nothing. Don't act like you have some moral high ground.\n\nYou want student loans forgiven? John the military. Problem solved.", "score": 1, "replies": [{"body": "Which is the exact Republican mindset.\n\n\"I suffered, so everyone else must suffer as well.\"\n\nThe rest of the population understands that the world is a different place than the 70s. You now need an educated work force to compete in the modern, tech-heavy world.\n\n> You want student loans forgiven? John the military. Problem solved.\n\nNever knew it was such a simple solution, fuck off lmfao.", "score": 2, "replies": [{"body": "\"Wah wah wah, why should I pay my own bills just because you paid yours? Give me free money!\"\n\nHere's my offer. We'll forgive $10k of student debt but you have to quit all social media for 6 years. Deal? I mean, you're desperate, right? So easy call?", "score": -1, "replies": [{"body": "By your logic:\n\n\"My kids got murdered because of the lack of gun controls, so your kids should suffer from the same gun policy\".\n\n\"I got infected with COVID because of lack of safety regulations, so everyone else must suffer from the lack of safety regulations\"\n\n\"I went bankrupt because of the lack of health insurance, so no one should be able to get health insurance\"\n\nWe would all end up climbing trees and throwing poop at each other if we hate each others as much as you do.\n\nBtw, my student loans are already paid off.", "score": 1, "replies": [{"body": "Oh horse shit, again. You're trying to pretend like my reason is because I paid my loans. The real reason is a person shouldn't pay their own loans. Doesn't matter what happened to me. You should pay back what you borrowed. Simple as that, you freeloading POS.\n\nNow you're trying the child's tactic,  \"if you loved me, you'd give me free money.\" Doesn't work when my 14 year old tries it, won't work for you either.\n\nQuit the self-righteous act. It is not right, proper, or fair for you to receive money you don't deserve. And you don't deserve it. Stop trying to make your problems other people's problems. Your loans, your responsibility.", "score": -1, "replies": [{"body": "\"if you loved me, you'd give me free money.\"\n\nNo one said this, you did.\n\nMake up whatever stuff to make you feel better I guess", "score": 0, "replies": [{"body": "You're saying it, like a child. I won't give you money for the mall, so you're stomping your feet acting like I hate you. Something about throwing poo, or whatever. Keep trying though, maybe you're just one more childish rant away from convincing me you deserve $10k for doing nothing?\n\nOo, maybe tell me it's my fault you can't get a decent paying job? That's a classic that never gets old. It \"slaps,\" I think you kids say?", "score": -1, "replies": [{"body": "Lol wtf are you even on about.\n\nJust mindless rambling.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": ">No it doesn't. If he forgives student loans, it's the last straw and I'll go Republican again. \n\nLol.  Bye Felicia.", "score": 2, "replies": []}, {"body": "The press secretary said 82% of people support it so it will net us votes. I just haven’t figured out how this will affect the stock market. On one hand that’s more money for kids to buy stocks, but they’ll probably buy stupid meme stocks. On the other, it shakes the faith in contracts and agreements since it trashes the concept of accountability and ethics that makes our entire system work.", "score": 2, "replies": [{"body": "That's the press secretary's job. Take a survey where the question is \"should the government do more to help student debt\" and change that to \"do you support the white house's exact proposal?\" The survey I read yesterday said it's 50/50, with more against it the older and whiter you go.", "score": 3, "replies": []}]}]}]}]}, {"body": "He hasn’t impressed so far… speaking as someone who leans left.", "score": 16, "replies": [{"body": "Left-leaning in the US? Now that's quite the surprise considering the US don't have a relevant left party and the politicians that barely make it to the center-left in the spectrum (basically Bernie, that's about it by european standards) are called names like communist.", "score": 0, "replies": []}, {"body": "I happily voted for Biden but legitimately believe Biden is a figurehead and the Obama infrastructure is running the show. \n\nThat said, Biden has already extended the moratorium multiple times - why would he not do it again?", "score": 1, "replies": [{"body": "That's dumb because you've got it completely the wrong way around.  I don't know how you think a black junior Senator who just happens to be a sexy sweet talker would be pulling the strings on old law and order white man who's been in the game for nearly 50 years... \n\nThis is Joe Biden.  It's what he's always been.  He said it in his campaign.  He preferred to court moderate conservatives than the left wing progressives in his own party.", "score": 2, "replies": []}]}, {"body": "So you lean left but you are impressed from a president that tries to prop up stocks huh. Typical.", "score": -10, "replies": [{"body": "Where did I say that at all?", "score": 5, "replies": [{"body": "You claim he is dumb not to pump up stocks. Lol at the down votes", "score": 0, "replies": []}]}]}]}, {"body": "Do you think fed will change stance and stop raising rates once mid term election comes?", "score": 2, "replies": []}, {"body": "Never overestimate the Democrats.", "score": 0, "replies": []}]}, {"body": "I think since it seems everyone is predicting further rate hikes and a recession next year, we’re likely not getting that. It’s the only thing I’m sure of.", "score": 33, "replies": [{"body": "If a bunch of derp redditors think they know a recession is coming it’s highly unlikely to happen in the way everyone thinks. Recessions never happen the way people think. 2008 was a surprise, COVID was a surprise, the dot com bubble popped without people knowing how to time it. This is the same thing. Everyone is scared because this is the first time stocks don’t just go up all the time hahah", "score": 32, "replies": [{"body": "Spot on", "score": 3, "replies": []}, {"body": "Exactly this. The shit that people already know about isn't necessarily the thing that blows the market up, contributing factors maybe. It's some change out of right field that no one is expecting. Although this could go the other way too if there were less China lockdowns or wars in Ukraine.\n\nMy money is on Biden, Trump, Xi and Putin all come out as furries which ushers in a new global peace accord and the market climbs 20% in one day and 90% by year end.", "score": 7, "replies": []}, {"body": "I mean personal debt levels were highly unsustainable before 08 and my dad and a lot of his trader friends invested heavily in gold right before then. When the repo crisis of 2019 happened both of us were anticipating a market crash even sooner than when it eventually happened. Obviously neither of us were anticipating lockdown and a 35% contraction in GDP that far out but by about a month before as they had established the pandemic committee and Pelosi was offloading equities while telling everyone there wasn’t going to be a lockdown, with what was going on in China, we were concerned that was where we were headed. Honestly corporate debt is enormous, government debt here and abroad is enormous and central bank balance sheets are very bloated plus there’s no ability to ease with high inflation. It all points to all the reasons for stocks rising so precipitously being removed. No more cheap debt for stock buybacks, instead it’s rising cost of debt repayment, no more rapidly printing money, no more rampant credit creation, no more central banks purchasing fucking equities unless it really goes in the shitter. These are all things that happened abundantly and pointed to rising stock prices, now the only thing pointing to any hope of avoiding a colossal fall in equities is low personal debt levels (although rising rapidly) and a healthy labor market. But realistically I think that has more to do with economic outlook than market outlook and stocks falling will lead to loosening in the labor market in all likelihood as companies lose capitalization and their debt loads become relatively more burdensome, particularly in a rising rate environment. I’m no rain man and I was even willing to buy a bit of spy at 390 but I anticipate going a good deal lower than we’ve seen. Feel free to let me know down the road if I was wrong but I feel reasonably confident I’m not.", "score": 6, "replies": []}, {"body": "This down turn was very predictable, probably the most preditactble thing to happen the last few years", "score": 1, "replies": [{"body": "Perhaps, but those who predicted it last September were in cash very early; then there are those who thought the Covid recovery that happened so quickly after the crash was a dead car bounce and stayed in cash; then there are those who thought Sept 2020 was the top…Then there was the almost crash of 2018, 2015, 2010 …\n\nEverybody always knows a recession is coming, because a recession is always coming. Someone is always thinking they’re a genius preparing their portfolio for a recession … and low and behold, a broken clock is right twice a day.", "score": 6, "replies": []}]}, {"body": "So recession will come in surprise? 🤣", "score": 1, "replies": []}, {"body": "I was a kid but I remember the 08 recession pretty well. It was everywhere on the news and everyone was talking about it. Just like now.", "score": 1, "replies": []}, {"body": "Yup.  Embracing the short term pain and buying stocks in the whole time was very profitable.  Gotta buy before the sweet sweet fear runs out.", "score": 1, "replies": []}]}]}, {"body": "Really hope not layoffs. Don’t wanna go through that again", "score": 12, "replies": [{"body": "Lived through it.\n\nYoung folks just getting in will get cut. Unnecessary expense. Old folks that have had one too many raises, high salary, maxed out at their job will get cut. Too expensive. Companies will be destroying families left and right. Six-figured combined income families left with nothing. House, gone. Car, gone. It is going to be a blood bath this time around.\n\nWhat job will help pay the $3,000 rent when the real job is lost. These people are up shit creek.", "score": 14, "replies": [{"body": ">$3,000 rent\n\nI think a home with that rent is really only for the affluent anyways, isn't it? I know wages are all over the place in the US depending on where you live, but $3,000 monthly in a country where the median annual income is $31,000 seems like it's not for the general population at least. I guess for a household it's more affordable, but still, that's $36,000 a year with the median household income being $67,000 or so.", "score": 0, "replies": [{"body": "That's like an average 3br in Los Angeles.", "score": 1, "replies": [{"body": "Oh damn. I mean, I guess it is LA, but still, I did not expect that. I take it property prices in that area are 7 figures?", "score": 1, "replies": [{"body": "For the most part yes and rising. I'm lucky that I bought a place about 4 years ago for 1/2 mil and I'm getting automated offers at $800k+. Market is wild out here.", "score": 2, "replies": []}]}]}, {"body": "3k also quite common in San Fran and NYC for some pretty dilapidated apartments unless you're willing to live with roommates.", "score": 1, "replies": [{"body": "I see. Thanks for clarifying!", "score": 1, "replies": []}]}]}]}]}, {"body": "Next quarter earnings will get more sucks", "score": 6, "replies": []}, {"body": "> Increased mortgage rates further tighten household budgets for any new home buyer. This will have a slower impact on demand but still contributes.\n\nLots of apartments are increasing rent by 30% as well. I hear stories of 2 BR apartments going from $2200 to over $2600 in under a few months. I also hear about how the same ones that were $2600 are now over $3000/month. It's getting to the point a 6 figure salary isn't enough because we're paying $35k/rent a year and apartments still require 3x rent. You'd have to make over $105k in order to pass applications in these places before taxes.", "score": 13, "replies": [{"body": "who rents a 2 bedroom alone?\n\n2 people 2 incomes usually no?", "score": 2, "replies": [{"body": "Lots of people who work from home? Separate work and home life is a very strong way to keep your sanity, especially when you're locked in your own apartment with nothing to do and nowhere to go", "score": 4, "replies": []}]}, {"body": "Rents wouldn’t be raised if no one could afford it. So that just means a lot of people are earning a lot more than before.", "score": 2, "replies": [{"body": "> Rents wouldn’t be raised if no one could afford it.\n\nX to doubt. Lots aren't paying the new rates yet as they haven't gone into effect. People are moving to what is considered \"Low income\" housing even though you have to make $80,000+ to live there and still meet 3x rent standards.\n\nIdk about you but I didn't get a pay increase in the last 6 months. Did you? My neighbors didn't. My parents didn't. My siblings didn't. My uncle, cousin, aunt, grandparents, etc didn't. What do you do if you are on Social Security? You're literally *forced out* of your home because they raised rates a ridiculous percentage with NO reason.", "score": 0, "replies": [{"body": "Dude, landlords are in the business of making money. Vacant apartments are a money pit, so you want to rent it out as soon as possible, because every month it sits empty you lose thousands of dollars.\n\nLet’s take your assumption as the truth then. No one can afford those apartments. So the apartment sits empty and the landlord loses 30k/year, and is happy about that, just to stick it to the plebs right? See how ridiculous that reasoning sounds?\n\nThe reality is that even at 3k a month, there’s someone who’s going to rent it out within the next month, otherwise the landlord would keep decreasing prices until it’s at a fair market price.\n\nAnd yes, I did get a significant pay increase in the past 6 months. Stop looking within your own bubble. Almost everyone in my own social circle got huge pay increases, including my parents and cousins.", "score": 2, "replies": [{"body": "> No one can afford those apartments.\n\nI didn't mean *literally* no one. I don't know how you can reasonably expect that lol. \n\nMy point was, even those who make 1.8x the national median pay/year, they can't afford the *median* apartments in smaller cities and suburbs. \n\nAt this point you either have to make a shit ton or you go off to apartments that haven't been renovated since the 90s and have no security, assigned parking, or amenities. Those are your choices. Be poor and own nothing.\n\nMobile homes in my area are charging almost $800 month for a 1 bedroom.... You're victim blaming if you think the issue is anything other than irrational hikes by landlords for little to no reason.", "score": 1, "replies": [{"body": "How is it irrational if *someone* is clearly renting out these places? Supply meets demand.\n\nNational median pay is less important than local median pay.\n\nAlso, what a joke… you expect a modern luxury apartment with amenities, otherwise you consider that poor. So much entitlement reeking here.", "score": 2, "replies": [{"body": ">  you expect a modern luxury apartment with amenities, otherwise you consider that poor. So much entitlement reeking here.\n\nNo, I don't.\n\nYou're ignoring that the apartments in my area *are just that*. The apartments available in my area. I don't want to live in some place that I'm going to get robbed. I don't want to live in an apartment that is 800 sqft 2 bedrooms. That's not enough for me and my family.\n\nThe problem is, there's no in-between. Either you have all of it, or none of it and the price differences are non-existant. I could go across the street from one place and find another with 3x amenities, security, and a lot of other things for only $150 more. Both are rented to capacity though. \n\nI'm not really sure you get it, so I won't continue this conversation.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I just bought a small 2BR to rent .\nExpected roommates cuz downtown DC .\nBut to my surprise all these young people came with Realtors . This is something new cuz I've been a landlord many years.  A 2BR can go for $3200-3400 but this one was smaller so $2950. \nThe stock market is how I spend my time .", "score": 2, "replies": []}]}, {"body": "A company's stock often rallies after layoffs as it cuts costs and tells investors that actions are being taken to reduce spending.\n\nGotta watch out for reduced ad spending and other downstream cost cutting measures.", "score": 5, "replies": [{"body": "I've seen announcements PYPL and maybe NFLX. \nIt makes me think those companies are in trouble. Not growing.", "score": 1, "replies": []}]}, {"body": "Good summary the low of the year has not been printed yet", "score": 7, "replies": [{"body": "why do you think you know the direction/timing of the market?\n\nwho are you to allude to being a predictive authority on its price action?", "score": 1, "replies": [{"body": "Who said I’m the authority. Just trying to help OP", "score": 1, "replies": [{"body": "“the low of the year hasn’t been printed yet”\n\nthat isn’t a market prediction?", "score": 1, "replies": [{"body": "Yea that’s what I’m seeing based on price and breadth data. Hope helps op.", "score": 1, "replies": [{"body": "that’s what you’re seeing\n\nlmfao\n\nhow can we pin this post to the top of the subreddit for all 2+ million members to see", "score": 1, "replies": [{"body": "Not sure why you’re mad. You can ignore and keep scrolling. Hit some kind of nerve I guess lol", "score": 1, "replies": [{"body": "i’m not\n\nwhat you’re doing is ultra toxic for the community but everybody just upvotes it and gets “fake news”ed by you and you don’t think you did anything wrong\n\ni’m trying to change blistering stupidity like you calling stock market directions from being accepted to frowned upon\n\nkeep thinking u know the direction though\n\nwall street should hire you", "score": 1, "replies": [{"body": "Still not sure why you’re mad and attacking me. You don’t like it move on sir.\n\nNothing toxic about helping people", "score": 1, "replies": [{"body": "you aren’t hurting\n\nyou’re hurting\n\nyou’re making people think you know what’s going to happen and they should follow your advice\n\nwhere’s your track record of being right?\n\nhow much in assets u managing?\n\nlemme guess, under $500k lol", "score": 1, "replies": [{"body": "I’m doing great. Sounds like I hit a nerve. Op can decide what he wants to listen to. \n\nJust move on before embarrassing yourself more", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "What about mid term elections? Do you think this will change fed position? No reigning party wants the stock market to be in the dumps while trying to rally the voters", "score": 3, "replies": []}, {"body": "The FED has printed too much money over the last decade. And then it followed that up by printing way too much money over COVID. It wants the market to have a recession to avoid massive inflation numbers. So they've ~~started~~ will start in June quantities tightening, selling back all those bonds and securities they bought over the last decade to prop up the market. That's why they as individuals \"discovered a conflict of interest\" at the tippy top of the market. And that's why they're letting $2T be parked daily in the RRP.\n\nEdit- Qt dates credit /u/rockwood", "score": 3, "replies": [{"body": "They have not started QT yet to my knowledge.  Do you have a source?  They are just raising rates right now.", "score": 2, "replies": [{"body": "[Source](https://www.reuters.com/business/feds-qt-plan-then-now-2022-04-06/)\n\nYou're correct they said they're going to start in June.", "score": 1, "replies": []}]}]}, {"body": "Imo, as an investor, paying too much attention to macroeconomics is a waste of time. Focus on DCAing into index funds like VOO and SCHD and you’ll make money in both money in both bear and bull markets. If you like picking stocks, focus on companies with good earnings, decent growth, and reasonable valuations and you’ll be good in the long term.", "score": 9, "replies": [{"body": "Or just pull a Joseph Carlson and be fully invested going into 2022... ouch", "score": 4, "replies": [{"body": "Your point being? People have been pulling out of the market every year since the 2009 bottom due to fears of recession. Imagine how many gains those guys lost out on lol. Anyone fully invested in the market, yours truly included, will keep hoovering up stocks on the cheap and be green long before the market reaches its previous ATHs.", "score": 1, "replies": [{"body": "It just depends on your financial flexibility really. People purchasing leveraged equities on margin have the potential to get blown up spectacularly. People who lose their jobs in a potential downturn have the potential to lose out badly by being forced to cash out equities from retirement that they purchased at high prices at a far lower price. It’s smart to buy on the way down for sure, just like it’s smart to buy on the way up but it really just depends on who you are and what you mean by fully invested in the market whether it’s actually a good idea or not. Good luck, I hope it all works out for you!", "score": 1, "replies": [{"body": "Thanks for your comment. By fully invested in the market, I only mean that all my non-emergency cash is in it. I have about 6 months worth of expenses saved up in cash. I want to increase this to 9 months in case of a recession while continuing to DCA in the market, so I’m cutting down on non essential expenses. And I do agree that buying stocks on margin is a recipe for disaster.", "score": 3, "replies": []}]}]}]}]}, {"body": "Well there are some retailers holding some stocks and apparently it’s detrimental to market structure so there’s that…", "score": 2, "replies": []}, {"body": "Very interesting writeup, thank you. My opinion is that it is just too hard to tell what will happen, exactly like in the COVID dip - who knew we will have such quick recovery and rally.\n\nThe approach I am taking is to ignore whats going on - the news, the panic, FOMO, etc - and just wait for prices of my favorite companies to drop to reasonable levels and then buy them. I think this is all we can do.", "score": 2, "replies": []}, {"body": "Agreed. Except for the last bit.\n\nEarnings will continue to drop, both in actual and in forecasts. Q2 ER is not going to be good. Q3 will be flat and we may see some green shoots in Q4 or Q1.\n\nSo far we've had the \"P\" in P/E drop. The earnings haven't dropped significantly yet.\n\nAs you rightly said, this is all dependant on supply and demand. Supply is the war, China and supply chain. Demand is if higher prices will curb the insatiable desire to 'live a little' post covid. \n\nAt the end of the day this is all about debt. Until we bring debt back to nominal levels there will continue to be heightened risk of a recession to make that happen.", "score": 6, "replies": [{"body": "Yup, we’re going to see the earnings drop real soon. Diesel prices alone is 70% higher than last year. Most people think there’s only outbound freight but there’s also inbound freight, for example bringing in goods to manufacture your product. Many customers are fighting tooth and nail to not take a price increase on freight costs alone or fuel surcharges because they can’t pass it on to the customer therefore taking a margin hit on their bottom line. If they do pass it on to the consumer via price increases then sales drop but your overhead is fixed…so what do businesses do? Start laying off staff, consolidating manufacturing facilities, looking for substitutes etc. \nAgreed, Q2 earnings is going to look bad so end of July/August is going to be a shit show.", "score": 4, "replies": []}, {"body": "Kinda weird how both parties talking points are always Russia and China...and Bidens son was caught up in Ukraine.", "score": 1, "replies": []}]}, {"body": "Could take 5 years", "score": 3, "replies": []}, {"body": "Not a shock inflation is uncontrollable the effects are predictable based on history", "score": 1, "replies": []}, {"body": "Supply will come back. The materials and workers are there to produce. China is just playing the same hand it did when COVID first broke. Last time, they shut everything down, this stoked demand to a frenzy, then they came back and were able to charge any price that they wanted. Shut downs also make it more difficult for businesses to leave because they need to get caught up on backorders first. Their people are suffering for it, but the CCP sees sharp short-term pain to grinding long-term soul crushing.", "score": 1, "replies": []}, {"body": "TLDR: Everything that everyone else says when they say “what’s going on / what do you think?”", "score": 1, "replies": []}, {"body": "\"Dip into the savings for summer\"\nWhat savings", "score": 1, "replies": []}, {"body": "Good post. I wonder how well Q2 expectations are priced in now. From what I've read, things slowing down really accelerated in April and May (which makes sense), so Q2 earnings should be affected a lot more than Q1 results, which already weren't stellar. So depending on that, sentiment could change to the downside when Q2 earnings season comes around, assuming we'll even rally until then.\n\nI, for one, expect a turbulent and volatile couple of months in front of us, although I couldn't tell you the overall direction. Realistically I think we haven't seen the lows yet, especially not if there's gonna be a confirmed recession.", "score": 1, "replies": []}, {"body": "I think the COVID lockdowns in China are part of a covert proxy war they are waging on the West.  While we firebrand and hoo-rah over our Russian sanctions, China have placed sanctions on us without anyone noticing.  It will be felt in our wallets though. \n\nThis is consistent with the Mao Zedong/Sun Tzu theory of warfare.  \n\nTrump's foolish alienation of our production center is going to be our undoing.", "score": 1, "replies": []}, {"body": "https://www.indy100.com/viral/stripper-recession-empty-clubs\n\nI can trust them more than the Fed", "score": 1, "replies": []}]}
