{"title": "Shouldn't banks be 20-30% up with interest rates increasing so much?", "selftext": "[deleted]", "id": "uw2yyu", "created_utc": 1653320107.0, "score": 324, "upvote_ratio": 0.91, "num_comments": 93, "comments": [{"body": "Loans have maturities greater than 6 months. If the average maturity of a loan in a banks portfolio is 5 years, a tiny fraction of those loans will have been turned over into higher paying loans in only 6 months.\n\nIn the mean time, banks have to pay higher interest rates to savers *now*. So costs go up first before top line revenue catches up.\n\nAnd before any specialists in the banking industry scream at me, I've grossly oversimplified the situation. For example, some loans are tied to the prime rate adjusted monthly and are already paying higher. Revolving debt also responds more quickly to rising rates.\n\nBut all those complications aside, banks don't instantly turn a higher Fed Rate into bottom line profit. It's takes time. The market may want to see the next quarterly results before making bigger bets.", "score": 244, "replies": [{"body": "Yup.  \n\nDon't forget liabilities are at all time highs for prime brokers as evidenced by overnight reverse repo rates.  Also, rising interest rates and collapsing equities is recipe for defaulting margin loans and bankrupting hedge funds.  Risk has to get priced in.", "score": 82, "replies": [{"body": "What liability comes from overnight reverse repo rate?\n\nGenuinely asking.", "score": 3, "replies": [{"body": "The “Federal Reserve Reverse Repurchase Agreement” REDUCES liabilities.\n\nOverly simplified explanation:\n\nCash is a liability to a bank as it’s owed to the account holder. (It’s not lent out, but it can be collateralized as reserves.  Off-topic.)  Holding too many liabilities overnight, including but not limited to cash, can be problematic for compliance/regulatory reasons.\n\nOne way to reduce liabilities held overnight is to transfer the cash to the fed before end of day, then the fed transfers the cash back every morning just after open.  This way the liability of the cash isn’t on the banks books overnight but they still have the benefit of using the cash for reserves.  This is called a “Reverse Repurchase Agreement” (There’s also Repo Agreements).\n\nMost times this agreement is utilized very little or not at all.  During times of low liquidity and low rates (2008, Covid Crash…) the amount of money transferred back and forth every day can be in the hundreds of billions.  Last fall it crossed over a trillion dollars every day.  Last week we hit 2 trillion every day.", "score": 19, "replies": [{"body": "Then what do you mean “liability at all time high as evidence by overnight reverse repo rate”?", "score": 3, "replies": [{"body": ">Cash is a liability to a bank as it’s owed to the account holder. (It’s not lent out, but it can be collateralized as reserves. Off-topic.) Holding too many liabilities overnight, including but not limited to cash, can be problematic for compliance/regulatory reasons.\n\nExplained in that paragraph.  Cash is a liability.  Banks get that liability off their balance sheet each night using reverse repo. Therefore, when reverse repos are up, it means cash liabilities at banks are up.  Reverse repos at all time highs  = cash liabilities at banks at all time highs.", "score": 6, "replies": []}]}, {"body": "so the amount of reverse repurchase going up means no one is borrowing money from the banks? \nwhat are the short term and long term implications of this?", "score": 2, "replies": [{"body": "I would say it also means that these institutions utilizing overnight repo do not see a better option to invest that cash into.  Compare the interest rate that the Federal Reserve gives for these loans to anything else that cash could go towards and imply what you will from that.  Out of all of the options available, more and more money is getting loaned to the Fed overnight so these institutions either need the money on hand every day for business purposes, or they do not see anything better out there to spend towards.", "score": 1, "replies": [{"body": "makes sense. Thanks!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It’s almost as if there could be a crisis that occurs between savings and loans", "score": 8, "replies": []}, {"body": "I would like to counter and say no, the banks don't have to increase savings. It's all about deposit demand, and not all banks have need of additional funds. They have cash sitting, waiting for loan demand to pick back up to pre pandemic levels. And that's why they aren't as profitable and won't be until credit demand is back", "score": 19, "replies": [{"body": "You misunderstood the point. The bank has to pay interest on the savings people deposit.. all savings, immediately, no matter when they deposited. Loan profitability depends on the when the loan was originated and the underlying interest rate (assuming a fixed loan).. what the top comment doesn’t mention is that variable rate loans are way less common since ‘08. Adjustable/variable rate loans are most common (nowadays) for highly qualified borrowers who are seeking HELOC’s or secondary lines of financing for strategic purposes.", "score": 5, "replies": []}]}, {"body": "Don't forget the trend towards securitization of debt, which means the banks take an upfront fee and then get rid of the mortgages and other loans off their books. They don't carry as many loans on their own balance sheet as they did 10,20,30 years ago.", "score": 3, "replies": []}, {"body": "Also, the entire point of raising rates is to cool off the economy so that means the new high interest loans given out in a smaller quantity.", "score": 10, "replies": [{"body": "Right. It's a race to see how much the financial sector can profit from the initial raise before a recession happens and ruins everyone's day.", "score": 14, "replies": []}]}, {"body": "Has your banked raised your interest rate yet?  Mine hasn’t , might be time for a new bank for me.", "score": 6, "replies": [{"body": "Yes, for CDs and MMFs. Not for \"interest checking\", that never paid more than pocket lint anyway.", "score": 1, "replies": [{"body": "My MMF is still at like .35 that’s garbage 🗑", "score": 1, "replies": []}]}]}, {"body": "I'd say that the nuance you're missing in your analysis is the yield curve steepness.\n\nTo make things simple, a bank gets leverage from client deposits and interbank loans. Some banks have more deposits than others, but their leverage is limited by capital ratios. If a bank has mostly interbank loans for leverage, then it actually is very lightly affected by interest rate fluctuations if it is properly hedged with some swaps or futures, because it's basically an intermediary between the interbank market and credit consumers, its real risk is mainly commercial, in its ability to fill its balance sheet with loans, it gains money from the difference between interbank rates and the rate it lends to its customers. \n\nSuch a bank doesn't really exist, because they all have a certain share of deposits in their liabilities, but it's a spectrum. \n\nOn the other end of the spectrum, a bank with lots of deposits relative to interbank loans is all about managing the duration of these deposits. The added value of the bank is not so much in being able to lend money as much as possible, but in its ability to lend for the longest time possible its deposits without having to refinance a large part of its liquidities. One way to keep client deposits for a long time is to offer decent yields relative to short term rates. \n\nSuch a bank is naturally long on long term rates and short on short term rates. Meaning if the spread between long term and short term yields rises, it will gain in profitability, but if the spread tightens, it will lose profitability. Yield curve inversions are a pretty bad sign for such banks for instance. \n\nSo it's not about top line revenue vs bottom line because the market already prices such things, in my view it's the fact that the market is anticipates the FFR-10y spread to tighten.", "score": 3, "replies": [{"body": "Great explainer, thank you! I had learned about the importance of the yield spread some time ago, but forgot all about it, until your refresher course.", "score": 1, "replies": [{"body": "Glad you liked it. \n\nIf it's worth anything, I'm an accountant / financial controller at a small bank, so I could go on about this for a long time :)", "score": 1, "replies": [{"body": "I bet you could! ;)\n\nSince you offered, can you give a quick explainer about regional vs. national banks differences vs. the yield spread, in the context of the basic framework you already laid out. Like, are regional banks more likely to be retail/commercial deposit heavy while nationals are more inter-bank or institutional?", "score": 1, "replies": [{"body": "Disclaimer : I'm not from the US, but I checked a bunch of balance sheets to make sure I wasn't saying something wrong.\n\nBanks in the US are on average much more deposit heavy than big banks in the EU. \n\nRegional banks in the US are super heavy on deposits, some bigger ones have less than a percent of their liabilities in interbank loans. \n\nNow note that banks are not just about loans, some have well-developed brokerages which both :\n\nA) make money on retail trading volumes which are somewhat sensitive to interest rate volatility\n\nB) make more margin loans when rates are low in absolute and trading volumes are high\n\nWhich means they are even more rate sensitive than their balance sheets would suggest. \n\nDoes it answer your question?\n\nEdit : Now there's also the question retail VS commercial, so yes retail oriented banks have higher duration deposits and loans to clients (mostly mortgages). But I'm not knowledgeable enough to say how this looks like in the US.", "score": 2, "replies": []}]}]}]}]}, {"body": "Don’t banks also have to borrow too? It seems to me this is a larger concern.", "score": 2, "replies": []}, {"body": "> In the mean time, banks have to pay higher interest rates to savers now.\n\nWhere are these banks paying higher interest rates to savers now?", "score": 2, "replies": [{"body": "Have you looked at CD and MMF rates recently? My bank raised both (Citi).\n\nBut if you are only looking at your \"interest checking\", yeah that never paid more than pocket lint anyway.", "score": 1, "replies": []}]}, {"body": "Where are those banks paying higher interest rates?\n\nI'm getting 0.05% on a slug of cash I took out of the market.\nIf I want to tie the money up and pay penalties to get it back, I can make as much as 0.5%.", "score": 2, "replies": [{"body": "SoFi has a 1.25% APY on their savings accounts!", "score": 1, "replies": [{"body": "Stairs has 6% (not FDIC insured tho)", "score": 1, "replies": [{"body": "Then why bother keeping it an account? QYLD had a 12% dividend", "score": 1, "replies": [{"body": "Because it’s guaranteed 6% and it functions as a savings account? I don’t keep my entire emergency fund there, but I’d rather get 6% on half of it than jump through like 20 hoops per month for 1%", "score": 1, "replies": []}]}, {"body": "And it's not a bank. It sells promissory notes, backed only by commercial mortgages. If we go into a recession, they could go broke, taking investor money with them. \n\nI think I'm more comfortable selling stock options. LOL", "score": 1, "replies": []}]}]}, {"body": "CD and MMF rates. You're not going to get anything for \"interest checking\".", "score": 1, "replies": []}]}, {"body": "You have got it almost completely wrong.  Banks’ liabilities are their deposits.  A well managed bank has primarily checking deposits for which the bank pays zero interest.  The bank then uses that free money and invests it in floating rate debt.  As interest rates rise, a bank will receive higher interest payments on its loan book.\n\nBanks should thrive in a rising rate environment.", "score": 1, "replies": []}, {"body": "Also inflation hurts the lender and benefits the borrower in terms of the loan itself.", "score": 1, "replies": []}]}, {"body": "Jun 17 150c will not print. Jun 17 130c if you believe the banks will begin to stabilize and stop declining, but honestly i think this pop will just get shorted like the rest of them were. You can hedge with 120 puts same expiration date. Buy, say 5 calls hedge with 2-3 puts", "score": 46, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "So the banks seemed to have a great day today, we saw JPM for instance go from 117 to a high of 126, but its already at 124.60- healthy movement, and if it continues its uptrend we'll see the 130s soon- and heres the exact problem with OTM options- that 150 call will have increased slightly along with the underlying from 120 to 130, but as the underlying consolidates in the 130 range (it will probably hang around there awhile) that 150 call will then be losing tons of extrinsic value (Time premium. theta) every single day, since your contract has no intrinsic value theres literally nothing cushioning the trade. The 130c, however will have intrinsic value at every price above 130.01, and this is a source of premium to the contract.", "score": 4, "replies": []}]}]}, {"body": "The federal reserve rate is the rate at which banks can borrow, so their borrowing cost goes up.  They lend at a higher rate, which is how they make money.  However, demand for loans is dropping due to this, plus the threat of a slowdown in the overall economy is also bad for lending, as a slowdown of the economy increases risks of defaults and lowers demand for loans.  Also, the federal regulators are likely to require more reserves in preparation for an economic downturn, so banks may not be able to spend any extra money they accumulate.  The time to invest in banks was just before they were receiving free money in an economy with the federal reserve dumping money into stocks, not now when it actually costs them something and there are numerous risks being exposed.", "score": 23, "replies": [{"body": "I always think it's funny when people ask why stocks haven't gone up when a company's REVENUES go up.  McDonald's prices have gone up 8% since last year.  Why has their stock not also gone up by that much???", "score": 9, "replies": []}]}, {"body": "When interest rates go up, the economy slows down because the cost of money increases.\n\nWhen the economy slows down, people and/or businesses may have trouble repaying their loans. Thus, they default. The banks take losses on their loans. If  a bank has too many bad loans, the bank becomes insolvent.", "score": 15, "replies": [{"body": "Reverse repo hitting over $2 trillion says there’s plenty of liquidity, at least.", "score": 2, "replies": []}]}, {"body": "JPM announced that they \"may\" see 17% ROCTE this year \"assuming\" the Fed rate increases to 3% by the end of 2022, and \"if\" the credit environment is \"benign\". (17% ROCTE has been their target for a long while.)\n\nAlthough higher rates do, in theory, help banks (help net interest income), the way in which rates are coming up probably won't. For instance, capital 1 reserve requirements will probably be increased as economic forecasts get worse. A true recession will make things much uglier. It will also be interesting to see investment income on their next few reports, which has probably fallen.\n\nIf it were me, I'd buy bear put spreads for 1-2 weeks from now, not calls. I think this pop is transient.", "score": 13, "replies": []}, {"body": "Another thing people seem to forget is that the big banks hold trillions in swaps and are lenders to hedge funds and market makers.\n\nAs volatility goes up and the value of collateral (stocks and bonds) goes down, these banks are exposed to substantial losses.\n\nSee: Archegos and Credit Suisse\n\nAdditionally, the market troubles and increasing mortgage defaults could spell trouble. This would probably affect the price.", "score": 20, "replies": [{"body": "What increasing mortgage defaults? The seasonally-adjusred delinquency rate decreased from Q4 2021 to Q1 2022. https://fred.stlouisfed.org/series/DRSFRMACBS", "score": 2, "replies": [{"body": "hmmm...I was remembering an article I saw (maybe https://www.marketwatch.com/picks/mortgage-delinquencies-rose-for-the-first-time-in-9-months-heres-what-that-means-for-the-housing-market-01648863070)\n\nBut I also found several articles which say something else so...\n\nEither way the increase (if there is one) won't be seen on the FRED quarterly data yet.", "score": 1, "replies": []}]}]}, {"body": "Buy low, sell high.", "score": 10, "replies": [{"body": "Buy low stay high", "score": 13, "replies": [{"body": "That too. 🖖🏻", "score": 5, "replies": []}]}]}, {"body": "If you can borrow money for low interest, you might take the loan even if you dont really need it, but it could help you.\n\n\nIf interests are high then less people will take out loans. Thats not the only factor of course, but I didnt see anyone comment that. All other comments have really good (better) points too.", "score": 6, "replies": [{"body": ">If interests are high then less people will take out loans.Thats not the only factor of course, but I didnt see anyone comment that.\n\nAmazing way to put that for people that dont get all this.  There are a lot of other factors forsure, but just explaining one of the big ones in that way. solid.", "score": 2, "replies": []}, {"body": "Great example is BRK.  [They sold Japanese bonds at 0.203%](https://www.bloomberg.com/news/articles/2022-01-14/buffett-s-berkshire-hathaway-prices-128-5-billion-yen-of-bonds).  Now BRK certainly doesn't need money and Buffet was clear about that.  But at that low rate, why the hell not?  BRK knows they can easily make more than the interest they are paying on the bonds with that money, making it effectively free money that earns them more money. When rates go up, that proposition becomes harder, then impossible; resulting in less borrowing. At high rates, only the ones who really need the money are borrowing.  BRK wouldn't have sold those bonds if it was at 3%.", "score": 2, "replies": [{"body": "Exactly", "score": 1, "replies": []}]}]}, {"body": "Your thesis is wrong.  Why should banks be money making machines with high interest? If you think that, it means you don’t have a sound understanding of how banks work. \n\nBanks’ profits from Interest  don’t really have anything to do with the rate-  they profit from a spread between what they borrow and what they lend.  As interest rates go up- sure they “charge” more when they lend, but it also costs more for them to borrow the money that they lend. \nIn theory, they should be making roughly as much when lending at 4 or 5% on mortgages with the prime rate at 1%, as they would profit from 6 and 7% mortgages with primes at 3%. (edit - while the profit comes out to the same amount, it actually ends up looking a little worse on the financial statements in the second scenario because the same amount of profit needs a higher amount of revenue. - earning $1 out of every 100 lent , or earning the same $1 out of 103 lent when rates are higher - to just to make up some numbers - but the earnings/revenue is actually very slightly lower with higher rates)\n\nBut that’s just the barebones calculation of the interest rates- to add to that, increased interest rates (especially on the context of inflation) means an increased risk of default from borrowers- that is really bad news for lenders (banks). \n It will be harder for customers to qualify for new loans (so that is a reduction in potential business right there- bad news for banks) and/but those who already have loans are at a greater chance of being incapable of repaying their obligation (more bad news for banks).\n\nOver all though, it seems like higher rates and inflation mean only a slight negative for banks (but a much smaller negative than for most other industries) so at the end of the day financials will end up doing quite well relatively speaking.   not because higher rates mean more profit- but because higher rates don’t have too much of an impact at all (except as described above) allowing business to continue more or less as usual.\n\nWith everything in that context, I find it hard to believe you’ve “been following banking stocks”. - watching their prices, sure I can believe you’ve been doing that- but if you’re going to actually follow an industry you have to dive more into how that industry works\n\nAll that being said-  bank stocks are a great investment right now: they are (almost always) boring and predicable .  That’s what makes money in the long term-  and they’re priced well at the moment with the rest of the market overall being bearish.", "score": 4, "replies": []}, {"body": "They are paying depositors more after using our money for almost free for quite awhile so may be worrying about having put  that money out too cheap and hurting on some usage.", "score": 2, "replies": []}, {"body": "You might get more money per deal, but there are waaaayyyyyy fewer deals to be had right now.\n\nPrevious volume was elective.  People who wouldn’t have otherwise refinanced or bought did.\n\nNow that rates are going up again, the pucker effect is starting.", "score": 2, "replies": []}, {"body": "No, profits are the only thing that matters in the stock market. Until profits increase 20% in the same year I highly doubt the stock price would suddenly jump that much.", "score": 2, "replies": []}, {"body": "!RemindMe 3 months", "score": 2, "replies": [{"body": "I will be messaging you in 3 months on [**2022-08-23 23:46:54 UTC**](http://www.wolframalpha.com/input/?i=2022-08-23%2023:46:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/options/comments/uw2yyu/shouldnt_banks_be_2030_up_with_interest_rates/i9quqcl/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Fuw2yyu%2Fshouldnt_banks_be_2030_up_with_interest_rates%2Fi9quqcl%2F%5D%0A%0ARemindMe%21%202022-08-23%2023%3A46%3A54%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20uw2yyu)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "!RemindMe 3 months", "score": 2, "replies": []}, {"body": "Don’t forget those risky derivatives and swaps these junkies can’t get enough of. They are leveraged to the tits relying on the market to only ever go up. Now all their inflated assets are loosing value and for any bank their collateral is also the other guys collateral because their accounting books are all one big cesspool of fraction reserve banking. All this ‘capital’ but 0 liquidity and marge is calling because they are failing to pay the interest on their swaps which are getting pricier by the day. Basically the market hasn’t crashed yet because no big player has been liquidated yet. Once one does the house of card falls because the liquidation will lower the price of everyones assets into liquidation territory for the next weakest and the dominos continue . Welcome to the climactic end of the “everything bubble”", "score": 2, "replies": []}, {"body": "Banks do well when interest rates go up slowly over time due to economic strength.  \n\nBanks generally borrow short term, and lend long term.  so, if rates go up quickly, most of the bank portfolio is still on low rates, but the bank has to borrow at higher rates.\n\nAdditionally, a quick spike in rates tends to cause some losses as some consumers with variable rate products may become unable to pay their loans.\n\nSo, eventually, and if sustained, interest rate increases will be a net benefit to Banks, but in the shorter run, it can be a net negative if the increase is rapid.\n\nSource: Work at a bank.", "score": 2, "replies": []}, {"body": "I read an article about how banks that have an IB division have a corresponding negative exposure to interest rate hikes. If you want banks that don't have this kind of exposure, you got to look at the smaller, regional banks.\n\nThere are a few funds set up for this, but you could also look at banks in areas with statewide marijuana legalization. Some states, like New York, just went legal, and there may be some banks financing some large commercial growers. Not every bank likes to get into marijuana banking because the compliance overhead is a headache right now, but congress may eventually reform those laws and reduce the transaction cost of working with the marijuana industry. The earlier entrants have more opportunities in the space just for being early adopters, and with compliance costs ending, those banks would see a jump in their bottom line.\n\nRepublicans are more likely to sign on to banking reform that reduces costs to banks, so bipartisan reform is possible after the election and more likely than nationwide decriminalization, though I believe both are inevitable at some point with some states or municipalities remaining \"dry.\"\n\nAll being said, I did KRE a few months ago with the mind to do covered calls, but with this market, I am content with just owning 100 shares and selling calls when it moves back up later.", "score": 2, "replies": []}, {"body": "I dropped 50K in XLF last week. Seems to be paying off", "score": 1, "replies": [{"body": "You got downvoted, but that was probably a pretty good time.  I think that WFC just hit 1.0 price to book and BAC was at 1.10 briefly.  That's about when the big guys start buying.  Set it and forget it.  They could drop again, sure, but for a long portfolio they will always go up.", "score": 1, "replies": []}]}, {"body": "With interest rates so high, less people are getting loans.", "score": 0, "replies": []}, {"body": "Buying Burbank shares", "score": 0, "replies": []}, {"body": "wrong. traditional banks will no longer be the hedges of recessions past. \n\n&#x200B;\n\nshort the market. short it until capitulation. then go long. \n\n&#x200B;\n\nwhy fight the trend or look for the next long?\n\n&#x200B;\n\nthe whole f-ing market is going down. profit from that. You are not smarter than the quants!! trade the trend and do not look back. \n\n&#x200B;\n\nedit: bulls or bears? who cares? trade what is given to you! stop marrying the hooker; instead, fuck the cheerleaders. You are worth it!!!", "score": 0, "replies": []}, {"body": "Not if everyone’s fucking broke not just in the US. Literally the whole world.", "score": 1, "replies": []}, {"body": "How do banks make money……….\n\nYes they should be up! Higher interest rates means higher revenue and higher profit margins!", "score": 1, "replies": []}, {"body": "Why would banks make more money when rates are high? The only reason they’re higher is because they are paying more to borrow the money it doesn’t really translate to more profit and when rates are high less ppl are\nBorrowing from them so I would think they would make less money", "score": 1, "replies": []}, {"body": "Jpm did just have its biggest day since 2020....", "score": 1, "replies": []}, {"body": "The banks are pretty cheap right now.  They were in a bear market throughout the first half of this year.  I also have bank options which I bought a little early.  Today helped.  The big risk is recession.  Even if they are making money, if there is a perceived recession, then they will drop.  Otherwise, they should be great investments moving forward.  The interest income does help and they are much better positioned than they used to be.  I think they are a discount.  I think your expectation of how far they will rise and how fast is not correct.  There are too many headwinds for people to bid them up to top-of-cycle prices right now.  But I think there are tailwinds to get them there eventually if the economy is fine.", "score": 1, "replies": []}, {"body": "If it were me I would wait for price to break and hold above the 50 SMA. If $JPM can do that, *especially if it can do it in the face of market adversity*, I would look for 135/140 strikes if you must go OTM.\n\nITM with high delta, low IV, high OI, low theta that expire after earnings are going to retain their value infinitely better.\n\nSelling OTM bull put spreads keying off of the 20 and 50 SMA for support is the safest.", "score": 1, "replies": []}, {"body": "The rough proxy for bank profitability isnt just “rates”, its the rate spread. The shape of the (treasury) curve is what dictates what they earn from lending", "score": 1, "replies": []}, {"body": "They already are/were up.  Based on conversations with two friends who invest a lot different than me I think some traders were rotating, moving to cash, and \"buying the rumor\" a loooong time ago on banks pre-re-opening and interest rate and yield curve moves.  I was surprised when a few friends I talked to talked about moving assets to banks and cash and interest rate/yield curve issues in Dec 2020 and July 2021 - way before interest rates were all that rage.", "score": 1, "replies": []}, {"body": "That is why about 23% of my portfolio is JPM", "score": 1, "replies": []}, {"body": "People seem to be forgetting inflation. Banks go up with higher rates but down with inflation as it erodes interest payments", "score": 1, "replies": []}, {"body": "Check the preferred issues of banks - many have interest rates of 4 or 6 percent and are bond like equity - BMLp (bank of America) 25 par are at 18", "score": 1, "replies": []}, {"body": "1. Yield curve dynamics and the asset-liability mismatch of bank balance sheets is more important than the fact that rates are generally up. \n2. Higher rates raise default risk on the asset side of the balance sheet.\n\nShort rates rising will eventually mean higher deposit rates to savers which will decrease bank earnings. Higher short rates also hurt the borrowers who have borrowed short or are in a short rates + premium type rate schedule (e.g. mortgage ARMs).  That means default risks are higher. Also, if short maturity rates are rising faster than intermediate rates, bank costs rise because banks have a duration mismatch between their assets and liabilities. Banks borrow short and lend long.", "score": 1, "replies": []}, {"body": "No, that is one metric to look at but modern banks are extremely complicated. Banks also make money on loans, more of which will default when things get bad, they have oversees interests, some profit from IPOs, etc. Tbh insurance companies are a much cleaner play on higher interest rates", "score": 1, "replies": []}, {"body": "Seeing what you want to see on that chart", "score": 1, "replies": []}, {"body": "Banks are leant funds themselves at a higher rate. The spread they charge between the federal funds rate and their rate doesn’t actually change that drastically. Higher interest rates in fact lead to fewer lending opportunities. \n\nAdd to that that PE ratios decrease with higher real interest rates because prices fall due to bonds being relatively more attractive.", "score": 1, "replies": []}, {"body": "Interest rates are increasing \"so much\" but inflation is also pretty bad. As someone else said, it's possible that banks make more per loan, but the loan volume will drop. SBA lending is something to pay attention to, but my projection (as an SBA lender) is that SBA lending won't grow, but it's share of the pie will grow.", "score": 1, "replies": []}, {"body": "Do people even listen to what they are saying anymore, you want Chase’s market cap to go up 110 Billion just because of the interest rates?", "score": 1, "replies": []}, {"body": "What about defaults", "score": 1, "replies": []}, {"body": "It depends on where we are in the macro economic cycle. High rates and a beginning of the cycle is great for banks, they do well in that environment. However, most signs are we are in a late cycle, banks generally preform poorly late cycle.", "score": 1, "replies": []}, {"body": "Yes. Increasing interest rates help banks.\n\nBut you can't look at one thing and think that's all there is to see.\n\nMortgage employees are being laid off (mortgages are the bread and butter of banks), refi market is done, subprime lending is starting to default, some banks make be over extended working as shadow banks.\n\nYou'd be better off with puts.\n\nAnd the market is on a pronounced downturn. Why try to swim against the current based on one thing which is facing off against 4 bad things?", "score": 1, "replies": []}, {"body": "Supply and demand, price and quantity. Sure, they can get a very nice price for loans as rates rise. But with global growth slowing, how many loans will they be able to make?", "score": 1, "replies": []}, {"body": "Banks also tend to suffer during a recession, even if rates rise. Market could be pricing in the chance of a recession", "score": 1, "replies": []}, {"body": "lol the 1 year chart. you should look at a 2 year chart, since COVID and everyone expecting banks to raise rates *eventually*.\n\nit's all priced in.", "score": 1, "replies": []}, {"body": "Depends on the bank ...JP perhaps...but for banks balance sheets also matter a lot ...", "score": 1, "replies": []}]}
