{"title": "[deleted by user]", "selftext": "[removed]", "id": "ukju9l", "created_utc": 1651949710.0, "score": 33, "upvote_ratio": 0.7, "num_comments": 97, "comments": [{"body": "Seed, diesel, fertilizer (seed and fertilizer costs right now are up over 100%). Food is still going to go higher. So I want you to be correct, but…We may see a short reprieve, but I think Fall we get hit hard and then hopefully first Quarter next year we start to climb out. I reserve the right to be wrong, yet I know some folks close to farming industry.", "score": 42, "replies": []}, {"body": "I agree, I expect around 8.2%. Especially given that inflation is annualized, and last year’s insane numbers were skewed by the sub-2% inflation we saw throughout 2020. April 2021 CPI was the first to see a dramatic jump.\n\nA lot of people here get v snobby when somebody puts out a opinion that goes against the popular view, so don’t take some of these comments personally lol.", "score": 13, "replies": [{"body": "I’m calling for 10-20% inflation", "score": -4, "replies": [{"body": "No way. The real inflation is 50% - 60%.", "score": 8, "replies": []}, {"body": "Based on....?", "score": 2, "replies": [{"body": "....His deflated tech-heavy portfolio", "score": 12, "replies": []}]}]}]}, {"body": "How can we be at peak inflation already when the consumer is still strong as ever and the global supply chain is what it is??? I wouldn’t be so sure inflation has peaked.", "score": 12, "replies": []}, {"body": "[deleted]", "score": 49, "replies": [{"body": "List them", "score": 9, "replies": [{"body": "Commodities charts. They're all exploding still.", "score": -1, "replies": [{"body": "Scanning through commodities charts… they have all subsided over the last month. Oil is back on the rise but still hasn’t reached previous peak and looking at the 3 month avwap March ended at 104, April through now held in the 103.5 range never going above 104. \n\nI bought corn a little while back to keep a pulse and test the waters and am currently down 4%. If inflation is as bad as everyone here thinks then I’d be making a ton of money on commodities, but it’s actually been really tight and a losers game. Anyone who actually trades commodities knows inflation rolled over already.", "score": 8, "replies": [{"body": "$PXD $XOM $OXY breaking out to new highs, but more of climax top forming. Commodities suffering too not because inflation is not as bad anymore but because the bear comes for all sectors eventually, same thing in 2008 bear market where commodities were last to fall.", "score": 4, "replies": [{"body": "Ya those should hold strong and go up more even if oil/gas sits flat at this price since they’re still not fully priced to $100/barrel even. \n\nCommodities isn’t a sector and they do indeed go up with inflation not down. That’s just silly. Commodities fell at the end of 2008 because the bear market ended.", "score": 3, "replies": [{"body": "Oh actually I was incorrect, commodities actually formed a bubble in and peaked  Jan of 08 before crashing, ahead of the s&p. It was the 2000-2002 bear market where commodities fell with the rest of the market before recovering first\n\nEdit: anyways, Because a lot of commodities have already been driven up for so long because of the pandemic, I think we will see bearish price action in the near future, Copper, steel and gold look especially bad", "score": 1, "replies": []}]}]}, {"body": "Thank you for your input. How do you trade commodities?", "score": 1, "replies": [{"body": "Easiest way I’d suggest if you want to dabble for a start is to just go with the etfs like weat corn soy jo gld slv etc. There’s all kinds of them.", "score": 3, "replies": [{"body": "So you don't do futures?", "score": 1, "replies": [{"body": "There’s more liquidity in the etfs. \nFutures contracts tend to be more illiquid. Like trading spy versus spx.", "score": 3, "replies": []}]}]}]}, {"body": "I appreciate the engagement. You're not wrong about the recent price action, but I disagree that those charts have topped.  Some random thoughts that kind of make an argument:\n\n\\- Commodities have taken a break because of the DXY being so strong. I see that beginning to lose momentum in the technicals, though. Once (or if) the dollar begins to top, I think commodities run higher again. \n\n\\- Do the charts need to have topped to still cause persistent inflation? A number of CDN oil firms have reported losses from hedging oil \\~$80. If this is true for other commodities, then, current spot prices might not actually have made their way into the broader economy.  \n\\- Russian oil supply will likely contract because they've been increasingly reliant on foreign expertise and technology to keep their Siberian wells going. If the sanctions start really biting them, and they have to shut down production it might not come back on in similar capacity.\n\n\\- It's looking like the EU is looking towards the USA as a more permanent supplier of LNG. Check out that chart... Getting the stuff across the ocean will be expensive, while freight insurance and other costs are still quite high. \n\n\\- The weather hasn't been great for many crops around the world recently. Coupled with supply chain crunches and food security becoming a growing concern, I see those charts holding.\n\n\\- That both oil and gold have been so resilient in the face of Chinese lockdowns and a surging USD, I think we've got stuff brewing still.   \nI don't trade futures contracts, but I've built most of my portfolio around oil, agriculture, fertilizer, and natural gas names.", "score": 1, "replies": [{"body": "Ya those are all good points and I agree with them.\nI just don’t think that they cause any further inflationary pressure or commodities pricing increases. All of that has been priced in essentially. \nSomething new would need to come into play to change things further. \n\nSo as it relates to inflation, inflation itself has rolled over and the month over month will subside. \n\nOf course something new could come up and cause upward or downward pressures to come into play and change everything again. Who knows on that front.", "score": 1, "replies": []}]}]}]}]}, {"body": "Very scientific 🔮", "score": 14, "replies": []}, {"body": "I second that", "score": 16, "replies": []}, {"body": "I won't list my reasons either, but I believe there will be inflation", "score": 9, "replies": []}, {"body": "And it will keep increasing till the end of the year", "score": 7, "replies": []}, {"body": "Isn't like 1/3 of the world's wheat grown in Russia and Ukraine? OP didn't mention that. Luckily very little is made of wheat. Inflation will be up.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm listing reasons why I agree with you. It will be worse", "score": 2, "replies": []}]}, {"body": "Let them eat cake.", "score": 1, "replies": []}]}, {"body": "The reasons being you have puts, am I right?", "score": 1, "replies": []}]}, {"body": "Bit early to tell if we're peaked. I'm still seeing industries with big supply chain issues. Q2 / Q3 looks like the peak from my POV, so maybe we're there now but I don't see a significant easing just yet.", "score": 5, "replies": []}, {"body": "Well, Wednesday is only a few more days away. I'll give you my prediction after the number comes out.", "score": 7, "replies": []}, {"body": "If the Cleveland Fed has data that is close to right again, April YoY will be 8.2% when it is posted (they've been close but off by .1 on the low side for the last couple readings).\n\nI expect it to likely top the market for the week unless we push down into this reading considering that this has been what has been happening since options expired in April. Since the week of the 18th, there have been brutal sell offs in every latter part of the week.\n\nWhy expect that to change until proven otherwise? Maybe after a couple more weeks of it, it will, but until then, that would be my expectation.", "score": 11, "replies": [{"body": "Wasnt March 8.5% so that would be a dcerease?", "score": 7, "replies": [{"body": "Yes, and even though there hasn't been real relief price wise, it makes sense simply because April 2021 CPI was so terrible it's going to be tough to top (and core CPI ex food/fuel won't top it on a MoM basis, it was just too bad in April 2021).\n\nBut I've lost hope on a rally sticking for longer than 3 days anytime soon. So, my guess is that we do what we've done for the past few weeks, make it look like it's going to be a positive week and then see a hard rug pull on Thursday.\n\nI hope I'm wrong.\n\nEdit: For some more context, the Cleveland nowcast data was 8.4% for March and 7.81% for February. Actual was 8.5% and 7.9%. So, if their data is close but just slightly off again, that means 8.2% as I said in my first post.", "score": 9, "replies": [{"body": "Well at least a brief rally is better than no rally", "score": 3, "replies": []}, {"body": "A rally cannot sustain unless the macro picture changes. Too many headwinds for a sustained rally in equities. All rallies are getting sold for the foreseeable future.", "score": 2, "replies": []}]}]}, {"body": "So Cleveland feds also expecting may cpi at 7.8% so inflation peaked", "score": 7, "replies": []}]}, {"body": "Why do you think inflation peaked? While the prices of some commodities are down, those prices need some time to get into the system. Given that wheat is still at very high levels, I doubt that inflation will go down. Even if there are a few months where inflation looks like it has peaked, I expect inflation during this decade to be significantly higher like in the 1940 (Check Lyn Aldens blog for great comment)\n\nHow are you getting that CME is pricing in 0.75? The market rally for not 0.75 was already and it broke down afterwards. You also claim that the market is pricing in higher rates, but I don't see it. \n\nLook at the carnage of the bond market compared to the stock market. It is a wonder we are not down another 20%. I hope that inflation gets down, but I just don't see it.", "score": 15, "replies": [{"body": "You look at cme fedwatch and there you can see how much increase they are expecting", "score": -3, "replies": [{"body": "Why so much hate? Why downvotes lol", "score": 7, "replies": [{"body": "Probably because you listed an actual source instead of just talking about your feelings.", "score": 10, "replies": []}]}, {"body": "ok, I was rather asking how do the commodities price that in. Looking at how they calculate that expectancy - I could flip a coin and get a similar meaningful result.", "score": 1, "replies": []}]}]}, {"body": "THE END IS NEIGH! PANIC SELL AND BUY YOUR MREs, GUNS, AND AMMO!!!", "score": 7, "replies": [{"body": "Gold calls next week for a 10x gain", "score": 1, "replies": []}]}, {"body": "I agree. Considering report is annualized, numbers will look better this time. I've noticed already while oil is still expensive and food too, used cars, housing and some commodities have taken a trip other way. Maybe time to load up on some beaten down tech.", "score": 3, "replies": [{"body": "![gif](emote|free_emotes_pack|sunglasses)", "score": 1, "replies": []}]}, {"body": "Warren sold the airlines at the bottom. He's not all knowing.", "score": 6, "replies": []}, {"body": "Inflation has not peaked. The PPI shows this.", "score": 8, "replies": [{"body": "Whoa, someone who knows their shit. Thought I was the only one", "score": 1, "replies": []}]}, {"body": "did you come here to get flammed?", "score": 3, "replies": [{"body": "Lol why would you say that", "score": 2, "replies": []}]}, {"body": "Yeah.  All the evidence says inflation is down slightly, but no one here wants to hear it.  They've all joined the doom and gloom cult at this point.   Evidence doesn't matter much when people are letting their emotions do the thinking.", "score": 5, "replies": [{"body": "And the majority is usually wrong. Das why 1% come out with the zillions. I’ve made zillions from inverting public opinions.", "score": 1, "replies": []}]}, {"body": " This post reeks of desperate media narrative, you are mostly wrong, here’s why:\n\n1. CPI is a lagging indicator to ppi, ppi is still increasing so inflation has not peaked. I will concede that the fed might cook up a lower inflation number because you can add 10% to their number for the real number.\n\n2. Warren buffet didn’t spend 40 billion on growth tech stocks here’s what he bought. Chevron, occidental, atvi and his own fuckin stock. So he’s buying commodities. Arbitraging and trying to rescue his own stock price. How is that a good sign inflation has peaked?\n\n3. Your  commodity argument is very weak, because these rises all happened while everyone piled their money into dxy - the commodities markets you mentioned are high because of geopolitical action and short squeezes. \n\n4. Why are you trying to bet against the fed? Fighting the fed is a sure fire way to be poor\n\nChanging your thinking, the party is over and you have to adjust.", "score": 4, "replies": [{"body": "Buffet actually bought a lot of apple and hp too. And no buybacks last quarter.", "score": 2, "replies": []}]}, {"body": "When are you going to learn to stop believing the government generated inflation numbers. They're cooked.", "score": 2, "replies": [{"body": "CPI is good. Inflation cranks have always been cooked upstairs.", "score": 0, "replies": [{"body": "If the CPI numbers now are good that means they were calculating it wrong in the 1970s and so there was actually no reason for Volcker to raise rates in 1980.", "score": 1, "replies": [{"body": "The differences aren't that major. And, yes, some things about CPI in the '70's, '80's, 90's, etc wasn't ideal.", "score": 0, "replies": []}]}]}, {"body": "My crazy professor said they were always cooked and one day they will catch up.  Everyone laughed at him… so did i … maybe he’s not so crazy just early lol", "score": 1, "replies": []}]}, {"body": "You mean the rate of inflation will fall back down?  I don't think that transfers over to much.  I didn't get a raise, but my rent went up, food cost more, therefore, I have less to invest overall.  \n\nRight?", "score": 2, "replies": []}, {"body": "Inflation will ease slightly in everything except energy and food.\nEnergy and food price Inflation is just getting started, expect them to increase rapidly over the next 6 months.", "score": 2, "replies": []}, {"body": "Dude inflation isn’t over. The fed is wrong. Stop wasting your time.", "score": 3, "replies": [{"body": "Over it’s around 40% now if you do the math.  The govt is most likely under reporting", "score": -2, "replies": [{"body": "I meant over as in done. As in inflation is not done or going away", "score": 1, "replies": []}]}]}, {"body": "Naw, inflation still going up. Why? ... Impact of Ukraine's wheat harvest reduction and ongoing  international supply and transport issues are just two reasons.", "score": 1, "replies": []}, {"body": "Ok, those seem like good points. Even so, p/e and p/book seem still out of whack to me, so cash is still chasing deals.  Also, and I don't know if this is true or not, but I think that usa credit card debt is at an all time high. If the US consumer is broke, we have a looming problem with high equity valuations.", "score": 1, "replies": []}, {"body": "https://www.google.com/amp/s/www.cnbc.com/amp/2017/12/15/warren-buffetts-failures-15-investing-mistakes-he-regrets.html", "score": 1, "replies": [{"body": "It looks like you shared an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot). Fully cached AMP pages (like the one you shared), are [especially problematic](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.cnbc.com/2017/12/15/warren-buffetts-failures-15-investing-mistakes-he-regrets.html](https://www.cnbc.com/2017/12/15/warren-buffetts-failures-15-investing-mistakes-he-regrets.html)** | Gobankingrates canonical: **[https://www.gobankingrates.com/investing/7-investing-mistakes-warren-buffett-regrets/#16](https://www.gobankingrates.com/investing/7-investing-mistakes-warren-buffett-regrets/#16)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)", "score": 1, "replies": []}]}, {"body": "Peak inflation? The chuds got to you...", "score": 0, "replies": []}, {"body": "Inflation will hit 13% before it falls imo", "score": 0, "replies": []}, {"body": "Actual inflation is 20-70%, and I’m not being facetious.", "score": -1, "replies": []}, {"body": "If inflation hits 10-15% then we are cooked.  Some\nAnalysts are saying 25-40% inflation now but the govt isn’t reporting it because we’d collapse", "score": -2, "replies": []}, {"body": "Prediction:  \n1. April's inflation rate: 9.7%  \n2. QQQ: $270 by 5/20", "score": -2, "replies": [{"body": "Inflation doesn't matter.\nQQQ down to 150 in 24 months.", "score": 1, "replies": [{"body": "Too optimistic. $60 in 24 months.", "score": 1, "replies": []}]}]}, {"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I want you to be right. \n\nHowever, oil and gas are the main contributors to inflation and the EU is banning Russian oil which will drive up demand on the rest of the other supplies. \n\nThe energy sector is the only thing showing strength right now and it's the main cause of inflation. \n\nAre there any signs other supply issues such as shipping times are fixing themselves?\n\nA decrease in inflation is what everyone wants to see but I'm not super confident. My portfolio would love me to be wrong though.", "score": 1, "replies": [{"body": "I agree on energy but us inflation is more on goods and services..\nHow long china can stay in lockdown? It is shown that lockdown helps in spreading covid..\nSo if not this month than next month for sure..\nChina cnt stay for lockdown ever", "score": 1, "replies": []}]}, {"body": "Why does it matter what we’re thinking? You should invest based on your own analysis. \n\nNobody knows what will be peak, the bottom, etc. \n\nJust because inflation may peak does not necessarily mean it will go down and everything will be ok. It could be sticky for a long time and result in stagflation, which is a risk you should consider. \n\nIf your thesis is just based on whether inflation has peaked or not, that is not at all the whole story. You should consider all potential risks.", "score": 1, "replies": []}, {"body": ">We can see most of commodity peaked in March only oil and gas is up Prices of all other commodity coming down eg lead,Nickle aluminum copper wheat. So I think we have seen the worst.\n\nI think you have a good overview here just don't try to time the market.", "score": 1, "replies": []}, {"body": "There are global economic problems, and we cant just focus on ourselves or others do. We all lean on each other. Unfortunately the world is in economic decline. Nothing biden, the fed, or the queen can do about it. We cooked up this one. \n\nFood is still going to the moon, because: Ukraine, California, India.\n\nBut I will warn you - if inflation stops we will enter a deflationary period that will wreck the economy and theres nothing the fed can do about it. When demand drops the first thing gone is jobs. That pushes demand further down, The superbubble will have to deflate, but not even the rich will be safe - but definitely not the poor.\n\nThis bubble is long time cooking. Its bigger than .com or the housing bubble. ITS BOTH AND SOME MORE!  You dont want the fed to go to even 2.75.\n\nThe great depression was caused by the fed raising rates following a period of speculative trading and inflation. We always said the young fed just made a mistake, itl never happen again - turns out its possible they understood the risk, and had to choose - inflation or deflation, and the fed is facing the same decision.", "score": 1, "replies": []}, {"body": "I hope the inflation has peaked and not just those CPI numbers. Also can somebody explain why inflation is a good thing, because I heard the government targets 2%?\n\nWhy not just try and have a few years of 5% deflation or something?", "score": 1, "replies": [{"body": "Inflation allows the government to spend more without taxing you more. It also makes assets more valuable so the rich get richer.\n\nDeflation would undue that.", "score": 1, "replies": [{"body": "Ironic I think most would rather just have a VAT tax.  Warren Buffet says inflation is a tax on the poor.", "score": 1, "replies": [{"body": "It's so they can lower taxes but raise inflation. Jokes on the taxpayers.", "score": 1, "replies": []}]}]}]}, {"body": "Isnt cpi data Year on Year? A comparison to last April? If thats the case energy prices are still through the roof", "score": 1, "replies": [{"body": "You’re underestimating just how awful April CPI was last year.\n\nIt was so bad that the worst case would probably be 8.5 - 8.5 at least imo, but my general guess would be that it’ll be a little lower.\n\nNow if it is 8.2 just based off base effects (possible because of what the Cleveland Fed nowcast stuff says), it isn’t something that should be celebrated, but it could briefly catch some off balance.", "score": 1, "replies": []}]}, {"body": "Warren Buffet is holding 144 Billions in cash for a reason. 40 billions is not that expressive when you zoom out and look at his portfolio. His position in NUBANK went pretty sour .", "score": 1, "replies": [{"body": "That Nubank position has only been there for a few months. Give it time!", "score": 1, "replies": []}]}, {"body": "PPI (cost for producers) has been above CPI (cost for comsumers) for like a year straight. PPI leads the CPI.\n\nTherefore CPI has not peaked yet. Stop listening to financial media gaslighting you and trying to get you to buy stocks while big money is selling, and look at the actual data.\n\n/thread", "score": 1, "replies": []}, {"body": "Gas here in Phoenix has come down a little. My nearest station has gone from $4.85 to $4.65. So maybe you’re right. Groceries seem a little higher though. So…we can hope, right.", "score": 1, "replies": []}, {"body": "bla bla bla inflation,I don't care that my cup of coffee costs a few cents more..nor does anybody else care.I will care when my 12 pack of shitty light beer costs 20 dollars..no one cares if its a dollar more than last year", "score": 1, "replies": []}, {"body": "Yes inflation on wednesday, but not market rally. SUCCER RALLY.", "score": 1, "replies": []}, {"body": "The basket of goods will be adjusted to whatever it takes to make inflation look slightly less take that as you will...", "score": 1, "replies": []}]}
{"title": "Does anyone wheel AMD or suggest wheeling AMD?", "selftext": "I need a hundred dollar stock for me to wheel and currently amd looks the most attractive. Anyone else do it?", "id": "ukh66n", "created_utc": 1651941666.0, "score": 61, "upvote_ratio": 0.86, "num_comments": 98, "comments": [{"body": "Well, it's at a better price now than it was 6 months ago, when I started wheeling AMD. That's for sure.", "score": 113, "replies": [{"body": "What's your strategy for it, do you suggest doing a super tight wheel a dollar out and not care about assignment or do you keep it a few dollars out for your puts?", "score": 6, "replies": [{"body": "Well I'm down about 4K so you might not want to take my advice.", "score": 51, "replies": [{"body": "Hey that’s great advice!", "score": 6, "replies": []}]}, {"body": "Support has been roughly around $85, so that's a good safe place for a strike.", "score": 12, "replies": [{"body": "Support was $100 a couple of weeks ago lmao", "score": 61, "replies": [{"body": "\"support\" means jack shit, it's literally just a made up number pulled out of someone's ass", "score": 23, "replies": [{"body": "Lmao.", "score": 6, "replies": []}, {"body": "TA is just horoscopes for male nerds", "score": 9, "replies": [{"body": "So Dividend/ETF investing for you", "score": 2, "replies": [{"body": "Nope. contrarian investing/value investing and macro analysis is the way forward for me.", "score": 3, "replies": []}]}]}]}, {"body": "Yeah, well I read the farmers almanac and a candy wrapper so I think support is at tree fiddy!", "score": 8, "replies": []}]}, {"body": "Oh Jesus dude I was thinking 92 max. 85 is so goddamn little in premiums.", "score": 13, "replies": [{"body": "If you don’t mind getting assigned sure", "score": 32, "replies": []}, {"body": "Before you sell any CSP, do your downside calculations. If you pick up the stock at 85, what if that stock goes to 60? How much loss can you tolerate? Thetagang is great in a bullish market but right now it's looking bearish. Just be careful", "score": 13, "replies": []}, {"body": "Look for 30-45 days out and shoot for 0.15 delta. That’s what I have been doing but you gotta sell the puts on a deep red day and be ready to average down or push out if needed. It really is one of the most volatile stocks in the medium IV range. I thought support was 100 previously and wasn’t safe on my 85 dollar puts", "score": 6, "replies": []}, {"body": "Have you looked at the charts before deciding which strike to sell?", "score": 2, "replies": []}, {"body": "I’m basing this off todays numbers and what the premiums would have been like on Friday. \n\n92 premium I’m guessing $200 for the weekly and 85 was about $50.\n\nTaking a $50 premium on an $8500 investment annualizes to about 7% gain and much less chance of being assigned. \n\nWhere’s as if you took that $92 strike, you’re going yo get that $200 and then buy a stock that now $6 in the money. You’re now $400 in the hole.", "score": 2, "replies": []}]}, {"body": "Support doesn't exist in neat markets", "score": 2, "replies": []}, {"body": "Amd needs to go back to pre pandemic lvl at 50. Just wait and start wheeling whit get back down there", "score": -13, "replies": [{"body": "It's made a purchase since then. $50 likely won't be in the cards for AMD.", "score": 14, "replies": []}, {"body": "Im selling my right kidney to go all in if AMD reaches 50 again", "score": 14, "replies": [{"body": "Give it a year.", "score": 4, "replies": [{"body": "It’s acquired several companies and expanded its sales quite a bit since it was last at 50. If the US enters a steep recession it can certainly go back there though…", "score": 12, "replies": []}]}]}, {"body": "haha no.", "score": 4, "replies": []}, {"body": "Agreed. It’s going there just a matter of time", "score": -8, "replies": [{"body": "You see that? We’re near the bottom boys", "score": 4, "replies": []}, {"body": "Going for sure with all the down votes. It means a lot of bag holders holding onto hopes. It’ll break down to 50 once 80 breaks. They’ll all dump it around there.", "score": 0, "replies": [{"body": "So you believe AMD should be at $50 with a TTM PE around 18.5 and a forward PE around 10 while growing more than 50% per year?\n\nGet real.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "I’d personally sell 30-45 dte calls/puts to capture the most premium/downside protection. It’s tempting to sell weeklies, but you can easily lose ground on AMD with how volatile it is —- both upside and downside.", "score": 25, "replies": [{"body": "I sell 2 weeks out whatever option is in the 10-13% annualized return.  Most of the time it is 12-15% above the underlying.  Avoid earning unless it's way OTM.  I average about 15% per year or so.", "score": 2, "replies": []}, {"body": "This 100%. Thought 100 was the support previously and it blew through that. Said if it blew through 100 I would buy my short puts back and it did.", "score": 4, "replies": []}]}, {"body": "I've wheeled it multiple times and it's done me dirty every time.  Currently down 50% from the last time I tried wheeling it.  It basically goes on an uptrend until you sell puts against it and then it spikes down hard so that you get assigned, then trends slowly down for 6 months until you give up making $0.01/month and and sell some calls below your assignment price.  Then it spikes up by 20% to make sure your shares get called away for a loss.  Then it keeps trending up until you come back to it like a battered spouse and repeats the cycle again.  Damn you, AMD.", "score": 29, "replies": [{"body": "This feels like me right now ... rolling 3x $110 puts", "score": 7, "replies": []}, {"body": "Always on the wrong side of the market. I feel you.", "score": 1, "replies": []}]}, {"body": "Hellllll no I don’t wheel AMD. This is a ticker infamous for making all of its moves on 2 days in a year. You just load up on leaps during pull backs and make huge money every time it makes ATH. Gotta be patient.", "score": 22, "replies": [{"body": "Well the vol is priced pretty high for those two days. Sell some .16 delta puts for decent return on capital. I see it as midway between meme wheeling and smart investment. I'm bullish on AMD personally though.", "score": 4, "replies": [{"body": "Nah. You get like 5% in a year in exchange for missing 500% on your leaps when it rips out of nowhere. Never worth on this ticker IMO.", "score": 3, "replies": []}]}]}, {"body": "AMD is the only stock that has kept me afloat this year. Assuming you want to take assignment, I'd say sell 88 to 94s, or like 85-86 if you don't want assignment.", "score": 8, "replies": []}, {"body": "It's a legitimate, good company that has been consistently smashing ER.", "score": 7, "replies": []}, {"body": "You’re gonna have a really bad time wheeling any tech in this environment. There will be no significant price appreciation until at least the end of 2022 and probably, actually end of 2023. Tech risk now is to the downside, not the upside. If you like to wheel, wheel energy. Switch to tech when it’s time for tech to shine again, but that time is not in 2022.", "score": 11, "replies": []}, {"body": "I wouldnt want to run the wheel in this market regime. Tail risk is too high.", "score": 6, "replies": []}, {"body": "Wheeling AMD has me beat s&p by 20% right now. Selling 6 calls and selling 4 csp", "score": 6, "replies": []}, {"body": "I just wheeled AMD for 2 weeks, collected a nice hefty premium. Bought @ 89, sold @ 91", "score": 5, "replies": [{"body": "Shoulda held 😞", "score": 2, "replies": [{"body": "It’s cool, I’ll just sell puts again ^^", "score": 3, "replies": []}]}]}, {"body": "Poor mans", "score": 7, "replies": [{"body": "Amd is the poor man's wheel?", "score": 4, "replies": [{"body": "That's not what it means. He's saying to buy a long call and sell short calls against it", "score": 19, "replies": []}, {"body": "I believe he means the poor man's covered calls, also known as a diagnol spread.", "score": 11, "replies": [{"body": "Can you explain it to me?", "score": 2, "replies": [{"body": "https://youtu.be/LmqbVg9zqjQ this video should explain how the strategy works risks and all. It's pretty convenient.", "score": 1, "replies": []}]}]}]}, {"body": "I love it. I'll be Selling 7 at a time  once it's back above 100", "score": 2, "replies": []}]}, {"body": "I've wheeled AMD a few times.   I sell CSPs with 30-45 DTE, but once I'm assigned I sell weekly covered calls.   AMD has been pretty volatile for the last year so weeklies have worked best for me on the call side.   I'm not currently wheeling it but would if I was I would either be selling in the 85-90 range OR just trying get assigned at 95-100", "score": 4, "replies": []}, {"body": "I do it. It’s pretty volatile and so i just sell CCs close to market price and wait for it to dip to buy back for a 50% profit. This has worked decently well for a while now. Rn my strategy is: \nShares+Leap+CC\nShares I hold long term, the leap is there to sell if the stock explodes and my CC is too expensive to buy back since I don’t want to sell my shares, and then the CC usually dies if I sell them 1-3 weeks out", "score": 4, "replies": [{"body": "I've been doing this same thing recently", "score": 2, "replies": []}]}, {"body": "Wait to catch it on its way down and then sell", "score": 3, "replies": []}, {"body": "got assigned at 95 and wheeling pretty succesfully now (most covered calls so far have been at or close to atm), so far it works well but i suppose it might go lower and cc’s might get less attractive", "score": 3, "replies": []}, {"body": "I don't find the premiums justify the volatility. Take a look at TWLO. Currently at 107", "score": 3, "replies": [{"body": "Isn't that more volatile?", "score": 2, "replies": [{"body": "You can make decent money on far OTM strikes if you aren't too greedy", "score": 1, "replies": [{"body": "What do you consider far OTM on it?", "score": 1, "replies": []}]}]}]}, {"body": "I wheeled it, got exercised at like $120, was pissed, and now relieved.", "score": 3, "replies": []}, {"body": "I've had good luck recently with XOM, NUE, SI, HLT, DIS in the $100 range. Occasionally SQ but be careful. Heck, even GME puts far OTM have paid well (only small amounts of them)\n\nSome lower stock price I have found good are OXY, KSS, DVN, CCJ, AA, PFE, NVAX, SLB, WFC.", "score": 3, "replies": []}, {"body": "Great earnings, positive guidance despite everything going on, PE like a value stock, more market left to capture? I'm in", "score": 6, "replies": [{"body": "pe over 30 like  value stock? :D u do know historic spy p/e is around 15, and that is spy..", "score": 5, "replies": [{"body": "forward pe is 25. not exatly spy but much better than other growth", "score": 3, "replies": [{"body": "forward carry a lot of risks, i m doubtful even current p/e will hold in cooling economy..", "score": -2, "replies": []}]}, {"body": "Forward PE on AMD is less than 20 currently, and it's growing > 50% per year. It demands a higher multiple with that growth. Also, according to [nasdaq.com](https://www.nasdaq.com/market-activity/stocks/amd/price-earnings-peg-ratios) AMD has a peg of 0.78    \n\nHow many stocks in the S&P500 are consistently growing > 50% per year?", "score": 2, "replies": []}]}]}, {"body": "I got assigned a few times on AMD with my sell puts at around $88 CB. I almost want to keep selling strangles on it but almost don’t want to sell calls against them because they’re such a good avg price.\n\nI’m thinking I’ll keep selling $85 puts and off load them eventually. Makes up for my $110 Strike leaps that have a break even of $150. :(", "score": 2, "replies": []}, {"body": "It's a great company but it's one of the worst for wheeling", "score": 2, "replies": []}, {"body": "I have been, so far I made like $400 selling options and lost about $1800 on the stock. Still long on AMD though, just... well you know not great timing", "score": 2, "replies": []}, {"body": "I do and I think it's a great candidate at these prices. I would do it if you have enough capital to carry 300-400 shares. Start with 1 weekly Put .30-.20 delta depending on risk/reward you're comfortable with. \n\nIf assigned I them do a covered strangle for double $$$.\n\nAnother thing you could do is start with selling Put ratio spread which gives you a credit and more flexibility. It actually could earn you more than your intial credit if it moves AGAINST you, con be converted into a bear put spread, and close out 1 of the long and 1 of the short puts for a profit and let 1 Put get assigned. \n\nIt's pretty flexible. \n\nJust don't max out your capital or get greedy. Follow your plan and skip earnings weeks.", "score": 2, "replies": [{"body": "Ps if you do get assigned and it goes lower (bear market) you can also sell bear call spreads to earn premium and keep the stock if it blows through you spread to the upside.\n\nYou will take a known fixed loss but the value of your shares going up will be more than the loss. Repeat if necessary until it's close enough to your avg cost to earn good premium without taking a loss upon assignment.", "score": 2, "replies": []}]}, {"body": "Bear call spreads is best for amd currently in my opinion .  Close them out when amd dip on red days when you get at least 50’percent profit.  That’s what I’m doing .", "score": 2, "replies": []}, {"body": "Quick question, would you buy 100 shares of AMD @$90 to hold over the next year?\n\nIf the answer is yes, then wheel away.\nIf the answer is no, keep looking.", "score": 2, "replies": [{"body": "Absolutely", "score": 3, "replies": [{"body": "Then you have your answer! Good luck my friend.", "score": 1, "replies": []}]}, {"body": "Also DIS is looking good to me.", "score": 2, "replies": []}]}, {"body": "do you have at least 2 years on active management/adjustment of your options? if no, don't", "score": 3, "replies": []}, {"body": "Try AFFRM. High volatility but better premiums. But the stock has been battered the last few months.", "score": 0, "replies": [{"body": "But do you actually want to own AFRM? I'd rather own AMD even with lower premiums", "score": 7, "replies": [{"body": "The only saving grace is AFRM is sitting on a tonne of cash. If the market tightens and the repo rate goes up, AFRM with their claims of better underwriting may actually come out better. AMD is also good but was just highlighting risk vs. return.", "score": 1, "replies": []}]}]}, {"body": "ETH 2.0 is almost here which will affect both amd and nvida whether people agree with me or not. \nA lot of their $$ was the heavy mining demand. When that's all gone in August amd will dip...my 2 cents", "score": 0, "replies": []}, {"body": "In that space I would pick nvidia but they are more than a hundred", "score": -1, "replies": []}, {"body": "I sold 100 CSP few week ago. When it started tanking added 97c weekly hedge. Cost basis is 92 now so I am with minor profit. Moved to calendar straddle after earning :weekly/June. Will see how it performs in few weeks.", "score": 1, "replies": []}, {"body": "Yup wheels up", "score": 1, "replies": []}, {"body": "Wheel KO. It’s solid.", "score": 1, "replies": []}, {"body": "1", "score": 1, "replies": []}, {"body": "I wheel it but it has fucking sucked the past few weeks ever since falling below 100. I currently have a month out ccs at 108 . Normally i do it as weeklies since i watch the market everyday but i dont want to risk a strike below my 100 cost basis or too close to it.\n\n\nGetting in when it was in the 80s or low 90s would have been killer.", "score": 1, "replies": []}, {"body": "Well the way things are going if you wait a week or two you might have a bunch more stocks that are 100 dollars to choose from.", "score": 1, "replies": []}, {"body": "AMZN and GOOG", "score": 1, "replies": []}, {"body": "i was assigned amd at strike 105 since Apr. Now onto the covered calls. Since market is likely to be falling in the short  term, I am thinking of selling cc at same strike for a longer time out.", "score": 1, "replies": []}, {"body": "Good time to wheel amd yeah", "score": 1, "replies": []}, {"body": "I wheel SQ but not sure which is higher volume these days. Just tossing a similar price and sentiment stock sub 100 right meow easy condors", "score": 1, "replies": []}, {"body": "Stay away from growth until inflation eases, don't fight the fed or you'll be holding bags for a long time!", "score": 1, "replies": []}, {"body": "Dont Wheel anything right now imo lol", "score": 1, "replies": []}, {"body": "don't do CC. most of the tech stocks are getting hammered these days. Even with good news, AMD doesn't move a lot at all. It will slowly go back to 70-80 range in a few months.", "score": 1, "replies": []}]}
