{"title": "Former US Treasury Secretary Larry Summers says there’s an increasing risk the looming recession he’s anticipated will start sooner, in 2022", "selftext": "[removed]", "id": "vr9iy6", "created_utc": 1656947347.0, "score": 228, "upvote_ratio": 0.92, "num_comments": 89, "comments": [{"body": "*<pouring rain bounces of the pavement outside>*\n\n*<Larry Summers opens a window and sticks his head outside>*\n\n“Looks like it might rain”\n\n—Larry Summers", "score": 120, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "^^^The things people post when they really want people to know they are stupid.", "score": -1, "replies": [{"body": "Chef's kiss", "score": 0, "replies": []}]}]}, {"body": "Except he has been consistent", "score": -1, "replies": [{"body": "Ly wrong.", "score": 5, "replies": []}, {"body": "He’s been consistently looking at the recession daily.", "score": 2, "replies": [{"body": "Prices are up, I predict inflation", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 197, "replies": [{"body": "That increases the chances somewhat. --Larry Summers", "score": 11, "replies": []}, {"body": "Winner winner chicken dinner", "score": 36, "replies": [{"body": "ok, but chicken dinners are actually kind of expensive right now, so how do we claim the chicken dinner prize.", "score": 13, "replies": [{"body": "They're still a loss leader at costco!", "score": 3, "replies": []}, {"body": "My chickens gone up £1.50 :(", "score": 1, "replies": []}]}]}, {"body": "Man, I missed ur post. Ur right.", "score": 5, "replies": []}, {"body": "Recession declaration is backwards looking. Every recession starts before it's officially declared.", "score": 5, "replies": []}, {"body": "Just wait for the “but ahctually…” bros to come in and comment", "score": 9, "replies": [{"body": "Yeah because this isn't a real recession, but a technical one. One with  two job vacancies for every jobseeker. 10% wage growth. Red hot consumer demand. Leveraged investors absolutely killing it on real estate. If there is a real recession it will look and feel very different to this, and you'll laugh at yourself for equating them", "score": 22, "replies": [{"body": "It’s not a “technical recession”, either. That’s a Eurozone term, American economists don’t use it and specifically reject the “2 negative quarters” rule precisely because of what you just explained. We can’t be in a recession with record job creation. It’s fucking nonsensical.", "score": 5, "replies": [{"body": "I don’t know what you’re reading but that is exactly how a recession is defined in America", "score": 0, "replies": [{"body": "False. If you don’t know “what I’m reading” then you’re clueless.  \n\nhttps://www.nber.org/business-cycle-dating-procedure-frequently-asked-questions  \n  \nhttps://en.m.wikipedia.org/wiki/Recession", "score": 1, "replies": [{"body": "Don’t follow your logic. Also this is an extremely common question on securities licensing exams. But I’m sure you know more than the regulators", "score": 0, "replies": [{"body": "Your definition of a recession is wrong, and if you’re confused about “what I’m reading” (implying I’m getting this from some obscure reference) then you must be totally clueless! I literally linked NBER! I even doubled down by linking Wikipedia lmao. This isn’t up for debate! You certainly don’t have securities credentials if you don’t know the definition of a recession.", "score": 1, "replies": []}]}]}]}]}, {"body": "Not anymore lmao", "score": -1, "replies": []}]}, {"body": "Putting it in quotes and spelling it wrong doesn’t make the argument wrong. Like /u/dubov has mentioned, so far it’s really hard to claim this is a “recession” by NBER definitions, I honestly don’t think any of you would even notice anything besides higher inflation if it weren’t for the internet and media reporting these numbers. Do you really think you’d personally perceive a -2.0% GDP annualized Q2? Like do you think you’d notice that?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Where? Overall travelers are [way up compared to either 2020 or 2021](https://www.tsa.gov/coronavirus/passenger-throughput)", "score": 6, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Anecdotal. You have anecdotal evidence.", "score": 11, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "No I’d tell you to not use big words to lend authority to your claims. When…\n\n1. Your example you cited about tourists in your area, you clearly did not measure any thing other than looking at your little spot in the world and broadly concluded the economic state of the US.\n\nWhat is the difference between anecdotal and empirical evidence? Anecdotal evidence generally is the experience or observations of one person. Empirical evidence consists of observations collected systematically by researchers as part of a research study.\n\nTaLk oUt YoUr AsS, lol ok", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "The guy is some idiot, don’t mind him", "score": 1, "replies": []}]}]}]}, {"body": "I assume a lot of people are traveling to visit family.  They may not have gotten the chance the last two years.  We had to cancel attending our family reunion last year for medical reasons but did do other vacations.  This year we are avoiding the crowds and summer covid and traveling in September.  I put us on a recession budget in April.  Things are fine but I find I can’t seem to plan economically beyond the end of 2023 because the depth of the recession is not yet clear.  I think we are now in a recession but it is more a shallow consumer reaction to inflation rather than an industrial productivity decline.", "score": 1, "replies": []}]}]}]}, {"body": "Kind of cool that you and I both can look at GDPNow and both see what Summers is seeing. It's not some big secret.", "score": 2, "replies": []}]}, {"body": "Nobody wants to be the one to say it", "score": 28, "replies": [{"body": "I don’t understand this. Why is it so hard for them to just say it. If we go out, anywhere, the stores are still busy, just not like before.", "score": 1, "replies": []}]}, {"body": "So he said a recession was coming in the future. And now that its happening, just adjust it to say it's sooner then I thought. So your never wrong.", "score": 41, "replies": [{"body": "Ohhhhh, a guy adjusting his prediction when new evidence emerges! Such a conspiracy 🤪", "score": 4, "replies": []}, {"body": "Adjusting forward half a year isn't bad for a forecast. He was saying mid-2023 before", "score": 0, "replies": []}]}, {"body": "It's a transitory recession.", "score": 21, "replies": [{"body": "Everything is transitory, given a large enough time scale.", "score": 9, "replies": [{"body": "Transitory does not mean temporary or whatever you guys think it does.  \n  \nIt has a specific definition in economics; it refers to inflation that is caused by exogenous factors and is not caused by traditional broad-based paradigms like cost-push, demand-pull, or currency devaluation. Yellen et al dumped the transitory term when it was becoming increasingly clear last year that the inflation *was* broad-based demand-pull. Now, demand has cooled significantly. \n  \nSince the war in Ukraine and COVID are exogenous factors, the inflation is quite literally transitory. I.e will end when when the exogenous factors end.  \n  \nThis sub is economically illiterate.", "score": 11, "replies": [{"body": "It’s Reddit, any one who is an expert on anything will only be disappointed when reading what Reddit thinks about their subject.", "score": 4, "replies": []}, {"body": "Your comment is transitory", "score": 3, "replies": []}, {"body": "I mean it was a cheap joke but thanks for the explanation. 😁", "score": 2, "replies": []}]}]}, {"body": "Lol", "score": 2, "replies": []}]}, {"body": "The more I read and hear about the pending recession, the more skeptical I get.", "score": 34, "replies": [{"body": "[deleted]", "score": 26, "replies": [{"body": "Well, a broken clock is right twice a day.", "score": 11, "replies": [{"body": "And I see this saying twice a day too", "score": 2, "replies": []}, {"body": "My digital watch is never right....", "score": 1, "replies": []}]}, {"body": "We're coming off a record bull run that was capped off with money printing and free loans while the world was in lock down.  Recessions are a part of the system.  We waited too long.", "score": 8, "replies": []}, {"body": "I'd say quite tye contrary, any time a down turn is mentioned thr poster gets flamed by the hoards of 99% bulls", "score": 0, "replies": []}]}, {"body": "We're in a recession", "score": 12, "replies": []}, {"body": "when there's this much talk about a pending recession it means one of two things: 1) there won't be a recession, or 2) we're already in it", "score": 7, "replies": [{"body": "We are already in it.", "score": 2, "replies": []}]}]}, {"body": "It may start soon, like in January of 2022 soon.", "score": 6, "replies": []}, {"body": "Powel team has agreed to control inflation by the cost of recession. Recession is better than inflation!!!", "score": 15, "replies": []}, {"body": "I work for a big company. They are concerned about a potential recession coming in the future, so they've stopped hiring. If all companies take the same route and stop hiring then we're guaranteed a recession. It's kind of a self-fulfilling prophecy.", "score": 5, "replies": [{"body": "The spending stops before the hiring", "score": 2, "replies": [{"body": "That's actually not the case at my company. We just looked at the numbers are up yoy but they are projecting spending will stop increasing soon.", "score": 1, "replies": []}]}]}, {"body": "I dont get why so many top analysts are forecasting recession in next year, 6 months etc, while I feel like we have been in one since March?", "score": 14, "replies": [{"body": "I read some where a theory that was basically people were already locked into their summer vacation and spending plans and there was no backing out. Once the fall comes around and those credit card bills start coming in things will go south quick.", "score": 8, "replies": [{"body": "Yep, inventory levels have been rising once the log jam of shipping clears up there will be a glut of cars and chips.", "score": 1, "replies": []}, {"body": "That has been my experience with recessions in the past, they begin after Labor Day.", "score": 1, "replies": []}]}, {"body": "How many people have been laid off since March in the broader labor market? I know tech has slowed down but what about people outside tech?", "score": 7, "replies": [{"body": "Job losses/gains are usually lagging indicators.", "score": 9, "replies": [{"body": "On top of that, seems way less jobs getting posted and companies are slowing down replacing workers who leave.", "score": 3, "replies": [{"body": "Seems? Any data to back it up?", "score": 1, "replies": [{"body": "There’s been a number of articles on various companies announcing hiring freezes.  Tesla being one.  Seems like most of them I read were tech sector.", "score": 2, "replies": []}]}]}]}, {"body": "I’m curious with the state of industry and how many folks retired and/or passed away over the previous 2 years if a recession would really result in unemployment, especially of the type that we felt in 08-09+.", "score": 3, "replies": []}]}, {"body": "Because that's how recessions are reported.", "score": 1, "replies": []}]}, {"body": "Larry Summers also said he had a special connection with Jeffrey Epstein.", "score": 8, "replies": []}, {"body": "They need to stop playing this stupid game in the media.\n\nClearly, we're in a recession. \n\nThe Atlanta Fed just confirmed it.\n\nAnd we're still getting this bullshit \"44% chance of a recession in 2023\" \"risk of looming recession in 2022\".", "score": 3, "replies": []}, {"body": "Aren't these just speculative crashes? Where some guy like this is just like \"mmmmm is recession\" and then everyone freaks out and just causes the recession?", "score": 2, "replies": []}, {"body": "A recession is already 70% priced in for the July reading", "score": 5, "replies": [{"body": "What does price in recession even mean? Recessions does not have a exact meaning like pricing in 50 bps hike.", "score": 2, "replies": [{"body": "Mostly earnings estimates coming down, disregarding previous fwd guidance", "score": 1, "replies": [{"body": "Yes but did they price in 10% decline or 90%?", "score": 1, "replies": [{"body": "Depends on the industry and how much they have gone up in the past relative to mkt conditions at the time and as per OP it's 70% although I believe it largely varies by the industry.", "score": 1, "replies": []}]}]}, {"body": "The GDP is a key component for the terminal value of a company and is used in DCF models in calculating the market value of a company", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Chef Boyardee", "score": 3, "replies": []}]}]}, {"body": "No sh1t, wasn’t it official as of the first. The numbers are out there (and have been for a while) only uninformed people are surprised. Stop watching MSM and worrying about “celebrities” and focus on reality.", "score": 0, "replies": []}, {"body": "Wait a minute, didn’t Biden just announce that he spoke with Larry, a few weeks back and “there was nothing to worry about”?\n\nThe bigger question I have, if there is a recession incoming, is how bad is it and what is the effect on S&P earnings? I believe 2021 EPS was about $207 per share but if there is a pullback, what does that new EPS number for 2022 look like, $185-195? If yes, then that means @ a 16 multiple on $195 EPS then fair value of the S&P would be: 3,120.\n\nIf you’re a long term investor, I would believe, you have to be licking your chops, right?\n\nEither way, I’m staying consistent and buying quality, built around the SPY, ever decent day we have down and monthly!\n\nGood luck to all and happy fourth!!", "score": -2, "replies": []}, {"body": "Genius really", "score": 1, "replies": []}, {"body": "Can anyone on here confirm Larry Summers expected us to be in a recession much sooner ?", "score": 1, "replies": []}, {"body": "I’d say it’s already begun", "score": 1, "replies": []}, {"body": "Thank god Powell nuked our currency !!", "score": 1, "replies": []}, {"body": "wow you dont say!", "score": 1, "replies": []}, {"body": "The recession will magically be announced after the mid terms. Why? Because people need to keep their seats. The recession is already here, regardless of the formal recognition.", "score": 1, "replies": []}, {"body": "Spoiler alert: it already has", "score": 1, "replies": []}, {"body": "So ridiculous. It’s not like somebody flips a switch.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vrii8k", "created_utc": 1656972011.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 97, "comments": [{"body": "Nvda", "score": 10, "replies": [{"body": "Why is that", "score": 2, "replies": []}]}, {"body": "Google. I can’t remember what life was like before google search and YouTube. To boot the company prints money, every quarter, and has about $120 billion on net cash on hand.\n\nGoogle also has cloud which, eventually, is going to be profitable and, yet again, another high margin business for the company!", "score": 6, "replies": []}, {"body": "Big fan of MSFT. Money printer.", "score": 22, "replies": []}, {"body": "Micron. Current PE <6. Excellent balance sheet. Very little competition and very high barriers to entry, clear long term headwinds for memory.  The only downside is it will experience short term headwinds due to economic slowdown and the stock being cyclical.", "score": 10, "replies": [{"body": "Exactly the stock is cyclical. Buy the dip and wait until it will pass 100$", "score": 2, "replies": [{"body": " I think this is a long hold. Just let that baby compound.", "score": 5, "replies": [{"body": "Yeah, they will not be out of business anytime soon lol.", "score": 1, "replies": []}]}]}, {"body": "hmm very nice. ill look into it.", "score": 1, "replies": []}, {"body": "Probably a good choice.  They sounded the alarm so I'd say the semiconductor & computer parts market pitfalls are going to be more priced in for them than the other competitors.", "score": 1, "replies": []}, {"body": "Started my position recently. Plan to add to it as I go.", "score": 1, "replies": []}, {"body": "![gif](emote|free_emotes_pack|snoo)I’m looking to start building up a position ![gif](emote|free_emotes_pack|snoo)", "score": 1, "replies": []}, {"body": "Do we want to look at 2000 crash for MU ?", "score": 1, "replies": []}, {"body": "You mean tailwinds", "score": 1, "replies": []}]}, {"body": "dominos, americans are lazy and fat, in a recession they eat", "score": 13, "replies": [{"body": "Currently eating, can confirm, but the recession pizza is a $5 little caesars hot n ready. Sacrifices must be made", "score": 15, "replies": []}, {"body": "Agree. In recessions people don’t stop eating out but they do switch to cheaper options. Bad for Ruth’s Chris and such but good for fast food in general.", "score": 1, "replies": []}]}, {"body": "HSY! Who doesn't love chocolates?", "score": 4, "replies": []}, {"body": "I like Tesla because its kind of like watching Bitcoin investors. At any moment the price can go unrealistically high and then in the next moment crash and lose half of its value because its founder tweeted something stupid. I enjoy the free entertainment.", "score": 4, "replies": []}, {"body": "Tlo.to Talon (Tamarack project)\n\nSit on it for 5 years and watch that money 5x if not more. When they determine that nickel deposit is a district it's fat stacks. \n\nOne of the highest grading nickel deposits to date, near auto manufacturing, domestic supply of battery minerals for the US and provides copper and cobalt as a by product.\n\nWhat's that?? It's in a mining friendly district with a very experienced workforce?? Oh and it's partnered with one of the largest mining forces in the world (Rio Tinto). \n\nYou can thank me later.\n\nMy position is ~80k at .585 and im averaging down as funds become available.\n\nShort term hurt, but long term gain. \n\nFeel free to do some DD\n\nMining engineer here and I haven't been this excited since Skeena blew up.", "score": 5, "replies": [{"body": "Am I reading this right that they were founded in 2005 and still have no revenue?", "score": 4, "replies": [{"body": "Exploration company my dude", "score": 5, "replies": []}]}]}, {"body": "Google currently with the stock split. Can’t buy the stock fast enough at its price and with an upcoming 20:1.", "score": 6, "replies": []}, {"body": "That's a hard pick.  XOM?  I honestly think the phase-out of ICE engines is a meme that isn't going to happen.  I have a lot of exposure to lithium miners as well but I think we're going to discover a lot of barriers and long term environmental effects of EVs as they become more popular.", "score": 3, "replies": []}, {"body": "MSFT for the exact some reasons as OP except that azure is a close second to AWS.", "score": 6, "replies": [{"body": "They’re closing the gap", "score": 1, "replies": []}]}, {"body": "I like ASTS. I think world wide satellite cellular internet service through an app is still a very untapped market and anything can happen. Also enjoy keeping up with the news and a achievements of a growing company. Not financial advice.", "score": 6, "replies": [{"body": "Interesting. Can you please tell me more ?", "score": 1, "replies": [{"body": "They have plans to launch satellites this August to provide 5g coverage all around the world. Instead of making a new cell service they want to partner with existing services to use their satellites for customers. \n\nThey have done some test to prove the concept. Bluewalker 1 and 2 was a test consisting of a small satellite they sent to space that was pretty much a glorified cell phone and it communicated successfully with the land satellites.  Blue walker 3 which is the real deal satellite is set to be launched this August. \n\nThings to consider is the test results weren’t made public. Only confirmed they worked. That left people debating if 5g will be considered a possibility with these satellites or if it will be lesser and if so how much? Also the launch date has been pushed back and that has upset some investors but from the little I read it wasn’t really ASTS fault. \n\nIf all goes well with launch and the tech delivers on exactly what it’s promising this stock will do well. Currently it’s somewhere at 6-7 dollars per share. It will greatly increase when/if it starts generating revenue. It’s an interesting position to buy with some real risk but some real potential to succeed. There is a ASTS subreddit too.", "score": 1, "replies": []}]}, {"body": "I’m not sure what else to say really. Its currently still in the development stages. It won’t have revenue until past development if everything goes as planed. You can google the ticker for more info", "score": 1, "replies": []}]}, {"body": "SOFI, because I’m a bag holder and will not sell for a loss lol", "score": 12, "replies": [{"body": "Hahaha bet me to it! I was just about to type “PLTR because I’m a bag holder”.", "score": 0, "replies": []}]}, {"body": "GOOGL all day!", "score": 3, "replies": []}, {"body": "A...M...D...you already know", "score": 4, "replies": []}, {"body": "FedEx is one of my favourites. Very cheap at these levels", "score": 2, "replies": []}, {"body": "MU", "score": 2, "replies": []}, {"body": "I'm surprised no one has mentioned BRKB yet.  If I had to put everything into a single stock, this would be it.  They have a lot of quality businesses across various industries among their holdings and they're able to invest the cash from GEICO which helps fuel further growth.  The biggest risk is that Munger and Buffett can't live forever, but they've built the company to last beyond that.\n\nOn the flip side of the coin, I'm bullish on beaten down tech stocks in cybersecurity (e.g. OKTA, TENB, etc).  They maybe haven't seen the bottom yet, but look to be potential multi-baggers in a few years.", "score": 2, "replies": []}, {"body": "Danaher corp (DHR): I don't know who runs it, I don't know what it does but has a big mkt cap and the financials are strong.", "score": 2, "replies": []}, {"body": "DKNG for me . Huge upside. .. it’s still the beginning For sports gambling", "score": 2, "replies": []}, {"body": "GME, y’all ready know. Anything else is a mistake at this point", "score": 7, "replies": [{"body": "“Guaranteed returns” huh? Lol…not speculate huh? Let me know when you get all that figured out chief", "score": 12, "replies": []}, {"body": "GME is no longer a meme stock IMO.\nREV + RDBX + MU LM + BB IG etc. \n\nI still like the company though", "score": 2, "replies": []}, {"body": "I want to invest, not speculate. All the best stocks in the planet are down at this point due to the economic implications of what is going on in the USA and the world. Again, invest, not speculate. I need guaranteed returns.", "score": -12, "replies": [{"body": "That's not really fair to the commenter. You asked what their favorite stock is and they answered the question. You can't criticize their choice after asking an open question like that.", "score": 17, "replies": [{"body": "I agree. It was without conscious of the post. An accident made from a mistake.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I smell money", "score": 1, "replies": []}]}]}]}, {"body": "The only guaranteed return I know of are GICs. Everything else is on the risk spectrum.", "score": 2, "replies": []}, {"body": "Homie needs guaranteed returns 😂 go get a job then, investing is not the way for you", "score": 2, "replies": []}, {"body": "No such thing as guarantees bub", "score": 0, "replies": []}]}]}, {"body": "I like GSL atm", "score": 1, "replies": []}, {"body": "SQ !", "score": 1, "replies": []}, {"body": "Nio", "score": 1, "replies": []}, {"body": "I like to keep an eye on anything Ryan Cohen is doing.", "score": 1, "replies": []}, {"body": "Verizon. Love me some high yield dividend to enable reinvestment. Keeps rolling for me.", "score": 1, "replies": []}, {"body": "QFIN\n\nP/E of 3, has beaten earnings flawlessly over the last 2 years, healthy balance sheet, fast growth, pays about 5% dividend, will largely benefit from the recent policies...\n\nOnly risk at this point is the SEC dispute. Yes, it's Chinese. Fight me Reddit!", "score": 0, "replies": [{"body": "Sure \"beaten earnings\"", "score": 3, "replies": []}, {"body": "\"Yes, it's Chinese. Fight me Reddit!\" I am honestly discouraged to look into the stock seeing that it is matter of fact Chinese. Foreign Exchanges are not my forte, not unless, they are sold over the London Stock Exchange for that matter in which case I would be glad. Chinese stocks seem outpaced by American Stock. Maybe I will take a glance. Chinese. Gosh.", "score": 3, "replies": [{"body": "You don't have to. It carries a risk, especially as long as the SEC audit dispute hasn't been settled. Chinese stocks aren't for everyone. They're volatile, and get shit on every day on Reddit, so if you hold Redditor's opinion in high regard, you'll get spooked at soon as your holding goes down and sell, which is a perfect set-up to lose money.\n\nIf you want to limit your risk exposure, maybe wait until the audit dispute is resolved. In short, most companies, QFIN included, are audited by the Big 4, but the Chinese government doesn't want the reports handed over to the US government. They officially stated that they will allow it, shifting the responsibility for leaking national security data to listed companies, but it's not a done deal yet.\n\nAs far as performance goes, the US has entered a recession, and they'll need to increase rates at a much higher pace if they really want to control inflation. Elections are coming, and politicians will always try to make the next administration bear the cost of hard but necessary policies. Meanwhile, China has lowered their rates, recorded a GNP growth of 5% in Q1 (the US was negative), will benefit from lower tariffs with US, has signed a deal with SE Asia to trade without tariffs (including Australia)...\n\nAgain, Chinese stocks aren't for the weak-stomached, so tread lightly. But they do have very successful businesses. QFIN also has a very high institutional ownership. Morgan Stanley owns 6% of the company, Vanguard and Blackrock 5%...", "score": 3, "replies": [{"body": "I have BABA and have been thinking about building a position in Tencent. Thanks for the insightful commentary.", "score": 3, "replies": []}]}]}]}, {"body": "Nothing new here.", "score": 0, "replies": []}, {"body": "TSLA. A complete meme stock. If Elon writes anything it moves the market almost instantly. Its like having a twitter account = instant money. Also it has a lot of volatility. Great for intraday trades. Other than that Apple as it drives the NQ quite a lot. So watching it gives you often enough good money with very low risk involved. Love it.", "score": -1, "replies": []}, {"body": "RCMT has been my best lately", "score": 1, "replies": [{"body": "What do you like about them?", "score": 1, "replies": [{"body": "The fact that while all my stocks go down this was up almost every week.  A little less lately", "score": 1, "replies": []}]}]}, {"body": "Costco! You could argue its overvalued but if you ignore the stock price and look at the company and its business model its a cash cow at this point.", "score": 1, "replies": [{"body": "I'm interested.", "score": 1, "replies": [{"body": "Net incom increased 25% in 2021 to 5Billion! The company is sitting on another 5b in free cash. \n\nTheir debt is also decreasing by around 10% a year, they do have an insanely high P/E ratio which one could argue against but overall solid business, give it a look", "score": 1, "replies": [{"body": "Thanks man I'll look into it.", "score": 2, "replies": []}]}]}, {"body": "They have to increase their membership dues, but so long as the members aren't canceling, I'm not selling.  A well-run retailer with a decent moat.", "score": 1, "replies": [{"body": "Right! I’m always so surprised how it doesn’t get mentioned often and is not a “popular stock”", "score": 2, "replies": []}]}, {"body": "I agree but it does appear a tad over valued at the moment. There could be a solid opportunity to start or add to a position in the near future.", "score": 1, "replies": [{"body": "You’re right, i kept saying I will wait for perfect price until I saw a quote from the man buffet himself “Stocks are a dog on a leash and companies are the owner walking them, we tend to keep staring at the dog and its distraction rather than just caring about if the owner is walking in the right direction.” I pretty sure he said it in better words but you get the point haha. Its just that if the company is good and you could see yourself holding for a long term. Entry price atm shouldn’t be your main goal!", "score": 1, "replies": [{"body": "Buffett and Munger talk about not timing the market or not thinking about macro factors when planning their investments, but if you look at their actions, they were sitting on piles of cash doing nothing for a long time and just recently came off the bench and started buying, so clearly they care about what price they are paying. They may not be timing the market overall but they do time their purchases and entry points.", "score": 2, "replies": []}]}]}]}, {"body": "SARk.  Excellent way to get your loss back.", "score": 1, "replies": [{"body": "SARK", "score": 2, "replies": []}]}, {"body": "MMM, stability, consistency, dividend, value", "score": 1, "replies": []}, {"body": "My favorite stock has to be EQB.TO, they haven't done well lately but they are the 6th largest Canadian bank and Canadian banks have always been a great investment.\n\nPE of 5.98\nPS OF 2.75 \nPB of 0.94\n\nIncredibly undervalued especially considering they are growing faster then any of the large banks and innovative in the space by being an online platform bank where most of the big guys still make you go into a branch to do a lot of business.\n\nAlso they pay a modest dividend of 1.16 a share but plan to grow it to 4.00 in 5 year", "score": 1, "replies": []}, {"body": "Veal stock", "score": 1, "replies": []}, {"body": "Amd", "score": 1, "replies": []}, {"body": "AAPL; it was my first share I purchased  \nTSLA; second  \nASML/NVDA; my largest holdings and where I lost the most money; best lessons acquired from these guys", "score": 1, "replies": []}, {"body": "SFT because once their investments start showing a plan to increase margins they will be recognized as having a better business plan than Carvana or Vroom.", "score": 1, "replies": []}, {"body": "Tonies SE. I see a pretty solid future with a growable ecosystem for children of nearly all ages!", "score": 1, "replies": []}, {"body": "\"is said to be worth...\"\n\nThat says volumes about investing while relying on the analysis and numbers of others. I'm not picking on the OP, just noting that real analysis involves hard numbers and a rationale specific enough for others to try to shoot holes in it.", "score": 1, "replies": [{"body": "I haven't had the proper time to finish my analysis, but my concensus thus far is that Amazon is still a good company opposite of the broad market decline. That's all.", "score": 1, "replies": [{"body": "I hear you. As I said, I wasn't picking on you.\n\nA possible counter-argument to being enthusiastically long Amazon is that we're coming off a period of overvaluations very broadly. Amazon's PE is that of a growth stock. Is it still a growth company? How will its earnings do in the possibly looming recession? The company's consumer retail side had brilliant pandemic-related performance, so what happens to perception in the face of comps that will likely disappoint?\n\nAnd I'm not really responding about Amazon, but about enthusiasm in general unless its backed by some hard numbers about performance through the difficult conditions that lie ahead.\n\nI'm not making any predictions, even when I say we're likely in a recession that just hasn't yet been confirmed. Likely is the key word. However, we've just come through a period where winners were easy to find because money was practically free. The landscape is changing. I'd like to see signs that investors are becoming much harder to convince about a company's prospects.", "score": 1, "replies": [{"body": "We have to look at trailing P/Es beyond the past year to find amazon  more \"stable\" information. \nI don't think amazon is a growth company unless you factor in the AWS segment which . The truth is all that matters beyond bias is the numbers. I don't think the numbers matters in this recession because every company is underperforming. I think people j\n NMust need to understand the information they are taking in and make use of it which is what most don't do as if they're psychologically crippled by reality. Stock goes down because of market? Hold. Stock goes doen because of competition? Sell. Stock goes up? Hold until you know where to sell. Don't know where to sell? Figure it out. It's all there.", "score": 2, "replies": []}]}]}]}, {"body": "ABBV has great management that has been loyal to shareholders. They are constantly reinventing themselves with new product lines. They are a cash cow that increases the dividend by a meaningful amount each year.", "score": 1, "replies": [{"body": "I've heard of this company before. It was new years in 2021 I believe. Where does time go", "score": 1, "replies": []}]}, {"body": "Spy spy spy but if I had to choose a stock, apple…. Cuz it moves with the spy lol but I like brkb because of the spreads on their options. I like big money moves with little change in the stock price however, the stock price does make big daily moves often as well🤷‍♂️", "score": 1, "replies": [{"body": "Spy is average. Average is guaranteed. Can't go wrong with it.", "score": 1, "replies": [{"body": "Right, once u master 1-2 stocks that’s all u need", "score": 1, "replies": [{"body": "diversification is always important. Some things are difficult to foresee.", "score": 1, "replies": []}]}]}]}]}
