{"title": "Facebook ($META) has started to encrypt links to counter privacy-improving URL Stripping", "selftext": "https://www.ghacks.net/2022/07/17/facebook-has-started-to-encrypt-links-to-counter-privacy-improving-url-stripping/\n\n>There is no option currently to prevent Facebook's tracking of users via links. Users could avoid Facebook, but that may not be possible all the time. URL tracking does not help much if other tracking means, e.g., through cookies or site data, are not available. While Facebook gets some information from URL-based tracking, it can't link it if no persistent data is available.\n\nDoes this positively or negatively influence your opinion of META's stock going forward? Not asking for a morality statement :) \n\nIt's a good reminder that not only do they have billions in cash on hand, they also have many of the world's smartest people working there.", "id": "w2x8hc", "created_utc": 1658249010.0, "score": 67, "upvote_ratio": 0.87, "num_comments": 86, "comments": [{"body": "Even if the metaverse turns out to be shit, they’re still trading at 12 PE. Their revenues have consistently grown YoY at 10%+ for more than a decade. This is technically a value stock, no longer a growth stock. Reddit can shit on meta all they want, but if you take a peak at the market cap you’d see this is a screaming buy, even if you fantasize over this company failing.", "score": 14, "replies": []}, {"body": "Ive said it before. Most Meta bears would struggle to put a decent argument together based on numbers and fundamentals rather than \"feelz\"", "score": 50, "replies": [{"body": "Ok, here's a bear case.\n\n* Facebook (I refuse to call them by their new name) has a horrific reputation with consumers. Their brand is so toxic that they changed their name no doubt in part to run away from it's toxicity. This toxicity is going to hurt Facebook in a variety of ways in the future (covered in the later points).\n\n* Facebook is simply not going to trade at a sky high PE ratio like other FAANG stocks anymore. Their brand is so toxic that they've turned themselves into a modern day sin stock like MO that many will refuse to invest in for moral reasons. Reddit is a perfect example of this, a majority of the people at r/stocks will refuse to buy Facebook stock for any price. Many people blame Facebook for all the bad things that Social Media has done to society, and Facebook's past data scandals have only made them made this problem worse.\n\n* The VR/AR space Facebook wants to get into is a hot sector that's going to see a lot of new competition. And Facebook's toxic brand is going to be a real drag on them here once someone like Apple puts out a device that can go head to head with the Facebook owned Oculus. \n\n* The Metaverse is a similar story, there's going to be a lot of competition in the space. And because their brand is so toxic most people will not want to let Facebook win control of this market. They'd much rather someone like Apple, Microsoft, or some new company become the leader in the Metaverse space.\n\n* We don't know for sure how successful VR/AR is really going to be long term. People once thought that the 3D TV would be a big success, but today the 3D TV is in the graveyard. If I had to guess I suspect VR/AR will only have a limited audience once the initial \"I've gotta try this cool new technology out\" phase wears off. VR/AR can still be quite profitable with a limited audience, but imho it's highly unlikely to cannibalize other sectors of the gaming market.\n\n* As we saw with MySpace and other Social Media platforms nothing lasts forever. People move onto other social networking sites overtime, and Facebook's toxic brand, plus data privacy concerns, could help fuel an exodus to other social media sites in the future. While some Facebook bulls are fond of saying \"Facebook isn't just Facebook, they also own Instagram/etc.\" whenever someone says Facebook is dying, the fact is there's no guarantee that whatever the next hot Social Media site that steals users from a Facebook owned Social Media company ends up being will be owned by Facebook. Given Facebook's large size in the social media space, it's highly unlikely that regulators will let them purchase the next big up and coming social media site like they did with Instagram.\n\n* Facebook's social media presence is already so big today that there's very limited upside potential, outside of the entire market expanding. The only real growth they can get is by stuffing more ads onto their sites, which might encourage more users to get ad blockers or go elsewhere.\n\nSo basically I'm NOT making a \"Facebook is going to zero\" prediction. I'm stating that because of all of the above reasons I'm highly skeptical that Facebook is anywhere near as cheap as many Facebook bulls argue. I think there's a good chance that Facebook will under perform the market over the next 5 to 10 years.", "score": -42, "replies": [{"body": "I appreciate the long write up, but at the end of the day, my point still stands. Theres no good bear case that utilizes numbers and fundamentals. This write up is the same point over and over (you mentioned its \"toxic\" at least 5 times, which falls in the \"feelz\" category).", "score": 72, "replies": []}, {"body": "How many times can you say toxic?", "score": 30, "replies": []}, {"body": "Is a brand really \"toxic\" if half the world used its services, with the remaining half basically blocked by their country from using them?\n\nI think the typical liberal Redditor has quite a skewed viewpoint on Meta, because for once in history there was a Cali tech company that didn't collude against non-Democrat parties. And the media and other tech companies have not allowed liberals to forget this since.", "score": 14, "replies": []}, {"body": "Facebook updated their name because there’s a huge difference between the company, Meta, and the product, Facebook.", "score": 20, "replies": []}, {"body": "I would say the one point that can be completely debunked is the lack of adoption of VR/AR technology. That's a for sure thing for the advancement of the human race. 3D TV was a gimmick. The only reason we haven't had VR sooner is that the technology in processing power, screens, and form factor hasn't been good enough until now (and still needs some work).\n\nThe entire concept of the metaverse, or a virtual world that we live and work in, is going to be a reality at some point. It's just a matter of who will be leading the charge.", "score": 8, "replies": []}, {"body": "You could’ve succinctly summarized all of this in one word. \n\nAnd guess what other valuable brands out there are “toxic”. McDonald’s, Coca-Cola, Volkswagen, all the brands under Philip Morris & Altria, Koch Industries, Monsanto, Big oil names, etc the list goes on", "score": 7, "replies": []}, {"body": "On point #2, no other company can spend as much R&D on the metaverse unless another FAANG stock wanted to get into it. \n\nName-brand association is huge, when someone thinks of metaverse they naturally think of meta, that alone is going to be massive.", "score": 5, "replies": [{"body": "And, frankly, a significant part of the business model of FAANG companies is to just acquire smaller start ups. Venture capitalists and founders are generally happy to sell out to Meta because cash rules everything around us.", "score": 3, "replies": []}]}, {"body": "\"reeee, the brand is too toxic, nobody will invest in it\" said man about products billions of people use daily.", "score": 2, "replies": []}, {"body": "Your response just proves rampantprototyping's initial point.", "score": 2, "replies": []}, {"body": "It should be noted that the return profile of Phillip Morris investors since ~2000 is quite favorable", "score": 1, "replies": []}]}]}, {"body": "It definitely helps their display network and takes away a near-term threat to their business. I do feel that this is a temporary hack until the browser and other companies find a way to block this too.", "score": 7, "replies": []}, {"body": "WhatsApp is not monetized yet. If they monetize WhatsApp, it can break all records.", "score": 20, "replies": [{"body": "They do make money from Whatsapp.  WhatsApp for Business and WhatsApp Pay.  Plus whatever money they make from all the data.\n\nSo it's free for users to get a big user base, then charge businesses to communicate with that user base.", "score": 7, "replies": [{"body": "\\+ selling user data", "score": -3, "replies": []}]}]}, {"body": "Solved data tracking beyond apples reach, introducing meta pay to WhatsApp, cutting staff and reducing Metaverse spend while Board of Directors pushing for buybacks with their $50bn cash haul……Meta moving in the right direction but I’m waiting for results!", "score": 15, "replies": [{"body": "A $50B buyback is like 10% of outstanding shares. Thats a trick up their sleeve", "score": 7, "replies": [{"body": "Board of Directors are pushing the Zuck ….. no idea if he is listening!", "score": 1, "replies": [{"body": "They did a huge buyback in 2021, so he might just be waiting for the right time", "score": 4, "replies": []}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "CNBC said they're only spending 5% of their profits on the metaverse. That isn't bad, and you would help any tech company would spend that much or more on long shot R&D.", "score": 29, "replies": [{"body": "But this goes against the Reddit narrative so it cannot be true", "score": 21, "replies": []}, {"body": "5% so far.", "score": 8, "replies": [{"body": "Nah, VR has significant potential for entertainment and for occupational training, some investment is definitely justified. The Oculus Rift can be thought of much like the iPhone- highly ridiculed due to its shortcomings during its initial launch, but turned out to revolutionize so many things.\n\nIMO the main problem is Meta is spending too much on the wrong things. Like for example, \"Horizon Workrooms\" isn't going to catch on, people don't want to strap on a VR headset just to have a meeting that can be achieved via screen sharing and webcams. Nor are people going to want to have to throw on a VR headset to go shopping when its more convenient and faster on their phone.\n\nAcquiring Oculus was a brilliant move, but the spending is being ramped up in the wrong areas. What Meta needs is better production, better marketing, and better applications to get the average person to engage with VR.\n\nHow many non-gamers do you know that care for VR? This is where Meta needs to invest. If you can lure people in with in store demos of things like VR movies, VR concerts, etc, that can definitely get it going for the masses. But that will take substantial investment in content and marketing.", "score": 13, "replies": [{"body": "Augmented Reality where you just put glasses on and the image is projected into your own room (with the choice of full immersion) will probably catch on more. The more user accessible the headsets become the better. In 10+ years people will laugh at how massive and heavy the oculus is.\n\nThere's so many applications for AR/VR it's ridiculous. The more realistic it gets, the more black mirror esque society will become.", "score": 4, "replies": [{"body": "Tech for AR is hot garbage though, compared to to high sci-fi expectation. Hundreds of issues to solve. VR is at least mostly there already.", "score": 1, "replies": []}]}, {"body": "I wouldn’t underestimate work rooms. When I talk to older people about vr they only get interested when they realise they won’t have to travel as much for work. \n\nTeams is severely limited for working with remote staff. It’s revolutionised how we work together, but it’s still really just a conference video call with screen sharing. Obviously the quest 2 isn’t going to provide the experience required for mass adoption, but give it a couple generations and it will be pretty powerful.\n\nI like the idea of having a virtual office where you can have the benefits of working together, training of new staff and culture building without the commute. It will also help with accountability in the wfh situation.", "score": 1, "replies": []}]}, {"body": "Even if they double it, it's still only 10%.", "score": 5, "replies": []}]}, {"body": "5% profit and 50% of their market cap lmao", "score": 2, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "Just because your personal opinion of fb is shrinking, doesn't mean their userbase is. Fb has literally never had a quarter with less active users than the prior quarter.", "score": 12, "replies": [{"body": "real users of course and definitely not bots", "score": -6, "replies": []}]}]}]}, {"body": "Do people not look at the numbers anymore? They put $10 billion into AR/VR R&D while putting $40B of FCF into the bank", "score": 9, "replies": []}, {"body": "I m not sure why everyone is bashing the metaverse. Yes, VR glasses are a gimmick, but people (esp. genZ/Y) shift their spending away from physical stuff and spend most of their day plugged into the matrix through phones and computers. Zuck smells something there, but i m not sure he ll be the one to capitalize on it", "score": 18, "replies": [{"body": "You're telling me the owners and upper management of a billion dollar company know more about their own business than the armchair experts of reddit? 😯\n\nInconceivable! /s", "score": 13, "replies": []}, {"body": "Meta is advertising company. That is like if Apple shift the company into entertainment because its the future.\n\nThere is nothing unique about VR nor Meta’s ability to sell it. Maybe it turns into a stream of revenue, but in way its going to be the company’s future", "score": 12, "replies": [{"body": "I don't think the purpose of Facebook/Meta is advertising. The business is built around online connection/socialization and without that no one would use their product. Sure they make money off ads, but you need to understand what keeps your consumers coming back to your product. \n\nThe metaverse is built on the idea of a single central hub for all aspects of socialization (your job, school, social activities ie VR). This still falls in line with what they have previously done as a company with Facebook, they're just stretching it to all aspects of life.\n\nI think we're in a phase of online socialization where video games were in the 80/90's. Online socialization has to yet to evolve like video games had during that time period. If things continue to improve, there's so much potential for new mind bending technology that would be insane for people to experience living in today's world. Imagine Going from playing atari to PS5 with nothing in between.", "score": 13, "replies": [{"body": "What keeps  consumers coming back is advertisers. Without them, facebook wouldn't be able to host all those home-videos for free and nobody would use it. The social networking provides a moat for the users not to leave, but advertising provides the incentive to keep them there.\n\nI think their \"metaverse\" will be a re-do of their FB Platform that they had in the beginning, which they gradually closed when they decided to shift to news. There is talk today from facebook that they are shifting [back to focus on creators](https://www.wsj.com/articles/facebook-shifts-resources-from-news-tab-and-bulletin-to-focus-on-creator-economy-11658250433), which  I assume includes games etc.", "score": 1, "replies": [{"body": "Facebook in ye old times did not have anywhere near the level of advertising that there is now. The only reason why advertisers went to the platform was due to the fact that they had users. Without users, advertisers aren't going to care to spend millions of dollars to put their products on the platform.\n\nAdvertising is a side show to the main meat of your product. If your product is crap, your potential advertising revenue will fall with the user base because you need the user base to advertise to. What made Facebook a brand name in the beginning wasn't advertising, it was the product.", "score": 5, "replies": []}]}]}, {"body": "As an advertising company , the only other valid endeavour to invest in would be a search engine, so they can steal that piece of the advertising pie  from Google. The Advertising pie is only that big, and those two have taken all of it. But attacking google would be a huge expense , so they are going after gaming", "score": 4, "replies": [{"body": "Instagram is acting as a search engine these days. People use it to see places to eat or products search. Meta can refine Instagram to become a better search engine. Tiktok does the same thing.", "score": 9, "replies": []}]}, {"body": ">Meta is advertising company\n\nAnd Apple was once just a computer company, companies aren’t allowed to pivot into new fields?\n\n>There is nothing unique about Meta’s ability to sell VR\n\nI’d say all the IP they acquired from Oculus as well as the amount of R&D they’ve put into VR is something unique. The Quest is far and away the best VR headset on the market right now", "score": 3, "replies": []}, {"body": "Thing is the metaverse/VR and advertisment ABSOLUTELY go hand in hand..", "score": 1, "replies": []}]}, {"body": "Meta is a tech company but also they must have an absolute gold mine of data. They are one of the best placed companies in the world to understand trends and what people want.\n\nAs a gamer i hate the way games have gravitated towards in game currency, loot boxes and cosmetics, but the younger generations are now indoctrinated in it. \n\nWeb 3.0 could also be a social media killer, so meta have to diversify into complimentary services.\n\nAs you suggested, people want to be more integrated with their technology and VR is pretty obviously the next step. I think meta will be very well placed to give it to them in all honesty.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "You’re sitting here saying they have no moat while you talk trash about them trying to enter into some uncharted territory with VR etc. if they don’t expand into other areas of profitability what options do they have?", "score": 1, "replies": []}]}, {"body": "Gen Z hates metaverse, it's near universally despised on social media", "score": -2, "replies": [{"body": "> it's near universally despised on social media\n\nand what is social media?", "score": 9, "replies": [{"body": "If you're trying to imply that social media will transform into virtual/augmented reality metaverse bs I highly doubt you", "score": -2, "replies": [{"body": "no. i mean that \"social media\" communication is already part of the metaverse. and it's only going to get worse", "score": 4, "replies": []}]}]}, {"body": "Oh that must explain why oculus VR multiplayer games and Roblox are majority gen z", "score": 2, "replies": [{"body": "Online games=/=the metaverse", "score": -1, "replies": [{"body": "It’s almost impressive how everything you’re saying is wrong and you say it so confidently \n\n> Roblox, which went public 11 months ago, was seen as the first metaverse IPO. Its gaming platform is wildly popular with teens, and growth exploded during the stuck-at-home early days of the pandemic. Put simply, the Roblox metaverse is a growing phenomenon where real-life brands and trends lead to more companies working with the Roblox platform. This can encompass promotional crossovers, or the addition of game mechanics or currencies that overlap with the real world.\n\n> Generation Z (those born between the years 1997 and 2012) make up approximately 60% of users in the metaverse. This generation spends approximately eight or more hours a day online and is more immersed in digital culture than any other generation.", "score": 1, "replies": [{"body": "You cant just take online gaming and suddenly call it some new innovative industry, mmos and virtual online worlds have existed as games for decades and suddenly metamftcryprotechbros start riding on their backs. Stfu", "score": 0, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "so who are those people on Instagram", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You know that Instagram is from Meta/facebook right ? Cause you are saying they use Instagram cause they despise Facebook. So I'm not sure you know that lol. And no one uses Snapchat", "score": 2, "replies": []}]}]}]}]}, {"body": "Agreed", "score": 2, "replies": []}, {"body": "I don't buy into the Metaverse either.  I own shares but am considering dumping them for that reason in addition to further upward potential for the social media apps seem limited.", "score": 2, "replies": [{"body": "People are literally flocking to never leaving their home for the entire work day, and you believe social media ISN'T going to become bigger? Have you met anyone under the age of 30? They're socially awkward as fuck. Interacting with people in real life isn't a viable option for these people", "score": 3, "replies": []}]}, {"body": "I mean.. if they invest a small amount in whatever the metaverse crap will grow to be. I would be ok with that. I'm sure in the future every person will have a personal vr set, just like almost we all have a smartphone.", "score": 2, "replies": [{"body": "And if I agreed with that I might consider buying shares. But I don't think that will happen at all. Hence why I'm not buying.", "score": 1, "replies": []}]}, {"body": "Right!? Like remember when Apple thought they could make an IPhone?! Who needs a handheld internet device when we have computers! Apple should have stayed in the ipod industry.\n\nAt a 12PE meta is prob the stupidest investment in the world. It needs to maintain a 3% growth for their price to make sense.. 3% yah fucking right.\n\n SHAME ON THEM FOR INVESTING IN THE POTENTIAL FUTURE.", "score": 7, "replies": [{"body": "Absolutely love how every META thread people talk shit about the company and provide 0 numbers to back it up\n\nMakes me even more sure that it's a great investment", "score": 4, "replies": []}, {"body": "To be honest, while the Oculus is an impressive product, it's just that, it's not addictive and its potential is much limited. Their VR avatar is also already a festival of wokism: There are like 100 cocktail dresses for the male avatar, but no cowboy. It's clear they are throwing money away on that front. \n\nBut broadly, gaming and virtual worlds, with people dressing up their avatars and making fantasy workspaces is going to become mainstream, the way second life never managed to", "score": 1, "replies": [{"body": "Ah jesus lol I hate the wokism", "score": 1, "replies": []}]}, {"body": "That's kinda my point. I don't think it's the future, they are currently shrinking not growing at all (let alone 3%) hence why I'm not investing in them. If you think otherwise you do you, hope you're right for your sake - I like it when redditors make money. GL.", "score": -3, "replies": [{"body": "It grew in revenue 26% last year lol", "score": 8, "replies": []}]}]}, {"body": "Meta will be a shell of itself by 2030. So will Twitter and Google. They got so big and now they don't know what to do to keep their market share. Metaverse being stupid, Twitter being a bot orgy and Google continuously making their products shitter each year. Fucking search and Gmail are hot garbage.", "score": -5, "replies": [{"body": ">Fucking search and Gmail are hot garbage.\n\n**Please point the alternative search engine that functions as well.**\n\nNo, not that one. It uses the Google API in the background for the results.\n\nNope, not that one either. Microsoft made that hot garbage just to help train AI.\n\nNo, that one's just another front end for the Google API with some privacy features added on.", "score": 7, "replies": [{"body": "it's a struggle, sure.", "score": 1, "replies": []}]}]}]}, {"body": "Not convinced.  What do you expect a company that has 90% income from ads not analyze your online behavior.", "score": 1, "replies": []}, {"body": "Who keeps choosing this garbage app? Delete this shit. \n\nI say as I comment on Reddit", "score": 0, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Meta Platforms is not Facebook, it's Facebook, Instagram, Whatsapp, Messenger and Oculus VR.", "score": 16, "replies": [{"body": "And every one of those are solid names just by themselves.", "score": 10, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "You based all your arguments on \"I dont use that\". Anecdotal experiences mean exactly nothing when talking about platforms with 3.5 BILLION monthly active users", "score": 14, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Cant invest in LMT cause I dont use their fighter jets", "score": 1, "replies": []}]}]}]}]}, {"body": "TIL there are 3 billion boomers", "score": 2, "replies": []}, {"body": "Which is hilarious, but yes that seems to be true. Young people are moving past Facebook now.", "score": -6, "replies": [{"body": "Yes they definitely are moving past Instagram and WhatsApp. There are new young people everyday making money out of Instagram, drawing every generation to check Instagram everyday, Instagram is like one of the biggest economies in a social network. Influencers, ads, billions of people watching. And your argument is about their oldest product called Facebook", "score": 1, "replies": [{"body": "That's correct, the comment I responded to was about Facebook. Perhaps you'd care to reread it?", "score": 0, "replies": []}]}]}]}, {"body": "off there is an option STOP using Facebook,.problem solved", "score": -6, "replies": []}, {"body": "just walk away form Facebook, if enough people do it change will happen over night! $$$$$$$$$$$$", "score": -6, "replies": []}, {"body": "Meta talking about privacy is like fish talking about flying a plane.", "score": 1, "replies": []}, {"body": "Rumor has that Apple will launch an AR product before the end of this year 2022. I’m curious how this product will take off from Apples decades worth of physical device sales. Is wearables going to take off? This is bet you may want to take with a grain of salt? Look at the finance fundamentals of the company and then decide if META is a good investment for you. Also Midterms are coming this fall. Pay attention to the which social media platform is used most for those elections. Remember guys follow the money. Why did Nancy Pelosi buy NVDA stock? You know damn well that she has insider knowledge and her husband is the proxy that does the trades!", "score": 1, "replies": []}]}
{"title": "9.1% inflation? I don't even feel it.", "selftext": "", "id": "w2rwtc", "created_utc": 1658234840.0, "score": 3591, "upvote_ratio": 0.97, "num_comments": 93, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|97|**First Seen In WSB**|2 years ago\n**Total Comments**|1885|**Previous DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w2rwtc)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w2rwtc)", "score": 1, "replies": []}, {"body": "This is the quality I expect from a seasoned retard", "score": 154, "replies": [{"body": "Now we just need like four more of these posted every day to bring back the glory days of WSB", "score": 26, "replies": [{"body": "Working on one right now", "score": 1, "replies": []}]}]}, {"body": "“You’re just retarded! I know you are!”", "score": 237, "replies": [{"body": "Hard to tell 🥸", "score": 110, "replies": []}, {"body": "That bit made me laugh", "score": 34, "replies": []}, {"body": "My brother is actually retarded.  I now feel compelled to say this to him.  ![gif](emote|free_emotes_pack|facepalm)", "score": 19, "replies": []}, {"body": "Takes one to know one", "score": 7, "replies": []}]}, {"body": "Can't get screwed by inflation if you have no money left", "score": 49, "replies": []}, {"body": "love those DBZ memes...", "score": 110, "replies": []}, {"body": "The fucking M", "score": 27, "replies": []}, {"body": "Then you realize CPI using 1970’s metrics puts inflation over 17%.    Closer to WW1 levels than the 1970’s.", "score": 121, "replies": [{"body": "Yo is there a source for this information? I‘d like to learn more, be better informed so I can lose money but at least know why.", "score": 46, "replies": [{"body": "Just playing off the DB theme.    And the obvious CPLie of 9%.  \n\n\nEven Uncle JPow is low key like “Yea…. we don’t really believe that.   But it’s the tools we have”.", "score": 11, "replies": []}, {"body": "No, he’s spewing conspiracy laden bullshit.", "score": -12, "replies": [{"body": "Tell me you don't pay for gas or groceries or electricity without telling me.", "score": 15, "replies": []}]}]}, {"body": "What is this 17%? Losses for ants?", "score": 75, "replies": [{"body": "Since ants are smaller, they can only sustain smaller losses brah!", "score": 15, "replies": []}, {"body": "Based", "score": 3, "replies": []}]}, {"body": "you also can do a personal inflation rate, note all your expenses, change the prices for the previous and do the math.", "score": 8, "replies": [{"body": "20 year ago: live with parents\n\nToday: live with parents\n\n0%😎", "score": 24, "replies": [{"body": "this is the way, invest all the sallary so when they die you can be safe.", "score": 1, "replies": []}]}]}, {"body": "Then you realize using methodology from 52 years ago for a measurement today is retarded as fuck.", "score": 8, "replies": [{"body": "Less retarded than leaving out rent, food and energy", "score": 15, "replies": [{"body": "Chained CPI lets them replace those things with cheaper replacements.\n\nCardboard boxes in an alley, dumpster diving, and mcdonald's wifi.  All free. Inflation is 0% for rent, food, and energy.", "score": 1, "replies": []}]}, {"body": "Almost as retarded as 4% rent inflation", "score": 8, "replies": []}]}]}, {"body": "Making memes again, now with a little fried audio. Might experiment with this more in the future.", "score": 62, "replies": [{"body": "[If Vegeta is the autist, than is Goku Volcker swooping in with a big kamehameha 20% rate increase to save the day?](https://www.youtube.com/watch?v=FWcB9-SAYE0)", "score": 15, "replies": [{"body": "Goku would be the lead autist YOLOing it all on earnings puts, beating inflation by 420%, and calmly saying:\n\n*\"This isn't financial advice\"*", "score": 29, "replies": []}]}]}, {"body": "Yamcha offscreen wishing he was as cool as Vegeta, but he put his money in the Virgin Fund.", "score": 13, "replies": [{"body": "\"I don't know what this Yamcha is, but it sounds disappointing\" -Super Kami Guru.", "score": 3, "replies": [{"body": "NNNNNNNNNNNNAAAAAAAAAIIIIIIIIIILLLLLLLLLLLLLL!", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "-9.1% is beating my portfolio that's for sure.", "score": 12, "replies": []}]}, {"body": "Fuckin pui pui lol", "score": 8, "replies": []}, {"body": "Nice meme. 8/10. Still upvoted.", "score": 6, "replies": []}, {"body": "I love it. More crayons for me", "score": 6, "replies": []}, {"body": "Who’s more retarded, the retard who thinks money dosn’t matter or the retard who devalued the currency to the point where money dosn’t matter?", "score": 6, "replies": []}, {"body": "IT'S OVER 9%!!!!!!!", "score": 4, "replies": []}, {"body": "u/savevideobot", "score": 3, "replies": []}, {"body": "💀💀💀💀😂😂😂", "score": 2, "replies": []}, {"body": "Perfect ending", "score": 2, "replies": []}, {"body": "Catch these diamond hands, Powell.", "score": 2, "replies": []}, {"body": "Goat cartoon", "score": 2, "replies": []}, {"body": "Refreshing meme on this summers day", "score": 2, "replies": []}, {"body": "Holy shit fellas its been a while since ive seen quality meme support on WSB. TITS ARE FUCKING JACKED.", "score": 2, "replies": []}, {"body": "This is a good GIF OP.", "score": 2, "replies": []}, {"body": "All I see is bankruptcy", "score": 1, "replies": []}, {"body": "[https://manual.audacityteam.org/man/normalize.html](https://manual.audacityteam.org/man/normalize.html)\n\n&#x200B;\n\nfuck's sake..", "score": 0, "replies": []}, {"body": "What Street Fighter character is that?", "score": 0, "replies": []}, {"body": "u/savevideobot", "score": 1, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": []}, {"body": "It's just like the worn out prostitute that gives a discount for gangbangs, you don't feel it after you've been fucked for a few years.", "score": 1, "replies": []}, {"body": "**Well, hopefully right**![img](emote|t5_2th52|4260)", "score": 1, "replies": []}, {"body": "Art", "score": 1, "replies": []}, {"body": "Yep. One of my arms looks like that due to inflation… 👀", "score": 1, "replies": []}, {"body": "Vegeta’s gut punches just hit differn’t", "score": 1, "replies": []}, {"body": "It's stupid, when you look at the breakdown it's like 90% inflation for oil/energy and 4-5% for everything except food/energy.\n\nSaying 9.1% inflation doesn't really represent the reality of any particular sector", "score": 1, "replies": [{"body": "IDK about you but out of my monthly income a significant portion goes to food and energy.\n\n\n\n....and stonks.", "score": 3, "replies": [{"body": "I'm definitely biased there - I bike everywhere I can (which is possible in Seattle), didn't have/need a car til a few years ago, and then I got a Tesla about 1-2 years ago.\n\nA few months ago I put $40 into my dad's Honda accord. When I saw it was only half a tank I understood why everyone is bitching so much about gas, that's absolutely insane.\n\nAnd I go hunting 1-2x a year to fill my meat freezer. If unsuccessful then my friend and I split a cow from a ranch up north.\n\nWithout meat and oil/gas inflation, I'm experiencing like 4% inflation.\n\nI always find it outrageous (now that I have money) that poor people *always* have higher costs for living. I can spend a few thousand on a gun, scope, and ammo, another thousand on a freezer, 40k on a car, and insulate myself from the worst of inflation.\n\nSame with banking - minimum balances and linked qualifying investment accounts means I have no monthly fees, but someone with $100 in an account pays a service fee?! Servicing my account definitely costs the bank more than the guy with $100.", "score": 1, "replies": []}]}]}, {"body": "Which Episode is this?", "score": 1, "replies": [{"body": "Early buy saga. Before buu is released, don't know the number.", "score": 2, "replies": []}]}, {"body": "Which DBZ", "score": 1, "replies": []}, {"body": "It's over 9000%", "score": 1, "replies": []}, {"body": "Damn don’t Remember this 1 and I thought I seen every episode", "score": 1, "replies": []}, {"body": "You cut off the best part at the end where Vegeta is dancing en pointe just to rub it in.\n\nAnd then he kills him.", "score": 1, "replies": []}, {"body": "This is gold lol", "score": 1, "replies": []}, {"body": "Damn this one is fire 🔥", "score": 1, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": [{"body": "###[View link](https://redditsave.com/r/wallstreetbets/comments/w2rwtc/91_inflation_i_dont_even_feel_it/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wallstreetbets/comments/w2rwtc/91_inflation_i_dont_even_feel_it/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)", "score": 1, "replies": []}]}, {"body": "Sigh guess it’s time to binge dbz again.", "score": 1, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": [{"body": "###[View link](https://redditsave.com/r/wallstreetbets/comments/w2rwtc/91_inflation_i_dont_even_feel_it/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wallstreetbets/comments/w2rwtc/91_inflation_i_dont_even_feel_it/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)", "score": 1, "replies": []}]}, {"body": "Perfection 🤌", "score": 1, "replies": []}, {"body": "I’ve been shaving my balls with magic shave for like a month now", "score": 1, "replies": []}, {"body": "Dbz reference gets automatic upvote", "score": 1, "replies": []}, {"body": "$100 WTI support established.", "score": 1, "replies": []}, {"body": "This is the greatest thing today.", "score": 1, "replies": []}, {"body": "its not real.....its just in youes head", "score": 1, "replies": []}, {"body": "Maybe if it was 100 but less then 10? I don't even feel it...", "score": 1, "replies": []}, {"body": "Upvoted for DBZ. \n\nalso for quality ape meme", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4270)![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "Yo retards I found the original one: [DBZ](https://youtu.be/NZoPkUD0lzo)", "score": 1, "replies": []}, {"body": "no such thing as hope or hope of x or fall or better or win or bad etc, or laux about it, musclex, monx or not doesnt matter, cepuxuax, do, be, laugh, can do, be, laugh any nmw and any s perfect", "score": 1, "replies": []}]}
