{"title": "I'm out fellas (explanation inside).", "selftext": "[removed]", "id": "xn13d", "created_utc": 1344027787.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 49, "comments": [{"body": "WTF SHIT JUST GOT REAL", "score": 13, "replies": []}, {"body": "Wtf is this a scooby-doo episode?\n\n", "score": 10, "replies": []}, {"body": "This is so hilarious.", "score": 7, "replies": []}, {"body": "LOL i love this subreddit\n\nEdit: This is kind of a weird thing to do btw. ", "score": 7, "replies": []}, {"body": "Wait so you're going to forbid your services to a community of 1,158 readers because two or three people don't like you? Sounds like you're every bit of the megalomaniac I'd always made you out to be.", "score": 11, "replies": [{"body": "Just use a different username.\n", "score": 5, "replies": []}, {"body": "Dude is trolling you.  ", "score": 0, "replies": []}]}, {"body": "http://www.youtube.com/watch?v=_ok7SpbRhbA", "score": 4, "replies": []}, {"body": "Really???  No wonder I already started losing money today trading with the strategies you just taught me!!!  Now I have to unlearn all this shit.", "score": 7, "replies": [{"body": "6 hour redditor... comedy.", "score": -1, "replies": []}]}, {"body": "Oh wow, when did this happened?\n", "score": 3, "replies": []}, {"body": "That's a bummer to hear, cjp. I was enjoying lurking how your trades were going for that challenge of yours, but I'm guessing if I want to continue seeing your progress grow I'd have to head on over to /r/stockmarket. \nAside from that, just like you giving out a bit of your knowledge, you only talked to a small percentage of the people on this subreddit. There's more to it than appears. \n\nRegardless, it was interesting seeing your posts and what you had to share, best of luck in /r/stockmarket redditing, and in real-life trading and achieving. \n\nCheers. ", "score": 3, "replies": [{"body": "OP is a troll.", "score": 1, "replies": [{"body": "The biggest troll is you.", "score": 0, "replies": [{"body": "You either have too much time on your hands or an unfulfilled life to spend so much time and effort attempting to impersonate me.  I'm flattered.", "score": 1, "replies": [{"body": "Your feelings don't matter. You either answer the criticisms or you stop claiming things are not capable of. Frankly, you are either delusional or you are trying to set up a con on investors. Either way, somethings going down.\n\nWhat is your trading experience? How many years? Account size? Months of profitability? do you have a financial background? Have you statistically backtested your system?", "score": 1, "replies": [{"body": "I've answered these questions many times now...go back and research before you troll.", "score": 0, "replies": [{"body": "Bullshit. Burden of proof is on the one with the claims. You are stuck and you know it. You could easily silence critics with this as a grand opportunity but you won't. That is because you can't. You have no profitable record to show. And you no financial credentials. You are a con man.", "score": 1, "replies": [{"body": "What have I claimed?", "score": 1, "replies": [{"body": "That you have credibility as a trader. \n\n", "score": 0, "replies": [{"body": "You can go to my to http://infinitemargin.com/performance  and see how my picks perform.  Also, I post weekly watchlists at http://infinitemargin.com/watchlist.  Follow along and decide for yourself.", "score": 1, "replies": [{"body": "Okay. So you can't answer the questions. Also everyone knows you need entry and exit points and a stop loss. There is also not enough there to be statistically significant.", "score": 2, "replies": [{"body": "I've already answered them many times, troll.", "score": 1, "replies": [{"body": "Answer them again. It will be a benchmark. A unified source of all that is your con.\n", "score": 2, "replies": [{"body": "You haven't thought this out... what con?", "score": 0, "replies": [{"body": "I am sorry but there are a lot of people who think you are disingenuous. And they are right. Your con is giving the impression you are a credible trader.", "score": 2, "replies": [{"body": "Well, they are entitled to think that.", "score": 1, "replies": [{"body": "Are you a credible trader or not?", "score": 1, "replies": [{"body": "What is a credible trader?", "score": 0, "replies": [{"body": "If you don't know what it is, you aren't one.", "score": 2, "replies": [{"body": "Such strong logic of the false dichotomy sort!", "score": 0, "replies": [{"body": "Dude, you have been insulting me all day and ignoring questions. You aren't being logical.", "score": 2, "replies": [{"body": "...and this thread isn't an insult?", "score": 0, "replies": [{"body": "No.", "score": 2, "replies": [{"body": "You done pretending to be me?", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I don't answer to trolls.  Think of it as trolling the trolls.", "score": 0, "replies": [{"body": "Who here wants him to answer these questions?", "score": 4, "replies": [{"body": "You made a thread pretending to be me... what makes you think I would won't to associate with you at any capacity?", "score": 2, "replies": [{"body": "Are you going to feign emotional disturbance as a reason not to answer reasonable questions? Okay. I hereby declare cjp is a con man. And I am troll of a con man.", "score": 2, "replies": []}, {"body": "I think we all deserve some answers here, not just outsquared.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Whatever man.  I'm not in the mood for bullshit drama.  Going to bed...grow up.", "score": -4, "replies": []}]}]}, {"body": "outsquare made me laugh pretty hard. Nice troll.\n\nEdit:  p.s. you did a good job trolling, since these guys believe you are me, and reading the irc chat log gave me a heads up on some of these guy's feelings towards me. Nonetheless good laugh.", "score": 5, "replies": [{"body": "The plot thickens", "score": 8, "replies": [{"body": ">I'm glad I made my subreddit of choice, /r/stockmarket, and anyone who posts on /r/wsb is hereby banned from subscribing to my services on infinitemargin.com.\n\nThis was by far the most hilarious.  No matter the level of internet disgust I felt for someone, I'd never turn down their money.", "score": -1, "replies": []}]}, {"body": "Wow, being able to your protect your ego is the only exceptional quality of yours. Cheers. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "kinda impossible bro.", "score": 0, "replies": []}]}]}]}, {"body": "I don't get it?\n", "score": 1, "replies": []}, {"body": "What an asshole. ", "score": 0, "replies": [{"body": "Yeah the OP is a giant asshole troll.", "score": 1, "replies": []}]}]}
