{"title": "Top Stocks to Pay attention too", "selftext": "[deleted]", "id": "29sywb", "created_utc": 1404450515.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 11, "comments": [{"body": "Yeah I'll take the word of some random stranger on the internet with no backing information, who also misused \"too\" in their title", "score": 6, "replies": [{"body": "Why don't do take those symbols and do your own homework. ", "score": -5, "replies": [{"body": "Why don't you explain why we should pay attention to them instead of just posting ticker symbols randomly.", "score": 2, "replies": [{"body": "Because in 2014 ticket symbols is all you need to research. You need someone holding your hand and feeding you? Lol ", "score": -5, "replies": [{"body": "Thank you for the douchebag reply.", "score": 2, "replies": []}]}]}]}, {"body": "No one said you have to either. It's not my bad you can't idea generate. ", "score": -5, "replies": []}]}, {"body": "TSLA. Is ridiculously overpriced. How could you possibly come up with that one?", "score": 2, "replies": [{"body": "Do you know how to calculate Free Cash Flow? \nYou are saying it's over valued on a P/E Multiple method. That is only one metric. An important one, but not the only one. I bet you love utilities? smh", "score": 1, "replies": [{"body": "Look at they compound growth rate. Also Look at how proprietary there model is. Give me a legitimate competitor...", "score": 1, "replies": []}]}]}, {"body": "Thanks for the list, will do some research on some of the companies that I have not heard of, but they do look like the have some potential.", "score": 1, "replies": [{"body": "Huge potential. In the market, what you want is a story stock with a limited amount of shares floated. ", "score": -2, "replies": []}]}]}
{"title": "Stocks noob question", "selftext": "Hi guys I apologize beforehand for what might be a very dumb question but I was wondering why one company has two different stock listings on NASDAQ. For example verizon has VZ and VZA and google has GOOG and GOOGL", "id": "29t925", "created_utc": 1404460771.0, "score": 9, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Different share classes. With Google, GOOGL is the A class share that retains voting rights on corporate actions, GOOG is a C class share that does not have voting rights. The voting right has been valued ~$10 so you'll see the C class share trading at a discount to the A. ", "score": 4, "replies": [{"body": "Is it like that for all companies with two stocks?", "score": 3, "replies": [{"body": "Not necessarily, the Google situation is quite unique. I believe the difference between the two Verizon tickers you posted is that VZ is the common stock, VZA is the preferred. Preferred stock are more like fixed income then equity, as they pay a fixed percentage. ", "score": 3, "replies": [{"body": "Just to expand on that also if the company liquidates/goes bankrupt then preferred stockholders will be paid first.", "score": 2, "replies": [{"body": "This is true. Preferred is senior to common stock, but still junior to bonds. ", "score": 1, "replies": [{"body": "Good to know! I wasn't sure what the preference level was for other instruments. Thanks :) ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[Link](http://investorplace.com/2014/04/goog-google-stock-split/)", "score": 2, "replies": [{"body": "thanks for the elaborate article ", "score": 1, "replies": [{"body": "No problem. :)", "score": 1, "replies": []}]}]}, {"body": "Some stocks will have like common stock then a secondary one. (I am a noob too). Or also rather than having the stock split they will make another holding. I am sure that link helps more", "score": 2, "replies": [{"body": "that makes it a bit clearer. thank you\n", "score": 1, "replies": []}]}, {"body": "it is due to photsynthesis", "score": -5, "replies": [{"body": "Stop", "score": 1, "replies": []}]}]}
