{"title": "Apple, buy or pass?", "selftext": "Quick rundown, I'm 16 and have $12,000 sitting in a bank account collecting terrible interest. A few months ago I met with our financial adviser and he thinks we should take about $7,000 and put it into an aggressive Transamerica fund and put the rest into a Transamerica Emerging Markets fund, ticker he gave me was $CEMTX. These investments are for 10+ years.\n\nHowever, after the recent 7-1 split, I want to take $5,000, if not more, and invest into Apple.\n\nI think I'm willing to take the risk, but should I? I may go meet with our adviser again and see what he says but I'd like to see what you guys think.", "id": "2bguw1", "created_utc": 1406091264.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 13, "comments": [{"body": "Yeah, I am curious when to sell mine actually ... got in at $92 a share, not sure if I shold long term it or not. ", "score": 2, "replies": []}, {"body": "One should not be ideally making investment decisions based on a 'split'. With the split, nothing has fundamentally changed for Apple. It is just an 'illusion' that the stock is treading cheaper. However Apple is a great buy (as compared to crazily priced tech peers like say Twitter or Amazon). The latest Q3 earnings had bumper profits. It is definitely a decent buy if you are looking for \"decent\" returns. We can't expect the magic of Jobs now but it is still a great company to buy.", "score": 1, "replies": []}, {"body": "Your advisor said take it to reddit?! Thats wild. This is my adivce, apple is high right now, but it isnt going to go much lower. Iphone 6 comes out in september, the iwatch is coming out, then you have christmas, financials should be f***ing great. I am probably going to buy this probably real soon, but that is my mentality, i might get it for a few bucks cheaper but in the long run 1 dollar per share isnt that big of a deal. Look into disney as well, shanghai china is coming out in 2015, star wars, marvel movies, also a good buy IMO. Why not go 3 and 3.", "score": 1, "replies": []}, {"body": "No you shouldnt invest in AAPL because you dont know enough about investing.  You feel the stock is going to do something?  NEWSFLASH:  AAPL doesnt give a hot shit what you feel.  \n\nIf you're going to invest in the stock market, then follow Warren Buffett's advice for the know-nothing investor:  buy into a cheap 500 index fund.  He recommends VFINX.  And invest in it over a period of time.\n\nThat's if you even should be investing in stocks.  Are you going to college?  Who's paying for it?  Arent you going to need that money in a few years?  If you cant hold a stock for 10 years, then you shouldnt hold it for 10 seconds.\n\nAnd fire your financial advisor.  Youre paying him to give you shitty advice.\n\nAnd dont take my word for it.  Im some random asshole on the internet.  Go read a book by Burton G Malkiel or John Bogle, or Warren Buffet's 2013 Letter to Shareholders.", "score": 0, "replies": [{"body": "The stock was going to be long term, I'm not looking to make millions, a profit in the thousands or ten thousands. I have a few other stocks I picked on my own, $AA being my best one.\n\nI am going to college, I've obtained, and still am obtaining college credits in high school, which will save me a few thousand. I also have a few other mutual funds and a 529 plan. I'm really looking at the long term, I'm also opening a Roth IRA for myself.\n\nWhy is my adviser giving me bad advice? I didn't ask him about Apple yet, and my family and I decided we wanted to take this money and invest it for after college since two years won't give me much of a return for college.", "score": 1, "replies": [{"body": "financial advisers have a lot of pressure to push advice that's best for the company, not necessarily for you. thats why i wouldn't trust them. I dont know your financial situation but I wouldnt put that much into apple. I like 2lazy2care's advice\n", "score": 1, "replies": []}, {"body": "So do you have money for college or not?  If you don't then use this money to help pay for it.  You dont want to take on student loans if you dont have to.\n\nYour financial advisor is giving you bad advice because you should be investing in America instead of emerging markets.  And ditch the mutual funds.  75% of mutual funds dont beat the S&P 500.  Like I said, dont believe, read some books on it.  The only people pushing mutual funds are people that stand to profit.", "score": 0, "replies": []}]}]}, {"body": "I would honestly listen to your financial advisor. I don't know that fund in particular, but pretty much any fund is a better first investment than any particular stock. Put it in a solid ETF for a sector you are bullish on (or a whole market) and then move it once you know more about companies you want to invest in.\n\nPersonally I wouldn't put 40% of my capital in any single company. Take a few months and watch [these](https://www.khanacademy.org/economics-finance-domain/core-finance/stock-and-bonds) and some of [these](https://www.khanacademy.org/economics-finance-domain/core-finance) then pick a stable of 4-10 stocks and split your funds pretty much evenly between them.\n\nIf you want to gamble on risky investments and speculating, open a second investing account with no margin and the expectation that you will lose every dollar that you put into it, then put in a small percentage of your capital and use it to learn.", "score": 0, "replies": []}, {"body": "a little pricey right now i think\n", "score": 0, "replies": [{"body": "I really feel that the $94 mark is the cheapest it'll get now.", "score": 2, "replies": [{"body": "It wasn't a blow out quarter. For that reason alone,  it'll get cheaper.", "score": -3, "replies": []}]}]}, {"body": "Look at other tech stocks. Facebook, amazon, etc. I'm looking at tablet and electronics parts manufacturers ", "score": 0, "replies": []}, {"body": "are these managed funds that take a %? if they are, F them.  \nI'm long aapl. it will definitely hit 100. it has in the past ($700).  \nthis quarter was interesting in that there wasn't a huge swing the day of the conference call, there was no huge swing during AH, and today theres just a slow steady climb.  \nwhat im saying is that the rocky part is behind us, and until the next quarter, it is smooth sailing", "score": 0, "replies": []}]}
{"title": "We’re in the third biggest stock bubble in U.S. history - repost from /r/economics", "selftext": "", "id": "2bi3x2", "created_utc": 1406129675.0, "score": 22, "upvote_ratio": 0.77, "num_comments": 18, "comments": [{"body": "Yeah... I'm glad they already know what the 30 year returns on stock investments made in 1999 are.  Dumb article is dumb.\n", "score": 6, "replies": [{"body": "1968 + 30 years = 1998... \n\n1929+ 30 years= 1959\n\n1906 + 30 years = 1936\n\nI don't have a chart that goes back to 1853... but I have the chart for all three of these and all three times the market has been higher after 30 years.. http://allstarcharts.com/wp-content/uploads/2011/05/5-26-11-DJIA.jpg\n\nBut you have to remember people typically put money in over an extended period of time and don't just buy at the peaks so even if you were an idiot and bought the worst possible day each time, you'd have made money after 30 years.. ", "score": 3, "replies": [{"body": "So you expect the US to continue to grow at the same rate it did from the 1950s to the 2000s (4-7% real GDP/yr)?", "score": 1, "replies": [{"body": "I expect this is a loaded question. But I do expect growth rates to normalize. ", "score": 1, "replies": [{"body": "Just curious if you expect something that hasn't happened in the last 5 years (in fact it's been worse than at any time without a recession in US history, almost every year) to completely reverse and happen again consistently for 40+ years.\n\nReason I ask is, if it stays at 1-2%/yr like this indefinitely, the US just winds up becoming Japan.", "score": 1, "replies": [{"body": "I'm not sure I understand your question or statement. \n\nAre you trying to say because we have had slow growth for the last 5 years we are doomed to have slow growth forever? \n\n\n", "score": 1, "replies": [{"body": "No I'm saying that you have absolutely no basis to believe that the US economy will perform anything like it did before, given the highly competitive international stage the world is in now (and the US's strategically poor placement in it historically).\n\nPoor basic research spending and rising nations with much larger populations who are willing to spend far more than us in many areas (minus the military) doesn't bode well.  Beyond that, the US just isn't growing, and I can see no reason baring the US building out nuclear power plants en masse and exporting tons of shale natural gas that it will again in the next 10-15 years.\n\nFor example, 2012 we increased 2.8%, 2013, 1.9%, 2014 looks like a solid 1.5% or less (if we're lucky with Q3/Q4).  If you take a look at historical data it's far better (at no point has the USA seen below 2% outside of recessions):\nhttp://www.fin.gc.ca/ec2008/images/ecc1_5-eng.gif", "score": 2, "replies": [{"body": "So you're big into high yielding stocks? \n\n", "score": 1, "replies": [{"body": "No, I'm into emerging markets and was gobbling up Petrochina, Sinopec, FXI etc in February (and did another cycle last summer with many of the same, including CHU and such)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This is exactly correct. ", "score": 1, "replies": []}]}]}, {"body": "For the obvious haters who will comment on this.  This pretty much is saying what will inevitably happen to the stock market.  When you have historical data that can coincide with the present, it gives a huge understanding of what is happening now.  This stock bubble is real and will eventually happen.  The data for 30 years of investments obviously shows it goes back up higher after, but before that happens your money is stuck and you can either take a major loss or have no access to it the down time periods.  ", "score": 1, "replies": [{"body": "Part of investing is rolling with the punches. If you planned correctly and diversified well, you should be able to sit through the market downturn and make more when the market pops. The problem is people getting near retirement age don't reevaluate and sit in the same investments they had since their thirties. They're at a point in their lives where they can't afford to take a 30-40% hit, but they are still in securities which have the risk to move in those magnitudes.", "score": 1, "replies": [{"body": "Yea the key is getting in on the down turn at the right time.  This has already happened once and I missed the boat.  I won't let that happen again while everyone is freaking out.  It just depends on how much the bubble is played out by the media and how the hive mind reacts.", "score": 1, "replies": [{"body": ">Yea the key is getting in on the down turn at the right time.\n\nNo.  No it isnt.", "score": 0, "replies": [{"body": "So you don't buy low and sell high? I'd like to see your strategy.  Unless your shorting.", "score": 1, "replies": [{"body": ">I'd like to see your strategy.\n\nThen you shouldnt have downvoted me.  gfy kid", "score": 1, "replies": [{"body": "Lol maybe its because you have none and have no idea what your talking about?  Just another arguing redditor.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I'm sorry. I just can't take this serious. Every time I read \"Smithers\" I giggle a bit inside and think that Mr Burns told him to say this. ", "score": 0, "replies": []}]}
{"title": "How to buy stocks", "selftext": "  Good people of internet, I want to invest in stocks **but**\n\nI live in a country called Georgia, even though we have a well developed Foreign exchange market, our stock market is so undeveloped that its existence is still a question, Maybe it exists maybe not who knows. Because of this I want to invest in foreign stocks and I want to keep them.\n I am aware that there are various websites that you can buy stocks on, but this is what I do not understand.\n\n So for example: If i will buy 1000 Intel stocks and every year add 500 more, and after 10 years the website I was using will go out of business will I lose all my stocks ?? and what happens to dividends, will I get them directly or it will placed on stock traders websites balance ?? Will all of thous stocks be registrar on my name or websites name ?? \n Thous are the questions I am having so can anyone help me.\n\n Thank you very much for your time\n ", "id": "2bi9pe", "created_utc": 1406132772.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "I think there would be an issue with citizenship because most of the websites require identification. Other than that, the stocks are still yours if the site goes out of business but you still should pick a website that is one of the larger companies to be safe.", "score": 2, "replies": [{"body": " Really?? as far as I know us law allows foreigners to own capital in US, Hope someone knows that for sure and will provide information that I need. \n Anyway thank you for the reply.", "score": 1, "replies": []}]}, {"body": "Apply to any U.S. brokers you want. If they don't approve your application, ask them why, and what you need to do in order to be approved. If they approve you, then great!\n\nPersonally, I started trading by using a link on my bank's website. If you have an online account with a bank you might try looking around there for a similar link. \n\nAlternatively you could invest in currency by going once a week or so to an airport and exchanging one currency for another.\n\nYou're probably wanting to get in on some good tech company though, with a higher growth than currency will offer you. In that case, you might consider alternative investments like (don't laugh) bitcoin or possibly find a tech company in Georgia that is looking for investors. \n\nTruthfully, I'd stick with slow and steady investments though - and currency trading if done correctly, offers limited downsides. You'll always have the money in your pocket. Being from Georgia, you probably have an insider's perspective on situations that Americans don't have. You can leverage that knowledge to make money. ", "score": 2, "replies": [{"body": "Thank you very much for a detailed reply.\nSo I should contact a broker and not an online service like etrade.com (This is the first thing google showed me).\n About banks in Georgia sadly they do not offer such a service, banks in Georgia offer. \n\n As for Currency exchange goes there are couple of problems here, First the government keeps the national and and foreign currency at one stable rate. As for information goes well, I believe that we have no edge here, well maybe I might have more information on post soviet countries, but thous countries by themselves are Mysteries. For example you might have noticed that there is a conflict in Ukraine and you might have noticed that USA is trying to effect Russia's economy with various sanctions, but the crazy thing is that when USA announced sanctions this Russian stock markets indexes want up.\n\n However there are services that offer low risk high return investments (they work on currency exchange). \n\n Bit coin well i do not trust it, I believe it is not to far from getting regulated by countries and law, then what i believe it will lose it's price.\n\n In a nutshell what i want is a stable investment, that will offer a small dividend but is things get tough I will have no problem selling them with at least similar prices as I've bought them.\n \n Thank you very much for the information, it is very helpful, I will think about the currency exchange.", "score": 1, "replies": [{"body": "The major business of etrade.com is as a stock brokerage. So yes, apply to them for a trading account. If they deny you, ask them what you need to do in order to get approved. \n\nJust make sure that you don't give your money to anyone to invest unless it was you that reached out to them. There are plenty of slick people who would love to take advantage of your situtation.\n\nThe situation with Russia sounds like a potentially profitable ordeal. Sometimes, if you learn to look beyond the drama and into the future - you can see weakness in the market that will likely resolve it's self before too long. Maybe it's about the oil pipeline that Russia wants to build? Maybe if oil is pumped through your country, people will become wealthier? What would they possibly spend their money on, that you can buy right there in Georgia? \n\nHow about wine? Is there a chance that you could buy some high quality bottles of wine, and hide it away for a couple of years, and wait for the value to increase? If you were to become knowledgeable about investing in wine - is there a chance that other Georgians might seek out your knowledge - due to their inability to invest in the stock market? Would buying all the expensive bottles of wine drive the price up and create a price spike?\n\nYou see what I'm getting at? You need to see the advantages of your situtation. Don't focus on your inability to buy and sell stocks. \n\nAs for Bitcoin, currency trading or any other investment (including wine) - you should only trade what you are comfortable with. \n\n\nGood luck!!", "score": 2, "replies": [{"body": "Thank you again for an informative reply.\nThere is a question that is bugging me:\nFor example I registered on X website but either it want out of business or I want to switch to Y website, Is it possible to transfer my stock list to  that website, and if yes how much paper work would be necessary.\nThank you again for your replies", "score": 1, "replies": [{"body": "Just take your money out of x website. Then put your money into y website. I don't know how much paperwork will be involved.", "score": 2, "replies": [{"body": "Yes, I understand but I am thinking more about such a turn of events.\nFor example if I invest 140 000 first year and 15-20 every next year, after 20 years you might get some money from dividends. \n Sure you might think why am I asking such a question on reddit and not asking lets just say professionals. \n Well my father is one of the best professors in economic science field in my country but when I asked about stocks, he told me about theoretically how they work but in reality he said there is no stock practice in this country so I do not know. \n So I want to know if it is possible to invest in stocks and keep them, I am not talking about generating money from trading them. So is it a viable option to keep the stocks ?? or I am talking about nonsense, and if you want some gain from stocks you should invest millions ??", "score": 1, "replies": [{"body": "You have plenty of money to make it worth your while. Apply to etrade, and see what they have to say.", "score": 2, "replies": [{"body": " Thank you again for the reply.\n The reason I am planning to invest in stocks because Real Estate (where I have assets in) will go down, because my parliament passed a law to exempt house building companies from VAT. I believe there will be a lot of new buildings in my country and the prices will go down. \n Thank You again for every thing. I wish you the best of luck. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Priorities man, move into a 1st world country and then start investing.", "score": 0, "replies": [{"body": "Capital Idea, good thing that first world country representatives are knocking on my door and begging to accept their Job and citizenship.", "score": 4, "replies": []}]}]}
{"title": "GTAT ready to bounce, earnings on 8/4", "selftext": "I'm a big fan of this stock - rode it from $4 up to $18 then sold, and I think today's little dip is a great opportunity to get in long. Although there seems to be some doubt on the usage of their sapphire screens on the new iPhones, Apple has invested enough money in GTAT that they simply cannot abandon them altogether AND GTAT's other products, especially in the solar arena, still give them growth potential. Would like to get a discussion going", "id": "2bhshp", "created_utc": 1406122848.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 11, "comments": [{"body": "Im quotimg this from another source. I added more to my position today. Also somebody bought 127k shares after hours today and sept 20th, $20 strike were flying off the shelf today. Hes the technical analysis im quoting\n\nOK- girls\nWe're going to break out of the proverbial pack here- because... well we can- we have the technology.\nThis will help give us our own analysis of the GTAT/Apple facility capability and even put yield issues into a context-\nWe've been listening a lot to different numbers and trying to assign quality-of-belief to them. So I thought we'd just put our own set together to measure against those from others.\n\nIt's boring- but here we go:\nLet's start from the top- When GT released their new ASF165 commercially early this year- they could do 165kg sapphire boules all day long ('at a much reduced cost of operation'). At that time they also said they had 'already developed a more advanced ASF technology capable of producing boules significantly greater than 165 kg. The company intends to keep this more advanced ASF system captive for some extended period of time.' This statement and some other sleuth work produced very solid evidence that Apple locked up the new system for the GTAT-Apple MESA plant. That's what produced the 200-235kg boule furnace (by the way - competitors had done this as well). Given GT themselves said significantly greater then the ASF165, we'll conservatively use the lower end of the range of 200kg boules for each ASF. This also lines up perfectly with their roadmap from 3 years ago to reach less than 1/2 cost and 8\" diameter boule with a scalable ASF (that 1/2 cost by the way correlates perfectly with the now GT quoted $12 screen price vs $25 former)\n   \n\nSo all that to somewhat be comfortable with the ASF producing 200kg boules (may in fact be up to 235kg), and 8\" diameter size. Remember most all analysts now accept this as fact as well- not much conflict here.\nIn addition. the MESA furnace count has been pretty well acknowledged to be 2000 - 3000 (plus whatever MA has 300? - we won't count those).\n\nNow the blind faith part has until now, come in the form of how many iPhone screens can be made per furnace per year. Sleepy took a crack at sapphire per ASF with 4000kg. But other analysts haven't divulged how they got the number and who knows maybe they all use the same wrong source. So we're going to make our own computation from scratch, and see where that puts us. Some try to figure the slice and boule size- we're going for more accuracy using the actual rated weight- 200kg.\n\nThe new (4.7) iPhone dimensions are approximately 6.5cm x 13cm > 85cm2 (skip the larger one for now, you'll see why later- but it fits on the 8\" (20cm) diameter boule anyway, so really doesn't make much difference and the bigger volume by far will be the 4.7)\nthe current thinnest GGlass (iPhone 5) is 600 micron (.06cm), so let's say conservatively, the sapphire is no thinner than that- so 85cm2 x.06cm = 5.1cm3 sapphire volume per screen.\n\nThe density of sapphire is 4g/cm3, so each screen at 5.1cm3 will weigh 20.4g.\n\nAn 8\" (20cm) diameter 200kg boule at 4g/cm3 yields a per boule volume of (200,000g / 4g/cm3 =) 50,000cm3, and a length of (50,000cm3 / 10cm radius squared x 3.14 =) 159cm.\nLooks about right from this picture of full boule in the smaller furnace:\n \n(The 159cm boule lengths are likely cut into 4 sections of 40cm with the Meyer Burger cutters all reports show they sent to MESA)\n\nBricking the boule (cut into straight sides for screen slicing)- eliminates 37% of the boule, but doesn't effect the number of screens per boule as the bricks are the same length (159cm) and cut to X screens per slice- (side note the 37% is useable for smaller pieces- iWatch, camera lens, home button, so not all waste when considering cost). This 37% comes from simply geometry converting 8\" (20cm) diameter to square sides delivers 14cm equal side square (note for the bigger screen you can brick a taller, narrower dimension).\nThe calculation uses total boule volume of 50,000 cm3, then total brick volume of 14cm x 14cm x 159cm = 31,200 cm3 brick volume for screens (63% of the boule 50,000 cm3). We must remove the 37% weight from our weight based calculation since that cut off weight is not used for the screen. This makes each Brick 200kg x 63% = 125kg (remember this is likely very conservative as 235kg x would be 148kg). So in summary, we have each boule-Brick measuring 14cm x 14cm weighing 125kg. From that, we now slice our .06cm thin screens. Since they measure 6.5cm x 13cm, we miraculously get 2 screens per slice. Now isn't that a coincidence (I think not)- taking 13cm x 13cm of each 14cm x 14cm brick- so 13x13x159/14x14x159 of the brick is actually screen = 86% (14% final trim waste); So our 125kg Brick uses 125 x 86%= 108kg for actual screen\nEach screen measuring 6.5cm x 13cm x .06cm in sapphire 4g/cm3 density weighs (6.5 x 13 x .06 x 4 =) 20.3g\nSummary:\nEach Brick (from Boule) consists of 125kg x 86% = 108,000g for the actual screens sliced\nEach screen will weigh 20.3g\nBy itself, this would mean (108,000/20.3 =) 5,320 screens per Boule. But we're not done because cutting the screen has it's own waste from the diamond cutter kerf (cutter diameter)\n\nFirst, can we even slice that thin without Hyperion? and if we do how thick is the diamond wire slicer, which eliminates it's own thickness as kerf loss of sapphire when cutting. For answers we look to the Meyers Burger sapphire cutter systems Apple bought in 2013 for installation throughout 2014. Although, they never mentioned the customer per usual, this comes from Meyers Burger own ER reports and they in fact do have the world's leading system for this. It's the Meyer Burger DW 288 most advanced. It is a completely automated system, that has many multi-wires per cut cycle (multiple slices per brick cut for high throughput). Let's have a look at the specifications of this Apple purchased system and cover some of the post processing issues, until now left to our imagination:\n\n \n \n \n\nWe draw particular attention to it's boule diameter size capability of 8\". That MUST be yet another complete engineering coincidence pfftt..\n\nIn addition, we note it can slice sapphire sheet all the way down to 100 microns. 6 times the thinness we require. hmmm-- pretty good; We also observe it can use multi-wire diameters all the way down to 100 microns. Let's see what that does for us. We have to cut a 600 micron thin slice; Let's give some slack and use 120 micron diameter diamond cut-wire (Meyer Berger sold the wire to Apple with the systems- some $3m worth in fact). That would produce 120/600 = 20% kerf factor (this is where I got my number- shared earlier).\n\nfrom our Summary above:\nEach Brick (from Boule) uses 108,000g for the actual screens sliced\nEach screen will weigh 20.3g\nProducing 5,320 screens minus 20% kerf loss = 4,256 screens per Boule.\n\nWe know the furnace Boule cycle time is approximately 18 days (GT cycle time for the currently available ASF). They aren't giving the time for the larger one, but should be very similar (crystal growth is not a function of size but of heat and cool cycle). But lets be conservative once again and use a 20 day cycle (remember it's completely automated, so runs 24x7). Each ASF then can make 365/20 = 18 Boules per year\n18 Boules per year x 4,256 screens = 76,600 screens per year per ASF x 2500 ASFs =\n191,520,000 screens per year for the MESA plant.\nIf they actually have 3000 ASFs = 230m screens per year.\n\nGiven iPhone6 part of a 200m record breaking year (say 70% to account for legacy and 5c production)- 140m would be sapphire.\nthat provides a 30% cushion for yield and other issues over a year's time.\n\nWe now have our own analysis that validates the numbers being thrown around as if they come from some magical place.\n\nYou can nit-pick and argue of course with little pieces of assumptions- but none of it will substantively change the biggest problem. IF you believe Apple-GTAT actually built the plant and put the furnaces in and bought the Meyer-Burger post equipment ( virtually a given for the evidence)-- Let me turn the question around? What do you think Apple-GTAT meant to do with all that? And if there are yield problems (somehow new from the years of experience) that are unsolvable, to throw all of that away? Are you really betting against that scenario?\n\nThis forum now possesses it's own independent analysis of the numbers. Make your own decisions accordingly.\n\n\np.s.\nFinally- regarding Corning 20% increase in GG;\nGiven (as Nova points out) only 47% comes from top 3 clients, one of which surely is Apple. Let's say 35% from Apple. Since Apple is ordering record 100m 2014 - 50% higher than last year alone. Given 1/3 of that is likely legacy (even in our own numbers) - how is that not consistent with 20% overall, if the other clients are adding 20% themselves? And if the other 53% is adding ? 30% ?- it all fits.\nThe question should be with Apple (fully 1/3 of GG business) adding 50% to iPhone orders, how is GG only growing 20%? Answer, because it's not on the iPhone6.", "score": 5, "replies": []}, {"body": "Up 12% after hours", "score": 3, "replies": [{"body": "Looking good so far.  Hopefully the CC can further the short covering.  I was getting worried when it hit the mid 13's yesterday, but at that point I figured any bad news was mostly priced in.  (was actually figuring a leak of numbers, but not the content, but not sure about that now, as the margin/earnings raise is big, and I think everyone suspects on the conservative side.)  Actually had a bit more on the table than I wanted, as I was going to do a quick trade, but missed my sell point by a penny so ended up holding, which I was fine with either way.  Rather be lucky than good in the short term as they say in poker.", "score": 1, "replies": []}]}, {"body": "I rode GTAT from 9.75 up to 13ish and sold. Since then i've awaited another solid entry point. Today might be the day I get back into it.", "score": 2, "replies": [{"body": "did you get in?", "score": 1, "replies": [{"body": "In at 14.80 out at 14.60", "score": 0, "replies": [{"body": "Funny what a few days does to your perception.  I would say it is worth buying calls to have some exposure during earnings, but the calls are expensive, and I don't think the gag order will be lifted enough for people to get excited.  Will be inline earnings, with a muddled forecast for the future.  With the market down big overall today, Monday could be a particularly good entry point (or Tuesday or whenever it is you can buy after the earnings release). ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "did you get in?", "score": 1, "replies": []}]}, {"body": "amazing.", "score": 1, "replies": []}, {"body": "Is this the next NQ?", "score": 1, "replies": [{"body": "hahaha damn it this sub needs to be renamed. It's not, and although I admit to (successfully, luckily) betting on NQ, GTAT is a farrrrr different stock for innumerable reasons. A quick search will answer your question", "score": 3, "replies": []}]}]}
