{"title": "AMZN is a joke", "selftext": "So now India is the next target to lose money on.. \n\nIt sounds great they are looking for $1 billion in revenue.. \n\nBut to get that they need to spend $2 billion... \n\nSo assuming they are able to earn 7% margins there (which knowing Amazon that's never going to happen) that's $70 million a year in profit... \n\nTo pay off that $2 billion assuming no taxes on the profits and no interest on the loan as they don't have $2 billion in cash... It will be 28.5 years to pay off this investment. (Now I know some will say they can grow revenue over that time period but I'm assuming that growth will be what pays the interest and their taxes however that's an optimistic assumption). \n\nThis is the company, this is how they grow revenue... This is their outlook.. \n\n(For disclosure I'm long AMZN puts and loving life). \n\nEdit, just closed my put position. I still think this is going down but don't want the decay from the weekend. \n\n", "id": "2c58p5", "created_utc": 1406732074.0, "score": 5, "upvote_ratio": 0.77, "num_comments": 15, "comments": [{"body": "They generate 80 billion in revenue, surely they can afford to cut costs, alienate some customers, or provide additional services to increase margins and profits.\n\nAMZN dominates the market and have amazing leverages, it's just a matter of time before they become more profit oriented. I've made similar statements regarding Facebook a year back and I expect AMZN to offer good returns years down the line.\n\nI have no position in AMZN, but will take a position at the right time.", "score": 3, "replies": [{"body": "> it's just a matter of time before they become more profit oriented.\n\nPeople have been saying that for over 15 years...", "score": 1, "replies": [{"body": "And they're still growing at an amazing pace year after year, so why would they stop their model?\n\n\nAMZN is starting to dominate the growing IaaS market as well.. $300 will look cheap in a few years when they've complete control of web related and service markets.\n", "score": 2, "replies": [{"body": "They are going to grow revenue's by $1 billion dollars in India... \n\nGuess what it's only going to cost them $2 billion to do that, don't worry that will only take 28-60 years to break even... I'm sure investors are willing to wait on that... \n\nOh and AWS... yeah growth is slowing there... Don't hold your breath as that being the savior there... http://bits.blogs.nytimes.com/2014/07/25/challenges-for-amazons-cloud-computing-hopes/?_php=true&_type=blogs&_r=0", "score": 0, "replies": []}]}]}, {"body": "Clearly they have the ability to do this but it will cause multiple compression. What's a growth company worth if they stop growing? I'd argue they'd be worth less than a 30 PE \n\nAssume they are able to increase their earnings 5 times 5* 0.38= $1.90 in earnings... $1.90* 30 = $57... But a 30 pe is very rich for a company not growing (which Amazon grows by losing money and having almost 0 profit).. \n\nEven if their earnings increase 10 times... $3.80 * 30 = $114.... \n", "score": -3, "replies": [{"body": ">5 times 5* 0.38 \n\nA completely pointless number. Considering that Amazon's 2013 EPS was 0.59 with net income at 274 million, an 10 times earning of 2013 for a company at 80 billion revenue can be simply achieved by having a 3% margin.\n\nFor 0.38, you would need far less.", "score": 1, "replies": [{"body": "This is not a pointless number you're saying they should be able to increase their profits I gave you calculations on 5 times their current profits and 10 times their current profits. \n\nI get it, $80 billion sounds like a lot. \n\nI get it, Bezos sounds like some day he will just be able to dial up earnings and make boatloads of money. \n\nBut what if he can't? What if the reason I buy something on Amazon is because it's cheaper and I get free shipping? What if you have to start paying sales tax on online purchases? What if more companies come in and compete with AWS and compress margins? What if Amazon is forced to take a loan out to cover the $2 billion invested in India to make $20-70 million (in profits) a year? \n\nI get why people like this stock, but I don't buy the reasons it's worth what it is. Today's price has priced in perfection. \n", "score": -1, "replies": []}]}]}]}, {"body": "I read your post, where's the joke part?", "score": 2, "replies": [{"body": "The fact that people are still holding this stock for their revenue growth, and in hopes one day in 30 years they might be able to increase their margins. ", "score": -2, "replies": [{"body": "You're under the assumption that revenue growth and margins over the long term are the reasons people are holding this stock.  While I agree with your assertion that such reasoning is foolish, there are other reasons to hold this stock.  If you think Amazon is never going to go back up to 350 or 400, you are a fool. It will eventually break these barriers in the next year or 2. When it does, I will sell it, and I will make money.  \nTLDR: I hold AMZN because its going to go up in value, fundamentals be damned.", "score": 1, "replies": [{"body": "How is it going up in value? Just because you say so? \n", "score": -2, "replies": [{"body": "Yes, that's exactly how the stock market works. Get this man a medal.", "score": 2, "replies": []}]}]}]}]}, {"body": "This is a fundamental approach to trading. \n\nIt doesn't assume things like market control, or things they can/will do in with there level of dominance.  \n\nI.E. Shipping/Cloud services.\n\nIt can be beneficial to operate at a loss. ", "score": 1, "replies": []}, {"body": "[amazon is unprofitable](http://www.boston.com/business/technology/2014/07/25/amazon-unprofitable-and-completely-purpose/ZUtEQOW7EvYvERGuFuURMI/video.html)", "score": 1, "replies": [{"body": "I get what they say they are doing and what their hopes are for the future. \n\nBut if they aren't worried about profit... then why did they increase the price of prime? If they aren't worried about profit why did they increase the amount spent for free shipping? \n\nI'm sorry but I don't think Amazon is trying to grow to dominate the world any more... that's never going to happen... They are trying to grow to grow otherwise their stock is worth like $20-30... \n\nWe've seen them start already to try to grow earnings and have failed... So what is left? Spend like crazy in hopes you can grow into your insane valuation, and hope to god the share holders will go along with you and not question you. \n\nIt's pretty clear (by every time I post on here about amazon) that the shareholders of Amazon do this currently... The question is will it remain this way for how long? ", "score": 0, "replies": []}]}]}
{"title": "Can someone help explain this difference in price?", "selftext": "Hi all, thanks in advance for any help! \n\nI was reviewing a spread betting strategy that I have been using on the Dow Jones Industrial Average. The strategy seemed consist using intraday data that I was using to back test. The data was downloaded from finam.ru (http://www.finam.ru/analysis/profile041CA00007/default.asp#) But there are some discrepancies between the data i downloaded and the real time actual values. \n\nFor example on the 10th July, at 09:30 data from Finam.ru said the price was 16835.86 where as on SpreadCo (the spread betting broker i use) said it was 16,948.40 - which is a huge difference. \n\nAnyone got any helpful thoughts? \n", "id": "2c6gxd", "created_utc": 1406755599.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 10, "comments": [{"body": "one is likely the price that it closed at on the 9th and one is likely where it opened at on the 10th", "score": 2, "replies": [{"body": "Thanks, that might explain it. So the 9:30 price was still given from the previous day close? ", "score": 1, "replies": []}]}, {"body": "What is spread betting?", "score": 1, "replies": [{"body": "https://www.youtube.com/watch?v=oPZguyJgXs8", "score": 1, "replies": [{"body": "Thanks for the link. I can't believe people engage in this. I've seen people lose money trading penny stock, and buying options contracts, but this is a new level of gambling. ", "score": 1, "replies": []}]}]}, {"body": "Thanks to HFT, you can never know what the \"real time price\" is for anything anymore.....", "score": 1, "replies": [{"body": "HFT? Thanks for the response! ", "score": 1, "replies": [{"body": "it stands for high frequency trading, which itself is a very simplistic label on a very complex process .... this is not the place to try to explain it but you should be able to find a whole lot of good and bad info by googling it ....", "score": 1, "replies": [{"body": "Cheers for the help. I'll have a google.", "score": 1, "replies": []}]}]}]}, {"body": "Gambling, it is more fun than investing.", "score": 1, "replies": []}]}
