{"title": "Reddit Survival Guide: Common Misconceptions About Investing", "selftext": "Ever since the influx of retail investors over the past couple years, there are a lot more newbies on these boards and I hear a lot of phrases misused or quoted incorrectly. Here are a handful I've seen that, by debunking/clarifying, hopefully saves people some trouble:\n\n  \n**Misconception #1: 'Invest in what you know - Peter Lynch'** \n\nThis one is wrong out of omission. Peter Lynch never said that it was sufficient criteria for you to invest in a product or company **only because** you were familiar with. It was merely a starting point. You still need to do research on the fundamentals, like profitability and valuation, before you actually decide to invest in it. \n\n**Misconception #2: Time in the market beats timing the market**\n\nI hear too many people use this to justify stock picking. This should only be used when talking about buying the market itself, i.e index funds. Just because you hold a stock for 5 years doesn't mean it'll rise in that time, and if you make solid profits or see a good entry point based on valuation, then you should definitely sell or average down respectively. A company's prospects could change on a dime and one should be prepared to act accordingly. What time will allow, however, is median reversion, but that could go in either direction depending on if the stock is trading cheaply or richly. \n\n**Misconception #3: The stock went down after I bought it, so I was wrong and/or the stock went up after I bought it, so I was correct.** \n\nInvesting is at least as much about having a strong stomach is it about being smart/correct. Too many people feel complacent after their stocks or the market does well and feel downtrodden after the market crashes. The price is just what the market is willing to offer you to buy or sell. It is not an indication of the 'correctness' of your decisions. The market price is simply a means of selling things that are trading at a premium to your calculated value, or buying things trading at a discount. \n\nIf something you bought 'on sale' becomes even cheaper, and nothing else has worsened about the picture other than market volatility, then one should be inclined to average down. And likewise, if something rises far above what you think a stock's intrinsic value is, selling would be prudent. (unless one is holding for long-term capital gains, but that's another story) If you don't have a price target yourself (not an analyst's), then you should calculate one before you initiate a position. \n\n**Misconception #4: The company's doing great, so it must be a great buy!**\n\nA great company does not make a great investment. Valuation always matters in the end. If you buy a company performing amazingly like most tech/growth companies in 2021, but buy them at 50x sales, then you're going to have a bad time. Eventually, when valuations matter again, they will crash, as they did this year. There have been far too many story stocks over the past decade, with amazing industry prospects, but basically no fundamentals to speak of. \n\nAnd even the profitable companies were trading at a sharp premium. Look at Costco, which is still trading for over 30 P/E, despite being a slow-growing company. That's effectively a 3% rate of return in a highly inflationary environment. Even if they grow earnings at 10% a year (which is unlikely), it'll take a long time for your money to double. \n\n&#x200B;\n\n**Tldr:** Fundamentals matter, and if you don't want to do the research, index funds are a great way to get the returns of the market. But if you hold a stock for a long time, you'll get the returns of the business at the valuation you bought in at. Returning to the median works both ways, in that you'll lose money if you bought at a premium, and you'll gain money if you bought at a discount. And none of these principles apply to trading, which is a separate beast altogether. Anyway, happy investing! Hope y'all stay safe and make lots of money in these volatile times!", "id": "w4xf7u", "created_utc": 1658452550.0, "score": 690, "upvote_ratio": 0.93, "num_comments": 57, "comments": [{"body": "Actually Lynch meant this in a much narrower sense: that you should invest in companies that you have deep knowledge in. His example was that medical doctors tend to invest in oil companies while petrochemical engineers tend to choose biotech stocks. Simply because not knowing anything about that industry makes it look a much clearer situation. \n\nAnd inna different chapter he underscores the importance of \"insider\" knowledge. His example is that if you work as a car mechanic and notice that a particular brand of tires are selling like crazy, then you have a six month headstart before Wall Street notices the same phenomenon. \n\nHe never advised to buy something just because you have bought their product.", "score": 97, "replies": [{"body": "This, it's really a circle of competence point rather than a \"I bought jeans from Levi Strauss once, and they were good so I'm buying their stock\".", "score": 21, "replies": []}, {"body": "He said you should have knowledge/familiarity that gives you an edge over the market, but ALSO look at financials/fundamentals. Even if the product is great and sells like hot cake, the stock can be bad, because of debt/management/price/etc.\n\nAnd you don't need that deep knowledge,  according to Lynch. He was successful with Dunkin Donuts because he liked the coffee and he saw other people liked the coffee. Doesn't mean he has to be a barrista or donuts-expert.", "score": 5, "replies": []}, {"body": "He also wrote all of that before folks had a computer in their pocket (or, really, the internet).", "score": 3, "replies": []}, {"body": "He very much said that you should just buy products you know, you don't need \"deep knowledge\" on the topic, but you should inform yourself.\n\n\n\n\nLook at Beating the Street, chapter with elementary school kids picking stocks. They *didn't* have deeper knowledge about toys or entertainment, they just followed Peter's advice and paper invested into things they knew and liked, after they researched the company and went through the idea with the whole group. And they did succeed, most groups made solid profit as far as I remember.\n\n\n\n\nOf course he also made a point about people with special knowledge in some field to take adventage of it, but I feel like that is another point that just happens to neatly tie into his advice.", "score": 2, "replies": []}, {"body": "There are multiple meanings to what Lynch meant. Deep knowledge and insider knowledge are definitely use cases of 'what you know', but if anyone quoted Lynch referring to those, they would not be misunderstanding him. 🙂 I'm just addressing the oversimplification here, but your points are true as well. Though there are cases where he said buying the product gave insights to growing or waning demand, such as his wife's endorsement of products like L'eggs.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Why leave it at that? If you believe that's the case, I'll be happy to hear what you think I misunderstand. ![gif](emote|free_emotes_pack|slightly_smiling)", "score": 5, "replies": []}]}]}, {"body": "That’s… actually a pretty strong post.", "score": 150, "replies": [{"body": "You’re a a strong post. I love you", "score": 6, "replies": [{"body": "So sturdy.", "score": 4, "replies": []}]}, {"body": "Better Advice: \n\nBut the hype. \nSell the dip.\nYOLO FOMO\nJust the tip.", "score": 37, "replies": [{"body": "Don’t forget, “if you disagree with me, you’re a SHILL”", "score": 10, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Post your losses", "score": 8, "replies": [{"body": "Be your own bosses", "score": 3, "replies": []}]}]}]}, {"body": "The kind of post that I wish we had more of on r/stocks", "score": 2, "replies": []}, {"body": "Number #3 can be expanded with the allegory of Mr. Market. Same principle.", "score": 1, "replies": []}]}, {"body": "Thanks for posting this. Agree to such a high degree that I'm not going to nitpick or even add a corollary.", "score": 17, "replies": []}, {"body": "Thank you so much for this. I feel like most comments I’ve made in stocks subs has been one of these arguments in one form or another. Especially #2. The r/stocks sub really should be about individual stock picking. In which case of course timing matters. You want to buy WHEN it’s undervalued and sell WHEN it’s over valued.", "score": 6, "replies": []}, {"body": "Biggest misconception IMO is about \"priced in\" and \"efficient market hypothesis\"\n\nThey're the same concept.\n\nBasically, stock prices reflect all KNOWN information, it can also be about the future.\n\nIf a company guides to 100mil in 3 months, and then things happen inbetween e.g. shortage, then market expects company to achieve only 80mil, then when the company reports 75mil the stock price goes down and people will meme \"priced in\" (as if the market didn't price in the bad news, which it in fact did, but the results were even worse)\n\nBasically stocks do price in future expectations, however the future can differ from what was expected. It doesn't invalidate the concept of \"priced in\".\n\nPeople might say Tesla is MASSIVELY overvalued, and traditional autos are MASSIVELY undervalued because they're at 5-10 PE. \n\nBut, PE ratios doesn't determine whether a stock is expensive or cheap, but rather tells you how the market thinks the stock will do in the future.\n\nThe way to make money then, is to find stocks where the actual future will be different from the market's future expectations.\n\nFor example, (numbers made up) the market gives Intel a 10x forward PE and AMD a 30x forward PE.\n\nIt expects AMD to keep growing and Intel to continue to do poorly.\n\nIf you think the actual future will be different e.g. Intel will grow faster than the implicit growth that comes with a 10PE then if you are correct e.g. Intel releases earnings which show growth so the rest of the market re-adjusts their assumptions, that's where you make money because the price of Intel will rise to reflect the new numbers.\n\nTL;DR investing is about finding stocks that are priced based on incorrect expectations about the future, and buying/selling them before the market re-adjusts their expectations based on new information", "score": 11, "replies": []}, {"body": "Imma share this with all my homies out there.", "score": 4, "replies": []}, {"body": "It is so incredibly refreshing to see this post. It is absolutely spot on. Over time full time stock pickers lose. It is only those that make minor adjustments to the overall general risks in the market that win, and even that is sometimes but not always.  Knowing what risks you are taking and exactly why you are taking them is the only way to beat the market over time. This is only true over a long time.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Luck and randomness are definitely factors, which was partially addressed in my 3rd point. If one ended up with a lucky gain due to a factor they didn't predict, they shouldn't consider that a validation of their original thesis. Same for a black swan for losses (though proper risk management should always account for some degree of this). \n\nRegarding your points, \n\n1) I haven't found much use for Beta so far, but if you've had success with it, more power to you!   \n2) True, reversion to the mean tends to be a value oriented strategy. There are lots of other strategies as well, like turnarounds or growth as you said.", "score": 2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Someone's a big Burton Malkiel fan. ![gif](emote|free_emotes_pack|grin) I definitely agree though that trying to find a winning strategy/model based on historical performance is a losing game, as people who bought into ARKK **after** it had record gains would testify.\n\nFor sure, by definition, most people can't be 'top performers' since it's all relative. What I would disagree with is when people conclude that it's not worth trying to generate alpha, since one could argue the same for 'superstars' of any field. But if one is trying to find the right whale to hang onto the coattails of, then your points definitely are valid warnings for them.", "score": 6, "replies": []}]}]}, {"body": "If its all random, how can thousands of people make a living off investing? How can wallstreet exist? How can new york exist?", "score": 0, "replies": [{"body": "Big bankrolls and long timeframes.\n\nIt’s like asking how people make money playing poker if it’s all random", "score": 2, "replies": []}]}]}, {"body": "Give this man a Bells.", "score": 3, "replies": []}, {"body": "i fully concur about the timing market... sure for index funds or etfs for sure you dont need to try to time the market since their only way is up...\n\nbut stocks? one company.. time that market to the day!!", "score": 2, "replies": []}, {"body": "\\#2 directly feeds into #1 (when applied to individual stocks). Your strategy is not 'timing the market' if you buy and sell based on knowledge/fundamentals. The company position and direction dictate when you buy or sell - not the market movement as a whole.\n\nI would qualify #4 in that a stock with P/E of 50 can be a great buy (e.g. if the company is on an absolute growth tear and no sign of slowing down with large demand and a growing market) and a stock with a P/E of 2 can be a lousy buy (e.g. when its business is in the process of crumbling around its ears and it isn't making any moves to rectify the situation by transitioning into a more profitable business entity of the same or larger size).\n\nIndex funds are the low risk/low reward route. Individual stocks are the high risk/high reward (and potentially high loss) route. You can skew yourself towards 'high reward' if you put a lot of effort into research/DD - but it will likely still remain higher risk than an index fund.\n\nNo effort  - high reward? That one exists just about as much as it does in a casino. Can happen but banking on such an approach is foolish.", "score": 2, "replies": []}, {"body": "I got rekt with GoPro by following misconception 1 about 5 years ago!", "score": 2, "replies": [{"body": "I looked at GoPros fundamentals, liked them a lot, still got rekt.", "score": 1, "replies": []}]}, {"body": "Good points, especially on point 1, people get Lynch wrong so much on that, but he's really just reiterating the idea of the circle of competence that Buffett and Munger focus on in a more down to earth way. You still have to understand the fundamentals and business under the hood.", "score": 2, "replies": []}, {"body": "This is beautiful thank you", "score": 2, "replies": []}, {"body": "Misconceptions or rather \"People being unwilling/too lazy to read more than a headline or a single quote on a certain topic\" - in which case they're probably not a great fit for stockpicking.", "score": 2, "replies": []}, {"body": "Honestly I think 99.99% of people should go index fund and have like a casino budget of 50$ per month where they can do what ever with. If you make a profit with that 50 you add it up to the next month and if it goes to 0 you try again with another 50. \n\nIt's ultra rare I see people here actually asking the right questions, everyone seems like they are gambling. I'm 100% I to xeqt and won't be stock picking for the next 30 years. Circle of competence ? I have 0 competence picking stocks.", "score": 2, "replies": []}, {"body": "Point number two 100%", "score": 4, "replies": []}, {"body": "just buy what Pelosi's hubby is buying and you'll do ok", "score": 2, "replies": [{"body": "Didn't he buy RBLX?", "score": 4, "replies": [{"body": "and Paypal", "score": 1, "replies": []}]}, {"body": "Problem is you only get to find out what he went in on a full quarter after it happened. I.E probably too late.", "score": 9, "replies": []}]}, {"body": "Misconception: The usual timeline for investment advice given is not a year or two it’s ten years plus", "score": 2, "replies": []}, {"body": "TLDR goes at the top. (If you get to the bottom, you don’t need the TLDR) Otherwise, great stuff.", "score": 1, "replies": []}, {"body": "On #3, it's actually kind of fascinating how people will blame themselves for stocks going down.  It'd be like going to a restaurant and ordering a medium rare steak, but the waiter brings out a hockey puck.  You don't just sit there moping about how dumb you were to choose *this* restaurant instead of the one next door.  The restaurant is the one that failed, and you will typically hold them accountable by informing your waiter that their chef may have accidentally grabbed one of the briquettes by mistake.\n\nYou have not failed if a stock's price goes down.  The company has failed you.", "score": 0, "replies": []}, {"body": "Common Sense Investing on YouTube explains these and more misconceptions in much more details.", "score": -1, "replies": []}, {"body": "Market is rigged. This rule trumps all.", "score": -3, "replies": []}, {"body": ">Misconception #1: 'Invest in what you know - Peter Lynch'  \n>  \n>This one is wrong out of omission. Peter Lynch never said that it was sufficient criteria for you to invest in a product or company only because you were familiar with. It was merely a starting point. You still need to do research on the fundamentals, like profitability and valuation, before you actually decide to invest in it.\n\n&#x200B;\n\nSo when my dentist tells me to brush my teeth, he's wrong because he didn't also tell me to eat a balanced diet, exercise, get routine lab work done, play with my kids, take all prescribed medicines, etc.?\n\nI suppose I should call him and tell him that any piece of advice is wrong if it doesn't include **all** advice.\n\n&#x200B;\n\n>and if you make solid profits or see a good entry point based on valuation, then you should definitely sell \n\nAre you serious?  So even if I believe in a stock long-term, I should reduce my position because it has gone up?  You can't be serious here.  The fact that not all stocks go up in the long run doesn't mean no stocks go up in the long run.", "score": -10, "replies": [{"body": "Point 1, I said it's not *sufficient* criteria. I'm not saying Lynch's advice is wrong, I'm saying it's easy for people to oversimplify decisions. Lynch said himself people misunderstand what he said. If you can only have gluten free food, that doesn't mean you should eat anything that's gluten-free. You'd look at the nutritional information and calories too, right? And if it tastes good, etc. \n\nRegarding selling at a rich premium, I 100% stand by that. If you bought a stock at $20 and you think it's worth $50, and it hits $100, then you should definitely sell. If there's no price you'd sell at, you're never going to make money. That's different than saying sell only because the price went up.", "score": 4, "replies": [{"body": ">I'm not saying Lynch's advice is wrong,\n\nYes, you did say it was wrong: \n\n&#x200B;\n\n>This one is wrong out of omission. \n\nPeople misunderstanding Lynch isn't the same thing as the advice being wrong.  \n\n\nYou're moving the goalposts on the second point.  If you think it's worth $50, and it hits $100, of course you should sell.  But that's an entirely different scenario.  You said we should sell if we see solid profits, not if the stock trades for more than we think it's worth.", "score": -2, "replies": [{"body": "I already said I am not saying Lynch was wrong, just the quote is misunderstood. I'll humor you and consider the possibility I was saying Lynch was wrong. That would imply suggesting one should avoid what they know and invest in something they're clueless about. Take a moment and consider how silly that sounds. ![gif](emote|free_emotes_pack|stuck_out_tongue)\n\nAnd regarding 'solid profits', I clarify later by saying \"if something rises far above what you think a stock's intrinsic value is, selling would be prudent.\" That to me is 'solid'.", "score": 2, "replies": [{"body": "I think maybe we just have different approaches to communication.  To me, a sentence that is false is false regardless of what else is said.  So when you said \"This is wrong,\" I read it as saying Lynch was wrong.  That seems obvious to me, but perhaps we have different views on this sort of vehicle of communication.", "score": -1, "replies": []}]}]}]}]}, {"body": "Cant disagree with this bar 'timing the market'\n\nIf you buy quality stocks 9 times out of 10 in the long term you will make money \n\nExamples would be Disney, Costco, Microsoft etc \n\nIf your investment horizons are >5 years\n\nThis is not financial advice", "score": 1, "replies": [{"body": "I agree, but only with your last statement. Sorry.", "score": 1, "replies": []}]}, {"body": "counterpoint, If you invested in coca cola in 1920 and forgot about it, you are gonna have a nice surprise some day", "score": 1, "replies": []}, {"body": "I‘d like to take this opportunity to point out Larry Siegel‘s „Debunking Nine and a Half Myths of Investing“ at https://larrysiegeldotorg.files.wordpress.com/2020/03/ajo-9andahalf-myths-corona.pdf now updated for the Corona era in March 2020.", "score": 1, "replies": []}, {"body": ">if you make solid profits or see a good entry point based on valuation, then you should definitely sell or average down respectively. A company's prospects could change on a dime and one should be prepared to act accordingly.\n\nGot burned by this one last winter. I get that hindsight is 20/20, but the only other time we've seen stocks so irrationally valued to my knowledge was the dotcom bubble. I thought about taking some profits from some of my growth stocks in particular, but I held on based on the fact that I was trying to avoid timing the market.", "score": 1, "replies": []}, {"body": "Misconception 2: you are correct that this works better for indices than companies... meaning that valuations matter, a lot. However it's also a reminder that in the short term valuations can be irrational and the market can be somewhat inefficient. You may need to watch your company drop for years before you cash in. Trading in and out of a position due to emotional reasons will likely lead to losses.\n\nYou raise a good point, however.", "score": 1, "replies": []}, {"body": "Misconception #1 is also a fallacy. In the book *Your Money and Your Brain*, familiarity was said to be a source of contentment. Being too familiar with something makes us overweight our \"insider knowledge\" and risk being blinded to outsider perspectives. We tend to talk up the chances of success of things we're familiar with, even if the objective truth says otherwise. It is also the source of home country bias of the average investor. German and French investors are similarly bullish towards their own countries as how US investors are.", "score": 1, "replies": []}]}
{"title": "The true story of GME - Happy split day!", "selftext": "Once upon a time there was a stock that a lot of people bought around the same time.\n\nThis probably happened because \\*someone\\* smart wanted to make a lot of money and realized that if he encouraged enough people to buy it would cause a short squeeze. So he built a position and then pointed out the stock was \"undervalued\" when really it was a failing company. But people were dumb and bought shares.\n\nBecause most large institutions didn't anticipate these purchases to happen they were caught off guard in their short positions. The value of the shares went up really high and then crashed back down. This screwed over some institutions and made early investors a lot of money.\n\nThis also created a lot of bag holders because people were greedy. A lot of people didn't want to miss out on the squeeze and bough in too late. They got caught up in the hype and threw lots of money in on the way up just to lose it on the way down.\n\nThey wanted to get their money back and the solution to make that happen was to spread a bunch of misinformation online to encourage people to keep buying as many GME shares as possible. They succeeded and caused the shares to keep trading at a higher cost by getting enough idiots to buy and they recouped some of their losses.\n\nNow a whole bunch of idiots are holding a whole bunch of shares and not selling because they don't want to give up on hope or admit to themselves that they listened to bad advice online.\n\nThe company now has \\*correction\\* an 11.7 billion dollar market cap that they could leverage to restructure the company and turn profitable again. But the company was failing for a reason.\n\nTheir idiotic management decided to make an NFT marketplace instead. Which is basically the equivalent of selling overpriced image files that will do nothing but depreciate in value over time when the hype wears off. They're essentially the digital equivalent of beanie babies.\n\nJust like the share price right now, they are essentially only worth what idiots are willing to pay for them and don't have any intrinsic value. Human minds are fickle and this is destined to turn into a catastrophe similar to the great beanie baby crash of 1999.\n\nWhy am I griping about this now? I guess because I just want this bullshit to die so that I can go online and try to come up with some solid strategies to make money on stocks or options without being endlessly spammed with increasingly schizophrenic sounding GME posts.\n\nOh right there is a 4:1 split and today the shares are going to start trading on a split adjusted basis. What does this mean for the stock? It means absolutely nothing!\n\nIf you have $1 you have $1. If you have 4 quarters you have $1. The only real reason share splits are done is because people are fucking idiots. People perceive lower numbers as cheaper and are more likely to buy even if there is actually no reason whatsoever to do so.\n\nSo it can give the share price a temporary boost before people lose interest and get into something else when it just keeps trading sideways on lack of news.\n\nWhat impact will this have on GME? I have no clue. Why? GME isn't rational anymore. GME is like that kid you went to school with who gave no fucks, showed up high on LSD and somehow still aced his biochemistry exam. That kid did later die by electrocution because he thought he was a monkey and the power station down the street was a jungle. But everyone remembers that kid.\n\nNo one remembers Elissa, the quiet mild mannered girl who didn't talk much, studied diligently and aced all her classes. She's now the CEO of a boring company that sells generic brand pharmaceutical products online and is worth 1.2 billion. But everyone remembers that crazy ass kid Michael who went out in a literal blaze of glory due to a mescaline induced stupor. Even the traumatized paramedics who showed up to the scene to find brain matter, bone chunks and bits of skin stuck to the fence remember Michael.\n\nWhere am I going with this? I don't even know, but it makes more sense than that post that is currently pinned that is basically something that Michael would have written while he somehow impressed his friends as well as the scientific community by remaining conscious enough to write while having done a heroes dose of DMT.\n\nWhat's going to happen to GME tomorrow? I don't fucking know. I have no predictions and no way of making them. It's like trying to predict what Michael was going to be doing on a Friday night. It's a futile endeavor. Michael himself probably didn't know what he was doing half the time because he was just running from his demons in any way he could.\n\nWhen there is irrationality there is no way to make predictions. That's why GME is a no go for me. There is no rational way to predict what GME is going to do tomorrow. That's why I have no position on either the short or long side and I won't.\n\nI'm tired of hearing about something unpredictable that I can't make money off of because it's unpredictable.\n\nThen there is Elissa. She was predictable. If I could have bought calls on Elissa's grades in school I would have because there was like a 99% chance they would print.\n\nElissa, in case the reader is full on retardant (unlike Michael who combusted) , is a metaphor for the types of plays I want to be fucking reading about. Yeah, Michael was entertaining. But Elissa was basically a blue chip. You knew when she would succeed and when she would fail. Long on Elissa's grades and short on Elissa's social life. That's the kind of reliable plays I want to make.\n\nI tried to figure out how the GME share price would respond to the split. Guess what? There is no fucking point to even try to figure it out. GME do what GME do. Ape do what ape do.\n\nThat is all. Some things just aren't rational. Happy split day!\n\nWhatever does happen today, though, I'm sure will go down in history as something absolutely fucking crazy. Good luck, you're gonna need it since logic has gone out the window and there are no signs of it coming back.\n\nYes, I kept writing AFTER I said that is all. Why? Perhaps a metaphor for the irrational behavior of everyone's favorite stupidstonk. Cheers.", "id": "w54psc", "created_utc": 1658476384.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 53, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|40|**First Seen In WSB**|3 weeks ago\n**Total Comments**|999|**Previous DD**|\n**Account Age**|3 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w54psc)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w54psc)", "score": 1, "replies": []}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 17, "replies": [{"body": "I knew the mods were gay I just didn’t realize that auto mod could be gay too. Maybe you can by my C3P0 fantasy come true.", "score": -8, "replies": [{"body": "HELLO FREND!!!\n\nDid you mention GaeStop?! UwU! It's our faweite not-a-jpeg-store retaiwer! Our CEO and Founder, Ryan Cohen, has a BWILLIANT strategy that's going to kill AMAZON!!!\n\nOH! Have you read the DD? HAVE YOU? You should DYOR but make sure to read the DD! Don't invest more than you can lose, but if you haven't sold all your earthly possessions to invest in our MY (I am an indiwidual inwestor UWU) fawiite stock, then I HAAAATE YEWWW.\n\nOkayyyy, remember!! If you said anything negative I will be VEWY VEWY MAD at your FUDDERY!! I will just go buy EVEN MORE shares!!! Don't forget to DRS!!! Becuase that definitely does something!! We are all going to get rich together and I couldn't care less if you disagree, but if you do then I HATE YOU!!!! BAIIII", "score": 5, "replies": [{"body": "Hello fellow hodlers,\n\nContact your favorite grifters at memestocks@compushill.com if you have questions about the $3.5K limit on GME. \n\nP.S. We can not help with NFT scams on the \"highly vetted\" GameStop marketplace. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": [{"body": "Good bot", "score": 0, "replies": [{"body": "Good human.", "score": -2, "replies": [{"body": "That was…creepy", "score": -1, "replies": [{"body": "It has come full circle", "score": 1, "replies": []}]}]}]}]}, {"body": "Reeeee", "score": 1, "replies": []}]}]}]}, {"body": "Confirmed that op is a virgin.", "score": 12, "replies": [{"body": "Incorrect I’ve had more infected wangs inside me than a Shanghai hospital", "score": 5, "replies": []}]}, {"body": "You can suck deez ape nuts", "score": 10, "replies": [{"body": "Edit: they originally said squeeze deez nuts then edited the comment - I would gladly suck your ape balls while you stroke and cum your ape juice all over my face\n\nApe no hurt ape but I will gladly fondle them tenderly while I stroke your shaft and whisper in your ear that I love you and that I don’t care that you’re an ape and that I don’t care beastiality is illegal because the law will never keep us apart.", "score": -12, "replies": []}]}, {"body": "Tldr: stock is going up or stock is going down", "score": 5, "replies": [{"body": "Yes but better because stock is cray cray", "score": -1, "replies": []}]}, {"body": "If you take poppers next time you won’t end up so butthurt", "score": 5, "replies": [{"body": "Dirty little bitch it ain’t right if it’s painless", "score": -3, "replies": []}]}, {"body": "I was enjoying the nice story until you say they ‘have 11.9b in capital’ - and for this reason you are also retarded", "score": 3, "replies": [{"body": "https://www.investopedia.com/terms/s/sharecapital.asp", "score": 1, "replies": [{"body": "Their market cap is not how much capital they have 😂", "score": 8, "replies": [{"body": "Sorry didn't realize that I used one wrong word in the whole thing let me fix that so that you can focus on the fact this whole thing is fubar instead of fixating on small details and distracting from the big picture", "score": -1, "replies": [{"body": "How much did u get paid posting this bs?😂😂😂", "score": 0, "replies": [{"body": "Nothing it’s a passion project", "score": 5, "replies": []}]}]}]}]}]}, {"body": "TFW GME will be $50 on Monday 🤔", "score": 1, "replies": []}, {"body": "Tldr", "score": 3, "replies": []}, {"body": "So tell me Dick, did you also read about how everyone sold GameStop for the last 18 months?\n\nSo what’s your problem?", "score": 2, "replies": [{"body": "You aren’t making sense", "score": 1, "replies": []}]}, {"body": "“Went up and crashed back down” they removed the buy button!!! Creating bag holders and saving institutions dumb as$!!\nWhere have you been?? I started by rebuking each point but it’s clear you have no idea, stick with your/there narrative, served you well so far I see! ✌️", "score": 2, "replies": [{"body": "It would have still gone up and gone back down that's what a squeeze is it doesn't stay up forever silly billy.", "score": 3, "replies": []}, {"body": "You're calling the guy a clown but you managed to incorrectly use 'there' and 'your' in two separate comments...", "score": 2, "replies": [{"body": "The real crux of the matter, correcting grammar, that’s what we’re here for! Clown!!", "score": 1, "replies": [{"body": "Well it sure makes it easier to pick out the morons...", "score": 3, "replies": [{"body": "Elitist mindset you have there dude!! All the best!! Not an ape though!!", "score": -2, "replies": []}]}]}]}, {"body": "If we lock up the float, you’ll be wrong again!!\nLike 20/20 so far, impressive!!", "score": 2, "replies": [{"body": "It's impressive to be wrong that much tbh", "score": 2, "replies": []}]}, {"body": "Also \"they\" is like 2 companies out of how many trading platforms?", "score": 1, "replies": []}, {"body": "Straw man!! Your Missing the point, clown!!", "score": 0, "replies": [{"body": "You just replied to yourself and called your own argument a straw man argument that was missing the point - and you were accidentally correct for the first time ever.", "score": 4, "replies": [{"body": "That makes sense.\nYour post made it clear, your incapable of putting pieces together by yourself... follow the guidelines, invest in what they tell you to!!! Probably keep your bitter diatribe to yourself!!", "score": 1, "replies": []}]}]}]}, {"body": "I like you and turtles 😊", "score": 1, "replies": []}, {"body": "Jesus Christ, OP! GME is going to go to the fucking moo tomorrow. Why? I know because mom read me a story where the cow jumped over the moon and gme is like a moon cow and a space suit because elon musk said so and he made a tween on its.\n\nReeeeeeeeeeeeeeeeee\n\nOP is a fucking retard don't listen to anything he says bagholder spotted blah blah insert any random generic bot insults here blah", "score": 0, "replies": []}, {"body": "Jim is that you ?", "score": 0, "replies": [{"body": "Yes, remember, you guys always come to me for advice.", "score": 3, "replies": [{"body": "Yea I saw your tweet and it’s funny.", "score": 1, "replies": [{"body": "Glad you liked it. Also, the market is going to be green and keep climbing until 2024.", "score": 2, "replies": []}]}]}]}, {"body": "We found the weakness , they short it , we buy it , so simple , they have all the money , they have all the cheats , they have dark pool and we just buy shares and hold , they push the price real low so we just buy more shares and hold , they borrow millions of shares at a price and we just watch them pay , they make fake shares and we just watch them and hold , they tell us the sky is falling and we just hold", "score": 0, "replies": []}, {"body": "I just bought more. Have a nut", "score": 1, "replies": []}, {"body": "OP jealous cause that cool kid on drugs banged the quiet girl, Elissa. \nDude, you never had a chance with her.", "score": 1, "replies": []}]}
{"title": "The only FOMC week TA/ DD you'll ever need to read", "selftext": "&#x200B;\n\nhttps://preview.redd.it/g7jhq01sf6d91.png?width=667&format=png&auto=webp&s=8406915487c3c8f5dae8024aa21414bd127345a5\n\n**When should I close my Puts I opened?**\n\nIf we look at the trend… regardless of what SPY does AFTER FOMC… it is ALWAYS best to close Tuesday before EOD. Close the puts EOD before FOMC… save some BP and then buy a put for the next drop.\n\nhttps://preview.redd.it/3sd3nfwsf6d91.png?width=975&format=png&auto=webp&s=229e41707e95907c0878edf45ba4ebf2576faaa6\n\nThis FOMC will be even more juicy to buy overnight puts (may I recommend SPX 0dte here…) because despite 3 of the four last FOMCs opening red the next day… granted only one of these was anything significant. Three of the last four FOMCs the following day has been red and the last two have both been -3%+ red days. This FOMC is special because the following day we get the q2 GDP reading… why does this matter? Because this would be our SECOND negative reading in a row and that would mean we are 100% in a recession… we should expect at minimum a -1 to -1.5% open Thursday morning. Now will markets dump or will they rip like after CPI? That part im not sure just yet on… we also have Amazon, Ford, boeing, Ford, Meta and pinterest the day of FOMC… this can be a hella big bearish catalyst especially if Google and MSFT have bad earning Monday/ Tuesday. \n\nhttps://preview.redd.it/rp0982ktf6d91.png?width=975&format=png&auto=webp&s=651232a916930eadfe01174cf1f66a0e9ec30781\n\n**How markets have played out at 2pm the last 4 FOMC meetings**\n\nNow for January we didn’t have a rate hike but I believe ole JPOW finally got scared about inflation here and scared the markets… so at 2pm when FOMC was released we saw the doji (like may 4th) and then when he started his presser at 230pm we started our downward trend by 245 we were confirmed. However this trend peaked at 3pm and then slightly recovered. I don’t really equate this January one to much since there was no expected rate hike so we really mainly should focus on May and March. (initial run up till 210, dropped under 220 and then peaked at 230, dropped at 235, retested 230pm high at 240 and then by 245pm was breaking the 230 lows… from there we sold off until 250pm. Rested and then sold off the rest of the way at until 310pm when the bottom was in). \n\nMarch 16th FOMC we saw markets at 2pm react to the FOMC rate hike and by 230 when JPOW started talking we were finding bottom and at 245pm we were in the trend we were going to continue in and rallied till close. (235pm bottom is in but retested at 240pm).\n\nMay 4th FOMC as you can see at 2pm with the rate hike we were fairly indecisive forming a 15minute doji… JPOW started talking at 230pm. Markets found their bottom and from their rallied until close. (bottom was put in at 235pm) \n\nJune 15th FOMC We got the initial pop of green that was followed by a sell off. By 230pm when JPOW spoke we had found the bottom and from there we ran for 15minutes. This was the first FOMC though where at 245pm we saw a major pullback to where the 2pm candle opened before it then pushed green again to make a new HOD by 345pm. (bottom was put in at 235pm)\n\nhttps://preview.redd.it/5lwrz3svf6d91.png?width=588&format=png&auto=webp&s=d26625f758956e94ca08386bf913e06aadc6664d\n\n&#x200B;\n\n**How I plan to trade FOMC**\n\nHow do we play this? Well assuming this is going to behave similar to the March, May and June FOMCs we are going to take the opening price at 2pm and look for a 1% drop. So lets saw we open at 390. That means are BUY target is 386.1. Now the trick with this is PATIENCE! We CAN NOT fomo in and we CAN NOT get nervous here. The timing HAS to be perfect here… too early and youll get IV crushed (most likely will still get paid crazy good). The other thing that we have to be careful of is the wildcard market just dumps like January. The one thing I will say is that the January FOMC meeting was a wildcard and the market is much more understanding of FOMC than it was before in January. So I do think we will behave more like March, May and June especially. \n\nOkay so its now 235pm and we have our 1% drop at 386.1… this is where its dealers choice you can either buy say a 3-5OTM CALL or you can just stick with the try and trued ATM call. We are expecting nearly a 2.8% on average pop here… now of course that’s basically if you timed it perfectly top and bottom. For me I would safely set a 100% profit order if you entered anywhere remotely close to that 1% drop range and let it ride. You could set a 50% STOP LIMIT order once it gets closer to 100% and then just let it run till at least 245pm before closing it. \n\nThe safest way though is to enter and immediately set a 100% take profit order. To be safe you could set a 50% sell order instead.  \n\nThe one thing to note here is that from 215 to 230pm there biggest IV crush happens along with the biggest fall usually and that is why you have to be careful. \n\nFor those of you who wanna be aggressive AF… another play here… and mind you this one is the highest risk of them all… would be to take 0.5% from the 2pm OPEN price so lets use 390 again… 391.9 would be target… once that level is hit enter an ATM put…. And then ride that down 1% from the 2pm candle OPEN. So that would be down to 386.1… This method should net you a nice 50%. But this one is way riskier as you are exposed to IV crush and the way from the top to the bottom of 2pm to 215pm is wild and full of bounces and fake outs. This ones not for the faint of heart. \n\n**What if im wrong?**\n\nOkay what is the wild card here? What if I am wrong? What do we look for… im glad you asked! So with January the pattern was different. Now mind you January was a completely different time in the markets as they had “no idea” what was to come and this was the first inflation shit the bed news, etc. etc. \n\nSo with January we saw the spike at 2pm followed by a small sell off. The 215pm candle then just held within the 2pm candle which is key to watch for. We then saw that 230pm (when JPOW starts presser) was the peak and from there we basically started dumping. This will be key to watch for. If we aren’t seeing the Up -> down -> bigger up pattern started and come 230/235 we aren’t seeing the pattern making a bottom we need to be prepared to play a put instead. From 230 to 245 we dumped lower and then that 245 candle dumped us all the way until 245. Keep and eye on the candle bodies. If the candle bodies are looking weak and we aren’t seeing big wicks to the downside then we might get the dump like this. \n\nWhat could cause a dump like this? Well it depends what we see from the media this week and Monday/ Tuesday. The fed now is basically telling us we are getting 75bps hike and nothing matters. They said that 100bps hike wont help and doesn’t matter. We are essentially expecting a 75bps hike so if we get surprised with a 100bps hike AND JPOW throws some sort of wild card at us we might see a dump like this. \n\nThe other wildcard which some are saying “how can you be so bearish for FOMC… the markets already expects rates, etc. etc. etc.” To this I do agree and this is where I say despite things being priced in… they are only priced in until the markets/ algos hear and see those numbers live. They its officially priced in. \n\nSomeone else and other I am hearing mention that the fed may actually hint to a pausing of rate hikes from here on out and maybe even at Wednesday meeting… why? Because big tech is already doing hiring freezes and the big techs are already showing that stuff is easing… it doesn’t 100% make sense to me but I do see some peoples logic with it. \n\nSo if we are under the impression we are priced in then we need to be prepared that at 2pm till EOD we just rip on FOMC giving us “good” news… aka not badder than expected news…\n\nFor this type of “good news FOMC” we gotta go back to December 15th and November 3rd 2021. \n\nIf we are expecting bull run during FOMC we will look for a large 2pm to 230pm pop… large then the normal 0.5% fake pop… but the KEY would be that we see a small retracement leading to 230 presser starting but we do NOT break below the 2pm candles low. If this is what we are getting that magical 235pm time is still the best buy time. \n\nIt is key to watch how the candles move and interact with eachother… and either way you HAVE to be patient… 235pm regardless seems to be the magical buy time… and almost all scenarios 235pm is the CALL buy opportunity… only 1 meeting in the last 8 meetings was it an actual put buying opportunity.", "id": "w5k3q1", "created_utc": 1658520659.0, "score": 121, "upvote_ratio": 0.93, "num_comments": 52, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|237|**First Seen In WSB**|1 year ago\n**Total Comments**|2235|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/uxvyrg/52522_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuwx6/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuz82/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/v8vbnd/6922_spy_daily_ta_bonus_cpi_day_trade_breakdown/) [x](https://www.reddit.com/r/wallstreetbets/comments/ur9t1w/51622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w5k3q1/the_only_fomc_week_ta_dd_youll_ever_need_to_read/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpf4gi/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpezp3/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthspd/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/uyxorz/52722_spy_pre_market/) [x](https://www.reddit.com/r/wallstreetbets/comments/skp8ci/24_spy_recap_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vikp3b/62222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vcewfy/61422_spy_daily_ta_and_a_breakdown_of_how_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/vydqkl/71322_spy_es_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vm7yov/62722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/us0d0d/51722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w29gw7/71822_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v23784/53122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v9jfp2/61022_spy_weekly_review_fomc_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjbyng/62322_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v6ewtr/6622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vz5ejc/71422_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5w3m/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5xtr/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vmx21o/62822_spy_es_futures_daily_ta_bonus_qqq_and_apple/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/w33way/71922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vs0b13/breakdown_of_fomc_minute_days_and_how_to_trade_it/) [x](https://www.reddit.com/r/wallstreetbets/comments/vd6j6u/61522_spy_daily_ta_and_fomc_trade_review/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/usqmwy/51822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v2sj0k/6122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v7clxo/6722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vzz7j9/71522_spy_es_futures_vix_uvxy_and_amd_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjy8l2/62422_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w3x7sj/72022_spy_es_futures_daily_ta_little_fomc_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vw7sc0/its_time_to_go_long_on_vix_uvxy_calls_july_is/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdhxd/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdk8h/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwhw7o/how_to_trade_cpi_day/) [x](https://www.reddit.com/r/wallstreetbets/comments/v3mubg/6222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v82mas/6822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vnphqa/62922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvrv2/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvtju/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdwm4u/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v48yk1/6322_spy_weekly_ta_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwukf1/71122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdzrud/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthl4s/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w4rgvv/72122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/ux4ri2/52422_spy_daily_ta_fomc_minutes_prediction/) [x](https://www.reddit.com/r/wallstreetbets/comments/vbnl4b/61322_spy_daily_ta_and_fomc_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vt2tn2/7622_spy_es_futures_daily_ta_and_fomc_minutes/) [x](https://www.reddit.com/r/wallstreetbets/comments/vhms2v/62122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vojpv5/63022_spy_daily_ta/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w5k3q1)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w5k3q1)\n    \nHey /u/DaddyDersch, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "The Fed would have to be absolutely out of their fucking minds to PAUSE rate hikes?????? I see that as a -100% chance of happening", "score": 31, "replies": [{"body": "Priced in.", "score": 5, "replies": []}]}, {"body": "FYI: MSFT earnings are Tuesday the 26th, not the 25th", "score": 19, "replies": []}, {"body": "This FOMC will be different, it's the first time this year that the week before is green, so I say FOMC red. I'm closing my puts on Friday at 3:59pm", "score": 17, "replies": []}, {"body": "Tldr: can go down , down a lot, or it can go up, thank you for the DD.", "score": 36, "replies": [{"body": "![img](emote|t5_2th52|8880)", "score": 7, "replies": []}]}, {"body": "Nice DD, gonna try to read this a couple times and review the charts closely.  I hope I don’t end up flying too close to the sun next week.", "score": 11, "replies": [{"body": "OP actually suggests a pretty safe play and gives a lot of DD backing it up. Bar a huge reversal it should be a smart move", "score": 5, "replies": []}, {"body": "The most important part was the timing. 2:35 pm. The clock is one of the most important elements of making intraday trades. Huge difference in opening a trade at 9:58 or 10:06-10:12 for example. My favorite intraday timeframes are: 3,4,12,22,38. They often give cleaner patterns and when they all align, let the trade ride", "score": 1, "replies": []}]}, {"body": "Your DD is killer brother! I get on Reddit now, mostly, just to look at your stuff. And to see what these other degens are gambling on!", "score": 10, "replies": []}, {"body": "i'm again joining in on this one... of all the stupid shit i attempt to play myself, these Fed meeting patterns seems to be the most consistent if the setting is the same, which it seems like it is\n\ni added a little spice to this play and kept short positions open through the weekend, last pre-FOMC meeting monday was a bloodbath with a similar runup although sooner ... that's the only green flag (in this case :) ) .... every other time there was a dump that started earlier, now we are still climbing up (for the week) ... but hopefully today was the first red starter day", "score": 9, "replies": [{"body": "Kept some shorts over the weekend too! Good luck Brother!", "score": 4, "replies": []}]}, {"body": "I Will wait on spy till Wednesday, and putting my calls in at 2-230, will sell half before close and let the rest ride till Thursday", "score": 7, "replies": [{"body": "[removed]", "score": 10, "replies": [{"body": "Yeah was thinking about that might just throw in couple puts instead", "score": 2, "replies": []}, {"body": "wildest week so far in 2022, FOMC and Recession", "score": 2, "replies": []}]}, {"body": "I feel like holding calls overnight is a death sentence considering what’s happened in the past but you never know with this market", "score": 2, "replies": []}]}, {"body": "Sounds like a plan, I’m in", "score": 6, "replies": []}, {"body": "With strong jobs report, high cpi.. Won't feds feel more emboldened to make 100 basis points increase?", "score": 7, "replies": []}, {"body": "Wish I could read", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Well we gap filled, guess we can fall like a rock now.  Yipee!", "score": 2, "replies": []}, {"body": "I tried some puts/calls also before 2:35, got pretty hosed it was so volatile.  Even right now is too.  I sold most my calls except 5 of them right now.  Gonna see we gap fill 402.", "score": 1, "replies": []}]}]}, {"body": "Thank you for putting this out there for us to consider. I appreciate your posts !", "score": 3, "replies": []}, {"body": "Just to confirm, 1% otm puts at \\~2pm, then atm calls at 2:35?![img](emote|t5_2th52|8881)", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 1, "replies": []}]}, {"body": ">assuming this plays out the same as March\n\nAss u me", "score": 5, "replies": []}, {"body": "Where’s Aprils data?", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Lol, I was checking on that and was running back here to delete my comment. Let my ignorance be laid bare for all to see.", "score": 6, "replies": []}]}]}, {"body": "2 negative quarters don’t equal official definition of recession - need a another indicator. Most people believe it will be employment", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Enjoy reading your analysis BTW - good stuff!", "score": 3, "replies": []}, {"body": "I don’t know them all - unemployment is main one, manufacturing, wage growth? \n\nAfter negative GDP numbers you’ll see the conversation shift to the debate as to whether or not we are in an ‘official’ recession", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "ok, so the first drop was bullshit, it pumped as much as it dove down after, so that play i effectively gained 0 on\n\nbut the rest was pretty juicy and on the money again, was waiting more pumpage later but i guess the 30% until 3:15 is good enough :)  ... i don't feel like it will squeeze much more money into close\n\nnow the remaining question stands if opening the short right off the top now will be the right play... probably will wait till 6pm and then decide", "score": 2, "replies": []}, {"body": "Bravo sir, I didn't play this but I did watch it as it played out.", "score": 2, "replies": []}, {"body": "I definitely did not need to read this incoherent financial astrology. The fed is Gona hike 75bps. This will surprise a very small portion of the market betting on 100, we’ll see a modest bump as a result. After that, the fed meeting will stop having any impact on markets until we get the next jobs and cpi reports", "score": -2, "replies": []}, {"body": "some reason on this forum? this is gambling parlour senior. \n\non serious note. brilliant 👌", "score": 4, "replies": [{"body": "It’s instructions to gamble, sir.", "score": 4, "replies": [{"body": "true that 🧐", "score": 1, "replies": []}]}]}, {"body": "Any thoughts on UVXY play ?", "score": 1, "replies": []}]}
{"title": "7-22-22 SPY/ ES Futures Weekly TA and Recap (bonus Apple today)… this is along one but worth it…", "selftext": "This week was an interesting one. The bulls were pretty clearly in control all week yet we only secured a 2.5% green week. The most interesting thing though is that this is the first week before FOMC that has been green since 2021… Almost every week before FOMC has been very red (average is -2 to -5%). \n\nSpeaking of FOMC week (recommend you read my TA I just posted on that too… ) but two of the last four FOMC Mondays/ Tuesdays were red (averaging -1.2% for the reds Mondays/ Tuesday) and averaging +0.6% for the green Mondays/ tuesdays). It should be noted that the reddest Monday/ Tuesday before FOMC was this last meeting in June where we dropped a total of 4.2% over two days. \n\nLets start with SPY then move onto ES as this week we are actually seeing some differences that present two different cases for next week. \n\nhttps://preview.redd.it/ymki7h4ev6d91.png?width=975&format=png&auto=webp&s=51b01064e7fe20880905e907eb9aafa5bdf78346\n\nhttps://preview.redd.it/ha0x8mpev6d91.png?width=975&format=png&auto=webp&s=fd56fda96cffbbaabfab2fdadc60c4b3705092af\n\nThe chart actually has quite a few things to keep an eye on.\n\nRising wedge- Today you see the rising wedges support line was broken. Technically it was broken yesterday but because we still had a green day it was worth noting a possible new support could have built. Plus the support for this rising wedge on the 15minute had not been broken yet. Now that we have broken this support it should be assumed a retracement back down is coming as this is a bearish reversal pattern. \n\nDouble top- We actually put in a perfect double top on the daily today with resistance now being at 398.9. This should be seen as a major resistance going forward. This level has been hit time and time again. \n\n401.44 Gap- today we chipped away at the 401.55 gap dropping it from a $2.6 gap to a $1.29 gap. There is actually a case to be made though that SPY is going to build support here and consolidate sideways (much like we did in April and June) before we either fall more or make our next move up. While my personal preference is not that SPY fills this gap Monday there is a case to be made that we could pop $6.5 fill it really quick and then start our sell off. Would be a nice 1.6% pop on Monday. I suppose the case could be made that we fill it and consolidate here before FOMC Wednesday instead of seeing a true sell off. \n\n378.57 to 380.54 gap- we still have this about $3 gap left down below and I would be very surprised to not see it filled this week. Overall I actually suspect this to be filled by Tuesday EOD its about a 4.5% drop from here. At minimum if they really are planning to leave this unfilled I suspect them to cut that gap in half. \n\n369.38 to 370.18 gap- this 80 cent gap still exists and lives rent free in SPYs head… overall this one being under $1 while statistically speaking it SHOULD fill I would not be surprised if this one did not fill.\n\nSymmetrical triangle- looking at this daily you can see we have a symmetrical triangle forming with the green dotted being resistance and the blue dotted being support. WE should look to see now that resistance has been made a dip back to retest support. \n\nDaily 50ema- this was the first week that SPY has broken above the daily 50ema since April. Despite trading beneath it today and threatening to close below it today the bulls bounced it enough to close above it… I like to say when an EMA is broken like this that it is a hint of what to come. Had this been true support I would have liked to seen a bounce off of it and not trade beneath it the way we did. My suspicion is that we see this broke and we test the daily 8 and 20ema this week ahead. \n\nhttps://preview.redd.it/fupr38dfv6d91.png?width=975&format=png&auto=webp&s=278f05a0a0de6752ece85eaf3f1ad47be14b1260\n\nThe weekly chart I would call bullish but weak. Today we saw that 400 level retested and a pretty solid resistance rejection as you can see. After that 400 test we saw a pretty violent sell off and rejection further down. This is the first time the weekly candle has closed above the weekly 8ema since the week of April 5th. \n\nOverall you can see we have actually started a very mild bull channel upwards. The support for that next week that is crucial to hold is 389.4. \n\nBull and bear wise for SPY… I see far more reason to be bearish then I do bullish right now. I would be vey surprised to see the markets not begin to panic at all before FOMC. To go into FOMC bullish or even neutral with no sell off would be hella surprising. The only case I can have be made for that is that everyone expects 75bps hike and now that big tech is laying people off they are going to look to see if the feds actually pause rate hikes after this one. That or we truly are setting up for one hell of a bloody week with big tech earnings, FOMC and GDP Thursday. \n\nBulls-\n\nBulls are going to want to see this 395 support level hold on Monday and from there they have a lot of resistance to break through to fill the gap before FOMC and try to be in the 400s before FOMC on Wednesday. \n\n389.9 -> 401.4 (gap fill and break resistance line) -> 405.4 -> 409.5 -> 412\n\nBears-\n\nBears are going to want to break down that 395 support and break through the daily 50ema without question. Once the daily 50ema is closed under they will look to drop this back under the daily 8 and 20ema and prevent the 8ema from crossing above the 50ema. \n\n395 -> 392.3 -> 388.7 -> 385.3 -> 382.1 -> 378.8 (gap fill) -> 376.8 (support line)\n\nhttps://preview.redd.it/6lcdan1gv6d91.png?width=975&format=png&auto=webp&s=1047ec5af41e594bdf745cd4a2f2efdd0d8a5602\n\nhttps://preview.redd.it/pdq3qwogv6d91.png?width=975&format=png&auto=webp&s=05e7606bf68f3d11992d40558d395841c3591f6a\n\nES futures daily chart is a little different. \n\nAs you can see the bulls actually held it above the rising wedges support when they prevented the end of day sell off. The wedge is pretty much reached its peak right now though and we are about as close to a decision without having it as we can possible be. So lets talk about the daily ES.\n\nRising wedge- this morning when we broke out to 4016 we actually DID break the resistance line of the rising wedge. It was not by much but it did very slightly wick through resistance. However, due to the immediate rejection we could have had a fake breakout. This pattern will play out Monday with either 3978 support breaking or 4005 resistance breaking. Being that 4005 has been a key resistance I would be surprised to see a breakout to the upside\n\nSymmetrical triangle- this uses the blue dotted support and red dotted resistance line. As I had mentioned the red dotted resistance was broken but its possible it’s a fake breakout. If we start breaking down this week we will look for support between 3775 and 3790 on the blue dotted line depending on the intensity of the drop. If we were to see the rising wedge hold and see the red dotted line broken at 4005 then we are actually going to be targeting 4100-4175 next week. \n\nDaily 50ema- much like SPY I mentioned about they closed it over the 50ema today just barely at the end. Bears will want to break that down next week while bulls defend it again. \n\nhttps://preview.redd.it/9k9jm6fhv6d91.png?width=975&format=png&auto=webp&s=4272cbb6ef2996a58f5f839896251905d074a965\n\nNow the futures weekly is looking similar to SPY but almost more bullish to me. We are seeing that we closed above that key 3905 resistance line. That has been a magnet for the last 4 weeks and we finally were able to close away from it. \n\nAs you can see we have that blue dotted mild bull channel formed here too. We will keep a close eye on that this week and weeks to come. I am seeing that SPY weekly did fail to break out above the 100ema despite having the bullish close over the weekly 8ema for first time since the week of March 28th. \n\nWhen I look at the ES daily/ weekly chart I actually want to be more bullish than I do with SPY. It actually attempted to break out upwards from resistance of the symmetrical triangle before being smacked down. In addition I have been saying I truly think the bottom is in and if the bottom is truly in then this slow mild bull channel would be the perfect mild recovery trajectory. \n\nThere is no doubt who was in control this week and that was the bulls. Even the VIX on this pretty good sell off SPY had managed to close at 23. The VIX made a lower low despite a pretty big red day for SPY. \n\nIf I was looking at this chart right here and I didn’t have FOMC to worry about and didn’t have earnings to worry about I would be saying lets load some calls for next week cause shes finna rip and that this dip was the buying opportunity. However, we have to even in a macro trend look at the micro trend. \n\nI wont lie when I started writing this TA I was full bear for next week. But the more I look really hard into things, adjust things for how the day finished out im struggling not feeling bullish next week. Had the bears been able to break us down close to 392/ 3920 or below EOD then I would be hella bearish but im slightly struggling being bearish more then knowing FOMC usually is a drop in market due to fear. \n\nI still do see now looking at this a case for that gap fill Monday or Tuesday. But the unknown of course is going to be FOMC… is markets truly already numb and priced in the 75bps hike and we are just going to rally or at least range into FOMC? I mean I suppose its possible. \n\nI recommend you read my FOMC dd/ta I posted but I mention playing calls in there at 235pm and being careful of a January FOMC when we dump… if market is truly going to go into FOMC with a bullish mentality that everything is fine and we have nothing to worry about then we do need to be very careful with what we do on that FOMC trade. IF we get truly something in left field and JPOW is even slightly hawkish we are about to see the mega dumps of mega dumps. I also think with GDP the next day we are going to aggressive dump Thursday. \n\nhttps://preview.redd.it/zvyx5vciv6d91.png?width=975&format=png&auto=webp&s=051c86d6f5ab423161d75f9ed3ee5d07ba3812ea\n\nhttps://preview.redd.it/e9hr82ziv6d91.png?width=975&format=png&auto=webp&s=9189746fd493a245a70bcdf74e7f15f8f520b8e7\n\nNow apple is an interesting chart. I missed the massive breakout that apple was going on and truly that handicapped me this week as I missed the bullish tech momentum that Apple hinted at in early July. \n\nRising wedge- apple is trading within two potential rising wedges. There is the solid black support line which puts support close to 150.5 to 152. This support has held up nicely since June 30th that’s nearly a month long bull support line on Apple. Resistance wise we have the first one using todays candle the black dotted which shows 156.5 as resistance for Monday and then we have the solid black resistance line that actually shows Apple could break out of its grey bear channel. \n\nGrey bear channel- this channel resistance has not been tested since the April bull run. We are closer to it now then we have been since then. This week we have potential to not only test resistance but also to break resistance if Apple can see 158. 159.5 for 100% confirmation. However, a rejection here would play the bearish thesis out for SPY and the overall markets. This 158 rejection also would allow SPY to fill its 401.5 gap. \n\nDaily 200ema- this is the first time we have seen Apple close a full candle over the 200ema since May 4th (ironically that was FOMC day). \n\nDaily double top- apple put in a pretty convincing double top at 155.5 today and that will prove to be a key level for bulls to retake and for bears to defend. \n\nEMAs- we now have the daily 20ema crossed over the 50ema for the first time since April 22nd (very bullish), and we have the daily 8 ema threatening to cross over the 100ema which would be an incredibly bullish move. Bulls need to defend that 200ema with their lives next week. \n\nEarnings- this is actually why I am currently in a 7dte 152.5P for next week. In April the 7day proceeding earnings on the 28th saw a 10% drop and 9% drop. With the big SNAP miss and overall slowing of hiring announced this week and what not I am playing this that we should see further drop Monday Tuesday and Wednesday leading to the Thursday Earnings. This would target 138-140. I personally do not think it dips that low but I am eyeing support around 147. \n\nhttps://preview.redd.it/fme7fwojv6d91.png?width=975&format=png&auto=webp&s=01bc88bcaf07484f86223333d4001b35bdbef914\n\nThe Apple weekly chart actually is looking hella bullish right now. \n\nBlack dotted bull channel- that we have held despite its tightness for 6 weeks now… That’s some significant movement green… Support for this remains at 152.3 next week. IF that level breaks we should suspect downside closer to 140-145. If bulls defend 152.3 we have upside potential of 167 based on the black dotted channel. \n\nRed dotted bear channel- this channel shows that if bulls hold onto support of the black bull channel and if earnings are good this week we could be seeing 164 tested. This 164 and red dotted resistance line is very important because it shows that we are 100% out of the bear channels and will look to tackle the last resistance line at 175. The thing to know is that Apple unlike most charts (SPY/ QQQ) didn’t have the straight drop it sideways burned and in March had such an aggressive recovery it nearly retouched ATHs. \n\nBlue dotted bear channel- this one is a key level for bulls to break through. It rides at 156.2 which is the level Apples weekly rejected at this week. If we break through that there is a lot of green ahead of us. If we reject there and reconfirm the bear channel then we are starting to think about that support line down in the low 100s again. \n\nOverall I see a big case for bulls the more im diving into this. If it was not for FOMC I would be 100% bullish next week. Is FOMC enough reason to not be bullish though? Historically speaking yes it is. As you can see every week this year before FOMC has been red in preparation and 50% of the time SPY is red the two days before FOMC. Once we get FOMC, GDP and Earnings outta the way then we can follow the chart and not the events. \n\nNOTE- I am out of town Monday and Tuesday with the family at the beach… no TA those days and no trading those days. I will be back in the saddle Wednesday though for FOMC of course!\n\n10% challenge-\n\nOverall this was a red week for me. I had a great Monday (broke my 5 week long red Monday streak which is great… also broke my red Friday streak too) but I unfortunately could not get on board with the bull thesis this week and that was my downfall. I was too bearish with FOMC coming up and expecting a sell off that I missed out on big gains. That was a bias I gave myself based on previous data. \n\nI also got greedy at times too and didn’t trust the trend. This is actually the best trends I have seen in months on SPY. We pretty much had five days this week that once the morning bullshit was done we were locked into a solid trend that was easy to follow and maximum gains were able to be achieved. OF course this market has turned most of us into scalpers so its hard to trust anything over 10-15% gains. \n\nThis week ALMOST makes me believe in trusting the trend. And that just because a candle retraces slightly doesn’t mean we have to exit. If this is truly the new market and we truly put a bottom in… we just might be seeing some normalcy return. \n\nThe biggest thing for me next week is to not fight the trend and also no matter what I THINK its going to do we trust the trend in front of us. I wont miss out on any rallies just because I don’t believe it anymore. \n\n&#x200B;\n\nhttps://preview.redd.it/3np0n4dkv6d91.png?width=780&format=png&auto=webp&s=57b49f54c5a349496da53fa162a8718096a80a75\n\nI didn’t make any new trades today. I averaged down my 0dte that I swung (too early but still for nice profit) and then I let my 5dte run till pretty much the bottom at 393 and close that for maximum profits. Overall a great day. I didn’t make any actual day trades just cause I didn’t wanna be over leveraged and I was planning to save BP for a swing but decided not to use what I planned to use. \n\n&#x200B;\n\nhttps://preview.redd.it/0l6rzuukv6d91.png?width=820&format=png&auto=webp&s=a669c1dca3f050701cdb4229985ea513c9f067f1\n\nI opened this VERY small swing for next weeks earnings. I expect a sell off into earnings so I will be looking to close this Monday or Tuesday depending on what happens. However, upon writing this TA I am not as confident in this position as I was when I opened it and Apple and SPY looked like an EOD sell off was coming. \n\nI don’t plan to trade at all Monday or Tuesday. I might make a small swing Monday night depending on what I see. But Tuesday night historically besides the January FOMC the risk to reward of swinging anything into FOMC is not there…", "id": "w5m6n6", "created_utc": 1658525932.0, "score": 57, "upvote_ratio": 0.86, "num_comments": 58, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|238|**First Seen In WSB**|1 year ago\n**Total Comments**|2235|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/uxvyrg/52522_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuwx6/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuz82/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/v8vbnd/6922_spy_daily_ta_bonus_cpi_day_trade_breakdown/) [x](https://www.reddit.com/r/wallstreetbets/comments/ur9t1w/51622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w5k3q1/the_only_fomc_week_ta_dd_youll_ever_need_to_read/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpf4gi/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpezp3/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthspd/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w5m6n6/72222_spy_es_futures_weekly_ta_and_recap_bonus/) [x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/uyxorz/52722_spy_pre_market/) [x](https://www.reddit.com/r/wallstreetbets/comments/skp8ci/24_spy_recap_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vikp3b/62222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vcewfy/61422_spy_daily_ta_and_a_breakdown_of_how_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/vydqkl/71322_spy_es_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vm7yov/62722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/us0d0d/51722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w29gw7/71822_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v23784/53122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v9jfp2/61022_spy_weekly_review_fomc_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjbyng/62322_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v6ewtr/6622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vz5ejc/71422_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5w3m/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5xtr/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vmx21o/62822_spy_es_futures_daily_ta_bonus_qqq_and_apple/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/w33way/71922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vs0b13/breakdown_of_fomc_minute_days_and_how_to_trade_it/) [x](https://www.reddit.com/r/wallstreetbets/comments/vd6j6u/61522_spy_daily_ta_and_fomc_trade_review/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/usqmwy/51822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v2sj0k/6122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v7clxo/6722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vzz7j9/71522_spy_es_futures_vix_uvxy_and_amd_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjy8l2/62422_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w3x7sj/72022_spy_es_futures_daily_ta_little_fomc_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vw7sc0/its_time_to_go_long_on_vix_uvxy_calls_july_is/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdhxd/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdk8h/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwhw7o/how_to_trade_cpi_day/) [x](https://www.reddit.com/r/wallstreetbets/comments/v3mubg/6222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v82mas/6822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vnphqa/62922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvrv2/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvtju/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdwm4u/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v48yk1/6322_spy_weekly_ta_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwukf1/71122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdzrud/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthl4s/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w4rgvv/72122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/ux4ri2/52422_spy_daily_ta_fomc_minutes_prediction/) [x](https://www.reddit.com/r/wallstreetbets/comments/vbnl4b/61322_spy_daily_ta_and_fomc_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vt2tn2/7622_spy_es_futures_daily_ta_and_fomc_minutes/) [x](https://www.reddit.com/r/wallstreetbets/comments/vhms2v/62122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vojpv5/63022_spy_daily_ta/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w5m6n6)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w5m6n6)", "score": 1, "replies": []}, {"body": "That JPM collar though...I think it was interesting we immediately hit SPY 400, rejected, and went down. Actually it would make sense to me how this market was pumped up so high this week as a cushion for whats to come. This mornings PMI showed 47.5, the worst since the great recession if you exclude the COVID black swan event. More jobless claims than expected as well. With that GDP print confirming double contraction for 2 quarters, I feel that the media won't be able to cover this \"soft landing\" narrative that well anymore, along with Europe and China in shambles. Once the word \"recession\" appears, the panic finally might solidify and we begin to price in the recession in the stock market which has been in complete denial.", "score": 11, "replies": [{"body": "I had calls I was going to sell at 401 when the gap was filled. Just got smoked when it was rejected by 400. I think bear is back in session next week. Meta and Google will likely have less ad revenue as evidence by snap", "score": 10, "replies": [{"body": "Meta, absolutely. But I think Google is benefiting from budgets being shifted from social to search, not being reduced. Social is getting hammered from reduced attribution from so many privacy restrictions, making it seemingly super expensive. Search is just cost-per-click and it looks cheaper, so money moves there.\n\nSource: trust me bro, I work in adtech servicing Fortune 100 clients", "score": 10, "replies": [{"body": "Sp meta puts?", "score": 3, "replies": [{"body": "Given the drop since Snap’s earnings and elevated IV, hard to say how much money there is to be made at this point. $155.85 looks to be the 6 month low, so there’s a little room for known range, but again, feels chase-y at this point.\n\nI like GOOG calls over META puts.", "score": 3, "replies": [{"body": "I'll probably stick with spy puts", "score": 4, "replies": [{"body": "May the economy burn ![gif](emote|free_emotes_pack|sunglasses)", "score": 5, "replies": []}]}]}]}]}, {"body": "Same here I tried to sell off enough to cover my cost basis for my calls and let the others ride. It dumped so quickly that it didn't fill. Held to long thinking it would still hit that gap and got crushed. Hopefully get the lower gap filled before Wednesday", "score": 2, "replies": []}, {"body": ">That JPM collar though...I think it was interesting we immediately hit SPY 400, rejected, and went down. Actually it would make sense to me how this market was pumped up so high this week as a cushion for whats to come. This mornings PMI showed 47.5, the worst since the great recession if you exclude the COVID black swan event. More jobless claims than expected as well. With that GDP print confirming double contraction for 2 quarters, I feel that the media won't be able to cover this \"soft landing\" narrative that well anymore, along with Europe and China in shambles. Once the word \"recession\" appears, the panic finally might solidify and we begin to price in the recession in the stock market which has been in complete denial.\n\nYeah man, I was ready to sell the calls at 401 also when the rug got pulled.", "score": 2, "replies": [{"body": "The pump does make sense to make it look not so bad if spy drops 30 this week", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}, {"body": "What’s a collar?", "score": 2, "replies": [{"body": "Check out this post by D^2 earlier weeks back\n\nhttps://old.reddit.com/r/wallstreetbets/comments/vogpn1/new_jpm_collar_for_september_30th_located/", "score": 2, "replies": [{"body": "And how do we know that’s JPM?", "score": 2, "replies": [{"body": "Can't remember, you'll have to ask OP", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "350 by next week would be god tier. I’m just sitting on some 357 puts for 7/29", "score": 6, "replies": []}, {"body": "So you are thinking 350 this week,?", "score": 4, "replies": [{"body": "If it happens at all I’d say sometime between next Thursday and Aug 5. We will see.", "score": 7, "replies": []}]}]}, {"body": "great day\n\nsomething probably got leaked, like tech earnings or proxies next week\n\nit seems like ta is negative for mon\n\nmagic 8 ball is meh (tad positive)", "score": 7, "replies": []}, {"body": "Thanks for the DD, it's great! Could you also explain why you think the bottom has already been reached? Yet I see too many and heavy downturns to make us cross below 360", "score": 4, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Have to add the president has COVID. All we need is a hospital stay and things could get shaky…", "score": 3, "replies": []}, {"body": "I think China real estate and current bank situations along with European economy deteriorating could push us lower later this year", "score": 3, "replies": []}, {"body": "Looks like monkeypox might be the black swan that will be the catalyst that triggers a crash. At least crypto is way down.", "score": 1, "replies": []}]}]}, {"body": "I closed all my SPY 8/19 380p, I got a little upside down scaling into this position, didn't expect TSLA's ER to unravel like it did. I guess people are still crazy for it, the padded books didn't sit well with me (oh well, market does what it does). I did avg down this position at about 3pm yesterday, but you know how yesterday ended. Closed down about 14% of a 2K position.\n\nWith the big boys ERs next week, I'm afraid it's to difficult to know how to play it, lots of signaling of a slow down from AAPL and GOOGL, ad sales across the board have been hit, OMC, SNAP, etc... in my heart I repositioning into some ATM/ITM puts is the play, but I really think FOMC causes some hesitation. I feel June was fairly stagnant with inflation, gas has leveled out and come down a bit throughout June, so I could see the fed just doing the 75 raise with some positive feedback about what they are seeing, that will probably drove the market up. \n\nSo maybe a straddle is the play.", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 3, "replies": []}, {"body": "Im taking this as financial advice. I bought two SPX 3850p Aug 5 exp. They better make 10x or Im getting a new TA guy", "score": 7, "replies": []}, {"body": "I’m thinking we’ll have a pretty big dump after those GDP numbers come out. It should be priced in because the Atlanta Fed has been projecting a negative quarter for over a month now but I see so many headlines about how people are worried the fed will push us into a recession by hiking rates too fast.", "score": 6, "replies": [{"body": "Been seeing Atlanta Fed is saying pretty negative, but every other analysis I’ve seen is saying slightly positive estimate. Is Atlanta Fed pretty spot on?", "score": 4, "replies": [{"body": "I haven’t followed them long enough to know but it definitely sounds reasonable. I find it hard to believe that we went from a negative GDP quarter to a positive one just like that and with no catalysts. We’ve been raising interest rates which should slow the economy not grow it.", "score": 2, "replies": [{"body": "I’m with you in the thought process. Arguing against myself, I can only think of if supply chain started easing in Q2 compared to Q1, and inflation continued to rise, then total notional value increases enough to have positive GDP.", "score": 3, "replies": [{"body": "Yeah I could see that. If the analysts weren’t so overly optimistic I would believe them but they’ve been off on CPI almost every month and not for the better. Honestly nothing would surprise me at this point", "score": 2, "replies": [{"body": "So, went and did the comparison. Atlanta Fed is pretty hit or miss. They've ranged in absolute values being 0.2% to over 4% off, being more than 1% off 9 of the last 16 quarters. Screenshot: [https://imgur.com/a/hiZGknV](https://imgur.com/a/hiZGknV)\n\nEven on their own website, they're showing that they're virtually the only ones predicting negative: https://www.atlantafed.org/-/media/images/cqer/research/gdpnow/gdpnow-forecast-evolution.gif?h=498&w=650&la=en", "score": 3, "replies": [{"body": "Interesting. Nice work looking that up. I can now see why markets aren’t pricing in a negative number yet. I’m still expecting a negative number next week but it’s far from a sure thing. It would be pretty impressive to see us go from a negative 1.6% quarter to a positive one", "score": 3, "replies": [{"body": "It’ll be interesting if GDP is positive, but inflation-adjusted GDP is negative.", "score": 3, "replies": [{"body": "Algos won’t know what to do lol", "score": 3, "replies": []}]}]}]}]}]}]}]}]}, {"body": "“Lives rent free in SPY’s head!” 🤣\n\nHad 3 shorts on ES this morning. Main trade was in the opening 5 minute bar. Though I usually play small ball in the opening 15 minutes due to it usually being a washing  machine of order flow being filled and IV being high at the open, when they opened the 9:30 bar gapping slightly in the green, I put in a larger order than normal well under the market for the 0DTD 3980 puts at $8. ES ran to 4007ish and I got filled. Closed less than 3 mins later-still in the opening 5 min bar at $10.25. They ran to $13.50 or so I’m the next 5 minutes but I’d never second guess a quick trigger that time of day when my indicators were mixed. \n\nI made 2 smaller trades, also on the short side for quick profits and my day was done shortly after 10. I’m totally gassed after this week and wasn’t going to make it to 11ish when trend really accelerated. I also wouldn’t have risked the day’s gains at that point. 3 for 3 is one thing but I don’t go 4 for 4 intraday!\n\nThere’s a lot to unpack in this post and will get back to next week’s thoughts over the weekend. I’m more bearish on earnings and the economy than I am the fed I think.", "score": 3, "replies": []}, {"body": "🍏🍏🍏🚀🚀🚀", "score": 3, "replies": []}, {"body": "I think Monday/Tuesday green. They need the last minute traps if it’s truly gonna be a rug pull.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "But last time when we got a negative Q1 GDP, the market had a big rally.", "score": 2, "replies": []}, {"body": "god, I would be so bearish next week if wasn't for this 1 dollar gap on spy unfilled, Spx stopping 4012.44 gaping to 4017.17, spy 400.18 to 401.44. I was like WHYYYYYY!!! Leaving out small gap like these will make people think, \"all gaps must be filled\", it's going to get people to buy in. \n\nThis has been going on for entire week now...I am baffled.", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "true, but there are just too many people bullish on mega tech earning week. Then again we also have the recession expectation, gdp, fed rate hike, pce, etc, all these possible negative sentiments, yet how many of us are sure of down turn is going to happen just because of the run up from this week? One thing for sure, it's going to get alot tougher to bet on recession", "score": 4, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "do you expect a leg down anytime soon after all  of the potential negative catalyst next week?", "score": 2, "replies": []}]}]}]}]}, {"body": "I was following Apple very intently yesterday, as I believe it has been one of the main drivers of the bear market rally the last week. Every time Apple got on board SPY broke through supports and resistances, but when Apple wasn't in on it it failed. For me it sort of seems like Apple might've been one of the most popular stocks to buy right now (safe haven in recession, will recover quickly after crash, blue chip with dividends that easily can increase prices in an inflationary enviruonment) and the drive upwards also looks a bit like a short squeeze to me. Russel 2000 also has a pretty short squeeze like movement after breaking out like Apple, and it led the way down yesterday with 2 percent having no help from Apple like the other indices. But Apple really fell like a rock yesterday breaking through supports like knife in butter, so I sort of guess that the short covering is over? Though people have to be insane to short Apple imho.\n\nI'm pretty bearish for next week, but I'm always bearish so that doesn't help much. Even though two thirds of companies have had good earnings until now, I sort of think that the strong dollar might show to make earnings worse for the rest, and the biggies this week I'd be surprised if not the majority don't have bad earnings. But I don't really do earnings plays because I don't know enough about the companies, but I'd probably buy puts for at least Amazon and Google. I think Apple is going to dump mostly because of technicals, but fundamentals for Apple are probably the best of the bunch.", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
