{"title": "I just put 7700 usd in QQQ and Tesla, am I insane?", "selftext": "[removed]", "id": "w4ez9w", "created_utc": 1658405047.0, "score": 15, "upvote_ratio": 0.8, "num_comments": 49, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|6|**Previous DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w4ez9w)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w4ez9w)", "score": 1, "replies": [{"body": "Hahaha GG OP", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 34, "replies": [{"body": "If I lost that money I’m dead haha , it’s all or nothing. I’ll update you", "score": 14, "replies": [{"body": "Coffindance.exe ![img](emote|t5_2th52|4267)", "score": 20, "replies": []}, {"body": "Costco sells caskets!", "score": 8, "replies": [{"body": "I’ll preorder one , thanks", "score": 9, "replies": []}]}, {"body": "If you’re serious then do a smaller position. This is not the market to be doing that in. Two years ago sure, but this could turn very quickly.", "score": 3, "replies": []}]}]}, {"body": "He who plays out of necessity loses out of obligation...", "score": 21, "replies": []}, {"body": "“Must pay urgent debt”\n\n> “gambling $8800 on stocks”\n\nJust become a financial advisor you will be rich in no time", "score": 17, "replies": []}, {"body": "Yes.\nYou will know about your insanity in coming weeks. \nGood luck", "score": 12, "replies": []}, {"body": "Really really bad time to buy qqq", "score": 6, "replies": [{"body": "Not exactly. The run up this week will retrace because nothing has fundamentally changed but grabbing up a liquid, broad sector ETF that is down 30% is absolutely a good time to buy. Tesla on the other hand, I’ll pass personally.", "score": 2, "replies": [{"body": "I feel we have further to fall but we are all guessing. Remind me in 6 months", "score": 3, "replies": []}]}, {"body": "Why are you ruining my day even more", "score": 0, "replies": []}]}, {"body": "Depends on the rest of the portfolio.\n\n>in order to pay an urgent debt by the end of the month... Has somebody experience...\n\nYou're emotionally involved in the play. You're asking for a loss.", "score": 7, "replies": []}, {"body": "Did you go long or short? \n\n“Only want to short them”….", "score": 5, "replies": []}, {"body": "This would have been a great move about a month ago.", "score": 4, "replies": []}, {"body": "No, you're not insane. You're retarded.", "score": 5, "replies": []}, {"body": "we would like to see the leg or legs in a cast![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "If that happens probably will appear in the news", "score": 3, "replies": []}]}, {"body": "what could go wrong?", "score": 3, "replies": []}, {"body": "If u need it short term its important to be aware that the market is coming up to critical resistance which if spy rejects, would confirm the downtrend is still valid and therefore traders would short the market, potentially causing more pain in the short term. \n\nWe just got lots more bad news and the only reason market bouncing is speculation that the worst is behind us already.", "score": 3, "replies": []}, {"body": "are u long or short!?!?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah, but I didn’t want to put 20k in one sit. If I’m still alive by the end of the month will improve the portfolio", "score": 1, "replies": [{"body": "You will lose it all", "score": 6, "replies": []}]}]}, {"body": "Qqq has to retest 296 resistance which will become support before going higher. Today will be red, but fear not.", "score": 2, "replies": []}, {"body": "I would say that you should consider an actual casino, but then again you truly belong here.", "score": 2, "replies": []}, {"body": "What’s your position. Tesla might tank, but it could take a few weeks.", "score": 2, "replies": []}, {"body": "I think your late,  going to dump my money in energy and buy puts on Tech.", "score": 2, "replies": []}, {"body": "I would had gone with $7777", "score": 2, "replies": []}, {"body": "You bought it while its down 26% and not at all time high's. You just need patience and to not be emotional with it. Stock market goes up over time. Just look at the history of the stock market. It's all about time in the market to let it go up.", "score": 2, "replies": []}, {"body": "shit, i’m going to put 10k in QQQ when blood is in the streets in december", "score": 2, "replies": []}, {"body": "Can't go tits up", "score": 2, "replies": []}, {"body": "7700 is the transponder code for emergency aircraft. Your account about to crash and burn.", "score": 2, "replies": []}, {"body": "Top confirmed, going long SQQQ", "score": 2, "replies": []}, {"body": "You do know you have better chances with 7k at a casino right?", "score": 0, "replies": [{"body": "Sir this IS a casino!", "score": 8, "replies": []}]}, {"body": "idk about QQQ but TSLA is a great choice", "score": 1, "replies": []}, {"body": "Did you do this yesterday- why would you bet on more upside after 4% run? I really hope you don't need the money , kinda sounds like you owe money to some not so nice people , better off using it to move.", "score": 1, "replies": []}, {"body": "Your wording is confusing: if you \"put\" 7700$ in QQQ and TSLA, do you mean that you bought \"put\" options (i.e. you went short), or that you \"put\" (i.e. \"placed\") your money in those two instruments (i.e. you went long)?\n\nAnyway, to answer your question: in the very short term (= days) it is probable for those to go higher (but the rally has begun some time ago and it is not clear how much higher it has fuel to go anymore), in the medium term they will go down with the whole market.", "score": 1, "replies": []}, {"body": "you have to pay debt so you are going all in on naked options? You are setting yourself up to get fucked", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Yeah :( I saw that", "score": 1, "replies": []}]}, {"body": "You’re using the only cash you have and gambling it all so you can pay an even greater amount in debt? Why not... oh, I don’t know.... pay some of your debt with some of the cash you just gambled away and are going to surely -99%?\n\nOh wait, I forgot... we don’t do that here.", "score": 1, "replies": []}, {"body": "Please tell me this is a joke", "score": 1, "replies": []}, {"body": "You’re dead if you loose $7,700?", "score": 1, "replies": [{"body": "Third word is not fun always", "score": 1, "replies": []}]}]}
{"title": "7-21-22 Spy/ ES Futures Daily TA", "selftext": "Today was yet again another interesting one. Today if you missed it Biden was diagnosed with COVID… only mild symptoms. This was VERY interesting timing as markets had already saw a very aggressive morning rejection and was starting a dump. The new came out and the sell pressure hit some pretty high levels however, we managed to find support at that 391.5 to 392 range yet again and went on for a pretty impressive $7.21 run. \n\nhttps://preview.redd.it/5id89j0jizc91.png?width=975&format=png&auto=webp&s=03472c6b29c41c4421c0cd6d7363132c61ff170d\n\nSomething extremely interesting about this week before FOMC is that this is the first week since the November 2021 FOMC meeting that SPY has had a green week proceeding the FOMC meeting. So that’s only 1 other time in the last 6 meetings we have seen that… interesting to say the least. This is also the lowest the VIX has been the week before FOMC since January. \n\nWhat does this mean? I am not sure… but the sentiment right now is clearly very bullish but I think that we are about to see this change. The steam has been slowly fading. \n\nhttps://preview.redd.it/ufkgh4pjizc91.png?width=403&format=png&auto=webp&s=aeec0d852274ebfb767dd32ca31732567a3f6cab\n\nSNAP just came in with a massive miss and they couldn’t provide guidance… after hours pinterest, google and meta all tanking on this… as I write this… everything is red after hours. Tomorrow is going to be interesting. So what am I seeing? \n\nhttps://preview.redd.it/zyv7oedkizc91.png?width=975&format=png&auto=webp&s=913d634c3e9dee17991f58c7922d8980251430d1\n\nKind of an interesting case here on the daily. At open today we had already broken the week+ long support line. This means that the rising wedge you see what and is broken. So that SHOULD be a sign of a drop that is coming. I am looking at that red resistance line and the last 4 candles on spy have hit it… today came very close to hitting it but did not have enough momentum to hit its 400 target. \n\nThis candle is a hammer candle on paper which could signal a top. \n\nhttps://preview.redd.it/s4j32oxkizc91.png?width=975&format=png&auto=webp&s=5827fdfa1467e78f8c99430e21c05defc436c976\n\nThe SPY weekly did break its resistance line which is bullish, however, its fallen short of its 400 resistance line. \n\nhttps://preview.redd.it/j4hsj9jlizc91.png?width=975&format=png&auto=webp&s=d5b2405f9cb86b2d325436d0042ec5cf5d9dd62b\n\nES futures perfectly rejected the 4005 resistance line. We have not however, seen ES futures break down out of its rising wedge but we are seeing that tomorrow and overnight this 4005 resistance level is going to be key. My expectations is ES will retest 4005 perhaps even the red dotted line at 4015 before it rejects and falls out of the rising wedge with support at 3945. \n\nhttps://preview.redd.it/byfa2j6mizc91.png?width=975&format=png&auto=webp&s=a5390af64a18be0ab71302f85264dd488bd29bd6\n\nI wanted to draw some attention to Apples Daily chart. Apple has been in my opinion carrying this whole last month of movement upward. Today we saw a confirmed hammer candle on the daily and the last time we had a candle like this was May 17th which led to a massive gap down and a massive red day. You can see the last two days on Apple the volume has significantly dropped off which tells me that the buying momentum has faded and we should and could be seeing the top put in right now. \n\nBull case- \n\nDespite a spotty morning we were able to back test 392.3 support and make it through the morning Biden Covid news. Despite the rising wedge breaking we are still making higher highs and higher lows since July 14th. Markets are still quickly pricing in all news. The weekly just saw a major resistance line broken and now with the June 9th gap only $2.60 away it is a natural expectation that this will be filled tomorrow as it is within reach. The bulls have clearly been in control all week with every dip being a CALL buying opportunity. \n\nBulls will look to gap fill 401.5 and break through resistance at 402.4. From there it looks to continue its bullish momentum as we head into next week where bulls will look to reach the top of the rising wedge at 415 before FOMC on Wednesday. \n\nBear case (this is where im leaning)-\n\nThis is the first earnings that really has shaken up the market. Now SNAPCHAT does not have a huge stake in the market BUT you can see everyone is being hit by it now. A little odd thing is that last earnings seasons SNAP report on April 21st and that was what proceeded a major sell off going into FOMC the next week… April 21st was the top after SNAP reports and today is looking to be the top after SNAP reported and FOMC next week… coincidence? Probably… but weird… okay back to TA…\n\nDespite the bullish momentum today we saw that the support line that has been carrying spy fell today. We have now broken out of the rising wedge and that naturally should signal a top. The bulls for two days straight now have had an opportunity to reach 401.5 to gap fill yet have failed time and time again. Intraday the last two days we have seen some pretty heavy sell offs and sell pressure, however, at this momentum for now its been eaten up by the bulls.\n\nWith this hammer candle on Apple and Spy and an overall decrease in the volume on SPY, with 4 of the last 5 days being green (3 green in a row) and the weekend ahead it is a natural expectation that we see a red day tomorrow. With the weekend ahead and snap now missing earnings hugely and not giving guidance we should see people start to position themselves for the rest of big tech next week and FOMC next week. \n\nBears will look to break down that \n\nIf by some miracle the bulls can keep this momentum up tomorrow and they can take this to the gap fill and even that 403 level I mentioned I would be surprised. 392.5 and attempt to close SPY back under the daily 8ema which is currently at 389.5. A closure back under the daily 50 and 8ema would be a very bearish turn for the markets and would give a nice hint of bearishness heading into FOMC next week. \n\n10% challenge-\n\nToday I did not make any day trades. My expectations were a range day and this morning movement was anything but normal. We had once again some major 0.5% candles and saw at times Spy moving up and down but 50 cents at a time. When the Biden covid news hit I was ready to take a short but knew that this could be the over reaction. Despite increasing sell pressure I waited and it paid off. Around 2pm when I saw how strong 397.3 resistance was holding up I did scale into a 1dte and 6dte put position. I had plans to scale in further EOD but with us so close to the gap fill I wanted to be cautious and knew that theta would eat me up overnight either way. \n\nMy plan is to see where we open the 1dte has a break even (currently with no expected IV pump on a dump) of 394. There is a pretty big case that we could see a -1% or lower opening. With the dump right at close my average down only brought my breakeven close by $1 so the risk to reward was not there for me. If we open green and look to be going for gap fill I will consider averaging down there if I suspect an EOD sell off. If we open big red I will most likely just let it ride as If we are red I suspect a bigger sell off. \n\nThe 6dte I wanted to scale into and hold this till Tuesday night. I suspect that we are going to see a pretty large sell off tomorrow, Monday and Tuesday especially. I will look to average down if we gap fill this otherwise I will consider adding to this in the morning. I most likely will take profits EOD and then open a new position for next week depending on what tomorrow brings. This 6dte has about the same breakeven without pump near 394.5. \n\nNot going to lie after a rough week of trading for me it felt kind of nice not playing anything and just watching it. The momentum was spotty at times. I never felt like the bulls had me convinced we were going to run like that EOD. I also have not been a fan of trading over the probable IV highs/ lows and we once again hit the improbable IV high. \n\nhttps://preview.redd.it/o1op9b1nizc91.png?width=805&format=png&auto=webp&s=4c4e7da8568eee0c5f4d0c0d8fd9ea7bd7c01467", "id": "w4rgvv", "created_utc": 1658436831.0, "score": 85, "upvote_ratio": 0.94, "num_comments": 47, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|236|**First Seen In WSB**|1 year ago\n**Total Comments**|2224|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/uxvyrg/52522_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuwx6/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuz82/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/v8vbnd/6922_spy_daily_ta_bonus_cpi_day_trade_breakdown/) [x](https://www.reddit.com/r/wallstreetbets/comments/ur9t1w/51622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpf4gi/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpezp3/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthspd/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/uyxorz/52722_spy_pre_market/) [x](https://www.reddit.com/r/wallstreetbets/comments/skp8ci/24_spy_recap_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vikp3b/62222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vcewfy/61422_spy_daily_ta_and_a_breakdown_of_how_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/vydqkl/71322_spy_es_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vm7yov/62722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/us0d0d/51722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w29gw7/71822_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v23784/53122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v9jfp2/61022_spy_weekly_review_fomc_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjbyng/62322_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v6ewtr/6622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vz5ejc/71422_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5w3m/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5xtr/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vmx21o/62822_spy_es_futures_daily_ta_bonus_qqq_and_apple/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/w33way/71922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vs0b13/breakdown_of_fomc_minute_days_and_how_to_trade_it/) [x](https://www.reddit.com/r/wallstreetbets/comments/vd6j6u/61522_spy_daily_ta_and_fomc_trade_review/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/usqmwy/51822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v2sj0k/6122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v7clxo/6722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vzz7j9/71522_spy_es_futures_vix_uvxy_and_amd_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjy8l2/62422_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w3x7sj/72022_spy_es_futures_daily_ta_little_fomc_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vw7sc0/its_time_to_go_long_on_vix_uvxy_calls_july_is/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdhxd/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdk8h/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwhw7o/how_to_trade_cpi_day/) [x](https://www.reddit.com/r/wallstreetbets/comments/v3mubg/6222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v82mas/6822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vnphqa/62922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvrv2/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvtju/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdwm4u/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v48yk1/6322_spy_weekly_ta_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwukf1/71122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdzrud/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthl4s/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w4rgvv/72122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/ux4ri2/52422_spy_daily_ta_fomc_minutes_prediction/) [x](https://www.reddit.com/r/wallstreetbets/comments/vbnl4b/61322_spy_daily_ta_and_fomc_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vt2tn2/7622_spy_es_futures_daily_ta_and_fomc_minutes/) [x](https://www.reddit.com/r/wallstreetbets/comments/vhms2v/62122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vojpv5/63022_spy_daily_ta/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w4rgvv)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w4rgvv)", "score": 1, "replies": []}, {"body": "Pretty sure that reversal this morning was my fault. SPY broke through the $392 resistance so I loaded up on Puts at $391.90. Immediately started going up and continued all day\n\nI should start my own discord where I tell people what I'm buying and they ride the wave in the other direction.", "score": 33, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Then I guess you're first in line for my upcoming discord lol", "score": 4, "replies": [{"body": "I’ll show up, I thought the 390 puts I picked up last week would carry into this week. No chance.", "score": 3, "replies": []}]}]}, {"body": "Me too. I was foolish enough to think the 200 year old president getting covid was bad news", "score": 3, "replies": []}, {"body": "I wanted to buy puts… so i reversed myself.  Worked out well.", "score": 3, "replies": []}, {"body": "I sold my calls and switched to puts at that exact time 🤣", "score": 3, "replies": []}]}, {"body": "I like reading you analysis. Keep up the good job 👍", "score": 19, "replies": []}, {"body": "I'm holding calls so I hope it shoots up to 403 early. I'll sell my calls and hold cash until next week. I think the fed stays at 75 bps and the market runs Wednesday", "score": 14, "replies": [{"body": "Same here on lotto $400c! Lol", "score": 7, "replies": [{"body": "Oh my. AH spy isn't looking hot thanks to snap. But there always seems to be a rehearsal. Then an opening run and then a drop within the first 30 minutes. And then a big run up. \nThey'll probably change the play book on us now", "score": 2, "replies": [{"body": "I like the current play.  It lets you jump in before the run.", "score": 2, "replies": []}, {"body": "It's gonna be a Friday rug pull.", "score": 1, "replies": [{"body": "Why?", "score": 3, "replies": [{"body": "Lots of good earnings early in the week driving up the market, but with the drop tonight from Snap along with events scheduled for next week, I don't think Friday is going to continue the bull run. Don't mind if it does, but I don't expect it to just shoot straight to 400.", "score": 3, "replies": [{"body": "I really don't know what to think. I think Wednesday will be green is the fed only raises rates 75 bps. What I really need is a gap up and quick run to 403 in tvf morning so I can sell me calls for a profit", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I was paying attention to nvda and qqq this week, it seems like they always left a tiny gap \"unfilled\" eod. Then when you think that they don't have the momentum to fill the gap, and the market went 360 on you and fill the gap throughout the day, no matter what bad news came out.\n\nSo we have the spy here, tiny gap left, snap miss, and the question is will it enough to tank the market, or will they try hard to fill that gap on spy...Vix break through the support and all, I really don't know anything anymore", "score": 7, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "can we use that as indicator for fake dump? btw I wonder if any of you noticed those 200k+ volume that went in throughout the day over the past 2 days. Huge spike everytime, seem it when qqq was like 293, but their purchasing price was like 289.55 ish for 3 or 4 times throughout the day. Only once today though...", "score": 3, "replies": []}, {"body": "Exactly VIX still not cooperating and Tessy absolutely wrecking shorts on that weird earnings “beat”. I know it’s not probable and I had just about given up on my bullishness, but I’m expecting another stupid pop tomorrow maybe into Monday. The OI on puts is nuts everywhere, I wouldn’t put it out if the question for Tessy to run another 30$ tomorrow and bring the market with it. That being said, we are seeing some decent red after close, but this bill run hasn’t quite run out of steam yet in my opinion. At what point does it make sense for Tesla shorts to cut losses? 820? 830? 850? Can honestly say I haven’t upward action like that any time previously. Anyways, I’m lonely wrong so put will go brrrr, but I do have a few 400c.", "score": 3, "replies": []}, {"body": "How is VIX priced exactly? Aren’t option IVs and VIX linked in some way?  If VIX isn’t going up on a big move I’m guessing options aren’t driving the move with the gamma squeeze goodies.", "score": 2, "replies": []}]}]}, {"body": "I didn’t get long against the tape bomb-I didn’t get long against the tape bomb! Finally, of the 3 tape bombs this week it didn’t attempt a premature long against 3950 today. The volatility around1015/1020 was visible if you just looked at bid/ask and not a chart. News made it to the market a little quicker than for the Apple or Google hiring freeze tape bombs (maybe cause this one was actually newsworthy?). \n\nOnly a few trades today and the only closed in the red was an early ES put that I quickly closed and switched sides to test up to 3950. Didn’t look to rush in at 1030 and waited for a couple of bull flags against the 9 ema. Those call buy worked out and I was done for the day. Wasn’t too worried if we saw 4000 or not from there and was done by 1230. Frankly, been an exhausting market week and it finally was catching up to me. I just thought best to watch the action and keep my gains. \n\nDid I mention I didn’t get long against today’s tape bomb!?!? \n\nAnother great post D^2 and I’m starting to warmup the bear setup. \n\nLet’s see what they give us tomorrow.", "score": 5, "replies": []}, {"body": "Snap collateral damage reaches out to advertising sensitive tickers. Meta, Pins, twtr on the social side and mgni, ttd, goog and apps on the service side.", "score": 8, "replies": []}, {"body": "Right on bro! All of this week has been like a meth induced tulip mania buying, like as if the money printer was on and 0 interest rates. Completely agree with what you said, if this thing doesn’t start to tank tomorrow or next week, then I will learn that the stock market actually can go to infinity all fundamentals be damned. Loaded some SQQQ shares in the AH right now 👌", "score": 7, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "There is just no way this is sustainable especially in a fed tightening cycle. Even if this thing rallies next week, no way in hell we will start a new bull run I think.\n\n1968: Inflation at around 4% (Start of inflationary period):\n\nS&P500 = 98\n\n1979: Inflation at around 10% (Right before Volcker hikes us into recession)\n\nS&P500 = 99\n\nA 1% gain in SPY, NOT ACCOUNTING FOR INFLATION, an entire decade absolutely lost\n\nAnd real inflation right now is ~20% using 80s formula\n\nCan’t see how any rallies will last until JPow has the balls to hike us to recession back to 3% inflation, which probably won't happen. Sideways market for the next 5 years might even be on the menu!", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "You do all this but don't make money\n\nJust like the rest of us\n\n![img](emote|t5_2th52|4270)", "score": 5, "replies": []}, {"body": "Thanks!", "score": 3, "replies": []}, {"body": "It’d be good to see SPX gap fill from June 9th first, before we bear our way down a good 2%. In the last two days alone there were few massive 1-2dte bearish bets of 10M+ in premium per order. It can get pretty ugly pretty quick tomorrow.", "score": 3, "replies": []}, {"body": "felt like the market was rallying then dipped after biden announced he had covid.  i think the market dipped because it might have seen harris as potentially taking over hence why the market rallied again after he announced he was fine.", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "I'm surprised we're even rallying at all.  perhaps it's just a technical bounce from oversold conditions and there's nothing more to ascertain.  all i know is i'm pretty f'ed tomorrow cause SNAP and STX both drilled after their ers.  My only hope will be that CLF saves my other steel stocks tomorrow morning.", "score": 3, "replies": []}]}]}, {"body": "Have you seen any odd massive put orders?", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Spy, QQQ, 54%, 58% respectively, puts vs calls. So sentiment bearish for sure.", "score": 3, "replies": []}]}]}, {"body": "Giving my 388 spy puts that expire tomorrow hope!", "score": 3, "replies": []}, {"body": "This some good shit right here, keep em comin", "score": 3, "replies": []}, {"body": "Either tomorrow, friday or monday. Bears gna come out full swing. Big volume and lots of funds buying vix etfs. Look at VIXY and UVXY. Its going to happen, its just a matter of when. Also this semiconductor bill, very interesting little addition to an already confusing market. If its rejected, you can bet your sweet juicy ass spy will hit 340", "score": 3, "replies": [{"body": "Hi! \n\nI bought 3000 UVXY shares this week at $12.10 Average. I know we’ve seen $16-17 recently… but will be happy to sell at $14.50 or so. Bought a few 30dte contracts too.\n\nWhere did u see the volume/funds buying Vix ETFs?\n\nThanks!", "score": 2, "replies": [{"body": "https://imgur.com/a/1wmMf9f/\n\n7/29 is spy options, the other two are VIX options. Barchart.com\n\nIf you dig around you will see many vix etfs are heavy on calls. Goodluck brother, hope we can all make some good money", "score": 2, "replies": []}]}]}]}
