{"title": "Now is a good time to invest", "selftext": "There's tons of us here right? We invested, we lost a lot of money, some of us in previous stock market downturns.\n\nBut for the young people out there who have never invested, now is a good time to invest. Now maybe the market gets worse from this point on... but there are people here who've started investing:\n\n* Since before October last year, who are now down like 20%-70% depending on how risky they invested\n* Since December last year... Down a lot still.\n* Since February this year...\n* Since April this year...\n\nThe only question becomes \"where is the bottom?\"\n\nAnd for young people if you haven't yet invested, you really may be in the best position to invest.\n\nObviously, yes, the stocks could still go down. There could be a recession, or it may be a slight bounce back, or it may not even be a bad recession, or it may be stagflation even worse... But start now, and then you have a chance to invest again harder in fall of 2022, maybe even harder in winter 2022, and again in Spring 2023. It's historically guaranteed the economy has recovered by then or nearing the end of any projected \"worst case doom and gloom\" scenarios.\n\nJust stop using that shitty app like robinhood, use like schwab, fidelity, etrade, chase, or something else.\n\nSometimes the best time to invest is now... You can certainly wait longer but that could just be missing out on some gains as maybe the market recovers and a lot of these issues like oil prices get resolved leading to less inflation as QT and belts are tightened of corporations. Back before covid19 2020 crash, we were talking about how the economy fundamentals were very strong. Not a lot has changed since then, just peoples' attitudes got more gloomy due to inflation / QT announcements.", "id": "vpjdlh", "created_utc": 1656735740.0, "score": 3, "upvote_ratio": 0.54, "num_comments": 58, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Hearing this every week over the last 6 months. Every time it’s now is the time.", "score": 18, "replies": [{"body": "I guess it's the time to DCA.", "score": 6, "replies": []}, {"body": "Now is certainly better than 6 months ago.", "score": 2, "replies": []}]}, {"body": "Also don't invest in sky high PEs or companies without any earnings, they will get hurt the most during a recession.", "score": 6, "replies": []}, {"body": "Now is the worst time to invest. Your much better off letting all the data and earnings releases get out there end of July. If your still optimistic enter the market August 1", "score": 12, "replies": [{"body": "Now is the worst time?\nAug 2021-April2022 was a FAR worse time.\n\nNow is definitely not the worst time. Now is a better time to invest than literally any time last year.\nAt least now multiples are much lower.\n\nIs now the best time? No, March 2020 and March 2009 were much better times to invest vs now.", "score": 9, "replies": [{"body": "Like Burry said you got multiple compression then earnings compression. You’v seen how the market felt about netflix, meta, target. Who has had good earnings for Q1? Its only gonna get worse. You wanna wait for the same signal as you had in 2020 which was the fed pivoting on policy to ease things. No easing in sight so far", "score": 0, "replies": [{"body": "The market is a discounting mechanism.  Many companies have already been priced for slight earnings compression.   Meta being one of them.", "score": 3, "replies": [{"body": "Did you think 174 was a good price for meta during the earnings decline? If you did your already down 14 bucks. People are going to buy the earnings “dip” just to wonder why they are down a month later. \n\nYou can buy this dip, but its nowhere close to the bottom. Again if you really cant help yourself from gambling this will immediately improve this month then place your bets. Gonna wait till after July and also see what Powell says at this meeting.", "score": 1, "replies": [{"body": "174 is a good price.  200 is a good price.\n\nI don’t really care where the bottom is.  Of course it would be great to know at what point meta will bottom, but nobody knows that.  I am extremely confident that Meta at any price below $200 rn will beat the market.\n\nFor all we know, Meta has already bottomed.  Even if the overall market continues to drop for the next six months, it’s possible that Meta doesn’t.  The indexes are dropping due to a cascading sell off.  \n\nDuring the dotcom crash, by the time SP500 bottomed, hundreds of stocks had been rallying upward for over a year already… if you waited for SPY to reach a certain level, you would have been late to the party for so many other stocks.   Amazon was already a multibagger off its bottom by the time the market bottomed.", "score": 2, "replies": [{"body": "Thats all very true! So are you buying this month?", "score": 1, "replies": [{"body": "I’m holding at the moment. I was a buyer in mid May.  I don’t own Meta btw.", "score": 1, "replies": [{"body": "Yea I dont think it makes any sense to sell anything held this far. Even if we are in for some catastrophe, the market always comes back from them. Its just soooooo strange how we are repeating the early 1900’s. Pandemic, war in europe, big spooks in the stock market. Even with the spooks theres weird parallels to the 1907 crash with JP Morgan saving the day much like the fed saved the 2020 crash. Then no one could save the next one. I hope this isnt that all over again :/ its as though history loves to repeat itself", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Burry the bear?", "score": 1, "replies": []}]}, {"body": "If you can provide me a way to go back to march 2020 and invest more then i will buy you a share of berkshire A tomorrow. (When i get back from reliving the last 26 months of my life again)", "score": 1, "replies": []}]}, {"body": "If this was guaranteed why doesn't the entire top 40 banks just pull out their money and wait until August being all in on cash and commodities?\n\nIt's not guaranteed at all.\n\nWhat if the data in july is good?", "score": 5, "replies": [{"body": "There is no guarantee at all! We're at a time when we don't know which way the market's headed. Anyone with a brain could have seen to go cash in winter. But now? \n\nExciting isn't it?", "score": 4, "replies": [{"body": "Hard to say, whether being more risky or less risky is usually better. \n\nNot everyone could have predicted going to cash during winter last year, because QE was going to QT around May or June, so in other words, there could have been another bullish run up until May/June for all we know. So we can't predict anything it seems.", "score": 1, "replies": [{"body": "Yeah I can see that.", "score": 2, "replies": []}]}, {"body": ">Anyone with a brain could have seen to go cash in winter.\n\nHuh? I saw a dozen comments per week saying a big dip was coming or the bubble was about to pop. \n\nAnd that was followed by. Comments like:\n\n bears have predicted 34 of the last 4 bubbles. \n\nBears are always saying its about to go down.....\n\nBlah. Blah blah. \n\nLast november we were cruising along in fucking overdrive. \n\nSome people trusted their gut and went to cash or less risky positions. But not everyone with a brain.", "score": 1, "replies": []}]}, {"body": "What do you think they are doing? JPM told the public to expect a “7%” rally last week. Instead we got a nice lil 2.5% decline so either the banks are stupid and are off by 9.5% on their calls or they are telling people to buy so they have better levels to sell to you at. \n\nThey are selling people on buying in so they can get out at better prices than they would have at if they were honest with us. Who wants to hold another 20% decline in the broader market? I don’t, and wont be. Wait till the fed pivots to being dovish. Until you get it, you can’t have a rally that holds.", "score": 2, "replies": []}]}, {"body": "remindme! august 1st", "score": 1, "replies": []}, {"body": "ouch!", "score": 1, "replies": []}]}, {"body": "It MIGHT be a start DCA'ing if you are young, have recession-proof job or enough cash to live through recession, if it occurs. Market will crash another 10-20% from here and people lose their jobs if recession happens. IMO, no rush to invest now. Wait for future Q2-3 earnings and Fed pivots. It is better to miss 10% gain than lose 20%.", "score": 2, "replies": [{"body": "Or market goes up while you wait for the \"10-20%\" recession. Some people have been in cash since 2008, 2014, 2018...", "score": 2, "replies": [{"body": "It won't go up 20% without good news or signs, like fed pivots, end of war, inflation back to 2-3%. Fed is still hiking 50-75 points until end of 2022. Inflation is still very high. \n\nI am planning to start buying when S&P 3200-3400 and QQQ 230-250; however my entry price might change based on future earnings, inflation data, Fed pivot, ...", "score": 1, "replies": []}]}]}, {"body": "No one knows what the market is going to do. Spend less than you make, invest what you can afford to risk and have an emergency fund. Then, enjoy the fruits of your planning.", "score": 2, "replies": []}, {"body": "Agreed. Just keep investing and ignore all the bears out there who's been in cash since 2008, 2014, 2018, etc. waiting for the S&P 500 to drop below when they sold their positions.", "score": 2, "replies": []}, {"body": "too early.", "score": 5, "replies": [{"body": "For all we know, it's just early enough...\n\nHow can you time it?\n\nWhat if oil prices suddenly start dropping? What if inflation numbers start going down a lot? What if recession occurs but is short-lived and bounces back in a V-shape?", "score": 4, "replies": [{"body": "timing current case is easy.", "score": -3, "replies": [{"body": "How do you know?", "score": 1, "replies": [{"body": "fed raises rate, s&p goes down. \n\nsecond rule of investing:  don’t fight the fed!", "score": 2, "replies": [{"body": "The Fed says we'll have a soft landing.  They will be taken by surprise if its a hard landing, so they will loosen up policy.  They're living in a fantasy land.", "score": 0, "replies": [{"body": "The Fed just said it might not be soft at all.", "score": 6, "replies": []}]}]}]}]}]}, {"body": "How so? I figure now would be good for young investors with cash who can afford to invest. Unless you're looking at certain indicators as a bottom, I am, but won't be greedy on the bear side despite wanting these things to happen.", "score": 0, "replies": []}]}, {"body": "Invest now, it's a relatively good time.\n \nInvest when no one else wants to and you will get the rewards that no one else can. \n\nThe best time to plant a tree was yesterday\nThe best time to invest has already passed you by, the next best time is now.\n\nInvest now and In 25 years you can say \"I'd have wished I had invested if I hadn't 25 years ago\"\n\nJust invest for the long term and you will be fine", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Even more reason to invest as quick as possible", "score": 0, "replies": []}, {"body": "That's a very different story then. Most people on here are 20-35, so that's what most people assume. But advice that is generally decent for your average 25 year old may be mismatched for someone who's 65.\n\nBeyond your life expectancy/your expected time in good health, it also depends on your goals, where you are in life, etc.\n\nIf you are 58 now and you don't wanna wait until you're in your 70s to use most of the money you've built up, the play is a different one than it would be if you have a \"I don't need the money at all. I live a good life as it is. I'm mainly doing this for the next generation\" mentality.\n\nGenerally speaking, although that doesn't apply to anyone, one should get more conservative with their investments as they age and approach retirement or their set finish line. And that usually means putting more emphasis on investments in bonds, for example. Usually, by that point, you have reached a stage where wealth preservation and limiting downside is your focus rather than building wealth.", "score": 1, "replies": []}]}]}, {"body": "Gonna be honest. People with money love bear markets. People who don't have money dislike it.\n\nShorting becomes riskier the more markets come down while the upside potential becomes a better bet.\n\nAre you going to short the markets now? Could make you profits, or is now a better chance for upside?\n\nFor me I have cash flow so it's a really good time for me. I wake up pretty dam excited to buy dips and love red days. I could 100% understand the pain from someone without cash to invest with seeing there portfolio drop, that's a lot of the people here. Honestly, pretty dam happy and so are most people with cash. That's why I don't ever come here to complain and just give my opinion on things, because I made money either way the market moved.\n\nTldr:people with cash to invest are happy. People with no cash are not. And most people live paycheck to paycheck and now stimcheck to stim check, jk\n\nNot a financial adviser, do your own dudiligence.", "score": 1, "replies": [{"body": ">I made money either way the market moved.\n\nSo you have short positions?", "score": 1, "replies": [{"body": "I did, I'm very active on r/Nio. I'm a China bull and was very bearish on U.S. companies since 2019. I got a lot of hate from friends, hit this sentiment from family, and was made to feel insane. I always thought Chinese and foreign stocks would rise, while the U.S. would decline. I was half right. But when Chinese stocked crashed in Q1 2021, I figured the U.S. would be next because China leads in a lot of things due to the power the country has, and it has shown that to me since Q1 2020, but I saw glimpses in 2016-2020.\n\nWhat I got wrong was thinking if U.S. came down, China would go up. Unless I'm right and the U.S. comes down and stagnates for a little, while Chinese recovers faster and wallstreet prices in the next 2-7 quarters of Chinese companies taking away from U.S. competitors and stronger economic prospects. \n\nI did make money being bearish on hospitality in 2020. And I did make money being bearish in 2022 on U.S. companies. But I still am a China bull and have decided to build long position in companies in China and others like Africa. I'm being much less risky now because I don't personally want to be greedy on the bear side now. It's sort of like a pendulum. I am buying U.S. as well but personally think diversification globally is a better bet now. If I could have bought Russian stocks, I most definitely would now but can't. I was considering Russian stocks for a awhile, especially pre war, good thing I didn't. \n\nI consider about 30 things before making big decisions outside of an individual company. I think that people here box themselves into rhetoric rather than do research. \n\nNot a financial adviser do your own dudiligence. Don't expect anyone to agree and a lot of people will probably bash me on my views.", "score": 1, "replies": [{"body": "I'd be more bullish on South America than Africa or maybe even Russia", "score": 2, "replies": [{"body": "Why? And in what ways? What sectors etx", "score": 1, "replies": [{"body": "VALE + Itau Bank + Bradesco bank. \nSociedad Quimica de Chile .Televisa .\n\nIndia is another powerhouse", "score": 2, "replies": [{"body": "These all seem like really great additions and I see why logistics and commodities are a good investment over the long run. I still am more bullish on Chinese companies in some sectors like tech/innovation/energy/manufacturing. I've considerd going more heavily into emerging/foreign and not as heavy in U.S. But I feel obligated to invest into U.S. not because I like these prices, it's more so the access of capital when the markets gain more liquidty/increase in money supply", "score": 1, "replies": [{"body": "In that case here's my advice .\n\nNumbers matter.\n\nP/ (sales/outstanding shares) = Value index . Closer to zero better Just 3 variables.\n\nThe value stocks in list below also have low debt +low  PE/PEG/ P/FCF .  All info available on Finviz.com. \n\nStocks are in no particular order\nhttps://imgur.com/a/xH3sYOL\n\nDIS + UPST + NVDA + TSLA are the 4 worst stocks in terms of value .", "score": 1, "replies": [{"body": "Thank you very much.", "score": 1, "replies": []}]}]}]}, {"body": "I'm not invested but know that Chile has a traditional solid mining company, Brazil has Nubank, Uruguay has DLOC . RAPPI is a Colombian service expanding throughout SA . And probably few more companies. \n\nCanada has a bunch of attractive stocks. \n\nThe economies in SA are I think more vibrant than Russia. Not sure about Africa but JMIA hasn't done well.", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">Just stop using that shitty app like robinhood, use like schwab, fidelity, etrade, chase, or something else.\n\nWhy is this a factor?\n\nIf a young person wants to invest - you can give them advice on what to buy or how long to hold. But honestly its none of your business what app they use. I cant imagine why you even put that line in there. Their money is safe in robinhood. And the app is better than all the other ones i have used. I have 80% of my money on other brokers. But my fun taxable account is on robinhood and i dont plan to change that because of your snarky comments. \n\nIt makes no sense to me why you feel so harshly about it.", "score": 0, "replies": [{"body": "Robinhood manipulated things and is in trouble with the courts.", "score": 0, "replies": []}]}, {"body": "Don’t invest now, look for some stability in market first.  It is not like you are going to miss a huge upside.  If you must invest then pick some individual companies but I would not do any index investing now.", "score": 0, "replies": []}, {"body": "I say start DCA’ing into whatever it is you are looking at. It’s my feeling that July earnings/recession and inflation are currently being baked in and before you know it you’ll be looking back like “damn that was the bottom”. The market is always ahead of the current news. You’ll miss good opportunity sitting around.", "score": 1, "replies": []}, {"body": "No.\n\nGood advise is to tell young people to understand the econony and how a strong economy benefits businesses and that is reflected in the stock market.\n\nNot \"buy now because low, not sure if much lower but who cares buy now\".\n\nWhere is the bottom?\n\nThe bottom is when wall street determines that the economic downturn will soon end and they open their positions before retail etc figure out that the economy is recovering.", "score": 1, "replies": []}]}
{"title": "BofA analyst sees Tesla market share of EVs falling from 70% to 11% by 2025", "selftext": "", "id": "vpk265", "created_utc": 1656738244.0, "score": 33, "upvote_ratio": 0.77, "num_comments": 54, "comments": [{"body": "Market share doesn’t really interest me. Tesla will dominate profit share for a long while.", "score": 37, "replies": [{"body": "We’ll stated, friend.", "score": 8, "replies": []}, {"body": "Something analyst won't talk about.  Invalid metrics are the only ones they care about", "score": 6, "replies": []}]}, {"body": "Even if it does fall to 11 percent (unlikely), it will be 11 percent of a much larger number, and therefore a growth story intact. Also, the TSLA story is reaching beyond cars. It's about software and AI.", "score": 66, "replies": [{"body": "The US car market peaked around 17 million. Tesla is likely to be producing close to 2m in the US alone by then, but let's be silly and say only a million. If a million is 11% of the EV market, the other guys will be selling over 8 million.\n\nThat's not going to happen in 2 years.\n\nThe problem with these boneheads is they're not putting their money where their mouth is. They're putting YOUR money where their mouth is.", "score": 87, "replies": [{"body": "The math on this is so crazy.  It just shows how out of touch every non-tesla investor is with the challenge of manufacturing ramps.  We all know it because we’ve spent every 3 months in the last 4 years agonizing over production and delivery spreadsheets and watching factories grow from empty lots.\n\nLet’s do an example.  In its first 2.5 years shanghai went from an approved project to a capacity of ~300k cars per year.  It is soon to be the largest single auto factory in the world and was ramped the fastest in history, so this is a *best case* comparison.\n\nUsing that as a baseline, if we assume that Tesla can produce something like 1.6M cars in the US in 2025, this would mean that other car companies would need to be investing right now in 50 giga shanghai scale projects.  When right now there is not one single US company contemplating building even one.  The most ambitious manufacturing scale project we’ve seen is VW’s, which is aiming for something like 4M EVs globally per year by *2030*.  And that’s their optimistic sales pitch estimate.\n\nThe math on this analyst statement is so staggeringly stupid that it makes you believe that TSLA has significant room to grow if the average investor thinks other companies can ramp production so quickly.  2025 is going to hit and people car going to wonder where all the cars are.", "score": 50, "replies": [{"body": "THIS!!\n\nI even stop antagonizing people over this absurdities. It reminds me of 2007, see Apple iPhone, go buy Apple stocks. For the next 5 years I did argued with people over iPhones being the real deal, with people arguing that they can do more with Android, Samsung, Huawei...  Apple was too expensive... who wants an app on a small screen... why do we even need a new phone when we have blackberry....\n\nApple controls 80% of the global PROFITS of the iPhone market. I am going to retire on Apple and Tesla stocks alone, which I bought despite the contrary advice of 401k managers, wife and all the rest of the extended family, and I could have been a really reach person - but I really do not care, because at my age, having a good conversation with my beloved wife and having her to admit that SOMETIME I am right, it is really priceless.", "score": 26, "replies": [{"body": "I feel the same as you. As I grew up in an Apple household, when my father brought home the first Mac in 1985, I always saw how Apple was ahead in innovation over their competitors. Not just ahead in innovation, but ahead in the user experience and ahead in creating a solid, upscale product thanks to not cutting corners. For a full 20 years, I neglected to invest in Apple stock until finally in 2008 when I rolled over a 401k into all AAPL. After more than 10x-ing my money, I started to notice Apple no longer innovating as much and at the same time I started noticing Tesla do what Apple used to do. Again, I listened to family and brokers all warning me to stay away but this time I knew to ignore them and go with what to me was obvious.  There were times I hesitated and moved my money to cash, and those were huge mistakes in hindsight, as I would have twice as much worth if I stayed in the market at all times. But I’ve never added a penny into that rolled over 401k since 2008, and $45,000 is now 820 shares of TSLA. Most people, except my peers in this sub, all think I am insane to not be diversified, but I will have time to diversify later. Right now, I can’t see investing in any other company than Tesla because right now no other company has grand plans like Tesla that actually make sense.", "score": 9, "replies": []}, {"body": "Upvote for wife admitting she is wrong. I'm hoping to experience that someday.", "score": 6, "replies": []}]}, {"body": "Using this analogy, what year is TSLA currently in on AAPL’s timeline? I’m thinking 2008 (11.6M units sold, to 20x by 2015). I know its not Apples to Apples (pun intended), but comparable to TSLA’s 20M units by 2030 in terms of expected growth rate. AAPL stock grew 46x since 2008.", "score": 1, "replies": []}, {"body": "> if we assume that Tesla can produce something like 1.6M cars in the US in 2025, this would mean that other car companies would need to be investing right now in 50 giga shanghai scale projects.\n\nI'm a bit confused on your math here.  Why would other OEMs need 50 factors to produce 10x what Tesla produces with 2 factories?  Wouldn't they need 20 factories (minus the production that they already have)?", "score": 1, "replies": []}, {"body": "> this would mean that other car companies would need to be investing right now in 50 giga shanghai scale projects\n\nThey don't necessarily need that. The established companies already have factories, they just need to retool. There's a factory nearby that's planning an eight month shutdown to reconfigure the lines to produce EVs instead of ICEs. I'm sure this is happening everywhere, but I only know about this because one of my friends is going to be out of work for those 8 months.\n\nIt's not going to be a fast transition, and I do think that the BofA analyst is pulling numbers out of their ass, but the transition can (and will) happen by transitioning existing manufacturing lines - not by building new production facilities.", "score": 1, "replies": [{"body": "Similar to Fremont. Fremont was one of the largest plants in North America. I am curious what the production will be from other factories non Tesla.", "score": 1, "replies": []}]}]}, {"body": "And there are almost never any consequences. When it turns out to be wrong in 2025, they'll just go \"oops 🤷‍♂️🙊\" and predict some other absurd shit.", "score": 17, "replies": [{"body": "11% by 2035...maybe? Unlikely IMO but it depends.\n\n11% by 2025? That's foolish.\n\nI threw !RemindMe in 3 years all over that thread (and will do so for all anti-Tesla threads) just to rain in a bunch of \"i told you so\" later on and embrace the salty downvotes to come.", "score": 15, "replies": [{"body": "I will be messaging you in 3 years on [**2025-07-02 08:42:23 UTC**](http://www.wolframalpha.com/input/?i=2025-07-02%2008:42:23%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/teslainvestorsclub/comments/vpk265/bofa_analyst_sees_tesla_market_share_of_evs/iek1smm/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2Fvpk265%2Fbofa_analyst_sees_tesla_market_share_of_evs%2Fiek1smm%2F%5D%0A%0ARemindMe%21%202025-07-02%2008%3A42%3A23%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vpk265)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 5, "replies": []}]}]}, {"body": "Imagine Toyota and Honda make 5mil EV for the US by 2025.\n \nI can't.", "score": 6, "replies": [{"body": "My imagination is vivid. Not that vivid though.", "score": 1, "replies": []}]}, {"body": "> That's not going to happen in 2 years.\n\nI agree with you, but 2025 is not in 2 years.  That would be 3.5 years from now (when sales for 2025 are done).", "score": 1, "replies": []}]}, {"body": "I wouldn't make a \"smaller slice of a larger pie\" argument on this goofy analysis. There is no indication that Ford and GM can ramp fast enough to catch Tesla on EV sales in 3 years.\n\nIt would be one thing to claim that Tesla will have an 11% share globally in 2030. My own model actually has them pretty close to that. But 11% in America? No. And by 2025? The analyst is smoking crack on the job and should be fired....unless having an accurate prediction is not part of the performance assessment.", "score": 24, "replies": [{"body": "The analyst assumes every EV model will sell like Tesla's Model Y. That's beyond foolishness. There has to be bad intention in his report. Maybe to mislead people.", "score": 6, "replies": []}, {"body": "They wont' be able to do it in 5 years.  How can they when they are still making, marketing, and selling ICE cars?  Neither of them will be able to take a few quarters of losses while retooling and reinvesting.", "score": 1, "replies": []}, {"body": "Tesla's is gonna make the pie and eats 100% of it.\nCreate robot taxi and everyone can have the crumbs.", "score": 1, "replies": []}]}, {"body": "..and insurance, and virtual power plants, and solar, and ...", "score": 1, "replies": []}, {"body": "Exactly, what percentage of vehicles overall are electric nowadays? Even if Tessa was to control 80% of the electric vehicle market today, overall the percentage of drivers is like 2%. Let’s see what happens if the electric market is 80% or 90% electric and tesla, in that market, is 10%. Right now gas vehicles clearly dominate and Toyota has like a 10% hold of the market. So having a 11% cap (what Bank of America suggests) on something that might be 95% of the market in 5 or more years is nothing to be ashamed of.\n\nBut this is clearly another example of a headline article designed to damage Tesla. It’s meant to be taken out of context.", "score": 1, "replies": []}]}, {"body": "1. John Murphy, aka, same guy who had Rivian at a $140 price target just a few months ago. Also had GM at $100 as well.\n2. 11% U.S. market share? Tesla just sold 300k vehicles in the U.S. for 2021. Estimates are the U.S. will sell around 3.2-3.5 million EV's in 2025. Tesla just sold 110k EV's in the U.S. for Q1 2022 and that is without their Austin factory. So by 2025, John Murphy expects Tesla to sell even fewer vehicles than they will this year? The math simply does not add up.\n3. He projects GM and Ford will surpass Tesla in market share. How? I'd like to see how he arrives to that calculation. Essentially, there is no data in his analysis. It's purely conjecture.\n4. \"Other car companies have a massive amount of car models.\" The issue with this is new models generally only help when you are in a mature industry that needs differentiation. The limiting factor for EV's right now isn't new models. Almost every EV manufactured is sold out regardless of who the manufacturer is. That should tell you that the bottleneck is the amount of batteries. New EV car models works against these ICE manufacturers. The reason Tesla is entirely focused on the MY and M3 is because they are the ideal vehicle for every geographical location whether you live in China, America, or an European country. Ford isn't selling F-150's in Europe. ICE manufacturers are already going to bleed money selling EV's and cannibalizing their profits to gain EV market share. Less efficient manufacturing because you have more specialized manufacturing for each new model will decrease any margins they may have. This narrative that people want more models is just absurd. People will want the higher performance car that offers ancillary benefits such as FSD, ease of charging, etc., Ask yourself: Why doesn't Apple have dozens of phone models out every release. It's just a handful amount every release. Because Apple's selling point is: We have a great product, great service, and our shit works. Look at how many different phones Samsung sells. Who do ya'll think is more profitable selling phones? In the future, as competition increases and Tesla needs to differentiate their models for a particular demographic, it will be done. But right now, if the bottleneck is batteries, what sense is there to create new models, complicate the manufacturing process, become less efficient, lower margins? \n5. John Murphy claims Tesla fell asleep with their advantage. Oh, really? Berlin and the Austin factory were completed relatively quickly by manufacturing standards. Tesla was the first automaker to receive approval to start a factory in China without a joint venture partner. Tesla recently applied to expand their Austin factory by 500,000 sq ft. Tesla is the most vertically integrated auto company and produces their own seats and windshield as well as the first to realize that they should also manufacture their own batteries. There are plans to possibly expand into the mining business and also for a new Gigafactory location. How exactly are they falling asleep but GM, the company that put a SIX MONTH HIATUS on their only EV is supposedly not falling asleep? Hmmm, interesting analysis.\n6. The European market share by the OP of that thread ignores the fact that Tesla had zero production capabilities in Europe up until Berlin became operational. German auto manufacturers, such as VW, is strategically placed in Europe. The mere fact Tesla even has a relevant market share to speak of is pretty spectacular if you ask me.", "score": 21, "replies": [{"body": "> The limiting factor for EV's right now isn't new models. Almost every EV manufactured is sold out regardless of who the manufacturer is. That should tell you that the bottleneck is the amount of batteries.\n\nThis is what I constantly have trouble understanding.  Or this miss is what I'm confused by.  If every EV being manufactured today is basically on wait list, or is rapidly sold, spending only a few weeks in inventory, then every part of the demand equation is a distraction right?  More models, preferred brands, higher trim... all of that is smoke and mirrors for the discussion right now.  It all just comes down to the supply side; how many EVs can a company manufacture?  Unless they are outright lemons and need to be recalled (GM), they are going to sell.\n\nI've heard people talk about how the Ford F150 is the most common, best selling passenger vehicle in the US.  Apparently in the US, there are more F150's on the road than any other vehicle.  Therefore, they claim, the F150 Lightning will be the best selling EV on the market.  But Ford's original plan was to manufacture 80k a year.  I think they are planning to double that now, but it is unclear if they'll be able to source the materials.  In a market where millions of vehicles are sold a year, how are you going to claim that an 80k-160k annual manufacturing rate is going to claim market share?  If every one of them is picked up at the plant by a customer while the paint is still wet, Ford has still only sold 160k vehicles, and greater demand can't change that.\n\nAs far as I know Tesla's got the highest production, the is continuing to ramp as much more more than competition, is ahead on the tech, and has secured the most raw material contracts.\n\n&#x200B;\n\n>The European market share by the OP of that thread ignores the fact that Tesla had zero production capabilities in Europe up until Berlin became operational.\n\nYeah, I saw that too.  Basically every Tesla on the roads of Europe today had to be shipped in from either the US or China, who both have markets where Teslas are still in huge demand.  Other than an attempt to be more visible across markets, Tesla doesn't really have any incentives to add shipping costs to the sale of a vehicle.  All other things equal, its easier and cheaper to sell to a buyer near the factory than far away from the factory.  I'm surprised Tesla has much of a market share in Europe at all at this point, but the Berlin factory is sure to drastically change that.", "score": 5, "replies": []}]}, {"body": "&#x200B;\n\n![gif](giphy|3ov9jOZesJQenx1NeM|downsized)", "score": 15, "replies": []}, {"body": "And all those batteries just magically appeared for the other EV makers.\n\nArticle claims Musk \"didn't move fast enough\" - who moved faster? \n\nUntil there's a legitimate competitor to Tesla's charging network, we won't see much competition in the US.  Europe will likely be a different story as I'm guessing they will have other EVs seamlessly charging like Teslas due to shared standards.", "score": 12, "replies": [{"body": "8-10 million cars times 75KWh….", "score": 5, "replies": []}]}, {"body": "Market share of EV is not interesting. No-one expects that to stay even over 30% in the long run.\n\nNow projected market share of all cars is more interesting. I am expect that to continue to rise for quite a bit.", "score": 9, "replies": []}, {"body": "What do you want to bet that in 3 years when this analyst's predictions have been ground to dust, he'll still have his job, and will be making even more money than he does today.", "score": 17, "replies": [{"body": "I would bet you all the old paint cans in my garage.", "score": 5, "replies": []}]}, {"body": "His TSLA price target is still 1300?  \nhttps://www.tipranks.com/experts/analysts/john-murphy", "score": 5, "replies": [{"body": "Post spilt? Yeah, that'd be nice.", "score": 1, "replies": []}]}, {"body": "I find it rather pointless to claim that Tesla would drop in share of the cars when there was no mention of replacements. At least name them, put your reputation on the line and give us the company that you actually think would succeed.", "score": 4, "replies": []}, {"body": "Analyst that can't add.\n\nNo one has enough production volume planned to reduce Tesla's market share that much.", "score": 5, "replies": []}, {"body": "> but other manufacturers are releasing 135 EV models over the coming years, so something is going to stick. \n\nYou think the issue is stickyness?\n\nOther manufacturers just haven't found the right combination of features/components, and it's just a matter of recombining them in 135 different combinations to the find the magical combination that the market will drool over?\n\nThat's adorbs.\n\n> We've already seen demand exceeding supply for the F150 and Mach E.\n\nExactly - they can't scale.  Demand continues to exceed supply for Tesla too, except Tesla is in the middle of executing a plan to massively mass produce and the other manufactures are far behind.  \n\nWhen Ford succeeds in scaling (and handling all their EV recalls) they are onto their next problem -- their margins are lousy, and their dealers are gouging their customers.  I think they are still asking their dealers to choose whether they are ICE or EV, as a way to get them to opt out of EV sales so they can sell direct, but that's probably still a decade+ of lawsuits for them.\n\n\n> Musk's apparent idea that the supposedly unsophisticated auto industry didn't know how to manufacture came back to bite him when he learned firsthand how hard it is to make cars, learned that those legacy techniques work, and was forced to adopt them. \"That was a big miss on his part,\" Murphy says.\n\nThis is years out of date.  The \"alien dreadnaught automated factory\" concept was abandoned years ago.  Tesla trying new things and throwing out what doesn't work (yet) is the silicon valley way.  Now with gigacastings they are doing things most others are not doing, and producing each individual car much faster.  Eventually the TeslaBot will be able to help... not seeing other auto-manufacturers working on anything similar.\n\n>  But I don't think it's going to be 90% of the market as some Tesla bulls predict.\n\nI haven't seen 90%.  It will probably be closer to 20-25% in 5 years, but all of the profits.  Other manufacturers will make a painful transition to EV, but they'll need your tax dollars for another bailout (hello 2008) to do it.", "score": 3, "replies": [{"body": "All the numbers in your comment added up to 420. Congrats!\n\n      135\n    + 135\n    + 150\n    = 420\n\n^([Click here](https://www.reddit.com/message/compose?to=LuckyNumber-Bot&subject=Stalk%20Me%20Pls&message=%2Fstalkme) to have me scan all your future comments.) \\\n^(Summon me on specific comments with u/LuckyNumber-Bot.)", "score": 6, "replies": []}, {"body": "Yup, nailed it", "score": 1, "replies": []}]}, {"body": "No one will even remember this crap by 2025.  Elon pissed off a bunch of journalists by suggesting a website that kept track of their honesty and accuracy.  It would be nice to have a website like that for these so-called “analysts.”\n\n“Remember that dipshit?  He’s been wrong in every analysis he’s made up until now, and his latest prediction is being covered by these media outlets, which makes you wonder about them too, doesn’t it?”", "score": 3, "replies": []}, {"body": "Tesla's goal is to produce 20M EVs per year so they can replace at least 1% of gasoline/diesel vehicles on the road.\n\nI guess after being dumb for a decade, John Murphy still has no idea what Tesla is trying to do.\n\nIn a few years, the analyst will be proven to be wrong, at that time he will release more stupid predictions and many people will take the bait. It's crazy how this world operates.", "score": 2, "replies": []}, {"body": "Lol 🤣 where's the batteries coming from??", "score": 2, "replies": []}, {"body": "\"The problem with Apple is they only sell a few variants of smartphone. This leaves them open for disruption by companies like Nokia and Blackberry who make far more variants.\"", "score": 2, "replies": []}, {"body": "It's a race to see *who can lose the least money* and bankrupt their cohorts.\n\nLICE auto is dead. RIP. F.", "score": 1, "replies": []}, {"body": "Tesla’s target is 20% of the entire world car market by 2030. BOA is definitely far off. If this was true, given the profit margins of everyone except Tesla being near zero or negative, everyone but Tesla will go bankrupt in 2026.", "score": 1, "replies": []}, {"body": "FUD from analyst", "score": 1, "replies": []}, {"body": "I see BofA market share of media will drop to zero", "score": 1, "replies": []}, {"body": "A bound coffee table book of analyst reports like this from the past 10 years would be a fantastic holiday gift item.", "score": 1, "replies": []}, {"body": "What an idiot. Probably still recommending oil companies and GM who is ramping Bummer production to 12 per day!", "score": 1, "replies": []}, {"body": "What weeds he’s smoke", "score": 1, "replies": []}, {"body": "Boa has been a joke on Tesla. This shows. They will continue to hurt their clients. What a disaster!", "score": 1, "replies": []}]}
