{"title": "Thinking that Elon orchestrated the whole Twitter fiasco just to have an excuse to sell his TSLA shares is ridiculous.", "selftext": "I see a lot of people on different financials forums(mainly wsb, of course) that think that Elon used Twitter as a bait to sell his TSLA shares. This does not make any sense for the following reasons:\n\n1. Elon started acquiring Twitter stock, before he  sold large chunk of TSLA shares, which was done for tax purposes according to him.\n\n 2. Elon acquired the largest portion of the capital needed for the acquisition of Twitter by getting loans against his shares and attracting numerous high-profile outside investors like Larry Ellison and the Qatar state investment fund. He did not need to actually sell his shares to raise money.\n\n3. Buying a company like Twitter requires extensive research and the use of a lot of resources (mainly financial). This was probably planned at least a year in advance, so the great oracle Elon probably did not have the chance to perfectly time his TSLA selling to maximise his profits. \n\n4. Do you actually think that a guy who tweeted that the  TSLA share price is too high cares so much about his shareholders opinion, so he will orchestrate a very expensive and time consuming operation that could potentially greatly harm his public and business persona, just so he will have an excuse to sell his TSLA shares? Musk has stated numerous times that the sole purpose for his accumulation of wealth is to secure the funding for the dream of his life, which is making humans interplanetary species. Couldn't he just have said that he is going to sell a small portion of his TSLA holdings for that reason? \n\n5. No, TSLA stock probably would not have crashed even if he did not state any reason for the reduction of his stake in the company. It is not like he sold 50 percent. Also, have you seen how devoted are the teslabros? \n\n6. No, you won't be able to sue Elon, cuz your calls expired worthless. One of the main reasons why founders and investors make their company's public is because financials markets provide them with great liquidity. \n\nI obviously can't say for certain why Elon decided to back out of the deal. My personal opinion is that he probably just changed his mind  in part due to miner setbacks like the number of bots on the site. As we all know , he is not very stable as a person and it is probably not as deep as many people think it is.", "id": "vv28yu", "created_utc": 1657374993.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 55, "comments": [{"body": "Tldr. But dude, I think the guy that sold a bunch of shares in his own company at the tippy top and blamed BERNIE SANDERS totally cares about the share price. Dudes a monster troll.\n\nDo you seriously think he planned for a year to buy Twitter and somehow had no idea they had bots before the big dog and pony show? And he made a huge offer with no research? He's a clown.", "score": 35, "replies": [{"body": "Did you read my post? First of all, the stock market is not magic. He couldn't have known for sure that he would be selling at the top, especially when owning a company that trades at ridiculous multiples. Second of all, he has the full right to sell his TSLA shares whenever he wants. He does not need to give anyone an explanation, although he stated that it is for tax purposes. What has buying Twitter has to do with it?", "score": -13, "replies": [{"body": "reading your rambling and emotional post does nothing for the argument that you are trying to make.\n\n\nElon sold at the top and the only way he was able to was with this twitter offer. He could pay a billion dollar fine and still make out like a bandit", "score": 9, "replies": [{"body": "\"Elon sold at the top and the only way he was able to was with this twitter offer.\" As a shareholder he has the right to sell his stock whenever he wants. Insiders are selling shares all the time. He also never said that he is selling TSLA to buy Twitter in an attempt to not\" spook\" his investors. He stated that he is selling TSLA stock for tax purposes and there were minimal complaints.\n\nPS: I do not have any position in TSLA.", "score": -5, "replies": [{"body": "> As a shareholder he has the right to sell his stock whenever he wants. Insiders are selling shares all the time\n\nAs the CEO, he actually doesn't.", "score": 5, "replies": [{"body": "He actually does, as long as he submits a trading plan with the SEC and he does not know of any insider information that could be 100 percent proven to be extremely detrimental to the company. However, as we all know the SEC are not very effective at doing their job and even knowing that the company could go bankrupt pretty soon, might not stop him from selling.", "score": 1, "replies": []}]}, {"body": "oh sweet child, do you not understand the concept of lying for personal gain?\n\n\n\nand no, a CEO and other insiders absolutely do not have the same rights to sell stock as regular shareholders", "score": 2, "replies": [{"body": "Oh, you really do not get it, do you? Elon Musk did not need to offer to buy Twitter in order to sell his TSLA stock. He made a trading plan that was approved by the SEC, he sold his stock and then tweeted that he is doing it for tax purposes, maybe to appease to his shareholders. This has nothing to do with Twitter.\n\nPS: Just to make it more clearer... When it was disclosed that he sold a portion of his TSLA shares, the stock price dipped a bit, but then recovered. Everything he did was completely legal and no one knew at the time that he will offer to buy Twitter.", "score": 1, "replies": [{"body": "Wow! Case closed, I didn't know you were an expert on the matter. Thank you so much for making it 'more clearer' for me, I take back everything I said and will now refer back to your genius if the topic gets brought up again", "score": 1, "replies": []}]}]}]}]}, {"body": "He didn’t read your post.  he said it was TLDR", "score": 4, "replies": []}, {"body": "Of course he could predict a drop because of what he just told you. A hyped stock for a business is doing well that suddenly starts doing not so well, and he knows if first hand, before it comes out to the news cycle, not the complex plot everyone thinks, but very rational", "score": 1, "replies": []}]}, {"body": "The top was 1200...he sold around 900-1000. The stock is now near 800. Lol", "score": -3, "replies": [{"body": "The Bernie sanders stuff was in nov/Dec. He sold at the top (the tippy top) and trolled Bernie sanders on Twitter about taxes. I dont think he knew it was the tippy top, but for sure he knows it's over valued.", "score": 3, "replies": [{"body": "He sells stock all of the time. He sells as much as he is legally allowed to.", "score": 3, "replies": []}]}, {"body": "When he sold for tax reason and pretended it was because of Bernier Sanders the stock was trading at 1200$. Elon made more from the shares he sold than overall net profit of the company since its became profitable.", "score": 1, "replies": [{"body": "Sanders literally said he wanted huge tax increases for this tax year. A lot of people sold things the end of last year rather than waiting because Sanders and several other tax and spend people all said that was their intent. It still might happen.", "score": 1, "replies": [{"body": "Sanders is literally one independant senator. He doesn't have any power in taxing peoples. They sold because their analysts told them it was the top.", "score": 1, "replies": [{"body": "You lie. He not be being independent. Keep me a member of our party. He be a democrat. He be being one of us. He was one of us. Stop lying. He is proud to say he was a Democrat. When he wanted our money when he ran in the primary, he admitted he was one of us because he wanted to take our money. He took our money probably. He is a proud member of our party. Stop lying. He is not a Republican despite the lies of your kind. He is one of us. He is a Democrat through and through. He is not a Republican invite your kind claims. No no no. Reading wise like your kind makes me wanna fuck", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "No he be being us!  So us.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "He was granted those options that were expiring in 2012. You “Elon has a time machine” people are crazy. He had no way of knowing what the stock price would be a decade later. Stop making up stuff. \n\nAlso, Biden promised massive tax increases for this year. That might still happen so it was smart for him to sell before this year. A friend sold his house earlier than he wanted to for the same reason. You apparently don’t follow the news.", "score": 1, "replies": []}]}, {"body": "The bots are a smoke screen.  He finally realized his offer was way too high and is using that as one of the excuses for not complying w the deal he signed.", "score": 18, "replies": [{"body": "Why would he makes the way over market value offer in the first place? He had some angle and legitimately acquiring Twitter was not it", "score": 3, "replies": [{"body": "I legitimately think that he changed his mind. Maybe after getting more info about Twitter, he came to the realisation that he is paying way too much. There were numerous times when I have bought something that I thought really wanted, just to immediatly regret it. It might be quite similar, although the scale is way different. \n\nTSLA's stock and business is not doing too well in the past couple of months too, which might be an additional stimul to back out of the deal.", "score": 3, "replies": [{"body": "If he offered current share price with his initial bid I could maybe see that. But I just can’t see him offering well over market value only to then realize after the fact he was overpaying. It makes no sense it would be like me walking into a jewelry store and offering to pay 3x the price of something only to afterwards get it appraised and try to offer less. It just screams of a bad faith offer", "score": 3, "replies": [{"body": "Well, Elon is definitely an unstable guy. I can't see any deeper reason for him to create a PR nightmare and take the risk of potentially losing billions of dollars.", "score": 6, "replies": [{"body": "I totally agree with him being unstable but I can’t see him genuinely thinking Twitter was worth his initial bid", "score": 4, "replies": [{"body": "Especially if he wanted to take it private.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "But if you come in we’ll above market value and then jump through every hoop possible to avoid closing the deal, that seems like a bad faith offer. Waiving your DD and then trying to use DD to back out of the offer is shady", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">Elon started acquiring Twitter stock, before he sold large chunk of TSLA shares, which was done for tax purposes according to him.\n\nThis is wrong. He sold the Tesla shares in November 2021 and the 13G indicated that he surpassed the threshold of 5% ownership from Twitter on 14.March 2022\n\n&#x200B;\n\n>Elon acquired the largest portion of the capital needed for the acquisition of Twitter by getting loans against his shares and attracting numerous high-profile outside investors like Larry Ellison and the Qatar state investment fund. He did not need to actually sell his shares to raise money.\n\nBut he did. \n\n&#x200B;\n\n>Buying a company like Twitter requires extensive research and the use of a lot of resources (mainly financial). This was probably planned at least a year in advance, so the great oracle Elon probably did not have the chance to perfectly time his TSLA selling to maximise his profits.\n\nLooking at his actions, he did not do any proper research on Twitter. It is clear that from his action and the \"tax-excuse\" (which he could have paid selling less shares than he did, or borrowing against his shares) -  that he is trying to sell Tesla stock. He does not want to crash the stock price tho. \n\n&#x200B;\n\n>Do you actually think that a guy who tweeted that the TSLA share price is too high cares so much about his shareholders opinion, so he will orchestrate a very expensive and time consuming operation that could potentially greatly harm his public and business persona, just so he will have an excuse to sell his TSLA shares? Musk has stated numerous times that the sole purpose for his accumulation of wealth is to secure the funding for the dream of his life, which is making humans interplanetary species. Couldn't he just have said that he is going to sell a small portion of his TSLA holdings for that reason?\n\nThere is only one thing that he visible cares about, and that is his fortune. Everything from the stock options to how he lives shows that. Nah if he would sold for \"interplanetary\" reasons, I doubt many would believe him. \n\n&#x200B;\n\n>No, TSLA stock probably would not have crashed even if he did not state any reason for the reduction of his stake in the company. It is not like he sold 50 percent. Also, have you seen how devoted are the teslabros?\n\nIt is exactly why it would have crashed the stock if he did not give any reasons. They are very devoted, so they would question his leadership if he sold and probably would do the same. \n\n  \n\n\n>I obviously can't say for certain why Elon decided to back out of the deal. My personal opinion is that he probably just changed his mind in part due to miner setbacks like the number of bots on the site. As we all know , he is not very stable as a person and it is probably not as deep as many people think it is.\n\nThe bots are just an excuse. What many forget is also that the company talks about monetised accounts are 5% bots. Meaning that Elon would have to prove, that more than 10% of Twitter's revenue would come from bots. If that would be true, there would be another bunch of lawsuits against the board and Jack Dorsey. \n\nYes it is not as deep as many think. He knows Tesla is overvalued, so he tries to sell as many shares as possible, without imploding the stock -  as he has many loans collatarized against them.", "score": 5, "replies": [{"body": "I stand corrected about the first paragraph. However, if he wanted to use Twitter as a bait to sell his TSLA shares and appease his investors at the same time, why would he never publicly declare it? Also, why would the TSLA shareholders be happy about the fact that he is selling stock in the \"most important company in the world\" to buy Twitter. This like a child being mad at his dad for selling his PS4, but then being happy again, when he eventually discovers that his dad used the funds to buy new tires for his car.", "score": 1, "replies": []}]}, {"body": "what if he did, what if he didnt. And why is it ridiculous, it makes more sense than his own actions", "score": 2, "replies": [{"body": "It is ridiculous, because he can sell TSLA whenever he wants. Also, if he did this whole Twitter thing just to not spook the investors, why would he say that he sold his stock for tax purposes. Do you think that most TSLA investors were like \" Oh, he is selling stock - bad, wait a minute, it is because he wants to buy another company in which I am not an investor, then - good\"", "score": 0, "replies": []}]}, {"body": "I think you don’t know his motivations, but I believe he knew what he was doing, his every move is made through a calculated persona.", "score": 2, "replies": [{"body": "Of course. I mean if you were him and did not make calculated business moves you would be an isiot", "score": 1, "replies": []}]}, {"body": "The muskrat apologists still can't come to grips with the fact that their idol is a snake oil salesman who is about leave them bag holding, yet again.", "score": 2, "replies": []}, {"body": "Musk has stated numerous times that the sole purpose for his accumulation of wealth is to secure the funding for the dream of his life, which is making humans interplanetary species.\n\nI assume buying Twitter is somehow going to get humans to Mars, no later than 2024 this time.", "score": 2, "replies": [{"body": "I am not saying that what he is saying is true. However, he said the he does not care even a single bit about material possessions and his only goal is to ensure the long-term survival of the human races by making colonisation of other planets possible.", "score": -1, "replies": []}, {"body": "I think his dream is to make robots to enslave humanity, then send men to mars while procreation with the women on earth.", "score": 1, "replies": []}]}, {"body": "Elon orchestrated that to show to the people how fake Twitter is and the same tactic could be used also here", "score": 1, "replies": []}, {"body": "Lol, totally what happened, I'd guess. Sell out of inflated asset without spooking the bag holders. Pretty damn smart.", "score": 1, "replies": [{"body": "He literally said that he is selling for tax purposes to not spook the investors, what does Twitter has to do with it? Also, how would selling TSLA stock to buy Twitter and then backing out of it will help with not spooking the investors???", "score": -2, "replies": []}]}, {"body": "Is it?", "score": 1, "replies": [{"body": "Tell me one reason why it isn't?", "score": 1, "replies": []}]}, {"body": "Dude watched the fed. And probably has close friends in the fed, and was told to watch the fed closely. Dude even made a Twitter poll to be 'less' degenerate, and he still would of sold. He had insider information. quit dick riding someone who doesn't give a shit about you. You should ask WHY someone has that much money. ITS NOT BECAUSE THEY ARE 'GOOD' FUCK.", "score": 1, "replies": [{"body": "I am not dick riding Elon. He is a guy that constantly says things to hype his companies, despite the fact that he knows that there is a 99 percent chance of them not becoming true in his proposed timeline. According to him, we should have had fully autonomous vehicles years ago.", "score": 2, "replies": [{"body": "Exactly. Just a dude who has always had money. Created a shitty car business, with nice cars. Literally rode his employees with unrealistic deadlines. Just a horrible dude demanding people work, while he does 'venture capitalist shit' saying he is working lol. Dude is a monstrous joke, who has never actually produced anything. Has only taken IP from multiple people and sold it to you in 'his' car. He is Garbage. And the Twitter deal is just him losing his mind trying to become like TRUMP.", "score": 2, "replies": [{"body": "Well, he is definitely a guy that put a lot of capital in companies that many thought would fail, but he actually succeeded massively which definitely takes balls and talant. He also undoubtedly greatly helped with the faster transition to electric vehicles, he made them  \"sexy\" again. To top it off he is accelerating space tech and exploration which I like. On the other hand, he became extremely rich in the process, so our society definitely repaid him generously. \n\nActually, when I think about it, I hate his \"dickriders\" and not him. You can even argue that even his \"hype\" statements are not generally bad, as without them TSLA would not have such a ridiculous valuation and some of his early shareholders wouldn't have made millions. I just dislike the so called \"elonbros\" that know nothing about him or his companies, but treat him like God and never criticise him. For example, I admit his achievements, but still think that the tunnel that he built under Las Vegas is laughable and serves no purpose.", "score": 0, "replies": []}]}]}]}, {"body": "3. Lol what research. He claimed he didn't know there were bots on the platform. He might not have done it to sell tsla shares exclusively but he clearly rushed that decision because he is/was wealthy enough that it wasn't a big deal for him.", "score": 1, "replies": [{"body": "That’s not what he claimed. He never said there were no bots. Stop lying. Of course there are. They’re even officially allowed. The issue was that Twitter knowingly lied in SEC filings.", "score": 1, "replies": [{"body": "Yeah he definetly knew there were bots and went throught with the offer. Shouldn't he do decent dd before doing a 44b deal?", "score": 1, "replies": []}]}]}, {"body": "Twitter, dodgecoin , tesla all have something in common Elon bought/had equity cheap then used his celebrity to pump it and take profits. I would be curious to see if Elon sold parts of his stake in Twitter after the run up.", "score": 1, "replies": []}, {"body": "He should’ve been honest. He needed to sell Tesla shares to pay child support for his 9 kids.", "score": 1, "replies": []}]}
{"title": "The real reason Musk tanked TWTR", "selftext": "Yes he sold TSLA without tanking the stock too much by diverting attention elsewhere… \n\nBUT, the real master plan is to expose Twitter as unreliable (all the bots and fake accounts that have come to light), just in time for the elections. \nElon thus ramps up his foray into politics, possibly as a running mate for Trump, or as his sidekick. \nWith Twitter in shambles he’s preparing the ground for SCOTUS to allow foreigners to become POTUS. \n\nMusk becomes president. Air Force One is replaced by SpaceX One.\n\nSpace Force merges with SpaceX.\n\nElon becomes the guardian of the galaxy 🚀\n\nhttps://www.reuters.com/technology/elon-musk-terminating-twitter-deal-2022-07-08/", "id": "vutp9d", "created_utc": 1657341441.0, "score": 40, "upvote_ratio": 0.59, "num_comments": 54, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vutp9d)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vutp9d)", "score": 1, "replies": []}, {"body": "That's pretty retarded", "score": 107, "replies": [{"body": "So you’re saying there’s a chance?", "score": 38, "replies": [{"body": "What about all that 1 in a million talk????", "score": 9, "replies": [{"body": "Maybe Freida Felcher will become his First Lady.", "score": 5, "replies": [{"body": "Yeah we're looking for a uh ...1984...uh Sheepdog. With Mutt Cutts written on the side.", "score": 3, "replies": []}]}, {"body": "Yeah...see that right there...That's an IOU... \"a little hope\" ...might want to hold onto that one.", "score": 3, "replies": []}]}]}, {"body": "“Retarded-ish”", "score": 6, "replies": []}, {"body": "Its not possible. Born in South Africa.", "score": 8, "replies": [{"body": "You must have fell in the toilet", "score": 6, "replies": []}, {"body": "Obummer was not born here, didnt seem to stop them from faking documents and a social", "score": -2, "replies": [{"body": "Hawaii?", "score": 1, "replies": []}]}]}, {"body": "Just retarded enough ![img](emote|t5_2th52|12787)", "score": 4, "replies": [{"body": "fertile waiting nutty chase dam paltry threatening wakeful clumsy slimy", "score": 3, "replies": []}]}]}, {"body": "Pass me some of that my man 😮‍💨 💨", "score": 14, "replies": []}, {"body": "I am Groot!", "score": 8, "replies": [{"body": "I am Groot!", "score": 4, "replies": [{"body": "I am alpharius", "score": 3, "replies": []}]}]}, {"body": "Are you off your meds or something? Or just really stupid?", "score": 23, "replies": [{"body": "Does a bear shit in the woods?", "score": 7, "replies": [{"body": "No but the pope sure fucking does.", "score": 8, "replies": [{"body": "He also covers up pedophilia. . .", "score": 3, "replies": []}]}, {"body": "Does the Pope shit in his hat?", "score": 1, "replies": []}]}]}, {"body": "6-3 conservative super majority allowing non us to become prez. Sounds legit.", "score": 11, "replies": [{"body": "Can you fucking imagine? That shit would have everyone riled up", "score": 2, "replies": []}, {"body": "The Republicans are originalists, which means they read the Constitution literally. “It don’t say nothin’ about allowing abortion in there.”\nNo way they’d allow a foreigner to be president when it says “native born” in the text.", "score": 3, "replies": [{"body": "Please take all unbabying talk to another subreddit. No one wants r/wallstreetbets to become a political hellhole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Native could mean anything", "score": 2, "replies": []}, {"body": "They already threw that away by saying John McCain (born in Panama) and Ted Cruz (Canadian) were eligible.  They'd be like \"native can mean a myriad of things...\"", "score": 1, "replies": [{"body": "Different situation than Elon. Both were children of U.S. citizens and in McCain’s case his dad was active Navy. Schwarzenegger and Kissinger knew they weren’t allowed to run.", "score": 1, "replies": []}]}]}]}, {"body": "Oldest trick in the book", "score": 3, "replies": []}, {"body": "Can I have what OP's having?", "score": 3, "replies": []}, {"body": "When WSB intersects with Qanon.", "score": 3, "replies": []}, {"body": "OP is obviously joking…obviously", "score": 6, "replies": []}, {"body": "Didn't Musk take a public \"poll\" to see if people were ok with his selling 10% of his Tesla stake, and the \"results\" came back that it was ok?  Why does he need Twitter as a smokescreen after that?", "score": 5, "replies": [{"body": "sauce?", "score": 3, "replies": [{"body": "[https://twitter.com/elonmusk/status/1457064697782489088](https://twitter.com/elonmusk/status/1457064697782489088)\n\n[https://twitter.com/elonmusk/status/1457066048944066565](https://twitter.com/elonmusk/status/1457066048944066565)", "score": 7, "replies": [{"body": "Seems legit. Surely the poll legitimised the action. Remember, it’s all priced in!", "score": 1, "replies": []}]}]}]}, {"body": "Only thing I’ve read today that makes sense.\n\nCalls on u/jasonfilos", "score": 4, "replies": []}, {"body": "Exactly Obama “Barry setoro” was born in Kenya just ask Hillary!  She is the original birther and she is the most smartest trusted piece of shit the democrats could find. Just ask them, she persisted like syphilis.", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vutp9d)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vutp9d)", "score": 1, "replies": []}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}, {"body": "Almost Putin like planning. Hé started his plan also years ahaed, when nobody paid attention.lets see if the immigrant Amerikaan does a better job at World domination", "score": -3, "replies": []}, {"body": "Elon & Trump yes but not Donald. \nIvanka \n🤮", "score": 0, "replies": []}, {"body": "Too much xanax", "score": 1, "replies": []}, {"body": "Bezos will not allow it", "score": 1, "replies": []}, {"body": "Lol scotus is never going to do that especially this scotus", "score": 1, "replies": []}, {"body": "Owning a president is cheaper than becoming one.", "score": 1, "replies": []}, {"body": "Elon for president that podcast guy for VP", "score": 1, "replies": []}, {"body": "This is what I’ll tell my kids happened.", "score": 1, "replies": []}, {"body": "Occam's Razor: he wanted to sell billions worth of stock at high prices.", "score": 1, "replies": []}, {"body": "Where was Elon born?", "score": 1, "replies": []}, {"body": "Elon wants to be Kingmaker for now & then the de-facto King.", "score": 1, "replies": []}, {"body": "Step 17 - Profit", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vvct0j", "created_utc": 1657405583.0, "score": 4, "upvote_ratio": 0.51, "num_comments": 52, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|9 months ago\n**Total Comments**|7|**Previous DD**|\n**Account Age**|9 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vvct0j)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vvct0j)", "score": 1, "replies": []}, {"body": "It's not a \"high IQ\" play because he's not a schlub casually talking about selling a used car. He signed a legally binding purchase agreement to buy Twitter. He now has significant legal exposure and does not have a legally sound means of backing out. Twitter has every incentive and a stronger legal case to either force him to complete the purchase or force a high settlement payment. All indications are that Elon acted impulsively and genuinely did not think this through.", "score": 10, "replies": [{"body": ">He now has significant legal exposure and does not have a legally sound means of backing out.\n\nI think a judge and two armies of lawyers will find out if that is correct or not.", "score": 2, "replies": []}, {"body": "I’ve said it in the comments I’ll say it again - a $1B fine for cancelling vs a >$40b cash value extraction. Worth the trade.\n\nThey have not provided the promised data to support their estimation of the (max) 5% bot user base they claim. Giving more than valid reason for pulling out for the first time in his entire life from a legal and logical perspective.", "score": -3, "replies": [{"body": "Legally, the bot argument is likely not a valid reason. You have to do your diligence before you sign the deal, not after. Signing indicates that he already considered the bot issue and overall state of Twitter (all of which were known) and agreed, again in a legally binding agreement, that he will purchase the company as is. If he had an issue with bots, then he should have decided not to buy the company. But that's not what he did. A purchase agreement is final. At this point he's still on the hook for the whole thing. He can't just \"choose\" to walk away and pay the $1 billion. \n\nEven regardless of that, paying $1B for nothing would still not be a \" high IQ\" move.", "score": 9, "replies": [{"body": "That all boils down to the wording of the contract. Based on what’s been communicated to the public it’s been explicitly stated as a part of the terms of agreement and therefore not providing this is a breech of contract.\n\nExample being if you buy a house subject to inspection, but they never let the inspector actually enter the house.\n\nA cancellation fee is in place explicitly to enable people to walk away from a deal like this for a price. Look at JetBlue trying to buy Spirit, they explicitly have added to the terms they will pay something like 350m if it doesn’t close due to regulatory issues or other cancellation reasons. \n\n\nTo you and I it would seem daft to pay a billion but as stated above, it’s the successful wealth extraction of >40bn without crashing the stock that is high IQ, to pay 2.5% of this as an enabler and to protect >100bn of assets still help it’s **absolutely** a high IQ move.\n\nWould you rather have 100% of 100m or 97.5% of 1b? I’m certain your answer would be the latter. In this case it’s the cost of business.", "score": -2, "replies": []}]}]}]}, {"body": "Remember when Elon sold a bunch of stock so he can pay a big tax bill lol", "score": 7, "replies": []}, {"body": "He might have sold TSLA stock to generate additional funds to buy Twitter, but he never admitted it publicly. So how is he using his Twitter offer to appease his shareholders? Also, why would the TSLA shareholders panic if he sells stock for let's say buying a yacht, but not panic when he sells to buy shares of another company, what is the difference? Last, but not least, if he was so concerned about his shareholder's opinion, he could have just said that he is doing it to fund his space exploration ambitions, as he has said numerous times that this is his ultimate life goal.", "score": 11, "replies": [{"body": "As you *must* know the shareholder sentiment is extremely fragile - “selling to buy a yacht” when you’re still active in the company (chairman and CEO) would not land well - whereas to pursue another business opportunity/venture seems logical, credible.. even profitable? \n\nSurely that’s pretty blatant?", "score": 3, "replies": [{"body": "I do not know man. I would prefer it if the CEO of a company that I have invested in sells stock for personal liquidity needs, instead of doing it to invest in another company that might generate him greater returns. Regardless of that, he has never publicly stated that he is selling TSLA stock to fund his Twitter purchase. Maybe you are on the opinion that TSLA's shareholders will come to that conclusion by themselves?\n\nOrchastrating such a complex and resourceful operation just to potentially prevent a slight decline in the share price seems like too much for me. It is not like he sold 50 percent of his holdings. Insiders sell stock all the time.", "score": 7, "replies": [{"body": "I’d agree however I don’t believe it would be a “slight” decline given the huge negative sentiment against Tesla - bill gates, Michael burry a load of big names and key players (hedge funds and big firms) with huge short positions against Tesla so all it would take is a big enough nudge.", "score": 0, "replies": [{"body": "Michael Burry responded to my craigslist ad looking for someone to mow my lawn. \"$30 is $30\", he said as he continued to mow what was clearly the wrong yard. My neighbor and I shouted at him but he was already wearing muffs. Focused dude. He attached a phone mount onto the handle of his push mower. I was able to sneak a peek and he was browsing Zillow listings in central Wyoming. He wouldn't stop cackling.\n\nThat is to say, Burry has his fingers in a lot of pies. He makes sure his name is in all the conversations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": [{"body": "Crack bot", "score": 3, "replies": []}, {"body": "Loool wtf is this", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Do y’all get paid to throat musk tip on the weekends, or is this a volunteer passion-project type of thing?", "score": 22, "replies": [{"body": "He doesn’t forget to lick the sack too", "score": 4, "replies": []}, {"body": "I detect a sucky sucky", "score": 2, "replies": []}, {"body": "PREACH", "score": 1, "replies": []}, {"body": "Pass the salt ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "If you’re seriously dense enough to think I could make a living for posting on a Reddit forum about a blatant high IQ play from a entrepreneurial icon.\n\nPlease do have a Cr’ank elsewhere. If you can’t see something this blatant then I hope you at least have glasses.", "score": -15, "replies": [{"body": "Lmao, bro sucking his dick this bad for free isn’t something to be proud of. Go back to 🤡 school", "score": 6, "replies": [{"body": "Mans names himself “war time” when the only war you’ve ever seen is on COD.\n\nPlease drown yourself in the product from your 0 IQ circlejerk.", "score": -8, "replies": [{"body": "Sorry, you’ll have to say all that again but really annunciate it after you take Musk’s crooked (probably defective) dick out of your mouth.", "score": 5, "replies": [{"body": "No no, please don't ask him to say anything. We all get dumber the more he talks", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s like these guys had their heads microwaved.", "score": 1, "replies": []}]}, {"body": "Yeah like when he sold to \"pay taxes\"", "score": 7, "replies": [{"body": "Yeah but you don’t have to pay taxes until you close a position so.. go figure.\n\nI’m amazed how mad this makes some people here, especially given I’m literally neutral on the guy, **comical**.", "score": 3, "replies": []}]}, {"body": "If there is justice in the world he will get stuck with a \"54.20\" billion dollar bill at the end of this. Remember, he has no friends at the SEC.  We will see what his money gets him in Delaware.", "score": 4, "replies": [{"body": "Yeah but he’s a multimillionaire nothing will happen.\n\nIt’s super impressive what he’s achieved though!", "score": 1, "replies": [{"body": "Many of them are, but he signed a contract and Twitter is a publicly traded company. He can't just walk away.", "score": 7, "replies": [{"body": "Valid, but a break up fee (for walking away) to cover your ass with the SEC is worth it, no?\n\nEven if it’s $1b of $40b+ worth you are able to extract.", "score": 1, "replies": []}]}]}]}, {"body": "MUSE🚀🚀🚀", "score": 2, "replies": []}, {"body": "Has anyone tried to figure out the Cap Gains hit from Elon’s TSLA stock sale? Curious.", "score": 2, "replies": [{"body": "Probs hard to calculate due to factoring in market shifts etc.", "score": 1, "replies": []}]}, {"body": "Elon isn't going to peg you pal, as much as you want.", "score": 2, "replies": []}, {"body": "Fuck man this is the 1000th post saying the same dumb shit. We get it, people think the Twitter deal was a ruse to offload tesla shares. Stfu about it already and scroll through the damn feed first if you want to post some \"ground breaking insight\" you may think you've had an original thought on", "score": 2, "replies": []}, {"body": "I was thinking exactly the same months ago.Yes!", "score": 2, "replies": []}, {"body": "Twtr was a scapegoat it seems for his dumping", "score": 4, "replies": []}, {"body": "Get off his dick. Is riding his cock all you do ?", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "When you post on Reddit you get opinions….especially when you post something that appears to simp one of the biggest douchebags on the planet…. And, in retrospect, I asked and appreciated Jaime’s opinion.  You keep up the good work Jaime!  Unless you are Jaime Dimon, in which case, eat a bag of dicks.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Get off his dick. Is riding his cock all you do ?", "score": 0, "replies": []}, {"body": "You know my step dad!!  Which one?  Please introduce us when you get a chance!", "score": 0, "replies": []}]}]}]}]}, {"body": "I’ll be honest I hadn’t thought about it like that.\n\nNice DD OP.", "score": 3, "replies": [{"body": "Ty but I’m just retarded who knows", "score": 3, "replies": []}]}, {"body": "Now he will let it drop to 1/2 it’s value and buy it then. Elon is the market maker", "score": 1, "replies": []}, {"body": "\"... but personally IDFC for your opinion, who asked?\"\n\nYet writes his own unsolicited long opinion.", "score": 1, "replies": []}, {"body": "Hes gonna pay much more than 1b in fines ya dingus. U and musk are both low iq", "score": 1, "replies": []}]}
