{"title": "New AAPL options position JULY 11 6:43am", "selftext": "", "id": "1e0pdhp", "created_utc": 1720705683.0, "score": 6, "upvote_ratio": 0.99, "num_comments": 28, "comments": [{"body": "Not going up today so far.", "score": 2, "replies": []}, {"body": "Just bought a bunch for 1.03", "score": 2, "replies": [{"body": "In at $.93 - thanks for the tail Jon", "score": 2, "replies": [{"body": "Awesome pick up yesterday.", "score": 2, "replies": [{"body": "Yes sir!  Just sold for 80% gain.  Thanks again Jon", "score": 1, "replies": [{"body": "Nice 😊 congratulations on printing profits again. Have a wonderful weekend", "score": 1, "replies": []}]}]}, {"body": "Sweet 😊 great price", "score": 1, "replies": []}]}]}, {"body": "Along for the ride as well.", "score": 2, "replies": [{"body": "Make sure  you check the current bid/ask before executing. got filled around a dollar recently. Up to 200 contracts right now", "score": 1, "replies": [{"body": ".98. But nowhere near 200 lol", "score": 2, "replies": []}]}, {"body": "How are you doing this morning?", "score": 1, "replies": [{"body": "I’m rocking it this morning. Bought my last contracts just before it pumped again this morning. For .98. I hope you are doing well also my friend.", "score": 2, "replies": [{"body": "Up $20k", "score": 2, "replies": [{"body": "Bruh you are legend.", "score": 3, "replies": []}, {"body": "🙏 much respect", "score": 2, "replies": []}]}]}]}]}, {"body": "I got in at $0.85. Only 10 contracts to test the waters, but in for the ride. Thanks Jon", "score": 2, "replies": [{"body": "Always 😊 good luck and happy hunting", "score": 1, "replies": []}, {"body": "Great buy yesterday. Now have an exit strategy preplanned and know what you’re gonna do depending on the situation ahead of time", "score": 1, "replies": [{"body": "Just sold all 10 contracts at 1.60 for a nice little profit. Thanks again homie", "score": 2, "replies": [{"body": "Always 😊 congratulations on printing profits!! Have a wonderful weekend", "score": 1, "replies": []}, {"body": "How are your current positions?", "score": 1, "replies": []}]}]}]}, {"body": "It just goes up.  I can't remember it ever going up so much.  When will it stop going up?", "score": 1, "replies": [{"body": "I think it'll go up to at least $275 by the end of the year (which is what some big analyst has set as the price target).", "score": 2, "replies": []}, {"body": "I bought after a decent pullback…", "score": 1, "replies": []}]}, {"body": "Currently working with:\n\n* 7/19 235c at 0.872\n* 7/19 232.5 at 1.88 (bought this morning) \n\nThanks for your wisdom!", "score": 1, "replies": [{"body": "Sweet 😊now have an exit strategy preplanned so you know what you’re gonna do depending on the situation. It’s difficult but try to maximize your gains while cutting losses quickly or adjusting quickly", "score": 1, "replies": [{"body": "Thanks for the advice! I definitely learned my lesson from yesterday 😅. \n\n\nAre you planning on securing profits today?", "score": 1, "replies": [{"body": "Depends", "score": 2, "replies": []}]}]}]}]}
{"title": "Arguments ‘for’ or ‘against’ this article please…", "selftext": "Just curious to hear all of your opinions on this article:\n\nhttps://www.morningstar.com/news/marketwatch/20240709179/nvidias-stock-is-soaring-largely-thanks-to-microsoft-alphabet-and-techs-other-ai-giants-that-wont-last\n", "id": "1e0orby", "created_utc": 1720703928.0, "score": 9, "upvote_ratio": 0.92, "num_comments": 29, "comments": [{"body": "His argument has three components against Nvidia's longer term success:  Surge pricing (cars in covid), competition is going to show up, and the cost is a capital expenditure.   HIs tl:dr is:  the cure for high prices is high prices.   I guess that's true if you're selling socks.\n\n- 1.  High prices aren't going away.   These chips are incredibly complex to build, wafer prices are sky rocketing and even if competitors enter, they are coming in at historically high prices (AMD MI300 for example is estimated at $20K a pop, the difference between H100 and MI300 pricing is easily quantified in the software and scalablity of one solution over the other.   Even Intel, with very little traction in their Gaudi product line is positioning their 3rd gen at near $15K a piece.)\n\n- 2. Competition.   I've been watching the machine learning market intently for 10 years.   I personally attended the first AI hardware summit in San Jose in 2018 when two dozen alternative venders where going to be contenders including Baidu and AWS.  The set of these collective competitors have been coming for years.   And many have come and many have gone, mostly into obscurity.   \n\nWhat shallow analysis like this guy's miss is the chips aren't interchangeable, each one needs robust software.   And then once they nail that they need networking and robust memory subsystems, and then supply chains and developers and roadmaps before data center operators are willing to invest.   DIY chips like Google and AWS's inferentia take enormous internal resources to scale.   And while they're trying to do that and get folks to come over to their platform, Nvidia releases a new generation, and it's all software compatible and basically plug and play.  And developers applications generally just work, or take minimal changes to take advantage of new architectural features.  That's the MOAT, the ecosystem flywheel that competitors will not overcome for a long time.\n\n- 3.  I can't make sense of his cap ex argument.  \"Nvidia shows up in Alphabet's income statement in the form of depreciation, while the full $40,000 shows up in Nvidia's revenues.\"   So what?   This is exactly the accounting that was going on when Intel built it's data center business too over the last 30 years.   It's not an argument, it's the way accounting works, these companies are investing in infrastructure which has a limited life and can be depreciated.   \n\nSimpler inferencing devices will provide opportunities for competitors at the edge/final mile sort of applications.   Nvidia is dabbling in this arena with Tegra and their Jetson robotics solutions.  But for the most part they will stay clear of low margin, low value solutions and cede those solutions to those who wish to fight for business below their corporate margin rates.", "score": 11, "replies": [{"body": "Thanks you for the thought full response. 👍", "score": 2, "replies": []}, {"body": "Is this chatgpt ?", "score": -1, "replies": [{"body": "that's good old fashion brain.", "score": 2, "replies": []}]}]}, {"body": "People who work in the industry understand that the urgency in compute and energy demands. I work in model research and applied AI, if we could afford to 10x our compute budget, we would do it in a heartbeat. I would love to have some discounted compute with AMD or Google hardware, but am I going to commit to only a single cloud platform and less mature software stack? Hell no. Not until the whole industry has matured and the only thing left to optimize is cost. There are millions of CUDA questions/answers, bug workarounds, tutorials, etc on the internet. When you have an issue, chances of someone in you team or online forums can help is exponentially higher for CUDA vs anything else. Also good luck replicating most AI paper on non-CUDA hardware. Those Wall Street analysts think we can just unplug the Nvidia GPU and plug in an AMD GPU and press the power button 😂. \n\nThere are many levels of abstractions between me launching the training pipeline and the results coming back. If any stage of the pipeline got stuck that could mean hours or days of my time and compute quota wasted. Unless AMD paid for my quota, I would not choose AMD over Nvidia at this point. In theory, it is possible that non-Nvidia platforms can build a black box software stack that run as smoothly as Nvidia’s and you can train a specific model in a specific way without much trouble. The problem is when you started to customize. We started to write code without assuming the underlying hardware, but we never tested our code in non-Nvidia hardware. By the time we wanted to try non-Nvidia hardware, the original author of most of our code already became a SVP or left the company. When the CTO asked me if I wanted to port the code from Nvidia to AMD, am I really going to ask my team of highly paid engineers to troubleshoot porting issues, and half of them will quit the very next day, or I politely decline the request?", "score": 7, "replies": [{"body": "Excellent, thanks for the insight.", "score": 3, "replies": []}, {"body": "> and press the power button 😂\n\ntake it from an industry insider, well said.", "score": 2, "replies": []}]}, {"body": "What he's saying definitely makes sense on the face of it and is typical from finance guys. But there are a couple of things he's not understanding, leading him to think of this current situation as any other bubble and AI as any other industry and Nvidia as any other company.\n\n1. Continued innovation. Blackwell is a lot better than I thought, I had thought that AMD would make more headway in the market than they did, but it looks like their current gen at least is comparatively of only lesser success simply because Blackwell is so extremely innovative. As alternatives try to catch up Nvidia presents a moving target. Did people think smartphones were going to come down in price over time as more and more companies got into it? It only increased in price simply because Apple was able to show continued technological superiority.\n\n2. Supply limits. There seems to be assumption that supply will eventually catch up to demand. People who are not in tech really underappreciates the sheer scale of demand here. The lack of chip supply is the #1 problem in the industry right now, and this will probably continue. Nvidia has deep access in the supply chain, and so long as they stay the biggest customers it'll be really hard for new customers to get in. Probably just hearing it from me you wouldn't be able to really understand, believe, and intuitively grasp how problematic the supply chain situation is right now for chipmakers, but guys the problem is very real. You'll have to talk to people who are in chip design to get it.\n\n3. Supply won't catch up to demand for the foreseeable future. Demand is absolutely overwhelming. It's kind of a repeat of the previous point but it's worth stressing. Demand is out of this world, like nothing else in human history. The comparison to cars made in the article is like what I would expect from someone who's not in tech and doesn't really understand what machine learning is. Unlike pretty much every single other product in human history, like cars, like smartphones, semi demand for AI is not limited by human population. There reaches a saturation point for every other product since humans are the consumers of every other product. That's not the case with AI. AI demands, hungers for more compute, it's self-perpetuating, the more compute it has the more uses for compute it has. AI compute will rival and surpass human bio compute, and then keep going. There is no reason to ever stop.", "score": 10, "replies": [{"body": "Thank you for the thoughtful response.", "score": 1, "replies": []}, {"body": "Is this chatgpt ?", "score": -1, "replies": [{"body": "No it's a bit rambling because it's not chatgpt.", "score": 0, "replies": []}]}]}, {"body": "This internet shite is just a fad...", "score": 3, "replies": []}, {"body": "Look up how much compute open AI sora uses. It's not released because there is not enough compute...", "score": 4, "replies": []}, {"body": "The article starts with \"Within a few years\" ... so we are clearly set for 2-3 years! And it is hard to think of a scenario in which a competitor is catching up to NVDA while they do nothing to advance....   \nAnd if in 3 years someone like AMD can make a similar performing chip AND at a similar power consumption AND has good software to back it up AND sells it at a lower price, what stops Nvidia from just lowering the price to be competitive? The margins are so high that they have room for that now (it will probably be the case in the future).", "score": 1, "replies": []}, {"body": "I 100% agree.   AWS and Google designed their own chips for AI.  Googles Gemini was trained exclusively using Google TPUs.   AWS have Trainium which uses their silicon. \n\nMicrosoft and Facebook are rolling their own.  Custom chips will be faster and will be more niche.  \n\nThose 4 represent most of NVIDIAs customers. \n\nThen you have others making custom AI chips as well.   Everyone is entering the market.   Even NVIDIA is getting into the design partnership game.", "score": 1, "replies": [{"body": "Not exclusively", "score": 1, "replies": []}, {"body": ">Custom chips will be faster\n\nGive one example from the past 10 years.   Okay, don't.  It hasn't happened.   Nvidia's GPUs continue at the top of the pack and will for the foreseeable future.\n\n>Everyone is entering the market.\n\nEveryone already entered 10 years ago.  They are just finally getting their shit together to find a tiny piece of real estate they can hold on to.  Google has their walled garden, AVGO has ethernet and AMD is working to stay atop of a tiny iceberg.", "score": 0, "replies": [{"body": "Graphics cards were the cream of the crop for say, Bitcoin mining in 2011, and then some companies no one ever heard of rolled their own chips which crushed it it terms of size, speed, and power.  More gates toggling doing the functions needed.  Less overhead.  The closer you get to the silicon and remove levels of abstraction like CUDA, the better.  No one uses NVIDIA for Bitcoin mining anymore.  Some of the more memory intensive algorithms, they do.\n\nIf an algorithm is well defined, defining custom silicon will always be faster.  If you have a library like PyTorch or Tensor flow, specific hardware can be designed which won't have the overhead of a more general purpose programmable processor. \n\nThis isn't news.  NVIDIA knows this and announced a partnership program with silicon manufacturers to aid in this.  The see what Google has done, and AWS.  They know that custom chips for each of the AI libraries (ex. Tensorflow, PyTorch, HuggingFace, Keras) will be the future.  Each chip will probably target just one.", "score": 0, "replies": [{"body": ">If an algorithm is well defined, defining custom silicon will always be faster.\n\nno duh.   Too bad ML isn't a place of well defined algorithms, now isn't it?\n\nWe can wait for your example of a faster ASICs. . . .  tick tick tick", "score": 1, "replies": [{"body": "The Google TPU v5p is the faster accelerator for tensor flow.   Google Gemini is trained on Google hardware exclusively.  ML libraries have hit that level of maturity.  \n\nNVIDIA biggest competition is its own customers.  There will always be a market for can’t build thei own.", "score": 1, "replies": [{"body": "Whose data do you use to conclude that?  Googles?  Or some public or legitimate source?  H100 is more than 2 years old now.   That's Googles model to compare 2 years later and then do a victory lap. \n\nBlackwell is sampling to customers now.  That's likely the fastest solution on the planet right now, we'll know soon enough.", "score": 1, "replies": [{"body": "Google's TPU are available for use in Google's CLOUD and there are benchmarks from customers.  Google is one of the largest owners of H100s on the planet, and they have ample numbers of them in their datacenters (A3 computers).  They train and do inference for Gemini with their own hardware despite having these resources...", "score": 1, "replies": [{"body": "right, you're not telling me anything not already known.   Owning \"ample numbers\" or \"customer data\" is not the same as independent 3rd party testing two solutions under the same conditions.  \n\nI'm not sure what the point is anyway, Blackwell is by Nvidia's claims 30X faster than H100.  \n\nIt's a pretty safe assumption it's faster than TPU.  As I say, we'll know soon enough.", "score": 1, "replies": [{"body": "I highly doubt the 30x improvements over an H100.  Best benchmarks I have seen is 19x over the older A100 which seems about right.  But we will see, all vaporware will it is here.\n\nI am sure the TPU v6, Trainium3 and Gaudy 4 will be large improvements as well.  Easy peasy to fire up some instances and run some benchmarks when they are deployed...", "score": 1, "replies": [{"body": ">Easy peasy to fire up some instances and run some benchmarks when they are deployed.\n\nWell, no.  Very very few public sources exist of reliable 3rd party benchmarks to date.  \n\n>I highly doubt the 30X \n\n4th slide here:  [https://medium.com/@learngrowthrive.fast/blackwell-vs-hopper-a-revolutionary-leap-forward-ed7a85082b15](https://medium.com/@learngrowthrive.fast/blackwell-vs-hopper-a-revolutionary-leap-forward-ed7a85082b15)", "score": 1, "replies": [{"body": "You can easily do your own benchmarking for your own training.  Firing up machines on AWS or Google Cloud is pretty straightforward.\n\nOh, I will believe the 30x when I see it.  Usually this type of marketing assumes a certain feature.  It looks here like they are assuming you use FP4 rather than FP8.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I’ve been saying this for weeks, I was told I’m retarded and I should go all in at $136 like everyone else.\nI’m holding a small short position from mid 130s, looking for a 50%+ drop", "score": 0, "replies": []}]}
{"title": "Should I Sell Nvidia?", "selftext": "[deleted]", "id": "1e0rlqy", "created_utc": 1720711499.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 26, "comments": [{"body": "If you're asking, you are a gambler.", "score": 6, "replies": [{"body": "Aren't we all...", "score": 2, "replies": [{"body": "I'm an investor.  I don't trade in and out", "score": 0, "replies": []}]}]}, {"body": "Sure, today is good to sell!", "score": 4, "replies": []}, {"body": "Hold for sure. Don’t know what profit you’re sitting on but it will hit $150 or more by next earnings.", "score": 8, "replies": []}, {"body": "It'll touch $150 eventually.", "score": 4, "replies": []}, {"body": "i sold ALL yesterday and had predicted this correction.  buy low, sell high.", "score": 5, "replies": [{"body": "How you predicted it?", "score": 1, "replies": [{"body": "I tried the Magic 8 Ball and won once.", "score": 4, "replies": []}, {"body": "nobody knows for sure but the bigger the run up, the higher the chance for a correction as more and more people sell for profit and stops are sold.", "score": 2, "replies": []}, {"body": "i saw an modest, incremental run up for 5 days.  it seemed tentative.  so the momentum wasn't there.  i decided to take my profit and wait until it corrects, and it did.  of course, you would have had a 50% to get it right flipping a coin.  LOL", "score": 1, "replies": []}]}]}, {"body": "I would wait till at least next earnings.  But I am going to hold long term since they have no real competition yet.  Once they have a real competitor then I’ll reassess again.", "score": 3, "replies": []}, {"body": "Abso-lutely! Sell it all now. I heard they are heading towards bankruptcy. \n\nSource- trust me bro.", "score": 3, "replies": []}, {"body": "Good Lord, MFs really are brand new", "score": 3, "replies": []}, {"body": "Nooo buddy hold it", "score": 7, "replies": [{"body": "I have 200 shares im planning on holding but it seems everyone here’s is stressing about these little dips, all day traders I’m guessing?", "score": 1, "replies": []}]}, {"body": "After earnings there’s a good chance but why would it go up that much over a month before then?\n\nI think August and September will be good months before a large and needed pullback in stocks in general in October. Stocks don’t just go up and up everyday ", "score": 2, "replies": [{"body": "why it would go up? hype. oh and FOMO obviously", "score": 1, "replies": []}]}, {"body": "Don’t sell", "score": 2, "replies": []}, {"body": "wait for earnings next month or hold for long term 2 to 4 years", "score": 2, "replies": []}, {"body": "Not an expert here but I am holding.  Actually bought another share this morning.", "score": 2, "replies": []}, {"body": "Yeah sell it. Weak hands should not hold Nvidia. Sell it to me!", "score": 2, "replies": [{"body": "Chill out. Just asking for advise not attacks. ", "score": 1, "replies": [{"body": "They’re dumb questions. Why would you sell Nvidia? Just keep buying.", "score": 1, "replies": []}]}]}, {"body": "Sell it! I will buy.", "score": 2, "replies": []}, {"body": "Paper hands", "score": 1, "replies": []}]}
{"title": "Price action", "selftext": "so many traders attached to their gains, emotion-posting “yep nvidia bear here, stock is going to sub 100, i told you guys☝🏼🤓” meanwhile seething behind their screen hoping to see it go back up. \n\nstock subreddits are an evil place when the subject stock turns red..", "id": "1e0te7q", "created_utc": 1720716019.0, "score": 19, "upvote_ratio": 0.85, "num_comments": 23, "comments": [{"body": "Nobody online is real anymore. It’s all bots and lurkers who never comment. The lurkers end up making trades based on bots arguing online", "score": 14, "replies": [{"body": "Beep boop, I’m in this comment, and I feel personally offended", "score": 6, "replies": [{"body": "Reported for bullying /s.", "score": 1, "replies": []}]}]}, {"body": "Agree completely - yet there’s so many people who think now that all stocks do is go up and people think it is normal for stocks to go up over 10-20% everyday now because they are a growth stock\n\nLike I like SoundHound because Nvidia has invested in them and they seem promising but 22% gain yesterday and then today around 8% so far it’s just crazy", "score": 13, "replies": [{"body": "I dont have too many shares (200) but SoundHound finally broke even for me this week. Then the market/NVDA decided to take a shit today… 🤣", "score": 1, "replies": []}, {"body": "NVDA didn't go up 22% yesterday duh", "score": -5, "replies": [{"body": "He’s talking about SoundHound", "score": 7, "replies": []}]}]}, {"body": "As someone who is a huge fan of Nvidia I just find all the hopium on this sub so funny. You've got people who are getting in at all time highs acting like they're getting in on the ground floor.\n\nGuys, Nvidia is a solid business and will probably continue to do well, but it's also one of the biggest companies in the world. It isn't a unicorn where you're going to 5x.", "score": 6, "replies": [{"body": "What people forget also is the big big problem with market dominance on the SPX right now, when NVIDIA falls we actually have an issue of financial contagion now where the whole market appears down...\n\nThis is going to be a total shit show.", "score": 2, "replies": []}]}, {"body": "I hope it goes to 100 so I can buy more of it.", "score": 3, "replies": [{"body": "Hoping for $100 so I can more shares!", "score": 2, "replies": []}]}, {"body": "I think NVDA has run its course. But I don't think it's going down, and I hope not. It's going to drag the entire market down with it, and that's where I locked in my gains. Lol.", "score": 0, "replies": []}, {"body": "Why do you want it to go higher?  We should be hoping it goes to $50 a share so we can buy even more ...", "score": -7, "replies": [{"body": "Well that is not happening. not even 1000", "score": 1, "replies": [{"body": "1000?", "score": 1, "replies": [{"body": "I meant 100", "score": 1, "replies": [{"body": "Well actually you're right, it is 1000 and everyone seems to forget this just because of the stock split. Which, funnily enough, companies do to stocks to make them look reasonably priced whilst the CEO and directors begin offloading their shares at all time highs to retailers. Lmao like clockwork", "score": 1, "replies": []}]}]}]}, {"body": "Stfu not all of us want to keep buying and definitely not if it hits 50", "score": 1, "replies": [{"body": "Why not?  So you want to pay more for your shares?   lol makes sense", "score": 1, "replies": [{"body": "If it hits 50 I’d lose 150%. No thank you.", "score": 1, "replies": [{"body": "If you have the attitude, seriously just stick to index funds.  Do you want to be 65 with $10k in the bank?  If not, VTI and a little QQQ are your best bets for long term.  But you have to have discipline and KEEP adding money and NEVER sell until you retire.  And believe me retirement comes QUICKER than you think it does!", "score": 2, "replies": []}, {"body": "You're never gonna make it in the investing world....", "score": 1, "replies": []}, {"body": "The point of investing is to buy LOW and sell high.  Sell doesn't mean NOW, unless you're trimming either because a position has gotten too large percentage wise compared to other things OR the companys outlook has gotten MUCH worse and theres no hope of things EVER changing in the future.\n\nIt doesn't make any sense that you wouldn't buy shares ON SALE if you believed long term in a company!  For example, if there's a macro event that sends ALL stocks down due to a scare it doesn't mean that NVDA had a reason to sell off, it simply meant that people got scared and added all up it sent ALL stocks and the most held down FURTHER.  \n\nThat's an opportunity to ADD!!   Not to SELL!  These are VERY important things to remember in investing or you won't make it really!  When good companies sell off due to macro scares those are times to buy on SALE!", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Do not be the one bag holding NVDA", "selftext": "you’ve been warned ", "id": "1e106gy", "created_utc": 1720733184.0, "score": 0, "upvote_ratio": 0.23, "num_comments": 22, "comments": [{"body": "What is this post supposed to be other than you trying to strengthen the position you’ve obviously taken. You don’t know where the stock is going short term or long term.", "score": 6, "replies": []}, {"body": "I have 900 shares remaining (sold some last week) at +\\~800%. \n\nWhat happened today is not even a blip on the radar screen. I've ridden other Wall St. darling ponies before and know how to cut off and dump/run if it is headed south in a major way. Already got my initial investment and a good bit of long term capital gain gravy out already.", "score": 5, "replies": [{"body": "So you’re expecting a major major drop in", "score": 2, "replies": [{"body": "I'd say sort of expecting a pothole or worse on the road though, more like hedging, reducing risk/exposure and maintaining diversification.\n\nIt has been \"my way\" since I started investing in the 1980's to sell some along the roller coaster ride up and avoid getting greedy by leaving all of an individual stock \"winner\" in play.  All of the past star performer individual stocks I've held eventually dropped substantially. No one knows when and anyone who claims to is full of caca.\n\nI've missed the boat on selling some- most notably MRNA when it was up more than 600% a few years ago (now it is \"merely\" up \\~70%).\n\nAn initial investment of $20k in NVDA turned into \\~8-10x gain within a few years which is my best overall % increase of an individual stock ever.\n\nI also actively maintain diversification across investments since I'm within \\~5 years or less of retiring.", "score": 1, "replies": []}]}]}, {"body": "I'm holding long term so I'm fine.", "score": 3, "replies": [{"body": "if u are in profit protect breakeven. If u are at a loss sell now", "score": -6, "replies": [{"body": "My cost basis is around $17 and I’m hedged. So not worried.", "score": 1, "replies": []}]}]}, {"body": "Show pics of your short position :p a 3 trillion dollar company will survive a 5% dip I promise everyone who bought just hold it may take a few months but you'll recover it's only a loss if you sell.", "score": 2, "replies": []}, {"body": "How you doing this morning ?", "score": 2, "replies": [{"body": "tried warning u", "score": 1, "replies": []}]}, {"body": "Is that a challenge?", "score": 1, "replies": []}, {"body": "I'm in deep. Can't pull out now.", "score": 1, "replies": [{"body": "if you’re in profit.. don’t let them evaporate. \nIf you’re currently underwater.. you should always have stops in place.", "score": -5, "replies": [{"body": "Short term thinking.. think out 5 years at least", "score": 3, "replies": []}]}]}, {"body": "So sell now?", "score": 1, "replies": [{"body": "if you are at a loss yes", "score": -6, "replies": []}]}, {"body": "Trade it for some lumen. Heard it here first.", "score": 1, "replies": []}, {"body": "I have balls thank you", "score": 1, "replies": []}, {"body": "So are you guys just day traders because I have 200 shares now I was planning on holding for like a few years. Is this not a good idea?? It will probably end up splitting again within 10 years", "score": 1, "replies": []}, {"body": "Is OP ok?", "score": 1, "replies": []}, {"body": "Going to $20", "score": 0, "replies": [{"body": "The rocket scientist above could get these puts for almost free and become a multi-billionaire if he bought them.\n\nToo bad he hasn’t yet researched how puts work (should say something about the rigor of his DD)", "score": 0, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1e10ykb", "created_utc": 1720735214.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 20, "comments": [{"body": "I’ve been reading some people with their TA saying that we could be heading a bit lower?", "score": 3, "replies": [{"body": "Great. That’s a value opportunity", "score": 2, "replies": []}]}, {"body": "If we have any hope of a recovered economy, you better hope small businesses draw money from high multiple safety tech. Otherwise, we're all boned.", "score": 3, "replies": [{"body": "Agreed.", "score": 1, "replies": []}, {"body": "I am wondering what is going to happen to less valuable companies such as Tesla.", "score": 1, "replies": []}, {"body": "100% boned to the bones", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I’d argue it’s not a rotation to value as much as it is companies that will benefit more from low interest rates. Small caps.", "score": 1, "replies": []}]}, {"body": "low caps will see growth so yeah might happen", "score": 2, "replies": []}, {"body": "Ask yourself this: do the mag 7 benefit from low interest rates or not?", "score": 2, "replies": []}, {"body": "You guys are missing the point, it’s not going to be a rotation, the whole market is going down, hard landing is almost guaranteed…", "score": -5, "replies": [{"body": "Small caps are going up. Look at TNA and Russel.", "score": 1, "replies": [{"body": "I am well aware, a day or even a few days doesn’t change anything, small caps will also get hit after they lure in people who are unaware of how bad the economy really is", "score": 0, "replies": [{"body": "Something something smart money... something something king of the bears... something something shorting the world economy...\n\nYeah, whatever you say.", "score": 1, "replies": [{"body": "Awe I already have admirers, cute 🥰", "score": 0, "replies": []}]}]}]}, {"body": "Are you stuck in 2022?  That’s a tired narrative.  We’ve already gotten through the thick of it.  Inflation is meaningfully down, rate cuts coming b/c there’s no way the U.S. government is going to continue to accrue 1-2T in new debt a year at 5%", "score": 1, "replies": [{"body": "Interest rates are as high as 2022 but even higher", "score": 1, "replies": [{"body": "Only new debt and variable debt gets acquired at existing rates.  The vast majority of debt is not at high rates.  \n\nRaising rates cools the economy… and then when it slows they lower rates as needed.  \n\nA hard landing is like a Mike Tyson knockout.  If it was gonna happen it was gonna happen in the early rounds.  Odds of a hard landing now are extremely diminished barring a black swan event.  But then with internet trolls, an asteroid will hit the earth and they’ll say “sEe i tOlD yOu hArD lAnDiNg”", "score": 2, "replies": [{"body": "😅", "score": 1, "replies": []}]}]}, {"body": "Hard landing in 2025 guaranteed…", "score": 0, "replies": []}]}, {"body": "Evidence? I have been hearing people say this for more than a year but macro indicators never support their opinions. So what are you looking at when you say you see a downturn?", "score": 1, "replies": []}]}]}
{"title": "Is it true that an options contract loses its value after a stock split?", "selftext": "I'm thinking of buying some AVGO calls but kinda uncertain on whether I should do it before or after the split.\n\nFrom what I read online, it seems the saying is simply that the contract will readjust in qty to conform to the new split and there's no price loss.\n\nHowever, I've also heard some people claim that the contract may actually devalue right after the split, due to IV crush. Some also claim the contract will be traded in a diff market thus lose its liquidity and value.\n\n I've also observed a lot of traders were selling their options right before Nvidia's split the last time, which was why Nvidia dipped abit right on the stock split date.\n\nSo which is which? Is it better to just hold off from buying any AVGO calls until 15th july then? so far it does seem like AVGO is indeed straddling instesd of rising as the last two days before the split approaches", "id": "1e0fxc1", "created_utc": 1720670859.0, "score": 6, "upvote_ratio": 0.58, "num_comments": 23, "comments": [{"body": "No your options will be split in a way that supposedly the value will remain the same, all things equal. Whether or not IV will increase or decrease or if people will selloff AVGO before the split is just speculation, nobody will know until it happens.", "score": 20, "replies": [{"body": "Correct this happened w my BNED shares", "score": 4, "replies": []}]}, {"body": "I personally did this with NVDA before the split but only because I knew the volume would explode once it was cheap enough for the WSB crowd to buy more than a share.\n\nI’m not sure I would expect the same with AVGO simply because it doesn’t have the same name recognition.", "score": 10, "replies": [{"body": "AVGO was at 1875 ATH before the massive AI dip a few weeks back. I dont see why it wouldnt rise back to that level at least, esp after a split and TSM's earnings", "score": 4, "replies": [{"body": "Very aware i had 1500 calls before that peak and made out like a bandit but it settled quite a bit since then", "score": 3, "replies": []}]}, {"body": "So did NVDA work out for you as you expected?", "score": 2, "replies": [{"body": "It was a 200% trade yea\n\nI also bought shares when it was still in the 900s as soon as I heard a split was on the table.", "score": 4, "replies": []}]}, {"body": "It's an AI play best believe it will shoot over $80", "score": 2, "replies": []}, {"body": "It does now…", "score": 1, "replies": []}]}, {"body": "Buy one. Record date for split is today. If you don’t own 10 or more shares or don’t hold a contract through today til next week. You will not get the 10:1! I got one I bought yesterday. Strike 1700 expires July 19th!", "score": 3, "replies": []}, {"body": "No, it doesn't lose anything, it is adjusted to make investors \"whole\". So there will be no difference. The strike and price will be adjusted but the option will become irregular and sometimes not easily traded.", "score": 6, "replies": [{"body": ">option will become irregular and sometimes not easily traded.\n\nYeah thats what I'm worried about. So the option does lose liquidity then?", "score": 3, "replies": [{"body": "Yes it will lose liquidity but not value (but this may not be the case with heavily traded underlying so don't take it as it happens all the time).", "score": 1, "replies": [{"body": "Given the risk of losing liquidity, isnt it most likely most traders are gonna sell their contracts by 12th July? I'm eyeing an AVGO dip at this point in time. But with the AI roar going on this week too, I'm not so certain if AVGO will really dip this time", "score": 2, "replies": [{"body": "It depends on your contract, strategy, DTE, delta, and whether you are long or short. If I have such an option (I sell options) and it is near the money and I do not want to be assigned and DTE less than 30 I close it and reopen after the split.", "score": 1, "replies": []}]}]}]}]}, {"body": "If it’s a 2–1 split the option is adjusted for price change and 2 contracts vs 1 is the result. If 3-1 split there would be 3 contracts etc", "score": 2, "replies": [{"body": "And the strikes are usually adjusted as well.", "score": 3, "replies": []}]}, {"body": "Absolutely not", "score": 2, "replies": []}, {"body": "Looking at it today... I hope you waited", "score": 2, "replies": [{"body": "nah I bought puts and rode the profits lol\n\nI dont know whether the sell off is coincidence or not. Anyway i'll be eyeing AVGO if it will rise back or not friday but part of me largely thinks not until Monday?", "score": 1, "replies": []}]}, {"body": "It’s neither true nor false.  The options will adjust with the split so that the trader does not gain or lose from the split.  From that point, the options will do whatever options do when reacting to the movement of the underlying.", "score": 0, "replies": []}, {"body": "The answer is you shouldn't even consider trading options until you educate yourself on the basics of how they work.", "score": -9, "replies": [{"body": "isn't that what he is doing by asking the question?", "score": 17, "replies": []}]}]}
{"title": "Reducing Port Size to Only Play Options?", "selftext": "Since starting to trade options, I've only used about 15% max of port even when loaded on contracts.\n\nYesterday, having enjoyed a celebration I drank, became impulsive and bought NVDA shares with the excuse it's to hold. I had mentally battled myself to not buy NVDA for days, wanting to wait for a real pull back if were to consider shares. I became emotional, impulsive and took unrealized losses today.\n\nI'm thinking of changing the environment to take control of the actions, reducing port size to only have funds available to trade options. There's no way I can continuously exert mental force to battle the nagging impulsive decisions. So eliminating the opportunity, changing the environment, reducing unused excess buying power seems only way to be safe won't act impulsively.\n\nHas anyone else reduced their port, reducing excess buying power to eliminate making impulsive purchases?", "id": "1e1104m", "created_utc": 1720735320.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 26, "comments": [{"body": "Leave this pursuit and seek professional help.  This ends badly.", "score": 6, "replies": [{"body": "I'm beating Spy for the year, I took a small position of shares, my unrealized loss is 2%, chill daddy", "score": -4, "replies": [{"body": "You would not be trading drunk and otherwise worried about your impulsive behavior if that were true.", "score": 4, "replies": [{"body": "Check my post history, I think the posts I've made explaining diagonal spreads and horizontal spreads speak for themselves. I'm up 25.18% for the year after checking right now.\n\nTomorrow's JPM earning's should push my $215 calendar and varying calls $220/$230 strikes expir. 12th, 19th, 26th - Should cover the NVDA shares loss. JPM I feel will announce a bullish stance after firing their head bear, or will mention AI as they have been, aside from reporting another beat.", "score": -1, "replies": []}, {"body": "[https://ibb.co/3FkDT4d](https://ibb.co/3FkDT4d) \\- Took a pic for ya", "score": -1, "replies": []}]}]}]}, {"body": "Take emotions out of this equation! You don’t want to be emotional when buying and selling options! That’s how you lose! Well I did that a few years ago! I took my emotions to new heights! Revenge trading! 😆-$15,000 I one day! Don’t be like me! 😆", "score": 1, "replies": [{"body": "We can't really control ourselves, just our environment which influences our decisions. I have to have margin to be able to open spreads but having excess buying power eventually anyone will buy something foolishly.\n\nIf I reduce my port size to just what I trade with options, I will have created a barrier to entry and changed the environment. I think this is what I'll do, then only withdraw after profit has been earned to xxx amount. With options we define risk, now I'm defining risk in my portfolio.", "score": 0, "replies": [{"body": "That’s the only way. Take profits as much and don’t look back at “I could’ve!”", "score": 1, "replies": []}]}]}, {"body": "What are your typical strategies?  Might be good to convert them to capital-intensive positions that tie up your liquidity (while paying interest, btw).  The reduced liquidity can slow you pretty good from making impulsive moves (designed to be a more expensive choice)", "score": 1, "replies": [{"body": "Calendars, lots and lots of calendars, horizontal spreads. Debt spreads as well but sparingly. Overnight Strangles on CPI days or big earning's which can move SPY. So cals, debt spreads, and strangles.\n\nI just went from 9 months ago just wheeling learning about options, to now understanding everything and just gathering data, gaining experience and putting into everything into practice to create my own systematic approaches. I'm like a mad scientist retesting what works and continuing trialing.\n\nMy problem was went from shares, going full margin, undefined risk, to options and defining risk. I have so much buying power now, I'm not using it and it's so tempting to buy NVDA shares with excuse am holding next decade but that's not trading and rather buy and hold which is upsetting. If I reduce port size by half I'd eliminate temptation and change my environment to make it boring so don't go trigger happy with NVDA shares again which already made me a lot this year. I would only buy NVDA shares because fundamentals are insane for next 2 years.", "score": 1, "replies": []}]}, {"body": "if you're trading more than 1 contract per trade and aren't already consistently profitable over long stretches, you're just kidding yourself.", "score": 0, "replies": [{"body": "[**https://ibb.co/3FkDT4d**](https://ibb.co/3FkDT4d) \\- 25.15% to be exact, NVDA cost me 2%, and paying for different options structure to trial and error has brought me down from 31%", "score": 1, "replies": [{"body": "nice. i've gotten a 32% ytd return on fbgrx by just coasting along.", "score": 1, "replies": [{"body": "I went from not trading, to wheeling SOFI, to buying calls/puts, to learning about spreads, to playing diagonal spreads, to ending up at cals which run for all reasons now. And strangles and debt spreads. I've spent a lot to learn a lot is how I take it. I'm just at the phase where it's all clicking and just now creating my own systematic approaches to events. I didn't know anything about options 9 months ago.", "score": 1, "replies": [{"body": "i wouldn't get too excited because this year has been an easy one for making money in the market with little effort or skill required.", "score": 1, "replies": [{"body": "I play for the downside in every trade nullifying risk, I take delta neutral trades so idk what you're on about I profit to the downside as well thanks. God, you're awfully negative and overly assuming because I showed weakness in one trade.", "score": 1, "replies": [{"body": "i'm just being realistic. you've done well in a relatively short amount of time, but so have many others with little to no experience trading by just being invested in index funds. thus far this simply hasn't been a challenging year as trading goes. but the knowledge you are building will hopefully serve you well when market conditions are not as favorable.", "score": 1, "replies": []}]}, {"body": "Like your fisker calls. Show us some profits big kahuna. Or it’s all online BS. \n\nYou don’t even understand liquidity or out the money. \n\nStop advising people fool.", "score": 1, "replies": []}]}]}]}]}, {"body": "Did you read what I wrote, I purchased shares, I had undefined risk, all my spreads have defined risk, and \"already consistently profitable over long stretches\", how do you that happens bud? By being unprofitable learning. I'm up 26% for the year after buying these shares so beating SP500 still.", "score": -1, "replies": [{"body": "if that were true you wouldn't be concerned about your impulsiveness.", "score": 1, "replies": [{"body": "Wtf LOL this cracks me up, yes I am and yes I was impulsive last night. I played NVDA from $95 to $139, biggest trade of the year. I told myself for days not to buy back-in and wait for the real pullback, am expecting the VIX to pump from where it's at and 5 day call/put ratio moving average is WAY too greedy right now. I caved and bought with the excuse am holding a decade. \n\nIt's not a bad buy, no point timing the market, just I cannot become the options trader I need to be making stupid long term decisions like this. Anyways, check my post history for calendars and diagonal spreads info, am not a noob and up 25.18% for the year.", "score": 1, "replies": [{"body": "with iv staying so low this year even noobs have been getting decent returns just trading 0dte spx. it's been one of those years so far where there haven't been too many bad choices.", "score": 1, "replies": [{"body": "I haven't traded 0dtes hardly at all. Cals work worse in low IV environment, so my bread and butter go-to structure is in hard mode this year compared to 2021. Guess am not taking the noob route.", "score": 1, "replies": [{"body": "you're still a noob because you haven't been tested yet under turbulent market conditions.", "score": 1, "replies": [{"body": "I profit to the downside in every trade and prepare for it. Neutral trades bud, I'm not very directional.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "Am I Crazy? (Buying AMZN)", "selftext": "Hello all I, 21 m, have a 105,000 portfolio. Most of it is in VTI. But 14000 of it is in VOO. I shouldn’t have bought both. So I’m selling VOO once I’m eligible for long term capital gains tax in December.\nI currently have 5,100 in AMZN’s individual stock. Would it be crazy if I just dumped that into AMZN every time Jeff Bezos sells some shares to just have 19% of my portfolio be Amazon?", "id": "1e0ffk5", "created_utc": 1720669213.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 27, "comments": [{"body": "amazon is not going anywhere, not point in trying to time the top or bottom and should just ride it out imo. But  you dont wan't to be so heavily invested in one stock. Might be better to just buy QQQ if you want to be in tech", "score": 23, "replies": []}, {"body": "21 years old, $105k portfolio? ...sheeze..", "score": 18, "replies": [{"body": "He started working hard with a lemonade stand at 7yo and transitioned to being a senior analytic at dad's company at 15. Add the regular $20 000 birthday money and you'll see how his \"hard work\" paid off. Only $105k spent on drugs and party so far so half is a net gain rofl", "score": 6, "replies": [{"body": "Lemonade stand was the front for the cocaine and hooker distribution network.", "score": 3, "replies": []}]}]}, {"body": "Amz is strong. buy in", "score": 33, "replies": []}, {"body": "Crazy? No. At least it's a very good company with a tremendous moat and excellent track record. You're not putting 19% of your portfolio in some sort of garbage ARKK-y AI name or something. \n\nIs AMZN some sort of underappreciated idea that isn't crowded? No.", "score": 6, "replies": [{"body": "Love the ARKK y comment 😂", "score": 1, "replies": []}]}, {"body": "In no way should you sell VOO to trade it for VTI.  You are taxed on gains, there is no reason to do this.  I have lots in VOO and VTI, it doesn't matter to have both.  There is no disadvantage in having both.  Yes, they overlap, but who cares.", "score": 2, "replies": [{"body": "I wouldn't buy both, but there's little point in converting one to the other", "score": 1, "replies": []}, {"body": "Yeah I know the overlap technically doesn’t matter but it would be nice to simplify it", "score": 1, "replies": []}]}, {"body": "I wouldn’t pay tax on voo to buy Amazon. Just use new money to buy if you’d like", "score": 3, "replies": [{"body": "Yeah I’ve reconsidered. I’m leaving it in VOO and investing into AMZN with every paycheck", "score": 3, "replies": [{"body": "Probably the best idea", "score": 3, "replies": []}]}]}, {"body": "Well here's your opportunity", "score": 2, "replies": []}, {"body": "Yes I think eBay and Etsy are about to shove Amazon to the side. /s", "score": 1, "replies": []}, {"body": "Why the f*** wouldn’t you buy Amazon at age 21?", "score": 0, "replies": []}, {"body": "Jeff bezos sells because he knows exactly that the stock will exceed its peak. I would be long for the next 2-3months if I where u", "score": -11, "replies": [{"body": "Why does he sell before it goes higher?", "score": -1, "replies": [{"body": "Because it is more profitable for him as an individual to deduct money shortly before ATH than, for example, in a consolidation or in a downward trend. I hardly or not at all noticed the sale of bezo’s in my portfolio & then directly again 200$\nBut it’s only my opinion", "score": -17, "replies": [{"body": "CEOs of big companies cannot sell their stock whenever they want. They have to announce  it  ahead of time (6+ months)", "score": 16, "replies": [{"body": "Yeah, that’s right", "score": -5, "replies": []}]}, {"body": "But why not just wait till ATH to sell? I’m still not getting it", "score": -5, "replies": [{"body": "He sold his shares exactly at $200", "score": 1, "replies": [{"body": "He announced the sale  a long time ago.", "score": 3, "replies": []}]}]}]}]}]}]}
{"title": "How to structure a portfolio at 18? ", "selftext": "I just turned 18 recently, and I’ve been getting into investing, trying to learn while also getting some hands on experience. \n\nInitially, I was being dumb and bought a ton of penny stocks like soundhound and just lost a bit of money, because I don’t have much money at my disposal. \n\nI currently have $1300 invested, and I know this is not much at all. However, I would like some advice to build off my current portfolio as I earn more money from working. \n\nI currently have: \n1 AMZN \n1 AAPL \n6 INTC \n10 RIVN \n1 HOOD \n2 SYM \n1 Tesla \nSome VOO \n\nI’m planning to invest about  $300 into crypto. \n\nI would like to humbly request advice on how I should change or fix my portfolio? Should I sell some, buy some more? Hold some? Thank you in advance ", "id": "1e0l80g", "created_utc": 1720692038.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 27, "comments": [{"body": "Do some reading over on r/bogleheads\n\nYou're at such an ideal age you will retire a multi millionaire if you follow the three fund portfolio principles starting now until your retirement", "score": 7, "replies": []}, {"body": "Get m1. 90% in voo and 10% for picks", "score": 3, "replies": []}, {"body": "First $10000 should go in an index fund. VOO is fine. You can have some exposure to crypto but I would stick to BTC only", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "God no. Leverage is horrible at a young age. They have the one advantage, time. Don’t waste it on a leverage stock, time is the last thing you want on those.", "score": 1, "replies": []}]}, {"body": "Keep buying VOO on regular intervals and skip the individual stock picking and crypto, or if you’re insistent on keeping those make them a much smaller portion of your portfolio, like 10%. Most people don’t beat the market and especially if you’re new stock to broad index funds while you’re learning", "score": 6, "replies": [{"body": "Would you recommend any other ETFs? QQQ perhaps?", "score": 1, "replies": [{"body": "If you’re bullish on tech QQQ is a good choice. Really any broad index fund is going to be better than what you have now… I’d look at that, VOO, VTI and VT none of which you can really go wrong with", "score": 1, "replies": []}]}]}, {"body": "If you're going to invest this early, which is good, then invest in ETFs like others are recommending. VOO or VTI would be my recommendation. \n\nFrom there, make sure other cash you can spare goes towards an emergency fund. 3-6 months worth in a HYSA. You should probably do this first before even investing in the ETFs but that's up to you.\n\nDown the line you can start messing with individual stocks.", "score": 2, "replies": []}, {"body": "So do your research of course, but I'll pass on the advice that I've found beneficial: \n1. Don't buy what Reddit tells you (haha)\n2. Read up on investing. You don't have to get it all at once, but some YouTube videos, some articles on basics here on reddit will do you some good.\n3. Ideally invest in things you understand/are familiar with (not trends...)\n4.***I have had the best gains in stocks in the $30ish cost range. Penny stocks are volatile and pricey stocks like what you've bought are already so far up there in price, you will be lucky to make money on those any time soon with limited funds to invest\n5. Follow people who know what they're doing and have already proven they know what they're doing\n6. ***diversify!!***\n7. Put a little in here and there. $25 bucks here, $150 bucks, buy ten of these, etc. Doesn't have to be a lot at once.\n8. Have patience.. plan to keep em a long time\n9. Sell the losers- people have differing opinions on what defines a loser, but you might pick a percentage loss and sell automatically when it hits that number. \n10. Keep a check on it but don't be stress watching it- it's just money :)", "score": 2, "replies": []}, {"body": "First 10k should go toward college tuition, and then  the next 10k should go into a high-interest savings account for emergencies. That's money you're never going to touch again, until you really really need it. In general, your ability to leverage your own earning potential is going to outweigh your ability to leverage stock growth for a while. \n\nOther than that, you should stay away from crypto and instead look at commodities like gold, silver and uranium. Or wheat, soybeans and rice, if you're into that. \n\nThe meme stocks are the ones that everyone's looking at right now, but the old wisdom about the gold rush of 1849 still holds true: don't go out there panning for gold, go out there and sell shovels. Invest in tool-makers and enablers, infrastructure and resources, and you more than likely will never go broke.", "score": 3, "replies": []}, {"body": "Decent looking tech portfolio. Not my style, but tech's been doing well lately and those are decent bets in the sector. Well ... except HOOD. Can't say I believe in HOOD.", "score": 1, "replies": []}, {"body": "I mean it’s only $300 of crypto so it’s not a big deal to just leave it there..  Don’t fuck wit penny stocks. Accumulate about $10,000 and then you can rip  into individual stocks. At your age, don’t waste your time or money with defensive stocks. They often return less than ETFs or almost the same..  stick to mostly tech stocks with elite management that give you the best opportunity for multi-baggers (of course there are exceptions like Costco)", "score": 1, "replies": []}, {"body": "50% in total market ETFs, 50% in individual stock picks.\n\nWhen your individual stock picks do worse over the next 12 months, do a 60-40 split for the following year.\n\nIf you do better with your individual picks than the ETFs perform, do a 40-60 split the following year.\n\nRepeat. \n\nI’m currently about 50-50 again \n\nEdit: **don’t buy crypto** buy $BTC", "score": 1, "replies": []}, {"body": "I think you should save for a house first. Doing so doesn't mean you're avoiding saving for retirement because the equity in the house does the same thing.. it's just investing in a \"sooner\" asset.\n\nDo a Roth IRA! When you want to purchase your first home you can withdrawal $10,000 of *earnings* without tax or penalty. You can also withdrawal your principal anytime. If I was your age, I'd go all in on a Roth.", "score": 1, "replies": [{"body": "What about a roth 401k? How much % would u contribute to that", "score": 1, "replies": [{"body": "With a Roth 401(k), you are limited to the investment options offered by your employer. IRAs let you steer the ship by choosing your own investments which means you pay no (or less) fees.\n\nIf you have to have a roth 401k, and you're young with stable income, contribute the max allowed or 15% of your income if you can, whichever is less.", "score": 1, "replies": []}]}]}, {"body": "r/investing is a good place for beginners to start. User friendly new guy advice across general investing questions and specific inquiries", "score": 1, "replies": []}, {"body": "Invest in ETFs boom diversified portfolio. VOO is good. I like SPMO and VONG too. SPY QQQ. SPYI if you want dividends", "score": 1, "replies": []}, {"body": "I'm 19 but I maxed out Roth with 90% into voo and the other 10% in index fund. Trade options with my other $ and losing😪", "score": 1, "replies": []}, {"body": "Buy some GOOGL.", "score": 1, "replies": []}, {"body": "I told my 18 year old to put 90% into $VOO and 10% into any individual stocks he likes", "score": 1, "replies": []}, {"body": "I'd recommend an aggressive growth ETF. You're very young so you have likely got a long timeline. You can buy a global growth ETF and then add IYW at maybe 20% of your holdings if you really like tech this much. Then just keep pulling as much of your money into it as you can. I have a small position in crypto too but that is an inflation hedge more than a growth investment.\n\nIndividual stocks are more easy to track but ultimately, mean that a single stock doing poorly, like Rivian for example, will have an oversized impact on your returns.", "score": 1, "replies": [{"body": "Thank you for your thoughtful advice and comment. Which ETFs would you recommend at this current moment?", "score": 1, "replies": []}]}, {"body": "No ones mentioned it but splg is just VOO with a lower expense ratio so it’s better", "score": 1, "replies": []}, {"body": "You can invest in crypto, you can buy it like bread... And sell it like sandwich, but let's not use invest and crypto together lol.", "score": -5, "replies": [{"body": "I understand, I apologize", "score": 1, "replies": []}]}]}
{"title": "The 8 \"secrets\" of when to sell stocks. Do you have any other ideas?", "selftext": "1. **Everyone makes mistakes. Just be sure to cut all losses short.** Even the best investors get hit with a loss from time to time. But they don't indulge in worry as the stock drops even further. They [cut their losses quickly](https://www.investors.com/how-to-invest/investors-corner/when-to-sell-growth-stocks-number-1-rule/) and move on. Leave your ego and pride at the door. Don't let a loss get to you — either mentally or financially.\n2. **If you don't sell too early, you'll sell too late.** To lock in solid gains, sell while your stock is still going up. As IBD founder William J. O'Neil has said, \"Your objective is to make and take significant gains and not get excited, optimistic, greedy, or emotionally carried away as your stock's advance gets stronger.\" Following the [20%-25% sell rule](https://www.investors.com/how-to-invest/investors-corner/how-to-build-long-term-profits-in-stocks-take-many-gains-at-20-25/) can help you do that. In a strong bull market, leading growth stocks like Nvidia, Meta, Microsoft and Apple can, of course, run longer than expected. But locking in some profits along the way allows investors to safeguard a portion of those gains, while still maintaining a position to take advantage of a continued run. It also reduces the risk of giving back too much in an extended pullback.\n3. **Have a sell plan in place** ***before*** **you buy.** The real drama kicks in when it comes time to sell. If you don't have sell rules and an exit plan, it's easy to freeze and not take action when needed. If your stock is soaring, you might get greedy and ignore certain sell signals and warning signs. Also, if you're sitting on a loss, you may do the \"hold and hope\" routine. You pray it bounces back — while it continues to drop. Stay grounded and keep your emotions at bay by having a selling plan in place ahead of time. Write down your target sell prices for both taking profits and cutting losses.\n4. **Don't let a decent gain turn into a loss.** If you have a nice gain of, say, 10%, 15% or more and the stock begins to decline, don't let that profit disappear completely. It's much less frustrating to see a 15%-20% gain turn into a 5%-10% profit than to see it turn into a 10% loss. You can always buy the stock back if it shows renewed strength and forms a proper [buy point](https://www.investors.com/how-to-invest/investors-corner/chart-reading-basics-how-a-buy-point-marks-a-time-of-opportunity/).\n5. **Don't marry your stocks. Just date them!** \"For better or for worse, for richer or for poorer\" is a noble and time-honored approach to marital fealty, but it's a bad idea when it comes to [investing in stocks](https://www.investors.com/how-to-invest/stock-investing-how-to-make-money-in-stock-3-key-factors). In most cases, it's better to take a good gain while you have it. And never hesitate to separate and protect yourself from a bad relationship if there are clear signs of trouble.\n6. **Sell your losing stocks first.** When building a winning basketball team, you wouldn't trade away all your top players for a bunch of benchwarmers. Yet many investors do just that. They sell stocks in which they have a good gain and hold those showing a loss. Further, they think a big gain is just around the corner. That's usually just wishful thinking. Do the opposite. Sell your losers and use that money — provided the [market trend](https://www.investors.com/how-to-invest/stock-market-timing-how-to-invest-in-stocks-tracking-bull-markets-bear-markets-stock-market-trends) is favorable — to add winners to your roster or invest more money in the top performers you already own.\n7. **When buying a stock, focus on both the fundamentals and the stock chart. When selling, focus on the chart.** They say the view is great at the top, and that often applies to stocks as well. The warning signs typically show up in the [stock chart](https://www.investors.com/how-to-invest/stock-charts-buying-stocks-using-technical-analysis) — i.e., [technical analysis](https://www.investors.com/how-to-invest/investors-corner/technical-analysis/) — before they appear in the company's fundamentals. It's crucial to use both technical and fundamental analysis when [buying stocks](https://www.investors.com/how-to-invest/how-to-buy-stocks-using-stock-lists-stock-ratings-stock-screener). The same is true on deciding when to sell stocks. Focus on the chart and technical analysis, like [price and volume](https://www.investors.com/how-to-invest/investors-corner/stock-chart-analysis-study-volume-in-bases/) action and behavior around key [moving averages](https://www.investors.com/how-to-invest/investors-corner/moving-averages-help-understand-stock-markets-direction-heres-how-to-use-them/).\n8. **The most important sell rule is to buy at the right time.** A very common mistake, particularly for [beginning investors](https://www.investors.com/how-to-invest/stock-investing-how-to-make-money-in-stock-3-key-factors), is buying at the wrong time. Some will not pay attention to [market timing](https://www.investors.com/how-to-invest/stock-market-timing-how-to-invest-in-stocks-tracking-bull-markets-bear-markets-stock-market-trends) and buy during a market correction when most stocks go down. Or they'll ignore the technical action in the [stock chart](https://www.investors.com/how-to-invest/stock-charts-buying-stocks-using-technical-analysis) and either buy too soon or too late. So before buying a stock, make sure [three key factors](https://www.investors.com/how-to-invest/stock-investing-how-to-make-money-in-stock-3-key-factors) — market trend, big earnings driven by something new, and institutional support — are in place. Doing so helps get you in at the right time, with the odds of success squarely in your favor.", "id": "1e0ra38", "created_utc": 1720710673.0, "score": 0, "upvote_ratio": 0.32, "num_comments": 20, "comments": [{"body": "**Congrats on using ChatGPT. Since you like your AI answers here is my low effort answer:**\n\n\n\n\nHere are additional pieces of advice and refinements to the existing ones to enhance your investment strategy:\n\nDiversify Your Portfolio: Avoid putting all your eggs in one basket. Diversifying across different sectors and asset classes can help mitigate risk and smooth out returns over time.\n\nStay Informed: Continuously educate yourself about the market, sectors of interest, and specific companies you invest in. Knowledge is power in investing, and staying updated can help you make informed decisions.\n\nUnderstand the Business: Invest in companies whose business models you understand. This allows you to better grasp their potential and the risks involved.\n\nSet Realistic Goals: Have clear, achievable investment goals based on your financial situation and risk tolerance. This helps you stay focused and avoid emotional decisions.\n\nRegularly Review Your Portfolio: Periodically assess your holdings to ensure they still align with your investment strategy and goals. This helps you stay on track and make adjustments as needed.\n\nWatch for Sector Rotation: Be aware that market leadership can shift from one sector to another. Stay agile and be prepared to adjust your portfolio accordingly.\n\nManage Taxes: Be mindful of the tax implications of your trades. Strategies like tax-loss harvesting can help you manage your tax bill more effectively.\n\nBe Patient: Successful investing often requires patience. Avoid the temptation to frequently buy and sell based on short-term market movements.\n\nHave an Emergency Fund: Ensure you have a cash reserve to cover unexpected expenses. This prevents you from having to liquidate investments at an inopportune time.\n\nLearn from Mistakes: Analyze your past trades, especially the unsuccessful ones. Understanding what went wrong can provide valuable lessons for future decisions.\n\nFollow a Consistent Investment Strategy: Whether it’s value investing, growth investing, or a hybrid approach, stick to a consistent strategy that aligns with your goals and risk tolerance.\n\nStay Disciplined: Emotions can cloud judgment. Stick to your plan and avoid making impulsive decisions based on market hype or fear.\n\nUtilize Dollar-Cost Averaging: This strategy involves investing a fixed amount of money at regular intervals, regardless of the market conditions. It reduces the impact of volatility and removes the guesswork of trying to time the market.\n\nKnow When to Take Profits: Set profit targets and stick to them. Taking profits at predefined levels ensures you lock in gains without getting greedy.\n\nUse Stop-Loss Orders: Implementing stop-loss orders can help you manage risk by automatically selling a stock if it falls to a certain price, protecting you from significant losses.\n\nFocus on Total Return: Consider both capital gains and dividends when evaluating the performance of an investment. A high dividend yield can provide steady income and reduce the reliance on capital gains alone.\n\nBy integrating these additional tips into your investment approach, you can create a more robust strategy that helps you navigate the complexities of the stock market more effectively.", "score": 21, "replies": []}, {"body": "9. Never sell", "score": 16, "replies": [{"body": "At least in my experience, maybe I choose bad stocks, but damn am I glad I sell. \n\n\nSold quite a few stocks at a 12-15% loss. Checked again yesterday and they're down 40-60% now. \n\n\nDon't sell the stable ones. But sell the ones that have poor financials early. ", "score": 3, "replies": [{"body": "💯\n\nfeels great selling a loser at 20%, checking back later and seeing it dropped even further.", "score": 1, "replies": []}, {"body": "Sounds like you should invest in index funds", "score": 0, "replies": []}]}, {"body": "who upvotes stupid shite like this", "score": 2, "replies": []}, {"body": "This is idiotic.   \nThe whole point is to sell eventually. Otherwise just go buy bonds.", "score": 1, "replies": [{"body": "Well, no shit. It’s a figure of speech that means don’t sell until you need the money in retirement.", "score": 1, "replies": []}]}]}, {"body": "So buy low and sell high?", "score": 3, "replies": [{"body": "buy high and sell higher.", "score": 3, "replies": []}]}, {"body": "If the company looks like it is going to implode (WBA for instance) I generally bail even if it is at a loss. \n\nIf I buy a stock with a dividend of say 4% and the stock explodes, and the dividend doesn’t keep up with the stock growth (say the dividend drops below 1%) I tend to at least sell off the value of what I put it into it in the first place. Functionally, I’ll take some profit but not close out of the stock. At the worst I can call it a slight reallocation.", "score": 2, "replies": []}, {"body": "Sell when guidance is lowered.", "score": 1, "replies": []}, {"body": "This all sounds like horrible advice. Whether a stock is up or down has very little to do with if you should actually sell it and people who go by that are just throwing darts at a board. \n\nYou don’t sell your home because someone offers you a lower price than you bought it for. \n\nIf the reason you bought the stock is still true, then why would you sell it? If anything, the value should look better to buy more. \n\nAnd trimming winners is the easiest way to cap all of your gains and never actually make any money. Think about it. If you sell every time you see a 25% gain, you would have missed out on the biggest booms in the last decade+ that could set you up for life. And every time you sell a winner, you have to go find somewhere else you think will be a better return! \n\n\nPeople get in their heads about being up or down, but, outside of tax harvesting, it’s all iterations of the sunk cost fallacy. You hold a stock if you think it will go up. You sell a stock if you think it will go down (or if you think there are better opportunities that offer larger potential gains and/or less risk).", "score": 1, "replies": []}, {"body": "Sell when the price drops bellow the 200 day moving average. If you believe in the company, buy back when it crosses it up.", "score": 1, "replies": []}, {"body": "Was this written by AI? Absolutely useless advice", "score": 1, "replies": [{"body": "This is far from useless advice, this advice comes from William Oneil and is used by all of the winners in the US investing championship.", "score": -1, "replies": []}]}, {"body": "i follow O Neil and Ive done well", "score": 1, "replies": []}, {"body": "Just call pelosi ", "score": 0, "replies": []}]}
{"title": "Periodic table of Sector Returns", "selftext": "Here’s a report I ran similar to Callan’s “Periodic Table of Asset Class returns” that looks at returns by S&P 500 Sector funds. I’ve been implementing this to wheel options on these funds based on relative performance. Mainly looking for sectors that have been oversold/underperforming for an extended period and selling CSPs closer to ATM hoping for longer term mean reversion. Of course you never know how long a sector will be depressed or how long a sector will be a top performer before it cools off (recent performance of XLK mainly driven by NVDA). Similar to indexes, these are broad basket ETFs so I’m ok holding them long term, they have decent liquidity and their price typically makes them easy to establish a position. It’s certainly interesting to see how some sectors rebound like financials (XLF) in late 2020 into 2021 or XLC which lagged all of 2022 and outperformed in 2023. I found it interesting, figured you all may as well. ", "id": "1e0oqni", "created_utc": 1720703874.0, "score": 63, "upvote_ratio": 0.87, "num_comments": 26, "comments": [{"body": "for anyone interested in the correlation of these:\n\nhttps://valuereports.economatica.com/correlation-analysis-via-the-sector-etfs/", "score": 8, "replies": [{"body": "Awesome, thank you!", "score": 1, "replies": []}]}, {"body": "This gave my eye cancer", "score": 22, "replies": []}, {"body": "Incomprehensible, why not just put the same tickers on one row and make the colors like a performance heat map?", "score": 10, "replies": [{"body": "Fair. I’m not claiming this is the best way to view the data. This is recreating the famous Callan Periodic table of Asset class returns but using S&P 500 sectors. I found it interesting and wanted to share. May not be for everyone and that’s ok too.", "score": 6, "replies": []}, {"body": "This is not abstract art?", "score": 3, "replies": []}, {"body": "[Here's an interactive version that I like](https://www.blackrock.com/corporate/insights/blackrock-investment-institute/interactive-charts/return-map). Doesn't really solve for the issue you called out but easier to freeze individual classes. They have a bunch of cool charts in that section of the site.", "score": 1, "replies": [{"body": "This is great thanks for sharing this. I wasn’t aware of an interactive version. \n\nTo share the inspiration for this…here is the link to annual report on asset classes ([https://www.callan.com/periodic-table/](https://www.callan.com/periodic-table/)). Thought it would be interesting to do it on S&P sectors.", "score": 1, "replies": []}]}]}, {"body": "Good ole energy, nice and volatile", "score": 3, "replies": [{"body": "Yep, fairly consistently rotating between the top and bottom performing sector the last 5 quarters. Seasonality definitely a factor in some of the moves.", "score": 3, "replies": [{"body": "It's the sector I play in the most. Almost entirely in a subsector of the energy sector. It treats me well. I recently did what WSB would call a yolo into a stock that had hit its near seasonal bottom and sold deep ITM puts for 6 months from now and use the premium to buy near ATM long dated calls.\n\nAlready up 30% on those puts and 50% on the calls. It moved way faster than I wanted as I wasn't done setting up my position when it started to rocket back up after hitting the recent bottom. Had I been able to fully position I would have been up another 10-20% on my portfolio. Made waaaay more doing this than I would have just buying and holding said stock and selling towards the top like I had been for the last few years.", "score": 4, "replies": [{"body": "Could you elaborate on this strategy?\nWhat stock are you currently trading with?", "score": 2, "replies": [{"body": "I'm trading UUUU. I opened my put position when it hit one of its recent bottoms at 5.6 a share. Currently it's pushing 6.7 a share. I sold 10 8P CSPs for ~2.4 per option (didn't have all the cash at once so it's staggered between 2.5 and 2.25). I then used the ~2400 in premium to buy 6Cs and 7Cs for September, Oct and January. The main reason I went with 8P over 7P is I needed that extra 1k in premium on a \"riskier\" position to buy more of the calls to be doubly long. Originally wanted to do 7P but the math wasn't matching for the legs I was opening up. Since the locked up money also gains interest it seemed good to me with current SPAXX rates. I've been trading UUUU for over 3 years now and have owned it well over $8 a share and am happy to have it at that price and sell calls on it should I get assigned but given it has a .50 premium on the ITM puts vs just selling the shares at its current strike I know it won't get exercised. All that would do for the put buyer is lock in a 500 dollar loss.\n\nUUUU typically bottoms out from April through June and hits its 52 week highs in November and starts getting choppy around February before repeating said cycle. It's spike up usually starts end of August early September while trading flat and slightly up from June to August. Its 52 week high is also usually over 8 a share with its recent ATH being iirc 11 or 12 a share back in 2021 or 2022. I did the same for another company called EU but the options are very illiquid and while it's in my favor it's not working how I wanted as well.\n\nIt's current spike up was fortuitous but not in my calculations because I didn't think the advance act would go through as quick as it did. Then there's the inflation numbers, kazataprom introducing a bigger tax on their uranium which is then processed by the Russians etc. making it all REALLY good for Canadian and US uranium miners.\n\nWas it the best way to make capital with options selling? God no. The stocks recommended here are better for that if you only care about the premiums and not about the underlying stock. My position is also insanely bullish because it's A.) buying calls and B.) selling fairly deep ITM CSPs. You don't open this kind of position unless you really know the company and know in your heart and mind it's at its lows and will rebound hard. But I went with UUUU because I know that company like the back of my hand and am extremely comfortable with owning it at whatever price I would be assigned. There's a few other stocks in the Uranium sector that likely would have been better to do this on but I like UUUU because it likes to sit in between 5 and 9 a share. The other companies aren't as predictable.", "score": 4, "replies": [{"body": "I also like to trade what I 'know'. I think switching too much between which equity you are trading just because some stock might go bullish is just to much of a time effort instead of playing (trading) with things you have done some deep digging into.\n\n  \nOther investments might work where one is not that well informed, but I rather play what I know and don't risk getting burned too quickly. - Had that happen to me more than once and since then, I stick to 'my' stuff.", "score": 2, "replies": [{"body": "Yeah that's what I've been re-affirming lately. Tried my hand in a different sector and barely knew anything about the company except that from what I could see it made sense, sold my options at a loss. Said options promptly 30xed in like 3 days.\n\nI'm over it but betting 700 bucks to realize a 400 dollar loss and then said position turns to 20,000 dollars really messes with your head. After that I went back into my sector and I'm staying there. The rest of the market can fuck off lol", "score": 2, "replies": [{"body": "That's messed up. Sometimes we do have some lessons to learn from wsb degenerates xD. Could have gotten a nice vacation by holding that trade longer.", "score": 2, "replies": [{"body": "Yeah, it was chewy. I had 9 27Cs for the week that it went ballistic off roaring kitty's tweet. I bought into it 2 weeks prior to the nuttiness because we get our pet stuff from chewy and I thought it was undervalued from the data and had a really really good earnings that to me wasn't fully priced into the shares yet since it's PS ratio was still below 1. When I bought it in did well for a few days but reversed HARD and I got spooked. Then it turned into a meme stocks so now I'm just staying away from it.\n\nBut yeah, got the contracts for ~85 a piece, sold em at a loss at 30 a piece because it was tanking, then it promptly ripped up to 200 a contract same day and when the tweet went out a few days later they capped at like 1100+ a contract. So not 20k but more like 11k.\n\nIt was the first time I'd ever sold out of a call position for a loss. Usually I ride for 50-100% profit or accept the full loss. This was the first time I tried being \"smart\" and it burned me hard. Will be going back to just letting em go at a profit or riding it into the ground.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Thank you, I like what you've done here.", "score": 2, "replies": [{"body": "Thanks, I was happy to share!", "score": 2, "replies": []}]}, {"body": "This is fantastic. Thanks for sharing.", "score": 2, "replies": [{"body": "Thanks, happy to do it!", "score": 1, "replies": []}]}, {"body": "This is a whole life insurance salesperson’s favorite tool. “Investing in the market is volatile and impossible to predict. Pay this insane premium and get a guaranteed dividend…return may vary”", "score": 2, "replies": []}, {"body": "I don't see anything wrong with the colors. It took a second to click in my head, but I choose the sector I'm interested in and I can easily see quarter over quarter where that sector performed compared to others.  There are definitely other ways to interpolate the data, but this way is fine.", "score": 2, "replies": []}, {"body": "How much lsd for this to make sense?", "score": 1, "replies": [{"body": "Go until you can hear colors, then it will all fall into place.", "score": 2, "replies": []}]}, {"body": "For me, there is no easy \"so what\" here, let alone a \"do this next\".\n\nNot my cup of visual tea, but good effort.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1e120wk", "created_utc": 1720738060.0, "score": 10, "upvote_ratio": 0.73, "num_comments": 26, "comments": [{"body": "If you want to get rid of the shares then weeklies. If you dont then 30+", "score": 32, "replies": [{"body": "Thats the answer.", "score": 3, "replies": []}, {"body": "This", "score": 5, "replies": []}, {"body": "With regard to rolling/closing the 30+ contracts, is the goal to always keep the contract 30-45 days out, or do you wait till  near the contract expiry and then look for something 30+ days out?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Weekly ATM will give awesome theta\n\nWeekly far OTM or deep ITM will be disastrous compared to monthlies", "score": 2, "replies": [{"body": ">Weekly ATM will give awesome theta\n\nIs that true for both high and low volatility situations?", "score": 2, "replies": [{"body": "ATM is ATM\n\n... but price moves and then you need to be able to adjust.", "score": 1, "replies": [{"body": "Fair enough. Would it be accurate to say that ATM weeklies are ideal for when the underlying trades sideways?", "score": 2, "replies": [{"body": "Sure. But if something trades sideways, that will be low IV. But sideways can mean being at same price or trading in a range. Find something that is in a range and that will eventually break out or break down but should work for a while. \n\nI personally am not afraid of break downs as I can buy. And if it breaks up, I can close and move on.", "score": 1, "replies": []}]}]}]}, {"body": "Hi man, wanted to ask-\n\ndisastrous in what way?\n\nSelling far OTM weekly call just seems irrelevant because you'll get almost no premium  \nSelling deep ITM weekly call is like already closing the position for the premium \n\nI guess that if the goal in mind is to make consistent income from selling calls, then both of these option just don't serve the goal (no premium/ getting rid of positions too quickly), but wanted to know what was in your mind", "score": 2, "replies": [{"body": "> Selling far OTM weekly call just seems irrelevant because you'll get almost no premium\n\nPrecisely\n\n> Selling deep ITM weekly call is like already closing the position for the premium\n\nBut same as above. Very little premium. \n\nSo why do it?\n\nDisaster did not mean \"margin call\" just did not make sense. And once in a while you will have that proverbial pennies in front of a road roller event.", "score": 2, "replies": []}]}]}]}, {"body": "There is no \"right\" strategy. There is only the right strategy for your goals.\n\nAnything on tsla can be a wild ride.\n\nSelling a monthly now will be better if the price settles lower and the premium drops. Selling weeklies could give you a chance to chase a higher strike price if things bounce and keep going back up.\n\nIf you know which way its gonna move, please let us know.", "score": 9, "replies": [{"body": "Yup. And if it craters to 100 and never recovers, the best play was selling a deep ITM LEAPS. \n\n\nBack testing shows 45 dte, manage at 21, is a good rule of thumb. Gets you a good amount of extrinsic, and you hop in the trade right as the extrinsic begans to disappear. But there are many individual scenarios where other expiries would be better.", "score": 2, "replies": [{"body": ">And if it craters to 100 and never recovers, the best play was selling a deep ITM LEAPS\n\nAm I missing something, or wouldn't that still lose money?\n\nThe call you sold would make a lot but the delta would be <1, whereas you're losing delta 1 on your shares position. So you're losing more on the shares than you gain on the covered call. \n\nAnd they're LEAPS, so theta decay isn't huge? Please correct me if I'm wrong somewhere", "score": 1, "replies": []}]}, {"body": "Exactly. This question basically boils down to - can anyone tell me how to predict the future  - that's a tough one for sure", "score": 1, "replies": []}]}, {"body": "Twice a year on TSLA there will be a massive spike or drop that will make you question everything you've learned to that point.", "score": 5, "replies": [{"body": "I've been thru this about 6 years = TWELVE times lol wtf TSLA", "score": 3, "replies": [{"body": "At this juncture TSLA has become a hedge against bear markets. Always moving in the opposite direction", "score": 2, "replies": []}]}]}, {"body": "Can’t help but I’m looking at the same,only with my 275s. Ouch", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Is 60% profit the sweet spot?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes makes sense", "score": 1, "replies": []}]}]}]}, {"body": "I usually sell between 2 weeks out and about 45 days out, but it doesn't matter because lately I've had to roll my calls daily up and out, so now I'm out in between September and June 2025.", "score": 2, "replies": []}, {"body": "Theta decay accelerates at around 30 days. If you are looking to cash in on theta, that's the time frame. But sometimes you will get caught by large movements by the underlying.", "score": 2, "replies": []}, {"body": "Everybody's cash level and risk tolerance is different, therefore their strategy. I have been doing the Wheel Strategy for almost two years, and my strategy is to sell the assigned CC with strike price >= the assigned put strike price, in your case, $252.5. The premium should be at least 1% of the strike price, so that's $2.5. With these two constraints, I then pick the closest expiration date. \n\nFrom my data, you could sell $252.5 on 07/19, with premium $4.4. That's pretty good in my view. You have earned the put premium (?) + the call premium $4.4. \n\nOr you could push one week later, since the next week is earnings. Then you are looking at $252.5 on 07/26, with premium $10.75. Hopefully TSLA doesn't drop too much or doesn't rise too much. LOL", "score": 2, "replies": []}, {"body": "One of the things I look at in deciding what duration to sell post-assignment is capital preservation.\n\nA cap preservation covered call looks to sell a call in the shortest duration that will result in a break even at or below where the underlying is currently trading.  With TSLA finishing the day at 241.03 (it went even lower AH), I would first shop for a call at or above the 252.5 strike that pays ***at least*** the difference between your short put strike (252.5) and current price (241.03) or 11.47.  The August 16th 255 (there is no 252.5 in August) would fit the bill, paying 13.95 at the mid.  Your resulting break even would be the 252.5 - 13.95 or 238.55 relative to today's close of 241.03 with a max of 16.45 (the diff between your short call strike and your break even).\n\nYou can also look at selling the August 16th 245 strike for 17.90, with a resulting break even of 252.5 - 17.90 or 234.60, 10.40 max; the August 16th 235 strike for 22.55 with a resulting break even of 252.50 - 22.55 or 229.95 or 5.05 max; or the August 16th 230 strike for 25.30 with a resulting break even of 227.2, 2.80 max.\n\nJust me, but with such a non-ideal entry, I'd be looking to bail out of the trade as soon as possible, so would probably lean toward the selling the August 16th 230 and then go from there ... .", "score": 2, "replies": []}, {"body": "I sell weekly mainly but depends for me overall market condition as well, when it’s a super Green Day and a stock is over bought then I’ll sell close to the stock price(hoping for a pullback) and buy back around 50 percent profit but if it been sideways and I don’t see any upside movement then I’ll do monthly, when it comes to Greeks personally to me it differs from other options traders so I really don’t want to give my input on that since everyone has a different perspective on it but for me it’s been working fine how I been trading", "score": 1, "replies": []}]}
{"title": "Big Tech has had its run now its time for Bio...Tech", "selftext": "Traditional tech has had its moment in the spotlight but i think the next leg up or the next area of astronomical growth and benefit from AI is the Biotech, pharma and healthcare space.\n\nImagine having a research partner that never sleeps, eats or takes breaks. Just crunching and analyzing data all day and night at warp speed. I think in the coming months/years we will see a revolution in drug discovery and development, personalized medicine, personalized genomic data analysis, more efficient clinical trials, better imaging and diagnosis, more efficient lab work and processing of results faster. Cant wait to see all the new product releases that will come from the space as a whole.\n\nIts a bit hard to pick the winners like Eli Lilly, its almost like a lottery given the number of Biotech companies out there. You can either buy the sector or pick individual names. My bet is on Pfizer and BioNTech for a cancer cure. They have alot of great stuff in the pipeline. Specifically Pfizer's acquisition of Seagen will give them a significant lead in the space. Its a golden goose. If GLP-1 drugs are worth billions what would a cure for cancer be worth? Its priceless.", "id": "1e0bge1", "created_utc": 1720657175.0, "score": 5, "upvote_ratio": 0.56, "num_comments": 35, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 1006 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "No thanks, I'm sticking with megacap American tech.\n\nAapl, nvda, msft, amd, googl, vgt for emergency fund", "score": 21, "replies": [{"body": "Good idea", "score": 3, "replies": []}]}, {"body": "I think you’re looking at it wrong, we will see interest rate cuts by this fall. That’s a huge trigger for a number of stocks currently on sale.", "score": 8, "replies": [{"body": "Positive trigger?", "score": 2, "replies": [{"body": "Most definitely", "score": 4, "replies": []}]}]}, {"body": "[My spouse and I are both in biotech]\n\nWithout a doubt, your premise is correct. However, there is a time component.\n\nAI and chips can be implemented and generate returns more or less instantly. For most conditions, a drug discovered this year wouldn't be approved for minimum 3-5 and in many cases more (eg neurodegenerative diseases, which are probably the biggest unmet need save maybe cancer, probably looking at 5-7 years). \n\nEssentially, there will likely be more drugs tested in clinical trials. But you cannot assume that \"AI\" is hoping to be any good at it. Many will fail. Maybe they'll all fail. My guess is the % of successful trials goes up somewhat, driven mostly by biomarkers and precision medicine. What it doesn't mean is that an approved treatment developed with \"AI\" is going to suddenly be with more than a \"non-AI\" drug.\n\nPerhaps someone develops a pipeline that gets really good results. THAT is the kind of scenario that would be required to actually augment the value of the company. But you would need to see a track record to be confident this pipeline would continue to produce. Which would take many approvals and many years. Essentially, this cannot be scaled quickly.\n\nTLDR: the likely impact is more smaller biotechs with more opportunities for success. Which also means more opportunities for failure.", "score": 7, "replies": [{"body": "Alphafold and such may be getting extremely powerfull tho, with more computing power. So powerful we gonna understand 10x more about enzymatic pathaways, bring us up to solid 10%", "score": 0, "replies": [{"body": "I'm not sure what you're trying to say", "score": 1, "replies": [{"body": "10% of understanding of human enzymatic pathways. A joke you should understand youreslf tbh, a little sus you dont", "score": 0, "replies": [{"body": "Lol ok, cool joke\n\nIn any case, my response above stands", "score": 1, "replies": [{"body": "And my anwser stands too. It was a joke. Btw do you know what is the proper guesstimate for those numbers?", "score": 0, "replies": [{"body": "I'm not sure why you're so upset I didn't specifically call out alpha-fold, but ok", "score": 1, "replies": [{"body": "Even more sus. Whats the guesstimate?", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Nah, both will be fine.", "score": 5, "replies": []}, {"body": "No, all yours.", "score": 4, "replies": []}, {"body": "This sounds fucking boring. Nah", "score": 3, "replies": []}, {"body": "$CMPS", "score": 2, "replies": []}, {"body": "NANOMACHINES SON?!", "score": 2, "replies": [{"body": "Memes, the DNA of the soul.", "score": 2, "replies": []}]}, {"body": "You’re going to have to stop referring to it as Big Tech before it ceases to be that.", "score": 2, "replies": []}, {"body": "VRNA just recently received FDA approval for ensifentrine, a new treatment for COPD, and is starting to pick up momentum. It closed at $17.93 today with an analyst consensus of $35.60. IV was crushed after approval, so you can buy call options much more cheaply than a month ago. I have a position.", "score": 2, "replies": []}, {"body": "Biotech stocks behave like 0DTE options", "score": 2, "replies": []}, {"body": "OP is right. It's time to invest heavily in biotech.\n\nThe future of biotech will be dominated by the use of AI.\n\nTherefore, calls on NVDA.", "score": 2, "replies": []}, {"body": "I'm a doctor (so pretty smart compared to you regards). AI is far from being that useful in drug discovery (biotech/pharma). \n\n  \nThe process from early basic (fundamental) research to development (clinical trials and manufacturing) is extremely laborious and very manual, and very human capital reliant. \n\n\n\nMost labs are still not very automated requiring a lot of lab techs to runt he experiments for the early discovery.\n\nOnce you're in clinical trials, the process is burdened with paper work and physical documentation. Again very labour intensive requiring huge teams of PMs, CTMs, CRAs, CRCs, nurses, and PIs/MMs (doctors). \n\nThe actual evaluation of the efficacy (\"biological and physiological effectiveness\") of the drug is likewise just as labour intensive, requiring a lot of laboratory work at CRO labs (labs that specialize in analyzing patient samples such as cancer tumor biopsies etc.) as well as a very labour intensive effort in India for the packaging of results i.e. data management i.e. doing the NEEDFUL.\n\n  \nThe biotech and pharma space is NOT scalable.", "score": 2, "replies": []}, {"body": "LABU #1", "score": 2, "replies": []}, {"body": "Lol….. yea probably not", "score": 3, "replies": []}, {"body": "Immatics N.V. , $IMTX", "score": 1, "replies": []}, {"body": "No, Biotech can not do magic like BIG Tech. Don't touch Biotech.", "score": 1, "replies": []}, {"body": "I'm not reading past that title. No.", "score": 1, "replies": []}]}
{"title": "Anyone else have SoundHound AI (SOUN) in their holdings or as a call/going long?", "selftext": "I have around 3.8k+ shares of SOUN in my Roth 401(k) brokerage account.  My dca is $4.52/share.  My account saw a jump today.  \n\nDoes anyone else have a call or holdings in this stonk?  I picked it up once I learned that NVIDIA has a small stake in the company disclosed at the beginning of the year.  \n\nThey just paid off all of their debt a couple weeks ago and had a huge deal go public today with Stellantis on their Peugeot, Opal, and Vauxhall vehicle lines in Europe.  \n\nThis one is going to the moon (in a couple years, of course).", "id": "1e0c3ot", "created_utc": 1720659027.0, "score": 12, "upvote_ratio": 0.75, "num_comments": 40, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 467 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "What a shitty company they have, calls it is.", "score": 12, "replies": [{"body": "Get it, good sir!", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)", "score": 3, "replies": []}]}, {"body": "why do you think it’s a shit company?", "score": 3, "replies": [{"body": "No product or actual revenue growth it’s an AI sham. Too much hype too little performance", "score": 3, "replies": [{"body": "I feel you, I put a lil too much money in a 6 dollar call and this morning has me stressed 🫡", "score": 3, "replies": [{"body": "Good luck.", "score": 3, "replies": []}, {"body": "$6.28 after market close today. When does it expire?", "score": 2, "replies": [{"body": "well i sold at .65 for 5 contracts and .95 the other 5 i was able to make 100 bucks nothing much but i have a smaller portfolio compared to most here. It expired 8/16 but i didnt mean to even buy it in the first place.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I have 300 shares. May buy another 100-200 on the dip next week", "score": 7, "replies": [{"body": "Nice.", "score": 2, "replies": []}]}, {"body": "This stinks like a P&D. Good luck if it isn’t but half you cucks don’t even post in the sub", "score": 7, "replies": []}, {"body": "I have 1000 shares. Strap in Alice! We are going to the moon!", "score": 5, "replies": [{"body": "To the moon!", "score": 2, "replies": []}]}, {"body": "took profits and ![img](emote|t5_2th52|31226)", "score": 5, "replies": []}, {"body": "It was too soon for me before, but I’ve watchlisted it. (Tbh won’t likely invest because trying to achieve a bit of balance.)", "score": 3, "replies": [{"body": "It looks very promising and it seems mostly good news this year.", "score": 4, "replies": [{"body": "I hear you, and agree. But most of my holdings are tech or speculative or crypto related. And that’s great for concentration, but, I feel like I need to learn the other side some. It’s actually too of watchlist, but I added to RXRX after Nvidia declared an interest, for example. And just this evening set limit sells on failing for now speculation (mostly pharma though.)\n\nI think you’ll do well! \n\n(Something crazy happened today. I liked a company that had great growth metrics, like, ridiculous. Had purchased some tracking shares and a couple of calls and it blew up on some government contract news. So, I want to stay between the next best and the forgotten, a bit. And again, focus on balance and some shares.)", "score": 4, "replies": []}]}]}, {"body": "Yeah, shout-out to whoever bought my $4 7/12 covered calls lol", "score": 2, "replies": [{"body": "Roll it up and out and buy back on the dip next week", "score": 3, "replies": []}]}, {"body": "Jan 2025 calls. strike? well that's a Secret.", "score": 2, "replies": []}, {"body": "SOUN just broke the wall after the CFO conference call and isvrynning", "score": 2, "replies": [{"body": "Yeah, buddy!  Now I have about 6,500 shares in my Roth 401(k) brokerage at $4.54/share dca.  Here we go!  I have been leveling up since I made this earlier post.", "score": 1, "replies": []}]}, {"body": "Is having NVDA like the same thing?", "score": 1, "replies": [{"body": "Not really, but they are in tech and an AI play.", "score": 2, "replies": [{"body": "NVDA owns how much of them?", "score": 2, "replies": [{"body": "1.7 million shares: [https://finance.yahoo.com/news/nvidia-owns-stake-soundhound-ai-192550664.html](https://finance.yahoo.com/news/nvidia-owns-stake-soundhound-ai-192550664.html)", "score": 6, "replies": []}]}]}]}, {"body": "I got 200 at around $8. Waiting for the turnaround.", "score": 1, "replies": []}, {"body": "Randomly bought some yesterday and was a good idea. I’m down all time so wanted to make some money back. Overall, this is a terribly immoral and awful company that preys on marginalized communities. I’m not sure it will do well.", "score": 1, "replies": [{"body": "How so?  Do you have an article that talks about it?", "score": 3, "replies": []}]}, {"body": "I’ve got 2800 shares of big bear instead.", "score": 0, "replies": []}]}
{"title": "TSLA Recover", "selftext": "Experienced huge loss since April 22 all time low. \n\nManaged to recover the loss as a whole. \n\nMid day recovered all losses from original investment\n\nShould I hold these Calls?\n", "id": "1e0i65z", "created_utc": 1720679229.0, "score": 12, "upvote_ratio": 0.73, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "**NVDA 270 Call**", "score": 15, "replies": [{"body": "🤣", "score": 5, "replies": []}, {"body": "Thank you!! This is all I could see in the post.", "score": 4, "replies": []}]}, {"body": "You've recovered your losses, I'd take the profits or potentially face more losses. Would you buy Tesla at it's current price after such a run?", "score": 4, "replies": [{"body": "Odds he sold ?", "score": 1, "replies": [{"body": "Yeesh I forgot about this post ![img](emote|t5_2th52|4640)", "score": 1, "replies": []}]}]}, {"body": "This is enough. Puts on Telsa.", "score": 3, "replies": [{"body": "you up for sure", "score": 2, "replies": []}]}, {"body": "How do you compare two dates on RH like that? I've always been annoyed I couldn't", "score": 2, "replies": [{"body": "Use two fingers.", "score": 1, "replies": [{"body": "Yeah I've tried, must not be programmed into android", "score": 2, "replies": []}]}]}, {"body": "tell me you sold those calls.", "score": 2, "replies": []}, {"body": "Line goes up", "score": 1, "replies": []}]}
{"title": "NVDA versus INTC ( some thoughts to conclude this )", "selftext": "from last quarters cc Patrick Gelsinger \"Yeah. And Gaudi 3 announcement this quarter extremely well-received. And as I mentioned already, 20-plus customers for Gaudi 2, 3, so we're seeing that build. Obviously, Falcon Shores will build on that momentum. We'll be bringing that late next year when Falcon Shores, when we combine the great systolic performance of Gaudi 3 with a fully programmable architecture and all of that comes together with Falcon Shores. And then we have a rich, a very aggressive cadence of Falcon Shores products following that. We also added the Gaudi 3 PC IE card to it, this use case of Xeon plus an accelerator or Gaudi accelerator is getting very good response from customers as well. So we'll be bringing that out later this year. But the real story is delivering the TCO value, delivering the enterprise use cases. On Falcon Shores, we'll just build on the momentum that we're establishing with Gaudi 2 and 3. \"\n\n\"\" Intel's management stated that Gaudi 3 delivers a 50% on average better inference and 40% on average better power efficiency than Nvidia H100.\"\n\n  \nto conclude this for now I look at Nvdia valuations, and i see high multiples attached to a company with a concentrated customer base whereby the bulk of their revenus comes from four customers using old slow h100 chips amd the ceo is dumping shares at what appears to be a bubble I look at Intel, who just launched the Gaudi 3 and already has.20 customers, and the chip outperforms the h100 . Then, I look at the multiples and see it's undervalued, and the insiders are buying shares . this is a shift in paradigms, and I, for one, will not be on the wrong side of this .\"\n\nat a minimum, keep your NVDA and add INTC\n\n  \n", "id": "1e0o3da", "created_utc": 1720701962.0, "score": 17, "upvote_ratio": 0.73, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 113 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1e04m2x/intel_and_why_it_is_now_rising/) \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 34, "replies": [{"body": "Yes! Past performance is so gay so how could it get gayer?", "score": 2, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "By the time INTC catches up there will be a glut on the market and prices will drop. Loss of pricing power leads to lower earnings.", "score": 2, "replies": []}]}]}, {"body": "Our chip we developed today is better than a chip nvidia developed 5 years ago ![img](emote|t5_2th52|4271)", "score": 20, "replies": []}, {"body": "This guy is going places!", "score": 3, "replies": [{"body": "LOL, i am always somewhere for sure. \n\nwhen INTC was under 30 i got called regarded for saying i was going in because it didn't make sense.\n\nI will stay regarded for a long time because i just don't see how one can ignore INTC", "score": 1, "replies": []}]}, {"body": "Not sure how fast it will happen, but when the new foundry starts delivering in 2025, intc has nowhere to go but up", "score": 8, "replies": [{"body": "[sorry brother](https://www.nbc4i.com/intel-in-ohio/report-confirms-delayed-timeline-for-intel-facility-in-new-albany/)", "score": 1, "replies": []}]}, {"body": "Intel is trash... Y'all have to stop this", "score": 8, "replies": []}, {"body": "Cant wait for Falcon Shores to be a huge success just like ~~Ponte Vecchio~~ and ~~Rialto Bridge~~", "score": 2, "replies": []}, {"body": "Google “Pat Gelsinger rearview mirror”", "score": 2, "replies": []}, {"body": "this entire analysis is under the assumptions NVDA isn't developing too? \"CEO said this so it must be true.\" If the product was actually better, you would see it reflected in sales/revenue... NVDA already has new chips ready to go next year that will blow everything existing product out of the water. H100 came out in what like march of last year. You are regarded if you think INTC has a competitive advantage in this space.", "score": 3, "replies": []}, {"body": "I hope the 15th gen CPUs are better than the trash they have churned out in the past decade, it's about time they catch up (at the very least).", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "Nothing goes together better than INTC and Low 30s", "score": 1, "replies": []}]}
{"title": "Should Apple pay a one-time dividend of $10 per share?", "selftext": "Apple has been more into buybacks than dividends, and I gotta say it seems to have worked really well over the past couple of years. But now with a Market Cap of 3.5 Trillion, is even the huge $110 billion in buybacks they announced recently going to make a dent at all? How about a one time dividend for their loyal shareholders?\n\n", "id": "1e0v8x1", "created_utc": 1720720706.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Why would you want to pay taxes on gains instead of just keeping the gains?", "score": 64, "replies": [{"body": "This", "score": 7, "replies": []}, {"body": "Do you pay taxes on drip?", "score": 1, "replies": [{"body": "Yes..", "score": 9, "replies": [{"body": "Fair enough, I only invest through a Roth so I never pay attention.", "score": 1, "replies": []}]}]}]}, {"body": "That’s a 3% buyback, pretty big. You don’t pay tax on that, whereas dividends you do.", "score": 18, "replies": []}, {"body": "Google Apple public float, then get that number and multiply it by 10, that's how much money they'd be giving out, and how much the market cap would tank. Zero reason for this. With the growth it has it's better to leave it as is and people can pull money out at their discretion. For most common shareholders, that 10$ per share will be a few hundreds or a few thousands at best.", "score": 5, "replies": []}, {"body": "As an investor I couldn't give less of a shit about the tiny dividends some mag 7 stocks give, or could give. \n\nI buy dividend stocks for dividends, and growth stocks for growth. Getting $10 - $60 / year from a dividend on a Mag 7 stock means nothing to me.", "score": 7, "replies": [{"body": "Would a high yield savings account serve the same purpose at 5% vs a dividend stock?", "score": 2, "replies": [{"body": "Except you can get growth of the initial investment from the stock itself, especially as currency continues to lose it's value. $1 today isn't $1 tomorrow.\n\nFor example I get 4% from SU but I'm also up 20% on my investment in a year or so.", "score": 2, "replies": [{"body": "Right…but let’s say it drops, your dividend is roughly the same and overall value could be minus 30%…\nWhere as a high yield would be a zero risk guarantee 5%.\n\nIs this pretty accurate?\nThanks.", "score": 1, "replies": [{"body": "Yes. Hysa will get you surefire gains and be protected up to 250k if they're FDIC, while a dividend stock is indeed a risk.", "score": 2, "replies": []}, {"body": "yup, you're correct. the only thing that is missing is the true value of a dollar. as currency continually is debased and is losing value assets go up at an inflationary clip. So if you have $1 in the bank in 2020 it's worth more than that $1 in 2024.\n\nPersonally 4% is my lowest dividend. I usually opt for around 7%. You can't get savings accounts that high. \n\nBut you're 100% correct, with a stock there is a risk your investment will lose value. That's why I'm super picky with my dividend stocks and only go for good companies I believe will increase share price on. Typically a blue chip dividend stock will at least retain it's value since they are used so religiously for passive income.", "score": 2, "replies": []}]}]}]}]}, {"body": "![img](emote|t5_2th52|4259)", "score": 3, "replies": []}, {"body": "Buybacks are more efficient but apple shouldn’t be buying back shares at these prices.", "score": 4, "replies": [{"body": "This was my point with a 3.5 Tril Market cap those buybacks will barely make a dent.", "score": -6, "replies": [{"body": "Yeah that’s not relevant.", "score": 1, "replies": []}]}]}, {"body": "No", "score": 2, "replies": []}, {"body": "No.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "The buybacks are nothing more than a cynical plan to stop the stock price falling, Apple has already spent $645B on stock buybacks in the last decade.", "score": 1, "replies": []}, {"body": "No I don’t want $10. Keep the stock going up!", "score": 1, "replies": []}, {"body": "Sure, why not $100?\n\n  \n/s", "score": 1, "replies": []}, {"body": "The point of a buyback is NOT to provied buypressure to drive the stock uppwards.\n\nIts to buy back shares and then destroy them to cause the total amount of shares to decrease wich means that each shares increases in value", "score": 1, "replies": []}, {"body": "Lol. You want to give uncle Sam 30% of the gains?", "score": 0, "replies": [{"body": "Maximum tax bracket for dividends is like 23% bro 😂", "score": -2, "replies": [{"body": "Bro, read:\n\nhttps://preview.redd.it/55sql89fvxbd1.jpeg?width=1179&format=pjpg&auto=webp&s=c38c19154bf51c57fcd6b37580926a38daaf847f", "score": 4, "replies": [{"body": "Forgot about state taxes lmao, can’t believe state tax exists after the federal dildo takes a third up front.", "score": 0, "replies": []}]}]}]}]}
{"title": "Think about INTC in this context", "selftext": "\"Think about INTC in this context:\n\nIt puts more net income on the bottom line in one quarter than AMD does in three quarters, and it spends as much on R&D as AMD and NVDA combined and builds foundries as well - yet remains highly profitable.\n\nNow when that capx stops- INTC will be exponentially more profitable and today trades at 1/2 the market cap of AMD\n\nIntel is the most promising semiconductor in the market today and remains severely underappreciated\n\n\n\nIt has been mispriced and misunderstood .\n\n\n\nMelius just referred to it as the 2nd half ai catch up trade. \"\n\n(The above was borrowed from someone i thought made an excellent point so i shared it for a final thought about INTEL and its current state of play \n\nP.S. i personally think INTC will trade higher than AMD in market cap and share price once this company is understood better .", "id": "1e0wcfi", "created_utc": 1720723493.0, "score": 21, "upvote_ratio": 0.7, "num_comments": 34, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 116 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1e04m2x/intel_and_why_it_is_now_rising/) [x](https://www.reddit.com/r/wallstreetbets/comments/1e0wcfi/think_about_intc_in_this_context/) \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Fellow bag holder here, though barely. $36 average price. Going to hold for the long run.", "score": 11, "replies": [{"body": "Just bought 90 shares last week at $31 holding for the long haul as well", "score": 8, "replies": []}]}, {"body": "Idk how to feel about Intel. On one hand it’s terribly mismanaged, hasn’t grown in share value in forever, and behind Nvidia and AMD; but the government is splashing some money. I think it’s probably a long-term 5+ year hold.", "score": 10, "replies": [{"body": "I guess 5 years ago there also were people thinking the same\n\nhttps://preview.redd.it/ngyu3ix9oybd1.png?width=1080&format=pjpg&auto=webp&s=d33ed565e14facf4a599766fa799ab0b4b317446", "score": 17, "replies": []}, {"body": "2023 revenue also down 14% from 2022", "score": 5, "replies": []}]}, {"body": "Intel is a good company. Their stock is shit. I don't know why and don't care to find out. Dozens of companies are making huge swings every day and you can get in on the fun or wait anything from a month to 10 years for Intel to stop trading sideways.", "score": 18, "replies": [{"body": "Yeah; I like Intel but don’t have the patience for it.  2 years to gain 10%; might as well buy the index at that point.", "score": 6, "replies": []}]}, {"body": "I bought 20 39 10/18 calls at the beginning of may and was almost excited these past few days before this morning. I also bought 20 260 and 10 255 7/26 fdx puts because some guy posted pictures of its chart zoomed out.  Totally looked like it should dip again by the end of the month. I’m regarded but happy 😃", "score": 6, "replies": []}, {"body": "From last quarters earnings report \n\n“We are making steady progress against our priorities and delivered a solid quarter,” said Pat Gelsinger, Intel CEO. “Strong innovation across our client, edge and data center portfolios drove double-digit revenue growth in Intel Products. With Intel 3 in high-volume production, leading-edge semiconductors are being manufactured in the U.S. for the first time in almost a decade and we are on track to regain process leadership next year as we grow Intel Foundry. We are confident in our plans to drive sequential growth throughout the year as we accelerate our AI solutions and maintain our relentless focus on execution, operational discipline and shareholder value creation in a dynamic market.”\n\n“Q1 revenue was in line with our expectations and we delivered non-GAAP EPS above our guidance, driven by better-than-expected gross margins and strong expense discipline,” said David Zinsner, Intel CFO. \"Our new foundry operating model, which provides greater transparency and accountability, is already driving better decision-making across the business. Looking ahead, we expect to deliver year-over-year revenue and non-GAAP EPS growth in fiscal year 2024, including roughly 200 basis points of full-year gross margin improvement.”\n\n  \ni am bullish on INTC ( obviously ) but i consider myself to have done my research .\n\n  \nWe are now up 4 points since post earnings dip and just now getting play \n\n  \nI would not be surprised if we lead the second half", "score": 5, "replies": [{"body": "wud be nice if so", "score": 1, "replies": []}]}, {"body": "INTC is probably where it should be. AMD NVDA totally overpriced.", "score": 8, "replies": [{"body": "The opposite.  NVDA and AMD have more growth potential in short term.  Intel is very long term", "score": 4, "replies": [{"body": "I wouldn’t say very long term. It’s like 2 years max from kicking ass. ", "score": 1, "replies": []}]}, {"body": "Just looking at the earnings of these companies people will understand. But I think the people of WSB aren‘t here because of that. You can make fast Money with hype. And those companies enjoy the most hype.", "score": 3, "replies": []}]}, {"body": "Intel is interesting because it's been through multiple boom bust cycles. It's a big tech company but it's got the institutional muscle memory to keep from sloshing effort around internally like some of the younger big tech companies. Meta for instance is throwing everyone it can at AI, but there's a long term consequence to that. Underfunding traditional investments and over focusing on hype forms the backside risk. NVIDIA is focused on depth, Intel is focused on breadth, and id wager that is going to pay off big time in the long term. INTC is a ten bagger if you can hold it for long enough.", "score": 2, "replies": []}, {"body": "INTC is up 3.27% ATM. I think their recent chatter about foundries, software and AI initiatives is helping.", "score": 2, "replies": []}, {"body": "I'm in", "score": 2, "replies": [{"body": "INTC had a great day with lots of buyers, and we will go higher Would love to see a string of 1% to 2% daily gains . In an ugly market, we are doing well", "score": 1, "replies": []}]}, {"body": "Day 1: “Please buy intel. It’s good”\n\nDay 2: “yall missing multibagger- InTC”\n\nDay 5: “At least say say “I’ll buy Intc. InTC is good” \n“please”\n\n\nSeveral years later: “muh bags!! Selling this frigging pos INTC” and proceeds to sell\n\n\n\nSeveral years later +1 day: InTC 🔥⬆️\n\nOP: I don’t need this 💩 anymore\n\n😂😂", "score": 5, "replies": []}, {"body": "To be fair, they deserved the dump, they needed to wake up from resting easy and releasing reheated trash thinking they were kings.", "score": 3, "replies": []}, {"body": "$49B in debt on the books, $1B in interest expense and $25B in CapEx that will convert to depreciation expense in the next few years.  \n\nMargins will continue to be eroded by the cost of their debts and operational expense for the foundry.  \n\nThe only misunderstanding is in reading the 10K, Intel is a manufacturing company masquerading as a chip designer.\n\nEnjoy your bags.", "score": 2, "replies": [{"body": "lol; this is correct.  OP is comparing Intel to amd and NVIDIA without the financial Statements.  \n\nFoundry business is a dead end yet they don’t want to stop the bleeding.  3 years and not a single significant outside order. The best move would to be spinoff the fans along with the debt.  Then Intel becomes a viable investment", "score": 0, "replies": []}]}, {"body": "You are right about Capex.  Its just that bitcoin and generative AI use GPU not CPU.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "What’s up with the surge in intel posts lately.", "score": 1, "replies": []}, {"body": "Enjoy bagholding around $30 for the next 10 years while other semis do 10-1 splits for their $1000+ shares.\n\nPeople really don’t learn ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "i see this posts once a week. Intel hasnt gone anywhere in 20 years and wont go anywhere in the next 20. The only way Intel goes up is China attacks Taiwan and TSMC/AMD/NVDIA are heavily impacted. Intel has nothing to show, no strategy , no business acumen. INTC didnt pick up steam when the tech sector experienced 600% gains , and specially wont grow when the whole sector is battered. \n\nIntel never made anyone rich. All it did is making everyone a bag holder", "score": -1, "replies": [{"body": "Tbf, it made a fuck load of ppl rich from its 1987 debut until the Dot Com top. I think it did something like 7,000%\n\nBut since then, yeah, complete dogshit", "score": 3, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "i cant see what happens in the next 2 decades but short term Intel gets to $30 again like many times before. We all had big hopes and aspirations til we got stomped by the boomer stock INTC. The only thing Intel did for me in the past was to max maximize my tax deduction", "score": 0, "replies": []}]}]}, {"body": "I'll buy in when it's below 30", "score": 0, "replies": []}]}
{"title": "Delta did not swing enough", "selftext": "Now I know not to play earnings with \nBanks (Jpm)\nAirline (delta )\nMaterials (wd40)", "id": "1e0ylij", "created_utc": 1720729154.0, "score": 9, "upvote_ratio": 0.74, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 12 | **Previous Best DD** | \n**Account Age** | 1 week | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Your strikes are so stupid it’s actually impressive", "score": 25, "replies": [{"body": "I lol’d at the strikes 😂", "score": 3, "replies": []}, {"body": "G loll bh loll pool plot   l loll holl Dr loll my loll h loll mmm m pool mym mg km", "score": 1, "replies": []}]}, {"body": "Why the fuck do you have so  many options ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 14, "replies": []}, {"body": "Damn, those strike prices. Just buy a single SPX 0dte every day in one direction if you want to gamble", "score": 11, "replies": [{"body": "Never tell a man how to gamble, you uncultured swine", "score": 4, "replies": []}]}, {"body": "how did you manage to lose that much money on DAL puts if the stock tanked nearly 10% at open?", "score": 6, "replies": [{"body": "The strike my fellow regard ….the strike ![img](emote|t5_2th52|4260)", "score": 6, "replies": [{"body": "Ur overly regarded. My 45 strike puts hit, u was too greedy", "score": 2, "replies": []}]}]}, {"body": "I feel less regarded about myself after seeing this. I hope you get some help", "score": 5, "replies": []}, {"body": "Bro watch a video on strikes prices and the Greeks. You’re gonna blow your account like I almost did", "score": 3, "replies": [{"body": "Bro I’m up 11k for the week", "score": 2, "replies": [{"body": "Congrats bro but be careful. You can lose all that shit as fast as you made it", "score": 1, "replies": []}, {"body": "I definitely need to go back on my risk tolerance lol", "score": 1, "replies": []}]}, {"body": " yes I do understand options theta Iv most things are priced in that’s why I buy the options that no one are looking at check my profile I took $700 turned in to almost 15k took 10k out", "score": 0, "replies": []}]}, {"body": "Imagine if you bought a boatload of NVDA puts….", "score": 2, "replies": []}, {"body": "These are the dumbest strike prices I have ever seen. ", "score": 2, "replies": [{"body": "I was copying your wife’s boyfriends trades ![img](emote|t5_2th52|8883)", "score": 2, "replies": [{"body": "original comment for an original little boy :)", "score": 1, "replies": []}]}]}, {"body": "You should quit options trading", "score": 1, "replies": []}, {"body": "I thought I was stupid to while choosing Strike prices, but after I had a look at your strike, I feel I am not that stupid.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1e10tur", "created_utc": 1720734858.0, "score": 42, "upvote_ratio": 0.9, "num_comments": 22, "comments": [{"body": "Dude why didn’t you buy these at open rather then before close lmao come on", "score": 28, "replies": [{"body": "lmao this is why i love this sub. Buy calls when the stock ran 50% in a month, then buy 1DTE puts AFTER the stock tanked almost 10% in a day lmao", "score": 25, "replies": [{"body": "Thats exactly how you make that million tho", "score": 2, "replies": [{"body": "This sub has taught me that “once it seems like a good idea, it’s too late” \n\nSeriously. Think about this every time you see someone’s massive gains.", "score": 7, "replies": []}]}]}]}, {"body": "Great job, you gave your position up to *Aladdin*", "score": 17, "replies": []}, {"body": "Theta says thanks regard.", "score": 10, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "It’s okay mah man. Close it asap at open.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "But but ya re running out of time mah man. \n\nCan ya simulate your return and see your gains in RH as of now? What does it look like?", "score": 1, "replies": []}]}]}]}]}, {"body": "HOW ARE U DOWN? MAKING ME SCREAM!!!", "score": 6, "replies": [{"body": "Cus he bought his puts at their peak", "score": 8, "replies": []}]}, {"body": "as far as bets go that seems pretty reasonable.", "score": 8, "replies": []}, {"body": "Jinxed my poots now ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "You got big balls for this.. wish you well but I think tomorrow will be green. Today was a blood shed", "score": 3, "replies": []}, {"body": "Just make sure not to sell until 110%", "score": 2, "replies": []}, {"body": "well shit, I guess I did it the wrong way op, bought near the close yesterday as well\n\nhttps://preview.redd.it/eugid7er00cd1.jpeg?width=560&format=pjpg&auto=webp&s=e94704bd08ff2e3b82ec347427229af09869c7f5", "score": 2, "replies": []}, {"body": "I'm with you", "score": 3, "replies": []}, {"body": "Should print!", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 8 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Yeah you in the money here soon buddy good job", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}
{"title": "NVDA - buy the dip", "selftext": "I wasn’t planning on trading today but NVDA dips must be bought! Another lovely entry point. Just throwing in a little play money for the unexpected buying opportunity 🤏. Buy that dip!!", "id": "1e1174s", "created_utc": 1720735831.0, "score": 26, "upvote_ratio": 0.82, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 10 months ago\n**Total Comments** | 450 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "I get paid in the morning, so I really hope it doesn’t rip until the market opens 🤞", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/i0h3k6z2sybd1.png?width=402&format=png&auto=webp&s=807d3ff27359e8525c9320af493e9427d44988b0\n\nJust one today. MRVL, AMD, and AAPL too. Redder than a ginger convention.", "score": 10, "replies": [{"body": "Just a lil taste", "score": 10, "replies": []}]}, {"body": "I have the same plan. 134 calls 11k yolo sep 20. We will know by earnings if we make it to the promised land.", "score": 8, "replies": [{"body": "Hell yeah! Going full regard ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}, {"body": "It’s still being so mean after hours :’(", "score": 6, "replies": [{"body": "If there’s anything that the last couple of weeks has taught me, after hours is completely meaningless\n\n1 min before market opened today ![img](emote|t5_2th52|4258) Right now ![img](emote|t5_2th52|52627)", "score": 7, "replies": [{"body": "Yeah what a bunch of ball busters. Got me good. I’m down a couple K.", "score": 5, "replies": []}]}]}, {"body": "Bought the shop today as well. $8k of NVDL", "score": 3, "replies": []}, {"body": "Bro you got weeks and months for these to go ITM what are you bitching about? If you're crying over every position that's not immedtiately green you shouldn't be doing this.", "score": 1, "replies": [{"body": "I don’t think you know how to read", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Good grief. Again. You don’t know how to read. These are buy transactions, not sell transactions…", "score": 1, "replies": [{"body": "oooooooooh so you were writing options and got fucked. Even I know not to do that and I can't read", "score": 0, "replies": [{"body": "No. Once again… no….\n\nWriting options is where I sell the contract and get the premium. I did not do that.\n\nI bought the options", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I have a feeling this shit will trade sideways, maybe a small correction and then steady upwards trend to $150 in 6 months, around election time. Calling it now.", "score": 1, "replies": []}, {"body": "biden says fuck you’re calls", "score": 0, "replies": [{"body": "I am calls? Fuck you, you’re calls", "score": 3, "replies": [{"body": "😂", "score": 1, "replies": []}]}]}, {"body": "Looks like NVDA won't be going near 135 until after 8/30\n\nFU OP", "score": 0, "replies": [{"body": "Interesting theory", "score": 1, "replies": []}]}]}
