{"title": "Reduce AAPL from 10% to 5%. Up my MSFT to 10% or add some AVGO.", "selftext": "I'm thinking of reducing my AAPL from about 10% of portfolio to around 5% and increasing my MSFT from 8 to 10%.  Or adding some AVGO.\n\nThis is in taxable, but the AAPL shares in question have just gone long for capital gains.\n\nGood move?  I feel a tough road ahead for AAPL as opposed to MSFT and or something like AVGO.", "id": "nsm4rj", "created_utc": 1622861989.0, "score": 8, "upvote_ratio": 0.66, "num_comments": 51, "comments": [{"body": "Love MSFT and Cloud much more", "score": 10, "replies": []}, {"body": "This question is going to elicit responses with bias.  AAPL & MSFT are both great companies.  \n\nI'll enter my own random redditor bias here... My personal position is that AAPL will continue to do better both in the short(ish) term and long.  \n\nEvery product/service AAPL makes has ridiculous margins... but justifiably as AAPL heads (and there are a lot) can't wait for the next 'thing' in their pipeline.  MSFT simply isn't at this point... yet.  \n\nI think the 2 trillion market cap is making some think 'how can it get any bigger/better'... I thought the same when it crossed 1 trillion back at the end of '18.", "score": 17, "replies": [{"body": "No bias.  MSFT has had a nice run, AAPL has been somewhat stagnant since the split.  Maybe OP is overthinking it a bit, I agree with you that AAPL will see a good run this year.  I wouldn't sell either of them, I've had enough lessons in the guessing game. Just hold, if you like the company why sell any?", "score": 11, "replies": [{"body": "I don't think it'll matter either way in the long run. I'm about 50% tech though and thought good idea lighten up.  20% is msft aapl.  Then I have LRCX NVDA ASML etc.", "score": 1, "replies": []}]}, {"body": "Apple doesn't spend the cash they have on hand whereas Microsoft just bought Nuance for $15 billion so that is also something to consider.\n\nYou can also factor in Microsoft's move to a subscription based/focused model and the cloud. Microsoft still has a ton of room to grow in my opinion.", "score": 3, "replies": []}, {"body": "Thanks. I agree.  It's really hard too tell the future.  I just have about 10% in AAPL.", "score": 3, "replies": []}]}, {"body": "Keep apple", "score": 7, "replies": [{"body": "I'm keeping.  Just thinking of reducing from 10% to 5% and increasing msft to around 10%.", "score": 1, "replies": [{"body": "Bad move. You're going to sell a company you like, get hit with taxes, then buy into another company you like with less cash because of the taxes. Your net worth will immediately decrease as an result of this trade. \n\nIt would be different if you didn't like aapl, but if you like them, just hold.", "score": 12, "replies": [{"body": "I agree. I think just put more contributions into MSFT/others and your Apple % will reduce.", "score": 4, "replies": []}, {"body": "Long term shares.  I pay 0% long term gains.", "score": 2, "replies": [{"body": "How does that work? Long term capital gains isn't zero", "score": 2, "replies": [{"body": "I make under 40k.  It's 0.", "score": 3, "replies": [{"body": "Oh, gotcha TIL", "score": 2, "replies": []}, {"body": "Just in case. Remember that long term gain can bring up ur taxable income that u hit the 15%", "score": 1, "replies": [{"body": "Ha not me! We'd be Talk in about a sub 1000 gain here.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Apple is due for some positive movement and they have 100 billion in cash. But in the end you need to trust yourself. Best of luck", "score": 1, "replies": []}]}]}, {"body": "MSFT is probably the safe bet here.", "score": 11, "replies": [{"body": "That's how I've felt since 1.5 years of investing so far.  But AAPL has done better percentage wise for my account. I even feel LRCX will do better than AAPL going forward.  Not sure of course.", "score": -1, "replies": []}]}, {"body": "Any option here on CRM Salesforce? \n\nApple 2.2 trillion evaluation has had its stagnation. Only positive news that increase price was the EV news. Otherwise, it’s dropped since that and even after incredible quarterly earnings.", "score": 2, "replies": [{"body": "I love Salesforce. Expecting that they're going to acquire Monday.com to continuously bring the heat to Microsoft in the office space.", "score": 2, "replies": []}, {"body": "long crm for sure", "score": 1, "replies": []}]}, {"body": "Apple will pop more this year, but long term msft is better", "score": 3, "replies": [{"body": "I hope so. What makes you say that though?", "score": 0, "replies": [{"body": "Apple will release new products (iphone, earpods) in september for xmas.  It will get some excitement and the stock will pop.  Microsoft has little excitement end of year.  But I like microsoft's diversity long term", "score": 2, "replies": []}]}, {"body": "That's how I feel.", "score": -1, "replies": []}]}, {"body": "I'm pulling for a Gateway comeback", "score": 1, "replies": [{"body": "Yeah I haven't lost faith or anything.  I just feel MSFT is a little more stable.  Most likely won't matter much in long run for me anyways. It's not like I have hundreds of thousands in either, but percentage is percentage!", "score": 0, "replies": [{"body": "Why do you ‘feel’ that? ‘Feel’ is the worst word to hear when discussing investments.", "score": 3, "replies": [{"body": "Yeah it's just I have 10% in AAPL.  Maybe wouldn't hurt to diversify 5% of it. Sooner or later I'm gonna have to trim it unless other things catch up.", "score": 1, "replies": [{"body": "So your basing this on its stock performance?", "score": 1, "replies": [{"body": "I've read a lot about AAPL having headwinds.  Can't grow much more cause 2 trillion, etc etc.", "score": 1, "replies": [{"body": "Well if you can translate what their outlook is into what it might be on the balance sheet and think they will not be growing much...then thats a decent reason to start backing out of a company.", "score": 1, "replies": [{"body": "I just listen to various CNBC people and read Motley Fool.  I check a few technicals like earnings growth, pe, forward pe, etc.  \n\nNo one knows what the future of any company will be.  If anyone really knew they'd be ultra rich.  The technicals can all line up and a stock can still tank.\n\nI just think 10% may be a little much that's all.  I read somewhere that you shouldn't have more than 5% in any one stock.", "score": 1, "replies": [{"body": "Well then sell it for another...or better just don’t add more Apple in case theres some cap gains involved.\n\nThat said, while no one knows anything with certainty I think they can make logical decisions that likely provide a better outcome. Apple is continuing to make 13% earnings on avg. plus buying back 5% of their stock. So in theory that should translate into 18% growth and all things being equal 18% increase in stock price. Thats still a great outlook. But not as good as MSFT at 28% with a little over 1% buybacks.", "score": 1, "replies": [{"body": "If only be selling 16 shares of AAPL. They're long term gains and for me that's 0 tax rate. I don't think it'll matter much.  I just think leaning towards MSFT may make more sense or even upping my GOOGL from 4% .\n\nThey say googl is part of the re-opening ... Whatever that is lol.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I upvoted you for the memes", "score": 1, "replies": []}]}, {"body": "I still like avgo at current prices", "score": 1, "replies": [{"body": "3% dividend also!  Although 3% of maybe $1000 isn't much lol.", "score": 2, "replies": []}]}, {"body": "I would instead move it to GOOG instead of MSFT.   Google is cheaper, makes more money, and growing faster.\n\nPlus Google has a lot more assets yet to be monetized.\n\nBut otherwise still like AAPL more than MSFT.   But really, IMHO, people should be owning all four.  GOOG, AMZN, AAPL and MSFT.", "score": 1, "replies": [{"body": "Thanks.  I've got less in AMZN n GOOGL.  Maybe 3 to 4% each.  No FB though.  I've got LRCX NVDA too.", "score": 1, "replies": []}]}, {"body": "Lol what? Why? Just because you feel like it? What's the methodology? Oh yea you're just some random nobody thinking you're warren Buffett. Just stick to in dex funds. Wanna share with us your 3k portfolio?", "score": -12, "replies": [{"body": "Ahahaahaa.  Try almost 6 figures.  Not a lot I agree, but I'm working on it.", "score": 1, "replies": []}]}, {"body": "I think both are going to have slower growth post pandemic, simply the size of the companies and how they get revenue...I feel Microsoft might have more solid opportunities to grow..but Apple has a hardcore base that will gladly pay when Apple cuts corners and charges them extra (for example no headphones or chargers) I bet a near (maybe a few years) future move from Apple will be no more hard drive and 100% cloud storage with a monthly payment (but this is speculative on my part)..\n\nI like Microsoft on this because they have more flexibility with income streams..but personally I wouldn’t care to have either in my portfolio, the companies are too big for my portfolio preference..", "score": 1, "replies": [{"body": "Maybe I can view them like bonds?  I don't fear losing money with them long term, but maybe 5% yoy growth?  Maybe 10% hopefully!", "score": 1, "replies": []}]}, {"body": "Goog", "score": 1, "replies": [{"body": "Yeah I only have I think 4% in GOOGL.", "score": 1, "replies": []}]}]}
{"title": "How confident should we be in the years ahead that the Fed will ALWAYS step in and boost the stock market as needed?", "selftext": "Ever since 2008 it seems to be a given that the Fed will fix the stock market whenever it \"breaks.\" Will this be the norm in the decades ahead? If so we truly shouldn't worry about a correction beyond a few months time. Some could argue the dead market following the dot com crash would not happen again with today's QE measures. It is kind of crazy that this has become a normal thing nowadays. Or maybe I'm just crazy for thinking they weren't in control all along.", "id": "nt8rls", "created_utc": 1622937288.0, "score": 41, "upvote_ratio": 0.79, "num_comments": 56, "comments": [{"body": "Their balance sheet is growing exponentially every time they feel they need to step in.\n1 to 2 trillion, 2 to 4 trillion, this time 4 to 8 trillion.\n\nSomethings gotta give.\nQuestion is if that's at 8, 16, 32, 64 or 128 trillion.\n\nMaybe I'm wrong and this is somehow sustainable but it seems to me that the further they take this, the bigger the damage will be when the cardhouse falls apart.\n\nPhysical dollars approx. 2.2 trillion according to [stlouisfed](https://fred.stlouisfed.org/series/CURRCIR)", "score": 48, "replies": [{"body": "Maybe they will loose the global currency badge", "score": 6, "replies": []}, {"body": "Account for inflation and the growing GDP and it's not that bad. COVID definitely made it worse, but it's not like we've been snowballing out of control for years. Frame it in the perspective of percentages rather than raw number value since context is everything. [https://www.thebalance.com/us-deficit-by-year-3306306](https://www.thebalance.com/us-deficit-by-year-3306306)", "score": 15, "replies": [{"body": "The economy is absolutely not growing exponentially.", "score": 5, "replies": [{"body": "And neither is our debt. COVID was an exceptional occurrence.", "score": 2, "replies": []}, {"body": "2% yearly growth is certainly exponential, albeit a low one.\n\nEdit: Wow, the education system is shit isn’t it?  I’m sorry those downvoting don’t know what exponential functions are:\n\nx(t) = x(0) * (1 + r) ^ t\n\nr can most certainly be 0.02 and be exponential growth. If r < 0, you get exponential decay.", "score": -6, "replies": [{"body": "That's not how it works, that's not how anything exponential works.", "score": 3, "replies": [{"body": "1.02 ^ y(ears) is exponential. This is math, not a debate. If the change in the variable is proportional to the base at every time step, it is exponential.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think they’ll do it till it breaks something, the public, private, and political pressure is too large. Everybody’s shirt term incentives align behind intervention and anybody who warns about the future consequences will be shouted down until they are proven right.\n\nBut also consider that even if they are right and the ling term consequences are dire, saving the markets from a collapse at the cost of anything short of a hyperinflation will still be preferable for those who hold assets.", "score": 1, "replies": []}]}, {"body": "I’ve thought about this also. It is definitely a possibility; this is why I’m long term bullish on the S&P 500.", "score": 25, "replies": [{"body": "+1.  \nThe Fed almost has the 'moral obligation' to keep making moves to increase asset prices, whether it's dropping interest rates (or refusing to raise them) or spending $120 billion a month. So many things are now tied to the stock market; everybody's retirement with 401k's, etc. You can even invest your medical HSA in the stock market, as well as buy GameS and that digital coin in your IRA.  \nIf the Fed doesn't support the markets, there is so much that can go wrong, whether with inflation, investments, etc.  \nI don't agree with all of the Fed's intervention (manipulation?) but if you can't beat 'em, join 'em.", "score": 24, "replies": [{"body": "Wasn’t everyones retirement based on stock market like forever?", "score": 2, "replies": [{"body": "401ks were not even in existence until 1978 and didn’t really become a thing until the 80s and 90s", "score": 3, "replies": [{"body": "Ok, i'm not from US so not familliar with 401k too much but this aside- were not ordinary pension plans always held in trust funds? So then basically they were somehow dependant on market movement?", "score": 1, "replies": []}]}]}]}]}, {"body": "Pretty confident if the general population of the United States increases and people keep working and contributing to their 401k.", "score": 11, "replies": [{"body": "Not really that much different than a Ponzi Scheme, lol", "score": 3, "replies": [{"body": "Hey, Anything is better than .1% sitting in the bank.", "score": 3, "replies": []}]}]}, {"body": "You are paying it through inflation", "score": 6, "replies": []}, {"body": "Entire population’s retirement linked to market through 401K so Govt. will always step in protect the market or they will be voted out.", "score": 5, "replies": [{"body": "> Entire population’s retirement linked to market through 401K so Govt. will always step in protect the market or they will be ~~voted out~~ retiring early and replaced with other overlords to do whatever the hell they want.", "score": 3, "replies": []}]}, {"body": "The fed charter gives it dual (and opposing) responsibility for max employment and min inflation.  If inflation hits, they will have to slow the economy.  Of course this time they say it is 'transitory', which might give them more room until its too late...", "score": 9, "replies": [{"body": "Well you could very easily argue the case that it is transitory. CPI numbers were driven by used car sales, and any product not affected by the lumber/semis shortage performed very poorly. I looked through the data, and I suggest you do the same.", "score": 9, "replies": [{"body": "I have and you're right about last CPI, but PPI and commodities tends to push into future CPI - those dramatic increases weren't used cars or just lumber/SC... It takes 3-6 months for commodity prices to push into consumer prices.  The only thing holding CPI down is lack of demand, but that's changing rapidly.  If PPI and commodities drop, then I will believe in transitory, until then, I'm believing in money supply", "score": 11, "replies": [{"body": "I think, the conclusion that is easily drawn is that we need more data. Right now, it's impossible to draw assumptions. It's essentially a guessing game, but even so, the fed have done a good job to date of holding the market together, and I believe they're educated enough to know what they're doing in a case like this.", "score": 4, "replies": []}]}]}]}, {"body": "Honestly I feel very strongly that the fed can only put so much duct tape on the leaky pipe that is the stock market before it stops working and the pipes burst. Maybe that’s not the best metaphor, however, the stock market just keeps growing and growing, paired with how divided our country and the world is today, along with corruption, I feel like it’s a time bomb. God I hope not tho.", "score": 6, "replies": [{"body": "But don’t they manufacture the duct tape?", "score": 7, "replies": [{"body": "Touché my friend. I suppose it is more complicated than I first thought.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Keep on scrolling and don’t waste your time reading it and also your time replying to it. \nHey yeah there’s the well thought out, intelligent advice you was looking for.", "score": 1, "replies": []}]}]}, {"body": "Even though I agree that the FED fixing the stock market will be the norm going forward, I'm not thinking \"this time is different.\" An inflationary correction is definitely possible and the FED might not be able to control it easily. If inflation were to become uncontrolled, the subsequent interest rate increases would dramatically reduce equity valuations. (Correct me if I'm wrong, but as far as I understand, the FED has no choice but to raise interest rates in the face of inflation)\n\nWhat if inflation lasts three years? Equities would be \"correcting\" the entire time. \n\nI don't lose sleep over this though & I can't tell the future, so I'm fully invested.", "score": 8, "replies": [{"body": "Me too fully invested even market crash happens I just gone hold , no point hold cash and wait many years while your money loose buying power .", "score": 1, "replies": [{"body": "https://imgflip.com/i/5c9sum", "score": 3, "replies": []}]}]}, {"body": "It’s very safe to assume that YES they will", "score": 3, "replies": []}, {"body": "Please enlighten me. 2008 it was the fucking economy at the verge of collapse. 2020 you had businesses finding themselves in the middle of a pandemic, where revenues/profits where going to get hit VERY hard, risking, again, the economy.\n\n&#x200B;\n\nWhat I mean by this is you've taken a 13 year range and based on two events concluded: Will the FED ALWAYS STEP IN AND BOOST THE STOCK MARKET?\n\n&#x200B;\n\nBruh... The Fed jumped in when the economy was at risk, not when the stock market tanked.", "score": 12, "replies": [{"body": "This is why Reddit is a most often a joke for serious stock market information.  Misleading, stupid naive questions like OP is asking", "score": 1, "replies": []}, {"body": "In 2018 when the market threw a hissy fit over increase in interest rate Fed backtracked their policies", "score": 1, "replies": []}]}, {"body": "I've been thinking the same. Here's my take though...\n\nIf our market tanks, Global warming is for sure considering we won't have the equity and funds to mitigate, produce, and purchase the needed materials. Nor will we have time to wait to get it back going.\n\nAmerica more or less loses our established firm No. 1 country status.\n\nMillennials pretty much have the final nail in the coffin on having a decent midlife of getting money, retirement fucked.\n\nAnd that's a wrap.\n\nSo with that at stake, can the economy really fail? If it fails, the next 20-35 years is a wrap. I don't think they can let it fail. Our country has too much at stake.", "score": 5, "replies": []}, {"body": "All good things must come to an end.", "score": 7, "replies": [{"body": "If you're implying that this is the end of the market as we know it, boy are you in for an awakening. The only way I see the market falling to unrecoverable levels, is if Nuclear warfare is waged against the US, completely obliterating its existence.", "score": 6, "replies": [{"body": "It could stagflate like the 70s and the fed has to go volker-style on interest rates which hurts the market. So in that case the fed won't have the (short term) interest of the market.\n\nProbably won't happen anytime soon, but I'm sure some time in the future it will.", "score": 4, "replies": []}, {"body": "It’s an old saying and as true today as it was when first spoken.", "score": -2, "replies": []}]}]}, {"body": "I am not uncertain", "score": 2, "replies": [{"body": "Which family are you dad to this week?", "score": 1, "replies": []}]}, {"body": "You can always bet on the Fed to manipulate the market, or at least attempt to. Manipulating the market and the economy as a whole is literally their entire mission statement. It's only illegal when you do it.\n\nEdit: By the way this isn't a \"conspiracy\" at all. It's entirely a statement of fact. Just go check out their website. They're actually pretty open about it honestly.", "score": 3, "replies": []}, {"body": "Corporate balance sheets much like supply chains are no longer as resilient as they were. This is mostly a good thing as it makes our society much more efficient most of the time. So, I don’t see FED interventions being stopping anytime soon, but I also don’t think that that is necessarily a bad thing.", "score": 2, "replies": []}, {"body": "You should ALWAYS trust your government.", "score": -1, "replies": [{"body": "/s?", "score": 2, "replies": []}]}, {"body": "If the government didn’t boost the economy and the market crashed there would be a big run on banks and that would be similar to the 1929 crash. \nIf all apes got together and stopped using major banks it would cause liquidity issues for banks, in return they would have less money to lend HF’s", "score": -3, "replies": [{"body": "That is what happened in 1929. Govt did nothing but lesson learned now everyone retirement linked to market through 401K so Govt. has to step in.", "score": 1, "replies": []}]}, {"body": "Ultimately it doesn't really matter imo", "score": -1, "replies": []}, {"body": "You have zero clue what you’re even talking about", "score": -1, "replies": []}, {"body": "Stocks only go up", "score": -2, "replies": []}, {"body": "In the long term as long as people keep getting paychecks expect constant long term gains in the market. Capital gains are like the governments own bonds", "score": 1, "replies": []}, {"body": "I think when the baby boomers aren’t the ones  relying on the market it won’t be the norm.", "score": 1, "replies": []}, {"body": "My question is, why should we even have \"cycles\" and why not fix \"cycles\" if we can?", "score": 1, "replies": []}]}
