{"title": "Bond like stocks? JNJ?", "selftext": "I'm wondering what the most 'bond like' stocks may be.  What I mean is that they're fairly stable and hold up good in market sell offs.\n\nThe only one I can think of off hand is maybe JNJ? According to Portfolio visualizer, it's max drawdown was -34% and worst year was -10% all the way back to 1986.\n\nI kind of think as MSFT in the same way except it has growth and more volatility to the downside though in market sell offs.", "id": "o2c422", "created_utc": 1623975975.0, "score": 25, "upvote_ratio": 0.85, "num_comments": 53, "comments": [{"body": "I think most of the stocks in the DOW 30 are what you’re looking for", "score": 26, "replies": [{"body": "How did you think about Exxon a few years ago. It's a dog today. \n\nProctor & Gamble or Unilever.. very stable because most household chemicals come from them... But Clorox would possibly have some growth, too.", "score": 1, "replies": [{"body": "Made 30+% off Exxon last year, plus dividends. That being said... I think they dividends are in trouble.  Looks at Chevron or Diamondback instead.", "score": 1, "replies": [{"body": "That's last year, (I did, too) but longer term, it's been a boat anchor", "score": 1, "replies": [{"body": "Writing was on the wall when they got replaced on DOW, but still made some beyond that.  Wanted to trade over to Chevron or Diamondback at the time, but had to hold until LTG.", "score": 1, "replies": []}]}]}]}]}, {"body": "WM is rock solid with an absurd moat.", "score": 21, "replies": [{"body": "Too expensive", "score": -23, "replies": [{"body": "That's not the question being asked.", "score": 25, "replies": [{"body": "Lmao", "score": -24, "replies": []}]}]}]}, {"body": "JNJ and MSFT, you can't go wrong I own them both.", "score": 8, "replies": [{"body": "MSFT is about 12% of my portfolio! Along with AAPL about 21% together.", "score": 6, "replies": []}]}, {"body": "MCD DG COST WMT", "score": 4, "replies": []}, {"body": "WMT, KO", "score": 3, "replies": []}, {"body": "WMT, PG, UL", "score": 3, "replies": [{"body": "UL?  Never heard of that one!", "score": 2, "replies": [{"body": "There a 110% chance that you have bought their products \n\nhttps://www.unilever.com/brands/view-all-brands/?page=1", "score": 3, "replies": []}]}]}, {"body": "What you want to be looking for are stocks with low Betas (MSFT has a beta close to 1, so I wouldn't call it a bond like stock). Look at companies like JNJ (though the have some correlation to the vaccine), PG, WMT, TGT, KR, COST, MCD. The sectors you want to look at  are Consumer Staples, Healthcare and possibly Utilities which are more defensive.", "score": 4, "replies": [{"body": "I've got UNH and a healthcare mutual funds.  Fidelity FSMEX and FSPHX.  I was thinking of adding MCD.  A lot of nostalgia for me.", "score": 1, "replies": []}]}, {"body": "Brk is the obvious answer. It’s roughly half cash just waiting for a big drop", "score": 7, "replies": [{"body": "One of the biggest drops happened last year and they didn’t do much…", "score": 4, "replies": [{"body": "Buffett and company are highly selective, they buy only when the price is right. he'll go years without making a move. he dissolved his first investing company and returned money to people because it was a raging bear market in the late 1960s and everything was overvalued, no bargains to be found.", "score": 4, "replies": [{"body": "You’re saying their were no bargains during the pandemic 😂", "score": 1, "replies": [{"body": "That’s not what anyone is saying. Hindsight is 20/20. The market drops 30% in such a short time due to a global pandemic. No one knows if there is further to drop, fundamentals become increasingly detached from valuations- that’s not the environment Buffett wants to buy in. It is slow and boring, but patience is their game and that does mean missing some opportunities while waiting for their moment.\n\nAnd it’s not like they did nothing. Share buy backs are big. Repositioning and leaning heavy into BoA was not a nothing move", "score": 2, "replies": [{"body": "That’s just fear and greed controlling investment decisions at that point. Don’t know if the 30% discount is good enough for my cash pile lol", "score": 1, "replies": [{"body": "I think it’s greed to say you should change your entire, extremely successful, 60 year investment style and thesis to accommodate an unprecedented market drop that we now know quickly spiked back up to all time highs. It’s very easy to look backwards and give investment advice, much harder to look forwards. And to safely look forwards, with the goal being first to preserve capital and second to grow it, BRK made completely understandable moves", "score": 3, "replies": [{"body": "Market crashes are generally unprecedented. And it wouldn’t really matter if stocks stayed down for a longer period of time, Brk would’ve probably bought near a low if they did anything. But you’re right, making no moves is a move it just doesn’t go hand in hand with “waiting for a crash to deploy cash theory.”", "score": 1, "replies": [{"body": "I disagree. The cash pile is waiting for the right move. That takes time, patience and due diligence. It’s not meant to be used for a fire sale. What happened in March last year was effectively everything was in a fire sale for a few months. At the time, we did not know how long pandemic would last, lasting ramifications, and no company had a major lasting change to their fundamentals that would make Berkshire see them as an appealing target for the cash pile.\n\nThey made moves. They made money. Berkshire did not just sit with their thumbs up their ass doing nothing. But they didn’t deploy the elephant gun so to speak. And just because they didn’t deploy it last March, doesn’t mean it invalidates the idea that they have a huge cash pool waiting for the right opportunity to capitalize on.", "score": 0, "replies": [{"body": "They definitely had targets for companies and prices were definitely under their price targets for huge value in these names, and they didn’t make a move but I get it too, not losing money is rule #1 at brk", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Brk performed well last year. It dropped less then the market. The rebound was so fast we didn’t really get to test how it would fair in a prolonged downturn, which is where you would want it to behave like a bond. \n\n\nGiven it was an unprecedented drop and spike back up, I think it’s asking too much to expect them to deploy $100Bn in such a situation. Instead they bought lots of their own stock. Made a few speculative plays and lined up their leadership.", "score": 1, "replies": [{"body": "And sold airlines at the literal bottom", "score": 1, "replies": [{"body": "This gets thrown out so often. BRK is not nimble. It’s like turning or stopping an 18 wheeler. It’s obvious airlines are a risky if not dangerous play. A retail trader can capitalize on volatility but that’s not how Berkshire operates. And again, if you think of it as a bond proxy, you wouldn’t want them playing risky and volatile positions", "score": 2, "replies": []}]}, {"body": "If it’s “half cash” it obviously would drop less than the rest of market. The point still stands, one of the biggest crashes and no deployment of cash hoard in any significant way. Berk has been waiting for that type of drop for over a decade and just sat on their hands", "score": 1, "replies": [{"body": "But we’re talking about it acting as a bond proxy? So it behaved accordingly. You don’t get a bond proxy to make huge gains.\n\nIn regards to not capitalizing on the drop, again I think this was too short and volatile of a drop. You can’t deploy so much cash with any uncertainty. So while in hindsight March was the best time in a decade to buy, that was far from a foregone conclusion at the time", "score": 1, "replies": [{"body": "Dude brk’s job is to know the value of pretty much every “interesting” company for their portfolio. They own snowflake ffs. \nThey didn’t think anything was at a good buy price when stocks were depressed 50% or more? Is it greed or incompetence at that point waiting for the lowest low? The 50% discount wasn’t good enough?", "score": 1, "replies": [{"body": "BRK takes a very long outlook for their portfolio. It’s very easy right now to say that stocks were down 50% for a few months and then came roaring back to ATHs, what idiot wouldn’t have bought that dip! But that’s hindsight bias. \n\nAs a retailer trader it’s much more acceptable to take on that kind of risk than it is for BRK. What if the unprecedented global pandemic actually left stocks depressed and stagnant for years? At the time there was no reason to be so sure the dip would be short lived.\n\nBRK is not really geared towards maximizing the value of each position at any moment. That’s not what they are for. They don’t swing trade, the hold mostly steady companies and don’t usually take major changes to their positions.\n\nNow ironically they did kind of make some interesting and major structural changes. They consolidated in Verizon and BoA, expanded into pharma and trimmed some of their other long term financial holds. But the goal isn’t to quickly take advantage of the current market volatility. The goal is to build a fortress that performs well over decades long horizons", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Most their cash is insurance float though", "score": 1, "replies": [{"body": "Their cash pool is still deployable though. If there was a whale they wanted they can lean in to heavily. They’re just very selective about when to deploy that cash and on what", "score": 1, "replies": [{"body": "In 2008 Warren Buffet was one of the calmest and smartest guys around.  He profited nicely.", "score": 1, "replies": []}]}]}]}, {"body": "Look for low beta, dividend paying. Add options to make it more fun. I created a scan on thinkorswim.", "score": 2, "replies": []}, {"body": "> fairly stable\n\nlook for the 'beta' of a stock, which measures volatility relative to the market. \n\nthe market as a whole has a beta of about 1, which is what you'll get from a total market or S&P 500 index. +1 is more volatile, -1 is less volatile. \n\nTesla is a hotter stock, beta of 1.36 (36% more volatile than the market). \n\nhttps://www.marketwatch.com/investing/stock/tsla\n\ncompare with some of the stocks suggested here. \n\nWM has a beta of 0.72 \n\nhttps://www.marketwatch.com/investing/stock/wm?mod=over_search\n\nand JNJ has a a beta of 0.64\n\nhttps://www.marketwatch.com/investing/stock/jnj?mod=quote_search\n\nvalue stocks tend to have lower beta, so maybe start by looking at the holdings of value funds/etf's to get some more ideas.", "score": 2, "replies": [{"body": "Thanks!  I'm wondering though.  In in accumulation mode and if not holding more fangs is smarter. Yes, you have the volatility, but in the long run you may accumulate more.  I just have a diversified portfolio, but I'm leaning with MSFT AAPL GOOGL PYPL NVDA etc.", "score": 1, "replies": []}]}, {"body": "Surprised no one is mentioning Verizon.", "score": 0, "replies": []}, {"body": "LODE", "score": 1, "replies": [{"body": "😆", "score": 1, "replies": [{"body": "Half kidding. It is a joke of a stock but I think the business model is super strong and they have a ton of growth. Picked up a few hundred shares for a long hold", "score": 1, "replies": [{"body": "What do they do?", "score": 1, "replies": [{"body": "Precious metals money out in Las Vegas that just went debt free, owns a fuck ton of band, opened mines for precious materials like palladium copper and lithium, and they just started a lithium ion battery recycling company hoping to capture the 98% or car batteries and ev car batters that as trashed each year and recycle them for the metals and materials \n\nSounds lucrative the ceo is all sustainablity and shit great fuy", "score": 1, "replies": []}]}]}]}]}, {"body": "I hold others with a beta under 1, but some of the stocks that I specifically picked to act as bond proxies in our portfolio are: PEP PFE VZ TD RY LMT.", "score": 1, "replies": []}, {"body": "VZ. If you look up “sideways” in the dictionary there’s a Verizon logo.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "o2s9v9", "created_utc": 1624031541.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 59, "comments": [{"body": "[https://en.wikipedia.org/wiki/Rollout\\_(drag\\_racing)#:\\~:text=Rollout%20or%20rollout%20allowance%20in,the%20initial%20standing%20start%20position](https://en.wikipedia.org/wiki/Rollout_(drag_racing)#:~:text=Rollout%20or%20rollout%20allowance%20in,the%20initial%20standing%20start%20position).\n\nI don't see the big deal. I think every Tesla Stan or whatever people who like Tesla's are called these days, understand that the 0-60 was with rollout and on a VHT surface. It is all these nuts trying to tell us that but if I don't agree with you to measure it that way I get a time over 2 seconds.\n\nSERIOUSLY, GET A LIFE, WE KNOW THAT IF IT IS NOT ON VHT WITHOUT ROLLOUT THE TIME GOES UP!!! YOU ARE NOT TELLING US ANYTHING WE ARE IN DENIAL ABOUT.\n\nOk, now that I am done yelling, the S Plaid is an awesome car and might just outperform any other production car out there. Can't wait to see what it can do on the Nurburgring.", "score": 6, "replies": [{"body": "I'm not a Tesla fan boy, but I do have a Tesla, I don't in any way understand the concept of rollout or how it can be logically applied to a road car, this to me is just lying.\n\nIt is however commonplace, pretty much any marketing in the world can always be taken with a pinch of salt, the moment I saw that 1.99 second time I new there would be some caveat to it and it and I knew it would be BS, and as it turns out it is.", "score": -2, "replies": [{"body": ">\tthe moment I saw that 1.99 second time I new there would be some caveat to it and it and I knew it would be BS, and as it turns out it is.\n\nYes, I had a sneaking suspicion too, given the very obvious asterisk next to the number.", "score": 2, "replies": [{"body": "It's sad isn't it they can't just stick to the facts\\*\n\n&#x200B;\n\n&#x200B;\n\n\\* by sad I mean disappointing", "score": 0, "replies": []}]}, {"body": "> I don't in any way understand the concept of rollout or how it can be logically applied to a road car, this to me is just lying.\n\nI don't like the 1ft rollout either. However, there's [still reason](https://www.caranddriver.com/features/a18202575/the-importance-of-rollout/) to use it for standardizing the timing measurement. Even though measurement devices have certainly improved since (more accurate GPS, lasers, accelerometers, SLAM tracking, etc), a lot of media (not just MT) still rely on it for continuity; it's a useful way to compare drag times of today's cars to yesterday's.\n\nIn any case, to show the masses they're the fastest, Tesla *has* to include it. Can't have the plebs believing that their 918 Spyder or 911 Turbo S could out-accelerate it, can we? /s\n\nThe funny thing is that if we remove all of the 1-ft rollout times from the list, it severely hurts ICE cars disproportionately.", "score": 2, "replies": [{"body": ">it's a useful way to compare drag times of today's cars to yesterday's\n\nThat's a cop out answer.  They could just not follow the old \"standard\". The American publications could put a giant asterisk on all past cars and the 10 people who cared could do that math.", "score": 1, "replies": []}]}, {"body": "Rollout explained.\n\n[https://www.youtube.com/watch?v=TtLvv8399pg](https://www.youtube.com/watch?v=TtLvv8399pg)", "score": 2, "replies": []}, {"body": ">\tTesla, I don’t in any way understand the concept of rollout or how it can be logically applied to a road car, this to me is just lying.\n\nRoll out isn’t a Tesla thing it’s an American thing.", "score": 2, "replies": [{"body": "When I said I don't understand rollout, I might have been a bit disingenuous, it makes total sense for drag racing within the US, I do electronic control for a living so understand\\*  the photooptic Gates used to sense the position and movement of the front wheels works and where the 1 foot comes from,  I just can't understand how or why you would apply it to a road car that you're selling into a global market.\n\n\\*have a vague understanding.", "score": 1, "replies": [{"body": "It’s like EPA range. It’s just a standardised test. You can complain about the test rules but not the results.", "score": 3, "replies": [{"body": "The EPA test is a standardised test, 0 to 60 with rollout isn't standard is it, it may possibly be approaching a standard within the press of the USA, but it's completely unintelligible to the rest of the world and seems directly misleading", "score": 1, "replies": [{"body": ">\t0 to 60 with rollout isn’t standard is it, it may possibly be approaching a standard within the press of the USA, but it’s completely unintelligible to the rest of the world and seems directly misleading\n\nLol a standardised test is a test with set parameters. So saying a prepped track with rollout means you are setting those parameters. It’s been done like this for ever in the USA.\n\nDon’t buy into the FUD", "score": 5, "replies": [{"body": ">Lol a standardised test is a test with set parameters. So saying a prepped track with rollout means you are setting those parameters. It’s been done like this for ever in the USA.\n\nThis is the crux of the issue, 90% of the world are not in the USA, 0 to 60 means going from 0 miles an hour to 60 miles an hour to the rest of the world. Seems normal within the USA, it seems like lying to your customers to the other 90% of the world. Which is why it's being discussed here in such depth.", "score": 1, "replies": [{"body": "And as I said it’s no shit that an American car manufacturer uses the EPA standard as a benchmark as it’s their home town. Same for 0-60.\n\nYou are just being caught up by the trolls trying to pretend this is about Tesla lying", "score": 3, "replies": [{"body": "They don't use EPA in the rest of the world, but they do apply the 0-60 to the rest of the world, it is obvious lying.\n\nJust because someone does not agree with you does not make them a troll.", "score": 1, "replies": [{"body": "Keep it simple.\n\nThey used a known standard and declared how that standard works.  No need to be silly about it", "score": 2, "replies": [{"body": "It's not a known standard, that's why there are YouTube videos discussing how misleading it it.", "score": 0, "replies": [{"body": "Dude. It is. It’s how cars have been dragged since the 1940s. \n\nhttps://en.racelogic.support/02VBOX_Motorsport/01General_Information/Knowledge_Base/One_Foot_Rollout\n\nhttps://en.wikipedia.org/wiki/Rollout_(drag_racing)\n\nAnything else you need? Maybe a verbal YouTube from Mr Rollout?\n\nWhat you are getting caught on is magazines don’t use rollout because magazines don’t often drag strip their cars in testing.\n\nAs I said it’s just one version vs another", "score": 2, "replies": [{"body": "So it applies to drag racing and drag racing only, has no place in the international marketing for a road car.\n\nI'm just saying I can understand why it's caused controversy, 0 to 60 implies 0 which means 0, just would have been better if they were honest.", "score": 1, "replies": []}, {"body": "Don’t feed the troll.", "score": 1, "replies": []}]}]}]}, {"body": "> They don't use EPA in the rest of the world, but they do apply the 0-60 to the rest of the world, it is obvious lying.\n\nDerp, the rest of the world don't use 0-60, since most of the world doesn't even use \"mph\". Intl publications are more often citing 0-100kph, which is close (~62mph) but not the same- and sometimes going to be very different thanks to gears that top out at ~61 mph (purely by coincidence).\n\nIn any case, drag racing is far more popular in NA than the rest of the world. And rollout is a standard practice there.", "score": 1, "replies": []}]}]}]}]}, {"body": "> 0 to 60 with rollout isn't standard is it\n\n[It is](https://en.wikipedia.org/wiki/Rollout_(drag_racing).", "score": 5, "replies": []}]}]}, {"body": "It's called marketing.  People love and hate tesla, either way, they are talking about tesla.  No press is bad press.  Trump proved that when he became president. He knew how to get free advertising on TV, social media,  etc.", "score": 1, "replies": []}]}]}, {"body": "And if you were willing to spend the money would the 1.99 second claim only holding up under limited circumstances have impacted your decision to buy a S Plaid here? Personally, for myself, I would buy a Model Y or 3 over the S just because of the cost (and for my family prefer a minivan for the seating and space), but damn the S Plaid is so tempting (I could actually pay for it with gains on Tesla stock I have... so would be like a freebie).", "score": 1, "replies": [{"body": "It probably would have impacted my decision to buy it, had I already bought it and then learnt about rollout.\n\nWhen I told people my car did 1.99 seconds to 60 and they pointed out that it couldn't, I would feel defrauded, it would be enough to sour the taste of the car, and probably enough for me to take it back and get my money back.\n\nAnd if they are lying about the 0 to 60 time, what else are they lying about?\n\nIt would at very best be enough to take the shine off the car for me, and start to resent the money spent.\n\nWhy not just state that it does \"0 to 60 in 1.99 seconds on a drag strip\" without the snidey little Asterix,\n\nI was going to go for a model Y, then I realised it's 1 foot wider than my model 3 which makes it very impractical for the roads around me.", "score": 1, "replies": []}]}, {"body": "It is very simple\n\n  Time with roll out is more accurate but less precise\n\n  Time without roll out is more precise but less accurate.\n\nThe thing that nobody will tell you is that 1 foot roll out is a low precision estimate. Because of the laser timing mechanism you don't actually have precise data on roll out distance. So they just estimate it to be about 1 foot and then calculate the \"with roll out time\" using the \"without roll out data\" from the sensor and the low precision 1 foot distance estimate.", "score": 1, "replies": []}]}]}, {"body": "I agree with some of the facts this guy says. At the same time, some of the wording annoys me. Tesla does post a giant * and no one misses it. Claiming this is super shady is bullshit. What he does is a bit of marketing for his video. It doesn't change the big picture at all. Yet he is trying so hard to show he is the smart one. No, he is just being nitpicking imo. People will have different opinions on this , I get it. But plaid is fully capable of going under 2 without rollout by modifying tires a bit or maybe getting more downforce. Then Tesla will have to add * again because it's not stock. So it's just a bunch of BS about nothing.\n\n\nThe important thing is it is the fastest production car and goes under 2 without including rollout which is clearly stated on webpage.", "score": 9, "replies": [{"body": "It doesn't go sub 2s on the standard tires on a road surface, I can get why people will be really upset about this, it does seem like directly lying to your clients in order to leaver money out of their bank accounts on false pretences, if I had bought one of these on the basis that it did 0 to 60 in 1.99 seconds and I wasn't able to recreate that I would take it back and ask for my money back.", "score": -2, "replies": [{"body": "Is there a marketing play on the teslas part? Absolutely. Do people buy this only based on a premise of going sub 2 with stock configuration? Nope. The big picture matters and the guy is just focusing on one point and pour big negative words to it. I call that bullshit.", "score": 2, "replies": [{"body": "Bullshit is never factually correct, sadly he is..", "score": 0, "replies": [{"body": "Thanks for pointing it out. :D", "score": 1, "replies": []}]}]}, {"body": ">if I had bought one of these on the basis that it did 0 to 60 in 1.99 seconds and I wasn't able to recreate that I would take it back and ask for my money back.\n\nGood for you, but most people aren't going to because it's still the fastest car around.  At least the fastest car most people can get their hands on.\n\nYou'll take it back,  and what are you left with?  What else are you going to buy if fast was what you bought it for.", "score": 1, "replies": []}]}]}, {"body": "Wow, the total butthurt, nitpicking displayed by the Tesla haters for a supercar that goes 0 to 60 faster than cars that cost 10 times its cost is unseemly and I'm being kind.", "score": 3, "replies": []}, {"body": "Wikipedia begs to differ,\n\n[https://en.wikipedia.org/wiki/Tesla\\_Model\\_S#Plaid\\_2](https://en.wikipedia.org/wiki/Tesla_Model_S#Plaid_2)\n\n\"The 760 kW (1,020 hp) car, with 1,424 N.m (1,050 lb.ft) torque, was independently tested to go 0-60 mph in 1.98 seconds and cover a quarter-mile in 9.25 seconds\\[196\\].\"", "score": 2, "replies": []}, {"body": "Why do Tesla fans defend Musk's lies? It's still an impressive car even it's 2.5 seconds.", "score": 0, "replies": [{"body": "I don't think I'd call it a lie... More like a cheap shot. Could of been less disengenuous about it is all. It makes it less meaningfully if you have to put a bunch of asterixes next to everything.\nHigh school rules man. If someone is right but had to pull a bunch of bullshit tactics to be so, then no one ends up caring anymore.\n\nBest example is this [DRAG RACE](https://youtu.be/1s2Zf-wstUM) with the demon... Sure it ended up winning... But common man... What a bunch of bullshit it took to get there. And sure it's \"technically\" fast... But with a bunch of asterixes next to it for sure.", "score": 1, "replies": []}]}, {"body": "Playing devil's advocate here:\n\nThoughts?\n\nI think it was yesturday where someone posted a linking from r/cars about a little $100 bet, and the guy denying the 1.99 second claim was getting chewed up.\n\nWhere do you stand on the matter.\nI for one am guilty of heading on over to that r/cars link and reading through it and disliking a post from that guy... But this video sort of proves him right, does it not?", "score": -4, "replies": [{"body": "It went 1.98 seconds. So no, it does not.", "score": 9, "replies": [{"body": "It didn't, so it does make him right", "score": 0, "replies": [{"body": "Yeah it did. Motor trend got 1.98 seconds with rollout just like tesla said.", "score": 1, "replies": []}]}, {"body": "Did it though? Under what circumstances? Using the caviot that it canceled out the first foot of acceleration? Which even Tesla themselves never use again?\n\nThe roadster that space-X launched is currently rocketing around in space at 10s of thousands of kilometers per hour... So is that the roadster's top speed? Can Tesla put the 0-60 time for the roadster at 0.01 seconds with the little Asterix next to it saying \"when launched in space\"? Does that count?", "score": -5, "replies": [{"body": "It's not a caveat, it's how the test is performed accurately. \n\nThe 1 foot rollout is a historical artifact from how drag strips measured acceleration times with a light gate. You can't get the starting time before the wheels have rolled slightly forward and pass the gate, that's when you can synchronize all your watches. All historical 0 to 60 times had to use this method of measurement. If you want to look at historical 0 to 60 times they all had rollout inherently included. To be able to compare today's times with previous vehicles, you need the rollout. It's a standard.\n\n>The result was the standardization of a \"1 foot rollout \\[allowance\\]\" (30 cm) derived by accurately measuring a complete acceleration run, then subtracting the time taken for the first 1 foot (30 cm) of vehicle movement, with only the derived timing being published.\n\nLike don't underestimate how relevant those old records still are today. In the 60's and 70's people built insane jet engine, rocket engine contraptions which got insane quarter mile times (with rollout). Today people don't even want to attempt to break those land speed records because so many people died trying.\n\nIt's standard practice. Why Tesla didn't do it on their other cars is weird, maybe they just didn't care as much. Doing VHS coating sounds hard and they felt rollout was cheating. Now that they're really dedicated to making a ridiculous drag strip performant car, well they have to look at the rest of the industry and adopt some of their standards.\n\nHaving a 30 cm rollout is dumb, but it's how it's done.", "score": 10, "replies": [{"body": ">\tThe 1 foot rollout is a historical artifact from how drag strips measured acceleration times with a light gate\n\nSo many trolls are pretending this is a Tesla thing", "score": 10, "replies": [{"body": "No, no, no... you see, Tesla *invented* drag racing because it used to be the only track they could dominate. Therefore, it's all Tesla's fault for publications and other carmakers using that silly* 0-60 metric for historical reasons that predated the company's existence by decades.\n\nSeriously, 0-60 is actually a stupid metric. I wish 5-60 were more ubiquitous since it better reflects real-world performance and negates all of the launch control bullshit.\n\nedit- 5-60 would also mean we wouldn't be wasting any more time arguing over rollout. Every time Tesla comes out with a faster car, it happens. I swear I've witnessed each in TMC and/or /r/teslamotors with the P85D, then P90DL, P100DL, Raven Performance, and now Plaid. Wake me up when the inevitable rollout argument thread hits after the Roadster's release.", "score": 2, "replies": []}]}, {"body": "30 cm is 11.81 inches", "score": 2, "replies": []}]}, {"body": "There are always conditions to everything. What if there is headwind? Old tires? Wet? The road isnt flat?... As long as it is not missleading it is fine.", "score": 6, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "If its somehow mentioned that its under special conditions then not imo.\n\nBut then again if you buy any car that says it has a 0-60 in 8 seconds doesnt mean you personally will be able to do a 0-60 that fast, it just isnt in your skillset. Its just an orientation.\n\n0-60 in 1.99 is faster then everything else and the car actually is faster then anything else so yeah. Dont see the need to discuss if its 1/10 of a second slower or not. In the end its also just advertising 🤷🏼‍♂️", "score": 2, "replies": []}]}, {"body": "Hey fair enough, I'm just playing devil's advocate here.\n\nPersonally I do feel it a bit misleading, but that's just my opinion. Tesla has cool enough cars to not need to stoop down to these tactics.", "score": 0, "replies": [{"body": ">Personally I do feel it a bit misleading,\n\nThen you aren't *playing* devil's advocate.", "score": 3, "replies": [{"body": "I'm allowed to have an opinion on the subject, thank you very much.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Breaking 2.0 seconds just sounds so much more impressive than 2.1 or whatever a typical user will get.  I'm not surprised Tesla did everything possible to get that number to be reported as under 2.0.", "score": 2, "replies": []}, {"body": "While this sub is clearly biased towards Tesla, r/cars is clearly biased against. Obviously everyone has bias in some way but Reddit is unfortunately not designed for discussion of differing opinions.", "score": 4, "replies": [{"body": "Ain't that the truth", "score": 1, "replies": [{"body": "I’m not sure if you realise however is that how Tesla is reporting the time is how everyone else reports the time. It’s the standard for these types of tests\n\nThis isn’t a Tesla is exaggerating thing. This is a Tesla is following the same rules as everyone else thing", "score": 3, "replies": [{"body": "I'm just the messenger buddy", "score": 1, "replies": [{"body": "Messenger for what? People are confused how drag times have been measured for 80 years?", "score": 2, "replies": [{"body": "Sure? \nI saw a link, so I posted a link. It pertained to a post from yesturday regarding the very subject and a debate between two Redditors in which a $100 charitable donation bet was made.\n\nTrying to have some conversations. It doesn't have to mean anything. It just is what it is.", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "Big Lots (BIG): The story of an underdog with strong financials", "selftext": "Searching for companies that have a low price/earnings ratio is the fundamental principle behind value investing. It is in that regard that I bring to you Big Lots (BIG).\n\nHere we have a company that cares about its share holders and delivers year after year. Its financial record is strong as can be seen:\n\n&#x200B;\n\n[note increase in revenue & net income, decrease in shares outstanding every year](https://preview.redd.it/j11gf8otq1671.jpg?width=1553&format=pjpg&auto=webp&s=268d11048e09a2d8ac572f8cdd25bf2abf4c1e59)\n\n&#x200B;\n\n[cash on hand increased, 2020 was the company's best year](https://preview.redd.it/mut21up0r1671.jpg?width=1507&format=pjpg&auto=webp&s=d5939f22b8158279987737c5f5818e27b59807e9)\n\nNet income has increased every year and its financial position became even stronger in 2020. The company has been profitable every year since 2006.\n\nNow you would think that a company like Big Lots would see some of its revenue eaten up by the likes of Amazon and other online retailers but this is not the case. This is because big lots offers an alternative shopping experience that other companies without retail shopping centers cannot provide, BOPIS or buy online pick up in store. Unsurprisingly, many people don’t want to wait for shipping and would rather pick up their item(s) in store.\n\nNow that does not mean that big lots is not aware of the changing dynamic within the customer shopping experience. In 2019 they launched Operation North Star.\n\nThis has three major objectives:\n\n1. Drive profitable long-term growth\n\na. grow e-commerce sales.\n\nb. grow store count.\n\nc. strengthen their home offerings.\n\n2) Fund the journey\n\na. expanding gross margin rate\n\nb. increasing organizational efficiency\n\n3) Create long-term shareholder value\n\na. the first two objectives will increase earnings growth\n\nb. the 2020 share repurchase program which in the fourth quarter of 2020 consisted of buying back 1.6 million of their 39 million outstanding shares.\n\nWhen looking into the financials of Big Lots there is a trend that dates back to 2005. Back in 2005 they had 115 million shares outstanding and as of 2021 they currently only have 39 million shares outstanding. I found this to be of particular interest when considering shareholder value, typically as time goes on the shares outstanding of a company tend to increase but in the case of Big Lots the company has a consistent record of buying back their own shares. This reflects in their earnings per share as it was $0.21 in 2005 and now is a whopping $16.11. Everything in the financial records of the company indicates that Big Lots is undervalued.\n\nLets compare big lots to target to see if the market has priced it accurately:\n\n|**Year 2020**|**Big Lots**|**Target**|\n|:-|:-|:-|\n|Number of stores|1404|1909|\n|Market Capitalization|$2.38 Billion|$115.2 Billion|\n|Net Income|$629 Million|$4.368 Billion|\n|Price/Earnings Ratio|3.99|19.02|\n\n&#x200B;\n\nAs can be seen the market does not realize the true value of big lots. This is a company that has a proven track record of increased revenue, gross profit and earnings per share year after year.\n\nBig Lots also offers customers incentives to continue shopping at their company through the BIG rewards program. This program provides coupons and incentives for customers and encourages new membership. Through the beginning of 2021 the BIG rewards program had nearly 21 million active members. The value presented in this base of membership cannot be overstated; incentivizing customers to keep coming back by providing discounts for further purchases all but ensures that they will be retaining their core customers.\n\nTLDR: Big Lots (BIG) is an underappreciated company with an impressive balance sheet. Its current shopping experience is only rivaled by companies that are valued at hundreds of billions of dollars while Big Lots’ entire market cap is $2.5 billion.\n\n*Not financial advice, please do your own research.*\n\nedit: current position 1x $72.5c exp 7/16. & 10 shares\n\nEDIT #2: Looking through the financials it appears that a large portion of their net income came from the sale of four distribution centers in 2020. In 2020 revenue increased 16% while their net income increased 260%. This also explains the significant increase in cash on hand.", "id": "o2sl0l", "created_utc": 1624032348.0, "score": 15, "upvote_ratio": 0.64, "num_comments": 51, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|2 months ago\n**Total Comments**|81|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/o2sl0l/big_lots_big_the_story_of_an_underdog_with_strong/) [x](https://www.reddit.com/r/wallstreetbets/comments/nr21l5/blackberry_a_company_with_enormous_potential/) \n**Account Age**|9 months ago|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": [{"body": "I love this bot.", "score": 7, "replies": []}]}, {"body": "They're a pretty solid company.  They're doubling down on furniture which imo is a good bet.  Also, if your tight on cash you can use progressive leasing though them and pay payments.  It's expensive, around double, but still cheaper than Aaron's and rent a center.  When I went though a divorce a few years ago that's what I did to get a new bed.", "score": 9, "replies": [{"body": "I might need to visit a Big Lots again. My first experience was three years ago, not a great one.  But, this might turn out to be a big play.", "score": 5, "replies": []}]}, {"body": "Good find. Go $BIG or go home!", "score": 10, "replies": []}, {"body": "Deep in BIG, I think you’re right!", "score": 8, "replies": []}, {"body": "Unrelated to the stock, but the Big Lots by my house used to be trash. I went in there the other day for the first time in a couple of years and was very happy with the experience. Will be back again. Might buy a share or two to support them too.", "score": 15, "replies": [{"body": "I was about to comment about the one and only time I walked into a Big Lots.  It was such trash, I refused to go back.  Maybe it will be better as you have mentioned, but I have refused to go back into one.  That's how bad my experience was.  Worse than a dying K-Mart.", "score": 6, "replies": [{"body": "Could be worse. AMC near me closed down months ago. Then all these DDs popped up. Glad people made money, but damn if it’s not scary having the only threaten in your area turn into a hardware store.", "score": 3, "replies": []}]}, {"body": "Yeah they've completely changed over the past year or so. Big Lots used to be the place to shop only if you like buying expired food and low-budget housewares. Now they carry a lot more furniture and stopped trying to compete with Dollar Tree.", "score": 3, "replies": [{"body": "I’d argue that their furniture is junk. You’re better off going to a local discounted type store and picking up something there. Even ollies gets some good brands every now and then. \n\nThere’s a place near me that deals in bulk, local place on 380 (hence the name 380 auction) that gets all sorts of name brand furniture and sells it at fractions of the cost of Levins. My couch and love seat combo was $900, a simple couch at any of those places is upwards of $1k; I’ve had it around 7 years now and it still looks and functions great. Ashley brand.", "score": 2, "replies": []}]}]}, {"body": "One thing to add,  I commented on a post a week or two ago about $BIG  and one of the commenters brought up that investors like to see a retail chain that is expanding.\n\nI checked the new store openings for big lots is supposed to be 20 stores this year, up from 1408 stores, a 1.4% store count increase.  [source](https://www.google.com/amp/s/www.wsj.com/amp/articles/discount-chain-big-lots-invests-in-new-stores-as-stimulus-checks-boost-sales-11623163022)\n\nNow TJX  is increasing store count by ~2.5%.  [source](https://www.google.com/amp/s/www.cnbc.com/amp/2021/03/21/store-openings-2021-10-retailers-that-are-opening-new-shops.html)\n\nIn conclusion, TJX is increasing store count at a 78% higher rate than BIG  but PE ratio is 1,300% higher.  Seems to me BIG should go up.  What are we missing here?  And when is it  time to buy $BIG FDs?", "score": 7, "replies": []}, {"body": "So, does $BIG have BIG potential?  With the way the game has been played here recently on WSB, its all about the ticker name.  Sounds crazy, but true.  \n\nI think the financials here are compelling. I really don't like the store, but I am one person, out of millions.\n\nI can respect the positions you have, you are not a high roller here, but you are contributing by posting DD.  If BIG picks up big (didn't mean that pun), you'll be wishing you had a bigger position.\n\nI will scoop a few calls and shares!", "score": 5, "replies": [{"body": "I read their 10k, the company has good potential and is undervalued. they care about their shareholders and devote a good portion of the writing into how the company is setting itself up for future growth.", "score": 6, "replies": [{"body": "Well, I need something to make my portfolio grow, hopefully $BIG is it.", "score": 5, "replies": []}]}]}, {"body": "Nice find. They have room to grow their online presence as their websites a bit basic, I wonder if theres anything in the woodwork to revamp their ecommerce platform", "score": 5, "replies": [{"body": "I just checked out the website for $BIG.  Room for improvement for sure.", "score": 3, "replies": []}]}, {"body": "Positions?", "score": 7, "replies": [{"body": "They got posted at the bottom.  Not a screen shot, but based on the amounts listed, I believe them.", "score": 8, "replies": []}]}, {"body": "I went into one once and it smelled bad.  I can’t shop in a stinky store.", "score": 5, "replies": []}, {"body": "BIG if true..", "score": 4, "replies": [{"body": "BIG indeed", "score": 3, "replies": []}]}, {"body": "How 🦍 make 🍌 tho", "score": 7, "replies": [{"body": "Go $BIG.  Seems simple enough.", "score": 2, "replies": []}]}, {"body": "Someone needs to call $BIG into Cramers lightning round.  Maybe he has been to a big lots and has talked to the CEO and knows all.", "score": 3, "replies": []}, {"body": "Fucking Big Lots?", "score": 7, "replies": []}, {"body": "We just need to all get on the same page. We are everywhere right now and it’s showing.", "score": 0, "replies": [{"body": "What page is there to get on?  Collusion?  I mean, this is WSB not lets all pick one stock and pump it up.", "score": 7, "replies": []}]}, {"body": "Lol big lots is trash. Like a notch below k mart, which is just under Walmart.\n\nEdit: for the same amount I'd rather buy SNAP, a company that I use and enjoy regularly", "score": -3, "replies": [{"body": "Big lots has all name brand shit for a nice discount and there’s no fucking lines. What’s not to love Dipshit", "score": 2, "replies": [{"body": "Back in 7th grade Big Lots was the go-to spot for cheep candy. That's all it ever was, and all it ever will be.", "score": 3, "replies": [{"body": "they are sitting on a mountain of cash, have a 1.5x asset to liabilities ratio and have been profitable every year; they are not going anywhere.", "score": 3, "replies": [{"body": "Proof?\n\nEdit: proof of your positions", "score": 1, "replies": [{"body": "Read balance sheet data posted.  As of 1/31/2021 it’s 4,037M assets, 2759M liabilities.  4037/2759= 1.46", "score": 2, "replies": []}]}]}, {"body": "Cheap candy is where it's at!!  I didn't have a BIG in my town, but I definitely would frequent other places simply for some cheap candy.  \n\nHonestly, that should be the DD.  \n\n$BIG Lots DD: 🍭", "score": 3, "replies": []}, {"body": "I just got some pretty good patio furniture and a new pull-out sleeper chair for my office. Prices were great, and quality is 1000 times better than the stuff I find at Walmart.\n\nDon't sleep on the current Big Lots.", "score": 2, "replies": [{"body": "I'm not calling you a liar, just saying I find that hard to believe.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Are you actually spamming someone's DD with other tickers?", "score": 1, "replies": [{"body": "Whoops thought it was in the daily", "score": 1, "replies": [{"body": "That's fair. But since you are here, would you like to hear about $BIG?", "score": 1, "replies": [{"body": "I actually read through ur DD fine sir, you did great job here. I’ll buy some most likely Monday.", "score": 1, "replies": [{"body": "I'm not the OP, but I'll pass it along.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "This sub sure does love to push some of the worst possible companies.", "score": -8, "replies": [{"body": "did you even read the post?", "score": 11, "replies": [{"body": "Yes. It's a boring potentially not terrible long term stock.", "score": 2, "replies": []}]}, {"body": "Doubled in 12 months, steady appreciation, dramatic improvement in facilities and has expenses under control.  Maybe too pedestrian for you (and that’s ok).  But a lot of folks can’t tolerate yolo risks.", "score": 3, "replies": []}]}, {"body": "A lot of retail businesses are way behind in their rental and mortgage payments.  The only thing keeping them solvent is a moratorium on foreclosure/eviction.\n\nHow is Big Lots doing with their lease and mortgage payments?", "score": 1, "replies": [{"body": "they own 50 of their stores and lease out the rest. the typical lease terms are for approximately ten years with multiple five-year renewal options. the foreclosure/eviction moratorium does not apply to them as it in not listed in their risk factors. also, 2020 was their best year by all metrics, allowing them to significantly increase their cash on hand.", "score": 3, "replies": []}]}]}
{"title": "Why ITUB still has potential and why you shouldn’t sell", "selftext": "The muted giant. The new apple smart product the iTub. Ran by a legendary Chad…who we all aspire to be. iTub was very big talk on wsb and Reddit the past week but has since gone dark. \nWhy?\n\nBecause no one has enough to say about it for their post to not get removed…\n\nAnyways, those 7/16 8c whale orders everyone was talking about are down about 50% now. I myself have 307 7/16 8c at .09 a contract so I’m down about 54% or $1,500. But….\n\nI’m not worried at all. Anyone holding these calls will see significant upside in the 7+ $range. Whales don’t buy calls to lose money, right?\n\niTub has decided to contest the allegations of currency manipulation that’s supposed to cost them a trillion dollars or whatever.\n\nWhen we look at the chart, we see an upwards channel that has created higher highs and higher lows. This is Brazilian banking beginning to come out of the covid crash. Rates were just raised, Buffett is betting on Brazil, the CEO is named Chad, and whales are betting on this stock that also has roughly 20% short interest. This could easily move to the 7+ range in the next few weeks and I’m sure we are going to get some sort of news in that time period.\n\nTLDR: Chad=iTub\n\nPositions even though I already said it:\n\n307 7/16 8c. They are cheap af so pick up some lottos while you can.", "id": "o2z9uz", "created_utc": 1624047527.0, "score": 38, "upvote_ratio": 0.67, "num_comments": 57, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|3 months ago\n**Total Comments**|18|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/nzfy6u/bullish_on_extra_chromosomes_on_twnk/) [x](https://i.redd.it/uxisy861sx571.jpg) [x](https://www.reddit.com/r/wallstreetbets/comments/o2z9uz/why_itub_still_has_potential_and_why_you_shouldnt/) \n**Account Age**|1 year ago|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": [{"body": "Chad", "score": 1, "replies": []}]}, {"body": "don't tell me what to do *JARED*", "score": 11, "replies": [{"body": "Sorry Bill Hwang", "score": 8, "replies": [{"body": "that's quite alright *JARED*", "score": 6, "replies": []}]}]}, {"body": "I’m with you on those 7/16 $8c. Loaded up on them earlier in the week. Not ideal so far, but not sweating it. Biggest bank in the Southern Hemisphere, looking for a little 2-3 week Brazilian bank run is all 🤷🏻‍♂️", "score": 10, "replies": []}, {"body": "They were so cheap i had too.  7/16 $8c x20 bought in at .08  down to 0.4 at market close\nTotal cost: $80\nCurrent price: $40\nMax loss: $80\n Gain potential:  🌙", "score": 8, "replies": []}, {"body": "I am in the same boat holding 7/16 calls. That being said, if the price falls even more, I will be loading the boat again on these cheap calls.\n\nReason I am not worried is because the entire financial sector of Brazil dropped Friday.", "score": 9, "replies": [{"body": "Real was sold off as well", "score": 5, "replies": []}]}, {"body": "I bought 5 7/16 8c and your post just inspired me to buy more Monday at open.  They’re basically like dollar scratch offs but if one wins, they all win.", "score": 6, "replies": [{"body": "Exactly", "score": 2, "replies": []}]}, {"body": "Holding shitloads of calls, having done badly in the market recently this was supposed to be my rebound. I have stared sweating a bit", "score": 4, "replies": [{"body": "You’ll be good bro", "score": 4, "replies": [{"body": "Mate, given the rsi divergence and fridays short volume, if it wasn’t for quadruple whitching I would have sweared that whoever bought this calls has been hedging, hope I m good", "score": 3, "replies": [{"body": "Only time will tell", "score": 2, "replies": []}]}]}]}, {"body": "I’m in on ITUB. Let’s hope it makes a run. I hold $7 calls for July as well. May buy more now since they are pretty cheap after the dip.", "score": 9, "replies": [{"body": "I have them 7/16 8c lottos", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Yes.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I sold a few days ago", "score": 1, "replies": []}]}]}]}]}]}, {"body": "once i get my check ill buy 100 7c on monday", "score": 7, "replies": []}, {"body": "Congrats on becoming an itub bag holder", "score": 13, "replies": [{"body": "I’ll be your wife’s boyfriend in a few weeks", "score": 25, "replies": [{"body": "How’s that going", "score": 1, "replies": []}]}]}, {"body": "There is a fucking bearish rsi divergence, after hours was bad as well, BRL rallied unless there are news, I’m sweating", "score": 2, "replies": [{"body": "Imagine acknowledging Friday after hours", "score": 6, "replies": [{"body": "You re right. Position 2300 8c 07/16 at 0.04 each contract and swearing\n\nThe good thing is that open interest is still through the roof", "score": 6, "replies": [{"body": "And you’re in at .04", "score": 3, "replies": []}]}]}]}, {"body": "Sorry, even if the fundamentals are good...the weekly chart is too bearish", "score": 3, "replies": []}, {"body": "They’re getting sued for currency manipulation idk if this is the play here", "score": 2, "replies": [{"body": "They are contesting it and it’s like them and 6 other banks. They committed $70 billion US to improving the environment and economy of Brazil. Not sure they would do that if they knew they were screwed.", "score": 7, "replies": [{"body": "KAPOW good point…", "score": 3, "replies": []}]}]}, {"body": "Sold and bought CLNE. Smart money moves🚀", "score": -6, "replies": [{"body": "You are probably a millionaire now so if you want to be a billionaire invest in $CHAD with those gains.", "score": 2, "replies": [{"body": "Nah, CLNE is killin it!", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "I believe in the insider trading and nothing on this sub will do anything", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "We have until 7/16 as far as I’m concerned", "score": 7, "replies": []}, {"body": "That math", "score": 3, "replies": []}]}, {"body": "Load of bollocks. The 7/16 8 call was one leg of an 7-8 call spread that cost 5c and printed 100k.  They have $500k on the line. Only just qualifies as a yolo on wsb.  Classic pump and dump.", "score": -5, "replies": [{"body": "How do you know it was part of a call spread", "score": 1, "replies": [{"body": "On the 6/14 the following four trades were booked with condition code of Multi Leg Auction Execution Trade:\n\n21:09:42 7/16 8c 50k@0.03 and 7c 50k@0.08\n\n21:09:31 7/16 8c 50k@0.03 and 7c 50k@0.08\n\nIt is extremely unlikely that these were someone buying a combo of buying both strikes.  It was a call spread.  Possibly only 50k were done and the second print is a duplicate or more likely is that the order got split between two marketmakers.", "score": 1, "replies": [{"body": ">Multi Leg Auction Execution Trade:\n\nThanks, but how do you have the information that they were booked using this condition?", "score": 1, "replies": [{"body": "Because I have a Bloomberg Terminal and that is the Condition Code displayed next to them.", "score": 1, "replies": [{"body": "Ok, can we then become friends?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": -10, "replies": [{"body": "Not even a new meme stock. It has some meme potential but it has real potential too.", "score": 7, "replies": []}]}, {"body": "Hi", "score": 1, "replies": []}, {"body": "Going to get some cheap 7/18 calls too", "score": 1, "replies": []}]}
{"title": "It ain’t much but YOLO quad witching w/ NVDA", "selftext": "", "id": "o32ux4", "created_utc": 1624058163.0, "score": 29, "upvote_ratio": 0.67, "num_comments": 53, "comments": [{"body": "Ehh it ain’t much on here but it’s more than nothing. Nice job but you haven’t earned a fuck you yet.", "score": 10, "replies": [{"body": "Lmaoooo true that. I’ll post my AMC calls from the other week when I’m craving it", "score": 5, "replies": [{"body": "Bruh people are throwing a fit that it isn’t crashing but I found a broken 8 ball outside my homeless shelter and it says I’m about to be fucking loaded", "score": 9, "replies": [{"body": "If it’s any consolation prize to them, I papered handed 2 $720 calls I bought for $600 each 🤦‍♂️", "score": 3, "replies": [{"body": "Oof. Honestly I misplayed the crash a bit too but made it out in more than one piece. This week definitely strengthened my faith in the amc trend. Which will likely singlehandedly sink it lol but honestly that it keeps going and didn’t fall off on the 11th is encouraging.", "score": 3, "replies": [{"body": "Couldn’t have said it better myself.", "score": 1, "replies": []}, {"body": "[This surely had a big hand in the battering this week ](https://www.reuters.com/business/quadruple-witching-friday-see-818-bln-single-stock-options-expiration-goldman-2021-06-18/)", "score": 1, "replies": [{"body": "Iiinteresting.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "These screenshots are intraday and not closed positions. NVDA stock lost all its gain today and closed flat. Did you close before the fall from 775 to 745? Provide proof. Most got burned today", "score": 4, "replies": [{"body": "You are correct. I also have them all in my order history. I can send to you if you’d like. I actually sold for higher prices than these.", "score": 2, "replies": []}, {"body": "I’ve been burned hella plenty times. On Friday’s I’m selling in the first 2-15 minutes. Today I waited a little longer.", "score": 2, "replies": []}]}, {"body": "Nice and fuck you , I bought 785 calls for 7-19, will the stock keep going", "score": 4, "replies": [{"body": "Ape Theory dictates stonks only go up 🦍🤷‍♂️💎🙌🚀", "score": 5, "replies": [{"body": "LFG800", "score": 2, "replies": []}]}, {"body": "One analyst gave a pre-split pt of 900. It's hitting 8 for sure", "score": 2, "replies": []}]}, {"body": "NVDA be lettin you put it on auto pilot", "score": 5, "replies": [{"body": "Billy Mapes here. Just set it and forget it.", "score": 3, "replies": [{"body": "Set it, forget it and your tendies come out cooked to perfection.  Even better. For every tendie you put in June, four delicious tendies come out in July.", "score": 3, "replies": [{"body": "If you buy before 4 PM today, you’ll get 4 for the price of 1 on Monday 😱😱😱😱", "score": 3, "replies": [{"body": "I think July 20 is the date.", "score": 1, "replies": [{"body": "Yeah that’s the date but I think OP is wrong.  I was thinking the same thing but that would be giving away a lot of money free.  We are misunderstanding it OP, our stock gets split into 4 so the 1 we own now is 4 hence 3 free shares.   Ideally wished they gave us 3 free stock per one we own…. That would be at today’s price , 2320 of free $ in shares lol", "score": 2, "replies": [{"body": "That would be nice lol", "score": 2, "replies": []}, {"body": "The price also splits : )", "score": 1, "replies": []}]}, {"body": "Can anyone clarify if I’m right?", "score": 1, "replies": [{"body": "It's worded very oddly. June 21 is the shareholder of record date. July 20 is when we're issued the additional stock and it starts trading at the new price.", "score": 1, "replies": [{"body": "So you’ll get three more shares totaling over 2320$ (at today’s price) for every 1 you own 6/21 when the split completes in July ?", "score": 1, "replies": [{"body": "No you'll have four shares at 750 (or price on7/20)/4", "score": 2, "replies": [{"body": "That’s still great considering we will see a run up after since more guys will jump in at a lower price per share", "score": 1, "replies": [{"body": "That's definitely the impetus to get in before the split", "score": 1, "replies": []}]}]}, {"body": "So if it's $800 for 1 share, on 7/20 you'll have 4 shares worth 200 each", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "nvda is for strong bulls 😤 congrats n fuk u", "score": 3, "replies": [{"body": "[🙏 & 🖕as well fellow 🦍 ](https://m.youtube.com/watch?v=Yio9_-5TMew)", "score": 3, "replies": []}]}, {"body": "Could go down on Tuesday since ownership record day for split is Monday.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You will still get the “4 for 1” but your broker will be the one forwarding them to you. Most people just prefer to buy before then.", "score": 2, "replies": []}, {"body": "They don't get the dividend on the additional stocks", "score": 1, "replies": []}]}, {"body": "Very good point but remember retail traders loves them post split price stock they once thought was expensive. Let’s see what the new brings us all 😎🤞💎🙌🚀🌚", "score": 1, "replies": []}]}, {"body": "Did you sell before the dump?", "score": 2, "replies": [{"body": " Around 10 am", "score": 3, "replies": [{"body": "Nice", "score": 1, "replies": [{"body": "I bought some FOMO calls for next week", "score": 3, "replies": []}]}]}]}, {"body": "Why nvida?", "score": 2, "replies": [{"body": "Because there is something called a stock split happening.  Hint check stock prices for Tesla and Apple last year in run up to split.", "score": 2, "replies": []}, {"body": "Well. Cause the I like the stonk", "score": 1, "replies": [{"body": "Good luck with that", "score": 1, "replies": [{"body": "You short bro?", "score": 1, "replies": [{"body": "Nope. I never short", "score": 1, "replies": [{"body": "Never say never. Buy the ticket, take the ride.", "score": 1, "replies": [{"body": "If anything l’d be short on nvda. Wish you the best tho", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "When did you buy it?", "score": 1, "replies": [{"body": "$730 on Wednesday. $750 & $760 yesterday", "score": 3, "replies": []}, {"body": "Which one? The $730, $750 or the $760?", "score": 1, "replies": []}]}]}
