{"title": "How much longer is AAPL going to go down?", "selftext": "[deleted]", "id": "poqk2c", "created_utc": 1631713990.0, "score": 0, "upvote_ratio": 0.23, "num_comments": 37, "comments": [{"body": "If any of us knew that we’d be millionaires. Unfortunately none of us have a crystal ball in our rooms, so your guess is as good as ours.\n\nIn future you should probably stick to buying stock rather than trading options - you’ll feel much safer and won’t have to worry about timing.", "score": 27, "replies": []}, {"body": "You're asking how long AAPL will go down for? after being down 5-6%... For a week... From ATH...", "score": 40, "replies": []}, {"body": "Dont invest Money you are crying about when losing.", "score": 26, "replies": [{"body": "Lose your money happily.", "score": 22, "replies": []}]}, {"body": "October is two weeks away. The time value of your options is decaying rapidly. So you’re heavily dependent on the price rising about your strike+premium to have any value. Given that the main catalyst is behind us—the Apple product launch event—if that price is more than 5% higher, I’d look to cut my losses. I just don’t see what moves this stock higher than that before the next earnings.", "score": 10, "replies": [{"body": "News tomorrow: Apple hit by massive security breach.\n\nMarket: lol yolo AAPL up 10%.", "score": 3, "replies": []}]}, {"body": "Why the fuck would you buy calls?  It is hard enough to choose a stock that will perform well over the long term.  Why make it harder by trying to also predict what time it will hit a price.", "score": 5, "replies": []}, {"body": "lmfaoo u bought Calls at ATH? u deserve to lose your $$", "score": 3, "replies": [{"body": "SPY is at all time highs dumb fuck, but look what’s happening", "score": -2, "replies": [{"body": "lmfaooooo, you’re just mad cz ur about to lose all your money u dumb fuckin cry baby.Never heard of Vega? how about Theta? or even better, IV? lol, look at an options chain next  time you dumb fuckin moron", "score": 5, "replies": []}]}]}, {"body": "Understand why buying short term aapl calls was probably a bad idea.", "score": 5, "replies": []}, {"body": "After the stuff they showed off yesterday.... No wonder they go down. But chill they hit ath just a couple of days ago. \nAnd as always, they will pop upwards once you  sell.", "score": 5, "replies": []}, {"body": "Stop gambling on options if you're not prepared to deal with an inevitable loss every once in a while. There's a reason people sell options, and it's not because they think they're going to lose money. Make sure to put a stop loss on your next purchase if you want to limit your losses.", "score": 3, "replies": []}, {"body": "AAPL is one to buy shares of, not short term OTM calls.", "score": 2, "replies": []}, {"body": "I kept trying to warn people about buying AAPL at those highs... AAPL can fall to 140 this month so do not be surprised. Cut your losses on the pumps", "score": 2, "replies": []}, {"body": "Apple is down 4 percent from ATH bro", "score": 2, "replies": []}, {"body": "Why even let your calls get to down 70%…should have had a stop at -25%", "score": 4, "replies": []}, {"body": "nobody knows. its unpredictable. dont invest money you cant lose.", "score": 3, "replies": []}, {"body": "Stop buying Calls!!!! Don’t be greedy. Your greed bit you in the ass.", "score": 5, "replies": [{"body": "There's nothing wrong with buying calls if you know what you're doing. They clearly didn't.", "score": -4, "replies": []}]}, {"body": "This is so cute", "score": 3, "replies": []}, {"body": "Options are gambling. Only bet what you can lose.", "score": 2, "replies": []}, {"body": "By the look on today's chart atleast 1 day", "score": 1, "replies": []}, {"body": "Damn, I feel for you. Next time do not get calls that will expire way too soon. \n\nI bought a few yesterday, but that is knowing it may very well keep on sliding the rest of the week so I don't really feel bad about it.", "score": 0, "replies": []}, {"body": "Only until you sell", "score": -3, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Panic sell for spyware? Lol no. That’s not it.", "score": 1, "replies": [{"body": "Did you really laugh out loud? I call bull shit.", "score": 0, "replies": [{"body": "Yes Bruce, I did.", "score": 1, "replies": []}]}, {"body": "I'm gonna delete my comment lmao i just re read what OP posted", "score": 1, "replies": []}]}, {"body": "> Just hold, this is just a panic sell for some spyware issues. But if you sell you'll lose your money for sure.\n\nHe’s holding options. He will lose money when they expire in October unless Apple runs up before then.", "score": 1, "replies": [{"body": "Fuck I'm dumb lmao I read through it too quickly. I was quite confused when checking the charts", "score": 1, "replies": []}]}]}, {"body": "2-3 weeks max. Or days. Or months.", "score": -1, "replies": []}, {"body": "Just a few more days....", "score": -2, "replies": []}, {"body": "A good bit. The new iPhone isnt all it's cracked up to be", "score": -3, "replies": []}, {"body": "Just see this, but I do not have any idea (this is not my idea or I do not recommend). Just read, understand and take your decision.\n\nMany do not believe in TA.\n\n[https://www.tradingview.com/chart/AAPL/wHyiSJ4N-AAPL-Time-to-buy-Hang-on/](https://www.tradingview.com/chart/AAPL/wHyiSJ4N-AAPL-Time-to-buy-Hang-on/)", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Wednesday, Sept 15, 2021", "selftext": " \n\n**PsychoMarket Recap - Wednesday, September 15, 2021**\n\nStocks steadily rose today, shaking off earlier losses and recent, driven mainly by the energy and industrial sectors, as market participants digested new economic numbers and the coronavirus situation in the US. The S&P 500 (SPY) closed 0.83% higher, the tech-heavy Nasdaq (QQQ) closed 0.73% higher, the Dow Jones (DIA) rose 0.7%, and the Russell 2000 (IWM), which tracks the performance of small-caps, rose 1.09%. Not surprised by this at all, I have been saying for months I remain bullish and have been buying on every dip until the Fed begins discussing interest rate hikes.\n\nThe Labor Department reported that its Consumer price index (CPI), which tracks the price of a weighted average market basket of consumer goods and services purchased, rose at its slowest pace in six months in August, suggesting that while the inflation rate may remain high for a while due to supply-side constraints, it’s likely the rate of increase has already peaked. Core CPI, which excludes volatile food and energy prices, increased 0.1% last month, the smallest gain since February and below the 0.3% rise in July. On a year-on-year basis, CPI has decreased to 4% from 4.3% in July, an encouraging sign. Economists polled by Reuters had forecast the core CPI gaining 0.3% and the overall CPI rising 0.4%. It may not seem like it but this is a large month-to-month change.\n\nThe Fed's preferred inflation measure for its flexible 2% inflation target, the core personal consumption expenditures price index, increased 3.6% in the 12 months through July after a similar gain in June. August's data will be published later this month.\n\nIn global news, new economic data coming out of China suggests the recovery in the second-largest economy is losing steam. Retail sales, a key gauge of Chinese consumer consumption rose just 2.5% year-over-year in August, a massive deceleration from the 8.5% YoY growth recorded in July and a sharply missing estimates of 7% growth. Separate data released Wednesday by the statistics bureau showed home sales by value falling by 19.7% in August from a year ago, the largest drop since April 2020—at the height of the pandemic.\n\n**Highlights**\n\n* Apple (AAPL) released a new generation of products, including the new iPhone 13\n* US crude oil prices post rose sharply after the Energy Information Administration report that crude oil inventories declined by 6.4 million barrels last week amid pressure from Hurricane Ida, the lowest level since 2019\n* US manufacturing production decelerated in August, likely due to disruption by Hurricane Ida and ongoing supply-side disruptions. The Federal Reserve's latest data showed manufacturing production rose by just 0.2% in August, or half the gain expected, based on Bloomberg consensus data. Production had risen by 1.6% in July. \n* EV-maker Rivian, which is backed by Amazon, hopes to raise as much as $8 billion in an upcoming US IPO.\n* One of General Motors Co's China joint ventures said on Wednesday it is developing auto chips and aims to increase use of locally sourced chips in the next five years.\n* Whatsapp, which is owned by Facebook (FB), launched a test of an in-app business directory.\n* Volvo is also gearing up for a $20 billion IPO in the coming weeks, according to Reuters. \n* Elon Musk-led SpaceX’s Inspiration4 rocket is scheduled to launch an all-civilian crew of four into orbit for three days on Wednesday, a mission that will be streamed live on Netflix (NFLX)\n* **Sorry no price target upgrades, ran out of time**\n\n***\"The future belongs to those who believe in the beauty of their dreams.\"*** **-Eleanor Roosevelt**", "id": "poy1t0", "created_utc": 1631737060.0, "score": 86, "upvote_ratio": 0.95, "num_comments": 34, "comments": [{"body": "Today looked pretty good for all the doom talk the last week.", "score": 22, "replies": [{"body": "It always happens, a few red days and everyone acts like the next crash is coming \n\nNo point being a doom sayer and missing out on the incredible gains this market has to offer. Just plan for the downside all youll be alright", "score": 20, "replies": [{"body": "How to plan for downside aside from sitting on cash?", "score": 7, "replies": [{"body": "Stops on trades to mitigate downside and make sure your long-term account doesn't get margin called if something bad happens", "score": 8, "replies": [{"body": "like a stop loss? but doesnt that defeat the purpose of buying dips?", "score": 3, "replies": [{"body": "One should always use stops when trading, protects downside\n\nNote that is a massive difference between trading and investing", "score": 5, "replies": []}]}]}]}, {"body": "I'm in the camp that actually think the market it about to crash. \nI'm not here to try and prove you wrong but actually the opposite \nWhy isint the market going to take a turn? \n\nGiven that the amount of leverage in the market it wouldnt take much to tilt the scales in the other direction. \nI think if you see a 5% decline \nExpect it to continue.", "score": 2, "replies": [{"body": "I'd love a 5% or even 10% drop jeez, Id buy that whole dip up\n\nIve given my reasons for being bullish a million times, check past recaps you'll see why\n\nPeople have been calling a crash since like 2018, I dont see any reason to go against that trend and lose out on gains. Even if the market crashes, Ive made so much dip buying, I'd just do it again\n\nThere is a saying that goes \"Pessimists sound smart, optimists make money.\" I fully believe that", "score": 13, "replies": [{"body": "If its down 5 its most likely going down alot more. \nI quick reason why I believe so. \nI invested in gamestop in January trying to make some money like we all are. \nWoke up one morning to find out retail investors weren't about to buy the stock anymore, just sell. \nCould of easily sold for 300% gains but something felt fishy.\nLittle did a know I would spend the next 9 months spending my days reading and listening to everything regarding the market. \nI've learned that the leverage in the market is at levels that are honestly scary. \nThat coupled with rehypothocated securites you end up with a house of cards, a few bad weeks and the whole thing can come down on our heads. \n\nThe reverse repo has been in the trillions for over 2 weeks \nInflation is clearly not transitory  5.4 to 5.3 does not mean it's going down \nThey leave out the things that are really inflating so it's not like it matters anyway. \nAnd to top it off \nThe US is closer to defaulting on their debt then they have ever been \nCongress is the biggest joke \n\nI can keep going but I want to know what I'm missing \nI keep thing this shit is going to blow \nI ACTUALLY want to know what it is I'm not seeing that makes everyone so bullish on the overall market \n\nCheers", "score": -2, "replies": [{"body": "No offense at all my friend, but reading this it seems to me like you have gathered most, if not all of this information from those doom and gloom posts that have been floating around recently.\n\nYou say the Fed leaves things out it doesn't want, that is factually incorrect. Inflation has been calculated the same way for decades at this point at there is a very good reason why food and energy prices aren't calculated into core inflationary readings. Food and energy are left out because their prices can be too volatile or fluctuate wildly due to exogenous events (i.e. food prices rise during a drought, or oil prices rise or fall based on supply/demand.  Moreover, Food and energy are necessary staples, meaning demand for them doesn't change much even as prices rise.\n\nI would advise you to do some more research outside of Reddit, I have seen pretty much exactly what you wrote rehashed several times at this point\n\nSome basic reasons I'm bullish\n\n1. People always overreact to QE tapering (see the 2013 Taper Tantrum)\n2. Pace of corporate earnings\n3. Consumer spending, which accounts for 70% of GDP not unleashed due to resurgence of pandemic/supply disruptions\n4. Supply-side disruptions mean demand is much higher than supply, which as basic economics tells us, causes prices to rise\n5. Tons of slack in the labor market which will tighten as the delta variant recedes\n\nAll the best moving forward!", "score": 20, "replies": [{"body": "Thank you I appreciate the friendly post! \nAll things I haven't considered, time to go do some reading 😅 \nTake care!", "score": 8, "replies": [{"body": "Always a good time to read more!! Thank you as well my friend, always appreciate sharing different perspectives\n\nAgain, to be clear I am not trying to prove you wrong or anything, just giving my humble opinion", "score": 5, "replies": []}]}, {"body": "Good job taking the time to educate!", "score": 3, "replies": [{"body": "My pleasure!", "score": 4, "replies": []}]}, {"body": "Money post right here", "score": 2, "replies": []}]}]}, {"body": "I’d love a SPY pullback to the 200MA. A nice 10% drop from its previous high. Buy that tasty dip.", "score": 1, "replies": []}]}]}]}]}, {"body": "Also Amazon announced today that it’s planning a major beauty event in October $COTY $REV.\n\nEL doesn’t sell on Amazon so will not benefit from it unfortunately", "score": 6, "replies": [{"body": "Very nice! I missed this, thanks for the info!", "score": 5, "replies": []}]}, {"body": "Evergrande didn't make the market recap ?", "score": 5, "replies": [{"body": "No\n\nAs I said below, I dont report on individual stock moves. Also idk what that stock even is\n\nI could open a scanner and find 100 stocks that went up more than 20% everyday, no point in writing about it", "score": 6, "replies": [{"body": "But all your highlights are about individual stocks ?", "score": 4, "replies": [{"body": "He only mentions price target upgrades/downgrades given by analysts\n\nThere are so many tickers, how would he have the time/space to report everyone?\n\nAlso unless I'm looking at the wrong ticker, it seems like you're talking about an otc penny. That's such a worthless ticker to mention", "score": 7, "replies": [{"body": "It's the biggest real estate development company in China and it's defaulting, fuck a price movement on a ticket, this is the first domino falling", "score": 1, "replies": [{"body": "Literally never heard of it before lmao\n\nIf you wanna buy puts go ahead and let the fed spank you", "score": 7, "replies": []}]}, {"body": "Exactly!! There are notable stock moves everyday", "score": 1, "replies": []}]}, {"body": "Haha, you have a point there. Still love the recaps /u/psychotrader00", "score": 2, "replies": []}]}]}]}, {"body": "Thanks for the post. So you think that next week meeting has been already priced in? I am feeling a bit concerned about next week information and impact.", "score": 2, "replies": [{"body": "Of course not, how is the market going to price in information it doesn't have? We'll have to wait and see how it turns out", "score": 4, "replies": []}]}, {"body": "Thanks for the recap.", "score": 2, "replies": []}, {"body": "Ugh, please tell me we’re out of the woods", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I dont report individual stock movements", "score": 3, "replies": []}]}, {"body": "Green", "score": 1, "replies": []}, {"body": "Thank you so much, hope your day has been a good one my friend, cheers.", "score": 1, "replies": []}]}
{"title": "If Musk weren't around would TSLA come back to Earth?", "selftext": "I'm curious of any of ya'lls opinion on whether you think the growth of Tesla has been Musk driven or actual progress driven. I'm a turbomachinery engineer by trade, and I damn near went to work for SpaceX pretty recently actually, so I do have a sense of the engineering prowess the company has. But, we all know what a company is actually doing doesn't necessarily mean the stock price is going to respond similarly...it's mainly psychological not real; i.e., Gamestop and AMC. It's all a big meme. So hypothetically, say Musk's alien master race handlers come back and take him home, and we still have Tesla, what happens then?\n\nTSLA does have a massive head start in the EV world, and I myself own a ton of TSLA. I support Musk's goals and overall plan, and I do think he's a brilliant person, but he's also not as self-made as the fanboys say nor is he a super ethical person based on accounts of friends of mine and him. But is the image he's cultivated driving the company stock price, or are the numbers? That's the million dollar question.\n\nAlso, I'm just gonna say it, Stephen Mark Ryan the Solving the Money Problem guy acts like a complete shitbag who survives off of calling himself a genius and smelling his own farts. I don't think the man is stupid, nor is he wrong about many of things he says about Tesla, but GOD he's insufferable and so arrogant. His damn Youtube channel keeps getting pushed to me by the algorithm gods at Google and everytime I think \"...maybe this time it'll be different\", I watch a little, hear him gloat about all his money, call some people retarded, and I want to puke. I hope he gets a taste of his own eventually.", "id": "poksjv", "created_utc": 1631688100.0, "score": 22, "upvote_ratio": 0.82, "num_comments": 35, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "$20 without musk", "score": 20, "replies": [{"body": "Completely disagree \n\nElon is important but the company has enough momentum and strategic direction that it would succeed still", "score": -6, "replies": [{"body": "Marketing is arguably more important than the product, Elon is the marketing strategy. Sure they’ll succeed but nowhere near as much as they are currently on track to.\n\nComparing to apple, Tesla has basically released the first iPhone again… the FSD beta, thinking Apple would’ve blown up and became such a cultural zeitgeist without jobs is really assuming normal people will actually care about the company and not the mascot", "score": 8, "replies": []}]}]}, {"body": "Apple, Microsoft, Google, now Amazon have seen the original people move on and the companies do fine. Tesla might not be there yet, but one day soon.", "score": 12, "replies": [{"body": "Tesla is not there yet at all. msft, goog and amzn were all engrained into many people’s lives before the founder’s took a backseat. \n\nHow many people would have their quality of life seriously diminished without Tesla? This is why I think they are doing the robot and it should be a priority imo. \nTesla drivers have options, if the Tesla bot comes to market first and can pick up your groceries and your mail for you that puts TSLA a lot closer to being essential ala google search, windows, or the iphone.", "score": 2, "replies": []}]}, {"body": "TSLA is Weyland-Yutani / The Company.", "score": 4, "replies": [{"body": "If they make their robot bleed milk  is all the confirmation I needed.", "score": 2, "replies": []}, {"body": "Funny, I thought the exact same thing a few months back when I was binging Alien Theory on youtube. He is Weyland!", "score": 2, "replies": []}]}, {"body": "Just read the title.\n\nI hold far otm puts 2023 in the event Elon dies.", "score": 3, "replies": []}, {"body": "Pump and dump driven, also good marketing strategies to convince people that EVs are the future.", "score": 4, "replies": []}, {"body": "Musk IS Tesla. Without him in the public eye people would be distracted by all of the cars being rolled out that are better than his. Tesla is a meme car. Who doesn’t think buying an electric Corolla for the price of an S class isn’t hilarious!", "score": 7, "replies": [{"body": "Thank fuck someone rational in here.\n\nMusk attempts to control their narrative 24/7.  Pumping bullshit, announcing vapor three years before it ever could come to market; not to mention the financial shenanigans they’ve pulled over the years up to the solar city bailout which would have imploded spaceX et al.", "score": 1, "replies": [{"body": "I don’t even pay attention anymore. It’s been over three years since Jaguar released the I-Pace surpassing Tesla in every measurable way and in that time many other electrics have come out and knocked the fast food quality Tesla further and further down the ladder. Without the Elon fanboys , ridiculous media spinning up the prestige factor and most importantly the tax subsidy. Those cars would be clogging the inventory rolls and being given away like an old Prius.", "score": 1, "replies": []}, {"body": "I don’t even pay attention anymore. It’s been over three years since Jaguar released the I-Pace surpassing Tesla in every measurable way and in that time many other electrics have come out and knocked the fast food quality Tesla further and further down the ladder. Without the Elon fanboys , ridiculous media spinning up the prestige factor and most importantly the tax subsidy. Those cars would be clogging the inventory rolls and being given away like an old Prius.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "He's probably already uploaded somewhere.", "score": 6, "replies": []}]}, {"body": "Sounds like a deaththreat", "score": 2, "replies": []}, {"body": "Put a fat, bald and charmless middle-aged man in charge of Tesla and it would be a different story. People like that he is a slightly off beat multi-millionaire, who’s also very intelligent. Musk is at the end of the day, a face for the company, similar to how Steve Jobs represented Apple. I’m sure there are very innovative people behind the scenes at Tesla, engineers, etc. who never see the limelight. Is the stock overvalued?-more than likely. But that being said Tesla does have a lot to offer in the electric vehicle sector. \nIt probably doesn’t make sense how other car companies’ share prices are a fraction of what Tesla’s share price is. We all know that every car manufacturer will eventually only produce e.v.s and that Tesla will lose its uniqueness in that regard. But in the meantime nobody seems to care. Tesla it seems is a very well marketed company, that has a cool factor about it, largely due to its slightly unpredictable CEO.", "score": 3, "replies": [{"body": "Bezos?", "score": 1, "replies": []}]}, {"body": "Government money, it's a hell of a drug", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah but those guy’s companies stock prices actually fall more in line with their evaluations. Tesla stock is way out of whack in my opinion but hey people are still buying it for whatever reason. Personally, not touching that stock other than swinging puts and calls. If Tesla does come back to earth, you are going to be an extremely longggg bag holder. He says he wants his innovations and all to be available to all manufacturers however he keeps jumping into politics wanting decisions made to squeeze and apply pressure on the competition making him look very monopoly like. I think millenials have just put him up on a pedestal and he can do no wrong. to your point he’s definitely one of the best marketing guys out there!", "score": 4, "replies": []}, {"body": "And Tesla is just a huge “FOMO” stock in general. People have seen those big stock price numbers before the split and want in on the action.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah, you’re right but the fact of a tweet alone shifts this stock +\\- 5% is kinda telling how volatile and on edge people are with it. I do love the volatility on swinging options but still can’t bring myself whatsoever to holding share of it unless there’s a big crash unrelated to Tesla to buy in at.", "score": 2, "replies": []}]}]}]}, {"body": "If Reggie, the bus boy from IHOP, was running Tesla of course it would tank. Ppl aren't just investing in the products, they're investing in the visionary, the company guidance. Musk has managed his money extremely well given all the risks he's taken on", "score": 0, "replies": []}, {"body": "i definitely think it’s musk \n\nshit the stock goes up when spacex does something and they’re not related at all", "score": 0, "replies": []}, {"body": "Isnt Elon a major shareholder that almost never sells? That probly provides good support for the stock. If he were to cash out to actually have $100B in cash, i think tsla stock would implode.", "score": 0, "replies": []}, {"body": "Tesla is cheap right now lmao", "score": -3, "replies": []}, {"body": "Musk will be the Tesla Bot.", "score": 1, "replies": []}]}
{"title": "YOLO COMPILATION (AAL, AAPL, SOFI, SPY, PLTR)", "selftext": "", "id": "pom3rw", "created_utc": 1631694670.0, "score": 38, "upvote_ratio": 0.83, "num_comments": 32, "comments": [{"body": "That sofi upgrade came in clutch", "score": 4, "replies": [{"body": "I actually bought 200 of those calls months ago and yesterday’s sell off kind of threw a wrench in the trade. I decided to double down at close and bought 200 more at .15. It definitely came in clutch.", "score": 2, "replies": []}]}, {"body": "Sir these are some crazy yolos. Mad respect.", "score": 5, "replies": []}, {"body": "So you bough all the calls on the max pain threshold expiring on the quadruple witching day, the OpEx of all OpEXes. You belong here 🤣🤣🤣", "score": 6, "replies": [{"body": "It’s worked so far. 2k to 500k in 1 year. But please tell me what I should do instead.", "score": 3, "replies": [{"body": "2k to 500k in one year? \n\nProof or ban", "score": 4, "replies": [{"body": "He doesn’t even show the gains/loss so obviously a troll", "score": 2, "replies": []}, {"body": "I can’t post half of the gain as it’s in penny stocks (under mkt cap rules). I made some good money in PLTR and on GME shares on the way up and then shorting at 400. Lost a 100-200k since February by getting stuck in a PLTR call option that I bought months prior but the stock decided to take a shit the exact week that my expiry was.", "score": -1, "replies": [{"body": "All options? What's your strategy? Do you have target gain percentages? I have so many questions", "score": 0, "replies": []}]}]}, {"body": "It works until it doesn’t. Market makers and hedge founds will pus the prices down so that the max pain options strike expires worthless", "score": 2, "replies": [{"body": "You do know you can sell option positions prior to OPEX right? I’m not arguing that this is a risk-free investment. I’m not buying bonds here. It’s clearly a risky position that can pay out well if my contrarian view proves correct.", "score": 3, "replies": [{"body": "True, you will make some very nice profits if the trades go in your favour", "score": 1, "replies": []}]}]}]}]}, {"body": "Update 1: Exit entire PLTR position at 2.12 per. Proceeds: 21,200 (Profit: 12,400)", "score": 2, "replies": []}, {"body": "This is the most bullish thing I’ve ever seen 👊", "score": 2, "replies": []}, {"body": "Can it be a yolo if it's just a portfolio? These are typical boomer stocks", "score": 2, "replies": [{"body": "Expiration dates, size, and OTMness would point to yes. But I’ll leave it to the tards in the thread to decide…", "score": 6, "replies": [{"body": "Meh, I think diversifying your options across airline/travel, tech, banking and literally the market itself, kinda dilutes your yolo'ness. Also, this equates to like 60k which is about 12% of your total holdings according to your 500k comment below, also takes away from the yolo.\n\nI guess I'm a purist when it comes to retardation. You either go full retard yolo or it's just a standard move.", "score": 2, "replies": [{"body": "I guess you can say that, but in my trading account this makes up like 60% of the account rn. I’m not currently trading with that large of an amount.\n\nI respect your commitment to true retard yolo tradition.", "score": 2, "replies": []}]}]}]}, {"body": "Do you always go for the nearest exp on spy and Also do you wait for a decent dip to buy a call on it or just whenever.", "score": 1, "replies": [{"body": "I never buy calls when SPY is at an ATH, I always fear buying the top. But I also suck at timing when to exit puts, so what I like to do is sit on my hands and wait for a 1.5-2.5% decline and then buy an expiry less than a week out looking for a bounce. \n\nI used to play SPY more, but lately have had more success with QQQ and AAPL, so I stick with those more often.", "score": 3, "replies": []}]}, {"body": "What are the positions lol.\n\nCan you update it or take better screen shots", "score": 1, "replies": [{"body": "Lol this ain’t Robinhood. Avg px. In the top right corner is the cost per contract. The contact details are under the symbol and the current bid/ask spread is blue/red.\n\nWhat more you want to know?", "score": 2, "replies": []}]}, {"body": "You are crazy man. I love it.", "score": 1, "replies": [{"body": "Appreciate it man 📈🙏🏻", "score": 2, "replies": []}]}, {"body": "lol you’ve got several pics but none of them showing actual gain/loss, ok", "score": 1, "replies": [{"body": "It’s really not that hard to calculate. If you don’t know what the pic is saying I’m sorry, but it’s literally basic option knowledge.\n\nYou take the difference between avg px (my cost per contract) and the current bid/ask and multiply it by the number of contracts.", "score": 3, "replies": [{"body": "Ok my bad, so it’s mainly loss porn", "score": 0, "replies": []}]}]}, {"body": "close but still palantarded", "score": 1, "replies": [{"body": "Is there any other way?", "score": 1, "replies": []}]}, {"body": "SoFi baby! Let’s GO!", "score": 1, "replies": []}]}
