{"title": "Option Trading Lost Me 5k", "selftext": "* Over the course of the last 6 months I have deposited 5k (disbursed over several deposits) into my Robinhood portfolio and a several hundred in my Webull account. \n* I started investing towards the end of last year and at first was grabbing several shares of different large name companies I liked but wasn't seeing much of a return and actually kept selling when I would be down -50% and more. \n* I decided to only trade options instead and through an expensive lesson of not using stop losses, **I gradually lost all of the 5k and some.** \n* Yeah, I had some wins here and there, but my losses outweighed my wins every time.\n*  I understand how to analyze charts and use technical indicators to predict movement, I understand the Greeks, I get risk management, yet I still managed to blow through the whole 5k. \n* I was down to my last 1k and it only took 2 wrong TSLA calls/puts to clear my account :( At the moment I have $200 left in my Webull account and I really don't know what to do. \n* I am thinking of either just solely investing in Bitcoin and averaging down every time it dips below 45k and or/ just investing into several ETFs. \n\n&#x200B;\n\n**Any advice?**  Should I stay away from options all together? Should I deposit more money (enough that I m okay with losing) and try my luck again? I am probably going to have to pay a shit ton of taxes at the end of this year (which is something else I am unclear of how it works). \n\n&#x200B;\n\nAnyone else been there?", "id": "pxnvl1", "created_utc": 1632889813.0, "score": 1, "upvote_ratio": 0.55, "num_comments": 37, "comments": [{"body": "[deleted]", "score": 36, "replies": [{"body": "Facts.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "How many shares of a stock do you think its worth grabbing to be profitable? 10? 25? 50? I know it depends on how much I am looking to make, but with the big tech players I can't afford more than usually like one or two shares.", "score": 1, "replies": []}, {"body": "Yes. It's not a loss until you sell. Only put in money your are willing to throw away. Because even regular investing can still be a gamble.", "score": 0, "replies": []}]}, {"body": "Just 5k…I wish", "score": 5, "replies": [{"body": "To me it feels like more", "score": 1, "replies": []}]}, {"body": "Might as well buy one last option..", "score": 4, "replies": []}, {"body": "Was you playing weekly options?", "score": 2, "replies": [{"body": "Yea I was getting about 3-5 different options every week. Would hold typically max 1-3 days", "score": 1, "replies": []}]}, {"body": "This is the story for most people. Options are brutal. If you want to win, play the long game. Buy ETFs and high dividend stocks. Reinvest the divy’s so they compound. Forget get rich quicks like Bitcoin, etc until you are on your path to actual wealth. Don’t gamble. Options and short trading can be as addictive as gambling.", "score": 2, "replies": [{"body": "Thank you for this. I wish I could make that 5k back. I was thinking of possibly depositing 2k and making 1 to 2 big Amazon or TSLA plays...Probably shouldn't though. Ahhhh", "score": 2, "replies": [{"body": "Seems like you haven't learned your lesson. \n\nStop buying out of the money options. The odds of those being in the money before expiry is stacked against you. 80-90% of out of the money options expire out of the money, i.e., useless. You, the **option buyer**, are literally shoveling money to the **option sellers** who are laughing all the way to the bank on your naivety thinking you can make 1000% return in a short amount of time.\n\nStick to **buying shares** of good companies. **FORGET ABOUT OPTIONS**. $5K is a relatively cheap lesson. People have lost hundreds of thousands to millions thinking they can do the equivalent of winning the jackpot lottery on the stock market (i.e., buying tons of out of the money options which all expire worthless). **STOP BEING SO DAMN IMPATIENT**. The stock market is where the impatient transfers wealth to the patient.", "score": 2, "replies": [{"body": "Wow, I needed this. Thank you Bussy. I know, you're right. The reason I enjoyed option trading was because I was big on technical analysis and reading charts so I decided to use that to make my plays (fib retracement for entries, fib ext for exits, etc). But, you're right, I will focus on buying shares for sure.", "score": 1, "replies": []}]}, {"body": "I get it. Been there. That feeling is the same one people get at the casino.", "score": 1, "replies": []}, {"body": "Just lost 4k on Tesla put play :(", "score": 1, "replies": []}]}]}, {"body": "How do you go to zero with options? You either sell the stock or buy the stock. Either way you either make money selling the stock or end up with a stock. Yes I understand that the stock can drop in value, but until you sell, you still have “something”. I’m just wondering how you go to zero", "score": 0, "replies": [{"body": "Quite easily actually.  Trading options is not about buying and selling stocks.  It's about buying and selling options contracts for premiums.\n\nA buyer pays a premium in the hopes that the option they buy will increase in value so that they can sell it for a profit.  If the market doesn't move in their favor, then their total risk is the premium they paid.\n\nA seller writes a contract and sells it for a premium.  They're hoping that the option they sold will decrease in value so that they can buy it back at a lower price or let it expire worthless, to the buyer, and keep all of the premium.  If the market moves against the seller, and they have not sufficiently managed their risks, their downside can be quite large.\n\nEither way, it's quite easy for an inexperienced trader to lose money in the options market.\n\nDisclaimer:  I'm a novice and there are much better sources to learn about options, but since you asked an honest question I wanted to give you an answer.", "score": 2, "replies": [{"body": "First thanks for the great explanation,\nSo now I can totally see in your first example how someone can go to zero from what I’m guessing is called buying calls that end up expiring out of the money consistently \nBut in the second example, if the stock goes up and the seller has to sell, they still get the premium plus are paid for the shares. The only way I can see someone losing lots of money like that would be selling the calls at strike prices under their cost basis, but even in that scenario I can’t see them going to zero🤷‍♂️", "score": 1, "replies": [{"body": "There are a lot of strategies that an options trader can employ beyond just buying and selling calls.  Some of them involve being both a buyer and a seller and another dimension is that they can be calls or puts.  So there can be multiple options involved in a single play.  It's quite interesting really.\n\nTo keep things simple though we can just stay focused on calls, but even then there is more then one way.  Probably the most intuitive is a 'covered call'.  This is where you own a sufficient number of shares, 100 per contract, of the underlying stock to fulfill your obligation to the buyer should the contract end up in-the-money and you get assigned.  In this case you'll receive money from the sale of the underlying shares, but you're still losing money.  People will talk about cost basis and such, but if you have to sell something for less than it's worth, then you're losing money.  Though it won't decrease your account balance.\n\nHowever, there is another strategy called a 'naked call'.  This is similar to a covered call but the difference is that you don't own sufficient shares of the underlying stock to fulfill your obligation.  If the seller finds themselves in the position of having the contract(s) assigned then they will have to buy enough shares of the underlying at the current market price to fulfill their obligation to the buyer(s).  Their losses will be the difference between the current price of the underlying and the strike price of the option, less the premium, x100 per contract.  This is a worst-case scenario and we have to assume multiple mistakes on the part of the seller, but you can lose all of your money and more selling calls.", "score": 1, "replies": []}]}]}]}, {"body": "Just buy the s&p 500 and your favorite few Blue chips, reinvest your dividends and stay away from Options.", "score": 1, "replies": [{"body": "Yeah that's what I will do. I MIGHT grab an option here and there but will mostly play the S&P 500. Is that what you do?", "score": 2, "replies": [{"body": "50% of my portfolio is through the major ETFs SPY, DIA, QQQ. 30% is in Blue Chips and 20% in speculative.", "score": 1, "replies": []}]}]}, {"body": "I would talk to a tax guy. I think you get to deduct 3k per year. Your losses roll over. So one year you deduct 3k and next year the other 2k. Basically you get to gamble 3k a year and keep learning is what I understand.", "score": 1, "replies": [{"body": "really????", "score": 1, "replies": [{"body": "Porcupines statement is correct. You do deduct 3k from your total gross income and then that is taxed. Just depends on how much you make on what tax bracket and such you fall. It doesn’t end up saving you as much as I thought but at least you can deduct.", "score": 1, "replies": []}]}, {"body": "Right but that doesn't mean you get to 'gamble 3k a year'. The 3k is a deduction, but that doesn't mean you're going to pay 3k less in taxes unless your effective tax rate is 100%.", "score": 1, "replies": [{"body": "Ah yes that makes sense. So for example if make 100k per year. Only 97k would be taxed.", "score": 1, "replies": []}]}]}, {"body": "Started my investing journey last year with 10k. Lost 4k, mostly through options. I cannot emphasize enough how rare those people that make 100x gains are. For every one of them, there’s hundreds like you and I.", "score": 1, "replies": [{"body": "It's actually insane. At one point, I was hitting majority of my option calls/puts by sticking to stop losses and being very disciplined with my exit points.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "thanks man, needed this.", "score": 1, "replies": []}]}, {"body": "Wow same, except that money is closer to $10k for me", "score": 1, "replies": [{"body": "It is alright, we will bounce back. I was okay with losing that 5k, just hurts to bring up that YTD tab and you see all your total losses.LOL", "score": 1, "replies": []}]}, {"body": "Stop gambling with emotions and make plays that use logic", "score": 1, "replies": [{"body": "I was usually doing that. But there would be times I would forget to put a stop loss and I would take multiple $300+ L's.", "score": 1, "replies": []}]}, {"body": "I was a member of Raging Bull and was following their options trades. Due to poor training on their part, I eventually lost $130k in my IRA selling naked options. I learned how to trade selling options in January and hav since made my money back. Just learn,study, and watch YouTube. Stay away from naked options until you know it well, and do not have a margin account. You could loose everything. I woke up one morning and found my account owing 550,00k. Good luck.", "score": 1, "replies": []}, {"body": "Did you have a strategy or were you just buying whatever looked good to you?", "score": 1, "replies": [{"body": "na man, I had a whole strategy. I would DD and use my technical analysis skills to predict movement/use fib retracement and extension levels for my entries and exits. I would grab contracts that would have high volume and be relatively close to being in the money. I feel like my big losses came from not sticking to my stop losses and watching an option get to -50% with hopes it will climb back. I learned my lesson and literally have $200 left in my account. Wondering what to do with it.", "score": 1, "replies": []}]}, {"body": "https://www.globenewswire.com/news-release/2021/09/22/2301310/0/en/EverGrow-Coin-The-Next-New-Cryptocurrency-to-explode-in-2021-which-rewards-holders-in-Stable-USDT-Yield.html", "score": 1, "replies": []}]}
{"title": "Tesla receives approval to build multiple tanks for antifreeze and windscreen washer fluid, among other things", "selftext": "", "id": "pxscw1", "created_utc": 1632910474.0, "score": 89, "upvote_ratio": 0.93, "num_comments": 32, "comments": [{"body": "Translation:\n\nTesla receives the authorisation for the construction of several tanks\n\nPotsdam - The State Office for the Environment has authorised the premature construction of various tanks in the area of the central tank farm of the planned Tesla vehicle factory.\n\nThe approval includes the installation of a part of the plant technology that Tesla with the 17th Application for authorisation of early start has been applied for. This only makes it possible to build the tanks. Commissioning - i.e. filling - of the tanks is not yet permitted.\n\nThe approved plants are tanks for antifreeze and windshield washer fluid, among other things. In addition, gas tanks are approved for the subsequent storage of nitrogen and carbon dioxide as well as the premature construction of plant technology and containers for the sprinkler plant.\n\nThe examination for the early start of the measure still includes applications from Tesla for the installation of further parts of the technical building equipment as well as the testing of the operational suitability of other plant parts.", "score": 15, "replies": []}, {"body": "I spoiled the epic thread where we thought they were making military tanks:\n\n[https://www.reddit.com/r/teslainvestorsclub/comments/pxr1lj/tesla\\_receives\\_approval\\_to\\_build\\_multiple\\_tanks/](https://www.reddit.com/r/teslainvestorsclub/comments/pxr1lj/tesla_receives_approval_to_build_multiple_tanks/)\n\nI'm sorry guys. I wasn't thinking of the memes it would have created.", "score": 15, "replies": []}, {"body": "If someone working there is going to fart, does he/she needs to file some permit?", "score": 40, "replies": [{"body": "Did you get approval for that thought process?!", "score": 15, "replies": []}, {"body": "Please file a permit with expected emissions and do an environmental study about it. Thank you.", "score": 12, "replies": [{"body": "Or you can use an emissions test defeat device. Known to work great", "score": 11, "replies": [{"body": "I have one of those.\n\nIt's called a blame-it-on-the-dog-o-tron", "score": 4, "replies": []}]}, {"body": "...in triplicate.", "score": 1, "replies": []}]}, {"body": "Yes, followed by the formation of a committee of no less than 20 people, which will research the smell and flavor characteristics of the fart to determine if it’s at an acceptable level for the endangered cockroach that was once spotted in that area in 1974.", "score": 14, "replies": []}, {"body": "Yes", "score": 10, "replies": [{"body": "~~Yes~~\n\nJa.", "score": 5, "replies": []}]}, {"body": "need a 27b-6 form", "score": 2, "replies": []}]}, {"body": "How can the Germans be so thorough making sure every single thing in the Brandenburg plant is perfect, while at the same time allowing VW to basically pollute all they want and cheat their own systems?", "score": 34, "replies": [{"body": "> allowing VW\n\nIt wasn't \"allowed\". VW did it anyways. And basically most other carmakers as well as it turned out later. To bad people always only remember the first one that gets bad press about it.", "score": 2, "replies": [{"body": "I think what they are trying to say is how they are letting them get away with it. They have been caught lying/cheating again in the last 30 days, possibly twice and **next to nothing** has been done. An example is the moment one of these buildings walls has a crack in it due to something like a pouring error, Germany will likely want to close the whole plant even if inspections prove everything else is fine. It’s just unfair bias against Tesla while Germany gives a “oh well, we have em rules and they broke em. Not my problem since I tried” attitude towards Legacy Auto, particularly VW", "score": 13, "replies": [{"body": "This...", "score": 3, "replies": []}, {"body": "LICE buys politicians, BEV does not?", "score": 0, "replies": []}]}, {"body": "“Allow” has several meanings and that is one of them.", "score": 1, "replies": []}]}]}, {"body": "Do we really need a thread for every piece of approval Tesla gets for their factories?", "score": 8, "replies": [{"body": "I think it's justified, as a key Tesla factory in Germany is about to go online, with the only missing piece being ***permits***.\n\nThe same authorities are approving the big permit who are approving these smaller temporary permits as well.", "score": 8, "replies": []}, {"body": "This is all a lead up to the Giga-fest...\n\nWould be a great time to open it.", "score": 1, "replies": []}]}, {"body": "What about the blinker fluid tanks?", "score": 4, "replies": []}, {"body": "Anyone know why antifreeze? Heat pumps don’t use antifreeze…", "score": 3, "replies": [{"body": "I think in this case antifreeze is synonymous with coolant", "score": 4, "replies": []}, {"body": "> Anyone know why antifreeze? Heat pumps don’t use antifreeze…\n\nTesla's does. Count the number of plate heat exchangers on the car, go ahead.", "score": 0, "replies": [{"body": "That’s a weirdly snipe-y answer. I guess I was thinking of the fluid used to heat and cool the coolant, whose utility comes from its solid-liquid phase change point being near the ambient temperature of earth at sea level, which controls the temperature of the coolant, whose utility comes from its solid-liquid phase change being comfortably below the ambient temperature of earth at sea level.", "score": 2, "replies": [{"body": "Am I having a stroke?", "score": 5, "replies": [{"body": "No, I’m just trying to be as pedantic as possible", "score": 2, "replies": []}]}]}]}]}, {"body": "One would think approving a vehicle manufacturing facility would include approval of the obviously necessary parts included in that.", "score": 3, "replies": []}, {"body": "I know tanks can be erected pretty quickly, but I was hoping Giga Berlin was closer than this. I'm thinking that they can start limited production without these (in a less efficient manner) but that these are necessary for full ramp? Does anyone have any insight on what we can infer on production schedule for Berlin?", "score": 1, "replies": [{"body": "Just a tank.", "score": 1, "replies": []}]}]}
{"title": "TSLA Technicals and Fundamentals are converging. Bullish run expected...", "selftext": "&#x200B;\n\n[TSLA on long Bullish trend](https://preview.redd.it/lc6chzy4fcq71.png?width=1604&format=png&auto=webp&s=6d43a31a1dfcd5ef3c4f9815682507adfa70d655)\n\nI have had a bottom trend-line on TSLA stretching back to March of 2020 that we have been following fairly closely.  Yesterday we pushed past a resistance line at around $778-$780 on the daily and today, although a red day for the stock, we actually have a very bullish signal forming.  We sold down to around that resistance line and bought back up to post a daily candle above.... potentially confirming it as a new support. \n\nThis was the last resistance left on the before all time highs of about $900.  Additionally, Tesla has received several price upgrades as analysts in the last few day and they are expecting delivery numbers to put the companies current production rate at around 1 million vehicles per year presently, although the total for 2021 is expected to be in the low to mid 900k deliveries. Some analysts are expecting their best quarter by growth percentage ever.  \n\n\n Even if TSLA sold down to the bottom trend line it will reach ATH around March 31st 2022, the end of Q1. This would be the bear case, save for a market crash. Ironically TSLA investor are also speculating that Giga Texas should be operational at the end of Q1 (most likely we will get some production from Giga Texas sooner, maybe even in the end of 2021 but it's expected to be very limited as the entire factory will not be completed yet)    \n\n\nTLDR: We have a real convergence of technical and fundamental strength on TSLA.", "id": "pxknxt", "created_utc": 1632878394.0, "score": 40, "upvote_ratio": 0.86, "num_comments": 35, "comments": [{"body": "thought the same thing bought the top yesterday.", "score": 11, "replies": []}, {"body": "Michael Burry should be worried.", "score": 10, "replies": [{"body": "He’s reading this with shidded underwear right now", "score": 2, "replies": []}]}, {"body": "All in Tsla calls if market doesn't dump, I'm in", "score": 14, "replies": []}, {"body": "Soooo are my Friday $840 calls printing?", "score": 12, "replies": [{"body": "I would have gone for a one more week out but you id be surprised if TSLA isn’t higher than it is right now sometime before Friday morning so probably!", "score": 9, "replies": []}]}, {"body": "Who’s we?", "score": 9, "replies": [{"body": "Market participants", "score": 6, "replies": []}]}, {"body": "Went all in 10/29 810c today 🤔🤔🤔; I hope I survive.", "score": 5, "replies": [{"body": "Yesh im in 10/29 840c 😅", "score": 3, "replies": [{"body": "Hope it prints for us 😙", "score": 2, "replies": []}]}]}, {"body": "This pleases my 1000 15/06/2022 820C warrants", "score": 2, "replies": []}, {"body": "What do you mean Tesla is gonna hit 1469 by end of October", "score": 1, "replies": []}, {"body": "Yet whales are pulling out of tsla", "score": 1, "replies": [{"body": "Who’s selling?", "score": 1, "replies": []}]}, {"body": "TSLA Sep 2022 100p is my position \n\nStock will implode mightily as rates continue up. FSD is a scam, only speculation of possible future fuels this turd.", "score": -8, "replies": [{"body": "Seriously one of the most retarded and stubborn positions I've heard of. If you love wasting money just cashapp me", "score": 9, "replies": []}, {"body": "Op is fucking talking about fundamentals, lololol", "score": 2, "replies": [{"body": "I’m not talking about valuation, you can have your own opinions about that but just because you think Tesla is overvalued doesn’t mean it doesn’t respond to earnings and delivery data. Those would still fall under fundamental analysis rather than technical analysis.", "score": 5, "replies": [{"body": "You’re in the wrong group if you’re bringing rational DD ha…", "score": 0, "replies": []}]}]}, {"body": "I own 100x 100p exp 12/17😘😘 what color lambo you buying king?", "score": 1, "replies": [{"body": "You'll lose every dollar you put into that position.", "score": 1, "replies": [{"body": "Maybe, just maybe 🤔", "score": 0, "replies": [{"body": "No, it's definitely.", "score": 1, "replies": [{"body": "You know these contracts don’t have to be ITM for me to profit. If this thing crashes I have 100x the vega exposure. The premiums will pop tf off", "score": 0, "replies": [{"body": "Why would Tesla crash? They set new records every quarter. Only thing that would cause it to crash would be the whole market crashing. Tesla was only down 2% yesterday while many other stocks were down between 4 and 10% if you're betting on a broad market crash there are better stocks to buy puts in.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Chillllll I sold 820c for Friday. Wait til next week to run.", "score": 0, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|18|**First Seen In WSB**|8 months ago\n**Total Comments**|76|**Previous DD**|\n**Account Age**|11 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=pxknxt)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=pxknxt)", "score": 1, "replies": []}, {"body": "$860C exp 10/22….. down two hundred :(", "score": 1, "replies": []}]}
{"title": "🚀At the heart of the smart city BB DD🚀", "selftext": "Aloha gentletards, I’m here to tell you about a little 100 banger. Bb\n\nTLDR: bb has more exposure and better tech in regards to RTOS in not just the automotive sector but also in industrial. Ivy could revolutionize cars and monetize car data exponentially. Cyber security is as good as crwd, according to real world hacking testing done by SE labs. Patent sale finalization 80% probability done this quarter- rumored to be 1B+ and 7 year trailing while retaining rights to use patents.\n\n***this DD will be a work in progress and will be updated as much as I can***\nLet’s start with QNX and IVY.\n***QNX***\nQNX is a non-Linux based microkernel RtOs. Let’s break that down piece by piece: non-linux/microkernel- Linux by design is a monolithic kernel that runs all operating system components in kernel space; it includes all device drivers, file management, and networking and graphics stacks. Only user applications run in user space. Although a monolithic design protects a kernel from errant user code, it doesn’t protect it from errant kernel code. A single programming error (or successful exploit) in a file system, protocol stack or driver can crash a monolithic operating system. January 2020, the Linux kernel had around 27.8 million lines of code in its Git repository; with about 100 thousand lines of code the QNX Neutrino RTOS is 99.7% smaller. Smaller foot print= less vulnerability.\nA microkernel operating system embodies a fundamental innovation in the delivery of OS functionality: modularity. The tiny kernel is a side effect. With a microkernel OS, the microkernel works with a team of optional cooperating processes that provide higher-level OS functionality. Critically, unlike with a monolithic kernel, these processes run in user space; that is, outside privileged kernel space.  A microkernel OS like the QNX Neutrino RTOS encapsulates each application and OS service in its own isolated process space. The microkernel protects and allocates memory, and gives drivers and other OS services only the minimum privileges they need to perform their functions. \n***RTOS vs OS***\n\nA Real-time Operating System (RTOS) is an OS for devices and systems that need to react quickly to a trigger. In the case of a software fail-safe, for instance, an RTOS would pre-empt lower priority processes to take care of the higher-priority task. The LiDAR and video imaging that autonomous vehicles use to drive the car down a highway without straying outside the lines or hitting anything is very compute-intensive. It makes sense that a complex system with life-safety responsibilities might have an RTOS so that a processor can make a quick decision. On the other hand, an OS can be detrimental if it’s not really needed, and yet necessary if the system has a processor that must be interrupted so it can react to high priority tasks. Traditional MCUs are not going to run several threads simultaneously and are not going to have sophisticated interrupt capabilities. A while ago, the embedded world was mostly populated by MCUs due to the high price of performance computing and the fact that simple control loops were all that was needed. LINUX based car OS’s are just that, operating systems that lack in priority management and interrupts.\n***IVY***\nQNX, but ***cloud connected***. “BlackBerry and AWS are joining forces to develop BlackBerry IVY, a scalable, cloud-connected software platform that will allow automakers to create personalized driver and passenger experiences and improve operations of connected vehicles with new BlackBerry QNX and AWS technology.”\nSo all that sensor data flowing through qnx is or can be valuable both to the OEM’s and to third party app developers. From a user stand point, imagine at App Store for your car that you can download cool shit from. You know how Tesla’s can make your car fart? Imagine that… but not having to pay for a tsla. Or an app that allows you to make payments for tolls, gas, food, etc from your car([car payments](https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberry-ivy-to-provide-secure-vehicle-based-payments). \nFrom an OEM standpoint, the sensor data alone is a gold mine. Being able to track real world, real time conditions of their vehicles could/should streamline production, recalls, and r&d. The potential for a cloud-base RTOS is infinite.\nBest part about IVY? ***SUBSCRIPTION BASED***\nIf IVY gains the same amount of vehicles as QNX and the annual subscription per car is say 10 bucks. Annual gross would be 1.95 billion. At the same ratios that would put the stock roughly at 2x current levels.\n\nCompetitors for QNX/IVY- doesn’t really exist yet. From a technical standpoint or an exposure stand point. Android auto is gaining traction but here is a list of manufactures for android auto: 2020 Polestar 2\n2021 Volvo XC40 P8\n2021 Volvo XC40 Recharge\n2022 GMC Hummer EV\n2022 Renault Megane E-Tech Electric\n2022 Volvo XC60\n2022 Volvo S90\n2022 Volvo V90\n2022 Volvo V90 Cross Country\n2023 Ford cars\n2023 Lincoln cars\nWhere as qnx(automotive and industrial)\n\n.[companies](https://enlyft.com/tech/products/qnx) not sure if up to date.\n\n\n***Patent sale***\nCEO John Chen gave 80:20 odds of the deal being closed this quarter. The facts- bb will retain the right to use these patents after the sale.The price has been pretty much settled.\nthe rumors: a lump payment up front + 7 years trailing. \nMore facts- bb has not been able to claim or collect revenue from these patents during these negations. Factoring that in since the patent sale has been in litigation. 115mil annual- 28.75M per quarter- since q4 fy21 has been missing from earnings. \nMore rumors- conservative estimates in the range of 1B to 2B. I won’t talk about the higher end rumors because even i(a dude who unironically invested in GNUS)\n\n\n\n\nSome accolades :\n-Bb has secured design wins with 24 out of the top 25 EV manufacturers in the world, representing 82% of global EV volumes. An increase from 23 from last quarter. The final hold out, while not being named- being tsla.\n-SE labs conducted breach testing using “real world hacker techniques” with a 0 penetration result. Meaning with current means, or as current as SE labs employs, bb was impenetrable. Which puts BB cyber security at the same level as CRWD, as they as well got a AAA rating\n-2000+ patents granted fy21\n-195M+ cars embedded with QNX\n-Frost & Sullivan Names BlackBerry IVY an Industry Leading Edge-to-Cloud Software Platform for Automakers & Smart Cities\n-all 7 of g7 and 18 out of the g20.\n-nvdia drive- possible competitor right? Wrong, built on top of qnx.\n- partnerships include IBM, Aptiv, BMW, Bosch, Ford, GM, Honda, Mercedes-Benz, Toyota, Volkswagen, nio, xpeng, Cadillac, Jaguar, Audi, Baidu, Scania, and more.\n- secures over 500M endpoints\n-Canadian federal government multi year spark and secusuite deal.\n-USAF UES and UEM contract\n***this DD is a work in progress and will be updated as much as possible***\n***position*** 403 shares and 99 2023 contracts- majority 10’s\n\n***My conviction grows as does my position the further it slides***", "id": "pxmrch", "created_utc": 1632885624.0, "score": 208, "upvote_ratio": 0.96, "num_comments": 34, "comments": [{"body": "$BB to the moon, even if it takes adding and holding shares to my pile until I’m so elderly I forget my own name, so help me gawd $BB to the moon", "score": 61, "replies": []}, {"body": "Been slowly building my BB stash since march", "score": 49, "replies": [{"body": "Fr, everytime it dips I try to average down only for it to dip even more", "score": 5, "replies": []}, {"body": "I've got about eight grand in my blackberries since June oh, and I am ready to see the moon", "score": 3, "replies": []}]}, {"body": "Looool just noticed OP is cucumber😂", "score": 19, "replies": [{"body": "¿", "score": 11, "replies": []}]}, {"body": "Excellent, well done good sir.  Also Blackberry QNX is ISO 26262 certified, the auto functional safety standards. Also, they don't want the data. Any QNX competitor would have to commit a great deal of time and resources to get and keep certification AND not \"take\" the data.", "score": 16, "replies": []}, {"body": "I have so much already. Stop", "score": 19, "replies": [{"body": "Me too, but discounts keep rolling in and I’m a sucker for sales", "score": 9, "replies": [{"body": "I hesitated awhile back but couldn’t resist once it went below $11. Will be “forced” to keep buying if it keeps staying below $10.", "score": 6, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4275)", "score": 10, "replies": []}, {"body": "what about it's current valuation vs where it's going makes you think it's a 100 banger? I'm more interested in your speculative numbers", "score": 5, "replies": [{"body": "It’s a bit of an exaggeration, a bit of hope for future growth, and a whole lot of exaggeration. Could bb beat ATH’s sure, will it? Maybe. Do I think it’s undervalued now? Drastically, look at IRNT’s valuation vs revenue, or basically any company that exists. If BB was a new ipo with 1/10th the revenue stream it has currently I think it’d be trading  in the 50’s. Amazon partnership, ivy, qnx, safety certs, fuckin patent sale, etc. BB cyber security suite has been proven by SE labs to be ***as good*** as crwd and yet it means nothing. I get that revenue growth  has been less than exponential, but you gotta spend money to restructure a business from hand set to iot/cyber security. I don’t have a dcf model if that’s what you’re looking for.", "score": 3, "replies": [{"body": "OK I just wanted to know if it was hype\n\nBB to the moon either way 🚀🚀🚀", "score": 1, "replies": []}, {"body": "I think you’ve hit it on the head with that ‘if it was an IPO’ comment. The market is sleeping on this tired old phone maker.\n\nI’m expecting steady growth and the market starts seeing BB for what it is. \n\nI’m in with January calls (for the patent sale) and  leaps for growth.", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|50|**First Seen In WSB**|9 months ago\n**Total Comments**|424|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/pxmrch/at_the_heart_of_the_smart_city_bb_dd/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=pxmrch)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=pxmrch)\n    \nHey /u/Huge-Cucumber1152, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "[does this work?](https://www.reddit.com/user/Huge-Cucumber1152/comments/pxmtam/position/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 5, "replies": []}, {"body": " Yup, BB might surprise the world soon", "score": 2, "replies": []}]}, {"body": "Hello Big Dong 🥒- thanks for writing this. We will rise eventually.", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4267)  More BB! Thank your sir, may I have another..", "score": 2, "replies": []}, {"body": "🚀🚀🚀🚀", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": -5, "replies": []}]}
