{"title": "$DAL fucked", "selftext": "[deleted]", "id": "1dxk2az", "created_utc": 1720368585.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 90, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "lol. Your account is only 6 months old. Sorry. I must be missing something. \nThe DD is pretty solid if your trust me bro moment on flight attendants striking is real. Heard worse reasons for puts.", "score": 2, "replies": []}]}]}, {"body": "This is a colossally uninformed take", "score": 183, "replies": [{"body": "Isn’t that what we’re all here for tho?", "score": 54, "replies": []}, {"body": "Calls it is, last quarter earning's compared to this quarter is massive difference. Bad press is good press these days too lol Boeing drama is bullish.", "score": 15, "replies": []}, {"body": "Buy calls or you're wrong", "score": 4, "replies": []}]}, {"body": "flight attendants literally need government approval to strike so yeah that's not happening", "score": 83, "replies": [{"body": "DAL also doesn't have a flight attendant union.", "score": 43, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "Easy they just sick out randomly no need to strike you’d screw up the crew schedule with unpredictability", "score": 0, "replies": [{"body": "FAs have no protection w/o a union and are replaceable by anyone with a HS diploma. They have zero leverage and zero unity. Not happening.", "score": 15, "replies": []}]}]}, {"body": "Might be the dumbest post I’ve read on WSB in a week. Just an absolute brain-worm take. Delta is, without a doubt, the most consistent and pleasant domestic flying experience, period. \n\nTheir FA’s have had *three* pay raises in the last ~18 months. The last strike (of any airlines FA’s) was almost 15 years ago.\n\nNo reasonable and global airline would refuse to use Boeing planes. \n\nGood grief.", "score": 91, "replies": [{"body": "Also, Delta flight attendants are not unionized, so the eavesdropping you were doing was either not on Delta flight attendants, or they were f’n with you because without a union, the best they could do is a mass sick-call.", "score": 10, "replies": [{"body": "Non Union and best taken care of. Strike ain't happening. Source - banging a Delta fa", "score": 15, "replies": [{"body": "![img](emote|t5_2th52|27189)![img](emote|t5_2th52|4276)", "score": 3, "replies": []}, {"body": "All the DD I needed! Getting jacked to the tits on calls. \n\nThank you for your service 🫡", "score": 3, "replies": []}]}]}, {"body": "Also, by far the most profitable US airline with the most diverse fleet. While SW might save some pennies because all their equipment goes to a 737, Delta isn't as affected when the 737 maxes get recalled every other week. They can just pivot flights to one of their 6 other fleets or any of their regional partners.", "score": 17, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "True. More of an example though. If a type has issues, they have pivots.", "score": 2, "replies": []}]}, {"body": "Delta literally doesn’t even have any MAX planes in service, their orders are for the MAX10. They also diversified and ordered something like 200 new A321s and 150 A220s.\n\n\nIm a net neutral on delta stock simply because their airline business is fickle but if you were going to invest in one it should be delta.", "score": 1, "replies": []}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "They canceled my flight, friday last minute. Only rebooked my flight midway and didn't bother to book my layover back home. Had to fly another plane. Offered my checked baggage fee  and selected  seat as a coupon good for a year?", "score": 0, "replies": [{"body": "Sounds like a frustrating travel experience. These will and can happen on any airline. My experience, and a lot of others, is that these happen less on Delta and they are better than others at dealing with them. This is backed up by customer satisfaction data, which among fare classes Delta consistently ranks at the top, or near the top, YoY.\n\nFor what it’s worth - writing to them helps. A lot. They take complaints and feedback seriously. I am not a DAL employee - just a very frequent flyer.", "score": 5, "replies": []}]}]}, {"body": "Calls it is", "score": 59, "replies": [{"body": "This is the way.", "score": 7, "replies": []}]}, {"body": "Delta flight attendants aren't even unionized. Fake.", "score": 18, "replies": [{"body": "I think I am full nerd, I read that un-ionized.", "score": 1, "replies": [{"body": "This post does not supply iodide, a necessary nutrient", "score": 3, "replies": []}, {"body": "They are  neutralized", "score": 2, "replies": []}]}]}, {"body": "Ignorant uninformed opinion", "score": 11, "replies": []}, {"body": "FA’s cannot legally strike without government approval. DAL’s FAs are also not unionized, they just received pay raises and are in no negotiations that would lead to the government allowing them to strike. \n\nThe only airline that is close to having their FA’s strike is AA. They have been in negotiations for years, and are waiting to be released into a 30 day cool down period then they can strike.", "score": 10, "replies": [{"body": "What're, they gonna get arrested? Like wtf does that mean, a strike is illegal", "score": 1, "replies": [{"body": "The airline industry is governed under the railway labor act. Under that act, yes, they could be arrested for an unauthorized strike. There is a process for striking in the airline industry, that requires both parties to completely exhaust all options and be released into a 30 day period before they can seek self help.", "score": 1, "replies": []}]}]}, {"body": "There’s a reason why delta is usually the most expensive airline to fly with. It’s because people are willing to pay extra to fly delta.", "score": 7, "replies": []}, {"body": "Your post is so incredibly uninformed, you didn't even look into the fact DAL doesn't have a flight attendant union.\n\nDAL value dropped from post COVID high due to plane delivery delays. They are trying to grow more, but no manufacturers can keep up with their delays.", "score": 8, "replies": []}, {"body": "calls it is then", "score": 7, "replies": []}, {"body": "Getting a call just because of this post", "score": 6, "replies": []}, {"body": "I’m a DAL pilot. I have no clue what OP is talking about. Aside from the moldy food being an embarrassment, we have no whispers on travel disruptions in the foreseeable future. In fact, I am currently on an extra trip to keep up with demand.", "score": 6, "replies": []}, {"body": "A bet against the absolute best airline, with the most Airbus planes, in the USA. Go ahead, OP. It will endup well for you. Please keep us posted. I wouldn't even short BA. Why? They're a Top 10 government contractor.", "score": 7, "replies": []}, {"body": "The fact that Delta doesn’t prepare the food (it’s a contract provider at the airport), their flight attendants are not unionized,  and the stock is already off its ATH by 14%… OP may be the guy they’re explaining the seatbelt to in the safety video.", "score": 6, "replies": []}, {"body": "Positions or ban.  Put your money where your mouth is pussy", "score": 16, "replies": []}, {"body": "Excellent. Calls it is.", "score": 6, "replies": []}, {"body": "Delta does 20% of the volume and makes 40% of the profits. They’re the only major airline that isn’t in the shitter right now.", "score": 4, "replies": []}, {"body": "DAL FAs aren't unionized. Therefore they won't be going on strike. Perhaps that was an AA FA you overheard.", "score": 4, "replies": []}, {"body": "And people wonder why they lose it all on the stock market…making bets based off of hearsay from one disgruntled employee is not the insight you think it is 😂", "score": 3, "replies": []}, {"body": "Dumbester post of the week award goes to…", "score": 3, "replies": []}, {"body": "https://preview.redd.it/btbsssjh05bd1.jpeg?width=1125&format=pjpg&auto=webp&s=d14ce84561c695be3e971cf96fc1fc9511d2d5fb\n\nDoes this look like something to bet against?", "score": 3, "replies": [{"body": "What app?", "score": 1, "replies": []}]}, {"body": "The hole in your argument here is that I’m a pilot and I can tell your FOR CERTAIN that DELTA is an acronym: Don’t Ever Leave The Airbus.  They’re still MILES ahead of other airlines.", "score": 3, "replies": []}, {"body": "Calls it is", "score": 2, "replies": []}, {"body": "OP mistakenly overheard his daughter in a pant suit chattering with her friends trolling him because they saw his poor portfolio. \"Want to see a dumb bet happen in real time?\" they would say.", "score": 2, "replies": []}, {"body": "So a non unionized work group is going to strike? \n\nThey’re not. I work for an airline. There’s so much wrong with the post I honestly don’t know where to start.", "score": 2, "replies": []}, {"body": "Funny I just bought some on Friday’s dip because of next week’s earnings. Oh well hope you’re wrong with your flight attendant evesdrop", "score": 1, "replies": []}, {"body": "If Delta Airlines FAs had a strike scheduled for next week, most of us would have known about it a month ago. OP is a 12 year old playing with mommy's computer.", "score": 1, "replies": []}, {"body": "DAL isnt unionized... not sure wtf OP is talking about", "score": 1, "replies": []}, {"body": "This is the stupidest post I’ve ever read on here and that’s saying something", "score": 1, "replies": []}, {"body": "Good thing I’m not flying Delta this week.", "score": 1, "replies": []}, {"body": "You realize the food is out sourced…this is a bad take.", "score": 1, "replies": []}, {"body": "Regard read Delta was actually on Dildo", "score": 1, "replies": []}, {"body": "Smoothbrain confirmed", "score": 1, "replies": []}, {"body": " Delta flight attendants do not have a union", "score": 1, "replies": []}, {"body": "Calls it is", "score": 1, "replies": []}, {"body": "American FAs are talking about striking. I don’t think Delta even has a union.", "score": 1, "replies": []}, {"body": "Delta primarily uses airbus no?", "score": 1, "replies": []}, {"body": "This is a more brain dead take than anything I’ve had the misfortune to come across in any ape sub holy moly this makes ape subs looks smart by contrast", "score": 1, "replies": []}, {"body": "Listen to some guys dumbass opinion on wsb or scratch my balls and do the exact opposite….? 🤔 \n\nThink I’ll go with the latter.", "score": 1, "replies": []}, {"body": "Stop using Boeing aircraft? I'm sure the stews would be horrified if Delta or another American company started flying the trash that is made in China or Russia.", "score": 1, "replies": []}, {"body": "Dal literally can’t refuse Boeing planes. Only 2 commercial manufacturers of planes in the world. And other manufacturer has more issues than Boeing. It’s up to the airlines to keep maintenance of these planes. Plus # of people flying is at all time highs. Good luck on your puts tho", "score": 1, "replies": []}, {"body": "makeing stonk calls based on stuff youve overheard in the airport boarding area checks out as a wsb move.", "score": 1, "replies": []}, {"body": "Such a regarded post that perhaps puts actually is the right play on this one ![img](emote|t5_2th52|12787)", "score": 1, "replies": []}, {"body": "After reading this I’m buying calls", "score": 1, "replies": []}, {"body": "“Refusal to stop using Boeing planes” directed at an airline known for their technical competence at maintenance so they can continue to fly older airframes that were never a part of the recent Boeing mess?\n\nGreat research. Next time look up Delta TechOps first.", "score": 1, "replies": []}, {"body": "Did you know that airlines generally operate at a loss on many of their flights and generate huge chunks of their revenue by selling points for their frequent flyer programs to business partners and their credit programs. Airlines are essentially banks and the banking portion of their business allows them to fly at a loss in order to keep prices in reach for most people. \nYou’ll never get a feel for how the airline is doing by walking around an airport.", "score": 1, "replies": []}, {"body": "I’m embarrassed posting this, but what the heck. Ok, sometimes, when I fly cross country, 3-5 times a year, if the 1st class ticket is only say $500 more than economy plus, I splurge. I have a bad back, and it’s worth it when spending 7 hours or so in a seat. Flew Delta 1st last week and was disappointed. Stewardess was great, very attentive, offering drinks frequently, etc. BUT on a 7-hour flight, only one meal served. I don’t expect Michelin fine dining, but it was subpar. Then just offers of typical airline snacks - chips, cookies, etc. No hot towels! Same tiny TV screen as economy. Worst, the seat was hard & uncomfortable - had to use my own padding. Oh yeah - was shocked that buying a full freight first class ticket didn’t give me entrance to the Delta Sky Club! With a long delay, these can be a lifesaver - free drinks, snacks, salads, lounge chairs, etc. \n\nListen, I know these are extremely first-world problems, but I expect Delta to be the best. And they don’t seem to be anymore. In contrast, United 1st x-country (usually - check Seat Guru!) has incredibly comfortable lay-down seats with footrests (it’s an amazing feeling to fly 7 hours and feel rested rather than exhausted after arrival), 30” tv screens, United Club access, and will serve you an ice cream sundae for a snack.", "score": 1, "replies": []}, {"body": "Travel demand is higher than ever btw. Not sure where you’re getting your info frok", "score": 1, "replies": []}, {"body": "American Airlines would fall first before Delta and United. They are still running the absolute shitshow of show they have. I’d fly delta over AAL anytime, even if I have to eat moldy food. Not happening anytime soon, neither.", "score": 1, "replies": []}, {"body": "Priced in. Your puts r fukkk ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "!Remindme 5 days", "score": 1, "replies": [{"body": "I will be messaging you in 5 days on [**2024-07-12 22:00:27 UTC**](http://www.wolframalpha.com/input/?i=2024-07-12%2022:00:27%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1dxk2az/dal_fucked/lc3pvmc/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1dxk2az%2Fdal_fucked%2Flc3pvmc%2F%5D%0A%0ARemindMe%21%202024-07-12%2022%3A00%3A27%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dxk2az)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Delta flight attendants aren’t even unionized…", "score": 1, "replies": []}, {"body": "pissed off employees say stuff like that all the time. Can you trust what was stated by your flight attendant? Delta seems to be one of the best-run airlines in the US. While I agree that the stock looks pricey, travel numbers are at all time highs right now. When will the travel boom come to an end? Personally, I think you're a tad bit early on the puts, but hey that's just my 0.02", "score": 1, "replies": []}, {"body": "Worry about your estrogen levels and leave the gambling to us.", "score": 0, "replies": []}, {"body": "Hmmm solid info but there is still the urge to inverse WSB Posts 🤔\n\nWith our luck, we'll all get put options and then the union and DAL will come to terms and there will be a rise in price!\n\nEDIT: MACD is negative on the week, month, 3month and year indicator, long puts look good!", "score": -1, "replies": []}, {"body": "Y’all put so much effort into what the slot machine is going to show on the next pull lol", "score": 0, "replies": []}, {"body": "Do what you want with that info. I'm holding 7/19-dated puts.\n\ndecay is a btich", "score": 0, "replies": []}, {"body": "Same, it looks juicy.", "score": -2, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1dxkvmk", "created_utc": 1720370738.0, "score": 41, "upvote_ratio": 0.83, "num_comments": 94, "comments": [{"body": "live muddle nose arrest spotted memory squealing doll light zonked", "score": 83, "replies": [{"body": "After research, you lost 15% each time. What lesson did you learn from it?", "score": 14, "replies": [{"body": "That public school was a joke", "score": 45, "replies": [{"body": "Do the private and charter schools teach better economics?", "score": 1, "replies": []}]}, {"body": "crush public abounding chunky wakeful mighty placid smell vase dull", "score": 3, "replies": [{"body": "My strategy( which I have noticed for a while) is good news stonk goes down, bad news stonk goes up, very good news stonk goes way up, very bad news stonk goes way way up. There is also too much overpriced ( high P/E) stonk which needs correction", "score": 1, "replies": [{"body": "nose towering steer unique direction makeshift command crowd reminiscent test", "score": 1, "replies": []}]}]}, {"body": "That shorting the stocks are better.", "score": 1, "replies": [{"body": "Not all shorting. You need to choose the best out of the worst", "score": 1, "replies": []}]}]}, {"body": "> lost 15%\n\nLook at this guy not losing 100% by picking the wrong move on massively OTM options", "score": 23, "replies": []}, {"body": "People really think that they can just google public knowledge and gain an edge over everyone else in predicting company earnings", "score": 9, "replies": [{"body": "Bro it's deep research ", "score": 13, "replies": [{"body": "Googling articles and reading company disclosures?", "score": 1, "replies": [{"body": "I just do the opposite of Jim Cramer lol", "score": 3, "replies": [{"body": "I always thought about using that technique.", "score": 2, "replies": []}]}]}]}, {"body": "I mean, in some cases they can. Nvidia experienced a massive fall at the same time as AI became the most discussed thing everywhere. You could get the stock at 120 pre split less than 2 years ago based on very public knowledge. I did and I only regret I didn't have more than 40k to put it in then.", "score": 2, "replies": [{"body": "Nvidia will be remembered as the company that supplied the tools to destroy the internet, flooding it with bots and useless search results, and maybe even the stock market, with couple of companies valuation that already lost connection to reality", "score": 1, "replies": [{"body": "jeans tap teeny sand axiomatic light bear gold worm six", "score": 4, "replies": []}]}]}]}, {"body": "Homebiogas meeting at 17th and I think they hit rock bottom already!", "score": 1, "replies": []}, {"body": "Earnings exactly as predicted, guidance is shit.", "score": 1, "replies": []}, {"body": "Which didn't you just do the opposite?", "score": 1, "replies": [{"body": "strong squash aware hateful growth vast quiet capable teeny tart", "score": 2, "replies": []}]}, {"body": "I feel that. Played MU near the money, ranked", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 48, "replies": [{"body": "I never pull out!", "score": 19, "replies": [{"body": "That can get expensive", "score": 3, "replies": []}]}, {"body": "Dkng in 3 weeks", "score": 1, "replies": []}]}, {"body": ">Are earnings worth the risk? Or you just end up losing money?\n\n![img](emote|t5_2th52|4259) Playing earnings is like gambling. Can go both ways (Got burned by TSLA last quarter). I rather wait for the dip after earnings to get in.", "score": 31, "replies": [{"body": "it can also remain flat after earnings, and fuck you both ways.", "score": 4, "replies": [{"body": "Companies can stay flat after earnings even after high volatility?? ![img](emote|t5_2th52|4640)", "score": 3, "replies": [{"body": "Share price, sure. And the IV crush can negate moves anyway.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 60, "replies": [{"body": "“IV crush” , most people neglect this fact", "score": 23, "replies": [{"body": "Realizing the market is completely irrational when it comes to earning news is a big mental hurdle to hop. \n\n“We have more cash on hand, and earnings per share increased” stock goes down 7%", "score": 15, "replies": [{"body": "That’s because you’re not factoring GUIDANCE", "score": 4, "replies": []}]}]}, {"body": "Chaos is an opportunity.", "score": 2, "replies": []}]}, {"body": "Here, people on WSB, they don't know exactly what they do. Sometimes, they act negatively on the positive result of earnings. Mostly, I pick two to three stocks (very volatile ones)with upcoming earnings and go only with either calls or puts on all three of them, randomly, no analysis at all. Most of the time, at least one of them make me profits and also covers all of my losses. I have been doing this for over a year, and I have been profitable. You need to be careful (please do some research) with Delta and Theta while choosing strike price.", "score": 21, "replies": [{"body": "Get outta here with your honest gambling system ", "score": 10, "replies": []}, {"body": "I appreciate when people dont pretend that they know what they are doing with overcomplicated jargon.", "score": 8, "replies": []}, {"body": "What delta and theta do you usually aim for?", "score": 1, "replies": []}]}, {"body": "I do not gamble on earnings. \n\nBut if you have some extra winnings and do not over leverage yourself it can be fun to add excitement.\n\nThe better move is trading post earnings.", "score": 8, "replies": []}, {"body": "Earnings is a good way to deliver asymmetrical returns to your portfolio. The problem is you need a big portfolio to do it. The f you have 200k, and you decide to play 3 earnings 10k each if they come out wrong you are down to 170k, with enough time you can make that 30k back, if you are right In 2 out of 3 you can easily make 70k or 80k.", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Don't try to guess direction - just buy either puts/calls on each one. Every time I guess direction, im pretty much wrong.", "score": 3, "replies": [{"body": "You’re absolutely regarded. Buying puts or calls is guessing direction! A straddle or a strangle is directionless long volatility play.", "score": 2, "replies": [{"body": "I wasn't clear. I meant I don't try to guess the direction of each stock I buy options on. I just pick a few that are likely to move, and then buy either calls or puts on each.", "score": 2, "replies": []}]}]}, {"body": "I’ve been right 2 out of 3 max. I played nvda, and Broadcom. Thought about playing micron to the upside, but I chickened out. I did get burned playing crow strike to the downside. For nvda and Avgo I had shares, for crwd I had put debit spread. Market sentiment is important when playing earnings, so is luck.", "score": 1, "replies": []}]}]}, {"body": "I’m almost always right on ER results, but I’m very negative on ER plays\n\nYMMV", "score": 7, "replies": []}, {"body": "Me personally, if the IV is too high I stay away. If you can afford to lose the money you risk then why not try to go for those made 10x-100x potential gains?", "score": 5, "replies": []}, {"body": "Someone please explain to me why playing a straddle on earnings is regarded.", "score": 4, "replies": [{"body": "The option sellers usually have an idea of what the stock range will be post earnings, up or down. The premium on the straddle almost always cancels itself out, or more likely due to theta, results in a net loss to you. The times it does work, is when the stock movement is far outside of the range that MMs predicted.\n\n(**Very basic** example:): Stonk A is trading at $50 -Option sellers predict it will either go up or down $4 at most.  The ATM call/put straddle costs $10 ($5 for each option). \n\nSo, if it trades in the range expected, your gains will not offset your losses. Now if something dramatic in the earnings causes the stock to move $10, that's when ideally the gain in your winning option exceeds the cost of both it and the losing option. I hope this made sense. Typing at the pool.", "score": 3, "replies": [{"body": "That made sense, thanks. I was thinking of high volatility cases where my expiration is a week out and the stock goes too far in one direction, then corrects, giving both options a chance to be profitable at some point during the week. But I guess IV crush and theta would eat my cookies.", "score": 3, "replies": []}]}, {"body": "IV crush", "score": 1, "replies": []}]}, {"body": "You can sell some volatility and make money off IV crush. But being wrong can cost you.", "score": 3, "replies": [{"body": "They're/where?", "score": 1, "replies": [{"body": "Some 1DTE to 5DTE expiry can lose 50% in value regardless of direction. You just need to set the option outside the expected move. \n\nIf it is not in the money, it will lose value. \n\nIf you sell a put and it increases in value l, you can get almost 100%", "score": 2, "replies": []}]}]}, {"body": "The WSB consensus is play 0DTEs on every volatile ticker you can find every day, regardless of earnings.", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 155 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 2, "replies": [{"body": "Only reason one would care about the WSB consensus is so he can do the opposite.", "score": 1, "replies": []}]}, {"body": "Every ‘news’ event is a total binary gamble imo. I used to try and load up ahead of CPI, Fed meetings, earnings, whatever, trying to catch the move early. Usually (even if I was right) there’d be enough volatility around it that I’d get shaken out somehow. \n\nProblem is even if you know the number in advance - like someone handed you an early copy of whatever it is before the market gets to see - you still don’t know how the market will react to it. \n\nImportant news, whatever it is, will usually matter for days/weeks ahead. Trying to be there early and catch every bit of it will usually get you burned.", "score": 2, "replies": []}, {"body": "I’ve hit huge but also have been hit several times. Tbh, probably a bit of a flip of the coin. Sometimes there are huge industry red flags that just haven’t been baked in yet and others the CFO announces something crae crae and just shoots you in the foot 😂. So in short don’t bet what you can’t lose with earnings, especially options/shorts", "score": 2, "replies": []}, {"body": "I'm such a cuck, I played it safe after winning on NVDA earnings 4/4 times, and sat out the last one and missed out on so much profit. Probably going to rage trade full port into this quarters earnings", "score": 2, "replies": []}, {"body": "Usually just wait till the next day or after the earnings are released if before the market opens. Don’t have to worry about IV crush or being right vs wrong. I play the move the market decides to make. Earnings are almost always a gamble.", "score": 2, "replies": []}, {"body": "I mostly try to purchase 10% OTM options early 2-3 weeks ahead of earnings. Your options will normally significantly appreciate in value only due to IV doubling. I usually sell 1 or 2 days ahead of earnings / take profits and keep on option for gambling", "score": 2, "replies": [{"body": "I purchased my nvidia options last week to play earnings run up.. too early huh because so far it’s not looking good lol", "score": 1, "replies": []}]}, {"body": "I like to see a nice draw down into earnings. Classic sign it's going to pump to liquidate shorts.", "score": 2, "replies": []}, {"body": "Need to do a lot of DD and be able to critical think out scenarios on why things could happen to the upside vs downside. Creating a thesis that is the reason for making the play to begin with and enforcing it with facts. Don’t just hope you’ll be right. Put the time in to make the best educated position that you can. Being lazy is exactly how you end up like all these other people who play options using margin posting images of how they lost a $100k in a few months. They can’t for the life of them figure out how they keep losing slamming 10k worth of options on a company they just learned the ticker for.", "score": 1, "replies": []}, {"body": "If its up before earnings call... it goes down after\n\n\nAnd vice versa", "score": 1, "replies": []}, {"body": "\"that was the only safe bet\" ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "I LOVE EARNINGS", "score": 1, "replies": []}, {"body": "Earnings are almost always a gamble, but it’s also a quick way to make tons of money if you’re lucky", "score": 1, "replies": []}, {"body": "Only earnings worth playing are Mag 7 recently.", "score": 1, "replies": []}, {"body": "It won’t work 9/10 times. But that 1 time it works is really cool", "score": 1, "replies": [{"body": "Remember hitting that 10x on NFLX....felt great than proceded to lose all the gain on next 2 options play.", "score": 3, "replies": []}]}, {"body": "Last earnings was nuts. Companies that missed earnings gained 10%. Companies that beat earnings dropped 10%. Logic and reason fell off the charts last earnings season.", "score": 1, "replies": []}, {"body": "Where people get themselves into trouble playing earnings is the same way they get themselves into trouble with everything else. They convince themselves they can't lose and develop overly concentrated positions. Being wrong about earnings isn't that big of a deal when you have less than 1% of your account exposed. It's fucking brutal when you have over 90% of your account exposed. Figure out what amount is that big of a deal to you and play with that.", "score": 1, "replies": []}, {"body": "Playing earnings is like 0DTE. Best of luck to you sir", "score": 1, "replies": []}, {"body": "Buy both calls and puts on high IV earnings, profits are less but profit is profit. Can anybody tell if I am missing any factor where this can get me fucked??", "score": 1, "replies": []}, {"body": "Even with the mag 7, there is always 1 or 2 that fuck up their earnings.\n\nBut I think this quarter every Mag 7 will beat earnings", "score": 1, "replies": []}, {"body": "Learned consensus is that for chip makers, the expectations for earnings is incredibly high. For example micron earnings Meg expectations and still went down chip makers are expected to beat analyst expectations and if they don’t it crashes be careful", "score": 1, "replies": []}, {"body": "So with WSBs being a casino you can “bet” on earnings, but purely from an investment perspective its nothing more than a gamble.", "score": 1, "replies": []}, {"body": "All in half and half deep OTM. Somethings gonna hit. Foolproof.", "score": 1, "replies": []}, {"body": "I'll be scalping etf pair.", "score": 1, "replies": []}, {"body": "WSB has a problem with expecting an earnings beat to automatically cause a rally. They don’t even care about guidance or whether something else like a stock split/buyback was expected. Or the action/sentiment pre earnings. DELL/MU are good examples here. For DELL after Q1 earnings it was an 110$ stock it traded all the way to 160$ before earnings. Yes they beat expectations but it was not a smoke in any way to justify the 50$ rally pre earnings. On top of the fact their data center revenue was barely a beat. For MU similar set up,  high run up into earnings, expectations beat but nothing special. And a stock buyback was being priced in too. \n\nI’m looking at CMG next earnings. Depends on how it trades into earnings though. If it’s <59 I think the market would be overreacting to this whole portion size BS. Especially because I think it’s bringing attention to them if anything. I’ll buy calls 63$ strike before earnings in this case.", "score": 1, "replies": []}, {"body": "I just made 68k profit off FDX earnings with call 30k buy in. I also lost a ton of money earlier in the year playing earnings but made it all back. I’m going into this next earnings season with $25k loaded up in RH and an optimistic outlook. I’m going to play calls on Mag 7 stocks.", "score": 1, "replies": []}, {"body": "I’ve only paid close attention to quarterly earnings for a year, so, grain of salt. I nearly bought calls for Dell just before their first report this year. I thought they were a sleeper and would kill it with AI frenzy. But I was too chicken to buy the contracts. 4k could have grossed ~120k had I done so (did in my paper account.) So then, like a fool, I tried the next ER. I was up 100% the day before and sold all but one contract. Letting that one run was a mistake and seriously cut my net gain short. Played MU next and just finished realizing the loss there. The lessons I took from it, I shouldn’t have had to experience, as I’d certainly been warned. Now I buy with some time leading up to the event and sell into the volatility just before and realize profits immediately. There is always another play in the current bull market. Also, generally buying some time and using LEAPS for capital management has served me well. (Position sizing and concentration with some diversification are the other two things that have helped me this far.) People here have been incredibly helpful. I strive to learn from their experience (and mistakes) and ask questions, as you have here, OP!", "score": 1, "replies": []}, {"body": "This quarter earnings will be horrendous for 86% don’t play", "score": 1, "replies": []}, {"body": "You can play the micro pullback after earning, in the direction of the earnings. It’s much more consistent over months of doing it than not having any data and trying a lotto", "score": 1, "replies": []}, {"body": "You are asking a place that has cost regular folks hundreds of millions of dollars for their advice?\n\nDon't get me wrong, I have had a lot of fun with the WSB shenanigans, and I am a 'regular folk' myself (though have not invested based on WSB). It has earned a place in history, but you will mostly find amateur investors and traders here with little to no wisdom to offer.", "score": 0, "replies": [{"body": "I have learned so much from people here. And have enjoyed such kindness. It has changed my life very much for the better.", "score": 1, "replies": []}]}, {"body": "If you do your own in depth research to formulate a decision on how a company is/will be performing and can assume earnings based upon that, then you can have an above average winrate playing earnings.  The issue most people have is they don't look at every possible piece of data pertaining to the company they are playing earnings on and make uninformed decisions with grand assumptions then lose and complain.  Those same people also love to post their \"DD\" here.  So long story short use your own judgement and research if you decide to make a play not others.", "score": -1, "replies": []}]}
