{"title": "MSFT and AAPL are overvalued and overbought, Wallstreet is expecting too much from AI.", "selftext": "I got to try Microsoft's copilot this week and i have to say i was underwhelmed by what it had to offer. It just felt like an enhancement for windows with more features, nothing ground breaking. This wasn't a major leap in technology like going from fax's to email. Tech companies releasing new (free)upgrades and new (free)products is like Nike releasing a new pair of shoes, just something else to add to the lineup. Will it make SOME peoples jobs more efficient, yes. Is it applicable for most people, i have to say no. Nike makes shoes for athletes but maybe 1-2% actually use them for what its intended for. Lets say a company has 20,000 employees, of those employees how many need it for their role or will using it on a daily basis? Maybe 90 % wont. If that's accurate a company will only pay for the 10% that need a user license.\n\nIf chat GPT was never released all the mag 7 earnings would still be about the same without it.\n\nNow for the overvalued and overbought. MSFT has a PE of 40, one of the highest of all the mag 7. You're paying $40 for every dollar they earn. Based on their current AI stack im not sure they will be able to beat the current expectations in a big way consistently. MSFT is not NVDA. NVDA chips cost $30k+ each, as much as a low end Tesla. Copilot has a free version and the pro version is $20-$30 per user. Most people at companies are not using this and im not sure this will add to the bottom line very much. That means most of the earnings growth will have to come from the cloud business, admittedly the cloud business has been growing at double digits for a long time but there is also a lot of competition in cloud space, at some point growth will slow as cap ex spending slows. The other thing to consider is what AI costs for these companies. The GPU's are expensive, Data storage is expensive and the energy demand from AI use is very very expensive. At some point AI use, especially from free users is going to eat into the profit margins.\n\nMSFT right now is like buying a over priced Cadillac, yeah it drives nice but its overpriced.\n\nAAPL is also overvalued at 35x earnings. Adding chatGPT to a smartphone and enhancing siri isn't worth the current valuation. The goggles were a bust. No new products on the horizon just same stuff just newer versions. Apple isn't the glamorous high growth tech company it once was. Iphones sales are falling off in China and this will definitely show in the next couple quarters of earnings. Its the Nike of tech stocks. People aren't spending $100 for shoes they certainly wont spend $900+ for a phone. I wouldn't be surprised if Buffet starts to offload shares at this PE ratio.\n\nThat fourth industrial revolution is not happening today or tomorrow, we are too early. This is going to take some time.\n\nI agree with Ken Griffin on this, the current AI products on the market are not the revolution many are hoping for, they're mediocre at best. There's too much spending and too much free products for this to add to any company's bottom line. The real winners are semi's, data storage and anything surrounding it.\n\n[https://www.cnbc.com/2024/07/01/ken-griffin-says-hes-not-convinced-ai-will-replace-human-jobs-in-near-future.html](https://www.cnbc.com/2024/07/01/ken-griffin-says-hes-not-convinced-ai-will-replace-human-jobs-in-near-future.html)\n\nThere is one area that will benefit astronomically from AI but that will come a bit later.", "id": "1dylq15", "created_utc": 1720476629.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 98, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 1004 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "I think its time to give the family computer back to your wife's boyfriend so he can work on paying the bills", "score": 68, "replies": []}, {"body": "This is like being in the 90s and saying the internet has no value because dialup is slow. ", "score": 87, "replies": [{"body": "As someone who regularly wanked it to dialup in the 90s, it took them 15 years to develop a handheld device for me to wank it too. 20 years for a quality wanking device. It’s not that it has no value. It’s that it’s too early to justify the bubble. Like OP said. I agree.", "score": 15, "replies": [{"body": "So the internet was overhyped in the 90's because you couldn't jerk it on the go?\n\nI still don't jerk it on the go did I miss something about what we are supposed to be doing with these", "score": 9, "replies": [{"body": "If you’re not jerking it on the go you may have low T. Let’s see that hairline", "score": 1, "replies": []}]}]}, {"body": "i had an old manager who worked at Cisco back then. he told me he bought a second home with the stock. once it hit another $10 higher per share, he was going to quit and retire early. that was his plan in 1999.\n\nwhen i met him in 2015 he was still working. i checked his linkedin, he's still working.\n\nthat's gotta fucking suck dude. to be a multi-millionaire in the late 90's just to loose it all and work another 25 years.", "score": 16, "replies": [{"body": "You just gotta keep rolling your ‘easy’ gains into ‘safe’ assets.\n\nStarting to sound like a boomer here!", "score": 7, "replies": []}]}, {"body": "...then the dot com bubble burst, sometime around the widespread adoption of broadband.\n\n\nYou're making a solid argument for the OP.", "score": 14, "replies": []}, {"body": "Doesn’t mean a dotcom bubble can’t exist", "score": 1, "replies": []}]}, {"body": "People have been leveling similar criticisms at AAPL since 2010. At the end of the day, it mostly comes down to iPhone sales. Many analysts believe that regardless of how useful the Apple Intelligence features end up being in the short term, the fact that you’ll need an iPhone 15 Pro or higher to run them will significantly increase sales. I tend to agree with that assessment, and also believe that Apple will eventually implement some compelling “on device” use cases which will be good enough for most users.\n\nI don’t have much to say about MSFT, other than the fact that between cloud computing, operating systems, productivity software, gaming, tooling, and (yes) AI they are probably the best balanced big tech company in the world.\n\nI’m long both stocks and always will be. Oh, and people aren’t spending $900 for a phone. They are spending that money for a pocket computer that has replaced about 10 separate portable devices over the last 20 years.", "score": 20, "replies": [{"body": "I think you are missing the point. AI only increases sales....if it is good and people actually want it. It probably is shite.", "score": 1, "replies": []}]}, {"body": "Either show us your puts or show us on the doll where the bulls touched you last week ![img](emote|t5_2th52|4275)", "score": 18, "replies": []}, {"body": "Apparently you havnt seen AI boobs", "score": 10, "replies": [{"body": "Where?", "score": 1, "replies": []}]}, {"body": "🏳️‍🌈🐻", "score": 15, "replies": []}, {"body": "Generative AI is overhyped. AI is not. Especially in the long run.", "score": 16, "replies": [{"body": "Relevant-username^2", "score": 2, "replies": [{"body": "Relevant username cubed", "score": 1, "replies": []}]}, {"body": "AI at this point is theoretical tho. We don’t even know if it’s possible to make actual AI. It certainty won’t be available anytime soon.", "score": 2, "replies": []}]}, {"body": "If co pilot is 30 a month you’d need 33 million users to make 1 billion dollars a month on subscriptions\n\nThat would be 12 billion a year \n\nWhich is half of what nvda made last year just off 1 product in the MSFT catalogue \n\nIn January they said “Office365 has 400 million paid users driven by Copilot innovation”\n\nMsft office is 70 a year btw so that’s 28 billion dollars just in Msft office subs, assuming they subbed for the whole year. That’s more than NVDA made in 2023 just on MSFT office subs\n\nSo I don’t know bro. GitHub copilot is like actually replacing coding jobs right now and it has 1.3 million subscribers which is only 20 million dollars\n\nI have no problem with a bear case for AI in a shorter time frame, valuations are through the roof. But the underlying revenues here seem ok. I guess it really does depend on that though and that’s probably what everyone should be looking at \n\nHow many people are actually subscribing for AI. I’d love to know the answer", "score": 12, "replies": [{"body": "Head of IT Architecture here at an insurance broker. None of the developers use Co-pilot, but the AI chatbots we have implemented have improved our sales channels by 70%", "score": 7, "replies": []}, {"body": "Software dev here, no one I know is using co-pilot. All the big companies have huge privacy concers around it. Maybe freelance devs are taking it up.", "score": 5, "replies": [{"body": "No. I work at a big tech company as a design for test engineer a.k.a silicon design engineer.\nEarlier I used to help our team with scripting because most of them lack good scripting skills and had them depend on me for it. I was enjoying all the attention.\n\nNow they have introduced copilot and any idiot can whip up quick scripts. I'm losing my advantage in real-time.\nI fear for the future.", "score": 1, "replies": [{"body": "So you are saying a team of hardware guys are using co-pilot to code SCRIPTS. Lol ok. Let me know when teams of software guys are using it widespread in a meaningful way.", "score": 1, "replies": [{"body": "Well it always starts small.", "score": 1, "replies": []}, {"body": "Software guy here, I occasionally use co-pilot or tabnine  but basically just for scripting.  They are mediocre at it at best but mostly save time on things under about 150 lines of code.  \n\nI can use it to get rough start to a script or maybe a function or two then bash out the rest up to about 150 lines.  After that, basically tell it to optimize, add comment, and modularize.  From then on it’s really only useful for avoiding looking up syntax and junk for anything specific I want to do. \n\nMy question is when will the resources it requires become cheaper than human labor for the bigger tasks?   Or when will they even be able to make enough infrastructure to support that?  That is the major bottleneck I can see right now.  I can eat a server box worth of threads and DRAM just trying to get it to digest a medium size script and do something meaningful, hence the line limit.", "score": 1, "replies": []}]}]}]}, {"body": "GitHub Copilot is currently replacing coding jobs? \n\nThe layoffs have nothing to do with AI, companies were massively overhiring devs in 2020-2022 and are cutting the fat.\n\nMaybe here and there a stupid manager believes that tons of devs will be replaced by AI, but that's not what anyone in the field sees right now.", "score": 1, "replies": [{"body": "I’ve heard the exact opposite from people on Reddit that claim to be in the field \n\nSo I guess without any stats it’s just anecdotes", "score": 1, "replies": []}]}]}, {"body": "So calls on MSFT and AAPL, thank you :)", "score": 9, "replies": []}, {"body": "Everything in the mag 7 is overvalued. People just don’t want to say that and justify AI.", "score": 5, "replies": []}, {"body": "Ngl bruh this post is mad cringy. You loosing hella aura points on this one", "score": 38, "replies": [{"body": "Thanks for the confirmation that im on the right track .", "score": -18, "replies": [{"body": "I am with you. All the reddit regards are against you, so you are definitely onto something. AAPL jumped the shark this year and is a dud, and although Microsoft is still a baller, there is definitely an AI correction that is gonna hit them pretty hard soon.", "score": 1, "replies": [{"body": "AAPL is up +21% to MSFT's +25%. Calling Apple a dud (because of the Vision Pro?) but MSFT overbought doesn't track.", "score": 1, "replies": [{"body": "AAPL is a dud for many reason, not specific to the vision pro.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ghey. Bear.\n\nThat was a lot of words to just basically say \"I don't know how to write an effective prompt.\"", "score": 4, "replies": []}, {"body": "You're right but none of this matters until after November", "score": 7, "replies": [{"body": "Why November? It's NNN season?", "score": 3, "replies": [{"body": "Post election the need to \"pump\" markets might fade. If trump wins then some of these companies might face headwinds.", "score": 2, "replies": [{"body": "so market will pump until Nov but that's already priced in?", "score": 1, "replies": [{"body": "We gonna see 6000 at this pace…", "score": 1, "replies": []}]}]}]}]}, {"body": "MSFT will pass $500 and do a 5 for 1 split within a year. They are over due for a split, if anything.", "score": 6, "replies": [{"body": "msft hasnt had a stock split since 2003. and every split has been 2 for 1. or 1.5 to 1.", "score": 1, "replies": []}]}, {"body": "Microsoft has been proving for more than 40 years that they are not rarely the best at any part of technology, but they are consistently the best at _MONETIZING_ technology.\n\nName any product today that they make, and someone else makes a better one.  But they just never seem to lose when it comes to billing. That's always been their strongest talent.", "score": 3, "replies": []}, {"body": "And they are calling for a 10% correction!   Soooo that means I’m staying balls deep in since that still equals 30% gains for the year!\n\nDon’t fight it my follow degenerate, just welcome it until it no longer welcomes you!", "score": 2, "replies": []}, {"body": "I guess you’re new here. AAPL & MSFT only go up ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "i read 12 words.\n\ni agree.\n\nalso: i only know 12 words.", "score": 2, "replies": []}, {"body": "Found the guy with Nike calls and NVDA puts!", "score": 2, "replies": []}, {"body": "Ok China.", "score": 3, "replies": []}, {"body": "Just show us your loss porn after earnings", "score": 1, "replies": []}, {"body": "People just hoarding money in stocks cuz they don’t know better", "score": 1, "replies": []}, {"body": "Not really. They’re fine. \n\n\nTesla has falling sales numbers and even worse; -75% quarterly operating income and just pumped 30% in a week.", "score": 1, "replies": []}, {"body": "What, you thought AAPL was going to g8ve you the HAL 2000?", "score": 1, "replies": []}, {"body": "\"I don't know how to use AI\"", "score": 1, "replies": []}, {"body": "Right now the short term profits was selling AI shovels (NVDA/AMD). Long term is retaining market share revenue, which MSFT and AAPL fall into.", "score": 1, "replies": []}, {"body": "Let’s see that short position, or stfu", "score": 1, "replies": []}, {"body": "You really want to bet against Tim Apple and Johnny Microsoft?", "score": 1, "replies": []}, {"body": "calls it is!", "score": 1, "replies": []}, {"body": "As long AAPL and MSFT are either buying NVDA with the CapEx or indirectly using products that have to buy NVDA to do Ayeeee Eyeee...\n\nNVDA will be mooning along with AAPL and MSFT. They will all be launching to $4T and then $5T and then $10T", "score": 1, "replies": []}, {"body": "You have to realize AI is in the embryo stage and the market is pricing in those who are best positioned to grow it into a real boy", "score": 1, "replies": []}, {"body": "I work at a company that just dropped a few Billion with a B  into AI. (Yeah, we all have cars with doors that open up like this... ^ )\n\nThe daily use of AI has allowed us to start rolling off offshoring and do mass cuts on low level talents. Copilot specifically has allowed me to stop attending useless internal meeting, get a summary and actually get work done. I can also do stuff like compile an instant agenda and craft a response without wasting much time on it.\n\nOn the bigger scale, initial testing has demonstrated AI is as accurate as contract attorneys for doing first level review, so we'll be able to save more Billions with a B to buy cars with doors that open up like ^ not like - .", "score": -1, "replies": [{"body": "Sounds like some major ROI for AI (radio on the internet)", "score": 5, "replies": []}, {"body": "As an attorney, no it hasn’t. I’ve yet to meet a single attorney who would rely on a first level review from AI, which we do from juniors. Of course, since AI would be useless to assemble existing contract terms (we already have those, no need for AI), and very few counsel like to rely on novel terms…", "score": 6, "replies": [{"body": "It's cute you threw out a bunch of words without knowing what you're talking about. \n\nFirst off, being an attorney is meaningless. It's obvious you're not in corporate law doing large scale reviews (500+ reviewers for time sensitive matters such as 2Rs, congressional inquiries, etc.). I said nothing about search terms...idiot. \n\nSecondly, attorneys are the biggest regards on the face of this planet. I've yet to meet an attorney that knows anything about tech and doesn't just forward requests to a vendor, so STFU because I know from personal experience you have zero clue about what I'm talking about. I'm at the end client and you'll do what I say, ok lawyer? \n\nFinally, TAR 1.0 has been a standard for well over a decade and DOJ rarely pushes back if you know what you're talking about, which you obviously do not. Prioritized review (TAR 2.0/conceptual analytics) has also been established in case law for a while now. In contrast, Generative AI review tools aren't available to the public and still in the beta evaluation phase. If you worked at a real law firm, you'd know that. Here's an article from people I've actually worked with and know personally so you can STFU and stop acting like you actually know anything... \n\nhttps://www.relativity.com/blog/welcoming-generative-ai-into-the-cockpit-the-gpt-4-pilot-in-relativityone/", "score": -3, "replies": [{"body": "Someone sounds salty with all those personal attacks.", "score": 3, "replies": [{"body": "I really hate lawyers. Like I'm Hitler, but with attorneys.", "score": 1, "replies": [{"body": "What kind of camp do lawyers go to? Not a concentration camp?", "score": 3, "replies": [{"body": "There’s a joke there somewhere.", "score": 2, "replies": []}, {"body": "The Special Olympics camp?  ![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "Why do you hate lawyers so much. Please rant to me StocksGoBrr, dont hold back.", "score": 2, "replies": [{"body": "Oh man...\n\nTo start, most corporate lawyers have a liberals arts background and learn to game the system early to prop up their GPA rather than get any kind of real world skill or analytical mindset. (I went to an Ivy and many of my classmates went to law school and they use such strategies as claiming mental illness for extra assignment time or exam alternatives and leverage outside resources for the assistance on papers, etc.) An attorney then goes into their worthless program for a few years which is more or less a glorified internship incubator program without any actual skills nor prep for the job. Once they enter as an Associate at some prestigious firm, they're essentially thrown into big legal matters without much prep and expected to keep up utilization by billing whatever client they're attached to. These arrogant idiots refuse to take direction and often times create complex messes for which they bill millions upon millions of dollars until it's discovered many years down the line. As attorneys progress their career, they really just become glorified salespeople. Partners aren't experts in the real world scientific sense, they just have a client list and get credits based upon their new business origination, managing clients, name recognition, etc.. During their careers, they're expected to promote their names by any means to which I've seen the biggest idiots I've worked with speak in front of audiences with only the arrogance an incompetent attorney can muster or people that came from sensitive senior government roles exploit it by turning around to use their personal connections to protect foreign enemies (and charge a fortune for it). There's also an ultra conservative culture where the partners are treated as gods since they bring in money to the firm, which results in most being absolutely terrible scum of the earth, viewing their title as a license to berate and treat others as subhuman servants.  (notice the guy that originally responded tried to invoke his status \"as an attorney\" without realizing I'm a SME in the field) \n\nI am currently in a position where I am their boss and also a subject matter expert, which has changed this dynamic dramatically. Once you reach this side of things, the role is more about acting similar to what a contractor does in construction (but with regarded children), but also with protecting your firm from risks and predatory behavior. I can't tell you how many times I or one of my peers have had to absolutely tear apart and fire a law partner and their team for providing no value and making up fake bills, which is all considered normal in the legal field. \n\nUltimately, you'll realize most attorneys have no clue what they're doing. I've interacted with ones that type their entire email in the subject line because they can't figure out email despite their job literally revolving around tech and such things as forensic metadata. I've also interacted with many such as the types above that learn just enough to act like they know what they're talking about to land a sale or promotion, but have no depth of knowledge and ultimately pay another firm to offload all the work too. There are multiple tiers of consultants and vendors the law firms hire to do all the real work which they'll mark up to high hell and bill the end client. All the while, the 'legal strategy' for most attorneys amounts to just producing as many documents as possible in order to overwhelm the other side and keep the litigation going as long as possible to bill the client until they retire.\n\nNow, there is a path into law by having a technical background, but I can use a few fingers to count how many amongst the thousands I've interacted with have an engineering degree. What makes this worse is the law degree is essentially a ponzi scheme. Corporate law is what actually pays, but most will never meet the requirements so they end up paying a few hundred thousand for a degree that pays little more than a fast food employee these days. \n\nAlso, many are absolute degenerates that are also psycho/socio-paths. Sexual harassment, open drug use in the office, etc...everyone that's worked in law long enough has a story. \n\nDon't even get me started on personal stories. One involves a woman named Meytal, who used to call a vendor and scream for over an hour that THEY need to be more creative to predict her mistake before she made it and fix it and they better answer within 5 minutes of her emailing. She would bill the end client thousands for these calls...\n\nYou see, modern litigation is very lucrative. I've worked on the client side previously and worked with major companies. Someone like Meta may spend a few hundred thousand per month on a single matter that you see in the news. Multiply this by a few hundred, which is the volume a very large company may see across a few years. Where there's money, there are thieves.", "score": 0, "replies": [{"body": "Lol, I don’t know what a SME is. I have no knowledge of the law field. But this seems pretty accurate.", "score": 2, "replies": [{"body": "Subject Matter Expert. Yeah, notice none of the lawyers responded to my rebuttals because they don't actually set any of the document reviews up nor use the actual tools, but happy to assert themselves as an authority. Imagine a doctor not knowing a thing about medical treatment and charging you hundreds of thousands for their opinions, which was actually outsourced to an actual expert! It's one of the only industries someone can start near $200k/yr with absolutely no skill, knowledge nor talent and be up to a few hundred thousand per year by peddling themselves as a false authority. \n\nAttorneys are completely unaware that Large Language Models are currently being tested at their end clients (like me) with the sole goal of phasing out their overpriced incompetence and handling diverse and complex data sources that have popped up in the past few years (such as versioned doc history) that humans can't do without a high degree of error. \n\nAnother anecdote... Zuck actually instituted a policy that requires all legal bills be pre-approved and separated into small chunks because of the rampact overbilling. Just to keep billing, Outside Counsel were essentially doing work and redoing it daily. Once they instituted this policy, their next earning call swung from massive losses to gains. Attorneys are absolutely worthless and one of the main reasons everything in our society is so overpriced.", "score": 2, "replies": [{"body": "Damn, should I pursue a career in law? I am a youngin.", "score": 1, "replies": [{"body": "Honestly? I wouldn't recommend it. The early years in your career will consist of working every holiday and weekend and taking abuse from incompetent people that will take credit for all your hard work. \n\nJust being real with you, if you want the money, follow your passion. If you have a passion for tech, try finding a digital forensics program or doing some computer science. You can follow that into consulting and be on a 7 figures/year partner path. The most important thing is to find good internships while you're in school. I know plenty of people that are now big names (such as expert witnesses in the Kobe trial, etc.) that make more than lawyers and work on interesting problems.", "score": 2, "replies": [{"body": "I have no passion for law whatsoever.", "score": 2, "replies": [{"body": "Stay far away from law then unless all you care about is money. Lol\n\nAn acquaintance I know has a JD from Harvard and quit law after working at an internship at a top law firm in NYC. That mistake cost him a few hundred thousand...", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Thanks brother", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You’re also wrong about AI saving money though. Over the last year AI responsiveness coding has gotten more common and yet there are more contract attorneys employed than ever and getting paid more after the post covid drop in rates. Why? Because everyone is terrified of getting sued for sending their client’s precious privilege docs or hot docs to the other side (not to mention PII etc) and while they can look at responsiveness predictions and say a certain level is ok, they can’t say AI says this is just a little bit privileged so its fine to send out. Do that and the whole house of cards starts to look shaky.\n\nPlus cases are bigger than ever and AI makes it barely tractable by humans which leads to more investigstions or suits happening. And company data growth never leveled off, a case that was 2 million docs in 2014 can be 20 million in 2024.\n\nMaybe OpenAI is telling the truth and in 5 years we have fully general AI and can settle lawsuits with the click of a button. Fine call me when that happens.", "score": 5, "replies": [{"body": "Oh look, another dumbass lawyer that doesn't know a thing about tech... Review prioritization isn't AI and LLMs have just started being released so no, your reviews haven't used them. What current conceptual analytics do is use a form of NLP to ascertain a likeness score and work best to reduce the time it takes to find targeted material. If you knew that and leverage it that way, it's a huge cost saving. Otherwise, the old analytics tools are best for risk aversion. This isn't what LLMs do and why AI is much more valuable/cost saving. LLMs literally evaluate similar to a '4 corners' approach and have been proven in studies to be as accurate as 1L reviews. If you've actually done any review and QC, you'd know there are many contract attorneys that have to be let go and multiple rounds of wasteful QCs by review managers then OC, etc.. \n\nThere are much different current concerns than what you've stated. Since you're unaware, my firm launched private clouds for different LLMs that we have sole control over, which is similar to what Relativity is implementing in Azure. The actual concerns wrap more around where my data will end up and the repercussions that may follow if their cloud isn't locked to each individual tenant. \n\nAlso, since you're too dumb to understand what I said previously, I am the client. What I say goes or you're fired.\n\nSELECT *\nFROM GFY", "score": -5, "replies": []}]}]}]}, {"body": "fam is this insider info", "score": 1, "replies": [{"body": "It's not if you made it up. Dude is talking out of his ass and gets super defensive and confrontational when challenged. I bet he's yet another basement dweller that drank AI koolaid.", "score": 1, "replies": []}, {"body": "Just keep buying NVDA calls until the lawyers are homeless, you regard...\n\nhttps://preview.redd.it/h8sqa6s1zhbd1.jpeg?width=1080&format=pjpg&auto=webp&s=c35c6f764bbf0f45f847a276d1933453174d7140", "score": 1, "replies": []}]}]}, {"body": "I think we overestimated the Internet. I think we are underestimating AI.", "score": 0, "replies": []}, {"body": "LMAO", "score": 0, "replies": []}, {"body": "How exactly did you use copilot to come to this conclusion?\n\nYou realize there are a ton of different models, AI integration into azure services, and more being enabled by MSFT right?\n\nYou a replace most T1 support in a few days using the azure tools available if you have sufficient documentation of your product support flow.\n\nMsft provides powerful tools through copilot integration, and also enables next generation AI compute for research, generative AI services etc\n\nMsft will head to mid 500s by next year and then split.", "score": 0, "replies": [{"body": "he prob did some 2 big integer addition problem and then saw it was wrong and was like see ai dumb...", "score": 0, "replies": []}]}, {"body": "Yeah literally it's their only product. If they were a cloud play, or a software play, hardware play, semi conductor play it'd be much more appealing........", "score": 0, "replies": []}]}
