{"title": "Where did the myth that the market won't crash during an election year come from?", "selftext": "[removed]", "id": "1e3hdks", "created_utc": 1721003208.0, "score": 87, "upvote_ratio": 0.81, "num_comments": 94, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 554 | **Previous Best DD** | \n**Account Age** | 12 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Prob from the same people who keep pumping meme stocks here to dump them on regards.\n\nEvery time someone says \"no crash on election year\" someone brings up '00 and '08. Doesn't stick because you underestimate how delicious crayons are.", "score": 43, "replies": [{"body": "It's just so weird... The most recent, major market crashes happened during or had at least started (dropping at least 20%) before the election.  Yet, people here keep insisting that a crash can't happen this year, and use the upcoming election as their argument.\n\nIt's kind of like the diamond engagement ring thing.  DaBeers managed to plant a seed that people should spend a months salary on a ring.  Then people just ran with it like it was gospel.  I remember when it changed from 1 to 2 months salary.  Now it's at 3.", "score": 12, "replies": [{"body": "Ringflation.. diamond printer go brrrr", "score": 9, "replies": []}, {"body": "That’s because they swear the current administration can’t let it happen.. as if they got the power to do so.", "score": 3, "replies": [{"body": "There are a lot of false assumptions that could be put in check soon.  The idea that \"stocks only go up\" is another one.  If you zoom out far enough, sure.  However, people ignore that it essentially took 13 years for the S&P to get past the ATH it set in 2000.", "score": 3, "replies": []}]}, {"body": "It could but I don't see it happening with big tech now being a defensive position, no one really wants to take a risk on anything else. I think when things become calmer and more certain, you'll see the mag 7 trade unwind a bit and get a decent sized drop in QQQ/SPY.", "score": 4, "replies": []}]}, {"body": "Pfft that’s only 2 election years out of like…1000 right?\n\n/s", "score": 5, "replies": [{"body": "Just 46 cuz 46 Presidents", "score": 2, "replies": [{"body": "Presidents can serve 2 terms", "score": 2, "replies": [{"body": "Presidents can serve deez nuts", "score": 4, "replies": [{"body": "Can confirm.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "believing comments and rumors on WSB is like taking medical advice from your local crackhead", "score": 13, "replies": [{"body": "I need to remember this quote everytime I see a pumper post.", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/v386kql46lcd1.jpeg?width=1080&format=pjpg&auto=webp&s=54e58172099fe433a486b0d814594fdc503190f3", "score": 14, "replies": [{"body": "Never tell me the odds...", "score": 1, "replies": []}]}, {"body": "Market crashed in 2008", "score": 35, "replies": [{"body": "The 2008 crash kicked off in 2007. Look up the history of the Bear Stearns collapse.", "score": 29, "replies": []}]}, {"body": "This is exactly why the market probably will crash this year.  Also because I bought LEAPS at the top.", "score": 17, "replies": []}, {"body": "I just bought two packs of Newports for $15. Deflation is here and the economy is slowing much faster than people think.", "score": 30, "replies": [{"body": "That is terrifying honestly. Where do you live?", "score": 5, "replies": [{"body": "The south", "score": 5, "replies": [{"body": "How much cheaper is that than normal, because o live in the northwest, and a pack of Newports probably cost you 13 here.", "score": 3, "replies": [{"body": "One thing that also factors heavily into the price of cigarettes is where you buy them from. Here are the prices I see in my area (south FL) for Camel Crush based on the store.\n\nPublix: almost $11 per pack\n\nWalgreens: around $9\n\nWawa: $8.50ish\n\nMurphy Gas (aka Walmart gas station): two packs for $15 when using your free Murphy Rewards account", "score": 3, "replies": []}, {"body": "If you buy one pack it was usually 9.25. If you buy two at certain spots it’s cheaper but I haven’t seen them this cheap since Covid started.", "score": 3, "replies": []}]}]}]}, {"body": "Deflation on some goods and services does not mean that the entire economy is experiencing deflation", "score": 5, "replies": []}, {"body": "I’m seeing all nicotine products drop prices. We are seeing fast food competition. I am definitely seeing deflation finally.", "score": 5, "replies": []}, {"body": "Can of Camel Snus $8.99 😭 🐪", "score": 1, "replies": [{"body": "They were 2.99 forever aww", "score": 2, "replies": [{"body": "But the snus got hit with taxes. A roll used to cost 24-26$ then they added a 20$ tax to each roll and most of the price hike is just that. Tax.", "score": 2, "replies": []}]}, {"body": "Camel sus? Lol", "score": 1, "replies": []}]}]}, {"body": "2020 was a market crash. Look where we ended at the end of the year 🙂", "score": 9, "replies": []}, {"body": "Bro. This time is different", "score": 6, "replies": []}, {"body": "history is where it came from", "score": 5, "replies": []}, {"body": "Election years are volatile. But wont crash. If it crashed 20% in one month it will moon 30% in the next.", "score": 9, "replies": []}, {"body": "It only happened those two times, then two more times in history. All 4 times something very significant happened. We are on the verge of multiple significant things. Notably WW3", "score": 3, "replies": []}, {"body": "It's usually because the party in power doesn't want things to get shitty, and they do have things they can do to edge the economy, or at least the perception of the economy, one way or the other.  Now they DGAF as it is one purple, globalist party in command.", "score": 9, "replies": []}, {"body": "Preemptive rate cut (ie not cutting because of shit being broken), Trump election (very favorable for corporate taxes) will send this to new ATH. So no dumps this year.", "score": 12, "replies": [{"body": "People saying trump will get elected are way past understanding the american electorate.", "score": -30, "replies": [{"body": "Wrong. Every reliable forecaster I know is putting Trump ahead in Electoral count but behind in popular count.", "score": 14, "replies": []}, {"body": "You saying this tells me you don't understand the effect of an assassination attempt. As of yesterday, I am 100% positive Trump will win the election.", "score": 2, "replies": []}, {"body": "Bit hypocritical huh", "score": 3, "replies": []}, {"body": "He will, and it will crash the market by this time next year. He inherited a growing economy last time, and kept overstimulating. Biden did the same. There’s nothing left to stimulate.", "score": 0, "replies": [{"body": "I'm over stimulated but can't stop won't stop.", "score": 2, "replies": []}, {"body": "Interest rate drops will pump the markets", "score": 6, "replies": [{"body": "Good luck with that. Buy calls, to the moooon etc. \nI started selling stuff last week take some profits. I don’t trust any of this.", "score": 6, "replies": [{"body": "Time in the market always beats trying to time the market \n\nI don't gamble on options", "score": 5, "replies": [{"body": "r/lostredditors", "score": 7, "replies": [{"body": "I forgot where I am, that is true.\n\nThis must mean the market is about to moooon ![img](emote|t5_2th52|4276)", "score": 6, "replies": [{"body": "There you go, that’s more like it", "score": 3, "replies": []}]}]}]}, {"body": "Lol timing it using chicken bones? No way you're timing it right and are missing out.", "score": 1, "replies": [{"body": "I’m happy with 4.85% in my HYSA.", "score": 2, "replies": [{"body": "Schwab money market is 5.1% so you're missing out. Also that's APY which you won't see when rates get cut. \n\nUnless you have a short term need, you're not timing it right. Market is up 18% already.", "score": -1, "replies": []}]}]}]}]}, {"body": "Market did amazing during Trump, I think it averaged around 17%. \n\nWhen they cut rates and money flows like spice, market go up.", "score": -4, "replies": [{"body": "Yeah it did. Where do you think that inflation the past 3 years came from?", "score": 3, "replies": [{"body": "That was the money printer which the crash in '22 helped correct. Unless you forgot that 20% ride? \n\nYou know why interest rates were hiked faster than ever right? They can only go down, and with inflation at 3% we're Gucci. \n\nIf they don't time cuts correctly, we got deflation and all the gay bears have a parade.", "score": 1, "replies": [{"body": "I think the market is overestimating the effect of somewhat lower rates. We’re not going back to free money this decade. Unless the next administration fucks up even more than I expect them to.", "score": 1, "replies": []}]}]}]}]}, {"body": "It's all about perception. That shot to the ear made a martyr out of a moron. Trump beats whoever the dems trot out. Biden is breathing a little easier because for a day, the focus is not on his ineptitude.", "score": 3, "replies": []}]}]}, {"body": "Full years was it up or down\n\n  \n[https://www.macrotrends.net/2526/sp-500-historical-annual-returns](https://www.macrotrends.net/2526/sp-500-historical-annual-returns)", "score": 5, "replies": []}, {"body": "If this is business plot 2 the electric boogaloo,  I would expect a drop in October to seal the deal for Trump, but dems shitting bed so bad we might get a landslide leads to lower taxes on the rich rally.", "score": 3, "replies": []}, {"body": "Its not a myth. Its historical statistics. Sure there are years it doesnt follow the statistical trend but no one suggested the trend was 100% accurate. \n\nThe two outliers you list are simply that. Outliers. \n\nAnd those years actually follow somewhat the historical data that you have a pull back in election years (and most other years) in september and october. Those are very often the worst months. \n\nTrading is about finding an edge. That edge is never 100% or else you would have an infinite money glitch.", "score": 3, "replies": []}, {"body": "it comes from WSB. i saw a post about it 6 months ago....so it s safe source. Anyway...Biden sign 500pound bomb delivery to resume so just buy was stocks ITA PPA or their AI providers ;)", "score": 4, "replies": []}, {"body": "What was happening and happened in 08 before and after Obama got elected?", "score": 2, "replies": [{"body": "The same thing that happened in 2000 and is happening now... an interest rate cycle", "score": 10, "replies": [{"body": "Lol not even close to the same thing. Diapers dot com was a billion dollar website with no revenue in 2000. NVDA on the other hand has 300% revenue growth and prints money.", "score": 1, "replies": [{"body": "Who sold their products to companies like diapers dot com who then turned around and put \"AI\" in their quarterly reports, used it to fluff the report, but will ultimately fail cause the it's over hyped.", "score": 1, "replies": []}]}]}]}, {"body": "YO MAW!", "score": 1, "replies": []}, {"body": "Relax and enjoy the fun!", "score": 1, "replies": []}, {"body": "I dunno, but Trump should have his own stock ticker.", "score": 1, "replies": [{"body": "They could use his initials for the stock ticker.", "score": 1, "replies": []}]}, {"body": "There are no guarantees. There are some patterns related to election cycles that are real and are related to how the power of a new administration declines over time and how administrations try to avoid \"making sudden movements\" before elections. Tendencies, but nothing is sure.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "...I don't know", "score": 1, "replies": []}, {"body": "The fuck kind of copium do y’all bears be on bro", "score": 1, "replies": []}, {"body": "Will be interesting", "score": 1, "replies": []}, {"body": "The market dumps 24 points on average after rate cuts start.  Bonds get more attractive, and the money printer is out of ink.  Money into bonds comes out of equities", "score": 1, "replies": [{"body": "Yeah, I think that's another myth that's perpetuated... that the market will pump after a rate cut.  I said \"dead cat bounce\" because any gains that come after a rate cut are usually given up shortly after.", "score": 3, "replies": [{"body": "https://www.forbes.com/sites/paulweinstein/2024/03/29/what-history-tells-us-about-the-feds-timing-of-interest-rate-cuts/", "score": 1, "replies": []}]}]}, {"body": "I can't hear your ber propaganda over the brrrr of my calls. 😌", "score": 0, "replies": []}, {"body": "lol oh let’s see your position or omg stfu cause no one cares you pussy.", "score": 0, "replies": []}, {"body": "Is that you Nancy? What do you know!!! CALLS or PUTS Nancy?!?!!", "score": 0, "replies": []}, {"body": "Common sense", "score": -1, "replies": []}, {"body": "That’s where it came from    Elections are a joke   It’s rigged   A bunch of well timed bullshit    Is your question even real? Lol", "score": -3, "replies": []}]}
