{"title": "Tesla Stock Nearly Wipes Out 2024 Losses. Elon Musk Is World’s Richest Person Again.", "selftext": "", "id": "1duuuww", "created_utc": 1720056580.0, "score": 269, "upvote_ratio": 0.79, "num_comments": 107, "comments": [{"body": "Can we wipe out the 2022 losses?", "score": 27, "replies": [{"body": "Yes.", "score": 2, "replies": []}, {"body": "I am gonna need my 2023 taken care of too while you are at it", "score": 1, "replies": []}]}, {"body": "Bhahahah shorts ded. This what happens when you’re stupid. When you stand against human technology evolving. You get absolutely steam rolled", "score": 122, "replies": [{"body": "Yeah. Who the hell bets against technological progress??\n\nWhen in history has technological progress been a bad thing?", "score": 16, "replies": [{"body": "Bill Gates apparently 😂", "score": 7, "replies": [{"body": "Bill gates made another fortune shorting TSLA ", "score": 1, "replies": []}]}, {"body": "Theranos", "score": 2, "replies": []}, {"body": "Luddites, radical ecologists, radical believers....", "score": 4, "replies": []}, {"body": "That’s why I started buying stock at end of 2022 - all tech and especially TSLA was absurdly ridiculously down. It was the biggest gift anyone’s ever been given. Wtf was wrong with the entire world back then and wow have I “timed the market”", "score": 2, "replies": []}, {"body": "Paul Bunyan would like a word", "score": 1, "replies": []}, {"body": "Define progress with no new models and the disaster of the cucktruck?", "score": -2, "replies": []}]}, {"body": "^ this 👍", "score": 3, "replies": []}, {"body": "Preach", "score": -1, "replies": []}, {"body": "* market share: Q1 2022 \\~75% ---> Q1 2024: \\~52%\n* sales down \\~9% Y/Y\n* revenue down \\~9% Y/Y\n* income down \\~55% Y/Y\n* earnings per share down \\~53% Y/Y\n* Net margin down \\~51% Y/Y\n\nNothing about this is healthy. To make matters worse:\n\n* Merc already has L3 on the road.\n* Volvo, BMW, Jaguar, Ford, Land Rover, and Volvo are all aiming to have L3 on the road sometime in 2025.\n* Waymo already has autonomous taxis on the road.\n* I promise you that there's zero use-cases for anthropic robots in most automation applications. Omron already have [Autonomous Mobile Robots](https://www.omron.com.au/solutions/environmental-mobility/robotics/mobile-robot/overview/) (AMR's) to market, and they're really quite excellent and competitively priced for what they do. I know this because I have personally used them in a factory automation design *last year*.\n\nI got out of the stock in 2022 and I'm glad I did. I genuinely hope I'm wrong, because a lot of you seem to have a lot of money tied up here. Hopefully I'm full of shit and it does well for you, but I genuinely can't see what's being priced in besides the CEOs fantastical promises.\n\nAnyway, best of luck. Hope you get the chance to point and laugh at me and my paper hands in the future.", "score": -10, "replies": [{"body": "Apple market share of touchscreen phone market 2007\\~100% 2024 \\~24.7%.\n\nApple is doomed /s.", "score": 17, "replies": [{"body": "Difference between Apple and Tesla tho is that Apple is able to sell their phones with insane margins (50%) while Tesla has become more of Samsung due to having to cut prices to maintain sales and now their margins are no longer as impressive as they used to.", "score": -7, "replies": [{"body": "It's a different market.  Tesla just needs to put out a great product that's better than its competitors.  Just like Apple is trying to do with its suite of products.\n\nOnce Tesla dominates the overall car market and sells it can charge whatever it wants.  Also Tesla is more than a car company - cars, batteries, battery storage, solar, space exploration (via SpaceX), AI, neurolink, self driving, etc.", "score": 1, "replies": [{"body": ">Once Tesla dominates the overall car market and sells it can charge whatever it wants.\n\nThis assumes everyone else goes bankrupt which is likely not happening considering that Tesla has hit the demand wall already.\n\n>space exploration (via SpaceX), neurolink\n\nYou can't just combine other companies to Tesla. Tesla will never see the money these companies make because they are not part of Tesla. They are not contributing to bottom line.\n\n>cars, batteries, battery storage, solar, AI, self driving, etc.\n\nPretty sure you said batteries twice here. Solar is not making money at present to my knowledge. Issue with AI and FSD is that they are not making money at present or likely in near future. They are potential revenue sources that have yet to happen and it is unknown when they will happen and in what form. What ultimately matters is can you turn your research to product that people are willing to buy and preferably do so with good margins.", "score": 1, "replies": []}]}, {"body": " A smaller margin on a product that costs 10 times as much. Every other EV on the market is running at negative margins.", "score": 1, "replies": [{"body": "Apple sells 230 million phones annually or over 100x as much as Tesla sells cars. If Tesla would sell 20 million cars annually that would be equivalent due to higher price but as of now not the case.", "score": 1, "replies": [{"body": "your missing the point. Tesla has a high margin on cars, compared to other car makers.\n\n20% of the whole vehicle market is preferable to a 100% of a tiny EV market. 20% of the whole phone market is preferable to a 100% of a tiny smartphone market.\n\nIt was never Tesla's plan to sell the majority of EVs once they became mainstream.", "score": 1, "replies": []}]}]}]}, {"body": "😂 not true tho there were other touchscreen phones before tho", "score": -2, "replies": [{"body": "Right I remember owning a Sony Ericsson and also a Nokia with a touch screen", "score": 1, "replies": []}, {"body": "insert your own numbers then. Either way, by the previous poster's metric, Apple is doomed.", "score": 1, "replies": []}]}]}, {"body": "You completely lost me when you mentioned Mercedes L3... really... do your research, this is very basic...\n\nEDIT: i see you post on realTesla....", "score": 27, "replies": [{"body": "You clearly have no understanding on the levels to appreciate the difference between a supervised feature complete system and an unsupervised specific use case, or the advantages of the latter with respect to regulatory approval.", "score": -15, "replies": [{"body": "You clearly never read the disclaimer from Mercedes...", "score": 15, "replies": [{"body": "We wrote an extensive article on self driving levels and the in essence Mercedes and Tesla are on 2 very different paths, but the unavoidable truth, whether Tesla supporters like ourselves like it or not, is Tesla are still very much L2, and Merc L3. We suspect the real value however will only occur when L4 is reached, and that’s still to be seen except for Waymo and a few other specific trials https://tesla-info.com/blog/self-driving-levels.php", "score": 0, "replies": [{"body": "> Tesla are still very much L2, and Merc L3\n\nTrue, just as how a \"moon landing\" neural network hacked in a few hours today is \"real AI\" and the system from 1969 wasn't.\n\nWhether MB is L3 and Tesla is L2 is besides the point; it's an apples-to-oranges comparison, obviously. It's like asking whether a spoon is better than chopsticks... for what purpose?\n\nIn any case, that certain OEMs are claiming L3 is not indicative that they are actually delivering more useful products to consumers or more technically advanced than their competitors. It's trivial to create an L5 system today that takes you from point A to A. That's unfortunately not very useful. Here's the code:\n\n    # Code", "score": 0, "replies": [{"body": "If someone would deliver highway only L3 I would say it would likely be more useful for consumer today than FSD although not technically more advanced. There is just so much value the moment you are allowed to take your hands and eyes off and do something else.", "score": 0, "replies": [{"body": "Problem is, Mercedes is NOT offering Highway L3! They are offering an extremely limited scenario, which is probably less than 20% of the cases.", "score": 1, "replies": [{"body": "That's why I said if someone would offer. No one is currently offering that.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Lost me when you said merc and L3. Proves the lack of knowledge", "score": 9, "replies": [{"body": "Right? The financials are open for criticism, and opinions on the relevance of these automobile industry data in a high interest-rate market can and will vary.\n\nBut bringing up Mercedes' laughably constrained L3 system as if it's a valid talking point shows great naivety.", "score": 2, "replies": []}]}, {"body": "Does Waymo scale? No!\n\nHow much does each one of them cars cost, how many could they produce a year? and how many cities are they in.\n\nThey have to geo fence each location, and how do they deal with road works which can happy randomly anywhere.", "score": 8, "replies": []}, {"body": "Merc L3 is an absolute joke - never make that mistake again bringing that garbage product into ANY discussion with adults. Labels don’t mean jack if the thing itself is a cute lab demo that can’t even stop at a stop sign. If a system only works on some freeways in 2 states, under 45 mph in perfect weather (and no tunnels), and requires a car in front to lead it - it’s not a competitive product - it’s a lab demo that only works in traffic. You clearly haven’t even walked near a Tesla with FSD enabled, much less seen the stark differences between the systems. \n\nLet’s hope the rest of the L3 cars you mentioned can do MUCH better than the joke Merc released. \n\nWaymo is awesome, but still can’t scale quickly because HD maps are for tiny cities and scanning the earth will take too long for them to get off that requirement. Even if they did, Tesla fleet dwarfs Waymo significantly. \n\nOne thing Tesla will have to worry about though, is if their 8/8  Robo taxi has significantly different camera placement, it will be a tacit admission that their current blind spots are a deal breaker for their current set of cars. There are significant issue when half the car has to stick out into an intersection for it to see cross traffic in dense areas.", "score": 3, "replies": [{"body": "The Merc system is limited by the regulators, when it reverts to L2 it’s a perfectly capable L2 system that operates at higher speeds than the Tesla system on suitable roads. It’s doesn’t try to do what Tesla does, but what it does try to do it goes further in autonomous terms.", "score": 1, "replies": []}]}, {"body": "Whether you’re full of shit or not, your reasoning is flawed.  You’re looking at a single quarter as your determinant.  That’s a MASSIVE mistake.  Until you learn to handle longer term timeframes you absolutely should not be investing in any individual stocks whatsoever. You are one of those, who should definitely stick with index funds. But don’t feel bad. At least 99% of the population is in the same boat.", "score": 2, "replies": [{"body": "Longer timeframes only work for Tesla when you look forward and never backwards at the trail of broken promises. In 2017 people were buying Tesla stock on the promise of FSD in a year or two, then people were buying in 2018 on the promise of FSD in a year or two. Now it’s obviously very different 6 years later when people are buying on the promise of FSD in the next year or two and also ROBOTS!", "score": 1, "replies": [{"body": "Incorrect.  You’re making yet another fatal mistake.  Tesla and SpaceX striving for, yet missing internal goals has resulted in complete dominance in their respective industries.  I.e. the game is not who makes the best estimates.  It’s the progress compared to competitors (who are all missing Elon’s goals by WAY more than Elon’s companies.\n\nWhen did you acquire this weird fetish with how accurate estimates are as the most important thing?  Did your school give awards to those who predicted the time they would be able to run their races in, versus the students who actually won the races?\n\nAnd secondly, looking back, Tesla has shown, magnificent, revenue, growth, profit, growth, cash flow, technology increases… Tesla looks great over the long-term, whether you look forward or backwards.", "score": 1, "replies": []}]}]}, {"body": "Okay, explain to me why Elon became the richest man on the planet yesterday? You forgot that bullet point.", "score": 1, "replies": []}]}, {"body": "If you bought stock in 2020 you’re up $11 a share not even keeping up with inflation 🤣", "score": 0, "replies": [{"body": "Now do 2019, 2018, 2017, 2023, 2024….. 🤗, the years there wasn’t a worldwide sales disrupting pandemic virus. 🫨", "score": 2, "replies": []}]}, {"body": "Depends on when they entered their position. If late 2021, they're probably feeling great. Even 1 year ago would be fine.\n\n\nMost folks that are short are from long short funds so they might be long NVDA / short TSLA for example.", "score": 0, "replies": [{"body": "Collective Tesla short losses in 2023: -$13 billion, that’s their ‘BeSt’ year so far 🤣. Or are we looking at a specific person on a specific day, so you aren’t embarrassing yourself?\n\nIt was at -$5 billion a month ago in 2024, probably much much more after the recent rally. \nLet me guess tho, YOU specifically are not included, because ALL the reddit shorts are on yachts swimming in pools of money 😂. You guys never make mistakes! MUCH WOW!\n\nEdit: it’s been 3.5 BILLION in 2 days of losses 😭😭", "score": 3, "replies": [{"body": "Performance year over year and even YTD on Tesla has been negative. Same Nov 2021 to now.\n\n\nAgain, most shorts are from long short funds so if the market is up, short performance will typically be negative and long performance typically positive.\n\n\nThere is nothing noteworthy here. Our hedge fund is short MSCI EM futures but up 32% this year because our long positions have outperformed.\n\n\nThat's what a hedge is. Long tech, short TSLA would have done well and this almost certainly how those shorts were traded.", "score": 1, "replies": []}]}]}, {"body": "Absolutely cream pied", "score": -4, "replies": []}, {"body": "Meanwhile bulls getting wiped down to $160 also forget their hubris.", "score": -10, "replies": []}, {"body": "Elon is a shit person.", "score": -11, "replies": [{"body": "Ah, projecting, nice contribution to humanity.", "score": 4, "replies": []}]}]}, {"body": "Let’s see when the earnings report this month", "score": 16, "replies": []}, {"body": "I love how everyone wanted green / EV’s, Elon does it and all of a sudden they’re anti everything. It shows they’re short even their own dogma", "score": 50, "replies": [{"body": "Important point: \"everyone\" in this example, are that loud minority that occasionally line up with the right thing for the wrong reasons, who only care about what they're *told* their dogma is. \n\nA lot of times, worthwhile causes become trendy. But the people who really care about them stick with them, even after something else becomes the new trendy thing.", "score": 18, "replies": [{"body": "Agreed, and it’s the main area where my fellow lefties have disappointed me, because renewable energy is what we need, even if the guy who’s working like an absolute animal for it says and believes some regrettable things. \n\nI try to pay less attention to the Perpetually Indoors People.", "score": 2, "replies": []}, {"body": "Agreed", "score": -2, "replies": []}]}, {"body": "deranged fertile cake crown school lush faulty governor languid wakeful\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}, {"body": "Firstly, it was never realistic to threaten to disrupt 1/3rd of paychecks without attracting widespread ire.\n\nSecond, playing the role of shaitposter mcputinfluffer on social media is stupid.", "score": -15, "replies": [{"body": "Imagine thinking someone who enabled the US to independently launch spacecraft made the US less dependent on foreign oil, and supplied internet to Ukraine is a Putin fluffer. Could you be anymore wrong? ", "score": 8, "replies": [{"body": "Also Elon's companies never left Russia because they never came to Russia. The guy simply categorically avoids the Russian market even before it became fashionable.", "score": 5, "replies": []}, {"body": "I’ll take LazerPig’s take on Gonzolo Lira over Elon’s sources.  👍", "score": 1, "replies": []}]}, {"body": "What?", "score": 3, "replies": [{"body": "The automotive sector is directly or indirectly linked to 1 in 3 jobs.  Musk has been insufficiently anti-authoritarian in his posting.", "score": -8, "replies": []}]}, {"body": "> mcputinfluffer\n\nAh yes. That is so much worse than giving his military adversary critical communications equipment (at the direct request of their govt too).", "score": 0, "replies": [{"body": "Not letting the UA leverage Dishy McFlatface as a weapons guidance platform is arguable.  I disagree with Musk’s decision but I can accept that I may be missing facts.  It’s when Elon repeats moronic propaganda about Zelenskyy embezzling funds is where I start having problems.  The red army is and always has been atrocities on rails.  🛤️", "score": 1, "replies": [{"body": "Given the amount of waste fraud and abuse in our own government, how insane so you have to believe that other governments are doing the same with our money? ", "score": 1, "replies": [{"body": "My friend, where do you place the error bars for how the moscovy rus treats their subjects?", "score": 4, "replies": []}]}, {"body": "> Not letting the UA leverage Dishy McFlatface as a weapons guidance platform is arguable\n\nThat's not a call for SpaceX to make unilaterally. That is something for the US govt to decide. Even the use of Starlink as a comms system was allowed under the purview of the Pentagon. They can't just decide unilaterally to allow it's use to strike Russia (unless the US govt allows it).\n\nJust like Lockheed or Raytheon cannot be expected to supply weapons platforms to Ukraine even if Ukraine sent a direct request to their CEOs. It would have to be permitted by the US govt first.", "score": 1, "replies": [{"body": "Tell that to the civies that got hit days, weeks, and months later by the russian navel assets that were kept in action by actions that Elon is blamed for.", "score": 0, "replies": [{"body": "> by the russian navel assets that were kept in action by actions that Elon is blamed for.\n\nYes, they can be told that. Because he is being blamed for things outside his control. It is the responsibility of the federal govt to authorize actions like that.", "score": 1, "replies": [{"body": "Not helped when Elon equivocates for Putin while performing his regular shiatposting.", "score": 1, "replies": []}]}]}]}, {"body": "Let’s not forgot the “pedo” who helped recuse those trapped kids in that flooded mine.\n\nElon got told how impractical his rescue plan was by folks who are certified in cave diving and got all butt hurt over it.", "score": -3, "replies": [{"body": "That’s a low price to pay for full flow staged combustion getting off the ground.", "score": 3, "replies": []}]}]}]}]}, {"body": "Oh come-on dont be a such a victim. \n\nNobody says anything bad about other Teslas. Its the cybertruck that gets all the ridicule. Which it deserve.", "score": -6, "replies": []}, {"body": "All the issues \"everyone\" has with Tesla are personality based. Even the quality failures and shaky product launches have a direct correlation with Elon's personality and directives.\n\n\"everyone\" would not be \"anti everything\" related to green/EVs otherwise", "score": -1, "replies": [{"body": "You can’t say that here dude. Everyone here sucks Elon’s dick and doesn’t understand that being anti-Elon does not mean anti-EV.", "score": 1, "replies": []}]}]}, {"body": "If he’s the world’s richest person again, get ready for the constant smear campaign to get roaring back up on tv and social media. It’s the world’s biggest target on your back and it’s intensified when you aren’t politically correct.", "score": 26, "replies": [{"body": "The question becomes what happens when you eventually own the largest media company", "score": 3, "replies": []}, {"body": "It’s been worse than the trump presidency content for all those grueling years, even", "score": -10, "replies": []}]}, {"body": "And it’s only 1/2 way through the year! Happy Independence from Oil Day!", "score": 3, "replies": []}, {"body": "Now it just needs to wipe out the rest of the losses from when he said 'buy the dip' (at $300, in 2022, the day before he dumped billions more on the open market).  The long-term downtrend he gave us with repeated insider dumping (himself, and through his foundation) isn't broken until we start closing above $265.  The \"dip\" is over ~$300.", "score": 19, "replies": [{"body": "I’m still mad over “stock too high” tweet ![img](emote|t5_n9evv|3866)", "score": 7, "replies": [{"body": "“Price too high” then precedes to have a stock split. \n\nIt was greatest hint ever", "score": 10, "replies": []}]}, {"body": "Also, Elon \"promised\" to not sell more Tesla stock for two years.  And that was in late 2022.\n\nHmmm...", "score": 1, "replies": []}, {"body": "[removed]", "score": -2, "replies": [{"body": "[removed]", "score": 0, "replies": []}]}]}, {"body": "I just buy whenever.", "score": 5, "replies": []}, {"body": "Oh fuck Barons why would I pay for that FUD outlet", "score": 3, "replies": []}, {"body": "I wonder how many sales came from the .99% apr promo. Loans are almost 7% again so Tesla will have to do something to keep the delivery numbers up for q3+", "score": 1, "replies": []}, {"body": "So we are going to get more articles shitting on Elon now ?", "score": 1, "replies": []}, {"body": "Do t forget what spacex is worth", "score": 1, "replies": []}, {"body": "You can only cook the books for so long.  Remember when Tesla only remained solvent because of bitcoin mining.", "score": 1, "replies": []}, {"body": "spark faulty quiet silky wild expansion safe fanatical snails sulky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}, {"body": "You can check my post history. I’ve said this time and time AGAIN, you NEVER bet against the musk (nor zuck).", "score": -2, "replies": []}, {"body": "All the bad guys are winning. What is going on here?", "score": -16, "replies": [{"body": "You think Tesla, the company that showed the world EVs were viable while also leading the charge in both home and grid scale batteries, is the bad guy? \n\nAre Exxon, Chevron and Saudi Aramco the heroes of your story? Because they're certainly the ones paying for the misinformation that influences your views.", "score": 16, "replies": [{"body": "Phillip Morris gets [twice the ESG score](https://nypost.com/2023/06/15/elon-musk-slams-woke-sp-rating-after-marlboro-beats-tesla/) (environment, social and governance), so Tesla must be the bad guy.", "score": 5, "replies": []}, {"body": "I was talking about Elon, not Tesla. I love Tesla! I own one.", "score": 1, "replies": []}]}]}]}
