{"title": "What are your plans on bloodbath?", "selftext": "I’m buying more NVDA and NVDL 🫠😂😭🤞", "id": "1e5q7qp", "created_utc": 1721242596.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 89, "comments": [{"body": "Bathe in the blood and buy more", "score": 30, "replies": [{"body": "Already did 😂🤣, I cashed out half my savings account today just so I don’t miss the dip", "score": 11, "replies": []}]}, {"body": "Bloodbath? You can't be serious. Just zoom out dude.", "score": 51, "replies": [{"body": "Many people joined the train late, so all their gain could be wiped.", "score": 20, "replies": [{"body": "Patience.  In a few years it'll be $200 a share ..", "score": 5, "replies": [{"body": "$300 by 2026", "score": 1, "replies": [{"body": "Possible", "score": 1, "replies": []}]}]}, {"body": "Happened to me at 500 went to 400. Just bought more.  Now still buying the dips and doing well. I know a little more about the science than most folks. They are way way ahead of the competition.", "score": 4, "replies": []}]}, {"body": "For some people it was 🙃", "score": 19, "replies": []}, {"body": "Cause I already had some leveraged nvda", "score": 2, "replies": []}]}, {"body": "Bought a little more today but am waiting to buy more until Friday, after Trump’s speech tomorrow night", "score": 7, "replies": []}, {"body": "My plan is to stock up on acorns and then to go about and throw them at homeless people at night/early dawn.", "score": 9, "replies": [{"body": "I'm sure you have a squirrel costume", "score": 4, "replies": []}]}, {"body": "Yall do realize it pulled back more than this the end of June right?", "score": 4, "replies": [{"body": "Nope.  Their charts are only showing a couple hours at a time.  You can tell them to zoom out, but you are wasting your breath.", "score": 3, "replies": []}, {"body": "A 20% drop.", "score": 1, "replies": []}]}, {"body": "not touching for a while,  will nibble at 115,   take a bigger bite at 100-105  and blow my load  go all in at 90-95", "score": 6, "replies": [{"body": "Next big buy is the gap at $95", "score": 2, "replies": []}, {"body": "Idk timing the market never worked for me. Will see what happens tomorrow and then decide", "score": 2, "replies": [{"body": ">Idk timing the market never worked for me. ***Will see what happens tomorrow and then decide***\n\nIsn't this the very definition of timing the market.  😂", "score": 5, "replies": [{"body": "Like I call that loss management more than timing, market timing for me is like waiting for it to dip even more otherwise don’t buy/ waiting for the stock to go as much as it can and sell. Stuff like that", "score": 2, "replies": []}]}]}]}, {"body": "Bought calls i always fall for days like this i buy puts next day market has amnesia and watever reason they dumped it thry dont remember next day it pumps n im taking losses not again", "score": 3, "replies": [{"body": "Bear/bull traps. Can’t really time those especially with falling knife price action. Anyway I’m in 08/16 calls.", "score": 2, "replies": []}]}, {"body": "I’m waiting for NVDA to get to 90s low $100s. That’s if they tank it that low. If so well then I will unload at least $50k in buying. Done deal", "score": 8, "replies": [{"body": "Nah, they have resistance around 115$ imho", "score": 6, "replies": [{"body": "Trump making big headway into the election. I like him and his big mouth. He keep’s putting pressure on countries to fork up for defense it’s a short term head fake on knocking down tech. When that happens I will unload. Then we all know his cabinet members and even himself, they will collaborate and tone done rhetoric and then vrooooom! Back to the $130s", "score": -8, "replies": []}]}, {"body": "I am waiting for $40.", "score": 0, "replies": [{"body": "$40??? We are then taking serious corrective measures", "score": 1, "replies": [{"body": "Not a dream to see $20 even imho.", "score": 0, "replies": [{"body": "NVDA not holding at today’s opening", "score": 1, "replies": [{"body": "Yea I think it will close at $100 today.", "score": 1, "replies": [{"body": "It’s rebounding nicely now. Looks like we can make some money today", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Good call I just sold most of mine l I bought in way too high at 120s too volatile now. I’ll wait till after election or when it gets that low to buy more but my dumb ass went in like 9K.", "score": -1, "replies": [{"body": "Law. It’s all good. I bought in at highs on so many positions like NVDA, AAPL and had to wait. We all get caught at times", "score": 2, "replies": [{"body": "Yeah I had 2K in gains wiped out in 2 days lol. First time newbie investor but clearly I wasn’t diversified enough", "score": 2, "replies": [{"body": "!remindme 36 days", "score": 2, "replies": [{"body": "I will be messaging you in 1 month on [**2024-08-22 23:54:03 UTC**](http://www.wolframalpha.com/input/?i=2024-08-22%2023:54:03%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/NVDA_Stock/comments/1e5q7qp/what_are_your_plans_on_bloodbath/ldp041r/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FNVDA_Stock%2Fcomments%2F1e5q7qp%2Fwhat_are_your_plans_on_bloodbath%2Fldp041r%2F%5D%0A%0ARemindMe%21%202024-08-22%2023%3A54%3A03%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201e5q7qp)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Maybe so but I’m not going to stick around to find out when I bought in at 120-128$ a share lol", "score": 1, "replies": []}]}]}, {"body": "Guys TSMC reported good numbers this AM, Taiwan Semiconductor Manufacturing Company on Thursday beat revenue and profit expectations", "score": 1, "replies": []}]}]}]}, {"body": "Grabbed some calls today for Aug 30", "score": 2, "replies": []}, {"body": "You're regarded.", "score": 2, "replies": []}, {"body": "NVDL is a trap ......  Buy more when NVDA hits 90", "score": 2, "replies": []}, {"body": "I buy more every week", "score": 2, "replies": [{"body": "I like this idea", "score": 2, "replies": []}]}, {"body": "Please quit stonks if this is a bloodbath to you.", "score": 2, "replies": []}, {"body": "This is not remotely a bloodbath.", "score": 2, "replies": []}, {"body": "WTF is bloodbath?  Down only 6.42% last I checked.  Chill out, take a walk, and get some fresh air, bud.", "score": 3, "replies": [{"body": "I sold quickly on 8%and bought back on 14.5% dip tho", "score": 1, "replies": [{"body": "What went down 14.5?", "score": 1, "replies": [{"body": "NVDL, SOXL, NVDU etc", "score": 1, "replies": []}]}]}, {"body": "Leveraged ones down a lot more", "score": 0, "replies": [{"body": "Yes, that’s how leveraged plays work", "score": 3, "replies": [{"body": "Yeah, by bloodbath I meant everything’s downtrend today and by a long dip, I’m not panicking it was just sudden and for a stupid reason", "score": 1, "replies": [{"body": "Your strategy doesn’t make sense. You say you suck at timing the market, yet you play with leverage? Also, you can’t expect the NVDA Stock subreddit to be on the same wavelength as traders. Some are traders, sure. But most people here are investors, those who believe in the company longterm, not cuz they’re analyzing every bump and jiggle in the price movement", "score": 1, "replies": [{"body": "Think if you want to make money in investment, then you need to understand the movement. You can’t just rely on nvda to go up every time. I know it’s very unlikely but there could be a serious downtrend someday, are you still gonna hold on over -20% or would you try to exit on -10% and re entry later on the lowest dip. You need to be a professional trader to understand how excellent market timing works. I do trading as a side gig", "score": 0, "replies": [{"body": "Alright. So you were just being modest. I respect that. As long as you have your trading rules and risk management, I don’t have any objections", "score": 1, "replies": [{"body": "Yeah, playing with leveraged etfs feels much easier than day trading tbh. Cause when I do day trading, it’s a gamble. But on leveraged etfs like nvdl, tlss, usd, tqqq I know they will be back up", "score": 1, "replies": []}]}]}, {"body": "My exit strat at market timing is working, it’s the entry I make mistakes sometimes. I bought on the lowest dip today, let’s see what happens tomorrow", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Meh no big deal. Bought a bit more 🤷‍♂️", "score": 3, "replies": []}, {"body": "Jump in and add some bubbles", "score": 1, "replies": []}, {"body": "I'll buy at 99. no one can time the market exactly", "score": 1, "replies": []}, {"body": "I had -3.5% off my portfolio today.  Stocks in my portfolio AAPL AMD GOOGL NVDA PYPL TSLA", "score": 1, "replies": [{"body": "I had -6% 🙃🫠, am up 2.4% on post market tho", "score": 1, "replies": []}, {"body": "Looks like you need to diversify your portfolio. My nvda was down but as a whole I was up.", "score": 1, "replies": []}]}, {"body": "Haha just buy in days like this and hold. Time in the market > timing the market", "score": 1, "replies": [{"body": "Best advice you can get for this stock", "score": 4, "replies": []}]}, {"body": "it's one gap down day...relax.  look for rebuying around that gap fil 103-107", "score": 1, "replies": []}, {"body": "No bloodbath until Sept or later. Minor pullback", "score": 1, "replies": []}, {"body": "Buy more shares", "score": 1, "replies": []}, {"body": "Bought puts", "score": 1, "replies": []}, {"body": "See Black Monday 1987; that was a bloodbath. This is a blip.", "score": 1, "replies": [{"body": "What %", "score": 1, "replies": [{"body": "22", "score": 1, "replies": [{"body": "Pshshhhhhh that's just 3 blips", "score": 1, "replies": [{"body": "It was the largest percentage drop in stock market history. Ten percentage points more than the crash in ‘29. If the Dow dropped 9000 points in a day, tomorrow, you might rethink.", "score": 0, "replies": [{"body": "I'm just joking becuz u said 7% was just a blip... So 22% is 3 blips", "score": 3, "replies": []}]}]}]}]}]}]}
{"title": "Global chip stocks from Nvidia to ASML fall on geopolitics, Trump comments", "selftext": "[removed]", "id": "1e5eubd", "created_utc": 1721212178.0, "score": 1309, "upvote_ratio": 0.93, "num_comments": 89, "comments": [{"body": "Off topic:  Not bringing up stocks or the stockmarket.\n\nAlmost any post related to stocks and investment is welcome on r/Stocks, including pre IPO news, futures & forex related to stocks, and geopolitical or corporate events indicating risks; outside this is offtopic and can be removed.\n\nPosts & comments that are purely political, religious (dealing with morality), or focusing on other types of investments not related to stocks such as real estate, crypto, designing websites, or even selling sneakers will be removed.  An example of what wouldn't get removed:  Discussing real estate when related to the ETF VNQ or real estate bubble affecting the stock market.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "RIP, premarket is an absolute bloodbath. Gonna be wild seeing damn near every tech stock opening with a gap down.", "score": 720, "replies": [{"body": "Ah, the last Trump years were a gong show. Trump moving the market with his tweets, then the next day his people in government going idnwtf he is taking about. Market goes nuts again. Please don’t re-elect this guy again, he is an imbecile. \n\nNow that people think he will win, get used to this shit.", "score": 1128, "replies": [{"body": "I’m just going to keep ignoring the media and corrupt judges constantly helping this guy and vote for literally anyone but him. It’s sad how short the collective memory of the country is but I don’t want to go back to that psychotic government.", "score": 554, "replies": [{"body": "People keep talking about the misery of living through “multiple historical events” and fail to recognize the common denominator.", "score": 301, "replies": [{"body": "It’s like hearing the word “unprecedented” has really picked up since 2016….", "score": 115, "replies": []}]}, {"body": "[removed]", "score": -300, "replies": [{"body": "Trolling, insults, or harassment, especially in posts requesting advice, is not tolerated.  Please try to keep discussions on /r/stocks civil by providing straightforward responses without including any insults or harassment.\n\nContinual abuse of /r/stocks rule #5 regarding trolling, insulting and harassment will result in your account being banned.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -216, "replies": [{"body": "[removed]", "score": 85, "replies": [{"body": "[removed]", "score": -122, "replies": [{"body": "You're not in control of what Biden does only what you do. If trump wins, Biden will definitely be one of the biggest to blame. Question is do you want to share that blame as well?", "score": 46, "replies": [{"body": "[removed]", "score": -115, "replies": []}]}]}]}, {"body": "Off topic:  Not bringing up stocks or the stockmarket.\n\nAlmost any post related to stocks and investment is welcome on r/Stocks, including pre IPO news, futures & forex related to stocks, and geopolitical or corporate events indicating risks; outside this is offtopic and can be removed.\n\nPosts & comments that are purely political, religious (dealing with morality), or focusing on other types of investments not related to stocks such as real estate, crypto, designing websites, or even selling sneakers will be removed.  An example of what wouldn't get removed:  Discussing real estate when related to the ETF VNQ or real estate bubble affecting the stock market.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}]}]}, {"body": "Gonna have to switch up my strategy to selling vol", "score": 13, "replies": []}, {"body": "But both are imbeciles.. why can’t Bernie win", "score": -61, "replies": []}, {"body": "Trump is like Elon but worse.\n\n\nBtw, Elon will launch itself in politics and will become the next president of USA.", "score": -71, "replies": [{"body": "Elon can't be elected as (V)POTUS", "score": 37, "replies": [{"body": "They will change the law. They will say people whose contributions exceptionally helped shape US (SpaceX, Tesla) and are aligned on principles and values of Republican party, can run for president.", "score": -57, "replies": []}]}]}, {"body": "Will he give us good offers on tech stocks?", "score": -35, "replies": []}]}, {"body": "We’re back to a couple weeks ago…", "score": 40, "replies": []}, {"body": "sp500 -0.9%\n\nnasdaq -1.3%\n\n\"absolute bloodbath\"", "score": 125, "replies": [{"body": "That’s pretty bad as far as futes go", "score": 96, "replies": [{"body": "no disagreement there - but \"absolute bloodbath\" isn't the same as \"pretty bad\"", "score": 46, "replies": []}]}, {"body": "It will be down more than that.  Just wait.", "score": 16, "replies": []}]}, {"body": "LOL, \"bloodbath?\"  I don't think that word word means what you think it means.  (Also way to borrow some ill-advised rhetoric there)", "score": 17, "replies": []}]}, {"body": "He is back!\n\nMexico should pay for the wall, Taiwan should pay for US defense and my neighbor’s nephew’s friend’s future in laws must make my car payments.", "score": 618, "replies": [{"body": "And russia can take all of ukraine.", "score": 265, "replies": []}]}, {"body": "mans not even president and hes already fucking things up", "score": 746, "replies": [{"body": "Market has outperformed under Biden compared to Trump. Gonna go right back to shit if he comes bac", "score": 435, "replies": [{"body": "This is why I have no clue what’s wrong with people that think the market runs if Trump gets elected. Like have they just had blinders on since 2020? We’ve been in the midst of a massive bull run for a while now.", "score": 302, "replies": []}, {"body": "[removed]", "score": -74, "replies": []}]}]}, {"body": "For fuck sake Trump shut the hell up", "score": 307, "replies": []}, {"body": "Taiwan is literally the backbone of the US tech industry and the A.I boon and Trump here is talking about defence bills. He's a simpleton and places the hegemony of the US dollar and the global economy in danger for his authoritarian friends. It's insane this rapist has been in the White House, never mind going back in", "score": 405, "replies": []}, {"body": "domestic fabs are the next thing i swear", "score": 109, "replies": [{"body": "One of the reasons I’ve bought Intel. People can shit all over Intel all they want but we’re going to need their fabs.", "score": 110, "replies": [{"body": "TSMC are building fabs in the US too.", "score": 85, "replies": [{"body": "Would these technology nodes be capable of building NVDSA chips?", "score": 6, "replies": [{"body": "No, all those fabs are in Taiwan", "score": 28, "replies": [{"body": "I know. I’m asking about the new TSMC fabs that are being built in the US.  I know they will not be the most advanced technology nodes.", "score": 11, "replies": []}]}]}]}, {"body": "Why not asml since it's the one manufacturing machines for all the other chip manufacturers? ", "score": 10, "replies": []}, {"body": "Intel is still 1 decade behind tsmc in manufactoring. They wont be able to build nvida chips in the next 10 years and probably will never.", "score": -11, "replies": [{"body": "That is not correct, as of this quarter Intel is on par for manufacturing technology, next year if you look at TSM and intels roadmaps, Intel will be ahead for the first time in a decade.\n\nEdit: Intel 3 is now in high volume manufacturing, next year they launch 18A which will be ahead of TSM’s plan to launch on 2nm in 2025. TSM believes the current N3 node will be comparable with 18A but backside power won’t be until 2026 behind Intel. Plus they have finFET, gate all around\n\nDownvote me all you like. I own and cover both", "score": -27, "replies": []}]}]}]}, {"body": "Him and his cronies are buying the dip\n\nWhether he gets elected or not, they are profiting from this election campaign.", "score": 231, "replies": []}, {"body": "Who wants another 4 years of this nonsense?", "score": 306, "replies": []}, {"body": "My aapl and nvda calls are so fkd right now.  Hoping I can get even from intel though.  Isn’t intel the USA chip darling?", "score": 56, "replies": []}, {"body": "So keep DCAing. Got it.", "score": 40, "replies": []}, {"body": "we are still in btfd mode.\n\ndon't be afraid to buy the dip.\n\nthis market fuckery is just a chance to get in at a lower price", "score": 52, "replies": []}, {"body": "One day does not make the market. The run up in tech has been massive. These stocks will certainly be worth more in the future. A pullback and broadening of the market is healthy. I think the day will end better than it will begin.", "score": 86, "replies": [{"body": "I’ll hold my nearly worthless calls and hope you are right", "score": 32, "replies": []}]}, {"body": "[removed]", "score": 42, "replies": [{"body": "[removed]", "score": 45, "replies": [{"body": "Gretchen.", "score": 12, "replies": []}, {"body": "I thought they would choose Whitmer or Shapiro but any change looks pretty unlikely.", "score": 6, "replies": []}, {"body": "[removed]", "score": -8, "replies": [{"body": "Can’t pick anyone except Kamala if they want to use the donations already collected", "score": 17, "replies": []}]}]}, {"body": "do you know what \"fascist\" means?", "score": -53, "replies": [{"body": "I do, I'm part Italian", "score": 37, "replies": []}, {"body": "drab humor wide numerous makeshift include workable aback pen engine\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 40, "replies": []}, {"body": "I assume yes if he’s calling Trump one", "score": 33, "replies": []}, {"body": "Does it resemble lying about voter fraud in an attempt to steal a democratic election?", "score": 28, "replies": []}, {"body": "1.9 trillion to 200 billionaires does seem more oligarchy..", "score": 14, "replies": []}]}]}, {"body": "What exactly is the news here? This stuff is already export restricted.", "score": 11, "replies": [{"body": "I like to hike.", "score": 52, "replies": []}]}, {"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[removed]", "score": -12, "replies": [{"body": "That’s because SMH is currently down 3% and the comments were about a segment that everyone has their eyes on.", "score": 7, "replies": [{"body": "I get that, but still this article is of course getting traction. Also it’s funny to look at comment history of these commenters, most of them never post here. It’s the r/politics gang spreading out Reddit propaganda.", "score": -13, "replies": []}]}]}, {"body": "It makes no sense. It’s almost as if the market is 100% certain Trump will win", "score": -22, "replies": []}, {"body": "Feels good to be 100% cash right now 🤑", "score": -72, "replies": []}, {"body": "[removed]", "score": -34, "replies": [{"body": "And the middle class will decend deeper into poverty as he continues to shift the tax burden to the poor. The same exact thing he did last time..", "score": 48, "replies": [{"body": "Idk man with the Trump tax cut, my paycheck grew instantly by about $100.\n\nThat's set to expire shortly either this yr or next unless it gets renewed.", "score": -36, "replies": [{"body": "That was because he changed deductions.. Your taxes went up if you make less the 400k look it up. Your end of year returns were different guaranteed.", "score": 31, "replies": []}]}, {"body": "I don't care, I'm Irish with American stocks!", "score": -38, "replies": [{"body": "Yeah you are missing the point though, Republicans historically lead to recessions. There is a short sighted bump because people \"feel\" like they will be good for the economy and the tax cuts are going to help everyone...then you get the 2008 recession or the COVID recession etc...\n\nThe last five recessions all started while a Republican was in the White House (Reagan. G.H.W. Bush, G.W. Bush twice, and Trump)\n\nA remarkable 9 of the last 10 recessions have started when a Republican was president. \n\nSo sure, you can maybe take advantage of a short term bump the first few months, and then the likelihood that the entire worldwide economy goes to shit is high.\n\nSo small gains and then big losses. It's characteristic really of Republican policies, really short sighted economic policies that sound good, but do jack shit for people in the medium-long term.", "score": 33, "replies": []}, {"body": "Sweet. Im American and like Irish hip hop. You gonna see kneecap? Lol", "score": 1, "replies": [{"body": "I've actually never heard their music but they're getting good publicity with their film so glad you enjoy them :)", "score": -11, "replies": []}]}]}]}]}]}
{"title": "'Nvidia Is Slowly Becoming The IBM Of The AI Era' Says Former AMD And Tesla Engineer. Here's The Problem With That Comparison", "selftext": "", "id": "1e5ehan", "created_utc": 1721210773.0, "score": 311, "upvote_ratio": 0.87, "num_comments": 89, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 41 seconds ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Jim Keller is one of the most influential and innovative figures in Semiconductors. This is like calling Einstein a generic German academic. \n\nWhen Jim Keller speaks on Semi’s, the semi community listens.", "score": 153, "replies": []}, {"body": "Former engineer. lol. Its Jim Keller\n\nHeadline makes it seem like some random peon.", "score": 230, "replies": [{"body": "\"former engineer\" - the most respected engineer/chip architect in the business.", "score": 103, "replies": []}]}, {"body": "The article is written all around this phrase:\n\n> *He thinks Nvidia is becoming like IBM back in the day but in the AI world.*\n\nJim Keller is legit and we should listen, but the article isn't Jim Keller. It's just that sentence.", "score": 28, "replies": []}, {"body": "Problem that he worked at Tesla so maybe he is already burnout ![img](emote|t5_2th52|4271)", "score": 120, "replies": []}, {"body": "Jim Keller is not just some random former engineer. He literally revived AMD", "score": 8, "replies": []}, {"body": "Nvidia is very good company but it is extremely overvalued. ASICs are future of AI not GPUs.", "score": 48, "replies": [{"body": "Well what nvidia is building is asic I think a lot of ppl have misconception about this since nvidia keep naming it as gpu. H100 is literally ml accelerator.", "score": 80, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Correct but even amd had better flop than nvidias chip and thats not the reason why ppl buy nvidias chip. It is hw/sw stack", "score": 8, "replies": []}]}]}, {"body": "The shoe company?", "score": 25, "replies": [{"body": "It’s how they plan to run laps around competitors", "score": 7, "replies": []}]}, {"body": "It would be strange if there wasn't a lot of overlap in the skills to make those", "score": 8, "replies": []}, {"body": "Who cares? The question isn't \"how overvalued is it?\", the question is \"how overvalued can it get?\"", "score": 4, "replies": []}, {"body": "Tensor cores are literally ASICs", "score": 1, "replies": []}, {"body": "What sort of integrated circuit do you think would be better than a GPU for AI?", "score": 0, "replies": [{"body": "AIPU?", "score": 4, "replies": [{"body": "So, a highly specialized chipset designed to perform extremely well for AI-related processing?  Great idea.  Oh wait, NVIDIA is already selling that.  Woops!", "score": 0, "replies": [{"body": "Well, yeah.  GPUs are really versatile, but ASICs can be more efficient at solving strictly defined problems.  An AI application framework could be developed in conjunction with development of application-specific integrated circuits (ASICs).  But that would also present hardware limitations if and when programmers needed to make a change in the framework.\n\nI think NVIDIA's CUDA system represents a sort of bridge between the two ideas - something of a generalist ASIC (paradoxical as that may sound).", "score": 1, "replies": [{"body": "And what is to prevent Nvidia from making them and doing a better job if they turn out to be more profitable than their current product offerings?  You think they are unaware of them? Do you think they will be taken by surprise?", "score": 1, "replies": [{"body": "I am really not sure whose posts you are arguing against here.  I think this thread has run its course, but feel free to continue posting if you like.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Yeah you probably know more than all the brilliant minds at Nvidia. They should hire you and you can run the company so you can clearly get them going into right direction since they clearly have no idea what the future of AI is going to be.", "score": -2, "replies": []}, {"body": "ASICs are not even used for AI computing. Are you confusing Bitcoin mining with AI computing?", "score": -4, "replies": [{"body": "ASIC is: Application Specific Integrated Circuit.   \nWhich means, that any chip that is designed to do one algorithm well can be called ASIC", "score": 3, "replies": [{"body": "Yes it’s used for specific reasons tasks like solving complicated math problem (mining) gpus are superior in AI", "score": 0, "replies": [{"body": "Nvidia has tensor cores, which is literally ASIC for matrix multiplication.", "score": 1, "replies": [{"body": "This is literally not true at all. It is the GPU not an ASIC. ASIC are specifically designed for 1 task", "score": 0, "replies": []}]}]}]}]}]}, {"body": "They shouldn't be mentioned in the same sentence. IBM is quite possible the worst tech company alive.", "score": 30, "replies": [{"body": "Now, sure. But they used to be the hottest shit ever. And after that fucking HP was thought to be the rockstars of the tech sector for a decade. Hell, Cisco was the big dog of the tech sector not too long ago. Nvidia won't stay on top forever.", "score": 61, "replies": [{"body": "People said that about Microsoft and Apple. 20 years ago and 10 years ago respectively... Yea their dominance needs to end eventually but someone else needs to take their place for that to happen.", "score": 22, "replies": [{"body": "Those are the exceptions. You can’t lean on the exceptions to the rule. Businesses fade and fail all the time, even if they hit epically high highs for their sector.\n\nOf course it is *possible*, I’d never say it’s not. But I do highly doubt Nvidia will land among those few over time considering their products. They are a shovel company during the discovery of gold deposit. They very well might continue innovating and successfully diversify their revenue streams; but historically they are likely going to end up along the same lines as the myriad of other companies who struck gold and begin to slide with each year further and further from relevancy. Perhaps at no fault of their own, just the whim of market conditions.  \n\nThat said I do see them continuing to do well enough as a company over the longer term. They might not even come down, but they likely will stay relatively stagnant. I do not see them consistently stand among the wealthiest companies without massive expansion and diversification shielding themselves against inevitable competition. I’m sure related conversations are being held left and right daily in their board rooms.", "score": 3, "replies": [{"body": "Chip companies tend to have their own cycle. You stay relevant or become obsolete. But you still need someone to take their supremacy away. Intel was the best choice until AMD/Apple took that position.", "score": 3, "replies": []}]}]}, {"body": "Nobody is claiming they will stay on top forever.  Just for the next 3-5 years.  There are many trillions of dollars to he earned during that timeframe.", "score": 1, "replies": []}]}, {"body": "I think the comparison is how they both dominated the industry in the beginning. IBM was the de facto standard for computing back in the day. Years of misguided leadership tanked their lead.", "score": 7, "replies": [{"body": "Fair enough.", "score": 1, "replies": []}]}, {"body": "They just havnt innovated in a while. They used to be top dogs", "score": 5, "replies": []}, {"body": "It’s a massive company. Some of their offerings are highly competitive. They were also major contributors to getting Kubernetes off the ground.", "score": 1, "replies": [{"body": "In the past IBM did good or great things. Now they mainly just export jobs to India.", "score": 8, "replies": []}]}, {"body": "But once they were the best in class", "score": 1, "replies": [{"body": "Yes, the good ol' 80s.\n\nhttps://preview.redd.it/kbnszbae26dd1.png?width=650&format=png&auto=webp&s=23e371ca67284953ba3ef379f09e884fc94d9947", "score": 2, "replies": []}, {"body": "It will be again with quantum tech", "score": 1, "replies": []}]}]}, {"body": "tl;dr - Hardware does not equal design/software\n\nI'm sure I'm nowhere near as smart as this nerd. But even someone with a double-digit IQ knows there is a world of difference between an IBM (Hardware in the heyday) and NVDA (Design/Software)\n\nAll nascent manufacturing industries start out with fat profits and a few players. This is immediately followed by numerous competitors that rush into the industry to get a piece of the pie, slowly forcing down profit margins in exchange for volume. And eventually, these industries become dominated by oligopolies. It is the nature of tangible products to become commoditized with time (aka - productivity)\n\nCars, TVs, Chips, PCs, etc. It's almost always the same. Go ahead and look up how many US auto manufacturers have existed in the US (Spoiler = around 3,000). 30 years ago, about 20. Today, a handful. And they focus on selling as many cars as possible and sometimes dont even make a profit on the ones they do.\n\nBut in this case, we are talking about computer hardware, so I'll stay on that. I do have a tendency to ramble:\n\nPeople had PCs in the 70s and 80s, but they were often for those in the highest income brackets, because the things were freaking expensive. It wasn't until the very early 90s for true mass adoption of the PC to begin (primarily driven by creation of the information superhighway). That's also when the number of PC makers exploded. Why did so many companies rush in to make PCs? Because a new Apple, IBM, HP, Compaq, NEC, computer with all the fixins was around $2,000 to $3,000.  Thats 30 years ago pricing - That's like paying $7,000 for a new PC today. There was lots of money to be made, hence the PC gold-rush.\n\nEventually you had upstarts that came in as the cheaper plays, Gateway, Dell, etc. Their claim to fame was getting a whole PC set-up for $1,500-$2,000. This led to the true cost-conscious builders - See: eMachines with their $499 computers. Today you can get a desktop equivalent powered laptop for $300. Something that would have been considered a ludicrous joke 20 years ago.\n\nThis race to the bottom leads to inevitable outcomes: Most manufacturers go out of business - Ex: Compaq (Once the world leader and introduced the first laptop). Some become niche: See Apple.  And some manufacturers dominate through their processes - Ex: Dell and its direct-to-consumer business. But even they remain beholden to volume and profit margins. And so, when the world has a mild PC slowdown, they struggle.\n\nAnd then some players pivot - which brings us to IBM. They sold off their laptop business to China and attempted to pivot to consulting/software. (Sidenote: Their mistake was selling their laptop business. They should have used it to sell ancillary services with higher profit margins - See: Dell). It wasn't a bad idea. They have incredible IP (Up until a year ago, they had the most patents in the world). They tried to do the AI thing before AI was truly feasible from a computational standpoint. Remember Big Blue playing chess vs Kasparov? Deep Blue, etc. In some ways, they were ahead of the game.\n\nUltimately, they didn't pull it off and instead focused on consulting.\n\nTo compare a company that produced hardware to become an industry titan (IBM started by making typewriters - hence the International Business Machine moniker) to one that produces nothing, save intellectual property, is quite silly.\n\nNVDA should be compared to MSFT or AAPL. They both rely on the production of hardware, but they themselves make none of it; the hardware is just a delivery system. MSFT doesn't give a crap who makes PCs. The only thing that matters is Windows, Office, and Azure are loaded onto it. AAPL doesn't care about which manufacturer/country produces their new iphone - whether it's in Vietnam, China, or India. Those phones are simply tools that allow you to access the apps on their appstore/ecosystem.\n\nAnd that is what NVDA does with GPUs. They don't manufacture anything, but their graphics cards go into every system on the planet. And those cards are simply a computational tool that allow you access to CUDA.\n\nCUDA is everything. If and when a truly viable competitor to CUDA arises, then NVDA will be in trouble. And that is when you can value it on being just another IBM.", "score": 4, "replies": [{"body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "The problem with that comparison is a shit ton of companies are buying a shit ton of Nvidia hardware and then buying subscriptions to that hardware", "score": 9, "replies": [{"body": "Sort of like IBM mainframes?", "score": 6, "replies": [{"body": "I don’t know, I don’t know enough as I should", "score": 1, "replies": []}]}, {"body": "Salty people who missed the boat gonna stay salty.  See you next earnings [̲̅$̲̅(̲̅ ͡° ͜ʖ ͡°̲̅)̲̅$̲̅]", "score": 7, "replies": []}]}, {"body": "This is going to be a tangent from the article, but I never understood the hype around Jim Keller. \n\nPeople make it sound like this guy is an engineer who just single-handedly designs CPU architecture, like he just went into the desert for 40 days and showed back up with the Zen architecture. Semis are just way too complex for that. People want one face they can put on some innovation, \"this guy created that!\", but chip design isn't something that one guy can do. For leading-edge CPUs, it's not a task that even 100 guys can do. At big corporations, it's thousands of engineers working across a hundred different teams.\n\nCalling Keller a brilliant architect who built all these chips is like calling Napoleon a brilliant foot soldier who single-handedly won Austerlitz. They haven't done that foot-slogger junk in decades. They direct armies now.", "score": 15, "replies": [{"body": "It’s people with vision and the capacity to understand the challenges that those 1000 individuals have when trying to enact their vision. AMD was unable to create a competitive product for years. And the first project Keller was on was the basis for their current success 9 years later.\n\nYou can have smart people but if you can’t align them they might as well be chickens without their heads.", "score": 1, "replies": []}]}, {"body": "But does it make bitcoin?", "score": 6, "replies": [{"body": "I plugged my Bitcoin into my Google and then transferred it to my NVIDIA via the Tesla. Still haven't received an email from Instagram so I'm watching Tiktok.", "score": 35, "replies": [{"body": "this guy bitcoins", "score": 13, "replies": []}, {"body": "This 😂", "score": 2, "replies": []}, {"body": "They'll probably send you a WUPHF.  [https://www.youtube.com/watch?v=uRoCMde-Cm8](https://www.youtube.com/watch?v=uRoCMde-Cm8)", "score": 1, "replies": []}]}]}, {"body": "Nvidia is just joking everything is fine!!!\nThere are no risk of:\n- failing on earnings like ASML today\n- china takes over Taiwan\n- Trump push US producer like Intel an punish taiwan chip firms\n- monopoly penalties for nvidia like in france \n- economy slowdown dues to reduces investitions in AI (microsoft already cuts expenses)\n- Rotation\n- Stupid people selling AI stocks for the next small caps hype\n- overbought stock - good news just not be heared\n- some fakes news more....\n\nPleas buy nvidia calls - i swear everything is right.", "score": 21, "replies": [{"body": "Lol you’ve been in SNDL for years, your opinion holds negative weight.\n\nPost all time and positions or stfu", "score": 22, "replies": [{"body": "Lol it's nice that you follow me, unfortunately i don't even know your name.", "score": -12, "replies": []}]}, {"body": "When has nvidia missed on earnings in the past year give me a break", "score": 5, "replies": [{"body": "I talk about the future. Onetime they will miss. Not earnings but future expectations like ASML today.", "score": 0, "replies": []}, {"body": "26 billom earnings means they should be worth over 3 trillion. Holy fuck you regard.", "score": -5, "replies": [{"body": "Short them then.  Be sure to post the result.", "score": 0, "replies": [{"body": "I didn't say anything about the value of the stock you mentally challenged fools. Just that nvidias value is obviously not correlated to its earnings.", "score": -1, "replies": [{"body": "In other words you don't stand by your comments which are based on nothing and you are admitting it with this reply. Thanks for letting us know.\n\nIf you believed what you are trying to convince us of, you would be shorting them right now with every penny you have.  Simple as.", "score": 1, "replies": []}]}]}]}]}, {"body": "Then why small caps go down too?", "score": 3, "replies": []}, {"body": "Someone missed the rocket to the moon and is salty.", "score": 1, "replies": []}, {"body": "NVidia's a legit business, but they are priced 10x too high.", "score": 1, "replies": [{"body": "44x NTM consensus earnings is 10x too high for you? You think they should trade at a 4.4x P/E? That’s certainly quite the take…", "score": 6, "replies": [{"body": "We'll see how long those earnings last. I think they are going to lose half their business in about 2 years, when AAPL/MSFT/FB/GOOG finish a chip design cycle and take their GPUs in-house, and then NVidia will lose the pricing power to hold out for 90% margins.\n\nHeck, even if the big four don't develop their own in-house replacement, just slowing down their compute spend will smash the brakes on NVidia's revenue. People are projecting long-term stock gains out of what's been a very short-term situation.", "score": 4, "replies": [{"body": "I agree, NVDA has a good product, but the quarters of constant earnings blowouts can't last. I predict that the other tech companies will cut back on chip spending as they see the expected earnings from AI not materialize. The when is the big question but I don't think we will see a major NVDA pullback until mid 2025-2026.", "score": 3, "replies": []}]}]}]}]}, {"body": "Dude is salty because he works at AMD and Tesla but not Nvidia. NVDA is up 3000% in 5 yrs whereas TSLA is up 1500% and AMD is 500% ![img](emote|t5_2th52|4271)", "score": 29, "replies": [{"body": "lmfao you clown, do you know who this guy is?\n\nJIm Keller is not salty about stock gains lol. Anywhere he wants a job, he has one... and a very senior one with huge fucking stock incentives", "score": 85, "replies": [{"body": "This is wsb, you guys take comments here seriously?", "score": -29, "replies": []}]}, {"body": "nah, it's jim keller.  he's a 'rockstar chip engineer.'  he could be a vp or above at any semi company.", "score": 58, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "\"Born 1958 or 1959\"?", "score": 3, "replies": []}]}, {"body": "You obviously know nothing", "score": 6, "replies": [{"body": "Obviously, thats why I am here ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "I don't think he needs to invest in stocks to make money anymore.", "score": 1, "replies": []}]}, {"body": "Lmao", "score": 2, "replies": []}, {"body": "It's the Cisco of this era, from the early 2000s", "score": 3, "replies": []}, {"body": "Calls are fd", "score": 1, "replies": []}, {"body": "How sway?", "score": 1, "replies": []}, {"body": "Nvidia has a leading edge in GPU hardware. AMD doesn’t even compare to energy / ecosystem.\n\nThat’s like saying Microsoft is becoming the next IBM of cloud.", "score": -2, "replies": []}]}
