{"title": "Tesla Wins Approval to Sell Power in Texas | Barron's", "selftext": "", "id": "qsoht2", "created_utc": 1636761852.0, "score": 196, "upvote_ratio": 0.99, "num_comments": 34, "comments": [{"body": "Next up, selling cars in Texas!", "score": 54, "replies": [{"body": ">Next up, selling cars in Texas!\n\nThe land of the fre... wait a minute. 🤔", "score": 10, "replies": [{"body": "What if they figure out a workaround with being an energy company?", "score": 3, "replies": []}]}, {"body": "Who cares. Tesla already found way to get cars to tx anyway.\n\n\nThe fact that tesla is on the way to become a major utility provider to the 9th largest economy on earth is a much bigger deal. I'm sure China is watching this with great interest as well.", "score": 6, "replies": [{"body": ">Who cares. Tesla already found way to get cars to tx anyway.\n\nIt will be funny: when Giga Texas opens in a few weeks, Tesla will have to ship those cars **out of Texas physically and ship them back to a customer in Texas**.\n\nThis has to be done for every car that is bought by a customer ***after*** that car has been fully purchased & financed. You order, pay, Tesla ships your car out of Texas and back, a 600 miles round-trip for Austin - more for half of Texas.\n\nFree markets!", "score": 8, "replies": [{"body": "Texan here ... when Elon was working with Texas Governor Abbott to bring the Gigafactory to the state, I can’t understand why he would not negotiate this point — if Tesla builds a factory and employs thousands of Texans, you (Gov) get this law repealed preventing us from selling cars in the state. \n\nWas that not even on the table? I don’t know.", "score": 4, "replies": [{"body": "He can sell there after all. He will sell hundreds of thousands, if Texans like buying local. More and more people will realise how stupid that law is. Eventually it will be repelled.  \n\nMeantime, he is not losing that much money by doing the round trip. Definitely a lot less than the incentives he was given for the factory. So he probably didn’t want to distract the negotiations with a low importance issue.  \n\nNevermind that the dealer’s argument so far was that jobs will be lost. This can now be answered with “they can go and work for Tesla then”.", "score": 3, "replies": [{"body": "I think they will change the law but never underestimate the stupidity and corruption of texas law makers", "score": 2, "replies": []}]}]}, {"body": "I think Tesla may be able to do some legal maneuvering and sell the cars to Texans through an out-of-state affiliate “dealership” and then transfer it to Texas after it’s been delivered or something like this.", "score": 2, "replies": [{"body": "I'm pretty sure the car has to come out of state - which is a given right now, but will be an issue with Giga Texas.\n\nShipping from out of state is also legally safer: makes the sold item ***clearly*** cross state lines, and thus trigger the interstate commerce clause's protections against any Texas dealership mafia state legislation overreach...", "score": 3, "replies": [{"body": "Yeah true, we’ll see what happens. Maybe they could ship a partially completed car out of state and back, or just a few key components. There’s usually gaps in laws if you’re willing to look hard enough and the money is worth it. It would be a really bad look for Texas to sue Tesla after they build the Austin factory.", "score": 1, "replies": []}]}]}]}, {"body": "I care.\n\nFuck dealership middlemen.\n\nMargins.", "score": 11, "replies": []}]}]}, {"body": "Now they can sell their new \"mobile energy storage device (not a car)\" direct to consumers.", "score": 19, "replies": []}, {"body": "BIGGEST NEWS THIS YEAR.", "score": 12, "replies": []}, {"body": "We will go to the moon. Mark my word. We will go to the fucking MOON!!!\n\nHappy Friday!!!!!", "score": 15, "replies": []}, {"body": "Oh… this … this is interesting", "score": 7, "replies": []}, {"body": "Texas is giving license to loot under the disguise of \"utility\". It's hella profitable. So many Bitcoin miners also setting up shop. So much muhneeyy", "score": 3, "replies": []}, {"body": "Isn't this like 1 wek old news? Or was that Tesla applied?", "score": 5, "replies": [{"body": "Maybe, but not everyone knows of this good news.", "score": 4, "replies": []}]}, {"body": "Can someone get me passed the Paywal", "score": 4, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Thank you", "score": 4, "replies": []}, {"body": "Thank you", "score": 2, "replies": []}]}, {"body": "Heres a tool for future paywalls - https://12ft.io", "score": 1, "replies": []}]}, {"body": "Tesla will deploy their own PV + storage (maybe all those mega packs we saw in NV recently) they’ll generate, store, distribute and consume pure renewable energy. They’ve been coalescing toward this for quite some time. In time we may even be able to take our energy credits with us while traveling. Hook up to a SC and consume the energy you generated from your home via credit. \n\nFor added fun - maybe elons giant tract of land in Texas will be site number 1. Consider how often he refers to the small size of land necessary to generate power for the US. Scale that to what’s necessary for just TX and you might have a reasonable portion of it covered.", "score": 2, "replies": [{"body": "Starbase city would be a great test case", "score": 1, "replies": []}]}, {"body": "Oh fuck", "score": 2, "replies": []}, {"body": "Anyone knows the implication of this to the stock? Is this the first time Tesla Energy captures a huge sustainable project?", "score": 1, "replies": [{"body": "It's not a huge project yet, this really is just the first step.  Needs more solar/powerwall installs at scale to make this a big money maker.", "score": 5, "replies": [{"body": "Nice", "score": 1, "replies": []}, {"body": "Tesla is getting licenses in many countries. It's all part of vertical integration, in a market that is replacing the whole oil and gas industry. Silently, not making the front-pages (yet!).", "score": 1, "replies": []}]}, {"body": "I believe it's the reason the stock only regressed 10 days instead of 30-60 due to Elon's sale.", "score": 2, "replies": []}, {"body": "Not the first time. https://reddit.com/r/teslainvestorsclub/comments/qpnfgv/_/hjvcz06/?context=1", "score": 1, "replies": []}]}, {"body": "Charge a “Texas transport surcharge” on every car sold in Texas. The stink that rich folk in Texas make over having to pay extra for their Y will quickly force the legislature to change this.", "score": 1, "replies": []}, {"body": "Elon is building his kingdom in Texas.", "score": 1, "replies": []}]}
