{"title": "5 Year Portfolio Timeframe", "selftext": "As the title states, I have around a 5 year time horizon (preferably less if I can make enough money) to buy my first house. I wish to save up atleast $100k for the downpayment and have been using stocks as a way to generate steady but fast growing wealth. \n\nCurrently my tax free portfolio includes:\n\n1. Enbridge - 30%\n2. Scotiabank - 21%\n3. AMD - 20%\n3. CN Rail - 16%\n4. Carrier Global - 11%\n5. Fobi AI - 2%\n\nI wanted to know your opinion on what stocks I should be buying more of, which to sell in my portfolio, or which new high growth stocks I should buy to appreciate my portfolio significantly within the next 2-5 years. I don't want to keep too many stocks because I feel I will miss out on potential gains on some growth stocks I have right now. I also have $6k cash coming in soon which I may use to fill up an existing position or buy a new high growth stock. \n\nAny help/advice would be much appreciated. I need my money to grow at a significant pace for the next few years.", "id": "qy9uep", "created_utc": 1637427860.0, "score": 8, "upvote_ratio": 0.83, "num_comments": 32, "comments": [{"body": "Couple things. Do you really need to save 100k for a house? \n\nNot a financial adviser, but you can put down 5% on a house and just take the PMI. For example, on a 400K house, you can simply put down around 20K and the PMI would only be like 80 a month. \n\nSecond, if you are saving for a house, I’d suggest just going with like the SPY or VTI. It’s hard to out perform the market, especially as the timeline goes longer.", "score": 12, "replies": [{"body": "I would like to save as much as possible for the downpayment so I dont have to pay mortgage insurance (Canada) and so I have the peace of mind that can afford the house. \n\nI would like to put my money in a safe, profitable company, high growth stock in a sector which is expected to grow significantly over the next 2 to 5 years. SPY, VTI or even a HISA wont cut it for my goals. I am willing to take on risk and put my money in a high growth stock in the meantime.", "score": 2, "replies": [{"body": "I’d still suggest looking into an ETF, rather try to pick yourself. \n\nQQQJ seems interesting. There is always just going with the QQQ. That’s grown over 240% the last five years.", "score": 7, "replies": []}, {"body": "So you’re willing to risk losing this very important money for your house? You’re just not gonna buy a house if the investment doesn’t work?", "score": 4, "replies": [{"body": "I am 22 yrs old and I understand the risks especially considering I've been keeping my whole savings in stocks for the past 3 years and have faith that every correction will recover given that I am invested with safe, profitable companies. Just need a couple high growth stocks (profitable companies) that will appreciate my portfolio to new heights in a shorter time horizon.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "A big crash just occurred in early 2020, no? I held through alot of my stocks which crashed, especially Enbridge. All of them recovered. Since 2017, I have been holding my stocks through every correction including the US-China trade war, recent bond yield fears, inflation fears, etc.\n\nNot here to go back and forth, but I'd say it's a pretty good gamble to take to buy high growth stocks in proven sectors which are primed to dominate like AI and semiconductors.", "score": 1, "replies": [{"body": "You are on the correct path and are observant. Avoid listening to a lot of people here. Especially that guy going back and forth with you. 2020 was one of the larger declines in history but people ignore that and if they did any research, crash have not happened immediately after another one. You are starting young at the start of a new bull market.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Yea, In five years when he’s up 100% that 10-20% correction is really gonna be a bloodbath, he’ll probably be bankrupt when it’s said and done. Stop fear mongering and let the man invest his money.", "score": 2, "replies": [{"body": "It's okay if he's willing to accept the fact that he might not be able to buy his house if we see a major market downturn. If that's an acceptable reality to him then fine. But that's a very real possibility so if he's not prepared for that then it shouldn't be invested.", "score": 1, "replies": []}]}, {"body": "I obviously plan on continuing to hold my safe, dividend holds like Scotiabank, and Carrier and Enbridge, but I'm seriously considering selling CN Rail and Fobi and putting that into AMD and then eventually also buying NVIDIA. Just my strategy, you dont have to agree. I appreciate your precious insights though.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "* Safe\n* Profitable\n* High Growth, grow significantly over the next 2-5 years.\n\nYou can't even pick 2 of these. Pick 1.", "score": 4, "replies": [{"body": "lot of semiconductors and tech stocks like AMD, NVIDIA, etc. are safe and profitable and we dont even have to talk about the share price appreciation. Yes NVIDIA is heavily overvalued but who's to say it still can't move up that much higher?", "score": 0, "replies": []}]}]}]}, {"body": "Post a Thread asking for opinions and later goes on to not listen to opinions", "score": 5, "replies": [{"body": "Because opinions like \"dont invest money you will need in 5 years\" or \"buy ETFs\" are not relevant to my life situation considering I fully understand the risks involved in the market. It's not like I'm investing in meme stocks, simply want good growth stock names which will appreciate significantly in 2-5 yrs.", "score": -1, "replies": [{"body": "Everyone thinks they have a plan until they get punched in the face. \n\nI’ve seen countless individuals similar to you in my circle. Is greed talking when 2-5X isn’t enough anymore.", "score": 1, "replies": [{"body": "That is fine and you are entitled to your opinion but for my situation I really want to get into the real estate market ASAP. Buying high growth stocks from profitable companies like AMD and few others will help me achieve that.", "score": 2, "replies": []}]}]}]}, {"body": "Are you aware that a market crash can occur during those 5 years and you can walk away with a substantial loss? 5 years is too short timeframe imo, I wouldn't risk money I know I will need here.", "score": 6, "replies": [{"body": "I am 22 yrs old. I don't NEED the money in 5 years but I would like to take my chances and get into the real estate market ASAP. I am willing to take on the risk and understand market can be volatile at times. Some high growth stock picks would be appreciated which are safe, profitable companies, and are in sectors that will grow significantly in 2-5 yrs", "score": 5, "replies": []}]}, {"body": "Have a look at vaccines, not trying to predict next pandemia, demand is there and supply continues to ramp up.  Novavax, Moderna, Biontech,", "score": 0, "replies": []}, {"body": "Take a look at AEHR + IONQ + FUBO + LCID + SOFI + BKKT", "score": -4, "replies": [{"body": "Those are great growth names but for the time being I would rather invest in companies that are delivering net profits. Would you recommend buying Nvidia or more AMD for the next few years?", "score": 0, "replies": [{"body": "I don't hold either of those . For the most part I only buy stocks under $80", "score": -2, "replies": []}]}]}, {"body": "I like CP over CN because of the KCS deal", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I have never traded TSLA calls before. Any recommendations on the best call contracts to buy?", "score": 1, "replies": []}]}, {"body": "I would look into Amazon as well. They are an absolute titan when it comes to cash flow and revenue. Don’t listen to the analysts who say it has disappointing earnings because they didn’t meet “ expectations. “ Amazon is generating in excess of 100BB a QUARTER which is a simply astounding number and as it stand their securities have been trading relatively flat the last year. \n\nAlso, I understand you want to manage to save up 100k in the next 5 years, how much money are you currently working with? Starting from scratch might be somewhat difficult to achieve that unless you have a nice job where you can make consistent deposits into your brokerage account.", "score": 1, "replies": [{"body": "I am 22 yrs old. Have been in the market since I was 18. Started out with safe, dividend stocks only and realized I need more growth names if I wanna see more capital appreciation. Right now my portfolio stands at just half of what my 5 year (preferably sooner) goal is. \n\nI also do have a full time job, but lately I have been working on paying off my student loans, which are almost fully paid off and should be complete by early next year.", "score": 1, "replies": [{"body": "Keep at you have the potential to have your first million in a few years.", "score": 2, "replies": []}, {"body": "I doubt you will have much issue making it tp 100k in 5 years if you are already half way there.", "score": 1, "replies": []}]}]}, {"body": "With the portfolio you have atm, you might as well get the TSX composite ETF and a Semi ETF. You aren't going to be drastically outperforming either.\n\nYou should get some ideas for bigger growth plays if you want something that'll outperform the SP500.\n\nThere's some solid value plays on the Canadian market if you sniff around. Look outside the popular picks.", "score": 1, "replies": []}]}
{"title": "Read the emails Elon Musk sent Tesla employees about music on the job and following directions", "selftext": "", "id": "qycixs", "created_utc": 1637435629.0, "score": 48, "upvote_ratio": 0.83, "num_comments": 40, "comments": [{"body": "I love this and will use it. Explain why I’m wrong, ask for clarification, or execute.", "score": 28, "replies": [{"body": "Lead , Follow or get out of the way. Gen. George Patton", "score": 16, "replies": [{"body": "Joe Bauer: Gets out of the way.", "score": 1, "replies": []}]}, {"body": "I especially like \"explain why I'm wrong\". Elon doesn't let his ego get in the way of getting to the truth of things. Far too many people in positions of power struggle with accepting that they make mistakes.\n\nFar too many workplaces where explaining how your manager is wrong would get you fired cuz you hurt your manager's ego.", "score": 3, "replies": [{"body": "The main question is if you were wrong about why he was wrong do you still get fired…", "score": 1, "replies": [{"body": "No. The reason why he sent that particular email was because some managers were simply ignoring the instructions. The worse thing they can do.", "score": 1, "replies": []}]}]}]}, {"body": "If he had send the first email only to the managers, there would have been zero chance this would have been executed consistently across ~5 factories.\n\nWhat is the situation in other US car factories? Is this the kind of thing that unions fight for?", "score": 8, "replies": [{"body": "I really want to know if unions could push for specific verbiage or omitting requests such as these?", "score": 2, "replies": []}]}, {"body": "Who's hungry? I am. I could totally go for a nothingburger right about now.", "score": 15, "replies": []}, {"body": "This is a rare exception of us posting a Lora Kolodny article: but it's reasonably fair & objective, has no false narrative & quotes the entire emails.\n\nThe only bit missing is that the 'managers need to follow orders' email was apparently ***in response*** to the 'music on the job is allowed' email. (A fairly common-sense explanation would be that some managers continued to ban music on the job, and Elon got informed about this, and followed up with the second email.)", "score": 1, "replies": [{"body": ">The only bit missing is that the 'managers need to follow orders' email was apparently ***in response*** to the 'music on the job is allowed' email.\n\nWhat are you even basing this on?", "score": 0, "replies": [{"body": "The follow-up email about manager behavior was sent the day after the music email was sent.  \n\nYou obviously know this since you read the article.  Right?\n\nSo … \n\nAre you suggesting there could be a separate manager issue that coincidentally occurred at the same time?", "score": 11, "replies": [{"body": "Also, Elon isn't emailing to \"All\" all that often: once every couple of weeks AFAIK. So another email in a related topic on the next day is absolutely a follow-up.", "score": 3, "replies": []}]}]}]}, {"body": "> The second, harsher email reminded employees there are only three options when Musk sends directions: explain why he’s wrong, request further clarification, or execute.\n\nWhat's really \"harsh\" is management with their heads up their asses.  At least elon runs on logic, and can be convinced of new arguments with sufficient evidence.  In companies with toxic management, it's all about \"get in the inner circle & stay on my good side, then i won't yell at you for listening to music\".", "score": 7, "replies": []}, {"body": "The music one may seem trivial, but to me that really shows that Musk is in touch with what working one of these jobs is like. Something like music is massively important for job satisfaction, and most managers are too fucking stupid/out-of-touch to understand that this is a very simple thing to do *that costs them nothing* and improves job satisfaction *and* performance.", "score": 6, "replies": []}, {"body": "No jerk policy !", "score": 12, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Flat in the sense that employees can bypass the management hierarchy and contact Elon directly, if there's something important to communicate (a good suggestion or a significant problem).\n\nIn some organizations if you have something important to communicate you have to tell your supervisor, then if they think it's important they tell their boss, and so on up the organizational structure, and if any boss along the way thinks it's not important then the message never gets to the top.", "score": 3, "replies": [{"body": "Or the message gets transmitted as being their idea and the worker gets a big fuck you from them with no proof.", "score": 2, "replies": []}]}, {"body": "There are 70,000+ employees at Tesla and will grow to 100,000 soon.  There are managers for a workforce this large.", "score": 2, "replies": []}, {"body": "You bought 30k in Tesla shares because you thought they didn't have managers. You must really hate managers 🤣", "score": 2, "replies": []}]}, {"body": "The music one is very surprising, I've worked in probably 10 different warehouses and none of them allowed music, it's a safety hazard, anywhere a forklift is present.\n\nAnd I assume a car factory is far more dangerous than any of the warehouses I've worked in.", "score": 7, "replies": [{"body": "I worked in retail where we had pallet jacks (Electric and manual) walkie stackers, and various trollies. Were allowed to have music once the store was closed. Some managers even encourage it, since the PA Music is terrible.", "score": 5, "replies": []}, {"body": "That's why the rule is for having one earbud out. Music is less loud than audible alarms.", "score": 6, "replies": []}, {"body": "I can't imagine a brand new factory would have systems that relied on audible horns or alarms to keep people from getting run over. Material movers have had collision avoidance systems for years now.", "score": 9, "replies": []}, {"body": "Yes but also transparency is a thing on AirPods. And deaf employees as well. Let's not stay stuck in the pas century.", "score": 1, "replies": [{"body": "But what about the blind truck drivers!", "score": 1, "replies": [{"body": "Autopilot? Why are you even in this sub ;)", "score": 2, "replies": []}]}]}]}, {"body": "Those all seem very reasonable to me.", "score": 3, "replies": []}, {"body": "Fun, but assertive.", "score": 5, "replies": []}, {"body": "LOL I wonder what promoted that email", "score": 2, "replies": []}, {"body": "[removed]", "score": -41, "replies": [{"body": "He has paid more taxes than you will in 1,000 lifetimes.", "score": 21, "replies": [{"body": "I paid more taxes than him last year u idiot…", "score": -28, "replies": [{"body": "I dont know if your trolling or you just don’t know how his taxes work. He does not draw a salary from the company. So he does not pay taxes on money he does not receive. If you make 0 on income why pay taxes?  Now he is the owner of the company and thus has a shit ton of shares or stocks of Tesla. So if the company does good and thus the stock price goes up his overall net worth increases. Now it is normal for everyone who owns stock not to pay taxes on those shares till you sell them. This includes you and me. To pay for every day stuff he takes out a loan from the bank. Now since his net worth is so much more then you or me Elon can get a bigger loan at a lower rate. Now you may ask why is he finally paying taxes now? He had certain criteria that if he met yet got to buy shares from the company for cheap. He has to pay taxes on these since they are worth more then what he is buying them for. He is getting a lot of shares here so he will being paying a lot of taxes this year. That’s a lot with 9 zeros... (billions) So yes you paid thousands or hundreds in taxes last year I’m guessing. Elons paying billions in taxes this year.  To get to a billion you take your $1,000 and add 6 more zeros to get  $1,000,000,000. \n\nTLDR Why are you comparing your chump change from last year with his billions from this year?", "score": 10, "replies": []}, {"body": "Yeah, he's definitely the idiot in this equation", "score": 6, "replies": []}, {"body": "Yep and you still have a lot of catching up to do", "score": 1, "replies": []}]}]}, {"body": ">Dude wants his employees to work like a slave so his company and net worth can go higher…all while paying no taxes 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️\n\nRule 5 violation: no trolling.\n\n> I paid more taxes than him last year u idiot…\n\nRule 6 violation.\n\nBanned.", "score": 19, "replies": []}, {"body": "Allowing employees to play music is a form of slavery. Got it.", "score": 16, "replies": []}, {"body": "His employees also get stocks.", "score": 7, "replies": []}, {"body": "You know what’s worse than one’s ignorance? Spouting your ignorance.", "score": 2, "replies": []}]}]}
{"title": "Anyone catch latest “kink” in the Tesla armor? Look what happened to ATVI after their similar troubles began. The bad news is just starting. Profit from the loss of confidence and negative media press that inevitably will persist & beware of analysts pumping their books.", "selftext": "", "id": "qxxybk", "created_utc": 1637383256.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 31, "comments": [{"body": "Then buy puts.", "score": 13, "replies": [{"body": "I  am positioning carefully.  Reading the tea leaves.  👍", "score": 0, "replies": [{"body": "I am relying on Haruspex myself, sacrificing an animal, cutting it's entrails out, and then letting a professional divine the future from them, particlarly the liver.", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 0, "replies": []}]}, {"body": "Best of luck with that.", "score": 3, "replies": []}]}]}, {"body": "OP more irrelevant than this shit ass post lol you clowns got to do better honestly shit getting pathetic", "score": 3, "replies": []}, {"body": "Name a company with 50,000+ employees that hasn’t had a sexual harassment lawsuit...", "score": 4, "replies": [{"body": "Like I said, companies like ATVI are getting punished. It’s real thing nowadays. This is not the only bad news for Tesla.   Did anyone see Consumer Reports yet?   Now add today’s server outage.   It’s just starting.", "score": 1, "replies": [{"body": "Yeah i read consumer reports, during the commercial breaks on Miami Vice. What is this 1987? \n\nWtf reads consumer reports here.", "score": 2, "replies": [{"body": "Agree.  Who reads nowadays?  😂", "score": 0, "replies": []}]}, {"body": "I believe Elon's company won't fall much until a general downturn starts, which could happen soon.  Then I do plan on buying some puts, but Elon as legions of retail investors he can manipulate into buying his stock.", "score": 2, "replies": [{"body": "Agree.  It’s tough to fight so much blue sky thinking.", "score": 2, "replies": []}]}]}]}, {"body": "Kink? Sounds kinky", "score": 2, "replies": []}, {"body": "Eh, blizzard was effing up anyway. Tesla is a solid company, way over valued, but I get it. Tesla will be here for many lifetimes, if not more. This was more than likely a hit piece. No doubt, a company with as many employees as Tesla world wide, there is going to be a couple sickos harassing people.", "score": 2, "replies": [{"body": "[problems often not too far from the top. ](https://qz.com/work/2082746/elon-musks-tweet-captures-everyday-sexism-faced-by-women-in-stem/)", "score": 1, "replies": []}]}, {"body": "Meh, TSLA is king in the EV market. Will take much more than that too take them down.", "score": 4, "replies": [{"body": " 'uneasy is the head that wears a crown'", "score": 1, "replies": []}]}, {"body": "I few million in payouts, nobody will care.\n\nDo you know anyone that won't buy a product  because of what someone that worked for the company did years ago? This shit only works on Twitter. Won't effect stock price in the long run at all.", "score": 2, "replies": [{"body": "May I volunteer to have my ass grabbed for a few million?\n\nNot that I condone harrassment; but I’ll take the hit into martyrdom for my female brethren.", "score": 2, "replies": [{"body": "I get your point. I mean, you're in van and I'm in Calgary so probably not gunna work out.", "score": 1, "replies": []}]}, {"body": "It’s about culture and work environments. In the world we live in now it seems to matter way more than ever before.", "score": 0, "replies": [{"body": "Sorry, this is a tech company. They don’t pay the price for impropriety.", "score": 1, "replies": [{"body": "ATVI?", "score": 2, "replies": [{"body": "ATVI is fucked because it’s the CEO who fucked up. And that CEO isn’t the richest person on the planet, and isn’t a cult leader.", "score": 1, "replies": [{"body": "No argumentes from me.  But if you think irrational and irresponsible behavior is not within Elon you must be smoking the same stuff he does, or part of the cult.", "score": 2, "replies": [{"body": "To blame him directly for things is also presumptuous.", "score": 1, "replies": [{"body": "[You say he is not part of the problem eh?](https://qz.com/work/2082746/elon-musks-tweet-captures-everyday-sexism-faced-by-women-in-stem/)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "🥱", "score": 1, "replies": [{"body": "I know it’s late.  Sorry for that.", "score": 1, "replies": []}]}]}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|7 months ago\n**Total Comments**|103|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qxxybk)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qxxybk)", "score": 1, "replies": []}]}
