{"title": "Confused about the market as a new investor", "selftext": "Everyone and every news publication is saying the market is down because of trump getting covid. I’m confused about this because how does this change the fundamentals of companies like Tesla, apple, or literally any company for performing well or not?", "id": "j4a6gi", "created_utc": 1601701933.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 13, "comments": [{"body": "Fear", "score": 10, "replies": [{"body": "Fear along with uncertainty. It's funny that sometimes a stock will go up when there's bad news, because the bad news *isn't as bad as people thought it would be*. But the stock was previously down due to the uncertainty and fear.", "score": 3, "replies": []}]}, {"body": "Uncertainty breeds fear.  Fear leads to big commercial investors closing positions and holding cash.  Large sell offs drop prices.  Put the phone down, wait a month, and it’ll have rally’d.", "score": 3, "replies": []}, {"body": "Imo Trump getting covid was just an excuse for short term investors to dump their shares after we had multiple thick green days in a row. It was a shock for sure, but market futures were already slightly in the red before the announcement.", "score": 2, "replies": []}, {"body": "Markets don't like uncertainty. Prices are an estimate of future earnings. If something uncertain happens it becomes harder to estimate future earnings, and investors want a discount on that additional risk.  \n\n\nPlus if fundamentals were the primary pricing factor in the companies you mention, they wouldn't be worth half of what they are now.", "score": 1, "replies": []}, {"body": "People are selling early to take profits because they know that the market is going to sell off.", "score": 1, "replies": []}, {"body": "You’re correct. It hasn’t changed the fundamentals of those companies. But the market itself goes up and down for all sorts of random reasons.", "score": 1, "replies": []}, {"body": "Uncertainty causes fear and thus panic selling. Not a good plan, but it happens. This is why the stock market is risky. Regardless of a company's fundamentals, if investors think it will go down, they may sell off; driving the price down. \n\nInvestors which understand the fundamentals haven't changed will hold or even increase their position in the drop.", "score": 1, "replies": []}, {"body": "If the market ran purely on fundamentals then the stocks you named should drop by 50%. The market is a washing machine where the only 2 cycles are hype and fear. Rinse and repeat.", "score": 1, "replies": []}, {"body": "Investors become fearful so they'll sell their shares anticipating the market to drop, take whatever profits they can and then take advantage of rebuying on the dip.", "score": 1, "replies": []}, {"body": "Fundamentals do change.  It has do with disposable income.  If no more stimulus it has trickle down  impact.  Will you know it in 2030. I don’t think so.", "score": 1, "replies": []}, {"body": "Because people know Trump will be fine soon", "score": 0, "replies": []}, {"body": "Oh I remember fundamentals. That was before your time son.", "score": 0, "replies": []}]}
{"title": "Rate my portfolio", "selftext": "Tesla: 21.46% (I’m gonna sell some of it in the future)\n\nDelta Airlines: 10.35% (bought in a wrong time, gonna sell a part of it)\n\nApple: 9.89%\n\nIntel: 8.63%\n\nNvidia: 8.63%\n\nNIO: 5.50%\n\nFacebook: 5.18%\n\nMicrosoft: 5.18%\n\nAmazon: 5.18%\n\nCanadian Solar: 5.18%\n\nZoom: 4.43% (short term position)\n\nBeyond Meat: 4.31%\n\nAlibaba: 3.45%\n\nBoeing: 2.67%", "id": "j4erm9", "created_utc": 1601730662.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 19, "comments": [{"body": "Too much TSLA exposure. Have a feeling it's gonna dip back to the mid 300's fairly soon.", "score": 6, "replies": [{"body": "I think TSLA is going to reach 500 next year. I agree exposure is too much, this is why I’m gonna sell part of it (I still want it to be my biggest holding though)", "score": 1, "replies": []}]}, {"body": "Looks like 99% of retail investors portfolio", "score": 3, "replies": []}, {"body": "A lot of flash names, not a lot of substance or fundamentals grounding you against changes in momentum", "score": 5, "replies": [{"body": "You mean too many “known” companies?", "score": 1, "replies": [{"body": "Too many retail known names yes tbh.\n\nFirst of all if you want to own fang heavy or maga heavy, just buy a weighted index fund. Nio and tsla? Gonna drag you. Id rather own something like a PANW than facebook, and TSM over Nvidia. Speaking of which, even if you didnt own nvidia i would still advise against intc. Bad tech and everyone knows it. Amd eats their lunch. Would rather be in delta than boeing but pick one; no one will be expanding cap ex in that industry though so why BA? Zoom is fine but there are better stay home plays that didnt explode in valuation and are better established to actually gain from stay at home like Adobe. Beyond meat has no real patent, and the space is flooding with competition for half the price — i would rather be in grocery or distribution in the food and discretionary segment. Wheres Fedex or Jb hunt, or CSX... or more speculative you could do UNFI. Alibaba and Amzn have too much overlap for my liking too. Would rather b in BABA here. Also some europe or korea exposure would be good (FCAU or PKX) for car industry.", "score": 2, "replies": []}]}]}, {"body": "\"every stock in my portfolio is overpriced and I dont understand anything in it, rate my portfolio\". Sell this and stick to s&p index, it won't hurt that much when the market crashes.", "score": 1, "replies": [{"body": "Boeing, Delta, NIO, Canadian and Intel are overpriced for you? Plus you have no idea of who I am, yet you managed to know I know nothing about these stocks?", "score": 5, "replies": [{"body": "If you know what you are doing why do you need random strangers on the internet to 'rate' your portfolio?", "score": 2, "replies": [{"body": "I’m open to discussion, I’m happy if someone tells me his opinion on that, like “too much Tesla or sell Delta”. I’m not gonna change my portfolio because of strangers, but having a feedback is always important", "score": 5, "replies": []}]}, {"body": "I know if one fifth of your portfolio is tesla :P", "score": -1, "replies": []}]}]}, {"body": "Be careful with beyond meat! But long term won’t be a problem!", "score": 1, "replies": [{"body": "Why? What’s the problem with beyond meat?", "score": 1, "replies": [{"body": "With the incoming recession they might experience some volatility!", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s sooner than we think", "score": 1, "replies": []}]}]}]}]}, {"body": "I like it, just trim TSLA to 10%.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I have great expectations on Tesla, but I don’t feel comfortable having 1/4 of my portfolio on Tesla. I’ll probably bring it to 15% and use the rest to invest in companies I’m monitoring (or just a simple tqqq / sqqq depending on a bullish/bearish market", "score": 2, "replies": [{"body": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[Great Expectations](https://snewd.com/ebooks/great-expectations/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)", "score": 1, "replies": []}]}]}, {"body": "You need to change Apple from 9.89%, to 9.9265% of your portfolio-ASAP.\n\nSeriously though-No index funds or etfs?  Even if you are young and like risk, they should be a chunk of your portfolio.  Your amounts don’t equal 100%, so I’m assuming the remainder is in index/etfs?\n\nA wider variety of ‘recovery stocks’, other than just airlines.  Better balance.  Maybe try to add some tech that hasn’t already had massive runs.  Not saying they won’t continue to do well, but maybe add some small cap tech to it that has a lot of room to grow.  Right now, your portfolio probably takes big hits when the nasdaq takes a hit.", "score": 1, "replies": []}]}
{"title": "What does the DowJones mean and how to watch it?", "selftext": "I am now of voting age and in my quest of political enlightenment I have found that the stock market is tied to politics as well. As such I have a few questions.\n\n1: Should I care?\n\n2: How should I keep tabs on it?\n\n3: What is the Dow Jones?\n\n4: What are \"Points\"?\n\n5: How do I easily keep track of the market's health?", "id": "j477ql", "created_utc": 1601689058.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 13, "comments": [{"body": "1. Not unless you’re investing\n\n2. Use the stocks app on your phone. Or google. Or if you invest your broker (the company you invest with) will have a tracker.\n\n3. The Dow Jones is an index. It is comprised of 30 big cap names in the US. Google the specifics, but they’re the big ones you’d think of off the top if your head (Coke, Apple, Walmart, McDonalds, etc.). It is supposed to act as an indicator for the overall health and direction of the US economy/market.\n\n4. “Points”=dollars\n\n5. You can easily track the health of the market by just looking at the 3 main indexes: The Dow (explained above), the S&P 500 (similar to the Dow, but 500 companies), and the NASDAQ (very tech heavy). Those 3 index’s will give you a general idea. Most people I think has the S&P since it’s a wider lens (500 in all sectors compared to 30 in the Dow or 103 tech heavy in the NASDAQ)", "score": 12, "replies": [{"body": "Thanks for the legitimate response, it has helped greatly.", "score": 2, "replies": [{"body": "And I got downvoted for it - lol\n\nNo worries - that’s what this is for, right?", "score": 8, "replies": []}]}]}, {"body": ">\n1: Should I care?\n\nHonestly, that depends.\n\n>2: How should I keep tabs on it?\n\ntype in DJIA to google.\n\n>3: What is the Dow Jones?\n\nA carefully selected group of 30 stocks.\n\n>4: What are \"Points\"?\n\nEquivalent of a dollar\n\n>: How do I easily keep track of the market's health?\n\n^GSPC (S&P 500) is a better barometer of the market.", "score": 3, "replies": [{"body": "Your actual response to my question is deeply appreciated", "score": 0, "replies": []}]}, {"body": "Google", "score": 7, "replies": []}, {"body": ">how to watch it\n\nWith your eyes, Bert.", "score": 3, "replies": []}, {"body": "Hodl", "score": 1, "replies": []}, {"body": "\\#5 is a really good question. A healthy market has sensible P/E (Price-to-Earnings) and P/S (Price-to-Sales) ratios, i.e. stocks are collectively (S&P for ex.) priced at around fair value. Volatility (VIX) is relatively low and stable. Market sentiment is balanced between greed and fear.\n\nThere are many more factors that are beyond the stock market. For example, macroeconomic indicators. Political climate is stable, corporate debt to GDP is sustainable, inflation (CPI) is not running too hot, bank lending is steadily growing and outpacing loan repayment, fiscal and trade deficits are under control, unemployment is low, etc.", "score": 1, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "Spy puts", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "For what? I'm not looking for karma, just advice from people who know more than me. Is that an issue?", "score": -3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, however I'm not really sure where to look for the correct information. I could look it up, but I wouldn't trust my research. The legitimate responses I got gave me a foothold on what I need to know moving forward. That was my goal. I don't expect a full education from reddit.", "score": -4, "replies": []}]}]}]}]}
{"title": "Elon Musk thought there was a ‘greater than 90% chance both SpaceX and Tesla would be worth $0’–but still invested millions", "selftext": "", "id": "j4h14u", "created_utc": 1601739324.0, "score": 76, "upvote_ratio": 0.92, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 33, "replies": [{"body": "The funny part is that even if he had lost everything he would 99% still be a billionaire today. I am.clnvimced that if you dropped this man on the street with nothing but the clothes he was wearing he would manage to be a millionaire in 2-3 years and a billionaire in 10.", "score": 9, "replies": [{"body": "> he would manage to be a millionaire in 2-3 years and a billionaire in 10.\n\nI mean with his connections that is not such a hot take. Could always have some relatives help him out after he saved their ass with solar city", "score": 0, "replies": [{"body": "That's obviously not what I mean. No help from anyone in that sense. Just his knowledge and own worth.", "score": 3, "replies": [{"body": "Perhaps his greatest ability is attracting and retaining engineering talent.", "score": 1, "replies": [{"body": "His mind and mindset in general. He can see what can be disrupted and how. Everything he gets involved in he manages to hugely disrupt and create a completely new standard and pace of innovation for each industry. Don't forget that he was and still is the lead engineer in both SpaceX and Tesla.", "score": 2, "replies": [{"body": ">He can see what can be disrupted and how\n\nRelatively common. Many of us on this sub and others have made a lot of money because we share that ability. Even building amazing prototypes is relatively easy. Doing so at scale and bringing them to market against numerous challenges and people trying to stop you is what makes leaders stand out.\n\n>Don't forget that he was and still is the lead engineer in both SpaceX and Tesla.\n\nThis is why he's able to attract such talent per my previous point.", "score": 2, "replies": [{"body": "This all shows that he can do much more than attract talent. That he really is the reason he achieves to much.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "“If something is important enough, even if the odds are against you, you should still do it.”\n\n[https://medium.com/w-i-t/7-quotes-from-elon-musk-that-will-inspire-you-to-succeed-in-2018-ec40b98b6e2e](https://medium.com/w-i-t/7-quotes-from-elon-musk-that-will-inspire-you-to-succeed-in-2018-ec40b98b6e2e)", "score": 33, "replies": []}, {"body": "Still 10% chance to succeed and would benefit humanity a great deal.", "score": 12, "replies": []}, {"body": "All of these middle school economics articles lol. \n\nYes, the rich become richer because they can afford to take more risk. Returns are tied to risk. That’s why poverty is so difficult to beat, the impoverished family cannot afford to take on as much risk.", "score": 16, "replies": [{"body": "It's not even about being able to take risk for the impoverished family. They just have nothing to risk. It's about access to capital, and then it becomes about being able to risk parts of that capital. A poor person could still risk the money for today's food, but even if his risk paid of all he might get would be 2 days worth of food.", "score": 3, "replies": []}]}, {"body": "Perhaps what is least often discussed is that it’s not that Musk is some Tony Stark genius who did everything himself, Musk’s genius was imparting his passion on others and bringing them on the journey with him.\n\nEveryone has ideas that seem cool to them but who has the will power and aptitude to convince other very smart people to follow your ideas.\n\nHere it is again\n\nhttps://www.tesmanian.com/blogs/tesmanian-blog/employer\nThe top 1 and 2 places for smart graduates to work is for Musk.\n\nNone of this is possible without thousands of incredibly smart and passionate people", "score": 4, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": -1, "replies": []}]}]}]}]}]}]}]}
{"title": "Where Elon Musk and Tesla earn real credit 'eating the lunch' of auto competitors | CNBC", "selftext": "", "id": "j4i09h", "created_utc": 1601742539.0, "score": 120, "upvote_ratio": 0.98, "num_comments": 15, "comments": [{"body": "Good read, recommend reading the whole thing. Learned a lot about energy credits", "score": 22, "replies": [{"body": "Agree. I also didn't know he made a cameo on the big bang theory :).", "score": 5, "replies": [{"body": "He was doing dishes with Howard right?", "score": 1, "replies": [{"body": "Yeah, you can see that in the thumbnail where he is doing dishes with Howard", "score": 11, "replies": []}]}]}]}, {"body": "This is an interesting positive feedback loop for Tesla and a negative one for ICE companies. \n\nAs Tesla sells tax credits to ICE companies, they increase their cashflow to increase  production and create even more tax credits for sale. \n\nFor the ICE manufacturers they need to pay more and more for EV credits which is basically giving a leg up to a competitor that is eating their lunch.", "score": 18, "replies": [{"body": "This. Credits seem to be a part of Tesla’s magic sauce that keeps befuddling analysts.", "score": 10, "replies": [{"body": "and what's interesting is that legacy analysts are giving them shit for using EV credits to improve their bottom line. But meanwhile, Telsa gets to use these credits to balance their books while using their real cashflow to fuel their R&D and growth.", "score": 10, "replies": [{"body": "Credits are upsetting to analysts and others that favor more purist capitalism. However, purist capitalism has a tendency to fuck over the common good/Earth and not pay for the damages. These analysts argue that ICE companies are paying more than the “true” cost of their business, that they are subsidizing the EV producers.\n\nIn reality, the TRUE cost of their business should factor in the damage they do to the earth via pollution. I see the credits as making ICE companies pay the TRUE cost of their product, not vice-versa. *All* of us either benefit from or suffer from the condition of our Earth *together*, and IMO this should be factored into the production of goods.", "score": 28, "replies": [{"body": "this is a great  way to articulate one of the biggest weakness of capitalism. most people that are proponents of capitalism and the free market are purist. but just like anything else purist version of many things dont tend to work as intended unless you add other things to it.", "score": 2, "replies": [{"body": "Yes, the biggest peril with capitalism is the destruction of the common good. There is no profit motive to protect our environment as there is a community cost and no immediate return. To see the economic benefit in a healthy climate we need to shift our focus beyond quarterly and annual earnings. A healthy climate will allow us to prosper economically in the long-term, if we transition away from our planet-killing industries. There will be \\*no\\* economy if we don't protect the earth at some point.\n\nThere's hundreds of years of proof showing capitalism needs regulation, otherwise labor laws and environmental laws would not need to exist. Capitalism is a creature that will eventually devour until it hits some type of wall (regulation). The first environmental laws in the US were created by loggers and hunters that wanted to sustainably manage resources as they began to see shortages of their lumber and animal stocks.\n\nRegulation tempers capitalism from hurting those that do not have power in the economy, including soil, water, air, plants, and animals. It protects common goods that exist and do not necessarily generate short-term profit. \n\nTL:DR;  There is a misconception that protecting in the environment will destroy our economy, when the opposite is true. Strong regulation is not counter to a healthy working capitalism, but essential for it to exist.", "score": 1, "replies": []}]}]}]}, {"body": "Operating Leverage is what really befuddles them.  At 100k cars / quarter Tesla generates enough gross profit to run the company (Stores, Service Centers, R&D...) even without credits.  But every single vehicle sold above 100k generates an additional $10k profit, of which at most a small percentage is required for additional costs in running the company, so that $10k basically becomes net profit.\n\nI.e. Tesla just went from a basically break even company to $400M net profit this quarter and $800M next (or a huge $3.2B annualized net profit).  Tesla Energy growth and credits on top!\n\nNote that they have to subtract costs for Elon’s compensation package, which will be extra large this quarter since the market cap rocketed up.", "score": 3, "replies": []}]}]}, {"body": "Something u/stevenmarkryan has been saying over and over", "score": 11, "replies": []}, {"body": "Wow, super interesting comments. In particular:\n\n“Nelson is estimating $560 million for Q3 and $670 million in credits' revenue in Q4. \"Directionally, it will be up over the next two quarters, but it's more of a guesstimate. I don't think anyone has a really good handle where it comes in, except that it will be higher,\" he said.”\n\nReally interesting to see what Tesla report now for Q3 earnings. I’d been prudently assuming $200m ref credits for Q3 as I thought they had used all the deferred credits in Q2.", "score": 6, "replies": [{"body": "This doesn't seem to line up with what Zack Kirkhorn guided though. He basically said to expect less credit sales in Q3/Q4 than Q1/Q2.", "score": 3, "replies": [{"body": "Agreed. Who would be buying 560M and 670M of credits that wasn't buying credits before?\n\nI read the majority of the credits were purchased by GM and Fiat Chrysler", "score": 1, "replies": []}]}]}]}
{"title": "2 cents on why this doesn’t look good", "selftext": "With the resurgence of COVID, this can’t look too good for what looked to be the reversal. Was doing some TA before Donald was positive and the MACD on almost all the significant stocks like Apple and spy looked to make a very convincing convergence + the rsi was sloping up just above the 50 level. And This was just after the 100 MA which is heavily eyed by the most retail of retail Traders to big institutional investors acted as almost perfect support. \n\nFrom the massive spikes in Europe to America’s most Critical political figures contracting covid to the most recent controversial flop of a presidential debate, If the market ends red this week against what seemed to be the most rigged reversal in recent times with Softbank involve in the purchase of 2m calls on FAANG, I think we could seriously head towards 3000. Not to mention that this virus has an obvious insidious effect which means that the people around trump who may have tested negative or have yet to be tested have a possibility of testing positive in the near future which could absolutely send the whole political system in a frenzy due to the disruption of the extremely critical election. I definitely won’t go as far as to think we will drop to March levels due to the stimulus deal being closer to being agreed upon and nearer than ever before potential vaccine relief, but I do think the market has yet to absorb the true impact of the late resurgence of covid around the world and this can lead to some serious consequences \n\nOnly a tried and true vaccine will seem to lift this market from its potential 2nd turmoil.", "id": "j4en0z", "created_utc": 1601730095.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 15, "comments": [{"body": "I'm not saying your premise is wrong, but let's also factor in that we know a lot more about Covid and treatment than we did in February. This should (and so far as I know, does) reduce the mortality rate. That in turn should reduce the need for heavy-handed tactics if there's a resurgence.", "score": 4, "replies": []}, {"body": "It really all depends on a stimulus package.  I don't think we are going to get it.  The big drop in 2008 was because of a failed stimulus bill and election year politics.  In 2000 there was a big fight over the actual vote and that pushed the market lower.  Election year is a bad year for the markets in general.  There are lots of reasons to be bearish for the next month or two.  I'm half cash for a bit.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think the Oct. 8th first time unemployment numbers are going to jump up a lot.  Like 1.1 million maybe.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm honestly really confused why our unemployment ratio doesn't go back up.  If there are 800,000 new unemployed every week, then for the unemployment ratio to go down, like 1 million something new jobs are being created somewhere else somehow?  Like where?  Why is the number of new unemployed at record highs every month (records for all time apart from this year) and unemployment rate still going down?", "score": 2, "replies": []}]}]}]}, {"body": "Agreed. We won't get it until after the election. Any talking about getting one soon is just BS.", "score": 1, "replies": []}]}, {"body": "This was a lot more than “2 cents” lol. \n\nThe whole point of theta is that you **don’t** have to time the market and **don’t** have to panic.\n\nIf you are freaking out, you are either over leveraged or in the wrong sub 💁🏼‍♀️", "score": 2, "replies": [{"body": "You act as if theta gang is some free money hack lmao. What a complacent comment. Credit, debit spreads, iron condors even cash secured puts are some of the best examples of how a market like these can even potentially rekt these theta gang strategies", "score": 1, "replies": []}]}, {"body": "There’s also the possibility that if Trump survives the virus and takes it well then it’ll only add to his view on it being just another flu. I think congress going back to speak on another stim package is bullish for the market. If the Don doesn’t make it though and the stim package falls through we’re in for a long ride down. Volatility is going to pack a punch regardless though so it’s gonna be a wild ride until after January OR after tech finally gets back to normal levels. Also, volatility futures barely came up even after that crazy ride down yesterday which indicates the real fear has not set in yet.", "score": 1, "replies": [{"body": "Buddy if it was just another flu he wouldn't be at the hospital over it.", "score": 1, "replies": [{"body": "My guy, you’re telling me that a world leader who contracted the most possible virus is going to be taken care of like the normal population? Hell no man. The dude is an asset so the protocols in place are there to make sure he gets the best care possible so he doesn’t get into critical condition and make things worse than they are", "score": 1, "replies": [{"body": "Im not sure where you're going with this? My comment was pretty specific. To expound, I'm implying that regardless of if he makes it through or not the fact that he contracted it and is in the hospital just goes to show the severity of it. You have to understand that there was a large portion of the population under the assumption the virus was fake, a hoax, not a big deal. This revelation of it being real has turned their world and the markets world upside down.", "score": 1, "replies": []}]}]}]}, {"body": "Growing coronavirus infections, the crazy election and weakening economic numbers all suggest it's a time to be careful.", "score": 1, "replies": []}, {"body": "i can't even begin to tell you how wrong you are on everything.", "score": -1, "replies": [{"body": "Please clarify.", "score": 0, "replies": [{"body": "Ignore him, he’s a pathetic salty clown. his intentions are not to make any constructive arguments, think I’ve seen this guy bullshitting around here alot", "score": 1, "replies": []}]}]}]}
{"title": "Unity ($U) - Before you sell puts / decide to wheel", "selftext": "&#x200B;\n\nHi All,\n\nA wrote [my take on Asana](https://www.reddit.com/r/thetagang/comments/j387xq/asana_asan_before_you_wheel/) ($ASAN) a few days ago, which some of you found useful. There were also requests for covering other IPOs. So to continue the thread forward, I have written my take on Unity ($U) below - another company which had a spectacular IPO debut. \n\nI have posted a summary version here. If you are interested in a more detailed version, you can find it here: [https://knowyourstocks.substack.com/p/unity-u-creating-the-future](https://knowyourstocks.substack.com/p/unity-u-creating-the-future)\n\n&#x200B;\n\n**Unity Software ($U)**\n\n\\---------------------------------------------------------------------------------------------------------------------------------------------------\n\n**What does it do?**\n\nUnity is a very cool company and an impressive business. It makes two types of products:\n\n**Create Solutions: 30% of revenue**\n\nSoftware which allows creators (artists, developers etc.) to develop many different types of content across platforms (Mobile, PC, incl. Virtual Reality). The company charges a monthly subscription fee for this solution, across various tiers. Smash hit *Pokemon Go* was built on Unity.\n\n**Operate Solutions: 61% of revenue**\n\nA wide variety of software and solutions that allow content / game creators to operate and monetize their games (e.g. analytics to optimize engagement, In-App Purchases). Unity charges a share of the revenue that content /game creators make or sometimes usage based fee. This is a healthy business model as it grows with the usage of any game / content using Unity operate solutions.\n\nKey to note here is that customers can use Operate solutions even on content that was not created on Unity.\n\n&#x200B;\n\n**I like:**\n\n* High gross margins (80%)\n* Large Gaming TAM ($12B, growing at 6%) and Non Gaming TAM ($17B)\n* Lot of room to grow in Non Gaming category\n* Accelerating revenue growth, but cost efficient\n* Asymmetric opportunity to benefit if VR becomes a dominant technology in future\n\n&#x200B;\n\n**I don’t like:**\n\n* Platform risk (dependency on Apple / Google)\n* Dynamic competition leading to pressure on free cash flows\n\n&#x200B;\n\nOne thing I really liked about Unity was their focus to grow their large customers (>$100k TTM revenue) from 389 to 716 in last 10 quarters. This results in a lot of sales efficiency.\n\nAdditionally, their dollar net expansion rate is 122-142% in the last 10 quarters (this means a customer who spent $100 last quarter, spend $122-$142 this quarter - a very positive sign). Unity’s net expansion rates are in the upper quartile of all high growth SaaS companies.\n\nOne of the key risks I see with Unity is platform risk. As we saw with Epic games recently, Google and Apple control Unity’s access to its customers and this poses platform risk for Unity.  This is a serious issue and not unique to them, but they have to find a way around this. Their foray outside gaming should help to some extent.\n\nAnother key point is that they are in an industry where they have to constantly innovate and have dynamic competition. Their R&D cost grew by 40% YoY to $167M in H1, 2020 and now represent 47% of its revenue. This is quite high and a drain on cash flows. Unity has to continue to perform well on revenue growth, else cash flows can suffer a lot in future which will become a risk on stock price.\n\n\\-------------------------------------------------------------------------------------------------------------------------------------------------\n\n**For Options trading**\n\nUnity had a spectacular IPO (no surprises) on Sept 18, and since then has gone on to reach a market cap of $22B (\\~$83.5 / share, ending Friday Oct 2, 2020), resulting in an EV / Sales (TTM) of 35.3.  This valuation puts it in the category of other high growth SaaS companies like Docusign, Cloudflare who are also growing revenue upwards of 40%. \n\nOverall I like Unity’s leading position, and its future growth prospects. The valuations are quite rich as is with the sector in general. I would look for any decent drop as a good opportunity for opening new positions.\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\nIf you continue to find this post useful, please let me know - I will cover other exciting IPOs like Snowflake ($SNOW), JFROG ($FROG), Sumo Logic ($SUMO), Amwell ($AMWL) and Palantir ($PLTR) in future posts.\n\n\\-------------------------------------------------------------------------------------------------------------------------------------------------\n\nI write about stocks in my weekly newsletter @ [knowyourstocks.substack.com](https://knowyourstocks.substack.com/)\n\n**Disclaimer** \\- This post is just meant for information purposes. Please do your own research before investing / trading", "id": "j4ol64", "created_utc": 1601766048.0, "score": 76, "upvote_ratio": 0.95, "num_comments": 17, "comments": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Thanks so much for sharing your experience. As a creator using Unity's products, your experience is super useful in confirming / denying my thesis.  I think the nature of the industry is such that there will be stumbles - but as long as management is eager to fix and march ahead, the future should be bright. \n\nHappy to hear that you found my analysis on-point.\n\nI'll look to trade OTM CSPs and at some point open a long position.", "score": 2, "replies": []}, {"body": "You forgot to add... deprecating UNET with no reliable alternative. That’s a huge deal.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Great point.  Thanks for giving these examples. VR is still niche overall but it has so much potential - if the tech catches up - it can become a dominant platform. Then sky is the limit for Unity", "score": 3, "replies": [{"body": "Thanks for the analysis. I would like to see what you think of sumo", "score": 2, "replies": []}]}]}, {"body": "Great post. I am a mobile game developer and our company uses Unity extensively so I am quite familiar with them.\n\nCouple of points:\n\n* Unlike Unreal, they don't make games themselves (other than demos that showcases their engine). Their goal is to ensure that their customers are successful so the risk of running afoul with Apple/Google are much more slim.\n* Their engine supports home consoles as well (PS/Xbox/Switch). For example, Cuphead was built on Unity.\n* They partner with Tencent to help developers get their games into the China market. Without that it is almost impossible to publish any games in China.", "score": 9, "replies": [{"body": "Thanks, agree with your points. They are better off than publishers, and outside mobile revenue is more protected. But their mobile revenue won't be small. Still I think as they get more outside gaming, they become a better business. Hence, my thesis is long.\n\nI like their China business. Its growing very fast. It will be interesting to see how it unfolds.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 8, "replies": [{"body": "While its true that unlike Epic, they don't make titles themselves, still they only make money if the games that use Unity makes money. Even if there is no outright ban, changes such as what Apple proposed earlier on IDFA can have meaningful impact on their revenue (esp. \"Operate Solutions\" part). Apple hasn't moved ahead with it but this issue is far from over. \n\nWe don't know Unity's exact dependency on Mobile games, but given Mobile game is the biggest category within gaming ([source](https://newzoo.com/insights/articles/the-global-games-market-will-generate-152-1-billion-in-2019-as-the-u-s-overtakes-china-as-the-biggest-market/)), the risk is significant. Its certainly important enough in Unity's mind as they spoke about this a lot in their S-1. From an investor's perspective, this can keep me up at night.\n\nI think growing outside gaming revenue protects agains them from this.", "score": 1, "replies": []}]}, {"body": "> I don’t like:\n\n> Platform risk (dependency on Apple / Google)\n> Dynamic competition leading to pressure on free cash flows\n\nI disagree with these. As for platform risk, I don't think so, because if Unity was ever to be banned by Apple or Google they'd have almost no games in their store. It won't happen and they also have large cash cows from plenty of other console, VR and PC games.\n\nCompetition is only from Unreal right now - Nothing else even comes close. Unreal is more for high-end AAA games. I don't see them occupying the same space.", "score": 7, "replies": [{"body": "Even if there is no outright ban, changes such as Apple's IDFA can have a significant impact on their revenue. We don't know if / when / in what form it is going to be implemented but the business needs to protect itself. They are better off than game publishers though, but any impact to their large customers cuts Unity deep as well.\n\nCompetition in the industry is dynamic \\[unlike, say an ERP category\\] but Unity does seem up to the task. But if their R&D costs remain high, we won't see a lot of FCF being generated. Still i like their business model more than a publisher's.", "score": 1, "replies": []}]}, {"body": "definitely to get in. but thats 8500$ to get in on CSP. I have 4K im better off with XLF ETFs. damn...", "score": 3, "replies": [{"body": "Indeed you need some capital - or consider OTM CSPs.", "score": 1, "replies": []}]}, {"body": "Excited to see this post. I sold to open $U 75 put not too long ago.", "score": 4, "replies": [{"body": "$85. Premium was irresistible, profitable down to $75. I think the company has greater long term potential and I can sell CCs if assigned.", "score": 1, "replies": [{"body": "I feel strongly the same but considering that it just IPOed I get nervous lol. Wanted to see some more price discovery first. But oh well. Im holding it so best of luck to the both of us ☺️", "score": 2, "replies": []}]}]}, {"body": "Been watching some VFX artists react videos and have learned just how much Unity is involved in the VFX and film industry. They do some really clever things with giant LED screens and positional tracking of cameras. I expect, as the film industry opens up, they may find some strong growth here. Films will need to be \"cheap and good\" until Hollywood feels brave enough to drop big bucks on a blockbuster. Unity can probably help make that happen.", "score": 2, "replies": []}, {"body": "$PLTR", "score": -6, "replies": []}]}
{"title": "Did you get your $1.48 ps for WSTL?", "selftext": "So anyone who’s holding WSTL. I think there was supposed to be reverse followed by forward split ar 5:00 pm at 1st October. I see in my portfolio it has been swapped with WSTLZZZ without any update. Did any one of you who’s holding below 1000 shares got their $1.48?", "id": "j46fr2", "created_utc": 1601685767.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 12, "comments": [{"body": "What is this and I'm definitely too late aren't I", "score": 7, "replies": [{"body": "I'm gonna join you", "score": 2, "replies": []}]}, {"body": "Not yet, but I’m surprised you’re posting about it in wsb.  This crowd doesn’t like actual free money.\n\nI think there was some kind of payout extension?  I still have a control number in e*trade showing, I opened a TDA account for the wife to double dip on this and haven’t checked in on it yet.", "score": 4, "replies": []}, {"body": "Pretty sure you bought them on 29 september..", "score": 1, "replies": []}, {"body": "The shares need to be in your name, you should check with your broker to see if they are in your name or in the brokers name and on the books to you.", "score": 1, "replies": []}, {"body": "Were you able to get any update on this? I'm in the same boat. I have 999 shares in my portfolio, and its turned into WSTLZZZ and my investment into it/buying power got deducted off my portfolio.", "score": 1, "replies": [{"body": "Same here, assuming you’re on RH as well. I remember seeing something about a 10/19 date but can’t remember what it was.", "score": 1, "replies": []}, {"body": "So I have emailed RH awaiting for their response but someone already did and posted a screenshot of RH’s response - it said something like company hasn’t provided the shares money yet that’s why we don’t see anything in our account but we should be getting it this week! Let’s see what do they respond on my email.", "score": 1, "replies": [{"body": "Did this end up happening?", "score": 1, "replies": [{"body": "Not yet", "score": 1, "replies": []}]}]}]}, {"body": "https://stocktwits.com/Babe2020/message/248147515", "score": 1, "replies": []}]}
