{"title": "New highs: NFLX, AMZN, DIS, FB.", "selftext": "Hello, friends! Today the market is really wonderful. The stocks rose right before the eyes. What do you think? I didn't forget to mention some other stock?", "id": "62g7gp", "created_utc": 1490902118.0, "score": 27, "upvote_ratio": 0.82, "num_comments": 29, "comments": [{"body": "DIS is not at an all time high. ", "score": 10, "replies": [{"body": "long time high", "score": 3, "replies": [{"body": "that's a nice definition. ", "score": 2, "replies": []}, {"body": "I'm not trying to disagree, but come on DIS was trading at a 10% clip higher less then 18 months ago. But I do agree the stock has performed extremely well and deserves to be trading at a 200 billion market capitalization. ", "score": 2, "replies": []}]}]}, {"body": "TSLA has been on a good run.  Not all time high right now but close. ", "score": 5, "replies": [{"body": "TSLA has been a fucking roller coaster this month! But now it's edging back towards an all time high. ", "score": 2, "replies": [{"body": "Sell before the earnings in may", "score": 3, "replies": [{"body": "Good tip for anyone not in it for the long run. It's arguably nearing the highest it will hit for a while. The earnings report will inevitably drive prices down, and the climb will start anew. ", "score": 1, "replies": [{"body": "So... short TSLA?", "score": 2, "replies": []}]}]}]}, {"body": "Who had $0 pt on Tesla? ", "score": 1, "replies": []}, {"body": "Agree with you. I expect that new highs will happen to TSLA so soon. ", "score": 0, "replies": []}]}, {"body": "Last 2 days I've been waking up to alerts of AMZN kicking ass. The day starts off good. ", "score": 4, "replies": [{"body": "Yeah, Amazon is doing a great job. ", "score": 1, "replies": [{"body": "Is it even worth it to buy at their current price though? Is there no possibility of a future split?", "score": 1, "replies": [{"body": "Why do you care if they split or not? ", "score": 1, "replies": [{"body": "I'm pretty new to stocks and only have about 3k to invest right now so buying an $800 stock is out of the question for me. If they split and I continue to save money for investing though I'd happily buy at $400. Idk, are there companies that have gone above say $1100 per share without splitting?", "score": 1, "replies": [{"body": "Most companies do split before or around $1000 it seems. Although Priceline $PCLN has been above $1000 for quite some time, and if you want to see a crazy high priced stock check out $BRK.A. \n\nAlso unless you are using a commission free broker, a'la Robinhood, it is usually recomened to not spend more than 1-2% of your investment on commissions. So if you broker's commission is $5 you should really try to not buy less than $500 per transaction, since it will cost $5 (1%) to buy and another $5 (1%) to sell. \n\nIf you goal is to diversify your 3k you should be looking at index funds and ETFs. If you goal is to just start with 3k and to just diversify as you add more funds and grow your portfolio, I think it is fine to just split your 3k between 2-4 stocks to start with.", "score": 1, "replies": [{"body": "Thanks for the informative reply I appreciate it. I think I'm just gonna dive into 2-4 stocks with my 3k as you said. I've been following the \"mainstream\" stocks for a while, tried to convince my Dad to invest in Tesla at $160 and AMD when they were at $6 and he wouldn't do it so that's fueled my desire to go out on my own. \n\nIf you don't mind, I have some questions. Do you think I should use Robinhood? I've heard some sketch things about them. Also, I personally feel like AMD's cap is around $15 but I obviously love them cause I saw them shoot up. Do you think my $15 cap is crazy? How much potential do they have?\n\nLastly, if I wanted to spend the majority of my 3k on AMD and AUPH, do you feel that's just chasing eggs that have already hatched in a sense or no?\n\nAny reply to any of this would be much appreciated.", "score": 1, "replies": []}]}]}]}, {"body": "Eventually, they'll have to split the stock, but nobody knows when it's gonna happen. ", "score": 1, "replies": []}]}]}]}, {"body": "What about GOOG :(", "score": 2, "replies": [{"body": "Goog recovered quickly after that sale from 850 - now at 830. As soon as a solution is made about the youtube ads, stocks should pick up and those companies that became holy warriors will be back.", "score": 2, "replies": []}]}, {"body": "Panera hit an all time high. ", "score": 1, "replies": []}, {"body": "Well, I think we all are gonna pay for this rally sooner or later. I wish I knew when it's gonna happen. ", "score": 1, "replies": []}, {"body": "APPL is right there too", "score": 1, "replies": []}, {"body": "DIS still over 5% down from their all time high.", "score": 1, "replies": []}, {"body": "FAND", "score": 0, "replies": []}, {"body": "Does anyone know when/if ChargePoint will go IPO? They make the charger stations for Tesla.", "score": -3, "replies": [{"body": "Google?", "score": 3, "replies": []}, {"body": "Source?   \n\nFrom my understanding of Tesla and Elon Musk in general,  they try to build everything on their own.   Highly doubt they would outsource the charger.", "score": 1, "replies": []}]}]}
{"title": "How do I profit off of the potential crash of the Australian housing market?", "selftext": "I'm American. I love Australia. I also watched the big short. I know a thing or two...\n\nNo seriously, how could I personally profit from a bubble collapse in another country?  Is it possible? ", "id": "62as1o", "created_utc": 1490835130.0, "score": 34, "upvote_ratio": 0.8, "num_comments": 35, "comments": [{"body": "Do I really need to explain credit default swaps on the triple A traunch again? Just do it with the Australian exchange", "score": 31, "replies": [{"body": "How do I trade on the Australian exchange? ", "score": 6, "replies": [{"body": "Turn the bloomberg terminal upside down", "score": 96, "replies": [{"body": "[removed]", "score": -5, "replies": [{"body": "Headass", "score": 7, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Skin tone chicken bone leave me alone", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Link to a post where you explained it?", "score": 2, "replies": [{"body": "https://en.m.wikipedia.org/wiki/Get_Smart_(film)", "score": 2, "replies": [{"body": "Non-Mobile link: https://en.wikipedia.org/wiki/Get_Smart_(film)\n***\n^HelperBot ^v1.1 ^/r/HelperBot_ ^I ^am ^a ^bot. ^Please ^message ^/u/swim1929 ^with ^any ^feedback ^and/or ^hate. ^Counter: ^50054", "score": 1, "replies": []}]}]}]}, {"body": "Short sell houses. Find real estate brokers who will loan you the houses to sell. After that, just gotta hope you don't get mortgage called.", "score": 20, "replies": [{"body": "Has anyone ever short sold a house?", "score": 1, "replies": []}]}, {"body": "Of course it's possible. But it's a tricky thing. It's incredible difficult to time a bubble collapse, and you can only hold your short for so long. The guys in The Big Short managed to do it, but what the movie didn't show was the people who got the timing wrong and lost it all when they got margin called.\n\nAs for the Aussies, you are not the first person to predict a collapse of their housing market. Here's an article from 2012 discussing it, so in fact it would seem you are quite late to the game.\n\nhttps://www.moneymorning.com.au/20120125/strong-currency-hides-australias-housing-bubble.html/amp\n\nThe most straightforward way would be to short AUD/USD. I.e. you essentially buy debt in AUD and if the Aussie housing market crashes their banks will get crushed, the currency will collapse, and you can convert your USDs back to AUDs and pay back the debt for cheap. The Aussies are pretty good at keeping their currency somewhat stable though and they'd just hike interest rates if things got dire. It would probably have to involve a larger, global financial crisis in which case they'd fall into deep recession and the banks would collapse anyway.\n\nThe slowdown in China has already hit AUD/USD pretty hard to the tune of a >25% decline in 4 years and it seems to have bottomed out. Asian markets are lagging just as the US economy is reaching full strength so the risk/reward curve is not going to be in your favor.", "score": 13, "replies": [{"body": "Well thanks for the information. Doesn't seem worth it after you explained it like this. ", "score": 5, "replies": []}]}, {"body": "I'm Australian. Get fucked cunt. Crash your own shithole.", "score": 1, "replies": []}, {"body": "You're betting against a billion chinks and slant oligarchs bro", "score": 33, "replies": [{"body": "Sooo... Profitting off a Chinese housing crisis is out of the question?", "score": 5, "replies": []}]}, {"body": "As a young Australian with a bunch of relatively poor mates who own a tonne of investment properties with basically zero equity, I am heavily investing in rope futures. When it all comes crashing down people are going to be offing themselves left, right and centre", "score": 8, "replies": [{"body": "Make sure you get them to give you all their stuff when you go. Just the assets of course tell them they can keep the debts ;)", "score": 2, "replies": []}, {"body": "Is there actually a bubble?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Yeah, good thing we don't do that at all in the US.  ", "score": 7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "to be quite honest I'm betting on the car being able to do both tasks.  Built in sex robots", "score": 4, "replies": [{"body": "The wife would have an affair with the husband's truck?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Honestly... I bet it bounces bitcoin ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": ">assuming WSB can afford to buy property \n\nWEW ", "score": 5, "replies": []}]}, {"body": "CDO's", "score": 1, "replies": [{"body": "Wrong direction ", "score": 1, "replies": []}]}, {"body": "Short CBA fuckwit, see how it works out.\n\nPeople have been predicting a bubble for almost 15 years. It didnt pop when iron ore tanked that should be a red how indicator. Also people trying to predict it just dont understand australian real estate. \n\nThere's only 2 real capital cities and all the other capitals are reasonably affordable. You don't need to live inner city melbourne or sydney but you're a fucking bogan if you don't.\n\nIf you really want to short banks, i dont like you chances but dont really give a shit if you make money\n", "score": 1, "replies": []}, {"body": "Go short on Autralian Real Estate Futures. Good luck with that though. Unless you have worked out mathematically when it will fail and how, you're just going to lose your shirt. You're talking about a bubble that has been going on for like decades now.", "score": 1, "replies": []}, {"body": "IDK, the Aussie ETF ($EWA) appears to be kicking ass. You could buy a couple Put LEAPS. Someone's in for 28K put contracts 10% OTM expiring Jan 2018, but the bid/ask is complete shit.", "score": 1, "replies": []}, {"body": "Short KANG.", "score": 1, "replies": []}, {"body": "Shorting the big 4 banks, also construction companies like Adelaide Brighton who are listed on the asx", "score": 1, "replies": []}, {"body": "As long as chinks keep buying our houses, the bubble is only gonna keep growing", "score": 0, "replies": []}]}
