{"title": "NVDA bullish sentiment permeates amongst investors:", "selftext": "$400 price target for a reason folks, but NVDA is an elite level company with respected amongst in the tech industry. Loved by shareholders. Analysts reports growth ascending year after year , New shareholders & buyers understand the next generation technology will make NVDA even more profitable. The following reasons why we invest in NVDA and hold long term : \n\nTop Leader in GPU invention\n\nRemarkable Price Return Performance\n\nWell-positioned for Artificial Intelligence\n\nAccelerating Earnings\n\nGaming and Data Center Revenue\n\nDecent Dividend Income\n\nAutonomous and Robotics\n\nMeta verse \n\nQ4 earnings will be positive, expectations are high and NVDA has always delivered. YTD Growth rate is exceptionally good. Looking forward to hearing your perspectives .", "id": "rlf7e3", "created_utc": 1640094988.0, "score": 18, "upvote_ratio": 0.91, "num_comments": 20, "comments": [{"body": "down $1,600+ in the last month on NVDA.  But I try to remember I'm up 24% in the last 3 months.  Still hate to see that dip.  Hoping for a much better new year.", "score": 5, "replies": [{"body": "There was lot of dip past 2 weeks … what are you averaging?", "score": 2, "replies": [{"body": "I only own NDVA, so about 25% last month, but only 2.5% the last week.  Over the month now down $1300+.  3 months +1300.  Yr. +1153.  Still lots of movement to go though.", "score": 1, "replies": []}]}, {"body": "im down 40+, damn", "score": 2, "replies": [{"body": "that's tough man.  I think January and 2022 will get us sorted back out.", "score": 3, "replies": [{"body": "hopefully, although i am quite positive in Nvidia, inevitable to feel sad seeing your assets going down everyday :(", "score": 1, "replies": []}]}]}]}, {"body": "Crypto", "score": 3, "replies": [{"body": "\nYes indeed crypto mining development: NVIDIA CMP HX\nDedicated GPU for Professional Mining\nKEY FEATURES\nDesigned for professional mining operations\nNVIDIA CMP allows a fully open, airflow-optimized bracket and is configured to allow a greater number of GPUs to be controlled by one CPU.\nOptimized for best mining performance\nNVIDIA GPU architecture allows you to mine more efficiently and recoup your mining investment faster.", "score": 2, "replies": [{"body": "NVDA will cross $1000 in less than ten years. Looking back it would feel like a no-brainer to just invest in it and stay back.", "score": 6, "replies": []}]}]}, {"body": "I love my Nvidia stake and hardware!! I agree that 2022 is looking great for shareholders and everything, just remove that dividends joke so you sound more reasonable… Thank you and I love you!! Happy holidays…", "score": 2, "replies": [{"body": "Look at it this way : some dividend is better than no dividend . So it is not a whole lot but it’s something .", "score": 1, "replies": [{"body": "The return from its growth is much bigger than the return of the highest paying dividend stock.", "score": 2, "replies": []}]}]}, {"body": "Im so happy today i bought shitload of nvda yesterday i want to throw 30 yacht parties its unreal. So proud of still believing like crazy in this company", "score": 2, "replies": []}, {"body": "Dividend?   It’s a joke", "score": 4, "replies": [{"body": "Four cents per share is great , if you are a thousands of shareholders it all adds up to good amount. We are grateful for the generous dividends. Thanks .", "score": -7, "replies": [{"body": ">the generous dividends\n\nLOL  current yield is 0.05%     Really hope you have thousands and thousands of shares. \n\n10,000 shares, 2.8 million dollars worth of stock,  would pay out $400 a quarter, like a good dinner with a nice bottle of wine, or save up all 4 quarters worth and maybe, MAYBE, you could pay rent in some parts of the country.", "score": 8, "replies": [{"body": "I hear you but look we are human naturally we won’t be happy no matter how high percentage the dividends are   distributed to shareholders . But it is better than zero dividend.", "score": -1, "replies": []}]}, {"body": "The few hundred dollars I get each quarter from NVDA is a joke.  People buy NVDA for its growth and potential, not for its paltry dividend.  I’d rather they pay no dividend.  It’s like having my manager tell me “Here’s your .05% holiday bonus!”", "score": 5, "replies": []}]}]}, {"body": "I personally love it - I think the software opportunity is underappreciated. Wrote a short report on it - would love to get feedback  [https://spear-invest.com/nvidia-the-one-stop-ai-shop/](https://spear-invest.com/nvidia-the-one-stop-ai-shop/)", "score": 1, "replies": []}, {"body": "I agree with everything you mentioned but the dividend is non existent.", "score": 1, "replies": []}]}
{"title": "NVDA Always rebounds", "selftext": "", "id": "rlofli", "created_utc": 1640121440.0, "score": 43, "upvote_ratio": 0.98, "num_comments": 18, "comments": [{"body": "lol I love a green day as much as anybody, but don't ride the rollercoaster gentlemen.\n\nWe all should be looking at 2 major days in our immediate future.\n\nJan 25th/26th - next FOMC meeting\n\nFeb 23rd - next NVDA earnings call.\n\nThose are the days.  Long game gentlemen.  Long game.", "score": 9, "replies": [{"body": "Agreed. I have 33% of my portfolio in Nvidia. it was 40% but I had to take a few gains and put it in different areas. Maybe I shoulda left it in but time will tell. Remind me in 3 months to let you know how it went vs nvidia.", "score": 1, "replies": [{"body": "RemindMe! 3 Months\n\nSounds like a plan!  Hopefully we both have something good to discuss then!", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2022-03-22 12:40:19 UTC**](http://www.wolframalpha.com/input/?i=2022-03-22%2012:40:19%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/NVDA_Stock/comments/rlofli/nvda_always_rebounds/hpjtbvo/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FNVDA_Stock%2Fcomments%2Frlofli%2Fnvda_always_rebounds%2Fhpjtbvo%2F%5D%0A%0ARemindMe%21%202022-03-22%2012%3A40%3A19%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20rlofli)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "I wish it rebounded better. It was wise fir me to invest elsewhere. I lost less that way but still lost some.", "score": 1, "replies": [{"body": "the day that NVDA released earnings and it dropped broke my heart.  I ended up selling at a loss due to needing the cash flow personally.  Was just looking at it's down to 186.  I remember the +300 day thinking man this is great.  Crazy how quick things have dropped down over the last 6 months due to covid, russia, and inflation battle coupled with interest rates.", "score": 1, "replies": [{"body": "Yeah. I sold 20% at over 300 a share and I've held the rest of it. Will see how it pans out", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Need that sweater", "score": 3, "replies": []}, {"body": "Where can i get that sweater?", "score": 3, "replies": []}, {"body": "Based", "score": 3, "replies": []}, {"body": "So glad I bought more the other day, let’s go to the moon babyyyy", "score": 3, "replies": []}, {"body": "For now. I hope it keeps up. Bought in over 300 and it's been down since, even when we get a green day.", "score": 3, "replies": []}, {"body": "Never stop believing", "score": 2, "replies": []}, {"body": "Ok where do i get this shirt lol", "score": 1, "replies": [{"body": "Yeah RobinDrip.com", "score": 1, "replies": []}]}, {"body": "I bought back in August when it was $198. Sold some, kept some stock and now just bought more cuz it hit $287. It will go up! It’s been bouncing between $290-320 for sometime now.", "score": 1, "replies": []}]}
{"title": "Question about Stock Safekeeping", "selftext": "For the first time ever, I decided I needed some extra money and would sell the only share I have, which was 1 stock in Microsoft given by my ex around 2008. It has a value of about $330 USD or so. I contacted my bank which told me I had to bring it in person, and it would take about 10 business days. That couldn't be further from the truth.\n\nI went into the branch on November 30th, and since then, it's been in what they call \"Safekeeping\", which means I have to wait up to 30 days for it to be released. I can then trade it which would only take 1 day but I have already lost $20 and who knows it could take another $20. \n\nHow would people ever trade physical shares back in the day, it seems so risky that people would have to worry about the value changing over a 30 day time period is ridiculous. I get that not every share would go through this process, but still...?", "id": "rlbkma", "created_utc": 1640081341.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 18, "comments": [{"body": "you should have gone to a broker dealer not a bank, if the certs were in your name, they could have had you sign a stock record document, and deposit it into your account, maybe 24 hours , 30 days is BS, you should demand the certificate back.  if not, ask them to let you speak to compliance, and show you were the procedure for safekeeping is, if not, i would make a big stink, and tell them you are going to call the regulators", "score": 5, "replies": [{"body": "I work for said bank but there are literally hundreds of different roles and countless departments. I did look it up which gives some reasons on why this can happen, one of them being if the share is over 5 years and mine was like 13 years old. There's literally a whole internal document about it, I just wasn't told it could happen. At this point, it probably makes no sense to fight since the time period is almost up.", "score": 1, "replies": [{"body": "You have different compliance because you are an employee, they may make you hold it for 30 days in the account , even though you have owned it for years , but they may have rule a for the internal account", "score": 2, "replies": []}]}]}, {"body": "I suspect that it was a lot more commonplace back in the day, but I also expect that trading with actual certificates still probably didn't happen often, and the trading would be done through the institution physically holding them for you.\n\nIt would have been neat to be a fly on the wall back around the turn of the 19th century to see how the mundane details were done.", "score": 3, "replies": []}, {"body": "Okay, first of all you need to talk to your broker.\n\n\nThe bank has the share in safekeeping but they can’t trade it for you, and you can’t do much with the physical certificate.\n\n\nSet up a brokerage account through your bank and check the status of your share.\n\n\nMicrosoft could have had all kinds COAC activity since 08, you may have more than just 1 share depending.\n\n\nYou don’t need to wait any time to trade it through your brokerage once they locate and reconcile the position.", "score": 2, "replies": []}, {"body": "My ex-exployer issued us a stock certificate periodically and we had to oblidge the same rule. No way to get around it.\n\nWhen Charles Schwab opened up I insisted they issue me a hard copy since I had no clue Schwab would be around. Soon front desk chuckled as rules have changed. I still see old folks bring them to the brokerage and get receipts. Right now Schwab has 32.5 other million account holders and everything is digital or pdf.\n\nIn your case you open a brokerage account just let it sit there. No fee. On the other end is your Schwab or whichever brokerage bank, Zelle, or Visa all bundled together.", "score": 1, "replies": []}]}
{"title": "Here's Your Daily Market Brief For December 21st", "selftext": "**📰 Top News**\n\nS&P Futures: +0.99%; DOW Futures: +0.88%; Nasdaq Futures: +1.20%\n\n**US stock futures opened higher Tuesday morning** following three days of losses from news of Omicron and Biden's spending bill.\n\n**US growth forecast slashed** \\- Goldman Sachs has cut its projection for US economic growth in 2022, citing the likely failure to pass the \"Build Back Better\" legislation touted by the Biden administration. *Note: Goldman now expects GDP to grow at a rate of 2% in the first quarter, down from 3% previously.* \n\n**China lowers interest rates** *-* China's central bank has cut its main interest rate for the first time in 20 months as authorities step up efforts to boost an economy hit by the pandemic. *Note: The People's Bank of China lowered its one-year loan prime rate (LPR) by 5 basis points to 3.8%.* \n\n**Coal world?** \\- The coal-fired power generation is due to hit an all-time high this year according to a report from the International Energy Agency (IEA). *Note: While it remains an important source of energy, coal has a substantial impact on the environment because of its range of polluting emissions.*  \n\n**🎯 Price Target Updates**\n\nBofA Securities upgrades Micron Technologies. MU upgraded to BUY from NEUTRAL - $100 (from $76)\n\nAtlantic Equities downgrades Alibaba. BABA downgraded to NEUTRAL - $140 (from $185)\n\nRBC downgrades Cerner Corporation. CERN downgraded to SECTOR PERFORM from OUTPERFORM - $95 (from $86)\n\n**📻 In Other News**\n\n**No dumping allowed!** \\- California has filed a lawsuit against Walmart for allegedly disposing of hazardous waste at a rate of \"1 million items each year\". *Note: The complaint also states that Walmart has been breaking California environmental law for many years by dumping waste in landfills not equipped to handle the material.*\n\n**Musk pays up** *-* Tesla and SpaceX CEO Elon Musk will likely pay $11 billion in taxes this year, setting a record for the highest individual tax bill on record. *Note: Stock options Musk was awarded in 2012 are set to expire in August 2022 and in order to exercise them he has to pay income tax on the gain.*\n\n**Auction market thanks the young and wealthy** \\- The Big Three auction houses hit a record $15 billion in sales this year as a surge in global wealth and a wave of young first-time collectors drove massive sales. *Note: This year's record highlights the rising wealth during the pandemic, fueled by government stimulus and rebounding consumer demand.*\n\n**📅 This Week's Key Economic Calendar**\n\n**Tuesday***:* *No major economic events*\n\n**Wednesday***: GDP annualized QoQ (3Q), Existing Home Sales (Nov), GDP Price Index (3Q)*\n\n***Thursday****: Personal Income (Nov), Initial jobless claims (wk end 18-Dec), New Home Sales (Nov)*\n\n***Friday****: No major economic events*  \n\n\n**📔 Snippet of the Day**\n\n***Quote of the day:*** *\"Most investors want to do today what they should have done yesterday\" -John Maynard Keynes*", "id": "rle5ss", "created_utc": 1640091544.0, "score": 33, "upvote_ratio": 0.91, "num_comments": 16, "comments": [{"body": "Coal firms hitting all time highs... that's ridiculous", "score": 7, "replies": [{"body": "Damn, that's efficient . I'm running Octopus T-Rex.", "score": 1, "replies": []}]}, {"body": "Gee - US not gonna grow as much because we aren't going to just increase more debt spending. Boo Hoo.", "score": 1, "replies": []}]}
{"title": "Stock Market and Seasonality", "selftext": "Is seasonality a thing in terms of how stocks move? Im new to the markets, less than 36 months and there seems to be a flow in terms of seasonality. Santa Clause valley (22 out of the last 23 years), October sell offs followed by November recovery. Small/Medium Cap usually explode in January/Feb. Financials in Feb/March/April. Mid term elections means the first half of the year is not as profitable as the 2nd half.....\n\n&#x200B;\n\nFor those veterans in the stock market, I understand there is no certainties in the market, but it seems like more often than not, you can somewhat time the market by its flow based on prior years. \n\n&#x200B;\n\nAny good research sources on seasonality? Please I would love to hear from Stock Market veterans", "id": "rlmig6", "created_utc": 1640115958.0, "score": 8, "upvote_ratio": 0.76, "num_comments": 17, "comments": [{"body": "***\"For those veterans in the stock market, I understand there is no certainties in the market, but it seems like more often than not, you can somewhat time the market by its flow based on prior years.\"***\n\nNot really, at least with reliable consistency. Sure, a number of different seasonal patterns have been observed (the [January Effect](https://en.wikipedia.org/wiki/January_effect) is a particularly notable one). But there is also a tremendous amount of randomness and noise involved. And, on the whole, there is not a known and reliable mechanism for capitalizing on such patterns.\n\nAnd it's important to note that random noise can produce patterns that seem important, but in reality, are neither meaningful or useful.\n\nA very simple experiment:\n\nI just opened up a spreadsheet and performed 100 dice rolls \\[=randbetween(1,6)\\]. After running a few scenarios, I was able to produce a set of 100 rolls that produced only five \"2s\" and 25 \"fours\". Now, if a person was sifting through this data to place a bet on the next numbers to hit, they might *wrongly* conclude that rolling a four is **five times** as likely as rolling a two. Perhaps alternatively, they might (also wrongly) think that rolling a \"two\" is \"due\" to happen soon since so few landed so far. In reality, of course, neither is correct. There is simply no advantage either way. It's noise.\n\nAnother thought experiment:\n\nIf taking advantage of seasonality or other patterns is a feasible way to edge out superior returns, why are people--[including professional portfolio managers](https://www.honestmath.com/active-failure)\\--so bad at beating the market?", "score": 6, "replies": [{"body": "**[January effect](https://en.wikipedia.org/wiki/January_effect)** \n \n >The January effect is a hypothesis that there is a seasonal anomaly in the financial market where securities' prices increase in the month of January more than in any other month. This calendar effect would create an opportunity for investors to buy stocks for lower prices before January and sell them after their value increases. As with all calendar effects, if true, it would suggest that the market is not efficient, as market efficiency would suggest that this effect should disappear. The effect was first observed around 1942 by investment banker Sidney B. Wachtel.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/StockMarket/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)", "score": 4, "replies": []}]}, {"body": "Yes, stock market move with season. Different sectors move with season also", "score": 2, "replies": []}, {"body": "This year there was a study published where strategies were tested 200 years back. Seasonal pattern was 3rd and showed a performance plus of 5.7%.\n\nBut I think futures were used and there is clearly seasonality in many of those products.\n\nTo time the market ist often considered pure luck. Chaos is only dangerous if it appears to be order.", "score": 2, "replies": []}]}
{"title": "Here is a Market Recap for today Tuesday, Dec 21, 2021. Please enjoy!", "selftext": " \n\n**PsychoMarket Recap - Tuesday, December 21, 2021**\n\n***Apologies for no recap yesterday, I was traveling all day back home to spend Christmas with my parents***\n\nThe market staged a comeback on Tuesday, with all three major indexes rising more than 1% as market participants digested news of federal involvement to help mitigate the spread of Omicron and the imminent authorization of an at-home COVID treatment.\n\nThe Biden administration announced it was buying 500 million at-home rapid coronavirus tests that Amercians will be able to order online for free starting in January. This comes following a report that Omicron has now become the dominant variant in the US, accounting for roughly 73% of all cases reported last week.\n\nNew COVID-19 cases rose 9% in the United States in the past week but are up 57% since the start of December, according to a Reuters tally. [https://www.bloomberg.com/news/articles/2021-12-20/omicron-surges-to-nearly-three-quarters-of-u-s-virus-cases](https://www.bloomberg.com/news/articles/2021-12-20/omicron-surges-to-nearly-three-quarters-of-u-s-virus-cases)\n\nMoreover, the White House will deploy 1,000 military personnel to assist at hospitals as capacity starts filling up.   The number of hospitalized COVID-19 patients has increased 26% this month, with hospitals in some areas already strained by the Delta variant that emerged earlier this year, according to that same Reuters tally.\n\n[https://graphics.reuters.com/world-coronavirus-tracker-and-maps/countries-and-territories/united-states/](https://graphics.reuters.com/world-coronavirus-tracker-and-maps/countries-and-territories/united-states/)\n\nThe Food and Drug Administration (FDA), which is in charge of approving and regulating new medications, is expected to authorize the Pfizer (PFE) and Merck (MRK) coronavirus treatment pills this week.\n\nLast week, Pfizer reported that its COVID pill showed near 90% efficacy in preventing hospitalizations and deaths in high-risk patients, and recent lab data suggests the drug retains its effectiveness against the fast spreading Omicron variant of the coronavirus.\n\n[https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-set-authorize-pfizer-merck-covid-19-pills-this-week-bloomberg-news-2021-12-21/](https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-set-authorize-pfizer-merck-covid-19-pills-this-week-bloomberg-news-2021-12-21/)\n\nMeera Pandit, global market strategist at JP Morgan, said “On the virus side, ultimately what we’ve seen with prior surges and prior variants is that market sell-offs tend to be somewhat contained to a period of time, so we do expect that as we get better and better at dealing with some of these challenges from the economic and market perspective, things will likely settle down despite some of the public health challenges we have ahead.”\n\nIn other news, market participants are also processing an unexpected blow to Biden's economic agenda after Senator Joe Manchin (D., W. Va.) quashed the administration’s long-deliberated Build Back Better Act, citing concerns about inflation, the national debt and ongoing pandemic.\n\nLooking ahead, there is tons of important economic coming out:\n\n* Wednesday - The Conference Board is set to release its latest consumer confidence index, expected to show an only modest uptick for the month of December.\n* Thursday - Bureau of Economic Analysis will publish Personal Consumption Expenditures, the Fed’s preferred measurement for inflation. Consensus data compiled by Bloomberg showed PCE is projected to climb at a 0.6% month-over-month rate in November.\n\n**Highlights**\n\n* President Joe Biden in remarks Tuesday afternoon said he was considering a reversal of recent travel restrictions in light of Omicron\n* AT&T Inc said on Tuesday it was selling its advertising unit, Xandr, to Microsoft. Xandr was created in 2018 through the acquisition of an ad exchange and a TV ad tech company to use data collected from phone, internet and TV services to target consumers.\n* Following the blocking infrastructure bill, Goldmans Sachs (GS) and Mark Zandi, chief economists at Moody’s, cut US GDP forecasts for 2022.\n* Moody’s, one of the main credit ratings agencies in the US, once again gave Apple the highest ‘AAA’ credit\n* The EU approved Microsoft’s (MSFT) $16 billion acquisition of Nuance, an AI-powered text to speech company\n* Workers at a Starbucks (SBUX) store in Seattle, the coffee giant’s hometown, say they aim to unionize, adding momentum to the organizing efforts at the chain.\n* Global merger and acquisition (M&A) activity shattered all-time records in 2021,  $5 trillion for the first time ever, with volumes rising 63% to $5.63 trillion by Dec. 16, according to Dealogic data, easily surpassing the pre-financial-crisis record of $4.42 trillion in 2007.\n* Taiwan Semiconductor Manufacturing Co Ltd has received approval from Taiwan's investment commission to set up a chip manufacturing plant in Japan.\n* Alphabet Inc's YouTube began restoring access to Walt Disney Co channels on its platform on Sunday, after the companies reached a distribution agreement to end a two-day blackout.", "id": "rloei1", "created_utc": 1640121351.0, "score": 20, "upvote_ratio": 0.81, "num_comments": 18, "comments": [{"body": "Thanks for the update!", "score": 2, "replies": []}, {"body": "A lot of the rally happened well before the federal/Biden news on omicron.", "score": 1, "replies": []}]}
{"title": "Taxes and capital losses/gains", "selftext": "This year started very poorly, I got on the GME bandwagon as it was headed to oblivion and took a 48k (realized) loss. After mopping around a couple of weeks, i learned about margin, and started taking huge positions on TSLA, which panned out. As TSLA is such a volatile stock i got into buy/sell multiple times a day, for the most part it worked out well. Currently i have a positive 80k in realized gains, here is where the question comes:\n\nBecause Musk has been selling and the state of the economy is not amazing either, my current unrealized position on TSLA is -75k. If i sell right now will i only pay taxes on the current profit of the 5k?", "id": "rlcx8a", "created_utc": 1640086901.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 20, "comments": [{"body": "Talk to an accountant before listening to anyone here", "score": 9, "replies": []}, {"body": "Look up wash sale rules. If selling the TSLA shares now is a wash sale (you purchase shares within 30 days before or after selling these shares), you cannot claim it as a loss for tax purposes. Start planning a few months ahead next year if taxes are a concern.", "score": 0, "replies": [{"body": "If he also sells the shares bought in the previous 30 days, then he can realize all losses.  The OP needs to be very careful in specifying which lo5s he is selling.", "score": 2, "replies": []}]}, {"body": "You don’t get to claim that much loss in a year. Only $3000 annual", "score": -1, "replies": [{"body": "But larger losses can be applied forward until the entire loss is used.", "score": 4, "replies": []}, {"body": "I don’t have “loses”, i have 5k in gains", "score": 2, "replies": [{"body": "I misunderstood then. The way I read your post was that you were contemplating a -75k sell.", "score": 1, "replies": []}, {"body": "Didn’t you say you had $48k in losses due to GME? So technically you still don’t have a $5k gain right? You may have $5k from TSLA but overall you would be at $43k in losses right?", "score": 1, "replies": [{"body": "Sorry, i should have clarified this. I covered my losses and then some by 80k+ in the green. By selling TSLA, i would be only at +5k in “gains”", "score": 2, "replies": []}]}]}, {"body": "You can use an unlimited amount of loss to offset capital gains.  The $3k is the limit for offsetting ordinary income after you have offset all realized gains.", "score": 2, "replies": []}, {"body": "Cant you post forward losses on it, 3k a year for X amount of years?", "score": 1, "replies": [{"body": "Yes that’s correct based upon my understanding.", "score": 1, "replies": []}]}]}, {"body": "Yes, but even with paying taxes you’ll probably be better off.  Why would you want to sell such a big loss just to not pay taxes? Even if it is a short term gain, you still seem like you would be better off collecting the profit from the original sale. It seems like you lose a lot more by selling then just paying the taxes", "score": 0, "replies": [{"body": "How though? If he doesn’t sell he’s paying taxes in $80k gains, when in reality he’s only made $5k. He could tax harvest and only pay taxes for his $5k gain and then after 30 days later he could rebuy the same stock. The downside is that the stock could boom in those 30 days, but personally I’d rather sell now to reduce taxes and rebuy at end of Jan.", "score": 2, "replies": [{"body": "Unrealized losses are not losses until you sell.\n\nHere is my rationale.  Let’s say the top tax rate is 50%.  This is a estimate based upon the current top tax rate being 37%(if you make north of 526,000 a year) and a state tax of 13%.  It’s probably a lot lower, but I’m just purposely being over the top.  He has 80,000 dollars to pay taxes on, let’s assume no tax deductions.  His tax hit would be 40,000.  So that leaves him with 40,000 to reinvest, put towards a new stock or reinvest into TSLA.  Even with my insane tax rate, he is still ahead by 35,000 dollars.  The reality is his tax is going to be much lower.\n\nAnother issue, that is 40,000 dollars of buying power.  The tax benefits for a loss is still available to me every year, but you won’t always make 80,000 dollars a year in stock.  Besides,  why would I want to decrease my buying power to 5000 dollars then rebuy the same stock that I’m anticipating is going to drop.  If I expect the stock to go up, why not use the full strength of my 40000 dollars to amplify my gain and buy when it goes down. Selling that huge of a loss just to avoid paying taxes is penny wise, and pound foolish.\n\nI’m not against mitigating taxes, that makes sense, but reducing your profit by 95% just to avoid paying 50%(in reality more like 30% at the most) doesn’t really make sense to me.\n\nNow, if OP believes that TSLA is such a lost cause that the further loss in unrealized gain will be far greater then his current realized profit, I can’t blame him for that.", "score": 1, "replies": [{"body": "Maybe I’m missing something, but when you mention he will pay $40,000 in taxes and have $40,000 left over to invest into another stock, this isn’t true since he’s already lost $75k (although unrealized losses).\n\nHe did make $80k in realized gains, but he reinvested into TSLA and has $75k in unrealized losses. So how will he have that $40k left over?", "score": 1, "replies": [{"body": "He hasn’t lost 75,000.  It’s a unrealized loss.  You don’t pay taxes on unrealized losses and gains.  Try going into a store and trying to buy groceries with your unrealized gains.", "score": 1, "replies": [{"body": "I think you’re missing the point or I’m just not getting it across correcty.\n\nLet’s say he does choose to pay 50% in taxes. So he hands over $40k of his gain. Okay… now what? He doesn’t have the other $40k to reinvest into another stock… he’s already in TSLA with the original $80k gain. Paying taxes doesn’t give him an edge.\n\nScenario: I sell TSLA for $80k gain and now my total portfolio is $100k. I buy TSLA back for $80k. After months, TSLA is tanking. The reinvested $80k is now only worth $5k. I now only have overall $5k gains and my total portfolio is $25k. To the IRS, if I don’t sell TSLA for a loss, I have to pay taxes on that $80k gain. Why on earth would you want to do that? Ideally I would sell for a loss, and only pay taxes on that $5k gain. Now I get to pay less in taxes, and if I want to reinvest my money into TSLA I can do so after 30 days.", "score": 1, "replies": [{"body": "The reason why is because the taxes are less then the realized loss, that is why you wouldn’t want to sell.  Especially if you believe the stock is going to increase.  Tax-loss harvesting is great for rebalancing portfolio, especially if you believe you have shares in a company that bad investment, but to accept any lose just because you might have to pay taxes on a gain, I don’t see the value there. \n\nWhat if the opposite happens in your scenario, and the stock shoots back up(as is common in January) you would effectively be selling low and buying high. \n\nObviously, this comes down to numbers and doing the math.  I don’t think the math checks out for this, but maybe there is more to it. I’m not an accountant.  I’m curious what an accountant would say about this situation.", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "Is FB a good buy right now?", "selftext": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to do that and post it here. That´s my first analysis for FB. If you have any feedback for me that would be great and highly appreciated. If you have questions feel free to ask, I´ll try to answer everything.\n\nToday we will look through the basics of Meta Platform´s business and then see if we can come up with a fair value for FB stock using discounted free cashflow.\n\nThis is not financial advice and I personally own shares in FB. Nevertheless I will try to stay as unbiased and objective as I can. Always do your own due diligence.\n\nFirst let´s review their different revenue streams. Their biggest stream, around **97%** of their sales comes from **Advertising**. The other **2%** come from **Other Revenues.**\n\nFor the valuation:\n\nWe take **analyst estimates**, we discount that by our **required return of 11,2%**. Then we use the **perpetual growth rate of 2,5%** and that gave us a fair value for FB´s stock of **$453 per share**. But because we have to account for **FB´s equity** as well, our **fair value of equity** would be **$454 per share**.\n\nNow feel free to include a margin of safety to that.\n\nWith **FB**´s price being at **$324** **per share** right now, it seems undervalued. That´s why I think buying *heavily* might be a good idea. Although you can always dollar-cost-average. That´s where you invest every month the same amount.\n\n**Where I see FB´s stock price in 5 years.** We can calculate where the price might be in 5 years with the **Earnings Per Share (EPS TTM)**, the **Estimated Growth Rate** and the **Future P/E Value**. With this method I get a stock price of around **$600 per share** which is higher than what it is now.\n\n**What I´ll do.** I believe FB is here to stay. I think they will stay for a long time. Meta Platforms is a good company to invest in and that´s why I will buy shares as soon as I get the chance.\n\nThank you for reading and I hope I´ll see you again.\n\nIf you want to see my analysis for another stock, please tell me.", "id": "rlgp2t", "created_utc": 1640099612.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 16, "comments": [{"body": "Yes, Great company, i'm in averaged at 320 and if i had more money on me i would have bought more yesterday", "score": 2, "replies": [{"body": "How do you feel now?", "score": 1, "replies": [{"body": "Great, bought more FB stock recently at a ridiculous discount", "score": 1, "replies": [{"body": "Whats the reasoning for your continued confidence in the company?", "score": 1, "replies": [{"body": "- Price drop happened because of slight decrease in MAUs (which to me was not relevant when you take into account that FB is already on the phones of half of the world population, so plateauing is inevitable, but that doesn't mean less profit);\n\n- They predicted slower growth rate due to Apple (and now Google) system changes that make data collection harder, but i feel like most people fail to realize that FB family of apps are still the absolute best way to advertise most brands and products (TikTok is growing but most users are teens or younger, who don't have that much money and are not target audience for most brands, besides, TikTok short video format is also way harder to monetize than IG, for example;\n\n- DCF model shows me the company is still undervalued even when using very conservative numbers;\n\n- Management has a great history;\n\n- They have way more cash than debt so they are definitely not going bankrupt or anything close to that;\n\n- Even though they aren't great capital allocators (since they have so much cash), their ROIC is still above 20% which is very good;\n\n- They haven't even begun monetizing WhatsApp and IG Reels;\n\n- They are essential to connection between people around the world, they have a huge MOAT which is their huge network effect and that will not go away so soon;\n\n- People often bash FB for all the harm it has done in the past, regarding fake news spreading and censorship, however people overlook how great they are for allowing people to connect and come together in moments of despair (covid, ukraine conflict, etc);\n\n- The company is still founder led, and i really trust Zuckerberg. Having heard him speak to the senate, and in more recent interviews/podcasts, i believe he is a guy with a mission (kinda like Elon but not so much) whose very rational, and some of FBs prior mistakes could be understandable after you listen to him and others debating the issues;\n\n- Metaverse is not even priced in on the stock;\n\n- They have the world's most advanced AI computer, which will allow them to process tons of data more efficiently and potentially offset some short term losses causes by Apple and Google's systems' changes.\n\nThere are probably other things but i can't keep writting them all, to me FB at 195$ is simply a no brainer.", "score": 1, "replies": [{"body": "Thanks man appreciate it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "For a long term play, I’d say yeah.", "score": 4, "replies": []}, {"body": "It’s a great stock and that’s actually decently priced right now. The only problem is fuckerberg sells shares every damn day and the stock doesn’t go up enough due to that.", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "While the volume of his sales likely doesn’t affect price there is a significant signal value to it, wouldn’t you agree?\n\nInsider selling is rarely good for any stock, whatever the reason.", "score": 1, "replies": []}]}]}, {"body": "Umm this a repost from couple weeks back... Wow", "score": -2, "replies": [{"body": "What?", "score": 0, "replies": []}]}, {"body": "YES. So is COIN", "score": 0, "replies": []}, {"body": "Looks like it will be going down to 250 or so likely after earnings calls. Wouldn’t expect it to go up this year but perhaps 2023 and beyond yes this will be a play.", "score": 1, "replies": [{"body": "Holy shit you called it lol", "score": 1, "replies": []}]}]}
{"title": "Tesla has lunched Wireless Portable Charger 2.0", "selftext": "", "id": "rl8zpx", "created_utc": 1640070875.0, "score": 57, "upvote_ratio": 0.95, "num_comments": 13, "comments": [{"body": "Damn, it is sold out!", "score": 12, "replies": []}, {"body": "Lunch….Mmmmmmmm.", "score": 10, "replies": [{"body": "Nom nom nom nom", "score": 1, "replies": []}]}, {"body": "Got a white one at midnight. Wanted the red one too but was sold out!", "score": 4, "replies": []}, {"body": "Tesla and their damn random listing times, you're killing me smalls!", "score": 9, "replies": []}, {"body": "They already sold out 20 minutes after this post", "score": 2, "replies": []}, {"body": "I’m gonna go lunch me some breakfast somewheres", "score": 2, "replies": []}, {"body": "I don’t think you’re going to get a lot miles out of that.", "score": 2, "replies": []}, {"body": "I dont get it.  Its a charger that you charge on your cars pad so you can charge your phone on it later?", "score": 2, "replies": []}, {"body": "Missed the A 😩", "score": 1, "replies": []}, {"body": "je m'envoie un chargeur portable tous les jours au déjeuner.\n\ndelicious!", "score": 1, "replies": []}, {"body": "\\#TeamMSM", "score": 1, "replies": []}]}
{"title": "2021-22 Tesla Model Y earns highest IIHS accolade", "selftext": "", "id": "rli8yx", "created_utc": 1640103991.0, "score": 141, "upvote_ratio": 0.99, "num_comments": 12, "comments": [{"body": "From my comment on the TeslaMotors thread:\n\nFor context, the complete list of vehicles:\r  \n\r  \nhttps://www.iihs.org/ratings/top-safety-picks", "score": 5, "replies": [{"body": "Wow, that's a lot more \"very\" safe cars than I expected. I hope this means even before autonomy we'll be able to see road deaths declining.", "score": 8, "replies": [{"body": "They have been declining for decades if you look at motor vehicle deaths per population and deaths per miles driven.", "score": 10, "replies": []}]}]}, {"body": "No big deal. Carry on", "score": 11, "replies": [{"body": "It’s a big deal, just not really news/a surprise.", "score": 13, "replies": []}]}, {"body": "It’s well known fact. Next.", "score": 4, "replies": []}, {"body": "Brutal", "score": 1, "replies": []}, {"body": "I am a model Z. Can I have some IIHZ lemonade, please.", "score": 1, "replies": []}]}
{"title": "Pfe? Mrna?", "selftext": "In the midst of a very nice rebound today, pfe and mrna are down 5.5 and 6.5%, respectively?\n\nAnyone else have an opinion about shorting the put?\n\nPfe is still relatively high, but mrna is down significantly from early september...", "id": "rlgxn0", "created_utc": 1640100307.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 12, "comments": [{"body": "Maybe PFE as I wouldn't mind holding it longer term. \n\nMRNA is a bit too much of an unknown", "score": 9, "replies": [{"body": "MRNA only has one product generating revenue, it could easily go down another 75% before the next product in it's pipeline is out, esp if the covid pill gets approved.  People are getting sick of covid and vaccinations.\n\nAgree on PFE being a good long term hold.", "score": 8, "replies": [{"body": "True. Moderna only generated a positive eps since covid. So far only looking like a one trick pony.", "score": 3, "replies": [{"body": "But that one trick is a hell of a trick. Mrna’s are being tested for cancer in stage two right now. Back in march i priced out MRNA, and it is sitting close to where I thought it would be. 600 is where it could be once it has another trick, or two. Something to definitely keep an eye on.\n\nI am holding PFE now.", "score": 1, "replies": [{"body": "Dude. It keeps tempting me. Came off another $17 since yesterday's close. \n\nThat 1/21 $220 put is generating about 3% of risked capital right now, 20 delta.\n\nSounds like you know more than I do. I keep it pretty diverse and superficial, and I'm not usually interested in anything without a profit history, or over 60% iv, but as freaking high as the market is, I keep my eye out for stocks that have come off a bit.", "score": 2, "replies": [{"body": "There’s alot of volatility and up and down with MRNA right now. What I will be doing is selling .15 delta put credit spreads on down days and setting up the calls for and iron condor on the up days. Thats how im building up capital for a good LEAPS once and nice opportunity presents itself. \n\nTheir profits will be paid by every government in the world. That seems pretty save for me while they develop more uses for the mRNA. \n\nIf you’re already tempted, start now but start small. Spreads can be as small as 500 capital. Good luck", "score": 1, "replies": []}]}]}]}]}, {"body": "You're probably right...", "score": 1, "replies": []}]}, {"body": "PFE is a safer option", "score": 7, "replies": [{"body": "Yeah. Moderna only showed a positive eps recently with vaxx sales", "score": 2, "replies": []}, {"body": "I’m curious, why is PFE a safer option than Moderna?", "score": 1, "replies": [{"body": "since moderna currently is a one trick pony which is the mrna covid19 vaccine, so any news (like the pfizer antiviral) that diminishes the need for the moderna vaccine or any bad press regarding the vaccine (myocarditis) the stock price tends to drop more sharply with more volatility.  great for buying call options or debit spreads but you run the risk of getting assigned if you sell puts or credit spreads on MRNA", "score": 2, "replies": [{"body": "I see. Thank you for the explanation!", "score": 1, "replies": []}]}]}]}]}
{"title": "Can someone explain this options Strategy to me?", "selftext": "I have been following a series of TSLA option trades today from some big player that clearly knows far more than I do about how to manage risk in option trading as the market evolves.  I was hoping someone might be able to explain what this specific strategy is.  Clearly there is a lot of money at play so, I assume whoever is making these moves has a far more logical approach than I can understand.\n\nhttps://preview.redd.it/4tfyyjtmhy681.png?width=584&format=png&auto=webp&s=2a917fd3321063c4da8aed6ca325995f0e964748\n\nMy understanding based upon the time frame.\n\n1.  Person opens up a short straddle position (strike $900, Qty 1,000, exp 12/31) as TSLA sells off this morning (likely Elon selling). At that point they, I assume they believe stock finds support and stays around $900.\n2. Next they sell another short straddle (strike $900, Qty 1,700, exp 12/31) on the rebound deepening their position at slightly higher strike to skew the breakeven to a more bullish outlook.\n3. Then they open a long straddle (strike $950, Qty 1,750, exp 1/21) further out at a higher strike.  Does this turn one of the options pairs into an iron butterfly? I assume this covers their risk slightly and further skews their price target to a more bullish view.\n4. They open another long straddle (strike $900, Qty 1,150, exp 2/18)  I assume to pair with the other short straddle. Does this also further sport a changing price target for a bullish outcome?\n\nCan someone confirm if my analysis is correct, and if this is an actual strategy or just some sort of maintenance on an open options position where the underlying stock moves dramatically up in the course of the day? I am fascinated by whatever is in play here especially with the sheer volume of money being thrown around, but know its beyond my knowledge.\n\n&#x200B;\n\nhttps://preview.redd.it/0lsrq4z0ky681.png?width=644&format=png&auto=webp&s=e2571b7b2a52d52cf9686d7dbc0acfc74917df0d", "id": "rlnv0d", "created_utc": 1640119788.0, "score": 11, "upvote_ratio": 0.79, "num_comments": 11, "comments": [{"body": "If this is the same trader then they are opening straddles and then making them into calendar spreads with maybe slightly more favorable deltas? \n\nIn this case you'll have 2700 900 straddles for 12/31 and 2900 straddles for 01/21 and 02/18 so you are backing your short 12/31 straddles with slightly more favorable delta calendar and diagonals?\n\nI think without mapping this trade it would be hard to know the risk/reward and payouts, but my initial thought is the person is betting on TSLA rebounding in the 900 range for the 12/31 expiration which would allow them to close those 2700 straddles for profit.\n\nSince they have diagonal and calendar spreads in longer expirations they can cover if TSLA rips and hedge their downside if TSLA drops some. \n\nIts a pretty insane trade though, god damn. \n\nWhat screener is this? TOS?", "score": 5, "replies": [{"body": "Thanks that makes a lot of sense. I can’t say it is the same trader, but this pattern seems to pop up every day Elon sells. \n\nI am trying to determine if there is a better way to trade on Tesla, but more often than not I find my most profitable trades are just selling puts whenever RSI drops below 15. And then check this screener for a indication big money is moving in the same direction. \n\nI’m using Active Trader Pro.", "score": 1, "replies": []}]}, {"body": "I think you're spot on. Looks like they're legging into and out of straddles to profit off of price fluctuations.", "score": 5, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "If I'm understanding correctly. There is an opening short side when volatility is higher. Then opening a long side side volatility is lower.\n\nAt those large numbers the smaller fluctuations probably matters and are easy enough to take advantage of so why not?", "score": 3, "replies": [{"body": "I guess what I don’t understand is why you would then open long straddles with future dates expirations. Is it simply to hedge at that point, then let out of each when timing is right?\n\nSeems like both of the short straddles that were open are at risk of heavy losses if TSLA were to keep running, but TSLA seems to be yo-yoing everywhere lately, so in theory you could leg back out and make both profitable, but that seems highly risky when your max loss is over $60M.", "score": 1, "replies": []}]}, {"body": "How do you know these trades were conducted by the same person/entity?", "score": 3, "replies": [{"body": "That’s a good point. I only suspect they were. Been watching the trade patterns over the past couple of weeks and there seems to be a similar pattern of high dollars trades done the same way. The are always routed the same way too. So I suspect but can’t complete confirm.", "score": 2, "replies": []}]}, {"body": "Straddles. There is a ton of support for TSLA around 900. I’ve been selling puts just below this level for a few weeks.", "score": 2, "replies": [{"body": "Agree with that. I have made more money this year than Any I’ve ever had just selling puts on Tesla. I’ve stopped trying to option trade on any other stock because they can’t compete with the time value for money. Going to be really sad when TSLA volatility dries up.", "score": 2, "replies": [{"body": "I suspect most of that money has been made in the last few months. Had you sold tsla puts in feb/mar when the stock was at 850, then you'd have been bang holding for a few months whilst the stock fell to 550 and hovered below 800 for months.\n\nI speak from painful experience :-)", "score": 1, "replies": []}]}]}]}
{"title": "Tesla squeeze 20 day 1hr chart", "selftext": "May someone please confirm. Is it 🚀🚀🚀 time.", "id": "rlgpn0", "created_utc": 1640099658.0, "score": 14, "upvote_ratio": 0.9, "num_comments": 14, "comments": [{"body": "🚀🚀🚀 Absolutely YES, chart indicates TSLA going to be above $1000 by end of the year. Watch learn and come back here on 1st 2022  🚀🚀🚀", "score": 9, "replies": [{"body": "Remember what I said... watch and LEARN 🚀🚀", "score": 2, "replies": []}]}, {"body": "1100 by Feb", "score": 5, "replies": []}, {"body": "To the moon soon!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "giddy up.....   $1500", "score": 4, "replies": []}]}, {"body": "What’s the number for tomorrow bulls ??", "score": 2, "replies": []}, {"body": "Yup called it 🚀🚀🚀 get in while you can people!", "score": 2, "replies": []}, {"body": "not yet might drop a little more. im very bullish on Tesla but seeing the previous trading patterns. it looks to me it might drop to somewhere 780 range before we start seeing a nice bounce back up. not financial advice just my opinion", "score": 3, "replies": []}, {"body": "No", "score": 1, "replies": [{"body": "?", "score": 1, "replies": []}]}, {"body": "TSLA is still cooling off from its last run. So definitely a couple more months.", "score": 0, "replies": []}, {"body": "Seems like fomo for me.", "score": 0, "replies": []}, {"body": "Today i believe is price Action due to short seller shiting their pants on the rumor that e is done selling.", "score": 0, "replies": []}, {"body": "Agree it will drop to 750-800", "score": -2, "replies": []}]}
{"title": "PFE Call Gains", "selftext": "[deleted]", "id": "rlbk6r", "created_utc": 1640081289.0, "score": 76, "upvote_ratio": 0.87, "num_comments": 16, "comments": [{"body": "I missed the rally 🤦‍♀️", "score": 10, "replies": [{"body": "Oil is next", "score": 8, "replies": [{"body": "I think the same with inflation but is exist oil options ?", "score": 2, "replies": []}, {"body": "What’s the ticker??", "score": 2, "replies": []}]}]}, {"body": "Get out of here we only post losses on this sub", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|4275)", "score": 6, "replies": []}]}, {"body": "Hod that shit, you can still lose money", "score": 4, "replies": []}, {"body": "Dog stock", "score": 3, "replies": []}, {"body": "God I wished it was me, I was looking at those same fucking calls like 3 weeks ago", "score": 2, "replies": []}, {"body": "Now reverse and buy Puts now that the pill is approved?", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "I bought PSX looking to reach $90 in the next upcoming months💰✅", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|21|**First Seen In WSB**|1 year ago\n**Total Comments**|3140|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rlbk6r)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rlbk6r)", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rljagk", "created_utc": 1640106848.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 12, "comments": [{"body": "Boeing is probably  good investment, unless covid will gets worse. Nothing worse for planes than total lockdown when people can't travel.", "score": 4, "replies": [{"body": "Yeah but there’s potential war coming Boeing is a good defense stock", "score": 3, "replies": [{"body": ">potential war coming\n\nWith whom?", "score": 2, "replies": [{"body": "Russia, and China.", "score": 1, "replies": []}]}, {"body": "You have think airlines are going order new planes with fuel prices rising and international travel will come back in 2022. Look at Honeywell I think it is performing because of forecast bump from increased flying in 2022", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|3 months ago\n**Total Comments**|17|**Previous DD**|\n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rljagk)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rljagk)\n    \nHey /u/Affectionate-Bat-235, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 2, "replies": []}, {"body": "Sir, I'm going to need to you use more pictures and crayons for me to see this properly.\n\nTL;DR - Airplanes go burrr?", "score": 2, "replies": []}, {"body": "Omnicron = 🖍 =red", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "lol imagine thinking you're not too late for a reopening play. Retard, the time to make this bet was like June of last year.", "score": 1, "replies": []}, {"body": "My bet is on $SPR. If Boeing will get tendies Spirit will get some subcontractor tendies as well and I think that Spirit is better priced than $BA.", "score": 1, "replies": []}]}
{"title": "Markets at close: 12/21/2021", "selftext": "**Today in brief**\n\n**S&P: 4,649.23 (+81.21) (+1.78%)**\n\n**Dow: 35,492.70 (+560.54) (+1.60%)**\n\n**Nasdaq: 15,341.09 (+360.14) (+2.40%)**\n\nFollowing the rout yesterday, Global stock markets were on the upswing today and the same was reflected in the US markets. The indices recouped the Monday losses and closed above Friday’s (12/17) close though nothing much has changed in terms of the concerns on the Omicron variant, which is fast becoming the dominant variant throughout the US and the World. Even with the cases rising and restrictions increasing, the general public is in a much better position to handle this new variant; vaccinations and general awareness on masks and social distancing is sure to help this leg of the pandemic to be in the rear-view mirror with much less damage.\n\nShares of Micron Technology was up by more than 10% following its beat of topline and EPS in its Q1 earnings and the subsequent strong chip demand forecast. The company’s shares have been trading sideways this year but has been attracting lots of attention on its DRAM and NAND Flash storage.\n\nEV Company and pandemic-era favorite Nikola will pay a fine of $125 Mn in settlement with SEC over alleged false claims by Nikola’s ex-CEO Trevor Milton. Nikola neither accepted nor denied the claims of Milton in terms of the settlement. Nikola currently trades above $9 which is a fraction of $70+ it traded in mid-2020s. Hindenburg’s damaging report and the subsequent watered-down deal with GM reversed the tides for this stock.\n\nAnother meme stock, WISH, jumped up by more than 14% today. For the year though the ecommerce stock is down by more than 80%.\n\nAirlines and Cruise stocks were all up today with DAL (+5.9%), AAL (+4.7%), UAL (+6.9%), CCL (+8.7%) and RCL (+5.4%) significantly in the green following a positive report by Bank of America. According to the report, domestic bookings have been largely resilient in the face of Omicron thus far with more softness in the international bookings. Cruise stocks continued the momentum on the favorable commentary by the management of CCL yesterday.", "id": "rlosrz", "created_utc": 1640122493.0, "score": 32, "upvote_ratio": 0.86, "num_comments": 13, "comments": [{"body": "Today is too good, spend plan been blocked, covid case sky rocket, and almost all the stock I bought have a big green day. This make me a little worry if we heading another big red day tomorrow. ![img](emote|t5_2th52|4270)", "score": 16, "replies": [{"body": "BBB will be back under some other different name with few modifications.  They need to get their act together before the mid-term", "score": 3, "replies": [{"body": " manchin just wanted to get his addon installed before big raid", "score": 5, "replies": [{"body": "He and Pelosi are just waiting on open interest", "score": 2, "replies": []}]}]}]}, {"body": "My AAL puts better print. They have to print this week", "score": 2, "replies": [{"body": "Buy the dip mentality but this today was more like buy a pullback. This goes to 16.50 by the eow", "score": 2, "replies": []}]}, {"body": "Why is the US500 index changing even now when all US markets are closed? I thought SP500 is calculated only from the prices fron US exchanges?\n\nDoes anyone know how its calculated?", "score": -4, "replies": [{"body": "After hours trading", "score": 9, "replies": [{"body": "Currently it's 8:17 am here (Europe time) and the US500 index keeps changing as well.\n\nSo does the SP500 index change whenever any stock exchange in the world is trading US stocks? It's not just bound to the US exchanges? Cause I'm sure pre-market hasn't started yet for US.\n\nI'm new to this but I havent been able to find an answer to this at all, thanks :)", "score": 2, "replies": [{"body": "This is because now the s&p 500 futures contracts are trading", "score": 1, "replies": [{"body": "I should study up more, I don't know how futures work yet. Thanks a lot for coming back to me!", "score": 1, "replies": []}]}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|7 months ago\n**Total Comments**|53|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/r5fslk/alpha_call_paysafe_buy_in_for_the_long_term/) \n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rlosrz)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rlosrz)", "score": 1, "replies": []}]}
{"title": "I Knew Better, but I Bought Tesla Stock - A bull market can tempt a business journalist into mistaking himself for an investing genius.", "selftext": "", "id": "rlpavt", "created_utc": 1640123976.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 10, "comments": [{"body": "\"The higher the markets rise, the more some of us believe we are investing geniuses. I fit this diagnosis. Though I spent my career covering business news and talking about stocks on cable news, I invested almost entirely in index funds and ETFs—until a few months ago. \n\nEmboldened by the growth in my retirement account and the ease of betting five-figure sums in seconds online, I started making some moves. Within weeks a cardinal lesson proved itself: Once your portfolio is set, the less you do, the better. \"", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "#this reads like WSB's greatest hits", "score": 2, "replies": []}, {"body": "This was a fabulous read and a sincere laugh out loud. If you didn’t laugh out loud you shouldn’t be on here.", "score": 4, "replies": [{"body": "Sounded good, not paying.", "score": 1, "replies": [{"body": "Paying what I read it article it’s free you retard", "score": 1, "replies": []}]}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|284|**First Seen In WSB**|11 months ago\n**Total Comments**|2831|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rlpavt)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rlpavt)", "score": 1, "replies": []}, {"body": "He’s got decades of experience as a business news analyst but is upset when his cryptoETF holding closes down 3% on the day?", "score": 1, "replies": []}, {"body": "\"I am down more than 20% in less than three months.\"\n\nWhat a fucking amateur. Rookie losses.", "score": 1, "replies": []}]}
