{"title": "Weekly Chat Thread and Discussion", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "rklqld", "created_utc": 1640001619.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 16, "comments": [{"body": "It's time to buy folks.", "score": 6, "replies": []}, {"body": "It’s going to be another red week :-(", "score": 5, "replies": []}, {"body": "MU beat the QT result. This is very good news for NVDA. Tuesday we can see 300", "score": 4, "replies": [{"body": "That's what I was thinking too", "score": 1, "replies": []}, {"body": "Could you explain how this is good news for NVDA? Do MU and NVDA buy/sell components from each other?", "score": 1, "replies": [{"body": "Is just good for semi growth stocks in general. Intel won’t have a big reaction but AMD, NVIDIA WILL", "score": 1, "replies": []}]}, {"body": "See this…In a statement, Micron (MU) Chief Executive Sanjay Mehrotra said the company was seeing trends \"including 5G, AI [artificial intelligence] and EV [electric vehicle] adoption fuel demand growth\" for its core DRAM and NAND memory chip products.\n\nMost of NVDA gpu and AI rams come from MU as well.\nHere AI means only NVDA.", "score": 1, "replies": []}]}, {"body": "I sold at 290-339, and started to buy back around 271", "score": 3, "replies": [{"body": "and now It's almost 290 again, good job!", "score": 1, "replies": [{"body": "Yah, I bought back already, 274-290", "score": 1, "replies": []}]}]}, {"body": "Lowerd my average price to below 300!", "score": 2, "replies": []}, {"body": "Yeah, I'ma just log off my portfolio until January.", "score": 2, "replies": []}, {"body": "Buying.", "score": 1, "replies": []}, {"body": "NVDA is an extremely volatile stock. I see posts complaining about being down 10+ percent.  If you don’t want to be down 10+ percent then invest in an\nIndex fund. We were down 50+ percent at the end of 2018.  \n\nThe quality of the company doesn’t drop along with the stock price.  This is a highly speculative stock because it has attracted short term traders and FOMO traders. Big money funds see this and take advantage. I fully expect a 40% correction at some point, but I also expect it to hit $400 per share in the next 1-5 years.  If you can’t stomach the possibility of being down  near or below $200 per share then you should consider selling now.", "score": 1, "replies": [{"body": "Oh man, I'd have a buying spree if it dropped below $200.", "score": 1, "replies": []}]}, {"body": "Doppelboden hat Standgehalten. Nun ist es Zeit zu kaufen bevor es explodiert.", "score": 1, "replies": []}]}
{"title": "Can you day trade butterfly spreads?", "selftext": "Exactly as the title states, can you profit through day trading a butterfly spread and how?\n\nIt seems that if chosen correctly, a long put butterfly spread would become profitable immediately after its bought, even if just slightly;  now if I were to take advantage of stocks such as TSLA, AMZN, or other stocks that move by a lot, daily in either direction - would I, in theory, be able to open this spread and manage to profit if I were to buy 1 DTE ? \n\nI'm understanding that I will be most profitable if it is closer to the body, on the expiration ofc, but if I simply move the expiration a bit sooner I could take advantage of price swing with more leverage for much cheaper risk.\n\nI'm not a professional, especially when it comes to multi-leg strategies, just been studying this strategy for a little while and have some questions.", "id": "rkk5nm", "created_utc": 1639995533.0, "score": 7, "upvote_ratio": 0.67, "num_comments": 12, "comments": [{"body": "You can use directional flies for a cheap earnings play.  Not my game but I have seen folks be successful at this (as much as earnings plays are successful).  I prefer non-directional flies further out but if I was trying something that short term it would be a directional fly around an event.  If you’re going to hold through an event, it’s nice to be negative Vega.  You just have to be prepared to lose it all so keep them small.", "score": 5, "replies": [{"body": "Thanks for the advice, can you expound on \"you just have to be prepared to lose it all ...\" - is this because of the event in question or is this a general thing to keep in mind for most fly spreads? I could see both but I also feel that flies seem to be hedged a lot better than simply a long position, so it feels like I shouldn't see it all go negative before I see profits  when buying these maybe a week out or so.", "score": 1, "replies": [{"body": "Technically any trade can max loss.  But with day trades or super short term trades, if things go against you, there isn’t much if any time left to repair it.  Most daytraders I have seen tend to open contracts with very short expirations since they don’t intend to be in the trade more than a few hours anyway and being further out tends to slow down movement which doesn’t work with daytrading.\n\nAgain, this isn’t my game…mostly because of this stuff.  You have to be right and right very quickly to win.  Possible but tough.  And because of that, in order to be responsible with risk you have to trade small.  If it works for you, great.  It’s just not for me.", "score": 3, "replies": []}]}]}, {"body": "You would have to be able to predict volatility that ISNT priced in to the premium. \n\nGood luck.", "score": 4, "replies": [{"body": "How so, this sounds sarcastic, but it's not I just would like to hear everything there is to know about this strategy, so if there are people who know things about it that havent crossed my mind I would love to hear em!", "score": 3, "replies": [{"body": "Hit up YouTube my duder, there’s a TON of free information available, including classes on different strategies. Take a note book and a pen and treat it like a regular class", "score": 2, "replies": []}]}]}, {"body": "It's been proven that 'day trading' / 'scalping' isn't a long term viable strategy by itself. Scalping should be used to stay engaged in the market - but not for a 'real' profit center in your strategy for options or stocks.", "score": 3, "replies": []}, {"body": "You can do spx on pretty good days. Monday i got filled at -$0.90. Only as things come closer to close/exp will a day trade be reasonable it seems.", "score": 3, "replies": []}, {"body": "You may be able to day trade an iron butterfly on expiration date. I can't think of any other time though.", "score": 2, "replies": []}, {"body": "Depending on your platform it's the fees that could kill that idea. I've ran Ford flys for a few weeks now @19.5 and 20 as the peak amd usually buy with very low limit orders (.00 - .03) and hope for execution during morning volatility.", "score": 1, "replies": [{"body": "So I trade on RH atm but am also setting up TD Ameritrade, although I'm stalling because of the whole, sending picture of ssn, thing and its redirected to the web so it feels very unsecure - point being I dont have fees, in my position what way could I benefit from this when using RH platform?", "score": 1, "replies": [{"body": "If I remember correct RH doesn't have much in fees for this...so they are probably the best platform to use the butterfly strategy. I use TOS (Ameritrade) and I pay pretty hefty fees for these options which is why I place low limit orders so I can quickly recover those fees. I think you will be minot from that", "score": 2, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rktcbo", "created_utc": 1640023756.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 10, "comments": [{"body": "TQQQ. \n\nI look forward to seeing your loss porn on WSB soon", "score": 8, "replies": [{"body": "And conversely, SQQQ.", "score": 4, "replies": []}, {"body": "Wel this was just mean. Lmao. I fell into the TQQQ trap recently as a newbie just trying to collect premium. That was the most stressful week of my trading life.", "score": 2, "replies": []}]}, {"body": "Set up your own scanner based on the Greeks, price and volume... Try to understand the Greeks and their relationship.", "score": 0, "replies": [{"body": "Can you recommend me a scanner please?", "score": 0, "replies": [{"body": "You need to set it up yourself. I already told you what you should be looking for. Most people call in brokerage asking for help to get started.  You can also pay a fee have investment firm to alert you.", "score": 0, "replies": []}, {"body": "Read up on the greeks or no advice will help", "score": 1, "replies": []}]}]}, {"body": "AMC and it’s one of the easiest . I trade it multiple times a day and have the best prediction rate on WeBull  at 95%", "score": -3, "replies": [{"body": "Add GME", "score": 0, "replies": [{"body": "Opposite the volatile side. Ford. It doesn't move alot but its strike prices are .50 apart. Its affordable. You can stack it up quick. Reliable company. So if you figure the daily direction that's what you buy that day. Don't get stuck in just calls or just puts. Buy the direction", "score": 1, "replies": []}]}]}]}
{"title": "Here's Your Daily Market Brief For December 20th", "selftext": "**📰 Top News**\n\nS&P Futures: -1.21%; DOW Futures: -1.15%; Nasdaq Futures: -1.38%\n\n**US stock futures opened lower on Monday morning** as investors grappled with bad news related to surging Covid cases and US President Biden's spending bill.\n\n**Biden spending bill dealt critical blow** \\- U.S Senator Joe Manchin dealt a critical blow to US President Joe Biden's landmark $1.75 trillion domestic investment bill by saying he would not vote in support of the legislation. *Note: Manchin's support is crucial for Biden as Republicans are united in opposition against the bill* \n\n**From pandemic to endemic** *-* Covid will become an endemic disease as early as 2024, according to a statement from vaccine manufacturer Pfizer. *Note: Endemic means the coronavirus will not disappear, but rather will become a vaccine-protected ailment like the flu.* \n\n**Supply chain shows promise ahead of holidays** \\- Supply chain woes ensnaring goods from around the world and driving inflation are slowly receding just ahead of Christmas according to Mario Cordero, executive director at the Port of Long Beach. *Note: \"You'll see normalcy in the supply chain, in my opinion in summer 2022.\" Cordero said.* \n\n&#x200B;\n\n**🎯 Price Target Updates**\n\nBarclays upgrades AT&T. T upgraded to OVERWEIGHT from EQUALWEIGHT - $30\n\nJP Morgan upgrades Public Storage. PSA upgraded to OVERWEIGHT from NEUTRAL - $385 (from $359)\n\nPiper Sandler downgrades Canopy Growth Corp. CGC downgraded to UNDERWEIGHT from NEUTRAL - $7 (from $11)\n\n&#x200B;\n\n**📻 In Other News**\n\n**Spiderman crawls to the top of US Box Office** \\- \"Spiderman: No Way Home\" shattered pandemic box office records this weekend, opening with an estimated $253 million in ticket sales. *Note: Not only is it the highest film debut of 2021, but it is also the third-best opening of all time behind \"Avengers: Endgame\" and \"Avengers: Infinity War\".*\n\n**Google, Disney work it out** *-* Alphabet's YouTube said that it has reached a deal with Walt Disney to distribute all Disney-owned channels on its platform. *Note: The agreement comes two days after talks between the companies broke down and led to a blackout*\n\n**Hair products recalled over cancer scare** \\- Procter and Gamble issued a voluntary recall of more than 30 aerosol spray products, due to concerns over the level of benzene, a chemical known to cause cancer. *Note: The recalled products include dry shampoos and conditioners and antiperspirants from brands such as Pantene, Aussie, and Herbal Essences.*\n\n&#x200B;\n\n**📅 This Week's Key Economic Calendar**\n\n**Monday***: Leading Index (Nov)*\n\n**Tuesday***:* *No major economic events*\n\n**Wednesday***: GDP annualized QoQ (3Q), Existing Home Sales (Nov), GDP Price Index (3Q)*\n\n***Thursday****: Personal Income (Nov), Initial jobless claims (wk end 18-Dec), New Home Sales (Nov)*\n\n***Friday****: No major economic events*  \n\n\n**📔 Snippet of the Day**\n\n***Quote of the day:*** *\"Successful investing is anticipating the anticipations of others\" -John Maynard Keynes*", "id": "rkn8q9", "created_utc": 1640006779.0, "score": 34, "upvote_ratio": 0.88, "num_comments": 13, "comments": []}
{"title": "AMD/XLMX- why buy AMD before the acquisition?", "selftext": "Correct me if I am wrong, but wouldn’t it be prudent to buy $2200 in XLNX right now than spend that money on AMD? Assuming the acquisition finishes as anticipated, each $2200 spent on XLNX would result in an extra 2.75 shares of AMD after the acquisition closes. Am I missing something or is this just free money on the table?", "id": "rkb51u", "created_utc": 1639963452.0, "score": 12, "upvote_ratio": 0.73, "num_comments": 20, "comments": [{"body": "If the acquisition doesn't get done XLMX will drop and you'll lose money.\n\nThere's never free money.", "score": 22, "replies": [{"body": "Last I checked, all regulatory bodies have given the green light. Lisa Su anticipate s the deal to close by end of year. It seems like a safe bet, right?", "score": 5, "replies": [{"body": "It's never safe, free money doesn't exist, if you think it's free money all that means you're either wrong or missing some piece of information.\n\nThere's always risk.", "score": 17, "replies": [{"body": "Duly noted, I’ll take the safer route then", "score": 3, "replies": [{"body": "If you think it will go through, then it is indeed free money. You just have to be right.\n\nThere are sometimes situations where you are sure while some of the market is not or unaware. This discrepancy is what makes good money but not everyone manages to assess situations correctly.", "score": 1, "replies": []}]}]}, {"body": "Only the year is essentially over. If you're counting on a Chinese Christmas surprise because you're feeling lucky, well....I've got a bridge for sale", "score": 0, "replies": []}, {"body": "It was until the current administration decided to get frisky and blacklist some more Chinese companies. China has been good about not retaliating but this merger would be a place they could.", "score": 1, "replies": []}]}, {"body": "I think you're thinking of the Nvidia ARM merger. Real possibility that doesn't go through.", "score": 1, "replies": [{"body": "I don't know the specifics of this acquisition but my point still stands.\n\nThere's no free money.", "score": 3, "replies": []}]}]}, {"body": "Also, who‘s to say that the deal will be accretive?", "score": 2, "replies": []}, {"body": "Odds of the acquisition going through are extremely high, but nothing is a certainty. It all depends on what you’re willing to risk. If you want to open a long position in AMD and you’re comfortable with potential losses on the off chance acquisition falls through, then get Xilinx.", "score": 1, "replies": []}, {"body": "Acuisitions dont  generally pop.", "score": 1, "replies": []}, {"body": "The difference in price between xlmx and its value if the merger goes through is a reflective of the markets assessment of the risk the deal fails.\n\nIf the deal fails, xlmx will drop a tremendous amount immediately. \n\nThe case for buying xlmx versus AMD is if you think the odds of the deal going through are higher than what the market thinks the odds are. Currently, the market seems to think its virtually a done deal, the risk reward ratio isn't great l.", "score": 1, "replies": []}]}
{"title": "Negative real rates 10 yr vs stocks", "selftext": "Stock market performance has been parabolic when 10 yr rates are negative. We’re about to go into a period of negative real rates and it’s doubtful CPI will get below the 10 yr rate any time soon.\n\nDoes this mean the best is yet to come for stocks?", "id": "rkba3t", "created_utc": 1639963876.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 11, "comments": [{"body": "That’s what Tom Lee was saying. Negative real rates = markets rocket higher.", "score": 9, "replies": [{"body": "The is no alternative strategy been doing great since like 2013", "score": 1, "replies": []}]}, {"body": "I keep more in touch with the vix.. it's still higher then pre-covid And historical levels.. I think we gotta get to 13-15 in the vix for calmer waters.. bond yields have been going down for years", "score": 3, "replies": []}, {"body": "Can you explain this for the smooth brains? Why do we get negative real rates when the Fed is planning to raise interest rates?", "score": 3, "replies": [{"body": "https://data.nasdaq.com/data/USTREASURY/REALYIELD-treasury-real-yield-curve-rates", "score": 1, "replies": []}]}, {"body": "Wait wait wait wait. Did OP just posted a bullish post, and not a \"the mother of all crashes is nigh\" ?\n\nWe've come a long way, wow", "score": 0, "replies": []}]}
{"title": "Inverted Yield Curve Question", "selftext": "An inverted yield curve is supposed to be a sign of a coming recession; but which specific bonds need to invert?\n\nAccording to statista.com the 20-yr and 30-yr bonds closed November inverted. No one is discussing this, so it must not be important. \n\n[Treasury yield curve in the United States as of November 2021](https://www.statista.com/statistics/1058454/yield-curve-usa/)\n\nCan someone please explain what constitutes a recession signaling inversion? Does it have to occur in a specific timeframe (ex. 2v10 or 10v30)? Evidently a 20v30 doesn’t count. \n\nThanks in advance!", "id": "rkgsqy", "created_utc": 1639982281.0, "score": 7, "upvote_ratio": 0.71, "num_comments": 13, "comments": [{"body": "2yr and 10 yr treasury yield is a classic conversion. That’s what I go off of, and what I was watching daily in august 2019. The rest is just headline hype, I could care less about the other inversions. The 10 yr is the basis of your standard long term commercial loan rate. The  2 yr is a good reflection of current economic outlook. That’s why I believe these two are more significant, and a more reliable indicator.", "score": 3, "replies": [{"body": "That makes sense. Sound reasoning. Thanks!", "score": 1, "replies": [{"body": "Here is the link, you are welcome:\n\nhttps://fred.stlouisfed.org/series/T10Y2Y", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Fantastic! Diving in now. Thanks!", "score": 2, "replies": []}]}, {"body": "r/AskEconomics\n\nYour answers would be 10x better", "score": -4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I think it's the 1-year and 10 years", "score": 1, "replies": []}, {"body": "Good question, I wanted to know too, so I ran the historical back test just now. See this tweet. [https://twitter.com/peterlikesFR/status/1473006661446946816?s=20](https://twitter.com/peterlikesFR/status/1473006661446946816?s=20)\n\nNot a huge difference between them. I might prefer the 10 year and 3 months.", "score": 1, "replies": []}]}
{"title": "Stocks Sink on Worries Over Omicron and the Fate of Biden’s Agenda", "selftext": "Stock futures sank Monday and global shares dropped amid a surge in Covid-19 cases and as President Joe Biden’s $2 trillion tax-and-spending package looked dead after Sen. Joe Manchin said he wouldn’t support the plan. Contracts linked to the Dow Jones Industrial Average fell 544 points, or 1.54%, S&P 500 futures declined 1.62% and Nasdaq futures were down 1.63%.\n\n***The yield on the 10-year Treasury note was at 1.371% after falling Friday to 1.401%, the lowest yield in two weeks.*** \n\nAsian shares posted steep losses and European stocks were tumbling as many countries warned they could institute fresh restrictions as the highly contagious Omicron variant of Covid-19 was quickly spreading. The Netherlands returned to full lockdown. Dr. Anthony Fauci, Biden’s chief medical advisor to Biden, said he expects coronavirus cases in the U.S. to reach record highs this winter, driven by the Omicron variant. He said he expects “significant stress” on hospital systems in some regions of the country.\n\nEconomists at Goldman Sachs cut their forecast for U.S. growth for 2022, citing Manchin’s rejection of the Biden spending bill.The Build Back Better bill’s “enactment had already looked likea close call and in light of Manchin’s comments we are adjustingour forecast to remove the assumption that BBB will become law,”Goldman’s economists wrote in a report Sunday. “A failure to pass BBB has negative growth implications.”\n\n***Oil prices fell sharply on worries that fresh Covid restrictions would reduce demand. Brent crude, the global benchmark, fell 4.1% to $70.50 a barrel, while West Texas Intermediate crude dropped 4.6% to $67.47 a barrel.***\n\nStocks fell last week on worries over a resurgence of Covid-19 and the Federal Reserve’s announcement that it would accelerate the end of its bond-buying program and its projection of three interest-rate increases next year, moves that will be made to rein in the highest inflation rates since 1982. \n\n# Here are five stocks on the move Monday:\n\n* Oracle (ORCL) could announce an acquisition of Cerner (CERN), the electronic-medical-records company, this week. The Wall Street Journal reported last week that Oracle would be buying the company in a deal that could be worth around $30 billion.\n* Nike (ticker: NKE) and Micron Technology (MU) report earnings after the closing bell Monday.\n* YouTube TV, owned by Alphabet (GOOGL), said Sunday it reached a deal with Walt Disney (DIS) to return its content to YouTube TV, including networks such as ESPN and FX, live and on-demand content.\n* Bank of Montreal agreed to acquire Bank of the West from BNP Paribas for $16.3 billion.\n\n[https://www.marketwatch.com/articles/stock-market-today-51639991918?mod=mw\\_latestnews](https://www.marketwatch.com/articles/stock-market-today-51639991918?mod=mw_latestnews)", "id": "rkl4tx", "created_utc": 1639999327.0, "score": 13, "upvote_ratio": 0.66, "num_comments": 14, "comments": [{"body": "Go BMO, keep chugging along and earning me money!\n\nAlso, watch it all be green by the end of the day...", "score": 4, "replies": []}, {"body": "Question is do I wait till tomorrow to sell? Prob have a slight correction… not that anyone knows but that’s what I am going with.", "score": 1, "replies": [{"body": "Why would you sell at this time. Prepare to buy more.", "score": 1, "replies": [{"body": "I need to reposition anyway and there are some positions I am trying to drop. If I sell now I can take the loss on taxes.", "score": 1, "replies": [{"body": "If it's for tax loss harvesting, I guess that makes sense.", "score": 1, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rkoprs", "created_utc": 1640011122.0, "score": 15, "upvote_ratio": 0.8, "num_comments": 10, "comments": [{"body": "Thanks for the well written and informed post. $UAN is my biggest position, have been invested since early 2021. I also work for a large ag producer and fertilizer prices are looking firm for 2022.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well, crop prices have not risen to where they should, so that could be one element to bring down demand. But otherwise both supply is constrained and demand currently is quite strong. European based", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "First off, not ATH. Look back at 2010-2012, which was the last time fertilizer prices were strong. Now fertilizer prices are even higher than they were then and the forward pricing is firm. \n\nSecondly, ATH in any case doesn’t mean it’s a bad time to buy a stock", "score": 2, "replies": []}]}, {"body": "Sorry, your [submission](https://www.reddit.com/r/stocks/comments/rkoprs/uan_2022_60_yield_distributions_multibagger/) in /r/stocks has been automatically removed due to Rule 3:  Low effort.\n\nIf you just want to post 1 liners or just want to know everyone's thoughts, then post a comment to our daily discussion thread which are generally stickied or [click here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+daily+discussion&restrict_sr=on&sort=new&t=all)\n\nIf you're wondering **why a stock moved** a certain way, check out [Reuters](https://www.reuters.com/), [Motley Fool](https://www.fool.com/), and **especially** [Finviz](https://finviz.com/quote.ashx?t=spy) **which aggregates the most news for almost every stock**.\n\nIf instead you're wondering what a term means, go to Investopedia.com and search for said term there.\n\nEither way come back here to repost with your findings, thanks!\n\nA list of the [rules can be found here](https://www.reddit.com/r/stocks/about/rules/), and if you're new to r/stocks please see the [wiki](https://www.reddit.com/r/stocks/wiki/index) and/or [read this post.](https://www.reddit.com/r/stocks/comments/4x1419/if_youre_new_here_read_this_post_first/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "Letting Children Pick Stocks: Week 16 Update", "selftext": "Been a while since my last update. This Omnicron bear market has put both my own and my children's portfolios through the ringer but I still don't think they're doing poorly.\n\nMy girlfriend and I started investing for our kids (7 & 1 YO), letting them pick the stocks and invest $10 per week for them. \n\n**7YO Portfolio (mostly in order of purchase): Moderna, Dcoin (can't spell it out on this sub), SPY (x2) SPYG (x2), Square, Paypal, Netflix, Tesla, Coca-Cola, Enphase Energy, McDonalds, Etsy, Chipotle, Gamestop, QQQ**\n\n**Current return: -8%**\n\nThe ETFs are my picks as we made the rules that 25% of the portfolio must be ETFs. He seems to be picking stocks with the highest 5Y returns so far. Other times we ask him what companies he likes (chipotle, mcdonalds lol). \n\n**1YO Portfolio we decided to just invest in ETFs until she's a bit older**. \n\nWe were rolling dice to pick the page and stock from that page but decided it will be better to just do ETFs until she can actually pick out her own stocks.\n\n**More details:**\n\nMy girlfriend has a 7 year old boy and we have a 1YO daughter (almost 2). I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick. The 1YO ~~rolls dice most the time lol~~ (changed to ETFs for now). We put in $10 every week to whatever they pick. 25% must be in ETFs for some stability.\n\nThey'll have access to the money once they're 18, accounts are still in our names just in case, and we don't expect to cash out enough to increase the capital gains taxes. We'll still likely be the gatekeepers for the money so they don't just blow it on hookers; more for a car, college, travel, etc.", "id": "rks8jf", "created_utc": 1640020775.0, "score": 17, "upvote_ratio": 0.75, "num_comments": 20, "comments": [{"body": "My six year old: ROBLOX! CAUSE IT'S COOL!\n\nCurrent return: We dont talk about it.", "score": 25, "replies": [{"body": "Haha yeah ours is into Roblox also. If Cocomelon was a stock I'd buy that in a heartbeat, I guess Netflix will have to do lol.", "score": 2, "replies": []}]}, {"body": "...Stealing this idea for my children", "score": 8, "replies": [{"body": "Stealing ideas from my children...", "score": 2, "replies": []}, {"body": "Haha a few people on my other posts have started trying this as well. The investments are small enough to not really matter to us but should be a decent amount over the years for them.", "score": 2, "replies": [{"body": "Also a great way to teach them about financial markets at an early age while making it fun and engaging for them. I imagine by the time they hit 18 they'll be far more financially literate than their peers which is awesome because often 18 year olds get bombarded with difficult financial decisions.\n\nProps to the great parenting my man, definitely gonna use this in a few years.", "score": 5, "replies": []}]}]}, {"body": "I'm a little confused - your 7 year old \"picked\" Enphase Energy?  SPYG?", "score": 4, "replies": [{"body": "\"I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick.\"\n\n\"The ETFs are my picks as we made the rules that 25% of the portfolio must be ETFs. \"", "score": 3, "replies": []}]}, {"body": "This intrigues me enough to be devil's advocate.\n\nI question the ability of a child to understand loss - at 7 they barely or maybe only become aware of death, let alone more abstract losses.\n\nTherefore I wonder if this is a good thing or non-issue, I highly doubt it's a negative.\n\nBut it might be good in immunizing them to acute sense of loss, like when a child doesn't get what they want they throw a tantrum or sense loss acutely.\n\nThen as adults we are never properly immunized to the losses of things like large amounts of capital.\n\nOr if that immunity will prevent them from ever learning key concepts of the market. It is the ability to sense loss and feel its sting sharply that trains habits.", "score": 4, "replies": []}, {"body": "I love this.", "score": 1, "replies": []}, {"body": "How did they even learn about Square and Enphase?", "score": 1, "replies": [{"body": "There’s a list to pick from.", "score": 1, "replies": []}]}]}
{"title": "The market hit a bottom", "selftext": "I'm pretty sure I said this last week, and today has tested it but not by much. I'm still calling us near a local bottom - not because of an expectation of January Effect, or the tax loss harvesting to go away after Decem-bear, etc.\n\nIn the below image I track unique patterns I call \"hidden-dojis\". A doji is a trading indicator that suggests indecision. Indecision is when Bears and Bulls are pretty evenly matched.\n\nThese indecisions mean one of two outcomes has to come true, either more down, or more up. And I do not believe we are facing a technical correction or a bearish market for the short term. Nothing suggests it. Financials are good, macro-economics are good, no one actually gives 2 shjts about Omicron (that's just news fear mongering).\n\nBottom line is everything is looking good for market outlook, which means the sell-off is a technical one, not a fundamental one. Call it tax loss harvesting, risk reduction, whatever, it's just traders being traders.\n\nI point to the two hidden dojis, the left side is counter trend (up in a down trend) and signifies the indecisiveness of bulls. Then we hit the center drop which was renewed bearish strength.\n\nThen we hit the counter trend hidden doji on the right side, which is down in an uptrend. And I expected to see it since I first identified this trade last week.\n\nHence last week on the same expectation I said we hit a bottom.\n\nI didn't expect it to be so dramatic (making today near the absolute bottom) but that's OK.\n\nI expected a reverse head and shoulders pattern but we are still queued for a triple bottom pattern which is simply a variant of the head and shoulders.\n\nIf we were facing a Bearish change of sentiment what we would look for is a significantly sideways (low volatility) week before Christmas, or a new lower low by Christmas or next week.\n\nIf that happens, then I think we are pretty much confirmed to be in a correction territory.\n\nBut, if tomorrow is strong. I think that'll crush the shorts and the week will finish strong or OK, and January will kick off with a bang.\n\nAnd that's the bet I'm leaning toward based on the technicals below.\n\nI use GS as a proxy, the pattern exists in SPY as well but is less \"clean\".\n\nGS, JPM and the banks look very clean as in the image below.\n\n[https://imgur.com/gallery/LsOvCzh](https://imgur.com/gallery/LsOvCzh)", "id": "rkw0wq", "created_utc": 1640031219.0, "score": 0, "upvote_ratio": 0.28, "num_comments": 10, "comments": [{"body": "What about when it’s down tomorrow?", "score": 6, "replies": [{"body": "I'd say that confirms actual bearishness.\n\nOut of some 306 iterations of SPY trading down on a monday, Tuesday is up 0.90% and the week finishes about +1%.\n\nIf we don't see that, after all this bloodbath, there are some structural problems with the market that need to be assessed.\n\nUnfortunately that can't be assessed until January. Because there's still room to bleed \"tax loss harvesting\" this week and next.\n\nSo it's a difficult time of assessment.\n\nWhat we are looking for is a strong Tuesday will basically show that the market has strength to it. Therefore a bottom.\n\nIf it's down tomorrow, we have to wait till January.\n\nIf it's up tomorrow, that's when you'd place your buys.\n\nMakes sense?\n\nLots of trading is knowing when to decide.", "score": 0, "replies": [{"body": "I’ll follow this and see how it goes. Hopefully we see some positivity tomm.", "score": 1, "replies": []}]}, {"body": "That'll make it the absolute, absolute bottom.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This is a bottom. Arr you shjtting bricks for 1 or 2%\n\nJesus", "score": -2, "replies": []}]}, {"body": "I am truly amazed at folk's confidence in investing.  Even the NBER only calls a bear market after 1-2 quarters AFTER it is done since it is so hard to predict.  Yet reddit posters who sit at home and draw some lines here and there on a graph in a fashion that has no statistical evidence to back it up have figured something out that the top economists in the country have admitted they can't do with all the MILLIONS of data points at their fingertips.", "score": 2, "replies": []}, {"body": "Buy the dip that keep on dipping.", "score": -1, "replies": []}, {"body": "If the Russell closes above 2131 it's safe for now. \n\nOr until tomorrow... lol. We'll see if it holds if it breaks down any lower it's nearly a bottomless pit for a long ways.\n\nGood luck!", "score": 1, "replies": [{"body": "The Russel made an extremely strong bottom signal....such a strong hammer I'd call it a Thors hammer.\n\nLOL.\n\nThat would mean the Russel is forming a double bottom. It could be true...depends on tomorrow's performance.", "score": 0, "replies": []}]}]}
{"title": "Markets at close: 12/20/2021", "selftext": "**Today in brief**\n\n**S&P: 4,568.02 (-52.62)(-1.14%)**\n\n**Dow: 34,932 (-433.28)(-1.23%)**\n\n**Nasdaq: 14,980.94 (-188.74)(-1.24%)**\n\nOmicron and Mr. Manchin’s rejection of Biden’s “Build Back Better” sent the market spiraling down for one of its worst days in the already Bearish December. The crude oil tumbled as well losing 6% midday and closing at 3% in the red. \n\nWSB’s favorite meme stocks were all in red for most of the day continuing the worsening December trend for the meme/growth stocks. GME was up by almost one percent at the close picking up some momentum at the end though well short on the average volume. AMC, despite opening in green following the bumper opening of Spider Man: No way home, reversed mid-morning and finally closed at 2% on the up. Another favorite of the memes, Palantir, plunged by more than 5% to close almost at its 52 week low.\n\nPandemic favorites Zoom was in green for most of the day and Chegg finished up at less than one percent, as stay at home and lockdowns were being announced in Europe and seems to be increasingly possible in this side of the Atlantic as well. \n\nCarnival Cruise Line (CCL) rose today by 3% after the Company said it expects to be profitable in the second half of 2022 despite rising Omicron cases worldwide.\n\nModerna shares were briefly up as the Pharma company’s booster shots provide better protection against Omicron by increasing the antibodies 37-fold. But along with the rest of the market the company’s shares went down in red and closed 6% down.\n\nShares of Rocket Companies (Rocket Mortgage’s parent) plunged more than 6% following the acquisition of Finance App TrueBill for $1.28 Bn. This acquisition will help the company to improve upon its image as a FinTech player and not just a mortgage company. Truebill is a finance management application that analyses spending habits, identifies inefficiencies and offers methods to improve financial health. It has 2.5 million members and is expected to add $100 million in annual recurring revenue to Rocket’s $1.3 Billion of annualized servicing fee income.", "id": "rky608", "created_utc": 1640037125.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 13, "comments": [{"body": "Hahaha CCL expects to be profitable haha.", "score": 4, "replies": []}, {"body": "The Covid news and Manchin are blips and not directly affecting today's markets. News is mostly bullshjt.\n\nMachin shooting down the BBB is a godsend. That bill intends to tax unearned gains.\n\nAnti-american to the core", "score": -2, "replies": [{"body": "covid / inflation / tapering / rate hike / BBB: all part of the same cycle", "score": 2, "replies": [{"body": "I post a lot of TA, and long before Omicron existed, back in November, I had been talking about weakness in the markets.\n\nIn the specific markets I trade, I set specific price targets - and pretty much nailed them.\n\nI time stamp everything, I can't go through a mountain of them and this site doesn't like me linking to my work. But you can take me at my word or search my own posts....things like LCID to $38.\n\nOr RKLB sub-$13.\n\nOr AMD to $129 (and it almost hit $129 a few days ago).\n\nLet me emphasize AMD, I predicted that back in November.\n\nSo you tell me....\n\nDid Omicron tank the market back before it existed such that I nailed price targets back in November?", "score": 1, "replies": [{"body": "Not offending ur market intelligence/acumen in any way.. but Omicron, lockdowns, school closings, work from home, hospitals getting filled, QE’s, inflation…. They all matter!", "score": 2, "replies": [{"body": "What I am saying is they don't matter at all. The hard truth is the only times I failed miserably in my trade is when I traded on news.\n\nI have my reasons for thinking TA works, but it does work, not perfectly, but pretty well.\n\nThe fact I can list off just a few recent price predictions that a month ago NO ONE saw coming....kinda suggests that it's not just luck.\n\nThere's always an element of luck in the markets because it's man vs. man, the most dangerous game, it's a version of war without bullets. And therefore there are surprises.\n\nBut news is not one of them...I've gotten to the point where news becomes a non-entity. And every time I tune it out I see clearly.\n\nNot knocking your market report, I hope you get some good upvotes and conversations in here - I hope I'm making it interesting. I like to be contrarian.", "score": -1, "replies": [{"body": "If you are so good at technical analysis tell me whats going to happen with nvda short and long term.", "score": 1, "replies": [{"body": "I don't track it - I think it'll implode from its fundamentals. There's a chance it's ready for short-term accumulation and then run some more.\n\nI think 2022 is going to be a really strong bull year that will make people's noses bleed.\n\nFollowed by a 2023 stall and then we'll hit correction territory where you'd really want to look for exit strategies.\n\nNVDA will likely implode 2023 - 2024.\n\nIt'll ride the bull market until then, its valuations are insanely unsustainable. Fundamentals will catch up with it someday.", "score": 0, "replies": []}, {"body": "Sorry - I had heard its fundamentals are unsustainable (high valuation) but it seems to only be 2x priced over MSFT (and I think of MSFT as the sustainable valuator).\n\nSo it's not THAT over valued.\n\nNear term it looks like accumulation is setting in. Expect it for a few months. I think mega-tech in general will trade somewhat sideways into Q1.\n\nSmall cap tech is more volatile, I expect better plays there.", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "Micron Shares Rise On Revenue Beat - great news for the industry?", "selftext": ">Micron Technology Inc (NASDAQ:MU) announced earnings per share of $2.16 on revenue of $7.69 billion. Analysts anticipated EPS of $2.10 on revenue of $7.68 billion.  \n>  \n>Looking ahead, the company sees revenue for the next quarter coming in at between $7.3 billion to $7.7 billion, with EPS coming in between $1.85 and $2.05.\n\nThe company did well despite all the worries. Shares are up \\~6.5% in after hours. Do you expect this to drag AMD and NVDA up tomorrow?", "id": "rky663", "created_utc": 1640037138.0, "score": 28, "upvote_ratio": 0.86, "num_comments": 14, "comments": [{"body": "Tbh I don’t really see why it would. Might get a small push at open, but it’s probably falling off again till eow", "score": 8, "replies": []}, {"body": "anyone bearish on semiconductors is a FOOL", "score": 7, "replies": []}, {"body": "What does Micron have to do with NVDA or AMD? Micron is a memory company, not even remotely related to the other two.", "score": -1, "replies": [{"body": "chips, semiconductors, electronics....while not directly related, the news could be an indicator of industry and segment health.", "score": 5, "replies": []}, {"body": "Charts disagree 😂", "score": 6, "replies": []}, {"body": "Don’t fool yourself they are related. They are all in the same boat together.\n\nNo chips, no products, no revenue.", "score": 1, "replies": [{"body": "Do you even know what products Micron makes? Lol.", "score": -1, "replies": [{"body": "Is it electrical?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Type of weed?", "score": 2, "replies": []}]}]}, {"body": "Omicron vaccine?", "score": 1, "replies": []}]}]}, {"body": "They all are in the cloud services business though", "score": 1, "replies": []}]}]}
{"title": "Wedbush - Outlook For Apple (AAPL) and Tesla (TSLA) In 2022", "selftext": "", "id": "rkzyla", "created_utc": 1640042211.0, "score": 36, "upvote_ratio": 0.93, "num_comments": 10, "comments": [{"body": "The year-end sell-off in #Tesla is just noise, says Wedbush's Dan Ives. “I think this is a stock that’s going to resume its upward move. $1,400’s our base case, bull case $1800.”", "score": 30, "replies": [{"body": "The fact that AAPL kept hitting ath on the strength of wedbush upgrade, despite repeated warning on supply constraint, bodes well for Tesla.\n\n$1800/1.8T mc is very conservative. I bet he will raise TSLA pt again after q42021 earnings release and updated giga Austin Berlin production status.\n\nMy estimate for tsla 20/22 is 3T mc before year end.", "score": 4, "replies": [{"body": "> My estimate for tsla 20/22 is 3T mc before year end.\n\n20/22 ?   3T before the end of 2022?  I think it will be closer to 2T.  I'm pretty sure Elon doesn't want it to rise too fast, for the ESPP and being able to entice new hires, so he may tweet something destablizing to try to halt a run above $1500", "score": 4, "replies": [{"body": "\n\n\n$1500 is when split 2 comes in, most likely 10 to 1. Elon may complain about the price being too high again like he did right before split 1 but the momentum from the split,  as well as continued exponential profit growth and new giga factories/4680 productions+ continued fsd improvement will get the stock to double from there in no time. Also importantly, the rise of omicron will keep yield low and the Fed dovish when the push comes to shove. COVID isn't going anywhere anytime soon and neither will super loose monetary policy.\n\n\nAlready wall st is singing praise for zoom again. 20/22 will play out a whole lot like 20/20.", "score": 0, "replies": [{"body": "Thats a lot of speculation, but I hope you're right.  Also, why the fuck do you put a / in the middle of your years? It's confusing as hell.  Just write it normal for god's sake, I dont care where you're from.", "score": 2, "replies": [{"body": "Are you not familiar with the American expression hindsight is 20/20? And that is what the year 2020 turned out to be for investors. The emergence of COVID looked like it was going to unleash major economic depression and stock market collapse, instead it has led to an epic bull market especially for tech companies. Those who sold at onset of COVID and didn't get back in missed out big time.\n\nWhen vaccines became widely available in 2021 many people thought COVID was over and the market will return to normal complete with rising yield and sector rotation out of tech. Well as it turned out COVID is more like a catch 22, a paradoxical situation from which the global economy cannot escape and where you get looped back in with a new variant just when you thought it was almost over. \n\nIn the same vein the year 20/22 will be a redux of 20/20. And for that matter We are stuck in COVID mode for the duration of the 20/20s. This macro trade wind will expedite enormous amount of wealth creations in well positioned tech companies and crypto currencies. So position your investments accordingly.", "score": -2, "replies": []}]}]}]}]}, {"body": "These are 1 year PTs?", "score": 1, "replies": [{"body": "Always when not specified", "score": 3, "replies": [{"body": "Awesome thanks, just wanted to make sure", "score": 2, "replies": []}]}]}, {"body": "Tesla is likely to have an awesome 2022.", "score": 1, "replies": []}]}]}
{"title": "What would I get assigned if I sold cash secured puts on VIX and the option contract expired ITM?", "selftext": "[deleted]", "id": "rkzci9", "created_utc": 1640040452.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 17, "comments": [{"body": "They are cash settled based on the settlement price at expiration.  So if you sold 1 18 put and at expiration the VIX settlement price was 18 or above, the contract would go out worthless and you would make the entire amount you sold the put for.  If it settled at 17.95, it would be as though you bought the contract back for .05.", "score": 21, "replies": []}, {"body": "It is a cash settled option. That means at expiration cash equal to the intrinsic value of option will be debited from your account.", "score": 7, "replies": []}, {"body": "Nothing,  Indexes are cash settled.", "score": 7, "replies": []}, {"body": "First thing: check to see if option is physical settle or cash settle.", "score": 12, "replies": [{"body": "You really don’t want to take physical delivery of the fear index", "score": 43, "replies": [{"body": "Scarecrow from batman turns up at your door with an auditor from the IRS...", "score": 25, "replies": [{"body": "Beat me to it", "score": 1, "replies": []}]}, {"body": "Damn it to hell. I gave away my freebie way too early today.", "score": 2, "replies": []}]}]}, {"body": "Cash settled", "score": 8, "replies": []}, {"body": "Cash", "score": 4, "replies": []}, {"body": "OP you shouldnt be trading stuff you don't understand.  A quick Google search of VIX settlement would have given you this info.  Don't be lazy.", "score": 3, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "tbf OP is a lazy POS who could have typed this exact question into google and gotten years of learning material. But they dont actually want to learn. They expect to be taught", "score": -8, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Asking here is a good way to get better and more efficient responses than Googling. OP didn’t ask, “should my fridge be on fire?” It was’t a stupid question.", "score": 7, "replies": []}]}, {"body": "tbf, it's harder to ask reddit than to ask Google. And it takes longer to get a response. So maybe OP is just dumb.", "score": -1, "replies": []}]}]}]}, {"body": "A loss", "score": 0, "replies": []}, {"body": "at expiration often extended 1.5hr after closing.  Not sure about this week. 12/23", "score": 1, "replies": []}]}
{"title": "What’s everyone’s price predictions for $TSLA for YE ‘21, ‘22, ‘25 and ‘30?", "selftext": "What’s everyone’s price predictions for $TSLA for YE ‘21, ‘22, ‘25 and ‘30?", "id": "rklt3v", "created_utc": 1640001838.0, "score": 13, "upvote_ratio": 0.79, "num_comments": 19, "comments": [{"body": "Ask Jim cramer, reverse it", "score": 9, "replies": [{"body": "This is the way lol", "score": 3, "replies": []}, {"body": "What he said…", "score": 2, "replies": []}]}, {"body": "21 : 900 / 22: 1200 / 25: 2500 / 30:10000", "score": 14, "replies": [{"body": "we finna end 21 at 1200 tho", "score": 3, "replies": []}]}, {"body": "Balls deep 1000/1600/5000/12000", "score": 12, "replies": []}, {"body": "up.  Way up.", "score": 5, "replies": []}, {"body": "First to the moon, then to Mars!!!  🚀", "score": 3, "replies": []}, {"body": "My price targets for 2021 was actually 900 and when it hit 1200 I was like offffffffff. So we should take a step bk and relax because Tesla will always retrace after parabolic moves. I think we stay above 900 through year end and 2022 I definitely think we will end 1400-1500. Once initial ramps are done with Austin and Berlin the profits will just be mouth watering. Plus cybertruck initial deliveries and 25k model possibly being revealed w/ 4680s in volume production it's hard not to head into 2022 with ur head up high. Investment grade rating is also coming. If we were at 1200 now the ceiling to go higher would be a lot less as too much good news is being priced in. The fact that we are at 900 again is not bad at all and honestly washes the sellers and the buyers will return. Just imagine if u were shorting Tesla now. You'd probably want to cover as the move down has pretty much been done so now you'd either be neutral or go long.", "score": 3, "replies": []}, {"body": "$3K 2022", "score": 2, "replies": []}, {"body": "800 600 400 200 150", "score": 0, "replies": []}, {"body": "Depends on how long time it takes for the bubble to burst, in 2025 the value is set by PE so probably a fraction of its peak", "score": 0, "replies": []}, {"body": "Breaking news \n\nTesla is using 4 year old batteries in new cars while raising purchase prices and not being transparent to customers about battery age.  Scathing comments flood the web \n\nVery very bearish if it’s true", "score": -4, "replies": []}, {"body": "Staying sideway for 6 months, then $1100", "score": -2, "replies": [{"body": "😂", "score": 2, "replies": []}]}, {"body": "Right now who knows. Was hoping profit from one share would pay my property taxes this month. Not looking good.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "If all goes well:\n\n2022 to the moon\n\n2030 to Mars", "score": 1, "replies": []}]}
