{"title": "Apple stock", "selftext": "I have about 20k invested in apple and I can't stop thinking about investing much much more into it....", "id": "rbvixx", "created_utc": 1638982341.0, "score": 11, "upvote_ratio": 0.87, "num_comments": 18, "comments": [{"body": "Apple will continue to go up. $200 per share  before year end!", "score": 9, "replies": [{"body": "My guess is by New years 2022 we will be at $200 / share.\n\nMy plan is to hold for a few years till we are $600+ / share and then figure out what I wanna do next", "score": 1, "replies": [{"body": "600 in a few years? What??", "score": 2, "replies": []}]}]}, {"body": "Be happy for every drop apple has. It’s the stock for thirty years long.", "score": 4, "replies": []}, {"body": "Keep compounding $AAPL", "score": 4, "replies": []}, {"body": "Same here but I started buying FTEC etf who’s top 2 holdings 38% are Apple and Microsoft", "score": 3, "replies": []}, {"body": "Keep investing in APPL. Consider MSFT as well. My company spends $300k a year in licensing. There are companies with 20 times the IT footprint we have. Do the math.", "score": 3, "replies": [{"body": "This 👆🏻", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "What's a CPI", "score": 1, "replies": [{"body": ">I’d wait for CPI’s to be announced friday and there will probably be a nice dip for you to buy in at.\n\nConsumer Price Index (CPI) report", "score": 2, "replies": [{"body": "Thanks, why would a CPI announcement yield a dip? Forgive my naivety.", "score": 1, "replies": [{"body": "Read the room.  You think its going to be good news?\n\n&#x200B;\n\nInflation, she is happening...", "score": 1, "replies": [{"body": "I thought when inflation happens, assets become more expensive? If stocks are assets, shouldn't they become more expensive?", "score": 1, "replies": [{"body": "The market will react to bad news.\n\n&#x200B;\n\nThere is definitely bad news incoming.", "score": 1, "replies": [{"body": "How did it go?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I hope you read this - we hit an ATH after CPI. No point trying to time an AAPL investment.", "score": 1, "replies": []}, {"body": "This didn’t age well 😆", "score": 1, "replies": []}]}, {"body": "Set an amount aside to invest each month. You will not regret it in the long term", "score": 2, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rbysn6", "created_utc": 1638991313.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 14, "comments": [{"body": "Can you clarify?  It sounds like you exited a position on APPL and then reentered at the same strike?", "score": 1, "replies": []}, {"body": "I would get used to examining what you would consider losing on every trade (whether percentage or dollar figure) and use that to form your profit targets. Since you’re at the buying options phase, the dollar figures will vary wildly on every trade so I would consider using a percent loss/win for now.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Are you scalping moves is that the strategy?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "The fact you’re practicing before trading live is great news and I am very happy to hear about your successes so far. I started options trading in 2017 and I started with long options just like you are doing. The road to being a consistently profitable trader is bumpy and can get discouraging. \n\nThere is nothing consistent with theta. I try and show everyone that what you are trading is actually implied volatility. When you buy a 170$ call on AAPL for 7.50 which puts the break even at 177.50 The extrinsic value is the “estimated” move. When theses are months away that extrinsic value is higher because they are estimating that to some extent that options could be valued at 7.50 at expiration. As more information comes into the market, they adjust that extrinsic value down which will give your long call a drag- you can see this increasing the negative theta too. You basically are saying when you place that trade you think the price of the underlying will be at least 177.51 at expiration. \n\nConsider elite directional traders are right 30% of the time. When you plan your profit target based off your max loss, consider over the long run you may be right 25% of the time. If the average call you buy is 1000 and you have a profit target of 20%, your acceptable loss will be 5% to break even. \n\nSorry for the rant.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I apologize for coming off as hostile. I work with a few traders and it is always hardest for me to type out my thoughts so I use Reddit for practice, but thank you for letting me know, I will work on that some more. \n\nDirectional trading offers a lot of opportunity and it’s a good place to start. I was only trying to instill the principals of using your max loss to determine your profit targets on every trade. As you progress through the various stages, your position sizes start to increase and it becomes very important to plan everything based on your maximum loss - so I like to tell new traders to start planning trades around that number as opposed to the profit. You’re already on the right path by paper trading and by asking questions - I wouldn’t worry about what strategy you should start with, I would start to journal every trade you do, mess around with different parameters like how long you want to be in the trade, make the trade on multiple expirations to see how the Greeks affect your positions over time. And practice taking different profit targets, start off with a 2-1 - “im going to enter this trade for a profit target of 200 but if im wrong, I will exit at a 100 dollar loss”. If you have a high win rate, increase 3-1 and so on. Good luck trading.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Lol- see? I’m going to add “terrible at reading” to my list of things to work on. Yeah, people forget what it was like to start and feel brand new to the whole thing. I don’t get it, like they are afraid if other people come in then they won’t make money or something. Really backwards. It’s expensive but SMB training has an Options Foundation program, I’ve been in classes with some of the participants and I was jealous I didn’t know about it when I was developing the essential skills. I was told that 70% of options traders who put in the time to learn and develop themselves become profitable traders, the hard part is showing up.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "So a few things:\n\n1) theta doesn’t usually really affect you till 30-45 dte so if it’s actually a long position several months out, you have wiggle room to ignore theta till 30-45 dte. For a better understanding of all that, follow the trades at r/thetagang \n\n2) if you’re not trying to day trade then why did you sell same day and then immediately need to jump back in? Btw, I read your other replies so this a rhetorical question for you to consider.\n\n3) if you’re only following a few tickers and are not trying to day trade then 25% is not necessarily good if you’re pretty confident that you can make it to 50% if you just waited a few more days and you’re not feeling the effects of theta bc your position is long. You’d need to look at your strategy to decide. For example, I’m evaluating my performance by month so I trade monthlies and am looking for a 45-65% gain per trade and trying to avg $2k gains on a $30k account per month. \n\n4) not sure how you’re evaluating your positions but let’s say you’re looking at MACD and RSI correlations and you’re confident that your ticker is alternating every month from bearish to bullish. You then decide that you’re going to alternate from puts to calls accordingly. To hedge against risk while still maximizing gains you need to be holding onto your position for more than a few days if you’re seeing a regular bell chart formation for the month. You should NOT be buying and selling daily if the charts are indicating a steady rise followed by a steady fall in price over the course of 1-2 months.", "score": 1, "replies": []}]}
{"title": "AAPL", "selftext": "Is appl going to continue trending up through the end of the week? Currently sitting on a 12/10 Call.", "id": "rbze6b", "created_utc": 1638993035.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 17, "comments": [{"body": "I’d take the money and run", "score": 10, "replies": []}, {"body": "Are you asking for someone to predict the future?? I’d love to know as well if it’ll go up, I’ll buy all the shares if it’s a guarantee up.", "score": 10, "replies": []}, {"body": "Price prediction is at least $590 by EOW", "score": 9, "replies": [{"body": "🤑You swapped a digit", "score": 2, "replies": [{"body": "$950?", "score": 4, "replies": []}]}]}, {"body": "Have 177.5 calls 12/10...hoping it gets there by Friday :-)", "score": 4, "replies": []}, {"body": "Article literally just came out right now, the epic games antitrust ruling was paused, this delays apple having to add alternative payments to the App Store. Could be bullish.", "score": 3, "replies": []}, {"body": "could go up. could go down. Will def go right. If you have a crystal ball and know how it'll end the week I can make a ton of money on that knowledge.", "score": 3, "replies": []}, {"body": "Maybe", "score": 1, "replies": []}, {"body": "Potentially", "score": 1, "replies": []}, {"body": "Perhaps", "score": 1, "replies": []}, {"body": "Possibly", "score": 1, "replies": []}, {"body": "my crystal ball says..........it's going to rain on Friday, somewhere on earth. 100% certainty.", "score": 1, "replies": [{"body": "can i borrow your crystal ball for the power ball numbers? it’s way easier to get rich quick like that.", "score": 1, "replies": [{"body": "it says every number selected will be greater than 0 and less than 70, 100% certainty.  good luck!", "score": 1, "replies": []}]}]}, {"body": "What strike price did you buy in at?", "score": 1, "replies": []}, {"body": "December being green, I am going for a PUT", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rbhm6u", "created_utc": 1638934481.0, "score": 15, "upvote_ratio": 0.86, "num_comments": 19, "comments": [{"body": "I’ve been long from the low teens and plan to stay long.", "score": 5, "replies": []}, {"body": "I have a high conviction for this company. I feel the demand for digitizing real life places is going to increase. They also already have an established customer base within real estate. The possible partnership with Meta is great too, and means they have connections in high places. If one of the largest companies on the planet likes what you do, you must be doing something right. \n\nI own 200 shares and will be looking to add more.", "score": 4, "replies": []}, {"body": "People are buying site unseen, so this technology will enable ease of viewing and closing, especially for first-time buyers…there’s an AR/VR play there, too. I like this stock for the long term, but also as a short play during all these damn variants and fear-mongering.", "score": 3, "replies": []}, {"body": "As lidar cameras and software become better (and they are) what is their moat? They’re early to the party, but I know realtors and builders who would quickly flee from them the moment there is a cheaper option. Their moat will get smaller over time, no?", "score": 2, "replies": [{"body": "LiDAR cameras get better - they will just partner up with the developer and introduce it as matterport ready. And now matterport users can have better camera tech.\n\nSoftware better - matterport by far is the biggest player among digital twin spatial scan by a margin. None of its competitors came close. And further matterport releases its API and allow other commercial partners to develop software on top of its solution. \n\nThey are by far the best. And even if the solution were cheaper, many of us would have been tied down into their ecosystem. It’s crazy how I can simply do a dollhouse of my house simply by taking 2d scans.", "score": 0, "replies": []}]}, {"body": "They're a walled garden and nickle and dime customers, and you can't get the actual data froma. scan, only what their system creates, so from a meta creation standpoint it's pretty useless. I was a VR developer competing with them.", "score": 5, "replies": [{"body": "In your opinion what are good companies to look at for meta creation?", "score": 1, "replies": [{"body": "I mean these days you'll want the actual scan data - colorized point clouds - I think 6d.ai has some really good software that compares and can capture on mobile - really smart people there. Matterport is really polished results but without access to the data - you can't do much - although that may have changed in the last year or so. Other than that - photogrammetry/drones can capture large terrain quickly with something like Autodesk ReCap. Good luck!", "score": 1, "replies": []}]}]}, {"body": "Bought at 18 sold entire position at 30. Will buy again if it gets back to 20. Selling puts for now", "score": 4, "replies": [{"body": "You selling naked puts?", "score": 1, "replies": []}]}, {"body": "It seems highly unlikely that there will be a big market for using an expensive site-scanning service to digitize rooms for use in FB's VR adville.\n\nIt is just too easy to measure a room and re-create it in any CAD program, and convert it to Pixar's Universal Scene Description format.", "score": 5, "replies": [{"body": "Disagree. I work with CAD on a daily basis and the effort to recreate a room for real estate use is not worth the time and effort. Site scanning is much faster and is as photo realistic to the site condition as it gets. If you are looking for rent/property, renders mean nothing vs the real life", "score": 7, "replies": [{"body": "If you're looking to rent property, a video walkthrough is better. Real life. The VR is the render.  Right now, most rentals don't even have a video walkthrough, they have photos and a floor plan. The equipment rental is expensive, and would take up even more of their time than just doing a video. And is your use of CAD comparable to having beginners input measurements for rooms? You don't need experienced people. And they don't need to be local, you can outsource that.\n\nYou have to spend more time thinking about the use cases. In the use cases you thought of and considered, maybe a scan is better. Don't stop there! Are those use cases important to the Metaverse? Do they make a lot of money? Or would it only be a few places doing it?\n\nFor example, FB mentioned having virtual concerts. How many venues are important enough that people care about having the venue precisely and perfectly represented? A large country might have 5. And you only scan them once, now you have them scanned! Most concerts are going to be at virtual, fantasy locations.\n\nIf a store adds VR metaverse shopping, do they want the customers to file through narrow openings, or is it better to create a fantasy store, since you have more space?", "score": 3, "replies": []}]}]}, {"body": "there was a DD posted not that long ago that sold me on it\n\nbought 100 @ 13.90", "score": 2, "replies": []}]}
{"title": "EPAM is up 16% today because it's getting added to the S&P 500.", "selftext": "[Article](https://www.marketwatch.com/story/epam-systems-shares-rise-14-on-move-to-s-p-500-271638976911)\n\nI own this and I was a little confused why it jumped 8-9% after hours on no company news. It's now up over 16%.\n\nThis feels like a blind spot for indexing for me. It can't be this easy, right? Just add companies that look like they might be next and then sit back as the index-tracking ETFs have to load up. That's worth 16%? And what does it say for index performance that this run up will already be baked in to the price before the ETFs can actually buy in.\n\nI get it - I saw this happen with TSLA last year and saw how it kept running after being added so the indexers are doing just fine. In fact, VOO is beating VTI for a good while now. But it has to be *in spite* of this, right? How do indexes keep winning if they're effectively paying a 10+% premium on every new company added?", "id": "rbv07l", "created_utc": 1638980853.0, "score": 19, "upvote_ratio": 0.87, "num_comments": 17, "comments": [{"body": "Do you know what company got knocked out? That’s the one to buy", "score": 12, "replies": [{"body": "I looked lol. The opening is because KSU was acquired by Canada Pacific (no maple jockeys in our Murican index!) so I don't think it's playable.", "score": 5, "replies": []}, {"body": "$KSU… not much price movement", "score": 2, "replies": [{"body": "I can’t find the article but I read something that historically the one that gets removed drastically outperforms the one that was added over the course of the next year.", "score": 2, "replies": [{"body": "$KSU is being acquired by $CP (which is not in the index since it's a Canadian company) so that dynamic doesn't really apply here", "score": 2, "replies": []}]}]}]}, {"body": "Sure, just buy companies which will be announced for inclusion next. Easy. Just give me insider information from the SP500 committee or a crystal ball and I'll be on my way.", "score": 7, "replies": [{"body": "Look for the inclusion criteria for the S&P 500 (hint, big companies), then see which ones meet those criteria.  Then wait for companies to fall out via acquisition.  Now you've got a good candidate.", "score": 5, "replies": [{"body": "Good luck.", "score": 2, "replies": []}]}, {"body": "It's not as big a universe of candidates as you'd think, given their inclusion criteria. I was aware of this possibility with EPAM when I bought, [as was Bloomberg, apparently](https://webcache.googleusercontent.com/search?q=cache:b3WNgNfVHD8J:https://www.bloomberg.com/news/articles/2021-09-03/next-to-win-a-slot-in-s-p-500-index-maybe-match-keurig-epam+&cd=1&hl=en&ct=clnk&gl=us). Two of the three stocks in their headline are now in and the third, Keurig Dr. Pepper, should be considered a candidate for future inclusion. [FactSet](https://insight.factset.com/through-the-looking-glass-predicting-sp-500-constituent-changes) - (another candidate, btw) puts out lists of potential stocks for inclusion and brags about 76% accuracy. Of course, these would still have to be stocks you'd otherwise want to own.\n\nEPAM getting in isn't what surprises me - the stock jumping 16% at the news is. How was this possibility not priced in already?", "score": 3, "replies": [{"body": "\"There are currently 20 such companies big enough for the S&P 500. \" And then they go on to mention 10 good candidates, with EPAM being one of them. So what's the trade here: invest in all those candidates in equal proportions  and hope the gains from the one or two that get included outweigh the variations from the others that were candidates and not included? \n\nI'm struggling to find the consistent edge here without hindsight bias. \n\nHow could something be priced in when it is not public information, until they announce the inclusion and it becomes public information? It was a possible candidate out of many. The big jump is probably largely attributed to people buying-in to frontrun the funds that will have to buy EPAM eventually.", "score": 3, "replies": [{"body": "I only count 9 whose chances were taken seriously in that article. IAC isn't yet big enough for inclusion and the no-no company was cited as a long-shot due to volatility and finances.\n\nOf the 9, three are now in (MTCH, EPAM, BRO) three months later. Mind you, only 4 companies have been added in that time, and that article listed 3 of them. MTCH apparently jumped 11% in September when their inclusion was announced, while BRO was more muted.\n\nThat leaves 6 others: KDP, CSGP, GGG, CPT, NDSN, FDS and I'd guess a few of these will get in within months assuming they stay big enough when the next slot opens up.\n\nThat's consistent with what FactSet advertises. They straight-up put out a \"Prediction Signal\" of potential inclusions and have been 60% accurate (inclusion within 6 months) since 2018. That basket of stocks has apparently [doubled the S&P 500's own performance over the last two years](https://insight.factset.com/through-the-looking-glass-predicting-sp-500-constituent-changes). It seems like the S&P has created a cottage industry for would-be front-runners. It surprises me that the market wouldn't have arbitraged away this advantage, and it also surprises me that the S&P 500 continues to outperform the broader US market anyway.", "score": 2, "replies": []}, {"body": "Someone needs to make an ETF stocks that are about to get added to the big ETFs. Bam million dollar idea", "score": 2, "replies": []}]}]}]}, {"body": "$3 billion revenue, $1 billion gross profit, $0.4 billion earnings, doubles every 3 years. Should grow into its $40 billion valuation in about 10 years if all goes well.", "score": 3, "replies": [{"body": "Yeah, the valuation makes no sense to me as well. I've been promoting EPAM here like a year ago but even at that time it was a bit overvalued. I'm not sure why outsourcing companies do so well. EPAM's \"competitor\" is GDYN, they grew even larger, +220% YTD", "score": 3, "replies": []}]}, {"body": "[Read this](https://www.investopedia.com/terms/s/spphenomenon.asp)", "score": 2, "replies": []}, {"body": "Damn. I knew I should be holding both. $DAVA will get there.", "score": 2, "replies": []}]}
{"title": "Inside Tesla’s Gigafactory Shanghai Body in White.", "selftext": "", "id": "rbp7w6", "created_utc": 1638962591.0, "score": 34, "upvote_ratio": 0.95, "num_comments": 14, "comments": [{"body": "Other manufacturers should be shaking in their boots.", "score": 9, "replies": []}, {"body": "I wish they didn't increased the speed.. Much clearer to understand how fast production is going", "score": 6, "replies": []}, {"body": "What was that robot doing that lifted the casting up, and then put it in the ceiling?", "score": 3, "replies": [{"body": "Isn’t the factory multi floor? Not sure about that, but it seems to me the body is just sent to the next stage", "score": 2, "replies": []}, {"body": "This is the \"output\" from the giga press. The ceiling has the conveyor belt that takes the cast to the next step. In the next scene in the video you can see another part of the factory with a conveyor belt in the ceiling with castings that just have arrived and are waiting to be picked up by the robot for merging with the rest of the car bodies.", "score": 2, "replies": []}, {"body": "Mega casting", "score": 1, "replies": [{"body": "yeah, but why was it putting it in the ceiling??", "score": 2, "replies": [{"body": "no idea, cooling, waiting for some next step?", "score": 1, "replies": []}]}]}, {"body": "Factory has multi levels. Parts can be worked on in lower level, then lifted to higher floor to mate with parts that are progressing on the upper level.", "score": 1, "replies": []}]}, {"body": "Holy shit that gave me shivers. Epic.", "score": 2, "replies": []}, {"body": "One of the newbie robots is saying “hey, where will I put this?” 😂", "score": 1, "replies": []}, {"body": "So fucking cool 😎", "score": 1, "replies": []}]}
{"title": "Tesla allows drivers to play video games in moving cars, raising safety concerns", "selftext": "", "id": "rbua1s", "created_utc": 1638978805.0, "score": 0, "upvote_ratio": 0.23, "num_comments": 14, "comments": [{"body": "[removed]", "score": 23, "replies": [{"body": "Like they can’t use their phones or tablets while driving anyway. BS.", "score": 9, "replies": []}]}, {"body": "FTA:  \n\"A notification asks the player to confirm they aren’t the driver before launching the game...\"  \n\n\nOK, so this is for passengers? Great.", "score": 15, "replies": []}, {"body": "It's almost asif the driver has some responsibility..", "score": 9, "replies": []}, {"body": "Has this always been the case? I swear I have tried while the car was in drive and it didn’t work. Hopefully this is in anticipation of a proper Tesla Arcade using the new GPU in S/X (maybe soon to be 3/Y)?", "score": 3, "replies": [{"body": "You can play like 3 games while the “passenger” solitaire and 2 other games but they don’t require a controller or anything like that", "score": 3, "replies": [{"body": "Ah I see. Technically Tesla could check for this with the cabin camera. Maybe that’s the answer for now.", "score": 2, "replies": [{"body": "Im pretty sure they already do. Fastest way I’ve had the car tell me to put my hands on the wheel was while I was messing with the screen. That and looking out the window to the left, it didn’t like that at all", "score": 2, "replies": []}]}]}]}, {"body": "Ive been able to do this since I bought my model 3 three years ago. This isnt new. It asks if you are the passenger.", "score": 3, "replies": [{"body": "Then Tesla is well over 3 decades behind technologically because Michael Knight was able to play blackjack vs KITT in S2E1: \"Goliath: Part 1.\" That was way back in 1983.\n\nBetter sell TSLA now, bag holders!", "score": 3, "replies": []}]}, {"body": "I had a loaner model 3 a few weeks back that allowed one one of the games to be played while driving, but it had to confirm that the passenger was playing.\n\nI knows Waze uses a similar pattern in its app.  If the devices senses its moving, then it has the user attest to being a passenger.\n\nI am sure some idiot drivers will try and play, but those same idiots were probably, texting, playing games, or watching videos on their phones anyhow.  Autopilot has made it abundantly obvious to me (since I am able to observe surroundings easier) exactly how many people play on their phones and dont even look at the road when they are driving.  It's insane.", "score": 3, "replies": []}, {"body": "![gif](giphy|lNL2Sc1opsLG4av4r7|downsized)", "score": 1, "replies": []}, {"body": "Not a fan of this decision. Why throw fuel onto the FSD \"safety\" fire? A passenger can play a game on their phone or tablet if they really need the entertainment.\n\nThis feels like Elon's ego poking the bear in charge of ADAS safety.", "score": -6, "replies": [{"body": "This has nothing to do with FSD.  If you are playing games and not looking at the road, while using FSD, the car will disable FSD.\n\nThis is a hit piece trying to create outrage for a feature that’s been available for years and probably will get more usage after owners read these articles.", "score": 1, "replies": []}]}]}
{"title": "Looking for some feedback on an application I have been building <3", "selftext": "Hey all, I’d love to get some feedback on an application I am building. I posted a while back on some early prototypes of what I've been poking at off and on for the past year or so but recently I have been spending a lot more time working on it with the goal of having a commercial offering. However, before I go too far and invest too much effort in that idea I had hoped to gather a bit of feedback regarding its current state. \n\nThe elevator pitch is effectively that it’s a desktop application for doing market research. It pulls data from free resources (so you wouldn’t need to pay extra to get data feeds) but also has the ability to ingest data from a number of subscription services (namely Tiingo and FMP since I use them). If you have an account with FMP, for example, and supply an API key, then the quarterly report data will be much more organized than if you use the SEC data that is pulled down (because… the SEC) but you can still have usable quarterly reports data without paying for FMP.\n\nFor data nerds, everything is stored in a database so it is accessible if you want to pull data out yourself. By default data is stored using SQLite but for those folks who want to run their own database, such as Postgres, it supports that too. In addition it has a minimal-but-growing HTTP API for extracting data as CSV or JSON. This makes it easy to write some R or Python externally but not have to fight with downloading data and unstructured garbage (it's done that for you already!)\n\nI have attached a few screenshots to go with this post but as of right now the feature set it has, which I use daily, is the following:\n\n* Newsfeed ingestion\n   * Pulls down all content from the web and then presents it in textual form by extracting content using NLP\n   * Extracts ticker symbols (using a combination of fuzzy matching and straight matches — i.e will treat “Microsoft” and “MSFT” in any given article as mapping to MSFT)\n   * PDF reader for PDF data (like SEC filings)\n   * Google, Yahoo, Tiingo\\*, Nasdaq News, SEC feeds\n   * Can also ingest arbitrary RSS feeds\n* Options scanner\n   * Filter based on a variety of criteria such as DTE, greeks, and return on capital\n* PnL modeling\n* Social data feeds\n   * Reddit post crawling, along with symbol extraction\n   * Social trend visualizations / analysis\n   * See the most talked about symbols in various subreddits\n   * See trends over time\n* Equity research\n   * Fundamentals\n   * Quarterly report data\n   * Pre-filtered news and social views\n* Treasury data\n   * Yield curves (current and historical)\n   * Yields over time\n* NASDAQ database charting\n   * Full-text search of datasets available\n   * Chart one or more dataset for comparison\n   * Able to support subscription datasets but currently only pulls free ones\n* Earnings calendar\n* Basic watchlist\n\nIf you have stuck it out this far, thanks! I am not quite ready for people to use it, hopefully in the next week or so, and I would love to have some willing beta testers - I will gladly give free licenses to people who help out. The app is, by design, multi-platform so it will run on macOS (x86 and M1), Windows and Linux, so anyone should be able to run it. \n\nPlanned future features that exist in a rough form but are not ready for people to use:\n\n* Forex market data / news / etc.\n* Crypto market bits\n* Backtesting / strategy building\n* Custom charting scripts for creating strategies\n* Additional third-party data sources\n* Custom dashboards and research views\n* More social feeds (Twitter at a minimum)\n* Built-in predictive models using ML (it already has some of this, namely HMM prediction, but I have been experimenting with news / market correlation and other things which would likely make their way in here.)\n\n&#x200B;\n\nhttps://preview.redd.it/jk6ius5l48481.png?width=3248&format=png&auto=webp&s=20192bfa43f66fc603140003342afa6f78aab516\n\nhttps://preview.redd.it/kmzju0sm48481.png?width=3258&format=png&auto=webp&s=139cfc02e48669745ff0195a60be9585a21efb9f\n\nhttps://preview.redd.it/4vw61a6n48481.png?width=3246&format=png&auto=webp&s=aa48d827b37f9314c0214c785991849336f71d30\n\nhttps://preview.redd.it/veh3uy6o48481.png?width=3244&format=png&auto=webp&s=951859d38bf7898c8f2980a231bfce54593c0c90\n\nhttps://preview.redd.it/drcl70wo48481.png?width=3250&format=png&auto=webp&s=52f8ac0922703de2cc511bd73d0486b9bc6cce68\n\nhttps://preview.redd.it/ucy4vf7q48481.png?width=3252&format=png&auto=webp&s=0e046d1b19850e377de45885cba6bc26e7b04119\n\nhttps://preview.redd.it/nr0yiqft48481.png?width=3266&format=png&auto=webp&s=3a15470a50983a5472431366c71c3e613ec447d5\n\nhttps://preview.redd.it/kobk19xt48481.png?width=3268&format=png&auto=webp&s=5af0bad90999fa23b7b627b91d3b26cdc99c001d\n\nhttps://preview.redd.it/7eey8gvu48481.png?width=3270&format=png&auto=webp&s=cda6a8b6311cef86a992e8a87155a293664f2ed9\n\nhttps://preview.redd.it/yc5qafd258481.png?width=3256&format=png&auto=webp&s=374949dffbb54924a1b651d06627963f69196855", "id": "rbflir", "created_utc": 1638928608.0, "score": 10, "upvote_ratio": 0.86, "num_comments": 20, "comments": [{"body": "This is amazing work. I’m sure there’s a need for normalized financial data for analysis. Have 2 questions if you don’t mind:\n\n(1) With financial data needing to be always online, curious why you chose a desktop app over a web app?\n\nI’m thinking if it’s a web app there will be fewer barriers for people to try it. You’d get mobile for free even if you don’t optimize for it. There’s also search engine discoverability.\n\n(2) Also curious what was the itch that needed scratching for you to make this? Your older post mentioned it’s options analysis but it seems like the scope has expanded?", "score": 5, "replies": [{"body": "Thanks! Good questions - so the core is separate from the UI portion intentionally, in case building a web app turned out to be a better choice (or even as a parallel thing) - I don't care much for web development but I'm also pragmatic enough to know it's a possible outcome. For me there are a few reasons - (cue small-sized nerd soapbox)\n\n1. I want to have the data available offline and available on my machine in a structured way that is predictable and consistent (and I think other people would like this as well); I find that I do a lot of experimentation in R, Python or Scala worksheets and while it's entirely feasible (and easy) to ingest data in non-typesafe languages, you inevitably end up with a bunch of data that you need to keep looking at to remember exactly which data came from which provider because it's a bunch of dataframe columns with random strings which is just painful so my workflow is basically this: find a data set -> write some Scala / JVM code to ingest the data into the database -> fiddle with it using R / python -> write something in the app that is reproducible for me later. \n\n2. I am probably old and curmudgeonly but I remember a time when you would buy a piece of software and then, you know... you owned it. This is neither here nor there but I loathe the subscription model (and I know lots of others do too, like with Adobe's CC offerings, for example). Plus, as a personal engineering aside, I really don't like dealing with JavaScript and the tire-fire of an ecosystem that it comes with so for my own personal use I find writing a desktop app to be more predictable and easier in many ways than dealing with it. \n\n3. I have spent enough of my life working on services I have to manage and I am kind of tired of it (I spent a long time at Amazon and AWS) so unless there's a compelling reason, I would prefer to avoid running anything critical these days - I still cringe a little bit when I hear a pager :-) \n\nAll that said, part of why I am hoping to get feedback is exactly that -- if it turns out everyone says \"man I would totally pay for that if I could use it on the web\" then that's what I will do, but for now a desktop app suits me best!", "score": 3, "replies": [{"body": "Appreciate the reply.\n\nI agree the JS ecosystem is a dumpster fire, especially the new shiny stuff. That said you can still find success in using plain old HTML/CSS/JS looking at Optionistics [1] for example. Totally understand why you'd rather not do any hosting at this point though.\n\nNowadays people are used to renting software as opposed to owning it. Bad for customers, good for businesses (like you). Your app can justify it because I'm sure it'll need to be updated at some point to integrate with more data sources - would you give those out for free? Or pay-to-upgrade? Look at it this way, the finance guys are all about risk/reward so they'd be willing to throw $100/mo on a tool if it means they'll earn $1000 back. Don't sell yourself short is what I'm saying.\n\n[1]\n\nhttps://www.optionistics.com/", "score": 1, "replies": []}]}]}, {"body": "If you’re serious you should get a UI guy in to help with that stuff. \n\n\nStuff is too horizontal like earnings calendar. \n\n\nOptions screener is good but you need more strings. Checkout TOS for how they do theirs. I don’t have it but from what I’ve seen it’s good because you can setup your own mathematical criteria which is amazing. Like to do a custom math formula of for example delta / premium x open interest. (Nonsense formula). But that way people can do whatever they want. \n\n\nI would pay money to have access to that and for any stock and all strikes all expiry. I do that in excel (google) and it’s painstaking because I can’t scrape data for the Greeks directly. \n\n\n\nI’d really write out who your target customer is. Pros. Semi pros. Amateurs. Etc. what they are looking for and how you will deliver it. This will help you with marketing it later. \n\n\nOther random thoughts: \n\nLayering graphs on graphs. I’d like to be able to do things like see the jobs reports numbers layered over SPY. \n\n\nAlerts. Custom alerts. Price swings of xyz etc. webull alerts could be used as a basis for what types and kinds to offer. \n\n\nNews too horizontal again. Whole page needs a lot of UI work but I think you know that already. Just mentioning it as I look through. \n\n\nComparatives for company financials. So I can lookup company DICK and see it has whatever metrics.  So what. I need to first know who the competitors are which would be good to have, and then be able to compare it to direct competitors and then compare sporting goods stores as a whole to other types of stores like furniture stores, and then compare to retail stores as a whole. That would be valuable data. \n\n\nAll the stock screeners I can find aren’t very good. Either handicapped or limited or whatever. So that would be a good thing to have / add, and detail out. Allowing for custom calculated metrics would also be interesting. Like debt / gross margin or whatever. \n\n\n\nSocial trends. Sure but what sources. You’d have to include sources and saying which ones are picked up and how. If it’s just number of mentions then that’s misleading to me because TSLA will always be quite high and I’ll miss GFD or whatever stock that’s hotly being talked about. \n\n\nI don’t know how, but trying to discern the quality of it is good too. If it’s just short squeeze sub spamming PROG that means nothing to me. \n\nBut instead if it’s Twitter organically not retweeting a ticker and lots of ordnance twits and reddits then that would be more powerful of an indicator to me. \n\n\nAdding it’s % gain up / down would be good as well. Also the options availability. \n\n\nSocial trends. Filter out CC and CSP and stuff like that which are acronyms. Don’t need WTF LOL either right. And again need to discern quality and sentiment not just number of mentions. Some other built services do that so you could explore those and see how to do the same. \n\n\nCheckout market chameleon for more of the in depth options screening stuff. Hot ops. Etc. \n\n\nA big aspect of hot stocks hot ops is volume which lots of services and screeners don’t do a good job of identifying. If a stock has a huge or unusual ops uptick I’d want to know. Some notification services like unusual whales exist for this. \n\n\nYou could include options payout graphs and tables like the ops profit calcs have. Oh sorry you do have that. Needs to be prettier. Checkout OptionStrat. \n\n\nIf you make a good robust thing; especially the custom options scraping of data and custom formulas and ranking and being able to color gradient the data for easier understanding id be down to be $10/mo for the that alone.", "score": 3, "replies": [{"body": "Wow, thanks for the feedback, I really appreciate it - like I said above, since this has largely been a personal project I haven't invested more time than \"whatever works for me\" in terms of these things so I totally agree with much of what you're saying both in terms of UI and also features. \n\nWhether intentional or not I think you bring up an interesting point, and something I find to be frustrating as well, which is that there are like 15 different tools you mention to get that data. While I firmly believe in the old UNIX philosophy of \"small tools you can string together\", the biggest problem for me has been twofold: first you end up spending a bunch of money on services that you have to keep paying, and second it makes it challenging at a minimum, sometimes downright impossible, to do any correlation between them because you don't have access to the raw data. This is also why I have been building a local app with data available, to make this kind of thing possible even if it's not built into the app itself just yet.\n\nI do have some ongoing work to better calculate quality of content - I am currently building some bits that do sentiment analysis and topic modeling of the content so I can decide if, to your point, it's a meaningful discussion or just a bunch of symbol spam, which also will help with identifying symbols / subjects / topics that are just noise vs. those which are meaningful. \n\nThe last point you bring up is a big part of why I'm now looking for feedback - I have thought that it may be better to break it into smaller, more focused applications, and either sell them separately (or license them separately, whichever) based on what folks are looking for. As well as understand how much / by what method people want to pay - i.e monthly subscription or just a one-time perpetual license thing (which is my personal preference but the world doesn't always care about what my preference is :-)) \n\nI know you brought up a lot of specifics, which I think are all great points and I'd love to see if other folks echo similar things. I don't know if filling this thread with that conversation would be best but I would love to continue it, perhaps via PM is best?", "score": 1, "replies": [{"body": "No problem dude. Either pm or in the sub, either way.", "score": 1, "replies": [{"body": "Maybe I am too low on karma to send PMs ¯\\\\\\_(ツ)\\_/¯ so I guess I can just follow-up here. \n\nI did some hacking on a web-based version, with the initial features I ported being mostly options screening and future / historical volume analysis. The screener has custom views / calculated columns and gradient-based screening (right now it's just keyed according to ITM / OTM but I am going to add a custom \"target\" mechanism this weekend for coloring so you could use, say, a return-on-capital calculated column instead). \n\nYou can sign up for free at the moment -- it currently lives at https://provisio.app -- now that I have the foundational bits deployed I am working on adding (and improving) the other features to the web version as well as UI improvements. (And the inevitable performance issues that will arise with folks other than just myself using it -- I haven't done any optimization really so hopefully posting the URL in here doesn't result in being slashdotted 🤣)\n\nThere's a feedback button in the upper-right once you log in so you can report anything that's broken or could be improved.", "score": 1, "replies": []}]}]}]}, {"body": "I just wanted to say that I like the effort and say I hope you get some traction with this.  Looks like you put a lot of work into it.\n\nUnfortunately, I am just not the right customer for something like this.", "score": 2, "replies": [{"body": "Hey, no worries but thanks for the positive comments!", "score": 1, "replies": []}]}, {"body": "Where do you source your options data?", "score": 2, "replies": [{"body": "The free bits come from Yahoo - but the greeks I wrote a calculator for. I do have support for TDA if you have an account (I think maybe I forgot to mention that earlier), but setting yourself up for developer access to that as an end-user is a bit painful. They do support OAuth, I just haven't implemented a login flow that would work with it because I already have my own token and nobody else uses it at the moment -- but that would be something to add if others use it.", "score": 2, "replies": [{"body": "Cool! I'd be careful about trying to commercialize this with Yahoo's data though. They can be strict if caught.", "score": 1, "replies": []}]}]}, {"body": "Count me on beta +1", "score": 1, "replies": [{"body": "Alright! <3", "score": 2, "replies": []}]}, {"body": "Count me in for beta +1", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "Put me in for a beta tester as well I’ll split profits", "score": 1, "replies": [{"body": "LOL - just as long as we don't split losses too :D", "score": 1, "replies": []}]}, {"body": "Hi. I'm a software engineer myself, would love to get in touch about this project. Oh, and sign me up as a beta tester if you can use the help 🙂", "score": 1, "replies": [{"body": "Sure! I can send you a PM :D", "score": 1, "replies": []}]}]}
{"title": "New to this sub, thoughts on CFD?", "selftext": "Hello, what are you guys' thoughts on CFD in general?\n\nI've been using a paper account selling CFD puts on the biggest techs right now (especially AAPL and MSFT) about 10% below the current price with a strike date 30 days out. I wish I could sell at a lower strike but the Brooker (plus500) simply doesn't offer it.\n\n&#x200B;\n\nDoing this, every month, and selling about 10 to 20% of my capital has allowed me to 250% profit, and I'm set up for 300% profit by mid-December if the current trend continues.\n\nI also did it with a real account (2k) and managed to 50% profit in about 6 months, although admittedly I made a few mistakes by not following clearly defined rules and overextending myself.\n\nThe biggest risk of doing this is that, in the event of a sudden gap, there is a real chance of going into debt, possibly more than I can handle, which is why I've been lowering the positions' size almost every month to account for market swings (just this month I lost 900 bucks because I sold 325 puts on MSFT when it was at 330, which in retrospect was a big mistake since I could have sold 140 puts on AAPL was at 155, a more likely) but it's still a huge risk without the \"safety\" of selling regular puts on strong companies that allow you to wheel it in case of it going ITM. At the same time, since it can't be exercised, you could hold a losing trade till expiration and potentially recoup losses.\n\n&#x200B;\n\nThe biggest benefit is that you don't need huge capital to start making money. Even with the limited options provided by my broker (and if you know of other CFD Options that work in Europe that offer better options, I'd greatly appreciate it!), you can easily start with 2k and place 100 euros positions for a 50/98% profit depending on your parameters, which with real options could need upwards to 10 to 20k depending on the underlying, also selling far OTM Puts in the last few days is really profitable, the aforementioned 140AAPL Put is worth about 0.08 right now, and I sold a few more on it yesterday expecting a 0.04 price by next Wednesday. A trade that uses Options needs 14000 for a 4 dollars profit.\n\n&#x200B;\n\nSince I don't have enough capital to open an account on IB, the only broker I've found that works in Europe and allows for trading US stocks,  then my objective is to use CFD aggressively like I've been doing now, try to get enough capital to start selling options and then use that premium to sell CFD.\n\n&#x200B;\n\nI believe I understand how Options and CFD work well enough and given my capital if I want to play the Theta game, CFD seems to have the highest risk and highest rewards, which I'm fine with.\n\nI just want to hear your opinion, if you have sold CFD before, how far have you taken it or anything I might have missed, I'd greatly appreciate it! Cheers!", "id": "rbnb7w", "created_utc": 1638954866.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 12, "comments": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Contract for difference. Basically you just deal with dollar changes on the instrument, such as options or stocks.\n\nIf you buy, you make what ever difference it gains, and if you sell you gain what ever difference it loses. The difference is that a CFD on Options DOESN'T give access to the underlying. \n\nMeaning if you buy a CFD Call you won't be able to excersise if it goes up and buy the stock, how ever you will make what ever profit you made on the appreciation of the Option Contract. Same way, if you sell a CFD Call you don't need stocks nor will you need to provide stocks if it ever goes ITM or, like I am doing, if you sell a CFD Put you don't need the capital to buy stocks if it goes ITM.\n. You only deal with dollar changes which allows for riskier plays but obviously more profitable ones.", "score": 1, "replies": []}, {"body": "Contract for Difference?\n\nSame thing that Hwang was using during his meteoric rise and fall.", "score": 1, "replies": [{"body": "Can I heard that story, sounds interesting", "score": 1, "replies": [{"body": "Google is your friend\n\nhttps://www.ryaneyes.com/blog/risk-management-archegos/", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": []}, {"body": "So, they were over-leveraged and lost all their money? How is that any different from just overleveraging a stock?", "score": 1, "replies": [{"body": "The method he was using allowed for leverage far higher than laws will typically allow in brokerage accounts.\n\nCFDs are far more dangerous than basic stock ownership, an important point.\n\n\"Used responsibly\" they are probably fine, but it's a hard thing to balance.  It's easy to make a mistake when using the kind of leverage that is in question here.", "score": 2, "replies": [{"body": "Eh, thanks for letting me know overlevering is dangerous, I guess", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Too sketchy. Stay away.", "score": 1, "replies": [{"body": "Do you have any arguments or what makes you say that?", "score": 1, "replies": [{"body": "I looked into it recently as well and thought it was great but then learned more and that’s the conclusion I came to. \n\n\nThe broker side holds too much power in this type of trade.", "score": 1, "replies": [{"body": "I'd love it if you were more specific about it. Do you mean the broker has a higher chance of winning if you make the purchase?   \n\n\nSince I am selling, not buying, I have time on my side, it more or less functions as a normal theta play just with a different instrument, unless I'm missing something regarding all of this?", "score": 1, "replies": []}]}]}]}]}
{"title": "CCS short leg tested", "selftext": "[deleted]", "id": "rbuxji", "created_utc": 1638980643.0, "score": 5, "upvote_ratio": 0.72, "num_comments": 15, "comments": [{"body": "I’m in the same position as you with a 175/180. I’ve rolled positions early in the past but my new plan has me waiting until expiration date to capture some more decay. Rolling seems to be cheaper that way. Obviously none of us know what will happen in the future so that could backfire. Roll/close if you’re uncomfortable, wait if you don’t mind.", "score": 2, "replies": [{"body": "I appreciate the input!", "score": 1, "replies": []}]}, {"body": "It's easier to roll your spread before the short leg gets breached.  If your long leg gets breached it gets a lot more difficult to roll for a credit unless you go out more than 2 weeks.\n\n&#x200B;\n\nPersonally, I would wait and see what happens tomorrow and see if it retreats a bit.  If it doesn't I'd roll out and up.  Though, I believe rolling the short leg is breached will get you the most credit.", "score": 2, "replies": [{"body": "I ended up closing for a $120 dollar loss. Didn’t wanna have to lose sleep over it tonight lol", "score": 2, "replies": [{"body": "Sleep is good and worth more than $120. You’ll win the next one. 👍", "score": 1, "replies": []}]}]}, {"body": "What does your trading plan tell you to do?  What any of us would do doesn't matter.", "score": 2, "replies": [{"body": "Never had a short leg tested so not sure", "score": 2, "replies": [{"body": "The word \"plan\" means to prepare for something that may occur.\n\nDid you not know the short leg could be tested?  If so, what are you doing trading?\n\nIf this is how you plan and approach life, then I fear you will die alone, broke and homeless . . .", "score": -1, "replies": [{"body": "dramatic much", "score": 0, "replies": [{"body": "Stupidity should be painful . . .", "score": 4, "replies": []}]}, {"body": "Well, if it's a first time, it's good to find out right? I'm a big believer in learning through experience...", "score": 1, "replies": [{"body": "OK, you're the kid that just had to put his hand on the red hot stove burner!", "score": 0, "replies": [{"body": "exactly. then you have a nice battle scar and don't do it again...", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Depends. Are you still bearish? You can roll out to next week and layer in a higher CCS to cover some of the damage from the older CCS. You can also roll it out, or take the loss. It depends on how you want to manage the position.", "score": 1, "replies": []}, {"body": "bag mountainous literate unused ad hoc oatmeal capable dull simplistic butter\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rbihiu", "created_utc": 1638937212.0, "score": 17, "upvote_ratio": 0.9, "num_comments": 12, "comments": [{"body": "What does this exactly show? Sorry I’m a total noob when it comes to buying stocks. I have about 30 shares though of AAPL", "score": 2, "replies": [{"body": "Current AAPL shares owned, each row represents a purchase made on the specified date.", "score": 2, "replies": [{"body": "Got it. I plan to hold on and continue to buy APPL for the foreseeable future.", "score": 2, "replies": []}]}, {"body": "Around 133k gain on approx 21k investment🚀", "score": 2, "replies": [{"body": "Take away the 52 I bought this year and it's more like 131k gains on 14k investment.", "score": 2, "replies": []}]}, {"body": "That’s bonkers. What a company.", "score": 1, "replies": []}]}, {"body": "Why the 8 year gap?", "score": 2, "replies": [{"body": "I thought I was supposed to diversify.", "score": 1, "replies": []}]}, {"body": "Can’t ever go wrong with AAPL. It bought my house.", "score": 1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 minute ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbihiu)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbihiu)", "score": 1, "replies": []}, {"body": "Quite a trust in half eaten apple...good for you.", "score": 1, "replies": []}]}
{"title": "Market Crash this year", "selftext": "", "id": "rbjbpg", "created_utc": 1638939913.0, "score": 38, "upvote_ratio": 0.92, "num_comments": 17, "comments": [{"body": "This is a deep message", "score": 6, "replies": []}, {"body": "I can't get no...  satisfaction...\nCause I try, and I try, and I try, and I try", "score": 4, "replies": []}, {"body": "No kidding lmao", "score": 3, "replies": []}, {"body": "Does it hit the pole or not?", "score": 3, "replies": [{"body": "Just watch the full clip", "score": 8, "replies": []}, {"body": "Maybe next time, tune in tomorrow!", "score": 3, "replies": []}, {"body": "Yes.", "score": 2, "replies": []}, {"body": "Only able to view it to the end on mobile by turning your phone landscape", "score": 2, "replies": []}]}, {"body": "Omg this", "score": 2, "replies": []}, {"body": "Dammit, won't you happen already??!!!", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 week ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbjbpg)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbjbpg)", "score": 1, "replies": []}, {"body": "Wait for it…", "score": 1, "replies": []}, {"body": "Bloody hell that truck got destroyed", "score": 1, "replies": []}, {"body": "There will be a market crash at some point between tomorrow and the heat death of the universe. When in-between those points? I have no clue.", "score": 1, "replies": []}]}
{"title": "levels of support for dow jones", "selftext": "", "id": "rbowat", "created_utc": 1638961346.0, "score": 10, "upvote_ratio": 0.6, "num_comments": 14, "comments": [{"body": "This doesn't mean anything lmao", "score": 22, "replies": [{"body": "What exactly do I see here", "score": 2, "replies": []}]}, {"body": "How tf is technical analysis lol", "score": 15, "replies": []}, {"body": "Why a 2 hour timeline?", "score": 9, "replies": []}, {"body": "I thought this will get removed already?", "score": 3, "replies": []}, {"body": "Who is Dow Jones and why should we support them?", "score": 3, "replies": []}, {"body": "lolol.. TA on... wait.. 10 hours of market.?", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|13|**First Seen In WSB**|9 months ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbowat)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbowat)", "score": 1, "replies": []}, {"body": "Technical anal cysts", "score": 1, "replies": []}, {"body": "Kinda looks like a dragon. Is that bullish?", "score": 1, "replies": []}, {"body": "Your Christmas Tree drawing looks like poo", "score": 1, "replies": []}]}
{"title": "Goldman Sachs Weekly Options Watch", "selftext": " Buying calls around analyst days has averaged +13% return on premium in 2021 and we see the potential for increased profitability this December. With macro concerns largely driving the recent increase in equity market volatility, we believe investors should position for relief rallies in stocks where management is likely to reassure investors regarding the current environment and outlook. Historically, companies have scheduled analyst days in December to provide investors with updated forward-looking guidance, discuss their outlooks for the subsequent year or discuss their long-term business strategy. With the COVID-19 pandemic disrupting year-end corporate events for many companies last year, we expect this year's analyst days to increase in number and significance, especially as companies potentially start to look beyond the impact of the pandemic.\n\nTrade #1: Buy calls on Airline stocks with upcoming Analyst Days; **LUV** (8-Dec), **DAL** (16-Dec) and **HA** (13-Dec) are hosting analyst days for the first time since the pandemic.\n\nTrade #2: Buy **NKE** straddles ahead of earnings on 20-Dec; supply chain related disruptions could drive higher than normal volatility on earnings.\n\nTrade #3: Buy **LULU** straddles ahead of earnings on 09-Dec; potential for higher freight costs derailing strong momentum.\n\nTrade #4: Buy calls ahead of **COMM** analyst day on 14-Dec; management is expected to provide a detailed road map on strategic transformation process.", "id": "rbrv13", "created_utc": 1638971690.0, "score": 63, "upvote_ratio": 0.93, "num_comments": 20, "comments": [{"body": "Nice, actual options DD.", "score": 19, "replies": []}, {"body": "Fuck straddling, all in nke 12/23 140p and lulu 375p 12/10", "score": 15, "replies": [{"body": "This guy fuuuuuuuuuuucks", "score": 3, "replies": []}, {"body": "I’m going to do this bro, try to stop me bro", "score": 1, "replies": []}]}, {"body": ">LULU straddles\n\n430p and 440c maybe??", "score": 6, "replies": [{"body": ">straddles \n\nThis is not a straddle...", "score": 3, "replies": []}]}, {"body": "Nice call on the airlines", "score": 4, "replies": []}, {"body": "Add **ALK** to the airlines. Alaska Air is one of the most solidly run airlines from a financial perspective.", "score": 3, "replies": [{"body": ">COMM\n\n**ALK** performed (during that time) better than any of the ones listed in the main article.", "score": 2, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|27|**First Seen In WSB**|10 months ago\n**Total Comments**|73|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/r5ntip/pton_play/) [x](https://www.reddit.com/r/wallstreetbets/comments/r5nzq8/spx_janney_technical_view/) \n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbrv13)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbrv13)", "score": 1, "replies": []}, {"body": "dal 42C Dec 17 at 0.32 looks kinda appetizing", "score": 2, "replies": [{"body": "They look like M\\&Ms; just scoop a big bunch up. Either you'll enjoy a rush or throw up, but either way it's entertaining.\n\nThe 40C looks more likely though, so I may get some of those.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It’s for clients, yea", "score": 1, "replies": []}]}, {"body": "GeeeZ I’m sorry guys I need more research on straddles. This is a nice post congrats on your work", "score": 3, "replies": []}, {"body": "Rather than choosing individual airlines I prefer Boeing - $BA \n\nI have a ton of 250 - 300$ calls for 1/21/22 and 12/17", "score": 1, "replies": []}, {"body": "13% premium seems oddly low for options. What’s the success rate for going long Pre events?", "score": 1, "replies": []}, {"body": "I wonder why Straddles and not Strangles?", "score": 1, "replies": []}]}
{"title": "Thanks Timmy AAPL! Buying a MacBook Pro to reinvest in my favorite stonk 🍏💻🐂📈", "selftext": "", "id": "rbu4jp", "created_utc": 1638978337.0, "score": 76, "upvote_ratio": 0.86, "num_comments": 10, "comments": [{"body": "Your a smallstreetbets god", "score": 19, "replies": []}, {"body": "Make sure you get the 16 inch pro M1 Max with 64 gb ram and 8 tb ssd. You may need to sell 30 shares to afford it.", "score": 10, "replies": []}, {"body": "👏🏾👏🏾👏🏾👏🏾 104 shares", "score": 4, "replies": []}, {"body": "You’re doing it wrong you gotta buy only pits and no shares it’s the only way to lose all of your money", "score": 2, "replies": []}, {"body": "ive bought appl but i refuse to buy apple.", "score": 2, "replies": []}, {"body": "Could never support a company such as Apple.", "score": -19, "replies": [{"body": "Thanks for letting us know. Really appreciate it.", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|5958)![img](emote|t5_2th52|4267)", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|8 months ago\n**Total Comments**|483|**Previous DD**|\n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbu4jp)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbu4jp)", "score": 1, "replies": []}]}
{"title": "First gain porn post. Not an options play, bought $400 of TSLA in 2015 while on the toilet. 3k or bust 🚀", "selftext": "", "id": "rbuyt6", "created_utc": 1638980743.0, "score": 62, "upvote_ratio": 0.86, "num_comments": 18, "comments": [{"body": "That was a productive dump ![gif](emote|free_emotes_pack|poop)", "score": 6, "replies": []}, {"body": "Hold. I’m betting that Tesla will be the first flying car for public consumer market purchase", "score": 2, "replies": [{"body": "Elon just stated he's against flying cars, so you won't find it from Tesla's suite of companies.\n\nI've been working in the UAS space and can tell you PEOPLE WILL NOT LIKE FLYING VEHICLES WHO CAN CRASH ON THEM or THEIR HOMES.", "score": 3, "replies": []}, {"body": "at $44/share I’m holding forever. Also it’s in my Roth ;)", "score": 2, "replies": []}, {"body": "we already have flying cars. the wings are too wide for driving, and its basically just a small plane. \n\ntheres ones with folding wings but they’re millions of dollars. i can’t imagine a world where i would want my car to have folding wings", "score": 2, "replies": [{"body": "I know we have flying cars….. I said I’m guessing that Tesla will be the first the mass produce them at a more affordable consumer market 😑", "score": 1, "replies": [{"body": "i just don’t think they’ll ever be practical. you need a runway to take off and land. you need to lug around enormous fuckin wings whenever you use it as just a car. a lot better off buying a cessna and a car to drive to the airport, rather than driving your transformer car to the airstrip. personal helicopters would make a lot more sense.", "score": 2, "replies": [{"body": "Hurry it up a Trademark that- “Transformer Car” 😂😂😂😂😭😭😭!! I literally laughed because I heard the transformer noise in my head as I imagined it folding and unfolding 😹😹👾", "score": 1, "replies": []}]}]}]}]}, {"body": "Im impressed hopefully the SNDL does that same thing 👀", "score": 1, "replies": []}, {"body": "Please ban OP mods.", "score": 0, "replies": [{"body": "How", "score": 3, "replies": [{"body": "THIS IS NOT /R/INVESTING\n\nTHIS SUB IS FOR YOLOING 100K ON TESLA WEEKLIES $200 OUT OF THE MONEY", "score": -1, "replies": [{"body": "someone BIG mad", "score": 7, "replies": [{"body": "No but you’re in the wrong place boomer.", "score": -1, "replies": [{"body": "WSB is a fantastic community and a welcoming one. I literally said that this isn’t an options call in my post. If it offends you, I suggest checking out   /r/askatherapist", "score": 9, "replies": []}, {"body": "So go to the posting rules and first thing you will see is this. \n\n\"Position Screenshots\n\nScreenshots of your positions for gain/loss posts must show gains or losses of more than $2,500 or $10,000 USD for options or stocks respectively. Screenshots for YOLO posts must show positions in a single equity of at least $10,000 or $25,000 USD for options or stocks respectively.\"\n\nIt does say Stocks. Calm your tits please.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|10 months ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbuyt6)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbuyt6)", "score": 1, "replies": []}]}
{"title": "Bought the Dip today. I heard omicron makes you grown an extra pair of balls. Pfizer going up?", "selftext": "", "id": "rbya7y", "created_utc": 1638989868.0, "score": 21, "upvote_ratio": 0.72, "num_comments": 16, "comments": [{"body": "Nice diversified portfolio 👍", "score": 10, "replies": [{"body": "Okay?", "score": 0, "replies": []}]}, {"body": "they are gonna release more booster shots", "score": 7, "replies": [{"body": "U think that’s already factored in to the price", "score": 2, "replies": [{"body": "Probably not , demand is likely to increase as long as the virus remains prevalent", "score": 4, "replies": [{"body": "Over half the world's population is still not fully vaccinated. Demand will be there for quite a while as doses still need to be bought for all the developing nations", "score": 2, "replies": []}, {"body": "I’m sure that’s why they wanna keep the virus around, more MONEY$$$$", "score": 2, "replies": []}]}]}]}, {"body": "I mean since they also sell Viagra and now there is a chance of double nutz … you might be onto something …", "score": 3, "replies": [{"body": "Viagra is viatris its spun off", "score": 2, "replies": [{"body": "So buy both? Instructions unclear…", "score": 1, "replies": []}]}]}, {"body": "I bought at 34$", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|10 months ago\n**Total Comments**|17|**Previous DD**|\n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbya7y)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbya7y)", "score": 1, "replies": []}, {"body": "gain?", "score": 1, "replies": []}, {"body": "Listen I bought PFE before the pandemic. I’ve gone up like cents. PFE is like a possum it’s not going to pop it just sits there playing dead unmoving no matter how many times you poke it. MRDRNA is a more alive play (read actually moves)", "score": 1, "replies": []}, {"body": "Shares…wow. Been awhile. Solid company IMO", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "rc1my9", "created_utc": 1638999427.0, "score": 21, "upvote_ratio": 0.74, "num_comments": 18, "comments": [{"body": "![img](emote|t5_2th52|4887)", "score": 6, "replies": []}, {"body": "I can't fucking read. I see no positions in your DD sir.\n\nEdit: I just checked the chart. Cup and handle on the weekly. Going all in", "score": 6, "replies": [{"body": "Wait seriously?", "score": 2, "replies": []}]}, {"body": "The Europoors mastered beer 1000 years ago. Everything else is bullshit.", "score": 5, "replies": []}, {"body": "Unless they’re buying ipa , I’m out.   They’re losing market share to crafts.  \n\nCraft beers is still the rage.", "score": 7, "replies": []}, {"body": "All that effort...bag holder looking for a pump detected.", "score": 5, "replies": [{"body": "Still has good downside protection", "score": 3, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 months ago\n**Total Comments**|5|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/rc1f3m/market_makers_hate_this_stock/) \n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rc1my9)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rc1my9)\n    \nHey /u/Method0, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 2, "replies": [{"body": "Entry: 102 x $53.46", "score": 1, "replies": []}]}, {"body": "Drinking while trading? Or trading while drinking? Either way I'll buy!", "score": 2, "replies": []}, {"body": "Dogshit. How the fuck do you lose money selling alcohol?", "score": 3, "replies": []}, {"body": "Bro WSB has really gone to shit.", "score": 2, "replies": []}, {"body": "I still remember my DD on this, with a price target of $57-62. I posted around Mar 2nd, 2021, and TAP hit my target price around May-June. \n\nHilarious\n\nThat one really did come and go.", "score": 0, "replies": []}, {"body": "Wow you would have made basically the same investing in TSLA in one yea over the entire life of tap…", "score": -1, "replies": [{"body": "This! Its a dogshit stock", "score": 0, "replies": []}]}, {"body": "Title be like: top 10 secrets traders don’t want you to know! 😱", "score": 1, "replies": []}, {"body": "Did you just watch a 6 month old episode of Dumb Money?\n\nA buddy of mine followed them for months, tried to get me in on it and just ended up down on his portfolio 30%... But good luck.", "score": 1, "replies": []}]}
{"title": "Why did the markets crash a good stock on no news", "selftext": "", "id": "rc1zln", "created_utc": 1639000472.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 13, "comments": [{"body": "Not sure what I am looking at it’s just two blank pictures", "score": 6, "replies": [{"body": "Same", "score": 4, "replies": []}]}, {"body": "Because the market specifically dislikes you.", "score": 5, "replies": []}, {"body": "Because the market is like a worried mom when you miss your curfew. It panics.\n\nShe is emotional first, rational shortly after.\n\nShe will calm down tomorrow. Always does.", "score": 2, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "I’m so confused did the market actually crash?", "score": 1, "replies": []}, {"body": "No news is horrible news.  Sell!", "score": 1, "replies": []}, {"body": "Supply chain issues I guess", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I don’t know, maybe because she’s a fickle B#%€h", "score": 1, "replies": []}]}
