{"title": "Dry powder. What % cash do you have in your portfolio?", "selftext": "I’m just wondering how much spare cash people have hanging around? I was in Tesla and reckon it will trade sideways for a bit so I got out. I’m going to put some cash in ETF’s. I’m just wondering what % of their portfolio is cash? I like the idea of having cash to pick up possible cheap stocks.", "id": "lk86f2", "created_utc": 1613372880.0, "score": 29, "upvote_ratio": 0.92, "num_comments": 71, "comments": [{"body": "A big fat 0 atm.", "score": 28, "replies": [{"body": "Same☺️", "score": 1, "replies": []}]}, {"body": "<1% hehehe", "score": 47, "replies": []}, {"body": "Right now I'm about 60% cash. Lol cashed out a bunch lately waiting for some new entry points on a few things. Getting some confidence in the entry point then I can roll.", "score": 16, "replies": [{"body": "Me too.....I think there will be a chance to pick up some new stocks or average down on some big names sometime this spring.  About 60% cash and the only reason I'm keeping with the stocks I have is I believe them to be the winners 5-10 years down the road, even if they take a little beating sometime this year.", "score": 3, "replies": []}, {"body": "Currently at 70%. Hoping some things in my watchlist come off their 52 week highs and offer a good entry point.", "score": 2, "replies": []}]}, {"body": "Recently a lot, I have had about 5% for the last five years. Now it is about 45% because I liquidated two long-term holds. \n\nStruggling to find the appetite to invest right now, everything just feels expensive.", "score": 9, "replies": [{"body": "I usually try to stay 8 - 10% in cash and never go into margin.  Last spring, when word of the pandemic started to emerge, I went all in.  At first, buying puts on nearly everything.  Cashed out of puts as market started to turn around and started buying calls on nearly everything, and investing in core stocks and areas that had been savaged by the downturn.  I never expected the rebound to be so dramatic, but was able to take advantage.  \n\nI’m cashing out and taking profits in select areas now and am out of margin and back to around 3% cash.  I plan to take profits through this spring and possibly summer to a place where I have around 15% cash.  \n\nPlanning for another cycle of weirdness by next November and having some cash on hand then. This has been an excellent year for me financially - one of my best.", "score": 3, "replies": [{"body": "So, one of the avenues I started exploring this month is possibly first rental property. Might be a good time given interest rates and cash on hand. The low interest rates have also inflated prices a bit around town", "score": 2, "replies": []}]}]}, {"body": "Sub 1% in my trading account. I keep other savings elsewhere which I can move across if I find a good buy opportunity. I'm in the UK so I keep my \"safe\" savings in premium bonds and only top up my trading account with stuff I can lose. \n\nI'm in my twenties and saving for a house so I've only got about 15% of my savings on the market as I'm too scared a crash will blow all my house deposit! 😂", "score": 7, "replies": []}, {"body": "Try to keep about 20-25% so I don’t have to sell positions for any opportunities that arise.", "score": 5, "replies": []}, {"body": "25% cash. Not for any reason other than I like to have an emergency fund and a savings account for travel, both of which I would happily dip into it if we see another market crash", "score": 10, "replies": [{"body": "Well, it isn’t technically in your portfolio then. It is literally an emergency fund and a savings account.", "score": 17, "replies": [{"body": "Yup, but if we see a market crash I’ll use both.", "score": 1, "replies": []}]}]}, {"body": "fluctuate between 10-40% 25% right now", "score": 4, "replies": []}, {"body": "$69 spent most last week buying.", "score": 3, "replies": []}, {"body": "Got 36 cents !", "score": 3, "replies": []}, {"body": "90% cash, currently remodelling my portfolio.", "score": 3, "replies": []}, {"body": "I’m like 80% cash right now. Other than playing with some long shot meme calls and other dice rolls I’m out of long term holdings. I can’t help but think this whole shittery has to crash and burn and I want to be liquid to buy when it does. \n\nBefore you take my advice though I’ve been saying this since April and already missed out on massive gains so WTF do I know 🤷‍♂️", "score": 12, "replies": [{"body": "So you’re one of *those* people... I’ve made >200% since April. It’s a great time to be investing and when the market does crash, we just buy the dip anyway", "score": 11, "replies": [{"body": "Yup. It’s ok, I’ve turned a lot of money outside of the market (real estate) since April and have done very well but I obviously missed out on huge market gains. But seriously, probably the worst economy in my lifetime with the lockdowns and the market skyrockets to new highs? Whatever", "score": 9, "replies": []}, {"body": "Seriously, WTF?  I bought a house and was talking to the mortgage broker guy who said the same thing--he was waiting to buy a dip.  I was like, what did you think March/April 2020 was?", "score": 2, "replies": []}]}, {"body": "Yeah I'm 60% as well. I do believe there is value to get out there but highly suspicious of the bubble burst. I'm playing a waiting game but doubtful I'll go in more than 60 invested 40 holding or in low cost etf with stop losses.", "score": 1, "replies": []}, {"body": "Rip this dude", "score": 1, "replies": []}]}, {"body": "30–50% set aside for red days when good stocks are priced at a discount.", "score": 2, "replies": []}, {"body": "10-15%. Just enough to buy into value incase of any half decent correction", "score": 2, "replies": []}, {"body": "2% 🧐🚀 if I was over 40 years old it would be more like 20%", "score": 2, "replies": []}, {"body": "What a weird question unless your trying to figure out how much more gme/amc we can buy.", "score": 2, "replies": []}, {"body": "0% in cash. - stop loss at 2.5-5% (depending on stock). I understand i run risk of losing these 2.5%, but there is no where else to put my money while I wait for the crash to happen. \n\nStop loss allows me to prevent from taking a 30-40% hit during a market crash and to purchase my favorite companies at (as ackman would say) \"bargains of a lifetime\"", "score": 1, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Like it won’t initiate if the day starts under that?", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "so there may be a misunderstanding, \n\nif i  place a stop order at 2.5%. If it triggers, it will sell at market price. This may result in a 10-20% loss  but nothing compared to the 30-40% and since it's automated, by order will get filled quicker than others. \n\nThe fact is if a crash happens, it doesn't take a second to go all the way down to 40%. There is time when the market evaluates whether this is a real crash. There is a resistance b/c normally there is a healthy side of buyers and sellers. \n\nAgain, you're right, i am going to take a loss, and it probably won't be contained at 2.5%. But it will be greater than, the cost of going all the way down.", "score": 1, "replies": []}]}]}, {"body": "Also, the bots which mercilessly hunt for stop orders intraday will stop you out and then laugh about it as the stock recovers to new highs.", "score": 1, "replies": []}]}, {"body": "I did the last year and inadvertently sold a large position in tdoc. Made big profits but I didn't want to take them yet on my portfolio. I bought back hard.", "score": 2, "replies": []}]}, {"body": "You got out of Tesla? That doesn’t even sound smart", "score": 1, "replies": [{"body": "I’ve made good money. It’s time for me  to go a bit more conservative. If the market actually has a correction the overpriced EV stocks are going to be the first to go down. Tesla is already down a bit. When considering the pre split pricing the drops are significant. \n\nIf you think there is more room for the price to go up stay in.", "score": 9, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Can you explain why?", "score": 1, "replies": []}]}]}]}, {"body": "Cash is trash but i have about 20% but thats because you always should have a decent amount of cash on the side", "score": 1, "replies": []}, {"body": "2 months living expenses worth in cash.", "score": 1, "replies": []}, {"body": "120% cash\n\nI'm super leveraged", "score": -1, "replies": [{"body": "Loans?", "score": 1, "replies": [{"body": "Is there any other way?", "score": 3, "replies": [{"body": "But why take loans just to have more cash?", "score": 2, "replies": [{"body": "Cocaine & hookers", "score": 5, "replies": [{"body": "[To your point](https://youtu.be/btAbU1sPqIM)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "<1% Also.\nI use $VZ as a HYSA of sorts....it mostly held through the pandemic drop so I feel like it’s working.", "score": 0, "replies": []}, {"body": "I wish mine was 15% missed some opportunities due to that.", "score": 1, "replies": []}, {"body": "No cash (0% interest) but have about 20% bonds in the retirement accounts which have an annual contribution limit that I max out", "score": 1, "replies": []}, {"body": "I have 37€ cash, all over 10k are in stocks", "score": 1, "replies": []}, {"body": "0-15% cash depending on situation. I like to swing trade some and try to keep a bit of cash ready for that.", "score": 1, "replies": []}, {"body": "I want to have most of my capital invested, but still want to be able to seizure some opportunities when they come around. For that reason it hovers around 10%", "score": 1, "replies": []}, {"body": "5%", "score": 1, "replies": []}, {"body": "rn about 5% but thats cause I sold some at close on friday", "score": 1, "replies": []}, {"body": "I've got a margin account, so it's a little different, but I try to keep less than 50% of my buying power committed at any one time.", "score": 1, "replies": []}, {"body": "Around 10%, id like to keep it like this or increase it to around 15%.", "score": 1, "replies": []}, {"body": "15% of my cash is on the market if you don't include the 401k. 40% if you do.\n\nI personally don't count the 401k in my decision making.", "score": 1, "replies": []}, {"body": "About 15% at the moment but it varies. I cashed out a few things and am waiting on shit to settle down for some good entry points.", "score": 1, "replies": []}, {"body": "With margin? -100%", "score": 1, "replies": []}, {"body": "10% \n\nCould be waiting for ages to see a good opp. Normally pull out of a long term portfolio aswell", "score": 1, "replies": []}, {"body": "15% is my (pretty arbitrary) target, maybe even lower with such a crazy bull market these days. Will probably try to cash out more in the coming months if there are signs of things slowing down", "score": 1, "replies": []}, {"body": "I'm generally a day trader so I cash out completely but as I'm making trades I try not to put more then 10 percent in each trade so I have ammo for dips or other securities", "score": 1, "replies": []}, {"body": "Zero, sucks cuz I can't buy a dip", "score": 1, "replies": []}, {"body": "I always keep between 15-20% in cash for taxes and any sudden opportunities.", "score": 1, "replies": []}, {"body": "10%", "score": 1, "replies": []}, {"body": "Just enough to pay bills.  I can't convince myself cash is a good hold with the fed increasing money supply so drastically.", "score": 1, "replies": []}, {"body": "After GameStop caused that mini pullback I emptied my cash position. I normally hold 10 percent to use when there are pullbacks. I’ll raise it when I feel there’s danger. But outside of maybe one correction this year, I’m not seeing danger. Still I have a day job so the cash position does increase monthly.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "lkoga9", "created_utc": 1613426763.0, "score": 14, "upvote_ratio": 0.82, "num_comments": 72, "comments": [{"body": "They are just now beginning to turn a profit and entirely new lines are due out within a year, and you want to sell now? You do you, but Imma Hold.", "score": 36, "replies": [{"body": "well they are treated like they sell more cars than most of the other car companies combined", "score": 1, "replies": [{"body": "I don’t look at them as only a car company. I mean, we’ve had electric cars fir 120+ years, but Tesla was the first to make them commercially viable and they’re ramping up to make a metric shit-ton of them. I’ve had eyes on that plant in Austin and it’s BIG and he’s got lots of room to make it bigger. But eventually, there are going to be a lot of gas pumps converted to electric. The plugs are proprietary and Tesla has a huge head start there. Plus, I see more solar panels going up than new roofs (TX). When consumers figure out Tesla price matches...and the solar roofs are cheaper than a roof+panels, they’re going to be a bigger deal in that market too. That’s not to say I’m a big believer in green energy; I’m not. But that’s the way the market is going in a hurry and I am a big believer in green paper.", "score": 1, "replies": []}]}]}, {"body": "Sell as much as you are willing to risk leaving on the table. If you can afford to risk letting the stock crash, hold. If you have other plays you think you can make money off of, then trim.\n\nHow much does you stand to gain if you keep holding? What’s your price target? How much do you stand to lose if it falls?\n\nYou’re right, Tesla is at an absurd valuation which makes it risky, but risk is all in the eye of the beholder.", "score": 8, "replies": []}, {"body": "10 year older you would tell yourself to hold.", "score": 17, "replies": [{"body": "not if it crashes lol", "score": 5, "replies": [{"body": "I highly doubt it. People should stop considering TSLA as a car company, they’re much more than that. That’s why their value will grow, exponentially.", "score": 14, "replies": [{"body": "I think like you but TSLA itself is just a car production company as far as I understand. They don’t produce any tech or anything else aside from vehicles. \n\nSure their tech is really good but ultimately they’re a car production company. \n\nAnyway that’s how my friends rationalized it", "score": -8, "replies": [{"body": "Also remember, Musk has no problem taking a new idea and starting an entirely different company.  He has never claimed Tesla is anything other than a car company and is not beholden to take it anywhere else.", "score": 3, "replies": []}, {"body": "Why did you buy it then?", "score": 3, "replies": [{"body": "First I bought it because I thought the naysayers were way off and it would become a very profitable company.  After it took off to the moon, I sold some and kept some to ride investor optimism to make a ton of money.  At this point I feel I'm either holding these shares for 20 years or selling them, because at some point, there absolutely will be a correction in price.", "score": 1, "replies": []}]}, {"body": "I agree. What is this tech they have that all the other car makers or their partners don’t have?", "score": 1, "replies": []}, {"body": "They are an energy company. But, Tesla isn’t all that Elon and Co are working on. I suggest you learn all you can about companies that you invest in.", "score": 0, "replies": []}, {"body": "I read somewhere on here the other day that the batteries they make and will be making in the near future out of these giga-factories will be so much better than anything else available that other manufacturers will likely end up just buying the batteries off of Tesla to put in their EV’s. Obviously if that does happen then only God knows what will happen to Elon and Tesla.", "score": 1, "replies": []}, {"body": "Solar energy, BATTERIES, AI, software, robots that build the robots that build cars, etc", "score": 1, "replies": []}]}]}]}]}, {"body": "Bought at 400 post split thought it was high now it's over 800 bucks .", "score": 4, "replies": []}, {"body": "Entry point?", "score": 9, "replies": []}, {"body": "I’m not selling. Average cost is around 480/per share. I’m long TSLA.", "score": 9, "replies": [{"body": "Number of shares?", "score": 1, "replies": [{"body": "50", "score": 7, "replies": []}]}]}, {"body": "There should NOT be 1 single to your question simply because you did not explain your situation and your investment philosophy.\n\n1/: If  I were you, pocket the $$$$$ and look for other investment ! ( don’t invest back to ARK funds, even though, I invested in ARK, but they’re $TSLa heavy and I invest $TSLa via $ARKK and $ ARKF, both are doing well). \n\n2/: If you are firm believer like Cathie Wood, then no need to hesitate and HOLD @Elon baby for the next 10 years ,,\n\nOnly 1 thing :\n\nMake sure that you $TSLA is less than 5% of your total portfolio! Heavily rely on 1 single stock will make you a gambler , not an investor !\n\nBest luck and enjoy the journey !\n\nFull disclosure:\n\nI have $ARKK and ARKF in my portfolio with less than 5% investment.", "score": 3, "replies": [{"body": "Eh, I think that’s interesting but have always stuck to the 20 rule that David Gardner likes - never let one stock grow to more than 20% of your portfolio", "score": 2, "replies": [{"body": "That's a stupid rule.  If you think the stock still has value why not?  The only rule in stocks is don't put money in you can't loose.  For anyone with an income, you can pretty much role it all.", "score": 1, "replies": [{"body": "Because it allows you to take profit and also to ensure you aren’t too dependent on one company in one sector. Let’s say ARKG crashes and loses 30% of it’s value in a year. That’s a large section of your portfolio just gone. If you check the portfolio’s of most of the gurus they follow that rule too.", "score": 1, "replies": [{"body": "It doesn't ensure a profit and it doesn't reduce the risk of loss.  The likely hood of you having 10 good ideas as opposed to 1or 2 is very low.\n\nBuying the S&P 500 would ensure you keep pace with the market and is absolutely what you should do if you want to diversify.", "score": 1, "replies": [{"body": "Yup, 1 million % agreed there, which is honestly what i’m gonna do once we get a correction. Can’t beat the S&P as a base for diversification. I don’t consider the S&P an individual stock though, such that it would probably be pretty safe to have 60% of your portfolio in that and some emerging market ETFs", "score": 1, "replies": []}]}]}, {"body": "Yeah Nick Sleep famously dissolved his investment company in 2013. Saying that he is 60% in Amazon and the rest split between costco and berkshire and he will hold onto them for the next 10 years. \n\nHe has done pretty damn well, even if you rebalance to maintain the allocation, even better without", "score": 1, "replies": []}]}, {"body": "Yes, I had read some of his article. What he is talking about Grow to 20% of your portfolio, but his opponents ( other advisors) said more clearly that when an investor from initiate to the last position add, it has to be disciplined enough to spend max 5% of your portfolio fund ! \n\nBut, hey, just follow whatever we as individual feel comfortable, so long as not dump all of our funds into very limited and selective high fly stocks or funds !\n\nI had learned lesson hard way back in 1999-2000.", "score": 1, "replies": []}]}]}, {"body": "3 years from now you'll wonder why you missed out on the golden egg.", "score": 4, "replies": []}, {"body": "I'd hold. They are going to be on the up and up for a while. This year they are coming out with the semi, which is going to boom the stock. I imagine it will go up to 2k again and they will do another stock split. Then once it recovers from the post stock split dip you should sell", "score": 3, "replies": []}, {"body": "Hold", "score": 3, "replies": []}, {"body": "Bro hold that shit 🙌💎", "score": 4, "replies": []}, {"body": "I’m conservative with investing but I’m holding my shares that I got after the recent split. I regret doing the buy/sell when it was in the $300’s thinking it surely would drop below $200 again. I especially regret selling shares at $27, making $5/shares of a few way back when. \n\nYes, their QA dept sucks. Yes, if it were a normal global Fortune 500 company and their forecast was that unstable, heads would’ve rolled. Their P/E makes no sense to me. But I own two Tesla’s as a consumer and I’ve experienced a couple of annoying aesthetic QA issues, but I’m not going back to regular ICE cars and I’m not sure I would consider switching EV brands. There’s a ton of loyal consumers who choose Tesla’s and they don’t even do any marketing.\n\nMaybe sell and recoup your original investment and let it ride.", "score": 2, "replies": [{"body": "To add to TwoSuns168:\n1. If you made it this far you are probably pretty good in the green.\n2. There's talk of another potential split. Nothing founded or concrete. But a few articles circulated last week about why it might be time for them to do another split.\n3. Not sure how many shares you have, but you could always sell covered calls on them if you want a semi-passive income stream.", "score": 5, "replies": [{"body": "I have 40 shares currently.\n\nMay I ask what you mean by covered calls? Could you explain that to me?", "score": 1, "replies": [{"body": "You would essentially make a contract to sell your shares to another person at a predetermined price that you set in advance. For the contract, that person pays you a premium.\nBut you need a min 100 shares as that is the amount of a contract.", "score": 1, "replies": []}]}]}]}, {"body": "It really depends on 2 things: if you think the market is in a bubble and if you think competition will impact them. Then there is their creative accounting.\nBubble: they have high volatility. You can always sell high and rebuy lower. I personally think their pump run is over.\nCompetition: there are tons coming up in the next 5 years from car companies who actually make profits selling cars.\nAccounting: sooner or later it will catch up to them as it always does. They are also running out of credits to sell in California which is where they free cash flow is coming from.", "score": 2, "replies": []}, {"body": "Y'all do realize TSLA installs solar roofs on customer houses and is in the process of building quite a few new large scale buildings for expansion? \n\n& I mean they just released a tequila lol it's just getting going IMHO", "score": 2, "replies": [{"body": "Well, they pretend to install solar roofs lol", "score": 0, "replies": []}]}, {"body": "Just something to think about... Every reply to your comment is positive. There's saying saying that says a stock peaks when the last bear becomes a bull because that means that everyone who wants the stock already has it.\n\nWith that said, Tesla has defied logic up until now, but you could take some profit and diversify and just set a stop below $800 for the rest as it seems to be holding well there.", "score": 2, "replies": []}, {"body": "Also I think you are heavily discounting how innovative Tesla is being an EV. Though not quite, it's like the model T coming out and going \"yeah but it's just a car company\". The sentiment is missing a lot of the bigger picture.", "score": 2, "replies": []}, {"body": "HOLD", "score": 2, "replies": [{"body": "For 20 years!", "score": 3, "replies": [{"body": "At least!", "score": 2, "replies": [{"body": "Nah by then BMUS will take over and we won’t need vehicles at all.\n\nWho can guess what BMUS is?", "score": -1, "replies": []}]}]}]}, {"body": "I guess is your money on Elon or Burry.  I mean TSLA is not going anywhere so do what let’s you sleep at night", "score": 1, "replies": []}, {"body": "Think about it like this: Tesla's stock went this high considering all these issues. Now, all these issues are being resolved and they will be focused on profit now. Not only that but they still have the model 2 to unveil as well as the robot axis comng down the pipeline. So, previous issues are being addressed and there are more good things to come. There may be a time to sell, but there never was and that time hasn't come yet.", "score": 1, "replies": []}, {"body": "Wait for stock split.", "score": 1, "replies": []}, {"body": "Sell? Come on man really?", "score": 0, "replies": []}, {"body": "Tsla ain’t going anywhere.", "score": 1, "replies": []}, {"body": "Drive", "score": 1, "replies": []}, {"body": "Keep a close eye on it and watch if the stock tumbles down. Highly unlikely to see it happen in the upcoming weeks but you never know what will happen in the future. Hold with a watchful eye.", "score": 1, "replies": []}, {"body": "It depends on your entry point and your risk. Me personally I had 5 shares than TSLA had the insane run up. I sold 3 shares around $870.00 just to take profits but I am hanging on to the other 2 even if the price goes to 0 lol. I think they are good company and will be around for awhile which is why I am keeping a couple shares.", "score": 1, "replies": [{"body": "Only reason it got so high was cause it was shorted so much. Those shorts are out and it’s gonna be decline time now. Gonna miss next earnings and I think some shady shit is gonna show up. He’s having safety issues now with the cars produced in China 150k recalls in the USA. It’s downhill time. They had a monopoly for long enough now that is over. His brother also just cashed out 25mill in shares. Musk moving to texas for the zero percent personal income tax may mean he’s ready to take some off the table himself.", "score": 3, "replies": [{"body": "Yeah IDK man. Either way it will be very interesting to see especially with all the competition going into the space now. You got Tesla, GM, Ford, BMW, Volkswagon, Toyota, and now there are rumors Apple is behind the scenes coming up with their. Either way I took profits from the insane run up so I am just going to sit back and watch at this point.", "score": 1, "replies": []}]}]}, {"body": "Sell half and buy it back if it dips", "score": 1, "replies": []}, {"body": "Set up two trailing stop % orders, one for 1/3 of your position at a 10% TS, one for 1/3 of your position at 20% TS, and hold the rest forever", "score": 1, "replies": []}, {"body": "If you think its a car company, its definitely overvalued.\n\nIf you think Tesla will become the dominant brand of all things tech across the planet I guess it could be fairly valued.\n\nMy guess would be somewhere in between the two.", "score": 1, "replies": []}, {"body": "they are also a solar panel company.", "score": 1, "replies": []}, {"body": "I would 100% sell Tesla if I had it.\n\nWhat's the potential upside? It doubles and overtakes Amazon, Microsoft, Google and Apple? No way.\n\nWhat's the potential downside? All the other car manufacturers create equally awesome electric cars and Tesla loses its shine? Falls back to reality and loses 90%.\n\nNot worth the risk IMO.", "score": 1, "replies": [{"body": "Competition is years behind.", "score": 1, "replies": []}]}]}
{"title": "$AAPL Searching for Autonomous Vehicle Partner + $AAPL Picked Up By Huge Hedge Fund", "selftext": "[deleted]", "id": "lkoww7", "created_utc": 1613428074.0, "score": 93, "upvote_ratio": 0.91, "num_comments": 71, "comments": [{"body": "[deleted]", "score": 134, "replies": [{"body": "If revenue determined stock price, Walmart would be worth 5 times Apple.", "score": 28, "replies": [{"body": "Profit matters too", "score": 4, "replies": []}]}, {"body": "> Amazing that people are bullish on an EV play\n\nAre they though?", "score": 3, "replies": []}, {"body": "i clicked on the 2nd link and it says \"pension fund\". is a pension fund a hedge fund? are all funds hedge funds? what about teh short squeeze? AAPL short squeeze coming soon amirite", "score": 6, "replies": []}, {"body": "I do not want to buy a 2.3T company. \n\nI’m 31 years old. I want risk. Fuck Apple", "score": -11, "replies": [{"body": "One day your future self will regret not tucking a few dollars into solid companies (at least some small percentage).  Hedging your portfolio is good investing.  When you're an old man/woman I think you'll look back fondly on the day you invested/held a bit in AAPL @ $135.", "score": 14, "replies": [{"body": "Yup AAPL is only going to go up steadily over time. Its safe. Why would you not want safe returns? You could lose everything with a risky investment. You could pretty much only gain with AAPL", "score": 11, "replies": [{"body": "!remind me 2 years", "score": 2, "replies": [{"body": "!remindme 2 years is what you’re looking for i think", "score": 3, "replies": []}]}]}]}, {"body": "You shoulda bought CHWY. Made a bull case video on it when it was around $30 a share", "score": 3, "replies": [{"body": "Woof woof", "score": 2, "replies": []}, {"body": "I’m not trying to invest in dog toys bro.", "score": -15, "replies": []}]}, {"body": "Im 31 and Im holding apple since stock split. Been good to me thus far", "score": 1, "replies": [{"body": "I’m up 300% in 3 weeks. That much better?", "score": 1, "replies": [{"body": "No but it’s relatively grounded company with a lot of cash on hand.", "score": 1, "replies": []}]}]}]}]}, {"body": "“Apple picked up by hedge funds” you cannot pick up Apple. Apple picks up hedge fund.", "score": 39, "replies": [{"body": "True!", "score": 2, "replies": []}]}, {"body": "Watch Apple buy lucid motors out from under Churchill haha", "score": 36, "replies": [{"body": "That would be crazy and beautiful", "score": 14, "replies": []}, {"body": "The problem is Lucid has a lot of the same weaknesses as Apple here, i.e. lack of manufacturing expertise.\n\nThat said, it makes more sense then buying up one of the legacy automakers like GM that I've seen others saying Apple should do. I would sell all of my AAPL shares if Apple spent $20+ billion buying up a legacy automaker, there's way too much downside potential and a lack of upside potential in it considering most of them already sell at least 10 million cars globally.", "score": 3, "replies": []}]}, {"body": "Wow ! Shall I load more $APPL tomorrow ?", "score": 21, "replies": [{"body": "Always buy $AAPL. Just buy and hold it.", "score": 38, "replies": [{"body": "Done , ready to load more ! $AAPL.", "score": 10, "replies": []}]}, {"body": "No, this is bad news and shows they're further from the project than was thought.\n\nNews already didn't move Apple stock despite Hyundai have a +30% day or something.", "score": 14, "replies": [{"body": "So, you mean that the  market has already taken into consideration of $AAPL’s evaluation of the new autonomous vehicle revenue and profits in today’s stock price ? \n\nIf so, holy crap, I can’t load more , better watch out ? !", "score": 8, "replies": [{"body": "I'm saying it's indifferent to it right now. AAPL is a perfectly good buy but don't buy it due to the EV news, unless it's something like a reveal with BMW or something.", "score": 4, "replies": [{"body": "Sounds good", "score": 1, "replies": []}]}]}]}, {"body": "I would if I could but I already have. No more capital!", "score": 2, "replies": []}, {"body": "Did you even read the article. The links are literally posted right there.", "score": 1, "replies": []}]}, {"body": "Has Apple announced that they were doing Apple cars or is this all just speculation?", "score": 11, "replies": [{"body": "I mean everything they do is \"speculation\" until they bust it out in a flashy event - but it appears as though it is 100% a thing they're going to do: [https://www.cnbc.com/2020/12/21/apple-targets-car-production-by-2024.html](https://www.cnbc.com/2020/12/21/apple-targets-car-production-by-2024.html)", "score": 9, "replies": [{"body": "Can we really trust cnbc anymore tho", "score": 27, "replies": []}, {"body": "2024 seems too unrealstic when they dont have any automotive partners. Automotive companies test atleast 2 years prior releasing their cars. Thats with cars having incremental updates", "score": 3, "replies": [{"body": "They have been working on this for years though. It’s not like they just started today. Even Musk talked about in an interview how he was only worried about AAPL as a competitor a few years back. AAPL has been poaching a lot of employees from tesla and other car companies for a while.", "score": 1, "replies": []}]}]}, {"body": "They had some top commander of the Apple Army step down recently from his role to work on Apples big future project", "score": 2, "replies": []}, {"body": "Apple does not comment on unreleased products.", "score": 1, "replies": []}]}, {"body": "My main curiosity, and maybe you can speak into this, **is how much battery research AAPL or any company they are planing to partner with has.**\n\nThe key to becoming the EV King is going to come down to who can crack a range that is at least 1.5x typical gas range (something like a 400-500 mile range to get rid of stigma) at the 25,000 price point.\n\nThe issue is, battery research is not easy. Tesla is  at the forefront experimenting with both Lithium Iron Phosphate and Lithium Ion, but they're not able to crack that $25,000 price just yet. In addition, they're facing issues being associated with not having experience as a traditional auto manufacture company (such as after-market repair, overall quality control).\n\nI'm sure the apple car would sell, but it could end up like some of the products that apple has that is more for niche mainas (think mac pro trash can for many years).", "score": 3, "replies": []}, {"body": "AAPL is now viewed by the WSB era investor as value stock.....it’s not hype enough....", "score": 10, "replies": [{"body": "WSB era idiots can suck it. $AAPL rules", "score": 11, "replies": [{"body": "I know, AAPL is my largest position and it is sad to see it kind of just hangs around relatively flat while others “mooned” or rocketed. \n\nIt is insane how AAPL, an era defining company is now viewed as “boring” in today’s meme driven world......", "score": 8, "replies": [{"body": "It's only a matter of time this rockets up.", "score": 4, "replies": []}]}]}]}, {"body": "Theres rumors FSR is partnering with AAPL", "score": 6, "replies": [{"body": "Im unfamiliar. Are their EVs quality?", "score": 3, "replies": [{"body": "Check out Henrik fisker Wikipedia, he's designed some nice cars", "score": 4, "replies": [{"body": "Nice renderings don't make good cars.", "score": 3, "replies": []}]}]}, {"body": "Links", "score": 2, "replies": []}]}, {"body": "My feb 19 apple call better print", "score": 3, "replies": [{"body": "What strike do you have?", "score": 2, "replies": [{"body": "133", "score": 1, "replies": []}]}]}, {"body": "I did read somewhere they also just contacted Nissan...in anyway this is bad for tsla and good for aapl", "score": 6, "replies": [{"body": "Nissan already said no, they don't want to become the Foxconn of the auto industry (i.e. known for just being an Apple hardware supplier instead of for being their own car brand).\n\nhttps://www.businessinsider.com/apple-car-electric-autonomous-self-driving-nissan-talks-hyundai-2021-2\n\nAlso Tesla is already the cool car company in the auto market that everyone raves about on social media and that has proven they can make a good EV. Apple is multiple years too late to take that away from them.", "score": 9, "replies": [{"body": "[deleted]", "score": 26, "replies": [{"body": "Totally agree, they’ll find right partner and Apple car will be something else , just like most of their products .\nI remember when everyone were using blackberry until IPhone came out .\nI believe same faith is in store for most of EV makers, Apple is on the hunt , watch out.", "score": 6, "replies": []}]}]}]}, {"body": "I think that Apple and GOEV are still together and are looking for a partner. With Hyundai and Nissan out, I legit think they might roll on over to Ford. Both have needs that the other can meet. \n\nIt just makes sense", "score": 2, "replies": []}, {"body": "Just make an announcement so I can do something with these GOEV shares", "score": 0, "replies": []}, {"body": "[removed]", "score": -3, "replies": [{"body": "I don’t believe they ever announced anything, it’s all rumors, leaks and speculation", "score": 6, "replies": []}]}, {"body": "Apple making a car is LOL. I get it...they think they can do anything, but they messed up when they didn't buy TSLA when they had the chance.\n\n\nApple will fail at this one because they are too damn cocky.", "score": -23, "replies": [{"body": "Yeah because a company just sitting on 90 billion dollars in cash and has some of the best tech engineers in the world working for their company, and a company with tons of brand loyalty is 100% going to fail, absolutely going to fail. Also trying to expand into a new domain to generate revenue and maybe pull in some new customers like what were they thinking! Absolutely unacceptable as soon as the market opens I am pulling all my money out of Apple tomorrow. F**k you Tim Apple 🖕🖕🖕", "score": 10, "replies": []}, {"body": "Yeah they were asleep at the wheel not buying Spotify too and sticking with itunes\n\n&#x200B;\n\npun very intended", "score": 1, "replies": []}]}, {"body": "Shorted it on the last EV pump was easy money.", "score": -17, "replies": [{"body": "Sir this is a casino", "score": 3, "replies": []}, {"body": "RemindMe! One month “reply to this thread”", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you in 1 month on [**2021-03-16 04:38:18 UTC**](http://www.wolframalpha.com/input/?i=2021-03-16%2004:38:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/lkoww7/aapl_searching_for_autonomous_vehicle_partner/gnm3s5v/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Flkoww7%2Faapl_searching_for_autonomous_vehicle_partner%2Fgnm3s5v%2F%5D%0A%0ARemindMe%21%202021-03-16%2004%3A38%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20lkoww7)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "I think Jaguar-Land Rover would be a good partner.", "score": 1, "replies": []}]}
{"title": "Sectors to watch for in Q2 2021", "selftext": "1 Transportation and Delivery\n\nTransportation and delivery stocks took a hit last March when the disruption of pandemic came. Almost one year later they have recovered strongly. Staying at home and working from home have created unprecedented demand for transportation and delivery of goods via vehicles on highways. As the vaccination looms and the economy reopens, the demand might drop, but the habits nurtured during the pandemic could linger for quite a while. I am still cautious about airline stocks; air travel is still far from recovering even 1/3 of what it was before the pandemic and I won’t make a move until the volume reaches about 1/2 . \n\nLooking at: PAG, KSU, UPS, FDX, UBER, UNP\n\n======\n\n2 More traditional/” big players” financial stocks\n\nI have opened another post asking for advice, so I will just be copying and pasting:\n\nFintech stocks and ETFs are popular on the market nowadays and I’ve reaped quite some profits from ARKF, PYPL, SQ, V, virtual currency ETFs e.t.c. But now I am eyeing in on the more traditional/big Wall Street players like Citibank, JPM, Morgan Stanley, Goldman e.t.c. All flaws and blames and crooked behaviors aside, they are still the biggest players in the financial market nowadays and the establishment can’t be overwhelmed by a few Reddit short squeezes. I am trying to observe if these stocks could sort of \"recover\" from the shock and respond to the innovative trend.\n\nThere’s also another realm of more diversified asset management player such as CG, BX, BLK, NTRS e.t.c. It seems the pandemic has a very strong asset/wealth reallocation effects and the wealthiest that could afford to have their assets managed by these players are doing well. These institutions also typically have quite established footings in emerging markets such as Asia and South America in both government and private businesses. CG has recently published a pleasant Q4 2020 report and their stocks climbed. I am waiting to see if BX, BLK and NTRS would follow suit.\n\nLooking at: JPM, BX, BLK, NTRS, CG, BAM\n\n======\n\n3 Military and Defense\n\nThe mainstream media tries hard to paint a layer of peaceful color to the new administration, but tensions around the globe won’t just disappear. The US military has quite a few major contracts for new weapon systems delivery coming up, and US arms sales to allies could increase as many of them are located at the forefronts of tensions (Japan, South Korea, Taiwan, Saudi, India e.t.c).\n\nLooking at: LDOS, LMT, GD, NOC, BA (more for its military contracts rather than for commercial airplanes)\n\n======\n\n4 Tech Infrastructures\n\nWith everything shifting to online platform, Tech stocks (IT, cloud computing, semiconductors e.t.c.) have done well in 2020. I am in MSFT and TSM, and I just want to take a look at stocks that offer a more infrastructural exposure to the tech advancements, such as base towers for 5G, solutions for cloud computing and online platforms, workstations, hardware production e.t.c.\n\nLooking at: CCI, AMT, CSCO, MSI, ERIC\n\n======\n\n5 Virtual Currency\n\nI am not a big fan of virtual currencies so far, and it might be a bit late to enter the game. but nobody could deny the soaring prices of every major virtual currency, and I certainly don’t mind to ride the bandwagon and get a few extra bucks. \n\nLooking at: BLOK, KOIN", "id": "lk4o91", "created_utc": 1613359876.0, "score": 88, "upvote_ratio": 0.84, "num_comments": 73, "comments": [{"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 31, "replies": [{"body": "good bot", "score": 3, "replies": []}]}, {"body": "I would add travel as well, with vaccine where it's at rn by the end of Q2 (MAYBE Q3) we should have some solid dates when intl travel will be 'normal' again and can start booking... TRIVAGO and Royal Caribbean should move", "score": 11, "replies": [{"body": ">I'd say I have as much caution in airline stocks as travel, want to see if travel sectors could recover as much as 50% of pre-pandemic volume/revenue e.t.c.", "score": 10, "replies": [{"body": "I think short term we'll see a huge wave of pent-up travel bux, which will look even better at the extra mark up some big companies can charge", "score": 4, "replies": []}]}, {"body": "WYNN ABNB going to soar", "score": 5, "replies": []}, {"body": "Honestly until we see how airlines become restructured stay away. As it is it'll be easy for new players to move in with zero debt and discounted surplus planes to just demolish the existing players weighed down by crushing debt and zero legacy costs when travel starts to pick up again.", "score": 1, "replies": []}, {"body": "I like travel but airlines look to expensive for how much debt they took on. Mayne the online and cruise ships stuff. \n\nI'm in MU for tech and that big infrastructure push. \n\nI also like some of the REITs and real estate related stocks that haven't recovered yet.", "score": 1, "replies": []}]}, {"body": "The sector I’m really looking at through 2021 that could really pop starting soon is ‘Moving’.\n\nI’m kicking myself because a decision I tried holding off on since December is to go deep on Zillow June 200c. It’s already there.\n\nI think the people who put off moving last year will renew those plans this year.\n\nSo I’m thinking Zillow, Home Depot/Lowes, Banks/mortgage orgs, furniture stores, thinks like that that are tied to any part of the moving process — Search, loan, move, furnishing.", "score": 18, "replies": [{"body": "I reaped a pretty decent profit from selling Open Technologies (OPEN) for the last week and I am thinking if I should get something similar. Thanks for the advice!", "score": 7, "replies": []}]}, {"body": "You forgot energy. Lots of potential on green", "score": 5, "replies": [{"body": "Somehow my original post was removed by WSB but I did include a caveat there which I have to remove to get this post across: I don’t talk about popular sectors such as Fintech, online retail, renewable energy, IT and cloud computing, medical and healthcare, online streaming, electric cars e.t.c. simply because I already have picked my stocks and/or ETFs from these places.", "score": 2, "replies": []}]}, {"body": "Regarding number 3, Raytheon. The new Sec Def, Lloyd Austin, has been “working” there for the past 4 years. Now what a life long infantry commander knows about aerospace manufacturing is beyond me but he was there. And guess which company got a nice fat contract to supply the F-35 right after he was confirmed. That’s right, ya boi Raytheon.\n\nNow it’s not going to pop like we like but given those factors and the military industrial complex being back in power and slightly starved over the past four years, things will be looking up for Raytheon. \n\nAlso keep an eye on Tenet Healthcare. In 2008 he was placed on their board of directors. Once again, what an infantry commander knows about the healthcare industry is anyone’s guess. But if the dems start their fuckery with the healthcare system I’m guessing that company will make fast adjustments. Almost like they had someone on the inside of the administration tipping them off. \n\nThe guy is dirty as fuck but everyone is cheering him as the first black sec def.", "score": 11, "replies": [{"body": "Wow thanks for the insight! Yeah the defense contracting process is crooked as f\\*\\*k. Will definitely take a look.", "score": 8, "replies": []}, {"body": "I dont think hes a total idiot but Dont forget his ba of science(just science) , and master of arts and master of business administration. I guess we can say he brings other aspects not common to that industry. /s", "score": 3, "replies": [{"body": "I never said “idiot”. I was in the military, dumb officers aren’t put in charge of combat units. The dumb ones wind up in charge of me, in a transportation unit. And, boy, did I run through some dumb ones.\n\nHe knows the political game and he has made the right friends. That’s how he got to where he is now. And those companies know that too. So if they can break him off some salary for a while they know that when he does get to where he going, like say, sec def, then he’s a good friend to have had.\n\nI remember hearing his name as a strong candidate for sec def when Hilary was running. So insiders knew where he was probably going to end up and decided to get to know him. And by “get to know” I mean pay him for a job he might not be qualified for.", "score": 3, "replies": [{"body": "Was trying to broadcast that although he doesnt seem terrifically qualified i do not think hes an idiot. \n\nWas not sure if the /s was enough to signify the satire of his educational background for a job in practically an engineering company.\n  Obv we are both agreeing he is only there because of the contacts he has had.", "score": 2, "replies": [{"body": "Just saying, did a bit of search on Austin. Every West Point graduate officer gets a Bachelor of Science degree since West Point used to be the army's engineering school, so the \"science\" here doesn't mean a lot. MA degree was in counselling education and that doesn't fit into the corporate/science background all too well. As for the MBA....well we all know how many crooks and idiots graduate from business school. LMAO", "score": 2, "replies": [{"body": "Exactly the point i was trying to convey. Not very specialized", "score": 2, "replies": []}]}]}]}]}]}, {"body": "The mighty Lube sector", "score": 7, "replies": []}, {"body": "How we feel about insurance ARGO", "score": 2, "replies": []}, {"body": "Travel\nHA : always solid and surviving without passengers with all the freight back and forth to the islands. Once travel resumes, everyone wants to go to Hawai\nALK : another great airline with a cult like following.\nQAN : cheap, vaccine about to roll out and they pretty much have the monopoly in Australian travel domestic and OS\n\nLithium:\nVUL : Vulcan energy. Mining in fuckin Germany! Positioned right in the middle of Europe. Prime position for the EV market\nAND MY FAVOURITE 🔥 \nLKE : mining the purest form of Lithium in the golden triangle of Argentina.\nHave the most environmentally sustainable practices to extract Lithium in the world.\nStock is cheap as Fck. Have deals with Novonix (up 10% today) who have a direct line to Tesla.\nLKE up 9%+ on the ASX just today ✈️ 🌙 💰", "score": 2, "replies": [{"body": "Thanks a lot!", "score": 1, "replies": [{"body": "Did you jump on ALK and HA today????", "score": 1, "replies": []}]}]}, {"body": "Stop writing \"e.t.c.\" with periods. It doesn't make sense and makes you look stupid.", "score": 5, "replies": []}, {"body": "Oil prices rising, multiple companies are undervalued, could be some opportunities there as well.", "score": 2, "replies": [{"body": "I had some thoughts on XOM and CVX, but I was a bit concerned that the Biden administration could be so pro-green and anti-oil that it might try to hamper the revenue of oil companies?", "score": 3, "replies": [{"body": "Absolutely agree with your concerns, that’s part of the reason I stayed away from XOM. However with demand still rising, and given that any Green New Deal isn’t going to immediately slit the jugular of the oil industry, I get the sense that prices will keep rising for the short/medium term, especially headed into a summer with many people vaccinated and a massive increase in travel. As long as oil is above the 40-50 threshold per barrel, Texas is going to be shifting back into high gear, and we’re already bouncing around 60 per barrel.\n\nI’m not 100% where/what to bet on, I’ll definitely be doing a lot of research in the coming weeks.", "score": 2, "replies": [{"body": "For me I would probably just buy a sweeping energy ETF like XLE?", "score": 2, "replies": []}]}]}]}, {"body": "CSCO is a perennial dog. Stay away from that woof woof at all costs.", "score": 2, "replies": [{"body": "What does that mean?", "score": 1, "replies": [{"body": ">that  \r\n>[th at; unstressed th uh t]    \r\n>1.    \r\n>*(used to indicate a person, thing, idea, state, event, time, remark, etc., as pointed out or present, mentioned before, supposed to be understood, or by way of emphasis):*    e.g **That is her mother. After that we saw each other.**", "score": 7, "replies": []}, {"body": "See my later response below.", "score": 1, "replies": [{"body": "I think it was removed.", "score": 1, "replies": [{"body": "Declining revenues and constant excuses from mgmt at conference calls as to why. They pointed to cybersecurity as a growth area but are having their lunch eaten by more nimbler companies (Crowdstrike, PANW, etc) + video conferencing is taking on heavy fire from the Zooms and RingCentrals of the world. CSCO is losing, just pull a 10 yr chart and see what I mean. \n\nOracle is a stodgy company too but at least they are willing to think out of the box with runs at Chinese owned social media companies (rhymes with \"click clock\" because if I write it the bots delete this message) when it arises. Oracle over CSCO any day of the week.", "score": 1, "replies": []}]}]}]}, {"body": "I wonder if you could elaborate a bit more? I am trying to decide between Oracle and CSCO", "score": -1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "This comment was removed because automod thinks it mentions a stock with a market cap below $1B. We don't allow such stocks on WSB due to their potential for pump and dumps. \n\nIf this was a mistake, check your inbox for more information on how to get your post approved! Sorry for the inconvenience and we'll fix it right away!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "This comment was removed because automod thinks it mentions a stock with a market cap below $1B. We don't allow such stocks on WSB due to their potential for pump and dumps. \n\nIf this was a mistake, check your inbox for more information on how to get your post approved! Sorry for the inconvenience and we'll fix it right away!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Neither. Cisco is just meh. Oracle is a big avoid for me - their Java licensing antics are one thing, but *every* traditional Oracle shop I know is migrating away to on-prem SQL Server or cloud-based database solutions in AWS or Azure. And Oracle's cloud offerings are comedy.", "score": 1, "replies": [{"body": "Gotcha. Will take a look at better SQL providers", "score": 0, "replies": []}]}]}]}, {"body": "What is this boomer shit none of those stocks you mentioned have any 🚀🚀Coming for them you are in the wrong group this is WTB please return your ass back to to CNBC where you belong", "score": -8, "replies": []}, {"body": "Shits getting interesting in silver.", "score": -14, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "You mentioned something that looks like crypto. We get it, crypto is neat, but it's not our thing. [(Rule 4)](https://old.reddit.com/r/wallstreetbets/about/rules)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "This comment was removed because automod thinks it mentions a stock with a market cap below $1B. We don't allow such stocks on WSB due to their potential for pump and dumps. \n\nIf this was a mistake, check your inbox for more information on how to get your post approved! Sorry for the inconvenience and we'll fix it right away!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Could be opportunities in oil shipping when the economy recovers and gas demand returns.\n\nJust throwing this out there ... is there someone on this board who knows that business well?", "score": 1, "replies": []}, {"body": "Seems like semiconductor.stocks are next in line, already started but they mooning. Also commodity mining stocks I think will see a pop.", "score": 1, "replies": []}, {"body": "BAYN.DE , big Pharma with vaccine deal with Curevac. Boomer Stock but I think it will perform. Glyphosate litigation is about to get solved and now they produce vaccines🤷🏻‍♂️ I think there is a lot of upside because she is quite beaten down so far 😁", "score": 1, "replies": []}, {"body": "Looking at LMT as a great value play, buying the dip but I do not want to buy too much too soon.", "score": 1, "replies": []}]}
