{"title": "How to look for a stock that's not well-known?", "selftext": "Like many, Gme got me interested in stocks, though I made modest amount of ‘safe’ stocks like apple, tesla, microsoft, etc. Aside from these already well-established companies, I don’t know where to look to find newer companies and what to look for when I find one. For instance, I bought a couple of Nio stocks because I saw it on wsb before the gme craze but didn’t know whether the price I bought it at is good or even worth buying at all.\n\nWhat resource did you use to know the basics of evaluating stocks? Also, do people here focus on a specific sector and focus their attention on the companies, much like an analyst would at a firm, or do you scroll through low-priced companies and evaluate whether it’s worth buying?", "id": "lbc7pc", "created_utc": 1612315887.0, "score": 66, "upvote_ratio": 0.96, "num_comments": 71, "comments": [{"body": "[removed]", "score": 28, "replies": [{"body": "Is it better than the finviz.com screener?", "score": 3, "replies": []}]}, {"body": "Pick an industry you think is going to have good future growth: green energy, digital creatives, e-sports, and supply chain tech for me personally. Do research on the industry and see which companies are solving problems you think are going to have a large impact. \n\nAlso, you can just look at IPOs, upcoming ones and the last three years. Some companies see explosive growth even just in the first year, while some become dogs (Uber). I’m personally targeting Roblox and UI Path as soon as they’re on the market. \n\nHighly recommend not buying Robinhood. \n\nI don’t cheap out on companies. It’s pretty difficult to find an undervalued gem that’s going to explode. I look at quality first (good leadership, promising financials or growth, brand recognition), then I pick based on value and potential. Cheap stocks are usually that, cheap. \n\nKnow how to read a 10k or company financials. I’m an MBA and there’s nothing I learned in school that you can’t learn on YouTube. If you pick up a bit of basic accounting, you’ll understand all those fancy stock ratios such as P/E, EPS, etc. and you’ll still be unable to understand why AMDs price tanked after the best earnings call they’ve ever had. \n\nFor fundamental stock valuations, I use the dividend discount model and discounted free cash flows, but they don’t work that great with TSLA or most tech stocks unless you use a bit of imagination.", "score": 12, "replies": [{"body": "esports stocks you recommend?  I'm also curious on the 'digital creatives' front.", "score": 1, "replies": [{"body": "I like the NERD and ESO esports ETFs. Good, solid returns over the past year.", "score": 1, "replies": [{"body": "Yeah, those are pretty good. I really like SKLZ so far, brand new and could make a good run this year.", "score": 1, "replies": []}]}]}]}, {"body": "Keep your eye our for IPOs, but resist the temptation to jump in early. They often have a fast run up then drop. Follow the press and see what they say about it. You may also want to look at a company that has a decent drop to see why it dropped and if there is a chance for it to recover. For me, not being good at analyzing data, I generally follow a couple of other rules. 1. Do I understand what business the company is in. For example, I won't buy biotech because I don't know enough to decide if it's a good buy. 2. If it's a consumer company, do I like the product? Would I buy it? Also, is it in line with my values. I wouldn't buy tobacco companies, oil, or gaming stocks because I believe their businesses to be a negative to society. 3. How is management? Do the leaders have a good or bad reputation? How did the CEO do in his last job? 4. Is it a growing or declining industry.", "score": 23, "replies": [{"body": "Genuinely interested, how would you say gaming is negative to society? \n\nI see that many games may be decaying in themes, often falling to  sexual and pro drug stances just to make a quick buck, but other games may be excellent for therapeutic purposes or education, like Minecraft for example.", "score": 12, "replies": [{"body": "I meant gambling, casino, etc. I have no problem with video games.", "score": 23, "replies": [{"body": "I would also add that many workers in the video game industry get fucked over pretty hard by their employers.", "score": 3, "replies": [{"body": "No harder than any other non-union labor. At least game devs make ~$60k.", "score": 5, "replies": []}]}, {"body": "Ah, gotcha. My first language isn't English so so wasn't familiar with that sense of the word.", "score": 4, "replies": [{"body": "Nah that’s a valid question, I’m a native speaker and I was confused for a sec too.", "score": 2, "replies": [{"body": "Glad I wasn't the only one! 🤗", "score": 2, "replies": []}]}]}]}, {"body": "Jeez that flew over my head, I thought he meant gambling for gaming. But video games? I dont get that", "score": 0, "replies": [{"body": "Saying you don't get why people would invest in games is like saying \"Arpanet? Who needs it?\" back in 1975.", "score": 2, "replies": []}, {"body": "No, I didn't mean video games. Gambling, like casinos", "score": 1, "replies": []}]}]}, {"body": "Learned this the hard way with slack. Held on hoping for an acquisition and finally it’s happening. I was down 70% for a long time", "score": 1, "replies": []}, {"body": "How do people get into an ipo? Like is the ticker visable or available before its live. And people can put in orders day before? (Trade app user here)", "score": 1, "replies": [{"body": "I think in most cases getting in before the launch of an IPO is restricted to select investors. It's not something us peons have access to.", "score": 2, "replies": []}]}]}, {"body": "Do some research in the industries you really believe in. Think of the future and maybe review some of the technical aspects of such companies. \n\nFor me , I think E-cars , Solar power , lithium , and DeFi is the way to go !", "score": 8, "replies": [{"body": "I'm leaning towards green energy as well, since I studied that in undergrad and would have some idea of what makes products impressive and understand some of the literature. Do you just focus on one area and pick out companies to invest?", "score": 8, "replies": [{"body": "Takes a lot of time and commitment to invest the right way. \n\nPersonally I start my research by going on the website of a company I’m interested in, reading what they do, press releases, financials, insider buying/selling/ownership, institutional buying/selling/ownership, etc. Then I read about their competitors and do the same thing. After that is done I do a mass comparison between all of them to see if there is an outlier. This could be something like a low P/E ratio, low P/S ratio, higher growth in revenue or earnings, geographic advantage, patented technology, so many different factors, and try to eye in on the best opportunity. \n\nTo answer your question simplistically: yes. Focus on one area if you believe it has a great future (such as green energy).\n\nI also stick to things I understand. For this reason I stay away from genomics, as it’s a field I really don’t understand. \n\nSorry for babbling, good luck.\n\nEdit: and when you research, don’t just look up one company and say “seems great, let’s invest in it” - because there are so many companies out there and just because one is “good” doesn’t mean there’s not a “better” one.", "score": 1, "replies": []}]}]}, {"body": "Research is key. I'm reading everything & watching every YT video on investing/stocks basics. In terms with news, it's the usual. CNBC, WSJ, Forbes. I'm also looking for the next Steve Madden.\n\nSteeeevvvveee Maaadddeennnn", "score": 23, "replies": [{"body": "If the stock is in the news ...  (Maybe ) It's too late to buy it", "score": 26, "replies": [{"body": "It is too late to buy it if the media picks it up.", "score": 6, "replies": [{"body": "Unless the media is trashing the business.", "score": 5, "replies": []}, {"body": "I noticed weird shit happening with silver last week and chucked a few dollars into $SLV to see what would happen, come monday morning the entire financial media circuit is reporting on a “reddit silver rally” out of thin air and I knew to get the fuck out immediately at the opening bell for a small profit before it got slaughtered", "score": 3, "replies": []}, {"body": "I always think of what Rockefeller said about the shoe polisher and stocks", "score": 2, "replies": []}]}]}, {"body": "Sweetheart, you have my money taped to your tits. Technically, you do work for me.", "score": 2, "replies": []}]}, {"body": "In addition to the screeners your broker may have, yahoo finance actually has screeners as well.  It also has a lot of stock info and is where I start a lot of times and is free.", "score": 7, "replies": []}, {"body": "screener to look for undervalued stock, or something like prnewswire for press release/news\n\n[https://www.prnewswire.com/news-releases/news-releases-list/](https://www.prnewswire.com/news-releases/news-releases-list/)", "score": 5, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "yes those are good resources too, but some require subscription i think", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}, {"body": "One idea I had was to search through my small-cap value ETFs and research each company\n\nIt seems like that would help with at least narrowed it down a bit", "score": 1, "replies": []}]}, {"body": "Personally I focus on just first just generic finance.yahoo.com/new search on something I like /want to learn or feel I have good understanding of the industry. Then just do simple google searches of it, make sure to go to their own site, see if it's worth going the extra mile for \n\nIf it’s something that gets a bite I’ll look into sites like [investor hub](https://investorshub.advfn.com/) and [stock twits](https://stocktwits.com/) , webull comments , search r/all  by the ticker seeing what comes up,. This is to obviously to get an idea of one, if there is any obvious manipulation of hype beasting but also on more niche companies/ unappreciated, those fourms can have good info from people who actually do a fair bit of their own due diligence to better understand common trends as you can read back forever. See how it correlated to previous prices \n\nSeems like a lot of investigating but it's necessary because when you are investing you should learn alot because it your hard earned  money not a meme so don't treat spending it like one.But if you keep hitting dead ends and finding nothing but claims, There is a high chance there is nothing substantial and thats a huge red flag.\nWhen all said and done you will be confident that it's the right time to jump out of the helicopter to land in the drop zone and pray the market is in your favor", "score": 3, "replies": []}, {"body": "Research helps. Following the news and asking yourself what the implications are helps. For example: as the convo around electric cars picked up - you gotta charge them somewhere. So you’d look up companies that make the chargers.\n\nI also like the “rule of 5.” If I see a newer product or service more than 5x, I will look into the company and consider investing. As more and more coffee shops added Square, I bought in. Saw a lot of Teslas in California - but that’s a given. When I started seeing them in my neighborhood in New York? I decided to invest.", "score": 3, "replies": []}, {"body": "I look through small and midcap etfs for things that look interesting look at the best performing stocks in them.", "score": 3, "replies": []}, {"body": "Dude me too. GME finally pushed me to make an account on Fidelity", "score": 6, "replies": []}, {"body": "You used to find great info here.  With all the GME bots, it's hard to find much useful here in the last month or 2.", "score": 2, "replies": []}, {"body": "Search a sector or product type, etc for companies that meet that criteria/business that you are looking at. I like to look at the different ratios compared to others in the industry but especially price to sales. See what the analyst rating is and a dive into their products if I'm not already familiar. See what their website says. There has obviously been a massive jump to EV and clean energy. I think 5G, VR/AR, etc are the future. Looking for companies that are involved in the production or sale is where I would start.", "score": 2, "replies": []}, {"body": "ERJ. Thank me later.", "score": 2, "replies": []}, {"body": "I've been looking through ETF holdings sometimes and looking at charts.\n\nRealistically you're just gonna be staring at your screen maybe chatting with 3 other people on stock twits wondering why no one is seeing what you're seeing.\n\nThen being punished on market downturns but without the recovery part.", "score": 1, "replies": []}, {"body": "Jmia the African Amazon or Sunrun solar(run) look into those.", "score": 1, "replies": []}, {"body": "Based on analysts or investment magazine editors reviews someone more credible. One would be like \"2021 best growth stocks\" from search engines.", "score": 1, "replies": []}, {"body": "Also major stock brokerages have excellent sources. You can down load put on a spread sheet filling in the financials, industry, ratings etc.", "score": 1, "replies": []}, {"body": "Yahoo financials almost the oldest online source.", "score": 1, "replies": []}, {"body": "I often check bar charts for both the 52 week high list an the 52 week low list. Some of my best investments have been from checking those lists and finding companies I’ve never heard of.", "score": 1, "replies": []}, {"body": "Expi is an example of a outstanding stock that performs outstandingly for 4 quarters in a row and no one seems to be talking about it.", "score": 1, "replies": []}, {"body": "B r e z ticker symbol", "score": 1, "replies": []}, {"body": "I think you need to find your investment style or copy someone who you like. You need to know what and why you’re buying it. I use [whale wisdom ](http://www.whalewisdom.com) to see what hedge funds are doing.", "score": 1, "replies": []}, {"body": "Some sites allow you to basically filter out every stock with any fundamentals you like. Use it as a list of stocks to then carry out further DD on before investing.\n\nStockopedia has brilliant stock screening system as well as an interesting scoring system  and gives a 14 day free trial for any email address without the need to enter any bank details. Normally several hundred pound per year to have a account.\n\nThey also have many pre-made screens created by professionals. \n\n50% of my portfolio is based on stocks I initially found on stockopedia screens. Every single one is in the green and only one I had previously heard of.\n\nI usually filter:\nMarket Cap\nValue score\nQuality Score\nRevenue growth\nNegative debt", "score": 1, "replies": []}]}
{"title": "Why AMC is Trash and why you should not hold", "selftext": "I was going to post a long drawn out message about why AMC has potential and why we should believe in them in the long run but all that got tossed out the window when I eventually came across their Movie Streaming service: [https://www.amctheatres.com/about/on-demand](https://www.amctheatres.com/about/on-demand) which I had to do WAY to much digging to find out it even exists (SMH).\n\nI'll start by explaining the difference between Box Office sales vs Streaming.  Streaming is like DVD sales, where the production company must sign over rights to the movie to the service which eliminates any chance at residuals such as Box Office sales which is where a majority of their profit lies.  My theory is that this is why we've only very few \"good\" movies recently, most of the production companies are sitting on their canned file waiting for COVID to be over.\n\nWhy I think AMC dropped the ball...  AMC, like other movie theaters already have agreements in place to share \"Box Office\" proceeds with the production companies.  I'm not sure why they wouldn't get creative and offer this same model up during COVID and get a leg up on their competition (Amazon, Google, etc...).  My guess, the same reason that I had to spend an hour doing DD just to find out that the only reason I could see them being viable into the future, they ALREADY had a product for and just don't do anything with.  Their leadership is completely incompetent and the company was being shorted into bankruptcy for a reason.\n\nAVOID AMC like the fucking plague stock that it is...", "id": "lbauct", "created_utc": 1612311683.0, "score": 0, "upvote_ratio": 0.15, "num_comments": 70, "comments": [{"body": "We don't take orders", "score": 77, "replies": []}, {"body": "Sir, this is a Wendy’s", "score": 130, "replies": []}, {"body": "We don't read, so u must be one of them.", "score": 74, "replies": []}, {"body": "Wtf does that even mean", "score": 54, "replies": []}, {"body": "Ban", "score": 18, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "First rule of fight club", "score": 2, "replies": []}, {"body": "Thanks for the heads up, joined!!!", "score": 1, "replies": []}, {"body": "DELETE", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -70, "replies": [{"body": "Actual bot", "score": 5, "replies": []}]}]}
{"title": "$GME, what comes next?", "selftext": "Let's establish the main opinion behind what I am going to type - GME  will not become bankrupt in the short term. If you believe GME will go  bankrupt within the next few months, then my thesis is completely  broken.\n\nThe shortsellers were betting on bankruptcy. That's why they dared to  short GME >100%. If GME went bankrupt, they would get more money than  what GME was initially worth.\n\nThat's literally printing money out of thin air. But it absolutely  requires GME to become bankrupt, so that the extra shorted shares will  never ever have to be bought back.\n\nNow, if we can agree GME won't go bankrupt at this point. So what happens next?\n\nWhen the share price drops, 3 things happen:\n\n1. paper handers sell\n2. diamond handers buy\n3. short sellers must cover\n\nAs prices drop, #1 will get fewer as they sell. Since share price won't  go to 0, #3 will want to cover at the dip as much as possible. #2 will  buy in massively. At this stage, liquidity evaporates. What happens  then? MOASS.\n\nThis is why you see the drop in VW's short squeeze graph right before their squeeze. The trigger for the squeeze is Porsche announcing its big dick stake, which immediately made everyone realize that VW stock is no longer liquid.\n\n&#x200B;\n\nAlternatively, we might see a $TSLA like slow squeeze, as earning numbers come in and short close out slowly 1 by 1 from the bottom up. For this, we will need to trust Papa Cohen. ❤️\n\n&#x200B;\n\nPositions: 1000 GME shares,   💎🍆🙌", "id": "lbcin7", "created_utc": 1612316846.0, "score": 218, "upvote_ratio": 0.88, "num_comments": 80, "comments": [{"body": "5 shares here HOLDING THE LINE", "score": 121, "replies": []}, {"body": "I just really like the stock.", "score": 57, "replies": []}, {"body": "This is like the South Park episode where Randy Marsh is all bloody and beat up but then said, \"I didn't hear no bell\" and proceeded to beat the living hell out of Bat-Dad.", "score": 90, "replies": [{"body": "I love that you’re referencing an homage to Rocky V", "score": 9, "replies": []}, {"body": "It’s more like that one episode when they made a shit ton in the casino and then lost it all because of retardation", "score": 3, "replies": []}]}, {"body": "If you average up with each ATH, then you'll eventually reach the peak of the squeeze.", "score": 28, "replies": []}, {"body": "r/PowerDeleteSuite", "score": 55, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "RH is not the only broker in town, I just added 200 yesterday from IKBR.", "score": 30, "replies": [{"body": "Even ikbr is shit. Right now, it seems Fidelity (my brokerage) and Vanguard are the only dependable ones. No surprises that they own significant shares of GME.", "score": 11, "replies": [{"body": "> Even ikbr is shit. \n\nLess shitty than RH. heh", "score": 4, "replies": []}]}]}, {"body": "People are switching to brokers that aren't limiting purchases.", "score": 3, "replies": []}]}, {"body": "Enjoy the hopium. \n\nThat said, I'm looking forward to seeing Ryan Cohen's plans for turning GME around. It's less a short squeeze play now and more of a fundamental one.", "score": 19, "replies": [{"body": "Yes. I can't wait for Cohen to do his chewy magic again! It will be so awesome to see. Given the hype in GME now, I think he is so primed to execute the biggest turnaround story of the millennium.", "score": 28, "replies": [{"body": "I think a good ending to the story would be how WSB gave GameStop global interest and Cohen takes the reins and moons the company.", "score": 30, "replies": [{"body": "I love your line of thinking.", "score": 15, "replies": []}]}]}, {"body": "I’m actually gonna play this long-ish once it finds its bottom I think.\n\nEdit: Not that anyone asked lol. Was thinking out loud.", "score": 19, "replies": []}]}, {"body": "Bb gang and a little GME", "score": 2, "replies": [{"body": "Thinking calls might be good?", "score": 1, "replies": []}]}, {"body": "Except in a best case scenario it's still a $60 stock", "score": -1, "replies": [{"body": "Best i can do is 4206.90", "score": 19, "replies": []}]}, {"body": "Stage 3 of Grief: Bargaining", "score": -29, "replies": [{"body": "Why are you downvoting? He's right!", "score": -9, "replies": [{"body": "They will understand when they hit Stage 5. Acceptance", "score": -10, "replies": []}]}]}]}
{"title": "John Deere Earnings Play", "selftext": "Got a strong feeling $DE is going to crush it on earnings in two weeks. Follow me here:\n\n**Pacific ocean La Nina that started summer 2020 is the strongest on Record since 2012**\n\nhttps://www.climate.gov/sites/default/files/ENSOblog_202101_EDD_ERSSTv5_large.png\n\n**Strong La Nina = drought = reduced soybean yields. There's a 1:1 matchup of the last major La Nina (2011-2013) and the last big dip for soybean yield.**\n\nhttps://ourworldindata.org/grapher/soybean-yields?tab=table&time=2013\n\n**Reduced soybean yields + unprecedented Chinese demand = huge spike in soybean prices**\n\nhttps://www.marketwatch.com/story/why-soybeans-may-be-headed-for-their-highest-price-in-6-years-11600450312\n\n**Largest US crop export by far is soybeans**\n\nhttps://www.fas.usda.gov/sites/default/files/2020-07/2019-export-yearbook-final.pdf\n\n**Biggest spike in soybean prices in 8 years means US farmers will be upgrading equipment. There's nothing farmers love more than buying a shiny new tractor with all the options on cheap credit with high grain prices.**\n\nhttps://www.stltoday.com/business/columns/david-nicklaus/nicklaus-rising-grain-prices-buoy-hopes-for-farm-economy/article_1b8a3c9f-85e2-5703-af8c-ef5ba8cfa33b.html\n\n**From the article:**\n\n\"Born, who grows corn and soybeans on 120 acres near Lovington, Illinois, about 135 miles northeast of St. Louis, feels confident enough that he’s investing money to upgrade aging farm equipment. The fact that soybean and corn prices are at six- and seven-year highs made that decision easier.\n\n“I have some equipment updates that are necessary capital expenditures, and you have to make hay when the sun shines,” Born said. “It has been a relatively exciting ride here in the past few months.”\n\n\n**tl;dr: $DE 2/19 $315c**", "id": "lbgjic", "created_utc": 1612330103.0, "score": 57, "upvote_ratio": 0.71, "num_comments": 73, "comments": [{"body": "Getting gourd vibes from this", "score": 89, "replies": [{"body": "Decorative gourds", "score": 10, "replies": []}, {"body": "I was just going to say this! \nFuck it, I'm in.", "score": 1, "replies": []}, {"body": "Sounds promising then", "score": 1, "replies": []}]}, {"body": "Fucking John Deere?", "score": 31, "replies": [{"body": "it's in kathie wood's arkq etf. i'm buying today and holding long term.", "score": 2, "replies": []}]}, {"body": "(Tomorrow’s News) “REDDIT DROPS ____________ FOCUSES ON JOHN DEERE”", "score": 27, "replies": [{"body": "Their pants", "score": 6, "replies": []}]}, {"body": "Nice a solid dd and anything non GME for a second\n\n[$CORN](https://finance.yahoo.com/news/corn-powers-5-soybeans-spike-063244731.html) is soaring right now too but I was a day too late on its rise and didn’t get in, either way I heard wsb lost on $CORN before", "score": 13, "replies": []}, {"body": "Finally something different. Thanks", "score": 30, "replies": []}, {"body": "The Chinese Trade Deal was supposed to get a lot of soybeans bought and I think that was the expectation. Unfortunately China never met the phase 1 numbers and that could hit bad since agriculture was expecting another 13 billion in purchases this last year.\n\nEdit: It's actually 5 billion in US agricultural exports. 13 billion is what the U.S. failed to meet on their end. China basically purchases most of their soybeans from Brazil. They let us pick up the slack when it's winter there. They also opened up more markets in other countries for soybeans after the trade war thingy.\n\nI know absolutely nothing about anything but for some reason I remembered this information from somewhere.", "score": 7, "replies": []}, {"body": "What about the fact metal prices are up so that will reduce earnings?\n\n$TSLA had 4pts higher cost per car due to commodities rising which contributed to the EPS miss. I could easily see $DE having good revenue growth but missing on earnings.", "score": 8, "replies": []}, {"body": "Farmers don't upgrade equipment in droughts. \n\nThe high soy beans prices reflect the reduce soy beans yields. Reduced yields mean farmers aren't earning as much - so they can't afford to upgrade equipment.", "score": 6, "replies": []}, {"body": "https://finance.yahoo.com/quote/DE?p=DE&.tsrc=fin-srch\n\nIt is crazy when you take this view of a stock and see how inflated prices are.  Switch chart to max.", "score": 3, "replies": [{"body": "Where do you think inflation went? Consumer inflation has been stagnant even with the Fed’s printing money. All that inflation went into equities. \n\nOverlay drop in interest rates and printing money with stock prices and you see they go hand in hand", "score": 1, "replies": []}, {"body": "It's a beautiful long-term growth chart, not a blow-off top. Sure, all equities are boosted by the Fed, but Deere is an *incredible* company with great execution. They have equipment to sell at every class (farm, compact, medium, heavy). Construction companies benefited heavily from the last decade's economic growth. They're also innovating through research in autonomous farming.", "score": 1, "replies": []}]}, {"body": "Deere had a difficult time meeting demand last year in the sub 100hp market. This year looks to be the same. They still haven't upped production enough. I work at a deere dealership and we can't get enough product to sell. For what its worth", "score": 3, "replies": []}, {"body": "Interesting, I’ll keep an eye on it. Thanks for the post", "score": 7, "replies": []}, {"body": "OP was correct on this, and a or of dumbasses here will continue to miss the boat on DE.", "score": 2, "replies": []}, {"body": "Interesting. Worth taking a look. Thanks!", "score": 4, "replies": [{"body": "😂 who are you? You clearly don’t belong here. Not when you talk like a FUCKING BOOMER. \n\nI sense that you are some paid little man", "score": -24, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**DE**|**$315**|**BUY CALL**|**2021-02-19**|**$4.67**|**$302.54**|**27**|**13**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckkozrufj07ih07018w0zctua) | [Track Record](https://www.pickmojo.com/user/shitmonster1488/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 3, "replies": []}, {"body": "Buy more GME🚀", "score": -17, "replies": [{"body": "better off somewhere else bud..too risky..i’m holding, but can’t lose anymore", "score": 5, "replies": []}, {"body": "🙄", "score": 1, "replies": []}, {"body": "[deleted]", "score": -14, "replies": [{"body": "No. No we haven’t.", "score": 0, "replies": []}]}]}, {"body": "Hold GME\n\nAlso, nice DD. Wife's boyfriend might let me get a couple hundred for my RH account for this one", "score": -10, "replies": []}, {"body": "57 day account 😂😂😂\n\nNice try, you fucking 🤡", "score": -21, "replies": []}, {"body": "Position Stats: DE 315C 02-19-2021\nRecent best performance: 117.39%\n[Price history chart](https://tendiechart.com/pricehistory.cfm?symbol=DE&date=1613692800&s=315&t=C)", "score": 1, "replies": []}]}
{"title": "Do the the skeptical claims about GME even make sense?", "selftext": "Alright, I'm not going to pretend that I have a deep understanding of finance, but some of the comments expressing skepticism about GME reek of pure bullshit. Here's some of the recent claims I've been seeing.\n\n**1. The shorts have covered!**\n\nThe poster usually cites the massive drop in SI as reported by S3. Something like \\~120% going into Friday, down to \\~51% going into Monday. So, from a basic supply & demand analysis, this doesn't add up. Volume was relatively low compared to Mo/Tues/Wed and the prior week, most likely due to heavy restrictions (or outright bans) on buying GME shares on brokerages who ran into liquidity issues. If it were true that the shorts closed a massive portion of their short positions—purportedly \\~70%—on Friday, then we would've seen a massive hike in price because shorts would've been scrambling to buy, along with the few institutional/retail investors who weren't restricted from buying. This basically would've been the squeeze. But that's not what happened. The price did increase, yes, but it didn't massively spike, not to the degree that it would have had the shorts legitimately bought back shares *en masse,* as is being claimed.\n\n**2. Sure, but that just means that new shorts opened up at the top, that's why the price didn't spike to squeeze levels!**\n\nNo, this can't be correct. If enough new short positions were opened Friday to artificially suppress and \"hide\" the supposed *massive* covering of short positions, then the SI reported by S3 would not have gone down—at least, it would not have decreased from \\~120% to 51%. At this point, claims 1 and 2 aren't even compatible. They can't both be true at the same time. My guess is shorts have been \"averaging up\" their short positions the entire time in a rolling fashion. Everyone knows the price will crash after the squeeze happens, so it seems unlikely that shorts who were willing to risk bankruptcy over this would suddenly throw their hands up, cover most of their positions (even if it were possible in this short time period) and then not take out new positions at the height to recoup losses on the way down. It would seem more likely that the SI hasn't actually decreased much at all, much less over the past 4 trading days.\n\n**3. The shorts closed/are closing their positions this week! (Mo/Tues)**\n\nAgain, I don't see how this would work. How could shorts be closing *en masse* while the stock price is in free fall, like it has been the last two days? When shorts close their shorted shares, they buy the stock. So, if the claim is that they've been closing their earlier short positions this week, then shouldn't we realistically have seen an increase in price? Especially with Monday's low volume? At the very least, the price should've stabilized, not plummeted.\n\nIt seems literally impossible for a massive buy back of borrowed shares to have occurred over the past 4 trading days while SI supposedly plummeted **and** without the price spiking to infinity, especially when those days were relatively low in volume in comparison to the days leading up to them.  One or more of these claims has to be false, right?\n\nMaybe they did massively cover and new short positions were opened to suppress/crash the price simultaneously. In that case, SI should've stayed relatively stable or gone up, not crash from previous estimates.\n\nIf the SI really did crash, meaning shorts massively covered their outstanding positions, then price should've erupted.\n\nIf we just ignore the estimated SI entirely and assume that the shorts covered a while ago, and the spike at the AH last week was \"the squeeze.\" That doesn't make sense though because why would shorts have tried to exit by buying back shares at the height of international attention? Between the shorts buying mass amounts of shares to cover and the gigantic wave of new retail investors wanting to get in on the squeeze, the price would've exploded well beyond what was achieved because who the fuck would've been selling at that point? What seems more likely is that the AH was simply a result of the insane media coverage and bullish hype drawing in lots of new long investors, both retail and institutional.\n\nHopefully someone can explain what I'm missing because I feel like I'm going crazy reading all this skeptical shit when half of it contradicts the other half.  I realize there are legitimate concerns regarding GME moving forward, but it seems like much of the original squeeze thesis is still viable. Am I just retarded?   💎🙌", "id": "lbi6em", "created_utc": 1612336724.0, "score": 336, "upvote_ratio": 0.93, "num_comments": 74, "comments": [{"body": "Someone could literally live stream a full seminar with factual information verified by Jesus, and at this point the sub would just go “hmmmm” well what does everyone else think?", "score": 228, "replies": [{"body": "Nobody knows for sure what happened, but here's my two cents.\n\nMelvin claims they covered their shorts, reported early Wednesday. Of course we don't know if they're being truthful. But that same day GME spiked from 150 to 370. That huge spike would be consistent with a massive shorter covering.\n\nGME hovers at around 300 on Friday. Since then it has been a straight line down. Reports coming out that short interest in GME has decreased dramatically. Also important to remember that most longs are also institutions, not retail traders.\n\nI think the logical conclusion here is quite obvious based on what we know. Melvin did cover on Tuesday-Wednesday. that explains the huge price hike we saw between those two days. No more short squeeze buying pressure. Long institutions realize this first, and sell off, hard. Retail is left holding the bag.", "score": 25, "replies": []}, {"body": "Hmm. GME should've exploded if shorts were covering. I would've predicted about a 1000% gain over the course of a few days.. Why hasn't that happened?", "score": 9, "replies": [{"body": "Nice how’d you calculate 1000% gain?", "score": 33, "replies": []}, {"body": "You're just pulling numbers out of your ass. From 90 Monday to 350 Wednesday is already quite significant.", "score": 5, "replies": []}]}]}, {"body": "Don’t look now $74USD in Germany. GUH.", "score": 138, "replies": [{"body": "Hahaha", "score": -60, "replies": []}]}, {"body": "I just really like the stock.", "score": 103, "replies": []}, {"body": "Honestly, each and every entity are in on the scam. Hedge funds, brokers (robinhood), clearinghouses, media, and skeptics. This is an and all ways will be an uphill battle. Just diversify your portfolio my ninja", "score": 75, "replies": [{"body": "your right.  This is a play by play\n\nhttp://counterfeitingstock.com/CS2.0/CounterfeitingStock.html", "score": 16, "replies": []}]}, {"body": "I think blood is being sucked out of the people throughout the day, not those that are holding. Price manipulation downward, fear, sell, loss, and repeat.\n\nThere has been a crazy amount of money that was made due to an absurd influx of inexperienced traders, price manipulation, and day trading.\n\nYou’re only looking at the short selling, these people have a bit more up their sleeve.", "score": 11, "replies": []}, {"body": "It's over for me\n\nIt's so over that I'm not selling anything. 💎🙌\n\nIn a more serious tone, I have the increasing feeling that we're being played right now in a war between HFs. All the laddering has to be the work of HFs being short, and volume shows that liquidity is just not there, no matter how much it drops. The only moment I saw a spike in volume this week was at upwards spikes, with sells trying to lower it fast.\n\nBut it is also telling that there is no buy volume either. To me it seems other HFs are lying in waiting for their moment to pounce, drive this up on a squeeze and leave the rival HFs in the dirt. I cannot make a lot of sense otherwise to the huge volume on way OTM calls for this Friday.\n\nThe other players that are eerily silent (sure they have some good reason) is GME management. They have kept completely mum, but also they don't have triggered a secondary offering, when AMC jumped at the first opportunity it got. THis is very conspiranoid, but maybe they know something, or they're being told to wait by bigger shareholders.\n\nI'm retarded and all of this may just be the mad ramblings of an old monke holding banana", "score": 33, "replies": [{"body": "Hey at the end of the day we are all monkeys rambling holding a banana stay GME STRONK my friend 🦍💪📈🍌💎💦👾", "score": 5, "replies": []}]}, {"body": "You have some good points. I have another thought provoking question though. My numbers are rough but if gme has about 50m shares float and volume of shares are anywhere from 30m on a slow day to hundreds of millions (I think) on big days, I don’t see how it would be hard for people to buy shares to cover shorts when volume is that big of a portion of the shares...", "score": 26, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 26, "replies": []}, {"body": "You're missing the memes, emojis, and funny phrases on this post. Entirely too long.", "score": 25, "replies": []}, {"body": "I dont need to read all these posts, im just holding and chilling with my brothers. In the end we will know who the true retards are with their diamond hands.", "score": 2, "replies": []}, {"body": "FUD? This is a copy pasta", "score": 6, "replies": []}, {"body": "🤡you holding?", "score": -26, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Holy shit. Calm down Chad Dickens.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}]}]}
{"title": "GME brief recap. Why did you buy GME in the first place? Hope to see more DDs instead of cultposting. Love you guys 🚀", "selftext": "TLDR: Brief recap - fundamentals are still fun, and may be getting better. Upgraded Ryan Chewy + Reggie Nintendo, MSFT deal with rev share, pc building kiosk 1.5 store, console cycle, e-commerce growth and pivot. Probably missed some. Now with free worldwide exposure.\n\nI am not trying to gatekeep whatever you guys want to post, but remember the time when people actually called GME stores to ask about pc kiosk (with recordings even)? Those type of posts are probably more useful if we want GME to moon. I think we all prefer the confirmation bias from more detailed fundamental DDs like those than posts about people holding the line. Maybe it's just me, but I would prefer people from all over the world knowing about how GME is a value play than a short squeeze play. Anyway, here's a brief recap on the 'fundamentals' to hopefully bring more fundamental DDs back.\n\n**Upgraded Ryan Chewy + Reggie Nintendo**\n\nI think we know who Ryan is. In short, Ryan grew Chewy by like, a lot, using little capital. Now Chewy competes against AMZN, etc. I don't have pets since I can't even take care of myself so I have not used Chewy, but an edge Chewy has against AMZN is apparently their customer service. All these growing Chewy means Ryan is now more experienced and has more connections than his Chewy days aka upgraded Ryan with bigger rockets.\n\nYou know who else is all about the customers? Reggie Nintendo. If you tards don't want to read, there are videos out there about Reggie and how his customer-oriented approach is pretty critical to Nintendo's success in freedom land. \n\nNote: I have seen some people saying how they did not really like GME in the past. Maybe Ryan + Reggie can change that.\n\n**Microsoft revenue sharing**\n\nGME will share revenue from all digital content: DLC, full games, microtransactions, xbox game pass, etc. This applies to both new and pre-owned systems. If someone bought the xbox at Walmart and then sold it to GME, GME would get a share of revenue on that system once it is resold. That's a pretty big deal itself, but here's a bigger implication: This is an incentive for GME to push MSFT systems. Will Sony, etc have a similar agreement with GME to mitigate this preferential treatment for xbox?\n\n**PC building kiosk**\n\nKnow microcenter? I don't, because there is not one store near me. But from other DDs, apparently to get high end pc stuffs you need to either buy them online or drive hours to a microcenter. With the spread of GME stores, it doesn't take much to see how much advantage they have. Older DDs have people literally asking GME employees about pc kiosk 1.5 store. Now imagine this:\n\n\\- All the used parts they could offer to people wanting to upgrade frequently\n\n\\- Ease of building a pc + all in one package. The thing about building a pc is you really need to make sure the parts are right for each other and right for you or risk getting ripped off. PC building kiosk means you don't have to know about ALL the specs to get a suitable pc. Combined with purchasing games, accessories, special deals for powerup members, collectibles, third party exclusives, etc all in one application or location for sYnErGy and you get 🚀. Why go elsewhere when you can have everything in one place? Best part is you don't even need to build it yourself. Someone else can eat that thermal paste for you. Worry about bending a CPU pin? Not really your problem at the pc kiosk.\n\n\\-  Want further synergy? Logistical advantage with having a store near you and knowing what's popular. With the right data, they may really cut down on the waiting times for a buyer on popular parts if not outright branded as 'never out of stock'.\n\n**Conclusion**\n\nGME's turnaround story has not changed. GME just got an added worldwide exposure. Is $500 a fair valuation based on fundamentals alone? Maybe not, but with the focus on digital growth, it wouldn't surprise me if GME gets a tech-like valuation. Like one of our favorite analysts once said, GME is a disruptive EV company after all. Anyway, I got lazy and left out lots of other good stuff. If you want more, just look into older DDs. The sources are in those, too.\n\nPosition GME @ $30+. Never sold. Also holding some CRSR.\n\nWhat about the squeeze?", "id": "lbma8f", "created_utc": 1612354509.0, "score": 344, "upvote_ratio": 0.93, "num_comments": 72, "comments": [{"body": "HF shorting didnt stop at all.\nIn fact they have increased their shorts.\n\nhttp://regsho.finra.org/CNMSshvol20210201.txt\n20210201|GME|6982444|364890|12820226|B,Q,N\n\n\nhttp://regsho.finra.org/CNMSshvol20210202.txt\n20210202|GME|16358136|1073011|29733410|B,Q,N\n\nit perfectly explain the 70m volume on 2/2, as it shown 29m trades were from shorts.", "score": 65, "replies": [{"body": "This is interesting...  so they’re playing the long game?  Hoping we’ll get bored?", "score": 49, "replies": [{"body": "They are trying to make the share price 0\nIt is the only way they can unwind the naked shorts because they dont have to buy back", "score": 8, "replies": [{"body": "Pre-market direction isn’t going to zero...", "score": 2, "replies": [{"body": "Never trust premarket numbers. It's literally the manipulators' playground.", "score": 3, "replies": [{"body": "Building the hype?  Maybe the hype will work against them...", "score": 1, "replies": [{"body": "Still watching the share price? New hires in GME is a very bullish news.\n\nShort sellers will try very hard to bring the price down. It's probably their last chance.", "score": 3, "replies": [{"body": "When I look at the order book- it seems there are more buyers thank sellers. Am I wrong?", "score": 1, "replies": [{"body": "I believe you are right on this.", "score": 2, "replies": []}]}, {"body": "Could we be keeping up with the price manipulation?  We’re buying their offering instead of them buying/selling back and forth?", "score": 1, "replies": [{"body": "I suspect this depends on how the brokers match the buyers and sellers. What if they intentionally match the manipulators together?", "score": 2, "replies": [{"body": "I guess I wouldn’t be surprised if that’s correct...", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "The fact that GameStop successfully fought to get themselves labeled as essential during covid, I found pretty impressive. \n\nRC seemed serious about his intentions to make the company successful.\n\nThe stock was really cheap.\n\nLastly, the fact that the stock was so heavily shorted, told me that as things started to turn around, those short positions would start to cover and we'd see the price gradually increase even more. \n\nI wasn't expecting to see $500 a month or two later, but I'm not complaining.", "score": 32, "replies": []}, {"body": "I bought in at 40, saw the whole hype but also liked that they plan to go into computer industry.. helped that Michael burry had a position . Dude predicted 2008", "score": 15, "replies": []}, {"body": "The PC accessory market is a UGE market in its own—- and they are perfectly positioned.", "score": 28, "replies": []}, {"body": "I just love the stock", "score": 13, "replies": []}, {"body": "Gamestop is the only service I have that actually will do same day delivery. Ordered some custom controllers yesterday afternoon and got to my front door before I was off work. If they can keep that up, I seriously have no reason to go out and buy stuff if it can get to me in the same time I'm sitting in traffic.", "score": 7, "replies": []}, {"body": "When did this sub turn into r/investing?", "score": 9, "replies": []}, {"body": "Short squeeze and/or long term hold. Think it is worth $20 right now, could be worth $100 when it transforms to online ecommerce. I would rebuy some if it drops to 20 to 30", "score": 9, "replies": []}, {"body": "Great summary. At this point I don't even need the squeeze as a reason to hold my shares. GME is heading to the moon anyway 🚀🚀🚀🚀", "score": 2, "replies": []}, {"body": "What about the squeeze?\n\nYou mean the one where it went to $480+ a share? That was it bro.", "score": -6, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -7, "replies": []}, {"body": "yeah $GME is still a pretty value stock with pretty good outlook definitely not worth $500/s though... maybe low $200... lol", "score": 1, "replies": []}, {"body": "I bought it at 40$ per cause I believed that Ryan Cohen could turn GameStop into Chewy an e-commerce focused business with some brick and mortar side gigs. Expected to get a 50% gain from this not a 500% which was pretty nice", "score": 1, "replies": []}]}
{"title": "GameStop Irony", "selftext": "Besides all the noise what do you guys see in this company?  What am I missing.  I am long term investor and love to make some quick cash.  I don't like the current stock manipulation and I think Wall Street made a bad decision.  Conspiracies aside what is good about GameStop?  Not to long ago you could see trending stories about how GameStop has the worst business model, customer support, and trade in prices.  I myself rarely bought anything from GameStop because it was never convenient.  It was like going to a car salesman which I now do online too. PC games for the most part were always sold online.  I remember as soon as consoles caught up to online downloads I never bought a physical game again.  GameStop's atmosphere always sucked and looked like a dated museum.  I much rather of gone into BestBuy or Target.  GameStop is also a pawn shop model with games and gimmick collector toys.  eBay & Amazon already dominate this used market.  People want to buy new things and the used market has been established for a long time.\n\nWhat is positive about GameStop?  The pre-order line waits and the memories having to wait for Halo or Gears of War.  That is an archaic thing that no one longer does.  Pre-orders can be placed from the comfort of a home and the download queued.\n\nGameStop recently hired a eCommerce CEO.  The only thing that can keep GameStop going at this point is consumer loyalty.  No one is buying from GameStop.  All of the GME shareholders do not buy games from GameStop and will not.  Shareholders are obsessed with hording money and making money.\n\nSo after Wall Street short sellers are beaten, I believe GME will become a worthless piece of trash.\n\nEdit: Also another note I think WSB will just become Wall Street after this.  Once the money transfers all the crooked shady ruthlessness' will continue online on chat forums like this one.", "id": "lbqkik", "created_utc": 1612367609.0, "score": 0, "upvote_ratio": 0.23, "num_comments": 72, "comments": [{"body": "[deleted]", "score": 59, "replies": []}, {"body": "You’re literally posting in the epicenter of the trade on GME. There’s a search bar. Too busy holding to do your research for you", "score": 20, "replies": []}, {"body": "I like the stock", "score": 17, "replies": []}, {"body": "You're a long term investor that loves to make quick cash?\n\nI don't think you know what words mean, retard. \n\nGet your paper handed bitch ass out of here.", "score": 48, "replies": [{"body": "I follow WSB to make a short term gain nothing more.  Most long term investor though.", "score": -15, "replies": [{"body": "We are here to make short term losses", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "I am just saying it's ironic that a trash company is used like this and everyone thinks they are any better than Wall Street at this point.  Usually after a short sell the company dies and life moves on.  Let the company go gracefully.", "score": -11, "replies": []}]}, {"body": "It’s a turn around project.\n\nUpdate the stores. Turn them into the equivalent of card shops but for video games - host tournaments and what not.\n\nIf the PC building kiosk rumors are true, that’d be so much better than having to order everything off the internet.\n\nThere’s potential", "score": 10, "replies": [{"body": "Tournaments like NFL or NBA brand?", "score": -1, "replies": [{"body": "Like super smash bros and league of legends or whatever - video games", "score": 3, "replies": []}, {"body": "Anything. Fighting games, sports, shooters, whatever.\n\nIf I were them, I’d have a dedicated night during the week for certain communities, as well. There’s a good fighting game community, so they could have like Wednesday Night Fight Club or w/e.\n\nIt’s so much better playing games with other people in person instead of hoping both connections stay stable - especially with fight games. People would love that, imo \n\nThere’s a lot of good ways to cater to the gaming community.", "score": 4, "replies": []}]}]}, {"body": "[https://www.youtube.com/watch?v=GZTr1-Gp74U&t=1740s](https://www.youtube.com/watch?v=GZTr1-Gp74U&t=1740s)", "score": 6, "replies": [{"body": "Damn this guy called it back in July. Fucking gamer", "score": 1, "replies": []}]}, {"body": "I think the company is getting more than it's share of free publicity. And lots of ppl here will support the company in other ways now than buying and holding the shares. Seen ppl buying gift cards and donating them to children in hospitals for instance.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "AMC is just another one of the failures.  AMC and GameStop have the same future I think.", "score": -2, "replies": []}]}, {"body": "You must be new here, retard. Feel free to research for gamestop transformation, chewy and Ryan Cohen", "score": 10, "replies": []}, {"body": "GameStop needs to push into a new market; competitive gaming, gaming lounges, or maybe some sort of VR gaming platform. I think a way they could do this is by partnering with AMC... They could turn unprofitable theaters into gaming lounges or competitive gaming arenas. Have gaming kiosks in the AMCs that you could test out/rent out games, have like a VR gaming platform in the lobbies, or maybe like gaming tournaments with feeds hooked to other movie theaters. Right now everyone plays games at home by themselves... Imagine if you could get them to come together in one place to game/compete and you can sell them pop(from midwest), candy/snacks, or alcohol at jacked up prices. Have god damn hookah lounges in some rooms, I don't know I think there's a lot of opportunity in the gaming industry right now. Ripe for innovation!", "score": 3, "replies": [{"body": "I can do that in my room.  Why drive to a game center and touch greasy equipment?", "score": 2, "replies": [{"body": "Community... We are social beings... because they'll release new games and equipment to gaming lounges that you can try before you buy, for a small fee....", "score": 3, "replies": []}]}]}, {"body": "RC ❤", "score": 2, "replies": []}, {"body": "GME - Power to the players", "score": 2, "replies": []}, {"body": "I was just in there over the weekend and bought the BioShock Collection for Switch for $20 (cheaper than online). I already own the PC version and replay it every year, but thought a Switch version might be fun too. The employees were fun to talk to. I also like the stock.", "score": 2, "replies": [{"body": "How busy was the store and was it worth the gas or public transport?", "score": -1, "replies": [{"body": "He walked", "score": 1, "replies": [{"body": "Most people don't though in America if they don't have to.", "score": -2, "replies": []}]}]}]}, {"body": "\"I much rather of gone into BestBuy or Target\" - see yourself out please..", "score": 2, "replies": [{"body": "So where do you shop?", "score": 1, "replies": []}]}, {"body": "\\*gets out his NO-SHIT stamp*", "score": 2, "replies": []}, {"body": "Definitely potential, but steady $90 from $4 potential? I think that it's being propped up by the \"revolution\" and emotional investors at this point who don't realize the rocket is on its way down. I would buy in around 20 or lower. Gamers have direct digital downloads. Esports already has major players and the pandemic continues to make gatherings difficult. Even swinging toward carrying PC Hardware is already outpaced by Newegg and every big retailer. \n\nI think GME could end up around $40 after the turnaround project if the turnaround project works. I think it would all ride on what esports moves they make.", "score": 1, "replies": [{"body": "Buying time turn around.  Don't think they can compete.", "score": 2, "replies": []}]}, {"body": "gme = next chewy.\n\nAlso don't be a paper hands bitch were trying to be punk and stick it to the hedgies.", "score": 1, "replies": []}, {"body": "i think they would be wise to try and work a deal with like valve or cdpr (gog) or epic games, etc. if they want to expand to digital they need to partner up with somebody, because that space is already crowded.\n\nthe need to keep some amount of the brick and mortar side for consoles, new and used. they need to make use of some of that real estate they're sitting on, so they should add shit to their inventory like actual gaming hardware, gpus, gaming mice, mechanical keyboards, ram, etc. expand their horizons a bit.\n\njust my 2c", "score": 1, "replies": [{"body": "Those stores are online now.", "score": 1, "replies": []}]}, {"body": "found the WaPo reporter", "score": 1, "replies": [{"body": "Check my post history more of a NOK guy.", "score": 1, "replies": []}]}, {"body": "I LIKE IT CAUSE IT HAS GAME I PLAYED ON MY PS3. THEN I BOUGHT MY GRANDSON THE PS4 AND HE SAID IT IS BEST GAME HE PLAYED TO. MY GRANDSON SAID HE IS NUMBER 1 PLAYER FOR CALL OF FORTNITE AND THAT HIS ONLY LOSS WAS DUE TO THE MACHINE AIMBOTTING HIM WHICH IS ILLEGAL AND HE WAS CHEATED TO BE LOSING. I AM BUYING GAMESTOP SO I WILL GET A DISCOUNT ON THE NEW PS4 I AM BUYING MYSELF ON MY BIRTHDAY SO MY GRANDSON CAN TEACH ME TO PLAY WITH HIM AND HIS GANG.", "score": 1, "replies": [{"body": "That's sad your grandson is a loser and plays with grandpa", "score": 1, "replies": []}]}]}
{"title": "I knew this would end bad - GME", "selftext": "I knew going into GME, that the rocket was going to crash hard. I don’t know why I thought we might actually see a thousand first though. So many lessons learned here. I would hate to be someone who threw their life savings at this thing. All over hype about “let’s take down a hedge fund.” “This is for 2008.” I hope everyone realizes that nothing has changed. And everyone who invested should be pissed they stopped it in its tracks at 500. Oh well. I can’t believe people are still buying in. I can’t imagine buying the top. You know it’s over when “wanna to be rappers” on Twitter, and your friends cousin are talking about taking down the establishment by trading stocks. At least next time I’ll know when to sell.", "id": "lbs0h2", "created_utc": 1612371218.0, "score": 0, "upvote_ratio": 0.18, "num_comments": 73, "comments": [{"body": "[deleted]", "score": 74, "replies": [{"body": "Wish I paperhanded at 400", "score": 6, "replies": [{"body": "Same bro", "score": -1, "replies": []}]}]}, {"body": "I hear ya paper hands", "score": 46, "replies": []}, {"body": "I thought the 9th was the day we found out if our short bus made it to the launch pad? 🚌🚀🪐", "score": 18, "replies": [{"body": "Possibly is,  no guarantees", "score": -17, "replies": []}]}, {"body": "RemindMe! 1 week", "score": 8, "replies": []}, {"body": "Imagine going to a Casino, winning in the Casino, and then having the Casino immediately change the rules to the game. Now stop imaging it and know this literally happened.", "score": 19, "replies": [{"body": "Yes, I agree. You should have anticipated something funny was going to happen. I did on Wednesday and got out with a big chunk of change. You are competing in the MOST competitive marketplace in the history of the world. You thought they were just going to bend over and take it? Naive. Welcome to the real world bro. Hopefully this doesn't make you bitter and instead you learn a lesson from it.", "score": 5, "replies": []}, {"body": "I agree", "score": 3, "replies": []}, {"body": "Sound like a bag holder. Next time sell when your up. Thanks you for holding my bags and getting bent over", "score": -13, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "No I bent you over at $310 and $400.", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Doesn’t look like it from where I’m standing. Good luck holding this shit down to the earth bud.  The fad is dead. No one cares anymore.", "score": -2, "replies": []}]}]}]}, {"body": "Do you know where you are? This is not r/stocks", "score": 4, "replies": [{"body": "WSB is about making big gains. Not about being a cult follower and bag holding for no reason. If you made 3-10x and didn’t even take any profits yes you deserve to lose it all.", "score": 3, "replies": [{"body": "Looks over at the tesla cult...and yes I'm there as well.", "score": 2, "replies": []}]}, {"body": "Sounds like your new to the sub.", "score": 2, "replies": [{"body": "Mhhm ya that's it...I was here at 200k but ya I'm the new one.", "score": 2, "replies": []}]}]}]}, {"body": "Imagine then continuing to play insisting the old rules still apply, whilst the casino manager shakes his head in disbelief and continues to pocket your money.\n\nBut hey, DiAmOnD HaNdS", "score": 0, "replies": []}]}, {"body": "fuck off :D", "score": 25, "replies": [{"body": "Mad your down?", "score": -21, "replies": [{"body": "Lol he has lost it all based off of hype from 17 year old retards on the internet. At the root of it is greed and low iq", "score": 4, "replies": []}, {"body": "Nope not at all actually.  You just don't know how to read a room.", "score": 3, "replies": []}, {"body": "I'm actually up :)", "score": 1, "replies": []}]}]}, {"body": "Oh ye of little faith.\n\nChoices and consequences.\n\nI have spoken.", "score": 17, "replies": [{"body": "Difference between faith and intelligence", "score": -9, "replies": []}]}, {"body": "Lol everyone is acting like this is over.  If you give up easily then go elsewhere.  I haven't sold a single share and add every time it drops.", "score": 6, "replies": []}, {"body": "Good. Really.I know i will loose some Karma for this but:\n\nwsb is more like a conspiracy circle jerk these days with unbelievable retarded optimism at an unprecedented level.\n\nI discovered the GME-thing on Friday the 15th of January and bought it immediately. Over the Weekend i checked the DDs. Those retards were right. In theory a short squeeze had to occur if we just like the stock together.\n\nSo, the journey started i was thrilled, i was on it. Last Sunday all changed. After Robin Hoods Massacre on Thursday because they prevented people from buying i was already like: \"well we recovered on friday, but without buying power it will get a lot harder. But the theory changed in no way. too much uncovered shorts = they have to buy\"\n\nWell on Sunday S3 Partners one of the major sources most of all wsb recited nearly daily said: \"there are just 30 Mio uncovered shorts left\"\n\nOn monday i sold enough to not get into the red lines the following days. Since then the stock only drove lower and lower. I sold the rest of my shares @ 90 Dollars or so this morning. yes if i waited i could have sold it for a higher price, but i just wanted to get rid of it.\n\nI dont really know if alle those people who are holding their dozens of shares @ 90 Dollars are just absolutly naiv for calling us paper hands and ignoring the facts or at least the current state of this whole squeeze or if they are smart af and we really live in a big conspiracy fueled by greedy hedgefunds, enforced by bad brokers and accomplished with short ladder attacks (which arent real as i have heard).\n\nIf you ask me: There will be no short squeeze alone on tuesday the shorts gained billions in Dollars back from you. If i would believe the theory right now, i hadnt sold today. But i honestly dont think there will be a squeeze at the beginning it looked great, but market changes. and it changed in favor of greedy hedgefunds.\n\nAll those people who are saying \"dont sell, we knew it would be rough\" are ignoring the changing market. This week isnt comparble to last week.**we had our momentum, we had international media attention and then we got fucked by our brokers.they are balls deep inside of you but u dont even notice because this is sub has gotten into a conspiracy bubble.**\n\nIf you are still holdin: Listen to your stomach, if you think: Those greedy dudes are lying af - then stay the hell in.\n\nBut if you have doubts choose a good exit in advance and in the next coming days if there is a rebound sell as fast as you can.\n\n**Best wishes from Germany.**I will respond to not-so-toxic comments if you wish.\n\nEDIT: This post is long af, even longer than melvins dick i had to suck.", "score": 3, "replies": []}, {"body": "Gme has value and it definitely hasn't ended, it may peak again soon (not looking likely, despite the math suggesting otherwise.) but this was originally meant to be a long play. \n\nAnd remember its at the same price it was 1 week ago.\n\nMaybe it's easier for me to say because I got in November time and didn't buy the top. 💎👐", "score": 5, "replies": [{"body": "it was a long play to some day get to 40$ when the company recovered completely. now its at 90$ all on hype. this will be tough to digest for a lot of people.", "score": 3, "replies": []}]}, {"body": "Didn't end yet retard", "score": 7, "replies": [{"body": "proof?", "score": 2, "replies": []}]}, {"body": "Shouldn't you be at Wendy's picking up your wife's boyfriend some spicy chicken nuggets?", "score": 5, "replies": []}, {"body": "why is it always \"you know its over when ...*insert main stream media platform advertises a buying instrument* decides to do it\" ..... so its bad when more people are encouraging and shining a light on a purchase which would increase the value of said product? \n\nyou dont understand advertising at all do you?\n\nNever heard the phrase \"there's no such thing as bad press\"  \n\nwhat your saying is \"I stopped using Apple products once i saw an advertisement on tv\"", "score": 2, "replies": []}, {"body": "i smell a punk ass little paper-handed bitch y'all", "score": 4, "replies": []}, {"body": "CONGRATS! You decided to lose your stake. Holding until my kids inherit the loss.", "score": 5, "replies": []}, {"body": "🧻🤲🏻🧻🤲🏻🧻🤲🏻🧻\nGo away robo-tits\n🦍🦍🦍🦍🦍🦍\nApes only\nApes together strong \nTell your bosses to grab their ankles. We're not going ANYWHERE 💎🙌🏻💎", "score": 3, "replies": []}, {"body": "💩🙌", "score": 2, "replies": []}, {"body": "Sorry about the lesson learned.  Hopefully others come to their senses after this:  Do not buy a stock from a Reddit forum in the name of emojis and moon phrases.", "score": 1, "replies": []}, {"body": "Yup seems like gme is done for. \nGlad I only lost 50€...", "score": -26, "replies": [{"body": "r/stocks is that way. This is wsb, where if you haven't lost atleast 10k, you shouldnt even be posting. Read the rules.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Salty", "score": 1, "replies": []}]}, {"body": "dont be the follower, think for yourself", "score": 1, "replies": []}]}
{"title": "DD $GOEV / Canoo's potential AAPL Partnership with a side of short squeeze 🚀", "selftext": "First I want to congratulate us on breaking 8 million degenerates. I have been posting on this sub for over 3 years back when we were at only a couple hundred thousand. This is my first DD write up and I’m a little retarded so please go easy on me. \n\nFor everyone who doesn’t want to read a wall of text there’s a **TL:DR** at the bottom.\n\n**Technical Setup:**\n\nCanoo has completed its SPAC merger and ticker change a little over a month ago going from HCAC to GOEV. Ever since the combination it has been piled into by shorts. The short position has grown exponentially from 99k shares to over 10 million as of the last update by NASDAQ. I subscribe to S3 Capital’s retail short algorithm which gives a more accurate current estimate of ~11 million shares short. New available shorts are nearly nonexistent and borrow rates are sky rocketing. If you haven’t been living under a rock the past couple of weeks you already know how well short squeezes can play out. \n\n[S3 short Info](https://imgur.com/RPVpzbu)\n\n[NASDAQ Short Info](https://imgur.com/LrjJJCD)\n\n[Share Borrow & Fees](https://imgur.com/esZFBfL)\n\n**Fundamental Setup:**\n\nGOEV has a ton of positive catalyst the shorts are overlooking and I believe this will lead to large losses on their side. For one, the EV revolution is here to stay as you can tell from the new administration. Biden plans to electrify the whole federal fleet (estimated 650k vehicles). GOEV  has the perfect mid sized commercial B2B purpose built vehicle which fits the build of many government vehicles. The Canoo purpose built vehicle can replace for example USPS mail trucks.\n\n[MPDV Purpose Built Vehicle](https://www.canoo.com/mpdv/) \n\nCanoo’s leadership are veterans in the automotive industry which is hard to say for some of the other SPAC *cough * NKLA. Canoo's co-founder and CEO Ulrich Kranz was CTO at EV carmaker Faraday Future and more importantly has over 30 years of management experience at BMW. He worked to reimagine the MINI brand, develop the company's first SUV, and the iProject (BMW i8 & i3). They also poached talent from Tesla; Sohel Merchant (vehicle architecture) Christoph Kuttner (vehicle trim), and Alexi Charbonneau (proprietary EV skateboard tech) just to name a few. \n\nThe real value here is their proprietary B2B skateboard platform for EVs. Allowing for any automaker to design and build their perfect sedan and just clip on to an already existing powertrain. Now AAPL is most likely going to sign an EV production contract with Hyundai/KIA (expected as soon as Feb 17th) confirmed last night by the  3.6 Billion investment. GOEV is already providing their platform to Hyundai/KIA. GOEV has already been validated by AAPL as in AAPL wanted to buy them out in 2020 so clearly they like their tech. And if you think that’s not enough to sell you on this theory then listen to this: In 2015, Apple almost used the BMW i3 as the basis for its Apple Car… the two founders of Canoo were the top guys on the iProject. It doesn’t take a genius to connect these dots. \n\n[i3 article Link](https://www.silicon.co.uk/e-innovation/apple-bmw-i3-electric-car-173344/amp)\n \n**My position:**\n\nI am holding shares as well as options. I recommend shares as it is the safer bet. We all know how long hedge-funds can hold a stock down for and burn your theta. \n\n[My Position](https://imgur.com/l8ir7rJ) \n \n\n\n**TL:DR**\n\n1. Positioned to take advantage of Biden's Federal vehicle electrification plan\n2. Veteran leadership from BMW & Tesla\n3. Partnership with Hyundai & KIA; Potentially Apple\n4. Lot of shorts to squeeze (~11 million shares short)\n5. 🚀🚀🚀🚀🚀", "id": "lbsi36", "created_utc": 1612372393.0, "score": 160, "upvote_ratio": 0.91, "num_comments": 74, "comments": [{"body": "Fuck yes I’m allll over this one. \n\nI know $PACs are banned here but I’m glad this one is kosher now. \n\nThis is a seriously underrated EV play. I’ve been holding at a loss since it was Hennessy but believe in it. \n\nPositions \n\nStonks at $19.25\nFeb 19 17.5c\n\n🚀🚀🚀🤠🚀🚀🚀", "score": 41, "replies": [{"body": "Now that its merged you can talk about it here", "score": 5, "replies": [{"body": "That’s what I thought cheers great DD.", "score": 3, "replies": []}]}]}, {"body": "They have a guy from skateboard tech?!?! \nI’m in....", "score": 16, "replies": [{"body": "Check out their latest tweet showing their EV platform.", "score": 6, "replies": []}]}, {"body": "Did some reading and the skateboard tech seems like their big angle.  My concern is that the Apple deal fell through for whatever reason.  Apple is a big boy and if they copy the tech it could be a downfall for the company.  Also looks like they are bleeding money hard at this point based on the articles.  How do you feel about the investments / interest from China and Taiwan?\n\nAs a side note nice to see some DD.  I'm putting it on my list and doing some additional research.", "score": 17, "replies": [{"body": "Apple held discussions with Canoo for an acquisition. But instead Canoo wanted to go public. Apple can try to copy IP but thats exactly why Hyundai partnered with them instead of trying.", "score": 6, "replies": []}]}, {"body": "The fact that this is still in the teens amazes me.\nFair market value was estimated at $26/share and that's before Apple car talks.\n\n\n2750 shares, 86 Feb 20C, 50 May 20C", "score": 12, "replies": [{"body": "it got a 30$ 1 year target estimate by an analyst btw\n\n[https://finance.yahoo.com/quote/GOEV?p=GOEV&.tsrc=fin-srch](https://finance.yahoo.com/quote/GOEV?p=GOEV&.tsrc=fin-srch)", "score": 3, "replies": [{"body": "There was an article discussing their business and they calculated a 26/share price. I'll find it", "score": 1, "replies": [{"body": "thanks", "score": 1, "replies": [{"body": "https://investorplace.com/2021/01/goev-stock-is-worth-80-more-now-that-its-spac-merger-has-closed/", "score": 3, "replies": []}]}]}]}]}, {"body": "Up $1.50+ AH prepare for blast off tomorrow 🚀🚀🚀🤠🚀🚀🚀", "score": 6, "replies": [{"body": "🚀🚀🚀🚀🚀", "score": 3, "replies": []}, {"body": "any news this is going up in AM ?", "score": 1, "replies": [{"body": "It’s been pretty popular on other trading boards and stuff. I think news is imminent and maybe this is insiders loading up? I don’t know I’m retarded.", "score": 1, "replies": []}]}]}, {"body": "I saw something I didn't like in here but the user is approved so I ignored it. /u/zjz", "score": 14, "replies": [{"body": "AutoMod is fuk", "score": 7, "replies": []}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "A lot of people still believe that EV is just a fad. It’s a lot easier to manipulate/short a company that is new on the market and isn’t really discovered yet.", "score": 13, "replies": []}]}, {"body": "GOEV pleasfly again. Holding 2000 shares at $20.6 and my account is bleeding. Any news on which this flying ?", "score": 3, "replies": []}, {"body": "Huge fan of Canoo and what they are doing. I’m long on GOEV.", "score": 3, "replies": []}, {"body": "Tailing 🤝🤞🏼", "score": 2, "replies": []}, {"body": "Ok people listen up. This is a bad play. Here’s why (Bear case )\n\n1. GoEV (Canoo) maybe or maybe not had talks with apple. No one knows. Apple has the resources to go at this alone, why do they need GOEV?\n\n2. GoEV management is god awful. First off, they got greedy by trying to take advantage of the EV market hype by going the SPAC route. Didn’t quite work out because they literally have beta models that are untested in terms of infrastructure,drive capacity, durability and drive software.\n\n3. This is becoming a crowded space. I would argue that NIO is overpriced but at least they have a product. Even though their valuation doesn’t justify the number of cars shipped per quarter.\n\n4. If GoEV is a standalone company,can it withstand the test of time? We all know the answer to that one.\n\nMy take: while this space evolves, I’m looking to expand into ancillary buys for EV. I’m thinking hydrogen fuels, lithium, battery makers and if Tesla ever dips again, adding more Tesla because Tesla is still the leader in this space by a mile and has a ton of cash flow to keep innovating.\n\nCompulsory rocket emoji 🚀🚀🚀🚀🚀🚀\nNot a financial advisor", "score": 9, "replies": [{"body": "I don’t believe they got greedy because the EV transition is still in its beginning phase. EVs car sales make up less than 2% of all car sales. They could’ve easily sold their company to AAPL and had enough money for the rest of their lives. But they’re veteran car guys and this is what they love to do.", "score": 12, "replies": [{"body": "Apple just announced a deal with Hyundai for EVs. Hope you didn’t put money in this garbage company", "score": -8, "replies": [{"body": "GOEV is partnered with Hyundai this news has been known for over a month lol that’s why Hyundai’s stock went up last month.", "score": 13, "replies": [{"body": "They’re partnered with not just Hyundai. This is an L for canoo bro", "score": -5, "replies": [{"body": "You said Apple just announced the deal. But Hyundai stock has been up off this news for awhile. This was expected as far as Hyundai and Apple News goes.", "score": 6, "replies": [{"body": "Whenever there’s an acquisition, or strategic merger the company who company being bought or acquired usually sees an increase in share price. \n\nThe company doing the buying or paying more for a merger either sees a drop or modest gain.", "score": -2, "replies": [{"body": "Not what’s happening though.", "score": 2, "replies": [{"body": "I anticipate Apple stock going up but Hyundai Kia going up even more.\nLet the full details emerge though", "score": 1, "replies": []}]}]}]}]}]}, {"body": "GOEV Makes the EV tech for Hyundai, dummy.", "score": 6, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "https://imgur.com/a/fu1YzSi\n\nI’m poor but here ya go. Bonus GME shares included for extra retardation. No need to be so hostile btw man. It’s all good if you disagree. Good luck.", "score": 3, "replies": [{"body": "The non believers are the ones that will fuel the push higher as they have to cover their shorts. Usually the most contested plays are the ones that end up paying up bigly.", "score": 2, "replies": [{"body": "You are wise. Like a miniature Buddha 🙏🏼", "score": 1, "replies": []}]}, {"body": "I’m not . You called me names first.\nIdc what you do with your money I’m not a financial advisor. I provided my best case and left it at that. \nI hope you make money off this but it’s not for me . Cheers", "score": 0, "replies": [{"body": "Lol! I called you a dummy which is super lighthearted and maybe even endearing for this sub. Perhaps just a misunderstanding with inability to express tone then. But yes good luck to you too fellow retard 🚀", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "And Canoo have a deal with Hyundai for EVs. What's your point?", "score": 7, "replies": []}]}]}, {"body": "I hate that 🌈🐻 opinions like this guy get downvoted. I’m bullish af on GOEV but I agree with a lot of this guys points. It’s riskier than some other EV plays like NIO but the risk/reward on GOEV is within my range to take a shot.\n\nEDIT - this was downvoted when I posted this fuck you.", "score": 23, "replies": [{"body": "At this point we know Apple isn’t going it alone.  Canoo and Hyundai will be suppliers, with Hyundai/Kia taking the assembly role like Foxxcon and Canoo supplying the skateboard to build on like a chip maker.", "score": 4, "replies": [{"body": "I don't understand why the stock hasnt exploded yet.\n\nPeople for some reason don't believe Canoo is Hyundai's EV powertrain\n\n2750 shares, 86 Feb 20C, 50 May 20C", "score": 3, "replies": [{"body": "Holy shit nice positions 🙌🏼💎", "score": 2, "replies": [{"body": "I cannot wait until 9:31am\n\nDiamond hands indeed, my Feb 20C were down 90%", "score": 3, "replies": [{"body": "I have feb 19 $17.5 calls I bought last week I was starting to lose hope on with this weeks sideways trading and no news yet. Those Friday and Monday dips were stressful but the market was kinda retarded. \n\nLooks like they could print though 🚀🚀🚀🚀🚀🚀\n\nLet’s reconvene at 9:30 lol", "score": 2, "replies": []}, {"body": "Eh buddy how you doin", "score": 1, "replies": [{"body": "$15k gain today on GOEV calls and shares. \nIt's a good day!", "score": 1, "replies": [{"body": "Holding?", "score": 1, "replies": [{"body": " I'm holding these calls until we get the official news.\nJust rumors right now but I'm confident that if Kia gets the apple car project, it'll be canoo skateboard", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "It can be good play, but not this year. 2022/23 we will know more about it.", "score": 3, "replies": []}]}, {"body": "ILOVE THIS STONK", "score": 1, "replies": []}]}
{"title": "Probability of Ryan Cohen buying 7% of GME", "selftext": "Important to read if you’re holding GME 🚀\n\n💎👐💎👐💎👐💎👐💎👐💎\n\nOkay so I personally think that that GME is going to trade relatively sideways until we see another catalyst. The new technology executive announcement is definitely very positive, but doesn’t have the same spark as an Elon tweet.\n\nI think, as many of my fellow bag holders are all hoping, that Ryan Cohen exercising his right to purchase 7% of GME will provide the spark we need to get back on track to the 400/500 and beyond range.\n\nSo, Ryan’s a smart guy. I think he recognizes where this company can go and the massive gaming and e sports industry that is only on the rise - it’s obvious there is strong pricing support at the $90 range.\n\nIf $90 is the new floor, which I believe it is, and Ryan Cohen may as well, what is the probability of him exercising this right? \n\nI’d say we have a 50/50 chance that he announces the purchase of these shares this week. I think GameStop is going to piggyback off of their latest executive hire announcement into this, and fully come out as a online/e-commerce transitioning company.\n\nI think that their competitor, EA sports, is going to amplify this need with their latest results . As Dow Jones newswire says today:\n\n“The game publishing giant reported late Tuesday a 19% jump in net bookings for the December quarter, driven by digital sales and its live services. The company noted that 62% of its new game sales for the quarter were digital, compared to 49% in last year's holiday period. \n\nDigital game sales create two problems for GameStop. One, they generally don't move through GameStop stores, with the exception of those driven by cards that the retailer sells. “\n\nTLDR: 50% chance that GME has been quietly lurking and just waiting for the right time to announce with Ryan Cohen. They wanted to wait for all you paper handed b*tches to bounce.\n\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n💎👐💎👐💎👐💎👐💎\n\nSincerely, 120 GME @avg 64", "id": "lbte8n", "created_utc": 1612374567.0, "score": 312, "upvote_ratio": 0.95, "num_comments": 73, "comments": [{"body": "That’s what I’m hoping for. We’ve supported GameStop this whole time through the ratfuckery from the brokerages and hedge funds. I’m hoping Ryan Cohen supports us and says something to add value to the shares.", "score": 46, "replies": []}, {"body": "Ryan Cohen should announce that he bought his other 7% of shares after the Q4 earnings. And hopefully announces he is the new ceo too. \n\nDrop one gigantic catalyst on us 👐", "score": 46, "replies": [{"body": "And announces Elon added to board", "score": 30, "replies": [{"body": "Jeff Bezos is also hiding somewhere", "score": 2, "replies": []}]}, {"body": "You think people here are sticking around until earnings?  Without something big happening SOON this hype dies down, shorts cover (if they still need to even) and this becomes a value play stock.  As it sits right nows, according to gmedd.com it's _slightly_ undervalued", "score": -12, "replies": []}]}, {"body": "What's  the DD to justify $90 in the new floor?", "score": 69, "replies": [{"body": "Price no go lower so far", "score": 130, "replies": []}, {"body": "Because it's at 90 now and stocks only go up", "score": 40, "replies": []}, {"body": "Triple/ quadruple bottom", "score": 36, "replies": [{"body": "Dam, I guess my charts are fake cause I dont see it", "score": 19, "replies": []}]}, {"body": "Lots of volume below 150 from before the peak, especially in the 60-120 range. If most of those folks are holding then it's reasonable to consider 90 the floor.", "score": 12, "replies": []}, {"body": "You'd have to anticipate the total market cap of the stock @ 90 vs another e-sports company like Riot or something. Riot games is owned  Tencent Holdings **and has a market cap of 900b.**", "score": -3, "replies": [{"body": "Tencent holds other assets. What is the valuation on Riot?", "score": 11, "replies": [{"body": "No public data on riot because it wholly owned by tencent not public", "score": 3, "replies": []}]}]}]}, {"body": "How are GameStop and EA Sports competitors?", "score": 15, "replies": [{"body": "Yeah? If anything wouldn’t they cosupport each other. More games made by EA equals more games to sell by GME. More games able to sell at GME equals more profits for EA", "score": 13, "replies": []}, {"body": "Electronic Arts is a Game producer, so I guess more of an industry trend. Thanks", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": []}, {"body": "u/rjquinn222 you're aware that Ryan Cohen already owns 13% of outstanding shares at 9m shares currently, right?", "score": 15, "replies": [{"body": "He’s aware, and he has an agreement to to buy no ore than 20% ownership, meaning he can buy another 7%, hence where that number came from.  He’s saying Cohen has been buying in tranches and has one more to go.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 20, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Monkey 🦧 hold 🚀", "score": -7, "replies": []}]}, {"body": "Would be interesting to see if they went to a green man games model of selling steam/epic keys cheaper, and then find some way to distribute console game content as well.", "score": 3, "replies": []}, {"body": "Not sure he’d put over 500M to buy 7% of the shares", "score": 5, "replies": [{"body": "He has options", "score": 10, "replies": []}, {"body": "He could buy 2%", "score": 4, "replies": []}]}, {"body": "Hypothetically, if the stock were to tank to say 10 bucks who wouldn't average down? The real question is what is the actual relative value of the stock? Is it above what shorts set it at? I think so. If so it's a long position to profit off of. Short squeeze or not it's besides the point. If the company can't be bankrupted then it matters not if shorts are able to back out of their positions because over a span of time we will all go on and make more money in our respective ways via stimulus, unemployment and/or employment that we can use to average down with. This activity will sure up the shares in our favor sending the price up. If this stock is worth 20 to 90 bucks in actuality no matter what the relatively stable price that it arrives at it will see spikes if the fundamentals are there and I'm reasonably confident they are. Therein, it becomes a solid, stable, upwardly ascendent, for the most part, stock to hold and occasionally profit off of the spikes from. Yes, no?", "score": 6, "replies": [{"body": "New shorts were open at 300 to 500 dollars. You are fighting against them now. You amke them sweat if sp goes backup to 300...but since they are itm they would just start closing their shorts as sp rises.", "score": 11, "replies": [{"body": "So you think all the shorts are at 300. You know they have to close their positions eventually unless they want to pay interest for ever.", "score": 2, "replies": [{"body": "I think interest is at 15% now. Even if it at 30% now, that would be 30% x $100sp =$30/yr =$2.50 per month. Ya, I can see them holding for another month where sp goes to $60 to make another $40 on $2.5 holding expenses. I use 30% but i think its at 15% now. Not sure why you say forever when they are making bank at this point in time.\n\nEdit: interest rate to borrow is 10.8% now. Not looking good", "score": -1, "replies": []}]}, {"body": "Sony is at 112... there's no way GameStop is worth nearly as much as Sony is there?", "score": -4, "replies": [{"body": "Worth is market cap, sp times number of stocks. They do not have the same number of shares", "score": 7, "replies": [{"body": "It's scary how few people realize this and still invest their money", "score": 11, "replies": [{"body": "Jesus F christ. I cannot comprehend people still comparing share prices instead of mcaps", "score": 3, "replies": []}]}]}, {"body": "Do you seriously not understand share price vs market cap.  You sir are truly retarded.", "score": 6, "replies": [{"body": "Truly.\n\n\nBut!\n\n\nI have a plan to fix the tardation", "score": 1, "replies": []}]}]}]}]}, {"body": "Clearly 90 ain't the new floor :/", "score": 2, "replies": []}, {"body": "Would a market collapse benefit us?", "score": 5, "replies": [{"body": "no it wouldn’t - I think this would cause panic selling", "score": 5, "replies": [{"body": "Hmm I guess that’s not terrible considering it’ll exposed the massive flaws in our stock market system.\n\nAlso.. I’d buy all the dips \n\nThanks for the insight", "score": 3, "replies": []}]}]}, {"body": "Your a joke.", "score": -17, "replies": []}, {"body": "HOOOOLD!! BUY THE DIP!! WE NEED TO PASS THE BAG TO NEW RETARDS SO WE CAN EXIT!!", "score": -28, "replies": [{"body": "Why would you exit when this thing legitimately has a chance to bounce back? Not holding means they won.", "score": 5, "replies": []}]}, {"body": "We need a situation where hedge funds cannot short ladder attack the shit out of the stock.", "score": 1, "replies": []}, {"body": "Can you provide a source for Ryan's share grant?", "score": 1, "replies": []}]}
