{"title": "[deleted by user]", "selftext": "[removed]", "id": "lrn6ga", "created_utc": 1614199912.0, "score": 97, "upvote_ratio": 0.93, "num_comments": 70, "comments": [{"body": "Can you post your plays in the daily thread next time? 😂 Well done.", "score": 39, "replies": [{"body": "I would but feel like I’m gonna get downvoted for peddling credit spreads instead of the wheel!", "score": 25, "replies": [{"body": "I am pretty sure ThetaGang is more than just The Wheel. Credit spreads are a theta-positive strategy. It totally fits this sub.\n\nVery nice job, by the way!", "score": 12, "replies": []}, {"body": "I do many credit spreads and have always been hesitant posting them, but you got a friend in me.\n\nYesterday's play, BTC 40pt wide AMZN Put Credit spread for 50% gain in one day.", "score": 4, "replies": [{"body": "Nice! Sounds like you caught the recovery wave too - what strikes and exp?", "score": 3, "replies": [{"body": "26 FEB 3160/3120p collect 18.10\n\nBuy back @ 9\n\nYes, massive gamma, it was calculated risk.\n\nThanks be to Vega treating me well.", "score": 2, "replies": []}]}]}, {"body": "Based on the upvotes on my comment it says otherwise. See you on the daily thread bro. All plays welcome", "score": 9, "replies": []}, {"body": "I mostly dabble in credit spreads as well - how do you typically find your plays?", "score": 2, "replies": [{"body": "These trades were purely opportunistic - they were both on my watchlist and I saw them drop to deep discount levels, so I decided to jump in.\n\nOn a normal day I rely on IV/IVR to spot opportunities. I have a full writeup of my approach to credit spreads in r/1PercentMax if anyone’s interested.", "score": 1, "replies": [{"body": "Here's a sneak peek of /r/1PercentMax using the [top posts](https://np.reddit.com/r/1PercentMax/top/?sort=top&t=all) of all time!\n\n\\#1: [Part II – Defining a Trading Methodology](https://np.reddit.com/r/1PercentMax/comments/lmae4w/part_ii_defining_a_trading_methodology/)  \n\\#2: [Welcome + Introduction (Start Here!)](https://np.reddit.com/r/1PercentMax/comments/lkftcc/welcome_introduction_start_here/)  \n\\#3: [Part I – Starting with a Healthy Mindset](https://np.reddit.com/r/1PercentMax/comments/lkfugh/part_i_starting_with_a_healthy_mindset/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)", "score": 2, "replies": [{"body": "Good bot!", "score": 0, "replies": []}]}]}]}]}, {"body": "Agreeed i will support lol", "score": 2, "replies": []}]}, {"body": "Ballsy play but nice gains", "score": 12, "replies": []}, {"body": "Wow good job! I’m still learning (selling covered calls/puts so far) so I’m not at the point of doing credit spreads. 😭", "score": 8, "replies": [{"body": "Same here and looking up credit spreads brought me here. Looking forward to learning", "score": 2, "replies": []}, {"body": "Thanks!! Start slow; paper trade and make as many mistakes as you can to learn.", "score": 3, "replies": [{"body": "Thank you. 🙏", "score": 3, "replies": []}]}]}, {"body": "Taking the gain was the best part about this!!!!", "score": 6, "replies": [{"body": "Absolutely! In 2 days too, instead of waiting the full 10 days!!", "score": 4, "replies": []}]}, {"body": "Very well done sir.  I made probably 30 trades in the first 20min yesterday on the same thesis about Fed testimony.  Several PCS on TSLA, SPY, AAPL.  But I was more risk averse but still closed several of them out today for a (small) profit.  Oh one thing I did differently was these were all the 3/19exp so didn't see as big of a swing as yours but still locked in early moneys.  \n\n&#x200B;\n\nGamma and Theta are mysterious and wonderful things.  You can be \"right\" on the direction (of the underlying) and still \"wrong\".  And other times you can be \"wrong\" and end up \"right\" in the end.  I saw both things happen.  So I closed out the winners and I'm holding the losers for another week or so.", "score": 5, "replies": [{"body": "Profit is always preferred over losses, so congratulations to you too!! \n\nOn the losers - what do you think is the issue?", "score": 1, "replies": [{"body": "I think a spike in IV.  Good example TSLA 460/500 Apr21 PCS - didn't see anything change in fact it was hovering above cost for most of the day until near close.  Still 51 DTE so I guess theta hasn't kicked in yet(?)  Still learning how this all works.", "score": 2, "replies": [{"body": "Why did you choose 51 DTE? Decay usually starts to accelerate around the 45 DTE mark...", "score": 2, "replies": [{"body": ">level 41PercentMaxOriginal Posterjust nowWhy did you choose 51 DTE? Decay usually starts to accelerate around the 45 DTE mark...VoteReplyGive AwardShareReport\n\nGood question - I'm aiming to do most of my trading around the monthlies and didn't want a good trading day to go to waste so I'm laying trades on the April exp's.", "score": 2, "replies": [{"body": "Nothing wrong with that - you'll probably just have to wait a little extra to start seeing returns.", "score": 1, "replies": [{"body": "If you're only trading monthlies, what would you do in times like now when you're in-between expiration dates by several DTE?", "score": 2, "replies": [{"body": "Simply wait to respond. Where yields are right now, it’s still not critical yet.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Well done!  Relatively new to options, so forgive me if this is a simplistic question.  Why would you go for a put credit spread vs a CSP?", "score": 4, "replies": [{"body": "PCS is much less collateral requirement.  A CSP for AMD at $80 requires $8000 collateral per contract, his play is $31,200 collateral requirement for 100 contracts but he has a spread window to deal with.\n\nWith a CSP if you choose wrong your consolation prize is 100 shares at your strike...with a PCS you have no consolation prize, you simply lose the full value if the option expires on the loss side of the spread.", "score": 8, "replies": [{"body": "This. You gain a lot of leverage with spreads, so it’s *really* important to not over allocate your portfolio into one position.", "score": 4, "replies": [{"body": "Thank you, both.  Again 1PercentMax, congrats on a nice pair of trades!", "score": 3, "replies": [{"body": "Thank you!! Always happy with a nice pair. 😜", "score": 2, "replies": []}]}, {"body": "How do you hedge or manage your position if it starts to get breached?", "score": 2, "replies": [{"body": "Depends. IMO it had a very low chance of staying below those prices by expiration.\n\nRolling would be near impossible, so I’ll probably take the L.", "score": 1, "replies": []}]}]}, {"body": "You also run the pin risk of getting assigned while your long options expire OTM. That's a bad time.", "score": 2, "replies": [{"body": "True - would be unwise to hold till expiration, which is why I always close early.", "score": 1, "replies": []}]}]}]}, {"body": "How was the liquidity closing the spreads? I always find I have to chase to close.", "score": 5, "replies": [{"body": "Good question! It's not too bad, they had ample OI and volume to begin with.\n\nThe struggle (especially with high # of contracts) is that it takes time for everything to fill.", "score": 2, "replies": [{"body": "Roughly how long did it take for these? Few hours?", "score": 2, "replies": [{"body": "Not THAT long lol. Took a minute, definitely not instant. So if the underlying decided to move away from me I had a chance of not getting the complete fill.", "score": 2, "replies": [{"body": "Haha ok just wondering cause I'm on TW and spreads take so long to get filled for me and I usually only do 1 spread at a time.", "score": 2, "replies": [{"body": "Are you trading low liquidity options? Seeing wide bid-ask spreads? That may be why.", "score": 2, "replies": [{"body": "Actually ya I think that makes sense, I do a lot of SHOP spreads and I remember the bid/ask is always wide", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Nice hit; Do you post your plays beforehand anywhere? Would like to tail your next move you been on fire all year.", "score": 3, "replies": [{"body": "Thanks!! Been asked that many times, might start a thread somewhere just to post my plays.", "score": 5, "replies": []}]}, {"body": "Awesome! Thank you for the detailed calculations, very helpful to me!", "score": 3, "replies": [{"body": "Happy to help!!", "score": 1, "replies": []}]}, {"body": "Thank you for sharing and great job! How would you trade if you had a small account, like $25k or so?", "score": 3, "replies": [{"body": "The *exact* same way. It’s easier to trade credit spreads in a smaller account since it gives you leverage.", "score": 2, "replies": [{"body": "Gotcha, I think my problem with the spreads approach was that I only did 1 spread at a time, I should try more like 10 or so, I guess I was just worried about over leveraging on 1 underlying. Also, CSPs decay so quickly too but if I'm doing 5-10DTE then the spreads should work out great, I'll probably do $1 wide spreads to start lol", "score": 2, "replies": [{"body": "Like any trade, consider the amount of risk you're dealing with - with spreads it's not the number of spreads or contracts, but the **max loss** if the position goes against you and breaches both legs.", "score": 2, "replies": [{"body": "How possible do you think it would be to generate about 2k a week with a 25k account or that seems way too much optimistic in your opinion? Just trying to run some numbers", "score": 2, "replies": [{"body": "You should absolutely not approach it this way. Saying you're trying to hit X% or $Y in a week will just lead you to disaster.\n\nThe returns are there, you just have to identify opportunities and go for it.", "score": 2, "replies": [{"body": "Ya you're right, I'm just setting myself for failure this way. I'm just so ready to quit my job lol. Would you go lower delta for smaller account then or just focus on finding good plays with high probability?", "score": 2, "replies": [{"body": "Pay attention to the underlying. It’s not just about Deltas, lots of other factors to be considered too.", "score": 2, "replies": [{"body": "Oh ya definitely matters on lots of other factors, I should've clarified, I usually only sell puts on underlyings that I believe in, mostly largecaps/tech with some memes that I think will be good longterm like CRSR", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Am really really new to this to the point I don't understand much of this play. Anybody have any resources to get started if possible?", "score": 2, "replies": [{"body": "Should start with the r/thetagang wiki, and please paper trade new strategies before you put money into it.", "score": 2, "replies": [{"body": "Thank you sirr", "score": 2, "replies": []}]}]}, {"body": "Congrats and good post, this is like the best textbook play that anybody new can learn from", "score": 2, "replies": [{"body": "Thanks!! Loving that username - hope what I said in the disclaimer didn't offend you LOL.", "score": 2, "replies": []}]}, {"body": "Nicely done.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "No risk, no reward! It’s a highly leveraged position for sure, but risking only a small % of my portfolio.\n\nWas comfortable with it since it’s a high probability trade (at least by my calculations).", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The spread was opened early morning when there was high volume which usually means a lot of mispricing in options. \n\nIn fact, I saw losses when TSLA kept dipping - that means I could’ve gotten much more than $7.54!!", "score": 1, "replies": []}]}, {"body": "Very well done! If you don't mind me asking, are you thinking of selling PCS on GME tomorrow? Lol just asking for fun.", "score": 2, "replies": [{"body": "What are you talking about? It’s 🚀💎🙌⏰!\n\nJk, yes definitely considering it - when it comes down though.", "score": 1, "replies": []}]}]}]}, {"body": "I appreciate you adding a Warning. Thank you for including the limitations of your play. It's very refreshing.", "score": 2, "replies": [{"body": "Of course! I've learned my lesson regarding disclosure for sure.", "score": 1, "replies": []}]}, {"body": "How big is your account relative to your position sizings here? Do you normally have a certain % of your account that you wont exceed on a single position?", "score": 2, "replies": [{"body": "I mentioned in my post that each of these are \\~10% of my portfolio size. \n\nMy range, like I've listed in my writeup on r/1PercentMax, is anywhere between 5-25% depending on other factors.", "score": 1, "replies": []}]}]}
{"title": "Should I sell $TSLA after yesterday's crash?", "selftext": "", "id": "lrck40", "created_utc": 1614172322.0, "score": 27, "upvote_ratio": 0.7, "num_comments": 76, "comments": [{"body": "Yes, always buy high and sell low", "score": 106, "replies": [{"body": "This is the way.", "score": 23, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}, {"body": "That's the plan!", "score": 10, "replies": [{"body": "Sell take profit and reposition again", "score": 2, "replies": []}]}]}, {"body": "Regardless of what others say 13 million is life changing money! invested on regular spy & Voo that’s 10% gain yearly averaged out just pay off all debt and live care free! congratulations ! enjoy your freedom og and buy yourself a car and the mortgage & leave a million to play with if that makes you happy", "score": 26, "replies": [{"body": "Or you could get 10 million dollar slut whore wives from shithole countries, and still have 3 million for coke and body guards.", "score": 7, "replies": [{"body": "i like the slut whores idea not just wives", "score": 1, "replies": [{"body": "How do you own them as property if not wife?", "score": 2, "replies": [{"body": "Money is power", "score": 2, "replies": []}]}]}]}, {"body": "they would have to pay CAP Gains (longterm which is better) but other then that.. yeah thats pretty amazing money", "score": 2, "replies": []}]}, {"body": "Cathie bought a shit load. Do you think she’s retarded? Are you retarded?", "score": 35, "replies": [{"body": "Yes and yes", "score": 18, "replies": []}, {"body": "To be honest I think cathie has no choice. \nIf she sells the stock , people will stop trusting her investments. ( TSLA, PLTR,SPCE) all have gone down. This last week alone, quite a lot of investors dropped her firm. So selling the stock is out of the question. \n\nIf she sticks to her guns, there would be a time where TSLA price would eventually move up and she could break even. \n\nI think that she’s buying more stock to show her investors that everything is going according to plan. This could probably convince other hedge fund managers with risky investments strategies to jump in. \n\nAnswering to OP: \n\nAlso, i sold my Tesla stocks because the P/E was x1000+ and I couldn’t imagine a scenario where Tesla would make so much money. I mean we should also remember that Tesla, starlink, spaceX are all different entities. Tesla alone is worth x1000 times it’s earnings. I’m not an Oracle and I can’t say if the stock will go up of not.  It’s just beyond my risk tolerance. \n\nBut it’s just my opinion. What do I know? I’m just a retard.", "score": 10, "replies": [{"body": "IF YOU'RE GOING TO FILIBUSTER, YOU SHOULD RUN FOR SENATE!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 10, "replies": [{"body": "Good bot", "score": 1, "replies": []}]}, {"body": "Looking at ups and downs weekly means nothing.  What is her average price.  Also if 1 stock becomes too large of a percentage of the portfolio they are forced to sell some.", "score": 2, "replies": [{"body": "We aren’t looking at weekly ups and downs. We are just debating as to how Tesla plans to earn x1000 times it’s current valuation? We might argue that they have self driving taxi technology. But Yandex in Easter Europe has the same, China surely will have its own sooner or later. Just a bit skeptical that’s all.", "score": 2, "replies": []}]}]}, {"body": "is she a cat?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Same. I’ll move most of into a safe ETF that liquid enough for me to cash out and cover debt from time to time. Gamble with the rest.", "score": 2, "replies": []}]}, {"body": "You might want to consider diversified low cost Vanguard Balanced Funds earning 7-10% annually.  At this stage of the game with this kind of money its more about preservation of wealth and not accumulation.  Depending on your lifestyle you could take 4% annually which equates to more than $500,000 a year and still have it grow exponentially and never touch the principal for the rest of your life, and the life of your inheritors, and the life of their inheritors.\n\nNot a Financial Advisor and this is not financial advice.", "score": 24, "replies": []}, {"body": "I’ll give you 600 for it", "score": 10, "replies": [{"body": "I’ll bid $601, Bob.", "score": 4, "replies": [{"body": "$1!", "score": 1, "replies": []}]}, {"body": "$6 and half a bag of skittles", "score": 2, "replies": [{"body": "$5 and no skittles", "score": 1, "replies": [{"body": "Wait, you guys have skittles?", "score": 5, "replies": []}]}, {"body": "yeah.. those are gone..", "score": 1, "replies": []}]}, {"body": "Put me down for tree fiddy", "score": 1, "replies": []}]}, {"body": "Sell at least half, friend. If anything negative happens to tesla -- those gains will be gone. Why risk it? You already made great money! Diversify part, keep it as a hedge.", "score": 8, "replies": []}, {"body": "Tesla is aiming to be the oil, largely investing in renewable energy infrastructures. I don't view them as a car company. They're as much a car company as the boring company is a flamethrower company", "score": 10, "replies": []}, {"body": "It’s up to you, Tesla is a safe long term play, it’s like Amazon back when Amazon was at $700, 5-6 years down the line it’ll be up there, I still think we’re in a tech bubble so at some point it’ll pop and we’ll see it go down a lot, under $600, but eventually it’ll still get up above $1000", "score": 9, "replies": [{"body": "> Tesla is a safe long term play\n\nLast I checked TSLA P/E ratio was over 1,100 compared to a Nasdaq average of ~22. So people people investing at the moment are counting on a 50-fold increase in Tesla earnings over the next few years with zero growth in share price. \n\nI’m not saying it’s not possible. But you can’t really say it’s safe to assume that Tesla will become one of the world’s biggest most productive companies.", "score": 1, "replies": [{"body": "And why not? They’re the leader in EV’s, by 2030’s some states plan to stop selling gas vehicles all together, with Tesla coming out with newer and cheaper models, it’ll make Tesla accessible to average people, vs only the rich, they’re opening more and more factories all over the world, and they’re leading in autonomous driving. As of right now they stand to make the most out of this EV evolution, they’ll be able to make the most EV cars, have the best tech, they already have the best brand awareness in the EV game, sure it’s still a gamble, but investing is a gamble, Amazon was a gamble when it started, no one knew it would be as big as it is now, and Tesla has all the pieces to become the biggest name in EV, it’s a good gamble", "score": 1, "replies": []}]}]}, {"body": "No but you should have sold when it was $900 and bought back in yesterday.", "score": 3, "replies": []}, {"body": "Yes.  Pigs get fed. Hogs get slaughtered. Don't sell ALL, but I would certainly sell down 80% of my position and diversify.", "score": 4, "replies": []}, {"body": "It sounds like you don't want to sell but need an exit strategy.\n\nDepending on how you feel, I would sell 3 lots of 50 calls each at a variety of delta points.\n\nNeutral - .4/.2/.1 = \\~230-250k monthly in income\n\nBullish - .3/.15/.1 = \\~125-130k monthly in income\n\nUltrabullish - .15/.1/.5 = \\~82-85k monthly in income\n\nThis keeps you with 5840 shares, generates good income, leaves you with a massive amounts of profits, and forces you to address the hardest point of when to leave.", "score": 4, "replies": []}, {"body": "Man, next year it could be back down to 70. Take the money.", "score": 8, "replies": []}, {"body": "You paper hand bitch Elon is the real god emperor. Now let me ask you. You want to go against your king?", "score": 11, "replies": []}, {"body": "Take 1m in profit to cover original investment, take another mill for you to throw into safe stocks ( 100-200k a year easy) then hodl the rest:)", "score": 3, "replies": []}, {"body": "Honestly Tesla can go down hard to 350 a share easily. It’s not going there because no one wants it, but the minute there is a better investment opportunity which is worth taking a loss on TSLA its gonna go down fast.", "score": 3, "replies": []}, {"body": "You should sell if you think it is fully valued based on your analysis , you should hold it if you think it is still undervalued .  But if you don’t know what you own, you are unsure what to do", "score": 6, "replies": [{"body": "In related news- you should drink water if you are thirsty", "score": 8, "replies": [{"body": "But the question is, am I thirsty daddy?", "score": 1, "replies": []}]}]}, {"body": "Sell some so you can buy your house, your mom's house, and your wife's boyfriend's house.", "score": 4, "replies": []}, {"body": "Bearish trend on TSLA. You can sell and re-enter later if you feel like there are headwinds with all the competition building up.", "score": 2, "replies": []}, {"body": "I think it will end at 700$ by friday, but I expect another big down\n\nPos: 2 Short on Tesla (I don't have much money) I want to close at 600$", "score": 2, "replies": []}, {"body": "Shitttt I mean if it were me I’d take a mili or two out once it rebounds and just live off that for the next 5 years", "score": 2, "replies": []}, {"body": "Sell on green days not red days", "score": 2, "replies": []}, {"body": "If it’s good enough to take screenshots, at least sell half", "score": 2, "replies": []}, {"body": "I would Sell half /1/3 of the position be debt free before any recession and sell calls for my positions. No financial advise i am a superhuman!", "score": 2, "replies": []}, {"body": "Bank some gains and keep some shares. That way you lock in your win and continue to win if the stock goes higher. \n\nRemember that you need a price point to get in and get out. I don’t know what your original exit point was, but you must be close to it now.", "score": 2, "replies": []}, {"body": "just sell a million so you can officially retire and do whatever you want. secure initial investment at least.", "score": 2, "replies": []}, {"body": "I learned from yesterday event, its good to take gains, regardless of holding long to make more gains.", "score": 2, "replies": []}, {"body": "Personally, I believe in Tesla as an innovative company. I'm not selling anything anytime soon", "score": 1, "replies": []}, {"body": "Fucking attention whores on WSB. I’m sick of this sub", "score": 1, "replies": []}, {"body": "I would think you’d want to buy Tesla after a crash. I know I’m tempted to.", "score": 1, "replies": []}, {"body": "Why you owned it at all is a mystery", "score": 0, "replies": []}, {"body": "You should buy more", "score": 0, "replies": []}, {"body": "Only for the loss porn.", "score": 0, "replies": []}, {"body": "Sold a million dollar car?!", "score": 0, "replies": []}, {"body": "Do what the fuck you want? Why would we give a shit?", "score": 0, "replies": []}, {"body": "Yes, sell *after* the crash", "score": 0, "replies": []}, {"body": "You didn't sell at 900 but want to sell at 700?", "score": 0, "replies": []}, {"body": "Yes listen to a bunch or retards and boomers. Sell your appreciating assets for depreciating assets that you’ll likely wouldn’t know what to do with. Like selling your house because it went up in value! Very nice!", "score": 0, "replies": []}, {"body": "Retodd… buy on the dips!", "score": 0, "replies": []}, {"body": "Where did you buy in? Do you think it'll drop more? Do you think it'll hit $800 again? Do you care about short term gains or are you happy to just leave something for months or years?  \n\n\nA profit is never a loss so if you bought in at $200, selling during a dip and realizing some gains makes sense. Equally if you think it'll continue to drop you can buy back in and either keep the profits or increase your stake.  \n\n\nAlternatively, if you're in for the long haul, just ignore it and check in every few months or so.", "score": 0, "replies": []}, {"body": "Forward looking PE by estimates goes to about 400-500 in 2 years.  Tsla has beat the odds so far. Production rising,  new offerings.  It really depends on how they hold up against the new electric car offerings from the established brands.  And seeing what Elon has done the last few years I'm expecting he will unviel another surprise in the next year or two.", "score": 0, "replies": []}, {"body": "No fucking shit Sherlock.", "score": 1, "replies": []}, {"body": "Buy High Sell low this is the way", "score": 1, "replies": []}, {"body": "Write those juicy monthly covered calls, literally free money !!", "score": 1, "replies": []}, {"body": "Yea", "score": 1, "replies": []}]}
{"title": "Daily DD #1 GM is stupidly undervalued", "selftext": "Welcome to Daily DD! I'll be offering one piece of DD on a stock every day for the next few days. On today's episode, GM.\n\ntl;dr at the bottom\n\nWhy it'll  🚀this year and next year:\n\n1) Biden wants to make the entire US fleet EV by the end of his term. You really think he's going to buy $70,000 cybertrucks for the fleet? Can you imagine the outrage if federal cars are using fancy Teslas while the average American has to buy regular cars? I think Biden will be more likely to buy GM's newer electric cars once they come out because they'll be much cheaper. Biden also drives GMs cars adding to possible bias or favoritism there. I don't think it's a coincidence that GM announced going fully electric while Biden pushed for a fully electric federal fleet. Either Biden knew GM was going electric or GM knew Biden would make this big purchase order.\n\n2) Cap and trade? Have you heard of it? No? You should learn about it or else you'll lose out on tendies.  Cap and trade is complicated so I'm not gonna explain it here. Go google it. Point is, companies who produce electric cars can receive a rebate because the car emits less CO2 compared to a gas car. In fact, Tesla would've **lost money** in 2020 if it wasn't for California's cap and trade program ([https://www.cnn.com/2021/01/31/investing/tesla-profitability/index.html](https://www.cnn.com/2021/01/31/investing/tesla-profitability/index.html)). Now that GM has access to this cap and trade market, they'll be able to sell these to the remaining gas car companies. This will also hurt Tesla because the more companies sell credits the cheaper they become. \n\nAlso, you know who's likely to pass cap and trade? The federal government. Obama tried to pass cap and trade in 2009 ([https://en.wikipedia.org/wiki/American\\_Clean\\_Energy\\_and\\_Security\\_Act](https://en.wikipedia.org/wiki/American_Clean_Energy_and_Security_Act)), but it was never brought to the senate. With climate change being a more pressing issue, and Biden's talk about solving climate change and green energy jobs, he's for sure going to try to expand and pass cap and trade on the national level. He's also publicly supported cap and trade ([https://www.washingtonpost.com/graphics/politics/policy-2020/climate-change/carbon-tax/](https://www.washingtonpost.com/graphics/politics/policy-2020/climate-change/carbon-tax/)). From his campaign website \"And, he will demand that Congress enacts legislation in the first year of his presidency that 1) establishes an enforcement mechanism to achieve the 2050 goal, including a target no later than the end of his first term in 2025 to ensure we get to the finish line.\" This seems to refer to cap and trade as it's the only real enforcement mechanism to achieve a targeted climate change goal. With democrats controlling everything, cap and trade is likely to pass this time. \n\nThen again, politicians lie all the time and  Biden isn't much different. However, even if the feds don't step in, multiple states have already passed cap and trade with many more to come. \n\n3) GMs cars are comparable to Tesla's cars.  The Model 3 isn't actually that good. The Chevy Bolt has a range of 259 miles, about 22 miles longer than Tesla. Both cars cost about the same amount. The newer Chevy Bolts also have fast charging, so Tesla's starting to lose its moat here. Guess Elon's plan to not patent anything really screwed him over.\n\n4) The PE on this is stupidly low. Come on? 12.13? It's practically **begging** to be bought at this price. Compare this to Tesla's 1,230. If GM and Tesla, both EV companies, had the same valuation, GM would be worth $5000. This is my price target lmao.\n\n5) The UK, Norway, and other countries are planning to ban vehicles. Norway is the most aggressive at 2025. China is also considering it, which would make EV companies like GM go absolutely parabolic. GM has the Chevy Bolt, meaning they already have a head start in terms of experience when it comes to producing EVs. \n\n&#x200B;\n\n&#x200B;\n\nWhy is the stock down?\n\nThere are a lot of things that make people scared of GM. Here's why I think they're dumb:\n\n1) The chip shortage:\n\nThis is a concern for GM in the short run, but they were still able to beat earnings compared to 2019. Currently they're projecting the earnings will be $1-$2 billion lower next year due to the shortage. I think that's a worst case scenario and the market is **overreacting** to the chip shortage. The chip shortage is now getting the concern of Congress and Biden ([https://www.washingtonpost.com/technology/2021/02/23/biden-semiconductor-shortage-meeting/](https://www.washingtonpost.com/technology/2021/02/23/biden-semiconductor-shortage-meeting/)). Given that Biden always talks about manufacturing, funding the semiconductor shortage via loans or grants and boosting domestic production of semiconductors could serve an easy win. He can claim this is coronavirus stimulus money to build manufacturing jobs or whatever. GM gets its chips from Qualcomm, which has a ton of facilities in the US and is based in San Diego. This can serve as an easy political win for Biden. \n\n2) Charging stations. This isn't going to be a concern for much longer. Most people don't drive for long haul journeys, so driving stations aren't really needed. Think about it. If you could fill up your car with gas at home, would you ever go to a gas station? Very rarely. This is the point of EVs, and it's why I think they'll be the future. Also I hate to mention Biden again, but he's planning to put 500,000 public charging stations in the US by 2030. This won't be a problem much longer. ([https://www.bloomberg.com/news/articles/2020-12-02/joe-biden-plan-to-fight-climate-change-could-sell-25-million-electric-cars](https://www.bloomberg.com/news/articles/2020-12-02/joe-biden-plan-to-fight-climate-change-could-sell-25-million-electric-cars))\n\n3) bEaR mArKEt. Chill. This shit happens every couple of months. People panic and say the market is crashing. It's not. Even if it was, GM would hardly be hit because its PE is so stupidly low. IMO the only company that should tank a ton is Tesla. People always bring up the **bUfFeT inDicAtoR** because they think Buffet is some kind of god. He's not. Sometimes Buffet is an idiot. He doesn't understand the tech industry, and I think the rise in stocks recently is tech related. We're entering a new era of American capitalism where tech companies dominate. 7% stock market growth is the norm. With GDP rising 2% per year, you should expect to see a high divergence in the long run. The buffet indicator only measures GDP too, which isn't remotely the same as stock prices. Stocks get their values from earnings and also the assets the company owns. GDP doesn't factor wealth into consideration at all. \n\nOne last point: people think it's a buy and hold for 10 years, but it's not. I think GM will go to the moon ($5000) quicker than you think. Stocks move faster than reality and price in future expectations. There are a lot of catalysts incoming (charging stations, no new gas cars, chip production, and cap and trade). If any one of these things are announced, that's GM to $100. \n\n&#x200B;\n\ntl;dr Buy GM. Cap and trade, EV ban, and its undervalued price make it super attractive. GM will hit $5000. Buy or cry.\n\nPositions: GM 1/21/22 $60c (I plan to roll over these options as they approach expiration)", "id": "lrivnu", "created_utc": 1614189162.0, "score": 74, "upvote_ratio": 0.85, "num_comments": 69, "comments": [{"body": "$GM will hit 5k? ![img](emote|wsb_emojis|bull)", "score": 22, "replies": [{"body": "$5k price target may have been the best part of this DD... overlooked a few points:\n\n1) GM owns majority of Cruise the autonomy company that launched driverless taxi service in SF. Autonomous has a multi-trillion dollar addressable market. Cruise competitor, Waymo, was valued at north of $100bn (vs total market cap of ~$70bn for GM) and that’s just one asset.\n\n2) GM has the best selling EV in China since Q3 20\n\n3) Joint venture with LG Chem for batteries is currently building US based factory with comparable output to Tesla’s Gigafactory in Nevada\n\n4) EV Hummer sold out in 10 minutes\n\n5) Súper Cruise driver assist out performed Tesla Autopilot in Consumer Reports review.\n\n6) GM owns Onstar and GM Financial, potential cross sell opportunitiesz", "score": 6, "replies": [{"body": "Why isn't this talked about more", "score": 2, "replies": []}]}, {"body": "It’s not a meme eggsdee", "score": 7, "replies": []}, {"body": "I've got 2,300 options contracts, guess I'll be the next DFV then...", "score": 2, "replies": []}]}, {"body": "I’m selling my left testicul to invest in Gm. You better be right dog, I’m trusting you with my left nut", "score": 19, "replies": [{"body": "GM to $5000", "score": 5, "replies": []}, {"body": "GM is probably a good move but what’s you’re take on GME?", "score": 3, "replies": [{"body": "As for me personally, I like the stock", "score": 6, "replies": []}]}, {"body": "I'm mortgaging my house, you better be right", "score": 1, "replies": []}]}, {"body": "I can't bring myself to invest in them but I hope a year from now I regret it and you're scroogeing poor people with your fat stacks", "score": 9, "replies": []}, {"body": "Fast charging the Bolt isn’t much good without available chargers. Completely impractical for a Bolt to be anything but an urban commuter car until there’s a charging network. Tesla’s charging network is years ahead and *still* makes owning a Tesla impractical for large swaths if the US. EA has some long, thin routes of chargers but is still inadequate for most. \n\nIf Tesla solves self driving in next 5 years then GM is really screwed because the Bolt is not future proofed for self driving. Tesla is so far behind promised dates that skepticism is warranted. But if they do it, it’s backward compatible to nearly every tesla on the road. Offer it as a subscription (which tesla has said it will do) and the used market for Teslas will shine at the expense of things like a new Bolt. Why isn’t GM putting Cadillac Supercruise hardware in every car?\n\nYou also didn’t factor in the problem of dealer laws. GM has to sell through dealers. Dealers don’t make money selling cars they make money servicing cars. EVs have significantly lower service costs and pushing a sale requires shitting on gasoline cars. Dealers are not going to sell the Bolt with any vigor until they make most of their money from EVs and not gasoline cars. That’s going to be a long ways away. And even then you’ve got this middle man taking a cut in every sale. A middle man that doesn’t know Jack about EVs or how to sell them (because they don’t really want to). \n\nThen there’s the casting and structural battery packs from Tesla no one else is doing. If Tesla is Apple and GM and Ford are taking the Android approach to EVs, buying batteries and motors and system software off the shelf, Tesla is a couple years from offering an equivalent to the iPhone SE, trickle down technology that’s more affordable. Maybe the SE doesn’t match a flagship Samsung Android but it has other things going for it like full iOS experience and iCloud integration. Absent major adjustments by legacies to their design and engineering methodology it’s possible (perhaps likely) by 2030 Tesla can offer a better experience at a cheaper price than GM in terms of everyday consumer cars. Teslas are luxury now because of price, just like the iPhone, but it won’t stay that way forever. \n\nI think the EV revolution will bring several winners and GM is likely one. I just think you’re underestimating the headwinds they face and the ability of upstarts to interfere. You gotta think at least one major manufacturer will suffer the fate of RIM/Blackberry.", "score": 15, "replies": [{"body": "Super good point on dealers. I almost bought a bolt last year. I asked the sales rep they said “ don’t know much about them, we don’t sell many because they don’t need service often”\n\nThat’s great for the consumer, bad for dealer network.", "score": 5, "replies": [{"body": "Yeah, if I make 95% of my money selling and servicing gas cars, and using best efforts to sell an EV requires detailing all the *problems* with gas cars, why they have higher service and maintenance needs and costs... well, good luck. Why would I as a dealer shit on 95% of my inventory just to sell a few token Bolts?", "score": 2, "replies": []}]}, {"body": "I’m in GM, so I hate this, but great points. Well done.", "score": 2, "replies": []}, {"body": "Tesla was already supposed to have full self driving and they haven’t even come close to something reliable. It’s literally fraud that they’re even offering the option still.", "score": 1, "replies": [{"body": "Tesla FSD doesn't fucking work. I bought it and use it everyday, but only on the safest paths. Unless you have a death wish, don't turn it on all the time ...", "score": 2, "replies": []}, {"body": "They’re absolutely way behind but compare the beta FSD videos in the wild to anything GM is offering and it’s not even close. When it comes to self driving, however bad you think Tesla is, GM is worse off relatively speaking. I’m simply making a counterpoint about comparing the Model 3 to the Bolt. Complain all your want about the Model 3 self driving, rightfully so, but it’s still ahead of the Bolt, not even with the Bolt (and the backward compatibility could make the discrepancy even worse in the future if Tesla gets it figured out). You can’t even get automatic emergency braking standard on the Bolt. You have to upgrade to a higher trim package just for that safety feature. That’s absurd. DC fast charging is another one that’s an *option* you have to separately pay for with the Bolt, which for a BEV is so incredibly dumb.", "score": 1, "replies": []}]}]}, {"body": "You also should know that Cadillac is going pure EV soon. The first one looks pretty dope it’s called the Lyriq. \n\nBut imagine the days when there’s gonna be EV Escalades on the market. 💥", "score": 6, "replies": [{"body": "EV Hummer I am planning to buy with my GM gains. he he", "score": 1, "replies": [{"body": "Between the Escalade, Hummer, Lyriq and whatever EV sedan that will replace the CTS i definitely see GM making a nice come back this century. \n\nI don’t have the patience to invest for that long, but I’m sure they’ll kill it in the future", "score": 2, "replies": [{"body": "That Hummer EV coming out later this year seems really bad ass. I remember I hated Hummer for bad gas efficiency, but now all those issues are gone. \n\nhttps://www.youtube.com/watch?v=MjMhZKmHKGk&ab_channel=GMC", "score": 1, "replies": []}]}]}]}, {"body": "What? Buy more GME? Ok, just bought, hodl and cum", "score": 18, "replies": [{"body": "This is the way.", "score": 1, "replies": []}]}, {"body": "As for me, I like the stock", "score": 7, "replies": []}, {"body": "But what do you make of GM's foiled partnership with Nikola? Are you confident in GM's indigenous capability of EV development (especially trucks) after they made such a blunder when choosing a tech partner?", "score": 3, "replies": [{"body": "Partnering with Nikola was quite strategic because Nikola was more of a customer than a partner, so GM didn’t really have much to lose anyways. I think they learned their lesson though. GM knows how to make its own cars and doesn’t need Nikola.", "score": 3, "replies": []}, {"body": "They are taking risks. Just like they did with $1bn cruise investment. I like it. \n\nThey picked a lemon and dumped them, what is wrong with that.", "score": 1, "replies": []}]}, {"body": "bought some calls  mijo", "score": 3, "replies": []}, {"body": "I like GM as well. I don't get why they are so undervalued.", "score": 3, "replies": [{"body": "GM to $5000", "score": 3, "replies": [{"body": "let's party together when it hits", "score": 2, "replies": []}]}]}, {"body": "> 3) GMs cars are comparable to Tesla's cars. The Model 3 isn't actually that good. The Chevy Bolt has a range of 259 miles, about 22 miles longer than Tesla. Both cars cost about the same amount. The newer Chevy Bolts also have fast charging, so Tesla's starting to lose its moat here. Guess Elon's plan to not patent anything really screwed him over. \n\n&#x200B;\n\n1. The Model 3 SR has 263 miles range (4 longer)\n2. The Model 3 SR starts at a lower price\n3. The Model 3 SR has some very important features (e.g. Autopilot) included at that price point\n4. The Model 3 SR has access to the Supercharger Network\n5. The Model 3 SR will soon enough get single front and rear casts, reducing cost to build (and sales price if Tesla chooses), and improving the car in terms of weight, stiffness, and quality.\n6. The Model 3 SR will soon enough get the 4680 structural battery which will, reduce cost (and  sales price if Tesla chooses), increase range, reduce weight, improve stiffness and handling, improve charging, improve performance.\n7. And the Model 3 SR includes the FSD hardware, so if you think it is worthwhile you can subscribe to that service at any time.\n\nTLDR - The Model 3 is already better then the Chevy Bolt and will with the upcoming changes will be quite a few years ahead of it.\n\nThere is a reason why GM trades for lower prices. I actually sold my GM stock recently (at a nice profit). I fully expect GM to in a matter of time fall apart once again.", "score": 4, "replies": [{"body": "Don't forget Tesla overestimated their range. I have a Model S and they quoted 402 miles, but getting like 350 miles. Normal driving, I'm not a racer ... but, still not very good.", "score": 1, "replies": [{"body": "Are you driving in a warm climate?\n\nAlso, I think range will be perhaps be more consistent when they have the 4680 cells out as the thermal management of them is much easier, as well as the electrical resistance is much lower.\n\nIn any case, it is going to likely be 15-20 (if we are very lucky, maybe 10 years) years before battery density and cost is where it needs to be and you can buy (non-expensive) long-range or at least fast-charging cars that result in range anxiety being a thing of the past.", "score": 1, "replies": [{"body": "No, driving in around 50-60-70 degree weather ...", "score": 1, "replies": []}]}]}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**GM**|**$60**|**BUY CALL**|**2022-01-21**|**$5.98**|**$51.97**|**10706**|**143**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckljqt93mb29x0765tgqt61pb) | [Track Record](https://www.pickmojo.com/user/player89283517/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 2, "replies": [{"body": "Hope the hedgies buy this up since I mentioned it", "score": 1, "replies": []}]}, {"body": "So if (GM) is undervalued, what’s your take on Ford Motor Company (F)?", "score": 2, "replies": [{"body": "Not sure. I don’t think Ford is going as hard on EVs than GM though", "score": -3, "replies": [{"body": "There were reports in early February they intend to put $29billion towards it. [Ford takes fight to Tesla with US$29bn invest](https://www.proactiveinvestors.com/companies/news/940528/ford-takes-fight-to-tesla-with-us29bn-invest-into-electric-and-autonomous-vehicles-940528.html)They have invested in Argo AI and their electric start up Rivian, I know they killed it Because of the pandemic. But still I see this company having room for massive gains. And I’m not saying that GM doesn’t but I still got a bad taste in my mouth from 2008 when they chose to protect their CEOs over their stockholders and Employees.", "score": 2, "replies": []}, {"body": "We got started late, but there is a big push internally.", "score": 1, "replies": []}]}]}, {"body": "I’m playing this for all the same reasons, although I went with an auto supplier instead. All these electric cars will require an increased amount of aluminum when compared to ICE for weight savings, also all the leather and trim will have to be purchased for all these new vehicles.   \n\n\nenter [XTC.TO](https://XTC.TO) with a rock solid balance sheet, effectively zero debt and is very shareholding friendly. They currently trade at around 10x cash from operations.", "score": 2, "replies": []}, {"body": "Interesting, I like the argument that GM is currently valued like a ice manufacturer, and could go up if it starts being valued as an EV manufacturer.", "score": 2, "replies": [{"body": "you don't dig their new logo, shouldn't that say something and their 30+ EV line up coming in 5 years?", "score": 1, "replies": []}]}, {"body": "GM currently has many government contracts and will continue to win more contracts. Government agencies use Chevy's SUVs and President Biden's limo is a modified Cadillac Limo. Biden has committed to turning the entire government fleet of 650,000+ vehicles (light trucks, SUVs, semi-trucks, etc...) into fully electric. and built in America, I expect an announcement soon and GM to be awarded some, if not a majority of the contract. Other startup EV companies simply do not have the scale to produce the government contract. Ford has EV production in Germany which is not made in America. Tesla recently purchased $1.5bn in cryptocurrency which the Treasury Secretary Yellen is against. I think $GM is the best bet to win a majority of the government's work", "score": 2, "replies": []}, {"body": "Who Killed the Electric Car? Yeah right it was GM!\n\n They rather destroyed thousands of EV1 in the 90's rather than selling them and sued the country in the 90's successfully and also tried it again in 2020. \n\nAnd remember this 'shitty' electric car back then was selling like hot cakes. And you believe GM will earnestly invest in electric cars?\n\nIf you want EV cars and think it will explode, then buy Hyundai, not the company who killed the electric car.", "score": 3, "replies": [{"body": "It’s truly stupid to act like a GM of the 90s is remotely the same company that it is today", "score": 4, "replies": []}]}, {"body": "I hear the logic, but I believe tesla leads the EV pack, Ford will lead the US auto industry, and NIO will be the next hot contender. \n\nI recently sold my GM for these so... let’s gooooo! Lol", "score": 1, "replies": [{"body": "Tesla’s losing their most to GM. Their Model 3 isn’t any better than the Chevy Bolt anymore", "score": 3, "replies": [{"body": "I don’t think auto will be there biggest play. I think their mastery of battery and energy will be. I know that’s silly for an auto company, but we’ll see.\n\nI also think that currently, Chevy is no where near as desirable as a tesla.", "score": 3, "replies": [{"body": "Maybe not but I think it’s more of an advertising/clout thing. If you read my DD you’ll see that the bolt has longer range, fast charging, and a cheaper price.", "score": 5, "replies": [{"body": "Sure, but people don’t buy things because they are better. They buy what they like. And people don’t like bolts, but love tesla. \n\nI still think GM is a great buy, but it’ll top out at 10-20% gains, where I hope we can see 50% on NIO/Ford.\n\nI think your DD is solid and it’ll be successful 💪🏼", "score": 4, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Nah that was flint being dumb and switching water sources", "score": 1, "replies": []}]}]}, {"body": "Chevrolet not cool? They also have a myriad of other brands, Chevy not cool enough, how about a Buick, no really they’re cool we made these mini crossovers that look weird, forget about you grandmothers Le Sabre, these are cool. Not buying it, how about a Cadillac, same stuff as the Chevy but more toys and a depreciation that only WSB will understand, you’ll give it away rather than have untold people with gold teeth show up at your house to buy it. Still not doing it, perhaps a Saturn, ok too much. What about a Pontiac, so we actually made some good cars and then stopped, but we can start again. Still not cool, hmmm why don’t we try an Oldsmobile, OK even we don’t remember what that’s supposed to be. How about an ever so slightly cooler Chevy where we sell you almost exactly the same car that looks slightly different, of course that’s what everyone needs you want a GMC. Think we have issues with branding, have you seen our new logo it’s “all electric” well OK we went lower case and the m looks like an electric plug? Look just please buy our cars and don’t ask us about our branding again, it embarrassing just thinking about it. We can make cars, we just don’t know who we are and our cars electrics weren’t that good for gas cars, so all electric should be great?", "score": 2, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "IMO VW is positioned to overtake both and lead on EVs. They’ve developed an entire new platform specifically for EVs vs the common practice of retrofitting EVishness onto an existing car. This was a huge investment for them and they’re making noises like they want it to be the next benchmark in their legacy.", "score": 1, "replies": [{"body": "But they are unfortunately reliant on the batteries everyone else is. Look at the rollout for the electric Quattro from Audi (sub brand) they kept pushing back the release because they couldn’t source the power supply from lg chem", "score": 1, "replies": []}]}]}]}, {"body": "I, for one, like this stock.", "score": 1, "replies": [{"body": "I like the stock too!\n\nDamn that’s another reason to buy. People buying GME will get confused and accidentally buy GM", "score": 1, "replies": []}]}, {"body": "Yes yes I totally agree GME is stupidly undervalued.", "score": 1, "replies": []}, {"body": "Only nit to pick: federal government won't pass cap and trade into law anytime soon. Not a chance.", "score": 1, "replies": [{"body": "At the earliest it’ll be summer 2021 but Biden could wait until the very end :/", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I think cap and trade could be more favorable to a carbon tax, but I see your point. Even Obama couldn’t do it with a house and senate majority. It might’ve cost them in 2010 as well. Then again the democrats have become more progressive over the years. Who knows? Nevertheless I think if enough state legislatures pass it, it could pressure congress to act similar to gay marriage and marijuana legalization.", "score": 2, "replies": []}]}]}]}]}
{"title": "Relief Package and Implications for Stock Market", "selftext": "Edit 2.24.2021 6:40 PM\n\nI didn't expect this post would quickly turn into a debate about raising federal minimum wages to $15. When I read the minimum wage clause I was thinking more along the lines of impacts to small and medium business and how that affects stock market performance of, say, Dow Jones Small Cap Index. Somehow I did not include this thought in my original post. Or perhaps the relief bill is focused on providing assistance to the grassroot and therefore only tangentially related to the stock market. I apologize if there is any confusion or unpleasant exchange. All comments (except those violating WSB rules) are still welcome. \n\n====================\n\nThe Biden administration’s $1.9 trillion relief package will be brought to the floors of House and Senate soon and with Democrats holding majority in both chambers there seems to be no issue passing it. Just want to have some discussion with fellow WSB investors about the impact of the package on stock market.  I understand that WSB is no political forum and I will try to make political discussions at the minimum, but inevitably some gauging of the administration’s pork barreling is needed.\n\nSome of my own thoughts:\n\n\\-The package seems to represent a pivot from the Fed (monetary policy) to Treasury (fiscal policy) as the center for economic relief and recovery. The market seems a bit concerned that fiscal policy could trigger inflation, that Fed might gradually withdraw from asset purchases and that the Fed might even be pressured to raise interest rates prematurely. Treasury yields shot up and institutional investors capitalized on it, dumping equities in the past two days. Now, I don’t think Fed will reduce asset purchases and suppress interest rates soon, but the market is quite sensitive to any attempt that could be interpreted as trying to poke the “bubble” on the stock market. I would expect more roller-coaster dramas in the coming weeks as more details of the bills are revealed.\n\n\\-The package is labeled as a “relief” bill and most of the media coverage I’ve read focuses on direct payments, child support, unemployment relief, child tax credit etc. but I am more concerned about what sectors could benefit from the bill. The recent announcement of USPS truck contract, while not part of the package, suggests the administration might use the package to send favors to specific sectors such as renewable energy and EV. From what I read there are also supports for health insurance premiums and transit systems, although I am not sure if that would have any substantial impact on relevant sectors.\n\n\\-I do agree that inflation could be a concern with such a big fiscal package, and I am looking for good options to hedge against it. One post I’ve seen suggest buying value stocks, but I am suspicious as stocks are generally not considered hedging options. I do buy physical silver and gold, but I wonder if there are any better suggestions.\n\n\\-The package also includes a $15 minimum wage clause and Biden is trying hard to sell it. All politics aside, I am genuinely not sure if this would damage employment rate and offset all the unemployment and small business relieves in the bill. I pledge ignorance on this issue and I await more enlightened views.", "id": "lrk5el", "created_utc": 1614192263.0, "score": 30, "upvote_ratio": 0.84, "num_comments": 70, "comments": [{"body": "15 bucks is fucking nothing. in and out pays their entry level high school kids 14.50/hr and their prices are less that fucking mcdonald's for a burger. \n\nThe biggest lie that boomer conservatives have never bother to look into is wage slavery. Want to get real fucked, tie the mim wage to a regions housing costs. Lul", "score": 44, "replies": [{"body": "If you are posting from an area with an IN and OUT, you do not understand the economy in other areas of the country. I have lived in the Rural South and the Bay area among other areas. TN/GA/MA/CA/MI/OH... a good slice of Americana. To put this into perspective when you quote a wage from the Bay Area... $117K is considered poverty line for a family of 4 and for a 1400sq ft house in Union City (Not even an expensive location) the down payment (20%) would have been the full purchase price in Knoxville TN (Relatively expensive location for TN).  \n\nBasically, what I am getting at is $14.50 an hour that you quote is a livable wage in TN but is peanuts in CA. a Federal minimum wage makes no sense to me when comparing such areas.", "score": 10, "replies": [{"body": "maybe, I could be incorrect?  You could also be towing the same dead horse that cons have pushed for decades. \n\nFederal action is the only action we have left since we've been shown time and time again that the wealthy (which includes political individuals) cannot be trusted with other's best interests.", "score": 1, "replies": [{"body": "Let me try it this way... If the fed sets the minimum wage to a level that supports a living wage in the Bay Area it will absolutely demolish small business in rural America. $15 isn't enough in high COLA areas and is too much in low COLA areas but we expect different things out of the minimum wage.\n\nTo be more direct about this. A Sophomore in High School qualifies for a minimum wage entry level job to get gas money, going out money, and odds and ends money. If you are an adult that only has the skills of an average High School Sophomore you have failed and made some really bad decisions - live with them. \n\nAdditionally, when minimum wage was supposed to be a living wage our economy was supported and needed manual labor. This is a limited sector in today's world. I don't care what skill you acquire, but some is needed. We can't have a large portion of the population deciding to take a path to get them on a minimum wage job because it can support them. There are not enough of those job and we need more skilled people; be that programmers, engineers, bio science, electricians, plumbers, machinist or custodians. \n\nI believe we need a federal minimum wage to protect from employers taking advantage of youth and entry level folks on their path to something more. I do not believe we can federally apply a minimum wage that is a living wage in high cost of living areas that makes sense in rural areas.", "score": 1, "replies": [{"body": "I'M RECLAIMING MY TIME!!!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": " \n\nI think your example of why someone gets a min wage job is an  elitest view, and fails to consider a changing working world.  (Some parts of the world see jobs as waiters or cooks as careers)  Your point insinuates that there are enough higher paying jobs to go around, I disagree with that because there's no pay control.\n\nTimes are changing you are correct, that's why the Living wage is for any job, regardless of how *you* value that work.  (Going back to the work a high school student *should* be doing)\n\nmanual or service work are the same now. \n\nTrades are different all together. If you're a tradesperson, you're above min wage (unless your employer is fucking you over)\n\nI'm ok with attaching the living wage to the cost of living in each given area, then you add 2/3rds on top of that wage. Why? Every finance advice on housing states spending 1/3rd on your living quarters.  This would bring people up to where they can pay for appropriate (as in, not shit holes) housing  and afford to live in addition.", "score": 2, "replies": [{"body": "Elitist... haha. Dude my dad was a Mechanic for a Rail Road, my mom was a teacher, and I started my career after getting an Engineering degree and now I own a company that employees 35 people (Not one makes minimum wage BTW) Yup, elitist I am in dirty jeans and boots. \"Failed to consider\"... I pointed out the change in workforce needs. I literally have more skilled jobs here than manual labor jobs and we are in the automotive manufacturing sector.... MANUFACTURING! I need more people building and keeping equipment running than I need people to run them since automation takes care of most of that. Still need people, just need people who can do more than shove a part in and hit a button. \n\nTake what you want from what I said, but I have created jobs an hired in more micro economies than you have lived in. I am not someone who is just theorizing, I have weekly payroll to make. Raising to $15/hr makes no difference to me but I bet the inflation that comes with it is going to hurt people making less than $20/hr right now. \n\nNot enough jobs. Ha! You need to look some information up that you just don't know about skilled jobs going unfilled. Dude, I didn't even get a machinist under the age of 50 to apply the last time my company was looking at a wage that was bench marked to the area. $35/hr. Let that sink in, $35/hr, plus dental, health, vision, 401K (3%match), vacation...\n\nYou are in LA LA theoretical make me feel good land. Meanwhile in the real world skilled jobs go unfilled, unskilled labor complains of unemployment, and you want to reduce the number of jobs available from employers having to reduce headcount to make payroll.", "score": 0, "replies": [{"body": "We're your born in bulgaria too? Where you started means nothing when looking at where you are, unless you want to pin a fucking medal on your jacket. (Which most people who like to compare then and now do)  Your second paragraph just supports my comment. \n\nI hope you're paying your employees something that they can live on and not just survive. I'm not making anything feel good, because there's nothing to feel good about.", "score": 2, "replies": [{"body": "Straight out of Ohio, old Steel town, shaped my views on how available jobs change.", "score": 0, "replies": []}]}]}, {"body": "IF YOU'RE GOING TO FILIBUSTER, YOU SHOULD RUN FOR SENATE!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "You have done an excellent job at wasting my time.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}]}, {"body": "It will destroy more jobs. It doesn’t matter what the minimum pay is when you can’t find a job.", "score": 3, "replies": []}, {"body": "In and out is in California though. Try that minimum wage in Georgia or Florida.  Small business will continue to get hurt.", "score": -15, "replies": [{"body": "Az, ca, tx, ut, nv all have them. \n\nYeah, try it and they will  survive. Stop buying the bull shit.  If your business can only survive because you pay people \"not enough to survive\" then your business isn't viable. \n\nThis has nothing to with fucking covid, people were getting fucked by low wages since the mid 1970s.", "score": 18, "replies": [{"body": "The tradeoff then is that unemployment will go up and those people will lose their jobs.\n\nEdit: Why am I getting downvoted lol. He literally said if your business can’t pay a livable wage then its not viable. If every business that can only pay minimum wage shuts down then how does unemployment not go up?", "score": -5, "replies": []}, {"body": "Cool google search skills, but you must be on the other side of the table. The 15 will benefit you. Temporary.  My friend 90 percent of the workers will lose there jobs. So get in or get left.", "score": -17, "replies": [{"body": "I haven't looked at Google today, is that where you got 90%?!  Or was that from fix news or news max?  I can't keep the facist news outlets straight, sorry it won't benefit me since I make a decent wage. 15 is nothing\n\nbusiness will adapt or die. And they are not going to adapt by replacing 90% of their workforce. \n\nThere's no getting in. The limo left long ago.", "score": 12, "replies": [{"body": "It is my understanding that the minimum wage will be across the country? If true, this is an issue because cost of living is not the same everywhere. I just don't like wide-net regulation.", "score": -4, "replies": [{"body": "Yeah, it should be higher in some areas.", "score": 2, "replies": [{"body": "and lower in others.", "score": 0, "replies": [{"body": "Not really", "score": 3, "replies": []}]}]}]}]}, {"body": "Will people lose their jobs or will they quit their jobs because they no longer have to work 2-3 jobs?", "score": 5, "replies": []}]}]}]}, {"body": "No one is forcing you to work at those low paying jobs. There are always better paying jobs.", "score": -20, "replies": [{"body": "Lol such a bull shit answer. Brought to you by the GQP", "score": 16, "replies": [{"body": "But on a serious note, those low paying jobs incentivize individuals to pursue schools, creating small business or pursue something else. I remember working McDonald's during college, they could have paid me $20 but I was not going to stay there.", "score": 2, "replies": []}]}]}]}, {"body": "Anyone saying 15 minimum will banrukpt business who haven’t been adjusting wages for inflation for YEARS have their own brains leaking out of their skulls and onto the carpet.", "score": 14, "replies": [{"body": "Cost of living varys vastly in different states. A universal minimum wage is rubbish and american people are gonna be unemployed.\n\nIf you think the cost of living in the sticks of arizona is anywhere close in price to La or Ny you’re tripping hard.", "score": 6, "replies": [{"body": "Well said.", "score": 2, "replies": []}, {"body": "Exactly. Making minimum wage in Boston? You’d have an easier time paying your bills by begging for spare change in Charlestown.", "score": 2, "replies": []}, {"body": "This is a straw man arguments . Nobody is disputing what you’re saying moron", "score": -1, "replies": [{"body": "Yeah 15$ minimum wage will fuck small business you moron👌🏽\n\nAs cost of living vary on area 👌🏽\n\nI wasn’t arguing I was making valid points that can be backed up with statistics👍🏼", "score": 0, "replies": []}]}]}]}, {"body": "*sigh* This a a multi-prong stun rod.  The Wage issue is multi-faceted, and answers are not found in arguing or heated debate.  It's also a centuries old problem.  Humans, in general,  empower the rich and enslave the poor.  The problem is the human heart, and that only changes from within.  No laws or regulation will change that.", "score": 3, "replies": []}, {"body": "15 a hour minimum wage lmao.... that will speed up the autonomous workers and robot work force.", "score": 16, "replies": [{"body": "It will definitely speed up innovation in autonomous technology. Long ROBO", "score": 7, "replies": []}, {"body": "Isn't innovation a good thing?  I see no issues with progress.", "score": 8, "replies": [{"body": "Problem is not everyone could tap into benefits of innovation such as automation and robot which could cause profound disruptions throughout the labor market, regardless of the specific minimum wage amount there is bound to be shifts of employment pattern and temporary unemployment", "score": 1, "replies": [{"body": "UBI needed for some of these reasons you mentioned.   The automation should be taxed to some extent as if it was a real worker to fund UBI and keep a balance.  Even truck drivers, engineers, lawyers, etc etc are getting replaced as well.  It's not just the labor industry.  Why make people do labor when robots can do it for us?   Too much automation and you have less and less taxes coming in and more and more people not working.   Not a bad thing, just need to handle it properly.   It's going to happen one way or the other.  We should embrace it and welcome it.   Trying to stop it is going to make it that much worse when the dam breaks.  There is no stopping it, just prolonging it.  Let's be smart about it.", "score": 3, "replies": []}]}, {"body": "Less jobs", "score": 0, "replies": [{"body": "And?   We should create/keep fake jobs for the sake of...what?  Stalling innovation?  Slowing down progress?   There are better ways to move forward than this archaic thinking that everyone has to have a job.   What happened to single household incomes?   What about UBI?   What about charity work?   There's so much out there.", "score": 2, "replies": [{"body": "People don’t know how to spend or save money. Also they don’t even know how money works. People will realize that it’s a terrible idea.", "score": 1, "replies": []}]}]}]}, {"body": "Whatever you tell yourself to keep the poor man down.  Guess what,these things are coming anyways dip shit this is the 21st century.  Now we can have increased technology with or without living wages.  Oh and also who the fuck do you think designs, produces, installs, services, and analyzes this so called autonomous technology you’re talking about?? Fucking robots?? No dummy it’s human workers.", "score": 6, "replies": [{"body": "One human can program millions of robots . Unless your skilled ur shit out of luck in the next 15 years", "score": 2, "replies": [{"body": "Never said anything about programming...I mentioned design, production, installation, service, analysis...unless you’re fucking Jesus one person isn’t doing all that.", "score": 2, "replies": [{"body": "Lol my thoughts are all speculation", "score": 1, "replies": []}]}]}, {"body": "The poor man is down becusse the system they built to keep you poor worked.  Free your mind and realize the elite dont care about you . They love unemployment.  Its called separation of the classes  they only want rich and poor bye bye middle class.", "score": 0, "replies": []}]}]}, {"body": "I hate how these discussions always end in some people acting like children, we need to be talking about this stuff and I completely agree about the min wage. Might be necessary in big cities that are dying anyway but I live in the midwest and work for a local breakfast lunch style diner and they’ve already had to lay off around half the servers so it’s just the owners and their family now. A 15 federal wage would lay me off and some of the cooks, no way to run a restaurant if you’ve only got 1 cook 1 dishwasher and 2 servers", "score": 6, "replies": [{"body": "Well said, this is topic is more complex. Cost of living is different throughout the US, which means a flat $15 will have different implications across the US. This is my issue with the flat $15.", "score": 4, "replies": []}, {"body": "Why does a 16 year old need to make what is called a “Livable wage.” Why stop at $15 an hour? Why not $18? $20? Anyone that has a mortgage and transportation could tell you that $15 an hour is not a livable wage.", "score": 6, "replies": []}, {"body": "I hear you, there are quite a few posts here about how In N Out could afford to pay a decent hourly wage while keeping their burger prices so low, and I am interested in how they could do it", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "IF YOU'RE GOING TO FILIBUSTER, YOU SHOULD RUN FOR SENATE!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "No, low paying jobs don't force people to improve their lives.  Wtf is this shit?  \n\nHere: You're my kid and you get daily beatings.. Because I'm trying to encourage you to better yourself?   \n\nThis line of thinking is how abusive partners work. The system isn't making your life shitty so you can improve yourself. It's making it shitty to keep you contained.", "score": 3, "replies": []}, {"body": "$15/hr is in 5 years, and many states are already at or near that level.  This is literally a.non-idsue, and only serves to give consumers more money to spend rather than executives more money to horde.", "score": 3, "replies": []}, {"body": "Where the business is dosent matter one fucking bit, why? Because when I travel the country, the McDonald's I go to in other states charge the same price for their product. Hell, I'm in CA and many other chains charge more out of state. \n\n somehow we're supposed to believe that in states where living costs and taxes are less, but the product sells for the same, SOMEhow the business will collapse?  Lol. Come on.", "score": 2, "replies": [{"body": "Your argument is only related to restaurant-chains. They can afford to keep prices the same because they have a larger and broader reach across their many locations. Small businesses typically have one location. And that one location could be located in a rural area that have less than 1,000 potential customers. They cannot afford $15 an hour. $15 an hour makes sense where it makes sense. Urban areas have much broader access to potential customers. Rural areas do not.", "score": 4, "replies": []}, {"body": "Yeah ive travelled the country too, and i can tell you Mcdonalds charges $2-4 more for a meal in California than my local mcdonalds in philadephia.\n\nThings like gas, groceries, car insurance all vary on location. Not sure what pipe youve been smoking but im interested!", "score": 2, "replies": [{"body": "Try McDonalds in West Yellowstone. 2 Sausage burritos is about $4.00 each.", "score": 3, "replies": []}]}]}, {"body": "Awesome let’s raise minimum wage to 15$ so small businesses can get fucked and we can all pay 20$ for a burger because the price of everything will be hiked up. If some asshat is getting 15$/hr for sweeping a floor then I want a raise too. Fuck outta here.", "score": -6, "replies": [{"body": "small businesses usually pay more then minimum - usually more then 15. if you are working for a small, family owned business and is making less then 15 dollars an hour, you are getting taken advantage of. if you think 4-5 dollars an hours on a workers or two wages is going to shut down a small business then that business will most likely close its doors anyways. Stop pushing your stupid views.", "score": 5, "replies": []}, {"body": "U my friend are a true retard. Congrats", "score": 3, "replies": [{"body": "Mission accomplished", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "There are quite a few posts here using In & Out as example. I love their burgers but I really don't know how they could afford to do such low prices while keeping their wages up. Will be interested to hear more about it", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Now do something that is not a food chain.", "score": 2, "replies": []}, {"body": "IF YOU'RE GOING TO FILIBUSTER, YOU SHOULD RUN FOR SENATE!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "Increasing minimum wage to $15 makes zero sense when you look at the discrepancy in housing costs from state to state. It will put more small business owners at massive risk of folding due to not being able to afford employees, but big boys don’t care.", "score": 0, "replies": []}, {"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
