{"title": "Goldman Sachs says the bull market is still in the early stages", "selftext": "From the article: The stock market’s swift comeback to record highs opened a new chapter on Wall Street, and the fresh bull market has a long way to go, according to Goldman Sachs.\n\nThe S&P 500 quickly bounced back from its March bottom as investors looked past the coronavirus turmoil and focused on a brighter future. Unprecedented fiscal and monetary support in Washington also played a critical role in the market’s resilience, which will drive stocks higher in the long run, the bank said.\n\n“We believe that we are still in the early stages of a new bull market, transitioning from the ‘Hope’ phase to a longer ‘Growth’ phase as strong profit growth emerges,” said chief global equity strategist  Peter Oppenheimer said in a note.\n\n“The changing mix of policy support in this cycle also suggests a possible inflection point towards a more reflationary environment than we have seen since the financial crisis,” Oppenheimer added. “This regime shift is likely to drive the bull market higher over coming months and also have important implications for market leadership.”\n\n\nhttps://www.cnbc.com/2021/02/04/goldman-says-the-bull-market-is-still-in-the-early-stages-gives-six-trades-to-play-it.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard", "id": "lcy74h", "created_utc": 1612495223.0, "score": 119, "upvote_ratio": 0.95, "num_comments": 73, "comments": [{"body": "This makes me want to sell. in my experience goldman does not have their finger on the pulse", "score": 104, "replies": [{"body": "I hear you but Tom Lee believes the bull rally continues. He’s been very accurate over the past year I’ve followed him.", "score": 5, "replies": []}, {"body": "I agree with your sentiment about GS but everything macro is bullish as fuck right now. We're going up.", "score": 3, "replies": []}, {"body": "Here is a similar post that I shared back in May, and dummies were mocking it and saying that it is time to sell:\n\nhttps://www.reddit.com/r/StockMarket/comments/grb4wi/came_across_an_article_from_jp_morgan_written_in/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 12, "replies": [{"body": "Well, I trust Goldman Sachs. They are honest people who look out for the common man!", "score": 49, "replies": [{"body": "Hello fellow kids!  Now is the perfect time for you to invest all your money!", "score": 5, "replies": []}]}, {"body": "To be fair to them. No one could've predicted that a pandemic would crash the markets just months later.", "score": 6, "replies": []}]}, {"body": "My older brother always said to do the opposite of what GS tells you to do.", "score": 1, "replies": []}]}, {"body": "Monetary policy (the Fed): They've already stated that they're keeping interest rates near-zero for at least the rest of 2021\n\nFiscal policy (Congress): insufficient as always, but better now than the first 8 months of the pandemic\n\nEverything else: Pandemic and lockdowns and impact are all knowns. The US and global economies are still suffering--badly--but the K-shaped recovery is underscored by the fact that the market marches higher while unemployment reaches its 9th month of hanging out at the worst levels seen during the GFC. Bad for the economy, for lower-middle class workers, and society in general. \n\nBut still good for stonks. Bull keep charging, mony printr keep brrr'ing.", "score": 40, "replies": [{"body": "Your comment just made me realize what a k-shaped recovery is. I'm not sure what I thought it was or why i didnt look it up but it just clicked, thanks.", "score": 18, "replies": [{"body": "Half the people go up and half go down lol", "score": 2, "replies": []}]}, {"body": "Interest rates are never going back up. The global economy is fucked long-term, but financial markets are doing great", "score": 5, "replies": [{"body": "Why are near zero rates bad?", "score": 2, "replies": [{"body": "They are not bad. They are a sign that something is bad: namely, economic growth. Central banks have only turned to zero (and in some cases negative) interest rates to try and stimulate economic growth by incentivizing loans and thus investment. But when you’ve been doing that for years with low growth, you know that something is awry. Look up “secular stagnation.”", "score": 2, "replies": [{"body": "Is there ever a period where high interest-rate‘s are good?", "score": 1, "replies": [{"body": "You have the causality reversed. Interest rates don’t produce a good or bad economy. They reflect it.", "score": 2, "replies": [{"body": "So on a booming stock market, in a booming economy, The healthiest of fundamentals around rising wages, high employment rates, freely flowing trade…why would the federal reserve raise interest rates?", "score": 1, "replies": [{"body": "To prevent inflation", "score": 1, "replies": [{"body": "To prevent inflation or deflation? Wouldn’t it be deflation", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You prevent inflation by raising interest rates?  I think you’re wrong", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No but I do appreciate an answer more than three words.  I am not a mind reader in three words is not an explanation worth giving, or a conversation worth having. \n\nMy assumptions: It seems that low interest rates are always favorable to the general economy.   It seems that I interest-rate‘s only favor big banks who can loan money out and collect more interest from it. If that occurs less people would invest in the stock market. \n\nI’ll ask again: when is an appropriate time for a high interest-rate‘s to occur?  (Taking in mind my assumptions) \n\nAlso don’t be a fucking prick. Are you ok? If you have anger problems I encourage you to seek mental health services.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes $1750 in GameStop", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Earned. I was trading in my IRA. \n\nFeel free to give me your perspective on my above questions... not sure the relevance of GameStop in this conversation", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Goldman is alright, but those Sachs guys....", "score": 27, "replies": []}, {"body": "Isn’t it weird how this century is following the 1900’s? \nPandemic... check\nRoaring 20’s.... kinda looks that way... I’ll be selling all stocks in 2027. (Kinda joking)", "score": 48, "replies": [{"body": "There was a depression then a war then roaring 20s", "score": 19, "replies": [{"body": "nine shocking wakeful memorize pen oatmeal quickest modern teeny license\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 7, "replies": [{"body": "1812 😂🤣😅", "score": 6, "replies": []}]}, {"body": "2008 crash, we've been at war since 2000", "score": 7, "replies": [{"body": "Gotta have that military-industrial complex to keep the economy chugging along", "score": 9, "replies": []}]}]}, {"body": "Guess I'm moving to a deserted island in sept 2039 then", "score": 6, "replies": [{"body": "Germany lookin sus.", "score": 13, "replies": [{"body": "Hitler had an attempted coup that failed miserably before he came back stronger with his ideology and party 1930. I'd look more towards America \n\nBuT tHiS TiMe ItS dIfFeReNt", "score": 1, "replies": []}]}, {"body": "Watch out japanese troopers", "score": 1, "replies": []}]}]}, {"body": "Rule of thumb follow what goldman sachs does not says", "score": 65, "replies": [{"body": "Yeah what this means is they are expecting it to crash and hopefully profit on the way down.", "score": 26, "replies": [{"body": "Gayman Sachs... \n\nLast year they said by end of 2020 S&P500 projected to be around 2400... This was my first major crash since I am in my late 20's, my rule is to never listen to bankers and look at what they do not what they say...", "score": 7, "replies": []}]}]}, {"body": "This makes me far less optimistic we are early in the bull market", "score": 22, "replies": []}, {"body": "Of course. While they short the market", "score": 53, "replies": [{"body": "I posted similar articles over the past year, and someone always says what you just said, and the market continues to march higher.", "score": 16, "replies": [{"body": "All that proves is that goldman was wrong multiple times.", "score": 8, "replies": []}]}]}, {"body": "idk, nobody knows anything. Economist XYZ says the economy will collapse and banker ABC says the bull market is just getting started. I just stay away from overvalued stocks and don't worry about it.", "score": 18, "replies": [{"body": "Yeah, choose wisely and you will be fine. Over a loooong history of US market we’ve seen bigger tests and market is still on big plus with a pretty quick rebounds. Collapse fantasies are just not reflected in the historical data and if we would be heading to a total collapse then stocks are last thing that we will be concerned about.", "score": 4, "replies": []}]}, {"body": "So bear market in 3 months", "score": 16, "replies": []}, {"body": "GS releases analysis in every which direction possible.", "score": 14, "replies": []}, {"body": "Oh no. Market crash incoming then.", "score": 14, "replies": []}, {"body": "Didn’t they say we were in a bubble not long ago?", "score": 8, "replies": []}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "Well, VIX completely caved today. For now the market is fucking strong. The other way to look at it is that VIX, gold, and silver have all bottomed.", "score": 6, "replies": [{"body": "Buying more vix...", "score": 1, "replies": []}]}, {"body": "I don't trust these people. When investment firms start hyping, it's wise to be cautious.", "score": 13, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Im usually a buy and hold investor but I exited 90% of my positions in Dec. I have been trying my luck at swing trading (with money that I don't mind losing) lately and I'm actually enjoying it lol.", "score": 4, "replies": []}]}]}, {"body": "All this talk about a new bull market we never even left the last one...", "score": 4, "replies": []}, {"body": "For sure, actually I read a research paper by jp morgan which says that the growth rate for s&p 500 is actually relatively low longer term wise. It also says that the long term holding rate for stocks is actually below the long term trend. So expect more inflows. \n\nI can post it when I get to my desktop", "score": 3, "replies": []}, {"body": "Calm down guys. This is almost definitely true, and a very easy call to make. As long as the USD is the global reserve currency and they can just print more to artificially prop up the equities market it's not going to collapse any time soon. Although I do believe the correction at the end is going to be fucking epic.", "score": 4, "replies": [{"body": "That was my thought. As long as they are printing the value of usd goes down and the stock market keeps going up. Until they figure out normied have no dollars to spend because the cost of everything is insane. Oh shit I just made a case for hyper inflation. Now I feel the global economy is fucked.", "score": 3, "replies": []}]}, {"body": "Doubt.", "score": 2, "replies": []}, {"body": "Bull Market not going away if unlimited QE and 0 interest stays around, OR if there is a major catalyst (like another plague or war)", "score": 2, "replies": []}, {"body": "Oh yeah, the same Goldman lobbying last week that retail investors might crash the whole fucking market  if they continue trying to push hedge funds to margin call.", "score": 2, "replies": [{"body": "The important word here is \"if\". Look like hegde manage to scary retail away with their tactic so market is safe and sound....", "score": 2, "replies": []}]}, {"body": "Hell yes love to see it", "score": 1, "replies": [{"body": "When has GS ever been wrong ...", "score": 3, "replies": []}]}, {"body": "I can’t see the whole article. Can somebody post the article for me or the original report from GS?", "score": 1, "replies": []}, {"body": "they could be right, or wrong. Nobody knows for sure.", "score": 1, "replies": []}]}
