{"title": "SENS - Ultimate DD + updates, 10x long term play", "selftext": "**DD for SENS (SENSEONICS) Still has room to go.**\n\nSENS has become a very popular stock with lots of exposure recently. This is a DD I did a while back and it was posted on other forums but maybe I should bring this to light again as it has recently taken a good pull back and is a perfect opportunity to enter. 10x money in the future (could be 1-2 years, maybe even sooner with this volatility). I am not a financial advisor so feel free to dig into the information presented and make your own decision on if you want to invest or now.\n\n**NOTE: if you have read this already go to the bottom for updates.** \n\nAnyways, I believe SENS is a very underrepresented company and they deserve to be at a much higher valuation. I think the company is doing great things for people with Diabetes as a health care professional I support this.\n\n \n\n**About Senseonics**\n\nSenseonics is a company that provides a revolutionary product called the Eversense. This device helps anyone with diabetes to monitor their blood sugar without pricking their finger a million times (This is HUGEE, type 1 diabetics must do this almost 6-10 times a day to check their sugars). Their current device is a small implantable device that fits just under the skin on the back of your arm (triceps area) and can be changed out every 90 days.\n\n\\*\\*\\*It has already received FDA approval and CGM (continuous glucose monitoring system) approval for 90 days and is pushing for 180 days now (FDA approval soon, articles on it here ([https://www.fiercebiotech.com/medtech/senseonics-180-day-eversense-glucose-monitor-delayed-at-fda-by-covid-19-pandemic](https://www.fiercebiotech.com/medtech/senseonics-180-day-eversense-glucose-monitor-delayed-at-fda-by-covid-19-pandemic) ).\\*\\*\\*\n\nIn Europe they are approved for 180 days (and from my understanding the EU is often stricter with regulatory approval so they will most likely be approved for FDA) This was in Dec 2020, so should be out soon before second quarter. This is a MAJOR Catalyst.\n\n&#x200B;\n\n**The product**\n\n&#x200B;\n\nhttps://preview.redd.it/r4lw3y48t9k61.png?width=430&format=png&auto=webp&s=67c008bcc2419ab67c6b222f5a7ae00ef1b45525\n\nThese are all the components of the product: the sensor which is placed in the arm (small surgery that can be done at your general physician’s office, the company provides FREE training for the doctors) The transmitter can be removed allowing the individual the freedom to move around, current competitors can’t, **explained further below**). The smart phone app can allow patients to have continuous monitoring of their blood sugars. The app also allows you to share this info with others. This is crucial for older seniors or individuals with disabilities allowing loved ones to monitor their condition from **anytime and anywhere.**\n\n&#x200B;\n\n&#x200B;\n\n**The market landscape**\n\n**“About 422 million people worldwide have diabetes, the majority living in low and middle income countries and 1.6 deaths are directly attributed to diabetes each year.”**\n\nThis is pulled from the WHO. Imagine each one of those individuals using this product. In this case,  you are looking at a multibillion dollar company (apparently at least 30 billion, and will move close to 50 billion with the rate they are currently moving). Type one diabetics and serious type 2 diabetics are the current market, but this can be used for causal type 2 diabetes as well, ESPECIALLY for anyone that is using insulin or want to be a good controller over their sugars. The addressable market is absolutely insane, yet the company is only worth $5 dollars. WTF…\n\nHere are articles that has shown that CGM is much better than your regular test strips at monitoring especially in Type 1 diabetics.\n\nReferences: Bolinder, Jan, et al. \"Novel glucose-sensing technology and hypoglycaemia in type 1 diabetes: a multicentre, non-masked, randomised controlled trial.\" The Lancet 388.10057 (2016): 2254-2263.\n\nHeinemann, Lutz, et al. \"Real-time continuous glucose monitoring in adults with type 1 diabetes and impaired hypoglycaemia awareness or severe hypoglycaemia treated with multiple daily insulin injections (HypoDE): a multicentre, randomised controlled trial.\" The Lancet 391.10128 (2018): 1367-1377.\n\n&#x200B;\n\nhttps://preview.redd.it/4pxd1009t9k61.png?width=553&format=png&auto=webp&s=dbd831972ba6b9f35aece598b9b7e5aff4ec593a\n\nAnyways back to some numbers. This is pulled from their investors presentation and as you can see there is an addressable market (32%) that is still available. Dexcom, Medtronic and Libre are all competitors, and their systems are by far wayyyy more cumbersome compared to Evanescence. The freestyle libre you must change every 14 days and the Dexcom every 10 days.\n\nHere is a quick chart that compares all 3 of them:\n\n&#x200B;\n\nhttps://preview.redd.it/l1u205g9t9k61.png?width=624&format=png&auto=webp&s=85f2ee2872151ea5a18a4304712b9c03e592a317\n\nThe Eversense is much superior in terms of the following...\n\n1. **Date to change**\n2. **Accuracy** when compared to the freestyle libre and the Dexcom. This is VERY important for type 1 diabetics as low sugars can cause dizziness and possibility of death.Overall studies have been done in the past regarding the Dexcom and Eversense (meta-analysis, the eversense came out well on top), this is outlined in a reddit post already, here’s the link [https://www.reddit.com/r/stocks/comments/l1t673/breaking\\_news\\_concerning\\_senseonics\\_sens/](https://www.reddit.com/r/stocks/comments/l1t673/breaking_news_concerning_senseonics_sens/)\n\n&#x200B;\n\n**Partnerships**\n\n&#x200B;\n\nhttps://preview.redd.it/13bci6wat9k61.png?width=624&format=png&auto=webp&s=6f1efc4a76b15ccc20879b51829e6b81b03f67b3\n\nProbably one of the most important things about a company is the backing it has from other well-known companies. SENS has recently moved from Roche as a partner to Ascensia which to be honest is a very well-placed strategic move as Ascensia is way more experienced with diabetic patients. Based on my conversation with the Investor relations, Roche had essentially screwed SENS because they moved away from their diabetes portfolio to focus their efforts on oncology. The original partnership with Roche was most likely due to their products in Insulin pumps. The new partnership with SENS and Ascensia will be huge as SENS will be providing Ascensia with a rivaling product in the world of CGM.\n\n&#x200B;\n\n&#x200B;\n\n**Customer satisfaction and reviews**\n\nFrom my research most customer testimonials are POSITIVE. I believe the ONLY downside to this product right now is that you still must prick your finger 2x a day to do a quick calibration (I’m sure not everyone will do it, but it’s recommended). The team is working on bringing this down to once per week. Despite having to do this, many patients have been very happy with the device and the freedom that it gives them. The transmitter that is applied can be taken off allowing the patient to swim and do activities freely without something stuck to them.\n\nPlease watch this video to check out the customer review on this product: [https://www.youtube.com/watch?v=4aRrnTDwU1c&ab\\_channel=BobbyHurt](https://www.youtube.com/watch?v=4aRrnTDwU1c&ab_channel=BobbyHurt)\n\n&#x200B;\n\n&#x200B;\n\n**Revenue and their financials of their 3rd quarter 2020**\n\nNow this part won’t be pretty since they are a start-up. They recently lost a lot of inflow of income due to covid-19. But I do believe this is the year they will come back very hard. They are projecting a 2021 revenue of 15 million this year up from last year of 19 million. Many doctors offices were closed down and elective surgeries were pushed back. This means that when things open this year there should be a major inflow of revenue.\n\n&#x200B;\n\nhttps://preview.redd.it/9tithm2ct9k61.png?width=624&format=png&auto=webp&s=687ace122a0101762ee34836d9693db8d2d4c5fd\n\nThe management team did a very good job trying to mitigate the cost for the company. Because they suffered a major decrease in sales they also lowered their expenses.\n\nFull report: [https://www.senseonics.com/tools/viewpdf.aspx?page={23F0689F-39F5-4C53-AE0D-2A5A45399E8A}](https://www.senseonics.com/tools/viewpdf.aspx?page=%7b23F0689F-39F5-4C53-AE0D-2A5A45399E8A%7d)\n\nI’m expecting a recovery, from this next quarter by a bit. Which is inline with what they reported of 3.5 million for 4th quarter of 2020. The projected revenue for the company is the following, which honestly, I think they are being very conservative. If they receive more funding, I can see this shoot up even faster.\n\n&#x200B;\n\nhttps://preview.redd.it/g3cgc20dt9k61.png?width=624&format=png&auto=webp&s=1c0936218a422e75bf350c250753db8fb81044ed\n\nSENS recently did a public offering to generate 150 million in cash, they absolutely need to do this to allow themselves some capital to work with and bolster their balance sheet. And I think they have a point here. I would do this if I owned a company. People should see this as a good sign that the company is growing and just needs some capital to keep going. If you believe in their product then you should really invest in this company.\n\nLink: [https://www.senseonics.com/tools/viewpdf.aspx?page={B23AB4E9-ED01-40FA-8673-CDBA858885CC}](https://www.senseonics.com/tools/viewpdf.aspx?page={B23AB4E9-ED01-40FA-8673-CDBA858885CC})\n\nNow we must talk about payment. If no one pays for it why would anyone ever use it? The challenge here is getting insurance companies to adopt this product, since majority of individuals will be getting this product using their insurance.\n\nThis article here talks about the cost. CGM average around $11000 and conventional test strips are $7000. The major cost comes from setting up the device and the initial procedures. Now this would change depending on which country. Some countries may provide this for free.\n\nThe article further outlines that CGM should be covered by most American insurance companies as the insurance often assesses coverage using cost/QALY (quality of life years gain, so much does this drug or product cost for each life year gained, the lower the number the better) essential it measures a medications cost effectiveness. CGMs start at 100 000/QALY which is still under some insurance companies' threshold for coverage (usual threshold is 50 000 - 100 000 for 7 days use, when extended to 10 days use, the QALY drops to $33 000/QALY which is within range of insurance companiesto cover. Again, remember this is for a system that’s used for 10 days. Imagine if they use it for 90 days the QALY would further decrease.\n\nReference for the article: University of Chicago Medical Center. \"Diabetes: Continuous glucose monitors proven cost-effective, add to quality of life for diabetics: Study of patients with type 1 diabetes shows that use of a continuous glucose monitor improves glucose control, adds to quality of life, and is cost-effective over manual testing with strips.\" ScienceDaily. ScienceDaily, 12 April 2018.\n\nAs of Jan 23, 2021, They have acquired yet another insurance company to cover for their product. This will continue to increase as more insurance companies realize that this is what patients want and its cheaper to cover it compared to other systems.\n\nThey currently have about 200 million covered lives with insurance like medicare (Federal coverage), blue cross, blue shield, Tricare and several others. SENS is moving towards full coverage.\n\nHere is the article about acquiring insurance coverage: [https://www.senseonics.com/tools/viewpdf.aspx?page={0BCB999D-C033-4343-A529-884A8057BC21}](https://www.senseonics.com/tools/viewpdf.aspx?page=%7b0BCB999D-C033-4343-A529-884A8057BC21%7d)\n\nAs technology advances these CGMs will become much cheaper to manufacture and hopefully replace your regular test strips. CGMs are superior to diabetes control and provides better patient outcomes, therefore generating cost savings for insurance companies. Eventually the market will move to CGMs.\n\n&#x200B;\n\n&#x200B;\n\n**Insider Trading**\n\n&#x200B;\n\nhttps://preview.redd.it/o4a215idt9k61.png?width=378&format=png&auto=webp&s=99a2e924272b861010684e00853b5a85a9662cba\n\nI believe one of the main aspects that need to be evaluated is the who is currently invested in this company. If there are a lot of insiders that are buying this company it means that they have confidence in this company. If not then we have a bigger issue with SENS. In the last 3 months there has been only buys, never any sells. Other aspects to look at is the amount of institutional holders in the company. SENS has well over 120 institutional holders (some sites say 117 some say 138).\n\n[More sources on institutional ownership and buying/selling: https://fintel.io/so/us/sens. ](https://preview.redd.it/9pwbu616fzh61.png?width=561&format=png&auto=webp&s=ae58c03165591302b67313b43a3ece22fb67081b)[**Follow the link** it gives you a good breakdown. Many directors in the company are picking up stock even at the 1 dollar price tag.](https://preview.redd.it/9pwbu616fzh61.png?width=561&format=png&auto=webp&s=ae58c03165591302b67313b43a3ece22fb67081b)\n\n&#x200B;\n\n&#x200B;\n\n**Their Management team and Employees (work place)**\n\nI looked them up on Glassdoor and they have a rating of 3.3 which to be honest is okay, not the best but the bad reviews are from 2019 and its people complaining about the company being fast paced and changes in management directions. Unfortunately, this is always the case with small start-ups. I work at a small company and the management team is faced with so many decisions because they lack support and are constantly doing so many things to try and grow the company while mitigating costs. The good thing about all the ratings is that they all support the CEO which is a good sign.\n\nTheir managers are all pretty well experienced in this field with talents from medtronics\n\nTim Goodnow, CEO – use to be VP at technical operations at ABBOTT Diabetes Care\n\nMukul Jain, COO – 13 years a Medtronic’s\n\nDr. Franchine R. Kaufman, CMO – 40 plus years in diabetes care, top endocrinologist at Childresn hospital in LA, author of more than 150 medical articles\n\nAbhi Chavan, VP of engineering and R&D – Leadership roles at Medtronic\n\nKatherine S. Tweden, VP clinical science – over 25 years of clinical and Regulatory affairs, over 060 patents and publications.\n\nMirasol Palilio, VP General manager global – VP of sales and marketing for Arkal Medical, worked at J&J, Abbott and help with strategic commercialization of freestyle.\n\nThis is a stacked team if you ask me. They have some of the best in town.\n\nFuture goals (if this is true and they can launch their planned product pipeline, this company is going to be bought out OR become a $100 stock, especially since dexcom is $300)\n\n&#x200B;\n\nhttps://preview.redd.it/oc47pwmet9k61.png?width=558&format=png&auto=webp&s=bcc12a1df2a1ba2c03285830cad32900e3553a5f\n\n**Summary + UPDATES (At the end most recent Investor Guidance)** \n\nR**ecent Update Feb 28 2021 - Discussed info, I BOLD the important points**\n\nQ4 2020 earning sales ahead of expectation – coming in ahead of expectation \n\nLong term guidance\n\n* 100-250 million by 2025\n   * Up side\n      * Ascensia partnership\n      * Product and it’s attribute relaunching in America, halted due to covid \n      * Pilot launch with ascensia in q4 – beginning in April 1st (MAJOR Catalyst) \n      * Opportunity in CGM market (5-10 billion dollar growth in the market in the coming year) \n      * Model based off their Germany sales for this 100-250 million in revenue \n      * A lot of the previous sales data is based of Europe, the America penetration is still coming so lots of upside\n* Predominately focused on America in the next couple of years – large impact on the business (over 4 year) \n* Ascensia partnership \n   * Commercialization Roche versus Ascensia \n      * Ascensia is much larger in the America, 10 million patients \n      * BGM market is retail oriented in America, Europe is more prescriber base  \n      * Ascensia stabilizing the base in Europe \n      * America is just based off the existing physician no expansion until April 1st – large ramp up \n      * Increase in sales reps, their recent sales were only at 10 and will increase to 40+ \n      * **April 1st will be a major start in the Direct-to-consumer (DTC) marketing from Ascensia (These marketing will be digital format, not yet tv ads)**\n      * **SENS is more operational, ascensia will be paying for DTC. Focus on medicare opportunity, will come out of ascensia part of the marketing, looking to spend 250 million on the commercial activity. KEYYY DIFFERENCE** \n   * **Medicare will be differentiated** \n      * **Durable medical dispensing but this will change in Medicare. Is covered for NATIONAL COVERAGE FOR THE PROCEDURE AND THE PRODUCT as established level. Physician can bill the government directly.** \n   * Ascensia B to C marketing will be controlled by both SENS and Ascensia together, high level marketing will still be controlled by SENS. \n   * LOTS more interaction with Ascesina compared to Roche.  (stronger partnership) \n* Covid situation \n   * Video training for physician \n   * Q3-q4 will be at a good ramp rate 2021\n* Product development \n   * 180 day delayed – probably closer to q3\n      * Back log on FDA by April 15, 2021. No further extension. Generic for the industry \n      * 6 month review from that period – The company is preparing to distribute 30 days from approval date.\n   * 365 days \n      * The game changer, authorization to extend the trail from the 180 day trial, retained accuracy of the system in 365 day trails \\\\=\n      * Improving chemistry of the system. Second half of 2021 will seek authorization of 365-day trial, testing European site. Very excited – gives basis for third gen. Help to bifurcate the system and make it for type 2 diabetics (freedom version), use for more on demand. 2024 most likely due to length of trial.  \n* Coverage \n   * Incremental coverage with the CTT code \n* NUMBER 1 ISSUE is awareness \n   * Ascensia will target this and will be their sole focus so watch out for their web presence increase ads. \n   * SENS was gaited in their ability. \n* High interest in the long term (from surveys and feedback) \n   * Duration is at the top of the list for consumers report regarding what they want in a CGM\n   * Push back concerns for SENS \n      * Procedures is a trade off for patient this will decrease as the product moves to 2 times a year insertion and finally to 1/year  \n      * Current users AMERICA 4000 patient, twice this in Europe \n      * Reinsertion – q4 reported 75% from reinsertion from sensor 1 -2 , 85% from 2-3. 90% from 3-4 \n      * Sensor 1-2 about 70% and sensor 3-4 about 80% (during covid, some effects from covid but this should return to pre-covid and may even be increasing with 180 approval) \n      * Strong emotional attachment to the product, people are very vocal if they can’t get the sensor. \n* Expansion financial side \n   * Break even for 2025. \n   * America and Europe Ascensia partnership are growing. – business plan seems to be very intact. \n   * Annual updates. \n* Integration with Insulin Pump \n   * Once they get the 180 day approval, will be filed for ICGM. \n   * Accuracy is very extreme and has high confidence there won’t be issues with that. \n   * Small industry and have been talking with them already \n\n&#x200B;\n\n**TLDR** \n\n**UPSIDE**\n\n\\- Superior product compared to their competitors. (cost savings and patient outcome)\n\n\\- Experienced management team, decent rating on glassdoor for a small company.\n\n\\- Many more insurance companies will start covering their product.\n\n\\- A lot of market shares still available.\n\n\\- Forecast of increased revenue especially with Covid being controlled soon.\n\n\\- Very shorted – and underrated, plenty of gains 🚀🚀🚀🚀🚀🚀🚀\n\n\\- Approval for their 180 day FDA approval very soon to come. (VERY confident it will pass, studies already reporting good safety data.\n\n\\- Increasing revenue from year to year  [📈](https://emojipedia.org/chart-increasing/)\n\n\\- Diabetes market is a growing market and will continue to affect more people as more countries become more developed (Africa and India are huge populations where diabetes is a very prevalent disease)\n\n\\- Their Final form (365 days) will honestly take 80% of market share, why would anyone stay with a product that you have to change 10 or 14 days when there is something that can be changed every year.\n\n\\- Lots of people have complained that they still wouldn’t want to go in for reinsertion biyearly. This honestly I think is an UPSIDE point, by having these yearly checkups it allows physicians to monitor a patients health allowing for frequent follow ups. This benefits the doctors since they get paid for visits. This benefits the patient since they will be followed up with more frequently and ensure proactive measures for future health benefits.\n\n**DOWNSIDES**\n\n\\- The company has a lot of cash burn compared to their current revenue.\n\n\\- Their debt to asset ratio is quite high, but most startups are especially if they want to grow.\n\n\\- Their shares volume is very large, high dilution, and could be subjected to offerings. \n\n\\- The company was affected by COVID as many people was not able to go into their family Doctors office. And their sales and marketing took a big hit. If this does not recover you can continue to see cash burn. (mitigated by the management team but still).\n\n\\- There is calibration that is needed for this machine, twice a day which is quite a lot, but this will eventually be worked out. Even Dexcom older generation needed calibration. This obviously will eventually change when the product matures.\n\n\\- Not compatible with Insulin pumps yet, but this will be in development, they already have studies with insulin pumps and it has been quite successful. They will be proceeding with its integration with insulin pump right after they get the 180 approval.\n\n**My thoughts**\n\n\\- I think this is an excellent company with SO MUCH UPSIDE. It was being pushed down so hard by shorts before. Not sure why…. Maybe because it’s a very good company and they want it to fail so someone else can pick up the tech they created. Another possibility was because it was running out of cash hard and their balance looked like it was going bankrupt. However this has all now changed from their offering. Now they are sitting in a nice place and I think this is the turning point for this company and it will now start to make profit and generate some very insane revenue.\n\n\\- This company would be an excellent buy out for companies like Dexcom that want to absorb their competitor or TELEDOC who is looking into digitizing patient management with systems that can be used to better control people’s health outcomes leading to less insurance claims.\n\n\\- This stock will continue to run, with some dips here and there. SENS can easily reach $10, maybe even $20 with it's amazing partnership with Acensia, amazing management team and a good product. I mean Dexcom is valued at 38 billion, SENS is sitting at just shy of over 1.9 billion, NOT even a 10th of Dexcom. This company I believe should at least be a 5th of Dexcom which means they should be around 5 billion which means the price still needs to double (2x let's go!) once more.\n\n\\- The Short term Prospect is that It will continue to be shorted (look on market place). The price might drop to below 3 or hover around the three dollar range. Then be pinned until MARCH 19th quad witching week. Then april 1st news and this is start to lag back up and retest all time highs. \n\n&#x200B;\n\nhttps://preview.redd.it/8p66slapt9k61.png?width=1355&format=png&auto=webp&s=9eaac60c094be73b79d588c4de75b86c947b5098\n\n\\- Continue to research the company. I think they have A LOT to offer but this is only my point of view. Do your own DD. **I do have shares in the company and am not looking to sell anytime soon. Like all great things it takes time and patience.**", "id": "luoep9", "created_utc": 1614541066.0, "score": 365, "upvote_ratio": 0.95, "num_comments": 77, "comments": [{"body": "This is a great dd. I have some sens also", "score": 43, "replies": [{"body": "It was great DD in January\n\nFolks holding some bags maybe", "score": 2, "replies": [{"body": "That's me", "score": 1, "replies": []}]}]}, {"body": "Type I Diabetic and early investor in Dexcom here, so I think I can provide some insight into the product I feel has been missed:\n\n\n\n**\"Lasts 90 days compared to 10-14 of competitors!\"** Yeah... sort of. You have to go into the doctor's office to get a surgical procedure done, and every day you have to replace the transmitter that sits on the top of the skin. Even though that doesn't pierce the skin, it's a big inconvenience. The Dexcom CGM really doesn't hurt much to replace, this is just not desirable to any diabetic. \n\n\n\n**\"Super accurate!\"** Dexcom's MARD is 9.0%, while Eversense is 8.5%. 8.5% from the mean is better, sure, but for a diabetic *this isn't a meaningful difference*. Our blood sugar swings from 100-200 frequently. That's just not a meaningful amount for what this data is used for. \n\n\n\n**Scarring** - The surgery can leave scarring. I don't really get excited about a product that offers me scarring... That being said, I would be interested in the product if I didn't have to physically go into the office to get the procedure. If senseonics figures out how to make this an at-home insertion, then it becomes more attractive. Big if.\n\n\n\n**Closed loop integration** - This is a HUGE value add for CGMs. Being able to integrate with insulin pumps is one of the biggest new trends in the industry. Insurance companies are going to be far more inclined to push diabetics to use closed loop systems... and diabetics are going to want it just as much. Dexcom has a huge, perhaps insurmountable start on this. It's a long development cycle to get closed loop and to have it approved. While I would certainly assume it would be faster with a new CGM instead of starting from scratch, there's not a lot of incentive for pump companies to do that if the CGM isn't already popular. There's a bit of a network effect here with CGMs and pumps. If I were interested in investing in Senseonics, I'd also be curious to know if any of these closed loop partnerships had exclusivity deals; I doubt it, but worth checking.\n\n\n\n**RE: glassdoor- Medtronic sucks.** I don't like that their leadership is from Medtronic. Medtronic is like the Mazda to Dexcom's Tesla. They were first in the industry, and have been getting absolutely destroyed by startups in the industry. A 3 star average rating for a startup sucks.\n\n\n\n**My conclusion:**\nTheir product is late to the market, and doesn't provide any significant advantage over the incumbents. They are Bing, and they will never be able to achieve the cash flow necessary to catch up to Dexcom which is already destroying the market, and has already secured the partnerships needed to accelerate their growth. If their technology is novel, then they may be a target for acquisition. Otherwise, I see no path to profitability for this company.", "score": 91, "replies": [{"body": "As an aside, appreciate your post significantly. It's a great contribution/read even if I disagree with the conclusion. Hopefully this provides some value back for sharing with us even if it doesn't influence your overall investment decision.", "score": 31, "replies": []}, {"body": "Hi irojo, You make a very good point about all these points. There are always down sides to initial iterations of a product. \n\n\\- so I agree I did outline this in the summary update part this will always be a trade off for a patient. As the amount of procedures needed comes down from 4 to 2 to 1 It will eventually change peoples mind. As a health professional myself, I like to see my patients at least 2 times a year to do check ups. These visits are paid for by the insruance. It makes a good buisness cause physician to adopt and push the product as well since they wull be paid. \n\n\\- you right in terms of the accuracy, but neverless it is still more accurate, and for some small changes may make a difference in their mental state, this is certainly more of a case when using it in elderly and younger patients or people that need a tighter control. \n\n\\-scarring - again this is a trade off that some will be made, some people care some don't. I think with convenience and accuracy people will eventually be okay with this procedure, You can use the mold for IUDs for contraception, not a lot of people liked the fact that you had to go in for a a very invasive procedures but more and more people are adopting this. \n\n\\- Close loop integration will come in the following year, they need to have the 180 day approval first which should be in by q3 time due to the lag time in FDA approval. \n\n\\- regarding the glassdoor - I mean it may be why they moved out of medtronics, so you have the people that actually wanted to move forward and be at a faster pace that has now had enough of medtronics and it's dying culture. The comments are very polarizing but if you look into the bad ones its people complaining about fast pace work and disorganization (this will always be an issue with startups and smaller companies) \n\nThat's fair for your conclusion, it's always the case when some company is winning everyone cheers for the winner. I like to look deeper and see if there will be a potential for a up and coming winner since that is where the money can be made. You have to remember Dexcom has had 6 iteration of their product to be at the place they are now. SENS is on their second, they will eventually take some market share and not only that but capture part of the growing market. They are improving their partnership with Ascensia. Lots of institutional backing. They are just about over 1 billion dollar market cap, I don't believe that at this rate they won't become a 5-10 billion dollar market cap. in the future, which still means lots of upside in their price. \n\nAnyways tho, thanks again for point these things out. always good to keep myself grounded, if they start falling short of their timelines and expectation in adoption numbers, then yea i'll probably be convinced by your points but as of right now i'm will to invest and wait. The narrative is too strong not to put something here.", "score": 17, "replies": []}, {"body": "Same as you, type 1 diabetic and early Dexcom investor.\n\nI've been watching SENS for a while now, and ignoring the plays you can make with the stock, I personally don't believe I'll get their product. The Dexcom G6 hits way more marks for me than Eversense, and by far actually. The G7 will be a small marginal improvement.\n\nEversense must figure out a how to make the implant procedure faster and easier. 180 days would be nice, but even that won't sway me from a G6.\n\nLook at it this way, if my G6 messes up (which it does), I have at least 4 different options of how to fix it. If my Eversense were to get messed up, I have only the option of going to the doctor. These devices aren't going to be perfect, even implanted, so the loss of quick fixes at home is a **massive** downside from a patient perspective.\n\n___\n\nAll that being said, the investor side of me will be watching this more closely and doing option plays on it. There's a lot of hype around them, so let's make some money even if I'm not interested in the product.", "score": 9, "replies": [{"body": "That won't be the case if they make it so that there is very little failures. Plus the procedure is an easy quick change at the office . Yes still have to visit the doctor but quick non the less. I'm sure they thought about this, therefore their production processes is probably very regulated and stringen making it much less likely for there to be fault sensors. The 180 is coming and I can see things changing . If there's a major cost saving insurance companies might start to limit dexcom . Since they need so may more units compared to sens.", "score": -1, "replies": []}]}, {"body": "Agreed. Type 2 diabetic here who has used CGM systems. I have a prescription for a Freestyle Libre, a 14 day CGM monitor that I can place on my arm at home in 30s after a shower. I don't use it all time (non-insulin dependent), but when I do it uses the NFC reader in most smart phones to read the sensor into an app, or a small handheld scanner for the more privacy conscious.\n\nNeeding to have a surgery every 90 days on top of regular diabetic checkup appointments is a total non starter for me.\n\nIf this device were a 90 day version of a much easier to implant sensor (probe in skin with a surface attachable sensor seems best in my experience), or if it was still 14 days but much cheaper, I'd be in in a heart beat both as a user and an investor.", "score": 8, "replies": [{"body": "Would you be willing to try the 180 day ? and if it was covered ? They have currently over 200 million lives covered. covered by medicare. They need more awareness.", "score": 3, "replies": [{"body": "2/yr is right at my tolerance point in terms of surgery frequency. The scarring mentioned in the OP might be a concern.\n\nI highly doubt any sensor will be 100% covered, at least by private insurance. The insurance industry treats diabetics like shit. I know people who have a provable medical life long dependence on insulin who still have to go to a doctor every 90 days and get a prescription refiled and refilled. Even though their lives depend on that medication. Being with a T1 diabetic who has ran out of insulin but hasn't been able to get to a doctor (for whatever reason) to re-up their prescription is heartbreaking. That dependence means that they don't have to cover it 100%, because their customers have no other options.\n\nNo matter how good their tech is, they're still at the mercy of the insurance companies.", "score": 4, "replies": [{"body": "Well recently they did say that Medicare and Medicaid covers for it. Not just the product but also the procedure. I think the over private coverages also cover for both the product and procedure, don't quote me on this one. Because you don't need to change it as often.  It's actually works out to be a much bigger cost saving for the insurance, this allows them to pay less. So I can see the insurance pushing for greater adoption of this product.", "score": 2, "replies": [{"body": "Per the CDC as of 2020, the 65+ age group represents 41% of the diagnosed diabetic population in the US. Granted, that's not a bad market share, and population rates are showing that will only grow in the next 10 - 30 years. The cost savings point is a good one that I hadn't thought of.\n\nIt might be a good long term play if you believed they were fundamentally technologically ahead of their competitors, which I don't believe they are. I have doubts about their ability to fend off competitors as the market changes, glancing at their granted patents it doesn't look like they have anything revolutionary yet. They will be a company I'll be watching in the future.\n\nIt is nice to hear people championing companies that are doing more in the diabetes space. Even though I disagree with your DD in the near term, good luck to you and I hope you do well!", "score": 1, "replies": [{"body": "I think they more than just medicare coverage. Here's a list apparently over 200 million lives insured. (Aetna, bluecross/blueshield (a number of states), tricare, veterans affairs, amerihealth, independence, cigna, HSCS, Humana, Molina, Highmark)\n\nreference: [https://www.senseonics.com/\\~/media/Files/S/Senseonics-IR/documents/events/senseonics-investor-deck-nov-2020.pdf](https://www.senseonics.com/~/media/Files/S/Senseonics-IR/documents/events/senseonics-investor-deck-nov-2020.pdf)\n\nBut yea I'm really looking at their freedom sensor that will be the mic drop moment, 1/year with no transmitter option (don't even need a thing on your arm)  2024 is their expected date. with covid probably 2025.   \nthey did the preliminary studies already you can see in the IR presentation above. very promising.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "1/yr is more tolerable.", "score": 2, "replies": []}]}]}, {"body": "This. I’m a type 1 diabetic (11 years and counting) and am way more experienced as a patient than as an investor. Every missing point that OP has mentioned is true and accurate from a product standpoint. Unless the company address all these points, I wouldn’t be inclined towards this product. Noting that: I’m a current FreeStyle Libre user and would much rather have Dexcom with the new closed loop integration tech.", "score": 3, "replies": []}, {"body": "Thank you for posting this. T1D here, fully agree. I have a metronic guardian and their latest sensor works great. This is mostly the case with existing systems - they are very accurate. They are also really hardly a hassle to replace, and don't leave scarring. On top of this, the SENS transmitter just looks massive and unsightly compared to current CGMs.\n\nBasically, too few upsides compared to the existing systems considering the semi-permanent nature of the proposed inserts. And don't get me started on the FDA approval process. It took years for them to get closed loop systems passed.", "score": 2, "replies": []}]}, {"body": "Thanks for the DD. I have used the device before  and mentioned SENS to friends / family and nobody thought it was worth anything under $1. The long term potential of this company is absolutely mind boggling. Hopped on this train early and looking forward to riding it to the top. 🚀\n\nEdit: The biggest potential risk to this company is lack of coverage from insurance which is a major issue and will turn away any diabetic patient. Coverage is always first to consider. Next their UI is garbage and their mobile app needs a complete overhaul. That being said, when I used the system I was able to correspond with the development team. It made me hopeful they are open to change when needed. The technology for eversense is there. This is the future of CGM’s (continuous glucose monitors).", "score": 30, "replies": []}, {"body": "Yeah so I didn’t read any of that, but I saw “10x” in the title, so I’ll be dumping at least 1K in when the market opens.\n\n(This is a joke, I will consider getting in based on the DD though)", "score": 10, "replies": [{"body": "Pshhh... pussy.", "score": 1, "replies": []}]}, {"body": "In 73 @ 3.01", "score": 6, "replies": []}, {"body": "Let’s fucking go! Finally there are more and more people going in SENS and I’m happy to see it! \n\nSENS just makes sense to buy for the long term. Don’t  say trade, short term, swing trade this. \n\n10,000 shares - cost average $4.23 - I won’t be selling my shares anytime soon.", "score": 5, "replies": [{"body": "If it falls you can average down. Won't be upset later this year when we get the approval in September ish time and it rockets to 10$", "score": 1, "replies": [{"body": "Yeah, I bought more last week when it hit like $3.20. It was at $4.50+, but brought my average down. Planning to buy more if it stays under $3.50 tmrw on when market opens.", "score": 2, "replies": [{"body": "This Friday is non-farm payroll, if the market freaks out and drops . I CNA see this lag under 3 . I would load up so hard.  Missed the 2.75 before so annoyed .", "score": 1, "replies": [{"body": "Yup, bought more shares. I hope it goes back to $5 by end of March.", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m in", "score": 5, "replies": []}, {"body": "For all the dyslexic’s SNES is discounted right now. Might be able to make a quick 15%. No dd. I just trade it a lot.", "score": 5, "replies": []}, {"body": "Looks like you spent some time on this, so thanks.\n\nI just want everyone to look up top posts in investing subs about health/drug companies from a year or more ago, then seeing where that stock stands today.\n\nLatest example was Soligenix (not a year or more since the posts, but we’ve passed the big day they were banking on) I'm sure a lot of people got burned on that one. \"Fast tracked by the FDA! to the moon!\" lol...\n\n&#x200B;\n\nNothing against your DD buddy, like you said, do your own dd guys. But these types of companies (aside from say, Moderna) don't have too good of a track record here", "score": 10, "replies": [{"body": "That's fine I'm in it for the long term. And I'm sure about you but this isn't a shitty company that has absolutely no prospects being pumped to the moon. They have a partnership with Ascenia which is a very well known company. AND they already have FDA approval, like half of the companies that a speculative for their FDA approval. I honestly think this is a better play than some of the SPACs out there. They have a very promising outlook and should continue to move forward, giving very conservative estimation compared to some other companies. Do I think it should be worth 10 dollars now, probably not but this thing will be $10-20 in 2/3 years times yes. They have delivered in terms of their estimation from time to time. This year will be a big year for them. easy return to $5 dollars i believe. \n\n&#x200B;\n\nSide note this is a tech health play, It's very easy to understand compare to your biotech companies. this is way different. All you have to understand is, is their product good can it monitor blood glucose, and it has been proven to be the most accurate product on the market. Now we look at the marketing aspect and their market penetration which is where they are lacking . But they have a solid product so i think this is fair well in the future.", "score": 6, "replies": []}]}, {"body": "Is it only me but everytime SENS DD is posted - op has diabetus. \n\nI've made money on SENs before but their financials are fucking awful.", "score": 3, "replies": []}, {"body": "Really pissed at myself for not buying that $2.80 dip last week", "score": 3, "replies": [{"body": "Don't worry it might comeback down, need to get through earning.", "score": 1, "replies": []}]}, {"body": "I bought SENS around 1.53.  \nLoaded more around $3. \nVery high conviction it will do well this year. \n\nThe product still needs improvement. \nI am hopeful with the new funding, they will be able to improve the product", "score": 3, "replies": []}, {"body": "Posted in a doctors fb investment group. Take it for what it is. \n\n“I see SENS going up and up and just wanted to post my thoughts on it as an Endo. \n\nI was very excited about it when I first learned about it at our Endo society conference in 2018. Followed the Instagram hashtag and patients in Europe seemed happy with it, so I bought 1k worth of stock. \n\nThen I started learning more. It’s an actual office surgical procedure to place the sensor, it requires stitches and scaring can be significant. Must be replaced every 3-6 months in the office. Patients also have to check a finger stick to calibrate 2x daily.  \n\nI did contact the company to receive training in order to be able to place these for my patients who were interested, but it was basically impossible to set this up. “\n\nDEXCOM is far superior and I really don’t see this taking off at all. I think this one is a memestock and will drop again like it did a few years ago. \n\nJust my thoughts, but I’m also learning that the market doesn’t really reflect product quality all that much.", "score": 3, "replies": [{"body": "They havent taken off because they had major issues with coverage and awareness. If you look at their previous reports on insertions, almost 75% of patients return after the first insertion. You aren't wrong that dexcom is more superior right now . But i trust in the management team to make the sensor better and increase it's life span. The 180 day will only require 1/day calibration. The dexcom only removed it's necessity for calibration in the g6 version. which is it's newest iteration. They product has so much potential and I see the adoption coming.", "score": 1, "replies": []}]}, {"body": "i feel like its gonna drop to 2.5 monday/tuesday", "score": 5, "replies": [{"body": "You aren't wrong it could, but I would just load up more. This is a winner long term. Timing the market is the worse thing you can do. find a price taget you think the stock is worth and start buying, if it goes down buy more. It's the long term we are looking it. Short term anything could happen. The market is spooked by inflation right now. probably over exaggerated, as it sells off this is a perfect time for you to shop for good value stocks like SENS. My DD is about the long term thesis, not in the next 2-3 weeks. this company will be a solid one, I believe.", "score": 6, "replies": []}, {"body": "The current support is at 3.5.... would be interesting to see if it does drop down further to 2.5", "score": 5, "replies": []}, {"body": "Why?", "score": 2, "replies": []}]}, {"body": "Type 1 here, I've been making money on the stock but I do not support their product. There are too many negatives and \"will be worked out as product matures\" items.\n\nFrom a realistic day-to-day use case, even 180 day implantable at this tech stage doesn't come close to the ease and flexibility of the Dexcom system.\n\nI'm here to make money on the stock and that's one thing, but don't get deluded into thinking SENS has a magic sauce that no one has thought up before. Even Dexcom was focused on implantables before they pivoted to externals.\n\n____\n\nThey'll spend a lot on marketing, they'll ride the tech health wave, and I'm sure there's money to be made on the long side of this stock. I'm with you. Just don't think they're doing something revolutionary.", "score": 5, "replies": [{"body": "I think it's going to be all in the marketing and how they spin this thing, and how easy they can get people to try it (remember the insurances like it and so do the doctors). The adoption rate is 75% from sensor 1-2 for the 90day, 85% from sensor 2-3. If they get the 365 days. That is a serious contender. Your telling me you wouldn't think about switching to something you only have to change 2/year versus 24 times (with some of those times maybe having some difficulty). I think people often think its fine, it's the normal and its easy to change something every 2 weeks. but then you experience the other side where you do not have to for 6 months straight. I think people will think twice about switching back. My 2 sense. I believe in the product and I think it will be something of great significance. anyways my opinion some may agree some may not. \n\nBTW Dexcom still has it's own issues, the adhesive has a lot of people questioning if it's a good product.", "score": 2, "replies": []}]}, {"body": "Ooof I sold off last week when I was up 1000%", "score": 3, "replies": [{"body": "No worries this is your time to re-enter, i think a lot of money is waiting on the side lines cause of the how the market is reacting right now. Initial spooks on inflation had people pulling out their gains. I think anything around 3 dollar range and under is a good add. March 19th is quad witching day (when a lot of options expire). There is a high short interest here. so they will keep the price down until then. APRIL will be a big expansion time for SENS Ascensia will launch their marketing campaign for SENS. This thing will move hard later this year. long term thesis. Their sales number should increase.", "score": 4, "replies": [{"body": "You know what they say... buy the dip", "score": 3, "replies": [{"body": "Yup buy the dip . I want more shares to be honest . If it comes down I'm load up", "score": 1, "replies": []}]}]}]}, {"body": "Excellent DD. Balanced. I appreciate, the time and effort you have put in. Please keep updating the thread, as SENS related news breaks.\n\n I plan on holding a minimum of 5 years, before I evaluate, if I should take out my initial investment. Yes, its a risky play. Though, I am very bullish on the product, I have tempered expectation on the price target. $10 by the end of the year would be nice, anything over that would be a cherry on top.", "score": 2, "replies": []}, {"body": "Hey guys please follow this Reddit group if you are actually interested in investing in SENS. We try to put out notification and upcoming news to help keep each other updated. Again this is NOTTTT a pump and dump. I'm holding this long term. It's deep value play. \n\n[https://www.reddit.com/r/senseonics/](https://www.reddit.com/r/senseonics/)\n\nThanks guys ! Happy investing  🚀🚀🚀🚀🚀🚀🚀", "score": 2, "replies": [{"body": "You mean... *deep fucking value play*?", "score": 1, "replies": []}]}, {"body": "You mean the peak was valued at 1.9b$. Right now it’s closer to 1.27b$.\nI am bullish on $SENS and I think they have a great story going forward.", "score": 2, "replies": []}, {"body": "45.94% of float is shorted according to MarketWatch.", "score": 2, "replies": []}, {"body": "I started playing around in pennies mid January and SENS was one of the first ones I bought, 100 @ .985, had a nice spike a few weeks ago as well, hopefully it picks back up some momentum", "score": 2, "replies": []}, {"body": "We killed it bro! The jokers can Laugh all they want! Lol\n\nI’m saying it’s hit ATLEAST mid 5.xx by end of year! I’m up like 82% as of this morning. Let’s slay those shorties!!!", "score": 2, "replies": []}, {"body": "I think you're mispelling $SNES\n 🐀 #ratsgang", "score": 1, "replies": [{"body": "hahah yea i heard of their stock as well. different but no this is the one, that's going to be the long term winner. I think at least.", "score": 1, "replies": []}]}, {"body": "it makes sense to buy some SENS", "score": 1, "replies": []}, {"body": "Was in way early, and out at the first moon a month ago.  It's resisting at 3/3 fiddy, right? Did you buy high and are holding a bag?  Or is there a catalyst approaching?", "score": 0, "replies": [{"body": "Average around 2.50 . Just kept pick it up here and there . Holding if it drops jsut going to buy.  Amazing company that I don't mind owning more shares of.", "score": 1, "replies": []}]}, {"body": "HAHAHAHAHAHAHAHAHAHAHA", "score": 0, "replies": []}, {"body": "$ghsi it’s good right now", "score": -1, "replies": []}, {"body": "Good news on EV company xpev. They are releasing lithium phosphate powered electric car in March 3. The stock might go up.. buying some shares.. let's gooo", "score": -2, "replies": []}, {"body": "Good news on EV company xpev .. they are releasing new lithium phosphate battery powered car .. the shares might go up.", "score": -3, "replies": [{"body": "Hi friend you might be in the wrong section . Please comment on the DD if you are posting . Thank you", "score": 1, "replies": []}]}, {"body": "I genuinely think $PACB is legit AF - no matter what BNGO fanboys say, which is just another hyped stock", "score": -11, "replies": []}, {"body": "AbCellera is on a whole other level. They money speeding up drug research, the runway is massive and they aren't limited to one area of expertise like a standard BioTech", "score": -16, "replies": [{"body": "Hi friend, thank you for promotion. I will look at the company. But if you are going to post on the DD, if you would be so kind to many comment on the company i'm reviewing i'm looking for insights as well. thank you", "score": 7, "replies": [{"body": "I is an ABC pumper.  His only two posts are about that company and the account was created two days ago.", "score": 6, "replies": []}]}]}, {"body": "Thank you for such a detailed analysis. My worry is that analysts have pegged this stock at 0.93 in a year's time and right now its trading in the mid 3's. Not that analysts are seldom right but still....", "score": 1, "replies": [{"body": "Investment I guess is for the future . If we hold then this company it will be worth much more than what they say it to be . Their guidance that was given is very conservative. I do believe that the company will be making big moves later this year . So early investment is key .", "score": 1, "replies": []}]}, {"body": "Buy puts got it", "score": 1, "replies": [{"body": "Maybe in the short term but don't bank on it for the long term . I have a feeling this might actually be up tomorrow since futures are up.", "score": 1, "replies": []}]}, {"body": "Well „do my own DD“ would mean that there is some information out there you HAVENT touched yet.. all my DD will be a part of yours...", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "*Ok, someone please*\n\n*Tell me why I shouldnt buy*\n\n*A few thousand shares?*\n\n\\- TenaciousBroski\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")", "score": 1, "replies": []}]}, {"body": "Somehow this is a reddit darling after the Walrus made a video on it. In the video he clearly states that the CGM by SENS can go for 3 months now and pending trials and approval there is a potential for 6 months in the future (maybe Mid-year). He goes on to state that while current market CGMs can be inserted at home by yourself the SENS model needs to be done via a surgical procedure. \n\nEveryone on reddit seems to over look the latter part of that. \n\nIt doesn't matter that a monkey can implant the CGM, its that a monkey needs to be used at all. You need to book the monkey to do it and thats the kicker. Compared to the other models on the market, to me as a non diabetic, this doesn't seem to offer a great deal more convenience. Another point to consider is what if the machine malfunctions? \n\nThe other thing that i picked up on after reading some other DD posts is that the mobile app used to monitor my Glucose levels can be shared around. um wtf...? How is this not a huge red flag for all the privacy minded people out there.", "score": 1, "replies": [{"body": "You are correct that there is a possibility that the machine may malfunction based on the reported data the re-insertion rate is extremely low. From what I understand yes you will need a procedure but it's small and gives people the convenience to be free of having to change a sensor close to 25 times/year. \n\nThe feature for sharing is so that you can share it with your loved ones so that you can safely monitor someone who is elderly at home and needs further surveillance. From what i understand the sharing feature has to be authorized from sharer. So no there is no privacy issues.", "score": 1, "replies": []}]}, {"body": "Great DD, well done.", "score": 1, "replies": []}, {"body": "Who got the partnership with the new Apple Watch?", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "luaheg", "created_utc": 1614499214.0, "score": 66, "upvote_ratio": 0.86, "num_comments": 76, "comments": [{"body": "I think it was overpriced at 73$. 48 is a decent price to get in if you believe in the stock imo. I'm not sure it will go down much more. Trying to time the bottom may not work out for you.\n\n48 is still probably a bit more than its worth, but market is crazy and its a long hold stock. It will go back up.\n\nDisclosure: hold some on a long position.", "score": 38, "replies": [{"body": "let me get my crystal ball so I can buy it when the market crashes in exactly 42 days and PLUG is at 24", "score": 18, "replies": [{"body": "Bro. It has been 46 days and it is currently sitting and \\~$25. Your joke happened to be extremely close.", "score": 11, "replies": [{"body": "I never said I was joking with my fortune telling powers... just kidding I'm bag holding hard. \n\nIf you would like me to predict the future it will cost $1000. No tax included :D", "score": 6, "replies": []}]}, {"body": "WTF. What a call. I wish I read this 46 days ago. You got an extra crystal ball I can borrow?", "score": 5, "replies": [{"body": "Haha I ran out of crystal balls calling 20 of the last 4 crashes. What I can tell you is that the market will either go up or down tomorrow!", "score": 5, "replies": []}]}, {"body": "or buy 100 shares and hedge with a put @ your strike price to cover yourself from more downside, you can also sell calls to collect premium if continues downward.", "score": 2, "replies": []}, {"body": "holy fuck.... i wish i saw this earlier.", "score": 1, "replies": []}, {"body": "yoooooooo", "score": 1, "replies": []}, {"body": "it's time to buy :)", "score": 1, "replies": []}]}]}, {"body": "Look at their one year chart, that might give you an answer.", "score": 21, "replies": [{"body": "This", "score": 3, "replies": []}]}, {"body": "I would suggest doing some DD on PLUG or any other stock you are considering as an investment. Most American investors don’t see the investment the rest of the world is making in the hydrogen economy so they think of hydrogen as side-show when it comes to reducing green house gasses to impact climate change. \n\nPlug Power is the largest user of hydrogen in the US consuming 40 tons per day. They are constructing the first green hydrogen plant in North America. They will have additional sites producing green hydrogen from renewable energy(hydro, wind, solar) with the capacity of 100 tons per day in 2022, 500 tons per day in 2025 and 1,000 tons per day in 2028. Amazon, Walmart, Home Depot, Carrefour, BMW, GM, ASDA, Krueger and more PLUG customers are telling Plug that they want green hydrogen.\n\nPlug has a $1.5 billion JV with the SK Group in South Korea, a $1.5 billion JV with Renault in France and a $1 billion JV with Accioni in Spain?Portugal. I would suggest starting with this info and do some DD to see if PLUG is an investment for you. Good Luck.", "score": 17, "replies": [{"body": "Isn't it Plug who pretty much gift shares in their company to other companies to make revenue? I seem to remember reading Amazon effectively got 3.5bn worth of shares for a few hundred million in revenue.", "score": 5, "replies": [{"body": "Both Amazon and Walmart were granted warrants in exchange for the first $600 million dollars they each spent with Plug. Amazon’s warrants were completed in 2020. Walmart’s will be done in 2021, later than Amazon because Amazon pays cash and Walmart pays through leasing. The value of the warrants is a non-cash charge to Plug so it doesn’t cost them anything.", "score": 1, "replies": [{"body": "Costs the shareholder though.", "score": 2, "replies": [{"body": "Yes, it certainly does just like a share offering. They both result in dilution but are necessary for growing companies. Tesla is still diluting shares because they are growing. Thanks.", "score": 1, "replies": []}]}]}]}, {"body": "> I would suggest starting with this info and do some DD to see if PLUG is an investment for you. Good Luck.\n\nI'd recommend looking into Xebec Adsorption (XBC.to) too. They've seen a similar meteoric rise, and drop, in sympathy with BLDP and PLUG.", "score": 0, "replies": []}]}, {"body": "> Since hydrogen is a new technology \n\nI don't get it. Hydrogen tech is as old as can be. Fuel cells have been around for a while. The rate of efficiency / cost improvements in generation and manufacturing hasn't really increased much or had a breakthrough of any kind. Why are so many people creaming over hydrogen in the last couple years?", "score": 23, "replies": [{"body": "> Why are so many people creaming over hydrogen in the last couple years?\n\nBecause they have literally only looked at the upsides and the cool fact that \"only water comes out the exhaust\" without realising the inherent practical problems of dealing with literally the smallest molecule", "score": 4, "replies": [{"body": "And battery tech has stalled. Throw all the money in the world at it. It’s not like Moore’s law like musk and every other tech person wants you to believe. Hydrogen prob is the way to go. Young investors need to realize this.", "score": 4, "replies": [{"body": "Hydrogen may be the way to go for SOME industries, particular heavy trucks (yet to be seen)\n\nHowever current battery and charging tech is already more than sufficient for the vast vast majority of light duty vehicles\n\nThe hydrogen hype is really driven by a lack of understanding on just how hard hydrogen infrastructure is to implement", "score": 10, "replies": [{"body": "I don’t think it’s hype. There’s no rare earth metal problems with hydrogen. But what would musk know about that he only comes from a mining family in South Africa.", "score": 8, "replies": [{"body": "Platinum is required for fuel cells, so there is some concern about price and availability for Platinum.", "score": 3, "replies": []}, {"body": "There are no rare earth metal problems but lets just ignore all of the other more fundamental problems...", "score": 2, "replies": []}]}]}]}]}, {"body": "I don’t know if this means anything but they make fantastic pallet lifts and forklifts. Walmart has adopted them and they are so much better than the old lifts Walmart had. Other companies are also gonna be buying plug power lifts apparently", "score": 2, "replies": []}, {"body": "My bad, it thought the tech has improved a lot in  the recent years, hence the immense popularity about this stock", "score": 1, "replies": []}, {"body": "It solves a lot of energy storage questions for a non fossil fuel energy grid", "score": 1, "replies": []}, {"body": "It's just the renewable craze. With more and more companies investing in EVs, they are going to look for better battery solutions. PLUG is one of them, but QS is another company that benefited from it. It also followed a similar pattern where it was overvalued a few months ago before falling to a more reasonable price. Everyone is trying to find the battery manufacturer that will stick in 10-15 years.", "score": 1, "replies": []}, {"body": "We’re finally on the cusp of having a large enough, green, energy surplus to make hydrogen a viable energy storage source. \nPlug Power have spent years improving efficiencies of their PEM fuel cells and now have the capital, JV and Partnerships to take it world wide.\nI’m gutted the price is tanking like it is at the moment and truely believe it’s undeserved. \nWell have to wait and see but I believe US will adopt a hydrogen plan, much like all European countries :)", "score": 1, "replies": []}]}, {"body": "Of all the \"green\" technologies, hydrogen has the most challenging path to success.\n\nAlso, in its current state its not even a green technology. 90% of the world's hydrogen is produced from natural gas.", "score": 7, "replies": [{"body": "FYI - XBC uses RNG to make green hydrogen.", "score": 2, "replies": []}]}, {"body": "Got 6.50 premium last week on 45$ csp 38.50 entry its just a downturn last couple weeks on a lot of stocks similar to plug imo", "score": 7, "replies": []}, {"body": "it’d probably be smart to wait for stabilization or a confirmed reversal. who knows how much more it can dip, supports are being broken everywhere. stairs up, elevator down", "score": 6, "replies": []}, {"body": "PLUG is an Industry Under-Perform\n\n[https://www.hedgyanalytics.com/HedgyReports/](https://www.hedgyanalytics.com/HedgyReports/)", "score": 2, "replies": []}, {"body": "Check out ITM Power, smaller company, less hype but quite a lot in the pipeline. They focus on electrolysers.", "score": 2, "replies": []}, {"body": "My oh guys know this company was around in 2000 right? Same with Ballard Power. These are companies that saw the same trends before. Excitement builds then they get valued properly to the $5 they are worth. I hope they can do wonderful things.", "score": 2, "replies": []}, {"body": "Hydrogen and butteries and everything related to this space will be a crowded commodity in a few years. At the price these companies are trading at it looks like market is placing them having a monopoly.\n\nThis stock is a trade and not an investment.", "score": 2, "replies": []}, {"body": "What do the fundementals say? Do you believe in the company, like what it does , is there a future for what they do or sell?, is there a current market?, etc. these are what I ask myself prior to purchasing a stock. I am no professional, this was all just how I personally approach my own portfolio, maybe I’m wrong? I’m open to advice as well. I was thinking of getting some because I believe in the company and feel there will be a market eventually but who knows, maybe by the time it’s ready to go, a new administration will come in and push a different adgenda. I want to be in on the ground floor and this is the risk I take but I will re-evaluate my decision based on more information regarding this company ,in the future. Time will tell. I hope they go forward with this technology, it seems cool. Again all my own opinion on how I make my own decision on my own portfolio, everyone is different, good luck 👍", "score": 2, "replies": []}, {"body": "I think the market has more to drop over all.", "score": 1, "replies": [{"body": "I agree, especially the NASDAQ 100, however I think (and hope) that the ones that dropped around 40% have seen their bottom and will stabilize", "score": 2, "replies": [{"body": "When they are overpriced by 500% or more they are going to drop by a lot more than 40%", "score": 3, "replies": []}]}]}, {"body": "Ill buy plug at 25$.", "score": 1, "replies": [{"body": "did you do it? lol", "score": 1, "replies": []}]}, {"body": "Hydrogen is nothing new and I recently saw a Top Gear episode where they tested a hydrogen car in 2008. Since then nothing really changed. \n\nAdd not really thrilling financial and a bogus market cap and I think that anything above 12$ is overvalued for PLUG.", "score": 0, "replies": [{"body": "I believe the tech has been made more efficient and production on large scales made possible through research and development through Plug in recent years. \nWith this the price of solar, wind and hydro has drop and we are finally on the cusp of having a large enough green energy surplus to produce cheap green hydrogen in large quantities. Plug plan 500TPD by 2025 and 1000TPD by 2028. \nJust my thoughts \nCheers :)", "score": 3, "replies": []}, {"body": "Plug Power has $5 billion in cash. Please explain your theory that PLUG is only worth a $12 valuation. Thanks", "score": 4, "replies": [{"body": "Their current market cap is 28 billion. And they don't make any money and won't make positive revenue for a long time. So a 7 billion market cap would be appropriate since they burning throuhg the cash.", "score": 6, "replies": [{"body": "Let me see if I understand. PLUG has over $9 per share in cash so your expert evaluation is that they are only worth $12/share. The only expertise you note is that you watched a Top Gear show once. If you want to provide some real facts, I wold be glad to present you with the facts I have on hand and give you my evaluation. Come on man! Good luck with your investments.", "score": -1, "replies": [{"body": "Wel that was just an example. There were Hydrogens models avaliable in 2008  and since then their adoption is still far from close mainly due to storage. \n\nYes they have 9$ per share, but they still burn through loads of cash yearly and I don't see how they will turn a good profit when they have 300 million in revenue which creates an insane P/S ratio. \n\nTheir current market cap is higher than that of Nissan, Suzuki, Mazda and very close to KIAs yet we neither see hydrogen being used for engines or for energy production. \n\nNow I would love be be proven wrong and please present me with the facts, but I can't see how they will become as valuable as they are now.", "score": 5, "replies": [{"body": "Thanks for the response. Do you know that Plug Power has 40,000 hydrogen fuel cell powered material handling units in the field today? They are forklifts, robotic material handlers, airport tiggers, etc. They are used by Amazon, Walmart, GM, Home Depot, BMW, Kroeger and others around the globe. Their material handling unit accumulate more than 500,000 hours of use per day, 365 days per year. Plug Power fuel cell units move 30% of the food the US consumes on a daily basis. Please don’t think of cars when you look at the hydrogen economy. Cars work better with batteries because people don’t operate them 18 to 24 hours per day. Plug had 2020 revenues of $337.4 million. They are predicting revenue of $475 million for 2021 and they have contracts for 95% of the 2021 revenue already. Their guidance for 2022 is $750 million. By 2024, Plug will be making $1 billion per year just from their green hydrogen production alone. Their 2024 guidance is $1.7 billion and that doesn’t factor in the revenue they will have from their recently signed JV with Renault in France. Good luck.", "score": 2, "replies": [{"body": "Thanks for the write up, greatly written. Now the problem I have is that even if they have 1 billion a year in 2024, how much of that will be actual income? I have looked at thier plans and still can't see how they would be worth as much as they are today. No matter how bullish the view. Even huge revenue growth, I can't see them being worth more than 15 billion if they make a billion in revenue in 2024 (which would still be a high P/S ratio)", "score": 2, "replies": [{"body": "Tesla had $862 million profit in FY 2020 and they have a market cap of $648 billion. Plug Power will have $350 million in profit in 2024 on $1.7 billion in revenue. To compare apples to apples, Plug’s valuation would be $259 billion In 2024. Why would you think their market cap would only be $15 billion? By the way, Tesla loses money on every car they sell. Their main income is derived from other car companies buying their green credits. Good luck.", "score": 1, "replies": [{"body": "You cannot take one of the most overvalued companies of the century and compare it to another one. I would understand if you take an overvalued company, but nobody can properly argue that Tesla isn't completly overvalued", "score": 0, "replies": [{"body": "I agree that TSLA is overvalued from a technical view but the market value of all stocks is based on what investors are willing to pay to invest in a company. Even if someone doesn’t think PLUG has a good business model, PLUG has more cash than 98% of the US listed companies. That alone raises their intrinsic value. Good luck.", "score": 2, "replies": []}]}]}]}, {"body": "Thank you, if this doesn’t restore faith I’m not sure what will. In at $35 and holding", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tell that to their balance sheet", "score": 1, "replies": []}]}, {"body": "Plug has a history of losing money and issuing new shares. They want to make hydrogen vehicles? Honda already has a working hydrogen car for about 10 years waiting for infrastructure. The next decade is for EV infrastructure maybe hydrogen will get the decade after that. I want to see what Plug does with their South Korea deal. That’s a huge test.", "score": 1, "replies": []}, {"body": "From a previous post about $PLUG, my bear breakdown\n\nhttps://www.reddit.com/r/wallstreetbets/comments/lm5ubt/plug_power_is_extremely_oversold_heres_why/gnulox6/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3", "score": 1, "replies": []}, {"body": "Its a good price but it is still very expensive. This is a company you need to have a 5-10 year outlook on to justify buying. I sold this for a few bucks a few years back but I bought back in last week. I think you will see good things from their R&D spending and corporate partnerships over the next few years.", "score": 1, "replies": []}, {"body": "This is presently being discussed over at r/plugpowerstock :)", "score": 1, "replies": []}]}
{"title": "Can someone help my understanding of Options and Selling Puts specifically?", "selftext": "I’m just curious and trying to understand, I had surgery this past Tuesday to remove the cancer in my neck/throat. So I’m on PTO recovery for the next month trying to learn the ins and outs of the option stuff now. I’ve been going down the rabbit hole of google etc, I’ve searched relatively narrowly specifically on selling puts so maybe my confusion is because I didn’t go wider on the general options topic in the first place. \n\nWhat has me confused is I was reading on SPY and a statement that followed is like a trick question for my ass trying to answer/figure it. \n\n“Sell the March $355/$350 bull put for around 55 cents.”\n\nI hypothetically pick $350 call with a “limit price” of 0.55. (Bid is 0.48 ask is 0.51). I enter it for 1 contract for a total or (min credit) of $55.00. \n\nIf SPY was trading at $379.70 currently and the $350 option was to expire on 3/5. Does that mean on 3/5 or before I’f the stock drops to $350 I then have to buy 100 shares @ $350 or 100 shares @ 0.55? What has me stuck is that I have to have money in my account (the $55) to execute it. If SPY stays above $350 do I just get my $55 back when it expires worthless? If SPY hits $350 or lower by 3/5 or sooner then where does my $55 go and am I now obligated to buy 100 shares @ $350?\n\nI just don’t see or understand the risk/reward here, I pay $55 to execute and either get my money back if it stays above $350 or if it hits $350 or lower now have to buy 100 shares @ $350. The profitability box says like 94.80%. So I don’t get where or what the profit comes from when I either get my $55 back or have to fork over $35,000 for 100 shares.", "id": "luou77", "created_utc": 1614542175.0, "score": 8, "upvote_ratio": 0.91, "num_comments": 72, "comments": [{"body": "When you sell a put you receive a credit(the premium)\n\nThe premium is you benefit. It’s yours free and clear. \n\nIf you are assigned you would have to buy 100x350.00. If you sell the put you will have to have $35,000 in collateral in your account that will be suspended. Tying up 35k in cash to make a $50 premium is not logical. \n\nYour only likely to be assigned if it is profitable to the buyer of your put usually at a share price less than the strike. That is the break even or strike - premium for the buyer. \n\nFeel free to correct me if I’m wrong. I’m a noob this is not financial advice.", "score": 6, "replies": [{"body": "That’s what I’m thinking, and dumb founded that it’s even a possibility. You literally would have to “pay” $55 as the min credit that you just get back, or you are sucking air dropping $35,000. \n\nThere is 0 upside and all downside in my eyes to this scenario and I can’t wrap my head around why anyone would do it? \n\nWhy would anyone do a $350 “sell put” 3/5 @ 0.55 for a chance to keep $55 or lose 35k", "score": 1, "replies": [{"body": "some people actually want to buy the shares at the X price", "score": 3, "replies": [{"body": "So I get and understand the appeal to that entirely", "score": 1, "replies": [{"body": "that’s why they sell the puts. they’ll get a premium and they happily buy the shares at the X price. only downside is if it goes significantly lower than the x price, or even a little lower, they are obligated to buy at the X, when they could’ve bought it at market value instead.\n\nthe purchaser of the put profits off the difference it fell below the strike (if they exercise, forcing you to buy the shares)", "score": 1, "replies": [{"body": "I found a good read that explained that process and how said person wanted to get into Microsoft cause yeah know it’s Microsoft. They weren’t willing to pay the current rate so set it up for a 10% discount because they still wanted the shares just ar a better rate.", "score": 1, "replies": []}]}, {"body": "Plus the odds of spy dropping 40+ points by Friday is like 01%.", "score": 1, "replies": [{"body": "Agreed, which in turn is like 01% of me forking 35k over", "score": 1, "replies": []}]}]}]}, {"body": "... you need to go way back to the basics. A credit is when you receive money. A debit is when you payout money.", "score": 2, "replies": [{"body": "Nah it’s the UI, “min credit” but I have to front that credit first to get it.", "score": 1, "replies": [{"body": "No you don’t.. it says minimum credit Incase your order is filled at a more favorable price. Minimum refers to it being a limit order", "score": 1, "replies": [{"body": "I’m saying the UI is what makes it confusing. \n\nContract (x100)\nLimit price\nMin credit \n\nWhatever I put in the limit price x100 is what reflects in the min credit which then requires me to have that respected amount to even proceed further with it.", "score": 1, "replies": [{"body": "No it requires that you have the collateral.. that is set aside to purchase the stock if you are assigned. 100xStrike price. In your example it’s $35,000... do you have $35,000 as collateral to collect the $50 credit?", "score": 2, "replies": [{"body": "Fuck no, that’s what spooked me playing around in it (not committing to it or anything) is that with as far as I went shy of executing it, I only had to deposit $55. \n\nSo what threw me off was that nothing popped up saying you know you need 20% collateral on 35k or for the funds to be available etc etc. unless it’s stupidly implied and there is no protection from preventing that mistake.\n\nWhich further led me down the rabbit hole because I assumed worst case id have to fork 35k but it essentially led me into that (at least with as far as I got) thinking $55 might be all there is to it lmao", "score": 1, "replies": [{"body": "You shouldn’t have access to options if you need a pop up to keep you from going bankrupt.. please make sure your margin is turned off.", "score": 2, "replies": [{"body": "So it’s stupidly implied got it. \n\nI’m not committing to it lol, I’m trying to figure it out without throwing money into it. I haven’t done a single options trade and don’t plan on it. \n\nYou’re very keen on pointing out my idiocy when I’m literally just trying to learn about it.\n\nRegardless I appreciate your feedback, thanks for your time.", "score": 1, "replies": [{"body": "https://www.optionseducation.org/referencelibrary/brochures-literature/page-assets/options-strategies-quick-guide.aspx", "score": 2, "replies": [{"body": "Wow! Thank you for sharing that!!", "score": 1, "replies": [{"body": "You’re welcome. It’s a lot of good information", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Thanks for posting this. I’ll stay here for answers.", "score": 2, "replies": [{"body": "I’m all for learning opportunities, it’s just not clicking for me here so welcome and hopefully this can help you as well!", "score": 2, "replies": []}]}, {"body": "Honestly, don’t trade options if you don’t understand.", "score": -1, "replies": [{"body": "I’m not at the point of trading, I’m at the point of trying to understand. I’m without a doubt in the phase of learning more than I earn. \n\nI haven’t put any money or executed this example. It’s just one I dug into and got stuck on understanding.", "score": 6, "replies": []}]}, {"body": "> If SPY was trading at $379.70 currently and the $350 option was to expire on 3/5. Does that mean on 3/5 or before I’f the stock drops to $350 I then have to buy 100 shares @ $350 or 100 shares @ 0.55?\n\n\nIn theory the contract buyer is not going to exercise his option at 350$, he is going to wait for it to sink more to make a decent profit.\n\n\n\n>  If SPY stays above $350 do I just get my $55 back when it expires worthless? \n\n\nIf you SOLD the put, you get the 55$ right away, and if it expires worthless you just keep your 55$ and enjoy your profit.\n\n\n\n> I just don’t see or understand the risk/reward here, I pay $55 to execute and either get my money back if it stays above $350 or if it hits $350 or lower now have to buy 100 shares @ $350. The profitability box says like 94.80%. So I don’t get where or what the profit comes from when I either get my $55 back or have to fork over $35,000 for 100 shares.\n\n\nI understand nothing about your non sense.\n\n\nIf you bought the option for 55$, and SPY stays high, you lost your money and it expires worthless. But if it crash, you are forcing the person to buy your SPY for 350$ each. Its essentially an \"insurance\" in case SPY crash.\n\n\nIf you sold the option, then its reversed.", "score": 1, "replies": [{"body": "If I sold the put (which is what it would be, selling a put is what I’d be trying to do here) I get the $55 I had to front to initiate it in the first place so I’d break even. If it expires worthless I keep my $55 and enjoy what profit? \n\nThe nonsense on the bottom is that I get or pay a min credit or $55 (0.55) as it says on Robinhood. The idea is that selling the put on a $350 call 3/5 expiring is that I expect the price to stay above that $350 mark. If I’m the writer I thought I’d be obligated to buy it if I’m selling the put? \n\nI’m just trying to understand the quoted statement from the article I read and how you profit on it in regards to this example with SPY. \n\nDo I either get the $55 back that’s labeled as “min credit” in Robinhood or at worse spend $35000 on 100 shares? To me I see no point if I’m fronting $55 only to get that $55 back (if successful) with a downside of having to blow 35k on 100 shares.", "score": 1, "replies": [{"body": "You are not paying 55 to get 55 back. You immediately receive the credit when you sell a Put. \nYou can not sell a put with out having it covered typically by cash. \nYou would need $35,000 in cash to even write the put, which could not be used until you closed your position.", "score": 2, "replies": []}, {"body": "What are you saying? A put option and a call option are two separate things. If you Sell a put option at a strike of 350 the most you can earn is the premium you charged the buyer yes. If the price hits 350 or below the buyer has the option to exercise the contract and you are either paying the difference of the current price and your strike or you are picking up 100 shares.\n\nThe best case scenario for a put seller is it doesn’t hit the strike so you keep the premium and don’t get called on the contract.", "score": 1, "replies": []}, {"body": "If you “Sell to Open” a contract (Put/Call), you keep that premium ($55 in your scenario).", "score": 1, "replies": []}, {"body": "You are selling someone the right to PUT 100 x STRIKE for $55. Otherwise your are buying the right to PUT them on someone else for 100 x STRIKE.\n\nWith a call you are buying the right to CALL shares to you for 100 x STRIKE or selling the right to CALL shares away from you to someone else.", "score": 1, "replies": [{"body": "Thank you for that explanation!", "score": 2, "replies": [{"body": "No problem!", "score": 1, "replies": []}]}]}]}]}, {"body": "Great way to lose a bunch of money", "score": 1, "replies": [{"body": "I think that’s my point, I either get the money back I put in with nothing to gain but essentially have $35,000 to lose.", "score": 0, "replies": [{"body": "Puts on Apple? 🤷🏻‍♂️", "score": 1, "replies": [{"body": "I don’t understand, sorry for being an idiot lol. I’m not looking to go options a bunch of shit, but everything I’ve read so far is it’s the best way to maximize gains while also risk substantial loss in some regards. Still looking for the many versions of different ELI5", "score": 1, "replies": [{"body": "the point of selling puts is basically “hey, i’d LOVE to buy 100 shares of\nthis stock at “strike price” AND, I get a premium for signing a contract?? cool!\n\nthat, or the seller is bullish and extremely confident the stock will rise..and he will never have to buy the shares, and will profit off the premium", "score": 2, "replies": [{"body": "The second part I guess is where I’m trying to loop my head around partially", "score": 1, "replies": [{"body": "what don’t ya get? i’ll explain", "score": 1, "replies": [{"body": "Shit I’m getting ate up and think it’d be wise to shut up lol. \n\nIf using the example I gave from the article “Sell the March 355/330 Bull put for around 55 cents” how do you or would someone gain a profit off that statement?", "score": 2, "replies": []}]}, {"body": "idk what a bull put is. don’t overthink it.\n\ni’m interested in buying 100 shares of XYZ for $5 a share ($500), right now it’s $10 though, which is too much for me.\n\nso i’ll sell a $5 put of XYZ for a .50 premium ($50) expiring 3/5. i keep this. it’s mine forever (PROFIT) , I put up $500 in collateral to sell this contract\n\nI sold (1) $5 Put 3/5 \n\nIf XYZ falls to 5 dollars or below on or before the expiration date, and the buyer exercises their contract, I will buy 100 shares at $5 a piece\n\n\nnow.. if the buyer exercises their contract, the buyer of the put makes money by buying the shares at market value and selling them to you for $5 a piece. that’s how they make profit", "score": 1, "replies": [{"body": "Love of god there it is thank you for taking the time to write that up. \n\nI’m certain that’s been explained a plethora of ways already in these comments but that’s the one that connects the most dots for me sense wise. \n\nChrist thank you, feels like I gotta be a damn Gordon Gekko to even post here let alone ask a question lmao.", "score": 2, "replies": [{"body": "by the way.. a bull put is a spread. don’t even worry about spreads until you understand buying and selling options first. spreads are multiple contracts in 1", "score": 1, "replies": []}]}, {"body": "reddit is full of gambling mentality. a lot of us don’t exercise contracts, we normally BUY calls or puts, and continuously trade (sell) the contracts as the premium goes up, which is determined by “the greeks” but the “point” of selling puts is to collect premium and be willing to buy 100 shares at the strike price.\n\nor, gamble and hope to god the price doesn’t drop to the strike price and force me to buy the shares, cuz i never wanted to to begin with, i just wanted the premium", "score": 1, "replies": []}]}]}, {"body": "therefore the risk/reward is high unless you want to buy the shares", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Sorry but I’m starting from scratch here cause the comments below are comical (but helpful if  followed and understood). So I think it’s better to start from the top:\n\n“Sell the March $355/$350 bull put SPREAD for around 55 cents”\n\nI think you were missing the key word SPREAD from the above as you have given two strike prices $355 and $350. That’s a slightly different thing from a simple PUT option, which you should understand first.\n\nIf you SELL a put option at $350 with a price of 0.55 you receive a credit of $55 (0.55 x 100 shares) into your account. You do not pay anything to enter this transaction (ignoring the minimal broker fee). What are you doing though is taking on the risk that the stock value may fall below your strike price of $350. For every $1 below it falls you will be on the hook for $100 ($1 x 100 shares) at expiration if exercised, if it remains below. So if the share price falls to $345 at expiration it will be exercised and you will lose $445 ($5 x 100 shares - $50 initial credit).\n\nIf it stays above $350 at expiration then it won’t be exercised as there is no point and you keep the $55 full stop.\n\nIf you option is exercised at any point you will need to buy the 100 shares for $350 ($3500) which happens automatically in your account if you have the money. If not then your broker will most likely close the transaction out buying the shares for you and simply subtracting the loss for your account. They’ll also probably charge you a small fee for their trouble. That’s also why your accounts buying power is reduced when you open a trade, to cover small losses.\n\nWhy would you open this sort of trade..... well actually you can make some good money selling the premiums on stocks that you expect to continue rising. Also if you are going to buy a stock anyway why not sell a put first and take in the credit, you can keep doing this until eventually you are exercised and need to buy the shares. At which point you may have got them a little cheaper than you initially would have as you have been profiting from previous PUT credits.\n\nMake sense? Probably not I’ve probably just been as bad at trying to explain it all.\n\nAny questions just ask.", "score": 1, "replies": [{"body": "It’s fine, they are but kinda feels like you gotta be a “Gordon Gekko” to ask a question let alone post here for clarity on things I’m trying to learn from other sources lmao. \n\nThe article Im referring to states “The Trade: Sell the March $355/$350 bull put for around 55 cents.”\n\nI’ll link it if need be but it’s a Google amp link from nasdaq.com. \n\nNonetheless adding spread makes more sense as I’ve read a little on call debt spread and put credit spread a bit thinking maybe I could get better clarification from those. The two prices I thought were just a either, or, in between range. \n\nThat really does make better sense compared to some of the breakdowns I’ve found with different examples pieced together. \n\nThank you for your insight, I am curious if I was wanting to get a feel for the options stuff on a small scale how would you recommend an indoctrination into that, simulation paper trading apps, dipping toes in with a low allotted amount of “don’t care money” on low priced consistent stocks? \n\nShits all sink or swim I get it, but I’d rather jump into the pool at 5ft deep vs the other side at 40ft deep. Especially when I’m well aware im gonna be learning more than I’ll be earning.", "score": 1, "replies": [{"body": "First off....don’t dip any toes with options until you know what you’re doing. It’s easy to lose a lot of money accidentally. Once you are comfortable though then just make sure you stick to limited risk trades first before you progress to anything else.\n\nThe trade you’ve described looks like a bull put credit spread which is a limited risk trade. So essentially what you are doing is.....\n\nSELLING the PUT option at $355\n\nAnd \n\nBUYING the PUT option at $350\n\nThe 0.55 ($55) credit they refer to Will be the difference in these two trades e.g. maybe a $300 credit for Selling the 355 put and a $245 debit for buying the 350 PUT which would leave a $55 credit difference.\n\nThe benefit to such a trade means that the max you can lose is the difference between the two strike prices minus the $55 credit you received so a max loss of $445. You can find better ratios than this but it’s just an example. You risk potentially $445 to make $55, but depending where the strikes are in relation to the current stock price there might be a high prob of success.\n\nMake more sense?", "score": 1, "replies": [{"body": "Yeah that kind of acts like a safety net to protect from a more substantial loss so to speak? \n\nI feel like although I have so much to learn, I won’t really grasp the whole concept until I was to see how it played out or worked via “dipping toes”. Although I completely agree with you and don’t plan on doing such just because of the accidental risk until I’m way more confident in my abilities to be effect with it.", "score": 1, "replies": []}]}]}, {"body": "> I think you were missing the key word SPREAD from the above\n\nOP's quote is accurate, the article's just kinda meh. This is definitely what it means though", "score": 1, "replies": []}, {"body": "“For every $1 below it falls you will be on the hook for $100 ($1 x 100 shares)”\n\nfalse ^ this is where the buyer of the put makes more money as it continuously moves farther in the money (farther below the x price)\n\nselling puts has a maximum “loss” = your strike price x100-premium collected. selling naked calls and shorting stocks has a theoretical infinite loss potential", "score": 1, "replies": [{"body": "Whats false about that statement? Its correct and you proceed to confirm it.", "score": 0, "replies": [{"body": "reread your post and then reread mine? you’re making it sound like the farther in the money the put is the more the seller has to pay... which is false...", "score": 1, "replies": [{"body": "My comment still stands. You’re referring to BUYING the PUT my statement referred clearly to SELLING the PUT as an example. If you sell it and the price falls below then you’re on the hook.\n\nAnyway thanks for the feedback", "score": 0, "replies": [{"body": "i’m correcting you, what you mentioned doesn’t make sense..\n\nyour statement stands that when selling a put, for every $1 below the strike price the seller owes 100? because that’s what your wrote, and it’s wrong", "score": 1, "replies": [{"body": "Thats right. An option contract is for 100 shares, therefore every $1 drop in price is multiplied by 100 which equals $100.", "score": 1, "replies": [{"body": "maximum loss is the strike price x 100-premium. not $100 for every dollar it goes below the strike.", "score": 1, "replies": [{"body": "At no point to i refer to what maximum loss is?!? And regardless what you have compared in your last comment is exactly the same thing except you haven’t subtracted the premium in my side of it. Something which i actually do further into my initial comment.\n\nYou seem to be arguing a point just for the sake of it here?", "score": 1, "replies": [{"body": "you literally said- for every $1 the stock moves below the strike, the seller is on the hook for $100 dollars........", "score": 1, "replies": [{"body": "Which is correct.", "score": 1, "replies": [{"body": "read a book", "score": 1, "replies": [{"body": "Why is that not correct?\n\nAn option contract is for 100 shares. Therefore for every $1 below your strike you are at a loss of $100 ($1 x 100 shares).\n\nYour comment regards Maximum loss is also correct to calculate that you would therefore multiply the strike by 100 shares and subtract the premium.\n\nThis is exactly the same as you would do to calculated your loss at any price below the initial strike.\n\nI’ll pass on reading the book but you feel free. I can’t even say lets agree to disagree here as your not even really disagreeing with me.", "score": 1, "replies": [{"body": "define loss", "score": 1, "replies": []}, {"body": "you know all a put seller is obligated to do is buy 100 shares at the strike price, right?", "score": 1, "replies": [{"body": "Yes and if you are in ITM your contract will be exercised and you will be sitting on a current loss which can be calculated as we have covered multiple times above.\n\nOr are you going to go down the road of saying oh well thats not actually a loss unless you decide to sell those shares at that price. Which is just semantics and pointless.\n\nThe whole purpose of the answer was to try and keep things simple. You’re just trying to confuse things now from what i can gather as to what your opinion of a loss is. A loss on paper is easier to handle for someone who is more experienced but not a beginner.\n\nGiven that we are also referring to circa $350 share in the example as well i doubt the OP would be up for holding $35k in shares at this point.\n\nAgain feel free to keep going round in this ridiculous circle.", "score": 1, "replies": [{"body": "selling a put you should be willing to buy the stock at the x price, so i don’t see that being a loss. and you’re not down $100 for every dollar it drops below the strike. you’re “down” what you were obligated to purchase at the x", "score": 1, "replies": [{"body": "X price is the strike price\n\nAnd no you shouldn’t necessarily be willing to buy the stock, thats your opinion. Thats why you may not see it as a loss.\n\nYou should be prepared to have to buy the stock thats all. Many people trade options with no intent to end up with the stock in their account, its just something you need to prepare for as an eventuality.", "score": 1, "replies": [{"body": "good day sir", "score": 1, "replies": [{"body": "Good day", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I am a noob, this is not financial advice. \n\nThis is my understanding, you sell puts because you think the stock is going UP, meaning you are bullish. It's like selling car insurance to someone, you don't want them to wreck and have to pay them for their useless car. Or stock. \n\nThe advice is usually to not sell a put unless you wouldn't MIND owning the stock at that price. The risk being you sell a $355 put, stock drops to $355 and you buy it from that person. But what if the stock keeps dropping, it might be down to $300 by the expiration, and you still have to fork over $355 a share, ouch.\n\nEnter the bull put SPREAD. You SELL a $355 put, get paid $40. BUY a $350 put, spend $25. Now if the stock does go to $300, you buy someone's shares for $355 each, and you also have the right to sell them at $350. You just lost $500, but you didn't lose $5500, the put that you bought protected you from this happening. Best case scenario the stock stays above $355, the put you sold expires worthless as does the one you bought. $15 profit. ($40 credit-$25 debit). You will have to put up $500 collateral to enter this trade, $355-$350=$5x100 shares=$500.\n\n$500 risk to make $15.\n\nWithout the spread your downside is the stock going to $0. Paying $355 a share that is now worth $0. And if you don't do the spread you now have to use $35500 collateral.\n\n$35500 risk to make $40.\n\nI based all my numbers on the March 03 put, this is after hours so they aren't accurate.\n\nIf you wonder why someone sells a put without the downside protection of doing the spread, it's because they don't mind owning the stock. Alot of people will then use \"The Wheel Strategy\", where they take the shares they just bought, let's say at $355. And sell a covered call for maybe $360. They collect some premium, lowering their cost per share, and if it hits $360 they get to sell their shares to someone, if it doesn't they just sell another call. The farther away from $355 it gets, the less premium you receive and harder it is to \"wheel\" your way out of a bad situation. That's when some people just sell and take the loss.\n\nI have only been trading since January 2021, so I literally have no idea how accurate my post is, it's just what I've read.", "score": 1, "replies": [{"body": "It falls in line with what I’ve read for the most part, the wheel strategy is new to me though so thank you for that knowledge! \n\nI’m seeing the consensus with the sell a put for stocks you wouldn’t mind owning, you just would rather have it a price to your liking, which in my mind is prettt clever because either way you get paid or you get to have a stock you want at a discounted rate so to speak rather than timing it?", "score": 1, "replies": []}]}, {"body": "Whoever buys the option has the rights, and pays the premium. \n\nWhoever sells the option has the obligation, and collects the premium. \n\nIf you sell a Put, you receive the premium and have the obligation to purchase 100 shares per put at the strike price. If the underlying stock's price is above the strike price the option expires worthless and you do not have to purchase the shares. \n\nWhether or not the option is exercised or expires worthless, you keep the premium.", "score": 1, "replies": []}]}
