{"title": "ATVI down 1.5%...", "selftext": "I'm praying for a recovery", "id": "4wah0a", "created_utc": 1470404952.0, "score": 38, "upvote_ratio": 0.87, "num_comments": 65, "comments": [{"body": "Eh, just people taking their dime gainz and going to the value menu.", "score": 20, "replies": [{"body": "I've seen at least 4 people on WSB today saying they sold at open, I bet that sentiment is widespread on this one; people licking their chops for some profit.", "score": 1, "replies": []}]}, {"body": "Lol, I sold right at market opening. ", "score": 27, "replies": [{"body": "Should've sold at open, at least I got out with just enough gains for some tendies ", "score": 9, "replies": [{"body": "https://www.youtube.com/watch?v=vXPg4isOUws", "score": 4, "replies": [{"body": ">[**bop to da top [0:10]**](http://youtu.be/vXPg4isOUws)\n\n>>gangstarrr\n\n> [*^NifflerKing*](https://www.youtube.com/channel/UCvaPjI8UP_qFAHh-o5Ie25g) ^in ^Film ^& ^Animation\n\n>*^51 ^views ^since ^Jul ^2016*\n\n[^bot ^info](http://www.reddit.com/r/youtubefactsbot/wiki/index)", "score": 2, "replies": []}]}]}, {"body": "Same. put a stop loss in slightly lower then when it opened and got out happy lol", "score": 3, "replies": []}, {"body": "Same.  Profit baby.   Sold at 41.69", "score": 2, "replies": []}, {"body": "I love it. Sold my one share at 42.25 lol", "score": 4, "replies": [{"body": "yeeee ballin'", "score": 3, "replies": []}]}, {"body": "You're the guy! ", "score": 1, "replies": []}]}, {"body": "This and facebook will be the death of me", "score": 7, "replies": [{"body": "Tell me about it. ", "score": 3, "replies": []}]}, {"body": "Got $41.50 calls. Crying rn", "score": 4, "replies": [{"body": "I had $41.00 ", "score": 1, "replies": []}]}, {"body": "If everyone has a job, no time for video games. ", "score": 11, "replies": [{"body": "assuming people don't play games at work", "score": 2, "replies": [{"body": "Don't have time for games at work, on Reddit.", "score": 2, "replies": [{"body": "Reddit isn't a game?", "score": 4, "replies": [{"body": "If it is my score sucks.", "score": 2, "replies": []}]}]}]}, {"body": "People buy games but don't play them for more than 10 minutes.", "score": 1, "replies": []}]}, {"body": "http://imgur.com/8m7ClGO\n\nOk so I guess Wall Street *did* know about Overwatch. ", "score": 3, "replies": []}, {"body": "WTF? I'm gonna hold, there's no way ATVI is going down next week.", "score": 6, "replies": [{"body": "paypal", "score": 7, "replies": [{"body": "Ah yes, the other thing I'm bagholding this week.", "score": 7, "replies": []}, {"body": "PayPal gapped down and just stayed there. Not the same thing (I hope).", "score": 1, "replies": []}]}, {"body": "Hoping for a correction next week; same thing happened to $RGR.", "score": 5, "replies": []}, {"body": "Yup. Price targets have been hiked.", "score": 1, "replies": []}]}, {"body": "I bought more.  Got faked out of EA by a flash selloff and got cheated out of thousands - not going to let it happen to me again.\n\nNOT TODAY!", "score": 8, "replies": [{"body": "I also bought more! Might be squirming over the weekend but I expect it to jump early next week. Would be nice to see some gain before close today...", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Gonna go work out for an hour and hope that you are right.\nedit: You weren't right....yet.", "score": 5, "replies": []}]}, {"body": "EA to the moon", "score": 3, "replies": []}, {"body": "almost feel bad for people with just calls.  rip IV crush.  Closed my spread for 2.45, bought it for 1.55\n\nhttp://imgur.com/a/j2bJs", "score": 5, "replies": []}, {"body": "Massive amount of profit taking faggots. It will tick back up over the next few days. ", "score": 5, "replies": []}, {"body": "Gonnnnnaaaa wait, gonna wait, gonnnnna wait.\n\n(Trying to just ignore market open)", "score": 4, "replies": [{"body": "trying my best to do the same", "score": 1, "replies": []}, {"body": "If it has a run at the end of the day we're gonna be fine.", "score": -1, "replies": [{"body": "I bought even more to average down because, hey, fuck it.", "score": 0, "replies": []}]}]}, {"body": "got in ah 41.20 sold at open 41.56. i refuse to hold another bag. maybe it'll rebound later.", "score": 2, "replies": []}, {"body": "Saw it at 42.6 and was sure it was going to the moon and didnt sale. Same thing happened with TTWO last earnings glad i didnt panic sale that so ill hold. Godspeed.", "score": 2, "replies": []}, {"body": "$55 price target initiated by Jefferies. Would be adding to it if wasnt a pleb. (This is why i buy options with at least 30 day expiry).", "score": 2, "replies": []}, {"body": "well, so far I'm down 8 k. Anyone know where you can get discount hookers and blow? I prefer hookers with aids and blow cut with draino so I can off myself.", "score": 2, "replies": []}, {"body": "I sold my calls the day before for 30% profit.  I felt like I was leaving money on the table but thank god.  The IV crush is real and 2spooky", "score": 2, "replies": []}, {"body": "So I actually did the 1500 shares like the other guy (Retarded). I managed to jump ship right at open. Never doing that again. \n\nhttp://imgur.com/j3C4NCU", "score": 2, "replies": []}, {"body": "You don't hold quarter reports.  You take it and fucking run.  The market over compensates every time", "score": 2, "replies": []}, {"body": "Been able to average down my calls quite nicely. Will climb back.... plz climb back...", "score": 3, "replies": []}, {"body": "My first invest ever went like this; bought 121 shares @40.27 late last week, sold all @42,25 at opening today. ", "score": 3, "replies": []}, {"body": "#profitaking", "score": 2, "replies": []}, {"body": "Oh nooo 1.5%!?!", "score": 2, "replies": []}, {"body": "Sold half of my shares, 500, at 42.05 before market open. Sold the rest, another 500, at 40.80 which was my entry price yesterday. A little frustrated I didnt sell it all at 42.05 but I had some covered calls. sigh. ", "score": 1, "replies": []}, {"body": "Sold my 4 calls and 100 shares at open. :)", "score": 1, "replies": []}, {"body": "Lets see if my reverse WSB strike pays off", "score": 1, "replies": []}, {"body": "I sold 2 iron condors and 2 put spreads. Nice IV crush on open plus we didn't get any huge movements. Closed out the shorts and even was able to sell some of the longs for $0.02\n\n[http://i.imgur.com/WSDaafX.png](http://i.imgur.com/WSDaafX.png)", "score": 1, "replies": []}, {"body": "Sold at market open at 41.69 a share.  Finally made the right move before I got fucked for once. ", "score": 1, "replies": []}, {"body": "Volatility crush killed me, I was up just barely on open figure I'd wait it out a few minutes being how much in the money my calls were and then the stock dropped, got out down about 20%. Oh well.. ", "score": 1, "replies": []}, {"body": "This is why you don't be weeklies, unless you're using it to hedge. ", "score": 1, "replies": []}, {"body": "Already over 3 million in volume after just 30 minutes of open, the fear is real. Watch it bounce back shortly (I hope)", "score": 1, "replies": []}, {"body": "You act like the fucking stock dropped 15%.\n\nIt's down less than a percent from yesterday's opening. You're acting like you're losing huge gains....\n\nThat's what you get for trading a stock with low volume though.", "score": 1, "replies": []}, {"body": "I have doubts Overwatch will last. Very heavy doubts.\n\nIt'll stick, but the scene won't be ginormous. Its own appeal will be its downfall -- casual gaming. Easy come, easy go.", "score": 0, "replies": [{"body": "Blizzard is invested in all their games. They still come out with updates to D3 even though that user base has decreased enormously since launch.\n\nBlizzard CEO made it abundantly clear to his employees that all games from now on are treated as a lifetime service. Their games aren't going anywhere and neither is the company.\n\nAs long as Mike Morhaime is still at the top, and the OGs are still at Blizzard, then I have all the confidence in the world in them.\n\nP.S. I have no positions in ATVI", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Earnings was AMC yesterday you dumb fuck", "score": 4, "replies": []}]}, {"body": "Always sell at open", "score": -1, "replies": []}, {"body": "Unless they come out with WOW for mobile, etc they are screwed..", "score": -4, "replies": [{"body": "I think your autism is even too much for wsb....", "score": 2, "replies": []}, {"body": "No.", "score": 1, "replies": []}]}]}
