{"title": "What are nVidia's current risks?", "selftext": "I recently opened a position in Nvidia. Everything looks like it's on the up and up for this company. Gamers still want their graphics cards, Crypto miners are still using their GPUs for mining (I know Ethereum switched to PoS, but it looks like it's still the preferred card for Bitcoin mining), and it apparently is positioning itself to be THE GPU provider for AI (as highly experimental AI computing is, nVidia is making a huge case to be the pioneer in this sector).\n\nThat's 3 major sections of performance computing nVidia appears to have a very strong grasp on. Coupled with strong financials to back up it's share price.\n\nI'm struggling to find the risk in this stock price. My first thought was if China invades Taiwan as nVidia has a close relationship with TSMC for it's fabrication plants, but I can't see a mainland China invasion prior to the U.S. elections this November.\n\nIs this stock as rosey-colored as I'm making it out to be? Or is there a glaring risk aspect I'm missing? ", "id": "1ddomac", "created_utc": 1718138625.0, "score": 16, "upvote_ratio": 0.67, "num_comments": 70, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 13 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "LLM hype dies down. Their biggest customers stop upgrading GPU clusters every year or in the same quantity. These are the cloud data center providers Amazon AWS, Google GCP, Microsoft Azure. New techniques for efficiently training large models and inferencing eliminates the need for bigger and better GPUs. You could see a transition from massive do everything foundation models to smaller expert models. Etc.\n\nTheir biggest customers are also the ones looking to build their own AI accelerators to replace some of their Nvidia spend so you could see revenue growth decline or go negative and or profit margin decline. Amazon has their Tranium and Inferentia chips. Google has their TPU. Microsoft has their Maia chips. Tesla has Dojo D1. Meta has MTIA. Apple has their own on device chips. And then you've got AMD with a competitive data center lineup the next few years that could eat into profitability. Nvidia is making too much money and their profit margins have ballooned. This invites competition and their biggest customers also want to be their competitors. Big tech is dumping massive sums of money into replacing Nvidia dependence and they are all using the same people to make their chips (TSMC, Broadcom, etc).", "score": 64, "replies": [{"body": "This.\n\nI caught a Microsoft Mechanics video on YouTube the other day that delved in MS' approach to AI/Language models.\n\nIn MS' AI datacentre, they're running nvidia, AMD and Maia chips. And Microsoft has been working hard on an interoperability layer that removes the need to program for specific hardware. So with my puny account, I'm going to start slanting it towards AMD (I already have enough Microsoft).\n\nAMD 'only' has a market cap of $260 billion vs Nvidia's $2.996 trillion. As AI tech evolves to become less hardware dependent, companies like AMD will readily step in to fill the supply void. I suspect that nvidia's moat isn't as big as many people assume. In fact, being a first mover isn't always beneficial as competitors can watch, and potentially capitalise on costly mistakes made by the incumbent.", "score": 16, "replies": [{"body": "I think it’s a pretty large moat. It’s been a large lot between the two prior to anyone talking about AI.", "score": 5, "replies": [{"body": "Agree. Amazing management and R&D, as well.", "score": 3, "replies": []}]}]}]}, {"body": "In no particular order:\n(1) China invades Taiwan.\n(2) We enter a post-GPU world.  GPUs replaced CPUs.  Another architecture could replace GPUs.\n(3) Recession.  Companies could invest less in AI during an economic downturn.\n(4) Nvidia advances plateau for some time.\n(5) AI advances plateau for some time.\n(6) ASICs, such as TPUs, replace GPUs in more instances than expected.", "score": 16, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That’s a great point.  Who do you believe will be it?  I have a few guesses.", "score": 1, "replies": []}]}]}, {"body": "I know most of you regards can't read, but NVDA lays out their risks clearly and thoroughly in their quarterly reports. They discuss the risks in lots of detail because if they dont, and later on the stock tanks, they can be sued for securities fraud.\n\nI'll let you google the report but here's a summary:\n\nTop 10 risks:\n\n1. Supply chain disruptions and lead times: NVIDIA relies on third-party manufacturers and suppliers, which can lead to supply chain disruptions and delays.\n\n2. Demand uncertainty: The company's demand for its products is uncertain and can be affected by various factors, including changes in the gaming and data center markets.\n\n3. Competition: NVIDIA faces intense competition in the semiconductor industry, which can lead to reduced market share and revenue.\n\n4. Geopolitical risks: The company operates in a global market and is subject to geopolitical risks, including trade tensions, export controls, and tariffs.\n\n5. Regulatory risks: NVIDIA is subject to various regulations, including export controls, and changes in regulations can impact its business.\n\n6. Cybersecurity risks: The company's products and services are vulnerable to cybersecurity risks, which can lead to data breaches and other security incidents.\n\n7. Dependence on suppliers: NVIDIA relies on suppliers for components and parts, which can lead to supply chain disruptions and delays.\n\n8. Economic downturn: The company's business is sensitive to economic downturns, which can lead to reduced demand for its products and services.\n\n9. Currency fluctuations: NVIDIA's international sales are subject to currency fluctuations, which can impact its revenue and profitability.\n\n10. Dependence on key personnel: The company's success depends on the skills and expertise of its employees, and the loss of key personnel can impact its business.", "score": 23, "replies": [{"body": "What is the difference between 1 and 7?", "score": 3, "replies": [{"body": "6", "score": 6, "replies": [{"body": "Best reply ever! -6", "score": 3, "replies": []}]}]}]}, {"body": "The risk is one or two whales cash out, the stock starts to dive on volume and the computers turn (or are programed to) bearish.  The rate of ascent will come to a point of exhaustion eventually.", "score": 6, "replies": [{"body": "For all intents and purposes that basically happened yesterday, regardless of how shorted it is it still ended up being brought back up, even with the lessened volume. Whales cash out and everyone else dives in as it goes on sale for an hour.", "score": 2, "replies": [{"body": "I'm capitulation on my Tech and Nvidia shorts. \n\nI lost some money and want to keep it that way.  Instead of growing my losses.  \n\nI tried and failed.  I'm admitting I was wrong.    I'm not getting long either just going to sit back and watch.  \n\nThe $80 put expiring January 2025 could sell for $1 if she has another rip roaring week higher which I expect.   Might take that last parting shot and then call it a wrap.  \n\nYou?", "score": 2, "replies": []}]}]}, {"body": "Risks:  \n(1) China doesn't buy any  \n(2) Turns out, we don't need bigger and bigger server farms to build smaller and smaller models that are just as performant for MOST of the needs. There is still a need to pursue mind boggling large clusters to do training, but maybe we don't need those more than the number of large multi-national entities on Earth.  \n(3) The value of compute plummets and starts to hit against the opportunity value for the same joule of energy used to do something else. Do you, compute another gigabyte of tentacle porn? Or do you heat dinner with it?  \n(4) Nvidia is a tech company, that means that its dominance resides with its experts. If enough of those experts get paid well enough, they retire. If less wealthy experts think that they can leave and join some other company or start their own thing, the tech bleeds and the company's unique advantages implode. Just like how TSMC can switch their production run between Samsung chips and Apple M# chips, modern companies are basically just drawing chip designs on paint, and another smaller outfit of ex-NVIDIA experts can also do the same thing.  \n(5) Nvidia could accidentally be optimizing towards the wrong end goal. As a taste of that from yesterday, what if they've been building towards bigger and better server-class AI clusters, and suddenly the world realize that maybe what it needs is endpoint compute nodes like personal devices?", "score": 13, "replies": [{"body": "How can China buy them when the US government doesn’t allow Nvidia to sell them to China and just restricted Nvidia from selling to the Middle East in fear that it would be an avenue for China to get their hands on them.\n\nSo….China is not buying them and isn’t going to be.", "score": 0, "replies": [{"body": "Oh you poor misguided soul. You think that Huang advertising in UAE and Asia about sovereign AI is going to be impeded by export restrictions? Of course, Nvidia wouldn't do anything illegal. But chips will still get there.\n\nNvidia only advertised to people that they think will become customers.", "score": 4, "replies": [{"body": "I’m a misguided soul because you think the number 1 risk to Nvidia stock is not selling to China when they already legally can’t? You think the current price of the stock is based on future sales to China? \n\nNo one said chips won’t make it there but it’s not going to be enough to where it’s going to be baked into Nvidias stock price. Even if they were illegally selling to China it’s not going to be baked into their earnings report lmao?", "score": 4, "replies": [{"body": "So, the way a server would come online to do the compute that is illegal to export would be through a domestic subsidiary or an allied subsidiary. Either a 3rd party will be erected that will buy and build the cloud facility in Europe or in the US, or the subsidiary will figure out a way to sell the chips into the dark market, with no end buyer specified.\n\nThis happened similarly during the crypto boom. \n\nWhen I mean China not buying, I also mean that China might roll their own chips, and/or stop buying the nerfed down chips. So Nvidia is not just exposed on the latest products but also existing product lines also.\n\nI would like to point out the many China based self driving companies that operate right here in the US where their daily work volume is basically a conference with teams in China where the work here is presented and their teams there get to do Q&A.", "score": 1, "replies": []}]}]}]}]}, {"body": "AI is the future, but the future is a lot more distant than the hype is telling you. \n\n\nCompanies will try to implement things that aren't close to ready because a CTO reads a hype blog, it won't work very well, and after enough disaster stories everyone will cool off for a while. This will reduce but not eliminate demand, but then the other side is all the biggest consumers of their hardware pushing hard for in-house chips.\n\n\nYou shouldn't get out, it'll be the hype stock for a while, but it won't last forever. Most of the people talking about AI don't know their ass from their elbow.", "score": 10, "replies": []}, {"body": "It's priced for 20+ percent revenue growth for the next 2 decades. If anything remotely deviates from those sky high expectations, or macro environment changes for the worse the downside is huge.", "score": 4, "replies": [{"body": "Do you think it would be dumb to throw 1k into nvidia right now?", "score": 1, "replies": []}]}, {"body": "*A single Blackwell chip will draw 1,875 watts of power. That’s nearly twice what the current Hopper chips consume.*\n\n\n\n\n*That means 1 million Blackwell chips, which Nvidia plans to produce, will be drawing twice the power of a nuclear power plant.*\n\n\n\n\nhttps://investorplace.com/2024/06/nvidias-rise-may-be-its-downfall-the-contrarian-case-for-selling-nvda-now/", "score": 7, "replies": [{"body": "I may have a nice position in a junior copper explorer... I just want someone to realise that we're going to need a butt load (not an official SI unit) of extra energy to charge EV's, have LLMs write our excel formulas for us etc etc...", "score": 4, "replies": [{"body": "No, not \"SI\", however, \"ButtLoad\" is well defined: \n\n[https://commonplacefacts.com/2020/02/05/a-buttload-is-an-actual-unit-of-measurement/](https://commonplacefacts.com/2020/02/05/a-buttload-is-an-actual-unit-of-measurement/)\n\nI believe we could convert it Kilos of Uranium if you wish (an american EE, yes, we take class on conversions \\[well, at my school\\], when your official unit of Mass is a \"slug\", you learn conversions.)", "score": 4, "replies": []}]}, {"body": "AMD meanwhile very wisely focused on power efficiency", "score": 2, "replies": []}, {"body": "Who cares?", "score": 2, "replies": []}]}, {"body": "For now, the only risk I see is:  Govt.  In the last 20+ years I’ve been in the business.  They’ve come after all lot of big tech stocks near their highs on anti-trust.  I would definitely not sell b/c of this, but once news hit you’ll have to trim the position regardless of where the stock is trading as the stock will prob be dead money for awhile.", "score": 3, "replies": []}, {"body": "Jensen loses his leather jacket", "score": 3, "replies": []}, {"body": "The news that Apple is running their LLMs on server on Apple Silicon is a big one. If Apple can eliminate the need for NVDA chips other players can too. At current NVDA margins putting stacks of actual laptops in the data center might make financial sense!", "score": 6, "replies": [{"body": "If AAPL silicon was good at linear algebra they would package and sell it to everybody else", "score": 4, "replies": []}]}, {"body": ">but it looks like it's still the preferred card for Bitcoin mining\n\nPeople haven't used a GPU to mine bitcoin for the better part of a decade. ASICs are used for that. GPUs are gonna be used for other altcoins.", "score": 2, "replies": []}, {"body": "> but it looks like it's still the preferred card for Bitcoin mining\n\nWTAF? Maybe in 2012.", "score": 2, "replies": []}, {"body": "It's overvalued and the current pace of sales (which is driving the current price) is not sustainable for much longer. This is a boom/bust cycle (despite everyone pretending it's not). May take a year to play out but eventually this stuffed pig is coming back down to reality. When? I have no idea.", "score": 7, "replies": [{"body": "Except they aren’t just making profit from GPU sales. They also are selling software subscriptions and licensing which will I’m sure dramatically increase as more and more of their products become the backbone of everything.\n\nI do agree that eventually the demand for their GPUs is going to die down as the infrastructure gets built but they are much more than just a GPU company.", "score": 2, "replies": []}]}, {"body": "It’s overvalued is the most succinct risk", "score": 3, "replies": []}, {"body": "The hell are you talking about Bitcoin mining, Bitcoin is not mined using GPU, it's CPU based or using ASIC not GPU's", "score": 3, "replies": [{"body": "That's what I thought too.", "score": 2, "replies": []}, {"body": "GPU BTC mining was a thing back in 2012. It has been ASICs since about 2014. CPU mining? Maybe 2010.", "score": 2, "replies": []}, {"body": "It was cpu based. Can be done with gpu now", "score": 1, "replies": [{"body": "This is not true, mining Bitcoin with a GPU is very inefficient, it's way cheaper to just buy an ASIC miner than spend money on 100 GPU's that will probably mine less that the cheap ASIC, no one is using GPU's to mine anything, is just not profitable anymore, the small coins that are left to mine with GPU are not worth it", "score": 4, "replies": [{"body": "Oh alright cool", "score": 1, "replies": []}]}]}]}, {"body": "NVDA is priced beyond perfection. It will never grow to justify it's current valuation. Never. Mark my words it's the new Cisco. Y'all are fucking dumb when it comes to pricing securities. If you bought it now, you are a gem among regards... and I don't mean that as a compliment.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I love your handle", "score": 1, "replies": []}]}, {"body": "Agreed it's the new Cisco. In the short term though, one could make money easy.", "score": 1, "replies": []}]}, {"body": "Not enough blow hookers and yatchs for execs", "score": 1, "replies": []}, {"body": "Honestly if China invade Taiwan it would be a great opportunity to add after the carnage. That’s the biggest risk I think", "score": 1, "replies": []}, {"body": "Paper hand risk", "score": 1, "replies": []}, {"body": "Apparently Apple partnering with OpenAI.", "score": 1, "replies": []}, {"body": "No one has mined Bitcoin with GPUS in like 8 years. 😂😂 you have no idea what you’re talking about", "score": 1, "replies": []}, {"body": "AGI & the Singularity", "score": 1, "replies": []}, {"body": "Nvidia is good company but its extremely overvalued. Currently priced in next 5 years (with expectation of huge growth rate). As only one in town they sell GPUs with huge profit margins. I dont think other companies sit and watch for 5 years. Google, Apple, Microsoft, Meta, Intel, AMD all designing their own AI chips. Maybe they are not competitive enough for  training big models now but they will catch up.", "score": 1, "replies": [{"body": "How is it priced in if the P/E is sitting at like 64-70 depending on the day? How do you price in sales 5 years in the future in an emerging technology? It’s P/E is actually lower right now than its median and average P/E has been in the last 5 years.", "score": 1, "replies": []}]}, {"body": "Very few at the moment.  Let's talk in 1 year.  And, I'm thinking a bottom line of 20% growth Q over Q for those 12 months.  They have sales comments that far out.  And, the use case is REALLY good for 12 months.  Now, does how does that translate into Stock Market Valuation?  Like, if I knew stuff like that you think I'd have time to even dictate this stuff to my totally hot assistant?", "score": 1, "replies": []}, {"body": "Competition. It’s coming.", "score": 1, "replies": [{"body": "Lmao do you know how much infra it takes to build 3nm chips?", "score": 1, "replies": []}]}, {"body": "One miss and the party’s over.", "score": 1, "replies": []}, {"body": "How large are those each of these lines of business and what may affect them? I don't see PC gamers really driving growth. And while Nvidia has great demand now for GPUs, big companies are working on inhouse solutions and finding competitors because the demand makes GPU prices too high for most companies to invest in them. So I i would look at how long that road is to competition coming online and what are they doing in R&D to stay ahead of the pack.", "score": 1, "replies": []}, {"body": "You really think PC gamers are part of the reason why Nvidia is the 1st or 2nd most valuable company in the world? \n\nLol... That's funny... Are you 16?  And this is coming from a guy who has a 4070 Super and is about to play some cs2 \n\nAnyways, there's only 1 reason they're worth as much as they are, and it's AI.", "score": 1, "replies": []}, {"body": "There is no risk. NVIDIA has become a cult stock at this point. Even if they missed earnings, there are countless investors & analysts ready to pump the stock up again for the following quarter.", "score": -5, "replies": [{"body": ">There is no risk \n\nIf this were true, I wouldn't be asking the question", "score": 4, "replies": []}]}, {"body": "As far back as 20 yrs ago, quartz crystals (and a few others) were being researched for use in data storage applications. Managing to get petabytes in crystals roughly thumb-sized, the lattice structure of the crystals being near perfect for the intended purpose. Of course, applying the energy to the crystals caused them to slightly swell, they would subsequently return to normal size when not in use with no ill-effects. \n\nNo idea where this research is at or has progressed to since first happening upon it way back when, but it would definitely have a huge bearing on AI's data generation & storage requirements if they got anywhere with it.", "score": -1, "replies": [{"body": "This guy’s literally trying to talk about crystals 🤣", "score": 0, "replies": [{"body": "Yeahhhhh, but not in the way you seem to want to suggest there, Sparky. Nice try, though! No anime, Thundercats or voodoo chicks involved with this...", "score": 1, "replies": []}]}]}, {"body": "[ Removed by Reddit ]", "score": -17, "replies": []}]}
