{"title": "[deleted by user]", "selftext": "[removed]", "id": "xbng65", "created_utc": 1662915069.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 167, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|5 minutes ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xbng65)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xbng65)", "score": 1, "replies": [{"body": "The best “proof” you’ll get: [proof?](https://imgur.com/a/UBvlSbB)", "score": -2, "replies": []}]}, {"body": "She should pay attention to her new heir, me. Hi ma.", "score": 103, "replies": [{"body": "No, me. I'm willing to scrape her bunions.", "score": 10, "replies": []}]}, {"body": "sounds like your aunt needs a new boyfriend...  \n\n\n14,286 shares @ IPO price ($21) = 4,114,368 shares after 9 splits since IPO  \n=$1,088,085,761.28 as of market close friday  \n\n\nyou're saying she doesn't know she's a billionaire? That smells like massive bullshit", "score": 466, "replies": [{"body": "She died recently at the age of 96...", "score": 131, "replies": [{"body": "still wifey material if you can get in on that will", "score": 59, "replies": []}, {"body": "Is she Queen Elizabeth?  She died recently at 96.", "score": 21, "replies": [{"body": "Whoosh", "score": 28, "replies": []}, {"body": "Rtard", "score": 13, "replies": []}, {"body": "Your input is highly regarded", "score": 3, "replies": []}]}, {"body": "You mean 69?", "score": 5, "replies": [{"body": "96 is how they use the double ended dildo", "score": 10, "replies": []}]}]}, {"body": "People are actually believing this trust me bro post?", "score": 68, "replies": [{"body": "not for a second. There isn't a billionaire on the planet that doesn't know they've got a billion dollars", "score": 28, "replies": [{"body": "Have you seen King Ralph?", "score": 9, "replies": []}, {"body": "Sorry bro, but there’s evidently at least one.", "score": -49, "replies": [{"body": "“Evidently” lmaoooo. You read that in a book one time and think u know what it means", "score": 13, "replies": []}]}]}]}, {"body": "4.1M shares currently paying $2.48 in dividends per year. So she's rocking an income of $10M+ per year with a tax bill of $2M this year. \n\nMicrosoft has paid a dividend since Q3 2013. She just didn't notice that her income jumped $2M in 2013? Or that her tax bill went up a few hundred thousand dollars?\n\nIf she did make that investment, she's damn well aware of it. She's probably doing the right thing and acting dumb because she knows her nephew hangs out in this sub.", "score": 65, "replies": [{"body": "Reinvest dividend dumbass", "score": 0, "replies": [{"body": "You still have to pay taxes on drip", "score": 8, "replies": [{"body": "If she funded a trust with the investment then the company managing the trust would pay the taxes. Technically it's possible she has no fucking idea what is happening.", "score": 2, "replies": []}]}]}]}, {"body": "For the record, there's like 50 women on the planet that would possible fit into the net worth of this being real, being of the age where they could make an investment in 1986....they'd have to have been 18 at minimum then which puts their age at 54+, more likely 70+ as most people don't have 300k to throw at an IPO at 25 or less.  \n\n\nSo that narrows it down to like 20 people....and I'm pretty sure all these people know they're billionaires.  \n\n\nhttps://www.forbes.com/real-time-billionaires/#67f0e9b83d78", "score": 34, "replies": [{"body": "why would they have to be 18 @ minimum?  my first stock transaction was @ age 8.", "score": 1, "replies": [{"body": "you know a lot of 8 year olds with $300k to invest in the market?  \n\n\nalso parental permission is a thing that's required under 18 in most countries.", "score": 9, "replies": []}]}, {"body": "Not that I’m buying this story, but that’s just the publicly known ones.  There are a lot of people who don’t show up on Forbes because they don’t own public companies and thus don’t have to file public disclosures.  \n\nEver wondered why you see buildings and streets with names you don’t recognize on them?  Often these people own private companies that don’t report to anyone but the irs, and if they are smart, they personally own nothing, it’s all company owned assets.", "score": 0, "replies": []}, {"body": "She’s a paper billionaire. I don’t know if the stock is in her name, her husbands, or a company they own.", "score": -46, "replies": [{"body": "she's also fictional", "score": 37, "replies": [{"body": "I mean it’s more likely that she’s lying to the kid or grossly exaggerating than that she herself if a fiction. If OP has never seen hard proof of the existence of those shares…. \n\nSource: I have family who are pathological liars.", "score": 3, "replies": []}]}]}]}, {"body": "Lmao “my aunt doesn’t know she’s actually one of the Richest people in the world”", "score": 3, "replies": []}, {"body": "It's something like[ $793 million](https://microsoft.gcs-web.com/investment-calculator?4b5195df-c641-42f0-a2e3-1d3e9e05ef02%5Bdate_month%5D=03&4b5195df-c641-42f0-a2e3-1d3e9e05ef02%5Bdate_day%5D=13&4b5195df-c641-42f0-a2e3-1d3e9e05ef02%5Bdate_year%5D=1986&4b5195df-c641-42f0-a2e3-1d3e9e05ef02%5Bnumber_invested%5D=300000&4b5195df-c641-42f0-a2e3-1d3e9e05ef02%5Binvestment_type%5D=dollars&url=) they would have now. And own like 3,000,000 shares after splits.", "score": 1, "replies": [{"body": "dividends", "score": 6, "replies": []}]}, {"body": "OP said his/her aunt has 300,000$ worth of Microsoft shares currently. Can’t you even read properly. She might have invested just 10k or whatever amount in 1986.", "score": -40, "replies": [{"body": "He said 300,000 only referring to it in terms of her purchase made in 1986. Perhaps you cannot read good sir.", "score": 36, "replies": [{"body": "You’re in wsb. Half of us are dyslexic.", "score": 4, "replies": []}]}, {"body": "You can’t read, can you?", "score": 8, "replies": []}, {"body": "Before trying to make someone look stupid, make sure you yourself are not a retard incapable of reading. The post clearly says the aunt refers to the investment at the amount of capital she originally invested. Therefore if she refers to it as 300k, that means she invested 300k originally.", "score": 5, "replies": []}, {"body": "No. OP explicitly said $300K was the amount invested in 1986.\n\nI bought 300 shares on a dip below IPO price in 1986. I sold them a few months later for like a 30% profit, which I though was pretty good…", "score": 3, "replies": [{"body": "What would that be worth today?", "score": 1, "replies": [{"body": "I try not to think about it.", "score": 2, "replies": [{"body": "I bought nearly 400 shares of Amazon around 2008 for $37 a share, sold once I made 100% profit. I’m with you", "score": 1, "replies": [{"body": "The money helped me move from Detroit to San Diego.\n\nHobson’s Choice.", "score": 1, "replies": []}]}, {"body": "If my math is right, due to stock splits over the years, a person who bought 300 shares in 1986 would have 64,800 shares today, worth nearly $23M, not including reinvested dividends.", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4260)", "score": 5, "replies": []}]}]}]}]}, {"body": "Better to remain silent and be thought of as a fool, in this case if you stayed silent no one would have any opinion of you because no one would even know you were in the room, than to open your mouth and remove all doubt.", "score": 2, "replies": []}, {"body": "No you read it wrong. He said “she looks at it as what she invested at that time” or ($300k). \nA $10,000 investment in Microsoft in 1986 would be worth a little over $20 million in 2022. Your math is way off", "score": 0, "replies": []}]}]}, {"body": "Gonna need some proof here", "score": 49, "replies": [{"body": "My aunt is jeff bezos girlfriend, see words are cheap with no proof.", "score": 8, "replies": [{"body": "When i open my pants there comes a bezos", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "Keep my girlfriend's name out your mouth.", "score": 3, "replies": [{"body": "Fight me dog face pony soldier", "score": 4, "replies": [{"body": "That's uncle Jeff to you.", "score": 2, "replies": []}]}]}]}]}, {"body": "Jesus F. Christ. Proof or ban.", "score": 80, "replies": []}, {"body": "This is so fake, she just ignores $10M in dividend income every year? There’s no way the IRS wouldn’t have audited her years ago.", "score": 37, "replies": [{"body": "Pretty sure her money person invests dividends into the original stock.", "score": -57, "replies": [{"body": "I don’t think you understand how taxes work", "score": 33, "replies": [{"body": "> I don’t think you understand how taxes work\n\nYou buy something at the grocery store and it just rounds up the 99 cent part of the price", "score": -9, "replies": []}]}, {"body": "“Money person” AHAHAHAHAHAHAHA", "score": 9, "replies": []}]}, {"body": "Auntie works for the IRS. She has Government privilege.", "score": 1, "replies": []}]}, {"body": "Can we get a mod to ban this idiot.", "score": 37, "replies": []}, {"body": "If she had 300k lying around to invest in 1986 ofc she doesn’t need to be paying attention to money", "score": 94, "replies": []}, {"body": "10,714 shares @ $28. You in the will?", "score": 29, "replies": [{"body": "Multiply by 288 to account for splits\n\nAunty is a billionaire", "score": 23, "replies": []}, {"body": "You need to consider the splits and dividend re investment . I don't know how many splits happened since then but her investment should worth half billion dollars now.", "score": 4, "replies": []}, {"body": "10714 with splits would be 3,085,632 shares today.  Times 264.46 closing price Friday equals:\n\n- $816 million today", "score": 2, "replies": [{"body": "Gotta take dividend payout in to consideration. Puts her closer to $1B. Definitely bullshit but ya know", "score": 3, "replies": []}]}]}, {"body": "I knew of a non-profit who spoke the same way, \"we have several hundred thousand dollars of x stock.\" I questioned them about it and they found out they had less than 60k, because it was all in one stock that had tanked. Guess it works for some and not others.", "score": 22, "replies": [{"body": "I have 100,000 shares in the great energy company called Enron. It’s for my grandchildren’s college fund.", "score": 19, "replies": [{"body": "My kids are gonna be rich when theranos takes off", "score": 9, "replies": []}, {"body": "/sigh! The first time I went from being a millionaire to NOT a millionaire was in the dot bomb.", "score": -16, "replies": []}]}]}, {"body": "A person who invests almost $1,000,000 (inflation adjusted) in an IPO of a business in a fledgling industry is definitely the type of person to “pay attention to all that”.\n\nEither you or your aunt are lying.", "score": 15, "replies": [{"body": "Meh - neither of us are.", "score": -28, "replies": []}]}, {"body": "Yea dude , that’s total bullshit. $10k invested at that time would be about $20 million in 2022. Your aunt would be on the Forbes 100 list if she had invested $300k into Microsoft in 1986 and still owned the stock", "score": 13, "replies": []}, {"body": "Get your ass in that will", "score": 13, "replies": []}, {"body": "Sounds like buuuu huuu huuu huuulllshit to me", "score": 10, "replies": []}, {"body": "Why is this bullshit:\n\n1.) Little probability someone put 300k in 1986 in an IPO company and haven't looked at it since. 300k then is worth more than 800k today.\n\n2.) As mentioned before, with stock splits, it'd be worth over a billion dollars as of now. She would be known by Forbes, all the other media and firstly and mostly, by IRS.", "score": 15, "replies": []}, {"body": "Cool story bro", "score": 20, "replies": []}, {"body": "The Warren Buffet of an aunt you got there bud", "score": 7, "replies": []}, {"body": "Am I misunderstanding the post or is OP claiming to have a grandma worth like 700 million?", "score": 13, "replies": [{"body": "Yes, you misunderstand. It's an *aunt*.", "score": 30, "replies": [{"body": "Haha, as you could probably guess from me being on this sub, reading is not really my best quality.", "score": 10, "replies": []}]}, {"body": "over a billion, actually", "score": 6, "replies": []}]}, {"body": " Tell her about BBBY, maybe she want to reinvest", "score": 11, "replies": []}, {"body": "On a split adjusted basis it looks like she would have paid around 10c each... So 3M shares, this seems unlikely lol", "score": 6, "replies": []}, {"body": "Is she single ??????", "score": 6, "replies": []}, {"body": "Fake", "score": 6, "replies": []}, {"body": "What a loser", "score": 8, "replies": []}, {"body": "GigaChad aunt with infinite theta mods.", "score": 4, "replies": []}, {"body": "Troll", "score": 4, "replies": []}, {"body": "Tell aunty she had better log into her account ASAP. States have gotten aggressive about abandoned property and will liquidate you via a process called escheatment. It could have happened decades ago.", "score": 4, "replies": [{"body": "Easy to just login to the state lost money website and see if it's there.", "score": 2, "replies": [{"body": "Sure. But it would be a shame if they cashed her out early and that 10,000 bagger is _just_ a 10 bagger.", "score": 1, "replies": []}]}]}, {"body": "Your aunt is a god damn moron. She should just come to this sub if she’s been diamond handing for that long. Jfc, take profits lady", "score": 5, "replies": [{"body": "Boom Capital gains+income tax", "score": 1, "replies": [{"body": "lol, what’s the other option? Not selling and losing the money and dying?", "score": 1, "replies": [{"body": "Ya there isnt one lol. But the government is gonna take like 25% of the 800m", "score": 1, "replies": []}]}]}]}, {"body": "Proof or ban", "score": 3, "replies": []}, {"body": "Anyone believing this nonsense is legitimately a moron", "score": 3, "replies": []}, {"body": "“You are a very wise auntie” \n\nNice touch there OP.", "score": 4, "replies": [{"body": "I was inspired by (plagiarized?) comments from this thread! 😊😊😊", "score": -1, "replies": []}]}, {"body": "![img](emote|t5_2th52|8882)", "score": 3, "replies": []}, {"body": "Can I have her phone number?", "score": 3, "replies": []}, {"body": "I don’t care if she’s single. Is she open to a side piece", "score": 3, "replies": []}, {"body": "Position or ban", "score": 3, "replies": []}, {"body": "You, or your aunt. One of you is full of shit", "score": 3, "replies": []}, {"body": "this is just a little math-practice story for us :)", "score": 3, "replies": []}, {"body": "Quit your bullshit", "score": 3, "replies": []}, {"body": "Smart", "score": 2, "replies": []}, {"body": "Unless you are telling a BIG story that $300,000.00 is now worth about $816,048,000. Good luck and don't blow it on bubble gum.", "score": 2, "replies": []}, {"body": "I'll give her 330k for it right now.", "score": 2, "replies": []}, {"body": "Don't you touch it or convince her that you can turn into more.", "score": 2, "replies": [{"body": "Actually that has been extremely hard for me to resist, but I fortunately have. Esp important because I’ve lost my million twice now.", "score": -7, "replies": []}]}, {"body": "Totally plausible, but would like to see what the actual story is. Boomers often don’t pay attention to a lot of details they don’t exactly understand. If true, your aunt is a goddam rockstar.", "score": 2, "replies": []}, {"body": "Positions or ban", "score": 2, "replies": []}, {"body": "She's doing way better than most  most people in this sub!", "score": 2, "replies": []}, {"body": "Idk why everyone hating, you are super lucky bro congrats 🎉🎊", "score": 2, "replies": []}, {"body": "If you spend anytime on this sub I wouldn't doll out investment advice to people you love.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4275)![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "I read some study once that some of the most successful investors were women who like grandma just invested and left it and had no interest in managing it actively. To put it in terms newer WSBers understand, “They liked the stock” and HODLd it.", "score": 1, "replies": [{"body": "To be fair, by the time you have that much money to throw into a stock and not worry about it, you're already rich, basically.", "score": 2, "replies": [{"body": "Yeah especially since 100$ in 1986 equals 270$ in todays money.", "score": 2, "replies": []}]}]}, {"body": "My brother in Christ, your aunt has more money than the entirety of this sub", "score": 1, "replies": []}, {"body": "That’s insane", "score": 0, "replies": []}, {"body": "It’s interesting that some people here feel that they understand rich people so freaking well that they can state with absolute authority that this story is fake. \n\nHow many billionaires have you spent time with?", "score": -5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What do you need for “proof”? Are screenshots “proof”?", "score": -1, "replies": [{"body": "Picture of your aunt naked would be enough for me personally", "score": 2, "replies": []}]}]}, {"body": "Worked closely with one. Probably the smartest and most detail oriented person I’ve met. \n\nOP u not giving details bro. \nMy old boss would be able to break down his net worth in less than a minute and he too has a “money person”.", "score": 1, "replies": []}, {"body": "there is not a single billionaire that \"doesn't pay attention to all that\"  \n\n\nliterally every one has every dollar they have out working for them at all times  \n\n\nI've met dozens of them (including about 10% of the forbes top 100) and they can tell you where every penny of their money is always.", "score": 1, "replies": []}]}, {"body": "She doesn't pay attention to that stuff? The government does.", "score": 1, "replies": [{"body": "She hasn’t realized any profit so it’s not (yet) taxable.", "score": -7, "replies": [{"body": "Just saying they know about it. Someday they’ll tax unrealized gains.", "score": 1, "replies": []}]}]}, {"body": "Is your aunt single?", "score": 1, "replies": []}, {"body": "Can you ask her if she us looking for a awesome, but poor degen? Here is my curriculum", "score": 1, "replies": []}, {"body": "she sounds infinitely wiser than the rest of us", "score": 1, "replies": []}, {"body": "🧢", "score": 1, "replies": []}, {"body": "Positions or ban", "score": 1, "replies": []}, {"body": "If I'm to assume this is real, I'd tell your aunt what her holdings are worth and see how she responds.\n\nI don't think I can assume this is real, but I can respond as if I assume this is real, I suppose.", "score": 1, "replies": []}, {"body": "BS. If she bought it at $.25 which is the sale price at the end of 1986, that would’ve been 1.2 million shares. Multiply that by $260 at the close of business last Friday, 9/9/22. She would not have been able to get on the pre-IPO price unless she was an accredited investor at that time. With 1 million net worth and or 200 K annual income. I say she’s a liar. And now that she’s passed away, unless you inherited quite a large sum of money, I’m sure you will agree.", "score": 1, "replies": [{"body": "It was some rando making a joke about the queen saying she passed recently at 96, not OP lol.\n\n\nI have no reason to not believe OP - going by the text thread, the money for the microsoft stock came from an inheritance in the first place, people who inherit 300k+ and *invest it* instead of spending it on bettering their lives are already living well and not worrying about money imo.\n\n\nAs far as her owning a billion dollars worth of stock and not being on the forbes list or whatever, or \"not logging into her account and it disappearing\" obviously this would be held in trust with an institution. Blackrock and vanguard hold a quarter-trillion dollars of microsoft between them, 700m or 800m or 1b is chump change, not even .05 of a percent of the company 🤷‍♂️", "score": 1, "replies": []}]}, {"body": "No shot", "score": 1, "replies": []}, {"body": "Sounds like you need to get her life insurance plan brother, ya know people slip and fall down stairs all the time!", "score": 1, "replies": []}, {"body": "Bro do you need an uncle or sum?", "score": 1, "replies": []}, {"body": "There's still time to become her favorite nephew.", "score": 1, "replies": []}, {"body": "she single?", "score": 1, "replies": []}, {"body": "yea I call bs on this 1986 is when MSFT went public", "score": 1, "replies": []}, {"body": "Take your larping back to the porno subreddits regard", "score": 1, "replies": []}, {"body": "“Blank” definitely sold and she doesn’t know", "score": 1, "replies": []}, {"body": "Or she's just confused. Isn't interested. And the 300k is what she has now.", "score": 1, "replies": []}, {"body": "Lol. Wise auntie saying she’s a billionaire I think you got one of those aunties that just says whatever bs she can think up at the time", "score": 1, "replies": []}, {"body": "Dude - she better check on it.  I’ve heard stories of people like her and the banks seize assets when nobody has logged in or looked at the account for xx amount of years", "score": 1, "replies": []}, {"body": "Tell her I would date her account oooops I mean her", "score": 1, "replies": []}, {"body": "Nice larp chin Gus", "score": 1, "replies": []}, {"body": "300k in the 80s. This isn’t wow. This is rich getting richer", "score": 1, "replies": []}, {"body": "Who the fuck would write something to their aunt like that?", "score": 1, "replies": []}, {"body": "that's roughly $1B", "score": 1, "replies": []}, {"body": "I own 300000 of your aunt", "score": 1, "replies": []}, {"body": "Sounds retarded", "score": 1, "replies": []}, {"body": "$300,000 investment into 1 stock and in 1986? Nope.", "score": 1, "replies": []}, {"body": "Dude if you’re serious you should definitely ask her to consider selling. She’d literally be a billionaire", "score": 1, "replies": []}, {"body": "Lol thanks for the laugh clown", "score": 1, "replies": []}, {"body": "What does it have to do with you?", "score": 1, "replies": []}]}
