{"title": "After losing money on options, excited to own my first stocks.", "selftext": "After losing 22K on options this year (Started year with 28K in savings) I decided it wasn't for me as I'm too compulsive and stupid. After months of feeling horrible about losing that kind of money and naseous, I finally decided to chalk it up to a learning experience and never do it again.\n\nThat being said, I put half of my remaining savings into stocks on monday and I couldn't be more excited. Bought a couple AMZN stocks, some NVDA, AMD, FB, MSFT and a few other smallers ones (MTCH, V, ADP, XAR) and I am already up $300. I sleep so much better knowing that my money isn't just evaporating, that even if it goes down there will be a light at the end of the tunnel. I should've done this from the start.\n\nI managed to pick up AMZN at 1502! I just think to myself \"Wow, if this goes back to ATH in next 6 months, I will have made $500+ by doing nothing\". All that money lost to options.. if only I had bought stocks from the beggining!", "id": "9t4ems", "created_utc": 1541030374.0, "score": 8, "upvote_ratio": 0.75, "num_comments": 20, "comments": [{"body": "I mean... with a track record like that, just do the exact opposite of anything you think is a good idea. if you think a long call on NVDA is good, sell one instead.\n\nJust kidding. Don’t do anything i suggest.", "score": 19, "replies": [{"body": "Believe it or not I actually had a lot of good picks! I was turning $1k into $3-5k pretty consistently, problem was soon as I got $5k I would put like $4k into next play and lose it all. I coul've been ahead so many times. But this is why I said I don't have the mentality for this, too much of a gambler.", "score": 2, "replies": [{"body": "Seriously for sec. If you look at this *as a gambler* my suggestion would be that the odds favor the house. Selling calls or puts generally wins out. something like 90% of all calls and puts expire worthless. If you are just making one sided bets with calls or puts, sell instead of buy, and only sell against what you’d like to invest in in case you get assigned. Fyi... selling puts is a great way to get a discount against what you already plan on buying anyway - so long as you want at least 100 shares that is.\n\nWARNING... don’t sell naked calls. that’s dangerous. - Also... again... don’t do anything I say.", "score": 2, "replies": [{"body": "Yea, the whole getting assigned thing scared me which is why I did naked calls/puts. But yes, people selling calls/puts make a lot more than those buying.", "score": 1, "replies": []}]}]}]}, {"body": "I completely feel this. I have been up on stocks over the year. Options have taken 3/4 of what ive put in.  \n\nRecently switch my account to 100 percent stocks and will continue to maintain this \n\nGodspeed to you brother and good for you for not quitting. ", "score": 2, "replies": []}, {"body": "You’re fairly tech heavy. Try diversifying your investments among different sectors to hedge against lopsided losses. Technology, industrials, energy, consumer staples, housing, utilities, banks, materials, consumer discretionary, etc. Try out some dividend stocks, REITs, bonds, and ETFs. My win to loss ratio in options is probably 40/60. I’ve been closing my puts and calls and diversifying into several stocks. Options are more stressful than normal trading too because a loss is just a loss whereas in stocks I can sit and wait for Amazon to recover and cash out in the green. ", "score": 2, "replies": []}, {"body": "Were you strictly buying options? I've had more success selling options than I have buying and holding stocks, but as someone who was a former sports gambler, its always so tempting to buy some calls or puts....", "score": 2, "replies": [{"body": "Yup, was buying calls and puts only. Cash account.", "score": 2, "replies": []}, {"body": "I'm in the same boat. Hold no naked stock anymore, entire portfolio is short options and I wouldn't have it any other way.  I love being the house rather than the gambler. ", "score": 1, "replies": [{"body": "Same here. I'm dealing more with credit spreads because I don't have enough cash/margin to back some of the short positions, but so far, short calls have been my biggest money maker. ", "score": 1, "replies": []}]}]}, {"body": "Option is a leverage. It can be in your favor if you know how to do it. But I agree is not for an average investor ", "score": 1, "replies": []}, {"body": "Read some books.", "score": 1, "replies": []}, {"body": "How did you ever go from options to stocks? It’s generally the other way around. Options are legit gambling lol. At least your in the BTD territory. GL!", "score": 1, "replies": [{"body": "Because I had a friend making a killing in December/January. Was easy money, until it wasn't... then kept putting money in to recover and well.. lost it all. Twice. Also, I got carried away because it was gambling.", "score": 1, "replies": []}]}, {"body": "Buy some XRP and thank me in a couple years", "score": 0, "replies": [{"body": "Have a bunch, thanks!", "score": 1, "replies": [{"body": "My guy! Cheers!", "score": 0, "replies": []}]}]}, {"body": "Man it’s going to be painful trying to recover without options.", "score": -1, "replies": []}, {"body": "Ever heard of *diversification*?", "score": 0, "replies": []}, {"body": "Aw you should have brought that $30K in options money to trade with me, would have doubled it by now.", "score": -8, "replies": []}]}
{"title": "TSLA Bullish Formation (NSFW)", "selftext": "TSLA Tit and Handle formation. Very bullish. $420 secured. \n\nhttps://preview.redd.it/hb4b5pg82fv11.png?width=791&format=png&auto=webp&s=b163564549b6e82f0afc45b2dff2990201a88db7", "id": "9stur4", "created_utc": 1540946092.0, "score": 42, "upvote_ratio": 0.76, "num_comments": 20, "comments": [{"body": "Are them some saggy titties ", "score": 70, "replies": [{"body": "yes, afraid so. but its the best we got. ", "score": 61, "replies": [{"body": "implants imminent ", "score": 3, "replies": []}]}, {"body": "Could be a warm scrotum formation ", "score": 26, "replies": []}, {"body": "The ol’ grandma’s turkey dance ", "score": 7, "replies": []}, {"body": "Saggy tits formation is best formation", "score": 3, "replies": []}]}, {"body": "Not suitable for work, still opened it at work. Got fired for charting titties.", "score": 29, "replies": [{"body": "then your boss is stalking you. report your boss. ", "score": 4, "replies": []}, {"body": "all I see are reverse ice cream sundaes. deny deny deny. ", "score": 1, "replies": []}]}, {"body": "Love this sub. Sitting here on my phone trying not to wake my girl while I laugh at some tits someone drew on a chart", "score": 12, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Autist that's borderline artist. ", "score": 8, "replies": []}]}]}, {"body": "The closest OP will get to some terrible looking breasts anytime soon.\n\nGood luck, lil buddy.", "score": 8, "replies": [{"body": "Need tendies to secure real ones. I'd say funding secured. ", "score": 3, "replies": []}]}, {"body": "Officially top WSB analyst. ", "score": 8, "replies": []}, {"body": "Elon clearly did this to impress his girlfriend", "score": 5, "replies": []}, {"body": "Tit patterns are high maintenance and high cost.  Those tits are bearish.  Sell Sell Sell!", "score": 3, "replies": []}, {"body": "Something something something...you can always find a trend/tits on any graph if you look hard enough...", "score": 2, "replies": []}, {"body": "Well, hopefully my portfolio doesn't go tits up ^(or I swear I will have to start stripping.) ", "score": 1, "replies": []}, {"body": "That's a cow not a bull you bloody idiot.  ", "score": 1, "replies": [{"body": "Cow tits. Still tits. ", "score": 1, "replies": []}]}]}
{"title": "Nvidia DD - Faulty Flagship Cards", "selftext": "Their latest cards are having a bunch of issues reported by users. Browsing /r/nvidia has shown that this issue is more common than normal. As of now, there's only one source covering it, CNET. I have a feeling that once more news outlets pick up this story, the stock won't fare too well (considering the current environment). \n\nCNET Link: \n\n* https://www.cnet.com/news/people-are-reporting-problems-with-their-nvidia-rtx-2080-ti-gpus/\n\nr/Nvidia: \n\n* https://www.reddit.com/r/nvidia/comments/9sysoa/survey_rtx2080ti_is_it_working_for_you/\n* https://www.reddit.com/r/nvidia/comments/9si1ww/nvidia_rtx_2080_ti_graphics_cards_are_dying_in/\n* https://www.reddit.com/r/nvidia/comments/9t1fwc/failing_rtx_2080_ti_source_discovered_its_the/ (top comment saying that Nvidia is using cheap MU memory, **puts on MU too**)\n\nThat's my DD. Nvidia down to $180.", "id": "9t2ngt", "created_utc": 1541018205.0, "score": 24, "upvote_ratio": 0.71, "num_comments": 30, "comments": [{"body": "is this my chance to be the next nvidia shark? eh probably not. calls it is.", "score": 22, "replies": []}, {"body": "Can you imagine what the stock market would be like if a company's stock price went down hard every time a small number of customers complained about a product?\n\nEvery stock would be red all the time. People love to complain. The media loves to report negative news. \n\nCompanies produce millions of products, and have millions of customers. Manufacturing does not have a 0% error rate - there will always be complaints. \n\nAND there will always be these shit clickbait news sites that LOVE to spit out low-effort 2 paragraph articles throughout the day that will convince idiots to click on it. Doesn't matter how big or small, or how true or false or newsworthy a problem really is when the goal is volume. How many articles has CNET published today? 50? 100? 500? Check it out. \n\nWhat I find weird and somewhat funny is 1) you bagholders keep clicking on these articles (CNET? Really?) 2) It appears you think EVERY SINGLE NEWS STORY YOU READ is going to move the stock (fucking nuts guys, get your shit together) 3) You come on here and shitpost and embarrass yourselves (this part I like and enjoy reading, keep it up please). \n\nCurious how did you get $180? What's the failure rate on these chips actually estimated at? If it's close to 15% then you may be right. \n\n\n\n\n", "score": 43, "replies": [{"body": "Yeah dude, as an engineer who's shipped millions of products, this is just how things go\n\nYou ship a million consumer devices, you're going to get at least 1000 customers with screwed up units.  Nowadays, they're going to congregate on Reddit or Facebook or somewhere and raise a huge shitstorm over it too.\n\nThe only way to prevent it is to use components with a zero failure rate/low tolerance, but those cost an order of magnitude more than normal electronics.  That's why everything in a hospital or an airplane is so fucking expensive, the parts all cost 50x as much because people would rather pay up front than have something break down in a critical moment.\n\nUnless people want to fork over $60,000+ for a graphics card on a 10 year upgrade cycle, they're just going to live with the possibility that they might need to send it back for a replacement/refund\n\nPresumably, NVidia and their retail partners are going to handle replacements smoothly since this is a regular occurrence.  I wouldn't buy any puts unless they tell their customers to fuck off and people start doing chargebacks en-masse and/or a class action lawsuit", "score": 19, "replies": []}, {"body": "this guy NVDAs", "score": 20, "replies": []}, {"body": "Same with Apple, always a ton of 'it's flawed' articles that amount to nothing", "score": 5, "replies": [{"body": "CALLS IT IS ", "score": 1, "replies": []}]}]}, {"body": "shit and you toss this up after market close? a lot can happen in 17 hours\n\ni have no idea if 4% rate is bad or good in that sample size tho heh", "score": 36, "replies": [{"body": "These reports came out monday", "score": 23, "replies": [{"body": "Yep. I'm surprised hit pieces aren't out yet.", "score": 13, "replies": [{"body": "That's cause big money scooped up massive shares at 180. This a minor issues considering their profit margins on these cards are probably 70% and if you want the best there is nothing on the market remotely comparable. First run of these cards can be susceptible to this type of malfunction and should be worked out in follow up production.", "score": 16, "replies": [{"body": "under $200 was a gift", "score": 5, "replies": []}]}, {"body": "Tweet this to Andrew Left ", "score": 7, "replies": [{"body": "Andrew Left probably covered by now.", "score": 4, "replies": []}, {"body": "He's actually been killing it lately. Short NVDA and ABBV and long TSLA before earnings", "score": 2, "replies": [{"body": "Yeah I actually want to buy calls when hitpiece comes out then recover.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Late. I’m docking you -10%.", "score": 7, "replies": []}, {"body": "Well I think we need to consider their growth markets more than their base market at the moment.\n\n&#x200B;\n\n  \nHere is my insider insight. I use v100s for deep learning. Amazon keeps running out of capacity on AWS, literally not a single v100 card available. Amazon cannot buy enough to meet demand. My friend down the street his company bought 8 v100s. My employer is buying product from NVDA. NVDA is setting the table on Mars waiting for Elon to show up.", "score": 14, "replies": []}, {"body": "Nvidia could have jensen huang drive around to every nvidia customers house and take a huge steaming shit on their cars and then ring their doorbells and they would still spend $1200 for 190fps instead of 150fps. Nvidia pulls this kind of crap every couple years and by the end of the month everyone just forgets about it and keeps buying their GPUs. Long NVDA", "score": 12, "replies": []}, {"body": "The amount of damage control within this thread is a contrarian signal.", "score": 5, "replies": []}, {"body": "Please oh god, go down before Friday ends", "score": 3, "replies": [{"body": "It's gonna gap down tomorrow no worries.", "score": 2, "replies": []}]}, {"body": "New tech with thiusands of sold units always has issues.", "score": 3, "replies": []}, {"body": "If you think professionals dont already know this youre even more autistic than you look (very)", "score": 2, "replies": [{"body": "My mum told me to stay away from people like you (meany). ", "score": 7, "replies": [{"body": "But you are people like him (autistic)", "score": 3, "replies": []}]}]}, {"body": "This is old news bro. Also people bitching on Reddit doesn't mean shit.  Also..\n\nThe reviews for rtx gpu's in Amazon don't really mention none of this bullshit, everything looks fine\n\nThe only solid information in the story was that people aren't getting their RMA back because the 2080ti is completely out of stock.... This to me screams sold out. \n\nLong NVDA", "score": 2, "replies": []}, {"body": "monopoly companies are nice   \n\nPeople don't even bother with AMD for compute because CUDA is so much better.   Do better DD this was a known issue Monday.", "score": 2, "replies": []}, {"body": "Gonna be red as fuck tomorrow SPY puts son.", "score": 2, "replies": []}, {"body": "Prayers to people shorting this stock long term. ", "score": 1, "replies": []}]}
{"title": "Good tsla trade?", "selftext": "[deleted]", "id": "9t3amp", "created_utc": 1541022527.0, "score": 7, "upvote_ratio": 0.71, "num_comments": 27, "comments": [{"body": "Wait a second...Maybe I don't see correctly. Why are you even selling those deep OTM strikes? This is for 2 weeks from now? What you are saving like 60 cents on a $3,000 trade? \n\nI recommend look into a straddle or rational delta wings. \n\nAlso the strategy is an iron condor not an iron butterfly but that's the least of your problems. ", "score": 25, "replies": [{"body": "It’s a reverse iron butterfly. Look at the photo...\n\nSelling the otm strikes tighten up the break even of spread. But honestly, I am looking to see why it won’t work. This is just from my understanding.\n\nWill look into the delta wings", "score": -8, "replies": [{"body": "This is not a butterfly", "score": 16, "replies": []}, {"body": "My man, a butterfly is when your inner parts (not sure of the exact terminology) have the same strike price. This is an iron condor.", "score": 10, "replies": [{"body": "You’re right... thanks brony", "score": 3, "replies": []}, {"body": ">inner parts\n\nlegs is the terminology, the inner legs are bought at the same strike, outer legs sold at some % out to lower cost of entering position\n\nyou prolly knew all that (excluding the terminology bit) but couldn't hurt to describe the butterfly", "score": 1, "replies": []}, {"body": "Called the \"body\" of the fly.  Body and wings.", "score": 1, "replies": []}]}]}]}, {"body": "This trade is shit. Raise the strike of the Put you’re selling, no way it’s ever going to 190. 250 is pretty safe.", "score": 14, "replies": [{"body": "I can't tell is he joking", "score": 7, "replies": []}, {"body": "Yeah have not seen hitting below $250 this year even with so many shitty news. Selling $250P Feb 19 is technically almost free money at this point. ", "score": 1, "replies": [{"body": "Just wrote a Jan $250 put today for $1400", "score": 4, "replies": []}]}]}, {"body": "This is a very dumb trade.\n\nFirst of all you're just buying a straight up long strangle. Selling the far OTM options save you a whole $20, and you will lose more than that in slippage just getting those filled. \n\nThat profit chart is also assuming IV stays the same. If it drops at all, you get double IV crushed. You need a huge move.\n\nThere are much better plays you could make.\n", "score": 10, "replies": [{"body": "Fair enough. Tell me something better man. I’m all ears", "score": 5, "replies": [{"body": "A double calendar spread, for starters.  I opened a 11/9-11/16 330c calendar spread just after earnings, and when TSLA surged up to 340ish I expanded it into a double calendar spread by adding a 11/9-11/16 350c spread.\n\n&#x200B;\n\nBelow is a picture of the position in ThinkOrSwim's trade simulator.  Note that the trade is profitable anywhere between $315 and $370 assuming IV remains similar or goes up.\n\n[https://imgur.com/a/yCJSKHq](https://imgur.com/a/yCJSKHq)\n\n&#x200B;\n\nThe benefit of using calendar spreads is that they profit from theta decay and have a wide profit zone... They just require patience, which isn't exactly the WSB way.  But in this case 'patience' means waiting like 2 weeks, so it's still a pretty short term trade and even with a double calendar the max profit on this trade is around 160% with the potential to be much higher if one or more of the short positions expire OTM and the stock surges afterwards.\n\n&#x200B;\n\nQuick note - if I were opening a trade like this rather than creating it as an adjustment, normally I'd use puts for the lower side of the double calendar to avoid opening a position with one side that's ITM.", "score": 9, "replies": [{"body": "Sick. Thanks man", "score": 2, "replies": []}, {"body": "Totally agree. Anytime I see an IV mismatch in front dated options like there has been recently, I go right to calendars. \n\nIf OP is truly agnostic to which direction this will move, I agree about a double call+put calendar spread. However, if there is any directional assumption or a plan for any adjustments, I think double calendars with both sides calls or puts (one leg ITM, one OTM) is better. Even if a stock is going down, a double call calendar is easier to adjust than a call+put because you can move the OTM leg a similar distance ITM for almost the same price. You basically alternate laddering either leg ITM based on the direction. You can't do that with a double calendar with both puts and calls, because it costs to move a way OTM leg a little closer OTM.\n", "score": 1, "replies": []}]}]}]}, {"body": "Because it’s going to trade sideways. ", "score": 6, "replies": []}, {"body": "Possibly a bad idea because you set your profit points at the floor and ceiling which might make you miss both if it bounces in between 305 and 370?? ", "score": 3, "replies": []}, {"body": "Those sell strikes are so crazy OTM why even bother? Can’t be reducing the cost of the trade by more than a couple %", "score": 3, "replies": []}, {"body": "It may stay flat at this point. It's been nearly a full week for digestion of earnings. If it was going to short squeeze it would have done so by know, but it's possible I underestimate the time required for shorts to cover. \n\nI don't see it going done though cause I have a ton of calls.", "score": 2, "replies": [{"body": "Maybe, but could be a good trade it timed well, especially if it had a longer expiration", "score": 1, "replies": []}]}, {"body": "I’d rather be the seller\n\nSelling far OTM ICs", "score": 2, "replies": [{"body": "This is selling. It’s basically selling a butterfly spread ", "score": 1, "replies": [{"body": ">bought closer strike and sold higher strike\n\nMmm 🤔 u sure ur trades got credited \n\nBuying Butterfly example:\n\nBuy $310C\n\nSell $320C\n\nBuy $330C\n\n", "score": 3, "replies": []}]}]}, {"body": "That’s a pretty expensive play for the return your looking at. What’s that like $600 profit cap?\n\nTesla I’ve is so high I’d rather go long or short 100 shares(depending IV on puts and calls). Write the covered option in the money. Almost an arb unless there’s a huge swing", "score": 2, "replies": []}, {"body": "Yikes. You don’t profit between a huge margin.", "score": 1, "replies": []}, {"body": "This doesn't counts iv as a constant rather then a changing. Try messing around with iv numbers in case of a iv crush \nUse iv at 90% and at like 50%", "score": 1, "replies": []}]}
