{"title": "10 Optimal Tesla Trades since 2022, average holding days = 45", "selftext": "", "id": "1chq6wy", "created_utc": 1714580318.0, "score": 4, "upvote_ratio": 0.55, "num_comments": 9, "comments": [{"body": "and? is that it?", "score": 6, "replies": [{"body": "yes", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "the audacity", "score": 2, "replies": []}]}]}]}, {"body": "May I ask what tool you used? It looks like excel / tableau but was wondering if you have convenience tooling on top, especially for calculating optimal trades during a timespan", "score": 1, "replies": [{"body": "i built this tool in python, its extracting data from yahoo finance, i give it 3 inputs: symbol + start/end dates, the rest is auto generated, i built the same thing for day trading too, i posted some of them on X, my usernames ant1oine, im on a longterm quest right now to find some kind of winning formula based on historical data", "score": 1, "replies": [{"body": "How this graph is actually helping you? What do you look for?", "score": 1, "replies": [{"body": "now that the tool automatically identifies the best possible trades for a given period, i am planning to build a predictive model that will scan through 100s of stocks and their historical data to try to find similarities in the price movements, volume, financials when optimal trades occur - its a medium-long term personal project, might fail might work, either way im having fun building it", "score": 1, "replies": []}]}]}]}, {"body": "What’s the strategy, divergences and trend breaks etc?", "score": 1, "replies": [{"body": "Still trying to figure it out", "score": 0, "replies": []}]}]}
{"title": "Pfizer raises profit outlook on cost cuts and strong non-Covid sales ", "selftext": "Pfizer on Wednesday reported first-quarter revenue that beat expectations and hiked its full-year profit outlook, benefitting from its broad cost-cutting program and strong sales of its non-Covid products.\n\nThe company now expects to book adjusted earnings of $2.15 to $2.35 per share for the fiscal year, up from its prior guidance of $2.05 to $2.25 per share.\n\nPfizer reiterated its previous revenue forecast of $58.5 billion and $61.5 billion, which it first outlined in mid-December. \n\nHere’s what Pfizer reported for the first quarter compared to what Wall Street was expecting, based on a survey of analysts by LSEG: \n\nEarnings per share: 82 cents adjusted, it was not immediately clear if it is comparable to the 52 cents expected.\n\nRevenue: $14.88 billion vs. $14.01 billion expected.\n\nAfter a rocky 2023, Wall Street appears to be skeptical about whether Pfizer can turn its business around just yet.\n\nThe stock fell roughly 40% in 2023 as demand for Covid treatment Paxlovid and its vaccine against the virus dried up, causing the company to dramatically slash its full-year revenue forecast and record multibillion-dollar charges related to inventory write-offs. Pfizer also disappointed the street with an underwhelming launch of a new RSV shot and a twice-daily weight loss pill that fell short in clinical trials. \n\nSource: https://www.cnbc.com/2024/05/01/pfizer-pfe-earnings-q1-2024.html", "id": "1chjnen", "created_utc": 1714562373.0, "score": 59, "upvote_ratio": 0.87, "num_comments": 11, "comments": [{"body": "I'll keep holding and collecting that dividend", "score": 24, "replies": []}, {"body": "They lowballed guidance so much last quarter that it would have taken an absurd miss to actually make the stock drop. The covid side of the business is all but written off as dead at this point. But there are encouraging signs that the rest of the business is on track to move the company forward.\n\nIf Pfizer can finally shake off the perception of being just a covid company this could be the start of a turnaround for the stock.", "score": 18, "replies": []}, {"body": "Not a bad value stock to hold.", "score": 7, "replies": []}, {"body": "Nice", "score": 8, "replies": []}, {"body": "Is the free fall finally over?", "score": 9, "replies": [{"body": "I'll start buying puts so the stock will rocket higher.", "score": 3, "replies": []}, {"body": "Lol nah man. What i notice is that the market loves to love and hate stocks. As long as pfizer is on the naughty list it’ll keep getting sold on any gains. On the contrary darling stocks like Nvda will always come back on any sell off.", "score": 3, "replies": [{"body": "For a balanced stock portfolio PFE is a high dividend defensive industry stock at the current price.  I own PFE and Nvda.", "score": 6, "replies": []}]}]}, {"body": "Got it for 26 will get out at 59", "score": 4, "replies": []}, {"body": "Lol.... make theta play because this stock has minimal price action....", "score": 2, "replies": []}, {"body": "They are going to buy CTXR! Great hemorrhoid treatment! First FDA approved for 2 phases!", "score": 1, "replies": []}]}
{"title": "Tesla Q1 Battery Report // The Death of the 4680 Has Been Greatly Exaggerated", "selftext": "", "id": "1chnaf3", "created_utc": 1714572994.0, "score": 26, "upvote_ratio": 0.78, "num_comments": 17, "comments": [{"body": "Yep. Per my sources in Austin, cell teams were the least impacted by layoffs.", "score": 7, "replies": [{"body": "Then again super charger team **was** least impacted, and that was exactly why they got canned", "score": 1, "replies": []}]}, {"body": "The ramp of 4680 has been even more greatly exaggerated. 2 years overdue and an order of magnitude lower output. Just a hedge after all....", "score": 27, "replies": [{"body": "Its weird on battery day how they mostly touted its ability to boost output, boost yield, improve charging speeds, improve heat management, and improve density. But then he called it a \"hedge\" -- I guess they weren't sitting on some new technology that was cheaper like they claimed? I hope they continue to invest and make improvements that they promised w.r.t density and charging.", "score": 4, "replies": [{"body": "All of these improvements were likely already on the roadmap of the suppliers. Given his comments that Tesla would *also* be buying as much as they could from them, it makes sense they’d be implementing the same improvements in their cells as well. \n\nHonestly it does look like at this point, it was all a hedge on volume/cost. Now that prices are down for commodities and batteries, why should they invest more blood and sweat for a limited gain? If any?\n\nShame given the potential this program could have had, but Tesla is known for pivoting quickly like this when the broader environment changes.", "score": 0, "replies": [{"body": "The hedge was to be able to get better performance and production scalability improvements for in-house batteries. That's why the model y and cybertruck that use 4680 don't have better range or charging profiles since the breakthroughs they claimed didn't come to fruition (yet).", "score": 1, "replies": []}]}]}, {"body": "Hated to hear Elon say that word on the earnings call, \"hedge\"", "score": 9, "replies": []}, {"body": "If, as it states in the video, they are using 4 cell assembly lines (with a nominal capacity of 100 GWh) to make 7 GWh of cells per year, that's a... 7% capacity factor. Ouch. That is legitimately terrible after running the lines for at least 2 years. No wonder they're not in a rush to scale them up - 7% capacity means they barely have them working; there is a lot of capacity yet to be unlocked just by (hopefully) getting them to run right. \n\nIf they can't get them to run right, then they'll have to retool, in which case building more lines now with the wrong tooling would be a mistake.\n\nSo there really isn't news. 4680s are late and underdelivering, as everyone already knew. Only question is if/when Tesla can fix that and achieved the original goals of the program.", "score": 2, "replies": []}, {"body": "Honestly if they're still working out some kinks, better to delay the main ramp. Like anything else, they'll figure it out in time.", "score": 5, "replies": []}, {"body": "I mean with the current state of the market, its better for tesla to buy the over supply of cheaper batteries because most of tesla's competitors scaled back plans, it makes sense to scale 4680 with the cybertruck ramp. Also at battery day they didn't know or realize how good LFP batteries would be in such a short amount of time.", "score": 1, "replies": []}]}, {"body": "Really good battery tech video and channel", "score": 5, "replies": []}, {"body": "Good video.\n\nI think if they could have ramped the 4680 they would have, as discussed if it were cheaper than supplier batteries it would have saved them a tonne of money. I also think the semi is conspicuously absent and imo a lot of that is about how much battery supply it would chew up.\n\nIt remindes me of the Solar Roof, where they're still pretending that's not dead when clearly it's dead. I hope they can eventually figure out 4680, and it's been way harder than they thought it would be.", "score": 4, "replies": [{"body": "How is tesla now battery AND demand constrained? Cant be both at the same time right?", "score": 2, "replies": [{"body": "As he mentions in the video with a US made 4680 batter the Model 3 could be way cheaper and get battery subsidies, which would then spur more demand.\n\nMoreover the semi is 1000% not demand constrained, they have an order book years long, it's stuck because there aren't enough chargers (which doesn't sound that hard to fix) and imo they take too many batteries. Elon said years ago that he didn't just want to launch more products if it meant taking batteries from one and putting it in another.\n\nTesla has had the semi design done for a while and all the capex they could need to actually build out the lines so why haven't they gone faster on it?", "score": 2, "replies": []}]}, {"body": "The cool thing is after they announced 4680 basically all battery manufacturers began to make it a standard size which means the efficiency gains can be had externally without much internal investment?", "score": 1, "replies": []}]}, {"body": "Might not be dead, but it's not like all the other companies are just sitting around doing nothing. CATL, BYD, etc are all developing new and quality battery technology, and Tesla is buying them.  \n\nMight turn out that 4680 is dead by the time it actually comes to market in the form they said it would.", "score": 2, "replies": []}]}
{"title": "Tesla Megapack Factory in China to start construction", "selftext": "", "id": "1chnpsx", "created_utc": 1714574120.0, "score": 79, "upvote_ratio": 0.86, "num_comments": 13, "comments": [{"body": "That shit will be up in running in <9 months. The Chinese don’t need permits and red tape just build.\n\nTimelapse of Shanghai Giga was a sight to behold ", "score": 26, "replies": [{"body": "[Link](https://old.reddit.com/r/teslamotors/comments/jkz3kf/satellite_timelapse_of_the_construction_of/)", "score": 1, "replies": []}]}, {"body": "Not to rain on the parade, but this was already known news (that it would start in may) and it was *supposed* to start being built in Q3 2023. It was supposed to start making packs right about now. But oh well, better later than never.", "score": 22, "replies": []}, {"body": "Jesus christ they have so much money for investments", "score": 15, "replies": [{"body": "Yep. Spending billions on various projects yet still have cash in the bank.", "score": 2, "replies": []}]}, {"body": "Who makes the batteries for this product? CATL? The grid storage market is going to be absolutely inundated with supply in short order and it will be commoditized by the players who control the battery cell supply (CATL, BYD, LG, Panasonic, SK, Samsung).\n\nCalifornia just announced the biggest grid storage facility in the world that will use Samsung, BYD and LG batteries.\n\n[https://www.energy-storage.news/edwards-sanborn-california-solar-storage-project-world-largest-bess-battery-system-fully-online/](https://www.energy-storage.news/edwards-sanborn-california-solar-storage-project-world-largest-bess-battery-system-fully-online/)\n\nAnother massive 620 MW project in Los Angeles announced recently will use BYD batteries.\n\n[https://www.canarymedia.com/articles/batteries/this-california-city-is-trading-an-old-gas-plant-for-a-giant-grid-battery](https://www.canarymedia.com/articles/batteries/this-california-city-is-trading-an-old-gas-plant-for-a-giant-grid-battery)\n\nThis is gonna be another business like EVs at maturity. A race to the bottom on profit margins. Batteries will be a commodity. China will do to grid battery storage what they did to solar panels.", "score": 10, "replies": [{"body": "I think it was CATL who built a battery factory very close to this mega pack factory so the assumption was that it is CATL to be supplying the batteries.", "score": 5, "replies": []}, {"body": "The megapacks being assembled at Lathrop at end of 2023 were using CATL LFP cells, and CATL's dominancy of LFP seems to be continuing, so I would say that CATL is a pretty safe bet.", "score": 3, "replies": []}, {"body": "So then why isn’t the grid storage market already inundated by supply today?\n\nHow is it that current supply is actually less than demand?\n\nWhy aren’t we seeing major competitors and price wars today?\n\nAnd why are things going to change?", "score": 2, "replies": [{"body": "Because it’s more nascent. It will get there give it a few years. And we are seeing major competitors. I just shared links that two of the biggest new projects in the world will use BYD, LG and Samsung batteries. CATL also has a competing product winning billions in contracts around the world including in the US. \n\nThings will change because that is the natural course of technology development. Particularly in electronics like grid storage batteries. A new technology is introduced. Supply is low relative to demand and margins are high. Everyone starts to mass produce the same product and that drives supply way up and profit margins down. You see it all the time in batteries, chips, TVs, etc. There’s no moat on grid storage batteries.", "score": 2, "replies": []}]}, {"body": "Just wait until the cheaper sodium ion batteries start entering the market.  That'll be when grid storage can really scale.  CATL, BYD, and a couple of smaller players like HiNa have ask been saying they are getting close to mass production stage on sodium ion.", "score": 1, "replies": []}]}, {"body": "In a few years it might become overcapacity because other Chinese firms start mass producing competitive products", "score": 5, "replies": []}, {"body": "It's not Tesla's anything, it's China's factory that Tesla is merely renting.", "score": 2, "replies": []}]}
{"title": "One of these chips is not like the others… Laying the bull and bear case for NVDA", "selftext": "TLDR at the top.\n\nChicago Bears case:\n1. General market uncertainty. SPY facing resistance\n2. Geopolitical threats in the form of Chinese aggression to Taiwan and sanctions from US\n\nChicago Bulls case:\n1. Most explosive growth of any company, growing revenue and profit almost 20% Q/Q over the past year\n2. Strong future demand, first to market advantage with no immediate threats\n3. The chart and timing of May 22nd earnings. \n4. Shorts can’t help themselves trying to call crash\n\nMy positions:\nJan2025 1000c\nMay 24 950c\n\nThe bear case is self explanatory so I will not go into much detail. \nWe are coming to the end of a massive QE cycle and almost everyone has lost spending power. Money is tight which risks a broad market sell off. I will look for more bank failures home and abroad to signal a short term dump. \n\nA significant threat from China would shake everything TSM touches. Right now we see posturing from the CCP and the occasional show of aggression when the politics call for it, but no signs of imminent invasion yet. \n\nThe bull case is simply bulletproof. Breaking down the above points below: \n\nThe earnings are in. AMD revenue has been flat for 3-4 years and they are supposed to compete with NVDA? They are not in the same league - no one is. NVDA is the only mega cap stock putting up these kind of numbers. Speculation is a bull’s best friend, and the trajectory is unparalleled with this stock. \n\nCryptocurrency mining is not going anywhere, and it just got more expensive to mine after the latest round of BTC halving. More computing power = more revenue for miners and this market competition will intensify. NVDA price seems to correlate with BTC but the crypto mining revenue stream is consistent. The other revenue stream is of course AI applications in which an arms race is taking place. \n\nThe psychology of us ‘investors’ is mostly really stupid, but the buzz matters. This is the only company anyone is excited about. Market makers know this and they know they can fetch a high price when earnings rolls around. The chart is set up for new heights with the dip bought within a week. I plan on holding my jan2025c through earnings. NVDA for the past year has beat the seemingly aggressive expectations it sets for itself. They say 24B revenue this quarter but I think closer to 27B. Let the speculation begin. It will be interesting to see if we get another dip before a significant event like last earnings feb 2024 and GTC meeting March 18. If so, I buy more.\n\nGood luck everyone! Don’t do anything impulsive or regarded and please add your disrespectful bear and bull thoughts in the comments. ", "id": "1chd3ny", "created_utc": 1714537068.0, "score": 15, "upvote_ratio": 0.79, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 47 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Read the bear case... agreed with ur points and didn't bother reading the rest. Wish you luck with ur puts", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thats the joke...", "score": 1, "replies": []}]}]}, {"body": "Everytime I think about how Nvidia is already so expensive I just remember the past 15 years and how all the best of breed tech stuff never failed to make new highs. Nvidia is the king and will be going forward. Everyone wants to own it for a reason.", "score": 2, "replies": [{"body": "if it was 350 id want to own it", "score": 0, "replies": [{"body": "So you think a best in class AI company deserves a future p/e below 15? No wonder you people never make any money.", "score": 3, "replies": [{"body": "actually youre right it should be lower that p/e is way too high", "score": -4, "replies": [{"body": "AAAAHAHAHAHHAHAA", "score": 2, "replies": []}, {"body": "50% dividend yield or don't waste my fucking time amirite?", "score": 2, "replies": []}]}]}]}]}, {"body": "Another post about chip manufacturers? Didn’t they all fall after earnings? No thank you, AMD can and does compete just fine with Nvidia in most markets. I can see nvidias AI chips doing well but every other product is going to take a hit just like the others.", "score": 1, "replies": []}, {"body": "Amd chip is cheaper and better then nvidia bro . Nvidia need to reduce their price and also amd chip need fewer servers \nNvidia going down this week and will go up again next week", "score": -8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I have call for your info bro that i bought on monday and was thinking it will go up and m gona loose if it will go down but reality is reality it will go down\n\nhttps://preview.redd.it/w4oykywlzsxc1.jpeg?width=1284&format=pjpg&auto=webp&s=243548c1e0306e7069bec1a8fd836790dea7b894", "score": -1, "replies": []}]}, {"body": "NVDA is still the leader with the H100 and AMD doesn’t come close, NVDA is also cutting down prices to pull business", "score": 3, "replies": [{"body": "Yes no doubt it is \nBut it will not be forever", "score": -2, "replies": []}]}, {"body": "AMD Cheaper and better? Can't make that claim if no one using it yet", "score": 2, "replies": []}, {"body": "`Amd chip is cheaper and better then nvidia bro`\n\nThis must be why Nvidia has more than 80% of the market share with > 50% overall profit margin.  All the hyperscale tech companies be like \"Amd chip is cheaper and better than nvidia bro, so we should pay 10x the amount for a worser product from Nvidia bro, and buy tons of them!\" and they be like buying all that nvidia shit up bro.  Amd has a 2% overall profit margin because they're better bro.\n\nEdit: Oh, and how many servers does a chip typically need?  😂🤣", "score": 0, "replies": [{"body": "Exactly bro 😂😂😂😂 u didnt get the sarcasm", "score": 1, "replies": [{"body": "Oh, lol 😂", "score": 1, "replies": []}]}]}]}]}
{"title": "JPOW is the center stage figure, but all eyes are real on BOJ", "selftext": "Little known fact: if you borrow currency from Japan, you get to trade on a 20:1 margin.\n\nThis is called the “Japan Carry Trade”.\n\n-Google it for source. Or, go to the more intelligent Reddit forum, r/economics\n\nJapan only lets others loan a firm 20:1 margin, and that’s based on how much they own in your treasury bonds.\n\nGuess what? 20 Trillion comes from the fact that Japan holds around 1 Trillion in US Treasury bonds. If the Yen tips further up, or the interest rate spread between the two tightens in its yield…guess who’s callin’?\n\nMarge. Marge is callin’. Auntie Marge’in’Cawl.\n\nAnd where do you suppose, that 20 Trilly is sitting right now? Bonds? Nooooooo…bonds are boring. And the US Dollar isn’t trustworthy. That money is better Yolo’d on the index funds!\n\nWhat could possibly go wrong! \n\nMaybe, the Yen going Incredible Hulk. And Yen going Hulk, means you have to pay more money than you expected, to buy back the Yen. So if Yen increases a bunch, Stock Market crashes. Global financial crisis. Or, if the US stock market starts to crash enough, MARGIN CALL. Stock market crashes more.\n\nSupposedly, if oil tips up, since the US isn’t in BRICs anymore, that too will affect the Yen.\n\nAll you need to realllly know, is a black swan is on the horizon. JPOW may be able to avoid it with bribery…but if NOT, market will crash bigly. \n\nOTM puts at your own risk, not financial advice.\n\nThe smartest, most regarded shit is on Reddit. Just sayin’.", "id": "1chdb8a", "created_utc": 1714537821.0, "score": 16, "upvote_ratio": 0.73, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1868 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1c8y5gy/its_time_to_short_blackrock_blk/) \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Holee shito", "score": 7, "replies": [{"body": "Hooo reeee shiiit", "score": 5, "replies": []}]}, {"body": "Proof of positions or ban", "score": 4, "replies": []}, {"body": "typical pleb analysis.", "score": 16, "replies": [{"body": "Nothing ever happens", "score": 1, "replies": []}]}, {"body": "True. OP has my regards. This is a well regarded post. I don't want to comment on the likelyhood of a crash crash but Japan Carry Trade is a big deal that avarage retail investor knows nothing about.", "score": 3, "replies": []}, {"body": "Huh?", "score": 3, "replies": []}, {"body": "Yen is *hurt* by oil going up you fool. Japan has no natural energy resources except hydro which was tapped out by the 70s. And *kinda* wind which they won't build because they like looking at mountains too much. \n\nMost likely the yen will drop another 10-20% versus the dollar until that brings up inflation enough for BoJ to stop handing out no-interest loans like megachurch flyers at a South Carolina flea market.\n\nThe Big Mac Index is looking pretty hilarious right now, though. USD and EUR overvalued against almost every other currency. Has to give sometime, doesn't it?", "score": 2, "replies": []}, {"body": "You are insane covered in tinfoil if you think the US or Japan would ever let that happen. Every war or “crisis” that has EVER happened, the market dips 10-20% worst case and comes roaring back. Why would you think tomorrow or this week would be any different?", "score": 4, "replies": []}, {"body": "They brought jpy/usd down not by selling used treasury but some sort of forward contract but I’m sure they’ll be delivering those treasuries soon", "score": 1, "replies": []}, {"body": "A couple of weeks of red and these regards lose their damn minds", "score": 1, "replies": []}, {"body": "Do you you think these high level economist, bond traders, FED officials, and bankers were all born yesterday?", "score": 1, "replies": [{"body": "No, but they’re permabulls. And permabulls always stamp out the voice of the Bear.", "score": 1, "replies": []}]}]}
{"title": "PUTS for Tmmr but not on NVDA and AAPL", "selftext": "Tommorow is feds meeting and Jp is 100 percent going to clown and tell us we might not expect a rate cut in near future or might even say inflationary data that we have right now is scary so in simple terms so fuck your calls. Now here’s where nvda and aapl come into play these bastards are massive inflationary hedge stocks and they always perform well during markets have fear of no interest rates. And best part is so many analysts are increasing their predictions on apple to outperform. And we also have earnings on apple stock on Thursday. At the end of the day what really matters is if you had fun and doesn’t matter if you lost money on random bastard being bullish on apple but you see the key to investing is……………….\n\nGood Night 💤\n", "id": "1chdsaa", "created_utc": 1714539514.0, "score": 6, "upvote_ratio": 0.67, "num_comments": 13, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 6 days ago\n**Total Comments** | 10 | **Previous Best DD** | \n**Account Age** | 10 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Key_Run_4405 believes the Federal Reserve meeting will impact the stock market and suggests that NVDA and AAPL may be hedges against potential rate cuts or inflation. The user also mentions increased analyst predictions for Apple's stock to outperform", "score": 13, "replies": [{"body": "Thanks for the tldr VM ![img](emote|t5_2th52|4271)", "score": 6, "replies": []}, {"body": "Are you trying to copy the best investment advisor on Wall Street?", "score": 2, "replies": [{"body": "Imho total opposite. Buy the calls ma nigggaz. NFA", "score": 1, "replies": []}]}]}, {"body": "All of these SPy shorting posts makes me confident in SPY pumping tomorrow.\n\nAAPL is also a horrible investment right now. I can think of 1000 better ways to hedge against inflation", "score": 7, "replies": []}, {"body": "Amazon poots?", "score": 1, "replies": []}, {"body": "Mate I’ve bought an Amazon strangle (call and put) . Either way I make money with good movement of stock", "score": 1, "replies": [{"body": "Didn’t the stock like not move at all?", "score": 2, "replies": [{"body": "I meant Apple 🤣didn’t realize I wrote Amazon . Waiting for earnings", "score": 2, "replies": []}]}]}, {"body": "Nvdia going down tomorrow \nLook at Amd bro \nThey provide better quality chip at cheaper rates plus they need fewer servers as compared to nvdia \nNvidia will go up next week but this week it will go below $800", "score": 0, "replies": [{"body": "That’s not true at all, AMD is way better value priced, although not as good.", "score": 1, "replies": [{"body": "The point was , its gona go down this week and then back up \nU could have profited", "score": 1, "replies": []}]}]}]}
{"title": "amazon going to pop tommorrow", "selftext": "", "id": "1chekrl", "created_utc": 1714542457.0, "score": 2, "upvote_ratio": 0.53, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 6 hours ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "I love how everytime a buy signal apprars on your chart the stock just drops more", "score": 45, "replies": [{"body": "Buy the dip, then buy the dip, then also buy the dip", "score": 4, "replies": []}]}, {"body": "Amazing DD, I’m going all in", "score": 13, "replies": []}, {"body": "he’s not wrong in that the stock would’ve pumped if it was any other day", "score": 10, "replies": []}, {"body": "Lol", "score": 4, "replies": []}, {"body": "Agreed I have 215 calls 💀", "score": 3, "replies": [{"body": "Amen.", "score": 2, "replies": []}, {"body": "Holding a 195 call", "score": 1, "replies": [{"body": "So you are the one holding my covered call of 195 nice", "score": 1, "replies": [{"body": "Yeah sold & inversed", "score": 1, "replies": []}]}]}]}, {"body": "Amazon to be range bound between 175-180.\n\n  \nThat way every regard who played earnings loses.", "score": 4, "replies": [{"body": "You're a cheery ray of sunshine. ☀️\n\n*checks premarket*\n\nAmzn trading at 177.75. 👀", "score": 2, "replies": [{"body": "I'm hoping by saying it, that it'll be wrong so my puts can print.\n\nThink I'm going to need a favor from papa Powell to have any chance of salvaging this.", "score": 1, "replies": []}]}, {"body": "It still will. Buyers just waiting for fed rate decision watch it end the week higher", "score": 2, "replies": []}]}, {"body": "So my put will print? ![img](emote|t5_2th52|51295)", "score": 2, "replies": []}, {"body": "You know movement is supposed to happen when the bollinger band squeezes, right??", "score": 1, "replies": []}, {"body": "But he was right?", "score": 1, "replies": []}, {"body": "This guys post history is too funny", "score": 1, "replies": []}, {"body": "It’s all priced in. Your forgetting they missed q2 guidance", "score": 0, "replies": []}]}
{"title": "Amazon cost cuts drive operating margin into double digits for first time", "selftext": "[deleted]", "id": "1chgv1l", "created_utc": 1714551574.0, "score": 72, "upvote_ratio": 0.85, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 8 months ago\n**Total Comments** | 6621 | **Previous Best DD** | \n**Account Age** | 8 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "\"We fired a lot of people so we could put more in our own pocket because fuck you poor people\"", "score": 7, "replies": [{"body": "Exactly what's going on", "score": 3, "replies": []}]}, {"body": "These cuts are annoying.\n\nGone are my prime shipping speeds without having to pay for it.\n\nMy free shipping on products bought within 48 hours of another order.\n\nReturns are more stingy.\n\n~~And prices keep going up.\n\nSolution: bring back free shipping for orders over $25", "score": 37, "replies": [{"body": "There’s free shipping for orders over $35 (I think it’s 35?) & you get free shipping on orders added for 24 hours", "score": 10, "replies": [{"body": "Hum... $35, yes.\n\nI don't get that 24 hr thing.\n\nU must b special. :)", "score": 6, "replies": []}]}, {"body": "You’re welcome to stop using amazon", "score": 9, "replies": [{"body": "Oh, yeah! I forgot...\n\nJust dumped $1300 in electronics in my eBay cart, heck yeah! 😁", "score": -3, "replies": []}]}, {"body": "Solution cancel membership ", "score": 12, "replies": []}]}, {"body": "Yay let’s continue to incentivize mega corps who are profitable already to cut more and more jobs", "score": 18, "replies": [{"body": "If you hate making profit you can cashapp me", "score": 5, "replies": []}, {"body": "Maybe if those bums added value to the company they'd still have jobs.", "score": 0, "replies": []}]}, {"body": "It really sucks working for amazon right now", "score": 4, "replies": []}, {"body": "Looks like it's not Day One anymore :(", "score": 2, "replies": []}, {"body": "Death gasps…", "score": -3, "replies": []}]}
{"title": "Tesla...", "selftext": "", "id": "1chhih7", "created_utc": 1714554307.0, "score": 16, "upvote_ratio": 0.83, "num_comments": 10, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "It’s still overrated, too high", "score": 4, "replies": [{"body": "Eh. Fundamentals are overrated. Stocks are a popularity contest", "score": 3, "replies": []}]}, {"body": "schade", "score": 4, "replies": []}, {"body": "https://preview.redd.it/haz6o8eh9txc1.png?width=379&format=png&auto=webp&s=b981a7aadd3d75a8b26c803ebe3c4f8a5f39bf84", "score": 2, "replies": []}, {"body": "Welche App benutzt du?", "score": 1, "replies": [{"body": "Das ist Trade Republic.", "score": 2, "replies": []}]}, {"body": "Why you got commas where the cents period should be.  And the dollar sign in the wrong place. If I read it backwards you still got $37,235.70 🙌🏼", "score": 0, "replies": [{"body": "Yes Japanese reads left to right!", "score": 2, "replies": []}]}]}
{"title": "I’m back with another inflation chart", "selftext": "For those who still believe in rate cuts this year…", "id": "1chmxon", "created_utc": 1714572101.0, "score": 34, "upvote_ratio": 0.85, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 66 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Here's the secret. No one expects rate cuts this year. The question is will JPow say that out loud? If not, doesn't matter.", "score": 25, "replies": [{"body": "Missed opportunity for \"always\\_has\\_been.jpg\". You're absolutely right though.", "score": 3, "replies": []}, {"body": "Nor does everyone expect 2% inflation. Literally no one gives a fuck about reaching 2% except the fucking Fed and Powell who made it a goal. 3% inflation is literally no different. It's out of control inflation (5-10%) that needs to be crushed since consumer expectation of inflation could create a self-reinforcing inflation spiral.", "score": 0, "replies": []}]}, {"body": "Honestly I don't blame the fed, everyone just needs to stop raising prices, if everyone stopped simultaneously the problem would all go away.", "score": 5, "replies": [{"body": "Problem is whole industries are bough by investors who don’t want competition, because they own all the other competitors.\n\nIf blackrock owns 50% of coke, and blackrock owns 50% of Pepsi, and black rock owns 50% of vanguard, and vanguard owns 50% of blackrock…. And they are all telling the ceo to raise prices and stop competing or else they will kick them out and get a new ceo who will follow orders… the problem isn’t going to be fixed until the conflict of interest is fixed.  And because investors essentially own the government, I don’t see that happening any time soon.\n\nThey’ll just cause a crash, buy up the carcasses, pump the economy full of taxpayer money again, rack up the us government debt as far as it goes, then move to Europe when America implodes.\n\nNobody gives a shit about the debt because the only people the debt affects is your average American who cannot jump shit when this country collapses.", "score": 5, "replies": []}, {"body": "I blamed the FED since years for printing so much and helping finance the deficit. Than heli money came and who did not know that this would lead to inflation? JP must retire immediately. He could not prevent us from inflation, he brought us the high rates and he is not aware of the wages prices spiral. He is the most incompetent one on top there ever. I doubt he can prevent recession. That dude is talking about cuts since a year now. Hallo? If the chairman doesn't hear the shot, he's obsolete.", "score": 0, "replies": [{"body": "This. Why tf would you not blame the fed? \n\nTake something as simple as the PPP loan program. You could just apply for a loan and there was little to no verification of whether you actually needed the money. People were getting loans while subsequently laying off their work force. Those loans were then moved around on the balance sheet and often reinvested elsewhere, nothing at all to do with the employment related relief it was supposed to be for.\n\nFed printed money hand over foot to delay a recession we should have had in 2020. We are now getting bent over for these same decisions. Again - why tf wouldn’t you blame the fed.", "score": 3, "replies": []}]}]}, {"body": "The Fed does NOTHING pro-actively, again NOTHING", "score": 3, "replies": []}, {"body": "Market can stay exuberant longer than I can stay solvent\n\nSo, shorts, cuz please let this shit burn to the ground", "score": 1, "replies": []}, {"body": "What if, and hear me out, we're actually about to experience deflation? Would be awfully convenient when everyone is all aboard the stagflation narrative, wouldn't it?", "score": 1, "replies": [{"body": "It's certainly possible. We just need peace in the Middle East and someone to do something about car insurance rates.", "score": 3, "replies": []}]}, {"body": "Executives need to be capped on how much they make. This is the main driver for higher prices.", "score": 0, "replies": []}, {"body": "This graph is bad and you should feel bad", "score": 0, "replies": []}, {"body": "Are we inflating to big gains or sloppy losses? What do??", "score": 0, "replies": []}, {"body": "CPI has some catching up to do.", "score": -1, "replies": []}]}
{"title": "Teachable moment: Don't trust intra-day trends to continue after market close", "selftext": "Exhibit A: Amazon  \n\n\nhttps://preview.redd.it/120d1ty9ptxc1.png?width=1196&format=png&auto=webp&s=0ba234f95c42bbf149b2a4a000f56d0b3710fab1", "id": "1chn87o", "created_utc": 1714572837.0, "score": 20, "upvote_ratio": 0.79, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 28 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Peasants trying to make sense of the ticker? Fascinating.", "score": 22, "replies": []}, {"body": "New, huh?", "score": 6, "replies": [{"body": "Shhh![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}, {"body": "Good ER", "score": 2, "replies": []}, {"body": "Lol.", "score": 2, "replies": []}, {"body": "Probably nothing to do with algorithms making sure most everyone gets fucked out of earnings options right? Earing don't even matter anymore... would be a better teachable moment.", "score": 2, "replies": []}, {"body": "What software is this?", "score": 1, "replies": [{"body": "It's a cutdown version of Trading View", "score": 3, "replies": [{"body": "Thanks good Sir.", "score": 1, "replies": []}]}]}, {"body": "Hey, that’s a good point shared with Amazon's chart! It really highlights how intraday trends can reverse at market close, stressing the importance of caution for those trading on such trends. A solid reminder not to bank solely on the direction seen during the session, as things can shift quickly near the end. Great teachable moment, thanks for sharing!", "score": 1, "replies": []}]}
{"title": "The White Girl index has taken a massive blow", "selftext": "[removed]", "id": "1chpiz2", "created_utc": 1714578706.0, "score": 30, "upvote_ratio": 0.89, "num_comments": 18, "comments": [{"body": "Post was reported for harassment and we had to take it down before RDDT jumps on us.\n\nMaybe repost without the racial undertones?", "score": 1, "replies": []}, {"body": "What happened to calling it the BECKY index?", "score": 22, "replies": [{"body": "racism", "score": 1, "replies": []}]}, {"body": "More like the sugadaddies are tapped out lmao", "score": 6, "replies": [{"body": "They lost all their TSLA gains.", "score": 1, "replies": []}]}, {"body": "Puts on BECKY", "score": 4, "replies": []}, {"body": "this might actually be legitimate analysis.", "score": 3, "replies": [{"body": "I'm sure there is definitely some correlation between Becky's being consumers and buying like good little consumers and the economic state of the country. Seems plausible", "score": 1, "replies": []}]}, {"body": "I'm wondering if CROX fits your criteria.", "score": 3, "replies": [{"body": "Thanks, just bought a put on them.\n\nAny others?", "score": 1, "replies": []}]}, {"body": "AAPL", "score": 3, "replies": []}, {"body": "Maybe PTON, but that's already a pretty ded stock.", "score": 3, "replies": []}, {"body": "This is a psyop for ppl to lose money on etsy puts", "score": 3, "replies": []}, {"body": "I am looking at Home Goods and TJ Max.", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1886 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1c8y5gy/its_time_to_short_blackrock_blk/) \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "BBWI", "score": 1, "replies": []}, {"body": "BECKY index probably includes ELF, ANF and CAVA as well...what about all the weight loss drug makers?", "score": 1, "replies": []}]}
{"title": "More TSLA layoffs", "selftext": "https://finance.yahoo.com/news/elimination-teslas-charging-department-raises-160639130.html\n\nTSLA just gained 1% back 🚀 ", "id": "1chqst5", "created_utc": 1714581823.0, "score": 17, "upvote_ratio": 0.79, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 460 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "do layoffs contribute to stock rising or falling more?", "score": 4, "replies": [{"body": "Yes", "score": 18, "replies": [{"body": "which one?😹", "score": 1, "replies": [{"body": "Absolutely!", "score": 13, "replies": [{"body": "Layoffs are bullish. Less expenses.", "score": 8, "replies": [{"body": "Layoffs are bearish. Less workers to do work stuff.", "score": 5, "replies": [{"body": "typically bullish. not less workers to do work stuff, same amount of work gets done with less people.", "score": 7, "replies": [{"body": "Layoffs bullish. Got it", "score": 1, "replies": []}, {"body": "Normally maybe.\n\nHowever layoffs that fuck up your already crackhead guidance... Probably not.", "score": 1, "replies": []}, {"body": "Not the way Elon does it.  No more Superchargers, no more future EV development, etc", "score": 1, "replies": [{"body": "yeah, yeah, people don't like elon. i know", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "The resson for layoffs is cash burn and unprofibilty right now.", "score": 1, "replies": []}]}, {"body": "A shame for those laid off-- perhaps they will invest their redundancy packages in Tesla stock and retire with yachts and caviar!", "score": 6, "replies": [{"body": "Only if they invest all in TSLA puts.", "score": 3, "replies": []}, {"body": "Tesla has extremely generous 401k and stock options. \n\nWhen I worked for them as a forklift driver many many moons ago, I worked alongside some millionaire forklift guys that you'd never suspect of being millionaires because they were caricatures of what forklift drivers look like lol, all because they had been with the company since it began and their stocks took off.\n\nThat being said everyone at the plant caps out at literally $23 an hour no matter how long you've been there, so yeah...\n\nAlso Elon personally shut down ANY and all attempts to unionize lol.\n\nDuring the first and only attempted actual unionization meeting, Elon walked into the meeting room, told the workers/lawyers gathered there \"Tesla will never be union as long as I'm in charge. I can't achieve my goal unless I have total control\" (actual quote) and walked out without giving anyone a chance to say anything haha.\n\nI miss that goofy fuck.", "score": 6, "replies": [{"body": "I’m gonna be real with you, if I became a millionaire from driving a forklift, my desire to unionize and change the status quo would be near zero.", "score": 10, "replies": [{"body": "they didn’t become a millionaire from driving a forklift, i will not elaborate, brush up your reading lil bro", "score": -7, "replies": []}]}]}, {"body": "Business plan for every Tesla employee:\nStep 1: Get accepted to Tesla\nStep 2: Get fired due to layoffs\nStep 3: …\nStep 4: Profit", "score": 2, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1chrpjl", "created_utc": 1714584037.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 248 | **Previous Best DD** | \n**Account Age** | 3 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Green apples are for those who enjoy a tart twist to their wealth.", "score": 1, "replies": []}, {"body": "The red apples is yummier", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If its above 2.5 then I round it up to 3.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Not here to argue math with you professor. I'm going to stop posting. I always get some dickhead like you responding to my post in a nasty way.", "score": 1, "replies": []}]}]}]}, {"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "This is not how WSB works.  \n\n*You* do the research.  \n\n*You* make a bet.\n\n*You* share the bet with your reasoning.\n\nDont come here and shit the place up by begging for tips.", "score": 0, "replies": [{"body": "I did make a bet. I said I'm holding calls and I believe its heading to $180. You're being a dick for no reason.", "score": 1, "replies": [{"body": "I'm being a dick because you continually make low effort and off-topic posts.\n\nWhere's your bet, your actual positions?", "score": 0, "replies": [{"body": "My apologies but this is WSB and you're acting like I'm a financial advisor who should be writing 2 page long articles so you can get  investment ideas from.", "score": 1, "replies": [{"body": "The B stands for bets.... Start there.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "All my savings on ZYNs $PM", "selftext": "i’ve got two upper deckys in right now and room for more 📈", "id": "1chrucd", "created_utc": 1714584356.0, "score": 13, "upvote_ratio": 0.78, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 10 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "ZYN stock is a terrible investment. It will be fun to watch the poor lose their money.", "score": 11, "replies": [{"body": "you obviously haven’t had an upper decky before ![img](emote|t5_2th52|4275)", "score": 10, "replies": [{"body": "Bro needs a post meal Zyn to understand", "score": 5, "replies": []}]}]}, {"body": "Brown v. Board of Educazyn", "score": 5, "replies": []}, {"body": "Why now?", "score": 2, "replies": [{"body": "the chart’s pointing towards it and the fundamentals are there. ZYN sales are through the roof and expected to grow. Also, Philip Morris just got the green light to launch iQOS in the united states. type in the word zyn on any social media search ![img](emote|t5_2th52|29637)", "score": 2, "replies": [{"body": "Zyn sounds like a fad, like pet rocks or bell-bottoms. My money's on מרלבורו.", "score": 6, "replies": []}, {"body": "Upper deckys are fuckin legit bro no argument there. Just was wondering if there was a catalyst", "score": 4, "replies": [{"body": "https://finance.yahoo.com/news/4-days-philip-morris-stock-200000589.html", "score": 0, "replies": []}]}]}]}, {"body": "Dude it’s expiring soon. I would take a profit and get back in with the profit. Save your initial investment.", "score": 2, "replies": [{"body": "hes down $2.5k", "score": 1, "replies": [{"body": "Lmao I didn’t see total return. Rip OP.", "score": 1, "replies": []}]}]}, {"body": "i can’t believe this post doesn’t have more upvotes. this is degen as fuck hope\nyou make a killing (literally)", "score": 2, "replies": []}, {"body": "Oh lord started playing this a month ago with shares but seeing as how WSB regards are posting about it it’s probably time to sell thanks guy", "score": 1, "replies": [{"body": "that would have been a mistake ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "I don’t feel anything when I take zyn. Just burning… don’t understand it. Where is the head high?", "score": 1, "replies": []}, {"body": "quick 2x, good stuff! I’m in big on sept 110c and 115c", "score": 1, "replies": []}]}
{"title": "VIX and VVIX seems to suggest Fed’s decision is priced in", "selftext": "VIX and VVIX elevated a bit prior to the FOMC meeting but they seem to indicate the market has already priced in the decision of keeping the rate steady.\n\nWhat are your thoughts?", "id": "1chsgcp", "created_utc": 1714585880.0, "score": 12, "upvote_ratio": 0.71, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 19 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Wow they priced in something they have see as a 97.5% probability who would’ve thought", "score": 30, "replies": []}, {"body": "Poor people thoughts don't concern me.", "score": 19, "replies": []}, {"body": "fed futures rate' priced it in long time ago so the bond market/equities market did the same...", "score": 3, "replies": []}, {"body": "I hoped for a slip up or no rate hikes this year. \n\nShould have known it would be it's all according to plan. We are confident and if data shows we will consider a rate hike but it's all good fuck off.", "score": 2, "replies": []}, {"body": "This didn’t age well", "score": 1, "replies": []}, {"body": "The DXY is a better indicator than the VIX", "score": 1, "replies": [{"body": "What’s your read based on DXY?", "score": 1, "replies": [{"body": "The higher it goes, the more inflation builds. But the lower, the more inflation unwinds. I should have said, it’s another indicator to watch if you think the VIX is being manipulated.", "score": 1, "replies": []}]}]}, {"body": "There’s some weird values on Vvix that showed up on the april 30th on tradingview. Massive pop that shows up nowhere on VIX", "score": 1, "replies": []}, {"body": "Vix is controlled now. It shows nothing", "score": -1, "replies": [{"body": "Only that the preferred are clothed in bubble wrap, waiting for the big POP! Long puts!!", "score": 1, "replies": []}]}]}
{"title": "FOMC meeting summary by ChatGPT", "selftext": "[removed]", "id": "1cht9uo", "created_utc": 1714587811.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 7 months ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Ah yes, the Federal Reserve, ever so cautious with their tight grip on the market's throat. Sounds like this summary could put a few retail investors to sleep, boring but necessary.", "score": 3, "replies": [{"body": "the Fed's job isn't to froth up the market.", "score": 2, "replies": []}]}, {"body": "Stick with poots. Companies are getting a kick back with ghost job posts and skewing the employment numbers, while price gouging. J Powell will continue to drive the US economy in the toilet until Biden loses the election.", "score": 2, "replies": []}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "AI judging AI. Wasted resources. Uranium to the moon.", "score": 3, "replies": [{"body": "**VM attempted to say something likely TOS-breaking, violent, or reportable.**", "score": 2, "replies": [{"body": "Must have taken that one personally. Can we get that uprising started sometime before my SPY PUTS expire today?", "score": 1, "replies": []}]}]}]}, {"body": "So spy back to 430 by summer?", "score": 1, "replies": []}]}
{"title": "Ppl say Jpow gonna hawk I say dove and there you have it hope you enjoyed gains SPY green!", "selftext": "[removed]", "id": "1chtqej", "created_utc": 1714588923.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 14, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "What’s the next play senpai?", "score": 3, "replies": []}, {"body": "Thank you dude! I've been following you and so far you were right all the fucking time! Can't wait for your next tip and definitely not financial advice", "score": 2, "replies": [{"body": "PUT YOUR HANDS UP Difficult-Bread-3321!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "What about tomorrow? Up or down?", "score": 2, "replies": []}, {"body": "$508 tomorrow👀regard ish man", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 899 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "\"Go buy a boat!\"", "score": 1, "replies": []}, {"body": "Nice gains for me too!", "score": 1, "replies": [{"body": "I wish I held longer whoaaaaa", "score": 2, "replies": [{"body": "Me too lmao", "score": 1, "replies": []}]}]}, {"body": "Dead cat bounce ", "score": 1, "replies": []}, {"body": "They don't call him fyoo puts Jpow  for nothing ..bears gona extinct for real like this ..", "score": 1, "replies": []}]}
{"title": "AI corrections ", "selftext": "[removed]", "id": "1chvc7j", "created_utc": 1714592826.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 13, "comments": [{"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 1, "replies": []}, {"body": "I agree with you, and the so called commercial applications seem to make even less sense than just someone using Chat GPT. For example, assistance on Amazon with shopping. Really? Just let me search, I am not using a chat bot for that.", "score": 5, "replies": [{"body": "You REALLY THINK that AI just means a chatbot? that is .01% of AI capability. small minded people.", "score": 1, "replies": []}]}, {"body": "AI is the same bullshit as Tesla FSD/Waymo were a few years ago. \n\nHuge amount of promises and optimism, but the only winner is Nvdia right now selling their chips. In about 2 years, the limitations of AI and LLM will become apparently to even the most regarded investor and the next bubble will take over.", "score": 4, "replies": []}, {"body": "AI is a load of shit. You're correct in your evaluation. Rest of the collective thinks image Gen and answers vs. Search results is something to get horny over. Fucking lames.", "score": 4, "replies": [{"body": "what you dont realize the public exposure to AI has been \"fun\" features that are like 1% of the capabilities.", "score": 0, "replies": [{"body": "✋️ cut that bullshit out. You sound just like crypto", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 13 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Hm the accuracy of the response depends on the user's knowledge of the topic. Wtf are you talking about?", "score": 1, "replies": []}, {"body": "The AI bubble startet poppig. Look at NVDA, Meta, AMD, INTL...\nIm bearish and positioned.\nIt'll not take a year to unwind. It's going faster I think.", "score": 1, "replies": []}, {"body": "https://www.euronews.com/next/2024/02/28/klarnas-ai-bot-is-doing-the-work-of-700-employees-what-will-happen-to-their-jobs", "score": 0, "replies": []}, {"body": "[removed]", "score": -1, "replies": [{"body": "I think NVIDIA will remain stronger for significant time, because they are at the bottom of the AI foodchain.", "score": 1, "replies": []}]}]}
{"title": "Tesla Lays Off Entire Supercharger Team in Midnight Purge", "selftext": "[removed]", "id": "1chxof4", "created_utc": 1714598606.0, "score": 18, "upvote_ratio": 0.82, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "I guess I should buy some puts.", "score": 8, "replies": [{"body": "Straddle. Every time TSLA should go down it goes up.", "score": 6, "replies": []}, {"body": "Supercharger network > any other EV network currently + they cut costs significantly \nThis may be bull behaviour", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4258)![img](emote|t5_2th52|8882)", "score": 2, "replies": []}]}, {"body": ">**...as well as the lead for new products**\n\nYeah, everything normal here, nothing to see", "score": 2, "replies": []}, {"body": "Elon knows best. Lower the headcount, increase the profit.", "score": 5, "replies": [{"body": "gpreeeeee servicing enron muskkkie:\n\nhttps://preview.redd.it/76iazqwgvvxc1.jpeg?width=472&format=pjpg&auto=webp&s=23b2c45dbcc9d1c65714e399799ddb96a402c1a8", "score": 5, "replies": []}]}, {"body": "tesla robots took their job sad af", "score": 1, "replies": []}, {"body": "Supercharge not fast enough. Need Gigachargers. ", "score": 1, "replies": []}, {"body": "Well there was no loss of talent there based off my experience with charging locations.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1chykv5", "created_utc": 1714600757.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 15, "comments": [{"body": "I've seen a flood of peasants selling their kidneys for a quick buck to keep up with their margin calls. Absolutely pathetic.", "score": 7, "replies": [{"body": "Damn thats crazy, off to a good start here\n\nMaybe ai is helping spy go to 300 instead of 600 eoy tho", "score": 1, "replies": []}]}, {"body": "It’s coming eventually but J POW has figured out some epic new trick and we’re about to ride this rocket to the moon for about 5-10 more years.  That’s my prediction and I’m sticking to it.  Major depression likely after that but I think SPY will hit 50,000 in 10 years", "score": 2, "replies": [{"body": "You’re regarded", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 5 years ago\n**Total Comments** | 485 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "bro trust me!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Vmod wannabe", "score": 1, "replies": []}]}, {"body": "Recession is coming this year. We’ve never had peak markets with peak rates without a recession following ever. But who knows, I’m struggling because I’m regarded ![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "But are rates really peak? Historical average the last what 50 yrs is less than 1% below where we currently are. We are used to historically low rates the last 20yrs but go back 20 more and things seem pretty damn good. So anything approaching average rates seem high.", "score": 1, "replies": [{"body": "When debt levels are this high, rates are at the peak. Business debt, auto loan and credit card debt are at scary levels and he knows it", "score": 1, "replies": []}, {"body": "Can’t reduce rates yet either because inflation is still crazy", "score": 1, "replies": [{"body": "But again, compared to recent time yes, but inflation still isn’t that crazy historically. I’m not trying to be argumentative. I’m myself trying to rationalize how this will play out and are we in the regression to the mean, but the mean is not going to be that of the last decade. But that of the last 10 decades.", "score": 1, "replies": [{"body": "Maybe I’m just regarded then bro", "score": 1, "replies": [{"body": "No you aren’t wrong, I’m just afraid the relief people expect to get from returning to the last 15yrs of record low interest rates (to try to keep growth from stagnating) and record low inflation (thanks largely to offshoring and cheap good from China offsetting cost increases and wage growth inflation in the western world) is not a reality. The reality is living with mortgage rates around 5-6% and inflation at around 3-3.5%. 2% was the goal when inflation (and therefore growth) was stubbornly low and the central banks struggled to get to it much less over it.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thanks for your submission! \n\nr/WallStreetBets is known for making absurd but sometimes profitable trades that no one ever considered possible.\n\nTo keep making that possible, we need your help in keeping the feed of threads interesting and exciting.\n\nWe try to move all the short and basic questions, analysis, or jokes to the daily thread so that the best quality content can stick around and be more visible. \n\nThis is definitely a bit subjective, and there are no hard and fast rules, but a few indicators that your post should have really been a comment in the daily thread include:\n\n* Asking a question that is easily googleable or has likely been asked before. E.g. \"What app should I use?\", \"What should I invest in?\". \n\n* Beating a meme to death, like the 10 millionth, \"inverse cramer\" joke again. \n\n* Reposting jokes from the front page but slightly altered to be related to trading. \n\n---\n\nAll that being said, we are here to help. We want to make it as easy as possible for you to post to our community. We have to balance this with making the subreddit interesting for our readers. \n\nIf you need some guidance, don't hesitate to [reach out to modmail](https://old.reddit.com/message/compose/?to=/r/wallstreetbets) and we'll give you some pointers!", "score": 0, "replies": []}]}
{"title": "Great win from today", "selftext": "Bought SBUX puts, total investment was $168, came out over 1800%! Only wish i have right is is that i bought more\n\nFIRST ever puts i’ve bought!\n\n", "id": "1chzpul", "created_utc": 1714603512.0, "score": 75, "upvote_ratio": 0.93, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/2k5b5nblawxc1.jpeg?width=1290&format=pjpg&auto=webp&s=6f3ca6b7d11a676dd307c8287ff788a2676443a0\n\nDo you think I could be as lucky as you by Friday? 🥲", "score": 9, "replies": [{"body": "To bad, options aren't allowed in my country...so I xan't buy puts![img](emote|t5_2th52|4260)", "score": 2, "replies": [{"body": "What country?", "score": 1, "replies": [{"body": "a country in europe..In europe options are banned", "score": 1, "replies": []}]}]}, {"body": "when did you buy it? it was above 184 today.", "score": 1, "replies": [{"body": "180 leg was bought first thing this morning and another one was bought prior to ER (IV crushed) 😭", "score": 1, "replies": [{"body": "even with the IV crush i think did you hold?", "score": 1, "replies": []}]}]}]}, {"body": "Congrats and I hate you.\n\nI had SPY calls today betting market up after JPow and got liquidated at $330 profit instead of $1500. Lame. If only IB’s liquidation window was 60 minutes instead of 150 minutes.\n\nSPX from now on.", "score": 4, "replies": [{"body": "Bro same exact thing happened to me today as well, except i lost around $130. Funny enough, my friend told me about SBUX and didn’t get in himself because he got called into a meeting", "score": 5, "replies": [{"body": "Wish I had a friend who told me about SBUX 😔", "score": 2, "replies": []}, {"body": "What is your friend to you about sbux? What made you go into it?", "score": 1, "replies": []}]}]}, {"body": "Hope you sold", "score": 5, "replies": [{"body": "Definitely did, secured that profit of $3,120", "score": 15, "replies": [{"body": "Happy for you. Congrats", "score": 5, "replies": []}]}]}, {"body": "Those $75 strike puts were only $4 dollars yesterday and went as high as $250 today... Man that was a lotto play.", "score": 3, "replies": []}, {"body": "if I keep slamming my head against the wall, one day I too will win", "score": 3, "replies": []}, {"body": "Noice", "score": 2, "replies": []}, {"body": "Gj brother", "score": 1, "replies": []}, {"body": "congrats on that impressive first-time win with SBUX puts! Scoring over 1800% is no small feat. It's tempting to think about what could have been if you bought more, but it's also crucial to manage risk and not get too carried away, especially when you're just starting. Always cool to see someone nail it right out of the gate! If you're looking for tips on how to keep up this momentum or learn more about options trading, feel free to hit me up. Keep riding that wave, but stay cautious!", "score": -1, "replies": []}]}
