{"title": "RIP $TSLA Shorters. Is this even legal? lol", "selftext": "", "id": "8ru2kj", "created_utc": 1529269869.0, "score": 965, "upvote_ratio": 0.97, "num_comments": 188, "comments": [{"body": "Lmao, “P.S. not investment advice (or is it😉)” - Elon", "score": 428, "replies": [{"body": "I was about to reduce my position too because I was starting to think he was losing it. Losing his woman to jack sparrow was just too much.", "score": 139, "replies": [{"body": "It was the other way around..", "score": 66, "replies": [{"body": "He lost his Jack sparrow to a woman?", "score": 157, "replies": [{"body": "Elons Gay? I knew it.", "score": 30, "replies": [{"body": "Everybody's gay for Jack. ", "score": 4, "replies": []}]}]}]}, {"body": "Pretty sure he swindled the butt pirate", "score": 18, "replies": []}]}]}, {"body": "Aight. Buying tesla calls", "score": 235, "replies": [{"body": "U 8 the B8 M8", "score": 115, "replies": []}, {"body": "How do I buy more calls when I've already yoloed all my savings into options? Should I sell and buy more out of the money options?", "score": 14, "replies": [{"body": "L E V E R A G E", "score": 27, "replies": []}, {"body": "That's why he said 3 weeks. That'll be at least one pay period that you can totally put into calls. Sure, rent will be late, but you can pay them once your totally-guaranteed investment pays off.", "score": 17, "replies": [{"body": "Use a payday loan to get in sooner", "score": 16, "replies": [{"body": "Why not both?", "score": 7, "replies": []}]}]}]}]}, {"body": "Short squeeze to 500 then print more stock. Shorts basically financing Tesla dream.\n\nElon is a genius", "score": 139, "replies": [{"body": "Reading this literally sent me about 6 points higher onto the spectrum", "score": 94, "replies": [{"body": "The autism spectrum?", "score": 10, "replies": [{"body": "No the UK telecom provider Spectrum.", "score": 39, "replies": [{"body": "US has that too ", "score": 5, "replies": []}, {"body": "That's even worse! (At least the US version of Spectrum)", "score": 2, "replies": []}, {"body": "I love it.", "score": 1, "replies": []}]}]}]}, {"body": "Who would buy?  The last time he needed the stock price higher due to lending covenants, he had to buy the shares on margin himself.  In a super illiquid market.  Forcing the price a bunch higher, forcing option market makers to cover their deltas on he open.\n\nHe doesn't seem to have much rope left in terms of financing.  2018 will likely be remembered for how this implodes and the spillover to other trendy techs.  That NASDAQ... ", "score": -7, "replies": [{"body": "[You](https://www.youtube.com/watch?v=0OnpkDWbeJs)", "score": 6, "replies": [{"body": "It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they're easier for our sausage fingers to click!\n\n\n[Here is link number 1](https://www.youtube.com/watch?v=0OnpkDWbeJs) - Previous text \"You\"\n\n\n\n----\n^Please ^PM ^/u/eganwall ^with ^issues ^or ^feedback! ^| ^[Delete](https://reddit.com/message/compose/?to=FatFingerHelperBot&subject=delete&message=delete%20e0v7a5y)\n", "score": 4, "replies": []}]}]}]}, {"body": "[Lol](https://twitter.com/elonmusk/status/1008445446975512576)", "score": 104, "replies": [{"body": "a true intellectual ", "score": 76, "replies": [{"body": "250 IQ", "score": 37, "replies": []}]}, {"body": "Ok time to cash in", "score": 26, "replies": []}]}, {"body": "[deleted]", "score": 67, "replies": [{"body": "Tesla could go to 900 one week and then to 100 a month later.\n\nThe premiums for options are insane, but as volatile as this shit is, you are likely to make money.", "score": 53, "replies": [{"body": "[deleted]", "score": 37, "replies": [{"body": "Exactly.\n\nEveryone knows there is a good chance that we see a huge short squeeze.\n\nBut also everyone knows that sometime people will end up realizing that Tesla is nowhere worth as much as GM or Ford. \n\n", "score": 25, "replies": [{"body": "That a car company producing 6.6 million vehicles and 156 billion in revenue last year....is somehow held in the same stratosphere as tesla....", "score": 34, "replies": [{"body": "Do yourself a favor and dont try to rationalize and calculate the intrinsic value of having the monster dong of Elon on your board", "score": 41, "replies": [{"body": "That a tent set up outside of a real factory...housing a full 1/3 of a company's manufacturing capability,  could convince anyone in said company's prospect of future profotability....so many things defying logic...the warping of gravity orbiting musks balls must be the reason...", "score": 26, "replies": [{"body": "You're mistaken\n\nThe tent to hide Elon's massive erection he's pitching from squeezing the shorts", "score": 21, "replies": []}, {"body": "I don't see a problem with the tent like structure. You can bet they'll build a permanent structure around the line in short order. Production priorities trump all.", "score": 16, "replies": []}]}]}, {"body": "GM and Ford are nothing special... no other car manufacturer is currently capable of what Tesla is doing right now - that is what makes Tesla valuable, and its speculation.\n\nUntil they have real EV competition or go bust, their value seems reasonable.", "score": 9, "replies": [{"body": "What is this capability you speak of?  Raise capital?", "score": 13, "replies": [{"body": "No, burn through capital.", "score": 28, "replies": []}, {"body": "Make EVs 100,000s put deposits on and waited two years to buy. ", "score": 3, "replies": []}]}, {"body": "What is Tesla doing other car manufacturers aren’t capable of? Mismatching paint? Forgetting to install fender liners? Having panel gaps big enough to fingerbang? Of all traditional automakers freaking Jaguar is looking to give them a run for their money. Jaguar, once a product of British Leyland and now a part of Tata Motors ain’t exactly the bastion of reliability. But at least they have an existing post sales support network, and don’t market level 2 automation as an autopilot or self driving system.", "score": 12, "replies": [{"body": "They're making batteries. The gigafactory is about batteries, not cars. To compete with tesla in evs large companies are going to have to buy batteries from samsung, or make their own. To compete with tesla and fulfill the battery needs of, say, Ford... samsung or ford will need a gigafactory. ", "score": 6, "replies": [{"body": "You do realize that Telsa buys batteries from Panasonic right? Something that Toyota is doing now too. \n\nThey just assemble them in the gigafactory lol. ", "score": 6, "replies": [{"body": "You do realize that Panasonic is investing $1.6 billion into the gigafactory and making batteries there... and operating at a loss right now. They're not just \"assembling\" them at the gigafactory LOL. The point of a ridiculously large factory is to lower operational costs by cutting out transportation between smaller factories. But Tesla still owns the factory. The point stands, tesla's nut is batteries, not cars. They're just getting a leg up in a huge industry while also giving people a fun toy product to get their hands on for good pr. Battery farms to level peak power spikes basically print money. Spread out across homes and paid for by consumers and you're talking about a large brick you sell to people that prints money. It also makes huge strides towards actually fixing a global problem. It's also paramount to have this process started as solar gets more and more efficient. Also, 10 years down the road there's a breakthrough in battery tech? No problem, we have a gigafactory to make them located in the second largest energy consuming country in the world. ", "score": 2, "replies": []}, {"body": "and not even good batteries at that, just repackaged 18650 pieces of shit. space utilization on those is complete crap. If they had a clue they would do something like AAPL does with laptop batteries, custom made to fit a certain space with near 100% fill factor. ", "score": 1, "replies": [{"body": "Yeah. I know people who work/ have worked in the gigafactory. I lol everytime someone says that Telsa's true value is in the batteries they make. \n\nShow's how good Elon is at PR and Marketing.  ", "score": 3, "replies": []}, {"body": "You should probably do some research before talking out your ass. Nothing is wrong with 18650s. The new 2170s aren't leagues & bounds better. Pouch cells are inferior. This is the best we have right now.", "score": 1, "replies": []}]}]}, {"body": "Gigafactory 2 is near where I live. If the car battery Gigafactory 1 is anything like that, Tesla has no idea what they're doing and Panasonic is running the whole show. I don't doubt the traditional automakers who are much better with not throwing suppliers under the bus will be able to figure that out. Panasonic isn't the only battery manufacturer and Tesla doesn't have a lock on them anyway.", "score": 1, "replies": [{"body": "Could you elaborate? I'm really interested in this. \n\nAnd even still, I don't see an issue there, really. Tesla and Panasonic are investing almost the same amount of money into it but Panasonic has the battery building experience, they should be running the show. Tesla still owns the factory. ", "score": 1, "replies": [{"body": "Basically the state owns the building and gave mega tax breaks to Tesla to occupy it. Tesla subcontracts all of the work to Panasonic because like the automobiles, they’re pretty chaotic and don’t know their asshole from a hole in the ground. Tesla is basically a rent seeker. They’re basically a middleman between government subsidies and the people who actually make stuff.", "score": 1, "replies": [{"body": "But tesla owns gigafactory 1, right? New York just already had the spot scouted as a clean energy business incubation center so it must have made everyone happy to put tesla and Panasonic there.", "score": 1, "replies": [{"body": "Ehhh. It’s been a dilapidated factory for a long time. It was supposed to be Silevo, they went bankrupt, then SolarCity, which basically went bankrupt, now Tesla, which is also in financial trouble. Andrew Cuomo threw money at Musk because it was cool, and he’s a financial idiot. They gave Tesla $750M in subsidies more or less up front. Tesla has 10 years to hire 5000 employees. Each year they miss hiring goals they get fined $41M or something. They make out like bandits. And they pay the people in Fremont shit which is a more expensive area to live. Not sure if it’s true, but in one of the threads on /r/buffalo a guy said after a few months of dicking him around in the hiring process they offered him $14 an hour.\n\n$750M would have been better spent on basically anything else. We have a local solar company that does good work and affordable installations. People in Buffalo won’t be able to afford his fancy integrated roof solar setups anytime in the near future. That money could have been spent so much better for the region. Nah, we’ll just give it to the cool tech bro.\n\nI mean the state owns the facility so if Tesla screws up, they can boot them for someone else. But even more money would need to be spent to retool the place.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Mass producing EVs maybe? Yeah, the QC suffered in the initial Model 3 deliveries. No surprise there. You should never buy a brand new model vehicle and expect it to be perfect, especially from Tesla. Not to mention their well-established charger network that is free to many current owners. Good luck to any other manufacturer catching up in that regard - will be years before any of them are even close to what Tesla has today. Autopilot is not marketed as self driving - FSD is, which does not yet exist. I love how aggressive Tesla has been with pushing Autopilot features. A few dumbasses got killed - so fucking what. Natural selection. I've driven thousands of miles with Autopilot and love it. The pussy shit other manufacturers are pushing doesn't come close. Shittilac's supercruise feature is useless outside of their mapped highways, and you have an ugly ass IR camera strip on the steering wheel monitoring your damn eyes the whole time - talk about amateur hour for aesthetic implementation. No fucking thank you.", "score": 0, "replies": [{"body": "Do you know why they put a camera to monitor your eyes? To make sure you're paying attention. Tesla has advertised their system as being basically hands free and keeps backpedaling. No one should ever die on mountain roads if the designer just made the speed limit super low. They know people will abuse it so they put guard rails up. Screwdrivers aren't supposed to be used to pry open cans of paint but people commonly misuse them for that purpose, so it's designed in. Tesla's autopilot design is negligent.\n\nAnd making a theoretical 3000 vehicles a week out of a factory that was capable of 6000 a week 10 years ago hardly counts as mass production in terms of automobiles. Ford made 6.6M vehicles last year. Tesla did what, like 100K? They'll run out of money before they ever become a mass market automaker.", "score": 1, "replies": []}, {"body": ">Autopilot is not marketed as self driving\n\nSelf steering and trajectory. Literally the definition of the word Autopilot. ", "score": 1, "replies": [{"body": "The definition of the word is irrelevant... this is a branded feature.", "score": 0, "replies": []}]}]}]}]}, {"body": "Yeah the reason you keep losing money on tsla is because you think it’s just a car company. It’s also a fucks your wife while you watch company. ", "score": 5, "replies": []}, {"body": "This is about the future.  Tesla hasn't even started to scale internationally, and it's not just a car company.  K? ", "score": 1, "replies": []}]}]}, {"body": "use a spread", "score": 8, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "for you to search for an options calculator and look for something that looks like an acceptable risk/return for you tomorrow when markets open and options have a current price assigned. I can easily see tesla passing 400 this year though", "score": 17, "replies": []}, {"body": "your butthole. spread it. ", "score": 1, "replies": []}]}]}]}, {"body": "So wait until after the shorts have to cover, *then* short?", "score": 0, "replies": [{"body": "So, just catch the rising knife!", "score": 2, "replies": []}, {"body": "Reasonable to me.", "score": 1, "replies": []}]}]}, {"body": "U can calculate (estimate) it. 30% short ratio on 120mil shares floating... about 40 million shares need to be purchased asap to minimize losses all them negative nancys picked up. \n@370 per share that'd cost around $15B. \nIf 15B was pumped into tsla, we're looking at 77B total market cap... around 24% increase from current price. ---> target $460\nYolo", "score": 1, "replies": [{"body": "Wow that got me going. At what point will they cover though I guess is the real question ", "score": 1, "replies": [{"body": "Elon said 3 weeks lol", "score": 1, "replies": []}]}]}]}, {"body": "Elon is bluffing watch him ask for $10 billion in financing at end of the year", "score": 368, "replies": [{"body": "I expect this", "score": 133, "replies": []}, {"body": "He's definitely going to ask for financing, he has to, that doesn't mean he's bluffing. \n\nThe share price is going to go up and fuck shorts, that's the whole point of all of this, he needs to run the price up before he asks for financing.", "score": 153, "replies": [{"body": "of course he is doing what he has to do but as soon as he does it will drop and a lot of people will be mad.", "score": 28, "replies": [{"body": "By the time he asks for financing model 3 will be pumping out legit numbers, it won’t even matter. ", "score": 36, "replies": [{"body": "well thats the question of the century ", "score": 80, "replies": [{"body": "I don't really think it is. Elon virtually always comes through... just years late and hundreds of millions or billions over budget. But in the end, it works out and makes money.\n\nTesla, if they just stop and sit on the model 3 for a while, will be profitable. Put the rest of their plans off an extra quarter or four to solidify profitability once they have it- no accounting gimmicks, no unsustainable overtime, no pulling people from profitable production lines. Just sustainable model 3 $$.\n\nThey just have to literally survive as a company long enough to have that happen. If I were private equity, I'd be excited to invest the last billion or two Tesla might need before they turn profitable.\n\nAnd it seems like Musk is serious about being profitable now. He won't say \"eh close enough, now onto something even cooler\" before they actually make money.\n\nedit: oh yeah but you were saying the question is if he'd be hitting good numbers by the time he asks for more financing. Yeah that's a big question...", "score": 21, "replies": [{"body": ">  He won't say \"eh close enough, now onto something even cooler\" before they actually make money.\n\ni dunno thats what I am afraid of", "score": 14, "replies": [{"body": "It's possible I suppose, but I think investors and everyone has made it like stone-cold clear that Tesla *has* to be profitable.\n\nBut yeah, maybe he hits 5k/week and thinks \"hey look at that number, that's the number I said I'd hit a year ago, that's all investors care about right? neato time to go launch a semi into space\" please Elon no I love you but get your head like a few inches further out of your ass", "score": 8, "replies": [{"body": "I agree, this does seem possible.", "score": 5, "replies": [{"body": "How do you decide what comments to agree on? Do you just hit the \"random subreddit\" button and click on a random thread?", "score": 8, "replies": [{"body": "I agree (in sharing curiosity in this process).", "score": 1, "replies": []}]}]}]}]}, {"body": "This could have been repeated for the past 6 years. ", "score": 2, "replies": [{"body": "Literally yes", "score": 1, "replies": []}]}, {"body": "> it works out and makes money.\n\nLOL... as if anything he has his hands in has ever made money", "score": 2, "replies": [{"body": "If you break down sections of Tesla, they do. Not the company as a whole, but that's the point- if he would have just stopped after the Roadster, or stopped after the S, or whatever, Tesla would have been/is profitable. I'm 90% sure that currently applies to the X too.\n\nTesla just keeps shoving profits back into R&D, which they're going to keep doing. I don't expect Tesla to be more than $1 profitable, or even necessarily sustain profitability at any point during the next 10 years or more. And I think that's clear to most investors?\n\nBut it seems like they want Musk to show he's capable of hitting that profit point- as a proof-of-concept almost? To show it can be done and that *he* can do it?\n\nEither way, I think it's clearly possible. Yeah, he's hemorrhaged money, but it's been intentional, and those losses have been eliminated over time. Things like the buyback insurance Tesla issued for its first few years, right? Hundreds of millions in liability that Tesla was almost certainly going to face. They dropped that massive liability off their unofficial numbers, which was misleading and deceitful, but only to a point- they don't offer that anymore, and it's a singular liability now- one that only shrinks over time.\n\nYeah anyway. Production lines are profitable. To look just at the company's bottom line is myopic, though I think it is a good idea for Musk to prove Tesla can be profitable and to prove that he's able to restrain himself when necessary and make those kinds of decisions.", "score": 5, "replies": []}, {"body": "Paypal.", "score": 3, "replies": []}]}]}]}, {"body": "Model 3 is a catch 22. On the one hand by not building them, he looks incompetent. On the other hand, the more exposure the Model 3 gets, the more people can see what a shoddy troublesome product it actually is. ", "score": 4, "replies": []}]}]}]}, {"body": "He's going to ask for financing after proving Q3/Q4 has positive cash flow and net income\n\nsomething something hyper growth", "score": 18, "replies": [{"body": "If that’s the case, TSLA will be a lot higher than it is now, and people will be lining up to give him money.\n\n", "score": 10, "replies": []}]}, {"body": "Who needs financing when you can just surf the waves of volatility that you create?", "score": 3, "replies": []}, {"body": "He said no additional financing will be required, plus profitability second half of this year. Let's see", "score": 2, "replies": [{"body": "thats what you suppose to say before you ask for more financing ", "score": 6, "replies": []}]}, {"body": "Probably. Whenever your CEO makes a statement other than \"we don't care about short term stock price moves because we're building a long term business\", it's a red flag.\n\nDown in pre-market right now", "score": 1, "replies": []}]}, {"body": "Musk does this so often too.  I remember last time when everyone and their grandma was down on TSLA and musk came in with some not very exciting news but whatever it it was it *crushed* short positions.  It's pretty funny. ", "score": 40, "replies": [{"body": "it it was it ", "score": 15, "replies": [{"body": "It it, it was it, was it?", "score": 7, "replies": [{"body": "Was was it, it was. ", "score": 4, "replies": [{"body": "A time of innocence", "score": 3, "replies": []}]}]}]}]}, {"body": "Sometimes I think Elon is a pie-in-the-sky kind of guy, promising too much and delivering little.\n\nLately I appreciate the fucking madman he's becoming.", "score": 36, "replies": [{"body": "I think he’s gradually become aware of how untouchable he is because of his pop culture popularity status. \nNow hes just pushing the limits to see what he can get away with", "score": 17, "replies": []}]}, {"body": "It's only illegal if you make the stocks go *down*.", "score": 28, "replies": [{"body": "Because shorting is U N A M E R I C A N. Jk, short defense, long weed, get rich off  peace✌️ ", "score": 7, "replies": []}]}, {"body": "Considering he bought Tesla stock like a week ago, I am pretty sure its not.\n\n", "score": 97, "replies": [{"body": "Dudes got the money to burn and time to earn, that doesnt mean anything. ", "score": 23, "replies": [{"body": "I like how you tried to defend his action using the worst possible reasoning", "score": 31, "replies": [{"body": "Dude’s got dollars to turn and hoes to churn ", "score": 32, "replies": [{"body": "Homie's breaking necks and cashing checks", "score": 22, "replies": [{"body": "Fucking Chicks and Sucking Dicks\n\n* Wait Fuck", "score": 13, "replies": [{"body": "*Eating pussy, sucking dicks and kicking ass.", "score": 7, "replies": [{"body": "[wheeler walker jr for the uninitiated](https://www.youtube.com/watch?v=vlq9UWWqe44)", "score": 2, "replies": []}, {"body": "lmao, they dont even sell him at Walmart, I really have found my home", "score": 1, "replies": [{"body": "Then you'll probably enjoy [this Joe Rogan podcast episode](https://www.youtube.com/watch?v=31phykl9D_E).\n", "score": 1, "replies": []}]}]}, {"body": "Elon doesn't wait, he just fucks.", "score": 1, "replies": []}]}]}]}]}, {"body": "You must think he is part of WSB. You really think he became a gajillionaire by purposely throwing money around knowing he's going to lose it? What kind of pleb rationale is this?", "score": 7, "replies": [{"body": "he's known for throwing other people's money around and losing it, mostly. ", "score": 1, "replies": []}]}]}, {"body": "The vote of confidence is worth more than the trade value for sure. It’s meaningless. ", "score": 1, "replies": []}]}, {"body": "Elon is going to blow up the Tesla factory for an insurance claim?", "score": 87, "replies": [{"body": "Seems likely.", "score": 33, "replies": []}, {"body": "Grimes is the new CEO ha!", "score": 11, "replies": [{"body": "Bitch is ugly lol", "score": -6, "replies": []}]}]}, {"body": "Daddy Elon is the best pumper", "score": 31, "replies": [{"body": "Watch Musk sell 20% of his 33 million TSLA shares at the market at 380, depressurizing the stock back to 250, then say: \"lawl, sorry bros, but I needed that money to buy raw materials and to make payroll since our venture capitalists are requiring me to give up my ownership of the company for more multi-billion dollar funding rounds.\"\n\nOne elephant in the room is that Musk isn't making any money, and he's on thin ice for more pallets of money stacked tight hundred dollar bills to burn.  Musk had to give up ownership of the fremont factory to keep the investment money coming.  When they see the trickle of money come in and investors said: \"That's all?\"  then Tesla may see $200 and $100.   Cars are great, but they're not that great, profit margin is low and and you can buy a decade worth of gasoline for the cost of the battery.", "score": 6, "replies": [{"body": "What stupid shit, if Elon sells shares then he has to file Form 4. He cannot just offload millions of shares ina single day. Your comment says as lot about your understanding of capital markets.\n\nAlso moment Elon files Form 4, the stock will crash. It’s a cult stock, when messiah starts selling, it’s over.", "score": 44, "replies": []}, {"body": "Yeeeeeaaaah. You think he just trades shares of stock of his own company like you do? You don't think he has to file these trades months in advance with the SEC? ", "score": 4, "replies": []}, {"body": "How much is the replacement battery? \n\nAlso, what about battery tech in the next 5 years? Is it still locked down by the big guys?", "score": 2, "replies": []}, {"body": "This isn’t far fetched ", "score": 0, "replies": []}]}]}, {"body": "Elon is going full Enron. ", "score": 163, "replies": [{"body": "He says they have to go from 3500 cars/week to 5000 by the end of this week, and talks about how he's going to be in the factory overseeing things, yet he spends his entire weekend shitposting on twitter. Go to his page and sort by \"tweets and replies\". He's probably posted 100 times since he sent out that email saying they need to boost production.", "score": 39, "replies": [{"body": "If Donald Trump can run the country from his toilet on Twitter then Elon Musk can shitpost and run his factory. ", "score": 28, "replies": [{"body": "Short both.", "score": 8, "replies": []}]}, {"body": "the dexedrine had just kicked in. gotta cut him some slack i know how it is lol", "score": 28, "replies": []}, {"body": "to be fair, what does \"overseeing\" mean in this context?\n\nHe just walks around? Stare real hard at the production lines? \n\nIn any case, he definitely has time to tweet. Trust me I know from experience, I'm a reddit addict.", "score": 18, "replies": [{"body": "Yes", "score": 3, "replies": []}]}, {"body": "It's father's day mate", "score": 2, "replies": []}]}, {"body": "He was answering to tweets from 2016. He has lost it. Either that or he never was legally sane.", "score": 118, "replies": [{"body": "Bro come on be factual at least. The twitter user himself said he brought up the thread again hoping Elon would see it today. ", "score": 42, "replies": []}, {"body": "Wait what?", "score": 20, "replies": [{"body": "Oh yeahm the thread is[ longer](https://imgur.com/a/5vWyGA3). He lost it. That or he is getting insane heat from the solar city investigation.\n\n", "score": 62, "replies": [{"body": "What’s up with that. I actually held solar city before he bought it from his cousins.", "score": 19, "replies": [{"body": "There is a pretty decent chance he withhold info from the board in order for them to approve the merger.", "score": 36, "replies": [{"body": "SO how much time do you give him?", "score": 6, "replies": [{"body": "I honestly dont see Tesla existing by this time next year.\n\nMight be sooner. Or he might get some crazy ass arab prince to finance his BS.", "score": -36, "replies": [{"body": "lol. alright bud. What other stock advice you wanna give so we can do the opposite?", "score": 67, "replies": [{"body": "I would tell you to keep an eye in argentine equities. Imo they have been hit way too much lately and might rebound soonish.\n\nI wouldnt buy yet, would probably wait a week or two then see how things are and make a decision.\n\nAlso, buy some BR equities, especially SID and PBR. And in the US I think both JEC and CLF have a decent upside.", "score": -10, "replies": [{"body": "There's still some protests and shit in Argentina right? That actually might be a good buy, assuming that all gets sorted out sometime soon. But I have zero experience in anything.", "score": 4, "replies": [{"body": "There are still some protests but they are having a huge abortion debate + world cup, so for know everything is calm.\n\nPlus, they got huge IMF package, that ought to protect them for a while.\n\nOn Wednesday after hours MS will decide if they are upgraded to emerging market category or not. If they are their ADRs will recieve a huge capital influx.\n\nSituation isnt as rosy as 6 months ago, but def better than what the situation is right now.", "score": 0, "replies": []}]}, {"body": "I wouldn't rush in to Argentina.  Sure this may be roughly the best prices we'll see.  But it's also super risky.  High variance.  Heaps easier for the risk to largely vanish and then come in.  Sure, you miss some points, but the odds of winning approach massive.  Do it the lazy way.\n\nThe hard part is determining when the coast is clear.  All I'll say is, it will be a long time before people are talking about it.  I'm still ignoring Argentina.", "score": 2, "replies": [{"body": "I fully agree with your sentiment. Keep an eye on it, but dont rush into it.", "score": 1, "replies": []}]}, {"body": "Ive gotten smoked selling puts a few weeks ago when PBR was on a bull run. I’ve been compounding losses by rolling down and out. I hope it recovers because I got assigned at $9.50 Friday.", "score": 1, "replies": [{"body": "Aw man, I just glanced at the price and remembered this comment.  Rough couple days brother.", "score": 1, "replies": [{"body": "It seems to be recovering, but holy crap they got clobbered. They looked like they were on a path to $20.", "score": 1, "replies": []}]}]}, {"body": "Bolsonaro would be best for PBR price if he wins in your opinion?", "score": 1, "replies": [{"body": "There are other better centrist candidates, but they are all polling like shit.\n\nBest case scenario would be a Bolsonaro-Alckmin run-off. \n\nBoth Gomes, Silva and Haddad present certain risks to PBR.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Elon is nuts", "score": 13, "replies": []}, {"body": "So he bought more of his own stock on margin in order to create a short squeeze so he can then later dilute shareholders with a capital raise or somehow reach his insane compensation package goals. The whole thing is a sham and Im damn glad Im not short common but March put spreads bc he is the best stock pumper of all time. He can spin any failure into a success or divert attention w/ PR. Kudos to him. ", "score": 13, "replies": []}, {"body": "So, the thread is a tad longer, [here](https://imgur.com/a/5vWyGA3) is everything that might be interesting.\n\nHe must be getting serious heat from the solar city investigation.", "score": 36, "replies": [{"body": ">He must be getting serious heat from the solar city investigation.\n\nWhat investigation? I thought there was one that ended like a year ago.", "score": 8, "replies": []}, {"body": "Big if true", "score": 8, "replies": []}, {"body": "Still not everything, later on the person who tweeted from 2016 said that they kept on going with that thread from 2016 & it’s nothing unusual that Elon responded to their original tweets. “Here is everything that might be interesting.” Lol", "score": 6, "replies": []}]}, {"body": "Thought this was fake, given WSB, had to check it myself.... dam Elon. Savage", "score": 7, "replies": []}, {"body": "How many layers of reverse psychology do I have to peel through to know if I should put all my life savings into options?", "score": 6, "replies": [{"body": "thinking at least five steps ahead", "score": 1, "replies": []}]}, {"body": "Elon is the goat. My boy Dorsey catching up tho ", "score": 13, "replies": [{"body": "I don't know much about Dorsey, but everything I've heard has made me respect him a lot.\n\nAnd without the eyerolling I do at Elon.", "score": 5, "replies": []}]}, {"body": "Screw the Rules, I have Money!", "score": 5, "replies": []}, {"body": "fred lambert and his site is comprised of the biggest tesla fanboys you will ever see. musk could be on autopilot in a tesla and take out a bunch of women running for prostate cancer research and fred would say that the women should have been running at the breast cancer marathon instead.", "score": 5, "replies": []}, {"body": "Part of his plan to get more cash. This guy doesn’t give a fuck. ", "score": 5, "replies": []}, {"body": "One of us, one of us!", "score": 3, "replies": []}, {"body": "I will forever find the peak of this. I’ve made gains on this but this is way overbought. I can’t justify this company’s worth no matter how much I love Tesla ", "score": 2, "replies": []}, {"body": "Well sometimes when I wear shorts in public, I'm afraid of pitching a tent. ", "score": 1, "replies": []}, {"body": "Haters didn't believe in Daddy Elong.", "score": 1, "replies": []}, {"body": "didn't their short position already explode in the run from $280 to $360?", "score": 1, "replies": []}, {"body": "Elon is just crowd sourcing because he level 100 iq", "score": 1, "replies": []}, {"body": "This shit shouldn't be legal. It's almost as bad as trump dicking around with the market by saying random shit. ", "score": 1, "replies": []}, {"body": "So if short covers tomorrow, but turns out he was bluffing - sounds like a legal issue for Musk.\n\nAlso if I buy tomorrow based on this ‘disclosure’ but it tanks in three weeks, do I got a case?", "score": -1, "replies": [{"body": "I doubt it. CEO's say their stock is a screaming buy all the time. ", "score": 14, "replies": [{"body": "Musk said it was overpriced last year above $370... He says it's different now. I believe him. There is a tent now and they gonna hit 5k at 20% margin first week of July, that's what three weeks mean.", "score": 10, "replies": []}]}]}, {"body": "Idiots never know how shorting works. They think that because a \"short squeeze\" can theoretically happen in low-volume stocks (but it almost never actually does) that the short squeeze is the defining triumph of the bull. Not only do bulls drive up the price, all these panicking loser shorts scramble to cover and eat a dick, blasting the stock to new and even greater heights. Riiiiiiiiiight. \n\nLet me tell you mongoloids what actually happens in the real world when a stock price with a lot of short interest jumps up without solid news backing it up: **it becomes an even more attractive short target than it was before, it gets shorted even harder, and so short interest goes up, not down.**\n\nPeople have been crying short squeeze on AMD and Tesla for years, and it's never happened. Both stocks have high volume and both stocks have been consistently smashed down whenever they climbed up in the past year. ", "score": -4, "replies": []}, {"body": "Shorts are gonna explode like Mary McCormark’sTesla", "score": -5, "replies": []}, {"body": "Buying puts", "score": -5, "replies": [{"body": "Notice he used \"explode\" which could be interpreted either way. He's hedging his tweets clearly. ", "score": 9, "replies": []}]}, {"body": "I am a bot from /r/wallstreetbets. You submitted something with no flair. Please make sure you select a flair, your submission was removed.", "score": 1, "replies": []}]}
