{"title": "Rivian Is Recalling Nearly All Vehicles It's Produced", "selftext": " \n\n* The front steering wheel fastener \"may not have been sufficiently torqued,\" CEO RJ Scaringe wrote to staff.\n* A spokesperson for Rivian said the recall was voluntary and that the cost would not be material.\n\nTesla challenger Rivian Automotive, Inc. will recall 13,000 of its vehicles after a structural manufacturing error was discovered in seven cars the company announced in emails to customers and staff.\n\nInsider reviewed an internal email Chief Executive Officer RJ Scaringe wrote to staff on Friday that said the fastener to the front steering wheel \"may not have been sufficiently torqued\" when the vehicles were manufactured.\n\n\"In rare circumstances, the fastener has loosened fully,\" Scaringe wrote. \"I want to reiterate that this is extremely rare, but it does reinforce why we are acting with urgency and caution.\"\n\nIn a statement to Insider, a spokesperson for Rivian said the recall is voluntary and the cost to perform the change was \"not material.\" Vehicle examinations at a Rivian Service Center would last a few minutes and would be free, the spokesperson said.\n\n\"The recall will not impact production, as Rivian has ceased producing vehicles with the insufficiently torqued steering knuckle fasteners, so this issue is not expected to persist,\" Rivian's spokesperson told Insider.\n\nRivian, a company backed by Amazon and Ford, has met with challenges this year, including [backlash from customers](https://www.businessinsider.com/rivian-price-increase-r1t-r1s-pre-order-customer-backlash-2022-3?utm_medium=referral&utm_source=yahoo.com) after raising its prices for pre-orders — and backtracking — in March 2022. The company also laid off [6% of its workforce](https://www.businessinsider.com/electric-vehicle-startups-trouble-insiders-reveal-layoffs-production-manufacturing-2022-8?utm_medium=referral&utm_source=yahoo.com) and saw a [slew of shareholder lawsuits](https://www.businessinsider.com/rivian-class-action-suit-accuses-rj-scaringe-misleading-investors-preipo-2022-3?utm_medium=referral&utm_source=yahoo.com) claiming that the company artificially inflated its share price and underpriced its cars.\n\nAfter a rough start to the year, the company saw a 47% increase in car deliveries in its third quarter compared to its second quarter.\n\nHowever, [analyst estimates show](https://markets.businessinsider.com/news/stocks/rivian-stock-price-3q-deliveries-reiterates-full-year-production-guidance-2022-10?utm_medium=referral&utm_source=yahoo.com) Rivian registered more than $3 billion in losses during the first half of 2022, [Markets Insider reported.](https://markets.businessinsider.com/news/stocks/rivian-stock-price-3q-deliveries-reiterates-full-year-production-guidance-2022-10?utm_medium=referral&utm_source=yahoo.com)", "id": "xyop7l", "created_utc": 1665222541.0, "score": 99, "upvote_ratio": 0.95, "num_comments": 36, "comments": [{"body": "Puts", "score": 26, "replies": [{"body": "Short Long I’ll take them all", "score": 2, "replies": []}]}, {"body": "Short naked calls", "score": 13, "replies": [{"body": "a possibility", "score": 2, "replies": [{"body": "41dte 45c last price was .81, 18 Delta. Very tempting.", "score": 1, "replies": [{"body": "I have been down on the entire sector.  I am here in SW Florida - the highway was littered with EV's after the hurricane.  I tend to get my little fund involved in growth/dividend paying stocks - I guess that comes from 35 years in the investment banking business.  Shorts have always burned me.", "score": 3, "replies": [{"body": "Electric is the future; I'm just in it for the swing, sell the news.", "score": 1, "replies": [{"body": "Electric is a problem waiting to explode -", "score": -2, "replies": [{"body": "Yes, but the technology will improve.", "score": 0, "replies": [{"body": "ok ....", "score": -2, "replies": []}]}]}]}]}]}]}]}, {"body": "The \"front steering wheel\"\n\nLol", "score": 13, "replies": [{"body": "Nice, it totally went over my head lmao.", "score": 1, "replies": []}]}, {"body": "Not a big deal to check & fix as needed, but it highlights the basic manufacturing issues these newer EV OEM’s struggle with. This is a basic operation in a manufacturing plant & it should be with a torque controlled tool. Not getting this right, as a singular event, is not as concerning as contemplating what else did they miss.", "score": 11, "replies": [{"body": "Yep, agreed.  Tons of challenges for brand new OEMs to figure out.  Even Elon had tonssss of issues (and still does) perfecting manufacturing processes.   \n\nHowever, I’ll say this was 100% tightened with a transducerized DC electric control tool.   This specific application would be considered a “critical fastener” (or “rank A”; nomenclature changes from manufacturer to manufacture) in which case they are required by law to not only use control tools, but store the data (most manufacturers store final torque, final angle and often the torque curve itself). \n\nI don’t know what happened in this specific case but I can think of two potential scenarios: 1) The design engineers could have simply spec’d too low a torque for this application and it has taken this long to come to light (7 out of 13,000 is 0.00054%) or 2) The tool itself could have been reading within spec during dynamic rundown during the process but the static torque on the actual fastener ended up being lower than the lower limit (either due to joint relaxation, lubrication getting on the threads, etc).", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Yea, like yes it's an error that shouldn't have happened and goes to show the complexities of car manufacturing, but as long as it isn't the first in a string of recalls,  this one isolated thing is pretty minor", "score": 4, "replies": []}]}, {"body": "Next recall will be for that poorly designed tonneau cover", "score": 2, "replies": []}, {"body": "Large scale manufacturing is not an easy task. For the CEO to come out and say the cost is not material is non-sense. \n\nPuts it is", "score": 2, "replies": [{"body": "Torquing up a steering fastener would be a <2 minute job at a Service Centre and cost nothing. Most mechanics would do this for free if you asked and many truck owners (myself included) would just do it themselves. For a multi billion dollar company this is a pretty insignificant recall.", "score": 8, "replies": [{"body": "True, but it involves nearly every vehicle that they have sold to date.  Fact is, most folks have no clue how to fix this let alone know where it is.", "score": -3, "replies": [{"body": "Right but scale is important here. Nearly every vehicle they’ve ever sold is only 13,000. The average Ford recall is 5 million and they have almost 1 a year", "score": 6, "replies": [{"body": "Correct ... I guess your missing the point", "score": -3, "replies": [{"body": "You would think people understand that\n\n1. having vehicles brought back/shipped back to dealerships or manufacturers is time consuming and expensive.\n\n2. spending 30 minutes bringing a vehicle in, lifting, working on it, bringing it down and having it moved 13,000 times will cost at least a few million since people at multiple levels need compensation for the work.\n\n3. Needing to recall your entire fleet of vehicles for a safety issue is NOT a good thing.\n\n4. We are in the middle of QT and these speculative companies cant afford mistakes like this, when Powell farting the wrong way will tank the Stock Market.", "score": -2, "replies": []}]}]}]}]}, {"body": "Never used a torque wrench have you?", "score": 2, "replies": [{"body": "Never", "score": -4, "replies": []}, {"body": "I guess the CEO hadn’t either and now the stock market agreed. \n\nPuts it is", "score": 1, "replies": [{"body": "How those lookin?", "score": 1, "replies": []}]}]}]}, {"body": "I saw my first Rivian in the wild the other day. Meh", "score": 4, "replies": [{"body": "Speaking of 1sts in the wild. I saw my first wild Polestar yesterday. I’ve seen a number of Rivians and even a few Lucid Airs.", "score": 2, "replies": []}, {"body": "I liked the one I saw in person, kinda like their brand. I still like Tesla the best though of all the evs. Really digging the model y", "score": 1, "replies": []}]}, {"body": "Welcome back to manual labor people haha", "score": 1, "replies": []}, {"body": "Rip", "score": 1, "replies": []}, {"body": "This really doesn't sound bad. I'll buy the dip.", "score": 1, "replies": []}, {"body": "Wow, well hope everyone got out awhile ago", "score": 1, "replies": []}, {"body": "Koala Tea.", "score": 1, "replies": []}, {"body": "Join my investing course on Udemy : Stock2Trade\nIt’s for free !", "score": 1, "replies": [{"body": "Are you asking me to join as a teacher, wanting to utilize my 35 years of experience as an investment banker?", "score": 1, "replies": []}]}]}
{"title": "The Philadelphia Phillies will determine when the recession starts, not JPOW", "selftext": "Alright regards and aspiring regards. I don't know shit and neither do you. But what I do is the city of Philadelphia is fucking cursed. MLB playoffs started today, and the Philadelphia Phillies are still playing. Why is this a big deal? Because everyone and their mother should be rooting against them. The Phillies have won two World Series titles since they became the Phillies:\n\n1980: Phillies defeated the Kansas City Royal 4-2 to win the World Series.\n\n2008: Phillies defeated the Tampa Bay Rays 4-1 to win the World Series.\n\nWhy does this matter? Just look at the years they won. \n\n1980: The U.S. was in early recession at the start of the decade, with the end of the recession coming around July of the same year. From 1981-1982 stocks saw little to no economic growth with interest rates continuing to rise despite the recession being over. This recession didn't officially end until 1983. \n\nGuess what happened in 1983...\n\nThe Baltimore Orioles defeated the Philadelphia Phillies 4-1 to win the World Series.\n\nThey wouldn't win another World Title until 2008. Which, you know, was only the biggest economic shit-show that most of us here have ever experienced. Do I even need to go into detail about how fucked up 2008 was? It's because the Phillies won the World Series, fight me. I'm convinced the only reason the economy eventually turned itself around was because the following year, 2009:\n\nThe New York Yankees defeated the Philadelphia Phillies 4-2 to win the World Series.\n\nIf you want to get super technical, in 1929 the Philadelphia Athletics defeated the Chicago Cubs 4-2 to win the World Series. The Great Depression followed throughout the entirety of the 1930's afterwards.\n\nHell, if you don't believe me, I have one more though it's a bit of a stretch. In 2017, the Philadelphia Eagles and Nick \"Big Dick\" Foles defeated the New England Patriots 41-33 to win their first Super Bowl in franchise history. Later that year, the corn market crashed. With corn dropping as much as 36% in mid-July 2017. \n\nAt the time of me writing this, the Philadelphia Phillies are leading the St. Louis Cardinals 1-0 in the NLWC, with an impressive win today in the 9th inning. The Philadelphia Eagles have the best record in the NFL as the only undefeated team remaining. Not much on the 76ers, but they're probably fucked too. \n\nTLDR: Go Cardinals. Short Philly ya'll", "id": "xyewdf", "created_utc": 1665189472.0, "score": 61, "upvote_ratio": 0.91, "num_comments": 34, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|523|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xyewdf)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xyewdf)", "score": 1, "replies": [{"body": "Only if everyone could do this type of DD", "score": 2, "replies": []}]}, {"body": "This is the kind of DD that put /r/wallstreetbets on the map!", "score": 28, "replies": []}, {"body": "Fuck it let the world burn. I want my city to win 🥰", "score": 18, "replies": []}, {"body": "So I should take out a second mortgage to place on the phillies to win it all? If they lose my stonks go moon?", "score": 12, "replies": [{"body": "Hedging is for landscapers, not gamblers!", "score": 8, "replies": []}, {"body": "They won’t get far in the playoffs so to the moon is the only option.", "score": 2, "replies": []}, {"body": "he gets it", "score": 1, "replies": []}]}, {"body": "I want to watch the world burn...\nGo Phillies!!!", "score": 9, "replies": []}, {"body": "It’s the Illuminati 👀 isn’t there a Fed regional bank in Philly? There ya go OP. Great DD all wrapped and giftboxed", "score": 4, "replies": []}, {"body": "This year is the pivot: if the Philadelphia Eagles win the SB the world economy collapses", "score": 4, "replies": []}, {"body": "Enjoy Bryce Harper", "score": 5, "replies": []}, {"body": "Go Phillies go birds go sixers go flyers! 4 for 4 let the market implode", "score": 3, "replies": []}, {"body": "As a Philly resident, this is solid DD. Crash confirmed.", "score": 3, "replies": []}, {"body": "The A’s won in 1929.", "score": 2, "replies": [{"body": "Yeah, the Philadelphia A’s.", "score": 3, "replies": []}]}, {"body": "The Eagles won in 2018, so the corn market crash of 2017 is irrelevant.\n\nTry better next time, OP ;)", "score": 2, "replies": []}, {"body": "Hey y’all, me again. Um, go chiefs.", "score": 1, "replies": [{"body": "Rip unless kc gets their head outta their ass", "score": 1, "replies": [{"body": "We ride at dawn", "score": 1, "replies": []}]}]}, {"body": "Saw the tweet already, this isn't original.", "score": 0, "replies": [{"body": "Oh fuck yourself. Just because someone else noticed it doesn’t mean I didn’t do my own research, and doesn’t make it any less hilarious that all these incidents happened. Take the stick out of your ass and enjoy the shit DD. Lord knows wsb needs it.", "score": 0, "replies": [{"body": "Stop stealing other peoples posts fuckin' karma pirate...", "score": 1, "replies": [{"body": "No one is stealing shit?? Stop being a fucking loser and either enjoy my shitpost or fuck yourself off. You prob a Phillies fan anyway", "score": -1, "replies": [{"body": "Someone posted a link to this 3 days ago to WSB which was posted on Sep 21st. So, they got a few weeks on you chump. I will do neither of the things you suggest and rather call you out as the fraud that you are. Plagiarism for karma points. YOU can fuck off.  \n\n\nhttps://twitter.com/MorningBrew/status/1572729134395969536", "score": 2, "replies": [{"body": "Sorry I don’t live on Reddit, my point still stands and I did my own dd. So yeah blow me, dude. Go cardinals.", "score": 0, "replies": [{"body": "No you didn't. Eat my ass.", "score": 0, "replies": [{"body": "Kk 😘", "score": 0, "replies": []}, {"body": "That tweet did not go into the detail that I did 😂 so yeah go on and tell me more about how I didn’t do any research", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "This actually makes perfect sense.", "score": 1, "replies": []}, {"body": "I got calls on the Dodgers. Phillies aren't going anywhere.", "score": 1, "replies": []}, {"body": "My guy had to cherry pick corn to find a depreciating asset from 2017.", "score": 1, "replies": []}, {"body": "Yo I was just downa phildelphyuh yesterdee an this jawn is friggin legit", "score": 1, "replies": []}, {"body": "Go Phillies! I'm sitting on cash to buy the dip 😏", "score": 1, "replies": []}]}
{"title": "50k Loan Guy with a quick update", "selftext": "Quick update on how last week went:\n\n&#x200B;\n\nhttps://preview.redd.it/u2bgr5ygmls91.jpg?width=738&format=pjpg&auto=webp&s=2f8b56b10d55f41d47393618ed5cecc6868079cd\n\n...and why I'm not worried\n\n&#x200B;\n\nhttps://preview.redd.it/vqlaax6pmls91.png?width=2094&format=png&auto=webp&s=2e2ee56465b5b38fb65bc76051b6bac2978edcca\n\nThe structure of this falling wedge is absolutely beautiful paired with the Bullish Divergence in both the RSI and the PPO, mwah (chef kiss).  I don't know what the catalyst will be, maybe it's just seasonality, or CPI comes in WAY lower than anyone was expecting, or the Fed pivots but something is going to happen and will bring about a MASSIVE rally across the entire stock market, and it's coming soon, like Mid-October soon , I'm seeing this stuff on almost everything in my watchlist.\n\nTurning notifications off in this thread because 90% of you are just here to shit on me.  The others, if you have anything constructive to say or simply don't want to be a dick, feel free to DM me!\n\nLater Nerds...", "id": "xyvg4n", "created_utc": 1665242628.0, "score": 11, "upvote_ratio": 0.66, "num_comments": 35, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|17|**First Seen In WSB**|6 months ago\n**Total Comments**|5009|**Previous DD**|\n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xyvg4n)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xyvg4n)", "score": 1, "replies": []}, {"body": "Man if inflation comes in hot again you can forget about any rally in October. I don’t care what your crayons are telling you to do.", "score": 37, "replies": [{"body": "That's the thing. It doesn't matter what the chart reads if the numbers are terrible we go down.  Now if they are optimistic we could see a rally that saves this idiots position, but do we really expect this nerd to sell if he actually is up a ton?", "score": 5, "replies": []}, {"body": "Inflation is making a comeback next cpi.. just go to the gas station or grocery store", "score": 4, "replies": [{"body": "Too expensive sir, I’m growing crayons out my balcony these days to stay in ample supply.", "score": 2, "replies": [{"body": "At this point I’m shitting candles", "score": 1, "replies": []}]}, {"body": "This. Ca is hitting $7.00 per gallon for 91.\n\nThat impacts diesel cost which means every fucking thing will be more expensive.\n\nI’m sure Wall Street thanks the OP for his generous donation to the wealthy hedge fund managers charity.", "score": 2, "replies": []}]}]}, {"body": "He drew 2 lines that go into a triangle; surely he cannot be wrong", "score": 18, "replies": [{"body": "He is  learned in our ways", "score": 7, "replies": []}]}, {"body": "\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣠⣤⣤⣶⣶⣿⣷⣆⠀⠀⠀⠀  \n⠀⠀⠀⢀⣤⣤⣶⣶⣾⣿⣿⣿⣿⣿⡿⣿⣿⣿⣿⣿⡆⠀⠀⠀  \n⠀⢀⣴⣿⣿⣿⣿⣿⣿⡿⠛⠉⠉⠀⠀⠀⣿⣿⣿⣿⣷⠀⠀⠀  \n⣠⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⢤⣶⣾⠿⢿⣿⣿⣿⣿⣇⠀⠀  \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠈⠉⠀⠀⠀⣿⣿⣿⣿⣿⡆⠀  \n⢸⣿⣿⣿⣏⣿⣿⣿⣿⣿⣷⠀⠀⢠⣤⣶⣿⣿⣿⣿⣿⣿⣿⡀  \n⠀⢿⣿⣿⣿⡸⣿⣿⣿⣿⣿⣇⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣧  \n⠀⠸⣿⣿⣿⣷⢹⣿⣿⣿⣿⣿⣄⣀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿  \n⠀⠀⢻⣿⣿⣿⡇⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿  \n⠀⠀⠘⣿⣿⣿⣿⠘⠻⠿⢛⣛⣭⣽⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿  \n⠀⠀⠀⢹⣿⣿⠏⠀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠋  \n⠀⠀⠀⠈⣿⠏⠀⣰⣿⣿⣿⣿⣿⣿⠿⠟⠛⠋⠉⠀⠀⠀⠀⠀  \n⠀⠀⠀⠀⠀⠀⢠⡿⠿⠛⠋⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀", "score": 16, "replies": []}, {"body": "I give you my blessing just to prove your prediction of 90% comments shitting on you wrong.", "score": 7, "replies": [{"body": "The comments so far are proving the math  LOL", "score": 1, "replies": [{"body": "The only math here is that you are bagholding 2.200 upst shares and is down the hole 10%... so far...\n\nThe good part is that its shares, so eventually, it can go higher than your cost. The bad part is that, you know, companies go broke, delist, etc...", "score": 2, "replies": []}]}]}, {"body": "This is a new one, using TA to claim something fundamental will happen to make your TA work lmaoooo???  \n  \nI drew a falling wedge so CPI will come in lower than expected 🤓", "score": 7, "replies": []}, {"body": "Seasonality ☠️😆😆😆😆😆😆😆😆😆", "score": 3, "replies": []}, {"body": "see you later on the suicide watch post", "score": 4, "replies": []}, {"body": "This loss porn will be one in story books", "score": 4, "replies": []}, {"body": "Why the hell are you posting if you don’t want to hear people’s responses? Why not just keep this shit to yourself then?\n\nEither ways your lines aren’t going to save you, dead money.", "score": 4, "replies": []}, {"body": "I have [positions](https://www.reddit.com/r/wallstreetbets/comments/xkhx78/i_dont_feel_so_good_mommy_i_need_my_milkers_this/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button) too. \n\nPlenty of haters out there. No need to complain about them. As long as I have my milkers in the morning, that's all that matters you bussy boi 🍼 🧴 \n\nFuxking wedge pattern is going to make him rich 🤣", "score": 3, "replies": [{"body": "Saw your post and top comment is some regard asking how you are rich and he is poor.  Well, it's because we do shit like this  XD\n\nMy man, we going up and the more regards in here that disagree just proves our point.", "score": 1, "replies": []}]}, {"body": "This current market does not care about stupid lines on a chart. 🤣", "score": 3, "replies": []}, {"body": "This is usually a continuation pattern, 70% chance it breaks to the downside. \n\nHowever there is a slight 30% chance it goes up.", "score": 3, "replies": []}, {"body": "Ooooph, optimism. Mans bout to be crushed", "score": 2, "replies": []}, {"body": "Once the market bottoms high risk stocks that are highly shorted will fking soar. I agree this is a good play", "score": 2, "replies": []}, {"body": "So, you think the lines on your graph can orchestrate  future events, beyond speculation? The chart cannot predict the type of events you're referencing. The chart can't make the fed pivot and it can't lower inflation. The  chart simply explains what is and has been, then we speculate. The fed isn't basing their decision on the chart, like your theory implies.", "score": 2, "replies": []}, {"body": "Wrong", "score": 1, "replies": []}, {"body": "Well of course people will shit on you when you unironically use TA to try and justify your bags", "score": 1, "replies": []}, {"body": ":Remind me 5 days", "score": 1, "replies": []}, {"body": "!RemindMe 2 weeks", "score": 1, "replies": [{"body": "I will be messaging you in 14 days on [**2022-10-23 00:32:30 UTC**](http://www.wolframalpha.com/input/?i=2022-10-23%2000:32:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/xyvg4n/50k_loan_guy_with_a_quick_update/irkrfwz/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fxyvg4n%2F50k_loan_guy_with_a_quick_update%2Firkrfwz%2F%5D%0A%0ARemindMe%21%202022-10-23%2000%3A32%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20xyvg4n)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "I mean this as an idiot but also out of curiosity….didn’t the September charts show the same trend lines right before awful CPI data?", "score": 1, "replies": []}, {"body": "But he made a whole post about how he's _not worried_", "score": 1, "replies": []}]}
