{"title": "[deleted by user]", "selftext": "[removed]", "id": "incai0", "created_utc": 1599351861.0, "score": 173, "upvote_ratio": 0.84, "num_comments": 85, "comments": [{"body": "Honestly dude you could have just said you are gay", "score": 335, "replies": [{"body": "Should OP eat your CumFlakess when his puts are worthless?", "score": 15, "replies": []}, {"body": "Username checks out.", "score": 5, "replies": []}, {"body": "but his parents won't accept that, so the long essay", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 140, "replies": [{"body": "That’s what makes a market", "score": 76, "replies": [{"body": "Thanks for stocking the market?", "score": 5, "replies": []}]}, {"body": "Explains the IV of this stock", "score": 5, "replies": []}, {"body": "It's very for or against TSLA isn't is? I'm thinking it's high risk but could still be high rewards", "score": 9, "replies": [{"body": "You just defined IV", "score": 21, "replies": []}, {"body": "I like TSLA as a company, I hate it as a stock and wouldn't touch those valuations with ***your*** money.", "score": 2, "replies": [{"body": "Probably the safe bet, I only have like 2k in stock and calls on tsla so no big deal if it tanks for me", "score": 1, "replies": []}]}]}, {"body": "Far better than an echochamber.", "score": 1, "replies": []}, {"body": "Democratic", "score": 1, "replies": []}]}, {"body": "When will anyone learn? Dont fight tesla super fans. I tried shorting it around $800, again around $1000. After barely being able to scalp any money i said fuck it and flipped to calls at 1400 and bang, they announced that split and I made a killing. It always seems like every month or so there is some catalyst that makes tesla go crazy. I do agree it is overpriced, but it doesnt make a difference. People are crazy as hell about tesla, so calls it is.\n\n11/20 550c bitches", "score": 31, "replies": [{"body": "Pretty sure Musk plans out those periodic events times to keep people from selling... smart fella", "score": 7, "replies": []}, {"body": "True. 11/22 550c should be the best bet. I'm gonna buy this dip on Tuesday.", "score": 3, "replies": []}, {"body": "i never shorted tesla but i did with lulu. i was long lulu until post pandemic when it reached ATH while other retaliers were down in the shitter, so i thought it was overvalued and shorted it at 260. kept mooning shorted more at 280, 310, 325 and got burned.\n\nafter earnings it dipped to 290, covered everything and bought 400c's 9/18 and now im up 500% on them (was up 1000% on wednesday). learned my lesson not to short the best in the industry. lulu is like the tesla of clothes.", "score": 1, "replies": []}, {"body": "Only its stock price has fallen for four days now and continued to fall in after hours trading Friday night.", "score": 1, "replies": [{"body": "It is bound to have dips. I dont YOLO tesla, i am playing it for the inevitable upward swings. When those swings happen i cash out and try to find a more reasonable position down the road. This month my expectation is the battery day will send it screaming back into the 500 range, but if im wrong I bought time that it wont blow up my position", "score": 3, "replies": []}]}]}, {"body": "Also why do you have an October put now if you think they will rise around battery day. Smh", "score": 13, "replies": [{"body": "Because he's not going to exercise it retard", "score": 18, "replies": []}]}, {"body": "Tesla Puts if you want Diamond hands!!!\nAlways inverse the sheep🤣", "score": 23, "replies": [{"body": "But it's so obvious that all of WSB is now buying TSLA puts. So does that mean we double inverse that and buy TSLA calls instead? What is dae way?", "score": 9, "replies": []}, {"body": "Do you have to get them removed to sell them, though?", "score": 1, "replies": []}]}, {"body": "Buying calls", "score": 11, "replies": []}, {"body": "He's here to recruit more bears.", "score": 9, "replies": []}, {"body": "You **paid** some money for that one.\n\n7k, betting against TSLA? 🤔", "score": 32, "replies": [{"body": "Funny how the TSLA bulls say that bets against it are evidence that anything they say is BS.  But if it's pro-TSLA, holdings are evidence that they truly believe the thesis.\n\nShorts can short anything they want.  Why would they pick TSLA?  Elon's fucking magic, look at SpaceX!  It's retarded to short TSLA unless you have a strong reason.  Why not pick GE?  They have as much charisma as a light bulb and they have a byzantine balance sheet and lord knows how many skeletons in the closet.  Definitely no superfans backing them.\n\nThe same could be said for TSLA bulls, they could invest in something else.  Although there are a lot of employees with stock and options...", "score": 12, "replies": [{"body": "Because no chill pumps lead to no chill dumps and OP wants to capitalize on the dump. Just like we went from 850 to 350 in a matter of days. Tesla makes millionaires in both directions.", "score": 7, "replies": []}, {"body": "Cuz GE is not trading at the same ridiculous multiples.  If Tesla falls like the prophesy has foretold,  there is almost an infinite amount to be made.", "score": 3, "replies": []}, {"body": ">It's retarded to short TSLA\n\nWhere\\_do\\_you\\_think\\_you are.avi.exe", "score": 1, "replies": []}, {"body": "It's almost like these people are biased", "score": 0, "replies": []}]}]}, {"body": "Expectations are too high for battery day. Unless they announce a new $30k Model S with 900 miles of range and some major nuclear powered battery breakthrough, the stock will continue to trend down.", "score": 29, "replies": [{"body": "Im predicting a million mile car with 600 mile range. Calls.", "score": 7, "replies": [{"body": "I'm expecting a surprising announcement of a $20k car. Calls.", "score": 5, "replies": [{"body": "China only, or globally?", "score": 1, "replies": [{"body": "Europe", "score": 1, "replies": []}]}]}]}]}, {"body": "They just became eligible and they're barely profitable. I don think s&p 500 is going to jump on that so quickly. Credits is a fine way for them to make money as it is something other car companies pay to save money. But right now s and p is probably trying to find a way to buy it at not such an inflated price.", "score": 11, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yea they can also make a side deal to include tesla they'll buy it at x amount per share.", "score": 1, "replies": []}]}]}, {"body": "You’re just regurgitating what every article out there already says. Good job taking credit forming your “thesis”", "score": 28, "replies": []}, {"body": "Without credits I think Tesla’s operating margin is still between 0.01% and 1%. Elon’s goal is widespread adoption of electric vehicles, which means scale, which means he is only concerned about profitability in so far as it keeps the company afloat and gets him to meet targets in his compensation plan. \n\nSo Tesla is sort of acting like Amazon in the 2000s plowing all its profits in to the businesses expansion. \n\nI can understand the S&P not being in a hurry though to add it.", "score": 9, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Okay but calls expiring this week are still fucked.", "score": 6, "replies": []}, {"body": "Dawg I think you overestimate people willing to transition to ev's...\nYou can get anyone to buy a $100 yearly subscription but buying an expensive vehicle they're ignorant about? Nah", "score": 1, "replies": []}, {"body": "I still don't get this... you compare to Amazon but Amazon has always sold loads of shit. Tesla barely sells any cars. Why do you think their market domination is so inevitable?", "score": 0, "replies": []}]}]}, {"body": "In musk we trust", "score": 5, "replies": []}, {"body": "Tesla : “look at me... I am the index now!”", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Shut up", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "😔", "score": 1, "replies": []}]}]}]}, {"body": "Expectations are too high and Tesla bulls are the pinnacle of the retail market. A company with a 300 BILLION dollar market cap only make 8 figure profits ... and the profits aren’t even from the business model themselves.\n\nWhat happens when other cars adapt to the EV business model and Tesla starts losing EV credit sales?? Hmm", "score": 8, "replies": []}, {"body": "Tesla doesn't sell cars, they sell stock and EV credits.", "score": 4, "replies": []}, {"body": "They're holding off most likely because they want it to stabilize to avoid mass market fluctuations. It qualifies for inclusion but its spot in the index has been climbing and dropping rapidly. So if it was included and then went even higher in a few months then the funds big money has are going to need to rebalance yet again.\n\nEither it needs to settle further down the list (fat chance) or it needs to rise up enough that the only companies above it are orders of magnitude greater in terms of market cap. Apple, Google, Microsoft, Amazon. Etc. \n\nJust wait until it holds a market cap above Facebooks for a month straight and boom instant inclusion", "score": 8, "replies": [{"body": ">185 comments\n\nA small flaw in that argument. If a stock (stonk) that's already a member of an index goes up, it does not mean passive funds (big money) need to rebalance again. The dollar value of their holdings goes up and down proportionally, in line with the price of the stock (stonk). The only time they need to rebalance is quarterly, for index inclusions, exclusions and free-float changes .", "score": 3, "replies": [{"body": ">if a stock \n\nWhat’s a stock?\n>\t(stonk)\n\nO", "score": 2, "replies": []}]}]}, {"body": "Some of you don’t know how the ZEV credits work.  Tesla’s only profit right now is that when another auto maker SELLS a car, they must buy the credit from Tesla.  Not produce, sell.  That’s right, Tesla is the environmental tax man.  \n\nWith that information, the current auto market, and with the population statistics out of the only state that makes the whole thing feasible...you think a company deserves a 1K P/E?\n\nDon’t short the man, short the business model.", "score": 3, "replies": []}, {"body": "Fuck em. Tesla fine without them before", "score": 6, "replies": []}, {"body": "Love how boomers bitch and complain about Tesla making profits only via EV tax credits. So fucking what? They’re generating greenbacks, I thought the bottom line of Wall Street was $$$&? I don’t care if it came from some drug kingpin in Colombia, a Russian mobster, a Nebraska farmer, or Uncle Sam. Dollars are dollars and those can be reinvested to expand production, marketing, hiring , technological capital. Boohoo your fucking volatility I’m in for the long run.", "score": 10, "replies": [{"body": "There is a limit to how much they can make from these tax credits as well as how long it will last.", "score": 7, "replies": [{"body": "But the real question is who the hell even cares that is tesla profitable right now?", "score": 4, "replies": []}, {"body": "But there is no limit on what they can spend the money on right? Cash is cash. It can be converted into more factories to sell more vehicles bringing down the cost to produce and raising profit margins.", "score": 3, "replies": []}, {"body": "> tax credits\n\nThese are not tax credits. They are literally paid by other auto-makers to avoid fines for not making enough EVs. These payments will last as long as traditional OEMs prefer to pay them rather than making their own EVs. Fiat paid them ~2B and I still don't see them having plans to make nearly enough EVs to stop buying credits. \n\nAnd Tesla will continue to take their money, and use it to drive down their prices to further expand market share. \n\nTesla makes ~18-20% gross margin on their cars without counting credits. They have flat/decreasing operating expenses while significantly increasing their production and driving down costs. By the time these OEMs pull their heads out their asses, Tesla will have 4+ factories on multiple continents pumping out cars.", "score": 0, "replies": []}]}]}, {"body": "😂😂😂😂😂", "score": 5, "replies": []}, {"body": "So many people here sitting on the shitter waiting on this buttmonkey to drop", "score": 2, "replies": [{"body": "It has dropped for four days...", "score": 1, "replies": []}]}, {"body": "Bruh they said 5 companies in 5 out, bitch i see 3. They holden till Tuesday so euro markets don’t have Monday on us", "score": 2, "replies": [{"body": "But didn't they get the head start on the 3..?", "score": 1, "replies": [{"body": "Who gives a fuck about esty", "score": 2, "replies": [{"body": "The dudes that got them a 5% bump apparently", "score": 1, "replies": [{"body": "That argument is puzzling to me, why can Europe get ahead on those the but not the other two?", "score": 1, "replies": []}]}]}]}]}, {"body": "You read that FT article too huh?", "score": 2, "replies": []}, {"body": ">1. TSLA's core business model is not profitable. TSLA's generates a profit through the sale of EV tax credits to auto manufacturers. \n\nYou're dumb af if you fell for this gay bear shit \n\n>2. Volatility. They do not want companies with the volatility of TSLA in the S&P 500, I believe Musk himself might even be a reason why they have not included TSLA (his tweets and SEC violations are a risk)\n\nThis is believable\n\n>3. I believe most importantly the committee believes that the current price reflects S&P inclusion. Why does this matter? The index will have to buy a huge number of shares after its inclusion. This will drive the price up, if large funds and retail investors start selling for profits the index becomes the bag holder. This combined with point 2 are the largest contributors. \n\nI don't think they really think or care about this.", "score": 2, "replies": []}, {"body": "Hey idiots\n\nThe rules for inclusion are not a mystery. They’re published here:\n\nhttps://www.spglobal.com/spdji/en/documents/methodologies/methodology-sp-us-indices.pdf", "score": 3, "replies": [{"body": "/confidentlyincorrect \n\nOP knows that you retard. He is saying it won’t be added any time soon due to volatility. Just because a company meets the MINIMUM requirements does not mean the index committee has to add it and they dont have to add them right now. They can wait a year or a damn decade if they collectively dont like Elon’s face. \nNow I don’t claim to be in the index committee and make no claims one way or the other. I am here for the ride. I want tsla to dump 90% and then go to 2000 on battery day. Just pure destruction in all directions.", "score": 3, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**TSLA**|**$420**|**BUY PUT**|**2020-10-23**|**$72.87**|**$418.32**|**0**|**27**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckeqd08zijfez0776qdhc123n) | [Track Record](https://www.pickmojo.com/user/mmz55/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 2, "replies": []}, {"body": "But the tendies", "score": 2, "replies": []}, {"body": "Thank you for your empirical evidence. A post like this is a perfect inverse candidate. Change that \"p\" to a \"c\" - simple as that", "score": 1, "replies": []}, {"body": "I got Tesla at 500 and I’m in it for long run do you guys think that’s too high ?", "score": 1, "replies": [{"body": "Only if you sell them lower", "score": 1, "replies": []}, {"body": "It is", "score": 1, "replies": []}]}, {"body": "> TSLA's generates a profit through the sale of EV tax credits to auto manufacturers. \n\nIt's even worse than that... they sell their tax credits to the casino industry, to allowing the gambling industry to avoid taxes while simultaneously affording TSLA the luxury of appearing profitable.  It's a very weird relationship that {c,s}hould disappear overnight with the swipe of Donnie Jon's pen.\n\nThe bigger question/observation people are neglecting about S&P\"500\" (there are actually over 500 entities in the \"S&P\" right now) is if they have enough companies to throw out of the index to make room from TSLA and the other excess entities already pushing the index over the 500 mark.", "score": 1, "replies": []}, {"body": "Also, I would expect some class action lawsuit against Tesla over the \"Full-Self Driving\" option in the next 1-2 years. I am sure trial attorneys across the country are salivating at the opportunity after the Consumer Reports article.", "score": 1, "replies": []}, {"body": "1. Study their sheets and subtract the reg credits and youll see they still made a hefty profit.  On top of that, they made it a GOAL to not max profits, they are targetting growth with some profit to stay comfortable \n2. Then S&P500 will continue to underperform competing indexes like Russel 1000 which they DONT WANT to happen", "score": 1, "replies": []}, {"body": "This is all true expect point 1. Tesla 100% makes profit from its core business, in fact it’s margins are some of the best in the industry. I think only Porsche beats them. The balance sheets are released each quarter, this isn’t information that isn’t clearly disclosed.", "score": 1, "replies": [{"body": "Per car margin and profit are not the same", "score": 0, "replies": [{"body": "Read the balance sheet.", "score": 1, "replies": []}]}]}, {"body": "Puts.... Tuesday.... 300 by 9/11.... downvote away tards..", "score": -1, "replies": []}]}
{"title": "TSLA cost me my grandma’s happiness", "selftext": "[deleted]", "id": "ine08d", "created_utc": 1599358732.0, "score": 213, "upvote_ratio": 0.81, "num_comments": 83, "comments": [{"body": "Prove it and I’ll pay for your grandma's hip replacement.\n\nEdit: Yes, I’m serious. While I haven’t received any response from OP I feel compelled to reiterate; the offer is genuine. Thanks", "score": 315, "replies": [{"body": "Bro this was a shitpost but if you wanna be generous I can probably come up with an excuse for you to give it to me.", "score": 64, "replies": []}, {"body": "Bro i need 64,000 dollars for a 64,000 dollar free crack give away party\n\nYou got me or am i gonna have to keep sucking dick behind the denny's?", "score": 26, "replies": []}, {"body": "I am autistic but I think this man is being serious", "score": 33, "replies": []}, {"body": "I’m the fucker that gave you gold. I swear to god you better be a decent human being. I need to know someone is in this cesspool of a sub that is decent.  Most are a waste dna and don’t know who there father is. \n\nEdit: it took be a year to get enough awards to give you gold. I’m too cheap to give Reddit money. Stay away from women with open sores.\n\nAn to the OP. I swear I hope you are joking. You sound like a total dipshit. Read this https://www.reddit.com/r/wallstreetbets/comments/iax4ej/newb_guide_to_losing_money_and_continuing_to_live/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 16, "replies": [{"body": "There was a post like this in the exact format talking about a dog hip replacement, literally the same, I don’t feel like finding it rn, but the top comment was the same also, they both could be just joking.\n\nEdit: https://www.reddit.com/r/wallstreetbets/comments/imb1lo/tsla_cost_me_my_dogs_happiness/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 10, "replies": [{"body": "Thanks. Hope he wasn’t joking. Took forever to get those coins lol", "score": 4, "replies": []}]}]}, {"body": "You’re good people.", "score": 3, "replies": []}, {"body": "Bravo", "score": 3, "replies": []}, {"body": "I can give his grandma a good hip alignment, send payment to me plz", "score": 2, "replies": []}, {"body": "Faith in humanity restored. Even if it turns out a shit post from op, genuinely good people are so hard to find", "score": 2, "replies": []}, {"body": "Op is an idiot, but it’s good to see someone willing to share their tendies, may you get extra sauce and a side of ranch with your next order", "score": 2, "replies": []}, {"body": "My grandma don't need a hip replacement, I can make it happen tho - will you still send? Thanks.", "score": 1, "replies": []}]}, {"body": "Proof or ban", "score": 208, "replies": [{"body": "Mods^", "score": 47, "replies": []}, {"body": "Proof and ban anyway.\n\nIf fake, fuck OP.\n\nIf real, fuck OP.", "score": 18, "replies": [{"body": "Amen", "score": 1, "replies": []}]}, {"body": "Her hips are gone because of a misspent youth.", "score": 6, "replies": []}]}, {"body": "Grandmas hip xray or ban", "score": 109, "replies": [{"body": "X-ray or ban!", "score": 36, "replies": [{"body": "Grandma or ban!", "score": 21, "replies": [{"body": "Ban", "score": 6, "replies": []}]}, {"body": "X-ray and ban", "score": 10, "replies": [{"body": "X-Raybans", "score": 6, "replies": []}]}]}, {"body": "Picture of grandmas hips or ban", "score": 2, "replies": []}]}, {"body": "Puts on your grandma", "score": 78, "replies": [{"body": "Bingo calls on grandma", "score": 12, "replies": []}]}, {"body": "This is more believable than spending 12k on a dog", "score": 33, "replies": []}, {"body": "No worries dude. Just make your grans an onlyfans page. Already has a large audience on pornhub for her gilf porn, may as well link and make money off it.", "score": 17, "replies": []}, {"body": "Puts on abuela 6ft put 1/15/21", "score": 6, "replies": []}, {"body": "First dog hip replacement, now grandmas hip replacement... what’s next? My pet elephants hip replacement?", "score": 6, "replies": []}, {"body": "Why do people do this, why?", "score": 19, "replies": [{"body": "At least this one is fake.", "score": 46, "replies": []}, {"body": "For karma, I get that you're retarded but don't be gullible too.", "score": 18, "replies": [{"body": "Im autistic not retarded", "score": 8, "replies": [{"body": "I’ve known my grandma for over 70 years - u/mulley00", "score": 10, "replies": []}]}]}, {"body": "it’s making fun of [this post](https://www.reddit.com/r/wallstreetbets/comments/imb1lo/tsla_cost_me_my_dogs_happiness/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 14, "replies": []}]}, {"body": "> for over 70 years since I was born\n\nSo you are over 70, and your grandma is how old? You might be needing those hip replacements yourself too soon.", "score": 15, "replies": []}, {"body": "Fake af", "score": 13, "replies": [{"body": "Whoa we got a real Columbo over here!\n\nWhat tipped you off?!", "score": 4, "replies": []}]}, {"body": "who the fuck calls their grandma Latina?", "score": 8, "replies": []}, {"body": "F", "score": 4, "replies": []}, {"body": "Buy the dip and save her hip", "score": 3, "replies": []}, {"body": "I bet this retard is hoping someone gives him cash like they did for the moron who gambled away his dog’s hip replacement", "score": 3, "replies": []}, {"body": "I just read a same post with the theme of high replacement for a Siberian husky... it cost him his dog’s happiness too", "score": 3, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**TSLA**|**$423**|**BUY CALL**|**2020-09-18**|**$36.53**|**$418.32**|**696**|**224**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckeqgxqey11al07794u28q7ef) | [Track Record](https://www.pickmojo.com/user/mulley00/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 2, "replies": []}, {"body": "I’ve known my grandma for over 70 years and she’s dead in the fucking ground and I’m 80....", "score": 2, "replies": []}, {"body": "Bro I hope this is a joke. Holy fuck.", "score": 3, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/mulley00 the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Or grandma isn’t gonna walk proper again if that’s true. If I math right which I can do Tesla won’t see 500 till EOY and even that’s stupid.", "score": 1, "replies": []}, {"body": "Idk what to make of this. If this is satire good on you. If this is a true story you’re an absolute degenerate and WSB is the perfect place for you! 😂", "score": 1, "replies": [{"body": "it’s making fun of [this post](https://www.reddit.com/r/wallstreetbets/comments/imb1lo/tsla_cost_me_my_dogs_happiness/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 1, "replies": []}]}, {"body": "F", "score": 1, "replies": []}, {"body": "Summary ban", "score": 1, "replies": []}, {"body": "Maybe take her to a third world country and do the procedure AND a stay in a nice hotel for a fraction of that money", "score": 1, "replies": []}, {"body": "FINNA SPLASH DOWN . DR MOOSK DINT HAVE A TRICK UP HIS SLEEVE TIL 🦇DAY\n\nENJOY 300 for a bit SUCKKAaa\n\n\nSoorry about the family 🌸🥀🌾💐🌷💐🌾", "score": 1, "replies": []}, {"body": "post positions", "score": 1, "replies": []}, {"body": "Stonks.", "score": 1, "replies": []}, {"body": "Don’t worry, proof and someone will pay for it.", "score": 1, "replies": []}, {"body": "Bullshit", "score": 1, "replies": []}, {"body": "If this is real you are retarded and I hope your family disowns you", "score": 1, "replies": []}, {"body": "My grandma got run over by a reindeer, can I get 10k for her funeral", "score": 1, "replies": []}, {"body": "Kimbal Musk appreciates you", "score": 1, "replies": []}, {"body": "Grandmas too busy fucking your Wife’s Boyfriends’s father", "score": 1, "replies": []}, {"body": "Grandma's boob shot or ban!", "score": 1, "replies": []}, {"body": "\"Buffets advice\" insinuating Buffet would but Tesla stock to begin with.", "score": 1, "replies": []}, {"body": "When/how did the word “finna” come about?", "score": 1, "replies": []}, {"body": "Use a dog hip replacement- works the same - half the price", "score": 1, "replies": []}, {"body": "!remindme", "score": 1, "replies": [{"body": "**Defaulted to one day.**\n\nI will be messaging you on [**2020-09-07 09:51:14 UTC**](http://www.wolframalpha.com/input/?i=2020-09-07%2009:51:14%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/ine08d/tsla_cost_me_my_grandmas_happiness/g47v9ad/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fine08d%2Ftsla_cost_me_my_grandmas_happiness%2Fg47v9ad%2F%5D%0A%0ARemindMe%21%202020-09-07%2009%3A51%3A14%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ine08d)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "It’s time to put her down, friend. She’s got dysplasia and her eyes are foggy.", "score": 1, "replies": []}, {"body": "It’s papa musk. Get it right or you won’t get shit.", "score": 1, "replies": []}, {"body": "I'm pretty sure you can get that hip replacement for one quarter of that price in Tijuana.", "score": 1, "replies": []}, {"body": "This is a shitpost in reference to that guy who used his dogs hip surgery money right?", "score": 1, "replies": []}, {"body": "The hips don’t lie", "score": 1, "replies": []}, {"body": "don't be a dick Elon, help abuelita Lolita  😭", "score": 1, "replies": []}, {"body": "first is the dog and now grandpa joined the chat", "score": 1, "replies": []}, {"body": "am I crazy or was this about a dog 10 hours ago?", "score": 1, "replies": []}, {"body": "Fuck you and your grandma. I don’t believe a word of your bullshit. Don’t post this shit hoping one of us autistic cunts will give you anything", "score": 0, "replies": []}]}
{"title": "BOSNIAN TESLA", "selftext": "", "id": "inetsb", "created_utc": 1599362228.0, "score": 1493, "upvote_ratio": 0.96, "num_comments": 86, "comments": [{"body": "Gas powered cyber truck", "score": 213, "replies": [{"body": "*Diesel", "score": 83, "replies": [{"body": "*Bosnian", "score": 78, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "2021 Milosevic by Yugo.  Made of carbon fiber instead of plexiglass.  Warrants for the new SPAC merger go on sale Tuesday with the ticker $YUGO", "score": 16, "replies": []}, {"body": "Clean coal", "score": 2, "replies": []}, {"body": "*downvotes", "score": -21, "replies": [{"body": "Can I buy puts on downvotes?", "score": 3, "replies": []}, {"body": "Alternate downvote", "score": -5, "replies": []}]}]}]}]}, {"body": "OK but does the window shatter when you throw a rock at it?", "score": 15, "replies": []}, {"body": "Yea any company can do this. But they just don't want to get sued.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 184, "replies": [{"body": "Damn, EDSN is picking up steam too", "score": 7, "replies": []}, {"body": "Son of a bitch, I’m going all in", "score": 3, "replies": []}, {"body": "LMFAOOO\n\nfuckin hilarious comment", "score": 5, "replies": []}]}, {"body": "Those tires look Balkanized", "score": 86, "replies": [{"body": "This post is underrated.", "score": 15, "replies": []}]}, {"body": "Here comes another EV startup.  They will be merging with a SPAC next week.  Based on how far ahead of NKLA they are, I'd value them around 25 billion.", "score": 64, "replies": [{"body": "Are you kidding me this was posted on The Internet. A tech company like that should be worth at least 100b", "score": 27, "replies": [{"body": "121 Trillion dollar market cap", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "That because everyone thought the target is proterra. Coocoo or whatever its called seems to be more ideas guys", "score": 2, "replies": []}, {"body": "It has in the very short term because of the failed Proterra hype, but it'll rise closer to merge, surely?", "score": 2, "replies": []}, {"body": "Yeah I sold that once I realized it wasn’t moving", "score": 1, "replies": []}]}, {"body": "This is so fucking true.", "score": 1, "replies": []}]}, {"body": "Ahh, I recognized that truck immediately!\n\nThe Marine transport from Aliens. Without the machine gun turrets.", "score": 19, "replies": [{"body": "Game over man, game over!", "score": 8, "replies": []}]}, {"body": "Elon Muskić", "score": 10, "replies": []}, {"body": "I'm all in with Tesla but God damnnnn that's an ugly truck..or is it even a truck?? What the fuck is it?", "score": 34, "replies": [{"body": "It is basically a pickup yeah. The slope at the back is kinda like how the Ridgeline has those ugly angled bits on the bed side walls.", "score": 17, "replies": [{"body": "A design choice so ugly that it was ridiculed by the truck community for years until Honda changed it.", "score": 4, "replies": [{"body": "They had to completely change the unibody to get rid of those sail pillars. They were load bearing because the truck doesnt roll on a frame to accommodate twisting", "score": 1, "replies": []}]}]}, {"body": "Red necks sure as fuck aren’t buying it", "score": 11, "replies": [{"body": "Truck drivers are usually very brand loyal. They aren’t going to switch from a Chevy to a Tesla for any reason. Tesla knew this and didn’t want to come out with the truck that looked like every other truck out on the market, because if they did that then it wouldn’t sell at all. So they tried something... a little drastic instead. 🤷🏼‍♂️", "score": 10, "replies": []}, {"body": "You would be surprised.", "score": 12, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "He said rednecks, not hicks. That refers to people who work outside (and so burn their neck). type of people that buy a vehicle for utility first.\n\nYou may be thinking specifically of suburban hicks, who buy a diesel f-250 to drive to their office job.", "score": 18, "replies": []}, {"body": "Hicks are diverse and will buy.  Short the stock buy the car.", "score": 3, "replies": []}]}]}, {"body": "I live in an area where visitors make jokes about hearing banjos.\n\nWatched the cybertruck demonstration live at work, and several coworkers who definitely meet the typical redneck stereotype were hyped.\n\nOnboard generator, air compressor, ramp, and towing capacity were very popular.", "score": 13, "replies": []}]}, {"body": "Most people (including me) think that its really ugly. But for these few people who like it, there is literally no other car that looks similar which they could buy instead", "score": 8, "replies": []}, {"body": "Elon actually mentioned they will likely be offering different exterior bodies if there are consumer demands that have more resemblances to  general consumer expectations. Think of the cyber truck body as limited edition.\n\nEdit: Tesla knowingly pursued the cyber truck body type with data that it may not appeal to as large of a market as the 'expected' truck stereotypes and their response was along the lines that they wanted to continue so they did. They also knew in doing so they could easily modify the exterior body to look more appealing to a larger market later.", "score": 8, "replies": [{"body": "Translation: Elon said something stupid about making a truck from inch thick steel, then couldn't walk it back after people who know engineering explained it to him. You see, he doesn't know that we know that he's not actually a genius. So then he made some further stupid claims thinking it was the iPhone launch, and now he's having difficulties walking those back.", "score": 22, "replies": [{"body": "Le “I’m so smart, stupid Elon with his millions of dollars” has arrived", "score": 6, "replies": [{"body": "I suppose Donald Trump is also a genius?", "score": 0, "replies": [{"body": "they are both super dumb.....hence rich powerful famous influential..... unlike us less stable geniuses", "score": 2, "replies": []}, {"body": "Considering the subjective definition of the term “genius” and the fact that he played the system to become president at the expense of retards who still waste their time bitching about him, arguably he is one.", "score": 0, "replies": []}]}]}, {"body": "He was born into a lot and used it well - I know a lot of people say he's a genius, there are plenty of arugments to be made he's not - but if watch his conversations with Jack Ma it's not difficult to see how easily people can perceive him as a genius.", "score": -13, "replies": [{"body": "I think Elon wants us to have a truck of choice in the upcoming robot uprising.", "score": 8, "replies": []}, {"body": "Genius or not, a study just showed that Tesla was the most attractive employer to engineering graduates. You don't have to be a genius yourself if you can build your company around top talent.", "score": 7, "replies": []}, {"body": "Anyone would look like a genius if you put them up onstage with Jack Ma", "score": 5, "replies": []}, {"body": "No colossal fuckup with the risks hes taken is incredible. Genius or not.", "score": 5, "replies": []}]}]}, {"body": "Bodies cost millions to make because of crash regs. Especially when you have to take into account other countries differing regulations. \n\nTesla cant afford to be retooling entire assembly lines ad hoc.", "score": 5, "replies": []}, {"body": "Can’t wait to one day to have an original Tesla cybertruck with an original body. It could very well be the first “classic” electric vehicle/Tesla.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "That’s literally what Elon revealed.", "score": 3, "replies": []}, {"body": "Tesla does not release concepts that won’t go into production.", "score": 3, "replies": []}]}, {"body": "I get the feeling it just doesn't photograph well. The angles are too sharp, lenses can't capture it. When you see it in person, totally different experience.", "score": 1, "replies": []}]}, {"body": "Stonks cant go down. Stonks only go up. Stocks can go down though.", "score": 6, "replies": [{"body": "This could be a good thing. Remind people of the cyber truck.", "score": 1, "replies": []}, {"body": "sometimes \"down\" ends at zero.", "score": 1, "replies": []}]}, {"body": "BALKAN \n\nBOTTOM TEXT", "score": 6, "replies": []}, {"body": "The cyber truck is an inverted V shape, soon to be like TSLA stock", "score": 9, "replies": [{"body": "This is conf bias I can get behind", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "You belong here. Did you sell?", "score": 2, "replies": []}]}, {"body": "Is it actually possible to make this truck attractive with tweaking?", "score": 3, "replies": [{"body": "A matte black wrap would be mint", "score": 1, "replies": []}]}, {"body": "Used a ford truck.  Calls on Ford for potential buyout!", "score": 3, "replies": []}, {"body": "*Tresla", "score": 2, "replies": []}, {"body": "He’s 5 btw", "score": 2, "replies": []}, {"body": "Check one off for the Slavs.", "score": 2, "replies": []}, {"body": "Even though I like tesla. I have to say, the cyber truck is fucking ugly.", "score": 4, "replies": [{"body": "Cybertruck is very polarizing. Personally, I like it. But I get why people don't.", "score": 7, "replies": []}]}, {"body": "Can it not handle a steel ball, though?", "score": 2, "replies": [{"body": "It can be opened by the tool lockpickinglawyer and bosnianbill made.", "score": 3, "replies": []}]}, {"body": "Slavic Musk will lead those with weak hands astray.", "score": 1, "replies": []}, {"body": "Looks like Aerotyne got their Series A!", "score": 1, "replies": []}, {"body": "Elon’s inspiration: waking up on his kitchen floor after a rough night and looking up at his range hood.", "score": 1, "replies": []}, {"body": "Love TSLA but does anyone else think the Cybertruck looks like it came out of a 90s game?", "score": 1, "replies": []}, {"body": "Who got preorders ?", "score": 1, "replies": []}, {"body": "I thot wheels wer square?", "score": 1, "replies": []}, {"body": "Must be equipped with cevapi grill in the trunk and turbofolk CD player", "score": 1, "replies": []}, {"body": "Why is the cybertruck so ugly tho", "score": -1, "replies": [{"body": "Because the nature of the construction. Those metal panels are made out of a proprietary alloy so strong that it was breaking the presses meant to bend them to shape. They haven't figured out curved panels yet.", "score": 4, "replies": [{"body": "Or just use a mould", "score": 2, "replies": []}]}, {"body": "You would've thought it'd at least look as good as the model s does for it's segment.", "score": 1, "replies": []}]}, {"body": "how many child workers did it take to assemble this", "score": -1, "replies": []}, {"body": "Vodka", "score": 0, "replies": [{"body": "It’s rakija dumbass", "score": 4, "replies": [{"body": "Beer", "score": 2, "replies": []}]}]}]}
{"title": "Which stocks haven't recovered yet and will benefit the most from Vaccine", "selftext": "Alright folks - I know that tech has been leading the charge for past 4 months. Which companies tech or non-tech do you think will benefit the most once vaccine is released. As of Friday, Trump said that Pfizer, John & Johnson and Moderna all three are in stage 3 trials. \n\nHere's my play:\n\n* JETS  March 19th 2021 22C\n* NCLH March 19th 2021 25C\n* WMT June 30 2021 160C (Walmart + lauch & partnership with InstaCart)\n\n&#x200B;\n\nWhat's your play?", "id": "inphay", "created_utc": 1599411346.0, "score": 15, "upvote_ratio": 0.68, "num_comments": 79, "comments": [{"body": "\"Trump said that\"....\n\nFlawless DD.", "score": 47, "replies": [{"body": "When he speaks on national tv, people listen. Remember the Kodak pump?", "score": -14, "replies": [{"body": "True, but when it comes to what is actually going to happen it's usually safe to inverse Trump", "score": 17, "replies": [{"body": "Lmao. Trump said market will be at all time highs in no time. Hmmmmmmmmmm I hope you inversed him and bought puts in June", "score": -4, "replies": [{"body": "Technically he called the top", "score": 10, "replies": []}, {"body": "Take this bullshit over to r/politics or ban.", "score": -17, "replies": [{"body": "What the fuck lol. Literally trying to make this not about politics. The kid said inverse trump, and I said he if he did he’s now poor.  It’s all about the market and whatever dumb shit he says works in the market. Market did nothing but skyrocket since March and that made plenty of people rich af after trump said the market is going to do “greater than ever”\n\nFuck off with calling “ban”\n\nLet’s take the word trump out from this. \n\nGuy said “inverse billy, billy is stupid and I don’t like him.”\n\nI said. “Billy was right though on pretty much anything in the stock market to date.”  \n\nI don’t give a fuck if it’s trump or Biden or Mandingo. Kid is retarded for inversing someone that in hindsight was right every time, especially when that person has the power to move markets with a tweet\n\nSucks when wsb hits the popular tab.", "score": 5, "replies": [{"body": "Mandingo, the porn star for POTUS! 😂👍🏼🍆", "score": 4, "replies": []}, {"body": "\"trade talks progressing!\" \n\n\"One day very soon this virus will just disappear\"\n\nLmao. The guy is a certified pumper. He's not wrong on everything oc, but he's not one to give a nuanced or totally accurate take on anything he thinks is going to affect markets", "score": 1, "replies": []}]}]}]}]}, {"body": "The pump that crashed right back down?  If you’re so much in belief that it’ll just based on his words, why such a long expiration?", "score": 2, "replies": []}]}]}, {"body": "Buy the rumor sell the news... everyone is going to be selling the news... also vaccine effectiveness and longevity is not expected to end the pandemic with the first releases. Expect green dildos and red grave diggers that week in any order.", "score": 7, "replies": []}, {"body": "This post is a perfect example of what I'm talking about.\n\nThere are no \"non-tech\" companies, there are only companies that are better and worse at leveraging tech in their respective industries.\n\nCompanies that are truly \"non-tech\" companies are fucking dead already.  They got killed off in the last cycle.", "score": 18, "replies": [{"body": "Tons of companies are not tech, and will be fine. It is called buying software solutions that you need from other tech companies. Not every company needs to build tech in house....", "score": 8, "replies": []}, {"body": "Bang on. If you’re not doing R&D you fucking toast. \n\nThat said, there’s Unilever and P&G that just label products and pawn them. Also Costco.", "score": 0, "replies": []}]}, {"body": "Play some airline stock on a 1/xx/22 date out. You’ll have some huge gains", "score": 8, "replies": [{"body": "This.", "score": -9, "replies": []}]}, {"body": "$SABR", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Sabre is a horrible, antiquated company. It has been downhill since AA spun them off 20yrs ago.", "score": 1, "replies": [{"body": "I’m up 77% since Monday on a 1/15/21 call", "score": 1, "replies": [{"body": "Even shit will float", "score": 1, "replies": [{"body": "!remindme 3 months", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2020-12-06 22:33:05 UTC**](http://www.wolframalpha.com/input/?i=2020-12-06%2022:33:05%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/inphay/which_stocks_havent_recovered_yet_and_will/g49xxa3/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Finphay%2Fwhich_stocks_havent_recovered_yet_and_will%2Fg49xxa3%2F%5D%0A%0ARemindMe%21%202020-12-06%2022%3A33%3A05%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20inphay)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Can someone explain to me why are those WMT calls so cheap? WMT was literally $155 last week ($5 away from ITM for the 160c) and yet they are just $10 per share???\n\nIf WMT+ kicks off I can see them reaching even $200 per share by the time June 2021 comes", "score": 2, "replies": []}, {"body": "Eventbrite", "score": 3, "replies": [{"body": "Their stocks 5 year trend is down, so not sure if recovery would help them.", "score": 2, "replies": [{"body": "They ipo’d 2 years ago and hadn’t really gotten their feet underneath them when the virus hit.  There’s no way they don’t pop at least a little when shows come back. Live nation is another play in the same space if their chart looks better to you.\n\nEDIT: typo", "score": -1, "replies": [{"body": "I looked at Live Nations. They are very close to their Feburary highs, so not sure how much juice is left in their run up", "score": 2, "replies": [{"body": "That makes EB look that much better to me. Unless live nation has revenue streams that I’m not aware of (which is possible) it seems like the two should behave similarly.", "score": 0, "replies": []}]}]}]}]}, {"body": "$AAL. \n\nAlso additional aid to airlines is to be provided soon.", "score": 3, "replies": [{"body": "Cant wait for AAL to go out of business so people stop fucking shilling it..", "score": 3, "replies": []}]}, {"body": "WMT and T", "score": 2, "replies": [{"body": "I already bought T and WMT on Friday. Good play", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Disney is $9 away from it's February highs. I don't think there is much juice left in it?", "score": 1, "replies": []}]}, {"body": "You may see a small pop but a recovery is far off with airlines. Business travel will never go back to where it was, a lot of business ceos states in a Bloomberg article few months back. Then you have the distribution of the vaccine and making ppl get it regularly Cause it’ll probably be a multi shot structure per year.\n\nEnd of 2021 until wide manufacturing and distribution", "score": 2, "replies": [{"body": "Good point. I was reading some where that 25% of the airline profits come from business travel, which is going to change.", "score": 1, "replies": [{"body": "That’s the number I was referencing, nice. A lot of it was last minuet hope on a plan for an hour meeting BS. Companies have seen that they can save the 1000$ and just zoom call it.\n\nMaybe we’ll see the US come into the 21st as a whole with high speed web finally.  Should be a national utility at this point but you know, profits over people.", "score": 2, "replies": []}, {"body": "Business travel is about touring properties, inspecting plants,  conducting inspections, etc... a lot more than can be replaced by zoom meetings.   That travel will mostly return.", "score": 1, "replies": []}, {"body": "LUV is (I think) has the highest proportion of non-business travel out of all the big airlines, worth looking into", "score": 1, "replies": [{"body": "Calls on LUV then", "score": 2, "replies": []}]}, {"body": "Another item to note is is in another Bloomberg article (really wish I had the links for you) that airlines route availability will be at about 40% of what it was pre pandemic in October, meaning more flights will be available. So if there is consumer interest LUV could be a good play since they have less business travel exposure like someone else mentioned here.", "score": 1, "replies": []}, {"body": "Business travel won’t change. Most companies don’t do business with the people they cannot meet in person. They’ll trust a familiar face that lives closer over some random guy across the world.", "score": -1, "replies": []}]}, {"body": "I doubt business travel will drop. It’s a part of boomer relations. Any reason to get away from their family they will gladly take.", "score": 0, "replies": []}]}, {"body": "Banks", "score": 1, "replies": []}, {"body": "LYG leaps!,,", "score": 1, "replies": [{"body": "Good one. Longest call U can buy is April 2021. Donu think it will $2 by then?", "score": 0, "replies": []}]}, {"body": "This is a WSB Gold question.", "score": 1, "replies": []}, {"body": "Airlines", "score": 1, "replies": []}, {"body": "$PK\n\nYou might not be able to buy under $10 anymore but you can definitely get in before it rockets back to $27.", "score": 1, "replies": []}, {"body": "$BA and $NFLX leaps are next on my shopping list", "score": 1, "replies": []}, {"body": "Vbiv fackin blows", "score": 1, "replies": []}, {"body": "Idk why everyone thinks theres gonna be a vaccine for this, we dont even have one for AIDS, if you were betting on stocks for that, 30 years later you'd still be waiting\n\nEdit: i like how you guys are downvoting this because you know it wouldnt benefit you lmao, ignorance is bliss", "score": -11, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Oranges have too much citrus so who cares about them", "score": 0, "replies": []}]}, {"body": "That's hardly the same though. It's gone from \"aaahhhh! Magic johnson sweat on me and now I'm gonna die!\" To a somewhat expensive but treatable disease that can be transmitted in only very traceable ways. If you bet on aids cure at peak panic you're probably sitting pretty right now. Even if there isn't a vaccine for covid (signs point to there being one eventually), it won't keep the world shut down forever.", "score": 2, "replies": [{"body": "Idk, global pandemic virus that killed celebrities is pretty comparable, and exactly, treatable, just like how this one will probably end up, i doubt there will actually be a vaccine", "score": 1, "replies": [{"body": "There are comparisons, sure, but vaccine or good treatment both have the same result of the world going back to normal more or less. The point is that if either of those happen, there are stocks that will benefit directly and should increase in value.", "score": 0, "replies": [{"body": "And as with AIDS it could take years to happen, as my post is saying", "score": 1, "replies": []}]}]}]}, {"body": "Did you know that the moon landing never happened and Kennedy was killed by the illuminati?", "score": 0, "replies": [{"body": "I best like the \"accidentally killed by the CIA\" version myself", "score": 0, "replies": []}, {"body": "It was the jews wasnt it", "score": -1, "replies": []}]}]}, {"body": "They’re already producing their vaccine because they know it works, their stock hit ATH months ago in advance of this. Priced in.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/hsp9g5/the_azn_top/fycbx8n/)*", "score": 0, "replies": []}, {"body": "OP: cruise lines seem to be a good play. CCL is extremely down still, and ready to rocket at the first vaccines. There are a few others I'll be researching today to make the best play, or maybe I'll just play all of them and hope nobody goes bankrupt before a vaccine. I also fuck with intel leaps because amd is just a hype train running up with other volatile tech, and it took a load of intels worth with it. That money will come back, intel is bouncing along its $48-$49 resistance for a while now, and we know it won't tank so it's about to go up bigly.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Good PUTS play but calls, not so much", "score": 2, "replies": []}]}, {"body": "SLB", "score": 0, "replies": []}, {"body": "Airlines, cruise and casinos", "score": 0, "replies": [{"body": "Great point on Casinos.", "score": 1, "replies": [{"body": "yeah try playign lvs. they barely move", "score": 0, "replies": []}]}]}, {"body": "Eventbrite and Discover Financial", "score": 0, "replies": []}, {"body": "Travel and manufacturing probably have the most room to recover. I don’t fucking know. I probably would’ve lost everything on Circuit City if I had been an adult then.", "score": 0, "replies": []}, {"body": "WMT?? Fucking walmart?", "score": -5, "replies": [{"body": "Yes fucking Walmart. They just launched Walmart+ and a partnership with InstaCart. Also, let's not forget their bid on TikTok along with MSFT.", "score": 4, "replies": [{"body": "I think Walmart will beat the S&p 500 in the next 5 years - I am a predicting a double .  I don't have any opinion on it going up a certain amount in the next 6 months though.", "score": 1, "replies": []}]}, {"body": "Imagine the delivery speeds they can have if they retrofit a part of every Walmart store into a distribution center.", "score": 1, "replies": []}]}, {"body": "I'm in Suncor Energy but other energy companies are gold. It's taken a dip recently and the oil price is low. Sitting around 15.60 at the moment and has been consolidating around 16-18 the past few months. Oil will rise with vaccine arrival which will benefit this stock aswell as a rotation out of tech.", "score": -1, "replies": [{"body": "Suncor has been bleeding for months. Long ways from a recovery", "score": 0, "replies": []}]}, {"body": "Nclh will benefit the most. Prefer cruiselines to airlines. Airlines are still operating, while cruiselines were artificially closed down. Also, airlines took on a lot more debt than cruislines.", "score": -1, "replies": []}, {"body": "BUD\n\nTAP\n\nPLAY\n\nAll the airlines \n\nAll the casinos\n\nAll the cruise companies\n\nRestaurant stocks\n\nProbably oil\n\nREITs\n\nDepartment stores\n\nHotels/booking companies\n\nAnything concert related.", "score": -1, "replies": []}, {"body": "WMT will be 500 within 3-5 years ngl", "score": -1, "replies": []}, {"body": "WMT+ is some bullshit. Really needed to have discounts, and next day delivery. With a newborn, I can tell you Amzn prime is as necessary as wetwipes and diapers.", "score": -1, "replies": []}, {"body": "YOURE A FUCKING ASSHOLE\nTHERE IS NO VACCINE\nTHERE IS NO VIRUS\nTHERE IS NO RECOVERY FOR STONKS THAT HAVEN’T  RECOVERED DANIEL \nJPOW PLEASE", "score": -6, "replies": []}]}
{"title": "Papa Elon - when everyone bashes $TSLA for not getting added to the S&P 🚀", "selftext": "[deleted]", "id": "inu89o", "created_utc": 1599427181.0, "score": 1745, "upvote_ratio": 0.95, "num_comments": 84, "comments": [{"body": "Thanks for the nightmares.", "score": 271, "replies": [{"body": "Ugh\n\nUnzips", "score": 39, "replies": [{"body": "Woah", "score": 16, "replies": []}, {"body": "Hahaha goddamn dude.", "score": 11, "replies": [{"body": "This is what no pussy does to a MF", "score": 7, "replies": []}]}]}, {"body": "If by nightmares you mean spank bank, I agree.", "score": 37, "replies": [{"body": "This is genius.  I want to downvote but I have so much respect for the honest perversity so I’m forced to upvote.", "score": 19, "replies": []}]}, {"body": "Oh god, this was meant to be seen by a couple of people then washed away in the sea of retardation\n\nLuke 23:34: Daddy musk, forgive them, for they know not what they do. 🙏🏻🙏🏻", "score": 5, "replies": [{"body": "shut up, you knew what you were doing", "score": 3, "replies": [{"body": "It told me to do it", "score": 2, "replies": []}]}]}]}, {"body": "✨what the fuck✨", "score": 40, "replies": []}, {"body": "If Joe Dirt had a daughter", "score": 101, "replies": [{"body": "It’s pronounced Dirtè", "score": 24, "replies": [{"body": "And spelt Duerte", "score": 4, "replies": []}]}, {"body": "Bro that IS David Spade.", "score": 9, "replies": []}, {"body": "All time movie", "score": -11, "replies": []}]}, {"body": "That's disturbing and I'm selling all my positions. This is the confirmation I needed.", "score": 40, "replies": [{"body": "You'll be back.", "score": 16, "replies": [{"body": "Hahaha you right.", "score": 7, "replies": [{"body": "Papa Musk is a thirst trap. Once he quenches that thirst he creates a desert for his followers by posting the newest stuff Tesla is doing, making us thirsty, and wealthier, once again.\nMusk=drugs.", "score": 5, "replies": [{"body": "> Musk=drugs\n\nJust gimme a taste man, tweet about battery life - or say \"we're six months out from full autonomous driving\" again man, c'mon.", "score": 1, "replies": []}]}]}]}]}, {"body": "Thanks I hate it", "score": 52, "replies": []}, {"body": "[deleted]", "score": 61, "replies": [{"body": "No it’s not. It’s papa Elon when everyone bashes $TSLA for not getting added to the S&P", "score": 87, "replies": [{"body": "It’s no not. Papa it’s Elon everyone when bashes not for $TSLA added S&P to the getting", "score": -19, "replies": [{"body": "Ahh... another day, another retard", "score": 1, "replies": [{"body": "hhA... another retard, another day", "score": 0, "replies": []}]}]}]}]}, {"body": "David Spade is that you?", "score": 32, "replies": [{"body": "Looks like Spades kid he had with the $2 hooker. That’s the shit of nightmares", "score": 7, "replies": []}, {"body": "Now I can't unsee it", "score": 1, "replies": []}]}, {"body": "What the fuck", "score": 14, "replies": []}, {"body": "Thanks, selling all my TSLA positions because of this cursed image.", "score": 7, "replies": []}, {"body": "Deeply, deeply disturbing", "score": 14, "replies": []}, {"body": "This has made me laugh aloud 3 times and counting", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Solid 5 now. I love how his eyes go back and forth", "score": 2, "replies": []}]}]}, {"body": "This is horrifying", "score": 9, "replies": []}, {"body": "That’s one freaky looking baby", "score": 4, "replies": []}, {"body": "Just when you thought you've seen it all", "score": 4, "replies": []}, {"body": "Joe Dirt 3 looking promising.", "score": 5, "replies": [{"body": "Was 2 any good?", "score": 2, "replies": [{"body": "No", "score": 3, "replies": []}]}]}, {"body": "Upvoting this thread in every comment in it", "score": 3, "replies": []}, {"body": "Thanks for the nightmares.", "score": 3, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "Please lower your voice. This is a public forum.", "score": 6, "replies": []}]}, {"body": "r/vredditdownloader", "score": 3, "replies": []}, {"body": "I’m tired of the gay bears believe you autist \nTSLA 500c Jan 15 2021", "score": 7, "replies": []}, {"body": "I don't hate it", "score": 7, "replies": []}, {"body": "Yuck. Wtf OP.", "score": 2, "replies": []}, {"body": "I want to gouge my eyes out with spoons", "score": 2, "replies": []}, {"body": "That’s not what he meant when he said Tesla was “too high imo.”", "score": 2, "replies": []}, {"body": "Fucking heinous", "score": 2, "replies": []}, {"body": "This is terrible.  Nice post and thanks for sharing?  \n\nSheesh I can't stop seeing it.", "score": 2, "replies": []}, {"body": "What the actual fuck", "score": 2, "replies": []}, {"body": "Goddamn dude talk about can’t be unseen.", "score": 2, "replies": []}, {"body": "I already have sleep issues", "score": 2, "replies": []}, {"body": "I hate this more than I hate you.\n\nThank you.", "score": 2, "replies": []}, {"body": "Tesla going private after this", "score": 2, "replies": []}, {"body": "wtf this is impressive and incredibly wrong. bravo!", "score": 2, "replies": []}, {"body": "Yeah I'm ready to get cucked Tuesday", "score": 2, "replies": []}, {"body": "Why", "score": 2, "replies": []}, {"body": "Bro i just busted a nut", "score": 2, "replies": []}, {"body": "Where can I go to unsee this?", "score": 1, "replies": []}, {"body": "r/vredditdownloader", "score": 1, "replies": []}, {"body": "Elon is probably reading this...", "score": 1, "replies": []}, {"body": "He only does weed, not meth.", "score": 1, "replies": []}, {"body": "Teradyne > tesla", "score": 1, "replies": []}, {"body": "If David Spade fucked Elon’s mom this would be their love child.", "score": 1, "replies": []}, {"body": "Looks like David spade lol", "score": 1, "replies": []}, {"body": "Can I unsee this fucking nightmare fuel...?", "score": 1, "replies": []}, {"body": "He looks like David Spade", "score": 1, "replies": []}, {"body": "I will visually never recover from this", "score": 1, "replies": []}, {"body": "Hahahahaha fuckin gold", "score": 1, "replies": []}, {"body": "😱", "score": 1, "replies": []}, {"body": "https://twitter.com/jamessantelli1/status/1302012646770663424?s=21", "score": 1, "replies": []}, {"body": "So guh", "score": 1, "replies": []}, {"body": "Bold of you to assume this isn't part of Papa Elon's autistic master plan.", "score": 1, "replies": []}, {"body": "Missed opportunity to Dame Da Ne", "score": 1, "replies": []}, {"body": "Fugly doesn't even begin to describe this.", "score": 1, "replies": []}, {"body": "i also realized papa musk has been frequenting this sub less (less golden awards spotted in the wild) since a few weeks before his 5BILLION selloff... Papa Musk might’ve put our retarded asses up for adoption :(", "score": 1, "replies": []}, {"body": "Jesus fucking Christ. Some of y’all got to much time on your hands lmao", "score": 1, "replies": []}, {"body": "Dear lord this is creepy af", "score": 1, "replies": []}, {"body": "11/10 would bang", "score": 1, "replies": []}, {"body": "Elon is too busy playing with rockets like they are hot wheels to even give a shit it seems like. 🤦🏻‍♂️🤦🏻‍♂️", "score": -3, "replies": []}]}
