{"title": "$VALE just added the Brazilian treasure secretary to the board boys, LETS GO TO FUCKING PLUTO", "selftext": "I need one of you fuckers to decide this shit, it looks like they might have added a very prestigious member to their board,\n\nDay after day more shit keeps adding up to the TSLA VALE contract but I could be wrong as fuck\n\n\nhttp://archive.fast-edgar.com/20200922/A8BEO22D8222O2ZZ272K22ZZQND8Z2Z2Z222/", "id": "ixrsls", "created_utc": 1600795073.0, "score": 114, "upvote_ratio": 0.91, "num_comments": 85, "comments": [{"body": "VAL(E)HALLA AWAITS!!", "score": 58, "replies": [{"body": "Put your rocket suit on fucker", "score": 18, "replies": [{"body": "Ground control this is Houston, Ready for take in T:minus 3:00:00", "score": 14, "replies": []}]}]}, {"body": "Guys can Papa Elon just say vale once", "score": 36, "replies": [{"body": "LITERALLY", "score": 12, "replies": []}]}, {"body": "JUST DROPPED $9 ON VALE CONTRACTS! \n\nI LOVE INVESTING!!", "score": 67, "replies": [{"body": "Nooooooo, DONT", "score": 15, "replies": [{"body": "but I'm \"investing\"", "score": 11, "replies": [{"body": "At least not on vale, I’m warning you", "score": 6, "replies": [{"body": "I have come to inform you that I have in fact lost $6 on my 3 contracts boutta cry on r/smallstreetbets hehe xD", "score": 1, "replies": []}]}]}]}, {"body": "Yes!!!!!", "score": 4, "replies": []}]}, {"body": "Bruh the price of 9/25, 10/2 calls are so low rn I’m tempted to throw everything...", "score": 27, "replies": [{"body": "Yeah, if you haven’t made money on this already, you’re probably not gonna. At least not this week...maybe a couple months out.", "score": 4, "replies": []}, {"body": "Don’t, probably not worth it", "score": 14, "replies": [{"body": "Lol usually how it goes", "score": 4, "replies": []}, {"body": "I read this after throwing money at it, fuck it", "score": 4, "replies": [{"body": "Nahhhhh pull out if possible, you’re truly already fucked", "score": 4, "replies": []}]}]}]}, {"body": "Vale and Tesla have had a contract since March...\n\n\n\nmore DD to add to everything else that's been posted\n\nTesla and Vale have already been in communication and have done business.\n\nAlso dont forget in 2019 shareholders meeting Elon said \"we might be getting into the mining business, we'll do whatever we have to keep up capacity\" https://youtu.be/Va5i42D13cI?t=3559\n\n\"A North American electric vehicle giant Tesla, has signed a contract with Vale-NC for the supply of intermediate mixed nickel and refined cobalt produced in New Caledonia. The contract was signed in March 2020.\n\nThis information was confidential and only negotiators had access to it, reports New Caledonia Business. According to their source, Tesla would use the Caledonian nickel-cobalt from Goro for its European factory in Berlin-Brandenburg, currently under construction. By purchasing nickel and cobalt in New Caledonia for its electric batteries, Tesla will meet future requirements from the European Union. From 2022, metals imported into Europe will require ethical, societal, and environmental production standards.\"\n\nhttps://www.tesmanian.com/blogs/tesmanian-blog/tesla-nickel-and-cobalt-contract-for-goro\n\n\"There are three key suppliers - Brazil's Vale VALE3.SA, which operates in Canada using some hydropower, Russia's Norilsk Nickel GMKN.MM and BHP Group's operations BHP.AX in Western Australia. \"Vale is in the box seat,\" he said.\"\n\nhttps://www.reuters.com/article/us-tesla-nickel/please-mine-more-nickel-musk-urges-as-tesla-boosts-production-idUSKCN24O0RV\n\nVale is also installing Telsa batteries in Rio de Janero furthering the theory of their partnership\n\n\"Iron ore miner Vale is installing a Tesla battery energy storage system at Ilha Guaiba terminal in Rio de Janeiro state to help meet power needs at the port as it moves toward energy saving technology.\"\n\nhttps://www.spglobal.com/platts/en/market-insights/latest-news/metals/082520-miner-vale-to-use-tesla-lithium-batteries-at-guaiba-iron-ore-port\n\n\"Vale, which acquired the project when it took over the Canadian miner Inco in 2006, is estimated to have spent $US9 billion on the Goro plant.\n\nPart of Vale's pre-sale restructure included the sale of nickel ore but pro-independence parties firmly oppose changes to the mining code to allow this.\n\nVale's changes involved prioritising the production of NHC, or nickel hydroxide cake, which is in demand for batteries for electric vehicles.\n\nVale's head is reported to have met Elon Musk of Tesla in March to discuss nickel and cobalt production.\"\n\nhttps://www.rnz.co.nz/international/pacific-news/422000/kanak-groups-object-to-vale-sale", "score": 18, "replies": [{"body": "Sadly, actual info doesn’t work well here, unless you’re the OP. Shitposts get upvoted and relevant info gets buried. If this hits, I’ll make a post about it.", "score": 5, "replies": [{"body": "lol ive noticed... and thanks!\n\nim surpsied by the lack of research some do lol", "score": 3, "replies": []}]}]}, {"body": "Fuck it, I've already bought 300 shares, going to double down.", "score": 12, "replies": [{"body": "Hope you bought the dip.", "score": 5, "replies": []}, {"body": "Dude don’t, dead ass not worth it at all.\n\nUnless you’re thinking long term then MAYBE it’s a good choice. But seriously double think this through", "score": -10, "replies": [{"body": "What is the downside? just curious what you think", "score": 4, "replies": [{"body": "Listen, Best case scenario you buy in now when it’s cheap, and Elon does announce his partnership with vale. Boom you’re fucking balling\n\nBut on the other hand, that announcement is the only thing that will make this shit not sink to the fucking ground. It’s up to you if you’ll bet on Elon coming through or not", "score": -5, "replies": [{"body": "So uhh what was the point of this post", "score": 15, "replies": [{"body": "For call holders hud, giving us dumbasses a bit of hope to not panic sell", "score": -4, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Yes that’s LITERALLY what I have been saying", "score": 2, "replies": []}]}, {"body": "i mean its already at 10.6~, cant go much lower", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Elon fucking everyone over and having a boring ass presentation", "score": 4, "replies": []}]}]}]}]}]}, {"body": "$Vale Gang \n\nIf you can't tell the difference does it really matter?", "score": 10, "replies": []}, {"body": "Next they'll be adding Trevor Milton's mom.", "score": 15, "replies": []}, {"body": "no reason to not buy in rn. just dont expect it to go crazy through the roof", "score": 6, "replies": [{"body": "Well I recommend to not buy in actually, sure it’s cheap but WE’RE gonna be stuck at $10-11 for a while. It’s really not worth the haste and headache", "score": -8, "replies": [{"body": "i agree. i just dont think we'll see bigger gaps than what we have now", "score": 3, "replies": [{"body": "That's why I bought leaps 😎", "score": 1, "replies": []}, {"body": "Listen, Best case scenario you buy in now when it’s cheap, and Elon does announce his partnership with vale. Boom you’re fucking balling\n\nBut on the other hand, that announcement is the only thing that will make this shit not sink to the fucking ground. It’s up to you if you’ll bet on Elon coming through or not", "score": -2, "replies": [{"body": "how long do you think vale has been propped up by battery day speculation?", "score": 3, "replies": [{"body": "What do you mean?", "score": 0, "replies": [{"body": "i could see it leaking, but i couldnt see it sinking. could be wrong though", "score": 3, "replies": [{"body": "Same same", "score": 1, "replies": []}]}, {"body": "if elon doesnt pull through, how much value do you expect vale to lose?", "score": 1, "replies": [{"body": "I don’t expect it to move much from where it’s at right now, lowest I can expect it to drop is to $10 which isn’t horrible", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Bought another 10 contracts. I love burning money", "score": 6, "replies": [{"body": "Oh my fucking god why", "score": 3, "replies": []}]}, {"body": "My Mom's male friend gave me $300 to play with, if I lose it he'll be mad at me, I need this", "score": 5, "replies": [{"body": "Hes gonna fuck u in the ass when u say you lost it on vale", "score": 7, "replies": []}, {"body": "He’s gonna beat the fuck out of you.\n\nSeriously bro not worth it at all.", "score": -2, "replies": []}]}, {"body": "Sure looks like someone is not happy with the climb from the low. I really like the huge volume of dip buys today.", "score": 5, "replies": [{"body": "What do you mean ?", "score": -1, "replies": [{"body": "Volume is the amount of shares bought or sold.", "score": 7, "replies": []}]}]}, {"body": "This hype shit on Vale is so awesome. I bought a cheap 2 year expiry Call back in the summer as a way to learn about how options work. Never would have guessed it would become a Power Meme.  Keep it up!", "score": 4, "replies": []}, {"body": "RIP TO VALE GANG ... ANOTHER GANG BITES THE DUST JOIN UP PURPL GANG & TANKER GANG", "score": 3, "replies": [{"body": "What’s the tickers?", "score": 1, "replies": []}]}, {"body": "Loading up on as much nickel as my portfolio can handle, some Vale but also JJN, BHP, ARRRF, ERMAY. If I don't know who he's gonna pick, might as well own a little of everyone. Except NILSY, so maybe that's the one everyone should buy given that it's the only one I don't own.", "score": 3, "replies": [{"body": "Make sure they’re long calls", "score": 2, "replies": [{"body": "As opposed to... Puts?", "score": 2, "replies": []}]}]}, {"body": "If Vale doesn’t pop by open tomorrow... \n\nWell then we’re all just fucked aren’t we??!", "score": 4, "replies": [{"body": "You’re not fucked if you’re holding long term, but if you bought 9/25 then yes you’re fucked", "score": 3, "replies": []}, {"body": "It's a $6B mining company. I'm in, but honestly not looking for the moon on this and not expecting a huge drop if no news.", "score": 1, "replies": []}]}, {"body": "I bought 100 shares at $12. Why is my account dying guys?", "score": 2, "replies": [{"body": "Dude, shares are fine. It’s calls we are worried about.\n\nDon’t panic sell. You’re good on shares dude", "score": 2, "replies": [{"body": "Shares are fine? VALE is down almost 11% since people started pumping it. My shares are definitely not fine. I need this shit back up to $12.", "score": 1, "replies": [{"body": "Shares DONT have an expiry date dumbass", "score": 2, "replies": [{"body": "I'm an autist, not a dumbass. Obviously they don't have an expiry date, doesn't mean it feels great to have your funds tied up. Or maybe it does feel great. Again, I'm an autist.", "score": 1, "replies": [{"body": "What are we arguing about again? Vale. Dude look at fucking cakes records, these fuckers are low key going up regardless", "score": 1, "replies": [{"body": "Idk, you’re making me feel good. Do you wanna get married?", "score": 1, "replies": [{"body": "Fuck it", "score": 1, "replies": [{"body": "Tl;dr I panic sold", "score": 1, "replies": [{"body": "Ahhh", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "If he does mention vale , how do you think he would go about it ? It seems weird to me that he would mention their partnership during the event.\n\nI threw my last $400 bucks left from buying Tesla calls into $Vale calls , basically a lotto ticket lol", "score": 2, "replies": [{"body": "I assume he would mention production of his new batteries, and somewhere along the lines he would mention how they are receiving nickel from a great source of environmentally sustainable mining companies like VALE or LAC.\n\nIt would boost his ego to be able to say environmentally sustainable", "score": 1, "replies": [{"body": "Are you holding any LAC ?", "score": 1, "replies": [{"body": "Didn’t seem worth it to me to bet on both since they were both super expensive when they hype built up.\n\nI would’ve if it was cheaper so I could get my hands in both, but overall VALE seemed like the best investment since they have a better track record", "score": 1, "replies": []}]}]}, {"body": "I'm suspecting purchase of the New Caledonia mine. Vale had a buyer fall through and then they've just started posted for new positions. If the mine was closing they wouldn't be hiring new engineers. They also were stating the mine will start producing 2022.", "score": 1, "replies": []}]}, {"body": "still holding the line i see...maybe its time to go home to your wives and live another day?", "score": 1, "replies": []}, {"body": "Hey look, more of my DD getting put into posts.\n\nMods should really curb the shitposts within DD posts so info can actually get out there. Ya’ll could’ve known a while back.", "score": 1, "replies": []}, {"body": "OP I'm confused. Your post seems very optimistic but all of your comment replies are saying don't buy it? Wot?", "score": 1, "replies": [{"body": "This is mainly for call holders and not potential buyers", "score": 1, "replies": []}]}, {"body": "Wait you believe is this a positive thing right? Your responses to different comments suggest otherwise 🦹", "score": 1, "replies": [{"body": "This was meant for call holders and not for new buyers, DONT BUY VALE", "score": 1, "replies": []}]}, {"body": "You guys will lose faith in vale soon enough", "score": 2, "replies": [{"body": "My faith is lost", "score": 6, "replies": []}]}, {"body": "This is old fucking news dweeb", "score": -7, "replies": []}]}
