{"title": "MSFT purchases Betheseda", "selftext": "I used to be a trader, till I took an ORCL deal to the knee: https://www.bloomberg.com/news/articles/2020-09-21/microsoft-to-buy-bethesda-studios-for-7-5-billion-to-boost-xbox\n\nWith the new generation of consoles, this exclusivity to MSFT for Xbox will be huge. Currently, the shares were down 1.1% to $198.18. But this happens with MSFT, with bullish returns following news.\n\nWhere do we think this news will affect SONY? How are you playing the purchase?", "id": "ix3nvt", "created_utc": 1600705454.0, "score": 467, "upvote_ratio": 0.97, "num_comments": 84, "comments": [{"body": "Sony is probably sensing that they'll need to find alternative means to stay in customers pockets at some point in the future....consoles are often sold at a loss, and subscriptions and services are needed to make up the difference. They've also been stuck at around 100 million consoles sales each generation. They'll need to expand beyond their hardcore audience if they want to generate more revenue.", "score": 92, "replies": [{"body": "> Sony is probably sensing that they'll need to find alternative means to stay in customers pockets at some point in the future\n\nAgreed. Sony is late to the streaming content platform bandwagon, which is weird, since they have all the divisions necessary to compete directly with Disney, HBO, Peacock, etc.", "score": 36, "replies": [{"body": "No theyve had streaming for years. Its called \"ps now\". They arent really doing much with it though probably because it would be really expensive", "score": 13, "replies": [{"body": "PS Now is game streaming. I mean content streaming, like Disney+, HBO Max, Peacock, that kind of stuff. Specifically original content like The Mandalorian. Sony needs killer content like that and a subscription service that it is exclusive to.", "score": 10, "replies": [{"body": "They have crackle, or at least they did, not sure if it is still going.  When I was last looking at it (years ago) the issue was that they had already made licensing deals with other streaming services for their really good programs.  From a US perspective at least, it did have a lot of their international stuff. If they really want to compete in that front they would need to get those rights back.", "score": 7, "replies": [{"body": "They also had PS Vue as a streaming television service in the US. The canned it rather unceremoniously late last year.", "score": 9, "replies": [{"body": "Just in time for everyone to be stuck at home with nothing to do but watch streaming. Nice move, Sony.", "score": 12, "replies": []}, {"body": "I used that and loved it.  Hulu live TV is what I replaced with and IMO PS Vue was better", "score": 8, "replies": [{"body": "Try YouTube TV, that's what we replaced it with right before Covid", "score": 2, "replies": []}, {"body": "PS VUE was the absolute best for sports", "score": 2, "replies": []}]}]}]}, {"body": "Thanks. I’ll have a look Hulu is not great", "score": 1, "replies": []}]}, {"body": "Sony makes all their money selling life insurance,  playstation revenue is nickles and dimes compared to their insurance revenues", "score": 1, "replies": []}, {"body": "Also, they have Crackle.com", "score": 1, "replies": []}]}]}, {"body": "“They’ve been stuck with 100 million console sales”\n\nYea, stuck", "score": 2, "replies": []}, {"body": "I invented an immersive entertainment pod and def think this is a mode of entertainment in the future ... not sure how it gets monetized but I see it happening and hardware makers should be at the forefront of innovating by paying me for my patent. Thanks for reading.", "score": -2, "replies": []}]}, {"body": "ORCL is the slowest moving stock.  it moved from 40 to 60 in about 4 years.  Not sure how any \"trader\" can lose to that.", "score": 10, "replies": []}, {"body": "What’s the ORCL shade about? lol", "score": 19, "replies": [{"body": "Tik Tok", "score": 13, "replies": []}]}, {"body": "Hopefully Bethesda doesn't go the way of Rare...", "score": 10, "replies": [{"body": "True. Everyone you where either dissapointed or just shocked when they where acquired a while ago. \n\nI was right never the less. Rare's talent department had jumped ship and to be fair they where just riding off of a legacy imo. \n\nThis won't happen with Bethesda. TES has been on fire for a while now and even outsiders can still see the potential in it. It's no where peaked.", "score": 6, "replies": []}]}, {"body": "I read it’s a case-by-case basis. I doubt TES will be exclusive. Maybe timed exclusive. Fallout has been mediocre and you could argue TES as well.", "score": 9, "replies": [{"body": "I like TES :(", "score": 3, "replies": []}]}, {"body": "RIP fun. \n\nPuts on MSFT.", "score": 59, "replies": [{"body": "MSFT has thrived on converting fun to profits for a while now.", "score": 39, "replies": [{"body": "Implying bethesda hasn't already been doing that?", "score": 16, "replies": []}, {"body": "Can you give me examples?", "score": -8, "replies": [{"body": "Yeah sure.  While they arent as bad as EA for straight micro transactions, they have shifted much of their gaming market to the xbox game pass.  They essentially pull the netflix model and lease games to resell on subscriptions so the user doesnt actually ever own a copy.  While its great for trying new games, when the pass runs out people will buy the game if they like it.   They get a cut through the xbox store as well. This is good in some ways, but again going back to netflix, it tends to silo the player base and give msft a ton of control over the popularity of games.  It's no coincidence that many heavy mtx games get a spotlight on gamepass (Fifa/nba/madden, cod, etc.)  \n\nLong story short, they suffocate other developers via exposure (like amazon) and then profit from the cash cows of the industry through licensing.", "score": 6, "replies": [{"body": "Thank you! That was actually helpful unlike the other responses.", "score": 2, "replies": []}, {"body": "But none of your mentioned games get a spotlight on game pass. Because they aren't on game pass. The EA ones will join, yes. But only the vault games.", "score": 0, "replies": [{"body": "Idk about you, but I'm constantly hounded with ads for the latest EA game on the dashboard via gamepass.  They even give free trials for the major sport games coupled with the pass.", "score": 1, "replies": []}]}]}, {"body": "Do you have observation skills?", "score": 15, "replies": [{"body": "Apparently not. I was simply asking a question", "score": 0, "replies": []}]}, {"body": "How do you get Wi-Fi from underneath that rock you've been living under for 20 years?", "score": 2, "replies": [{"body": "I was just asking a question. Thank you for your helpful answer genius.", "score": 1, "replies": []}, {"body": "LMAO roasted", "score": 1, "replies": []}]}]}]}, {"body": "Elder scrolls 6 will probably be the best selling game of all time tbh", "score": 25, "replies": [{"body": "Don't you mean Elder Scrolls V: Flaming ninja remastered enhanced and UNCUT version?", "score": 11, "replies": []}, {"body": "With the release rate of Bethesda, Elder scrolls 6 will come out in 2056...", "score": 2, "replies": [{"body": "...and we will STILL be waiting for Half Life 3..", "score": 2, "replies": []}]}, {"body": "But it's more likely that TES6 will be to TESV as Fallout 4 was to Fallout 3, right? In other words, a huge disappointment.", "score": -2, "replies": [{"body": "Interesting thought, however the TES lore is quite strong the subreddit alone has 100k members they have a much stronger foundation to work with for developing the game.", "score": 6, "replies": [{"body": "I'd be a lot more optimistic if Bethesda outsourced TES6 to Obsidian or even the Skywind crew. After the one-two punch of FO4 and FO76, I don't know how anyone can be optimistic about TES6. Particularly since Bethesda has been surpassed by CD Projekt Red, Rockstar and Guerilla Games. I'm much more excited about what those studios are working on next.", "score": 5, "replies": []}]}, {"body": "I don't see how you can make this argument, FO4 was an upgrade in every sense, maybe except the game engine, to FO3. F76 is a whole different story", "score": 2, "replies": [{"body": "Did I imagine all the salt and hate when FO4 came out? Let me check: I google, \"why fallout 4 hate.\" Er, nope, doesn't look like I imagined it.\n\nAnd I'm even discounting the \"voiced PC\" hate, because I don't mind that at all. Even taking that item off the list, the hate goes on and on. And I agree with most of it. FO4 was the first Bethesda game where I barely finished one run, it was so painful.\n\nThere was one thing I really liked about FO4, though. The Glowing Sea. It was the only part that seemed to capture the creeping horror of the Metro in Fallout 3, as well as add new elements and surprises.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 56, "replies": [{"body": "So by the end of the year you'll have more than 151 shares? Man next year you'll have over 516.. Loan me some money", "score": 10, "replies": []}, {"body": "It is not a bad play midterm. They have more cash than Croesus right now and are clearly trying to make juice with just buying stuff since they got stiffed on tiktok. Yet they are not stupid about it. If they start buying into self driving pizza delivery startups then it is time to sell.", "score": 1, "replies": []}, {"body": "LOL I wrote it then felt bad, so I deleted it. But you are seriously tarded if you go long on MSFT. It's about to get skull fucked for like two months lol.", "score": -13, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Boy, you're about as moist as an anus can get.", "score": -3, "replies": []}]}]}]}, {"body": "To be fair, after 76, how much more could they possibly ruin stuff...", "score": 3, "replies": [{"body": "\"Welcome to the Elder Microtransactions Online\"", "score": 9, "replies": [{"body": "That basically already exists with ESO", "score": 4, "replies": [{"body": "isn't ESO actually good though unlike FO76? I havent played either but people seemed like to like the former", "score": 4, "replies": [{"body": "Oh yeah, I like playing ESO, but there are a lot of things locked behind paywalls, not including the expansions since those make sense since ESO is a one-time purchase for access unlike WOW", "score": 1, "replies": []}]}, {"body": "lol wait til Microsoft gets involved. The insane pressure to make money has only just begun.", "score": 2, "replies": []}]}]}, {"body": "There is no bottom to how bad Bethesda can get.", "score": 2, "replies": []}]}, {"body": "So you're really saying is calls on MSFT? \n\nIs this one of those reverse Goldman Sachs moments?", "score": 1, "replies": [{"body": "Nah. Puts on the whole damn Nasdaq.", "score": 2, "replies": []}]}]}, {"body": "According to this, gaming is Sony's #2 revenue source, though the #1 reorganized Electronic Products & Solutions division is neck-and-neck. I think it's hilarious that Financial Services is #3, bigger than Movies or Music.\n\nhttps://www.statista.com/statistics/297533/sony-sales-worldwide-by-business-segment/\n\nBut Playstation exclusives have been top tier for years and they keep up with multi-platform releases. So vs. Xbox, they still have a content advantage. I don't think that picking up the much hated and reviled Bethesda is going to change that. Who plays TESV on Playstation anyway? Nobody. And it would be dumb to turn Bethesda multi-platform games like ESO into exclusives. So where's the harm to Sony?\n\nHonestly, I think Disney and HBO streaming platforms are bigger threats to Sony than MSFT picking up Bethesday.", "score": 8, "replies": []}, {"body": "So this mean SONY is going to buy Tiktok you saw it here first folks.", "score": 5, "replies": []}, {"body": "So does this mean that Skyrim Remastered 2 will only be for PC and Xbox", "score": 3, "replies": [{"body": "as much as i dick suck $MSFT, probably not\n\nit'd be the smart move to do, xbox exclusive and then a year later release on pc but $msft has way too high of a market cap to spend time playing console wars\n\nim pretty sure they spend $sne's market cap on just cooling azure servers", "score": 2, "replies": []}]}, {"body": "Perfect timing... When my call expired OTM...", "score": 2, "replies": []}, {"body": "Sony needs to remake Marvel Vs Capcom 2 and boom, problem solved.", "score": 1, "replies": []}, {"body": "See that mountain over there? You can climb that.", "score": 1, "replies": []}, {"body": "Dam, it will go up to $600 by end of 202 at this rate", "score": 1, "replies": []}, {"body": "Got fucked on the ORCL flip flop too. Hope it crashes hard in the next 18 days, I really guhed it.", "score": 1, "replies": []}, {"body": "Those guys on the right are playing a controller when there’s M and K right there!!!!!!!!!! That’s it I’m out planet earth", "score": -22, "replies": [{"body": "what?", "score": 8, "replies": []}]}, {"body": "They should have taken TikTok in. This deal here not impressive enough", "score": -40, "replies": [{"body": "You don’t quite know what you’re talking about, do you", "score": 27, "replies": [{"body": "I can see it from how the stock reacts. The markets don t care at all about this. When there was talk about TikTok, it was something else", "score": -6, "replies": [{"body": "Pretty sure tiktok didn't want Microsoft to own them", "score": 3, "replies": [{"body": "Yeah sadly. Could have been goldmine.", "score": -4, "replies": []}]}, {"body": "I wouldn’t take today as an indicator of how this news will play out. Techs getting reamed across the board.", "score": 1, "replies": []}]}]}, {"body": "I’d bet my whole portfolio that there are more than 1,000 employees at MSFT who knows more about capital allocation, M&A and valuation than you’ll ever learn in your entire life. If there was a good deal to be made, there would have been a deal made.", "score": 4, "replies": [{"body": "Probably, i m just an option and stockholder and the TikTok deal would have put this stock in a nice position. This deal is just to make us forget about TikTok", "score": -3, "replies": [{"body": "No, this is a deal to lock up exclusive titles for their upcoming Xbox release to gain an edge on Sony and app service companies like Apple. If MSFT can get gamers to sign up for their game pass, they can really start to dominate the gamer market.", "score": 3, "replies": [{"body": "Thanks for taking some time to explain. Appreciate it", "score": 2, "replies": []}]}, {"body": "I think the complexities of the Tik Tok deal escape you.\n\nThe purchase of ZeniMax Media and the subsidaries like Bethesda will be smoother, less politically manipulated (or even noticed) and a huge boom for Microsoft's cloud and gaming services like Azure & Xbox. That data has to go somewhere... why not into Azure? On top of the extremely valuable IP and legions of loyal customers to that IP. It seems like a no brainer.\n\nDisclaimer: long term MSFT holder and constant buyer", "score": 3, "replies": [{"body": "Buffett talked about his best deals being written up on a napkin and done with a handshake.  \n\nRegarding tiktok, once a deal has all these political games, posturing, bullshit media hype and misinformation, rounds of reworking, etc., you know it's a loser.", "score": 2, "replies": []}]}]}]}, {"body": "This deal is nothing like a tiktok deal you can't even compare it. They bought bethesda so they could make exclusives out of popular IP like elder scrolls and fallout. They had no choice but to do a move like that since the recent playstation event showed a lot of exclusive for the ps5. Basically, with not enough exclusives to compete with playstation, they would most likely have lost a lot of money in the console war. Now that they have bethesda they could make exclusives which would force bethesda fans to buy xbox and on top of that if they make good bethesda games (like a good elder scroll 6) and good marketing they might even have a pretty good fighting chance agaisnt playstation. Basically that was a very good and necessary move from microsft so they could stay in the gaming industry", "score": 2, "replies": [{"body": "Thanks for adding this interesting context", "score": 1, "replies": []}]}]}]}
