{"title": "TESLA", "selftext": "[deleted]", "id": "6ymixw", "created_utc": 1504782727.0, "score": 59, "upvote_ratio": 0.82, "num_comments": 37, "comments": [{"body": "I've been in since shares cost $30.  Best part of my work day is looking at that 1000%+ gains in my portfolio.  ", "score": 71, "replies": [{"body": "You clearly didn't buy enough shares at $30 if you are still staring at it during work.", "score": 98, "replies": [{"body": "Yeah, only a few hundred dollars.  My great regret.  Should have taken a second mortgage and put it on them.  \n\nBut then I look at DDD and SSYS and I'm glad I only gave them a few hundred dollars.  ", "score": 27, "replies": []}, {"body": ">still ~~staring at it~~ at work    ", "score": 1, "replies": []}]}, {"body": "When tesla was in the 30s I had my finger on the trigger and my dad (who's been a stock broker since the 60s) talked me out of it...  made the purchase on my mock portfolio and now I hate logging into it and seeing the gains", "score": 12, "replies": [{"body": "But isn't it true there were dozens of other stocks that you decided not to pull the trigger and those have tanked or gone bankrupt?", "score": 11, "replies": [{"body": "I suppose 😒", "score": 3, "replies": []}]}, {"body": "I remember when it was $25 and I talked myself out of it :'(", "score": 1, "replies": []}, {"body": "Your dad probably remembers Ballard power.  I don't blame him at all.  ", "score": 1, "replies": []}]}, {"body": "I bought 50 shares at $32.  I too enjoy looking at those gains in my portfolio.  TSLA was close to bankruptcy since the time we bought in though.  I can't help feeling we earned the gains on this one staying long.", "score": 4, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "I know we're in /r/stocks and you guys are day trading.  \nI plan on sitting on TSLA for 20+ years.  I'm convinced they are my generation's Microsoft.  \nIt jumped up a lot sooner than I expected but I don't see it ever dropping considerably for more than a few months.  ", "score": 6, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Because then I sell and watch it keep going up or it splits.  \nI'm never able to buy back in for what I sold.  \n\nThere's risk either way and I don't need the money right now.  ", "score": 1, "replies": [{"body": "I agree with you. Have you every thought of selling a little bit to cover your original entry price so even if tsla goes bankrupt you don't lose money? Just a thought. Congrats bro super jealous ", "score": 0, "replies": [{"body": "I'm in a lot better place financially than when I first bought in (and I was comfortable back then).  \nIf it went to $0, I'd be sad, but financially fine. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "https://www.bloomberg.com/news/articles/2017-09-06/house-approves-bill-to-speed-introduction-of-self-driving-autos\n\nAlso google, apple and others that have ventured into autonomous driving look attractive", "score": 28, "replies": [{"body": "Apple is too far behind other players to buy it because of SDCs, and Google is such a monster of a company, it will take years and years for that segment of their business to have any significant effect on their bottom line. Tesla is a better pure play. ", "score": 8, "replies": [{"body": "Apple being far behind does not mean anything when they have $250 billion in cash and make $55 billion in free cash flows a year.", "score": 4, "replies": [{"body": "Great, so they'll throw their war chest at an industry that is just starting to emerge? I don't think so. They need to figure out a high margin way of getting involved, otherwise their stock price will suffer. Like everything else they do, they'll be patient, wait for the market to develop and find ways to improve on tech that is already out there. They have never been first movers in any space so it's highly unlikely that they will start here, especially with so many unanswered questions around legality of the vehicles and technology. Of course they are researching the tech, but don't expect any revenue from this area for quite some time. \n\nThe only way they might accept lower margins is if they can fully integrate the Apple ecosystem within a car and maybe offer a subscription 4G service and some other means for people to spend money on in-car entertainment. \n\nBuying their way into the market is feasible but doesn't mean Apple stock will benefit anytime soon from it. They are a cash generating machine, but aren't going to overextend their capital until the market is clear. Point is, Apple is probably a good long term play but if SDC exposure is what you want, this is not the place to put your money...yet.", "score": 15, "replies": [{"body": "People said the EXACT same thing about Apple entering the smartphone arena in 2007. They are too far behind.", "score": 2, "replies": [{"body": "Did you not read my post? You entirely missed the point. Apple is patient and are not first movers. If you want exposure to self driving cars, it's too early for Apple. If you buy the stock now, you have literally zero exposure to that market. They are too far behind, RIGHT NOW.\n\nSeeing as how the first smartphones were out in 2000-2001, that further proves my point. The market had developed enough by 2007 that they understood their competition and how to make a better product. We are in the infancy of autonomous technology right now and Apple has never been one to dive in early. Research, yes. Product on the market, no. ", "score": 10, "replies": []}]}, {"body": "4G towers built into all their cars. Buy a car, get an iPhone every year free of cost, because Apple would be the cell carrier as well. Apple could then sell the towers mass market to either other auto manufacturers or to iPhone customers depending on how big of a range they can get out of the towers.", "score": 1, "replies": []}]}]}, {"body": "> it will take years and years for that segment of their business to have any significant effect on their bottom line. \n\nCould you elaborate on that please? Because they are too big, a single break out won't affect their valuation that much?", "score": 2, "replies": [{"body": "Exactly. Let's say that Google magically sold the same number of vehicles as Tesla last year or about 75,000 units at a similar price point. If we run this scenario, then Google's revenue would be about 12% higher. However, Google is running 60% gross margins now while Tesla is around 24%. Despite the top line growth, the net margins will only increase by 3%. Point is, even if Google started cranking out this many cars tomorrow, it would be a small percentage of their net profits but even worse, their margins would start to get dragged down by the less productive segment, and this doesn't even consider the upfront costs to build manufacturing facilities and develop a supply chain. Plus, there are years worth of testing which will continue, deciding on a product to actually sell, building public trust, and years of growing sales before they could reasonably hit the 75K sales figure where Tesla is today.", "score": 1, "replies": []}]}]}]}, {"body": "The only thing I'd keep in mind is that just because a company is spearheading a technology, doesn't mean it will be the company to capitalize on it the most. I'm wary of Tesla's valuation, but I've been saying that for a while, and I am often proven wrong", "score": 13, "replies": [{"body": "The company(Tesla) is losing money left and right. Last quarters operating cash flow: ~$400M Free cash flow: ~$1.3B! They are will probably blow about $1.1B this year on operating losses and burn even more on CapEx!\n\nSelf driving cars are probably 5-10 years away in sunny places like California. In winter conditions 15-25 years away probably. Tesla will not be there unless the shareholders want to subsidy Tesla even more. They have been supported wealthy Model S and Model X owners for 5 years. Now they will start to support Model 3 and transport companies with Tesla Semi. It's good to be Tesla shareholder!\n\nNow all teslafanboys will tell me about Amazon and Apple. \n\nApple printed money on the first iPhone and they don't manufacture it. Cars are very different beast compared to $700 iPhone.\n\nAmazon was/is middleman buy from manufacturer and sell it to the customers online. Amazon had a amazing timing when they started. The online shop market was just beginning and Jeff Bezos had brilliant plan to start with books. You could get books from the publishers without paying upfront, so it did not need a lot of capital to start(Car manufacturing not so much)! Amazon has been a cash flow positive from 2001 or 2002. Amazon has made one or two capital raises... Tesla makes them yearly or bi-yearly!", "score": 1, "replies": []}, {"body": "Microsoft and Apple (and IBM and many other \"innovators\") still own a huge slice of their respective markets.  \n\nTesla has set itself up to be the standard.  Even if someone makes a better car, it will still be a small light in the shadow of the first guys with a viable product. ", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "A friend of mine is an engineer for Tesla, he recently told me how they made him sit in an autonomous car from Indianapolis to Detroit with no driving. So he sat there and watched the whole thing. He said a huge surprise was when it calculated the perfect timing in a busy round-a-bout. ", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "The other auto/trucking industry is so far behind Tesla right now but you make a good point and will eventually catch up but it will be a while.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They have a product that's by far the best product in a massive market, that's seeing significant growth. They also have the strongest brand name in that market, by almost any measure. Talent often wants to work at Tesla, compared to Volkswagen, for example. Tech is disrupting the entire auto-industry and they're sitting in the middle of Silicon Valley. \n\nThe green tech sector is blowing up as we speak. The global market for energy storage is projected to reach $26 billion by 2022. Electric car and energy solution subsidies are starting to happen everywhere. Climate change is on everybody's lips, everywhere. China is pushing hard to move their car-fleet into an electric one. Tesla is in talks of building giga-factories there as well. \n\nTeslas current gigafactory cost around 5 bio USD to build. It will be key in providing economies of scale in their battery-building. No other competitor will be near Teslas cost of building batteries, unless they also sink money into this, which they haven't done. If you believe as I do that electric cars will be THE standard in 5-10 years, all other companies are lagging more behind by every year that they don't sink money into these type of endevours. Add the fact that Tesla has sunk massive amounts into developing \"the machine that builds the machine\", and it seems like Tesla is preparing for a ramp-up in size. Innovating automation in factories will further cut costs and speed up production. This is something most companies are looking at though so I wouldn't put it down as an advantage per se, but relatively, Tesla has pushed harder than competitors in this investment as well. \n\nIntel bought MobilEye for 15 billion USD. What's Teslas self-driving solution worth, out of their 58 billion USD market cap? How do you value this, seeing for example that their machine learning algorithms has logged more miles than MobilEye has, by far. \n\nI suppose that Elon is a charismatic and innovative leader... That's not their only \"primary advantage\" though. ", "score": 1, "replies": []}]}, {"body": "I don't think anyone that speculates on Tesla understands how much autonomous driving is a software, not hardware, problem.  \n\nThe other car manufacturers are way behind.  And Tesla systems are so heavily monitored and logged that every accident blamed on them has been easily proved to be driver negligence.  ", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lol, your TSLA shorts are never going to make you money.  ", "score": 0, "replies": []}]}]}, {"body": "Tesla didn't lose MobilEye. Teslas statement was basically that MobilEyes ability to evolve their tech had a very high engineering drag coefficient, due to having to support hundreds of different type of \"legacy\" vehichles from other companies. Tesla said they would fill the gaps in 6 months or less, which I believe they did, technically. Good luck with your shorts, I'm happy on the other side of the bet.", "score": 0, "replies": []}]}, {"body": "I so missed the buying oppurtunity on this stock..", "score": 3, "replies": []}, {"body": "Just want to toss out another thought.  Everyone is looking at Tesla's ability to make cars and comparing them to Chevy and Nissan.  \nBut Tesla also makes smart home batteries and solar roofing panels.  \nThey are diversified in \"saving the planet\" and that's a market that will be strong for the next hundred years minimum.  \n\nI'll bet the \"Boring Company\" is a plan to eventually efficiently create subterranean living space which is massively more energy efficient than our current wood and metal boxes in a field.  The current plan of digging HyperLoops (for TSLA hyper trains) is strong too.  Once it succeeds, I'm sure it will be consumed by TSLA.  \nI'm not sure when SpaceX matures into the end goal of Martian colonization if it will stay separate or also merge into the TSLA giant.  But it's making huge strides launching satellites and that's going to be profitable when they settle on their reusable rocket design.  ", "score": 7, "replies": []}, {"body": "Let TSLA make us all happy and rich. ", "score": 1, "replies": []}, {"body": "IMO if you want to long tesla now, you are looking at the company as an electric company, not an automaker. Automobiles will end up being just one arm of the company albeit one of the potentially more profitable arms.  Solely as an automaker, they just can't catch up to the big dogs. \n\nFd: I work in auto sales and am long tesla as an energy company. ", "score": 1, "replies": []}, {"body": "Covered my short yesterday and went back long this morning. The truck event later this mont will make or break this stock in the short term. Long term, you're investing in Musk, not just TSLA. If you think he is an innovator, keep buying. If not, sell.", "score": 1, "replies": []}]}
{"title": "Predicting a 10-12% market correction in the next 6 months.", "selftext": "I'm seeing a correction coming up.  Not a massive one.  Right now I'm holding about 20% cash and am waiting for a correction.\n\nIt will be a mild correction but a great time to get back into the market.   Right now I'm making a list of stocks that I will buy up once it happens:  GOOG, AMZN, AAPL, SHOP, ect.\n\nI could be wrong but at worst I think the overall market will be up maybe 1-3%.  I like my odds.", "id": "6yn4j7", "created_utc": 1504790097.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 32, "comments": [{"body": "These market crash post are getting out of control (multiple times a day).\n\nLike if you have a solid and thought out thesis behind it then I'll listen but, you didn't say anything of value to support your thoughts. ", "score": 21, "replies": [{"body": "This is more about feel an instinct.  I've been in the market for 2 decades and I see all the signs of a correction.\n\nI'm not predicting a market crash.  I'm predicting a small correction of 10-12%.", "score": -24, "replies": [{"body": "Again, you literally offered nothing of value. Typing out 10 - 12% gives the illusion you are being more calculated than you are, but youre just pulling this out of your rear end. If you are saying this with so much conviction, sell everything and place puts on the SPY. Screw shorting, you have the percentage, and the time frame locked down, go with options. Let us know how it goes. If you've been on this subreddit for any time, you will see these posts happen 4-5 times a week for the last 4 years. It may happen, it may not. But without any tangible analysis, 'my spidey senses are tingling' is not a disciplined, rational way to go about investing. \n\nSource: Have worked in a hedge fund or pe fund for the last 4 years ", "score": 16, "replies": [{"body": "selling everything is idiotic because of tax consequences.\n\nThis akin to predicting that the Patriots will win the Super Bowl, and expect someone to sell their house and make a bet in Vegas.\n\nHaving 20% in cash is a huge bet already.  Sorry but I'm not wreckless like you.", "score": -11, "replies": [{"body": "I dunno, man. He's not the one making boldly specific predictions based on instinct.", "score": 11, "replies": [{"body": "Instinct and facts.\n\n1. Historically high PE ratio's\n\n2. 8+ year Bull run\n\n3. Political tension \n\n4. Middle Class shrinking and getting poorer\n\n5. Possible ETF/Index fund panic", "score": -2, "replies": [{"body": "You literally JUST posted about how smart you were to tell people to buy SHOP at an ATH but you're now predicting a 10-12% market correction... so which is it?  Should we time the market or shouldn't we? ", "score": 6, "replies": [{"body": "I run multiple strategies", "score": 0, "replies": [{"body": "I too, put half on black and half on red.", "score": 10, "replies": []}, {"body": "Dude, you have to know when to admit you're wrong. No one is saying that the market isn't really hot right now, it takes 2 minutes of looking at a stock chart to tell you that. What everyone is saying, is that you aren't brining any new material information, nor are you doing any calculations. Do you know what the S&P market cap is? Do you know what 10-12% of that is? Do you know WHY the market is *fairly* valued at Current Market Cap - 10%? If you can't answer those questions without looking them up, you clearly haven't spent more than 2 minutes on this 'analysis'. Again - no one is arguing with you saying that market isn't OVERVALUED, but to say when and why...the hottest traders on Wall Street don't have the answer to that. But reddit user /u/nbagenius2000 does?\n\n\nIf you dont mind me asking, what is your age? ", "score": 4, "replies": [{"body": "we shall see in 6 months when I'm proven right or wrong.\n", "score": 1, "replies": [{"body": "Ok so let me get this straight... \n\nANYTIME within the next 6 months the DOW or the S&P500 will drop abruptly about 12% \n...within, maybe, 10 business days? \n...and you claim this because of 4- to 10 indicators you interpret as predictors.\n...so the message to take is?\n...keep alert?\n\n\nK", "score": 2, "replies": [{"body": "Correction - the market could drop 12% or also be up about 3%. Either or in the next 6 months. K. ", "score": 1, "replies": [{"body": "Nice. I'm so informed now", "score": 1, "replies": []}]}]}, {"body": "No we wont....this isn't about whether you are right or wrong. This is about you doing absolutely no work. You're not even reading anyone's replies. You're also saying the market is going to either fall 10% or be up 3%. Like what gives. ", "score": 1, "replies": [{"body": "its all about probability.\n\n10% dip can happen.  Just as 3% spike can happen.\n\n", "score": 1, "replies": []}]}, {"body": "Nobody is saying that's impossible, they are asking for substance to your claim.", "score": 1, "replies": []}]}]}]}]}, {"body": "These things aren't exactly brand-spanking new. I mean, don't get me wrong, could happen. But sp500 could shoot up to 2800 for all anybody knows. How is it reckless to consider other contingencies?", "score": 6, "replies": [{"body": "I think its reckless to sell all your stock and go 100% in cash. That was what I was replying to", "score": -1, "replies": [{"body": "Yeah... He wasn't actually suggesting you do that. ", "score": 5, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Proper shitpost", "score": 1, "replies": []}]}, {"body": "So 10-12% drop vs 1-3% gain according to you?\n\nWhy are you only 20% cash then?", "score": 6, "replies": [{"body": "Part of it is taxes.  \n\nPart of it is insurance if I'm wrong.", "score": 1, "replies": []}]}, {"body": "If you're so sure it's going to happen, why don't you short something, or buy a bear ETF? \n\nPost pics. ", "score": 3, "replies": [{"body": "Nope.  Shorting is dumb.  I will not be a slave to time value.", "score": -4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "nope.\n\nShorting you are paying for time value.\n\nI don't play that game.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Nah.  Like I said I don't pay for time. I let time pay me.\n\nThat's why I don't short, buy on margin, or naked options.\n\nI take advantage of time by collecting dividends, selling covered calls.", "score": -2, "replies": [{"body": "It's a consistent strategy nonetheless, respect", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "A 10%-12% correction is not going to happen overnight. Better to keep your money in the market(either European or bonds) than in cash if you're that risk adverse. There will be ample warning before a correction or crash. People are bad at predicting future events. Especially bad at predicting tops and bottoms. As long as the overall trend is up, you shouldn't be betting against the market.", "score": 2, "replies": [{"body": "I agree.  It will be a pretty slow drip to a 10% correction.  I don't expect the market to drop 10% in a few days.\n\n", "score": 2, "replies": []}]}, {"body": "> I could be wrong\n\nWell, never mind then.\n", "score": 1, "replies": []}, {"body": "RemindMe! 6 Months", "score": 1, "replies": []}]}
{"title": "Trader allegedly pays ex-Amazon employee and frat bro $10,000 to steal earnings results", "selftext": "[deleted]", "id": "6ypyk9", "created_utc": 1504816754.0, "score": 85, "upvote_ratio": 0.95, "num_comments": 32, "comments": [{"body": "Made >$100,000 insider trading then settle for $30,000 without admitting wrongdoing.  Sure showed him!", "score": 78, "replies": [{"body": "Did the SEC forget how math works?\nSounds like a pretty good trade still.", "score": 34, "replies": [{"body": "Nah, the SEC has never given a shit about punishing people, they just want a cut of those sweet gains so Mattis can buy more F-35s", "score": 38, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Nah, them shits are going sit on the tarmac until the next generation of fighters come out while the A-10s do all the work.\n\nBusiness as usual.", "score": 7, "replies": [{"body": "Would stick my dick in all barrels of that cannon. Brrrrrrrrrrrrrrrrrrrrrt.", "score": 4, "replies": [{"body": "Ah, I see I've found another BRRRT-kin", "score": 6, "replies": []}]}]}]}, {"body": "Agree with the first sentence. But what does SEC have to do with LMT? Thanks.", "score": 1, "replies": []}]}, {"body": "Is this article possibly incorrect? Other outlets as well as the SEC are reporting Kennedy and a third actor (Saghedi) settled for a combined $35k, with no mention of a deal for Rezakhani (the one who made $100k).\n\nhttps://www.cnbc.com/2017/09/07/former-amazon-employee-allegedly-gave-earnings-results-early-to-friend.html\n\nhttps://www.reuters.com/article/us-amazon-insidertrading/former-amazon-com-analyst-pleads-guilty-to-insider-trading-idUSKCN1BI2V4\n\nhttps://www.sec.gov/news/press-release/2017-160", "score": 2, "replies": []}]}, {"body": "Even with the 10k he paid for the info factored in, he's still up 70k+", "score": 9, "replies": []}, {"body": "Factor in the 10k he paid originally and the taxes on the gains...idk if I like that risk/reward.", "score": 3, "replies": []}, {"body": "That's how banks work. Jpm wasn't kidding when he said fine me. I pay and write it off as tax deductible ", "score": 9, "replies": [{"body": "Fines are not tax deductible ", "score": 11, "replies": [{"body": "I wish they were...", "score": 1, "replies": []}]}]}, {"body": "I always wondered... It really wouldn't be that hard to steal earnings results for a company you worked at with a little social engineering and a whole lot of illegal behavior.\n\nHow would they even find out if you made a lot?  You could easily just have YOLOd on the security.\n\nEdit: sounds like he was just am idiot and publicly posted his illegal activity.", "score": 2, "replies": []}, {"body": "Not sure, but they're probably also banned from the securities world now.\n", "score": 0, "replies": []}]}, {"body": "Where the fuck did he post the information at? Cause I need to start visiting over there instead", "score": 30, "replies": [{"body": "r/insidertrading", "score": 5, "replies": []}]}, {"body": "Walked away with 80k and didn't admit fault, fuck me", "score": 30, "replies": []}, {"body": "He's an idiot... should've used options not $1.7mill in commons.. he would've made at least 10x those gains ", "score": 28, "replies": [{"body": "You know how much it would suck to have it beat and tank?  Imagine having $NVDA earnings in late July and taking a second mortgage and loading the boat with calls, and on the day of earnings be up 500% and think 'I'm gonna hold because this will beat'... I'd seriously $ROPE something like that.", "score": 13, "replies": [{"body": "Or like $ULTA earnings recently... beats and grows with an enormous sell off. ", "score": 6, "replies": [{"body": "On second thought I think 10K worth of puts is probably more worthwhile than spending 10K to get insider information.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": ">Rezakhani first tried to steal $700,000 worth of iPhones by claiming they were lost in the mail", "score": 4, "replies": []}, {"body": "I wonder if he hid some of the cash, with a criminal record like this, no way he's getting a good job after getting out. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, the Wolf of Wall Street fan type of guy. A total loser pretending to be super important.", "score": 1, "replies": []}]}]}, {"body": "Ladies and gentleman the biggest faggot in the world. Those on WSB could only be so lucky being like him.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I thought that the funniest thing about this was that posting their trades to social media was part of their strategy to attract investors, lol", "score": 3, "replies": [{"body": "It would have been a good idea if he wouldn't have posted the exact financial numbers Amazon ended up having for those earnings...", "score": 2, "replies": []}]}]}, {"body": "Damn need to start hitting up my fraternity brothers for some insider info.", "score": 7, "replies": [{"body": "You miss them inside you a lot huh?", "score": 17, "replies": [{"body": "Yeah I'm a huge faggot", "score": 3, "replies": []}]}]}]}
