{"title": "Amazon’s quest for constant growth is not leaving it with many friends — except for Wall Street", "selftext": "https://www.cnbc.com/2019/08/11/amazon-is-losing-many-friends-but-not-wall-street.html\n\nFor the fourth straight month, all 45 analysts with ratings on Amazon’s stock recommend buying it, making it one of just three S&P 500 companies with a perfect “buy” rating, according to FactSet.\n\nWall Street is proving to be Amazon’s biggest ally even as the company is facing an expanding roster of enemies.\n\nAnalysts say the potential for a recession and antitrust probe are the two biggest risk factors facing Amazon.", "id": "coxap8", "created_utc": 1565533336.0, "score": 452, "upvote_ratio": 0.96, "num_comments": 60, "comments": [{"body": "Why anyone listens to an analyst anymore for buy and sell ratings, is beyond me. If they had to live off of commissions for being right, they would all be broke and looking for another job.", "score": 63, "replies": [{"body": "Well ain’t that the truth, what is the value of analyst beyond an opinion?", "score": 5, "replies": [{"body": "They give you research and data you might not otherwise find. Better to draw your own conclusions tho", "score": 11, "replies": [{"body": "Correct. Follow analysist that post good data that you can use to craft your own investment strategy. Or just buy the index and be happy with your life.", "score": 4, "replies": []}]}, {"body": "Their opinion drives the sentiment which drives  the stock value", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sorry not sorry", "score": 1, "replies": []}]}]}, {"body": "What else has a perfect buy rating?", "score": 65, "replies": [{"body": "Assurant and Diamondback Energy", "score": 61, "replies": []}, {"body": "Waste Management?", "score": -20, "replies": []}]}, {"body": "When is it finally going to buy a home improvement retailer?", "score": 57, "replies": [{"body": "Probably when the housing market caves again and they buy up all the foreclosed homes. Then they'll renovate them all with their newly purchased home depots. Then they'll rent them out to their workers who will pay rent with Amazon Bux.", "score": 104, "replies": [{"body": "They’d probably turn my living room into a warehouse distribution center.", "score": 38, "replies": [{"body": "And advertise it as same day delivery", "score": 18, "replies": []}, {"body": "Wouldn’t work since I’m assuming your house has bathrooms.", "score": 8, "replies": [{"body": "This bedroom has an oven in it", "score": 2, "replies": []}]}]}, {"body": "They will just make automated house repair robots and rent them on the new AmazonBNB. Free toilet paper for prime members with a 10 day stay!", "score": 6, "replies": []}, {"body": "Amazon invested in PlantPrefab which makes modular homes so wouldn't be surprising.", "score": 1, "replies": []}, {"body": "Very cyberpunk.", "score": 1, "replies": []}]}, {"body": "Well Lowes hired JcPenny's former CEO and axed a bunch of employees. So they'll probably purchase them in the next housing crisis.", "score": 4, "replies": [{"body": "Shoot, that’s means I’d work for Amazon. Is that a good or bad thing?", "score": 0, "replies": []}]}]}, {"body": "Why does Amazon need friends?\n\nIt is far better to do yourself if you can.", "score": 130, "replies": [{"body": "I feel like there’s an allegory about sex/masturbation here, but I can’t put my hand on it", "score": 90, "replies": [{"body": "Ha!   Yes I can see that.", "score": 7, "replies": []}, {"body": ">can’t put my hand on it\n\n( ͡º ͜ʖ ͡º)", "score": 17, "replies": []}]}]}, {"body": "Not from the US but what makes Amazon so loved by wall Street?\nAnd going by that could it mean that it's overbought?", "score": 30, "replies": [{"body": "I guess they expect it to dominate ecommerce like Walmart dominated retail.   I'm skeptical.", "score": 30, "replies": [{"body": "Well their growth is slowing and they have hit market saturation in the primary markets. That's why they trying new things, they need new industries or they stagnate.", "score": 8, "replies": [{"body": "I think continued growth with increasing efficiency will mean more returns for investors. They have so many places to look for efficiencies that they haven’t tapped into yet. It’s crazy", "score": 3, "replies": []}]}, {"body": "You are skeptical? You are like 15 years late, buddy", "score": 13, "replies": []}, {"body": "Expect? It already does", "score": 3, "replies": []}, {"body": "I'm sure they will hit a brick wall at some point but the question is when? And when will they stop growing?", "score": 1, "replies": []}]}, {"body": "I'm in Singapore, but Amazon's presence is growing here via Amazon Prime (which started off badly, but is doing alright now) and AWS.", "score": 14, "replies": [{"body": "Do you use Amazon prime?\nIsn singapore dominated by the likes of Lazada, redmart, qoo10 and even taobao? The e-commerce space is so crowded that honest bee is bailing..\nI like cloud business hence aws..but when it comes to e-commerce I'm not that optimistic..", "score": 6, "replies": [{"body": "Yeahh my family is using both Redmart and Amazon Prime. The 2/4-hour delivery options are a unique feature that started out horribly, but is pretty reliable now. All they need to do now is improve their offerings and partnerships within Singapore. Oh, and allow people to order through their web browsers. I've no idea why but we're only able to do so via the Prime app.", "score": 8, "replies": [{"body": "Just downloaded it. Thanks. Any idea whom they are partnering with? Prices are not expensive as I assumed. might give it a try on lazy days even though I have a supermarket within 50metres from my place. Lol", "score": 2, "replies": [{"body": "Yeahh prices are ok! As far as I know DBS card users get $10 off deals every once in a while, but there's not much else in terms of partnership yet.\n\nTotally understandable. Since the younger generation is going to have more dual income families, ordering groceries in has been becoming much more popular. Heck even the current aging population have been using tech to overcome the barriers of physically going to the store.", "score": 2, "replies": []}]}]}]}]}, {"body": "AWS is the real answer here. Even if they lose an antitrust case I don't see breaking them up as a disadvantage.", "score": 5, "replies": []}, {"body": "1. They’re quickly heading towards being a virtual monopoly to online commerce. This means they’ll be multiple times as big as Walmart in a decade or so \n2. AWS is like they have a small stake in every tech company that builds on their platform. This pool of companies is exploding right now. \n3. All of the top tech universities in the word basically feed their top students directly into amazon. They have some of the most talented R&D people in the world working on whatever they want to do next. Amazon can point at an industry and dominate it within 5 years", "score": 2, "replies": [{"body": "> They’re quickly heading towards being a virtual monopoly to online commerce\n\nThey won't be a monopoly until they can fix their shit search system.", "score": 0, "replies": []}]}, {"body": "They low-ball & squeeze every supplier, vendor partner  they do business with worse than Walmart & employees, but gawd damn that stock performance is str8 killing it yo, Nom saying?!", "score": -1, "replies": []}]}, {"body": "So... short Amazon is what you're saying?", "score": 12, "replies": [{"body": "Buybuybuy, will be back to 2k.", "score": 11, "replies": []}]}, {"body": "Cuz amazon trades based on its growth so a slowdown could cause it to go down sharply. Amazon trades at like 50x earnings and 20x book value. What does this mean? Let’s say you have 1m dollars in cash. Someone would have to pay  20m to purchase you.  Once they purchase you, all you earned last year is 400k. So it will take 50 years for them to recoup their cost assuming the same growth. The key is if amazon grows, then it will be worth their while. If it doesn’t then it was a poor investment. Cuz you could literally get more with a 50 year bond, or a preferred stock.", "score": 12, "replies": [{"body": "20x book value makes me a little nervous.", "score": 8, "replies": []}, {"body": "The forward P/E of 54 is based on analyst estimates of future earnings, which are probably too optimistic given the likelihood of entering a recession in the next year. The trailing P/E is 75.", "score": 5, "replies": []}]}, {"body": "So other than its customers and investors Amazon has no friends? Sounds brutal!", "score": 4, "replies": []}, {"body": "Feel like Amazon gets a lot of heat from misinformation about how they run their business.", "score": 5, "replies": []}, {"body": "What comes up must got down. I wonder how far they will go though", "score": 1, "replies": []}, {"body": "Let’s play....monopoly.", "score": 1, "replies": []}, {"body": "Blockchain is developing rapidly, and it led to appearing of Barter ecosystems. Due to Barter smartplace you are able to conduct secure and confidential transactions all over the world!", "score": 1, "replies": []}, {"body": "I have no stock in Amazon but I am cheering for its success", "score": -3, "replies": [{"body": "Why? I get it if you're an investor, but do you really want one company to own the supply chain of everything?", "score": 7, "replies": [{"body": "He probably has property in Nova. Shit is out of control though besides property values going up. From what I hear, homeless are getting shipped in to areas that have never seen homeless like Alexandria, Arlington, even Ashburn. And not to mention the traffic. Amazon is bad for America.", "score": 1, "replies": [{"body": "Wtf does Amazon have to do with homelessness?", "score": 1, "replies": []}]}, {"body": "You’re overstating it. If I could afford Amazon stock, I would. I’m hoping this trade war with China heats up so it might be in my range. That said, I like them as a company because they deliver good service fast. I’m also supportive of them selecting my area for HQ2.", "score": 1, "replies": []}]}]}, {"body": "Better to be feared than loved.", "score": -4, "replies": []}, {"body": "Could someone elaborate on this.... both Oracle and Microsoft are both competitors of AWS which is where Amazon makes most of it's profit....  \n\n*\" When there’s a recession, there’s a slowdown in revenue, and a big market correction usually follows. And consumer companies like Amazon tend to be more exposed to those downturns than enterprise companies like* [*Microsoft*](https://www.cnbc.com/quotes/?symbol=MSFT) *or* [*Oracle*](https://www.cnbc.com/quotes/?symbol=ORCL)*, who get the bulk of their revenue from business customers\"*", "score": 0, "replies": []}, {"body": "[removed]", "score": -8, "replies": [{"body": "Lololol", "score": 3, "replies": []}]}]}
