{"title": "Example of Bear Raid strategy today", "selftext": "[removed]", "id": "bsi151", "created_utc": 1558710419.0, "score": 3, "upvote_ratio": 0.54, "num_comments": 62, "comments": [{"body": "So when TSLA was going up a lot was that an illegal bull raid?\n\nIt’s a volatile meme stock and you’re overthinking this", "score": 58, "replies": [{"body": "Never illegal to go up. To infinity and beyond.", "score": 5, "replies": []}, {"body": "[deleted]", "score": -12, "replies": []}, {"body": "[deleted]", "score": -13, "replies": [{"body": "How heavy are those bags lil guy?", "score": 24, "replies": [{"body": "If he were holding any more bags, his 2 arms would rip off.", "score": 6, "replies": []}]}, {"body": "I think it’s gone up 30 points in like 2 days on more than one occasion", "score": 8, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Look at a daily candle chart around earnings last October. Went from 260 to 340 in like a week", "score": 12, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": ">It’s a volatile meme stock and you’re overthinking this\n\nHim\n\n>So you think they artificially inflated Tesla stock and now they're artificially deflating it? That makes it even more interesting.\n\nYou\n\nYou're a fucking retard.\n\n>I wonder if this is happening in other companies as well. They say market manipulation has become very common.\n\nWho is \"they?\"\n\nThat's a rhetorical question by the way, because I know \"they\" is you, and as you've made very clear with this thread, you're mentally incompetent.", "score": 13, "replies": [{"body": "(((they))) obviously", "score": 7, "replies": []}, {"body": "\"They\" obviously refers to the secret cabal of globalist cucks trying to make Tesla fail because \"they\" want to turn all the frogs gay\n\n[https://www.youtube.com/watch?v=_ePLkAm8i2s](https://www.youtube.com/watch?v=_ePLkAm8i2s)", "score": 4, "replies": []}]}, {"body": "No - I didn’t say that at all. \n\nYour entire thought process here just smells of someone who doesn’t like what’s happening with the stock and wants someone / something to blame so they turn to conspiracy", "score": 9, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I feel like you just read your first book on the stock market and you wanted to show off by sputtering some sentence fragments from it on the internet", "score": 5, "replies": [{"body": "Heh. \"read.\"", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Ok man...good luck with your crusade", "score": 3, "replies": []}, {"body": "Snowflake alert! Cant think outside his “I am perfect because mom taught me so” bubble so has to blame the world around him for all his mistakes! God help us when this moronic generation is the one running the country.. And for heaven’s sake, please do not false praise your children!", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "Apparently that's market manipulation according to this mouthbreather", "score": 11, "replies": [{"body": "And ofc, the crazy eyed Ark bitch making  a $4k call isn't market manipulation.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Literally anything you see will make you think you're right, because you're a retarded conspiracy theorist who's entirely beholden to confirmation bias.\n\nI'll ask again, how heavy are those bags feeling?", "score": 23, "replies": [{"body": "This my friend is called transference and what destroys the majority of retail traders.", "score": 6, "replies": []}]}, {"body": "\"All of these people coming into the comments to dispute the fact that climate change is a hoax makes me think I'm right\"", "score": 4, "replies": [{"body": "Lmao global warming was the hoax. Climate change is a cover up for global warming never happening. Climate change is just as retarded as it’s pretty obvious the climate will change in the future as the past has already proven this", "score": -1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I don't recall people ever being too polite to anti-vaxxers when they respond to them", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "My point is that \"people are arguing with me means I'm right\" would validate some pretty stupid opinions", "score": 6, "replies": []}, {"body": "Just gotta answer the question my man... how heavy are those bags feelin?", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Saying company that kept burning money will go bankrupt is somehow securities fraud?", "score": 14, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "k, what's your point?", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "The rule is the rule, no one forced you to play the game, if you think the shorts are driving the price below the value then why don't you double down and buy more TSLA?\n\nYou made a poor financial decision and the least you could do is to own up to it and learn from it.", "score": 10, "replies": []}, {"body": "Serious question, what do you think fair value of TSLA share price is?", "score": 2, "replies": []}]}]}]}]}, {"body": "idiot telling himself stories", "score": 7, "replies": []}, {"body": "Grapejelly stop making alts.", "score": 7, "replies": []}, {"body": "Normally I feel bad for Tesla bulls but this one I'm okay with losing all of his money", "score": 11, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "No one believes you", "score": 13, "replies": []}, {"body": "Yeah none of that is stock manipulation. Neither is Elon Musk's pre-market and after-market purchases (even though the whole purpose of doing that is to move the stock price). This is how the market works. If a company is failing, of course there are going to be news articles about it. What the hell else do you expect them to do with their time?\n\nIf you really think Tesla is being manipulated look at the bond market. The bond market has been predicting this movement in the stock price for months now (and still thinks it will go down further). The bond market doesn't even think Tesla will be able to repay the 566M bond they have due in November.", "score": 9, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "This started out funny but you honestly seem like you need psychiatric care, I almost feel bad for mocking you", "score": 6, "replies": []}, {"body": "Holy shit you're an idiot. Serious question: were you the result of inbreeding?", "score": 4, "replies": [{"body": "Seriously, what the fuck did I just read? Convertibles wouldn't exist without short selling? How fucking gaped must this guy's asshole be too pull this much bullshit through it?", "score": 5, "replies": [{"body": "Dude I don't even. I'm pretty sure we're living in a simulation and this dude's code got garbled.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Well, you're a rare form of dumbass. Why are you even on here with so little financial literacy? Go somewhere where you belong. Nobody here is going to explain anything, we'll just make fun of you.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "> Why does the SEC intervene to stop CEOs from lying about their company, but not for analysts who are literally just doing their job?\n\n-OP", "score": 4, "replies": []}, {"body": "Why would the SEC get involved if a company is worth 0$ and it’s share price goes to 0$. If anything analysts are doing investors a favor and letting them cash out high rn", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "the future price will be around $120, where is the strongest support level, so... please wait until the next year to open long positions. r/marketknows", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "well said, sometimes the market is illogical and irrational. $tsla is a good case to learn it.", "score": 2, "replies": []}]}]}, {"body": "So if Uber lyft and beyondmeat go down it’ll be because of bear raid too right? Stocks can only go up.", "score": 2, "replies": []}, {"body": "Example of a Butthurt Bagholder strategy today", "score": 3, "replies": []}, {"body": "We all know (((they))) did it, right Mel?", "score": 1, "replies": []}, {"body": "It's NOT FAIR that these analysts get to set an arbitrary price for the stocks I spent my hard earned moneys on!", "score": 1, "replies": []}, {"body": "Drink your soy milk and calm down. 💁‍♂️", "score": 1, "replies": []}, {"body": "What investments do you hold?\n\nI'd like to understand your positions so I can start doing my DD on those stocks", "score": 1, "replies": []}, {"body": "So saying an unprofitable company with enough funds to last another 10 months will go to $0 is manipulation? It seems like logic to me", "score": 1, "replies": []}, {"body": "Bro you can’t take the cars through a fucking car wash", "score": 1, "replies": []}, {"body": "This belongs on stockhouse.", "score": 1, "replies": []}, {"body": "Elon now has the SEC, in theory, watching over him and TSLA like a hawk. They should be able to sniff this out easily if watching so closely. Now, if they take action is another thing. It’s such obvious price manipulation when analysts are throwing out a $10 share price that doesn’t come from dilution. Especially for a company with billions in revenue.\n\nI think you are right on point.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Didn’t say they weren’t. That just adds to the retardation of analysts in general", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "What if you weren't getting your asshole gaped by your shitty trades? \n\nI'm guessing that would be the case in your fantasy world too.", "score": 7, "replies": []}, {"body": "wow, that's some salty tesla bull right there", "score": 1, "replies": []}, {"body": "Then they better hope Elon doesn’t hit the guidance for 2019", "score": 1, "replies": []}]}]}, {"body": "Lol the sec aint worried about the average Joe tho. U know this man.", "score": 0, "replies": []}, {"body": "News flash: there are very few genuinely unbiased sources of information when it comes to trading stocks. Everything from analyst ratings to CNBC is a way to legally push stock in one direction or another. Look at how the volume of shill articles or hit pieces increases before an ER. Welcome to the real world.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Go tell that to Andrew Left", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Left publishes baseless hit pieces that serve no purpose other than to rile up the market while his firm uses that momentum to make bank from shorting their target.", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Or you can just do what everyone else does and buy puts on whatever he writes about, regardless of whether what he says is true or not, and make some money off of it", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Yo there are so many scammers trying to pump the stock back up, more likely those sociopaths than a bear raid. Institutional investors who were long are selling and shorts smell blood, that’s all you need for the price to fall.\n\nI’ve traded options on a pump and dump before, bought puts once I discovered the fraud. \n\nLook up Longfin when you have the chance, most securities scams look like this, except options traders were in for a once in a lifetime fuck up for being right.\n\nTesla is just a shitty company and are more likely to be fraudulent on the corporate side. There may be shady stuff on the long side as retail investors get desperate over their heavy bags and try to convince others to bid the stock up so they can sell at a better price.", "score": 0, "replies": []}]}
