{"title": "Google cuts ties with Huawei. That may be a ‘kill switch’ for the Chinese firm’s global smartphone ambition", "selftext": "https://www.cnbc.com/2019/05/20/google-stops-some-business-with-huawei-could-hit-its-global-smartphone-ambitions.html\n\nGoogle has suspended business activity with Huawei that involves the transfer or hardware, software and key technical services.\n\nThat means Huawei will not be able to license the Android operating system complete with Google services and will instead have to use an open-source version.\n\nAnalysts said that could cause big problems for the company internationally, where nearly half of its smartphone shipments go.\n\nOther Huawei suppliers, including Qualcomm and Intel, reportedly told employees they will not sell to the Chinese firm until further notice.", "id": "bquosb", "created_utc": 1558353901.0, "score": 374, "upvote_ratio": 0.97, "num_comments": 88, "comments": [{"body": "Huawei are shady as shit, run by a known member of the chinese miltary brass. If anything we should be treating them as state funded entities, western capitalist companies (that dont have state backing) can't compete.\n\nChina uses these types of companies to create beachheads around the world, gathering influence, infrastructure and leverage - and that's not even including the epic corporate espionage.", "score": 177, "replies": [{"body": "Couldn't agree more.\nNot so long back, One plus was caught sending data to Chinese servers.\nBlessing in disguise for apple and Sammy..", "score": 32, "replies": [{"body": "Source on this?\n\n\n____________________________\nSent From My OnePlus 6T", "score": 10, "replies": [{"body": "https://www.notebookcheck.net/OnePlus-caught-swiping-user-data-again-only-this-time-also-sending-it-to-China-controlled-servers.277702.0.html", "score": 13, "replies": [{"body": "Well, shit. Th...thanks.", "score": 7, "replies": []}]}]}]}, {"body": "Who spies better China or US?  US is WAY better because they rarely get caught.  Nobody knew that the world was spied on.  It took an snitch to shock the world to what NSA was up to.  Just Google Snowden.   Who is better at Industrial espionage?  USA #1.  WHY?  Because US spies rarely get caught!!  China spies are clumsy and amateurish.  These idiots get caught all the time!   Can China be trusted?  Hell no!  But US hands is just as dirty.  You all need to separate propaganda from reality. \n\nhttps://m.dw.com/en/germany-fears-nsa-stole-industrial-secrets/a-16925289", "score": 2, "replies": [{"body": "If it’s going to happen I rather have he USA spying on me rather than an authoritarian dictatorship.", "score": 1, "replies": []}]}, {"body": "I totally agree. We should be treating Facebook, Cisco and google the same way!", "score": -15, "replies": []}, {"body": "So you support Trump....\n\nEdit: how funny, this was Trump's doing, all kinds of support and I'm getting downvoted lol", "score": -19, "replies": [{"body": "You’re getting downvoted for injecting politics into this for no reason.", "score": 4, "replies": [{"body": "So not going to answer my question as to who did what you support?", "score": -11, "replies": []}, {"body": "Who did this?\n\nI'll wait", "score": -11, "replies": []}]}]}]}, {"body": "I already give my information to Facebook, Apple,  Google, AT&T and the US government why to give them now to a Chinese company?", "score": 11, "replies": []}, {"body": "I felt a great disturbance in the Force, as if millions of spies suddenly cried out in terror and were suddenly silenced.", "score": 25, "replies": []}, {"body": "Well there goes Huawei’s chance of overtaking Samsung.\n\nI can’t help feel a little bad. I mean what they’re being accused of is no different than what the US intelligence community does to Cisco and the likes.\n\nAt the same time, this company has been caught doing weird shit like this, stealing IP and has been unapologetic about it. \n\nSo fuuuck them.", "score": 88, "replies": [{"body": "[The difference being that Huawei literally had a bonus program to encourage employees to steal.](https://qz.com/1536508/staff-allegedly-got-more-money-the-more-valuable-the-stolen-information/)\n\n&#x200B;\n\nHuawei USA went on to say,  “here in the USA we do not condone nor engage in such activities and such a behavior is expressly prohibited by \\[Huawei USA’s\\] company policies” but also said “in some foreign countries and regions such a directive and award program may be normal and within the usual course of business.” \n\n&#x200B;\n\nNot a good look.", "score": 79, "replies": [{"body": "Which is why I wrote the “unapologetic” about it part.\n\nIirc they stole something from T-Mobile and other tech companies during collaborations awhile back and got sued. They didn’t deny they stole, but they didn’t consider it theft.", "score": 23, "replies": [{"body": "They'll just view it as rightful reparation for their [century of humiliation.](https://en.wikipedia.org/wiki/Century_of_humiliation)", "score": 3, "replies": []}]}]}]}, {"body": "Good move, I do not trust Huawei at all, even my friend's father who's chinese thinks it's an easy way to get your personal info from phones and that the chinese gov't would be more than willing and capable to do so.", "score": 25, "replies": [{"body": "I think everyone in Asia knows this? Chinese people know Huawei is the golden child of the CCP.", "score": 13, "replies": []}]}, {"body": "Google payback for China booting them out of the country.", "score": 11, "replies": [{"body": "I doubt Google want this, it’s definitely gonna hurt their bottom line", "score": 4, "replies": []}, {"body": "China did not boot them out.   China government hacked Gmail accounts of their citizens in 2010.  Google picked up and left on their own.", "score": 1, "replies": []}]}, {"body": "The Chinese will retaliate. The question is how?", "score": 12, "replies": [{"body": "Enter firm shuashwei. With eerily similar smartphones to some other company, huawei, no relation", "score": 55, "replies": [{"body": "Jokes aside, I think they might do something drastic like banning iPhones or Windows 10 or whatever and drag another company into this mess, and that company is not gonna like that", "score": 13, "replies": [{"body": "They will get their iPhones and cracked windows 10s. China isn’t known for playing by the rules, which is what got them in this mess in the first place.", "score": 24, "replies": [{"body": "Cracked iPhones isn't really helping apple though is it? If they ban iPhones or anything similar, that company will be dragged into this since they definitely want to be in the Chinese market.", "score": 2, "replies": [{"body": "What I meant was they would never meaningfully impose a ban on iPhones and windows.\n\nWindows is crucial for their industries. iPhones are crucial for their egos, it’s one of the ultimate status symbols there for the middle class. Remember the kid who sold a kidney for an iPhone 3?", "score": 11, "replies": []}]}]}, {"body": "They won't touch apple. It impacts them just as much if not more if apple slows down.", "score": 13, "replies": [{"body": "arent the apple suppliers' factories all in china anyway, so yeah china will cry if they touch apple", "score": 9, "replies": [{"body": "Yep, suppliers and assemblers. Apple slowing down impacts China as well.", "score": 6, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 27, "replies": [{"body": "Its true.  Go to Beijing, China and your google services won’t work at all.  I been there last yr.", "score": 5, "replies": []}, {"body": "Well, that doesn't stop them from going hard on this to ensure that this ban on Huawei is lifted. This ban is also really unpopular here in Europe, where the blame is put on Trump. A lot of people have Huawei phones here.", "score": -17, "replies": [{"body": "I'm certainly not defending him, but how is the blame put on Trump for this?", "score": 12, "replies": [{"body": "Because Google did not want to do this, but was forced by the us government. Trump is the face of the us government", "score": -7, "replies": [{"body": "No, they weren't forced to do anything other than get a special license in order to sell to them.", "score": 2, "replies": []}]}]}]}]}, {"body": "they just recalled their pandas from the san diego zoo", "score": 3, "replies": [{"body": "Had to look that up, they've already been shipped back to China. Damn", "score": 2, "replies": []}]}, {"body": "Do they really need? This also hits US suppliers and im pretty sure that google is also not gonna be happy losing millions of users.", "score": 4, "replies": [{"body": "When China banned Google Services, Google should have stopped them from using Android in their smartphones.", "score": 15, "replies": []}]}]}, {"body": "Good move Google. Happy shareholder right here.", "score": 3, "replies": [{"body": "Think it was more Trump then Google.", "score": 1, "replies": []}]}, {"body": "Was kind of surprised about 2 years ago, Chinese coder showed me his Chinese phone and apps.  I was pretty blown away. My iPhone seemed ancient.  \n\nStunned they were that far ahead.", "score": 5, "replies": [{"body": "Any examples?", "score": 2, "replies": [{"body": "[http://technischehilfe.blogspot.com/2016/02/google-installer-for-meizu-or-xiaomi-or.html](http://technischehilfe.blogspot.com/2016/02/google-installer-for-meizu-or-xiaomi-or.html)", "score": 1, "replies": []}]}]}, {"body": "Good", "score": 3, "replies": []}, {"body": "Cheap Chinese built OS to take over the world in 3..2..1..", "score": 4, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Huawei sucks dude, name one feature they have that you can’t get on any other smart phone manufacturer", "score": 15, "replies": [{"body": "Free cloud storage.\n\n\n\n(*For your personal data and details, servers provided by the Chinese Communist Party.*)", "score": 36, "replies": []}, {"body": "Cheap price for higher quality, I have the honor play and I absolutely love it\n\ndisclaimer: used to buy iphones previously so what do I know about quality/cost proportions eh? ;)", "score": 7, "replies": [{"body": "Cheap price attained via IP theft is not a truly cheap price\n\nAnd also attained at the expense of privacy", "score": 25, "replies": [{"body": "Which smartphone company respects privacy?", "score": 6, "replies": [{"body": "Apple", "score": 16, "replies": [{"body": "Apple may protect you to some degree with their apps but they fail to protect your privacy thru the app store. \n\nMany apps use of 3rd APIs that developers use to augment their apps and speed development these APIs allow for your data and location information to be accessed by the app developer and the API provider.\n\n\"If Apple really cared about personal data, the company could take any number of actions to keep privacy violators off its platforms and away from its customers.\" - [source](https://www.theatlantic.com/technology/archive/2019/01/apples-hypocritical-defense-data-privacy/581680/) \n\nYou give apps sensitive information they tell Facebook while Apple does nothing to stop it - [source](https://www.wsj.com/articles/you-give-apps-sensitive-personal-information-then-they-tell-facebook-11550851636)", "score": 3, "replies": [{"body": "Ever heard of not using Facebook, cept through the website while using an adblocker? Friendly for the messaging features?", "score": 1, "replies": []}]}, {"body": "So you're saying with an iPhone the NSA can't spy on me?", "score": -6, "replies": [{"body": "He means Chinese Communist Party can't. Good luck stopping NSA.", "score": 7, "replies": [{"body": "Yeah but I don't care if the Chinese Communist party spy on me, I'm never gonna go there", "score": -4, "replies": [{"body": "In a century or two they’ll take over. So You won’t have to go there, they’ll come to you.", "score": 5, "replies": [{"body": "You do know none of us will be alive in a century or two right?", "score": 3, "replies": [{"body": "That’s the exact same line of thinking the oil execs create so they can keep putting carbon in the air. Stop being so selfish lol.", "score": 1, "replies": []}]}, {"body": "Nah, my bet is on the Canadians - nobody ever suspects the Canadians", "score": 3, "replies": []}, {"body": "I think we're very much dead by then, so who cares?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Blackberry used to but their secure software stack couldn't make up for their lack of features. Apple isn't too bad when it comes to privacy.", "score": 4, "replies": []}]}]}]}, {"body": "That's the point. It's the same features and quality for less. It's like an iPhone except it looks cooler and it costs less. Does the same things. In fact the P30 series has a better camera now.", "score": 0, "replies": []}]}, {"body": "Congrats, the chinese government has all the texts, calls, pics and passwords you've used since you started using the phone.\n\nThink I'm jokng? I'm not. American companies do it too, but they don't use their databases for spying and bribery. (Well, except for Facebook, but personally I think they were colluding with and selling out to China in the first place).", "score": -1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You should look into the NSA's data storage servers & units in Utah. The NSA publicly & openly discloses what this center is used for. Even politicians have admitted it exists publicly although they've never mentioned any specifics to date.\n\nSure, the data isn't available to just anyone, but it is being collected. You'd have to have clearance and know approximately what parameters you're seeking. Most recently it has been used to identify members and/or links/connections of violence or hate groups for tracking purposes. How do you think many of the would be suicide bombers have been stopped since 9-11? Luck? Gossip? Random? Hmmm... \n\nBTW, why do burner phones exist? If no data is being collected & stored, who cares right?\n\nIn any case, you're free to believe whatever you want.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "First, I don't believe you work in network security. If you did you would know the data (mostly) is encrypted. Yes, any idiot (you fit the bill nicely) can run a packet sniffer but very few can decode and process the results into meaningful data. I don't think you really understand what happens after your data is encrypted and sent out.\n\nSecond, there are tools that allow you to packet snoop, decrypt, process and store the data which governments & business's use. \n\nThird, all of this is somewhat irrelevant as Huawei has installed a mechanism to redirect personal data to private IPs. These IPs were used to collect (without users consent) photos, videos, contacts, emails, texts to a PRIVATE IP traced back to the Huawei & the government of the People's Republic of China. In addition, specific business's & people were targeted so Huawei could access to the data they want.\n\nThis is primarily why there are numerous open & active lawsuits against Huawei for spying on users. It's why Google & other companies are now blocking Huawei.\n\nGo read the lawsuit yourself and educate yourself on what they can and cannot do.", "score": 2, "replies": [{"body": "Haha. I don't know why I bother with people on the internet.", "score": 1, "replies": []}, {"body": ">This is primarily why there are numerous open & active lawsuits  against Huawei for spying on users. It's why Google & other  companies are now blocking Huawei.\n\nYes, Google & other companies are now blocking Huawei because they don't mind losing a customer that helps them to generate millions of revenue. Not because the U.S.A/Trump government is forcing them to do it", "score": 1, "replies": [{"body": "No, they are doing it because if corporations knowingly and willingly permit Huawei to continue with IP theft & other transgressions then those corporations will be held liable and accountable as well.", "score": 0, "replies": [{"body": "In other words, they are being forced to block Huawei, they are not blocking Huawei because they want to....", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "would this change affect the huawei matebook x pro’s in any way?", "score": 1, "replies": []}, {"body": "Sell everything!  Equities market is still frothy.  The economic cycle is in the 9th inning and I'm left to wonder what's it all about?  So is it the Trade war because of our trade imbalance or a tech war because 5g is the future and America was caught off guard and cannot accept that China is in the lead position to dictate how the rest of the world will be for the next 20 years?  Or is it the nationalist who believes \"my country first and the hell with the rest \"?   Or is this that thucydides trap developing and we're all screwed?  The Chess pieces are moving all at once over the board and impossible to see a good conclusion to all this.  Sell everything!", "score": 1, "replies": []}, {"body": "This is not a problem for Google.   They picked up and left China in 2010 and walked away from 10s of billions.\n\nThe worry is Apple.  Apple is all in with China.   They had over $50 billion in revenue in China in 2018.   The worry is the next blow with this pissing contest would be china banning iPhone sales.", "score": 1, "replies": []}, {"body": "I can't help it but feel that US are afraid that China will do what US is already doing", "score": -1, "replies": [{"body": "Are you implying that we Americans are afraid of attracting Chinese companies to invest infrastructure in the US with a promise of cheap labor but the ulterior motive of stealing intellectual property to complete against us?", "score": 1, "replies": [{"body": "I was implying something along the lines of Chinese PRISM, you know where US was violating basic rights of not only its citizens.\n\n\n\nTo the point of IP theft - I do not condone such actions, however it is not theft. There is quite literally law that states that any IP rights that are being used in China (i.e. products manufactured based on it) is in public domain 1 year after its introduction. Its not theft and companies know that, yet they still choose to rather do that than pay a living wage and insurance to home country workers.", "score": 2, "replies": []}]}]}, {"body": "ITT: Evil Chinaman bad. American good.", "score": -2, "replies": []}, {"body": "Whatever they accused of, the US has been doing for decades. This is pure bs", "score": -12, "replies": [{"body": "The world is splitting into two internets.", "score": 7, "replies": []}, {"body": "The US has been stealing it’s own IP from itself? \n\nThat’s literally nonsensical.", "score": 8, "replies": [{"body": "What a nitpicker. Stealing other countries' IP.", "score": -3, "replies": [{"body": "Please give examples. Or admit your full of shit", "score": 1, "replies": [{"body": "I'm sorry you are the largest information monitoring state in the world and you are saying you don't steal IP?", "score": 2, "replies": [{"body": "Again..... Please give examples or admit your full of shit.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Huawei tendered to supply the Australian Government with hardware to build the NBN ; (National broadband network) to supply network switch gear/routers, PON hardware etc, fortunately that tender was thrown out very quickly as even our stupid government knew it was a bad idea. This was a $60 billion dollar infrastructure project,", "score": 0, "replies": []}]}
