{"title": "[deleted by user]", "selftext": "[removed]", "id": "or9q47", "created_utc": 1627211643.0, "score": 48, "upvote_ratio": 0.84, "num_comments": 40, "comments": [{"body": "The problem with that logic is that if and when they drop you're not going to want to buy more as it's dropping because you're already in the red.\n\nIf you think it'll drop, why aren't you selling it and using the gains to buy more during the drop?", "score": 41, "replies": [{"body": "Good point", "score": 5, "replies": [{"body": "The issue with that logic is doing that exposes you to much more risk tax wise as you would have to wait 30 days before reentering or else it would fall into the wash sale rule.\n\nIt sounds to me like you need to more thoroughly assess your overall trading strategy in these positions. If you are planning to buy and hold for multiple years then sure there is less harm buying in at the top. If you do that though you have to be prepared to hold through any short term fluctuations in price. If you buy intending to hold until 2023 but you panic sell on a 5% dip from earnings then you are acting against your own investment thesis and are doomed to fail. \n\n\nMy general advice for entering any long position would be to look at the charts and identify a point of entry that you are comfortable with. When the stock hits that price enter your position and let your investment strategy run its course. Next look for a price to set a stop loss at. For example if you are bullish on a stock that is currently trading at an ATH identify a price you believe it could realistically retrace to and enter a limit order. Now that the price has already gone down from the ATH placing a stop loss below your entry has much less of a chance of being a mild correction and would more likely represent a trend reversal. The last thing I would suggest would be identifying a price that you feel if the stock were to hit in the short term would be high enough that it would be worth selling a portion of your trade to lock in profits. Doing this will take a lot of the uncertainty you may feel out of the equation when managing your portfolio and should allow you to follow your investment strategy much more consistently.", "score": 4, "replies": []}]}, {"body": "You haven't lost money until you've sold\n\nEdit: sausage fingers cant type lost", "score": -5, "replies": [{"body": "It's technically always unrealized until you sell.", "score": 10, "replies": [{"body": "There is a thing called opportunity cost.", "score": 6, "replies": []}]}, {"body": "My and my sausage fingers understand and feel your pain my man…… the other ones here…. They don’t know!!", "score": 2, "replies": []}]}]}, {"body": "If you are currently working you could always put in your money now. Then when/if the correction comes you can put in any money you've saved between now and then.", "score": 21, "replies": []}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Haha very good point and true, appreciate the reality dose", "score": 6, "replies": []}]}, {"body": "I personally would add small amounts into companies you really believe in but when they do take bigger dips you can add more with the money on the side lines.", "score": 7, "replies": []}, {"body": "Another thing that everyone needs to consider is we do not know when (or even if) a correction is going to happen. For all we know, markets are going to rise another 25% in the next six months and have a 30% correction. Hypothetically all those gains in December would look more like the market did May and June.  \n\nPoint being you don’t know what the ceiling will be and what the drop will be. It’s all perspective.", "score": 5, "replies": []}, {"body": "Having a too-low average cost basis in a long-term holding is a failure, IMO.\n\nLike if somebody is bragging that they have a $26 cost basis in $AAPL from 5 years ago. That's great, don't get me wrong, but it means that you made a good decision 5 years ago...and then never repeated that good decision?\n\nPersonally, if I think I've hit on a long-term compounder, I'm gonna want to see buys on that sucker every month and an average cost basis that keeps going up up up while the stock price does too.", "score": 4, "replies": []}, {"body": "If u can afford u could sell a otm put against them about a month out. Could probably get roughly a rate of 13% annualy on that and if the stock drops you keep the collateral and buy at a lower price. And you were gonna buy them at a higher price the day you sold the put anyways so you'd be buying them cheaper if exercised and keeping your average purchase price down", "score": 3, "replies": [{"body": "Yup I’ve been considering this more, probably will sell a put", "score": 1, "replies": [{"body": "Yeah, on one hand everyone says buy and hold but who am I to reject 15%  a year until assigned instead", "score": 2, "replies": []}]}]}, {"body": "You should have a price target in mind for each stock in your portfolio. To pick one stock lets say DIS. You should be thinking where will it be in 5 years. If you think it will hit $300 then buying now in the 175-180 range should be seen as a discount.", "score": 3, "replies": [{"body": "How does one determine a price target?", "score": 2, "replies": [{"body": "Dividend discount or discounted cash flow are two popular methods, but they may not be the right one depending on the stock/industry", "score": 2, "replies": []}]}]}, {"body": "Trying to time the market bit you in the ass. If you think these are long term plays like you said, then you should keep putting money into those stocks. If the price falls put more money in since you are bullish.", "score": 3, "replies": []}, {"body": "The market is trading at 17x fwd earnings ex top 10 snp500 stocks. The top 10 stocks trade at 30x, they also make up 30% of earnings contribution. They also have extremely suppressed earnings, see amazon, google, tesla, nvdia. Historical average for bottom 490 stocks multiple is around 15x. The thing is forward estimates are always wrong, so we are comparing estimates to actuals, the estimates always are too conservative. On average snp500 stocks beat 80% of the time, last quarter it was 96%, this quarter its 90%. This means we can assume the real forward multiple is 1-2 points lower. So right now we are at historical averages in terms of multiples. Then we also have really strong economic growth, above average (9% this year, 5% next year). Then we also have a historically dovish fed, with 180b in bond buying and 0% fed funds rate. This leads to a 1.3% 10 year yield, this not only increases money supply but also makes alternative investments relative to stocks look worse, all creating inflows to stocks. Then if u ask why u would do ex top 10 stocks they are very important, those top 10 stocks are probably the greatest value. Google trades at a market multiple ex cash ex intangibles, fb trades at a market multiple ex cash ex intangibles, amazon trades at a market multiple ex cash ex intangibles, optimized for earnings. All these top 10 stocks also have absurd revenue growth, very low terminal risk and suppressed earnings in return for future growth. Market is only over valued if you nitpick information. It’s not a frothy market, there’s always a stat at every time period that makes it look so.", "score": 5, "replies": [{"body": "Very interesting points and thank you for sharing. How do you think the expected inflation/rates etc affect the other data points your provided? That’s the only true bearish point I keep seeing brought up for what’s going to case a big correction. But I also agree with how the top ten differ from the rest of the market as well. I also am in the camp that when you believe in a company long term you can hold it regardless of conditions and sleep well at night", "score": 1, "replies": [{"body": "I think there’s a significant chance we see deflation this month next year. If you remove all the pandemic effected sectors- used cars, rental cars, hotels, airlines- there was historically average month/month inflation in core cpi. If the inflation was coming from the expansion monetary base we would see inflation in the aggregate, not just some areas with supply shortages and unsustainable levels of demand. I also think there’s a chance the massive amount ordering from this distress supply chain will leave to a supply overhang next year when supplies chains ramp back up, leading to more deflationary pressures. Also remember we measure the rate of change in inflation, if prices stay high, that is 0% inflation. I don’t see any convincing argument for persistent inflation. And to think the fed would taper or raise rates because of a chip shortage is silly", "score": 2, "replies": []}]}]}, {"body": "Just buy when ever you feel like it as long as the company is doing good. I don't give two fucks about buying at all time highs.", "score": 2, "replies": []}, {"body": "I like AMZN even in a market downturn, so I would just buy now. Barring some catastrophic development within Amazon, I don't see their stock dropping further than the market as a whole.\n\nIf the whole market sells off, you can sell your recent AMZN investment to harvest the loss and move it into something that's dropped further, and maybe has a bit more upside.", "score": 2, "replies": []}, {"body": "I would add a little to Amazon and Disney for now. DCA in. DCA into Tesla this week too as they will as usual have a little sell off after earnings.", "score": 2, "replies": [{"body": "Was thinking along these lines as well. Will probably pick up another Amazon share before their earnings call", "score": 2, "replies": []}]}, {"body": "I would consolidate into the Big Three until if and when in fact some would say that we are currently going thru the correction, but I would add to the big three and see how things pan out.", "score": 2, "replies": []}, {"body": "Dollar cost averaging is about the math and the inability to predict the market, less about emotion as you mentioned.", "score": 2, "replies": []}, {"body": "I ran into this issue years ago with Canadian weed stocks. Got in early on Canopy Growth for like $3.20/share. As it began to rise, I kept waiting for dips that didn’t come to not screw up by average.  \n\nNeedless to say I could have made way more money had I not been concerned about the average.", "score": 2, "replies": []}, {"body": "If your cash can support it, consider selling cash secured puts. Since you want the stock long term you should be getting paid to wait for a potential correction.", "score": 3, "replies": []}, {"body": "At this point. I’m waiting! I don’t see any good value and it is so volatile.", "score": 1, "replies": [{"body": "Amazon Facebook and Tesla are all at good values right now, yes I said Tesla.", "score": -1, "replies": []}]}, {"body": "You could find something that’s not overvalued that would diversify your portfolio - some mid-cap non blue chip - or just a mid-cap index\n\nPersonally, though, I like to buy intel when it’s down. That stock is like a yo-yo most of the time and trades +\\- 10%. Don’t get me wrong - I know I’ll get burnt one day and it won’t come back from the dip, or (more likely) another chip company will outperform it so I “could have done better”, but it’s been fairly reliable for me. If you would argue that nvidia or amd are a better play - buy those :-). The  chip shortage will drive quite a bit of speculation and swing trading in that sector for the next 18 mos.  if I did buy intel, I’d absolutely sell if it hit $60", "score": 1, "replies": []}, {"body": "The only way you're going to average down is if the price goes below your original purchase price.  Is that what you really want?", "score": 1, "replies": []}, {"body": "Have you considered pyramiding? Basically you put smaller amounts (like 20%) of your original investment at certain points like when the price bounces off its 10 week moving average or from a correction/dip?", "score": 1, "replies": [{"body": "Haven’t considered this but will look into it further, appreciate the advice", "score": 1, "replies": []}]}, {"body": "Sell put, it \"feels\" better than buying ATH", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - July 25, 2021", "selftext": "# This is the daily fun thread/chat. 🥳🚀\n\nAll topics are permitted in this thread.\n\nSee our Monthly thread for more in-depth discussions about news/thoughts/opinions about Tesla.\n\n^((This thread should not be construed as investment advice or guidance.))", "id": "or5der", "created_utc": 1627189215.0, "score": 23, "upvote_ratio": 0.9, "num_comments": 47, "comments": [{"body": "Elon tweets, FSD beta V9.1 coming Friday at midnight [Elon tweet](https://twitter.com/elonmusk/status/1419183525316661250?s=19)", "score": 19, "replies": [{"body": "From those of us not on Twitter, thanks for providing link!", "score": 7, "replies": [{"body": "Nae problem!", "score": 4, "replies": []}]}, {"body": "Improvements is not news worthy.  He did not say mass release is coming", "score": 0, "replies": []}]}, {"body": "[Model S Plaid breaks world record?](https://youtu.be/UHbKXoO2jCI)\n\n9.08 1/4 mile run.\n\nJust wait until it starts hitting in the 8's !", "score": 18, "replies": [{"body": "Very impressive no doubt but doubt it’ll be a huge catalyst. \n\nBugatti’s veryon didn’t push up vw share price much neither did Audi R8", "score": 5, "replies": [{"body": "I think there’s definitely a halo effect with the Plaid. How this will translate into sales, I’m uncertain, but the buzz has been good.", "score": 6, "replies": []}, {"body": "R8 sold 5000 units in it's best year. If that comparison made sense it would be a huge negative catalyst for TSLA.", "score": 1, "replies": []}]}]}, {"body": "For traders : \n\nU.S. ECONOMIC DATA THIS WEEK:\n\n*NEW HOME SALES (MON.)\n\n*CONSUMER CONFIDENCE (TUES.)\n\n*FED POLICY DECISION (WED.)\n\n*PRELIM Q2 GDP (THURS.)\n\n*JOBLESS CLAIMS (THURS.)\n\n*PENDING HOME SALES (THURS.)\n\n*CORE PCE PRICE INDEX (FRI.)\n\n*PERSONAL SPENDING (FRI.)", "score": 10, "replies": [{"body": "I DONT SEE TLSA EARNINGS", "score": 8, "replies": []}]}, {"body": "Something fishy has been going on with Tesla. \nI did some research and looked at price action leading up to quarterly report for the past 4 quarters and seems like volume was high and price slightly rose leading up to earnings and then small sell off/or stay flat.. but for this earnings run up to report we stayed flat and had very low volume? I’m guessing we might actually see a rise in price if the report is a slight beat. Probably $700 EOW? \n\nThoughts?", "score": 17, "replies": [{"body": "Thinking the exact same.  Past several earnings have seen some upswing on pre-earnings hype followed by profit taking following the reports.  \n\nThis is pretty flat action leading into earnings while creeping closer to the peak of a wedge…it definitely seems like people are looking to this earnings report to see which way we break.  \n\nFundamentally, I think Tsla is poised to smash this quarter’s estimates.  Sales are up significantly, new plants are being built, and there’s serious talk about other EV companies wanting in on Tesla’s charging grid which is a huge boon.  Not to mention FSD creeping ever closer to viability and a new subscription model…\n\nPlus anecdotally, in the past few months there’s been an explosion of Tesla owners in my parents’ relatively rural Midwest area.  If they’re pushing that deep into the flyover states, sales have been crushing it", "score": 11, "replies": []}, {"body": "I'm betting we will see upgraded price targets after earnings based on fsd subscription numbers and updated guidance for 2021 deliveries and new information around 4680, cybertruck, semi, solar roof, virtual power plant, and more", "score": 7, "replies": [{"body": "I hope they touch on those subjects as well as factories during the earnings call but have a feeling they won’t", "score": 5, "replies": []}]}]}, {"body": "Elon is tweeting memes like a madman, and commenting on lots of Tesla related stuff in the past hours. Has to be a good sign for Monday.", "score": 9, "replies": [{"body": "or he is again on twitter while tripping balls", "score": 6, "replies": []}, {"body": "[https://twitter.com/elonmusk/status/1419184341951913986](https://twitter.com/elonmusk/status/1419184341951913986)", "score": 2, "replies": []}]}, {"body": "😪 hello everyone 😪 still not Moonday. Hope you will all have a wonderful day 😘", "score": 8, "replies": [{"body": "You first!", "score": 2, "replies": []}]}, {"body": "Can’t wait for ER tomorrow!", "score": 6, "replies": []}, {"body": "[TSLA Earnings Call is tomorrow !](https://twitter.com/nitzao/status/1419391120677687298?s=21)", "score": 6, "replies": []}, {"body": "I've noted a couple of things on a post-it note. Over a week ago I saw the consensus EPS estimate was 0.93. Now the average estimate on yahoofi is 0.96. Top estimate is 1.16. \n\nI am eagerly awaiting CNBC to state Tesla missed their targets when they manage a 1.15.", "score": 6, "replies": [{"body": "CNBC, Burry, The UBS Analyst, ETC.....Such fake media. This is why people don't trust the media and vaccinations. They don't trust the media b/c the media spreads FUDs.", "score": 6, "replies": []}]}, {"body": "With the Q2 quaterly earnings comming up, what are you as invester looking for? In other words, what determins for you if the quater was a succes?  \nFor me personally, I am looking forward to the energy side of the business. Would be nice if they can become more profitable on energy.", "score": 5, "replies": [{"body": "Not much about the Q2 on itself but what they will say about the problems and timing for factories, 4680 and FSD. We know that they are supply constrain for cars and energy business. \n\nAnd I’m looking forward AI Day", "score": 7, "replies": []}, {"body": "I want to see Energy ramping up.", "score": 4, "replies": []}, {"body": "Nothing special, outlook is more important. Namely Berlin timeline, fsd subscription, fsd development in Europe (it doesn't work here).", "score": 3, "replies": []}, {"body": "Going to be a while befor energy is making money", "score": 2, "replies": []}, {"body": "Margin excluding bitcoin", "score": 1, "replies": []}]}, {"body": "Very bad typhoon and flooding in Shanghai.", "score": 4, "replies": [{"body": "Nooooooo", "score": 3, "replies": []}, {"body": "... with a bunch of Teslas driving deep in the floods.  Might look great that a car can do this, but not recommended.", "score": 3, "replies": []}]}, {"body": "https://amp-lefigaro-fr.translate.goog/societes/stellantis-annonce-la-signature-d-une-facilite-de-credit-syndique-de-12-milliards-d-euros-20210723?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=fr&_x_tr_pto=ajax,nv,elem\n\nStellantis add more debts ?… will not end well imo", "score": 3, "replies": []}, {"body": "TSLA GONNA REBOUND AND TRADE $700-$750 THIS WEEK", "score": 12, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Kanye you been saying Donda would be dropped a LONG time for now explain that", "score": 3, "replies": [{"body": "What is a donda?", "score": 2, "replies": []}]}]}, {"body": "I hope so because geesh", "score": 3, "replies": []}, {"body": "$650 EOW will be a victory for $TSLA. Monday/Tuesday and Friday will be red.", "score": -1, "replies": []}]}, {"body": "The European Central Bank just lifts limit on dividends due to pandemic … I’m pretty sure Oil&Gas and Legacy OEMs will increase dividend to please their investors … they will fail the transition to sustainable energy 🤦‍♂️", "score": 4, "replies": [{"body": "Their investors will use those dividends to invest in Tesla.", "score": 11, "replies": []}, {"body": "And they just raised prices on bank accounts and penalising balances of more than EUR100k.", "score": 5, "replies": []}, {"body": "I am all for more dividends of those companies, it will hurt them long term.", "score": 3, "replies": []}]}, {"body": "Any reports on the degree of flooding around Giga Shanghai?  I’ve been watching the radar and it looks like the Typhoon just stalled right over Shanghai.  I’d be surprised if they didn’t have to shut down for a few days or longer.", "score": 4, "replies": [{"body": "Yeah and what about all the cars in the lots...", "score": 2, "replies": []}]}, {"body": "Fiŕßtt", "score": 1, "replies": []}, {"body": "Model F - Family car surprise tomorrow. And a solid CRUSH on adj EPS.", "score": -2, "replies": []}]}
{"title": "Rivian Valuation", "selftext": "Do any of you dirt bags know (like know-know) the current valuation of Rivian after the most recent 2.5B capital raise?  Allegedly they were valued at 27.6B after the equity raise about 6 months ago, so I’m guessing 40-50B. The media is reporting a  forecasted IPO valuation of 60-70B which if you ask me is insane. \n\nComparing to Tesla: IPO valuation was 1.6B and they only raised ~225M.  I know every Tom, Dick, and Harry is expecting great things out of Rivian, but honestly I can’t justify 70B for a company with no revenue and limited production limited production forecast. Don’t get me wrong, Tesla’s valuation is outrageous too, but at least they have 5 models of road proven cars, a network of service centers, ~2000 supercharging stations, the fastest production car ever and hold the lead in AI driving by a couple years. \n\nDisclaimer: I work for TSLA, but not donning rose colored glasses.", "id": "orgi1s", "created_utc": 1627236144.0, "score": 41, "upvote_ratio": 0.81, "num_comments": 45, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|5 months ago\n**Total Comments**|23|**Previous DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Just a fun side note: rivian was used in that apple tv+ series “Long Way Up” with ewan mcgregor", "score": 11, "replies": []}, {"body": "EV makers are overvalued af rn", "score": 21, "replies": [{"body": "Yeah I personally think old blood like stellantis, ford and co will take the EV cup, but im an absolute rainman", "score": 19, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Omg are you kidding?? Nikola was a fraud from the very beginning. I had them pegged after listening to the CEO spout off fuzzy math about hydrogen refueling stations.", "score": 10, "replies": [{"body": "Bro, 50% of every trip is downhill.", "score": 9, "replies": [{"body": "^every round-trip, yes", "score": 1, "replies": []}]}]}]}, {"body": "...I like the cut of your jib...", "score": 3, "replies": []}, {"body": "Let me introduce you to Lucid ...", "score": 5, "replies": []}, {"body": "Lucid motors?", "score": 10, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "They are my man, they’re making an SUV that will be released some time in 2023. They also have plans to make other more affordable cars down the line. I think their batteries and drive train are the real selling points that will drive the company further", "score": 7, "replies": []}]}, {"body": "Lucid has a shot, but they don’t have the momentum and following that Rivian is quickly gaining.", "score": 6, "replies": [{"body": "Fake news", "score": -8, "replies": []}, {"body": "Ehhhh they JUST went public today and have 155,000 followers on Twitter. I think they will explode 2H following wise", "score": 1, "replies": [{"body": "Indeed they did….I had no idea. It’s pretty quiet inside the industry. Lots of Rivian rumblings, but no watercooler talk about Lucid.", "score": 2, "replies": []}]}]}]}, {"body": "I just texted Cathy, stand by for confirmation", "score": 3, "replies": []}, {"body": "Preordered the R1S! There is finally an electric SUV out there!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Design / Price is all that matters.  Look at current Trucks.  F150s tow more, more efficiently, but everyone sells trucks well enough because of design / cost.", "score": 5, "replies": []}, {"body": "Also Apple is absolutely killing it. The iphone was released in 2007 and the stock is up 2000% since then. Granted they have other products bringing in cash, but the iphone and app store are the flagship.", "score": 3, "replies": []}, {"body": "Yes, all Tesla’s are selling out. Inventory is consistently very low, this is public knowledge, look it up.\n\nDemand for EVs will continue to grow and grow. China and Europe are fully onboard with alternative energy and EVs. Once half of the evergreen forests in the US burn due to consistent summer temperatures in the mid 90s, I think we will be fully on the EV train as well.", "score": 8, "replies": []}]}, {"body": "Is the valuation high? Yes.\n\nDo they have a massive contract from Amazon? Yes.\n\nIs their truck a retarded low polygon wedge made to entertain an autistic carnival barker? No.\n\nThat said, private valuations can’t be reasonably compared to public, because we have no visibility into the other terms of the investment, so who cares?", "score": 3, "replies": [{"body": "I do. I am seriously considering joining the company and getting the RSUs pre-ipo.", "score": 6, "replies": [{"body": "I sure as shit would prefer Rivian RSUs to TSLA.", "score": 4, "replies": []}, {"body": "Do eet. I work at rivian and my RSU's have already 3x'ed since joining last year. It's like making a YOLO but you only can lose unrealized gains", "score": 1, "replies": [{"body": "Oh snap! Do you know what the signing RSU offering is these days for P3 or P4 engineer?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}, {"body": "Buy Lucid instead", "score": 3, "replies": []}, {"body": "Everything hindenbergenfaggen has been fudding about lordstown is the gay bear case for rivian. You might as well buy 70 billion whort of scrap metal because till they start production all you have is a dream, 70 billion for rivian is a collective rape on investors. \nToo expensive of an excuse for not producing their E-150 on time.\nSell 70 bill of this toillet paper and i will be born again short.\nShort this faillure from day one is my take on it, till these tampons can grow a penis or a vagina they can drunk text paris hilton, she knows more about trucks than cnbc.", "score": 2, "replies": [{"body": "Nikola was the one to short. I dabbled in Puts, it was fun.", "score": 4, "replies": []}, {"body": "Yep. Rivian overblown hype, RIDE the bargain...and getting bargainer.", "score": -3, "replies": [{"body": "RIDE is under so much I doubt they exist in a year.", "score": 3, "replies": [{"body": "You can wonder all u want while I buy more.", "score": -5, "replies": [{"body": "I just keep buying puts and being right", "score": 1, "replies": []}]}]}, {"body": "What’s the catalyst? Would like to hear your side.", "score": 1, "replies": [{"body": "I’ll answer in September. Mark it.", "score": 1, "replies": []}]}]}]}, {"body": "As far as I know the CEO of Ford sits on the Rivian board of directors. And they have invested heavily into Rivian. And will be using their power train for their own cars. Rivian also has orders from this tiny company Amazon. So I feel like they are well on their way to production and order issues being solved.\n\nEdit.\n\nhttps://www.reuters.com/business/autos-transportation/ev-startup-rivian-announces-25-bln-funding-round-led-by-amazon-ford-2021-07-23/\n\n\nhttps://www.wsj.com/articles/ford-names-daughter-of-chairman-to-companys-board-seat-at-rivian-11588346654", "score": 2, "replies": [{"body": "The founder of Rivian has done a great engaging the industry and creating partnerships. A solid rival for Elon no doubt.", "score": 3, "replies": []}]}, {"body": "And per Elon scaled product is very hard", "score": 1, "replies": []}, {"body": "LCID is the best EV buy rn", "score": 1, "replies": []}]}
