{"title": "Tesla Announces Date (Monday 7/26 AH) for Second Quarter 2021 Financial Results and Webcast", "selftext": "", "id": "ojdwez", "created_utc": 1626176835.0, "score": 161, "upvote_ratio": 0.98, "num_comments": 40, "comments": [{"body": "I’m so excited!!!  I think it’s going to crush all (initial) market expectations.", "score": 19, "replies": [{"body": "Initial is key.  Damn analysts moving the bar all the time to ensure ‘missed expectations’", "score": 22, "replies": [{"body": "Analysts raising estimates is what causes the stock to move up in the first place", "score": 5, "replies": [{"body": "Good point", "score": 3, "replies": []}]}]}, {"body": "I wonder if any more stock comp tranches unlocked? If not, this should easily be the first quarter where no one can argue that reg credits are necessary for profit (since there won't be a huge stock comp item confusing the issue).", "score": 2, "replies": [{"body": "I think Rob Maurer of Tesla Daily mentioned that about 70% of the plan has been unlocked already, and that he expected much less going forward.", "score": 2, "replies": []}]}]}, {"body": "Hopefully we’ll get some updates on the Austin factory and cybertruck development", "score": 17, "replies": [{"body": "Truly, can't wait. Even seeing the news about the cameras from Samsung is uplifting.", "score": 5, "replies": [{"body": "I saw someone else comment about that. I’m not up to speed unfortunately. What’s going on with Samsung and Tesla?", "score": 1, "replies": [{"body": "An order for $500,000,000 worth of cameras. Some are thinking that it has to do with some unique CT features such as the rear camera replacing the rearview mirror.", "score": 2, "replies": [{"body": "Gotcha. Appreciate it! Hopefully we get a fair amount of good news over the next couple of weeks.", "score": 1, "replies": []}]}]}]}]}, {"body": "Announced yesterday. How far out?\n\n...\n\nTwo weeks.", "score": 14, "replies": [{"body": "Okay, that does make me laugh imagining, the night of, Elon tweeting  : \"New earnings are amazing. An order of magnitude improvement. Just need 2 more weeks to work out some final issues, then wide release.\"", "score": 12, "replies": [{"body": "[raises card high up in the air]\n\nBingo!!!", "score": 3, "replies": []}]}, {"body": "So buy 2 week calls?", "score": 5, "replies": [{"body": "And then sell them right before earnings", "score": 4, "replies": [{"body": "i plan to sell 3 covered calls. And buy more shares as is the way.", "score": 1, "replies": []}]}]}]}, {"body": "This *will* include huge ~~on-paper losses~~ impairment driven by the minimum value of Bitcoin during Q2, right?", "score": 4, "replies": [{"body": "They will have to report an Impairment as the asset (bitcoin) is worth or was worth less than what they paid for it.\n\nhttps://en.wikipedia.org/wiki/Impairment_(financial_reporting)\n\nhttps://dailyhodl.com/2021/07/06/tesla-facing-up-to-100000000-bitcoin-impairment-loss-in-q2-amidst-crypto-price-slump-report/", "score": 3, "replies": [{"body": "Yes, this is the term I was reaching for. From that wikipedia article, it *will* affect the GAAP line.", "score": 1, "replies": []}, {"body": "Impairments are generally for something like a building or rights to a mineral deposit or something like that. For an investment, generally impairments are not taken on fluctuations and are instead just considered an unrealized gain/loss. I'm not an expert on how bitcoin will be treated for a corporation since it's so new but I imagine that it will follow that same logic.\n\nSo whatever write-up they had in the past for the increase in value, it will just be reversal of that.", "score": 1, "replies": [{"body": "https://news.bloombergtax.com/financial-accounting/tesla-bitcoin-bet-exposes-limits-of-crypto-accounting-rules\n\n>The upshot: A company buying or investing in Bitcoin takes the value of the cryptocurrency at cost and records it as an asset on its balance sheet. There it stays, at the same amount, unless its value declines. If the company sees signs that the value has weakened, the company must record an impairment, which hits the income statement and reduces earnings. It must test the asset for impairment at least once a year, but more often if there are indications that the value is lower.", "score": 1, "replies": [{"body": "Wow that's absolutely insane that the FASB hasn't really provided much guidance and the small amount that it has provided has recommended treating it as goodwill. That makes no sense in my mind for a cryptocurrency. So bizarre.\n\nThanks for sharing that article. Really interesting. I love Tesla pushes the limits on everything including boring GAAP haha.", "score": 1, "replies": [{"body": "It is because crypto is not considered a currency. It is treated like as asset like literally owning gold bars, art or rare trading cards.", "score": 1, "replies": []}]}]}]}]}, {"body": "Why would the price of Bitcoin affect their revenue or losses? They haven’t sold any (since the 10% when it was higher), plus it’s about the same value as when they bought it.", "score": 3, "replies": [{"body": "There are some subtleties with Bitcoin accounting, because it's an asset ... weird stuff. You should google around :)", "score": 2, "replies": []}]}, {"body": "Why would it be the minimum value?\n\nI estimate Tesla's purchase price was around ~32,000 ... so, currently they're in the green (barely). You're saying the lowest low is what's reported for accounting?", "score": 1, "replies": [{"body": "The logic is if an asset goes below it's purchase price once, it can do it again.  Better take the \"loss\" on paper to be safe and transparent.\n\nConversely, they don't mark the asset up if the price rises, again to be conservative because the price could always fall again.\n\nIf they always \"marked to market\" at the end of the quarter, the gyrations of paper gains and losses would overwhelm the real value of the rest of operations.", "score": 2, "replies": [{"body": "Huh ... seems like that should be communicated somewhere, but requiring it be put into bottom-line earnings is just stupid. (not calling you stupid \\^\\^ just GAAP)\n\nGuess we'll see how Tesla handles it", "score": 1, "replies": []}]}]}, {"body": "Why? It's still worth more than they paid for it. They should sell it all now and call it profit, and then stop that nonsense.", "score": 1, "replies": [{"body": "Because that's how accounting for Bitcoin works. If they sell then they won't have them anymore...", "score": 1, "replies": [{"body": "I dont think they should own bitcoin. Id rather them invest those billions into more super chargers and other things to grow the company.  Perhaps expanded part availability as more and more Teslas will be on the road.", "score": 1, "replies": [{"body": "It's good to keep cash on hand to keep operations going in the event of a downturn.\n\nBut USD instead of Bitcoin... yeah, seems sensible.", "score": 1, "replies": []}, {"body": "I agree, but sometimes there are diminishing returns.", "score": 1, "replies": []}]}]}]}, {"body": "I’m not sure unrealized losses/gains are a factor. Maybe someone else can chime in.", "score": 1, "replies": []}]}, {"body": "Time to dispel the FUD!!!", "score": 4, "replies": []}, {"body": "My covered call for $730 expires 7/30 u cheeky kunts", "score": 0, "replies": []}, {"body": "The fact that they're announcing this in advance means that $TSLA will only go one way.", "score": 0, "replies": [{"body": "Did you expect them to surprise everyone with the earnings call?", "score": 2, "replies": []}]}]}
{"title": "$NFLX, $DIS, $VIAC, $NFLX, $DISCA. Upcoming Earnings!!", "selftext": "Edit 1:The title has Netflix twice as opposed to AT&T which I meant to include.\n\nEdit 2: The main suggestion is wait until Netflix's earning report, they report  first. Then see if they lost domestically and guess who relatively  gained the most subscribers of the remaining streamers (using google  trends).\n\nEdit 3: Internationally Netflix is present in more countries, than Disney, and  last HBO (due to licensing deals).   The domestic growth should be the relative most different between them i.e. one may have stagnated or decreased while other gained. They probably all grew internationally and it is too hard for me to tell  which one grew the most. I made guesses below.\n\nEdit 4. Slight risk that people wait until both earnings have posted before making a bullish decision,if AT&T's financial statements indicate that.\n\n* AT&T  earnings = July 22nd.\n* Discovery earnings = August 4th (estimated).\n\nEdit 5. Woah games for Netflix. Doesn't change information below, estimating subscriber growth. AT&T is already decent with games. Disney has lots of games IP that it sells out. Time will tell.\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\nNot a financial advisor\n\nJakeAlphaInvestingCorp.  \n\\-Blessed be my followers\n\n**Disclaimer:**\n\n* My position: Extremely Red on $T Calls.\n* Data pulled from a variety of sources, may be inaccurate. Especially google trends.\n* I am biased, thus more of AT&T is presented.\n\n**TLDR:**\n\n* Netflix fell last earnings report due to weak subscriber growth, the price has since risen. Google trends indicates a repeat of low subscribers for the quarter.\n* Disney  fell last earnings report due to weak subscriber growth and parks being  shut for the pandemic. Disney+ seems to have had an alright quarter for  subscribers, it really started taking off in July so that's good. This is after Q2  earnings so it will not greatly affect financials yet.\n* AT&T  price rose last earnings on strong subscriber growth in both  businesses, but then fell on merger announcement with Discovery. Google  trends indicates their greatest subscriber growth for HBO to date.  Feeling a repeat.\n* VIACOM this DD has less on them but seeing competitors is good. Great past earnings.\n* Discovery, your now stuck on the HBO train.\n* Netflix's  success or failure domestically and internationally will be reported on July 20th. This may  help assess AT&T, Disney, Viacom, and Discovery investments.\n* It would be smart to wait till after Netflix earnings before making a decision.\n\n**Previous posts by the author about streaming:**  \n(Check my profile)\n\n1. Google Trends review posted a month ago. More current info presented below.\n2. Options Play for Q1 2021 ER, Disney vs Netflix vs AT&T. Big success.\n3. AT&T call before prior earnings. Big success then a big fail on merger.\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Past Quarter Price Action:**\n\nBelow, in order, are the 3 month graphs for Netflix, AT&T, and Disney.\n\nNetflix down, AT&T up, and Disney down on earnings.\n\n* The red line represents the earnings report. As stated above subscriber growth for the three companies influenced the bullish or bearish behavior.\n* Google trends was fairly reliable last quarter in predicting this. No guarantees as to the current quarter.\n* The blue line for AT&T represents the merger announcement with Discovery.\n* Order of earnings for current quarter is Netflix, AT&T, Discovery (est.), Viacom, Disney.\n\nhttps://preview.redd.it/h8kbpx7kn1b71.png?width=1255&format=png&auto=webp&s=15084011f927638fcc6e3b98277380b6ae88fd83\n\nI am currently holding T calls (mainly), VIAC calls, and Discovery shares.\n\n\\-----------------------------------------------------------------------------------------------------------------------------------------------\n\n**THE BOX OFFICE 2021**\n\nHaving  Box Office hits has been one of the major drivers of subscriptions to a  streamers platform in the past year. Many of these hits do well  internationally in countries such as China.\n\n\\-  The list below shows the top grossing movies of 2021 domestically. A  movie such as Wonder Woman 1984 released in 2020 will be shown on this  list as it earned revenue in 2020.\n\n[https:\\/\\/www.the-numbers.com\\/market\\/2021\\/top-grossing-movies](https://preview.redd.it/uerj0jy021b71.png?width=625&format=png&auto=webp&s=988f8829012fe6c402b4b028094e5e8d3cb89319)\n\n&#x200B;\n\nBelow I have totaled the revenues from the top 25 Movies from the list  above both domestically/internationally by studio. Only those released  since 2021, so not including Wonder Woman and some other titles.\n\n[Data from Numbers.com](https://preview.redd.it/f6m1vw3621b71.png?width=1481&format=png&auto=webp&s=012faaef4cf24cf4fbf7d6d24215823aaaa4c8e4)\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n**Google Trends**\n\n***Disclaimer:***\n\n1. Data is not perfect and does not truly reflect subscriber-ship for a variety of reasons\n2. Consumers  already owning Netflix/Disney+ may be less likely to search for them,  whereas HBO users may be new inflating google trends data.\n3. Two search criteria exist, \"Television Network\" and \"Search Term\".  Netflix can unfortunately only be searched for as a \"Search Term\",  therefore I interchange between the two criteria.\n4. Using \"search term\" would include data such as  Disney's Parks. Netflix and Disney are also the names of the parent  companies, etc...\n\n***Past Data Accuracy:***\n\nFor  Q4 2020 and Q1 2021 HBO's uptrends along with box office hits did add  subscribers. A lot for WW 1984, their biggest addition to date, and some  for Batman Snyderverse. The uptrends associated with Netflix and Disney  for the holidays did not coincide with a box office hit. As such the  uptrends did not add meaningful subscribers for Disney and Netflix.\n\n***Semi-Confirmation of data accuracy before AT&T and Disney Earnings:***\n\nNetflix  will release subscriber data on July 20th prior to AT&T and Disney.  It may be a good idea to compare the the results to google trends to  see if downtrending or uptrending does indeed help estimate subscriber  prior to investing in AT&T, Disney, Viacom, or Discovery.\n\n&#x200B;\n\n**Trends data for HBO vs Disney+ for the past 12 months in the United States**\n\n**Search criteria= \"Television Network\"**\n\n[https:\\/\\/trends.google.com\\/trends\\/explore?geo=US&q=&#37;2Fg&#37;2F11fmb4rx9b,&#37;2Fg&#37;2F11f5bxylc0](https://preview.redd.it/v7tjtk4jq1b71.png?width=1048&format=png&auto=webp&s=fd5506ce9a8d31ea0f7a8c902e7725a13a37928b)\n\n&#x200B;\n\n* The blue line for HBO has four major upticks.\n* First uptick is for Q4 2020 during the holidays along with Disney.  HBO had a box office hit, none for Disney.\n* The  upticks for HBO during Q2 2021 are for Godzilla vs Kong, Mortal Kombat,  and the Friends reunion. There is a good chance of above expected  subcribers gains domestically.\n* Disney's  most recent uptick is both due to Loki the Tv series and the Black  Widow movie. Black Widow seems to be sending it higher though not yet as high as GvsK. have to wait to see if it peaks.\n* Also more theaters  were shut down both domestically and internationally for GvsK than BW. Vaccines not being out which could have influenced interest in GvsK. Less to do, could also mean more likely to subscribe.\n\n&#x200B;\n\n**Search criteria = \"Search Term\"**\n\nhttps://preview.redd.it/eycygn2br1b71.png?width=1035&format=png&auto=webp&s=210a6d610ab40259429408f7357bb71d8cd67fe3\n\n* As can been seen Netflix has been down-trending during Q2 2021 relative to both Disney and HBO\n* Disney overtaking Netflix could indicate a change in overall sentiment to be followed internationally.\n* Previous quarter financials:\n\n1. Netflix down due to weak subscriber growth, since risen back up.\n2. Disney down due to weak subscriber growth and parks being shut during pandemic, since risen back up.\n3. AT&T up on strong subscriber growth and good financials, since risen back down.\n\nTrends  indicate AT&T has continued strong subscriber growth while stock  price falls as Netflix continues weak subscriber growth while stock  price rises. Disney seemed to have a slow uptrend during the quarter but  a strong finish, not as prominent as AT&T via google trends. Once  again google trends data may be inaccurate.\n\n* As Netflix has such a high P/E if doubts about it's future to continue rapid growth arise the stock price could fall.\n* Netflix's  earnings report is first on July 20th. It can be used to assess growth  of AT&T, Viacom, and Disney before their earnings. Compare Netflix  subscriber growth domestically and internationally to past quarters and  competitors.\n* People seem unwilling to cancel Netflix even if they prefer a different service.\n\n&#x200B;\n\n**Worldwide, Past 12 months**\n\nThe graph below shows the worldwide google trends data in the past 12 months for Disney and HBO.\n\nThe  upticks that were seen on the United States graph are present but less  prominent. HBO has mainly been available in the United States up until  June 29th 2021 when they launched in Latin America (Regional breakdown  to follow). As such there was no way for them to compete  internationally.\n\n**Search criteria = \"Television Network\"**\n\nhttps://preview.redd.it/6twyclwzq1b71.png?width=1064&format=png&auto=webp&s=9a3b4c947bbac7ceef9cf66bc16a6ab71654e032\n\n* Disney while having a week start of the quarter has since up-trended for it's Marvel releases.\n* HBO began a strong quarter on the release of GvsK. This is mainly due to the United States.\n* HBO  has a final uptick seen here but not seen in the United States graph.  This is due to HBO's international launch in 39 countries and  territories in Latin America which seems to have edged them extremely  close to Disney on an international scale.\n* HBOs final uptick could strongly be influenced by a big marketing push in Latin America.\n\nNote:HBO  will call there platform different things in different countries. For  marketing reasons and due to deals with regional providers. In Canada  HBO is called \"Crave\" and distributed by Bell. It will not show up on  the search results. It can also be called HBO Latin America or HBO Asia  depending on your region. This last point google may be smart enough to  interpret for google trends, I am unsure. Disney is just Disney+.\n\n&#x200B;\n\n**Search criteria = \"Search Term\"**\n\nhttps://preview.redd.it/erngtyj5r1b71.png?width=1049&format=png&auto=webp&s=6a2670a4f208d958b99f1c90a2bd6863e3056041\n\n* Worldwide  Netflix is still on a downtrend over the past quarter, seemingly  following last quarters trends. (Once again google trends data may be  inaccurate). Still the leader by a lot and a bit of an uptick at the end.\n* Disney  has been higher this past quarter than the same time last year.  Worldwide it has still not had the same interest as during the 2020  holiday season but it has been steady all quarter and then up-trending  strongly since July.\n* HBO  worldwide continues to uptrend more strongly than it's previous high  during the holiday season where they added the most subscribers to date.  International users will not greatly affect Q2 financials apart from  maybe adding subscribers in the final 3 days of the quarter.\n\n&#x200B;\n\n**HBO vs Paramount vs Discovery**\n\n**Worldwide, \"Search Term\"**\n\nhttps://preview.redd.it/yaygbq5i21b71.png?width=1088&format=png&auto=webp&s=fded4a050e08c951b7dddb99259775734eaa2daf\n\n* Search Term used and Discovery is an actual word, might be other reasons to type this in.\n* Paramount just launched/ changed it's name this quarter.\n* Discovery seems to have more appeal than paramount but it is on a steady downtrend over the quarter.\n\n**United States**\n\nhttps://preview.redd.it/sjodso0k21b71.png?width=1069&format=png&auto=webp&s=d9097b5dbff37eaeab1dd90dbd0800aba7114a87\n\n* More of the same.\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n**HBO Goes International**\n\n**Regional Breakdown of Interest Worldwide:**\n\n**12 Months**\n\nhttps://preview.redd.it/rki8rnam21b71.png?width=1055&format=png&auto=webp&s=0411da007ae145159f1f45ea89f12b657a4b27a1\n\n* Disney is winning\n* HBO only overtook Disney this past quarter in the United States.\n\n**Since June 29th 2021 (HBO International launch)**\n\nhttps://preview.redd.it/wfzvc16n21b71.png?width=1068&format=png&auto=webp&s=2c86c1280f3bb196c97e2e84e5bcc9355a89fef5\n\n* International launch in Latin America pushes HBO ahead south of the border\n* Most populous countries are in order: Brazil, Mexico, Colombia, and Argentina\n\n**Past 7 days**\n\nhttps://preview.redd.it/bjca51io21b71.png?width=1042&format=png&auto=webp&s=be56e9c72c506bb6e024f915a454749bbacbbad1\n\n* As  seen in my first graph, HBO Max vs Disney+, Disney has overtaken HBO  Max with the release of Black Widow in the United States.\n* Worldwide  Disney again is overtaking HBO everywhere except Mexico, though the  battle is much much closer for HBO than it was 1 month ago.\n\n\\-------------------------------------------------------------------------------------------------------------------------------------------**4**\n\n**Most populated countries in Latin America, HBO vs Disney**\n\n**Brazil - Past 30 Days**\n\nhttps://preview.redd.it/3u10n4or21b71.png?width=1085&format=png&auto=webp&s=b40002b9a206a03829902b6b2adad97c7ab46e4c\n\n**Mexico - Past 30 Days**\n\nhttps://preview.redd.it/opr4zlds21b71.png?width=1071&format=png&auto=webp&s=8427e474a2ccf51f746e2fb68cfaadaa655d79b7\n\n**Argentina - Past 30 days**\n\nhttps://preview.redd.it/lg3hsg0t21b71.png?width=1083&format=png&auto=webp&s=d3b40e98e949afd19a5a9738a8bf1e7ead70ac39\n\n**Colombia - Past 30 days**\n\nhttps://preview.redd.it/9c85v85v11b71.png?width=1096&format=png&auto=webp&s=63eee8daa8dd61d514d2e691372ef4707c846c58\n\n**Black Widow vs Godzilla:**\n\n&#x200B;\n\nhttps://preview.redd.it/jzbg2nn0g1b71.png?width=1085&format=png&auto=webp&s=143757333112790a3ac80cbc3185b38e77f6c6c3\n\nBlack Widow made $60 Million on Disney plus, 2 million users rented it for $30.\n\nHow  much did GvsK make on VOD?\n\n* Only the US got it free on HBO $20 internationally to rent, e.g. Canada, UK, etc..\n* More theaters were closed during March due to the pandemic worldwide than for  Black Widow.\n\n&#x200B;", "id": "ojmgnk", "created_utc": 1626203079.0, "score": 56, "upvote_ratio": 0.83, "num_comments": 43, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|4 months ago\n**Total Comments**|20|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/ojl7ub/t_dis_viac_nflx_disca_earnings_upcoming/) [x](https://www.reddit.com/r/wallstreetbets/comments/md8bqr/most_shorted_stock_atnf/) [x](https://www.reddit.com/r/wallstreetbets/comments/n1f5rc/streaming_services_google_trends_must_see_disney/) \n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Thanks. VIAC to the moon!", "score": 24, "replies": [{"body": "All we need for VIAC moon is Mr. Hwang to convince Credit Suisse to take him back", "score": 19, "replies": [{"body": "They just need to kiss and make up", "score": 8, "replies": [{"body": "They should just hire him to run their prop desk. He could probs get them back to positive ROE for the year if VIAC doesn't secondary issue rug pull him again.", "score": 2, "replies": [{"body": "Word. With all the positive catalysts,  VIAC can't get out of bed... executive staff needs to do better.", "score": 2, "replies": [{"body": "I actually had a VIAC position pre Hwang and managed to get out at around $96 and have not followed it a ton after that. Had been holding it for a while and wasn't checking on the position much but saw it in the 90s one day and decided to GTFO because theres no way in hell it was worth that much. Probs woulda sold way earlier if I had noticed lol.", "score": 4, "replies": [{"body": "Lol. What would you value it at right now?", "score": 2, "replies": [{"body": "its been a minute since I did my work up on it. Was holding it for a while (Had VIAB before it re merged with CBS). Not sure if my pre covid analysis is that relevant anymore. I don't even remember exactly what my cost basis was. Think I closed up around 150% which implies that pre covid and pre cbs merger I liked VIAB at a price equivalent to VIAC just a bit below where it is now if that helps at all lmao. It was a pretty small speculative position for me in a low quality company that I thought was too cheap to ignore at the time. Not sure how I feel about them now either. Going at it alone on streaming will be hard for a company that size and now that DISC is off the table idk how much consolidation is left in media.", "score": 2, "replies": [{"body": "Gotcha. Thanks. General consensus seems to be that VIAC can't fight the streaming war solo. M &A is complicated but not impossible due to the rarity of original content.\n\nAt low 40s VIAC seems undervalued substantially. The Technicals and Fundamentals suggest a move up north of 50 isn't far away. However that's probably what every VIAC equity owner is thinking.  \n\nVIAC to the moon or whatever is reasonable. Lol", "score": 3, "replies": [{"body": "Technicals suggest as high as 70+ depending on the comparison. I think they have advantages that other providers don’t do. Long term play for sure. Also, there is a buy out opportunity as the different companies look to expand their libraries.", "score": 2, "replies": []}]}]}, {"body": "$55 right now and $70 post acquisition/merger. The current value of Paramount+ is higher than the entire market cap of VIAC", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Streaming is here to stay, content creators have a lot of value.  I'm bullish on all of them,  even the smaller niche players because they will be bought out eventually leaving 5 or so major players.  I own VIAC, T because they are the most undervalued but DIS looks really good as well.  Nothing wrong with NFLX but not as undervalued.", "score": 12, "replies": [{"body": "I have T calls mainly, some VIAC calls and some DISCK shares.\n\nI'm just hesistant on DIS cause of parks, will be better this quarter than last but still not at full capacity.\n\nAnd yeah Netflix seems the most overvalued\\*\\*\\*. My DD sort of states wait till Netflix earnings see if they stagnated domestically then make the call on who we think ate up those subscribers.\n\nI personally think it was HBO.\n\nNetflix might just need semi good international growth to do well, still have a high P/E though, on the idea they will remain king. Take the kingship away or make people doubt that and I do not see why it warrants such a high P/E.", "score": 3, "replies": []}]}, {"body": "Also have T calls, also very red.  Main lesson is - dont fuck with boomers dividends.", "score": 6, "replies": [{"body": "Feels good to know someone else is red.  Best of luck to us both.  \n\n\nScrew the dividend... ughs...", "score": 2, "replies": []}]}, {"body": "So Netflix puts ?", "score": 4, "replies": [{"body": "I hate buying puts but I really want too. Might get a couple for fun but like the tiniest amount.\n\nThat being said wouldn't be suprised if Netflix fell on weak domestic subcriber growth which would make me feel more confident about T.\n\nInternational subscriber growth I do not think is as reliably tracked by google trends.\n\nMy position as I said is T calls mainly, and some VIAC calls too but not a lot.", "score": 1, "replies": []}]}, {"body": "Calls on $DIS even thought it’ll probably prune me", "score": 5, "replies": [{"body": "Not saying my data is accurate.\n\nI said Disney+ had a slight uptrend during the quarter but then took off in July, might not impact Q2 financials.  \n\n\nI just re-checked google trends and Disney has surpassed their Holiday peaks with Black Widow. Something HBO and Netflix have not managed. So let's hope investors take the July growth into account.\n\n[https://trends.google.com/trends/explore?geo=US&q=%2Fg%2F11fmb4rx9b,%2Fg%2F11f5bxylc0](https://trends.google.com/trends/explore?geo=US&q=%2Fg%2F11fmb4rx9b,%2Fg%2F11f5bxylc0)", "score": 1, "replies": []}]}, {"body": "AT&T has the additional risk of management sailor diving into the shallow end of the pool on the earnings call and tanking even a good report. They managed to talk themselves from a 3% gain on the split-up to a big loss with just a few appearances on finance news channels. \n\nI can't imagine the market will care all that much about HBO max this quarter unless its an insane beat with similarly insane cell results. Everyone is thinking about the split up and merger.", "score": 6, "replies": [{"body": "The merger is making everyone hesitant its true. I feel as if WB has a chance at an insane beat this quarter... still going to be hard as they just went international June 29th. So maybe not.\n\nThat being said not as sure about cell growth. It does seem good and it was good last quarter.   \n\n\nFirstnet is hopeful, though I read an article that T lost a 911 call during flooding today. The call was then rerouted by so it didn't get fully lost but still the police wanted to switch from T to a cloud based service. Unsure if this was a firstnet municipality or not, they didn't say.\n\nYou could be right. But I am going to let Netfilxs domestic growth influence my decision. Compare they're reported numbers to google trends and app data.", "score": 4, "replies": [{"body": "June 29th probs isnt even going to be part of this quarters results. Not sure exactly when the q2 ended but probs right around then so at most you might be getting a few days of those results in this Q. Maybe they will bring it up on the call and mention positive early trends to start Q3 but i'm just not sure that moves the needle much. \n\nTBH if I had to guess the most likely positive catalyst for T around this earnings it would probs be management doing a better job convincing the market that the merger makes sense and that unlike every other deal they have made for the last 10 years, this one unlocks shareholder value. That plus a decent or better earnings could move it up a bit but idk if a see a ton of stuff happening until the merger is further along.", "score": 2, "replies": [{"body": "I am very much agreed just think there is enough of a chance and enough positive indicators for me to take the risk with T.\n\n\\- Best google trends  \n\\- Best box office-  \n Good app data, not presented here.  looked at it but couldn't find somewhere that summarized it all together and was too lazy...\n\n\\+ TNT Sports, Inside the NBA with Shaq, Kenny, Ernie, and the retiring Charles Barkley is way better than ESPN. As a program.", "score": 2, "replies": []}]}]}]}, {"body": "closed my disck swing today.  bearish on this until merger goes through.", "score": 2, "replies": [{"body": "Cool could have been the good move. I just think WB is gonna have good growth, I could be wrong. Could be very wrong.", "score": 2, "replies": [{"body": "holding shares in ira and hsa but those accounts have 5 yr + horizon", "score": 2, "replies": [{"body": "nice nice.", "score": 2, "replies": []}]}]}, {"body": "what actually happens to DISCK after merger? what will you own?", "score": 2, "replies": [{"body": "it's based on stock price of both stocks, if you own disca/diskb you will exchange those shares for new company shares.  if you own T you will keep your T shares but own some of new company also.   \n\nhow much shares of new company you will get is based on stock price of both companies at time of merger\n\nthis confusion is bearish, the stock price jockeying is bearish, but the new company looks good mainly because of WB + HBO", "score": 2, "replies": [{"body": "Thanks man, I'm a HUGE hbo fan, DISCK seems cheap right now at 27, do you think it will go lower?", "score": 3, "replies": [{"body": "The other guys answered.  \nNewco Split = 71% AT&T + 29% Discovery.\n\nDISCK as you noted is said better than DISCA or DISCB as they are all \"supposed\" to be a 1 to 1 conversion.\n\n**Discovery gives more NewCo per dollar invested:**\n\nThe market cap of T is $200 billion, the market cap of DISCA is $14 billion or roughly $20 billion with dilution.\n\nIf you invest $1 billion into T you get 1/200th or 0.5% of AT&T. + for Newco you get 1/200th\\*0.71 = 0.35%.\n\nIf you invest $1 billion into DISCA you get 1/20th or 5%, this will convert to 1/20\\*0.29 = 1.45%\n\nSo basically you get 4x the amount of Newco for every dollar you invest in Discovery as opposed to T. That being said you do not get the AT&T portion of the deal. (If you feel the P/E ratio of Newco will have a greater positive change than AT&T after split, I would recommend the DISCK shares.)", "score": 1, "replies": []}, {"body": "likely getting there, hwang&co made a mess with price discovery, in same boat as viac.  \n\npre hwang cheaper than now", "score": 1, "replies": []}]}]}]}]}, {"body": "What positions are you holding on T?", "score": 2, "replies": [{"body": "I am holding alot of T calls that expired worthless and alot more T calls that may expire worthless at tons of different strike prices. Been averaging down for months.\n\nSafest are my $30 15th of July 2022.  \nLeast safe are  $31 16th of July 2021.  \n\\--> those are definitely going to zero, bought them a while back.\n\nAT&T  earnings = July 22nd.  \nDiscovery earnings = August 4th (estimated).\n\nSlight risk that people wait until both earnings have posted before making a bullish decision, if AT&T's financial statements indicate that.\n\nBasically if earnings are good my conservative estimate is it could jump to $31-$32 after earnings on the 22nd, however this could be delayed as we await Discovery's earnings as well, and then $35 EOY.\n\nNetflix earnings could help tell stuff.", "score": 1, "replies": [{"body": "What do you think is going on with 7/16 30c? Open interest is sky high", "score": 2, "replies": [{"body": "Edit: Oops I thought you said \"what do you think of the 7/16 $30c\"\n\nI think it is mainly because of how long those calls have been available to buy and because they are the week before earnings. So if you check 17th of Oct 2021 and the 21st of Jan 2022 you will see high OI for $30 as well.\n\nSo incredibly risky I would never do that.\n\nThey're trading for $0.01.... The $29.5 for 7/16 are also trading at $0.01 so those at least are smarter. The $29 for 7/16 are trading at $0.02 and might open today at $0.01...\n\nI'd stay away from 7/16 and only look after earnings...\n\nAnyway calls go to zero... but those are zero...", "score": 1, "replies": []}]}]}]}, {"body": "Did you have any DIS calls?", "score": 1, "replies": []}]}
{"title": "SPCE Hypersonic plane", "selftext": "Jeff Bezos is trying to down play Sir Richard Branson & Virgin Galactic's outstanding performance traveling into outer space this past weekend. \n\nJeff Bezos is saying \"50 miles up is not outer space, but that 60 miles up is outer space.\" Meanwhile when Bezos goes up (which won't happen because he's afraid to even get an elevator) they'll be going to the same threshold between 50 and 60 miles. The average person traveling into space without proper conditioning, will not be able to handle anything past that. \n\nWhile Sir Richard Branson has always been well ahead in the game. The comments from bezos show he hasn't been able to get over it, with all the excitement and news Virgin Galactic has posted and received. \n\nVirgin Galactic's plane was designed for hypersonic speed. Hypersonic flight is coming. The idea of a nice jaunt into outer space for a joyride sounds fun, nevertheless soon people are going to be able to take hypersonic planes as a means of transportation anywhere in the world within two ~ four hours flight time. That's the goal. \n\nThere's also a big difference in the designs between all three space companies. Virgin Galactic is following the X aircraft design, specifically the Boeing X-20 Dyno. The other space companies are using old Apollo technology with a capsule perched a top a rocket that comes back through the upper atmosphere with parachutes deployed landing wherever the wind takes you. \n\nThe most important part of Virgin Galactic's hypersonic plane design is the feathering braking system that lets the plane float down through the atmosphere like a badminton birdie. The feathering system is based on Rutan's designs. The entire tail structure can rotate upward, giving the plane the ability to slow down and float like a feather as it re-enters the upper atmosphere. The plane then lands on a runway. I'll take the plane and land on a runway.", "id": "ojpr1n", "created_utc": 1626212632.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 49, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|1 month ago\n**Total Comments**|22|**Previous DD**|\n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Old news as my socks", "score": 18, "replies": [{"body": "So wen moon?", "score": 4, "replies": []}]}, {"body": "Question, is this hypersonic plane still gonna need a ride from a bigger plane. If so, how the fuck will this ever be remotely practical? If not, virgin must be working on a revolutionary multimode scramjet. Are they? If so, how far along are they? My point here is that virgin is not any closer than other aerospace firms (that arent even working on it!) to a passenger hypersonic vehicle, in fact theyre likely far behind.", "score": 10, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Im glad u brought up United. What theyre doing is interesting. They probly asked boeing and airbus how much for LRIP on a supersonic commercial plane and got sticker shock. So they go to a startup and get a more reasonable quote. The question is, if that plane ends up better than a concorde (reasonable goal considering newer technology available), will United collect hella tendies on that investment? I believe a well funded start up has a better shot at making a not overly complicated supercruiser than boeing or airbus. Plus NASA is doing the research to dampen the sonic boom, so they can leverage those results.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The marketing from Boom seems to suggest United is doing more than just buying the planes. It almost seems as if United is a major stakeholder. If so, how much more to just bring supercruiser design and build in house? It would be bold of an airline to invest in making their own planes, but for niche markets its makes sense and they can sell planes to other airlines 🤔", "score": 2, "replies": []}]}]}]}, {"body": "Virgin is way ahead", "score": 1, "replies": []}]}, {"body": ">The average person traveling into space without proper conditioning, will not be able to handle anything past that.\n\nBullshit. Nothing magical happens at 60 miles.", "score": 16, "replies": [{"body": "This. There is no “escape height” only “escape velocity”.", "score": 10, "replies": []}, {"body": "Um....yes.  at 62 miles it's a completely different part of the atmosphere", "score": -7, "replies": [{"body": "...no. Just stop, you're embarrassing yourself.", "score": 11, "replies": [{"body": "Go fuck yourself maybe?  Use Google cuck", "score": -9, "replies": [{"body": "Done. Guess what, no amount of self-love changes the fact that nothing special happens at 62 miles.", "score": 7, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I'm 99% sure you're bullshitting, but can you provide me a quote where Jeff Bezos said something special happens at 62 miles in altitude? If he did and he wasn't talking about the Karman Line, then it doesn't matter how much money he has, he's wrong.", "score": 1, "replies": [{"body": "62 miles is about the length of 148238.12 'EuroGraphics Knittin' Kittens 500-Piece Puzzles' next to each other", "score": 2, "replies": [{"body": "You know, I was about to ban you, but that was worth it. Thanks.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Most countries consider Karman line as the official \"space\".\n\nI know, most of you won't know what is the difference. They're just 20 more km, right?\nWrong.\nThere is a very easy and very strange measurement unit used in spaceflight. Delta V. It measures basically how \"far\" can you go.\n\nSpaceshiptwo has around 1,1km/s of delta V.\n\nTo reach the famous Karman line, you need at least 1,4 km/s. So these last 20 km, require almost 30% more deltaV.\n\nNow, just to put some more numbers in comparisons.\n\nNew Shepard (Bezos toy)has a deltaV of 3,3km/s. Basically 3 times the Spaceshiptwo's. \n\nAnd those are nothing more than entry level launchers.\nWe are still talking about \"suborbital flight\". (Flight that don't make a complete orbit around the planet)\n\nOrbital flight requires A LOT more deltaV.\n\nJust to reach the ISS (which is really close to the surface -300km orbit) you need around 9,4km/s of delta V.\n\nOnce you reach orbit, things get easier. Not much, but enough.\n\nSaturn V+ apollo stack (what was used to get on the moon and back) had around 12,5km/s.\n\nYou writing that SPCE went to Outher space is like saying that a kid who dug a small hole in the sand is a miner.", "score": 5, "replies": []}, {"body": "Going to edge of atmosphere (aka technically \"space\") and calling it some big achievement is a joke. Going to orbit and coming back is orders of magnitude harder, neither Branson nor Bezos are going into orbit, not even low earth orbit. Give me a break, their vehicles don't even need heat shields.  It's like saying swimming in your backyard pool and comparing it to going deep sea diving.", "score": 9, "replies": []}, {"body": "I kinda doubt that the VSS Unity class can handle a much larger rocket engine. To get anywhere serious, it's going to have to stay at very high altitude and have something to sustain the speed. It's top speed is about 2,300 miles an hour and NYC to London will take about an hour and a half at that speed.  The current motor burn time is measured in seconds.", "score": 5, "replies": [{"body": "Well, to be fair, the motor doesn't need to burn the whole time. By the time they reach altitude the air resistance is minimal, so they should be able to do a *lot* of coasting. I don't know much about their technology, so they could be far away but in theory (at least) a few seconds would be enough if they could impart enough momentum.", "score": 2, "replies": [{"body": "Air resistance is low, but not zero and I'd be surprised if it could stay supersonic in a glide for more than a few minutes. The current motor has nowhere near enough energy to get the craft more than a few hundred miles. And given the hour it takes VMS Eve to drag it up to launch altitude, it would be faster to fly a Mooney to get that distance.", "score": 3, "replies": [{"body": "Yeah, it's all predicated on having enough altitude/speed that a single burn is sufficient. For some reason I was thinking they went higher, too, but IDK", "score": 2, "replies": []}]}]}]}, {"body": "They didn’t go to outer space...", "score": 9, "replies": []}, {"body": "Why is no one talking about United. They recently announced they’re going supersonic.", "score": 3, "replies": []}, {"body": "All you have to do to dismiss that notion is look to Concorde, and why it failed. High upkeep/maintenance costs, high consumer cost and low utilization, high risks. And then you look at SPCE and all risk factors are magnitudes higher, and so is the cost. Plus the nature of space travel is there are always delays, and it's still subject to weather, so the whole high speed thing may not even materialize.\n\nThat's not taking into account, billions worth of launch infrastructure, certification, and design for new aircraft, because the current iteration is not capable of it. For what? So a bunch of rich dudes may or may not use it? Because it's still won't be practical after all that.\n\nThis stock is a richman's ticket to space, that's it.", "score": 9, "replies": []}, {"body": "At least you'll have a lot of friends at Wendy's.", "score": 2, "replies": []}, {"body": "PUTs all day", "score": 2, "replies": [{"body": "I tried to get in but I missed my limit buy by a dollar. A farking dollar....", "score": 1, "replies": []}]}, {"body": "Blue O is a rocket (ground takeoff to space) Virigin G is a spaceplane (taxi'd to high elevation, then launched), thats the only difference in their dick measuring contest. Both have different applications when it comes to monetizing/commercializing", "score": 2, "replies": [{"body": "One goes to space and has applications beyond firing off suckers into \"space\" and the other is $SPCE", "score": -1, "replies": []}]}, {"body": "lol u kids are so fucked keep riding ur spce intothe ground. btw there are no tendies in the soup line", "score": 6, "replies": [{"body": "Have fun staying poor kiddo", "score": 3, "replies": [{"body": "ahahahha\nAHAHAHAHHAHHAHAHABBSHSHDHJDNRJEI  KEJEJDNDIEBFNDJIENDND\n\nno really.\nyou are fucked\nahahahhaha", "score": -2, "replies": [{"body": "I’ve banked over 6 figures from SPCE calls and riding over 1000 free shares, if that’s fucked I’ll take it", "score": 3, "replies": [{"body": "cool bro dont tell anyone else you raped them tho u might catch a case from all these baggers", "score": -3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah I agree, it's almost as if this is all just a competition between these two and they haven't thought the business through. But then I had gone long in Virgin Galactic back in October and I sold last week, so I'm not mad at him.", "score": 1, "replies": []}]}, {"body": "I feel bad for the people who think this was a big accomplishment for space travel.", "score": 1, "replies": []}, {"body": "Agreed\n\nSpce is the only real player now as branson won\n\n\nAnd\nHe did go into space by any real\nDefinition\n\nMost here dont even know who burt is\n\n\nHypersonic baby", "score": 0, "replies": []}, {"body": "Hypersonic travel is unnecessary, and physically and economically unviable.  There's no reason anyone has to be anywhere within 2 hours when you have to schedule and preplan a flight anyway.  This is the dumbest business model ever.  That said, there are plenty of retards in the world so I'm sure they'll be very successful.", "score": -3, "replies": [{"body": "You are the kind of dude that would advocate for horses when cars debuted. Just too dense to see the writing on the wall.", "score": 5, "replies": [{"body": "And you're the kind of dude who saw 3DTVs in 2010 and thought it was the next big thing.  \n    \nWhat part of virgin galactic do you see as profitable now or any time in the future? It's a novelty and it always will be", "score": 0, "replies": [{"body": "Yes. That's why personally I'm interested in the stock and not in the company. At least right now, maybe later I'll be interested in the company too.", "score": 2, "replies": []}]}]}]}, {"body": "Can barely afford bus fare, so good to them", "score": 1, "replies": []}, {"body": "I love the idea behind spaceplanes, especially a single stage to orbit design. There's a lot of utility when everything is recoverable and you don't have to worry about ground conditions to launch. That said, SPCE is just for fun. Payloads can't reach orbit with that design. Virgin orbit, however... it's still a multi-stage design, but let's see what they come up with in a few years.", "score": 1, "replies": []}, {"body": "Fuck Bezos.  Guy works his employees into piss bottle toilet breaks.  Dickhead by name, dickhead by nature.  Even his rocket looks like a giant dildo he's sitting his butt on.", "score": 1, "replies": []}]}
