{"title": "INTC", "selftext": "All right I know I know : *Who wants to buy this boomer crap?!*. Bear with me for a minute.\n\nFirst you see that they are going for 3nm with TSMC next week. (Link removed because seeking alpha is banned. Just Google it.) \n\nYou also see the fundamentals are insane.(Link removed because imgur is banned. Google it)\n\nP/E is 9. Stock has been trading sideways for a year because dumbass previous CEO was an inbred mongoloid who hired a random hooker as VP and some guy from Qualcomm (with 0 foundry expérience) as tech lead. \n\nThe New CEO though, he isn't fucking around. [New chip design is quickly closing the gap with AMD.](https://www.tomshardware.com/features/amd-vs-intel-cpus).\n\nBut all this shit doesn't matter because of Geopolitics: Intel is a US national asset. It's not going anywhere (but up).\n\n\n**But who the f cares about fundamentals : IV. Is so low you can get FEB 22 70C for 20 bucks... 20 bucks!**\n\n**TLDR: *If you don't buy INTC right now you deserve to be poor.*\n\n\n*\"Positions or BAN\" : balls deep in Dec 21 60C*", "id": "rapo1y", "created_utc": 1638848094.0, "score": 75, "upvote_ratio": 0.83, "num_comments": 76, "comments": [{"body": "you could get them for $20 earlier today, not after this after hours shit went down", "score": 33, "replies": [{"body": "Oh shit I didn't even see. Lol I'm up 40K", "score": 50, "replies": [{"body": "hey dad", "score": 15, "replies": []}, {"body": "How’s it going with the premarket?", "score": 2, "replies": []}]}]}, {"body": "Fart sound. Followed by a burp.", "score": 17, "replies": [{"body": "Was the fart sloppy and wet?", "score": 1, "replies": [{"body": "Mmmmm yumyumyumyum", "score": 1, "replies": []}]}]}, {"body": "Lmfao af Intel unexpectedly rockets then all of sudden people coming out of everywhere saying to buy Intel", "score": 28, "replies": [{"body": "*How dare they make money !!!*", "score": -3, "replies": [{"body": "this is hindsight 20/20 lol.  \nintel was a good buy yesterday.  \ntoday...? im not so sure.  \n\nIf u meant long term hold yes.  After I switch to investing, I'll buy at least 30% intc.  \nThey make more money in 1 quarter than amd makes in a year.", "score": 18, "replies": [{"body": "Even after today's price action and even if it dips at open, and even if you ignore the news, you have to be dumb to sell intel at this price. Check fundamentals", "score": 3, "replies": [{"body": "theres an argument to be made here.  \nopportunity cost - i believe this is intel's floor.  \nmeaning to say i could sell it off, risk some other plays and still come back to this price anyway (49-55).", "score": 3, "replies": []}]}]}, {"body": "That's uh, not what they meant at all.", "score": 1, "replies": []}]}]}, {"body": "I like intel a lot to be honest", "score": 12, "replies": []}, {"body": "Stock been trading sideways fur like 5 years.  But money better spent elsewhere", "score": 19, "replies": [{"body": "Of course they did. They had the worst possible CEO for 5 years. \n\nBut if Patrick can't fix it, nobody can.", "score": 7, "replies": [{"body": "As long as he doesn’t live under a rock", "score": 2, "replies": []}]}]}, {"body": "As long as it makes SOXL go up thats all I care about.", "score": 5, "replies": []}, {"body": "Ive said this before here. Potential is huge for Intel. And I am not talking Alder Lake. LittleBig into desktop will be huge. Intel having its own foundrys. Apple fanboys spread fud but Apple was what, 1% of Intels production according to analyst. \n\nI dont think it will do an AMD. But its gonna go high.\n\nEdit: Also forgott. AMzn doing its own server cpu makes amd obsolete and amzn was a big customer.", "score": 6, "replies": []}, {"body": "Actually I’m in, you had me at low IV. Just need it to tank some more after this bounce.", "score": 5, "replies": []}, {"body": "\"Bear with me\"? Didn't read the rest, buying puts", "score": 4, "replies": []}, {"body": "Bull case argument is the $50 billion incentive by US government for Foundry business. In perspective TSMC is 3X bigger than INTC, the foundry business alone will make INTC 2X bigger in next 3-4 years", "score": 8, "replies": []}, {"body": "AMD is eating them alive", "score": 17, "replies": [{"body": "No argument there. \n\nDoesn't mean INTC isn't insanely undervalued. \n\nCheck the news lately. There is the CHIPS act coming and They also have the TSMC deal coming...\n\nYou have to be blind to not see the oncoming  shift. *Buy American* wasn't just a trump fluke. It's coming back full force and guess what: INTC basically has zero American competition. (AMD is essentially a taiwanese company at this point)", "score": 18, "replies": [{"body": "Maybe. I can’t stand Intel so I have not paid much attention to them.", "score": -2, "replies": []}]}, {"body": "Everyone says this. Performance per dollar it appears they should. However, in my limited experience the performance per core with AMD still lags behind Intel to a degree that the additional core count didn’t make up for.", "score": 2, "replies": [{"body": "Let’s be honest people in the market don’t care about the actual statistics of the processors. They just want to hear cool sounding deals and fancy words that make dollar go up. I think they are close enough to where either one works fine. Price movement will come down to who is better at looking better in the news articles which AMD does very well.", "score": 2, "replies": []}, {"body": "Why pay double the price for a CPU when it’s only marginally faster?", "score": 0, "replies": []}]}, {"body": "$AMD is down $NVDA is down \n\n$INTC is coming back for the CROWN", "score": 3, "replies": []}, {"body": "Sorry but that isn't true at the moment, do some research. They may take the lead again later this year, but don't have it now.", "score": 2, "replies": [{"body": "Yes, it is true at the moment. AMD is literally a whole generation ahead in the datacenter and the lead is growing. Nobody cares about the PC market, the datacenter is where money is made", "score": 4, "replies": [{"body": "You couldn’t be more wrong. Intel’s revenue in data centers alone is higher than AMD’s overall revenue.", "score": 15, "replies": [{"body": "The markets are forward looking", "score": 0, "replies": []}]}, {"body": "Lol you're wrong. \n\nDatacenter is dominated by Intel. Just because AMD makes a better chip doesn't mean the industry will switch overnight.", "score": 10, "replies": [{"body": "https://www.windowscentral.com/microsoft-azure-virtual-machines-are-more-secure-thanks-collaboration-amd-0?amp. \n\nhttps://www.reuters.com/technology/amazons-cloud-unit-launches-new-chips-take-intel-nvidia-2021-11-30/\n\nBearish arguments. The processor chip space is getting competitive, azure x amd Collab and more companies making their own chips.  \n\nThat said, Intel has so much money and expertise I simply can't believe they won't be competitive again. Nothing I've seen recently said they aren't trying or they are in the wrong direction.  \n\nI will have them as long term hold for sure", "score": 2, "replies": []}]}]}, {"body": "🤡", "score": -1, "replies": []}, {"body": "Sorry you’re wrong", "score": -3, "replies": []}]}, {"body": "Intel fanboys are out here SEETHING", "score": 1, "replies": []}]}, {"body": "Good play.  Remember, Taiwan is controlled by China and their current problems will trickle down.   Exactly what INTC needs to regain dominance.  I'm in.", "score": 6, "replies": [{"body": "This guy gets it. TSMC is a big player.", "score": 3, "replies": []}]}, {"body": "Agree with you here. Selling some of my BABA to Buy Intel in the morning before the price gets too high", "score": 2, "replies": []}, {"body": "I still don’t think intel can beat TSMC. Short of a Chinese invasion, no one will beat TSMC.", "score": 2, "replies": []}, {"body": "It's 20 bucks for a reason...  \nIts more likely the world ends by Feb 22 than Intel being 70bucks", "score": 0, "replies": [{"body": "Bet.", "score": 7, "replies": [{"body": "Bro check my submitted posts.  \nI literally have a Jan 70c 22 and more 😂.  \n\nhttps://old.reddit.com/r/wallstreetbets/comments/r62rq3/intel_has_let_me_down/.", "score": 1, "replies": [{"body": "Should have hold it a week more", "score": 1, "replies": [{"body": "oh dont worry, i didnt sell any.  \nim a big believer.  \ntendies or bust.", "score": 2, "replies": [{"body": "Yacht or Foodstamps", "score": 2, "replies": []}, {"body": "This is the way. Never sell. I'm holding too 2023's and 2024's", "score": 1, "replies": []}]}]}]}]}, {"body": "New CEO is mentally deranged (or making himself look like it) and needs to shut his trap before he makes everything else worse on himself and Intel, same with optics. 12th gen Core CPUs weren't that much better than the 5000 series from AMD. \n\nThere's a reason why I have been piping money over into AMD over Intel. They have a roadmap for what they want to do and is super eager to out compete themselves and the previous stuff. Plus you don't see Lisa Su or anyone else (besides that GPU dude I guess) spouting off stupid things like how they're going to try to win Apple back. AMD is actively competing against Intel on servers and desktop computers, while Intel is fumbling around like chickens with their heads cut off.\n\nAMD wants to win and they make it pretty obvious compared to Intel. My money is down on AMD for sure. Plus AMD has partnerships with Microsoft for the Xboxs and Sony for PlayStations, and even Samsung soon with Exynos. Keep in mind too AMD is in th Tesla's now, along with the super super hyped up Steam Deck. Don't see any of that with Intel at all.", "score": 8, "replies": [{"body": "is it!?  \ni actually am convinced of his speech when he first joined.  \ni believe that the intel foundry is going to be huge.  (they are going to allow companies to use intel tech that was previously propietary, sure tsmc and samsung might be more advanced, they are also at max capacity and intel is not that bad they could compete with amd still )  \n\n\n\nalderlake is awesome, gpu in 2022 would succeed more than the market is pricing it in too.", "score": 2, "replies": []}, {"body": "\\>*Going around talking shit*\n\nThis is the American way", "score": 2, "replies": []}, {"body": "All it takes is one chinese embargo and no schips(pun intended)leave Taiwan. And who has its own foundrys?", "score": 1, "replies": []}, {"body": "You mention having a roadmap as if Intel doesn't have a roadmap..\n\nAMD are so eager to compete against themselves that they stopped improving HEDT because they had no competition.", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|52|**First Seen In WSB**|1 year ago\n**Total Comments**|385|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/euodju/bear_gang_thread/) [x](https://www.reddit.com/r/wallstreetbets/comments/fixwx2/aal_to_reduce_international_flights_by_75/) [x](https://www.reddit.com/r/wallstreetbets/comments/f3yfbx/buy_case_for_hon_or_how_president_cheetos_is/) [x](https://i.redd.it/8wjxbyohrxc61.png) [x](https://www.reddit.com/r/wallstreetbets/comments/kx38jv/gme_igamma_squeeze_its_just_the_beginning/) [x](https://v.redd.it/w0afh03rqac61) [x](https://www.reddit.com/r/wallstreetbets/comments/fi7akt/euro_crisis_20_italy_spain_are_going_to_go/) [x](https://www.reddit.com/r/wallstreetbets/comments/rapo1y/intc/) [x](https://www.reddit.com/r/wallstreetbets/comments/raphrc/intc/) \n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rapo1y)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rapo1y)", "score": 1, "replies": []}, {"body": "Mmm hooker", "score": 1, "replies": []}, {"body": "bear? k shorting time", "score": 1, "replies": []}, {"body": "Well shit this looks like it was another doc lol", "score": 1, "replies": []}, {"body": "2.8% quarterly dividend too as a bonus. \n\nStill not sure though.", "score": 1, "replies": []}, {"body": "Did this mf really just say \"bear with me\"? \"Bear\"?! Are you out of your fucking mind? TSLA to the moon baby, recession is cancelled 🌈🐻", "score": 1, "replies": []}, {"body": "I bought into INTC with the new CEO because I liked what he brought to the table. The turnaround hasn’t and won’t be quick and easy but it will happen. It started with a few underwhelming earnings reports (I added each time on the dips) and will change with the execution of their game plan.", "score": 1, "replies": []}, {"body": "Tell me why i just bought 50 3dte 55c?", "score": 1, "replies": []}, {"body": "See ya at 45$ next earnings. Classic intel", "score": 1, "replies": []}, {"body": "I'll buy more when it comes back down to 49. Buying leaps and waiting for random pumps has been profitable.", "score": 1, "replies": []}, {"body": "60c for April went brrr today buying ITM calls tomorrow.", "score": 1, "replies": [{"body": "No regrets.", "score": 1, "replies": [{"body": "Ppl don’t know what’s about to happen.", "score": 1, "replies": []}]}]}]}
{"title": "17 year-old YOLO 100% of life savings into LEAPS ($FUBO, $ASO, $SNAP, $DIS, $TSM, $DKS) LET'S GET THIS BREAD 🚀🚀🚀🍞🍞🍞", "selftext": "", "id": "rbabkx", "created_utc": 1638913380.0, "score": 22, "upvote_ratio": 0.6, "num_comments": 77, "comments": [{"body": "I had like 20 bucks to my name at that age. Godspeed", "score": 49, "replies": [{"body": "I had atleast -10k at the time", "score": 17, "replies": []}]}, {"body": "How's a 17 year old get 15k in life savings? I was lucky to have money for gas at 17 lol. Then again, I am retarded.", "score": 39, "replies": [{"body": "![img](emote|t5_2th52|4641)", "score": 6, "replies": []}, {"body": "Buying calls thanks to JPOW", "score": 3, "replies": []}, {"body": "cracker jack box prize", "score": 3, "replies": []}]}, {"body": "Better to do this retarded shit when you're young. That way the losses don't hurt as much later on. I don't know what half of these tickers even are, Goodluck young fuck stick.", "score": 29, "replies": [{"body": "Stupid reasoning. Losing out this amount of cash hurts even more. He could have tucked this away for 33 years on boring stocks and cash out 200k easliy. Ruining this now sets him back 200k for his 50 year self.", "score": 11, "replies": [{"body": "lmao time...not money...is the most valuable thing in life. what you going to do with 200k at 60?", "score": 11, "replies": [{"body": "if time is so valuable he should understand he wants to be retired at age 50. not 65.", "score": 2, "replies": []}, {"body": "*50. He has that amount when he is 50. By investing in boring stocks. If he took some calculated risk it could be another 0 behind it. But yolo options is just wrong.", "score": 1, "replies": []}]}, {"body": "We all gonna be dead from covid-69 by then, better to yolo it now", "score": 11, "replies": [{"body": "amen brother, i don't wanna retire when I'm 65 I wanna retire when I'm 25. Plus $15k ain't shit. I'm in college for an MBA and I'm just gonna get a job afterward and make this much in like two months. Better to try and turn this into some real money than slowly compound it so I can afford the nicest nursing home in the world", "score": -6, "replies": [{"body": "You're about to get your BS in WSB", "score": 16, "replies": []}, {"body": "An MBA is a complete waste. Just work after undergrad", "score": 3, "replies": []}, {"body": "I'm with you. Yeah, don't worry about the $15K, you will not be able to yolo later in life when you have mortgage, family, bills etc. This is your best chance. Best of luck. \n\nBtw what's your thesis for $ASO? Do u maybe know any good DD you maybe can link?", "score": 4, "replies": [{"body": "This one's pretty good, basically just my DD but better https://www.reddit.com/r/wallstreetbets/comments/pkyq64/stop\\_buying\\_dumpster\\_fires\\_and\\_buy\\_aso/", "score": 4, "replies": []}]}]}]}, {"body": "Thats what makes it funnier", "score": 1, "replies": []}]}, {"body": "I've done DD on all the stocks, plus this isn't my first LEAPS rodeo.\n\nDisney - Well off ATHs, still rebounding from COVID, selloff from slowing Disney+ growth is overblown\n\nAcademy Sports - Insanely low PE ratio plus insanely high and consistent earnings beats. Growing like crazy too.\n\nDick's Sporting Goods - Stock recently dropped like 30% on revenue, EPS, and guidance beat. Shit makes no sense. Also growing.\n\nSnapchat - Growth is very high, selloff from Apple advertising changes is overblown.\n\nTSMC - Semi sector is so strong rn, TSMC basically has a monopoly, so it's a semi play. Semis are @ ATHs meanwhile TSM is @ 122 vs 142 ATH.\n\nFUBO - Just recently beat earnings and guidance, got punished anyway, all the way from 33 to 16. Value + growth IMO. I use their streaming platform anyways, it's good", "score": 2, "replies": []}]}, {"body": "Well, How many days do you think this kid will hold those leaps and then sold for a loss? I bet 69 days.", "score": 12, "replies": [{"body": "I held AMD LEAPS earlier this year from 89 to 73 and lost 40% of my account, doubled down because I liked the stock, cashed out a 140% gain once we made it to the 100s. I've been trading for three years now, so I've already gotten most of the autistic shit out of the way lol", "score": 15, "replies": []}]}, {"body": "But minors can't own stocks?", "score": 9, "replies": [{"body": "And major countries shouldn't have a negative P/E but hey welcome to 2021", "score": 12, "replies": []}, {"body": "You can if you open the account with a parent.", "score": 3, "replies": []}]}, {"body": "I don’t think you can trade at 17", "score": 8, "replies": [{"body": "You can if you open the account with a parent. It will be converted once you become of age.", "score": 3, "replies": []}, {"body": "OP says he’s been trading since he was 14", "score": 2, "replies": [{"body": "yep. ugma/utma account on tdameritrade. im a weird kid", "score": 3, "replies": [{"body": "Same brother, started a year ago and now I’m 16", "score": 1, "replies": []}]}]}]}, {"body": "How does a teen have this much money?", "score": 5, "replies": [{"body": "Lives at home, works at Wendy's, save them tendies.", "score": 5, "replies": [{"body": "Almost right lol. I took a gap year in-between school and college to save up some money working fast food and made some nice profits on AMD.", "score": 4, "replies": [{"body": "Su Bae be treating people right! And, may your portfolio print because you're not a total degen and have leaps. Best of luck.", "score": 3, "replies": [{"body": "Yeah, I'm done putting my entire account into options expiring in minutes... how I lose $3,000 lol\n\nalso praise our lord and savior Lisa Su", "score": 3, "replies": [{"body": "Yes, nothing like watch thousands evaporate before your very eyes! Sobering.\n\nSue has been good to me too.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "A true retard. Good luck.", "score": 5, "replies": []}, {"body": "Remember the first one's free. If it's good enough for a screenshot, good enough to cash out. Good luck.", "score": 4, "replies": []}, {"body": "ASO should crush earnings, the question is if they get treated like DKS", "score": 3, "replies": [{"body": "Exactly my thoughts. ASO's multiple is just so low, especially considering their growth has been insanse. But DKS did get clobbered on earnings for no reason. Hence why I bought.", "score": 1, "replies": []}]}, {"body": "Fuck dude. I couldnt even afford the extra bag of chips at lunch back in high school. Not even joking about that one..", "score": 3, "replies": []}, {"body": "How are you long $VIX and $DIS at the same time? If you are trying to hedge this is not the proper way", "score": 2, "replies": [{"body": "Eh, idk. I figure if the market starts to fall again thdn a VIX call could provide something of a buffer so I can liquidate a little less painfully, but the call option won't lose too much value if the rally continues since most of it's value is time value rather than principle since it's OTM and the VIX's implied volatility is so high. I think Disney is way too cheap rn and I think this is a good price, and there's a chance it'll take off from here. There ya go", "score": 2, "replies": []}]}, {"body": "By bread, he means money", "score": 2, "replies": []}, {"body": "DKS and ASO . Awesome list.", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|3|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rbabkx)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rbabkx)", "score": 1, "replies": []}, {"body": "If theres a long bear market your leaps are nuked", "score": 0, "replies": []}, {"body": "can a 17 year old really refer to them as \"life savings\"?", "score": 1, "replies": [{"body": "well, they are the savings of my life so...", "score": 6, "replies": [{"body": "Good point. 👍🏼", "score": 2, "replies": []}]}]}, {"body": "Terrible choices", "score": 1, "replies": []}, {"body": "Nice buying leaps, that extra DTE.", "score": 1, "replies": []}, {"body": "FUBO will need capital infusion and fast, yes growth looks good but shares oustanding have also exploded so as a minority shareholder you have stayed still.\n\nSNAP you can kiss that money goodbye. Sure topline is growing and gross margins are expanding but not fast enough to justify 22x P/S.\n\n1. Are you screening for short interest?\n2. Whats your hypothesis on why the market is pricing sporting goods DKS & ASO at these depressed multiples?", "score": 1, "replies": []}, {"body": "Not the worst yolo i have ever seen.", "score": 1, "replies": []}, {"body": "OP look into selling short calls against your Leaps and reinvesting the premium.  PMCC - short calls should be .1 to .3 maybe 7 to 45 dte depending on possibility of underlying running.", "score": 1, "replies": [{"body": "Ive heard of this strategy before actually- shorting options isn't allowed for my account type", "score": 1, "replies": [{"body": "Short just means that you are selling them.  These are calendar Spreads.  Even retirement accounts are allowed to do them.", "score": 1, "replies": []}]}]}, {"body": "I am 20 with net worth of $7000 fuck u lmao.\n\nBut also teach me your secrets", "score": 1, "replies": []}, {"body": "17 year old and “life savings” doesn’t really really go together. However, I know people who inherited sums in the 50k-100k range at a young age and blew it all on bullshit within a year and nothing to show for it.", "score": 1, "replies": [{"body": "I've never read a k-10, but I've pet plenty of k9s.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "😝", "score": 1, "replies": []}, {"body": "Any update on this?", "score": 1, "replies": [{"body": "Well, after the Nasdaq dove 30% with WWIII and everything else, with I ended up selling a lot of things (albeit too late) and rotating into Facebook and Academy leaps where I am still getting smothered, especially right now thanks to Snapchat's 8-K filing saying that they're going to miss guidance due to \"macroeconomic weakness\". \n\nI lost about 80% of what I had, but I'm working hard to make the money back and learn from my mistakes, again. It is what it is. Should have sold way earlier and bought puts on companies like PayPal and NVIDIA, which I thought were overvalued ages ago. Hindsight is 20/20, but I am still a noob to LEAPS and this was good experience. I see where I went wrong, treating options too much like stock and refusing to sell because I thought I could weather the storm and make more returns by doing so. Too greedy when others are fearful lol.", "score": 3, "replies": []}]}, {"body": "Yo how did those $ASO calls do?", "score": 1, "replies": []}]}
