{"title": "Is Alphabet Inc (GOOGL) Stock A Safer Bet Than Facebook Inc (FB) Stock Now?", "selftext": "Should I Sell FB Stock And Buy GOOGL Stock? ", "id": "5j67vb", "created_utc": 1482151817.0, "score": 14, "upvote_ratio": 0.75, "num_comments": 58, "comments": [{"body": "If I had to invest in one, it'd be google. Seems more future proof.", "score": 14, "replies": []}, {"body": "They're both quite different companies but still, it often seems like Google pretty much owns the internet nowadays, so I'd go with that instead.", "score": 7, "replies": [{"body": "I'd debate that $AMZN owns a lot of the \"internet\"... Internet meaning the mainstream sites/apps", "score": 5, "replies": [{"body": "AMZN is more prone to market share loss by competitors though. Nobody has got it right yet but eventually others will. The barrier to entry to compete with Google's search engine is much much higher. ", "score": 9, "replies": [{"body": "google is a freaking word for god's sake. Amazon just offers convenience, but not even close to the level of google. ", "score": 1, "replies": []}]}]}]}, {"body": "Yes. Facebook is a one trick pony. Google's Pixel phone is gaining some traction and their self-driving car project is coming to market shortly. Over the next few years, there's a lot more fundamental upside in Google than in FB, although I believe they'll split the stock sooner than later because the price point is too high, relatively speaking.", "score": 6, "replies": [{"body": "FB a one trick pony?\n\nJust lol. Thank you internet, I've heard it all now", "score": 6, "replies": [{"body": "Explain to me what else Facebook will profit from in the next 10 years excluding advertising revenue? Remember MySpace? People also thought that would last forever. Zuck and team have been able to capitalize big time off Facebook, but at the end of the day, their r&d is nothing compared to what Google has done. ", "score": 1, "replies": [{"body": "Oh, but please, explain how Google will profit off anything but advertising. ", "score": 6, "replies": [{"body": "Google is getting into the hardware business. Remember when the iPhone was exclusive to AT&T? That's the way these projects work. You start on one carrier, refine the product and launch on all major carriers with the next iteration.\n\nOn top of that, Google's autonomous car project is being incorporated as we speak meaning the product is ready to start hitting the market. Some automakers have already cut deals with Google to implement the technology into their cars. Google will be the first to market with legal self-driving technology and will probably be the biggest name in that segment for a decade or two. Remember how quick automakers were to throw bluetooth into their cars? Well, autonomous driving is proprietary, unlike bluetooth which is an open standard. That means car companies will have to license the tech from Google. It's not rocket science. There will be big demand for self-driving cars and Google is going to be the only place your favorite car manufacturer will be able to get a street-legal version of it for the next 10 years.\n\nThe last time I checked, hardware and automotive products are pretty far from \"advertising\". Of course, ad revenue will be the vast majority of Google's revenue for the next 20-30 years, but the projects they've invested billions in over the last decade are slowly but surely coming to market. Facebook has no means of growth aside from MAU. That's not a positive sign given the shrinking growth of new users.", "score": 6, "replies": [{"body": "Are we talking profit or revenue? Hardware is extremely low margin. Advertising is high margin if you own the targeting data and the users.\n\nFacebook owns Oculus. Arguably the top VR company in the world. So, yeah, they definitely have a diversified revenue channel setup for the future. ", "score": 2, "replies": [{"body": "Oculus isn't leading the VR market yet, because VR still hasn't integrated into the consumer market at a large scale yet. So there is still a lot of room for a third VR company to join the competition, besides the existing competition given by Vive and the other headsets for different platforms. Then there's also mixed reality headsets like Halolens coming out soon. Oculus isn't a secured source of revenue yet as the market is still extremely young.", "score": 3, "replies": []}]}, {"body": "Don't forget that Google runs one of the largest and most successful cloud operations in the world, collects more user data than any other company, runs arguably the best email service, and also is able to enter new competitive markets more seamlessly because of past R&D. ", "score": 1, "replies": []}, {"body": "dude Google is basically the same play as FB...they're all on ads right now. Whatever gadgets or doohickie hardware that each company wants to develop still has a long way to go.", "score": 1, "replies": [{"body": "Though Google can access information from Android phones, Youtube, Google searches to Chrome browser! And AdSense is on most websites. \nAlso, Apple has been riding on their iPhone sales for a while know, so if Google's Pixel lineups gains more traction they will definitely be a significant source of revenue. \nGoogle/Alphabet has a very far reaching portfolio, from the Search engine, Android, Web services, Assistant, etc. To Daydream VR, Pixel, Boston Dynamics, Nest and so much more.", "score": 2, "replies": [{"body": "Android is free... Google does not make any money off it like Apple does OSX or IOS... everything else you've mentioned is just ads like fb", "score": 1, "replies": [{"body": "They have access to information about from your Android phone and the other Services linked to your Google account. Unlike Facebook which requires you to use Facebook. While the amount of users on FB will keep fluctuating depending on certain trends, the Google universe is just increasing. Even most iPhone users use Google Maps or Chrome. You really have to go out of your way to avoid using a Google product, which really works in their favor. So, sure they do rely on ads, but the information they provide for ads is a lot more promising than Facebooks. For instance, Google Ads actually make me want to click them sometimes, Facebook ads come off as irrelevant and has me questioning why I'm seeing this.\n\nAs for the other stuff, Daydream VR is a very promising Mobile VR headset that's really cheap and therefor has a huge market. Pixel is competing with other highend devices and promises to be built with the OS, which has third party companies like Samsung and HTC beat and competes directly with Apple's strategy. Nest is becoming a really popular home security product. Google Home competes with Amazon Echo, is cheaper and has come on top of echo in quite a few reviews. Boston Dynamics has a lot of potential. And then there are a lot of other projects that Google either is working on or owns. There's a lot of scope for further growth! ", "score": 1, "replies": [{"body": "Bro all of that is ads...that's their source of revenue. Phrasing it a different way doesn't change that.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "They have products..... Chromecast, software, hardware, and they are making their driverless cars. They are creating a whole new company with their cars though. ", "score": 2, "replies": [{"body": "They stopped making cars and are licensing the software out to other car companies. Doubt that's going to be a huge business.", "score": 1, "replies": []}]}, {"body": "I throw in robotics too. Don't forget that Google bought that 8 or 9 robotics companies a few years ago. I know they've had issues with the division but even separate those companies were impressive. ", "score": 1, "replies": []}, {"body": "Doesnt that apply to fb too?", "score": -1, "replies": [{"body": "No. they own Oculus. ", "score": 1, "replies": [{"body": "That's not even comparable in revenue to their advertising $.", "score": 1, "replies": [{"body": "It's a bet on the future. FB advertising revenues are not going anywhere for a while. And if they do, Oculus will give them some breathing room when it does happen. ", "score": 1, "replies": [{"body": "I think you are overly optimistic on Oculus. There's quite a few companies working on virtual reality. And many of those other ones have video game development experience, unlike Facebook", "score": 4, "replies": [{"body": "So you're saying they won't make money on it at all? Wasn't the argument whether they had alternative revenue channels besides advertising?", "score": 1, "replies": [{"body": "Never even said that. I said that the potential revenues of VR probably are dwarfed by their ad revenue. I never said they won't make any $ on it", "score": 1, "replies": [{"body": "Today. When you invest in stocks, you're investing in the future. ", "score": 0, "replies": [{"body": "Why are you quoting cheesy lines? We're well past that point and are talking about the specifics of fb...", "score": 1, "replies": []}]}]}]}]}, {"body": "You think a $500 toy that needs a $500 computer to use is going to save them. A recent survey on Steam show that there are more people using the HTC Vive than the Rift.", "score": 1, "replies": [{"body": "And more people use PlayStation than Xbox, and Xbox was still a $10B a year business... your point?", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Instagram is going no where in the next ten years, and it is next to impossible to get rid of your Facebook account especially with all your great photographic memories on it (barf). I agree theyll most likely have advertising revenue, but you never know with the size of the company. Also, whats wrong with advertising revenue? I'd argue that it'll only become more profitable in the future.", "score": 1, "replies": []}, {"body": "I'm laughing at people downvoting this. It sucks to hear things you don't like.\n\nFB is a one trick pony.  Their entire business model is collect data, advertise based on that data.  The one exception is if Oculus Rift takes off.... although I'm betting google (among others) will be strong competition against them. \n", "score": 1, "replies": []}]}]}]}, {"body": "Absolutely.  Everyone I know has jumped ship on Facebook and given their last quarter mentioning growth on the social website has stalled and decreased in users, their is a lot of uncertainty with Facebook right now and will be for a while.", "score": 3, "replies": [{"body": "The biggest problem FB is going to face is the product growing old and stale. Social networks work in a cyclical cycle. Once users drop, it's VERY difficult to get them to sign back on. People are fickle, socially speaking. That also applies on the internet.", "score": 5, "replies": [{"body": "Instagram has 600M monthly active uses and will hit 1B by next year.i think they're doing just fine.", "score": 7, "replies": [{"body": "Instagram has limited ad revenue potential as compared with the core Facebook product. There's only so much advertising you can do with pictures when compared to URLs. Twitter also has a giant user-base but can't seems to be a victim of its own success in that regard. MAUs does not correlate directly with advertising revenue.", "score": 3, "replies": [{"body": "Twitter can't make money with ads because I they don't have any data on heir users to allow advertisers to target who their ads should show up to.\n\nOn Facebook advertisers can target users who are Jewish, who live in Miami, who listens to Pear Jam, and voted for Trump, and is engaged. No way Twitter has that lev of specific targeting. Facebook does. Hence their insane revenue.", "score": 5, "replies": []}, {"body": "Could you elaborate more on the distinction between pictures/ URL's and how it pertains to significant differences in generated advertising revenue? I'm a little new to this. My instincts tell me the Instagram's central focus on images would yield even better advert related revs but, as I said, I'm new. ", "score": 2, "replies": [{"body": "So, users are presented with an AD that usually redirects them to a webpage that tries to either sell a product or collect an email and phone number for a mailing list. The VAST majority of online advertising operates in such a fashion. In the industry, they're called landing pages. Advertisers create a number of landing pages to see how the marketing campaign would perform on a larger scale before making decisions. Facebook's ads work because the difference between a link your friend posts and a sponsored ad isn't inherently obvious. There is a small \"sponsored\" text at the top of the post but there's no inherently obvious way to distinguish ads from posts in your feed. A friend of your clicks like on an ad and what you see is \"john doe likes _____\" along with the ad which is highly targeted based on information Facebook has collected about you from your profile and other sources. On instagram, the amount of data points collected on users is fairly limited - maybe who they follow and the tags they like. Now, most users don't search for tags. Ads on IG are inherently obvious as IG shows you WHO POSTED not who likes what. Accompanying text is not an ability. The text must be embedded in the image which makes ads more cluttered and less cohesive. If you look at the successful advertising platforms such as Google, you'd notice their text ads are far more expensive than image ads. Why? Because they work a whole lot better. Someone searching for something is more likely to read text before deciding to click and less likely to click on an image as they are seen as advertisements in the eyes of the public. In other words, image ads are obvious and ads with accompanying texts are less intrusive - or at least they appear to be to the naked eye. No image/video ad platform has been even remotely as successful as platforms that features text as well. ", "score": 2, "replies": [{"body": "This is pretty thought out input. Appreciate it. IG seems to have another avenue for ads, however, that come from visible people wearing and tagging positioned product. I've heard it is a very sought after space. Could this feasibly count as a potential rev source? If IG could practically identify this kind of traffic and effectively tax it? $$$ would indirectly come from ad sponsors by way of popular users. Not sure if this is already done though. Again, I'm new. ", "score": 1, "replies": []}, {"body": "What you're talking about is called ad formats, and they can be easily changed and updated. These are heavily a/b tested to make sure they get the highest click-thru-rates. I'd trust the IG ads team to know what works best on IG compared to other platforms.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You don't understand IG advertising. You can do ads with photos and links. ", "score": 1, "replies": [{"body": "Instagram is going be such a great cash flow for Facebook. They could've had two huge cash cows if they found out how to purchase snapchat. Zuckerberg is doing something right with the company. Good managment", "score": 1, "replies": []}]}, {"body": "Good Discussion - I ran fundamental valuations on Apple, Google, Facebook and Amazon (ran them in stockcalc.com).\nNumbers shown are calculated value per share using the valuation model indicated.\nI have never been able to buy AMZN due to these numbers.  Have owned the rest at different points in time.\nGoogle looks like the best bet currently, Apple also but it has had a good run from 90.\n\n\t        ClosePrice\tDCF\t        Comps\tMultiples\tABV\t        Analysts\nAAPL\t        115.97\t118.61\t131.36\t101.85\t132.95\t133.13\n\nGOOG       790.89\t804.81\t1268.24\t793.84\t709.52\t967.82\n\nFB\t        119.87\t  99.11\t  63.06\t144.19\t130.30\t152.36\n\nAMZN       751.77\t309.40\t427.60\t959.83\t655.59\t943.50\n\n\t\t\t\t\t\t\nNotes\t\t\t\t\t\t\nClose Price - Price as of close on Dec 16, 2016\t\t\t\t\t\t\nDCF - Discounted Cash flow Analysis using consensus forecast data as basis \t\t\t\t\t\t\nComps - Valuation of the company using comparable companies ratios\t\t\t\t\t\t\nMultiples - Valuation of the company using its historic ratios\t\t\t\t\t\t\nABV - Adjusted book value times historic Price to Book ratio\t\t\t\t\t\t\nAnalysts - Consensus Analyst 1 year target prices\t\t\t\t\t\t\n \n\n", "score": 1, "replies": []}, {"body": "GOOGL is given more preference. But I wouldn't hurry to throw FB. For me these stocks are pretty good in the long run. ", "score": 1, "replies": []}, {"body": " it always has been, imo", "score": 1, "replies": []}, {"body": "Facebook has a better value than Google, but I would invest in Google because of sheer growth, product, and market potential. \n\nEdit: anyone trying to argue that either one is a bad investment doesn't really have an optimistic view. Both good companies.", "score": 1, "replies": []}, {"body": "FB's high P/S ratio suggests future growth is already priced in. Google on the other hand, while having a somewhat high p/e ratio, has a finger in several pies, and while growth in one of the pies is already baked in, it could shoot higher if two or more \"moonshots\" succeed. Also, FB's forward looking p/e with growth factored in only matches google current p/e without the drivers factored in. TL:DR, Google is a better bet than Facebook.", "score": 1, "replies": []}, {"body": "Both good. FB much better value, I would take 8 FB shares over 1 GOOGL any day. ", "score": 1, "replies": [{"body": ">I would take 8 FB shares over 1 GOOGL any day\n\nthats not how this works", "score": 1, "replies": [{"body": "Please enlighten me.... My point is that GOOGL stock trades at almost 8x that of FB and FB could very well beat GOOGL to the 1 Trillion dollar valuation mark. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Amazon has a dividend??????", "score": 1, "replies": []}, {"body": "Agreed, I'm in AMZN for the long haul.  More and more people are going to quit shopping at malls because there is no reason to.  I probably did 80% of my Christmas shopping this year through Amazon.  ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> Why do you think Amazon is going back to building store?\n\nThis. I love how everyone talks about so many people shop online now, retail is dead. Yet amazon, the business everyone says owns the online retail market, is building stores for people to walk into.", "score": 2, "replies": []}, {"body": "Same thing everybody said about newspapers. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}, {"body": "My company uses GCloud which outpeforms and outprices AWS. I think Google all the way .", "score": 1, "replies": []}]}]}]}
