{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1fyr66m", "created_utc": 1728360037.0, "score": 16, "upvote_ratio": 0.94, "num_comments": 252, "comments": [{"body": "Nvidia at 100: SELL SELL SELL\n\nNvidia at 130: BUY BUY BUY\n\nThis subreddit in a nutshell", "score": 22, "replies": [{"body": "I want a 10:1 reverse split.  Those were simpler times.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "I’m holding this for the long term\n\nThe long term in reference: 1 week", "score": 5, "replies": []}]}]}, {"body": "I’ll eat my balls if it closes above 133", "score": 13, "replies": [{"body": "You gonna start with the left or right?", "score": 2, "replies": [{"body": "Guy's balls got saved by end of day day traders dumping their positions. His balls were less than a dime from becoming dinner.", "score": 2, "replies": [{"body": "![gif](giphy|z3piokwf0WPH81MOhu)", "score": 2, "replies": []}]}]}, {"body": "I'm not sure I'd risk my balls on such a close bet.", "score": 2, "replies": []}, {"body": "10 minutes to go and it's at $132.99, I'd start up the broiler", "score": 1, "replies": []}]}, {"body": "Blackwell is online\n\nhttps://x.com/Azure/status/1843637745186484406?t=uwSdtvFKHwk4Cmdpg8pvCA&s=19", "score": 11, "replies": [{"body": "How tf are some humans smart enough to create this, and others are dumb enough not to invest in it?", "score": 6, "replies": []}]}, {"body": "Glad I’ve just been holding and DCA for the past 6 years. I never listened to the fucking idiots on motley fool or seeking alpha or the random dog shit YouTubers. Here I am. Get fucked bears", "score": 16, "replies": [{"body": "for how many years u think u'll hold ?", "score": 3, "replies": []}, {"body": "🔥🔥🔥🫡🫡", "score": 0, "replies": []}, {"body": "I doubt you own any shares", "score": -7, "replies": [{"body": "Yeah a mod of this subreddit owns zero shares alright. Gave me a good chuckle", "score": 6, "replies": [{"body": "0", "score": -1, "replies": [{"body": "Have a good day now kiddo 😭", "score": 5, "replies": [{"body": "0", "score": -7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "\\*owns 0 shares of Nvidia. angry\\*", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "130 wall is real", "score": 8, "replies": [{"body": "I still have PTSD from the massacre at 140.", "score": 8, "replies": [{"body": "PTSD? I'm still trying to break even lol\n\nOnce I do, I'll deal with my PTSD.\n\nI'm suspicious when this reaches 130 now. The fundamental hasn't changed since the last earnings report when it crashed to 90s in August.", "score": 3, "replies": []}]}, {"body": "So was 120 now we push past it.", "score": 1, "replies": [{"body": "Yeah, but it took a good deal of effort.", "score": 2, "replies": []}]}, {"body": "We bounce off it at 130.01 this morning.", "score": 0, "replies": []}]}, {"body": "I hope we can sustain it this time . Has there been any news driving the price up ? Can't find anything.", "score": 6, "replies": [{"body": "Nobel prize in physics was awarded for inventing artificial neural network, so science community recognizes impact of AI nowadays", "score": 2, "replies": []}, {"body": "There is an event ongoing now\n\nAI event or something. So this could be why its rising ...", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "I just hope we close the day above 130, would be a huge win.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "knowing Nvidia's volatility, i wouldnt bet on it :P But i can see ATH in the next 6 weeks almost guaranteed unless WWIII happens.", "score": 2, "replies": []}]}]}, {"body": "It’s looking like we will ride the high 130 on the bolinger band lower here for a minute, and I’m thinking it’s gonna do another run. Maybe 132+. Just a guess as the rsi and mfi cool a bit.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I’m in options right now. Unfortunately entered a little higher than I wanted on my last order, but looking at a handsome profit if we can break that 131.90 mark. I don’t know why I’m a little shy to trade on shares probably just the leverage.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I did a quick 20k on one day, then lost 10k the next couple days. The decay is painful but when it runs they go hard. But now I never touch margin with them. To do similar gains in shares I’d have to go a lot deeper in margin than I’m comfortable with right now.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I wonder if we get a dip again or if we go to next ath.", "score": 4, "replies": []}, {"body": "We broke 130. Let’s see if it has the momentum to breakaway from the gravity of tens of billions of dollars in option at 130.\n\nhttps://preview.redd.it/e78xaq8b9itd1.jpeg?width=1170&format=pjpg&auto=webp&s=bb9a4235f034aa74d4b7ba4631c4ea75fd3431a3", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "What do you mean?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don’t know.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is only the beginning", "score": 9, "replies": [{"body": "Count Dooku proceeds to use FORCE MOVE to topple metal beams onto wounded Obi-Wan & Anakin. Yoda responds with FORCE HOLD, letting Dooku escape.", "score": 1, "replies": []}]}, {"body": "Small bounce on qqq and we get ath. 🙏🙏🙏", "score": 5, "replies": []}, {"body": "136 pls🙏🙏🙏", "score": 4, "replies": []}, {"body": "Guys don’t worry I have a limit sell order for 131 so with my luck it’ll break 150 within the month after I pull out", "score": 5, "replies": [{"body": "Why would you even contemplate selling the best tech stock in the world? \n\nWhat could possibly be a better investment over the next 5 years?", "score": 3, "replies": [{"body": "I made the mistake of investing more than I needed liquid within the next year but I’ll be back, maybe at a higher entry point, but I’ll be back", "score": 2, "replies": []}, {"body": "I'm up big and still holding  3k shares at close to 200% return....however 5 years would be a wee bit longer than I would currently feel comfortable committing to.  We'll see what happens when 2026 gets here and all that.  I may hold it for 5 years or longer, but I'm not thinking that is a given at this point.", "score": 1, "replies": [{"body": "I highly doubt you own 3k shares based on this response.\n\nPost a screen shot and prove me wrong.", "score": -1, "replies": [{"body": "https://preview.redd.it/pc8i171r0ktd1.jpeg?width=4320&format=pjpg&auto=webp&s=922d1b87cc8ac6ec7da8de77acc5be571343e63a\n\nYou are correct, I only have 2763 share.  I've had shares for over a year.  2 year timeline I'm good with.  5 year timeline has too many variables.  Jensen could retire or die, tech could make a massive shift away from GPUs that NVDA isn't prepared for, another stock could provide a better growth opportunity.", "score": 1, "replies": [{"body": "That's not from a real brokerage account.", "score": 0, "replies": [{"body": "Seriously dude, it's from my monarch app.  Sorry I'm not posting something from my brokerage that includes my account numbers and all that on it to prove it.  Have a good one.", "score": 2, "replies": [{"body": "Obviously, you need to post a screenshot with your cost basis and percent gain from an actual account to prove anything.\n\nAnyone can generate what you posted using different websites.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Limit order filled aye? ;) 800k volume in 1min pushed us over 131 :D", "score": 2, "replies": [{"body": "Order filled. Wish I could’ve held longer but life didn’t want me to", "score": 1, "replies": [{"body": "If you need cash, sell without thinking.", "score": 3, "replies": [{"body": "I thought there was a hair on my screen all this time... 🤔", "score": 1, "replies": [{"body": "There is.", "score": 2, "replies": [{"body": "Shaddap 😆 \n\nYour icon tricked me", "score": 1, "replies": [{"body": "How does a plain white picture trick you?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": ">I have a limit sell order for 131\n\nAbort Abort!\n\nIts just going to keep rocketing up\n\nI think the sideways game was over last month\n\nIt will dip here and there but its more tricky to predict.\n\nWith Blackwellmania coming soon... just hold. Buy and hold!", "score": 1, "replies": []}]}, {"body": "SELL SELL SELL", "score": 7, "replies": []}, {"body": "Wheres the folks that said we would see $80", "score": 7, "replies": [{"body": "Morning shift at McDonalds", "score": 7, "replies": [{"body": "🤣 \n\nI hate Mcdonalds these days.\n\n\"Can I get BBq sauce\"\n\n\"Is the BBQ sauce in the bag\"\n\nNo bbq sauce\n\nGeez just bc it didnt go down to 80 don't be mad at me", "score": 3, "replies": []}]}, {"body": "They are weeping\n\nNVIDIA went sideways for a few months\n\nNot anymore. Lets go 🚀", "score": 6, "replies": [{"body": "Same thing happened last summer, now it's up nearly 175% YTD.\n\nAnyone who sells this stock is insanely dumb.", "score": 2, "replies": [{"body": "I kick myself in the head for not buying it sooner\n\nIt was like at 350 and I went with AMD instead. \n\nNever believe these so called investment experts on nbc etc..  Half of them kept harping that NVIDIA can't continue this pace. \n\nBut yes it can.", "score": 1, "replies": []}]}]}]}, {"body": "Im a piece of shit. I sold for sub optimal profit. Someone shoot me in the balls while i gather my money. Next dip i'm going all in.", "score": 6, "replies": [{"body": "Same here. Sold at $130.\n\nSub-optimal profits are part of risk management.", "score": 6, "replies": []}, {"body": "same here i sold a part, but not all, i need to stick to my plan next time.", "score": 2, "replies": []}, {"body": "And what makes you think you won’t do the same thing next time ?", "score": 1, "replies": []}, {"body": "There might not be a dip like we’ve had the past couple months again , the momentum is on our side", "score": 1, "replies": []}, {"body": "sold back at $115 while it was dipping last month. i was planning to buy back in when it dropped to like $108 ish, and then it never dropped again. kept a little in it just in case, but I put too much trust in the people on here saying it was gonna keep dropping. smh.", "score": 1, "replies": [{"body": "Reddit gurus give the best advice!", "score": 3, "replies": [{"body": "ironically, some do! ...but most don't", "score": 1, "replies": [{"body": "i sold NVDA a few years ago based on reddit panic/gurus, bought back but lost a bit... anyway NEVER again.", "score": 2, "replies": []}]}, {"body": "DYOR for sure. Too many in this subreddit are day traders or leverage traders. Unless you know the motivation behind the advice, best to not even listen to it.", "score": 1, "replies": []}]}]}, {"body": "Listen to all the panic here of guys who don't know how this stock works, Why i stay OUT on bad days.", "score": 1, "replies": []}, {"body": "You already missed buying the dip at $100. It will never go below $120-130 again.", "score": -2, "replies": []}]}, {"body": "https://preview.redd.it/1wiqm853ujtd1.jpeg?width=3024&format=pjpg&auto=webp&s=41da5538b6f6993b2e918701bfe32918534b913c\n\nLFG!!!", "score": 7, "replies": []}, {"body": "More blackwell deliveries\n\nhttps://x.com/OpenAI/status/1843704848753283356?t=zGIQ7Kc8xi94gQrww7u9nQ&s=19", "score": 5, "replies": [{"body": "The biggest tech companies in the world are worshipping this technology, yet many regards here sold at $130 for a 2% profit.", "score": 6, "replies": [{"body": "Yah that's why we are the millionaires and they are the degens.", "score": 2, "replies": [{"body": "im not a millionaire yet", "score": 1, "replies": [{"body": "soon", "score": 1, "replies": []}]}, {"body": "Yes", "score": 1, "replies": []}]}, {"body": "Taking profits periodically and re-entering at lower price is a much better strategy than buy and hold forever.", "score": 1, "replies": [{"body": "Wrong", "score": 1, "replies": [{"body": "I know you’re wrong. 😄", "score": 1, "replies": []}]}]}]}]}, {"body": "Gaht, damn!  Glad I stayed long on Nvidia and wasn’t a paper handed baby.", "score": 3, "replies": [{"body": "How long you plan on staying?", "score": 2, "replies": [{"body": "10 years hopefully", "score": 3, "replies": []}]}]}, {"body": "SMCI got shorted pretty hard lol", "score": 3, "replies": [{"body": "Their management is terrible", "score": 3, "replies": []}, {"body": "Nvda next", "score": 2, "replies": []}, {"body": "Looks like it\n\nI'm staying away\n\nI think the long term investors want to see the 10k 1st.", "score": 2, "replies": []}]}, {"body": "Peaked at 132. CAN WE PUSH THROUGH?", "score": 3, "replies": []}, {"body": "I’ll sell my ass for 132 today 🤣🤣🤣🫡", "score": 3, "replies": [{"body": "Pay up.", "score": 5, "replies": [{"body": "Meet me at the Wendy’s parking lot I’ll be in my birthday suit \n\nI asked and received lmao 🤣🤣🤣", "score": 5, "replies": []}]}]}, {"body": "I’m gonna thank me for believing in me. I’m gonna thank me for not panic selling. I’m gonna thank me for dip buying on any opportunity even 115$. ", "score": 3, "replies": []}, {"body": "Looking like we are about to hit another support pivot. Big bolingerband squeeze and RSI MFI 20s are cooling. Might bump up to 133", "score": 3, "replies": [{"body": "I think 130-131 end of day", "score": 2, "replies": [{"body": "I’d be pretty happy with that. By my count I think we are gonna slip into oversold and bounce back up at least one more time. 133 is my high mark for the day but I could definitely see close about 131.", "score": 1, "replies": []}]}, {"body": "Bolingerband widths are squeezed to 0.00 on the 20 and the 50. It is probably going to pop in one way or another. Signals look up to me.", "score": 1, "replies": []}]}, {"body": "I could be wrong but day traders I think that's it for today. 132.92 was peak", "score": 3, "replies": [{"body": "I’m optimistic we can break that resistance before the end of the day. But I won’t be shocked if we close at 132.", "score": 2, "replies": []}]}, {"body": "Nvidia’s Q4 forecast is going to be great", "score": 5, "replies": []}, {"body": "NVDA is going to keep hitting ATHs because every company in the world wants Blackwall chips. No company can not afford to stay ahead in the digital world now. It’s competition and it’s also internet to the future of all companies.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Why wouldn't they go into small caps?  Unless to go into mag 7 to pump and dump real quick.", "score": 2, "replies": []}]}, {"body": "Off to a good start again", "score": 4, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "The resistance is all the way to 132, then there is a nice gap up to 135.\n\nDo you think the CPI report on Thursday might stall things around 127-131 til then? That's my thought at the moment.", "score": 2, "replies": []}, {"body": "but didn't u sell yesterday some ? what do u plan to do with the shares u sold", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "i took some profits yesterday but i regret, i'm not daytrading it XD", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "alright, yea i'm in a TFSA account so no taxes, but u cant really day trade in it.", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "thanks. Glad I completely sold SMCI before open . Got 2% gain! lovely", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I also out from NVDA today with 1% gain . Was expect for more. I just can't handle the bounce anymore.\ngood luck to you and others who still in the game today!", "score": 2, "replies": []}]}]}]}, {"body": "hopefully the best today. SPY is at 570 now. Everything seem good so far. Uplifting momentum.", "score": 1, "replies": []}, {"body": "Hi,\nso, do you mean you sell and re enter using your cash to buy share ?\nIf so, don't you get t+1 settlement constrain?\n\nif it was t+0, I could trade more actively to accumulate more cash, haha", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "understood!", "score": 1, "replies": []}]}]}]}, {"body": "My prediction: We will go back and hit support at around 125$. Would be healthy and then we can go higher. Makes no sence to reach 130$ and the next days go just higher.", "score": 2, "replies": []}, {"body": "Is there pent up demand from the last 3 months? 👀", "score": 2, "replies": [{"body": "There is a compelling evidence to say yes. Lots of very bullish news that went nowhere.", "score": 3, "replies": [{"body": "We had a solid earnings report", "score": 1, "replies": []}]}]}, {"body": "Qqq very weak, we would be ath if macro wasn't a limp dick", "score": 2, "replies": [{"body": "it doesn't matter, qqq will dip and then bounce back, then Nvidia will jump further than ATH. Its a waiting game.", "score": 2, "replies": [{"body": "I want it nownownow", "score": 1, "replies": []}]}]}, {"body": "$130.99 peak. NOICE", "score": 2, "replies": []}, {"body": "135 today. It's been so long!", "score": 2, "replies": [{"body": "135 is a lil crazy, let’s just hope 130 holds", "score": 6, "replies": []}]}, {"body": "What do you guys think the share price will be by January?", "score": 2, "replies": [{"body": "No one knows, but 5 years from now it will be significantly higher.", "score": 3, "replies": [{"body": "Yes, definitely", "score": 1, "replies": []}]}, {"body": "150", "score": 1, "replies": []}, {"body": "Who da fk knows", "score": 1, "replies": [{"body": "I’m only trying to gauge this subs sentiment towards the stock", "score": 1, "replies": []}]}]}, {"body": "NASDAQ up above +200 already, looks like investors still believe in US BigTech", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Why?", "score": -2, "replies": []}]}, {"body": "If you got a good premium for it and sold for profits I’d spin that cash around into a covered put. Re-enter if there is a pull back. If there isn’t you still make money. Win-win-win imo.", "score": 1, "replies": []}]}, {"body": "I’m sitting on 1400 shares without a care in the world. Let’s just hope WW3 doesn’t ruin the good times…", "score": 3, "replies": []}, {"body": "This is why yesterday wasn’t the day to sell and profit take", "score": 3, "replies": [{"body": "True but good profit is good profit at the end of the day", "score": 4, "replies": [{"body": "Your right . I just think with the last couple months being so flat the stock finally has time to make another run up leading up to Blackwell", "score": 4, "replies": []}]}]}, {"body": "Nvdia stock\n\nThe only stock where it reaches ATH... but makes people sad.\n\nOh boy\n\nI guess buy and hold. Buy with every paycheque is like the old way of doing things.\n\nThese banks have really pushed options and shorting into another level eh?", "score": 5, "replies": [{"body": "This is not ATH.", "score": 1, "replies": []}]}, {"body": "Every time it reaches 130, it is fighting for its life. This is annoying. Manipulators wouldn't let it pass 130. I wonder why.", "score": 4, "replies": [{"body": "Or maybe it's a resistance like we have been saying for days? You know, where people put their sell limit orders at? \n\nSo many people are afraid and just want to get out of the stock are also selling which adds to the resistance. So it will keep hitting the point, dip a bit, try again, weakening it til it can breach further. You have support til around 132 then its a bit of a blue ocean til 135.", "score": 2, "replies": [{"body": "I agree, even as a Nvidia bull, we will be fighting 130 for a bit since a lot of people seem to want to sell there.  Honestly, the fact that it opened and didn’t just plummet is good.  Wouldn’t not be surprised if we finish below 130.  But I’ll take any green day, even if it’s 1 cent in the green!", "score": 3, "replies": []}]}]}, {"body": "Foxconn building huge blackwell factory", "score": 3, "replies": []}, {"body": "Serious question: Didn't Jensen say **Q4** will be Blackwell around the last earnings? What stops us from seeing another earnings like the last one, as the next one will only be Q3?", "score": 2, "replies": [{"body": "There was nothing wrong with Q2\n\nNI was 168 percent better than y/y! It cant be 500 percent better every QE. \n\nThe expectations is crazy.", "score": 4, "replies": [{"body": "There was nothing wrong with Q2 at all, but the market might show the same reaction again is what I'm saying", "score": 1, "replies": [{"body": "Smci was the main problem imo\n\nThey got killed from 1k to 400 due to Hindenburg accusation \n\nNvidia also suffered but not as badly", "score": 1, "replies": []}]}]}, {"body": "im thinking the same, earning will be quite the same and therefore not enough for investors. Q1 25 will be the rise", "score": 0, "replies": []}]}, {"body": "Dear lord (Jensen Huang), i am never selling part of my shares when there's no sign of bad news and the outcome of the next months are very obvious, please pardon my mistakes and give those buy high shares that i just bought the power and resilience to overcome.", "score": 2, "replies": []}, {"body": "NVDA today, Tomorrow and the next few years. Hueng is making a big announcement soon. NVDA , AI and Nano. NVDA 200 ATH lets fucking go.", "score": 3, "replies": []}, {"body": "Finally back to 130... for now", "score": 2, "replies": []}, {"body": "NVDA will reach ATH soon and surpass. There will be a run up and slow climb past election into earnings. Most reliable company right now that produces and AI chips are a must buy for any company in the world. They have to keep up!", "score": 2, "replies": []}, {"body": "134.87 EOD", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Why would you buy after it pumps and rallies from $115 low last week to $129 now? Like everyone ALWAYS shouts in the comments here, buy the dip, profit take when it pumps.\n\nLast night few people exited their positions at $130 and rightfully so. Even if some downvoted them, thats the right move. If you are up, profit take, if you are down, DCA.\n\nAs long as fundementals don't change, that's the correct play.", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Sure. it COULD be.\n\nBut it's a gamble. When Nvidia dipped 30% from all time high, that was the key point to buy since no fundementals changed, infact they got stronger. \n\nBuying at near ATH has it's risks where it might test the 130.5 resistance (like it did yesterday) and dip a bit more before retesting again later in the week or month. \n\nRemember, we as investors are in it to make money, right? What I said is simply to maximise profits. If your prediction that now is the point where it will break out and rally to $140 was correct, then by all means buy in. But remember, it's a prediction, the market is very choatic and unpredictable.", "score": 4, "replies": []}]}]}, {"body": "Hold, theres the santa rally left", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yea", "score": 1, "replies": []}]}]}]}, {"body": "Does anyone know the estimated date of nvidia earnings?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "We did breakout of the penant so now it's an open highway to 135. But something tells me its too good to be true. I sold 10% at 131.8. Whatever happens i'm still fully loaded.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm gonna hold now til i see a test near 135, not expecting it today but this stock is fucking unpredictable so we wait and see", "score": 2, "replies": []}]}]}]}, {"body": "Wowow team 💚", "score": 1, "replies": []}, {"body": "how much more do you think it’ll go up today? is it too late to hop in for a buy call :(", "score": 1, "replies": []}, {"body": "Anybody concerned about Tuesday?  Or really this week in general?  It looks like we saw some of it this afternoon, but I'm worried about massive institutional rotation into China stocks to catch the boom there for a couple weeks up to a couple months.  ", "score": 1, "replies": [{"body": "China stocks crashed. Baba down 6% overnight", "score": 3, "replies": [{"body": "Wow, that was faster than expected.  Thanks ", "score": 2, "replies": [{"body": "https://preview.redd.it/bsw8zwv0ihtd1.jpeg?width=1125&format=pjpg&auto=webp&s=c82d242226869aa5d3d987d120b3229aa0b19239\n\nrug pulled. it's been more than 2 weeks rally. I was expected it to end much sooner. The image is hong kong index equivalent to SPY", "score": 1, "replies": [{"body": "Oh, I was never getting into China stocks myself.  I was just watching a video talking about how the Chinese government uses stock market rug pulls to fund state owned enterprises and local governments.  Usually the hype cycle lasts much longer than a week though.  Cf. 2008 and 2015, apparently. ", "score": 2, "replies": []}]}]}]}, {"body": "Never worry about China. Only noobs and the dummy’s that Wall Street hustles to late buy Chinese stocks. You will lose and faster than any other stock. CCP compete market control and the CCP sold out as everyone else holds bags.", "score": 0, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "SMCI is litting the market up today.", "score": 1, "replies": [{"body": "feel like NVDA suck green blood from SMCI", "score": 1, "replies": [{"body": "Why is SMCI down?", "score": 2, "replies": [{"body": "Meme stock is meming", "score": 2, "replies": []}, {"body": "no idea... it just a meme stock", "score": 1, "replies": []}, {"body": "get in, get out, quick buck.\nthat's it!", "score": 1, "replies": []}]}]}]}]}, {"body": "140 EOW. Should I load 140 calls now bois?", "score": 1, "replies": [{"body": "Load it up man. You gon be rich", "score": 2, "replies": []}, {"body": "Friday selloff i think it might not hit that", "score": 1, "replies": []}, {"body": "If cpi report is good", "score": 1, "replies": []}]}, {"body": "$133 rally at end of day. LETS GOOO", "score": 1, "replies": []}, {"body": "Boy is back on the menu, meat!", "score": 1, "replies": [{"body": "Pedo", "score": 3, "replies": []}]}, {"body": "[https://imgur.com/a/nvda-waving-pennant-7oct24-tVntQPX](https://imgur.com/a/nvda-waving-pennant-7oct24-tVntQPX)", "score": 1, "replies": []}, {"body": "Got rid of my 121 calls this morning at 132.55, now I can just sit with the shares and relax 😂😂", "score": 1, "replies": []}, {"body": "Hell yeah, market's on a tear! Finally making some money with nvidia and avgo", "score": 1, "replies": []}, {"body": "Needs to beat 134.90 to be second highest close, otherwise third.", "score": 1, "replies": []}, {"body": "Nvidia planning to build blackwell servers via foxconn in mexico. if trump wins and installs his tariffs, thats probably trouble causing.", "score": -1, "replies": []}, {"body": "I can’t buy back in. I got absolutely rocked before earnings and lost 25k. I finally made my money back through my shares, and my stop loss triggered like an idiot at 125.5. I am really scared again to buy back at near ATH. It may be time I say goodbye to nvidia until it goes back to 125.", "score": -1, "replies": [{"body": "Time in the market > timing the market", "score": 4, "replies": [{"body": "This - 100%\n\n![gif](giphy|1hMjJILpxoWpQad37L|downsized)", "score": 2, "replies": []}]}, {"body": "Yup, you got wash sale issues too.", "score": 1, "replies": [{"body": "What’s that?", "score": 0, "replies": [{"body": "You REALLY NEED TO LEARN WHAT THAT IS! Just today I sold some NVDA. I thought my break even was $127. Interactive Brokers changed it to $131!!", "score": 1, "replies": []}]}]}, {"body": "it won't go back to $125", "score": -1, "replies": [{"body": "no one knows..", "score": 3, "replies": []}]}]}, {"body": "open \"dump\"!!!", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "So dumb", "score": 1, "replies": []}]}, {"body": "This might be drivning the price upwards:\n\n https://uk.finance.yahoo.com/news/nvidia-highlights-ai-software-and-services-at-dc-ai-summit-150022040.html\n\n\n\nNvidia highlighted a number of its software offerings and customers during its AI Summit in Washington, D.C., on Tuesday.", "score": 0, "replies": []}, {"body": "https://www.nobelprize.org/prizes/physics/2024/press-release/\n\nYeap, it is future science", "score": 0, "replies": [{"body": "physics is a stretch", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Yes\n\nThe prevention is lack of funds as the gateway", "score": 1, "replies": []}]}, {"body": "Where is the dude who said he was selling once it hit 125 or 127? Was a few weeks ago- did ya sell are u a ghost now in here?? Prob the latter!", "score": -2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "this guy was selling at break even at that price, that was his point of panic. Def team green!", "score": 1, "replies": []}]}]}, {"body": "Can you guys be honest, will i ever probably again get a buy back opportunity under 125.5? I truly messed up.", "score": -1, "replies": [{"body": "i hope not", "score": 4, "replies": []}, {"body": "honestly, nobody knows", "score": 2, "replies": []}, {"body": "I would say no", "score": 2, "replies": []}, {"body": "It’ll take some really bad news for it to happen", "score": 1, "replies": []}, {"body": "You had your chance when it dropped to 90. Everyone was dooming", "score": 1, "replies": [{"body": "I had put all 154k in at 125.5", "score": 1, "replies": []}]}]}, {"body": "Bullshit last minute selling! Illegal", "score": -6, "replies": [{"body": "The secret ingredient is crime.", "score": 2, "replies": [{"body": "Robbed of +4.6%", "score": -1, "replies": []}]}, {"body": "When? Did i miss smth??", "score": 1, "replies": [{"body": "Yah it was almost 133.5 ten minutes before close", "score": 1, "replies": [{"body": "Greatt…..just great", "score": 3, "replies": []}, {"body": "dumb", "score": 1, "replies": []}]}]}]}, {"body": "glad i only sold half yesterday,we are so fkin back, not selling the other half", "score": -2, "replies": [{"body": "i regret doing that lol, missed out on good money, but we never know with this stock it can crash 10% the next day lol", "score": 3, "replies": [{"body": "ye man lock in some profit is good", "score": 1, "replies": []}]}, {"body": "r u planning a reentry ? i am, but idk buying near ATH scares me lol", "score": 3, "replies": [{"body": "reeentry for sure rinse and repeat, this time ill buy a lot more", "score": 2, "replies": [{"body": "yea what price u trying to get in ?", "score": 1, "replies": [{"body": "probably below 120", "score": 2, "replies": []}]}]}]}]}, {"body": "I've been promoted to seeking alpha expert by the mods due to my innate genius and 800 shares of Nvidia.\n\nFeel free to ask me for Nvidia related financial advice at any time.", "score": -2, "replies": [{"body": "Congratulations bro", "score": 1, "replies": []}]}]}
{"title": "You guys still think it’s a buy @132 or you think we’ll get a pullback?", "selftext": "[removed]", "id": "1fz76rj", "created_utc": 1728412869.0, "score": 69, "upvote_ratio": 0.83, "num_comments": 222, "comments": [{"body": "This is a subreddit dedicated to building a professional environment to analyze NVDA stock. Posts without descriptive analysis will not be tolerated unless it is an article or video sharing informative information.\n\nFor posts like this please add them in the Daily Discussion thread pinned at the top of the subreddit each day. Thanks!\n\nIf you repeat breaking this rule it will result in you getting banned.", "score": 1, "replies": []}, {"body": "Just do the opposite of consensus. People are saying pullback so it won't pullback. When people say ath next week , it's gonna pull back", "score": 74, "replies": [{"body": "People are saying both", "score": 16, "replies": [{"body": "So it’ll be flat…", "score": 19, "replies": []}, {"body": "We can only trust dieselcock", "score": 18, "replies": [{"body": "Haha what a name. I am living under a rock and missed the reference though. Is he some wsb guy?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/NVDA_Stock/s/iEwdCvLvEJ", "score": 2, "replies": [{"body": "Sage!", "score": 1, "replies": []}]}]}]}]}, {"body": "This is as wise as it is profound.", "score": 3, "replies": []}, {"body": "![gif](giphy|10JhviFuU2gWD6)", "score": 6, "replies": []}, {"body": "ATH the week of Oct 18. Did I jinx it?", "score": 1, "replies": []}, {"body": "NVDA is the [Zombo.com](http://Zombo.com) of stock prices. You can have any price you want at the [Zombo.com](http://Zombo.com) of stock prices. The only limitation on the stock price is your imagination at the [Zombo.com](http://Zombo.com) of stock prices...", "score": 1, "replies": []}, {"body": "Sage advice", "score": 1, "replies": []}, {"body": "It’s already ath lol", "score": -3, "replies": []}]}, {"body": "When it was high 90s and low 100s, no one wanted to buy. When it's above 130, everyone wants to buy. Nothing fundamental has changed during the time period despite the price swings. The stock market and investors make no sense.", "score": 56, "replies": [{"body": "I agree. I have bad instincts and am fully aware that my logic of entries and exists makes no sense sometimes. I’m trying to get better at that.", "score": 9, "replies": [{"body": "Buy a little now, a little later", "score": 9, "replies": []}, {"body": "NVDA shares are best to buy and hold vs trade.. let the story play out and you’ll be rewarded.", "score": 2, "replies": []}, {"body": "I am with you on that lol.\n\ni sold at 124 with 9.5 percent profit. so sure its not bad but if i waited i could have made a loooooot more today. \n\nmy FOMO kicks in a lot so now i've bought 10 more back at 129.75. Lol! im an idiot but i hope for the best. it's impossible to accurate predict the stock market ultimately and i should have held far longer.", "score": 3, "replies": [{"body": "I just sold my 490 shares. My break even was $128 but due to wash sale it was $131. I didn’t want to sell but almost half was margin $$. I wanted out from under it cause I  am $30k down on SMCI. \n\nWill I sleep better tonight? Yes. \nWill I kick myself in the azz tomorrow? Yes.", "score": 8, "replies": []}, {"body": "Just hold for longer sell at 170 maybe", "score": 2, "replies": [{"body": "yeah lol that's the idea. or buy more if it dips. i didn't unload all my spare cash this time like an idiot, instead leaving some in reserve.", "score": 1, "replies": []}]}]}, {"body": "You’re trying, and will do better. All that counts.", "score": 2, "replies": []}, {"body": "You speculate on instinct. You don't invest. \"Moods a thing for cattle and making love\" gurney halleck. ", "score": 1, "replies": []}]}, {"body": "Very true. Just think 3-5 years out. I bought more when the morons drove the price down to 103. Most consequential company of this generation.", "score": 7, "replies": []}, {"body": "To be fair something did change... 1st AI chip demand is \"insane\" as per Jensen, backed by strong gpu shipment report released this week. And a fantastic last financial report.", "score": 9, "replies": [{"body": "We already knew chip demand would be insane", "score": 5, "replies": [{"body": "Then it was already mirrored in the stock price. Not knowing that will increase the stock price.", "score": 1, "replies": []}]}, {"body": "Crazy Eddie's prices were \"insane\" too. Didn't end well...\n\n[https://en.wikipedia.org/wiki/Crazy\\_Eddie](https://en.wikipedia.org/wiki/Crazy_Eddie)", "score": 1, "replies": []}]}, {"body": "The pull back to 99ish had nothing to do with NVDA, it was a general market pullback, I made quite a bit of profit on that because I believe in the long term future of the company.  The push to 130 is due to positive news about Blackwell (potential) - I took profits at 125 and 130 range because I an overleveraged in NVDA and think that 4th quarter earnings can go either way.   The market makes perfect sense from a macro scale.    If the entire market pulls back and you truely believe that the stock you are investing in isn't impacted, then it's a great time to invest.   If you think the company won't deliver on the Hype, then absolutely sell.", "score": 4, "replies": []}, {"body": "Speculators make no sense. Investors check fundamentals and buy accordingly. ", "score": 2, "replies": []}, {"body": "If no one wanted to buy, why is it 30% higher?", "score": 1, "replies": [{"body": "Retail doesn't move top mkt caps in any way", "score": 3, "replies": []}, {"body": "Because that’s not the only thing that influences a price movement", "score": 3, "replies": []}, {"body": "When he says no one he’s referring to retail. Every hedge fund and their mother that was given approval bought at these numbers. And then some.", "score": 2, "replies": []}]}, {"body": "People chase the trend and momentum not the share price my fellow regard", "score": 1, "replies": []}, {"body": "It’s simple: I had no money before. Now I do. And there’s nothing worse than leaving a cash balance sitting safely in your account when I could be buying at ATHs! \n\n(I know NVDA’s not currently but this is in general)", "score": 1, "replies": []}, {"body": "Yeah but a lot technical has changed", "score": -1, "replies": []}]}, {"body": "I predict a pull back and rise 1 or 2 more times before the final push for next quarter's earnings.", "score": 40, "replies": [{"body": "Please by a prophet. I sold early and missed out on the last week of gains lol", "score": 13, "replies": [{"body": "You and me both man, you and me both. I'm hoping it gets back down to the low 120's so I can come back in. I am hoping the election uncertainty triggers one last drop when Trump spews another line about tariffs on China.", "score": 3, "replies": [{"body": "Use anchored VWAP to see where the FOMO line is and buy in with fellow MOFOs", "score": 1, "replies": []}, {"body": "This shit drives me insane. It just keeps going up. I KNOW the exact moment I buy in it’s going to drop a mile. It happens every time and if I just held cash for another day or two I could buy in $10-15 cheaper. But no, I sit and wait for that moment and it just keeps going up. It is maddening!", "score": 1, "replies": []}]}, {"body": "It’s really simple to estimate.\n\nWhat happens in early September? School starts and tuition due need money\n\nWhat happens in October? Not much just Halloween and some political contributions for the rich\n\nWhat happens in November? Thanksgiving need money but not as much as school tuition\n\nWhat else happens in November? Black Friday at the end of month will need a lot of money and spend for December \n\nWhat happens in December? Paying off November credit card bills\n\nAnd there you have the general market trend\n\nPretty much boom until late November", "score": -2, "replies": []}]}, {"body": "Looking highly likely that my $130 covered calls get assigned this Friday.   I‘m guessing reasonable chance we are back in the $120‘s this month.  Should be an opportunity to buy back before earnings.  NVDA has monster moves - I am afraid to short…", "score": 5, "replies": [{"body": "If your afraid to short why are you selling covered calls so close to the money", "score": 3, "replies": [{"body": "Generates great cashflow", "score": -1, "replies": [{"body": "Yeah until you get called away at 130s and stock is at 160s.", "score": 1, "replies": []}]}]}, {"body": "Why not just walk those CC’s out and up?", "score": 3, "replies": [{"body": "Exactly. And get instant year tax credit too (when you have to roll it out to next FY).", "score": 1, "replies": []}]}, {"body": "Sell a PUT! I been selling puts and cover calls for cashflow and its been great the past few years. Just sell a $133 put on Monday or whatever you like to get back in below the cost basis of your sold calls.", "score": 2, "replies": [{"body": "Yep, I usually sell weekly calls.  When they are assigned, I sell weekly puts until I get the shares back.   It‘s great cashflow!   NVDA is a high flyer so it‘s harder to predict the movements.    I have other equities that I almost never get the shares assigned - just constant cash flow.\n\nBest of luck", "score": 1, "replies": [{"body": "What delta do you play at? Also do you open on Monday and close on Friday? Read somewhere or someone said for short calls to go Mon-Fri; SP Thu-Wed", "score": 1, "replies": [{"body": "Delta varies depending upon how the market is performing.  I prefer to sell calls on up days.  I try to open on Monday, and let them expire on Friday.  Same with selling puts on down days.", "score": 1, "replies": [{"body": "Noice. I also vary my deltas but within a range. More importantly to watch for the resistance and support levels", "score": 1, "replies": []}]}]}, {"body": "I’m newish to the options selling game but I’ve been selling 2 week covered calls and rolling them each week. Currently at 132 and will plan to roll them to 133-134 if the price works out on Friday.", "score": 1, "replies": []}]}]}]}]}, {"body": "Everyone think there will be a pullback because that’s what happened the last 3-4 times. And that’s why there won’t be a pullback.", "score": 61, "replies": [{"body": "Can't predict the future either way!", "score": 12, "replies": []}, {"body": "Only right comment", "score": 9, "replies": [{"body": "predictions arnt facts. that being said, i dont think theyre wrong", "score": 1, "replies": []}]}, {"body": "Exactly!!", "score": 1, "replies": []}]}, {"body": "If you buy it will pullback, and if you don't it will moon.", "score": 14, "replies": [{"body": "I have thought about issuing a 100% full proof investor news letter, called do the opposite of what I do. :-)", "score": 5, "replies": []}, {"body": "🙌", "score": 1, "replies": []}]}, {"body": "itll get pulled back", "score": 44, "replies": [{"body": "When and to what level do you think", "score": 2, "replies": [{"body": "It's one of the most volatile stocks.  Expect swings +/-10%.  They won't always be that large, but they can be.  And lately, you can see it swinging the opposite direction from the market a lot of the time, so think of why that might be.", "score": 11, "replies": [{"body": "Why do you think that is ?", "score": 0, "replies": []}]}, {"body": "I think it’ll get pulled back below 100 honestly. Personally I’d wait but no one really knows.", "score": -3, "replies": []}]}]}, {"body": "Pullback. Already 5 days gains into their summit", "score": 6, "replies": []}, {"body": "I set my stop at $129.70. I'm not riding it back down...", "score": 7, "replies": []}, {"body": "For technicals, yesterday the stock broke out of a bullish flag pattern.  If today's close is above 131.26 (previous intermediate high), then it has also broken the lower highs pattern in place since June.  This could signal a technical breakout with next resistance at the Jul 11 high of 136.15.  If it breaks above that, I'd expect it to take out the previous ATH of 140.76 before another pullback.\n\nhttps://preview.redd.it/dcqp9wym1ltd1.png?width=2306&format=png&auto=webp&s=bbc35a08f6e8ba9f2aeb8de0d676d3c8b2e8a257", "score": 24, "replies": [{"body": "Would you mind explain how these work a little more? I’m trying to learn more about TA\n\nhttps://preview.redd.it/velex94n8ltd1.jpeg?width=1179&format=pjpg&auto=webp&s=5b438ba92af156dc97fffc8cd0b0682a97a076aa\n\nAlso we love Nvidia 🫶🏻 4070 in the rig rn", "score": 3, "replies": [{"body": "Bullish Flag - the pennant created by the lower highs and higher lows since the ATH.  When this pattern is broken, many see this as a signal, take action, and the stock tends to continue the trend up or down.\n\nLower Highs Pattern - Each subsequent high since the ATH was lower than the previous high, until yesterday.  When this pattern is broken, it frequently precedes a reversal.\n\nUpper resistance tends to occur at previous high points on the chart where previous distribution of shares (supply exceeded demand) caused a short term reversal.\n\nTechnical analysis is a tactical tool and doesn't replace solid fundamentals and research, but  in my years of investing I've found that market participants pay attention to these levels, and in the absence of disruptive news, they frequently become self fulfilling as a result, so it's good to understand what levels the technicians are looking at.  OP asked a tactical question, so I think tactical technical levels are relevant to his question.\n\nThere are obviously no guarantees, and real news invalidates many technical signals.", "score": 8, "replies": []}]}, {"body": "You're going to need a few more crayons for this very informative analysis... /s", "score": 1, "replies": []}]}, {"body": "like king leonides in 300 said HOLD", "score": 6, "replies": []}, {"body": "Expecting at least one pullback before earnings", "score": 4, "replies": []}, {"body": "HELL. NO. dont make the same mistake as I did a month ago, buying at 128 lol", "score": 4, "replies": [{"body": "same... but at $130", "score": 1, "replies": []}]}, {"body": "I bought at 121 and 119. I sold yesterday at 129 like an idiot 🥲", "score": 11, "replies": [{"body": "I sold today at 133. Waiting for the dip to hop back in. We'll be okay broski", "score": 11, "replies": [{"body": "What’s your approx dip price? Asking out of curiosity \n\nGood for you taking profits, I know how hard it is.", "score": 3, "replies": [{"body": "120 or lower maybe. I'll buy back in", "score": 2, "replies": []}, {"body": "I'd probably do 125 as well", "score": 2, "replies": []}]}]}, {"body": "Why the hell are you trying to swing trade with NVDA? It's probably the most obvious buy and hold stock there is", "score": 5, "replies": []}, {"body": "You’ll survive", "score": 0, "replies": []}]}, {"body": "Amazing how there’s so many professional investors hanging out in this sub to give advice on how the stock is gonna perform…", "score": 8, "replies": []}, {"body": "Dumb to buy now. Don't let FOMO take over.\n\nWait for a dip.\n\nIt's not going to climb much higher without solid earnings report figures. Now the stock rides only on hype.", "score": 23, "replies": [{"body": "This guy trades.", "score": 3, "replies": []}]}, {"body": "It has to have a pull back sometime before next earnings on Nov 19, but it could be a very quick one, and when we get closer to the earnings date there will be a bull run. Blackwell is out and doing well", "score": 3, "replies": [{"body": "Blackwell is meaningless for next report. Next report is for July - Sept (3 months).", "score": 1, "replies": [{"body": "It’s for August-October. But I agree earning of Blackwell is not significant in this quarter (yet). It really depends on the guidance than the earning itself.", "score": 2, "replies": []}]}]}, {"body": "I trust Jensen when he says Blackwell demand is “insane”, and Foxconn when they say demand for server box build is very strong. There is still upside.", "score": 3, "replies": []}, {"body": "Of course there’s a pull back once it hits ath some time in the future I guarantee it and bet your house on it.", "score": 3, "replies": [{"body": "but the question is WHEN will the pullback happen?", "score": 1, "replies": [{"body": "I’m not sure when I’ll buy, but it’s then.", "score": 2, "replies": []}]}]}, {"body": "Dont think so, there hasn’t been any bad news lately.", "score": 2, "replies": [{"body": "Israel and Iran escalation could be a short setback.", "score": 3, "replies": [{"body": "and Milton", "score": 3, "replies": []}, {"body": "Nobody cares about Iran and Israel, they are already engaged in a full scale regional war. Israel has invaded Lebanon, and markets didn’t flinch.", "score": 1, "replies": []}]}]}, {"body": "I thought we would have a push up this week due to the less OI on the weekly options and the AI summit. There is 100K for next week so it might fall a tad. No Guarantees though. I have exited my calls today at 131.80 but if holding shares you can wait it out.", "score": 2, "replies": []}, {"body": "You buy with both hands as quickly as possible.", "score": 2, "replies": []}, {"body": "It always goes down when I buy, and up when I sell. Buying now tho seems a bit risky. Tho we are at the forefront of AI eternity.. nobody knows brother. Fuck it, buy shares.", "score": 2, "replies": []}, {"body": "I mean, i doubt we will see anything breaking 140 this year, in my guess we will probably see a bunch of pullbacks until then even if companies get blackwell gpus as it takes a long time to build new data centers that uses them and more so to adapt to this power boost.\n\nI doubt we will see anything above 150-60 until april or so which is 7 months (counting this month) from now which is plenty of time to get pullbacks.\n\nAlso depends on how well nvidia will do with offshore chip manufacturing tax that trump will do as they probably need to change to us manufacturing, saw on my feed that foxconn is building a blackwell manufacturing plant in Mexico but that will probably take until next year to finish.\n\nIf your question is will it go down from 130 anytime soon (tomorrow - week(s)? Probably.\n\nCould it go past 140 over new year? Perhaps", "score": 2, "replies": [{"body": "It shouldn’t matter how long it takes to build the data centers, all that matters is if they are selling units", "score": 3, "replies": [{"body": "Isnt it nvidia that is going to install all of them? What also matters is how many they can make, the foxconn center in mexico is one place thats going to make them but gonna take awhile to build it.\n\nDont think nvidia just take their big trucks loaded with gpus and just leave them there for a company to put together using a manual from ikea.\n\nAlso it probably matters how long it takes to build the data centers for any ai company as they are symbiotic in development of products and research for all of the companies using their services which is everyone else using ai.", "score": 1, "replies": []}, {"body": "https://www.pcgamer.com/hardware/graphics-cards/nvidia-had-already-sold-tens-of-thousands-of-blackwell-gpus-before-the-next-gen-architecture-was-announced/\n\nhttps://www.investopedia.com/nvidia-stock-rising-again-nearing-record-high-foxconn-blackwell-demand-8724899\n\nGonna take until past 2026 to complete most or half of the current orders i belive.", "score": 1, "replies": []}]}]}, {"body": "Yes", "score": 2, "replies": []}, {"body": "It’s not going to keep going up without a pullback. I’d wait a minute before buying if it were up to me.", "score": 2, "replies": []}, {"body": "It's a buy and hold. 130 is not the limit. But there will probably be a pull back this month or in Feb. If there isn't and the economy stabilizes then NVDA will probably be on a slow and steady climb from here.", "score": 2, "replies": []}, {"body": "Who is saying pullback? All I see is FOMO.", "score": 2, "replies": []}, {"body": "No one knows for certain.  I was sweating bullets buying at 125.  Today I’m better.  If anyone knew with certainty then they would sell everything and Annie up.  \n\nAll I know is AI is Huuuuge.  Nvida is the trend setter.  People need Blackwell.  The issue is Main Street and wall street don’t always follow.  \n\nThere are price targets of $175 and $230.  Can it dip between then, sure.  \n\nProblem is me personally I’m terrible at timing. I’m afraid to sell now and miss out or sell and not know when to come back.  I sold Netflix at $630 when I was up over 100%.  How stupid was that?!", "score": 2, "replies": [{"body": "I feel the same way. Horrible timing. Trying to get some swing trading in when I can but I’m long.", "score": 3, "replies": [{"body": "I’ve been watching this stock last 2 years and just saying NO WAY. I was going to PUT this or short this thinking it’s a fad.  Should have payed more attention and been positive when a friend of mine said hey I can’t buy a NVIDIA graphics card can you buy one for me and bring it to my country?!  That should have been my ohh $@&! buy this moment.  I’ve been watching this too much from the sidelines to sit back there and time this.  AI is going to replace my job.  You know what they say don’t buy $150 sneakers buy the stock of the company that sells them.  Or when everyone is looking for gold (AI) sell shovels.", "score": 2, "replies": []}]}]}, {"body": "It doesn't matter when you will buy if you plan on holding for a long time.", "score": 2, "replies": []}, {"body": "Just buy it and forget it. Don't try to timing the market - Always remember these words. If you think Nvidia stock will go much higher (which is definitely true. Even a kid also knows that) then just dump all your savings that you have right now into NVDA because why not? This stock is a MUST BUY at this moment ngl.", "score": 2, "replies": []}, {"body": "If you’re long gone 1/3 ou 1/2 and average up or down.", "score": 1, "replies": []}, {"body": "It will go up and down and sideways if you can wait long enough. The question is how soon.", "score": 1, "replies": []}, {"body": "Buy as much of it before $135 as you can", "score": 1, "replies": []}, {"body": "I broke even and a little plus today...😄 ready for a pullback now 😄😄", "score": 1, "replies": []}, {"body": "Bullish flag pattern expect ATH. I’m holding into earnings and I buy a little every week.", "score": 1, "replies": []}, {"body": "I hear it’s going over 500….", "score": 1, "replies": []}, {"body": "It’ll definitely dip…usually it swings a few points throughout the month. I’d probably just wait a bit", "score": 1, "replies": []}, {"body": "I’d buy a few. Pull back might happen into $124, $120. \n\nMaybe see $115 if trump is elected in January. So imo it’s worth buying 1/2 of what you can afford, don’t go all in, I’m tired of the posts that cry “I bought so high!” What goes up does come down.\n\n\nAll time high was back in June. So be mindful, June was a while ago", "score": 1, "replies": [{"body": "If Trump gets elected won't it all go to shit just like the stock market in 2018? I'm contemplating going completely out of stocks the day he gets elected; i don't think i can handle trauma for 4 years again.", "score": 6, "replies": [{"body": "He doesn’t believe (understand semis)\n\nsemiconductor index lost over $480bn in stock market value and headed for its worst session since 2022 after\nRemarks from Republican presidential nominee Donald Trump at the RNC.", "score": 1, "replies": []}]}]}, {"body": "If you have some stocks sell some covered calls and collect the high premium! Buy thwm back at the pullback and make some money", "score": 1, "replies": []}, {"body": "Prob short term pullback, long term growth. Could buy now but could also wait for that pullback. Honestly I’m new to analyzing stock, but I feel like AI is just starting. Very soon we will see true value being derived from AI. Right now it’s all been nonsense value (a bit of help from ChatGPT on stuff etc.) discoveries and advances are now clustering together…. Release of alphafold, new models on ChatGPT, founding of like 5 new prominent companies, etc. based on that I’m tempted to say nvidia is just stating and we are going to the fuckimg moon. But the only thing I don’t get is… how will that happen when nvidia is already the most valuable company. Like I think it’d be ludicrous if nvidia went to 5x the second most valuable. \n\nAre there ways that the company stock can go up but total company value stays about the same?", "score": 1, "replies": []}, {"body": "Pull back then run to $150.\n\nI was right on the $80 pullback so maybe I'm right on this? 🤷🏽", "score": 1, "replies": [{"body": "Let’s see!", "score": 2, "replies": [{"body": "Seems like $100/$110.\nThats my estimate.\n\nHope I'm wrong for those that want it to run; hope I'm right for those that want an opportunity to buy in before the next run up. 😜", "score": 1, "replies": []}]}]}, {"body": "There’s 6-7 weeks until what is likely going to be a very good earnings call. \n\nIMO it’ll pop then and in the run up, however I think it’ll drop a bit in the next week or so first.\n\nThe gamble is to sell more and buy back in if/when it drops, but if it doesn’t you’ll be scared to buy back in.\n\nTldr: hold", "score": 1, "replies": []}, {"body": "Eh I see 135 by EOW then maybe a pullback to lik 130. Just buy and hold ", "score": 1, "replies": []}, {"body": "I was afraid to buy the dip at 106, but now I have no problem DCAing in at 130. Blackwell is clearly our future, to the m00n baby", "score": 1, "replies": []}, {"body": "Yes and yes", "score": 1, "replies": []}, {"body": "Stocks go up…. Stocks go down…. Repeat", "score": 1, "replies": []}, {"body": "Elections will tell in Nov.  until then, who knows  😂", "score": 1, "replies": []}, {"body": "Do you really think the price is going to stay the same once Blackwell revenue starts really coming in? What about Ruben? What about a few years after that? Do you think Nvidia will continue to grow?", "score": 1, "replies": []}, {"body": "It’s probably gonna hit around 200 by the end of 2025", "score": 1, "replies": []}, {"body": "![gif](giphy|l4FGx3MWaVRzQStHO)", "score": 1, "replies": []}, {"body": "Pullback. Dont do it man.", "score": 1, "replies": []}, {"body": "I can’t predict anything, but NVDA has spent close to 5-6 month being in this range of consolidation. The stock probably left the $120 range and it will be hard to see that again. A pull back may happen between $130-$135 and I hope it comes after $135 and it will be another run to $140-$150 by EOY.", "score": 1, "replies": []}, {"body": "I am putting my money in QQQ for now until a major pull back to buy more. I, too, have a lot of shares already.", "score": 1, "replies": []}, {"body": "It always pulls back, how far is the real question", "score": 1, "replies": []}, {"body": "Here's my take. We are in a bullish rotation, clearly. I would wait for it to run and on a retracement head in before earnings. You can always DCA which is never a bad strat but do it on red days not on green days.", "score": 1, "replies": []}, {"body": "You can try to time a pullback, but I found it more gratifying buying it and forgetting.", "score": 1, "replies": []}, {"body": "Having seen Nvidia for about the last year my guess is that it will touch 160 levels, and then retract to about 120-130 and then go to 180-200 levels, and then fall to about 140. You get the drift :)", "score": 1, "replies": []}, {"body": "I would buy more because look at what 2025 is going to bring! Start the long-term cap gains tax timer sooner rather than later!", "score": 1, "replies": []}, {"body": "Prophet here  \nIt will be 150 eom", "score": 1, "replies": []}, {"body": "When it does pull back, I'm going all in on NVDX instead on NVDA", "score": 1, "replies": [{"body": "Same, but different.  I am riding 483 shares of NVDL.", "score": 2, "replies": [{"body": "Ive looked at nvdl, and probably will at some point. nvdx has been doing me good so far tho.", "score": 1, "replies": []}]}]}, {"body": "140 then 150 before earnings", "score": 1, "replies": []}, {"body": "yes", "score": 1, "replies": []}, {"body": "Bro guaranteed 140 so it’s a buy man go for it", "score": 1, "replies": []}, {"body": "Pullback to $120 maybe? Idk 🤷‍♂️", "score": 1, "replies": []}, {"body": "I think there will be a pullback within the next 10 days. Went up 13% from 10/1 closing price to today’s. I’m buying up more call options when/if it hits $118-$120", "score": 1, "replies": []}, {"body": "Since I sold covered calls (strike $137 exp. this friday) just for some extra cash today, I am sure it will go above $137 this week.", "score": 1, "replies": []}, {"body": "Why don’t yall just stay in ur goddamn positions of ur watching the price action so much. If you need to ask when to come back in then maybe you shouldn’t be exiting and entering", "score": 1, "replies": []}, {"body": "NVDA is going to ATH very soon, just buy and hold, unless you consider yourself a successful and profitable day trader who is better than some hedge funds to correctly time the market", "score": 1, "replies": []}, {"body": "Buy and DCA!", "score": 1, "replies": []}, {"body": "Profit taking before EOY so fund managers can claim victory", "score": 1, "replies": []}, {"body": "Been waiting for the right time to jump in", "score": 1, "replies": []}, {"body": "DCA around $115 right now for me, not in a hurry to buy more after the last couple days, but if it’s still around 130 or higher in the next 4-6 weeks, I’ll probably buy more then", "score": 1, "replies": []}, {"body": "Back to 130 tomorrow", "score": 1, "replies": []}, {"body": "Took it months to break that 125 barrier. Now we’re seeing some good consolidation above that price.", "score": 1, "replies": []}, {"body": "Were heading to 232", "score": 1, "replies": []}, {"body": "I don’t know how else to say this, except we’ve barely tapped into AI’s potential. \n\nWhen I get more money, I plan on buying more.", "score": 1, "replies": []}, {"body": "It’s gone up quite fast over last month. I would expect a small pullback before ATH by end of year.", "score": 1, "replies": []}, {"body": "I think it ll go back down to 80.", "score": 1, "replies": []}, {"body": "Yes and yes.", "score": 1, "replies": []}, {"body": "No idea... as it has already been said so many times in this sub, do not time the market for stocks with good financials. Just buy and hold, it will eventually go above 132. Timing the market is impossible and will only make you lose some returns.", "score": 1, "replies": []}, {"body": "TIME TO SELL.  You sell when people get greedy and buy when people are fearful.", "score": 1, "replies": []}, {"body": "Pull back", "score": 1, "replies": []}, {"body": "Pull the ultimate neutral move and get a bunch of calendar spreads. You can’t guess wrong if you don’t pick a side!\n\n![gif](giphy|d3mlE7uhX8KFgEmY)", "score": 1, "replies": []}, {"body": "pullback next week, but mooning toward christmas 🙈", "score": 1, "replies": []}, {"body": "I think buying at this price is fucking ridiculous, unless you believe current AI is going to revolutionise the world … which is not guaranteed to say the least.", "score": 1, "replies": []}, {"body": "Hard to say. I have $30k waiting for a pullback towards $100. Might never go back there again. Just never know.", "score": 1, "replies": []}, {"body": "I just buy an ignore it. I just bought 50 more shares a few days ago. I have faith it's going to continue to rise.", "score": 1, "replies": []}, {"body": "I am just answering the question,  as I am an individual private investor that has been in the stock market since junior high school. Damn years went by quick, so say 37 to 40 years. \n\nLook at your personal investment strategies that you have in mind, ever person has their own thought of investing. \n\nBuy what you like to or add to your position, I have done this many times over the my past history  with investing.\n\nI treat like the gym, hence people go to workout, funeral, I go to Teain. Their is a major difference.  \n\nSo as to investment or investing this is your choice. \n\nLike one of my favorite bands, I have big balls, and dine with them all, though have the biggest balls of them all. Something like that.\n\nEnjoy and have fun with your trade or day trade, yester was good if a day trader.", "score": 1, "replies": []}, {"body": "Who the fuck cares. Be an investor not a gambler.", "score": 1, "replies": [{"body": "This, this is the way", "score": 2, "replies": []}, {"body": "you think there's a difference?? try not looking at your portfolio for a week and tell me you arnt addicted", "score": 1, "replies": [{"body": "Yes there's a huge difference in buying and holding and having faith in the company you bought into and having long term vision and doing your dd vs speculative buying and selling every day ya absolute ape.", "score": 1, "replies": [{"body": "the comment was sarcastic pal. also your usage of the word \"faith\" to try to argue that it's not gambling made me giggle", "score": 1, "replies": []}]}]}]}, {"body": "I think $128 to $130 is the support for now. I think between now and earnings, $135 or so is the highest we go and then $140 after if they’re really good", "score": 1, "replies": []}, {"body": "Hilarious. It’s been basing for months now. It’s broken out of the wedge.\n\nThe retest of the wedge will be the low $120s if the support at $130 breaks.\n\nFucking fomo is hilarious.\n\nLearn to value a company. Then you’ll know when to buy.", "score": -5, "replies": [{"body": "I’ve already been bought in for months. Just asking a simple question about timing at this point.", "score": 2, "replies": [{"body": "And I've been \"bought in\" approaching SEVEN YEARS now.   \n  \nI'm saying IT'S BEEN BASING FOR MONTHS NOW. But now that it's broken out of the resistance, all of a sudden it's FOMO and \"should I buy now?!\" \n\nLEARN HOW TO FUCKING VALUE A COMPANY THEN YOU KNOW WHEN TO FUCKING BUY. \n\nA month ago its PEG was UNDER 1, and I was hammering this group to buy. And this group was wait for the $90s that were never going to come again. This group was selling at $116 and basically running around like a group of headless morons.\n\nBUT NOW YOU SUDDENLY HAVE THE EPIPHANY!  \n  \nDo I like a stock that's going to $10T at the end of the decade when it's priced at a PEG of 1.3? I do.   \n  \nBut I like it better when it's been basing under 1.2 and giving us gold of being under a 1 even fucking better.   \n  \nI reiterate for your actual question, it broke resistance and continued higher from the breakout of a 4 MONTH LONG WEDGE. Whenever there is a break out, the breakout is retested. This gives us new support above low $120s. The same wall that took a lot of volume to break through. \n\nIt's in my opinion we continue to $135 before that happens. Setting the stock up to revisit ATHs at next earnings.", "score": 3, "replies": []}]}]}, {"body": "Rug pull be incoming shortly", "score": 0, "replies": []}]}
{"title": "Is Netflix really worth more than Disney, Warner Bros Discovery, and Paramount COMBINED? ", "selftext": "I recently saw Netflix analyst upgrade and I looked at the market cap of 300 billion+. Is it really worth that much? I know they recently increased prices and they increased kdrama in their catalog but was there anything else? They aren't going to report about subscriber numbers anymore either. Another thing I noticed is that most entertainment companies had a negative or relatively low ytd increase, just Netflix was the outlier and had the highest one with 48%+. Anyone have any thoughts as to why it's valued so highly? ", "id": "1fz93kc", "created_utc": 1728417680.0, "score": 149, "upvote_ratio": 0.88, "num_comments": 122, "comments": [{"body": "TTM: Warner Bros + Disney + Paramount\n\nRevenue = 160b\nNet Income = -12.6bil\n\nTTM:Netflix\n\nRevenue = 36.2b\nNet Income = 7b\n\n\nSo to answer you, yes I think so considering the other three either barely turn a profit or are bleeding billions.", "score": 110, "replies": [{"body": "It's just lovely when all it takes is ~4 numbers\n\nThank you!", "score": 28, "replies": [{"body": "I'm not certain if this is a fair comparison. I think it's a comparison you need to make, but WBD, PARA, and DIS are just figuring out the streaming business and are finally starting to earn profits. (You just need to note the technical issues that surround streaming when you log onto these services and note that they often don't match the technical quality of streaming provided by Netflix.) Are there no investors who think Netflix's competitors might eventually catch up in terms of viewers, revenue, and, ikes, profits?", "score": 1, "replies": []}, {"body": "Well, it doesn't. If investing was this easy, everyone would be making money. But it does effectively prove the point why asking \"Should company X be worth more than Y?\" almost always leads people to the wrong conclusion.", "score": -1, "replies": [{"body": "Well of course, but the punchline was (1) Netflix makes money and (2) the other's aren't which is clearly important valuation wise\n\nAt least how I interpreted the comment", "score": 7, "replies": [{"body": "Yeah fair enough.", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": -9, "replies": [{"body": "I mean that makes it even more damning for those companies, investing in stuff that is not turning profits. \nAnd by the same logic, that could be said for some other endeavors of Netflix that probably are not profitable like games.\nIt is fair in the sense that companies might look to diversify. That doesn’t mean you can exclude them from your overall operation.", "score": 3, "replies": []}, {"body": "It's actually super fair and unbiased. I'm an investor who values companies that make money and have the potential to scale and make even more money, I don't hold sentiment on how they make that money as long as it's ethical.", "score": 9, "replies": []}]}]}, {"body": "You are asking the wrong question.  They are priced for around a 15% growth rate for next 5 years.  The question  should be can they continue to grow 15% a year for next 5 years.  \n\nSubscriber growth is around 10% a year, and I think they can grow pricing around 5% a year.  They can also improve margins, start generating ad revenue, and introduce more products.  I think it’s doable.", "score": 118, "replies": [{"body": "Question, I’m pretty new to investing, so I just want to know how you came up with the fact that they’re priced for 15% growth for 5 years. Thanks!", "score": 23, "replies": [{"body": "Most analysts will use a five year growth model followed by terminal growth of some low number like 3%, and make some assumptions like earnings approximating cash flow at steady state.  In that standard model roughly 45-50x PE ratio works out to be about 15% implies growth rate.\n\nThere is also the munger rule, which is P/E of 2x growth + 8 is fair, which would be 38x PE but munger rule is known to undervalue growth companies.", "score": 40, "replies": []}]}, {"body": "I dont think thats realistic.   The pricing power is goneas the content just doesn't exist to warrant the high pirces.   They are basically behaving like classic cable did.  Expect loss of subs when the report to reduce their growth welll below 15%.", "score": 29, "replies": [{"body": "The line between Netflix and Dish Network is not as large of a gulf as people think.  Once they raise prices to where they need to be, people will cut the cord just like they did with cable.  Imagine if our economy was based on Dish Network stock. 😳", "score": 4, "replies": [{"body": "Yeah Dish went through the same exact thing.\n\n1. Disrupted cable\n2. Experienced rapid growth \n3. Cable.lost subscribers\n4. Dish raised prices consistently while the going was good.\n5. Dish loses customers and continues have customer downgrade service \n6. Streaming service come online.   Dish is dead", "score": 9, "replies": [{"body": "Yeah but what is going to come online to disrupt streaming…?", "score": 1, "replies": [{"body": "Other streamers that join forces to challenge Netflix.  Let's face it Netflix had content when they were the only game in town.  Now that they have to create mostly their own content  the quality as fallen and we are waiting longer in between seasons.  Seasons are less than 10 episodes.   Etc etc.   The most important thing is we are heading into a tight economy.   Consumers dont have much left and if the have to pick between ghe bundle from hulunor Netflix they will go with the bundle thats the same price for more content.", "score": 1, "replies": []}, {"body": "> Yeah but what is going to come online to disrupt streaming…?\n\nBlockbuster 2.0", "score": 1, "replies": []}]}]}]}, {"body": "If you're a non-believer just look at their historical growth rates.  Of course past performance does not guarantee anything into the future but they aim to grow and have done a fine job at it over the years.", "score": 1, "replies": []}, {"body": "Squid game 2", "score": 0, "replies": []}, {"body": "I tend to agree on the pricing as we are probably entering a lower inflationary and economic growth period globally, but they have lots of room to grow subscriber numbers in markets other than the US. Especially if any other streaming services (which are struggling greatly in comparison) drop out of markets or fold completely.\n\nIf they meet subscriber growth numbers and make up for some lack of price growth with ad revenue, I can see them meeting their targets.", "score": 0, "replies": []}, {"body": "What high prices?", "score": -5, "replies": []}]}, {"body": "> start generating ad revenue\n\nDamn you for even mentioning that.", "score": 5, "replies": [{"body": "We went to streaming to get away from cable, now streaming has become the new cable. \n\nYo-Ho", "score": 5, "replies": []}, {"body": "Shit we might just decide to get off the couch lol. There is always antennae tv, just have to get a good one on the roof usually.", "score": 1, "replies": []}]}]}, {"body": "while I do think Netflix is severly overvalued at current prices i am bullish on it in the long run. Netflix has clearly won the streaming war.", "score": 8, "replies": [{"body": "What makes you think there’s a single winner? Disney and Max numbers wise do very well in households. They have structural corporate profit problems, but that doesn’t make them streaming losers", "score": 2, "replies": [{"body": "lol", "score": -3, "replies": [{"body": "You clearly have no idea what subscription numbers look like for either of those", "score": 1, "replies": [{"body": "Learn to read financials..kid", "score": -3, "replies": [{"body": "Max and Disney both have well over 100M subscribers and have been around significantly less than Netflix. What are you talking about.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They won the streaming wars.    \nThey will keep raising the prices, gain more subscribers, create more content, add new features,  \npossibly diversify into more markets.", "score": 49, "replies": [{"body": "They have the best tech but not the best content and legacy ( like Disney and hbo), going forward the gap on tech won't be this much, I don't know if Netflix can catch up on content though", "score": 56, "replies": [{"body": "You're getting downvoted but I sort of agree. We're about to cancel Netflix because good content has dried up and they're the most expensive out of all streamers.", "score": 48, "replies": [{"body": "[deleted]", "score": 5, "replies": []}, {"body": "Saying that - the content is a bit crappy but we go to that as the first app when streaming. Disney is a bit meh. Apple TV isn’t bad but not a lot on there. \n\nDon’t dvd have the other 2", "score": 4, "replies": []}, {"body": "Have similarly been considering cancellation recently as I can't remember the last decent thing I watched on Netflix. Out of HBO, Apple TV, Prime, Disney, and Netflix it would be Netflix that's first to go for me. ", "score": 1, "replies": []}]}, {"body": "Their problem is that they do actually develop some excellent content, but they keep cancelling it before it has time to grow and find an audience (i.e. they killed Kaos this morning). \n\nNobody wants a streaming service that's just a collection of dead, unfinished projects with cliffhanger endings. It makes for a miserable viewing experience and will eventually start to be real anchor for their brand, if it isn't already.", "score": 13, "replies": [{"body": "Yeah and humans are psychologically attracted to \"visions and projects\". There doesn't feel like any kind of vision or pathway to their content.", "score": 2, "replies": []}]}, {"body": "For Adults, Max is far and away ahead of everyone in terms of content (HBO beimg HBO like usual).\n\nIf they partner with Netflix it's a juggernaut.", "score": 5, "replies": []}, {"body": "I don't buy the legacy moat anymore. Do you really think the younger generation gives two shits about bugs bunny, goofy, micky, etc?", "score": 13, "replies": [{"body": "They do.  Source: have kids.", "score": 44, "replies": [{"body": "Can confirm ", "score": 4, "replies": []}]}, {"body": "No, but they all watch the Disney movies and everything Pixar on repeat ad infinitum.    \n   \nSource: am dad", "score": 3, "replies": []}, {"body": "What show/movie am I supposed to give a shit about on netflix?", "score": 14, "replies": [{"body": "Probably international shows that you never heard of. 60% of Netflix revenues come from outside North America. They are in 190+ countries. Outside of the US nobody knows what Disney+/HBO Now/Max are.", "score": 6, "replies": [{"body": "Disney, yes. Hbo and Max not so much. \nNetflix\nAmazon \nDisney\nAre big in the UK and in that order, the rest are barely used.", "score": 3, "replies": []}, {"body": "Yup. Disney and stuff only has English language shows. Netflix has endless Korean shows.", "score": 1, "replies": []}]}, {"body": "Doesn't matter, they aren't focused on old shit. They are only concerned on making new shit. Stuff like One piece or Squid games", "score": -1, "replies": []}]}, {"body": "That doesnt really make sense. Outside of Space Jam when has Warner Bros pumped Bugs Bunny. Warner Bros cartoons for the Younger generation is on Adult Swim and Cartoon Network. \n\nSo Warner Bros Legacy moat for cartoons isnt limited to Bugs Bunny. It is stuff like Adventure Time, Regular Show, Rick and Morty, The Boondocks, The Powerpuff Girls, and Samurai Jack.\n\nThat is just cartoons. They have live action shows like The Wire, The Sopranos, Barry, etc.", "score": 2, "replies": []}, {"body": "My kid knows more about Minecraft and Roblox than Mickey. Has no desire to go to Disneyland but wants to go to legoland.", "score": 1, "replies": []}, {"body": "Probably not, but you can fill a cinema with 3 different generations watching marvel movies ( even the fiascos)", "score": 0, "replies": []}]}, {"body": "Disney is done. Star Wars and Marvel are shadows of what they were.", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The modern audience", "score": 5, "replies": []}, {"body": "Their bosses", "score": 4, "replies": []}]}, {"body": "people love the slop, don't ask me why. i feel optimistic about disney being able to grow their streaming service", "score": 2, "replies": [{"body": "Not really. The ratings for recent Star Wars and Marvel shows have been horrible (Acolyte, Secret Wars, ect)", "score": 4, "replies": []}]}]}, {"body": "Netflix can buy all kinds of content. They can't catch up on \"branded\" content since they won't pay the premium to generate their own (*) and studios are in bed with legacy.\n\n\n* wording their contracts such that long running shows get a bigger piece of the pie, and then cancelling them before that kicks in", "score": 1, "replies": []}, {"body": "I can watch the other guys content on NFLX now though. They are bleeding so much money that they are licensing to NFLX again", "score": 1, "replies": []}, {"body": "Honestly, I wpuod say they probably do have the best content. Sure a lot is hot garbage but you can't say someone like Max/HBO is releasing stuff that's much better. Sure they have hits her and there but its no longer what it once was 4+ years ago. Not to mention you get 1 show every few months from HBO. \n\nDisney, has been even worse and Hulu is relasing some stuff but a lot of older stuff.\n\nSure Apple TV probably has the strongest content right now but their library is tiny and you don't really get movies.", "score": 1, "replies": [{"body": "Isn't it better to have 'boutique' streamers who'll guarantee a decent quality? Long term I'm not sure about the profitability in being the primark of streamers.", "score": 1, "replies": [{"body": "Let’s just say I’ve been offered free months of this boutique streamer multiple times and I’ve never seen any of their shows.", "score": 1, "replies": []}]}]}, {"body": "I mean Netflix still has the best overall content imo. Still cancelled it though", "score": 1, "replies": []}, {"body": "Disney's content is massively overrated. How many people do you know that talk about the shows on D+? Maybe it's just the circle I'm in, but everybody talks about Netflix stuff, not Disney.", "score": 0, "replies": [{"body": "I remember this argument but reversed right before Disney started going down. Blogger said everyone talks about the next marvel movie. Nobody talks about any Netflix show.", "score": 1, "replies": []}]}, {"body": "They can definitely catch up on content, as their subscribers numbers show. As if Disney or HBO are making incredible content these days\n\nPlus you vastly underestimate the effect of tech. They have the best recommendation algorithms", "score": 0, "replies": [{"body": "HBO has the best content.", "score": 10, "replies": [{"body": "Won’t argue. But I have observed HBO catalog content keeps getting leased by Netflix for a whole new generation to binge it.", "score": 1, "replies": []}, {"body": "Ok, good thing more than 1 service can have success", "score": 0, "replies": []}]}]}, {"body": "The tech gap isn't there. Netflix App crashed when I used it, admittedly anecdotal evidence, and IP streaming is the same tech regardless of the company using it.", "score": 0, "replies": []}, {"body": "HBO is no content I would watch. The ones I would watch is already off their streaming.\n\nMeanwhile, Netflix is endless for me.", "score": -2, "replies": []}]}, {"body": "I don't think the streaming wars are over", "score": 2, "replies": []}, {"body": "They did? Honestly, I think they will have it hard", "score": 2, "replies": []}, {"body": "'winning the streaming wars' doesn't answer the question about if it is over or undervalued. \n\nIf they won the streaming wars then should it be worth than Disney? Maybe maybe not.\n\n\nShould it be worth more than Apple which also has a streaming service?  Definitely not", "score": 1, "replies": []}, {"body": "You're basically saying that the war was over in 1941.", "score": 1, "replies": []}]}, {"body": "Disney and WB shot their foot with terrible recet productions.\n\nMeanwhile netflix gained recognition by producing local shows that are above average. No one comes close to this.", "score": 21, "replies": [{"body": "> by producing local shows that are above average\n\nby producing lower quality shows that made quality irrelevant", "score": 2, "replies": []}]}, {"body": "Because their execution has been immaculate. The market will pay a premium for such high a quality company with 10% CAGR growth (Finbox estimates 10.6% CAGR over the next 5 years). NFLX is not cheap, but I don’t think it’s outrageously priced given the above.", "score": 3, "replies": []}, {"body": "When the general population of people ask you about streaming services, tv show, movies, etc. what do they ask you?\n\ndo they say \"do you have Paramount?\". \"do you have peacock?\"\n\ndo they ask \"is it on Disney?\" or \"is it on Warner bros discovery\"? / \"is it on HBOmax?\"\n\nno.\n\nits always \"is it on netflix?\". \"do you have netflix?\". etc", "score": 20, "replies": [{"body": "Yes, in my country ( Argentina ) Streaming == \"Netflix\", the others streamings  ( max, prime etc)  are available and are much more Cheaper, but most of people only see and paid for Netflix content...\n\nI guess, is the same scenario in all World.", "score": 3, "replies": [{"body": "In India, there is Prime. Hotstar which is brought buy Hulu. Tons of regional Streaming services. Netflix is not having monopoly all over the world.", "score": 2, "replies": []}, {"body": "How the inflation and economy doing with the new guy. Not hearing much lately.", "score": 1, "replies": [{"body": "This probably isn’t a shocker to anyone but when your president elect is on stage with a chainsaw yelling “fuck the state” whatever is about to follow won’t be good.\n\nIf it was going well, the deregulation types would be talking about it nonstop. They aren’t for a reason.", "score": 1, "replies": []}]}]}]}, {"body": "Idk if they are worth their current market cap or not, but yes, they are absolutely worth more than the other streaming services combined. Disney would need to be more consistent with producing hits to compete and anyway has drastically less EPS. The others are just... not in a good place. It's questionable if they have a future at all or if they will be sold for their assets to one of the other players.", "score": 2, "replies": []}, {"body": "Yes. And it is not overvalued.", "score": 2, "replies": []}, {"body": "Yea look at earnings and FCF and it’s justified imo", "score": 2, "replies": []}, {"body": "It will never not amaze me that these companies could extract billions in rent from Netflix by licensing their catalogs as they were but instead they decided to launch their own streamers at what appears to be a permanent recurring losses in the billions. Converting billions in value to billions in losses. They could have continued to invest in content that justified that rent but nope.", "score": 2, "replies": []}, {"body": "Without question", "score": 2, "replies": []}, {"body": "Netflix T-12 Net Income: $7.09B\n\nNetflix Market Cap: $301B\n\nDisney/WBD/Paramount T-12 Net Income: -$12.59B\n\nDisney/WBD/Paramount Market Cap: $194B\n\nProfits determine value. \n\nNetflix could buy 95% of Paramount's current market cap with one year of their trailing Net Income. Netflix could buy 37% of WBD's current market cap with its trailing Net Income.\n\nDisney is the only one of those 3 that are actually profitable, and that's largely from their legacy media properties and their parks. Disney+ is only recently profitable and barely so\n\nNetflix is truly just the elite media company. Their streaming business is just unmatched", "score": 4, "replies": [{"body": "lmao NI is not free cash flow, do not say they can buy them with their NI unless you want to be laughed out the door by investors", "score": 5, "replies": [{"body": "It is interesting how all the top comment had to do was remove the you can buy PARA, WBD, DIS and they got upvoted to top.", "score": 1, "replies": []}]}]}, {"body": "Honestly I hate  NFLX. My kids like it.  There is NOTHING left on NFLX worth watching. What I would do  is (after kids leave home ). Buy it for a few months Binge watch then cancel.  Then rebuy 6 months later (binge watch again) cancel. rinse and repeat.", "score": 6, "replies": [{"body": "You arent the target demographic. Most people dont have time to churn. Or those small potatoes just arent worth their time.", "score": 10, "replies": []}, {"body": "You end up costing yourself money that way, congratulations. Just use an illegal stream if you're going to bitch about $10 a month or whatever.", "score": -5, "replies": [{"body": "10??  It’s like 20 for premium.", "score": 1, "replies": []}]}]}, {"body": "YouTube generates more money than all the studios combined.  GOOG is the way.  I believe Netflix has a flawed model for rev generation.  All about subscribers.  With subpar content and declining subs, I think it's completely flawed as an investment going forward.  Now I could be wrong... that's only my thesis.", "score": 6, "replies": [{"body": "You realise that year on year netflix has increased subscribers right?", "score": 5, "replies": [{"body": "Why have they decided to stop reporting subscriptions going forward?  Honest question.  What are they worried about.", "score": 5, "replies": [{"body": "AAPL stopped reporting iPhone unit sales just before their Buffet insane run up", "score": 3, "replies": []}, {"body": "I can answer. \n\nIt’s because “a subscriber” is no longer equal to another “subscriber”.\n\nOne could be a multiscreen $30 sub for which they earn few ad dollars, another could be a $7 ad tier in which they lose money on the sub but make it on ads.  And soon there will be specialized wrestling subs and game subs and live-this or live-that type of subs.\n\nIt was already deceptive in the last, with management bragging about adding subs but never being clear if those were $20 US or $5 India.\n\nSo in the same way Walmart doesn’t announce “we had this many customers” they say “this was our revenue” that’s Netflix is moving to, and makes more sense for what they’re doing.", "score": 5, "replies": []}]}, {"body": "Not sustainable and they won't be going forward.  We all have our convictions.", "score": 1, "replies": []}]}]}, {"body": "Because they are a good company. Do you have any analysis against them besides \"vibes\"", "score": 3, "replies": [{"body": "Nahh they aren't just started something first", "score": -1, "replies": [{"body": "They were smart enough to start something first, and win the streaming wars because of it, but apparently they are not a good company?", "score": 4, "replies": []}, {"body": "The technical performance of the Netflix app and website still performs better than the other streamers, and it's not close.", "score": 2, "replies": []}]}]}, {"body": "I think Disney is undervalued", "score": 4, "replies": []}, {"body": "It's more why are those companies worth so little? Declining sectors with insane costs and business models needing to transition to survive.", "score": 2, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Netflix is up due to lazy people not able to cancel it when they are not using it. I am one of them, haven't used it in months. Will cancel it tonight. Thanks for the reminder", "score": 1, "replies": []}, {"body": " In bc joke b on", "score": 1, "replies": []}, {"body": "A total pipe dream. Best of luck!", "score": 1, "replies": []}, {"body": "Yes- they market share for streaming service", "score": 1, "replies": []}, {"body": "It’s like Resla", "score": 1, "replies": []}, {"body": "I think long term Disney will do really well with both Disney + and Hulu.  It's a patient game.", "score": 1, "replies": []}, {"body": "Netflicks sucks!      Started showing commecials!!       Like they need to squeeze another dime outta us.", "score": 1, "replies": []}, {"body": "Who knows? What I can tell you is Disney, WB, and Paramount all suck. They all need better CEOs.", "score": 1, "replies": []}, {"body": "One thing about Netflix is that they are available in a lot of countries and not only in the US. I live in the US and go vacation in other countries and I am able to use my account there, while I had Disney I got the notification “Streaming is currently not available”.🤷‍♂️", "score": 1, "replies": []}, {"body": "I don't care what these numbers say, this company is absolutely not worth it's current valuation. \n\nIt's all about subscriber numbers. People talk about legacy media...NFLX IS legacy. \n\nPeople are spending more and more time viewing SHORT FORM content. I personally could give two shits about investing time binge watching a series or a 3 hour movie. But I don't want watching clips of wrap ups on TikTok or YouTube. I only subscribe to services that are packed with my cell phone but otherwise $20+ for a SINGLE service of mundane content is absurd. Those numbers will not be growing indefinitely. \n\nI think the company is nearing its peak.", "score": 1, "replies": []}, {"body": "It's a meme stock, always has been.", "score": -1, "replies": []}]}
{"title": "$TSLA Daily Thread - October 08, 2024", "selftext": " Fun chat. No comments constitute financial or investment advice. 🌮", "id": "1fyoy19", "created_utc": 1728352815.0, "score": 15, "upvote_ratio": 0.86, "num_comments": 220, "comments": [{"body": "Great job Elon. Your guy calling electric cars stupid and saying hybrids are good.\n\nhttps://x.com/atrupar/status/1843791280028991786", "score": 16, "replies": [{"body": "The epic self-own continues.", "score": 14, "replies": []}, {"body": "Such a lying sack of shit", "score": 11, "replies": []}]}, {"body": "E2E highway is nice", "score": 11, "replies": [{"body": "You have 12.5.6?", "score": 3, "replies": [{"body": "No but it is nice to finally see the rollout", "score": 1, "replies": []}]}]}, {"body": "[https://x.com/tesla\\_na/status/1843811098753151461](https://x.com/tesla_na/status/1843811098753151461)\n\nNew incentive: Buy a 3/Y with FSD and get 0% APR (US only)", "score": 8, "replies": [{"body": "Great incentive. ", "score": 5, "replies": []}, {"body": "If we get close to 300 I'll be doing this with the new M3LR. Robotaxi pls make stonk fly soon", "score": 3, "replies": []}, {"body": "If only they did that for the X and S 😩", "score": 2, "replies": [{"body": "X and S get the 3 year FSD and unlimited supercharging offer for $5k\n\n[https://x.com/SawyerMerritt/status/1826072001498288570](https://x.com/SawyerMerritt/status/1826072001498288570)", "score": 2, "replies": []}]}]}, {"body": "Well, I'm not getting a Tesla any time in the very near future but we are ordering an Enterprise Starlink kit for a proof of concept at work with the potential to order \\~12 more. \n\nIt's surprisingly super economical because with no contract and paying month-to-month it's an excellent means for disaster recovery.\n\nWe had 4 sites knocked offline for varying time periods due to Helene.", "score": 8, "replies": [{"body": "The corn harvester ripped out my overhead fiber line this morning. I pulled out my phone and restarted my Starlink subscription and was good to go in one minute. Amazing times we live in.", "score": 10, "replies": []}]}, {"body": "The fucking model 3 now has 436 miles of range? I need to stop being an early adopter. FFS", "score": 6, "replies": [{"body": "That's under the European test cycle so it's incredibly optimistic. The true range is closer to the EPA cycle of 363 miles. In fact, in real world use, it could exceed it by a few percent as evidenced by consumer reports latest test of the M3P. \n\nThe RWD M3 is by far the best deal for any car right now. Unbelievable value built into the base model.", "score": 6, "replies": [{"body": "Ah - makes much more sense. It was a Carwow review from Europe...", "score": 2, "replies": []}, {"body": "Tbf on Dutch roads with a speed limit of 100kmph even my 2018 model 3 without all the new fancy efficiency tech often exceeds the WLTP estimate. On the Autobahn not so much of course.", "score": 1, "replies": []}]}]}, {"body": "I hope everyone in florida stays safe!", "score": 5, "replies": [{"body": "E: No fema, federal funding \nPeople without power, food, starlinks\nHelicopters can’t fly, immigrants took all food and helicopters \n\nSorry, Wrong state, this one has repub gov.", "score": 4, "replies": []}]}, {"body": "pretty cool, got email from Tesla to watch live stream at various Tesla service centers near me", "score": 6, "replies": [{"body": "we robot event only for people with stage 4 asperger or above\n\nif you wear a minecraft tee and some noise cancelling headphones you can probably blend in. just don’t make eye contact", "score": 10, "replies": [{"body": "More like stage 420/69, ammirite?!! Hahaha. Ha.  Hehehee.  Hhhhhhhhh.", "score": 4, "replies": [{"body": "seems like you’ll do fine there!", "score": 6, "replies": [{"body": "![gif](giphy|t9vDJ3sOCcGtwyv0ks|downsized)", "score": 3, "replies": []}]}]}, {"body": "![gif](giphy|Y07F3fs9Is5byj4zK8|downsized)", "score": 1, "replies": []}, {"body": "This made my wife lol", "score": 1, "replies": []}]}]}, {"body": "So with these viewing meetups it’s gotta mean we will get to actually see something good right? …right? And that there won’t be a selloff RIGHT?!", "score": 6, "replies": [{"body": "![gif](giphy|y0bJKpOnCuZ8MJsd17)", "score": 4, "replies": []}, {"body": "High hopes I see", "score": 1, "replies": []}]}, {"body": "Downloaded my ticket. It's official.   \n  \nIf anyone comes up to me and whispers the phrase \"Upvote me, Ok?\" then I will know you are from the Lounge.", "score": 16, "replies": [{"body": "Please one of you, at a quiet moment in the night, please yell out \"Upvote me okay?!?\". Please it will be hilarious.", "score": 5, "replies": []}, {"body": "Should be a few of us there! Will either be the greatest night in Tesla history or we'll be complaining about the stock on here on Friday. \n\nNo in between.", "score": 7, "replies": []}, {"body": "Downloaded mine also! Whoohoo! 🥳", "score": 4, "replies": []}, {"body": "Ooo good choice", "score": 2, "replies": []}, {"body": "But it has to be a sultry whisper. Extra sultry.", "score": 3, "replies": []}, {"body": "How will I know what you look like?", "score": 2, "replies": [{"body": "He'll be the guy with the leaf blower strapped to his back", "score": 8, "replies": []}]}, {"body": "Got my ticket, too.  2 days left to arrange travel and hotel?  Nope!  Will be skipping this one.  Hope it goes well, though.", "score": 1, "replies": [{"body": "I'm close enough that I was just going to drive home after. Tough for people far away to take leap of faith with confirming tickets this close to the event.", "score": 2, "replies": [{"body": "It's a bummer, but not a big deal.  There's always webcasts!   Just please don't make it only available on Twitter.", "score": 3, "replies": []}]}]}]}, {"body": "So Milton is a crazy mfer.", "score": 5, "replies": [{"body": "I thought he was in jail", "score": 0, "replies": [{"body": "Meteorologists crying on TV. A rare sighting.", "score": 3, "replies": [{"body": "No way, msnbc?", "score": 1, "replies": []}]}]}]}, {"body": "First mother fuckers. My track record is horrendous with FP so you've all been warned. Prepare for the worst.", "score": 13, "replies": [{"body": "![gif](giphy|f9ZLRWMBjKAbe07PtH|downsized)", "score": 3, "replies": []}, {"body": "📉📉📉📉📉📉📉📉📉📉📉📉", "score": 2, "replies": []}]}, {"body": "2024.32.30 is just going out to early access right now. It includes End-to-End on highway for all vehicles, earlier and more natural lane changes and a new speed setting.", "score": 11, "replies": [{"body": "🎉\n\ngood foundation for v13 / robotaxi", "score": 5, "replies": []}, {"body": "The car waiting until .5 miles from the turn to get into the correct lane was why I didn't use FSD on the streets as much. Glad it's being corrected now. ", "score": 3, "replies": []}, {"body": ".32 branch turns off 12V power when car is off...going to have to think about it before disabling my trunk fridge...", "score": 1, "replies": []}]}, {"body": "I slave for an insurance company. We are shitting our pants about Hurricane Milton.\n\n![gif](giphy|3o84U5xPhrn42WgBJC)", "score": 10, "replies": [{"body": "Hope it somehow loses steam!\n\nI met a lot of nice people in FL!\n\nUsed to fly out to see Iron Maiden on tour. Their drummer lives in Boca/Coral Springs and has a BBQ restaurant there called Rock N’ Roll Ribs!\n\nAlso Disney has activated their ride-out crews at WDW", "score": 1, "replies": [{"body": "Hurricanes are not steam powered.", "score": 1, "replies": []}]}, {"body": "Where’s European guy who wants to move to Florida at? ", "score": 1, "replies": [{"body": "Here, i’m not mentioning this to my wife", "score": 1, "replies": [{"body": "Just think of the 'cheap' property after all this!", "score": 1, "replies": []}, {"body": "😂 ", "score": 0, "replies": []}]}]}]}, {"body": "So Elon joking about how fucked he is if Donald Trump loses. I thought he said his companies will be fine regardless of who the President is...What's all this apocalyptic, all-in crap about?", "score": 10, "replies": [{"body": "He also said a lot of BS irl. He is completely disconnected from reality since a couple of years.", "score": 17, "replies": [{"body": "I'm fully anticipating him becoming an evangelical christian next. Definitely got the quiver-full thing down.", "score": 6, "replies": [{"body": "The Russell brand path is too easy", "score": 6, "replies": []}, {"body": "I don't see him crossing the line into theism. If he did that I wouldn't just be surprised, I would be genuinely shocked.", "score": 1, "replies": [{"body": "Elon likes being popular with an in-group and wants to be seen as the cool kid. The hardcore right wing people he's surrounding himself these days also happen to be over represented by the religious crazies. I never thought he'd become an anti-pronouns warrior - especially given his family - but here we are.", "score": 7, "replies": [{"body": "A person's skeletons will always find a way to the surface", "score": 1, "replies": [{"body": "Except for Wolverine's. The adamantium's density will prevent it from rising to the surface.", "score": 4, "replies": [{"body": "![gif](giphy|3oGRFlVSk3yc4tz8DS)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "For rich people, being a victim is a hell of a drug.", "score": 13, "replies": [{"body": "🎯", "score": 8, "replies": []}]}]}, {"body": "Still no follow up email/details on event. Cutting it close. I'd be nervous buying a flight out to this with only 2 days to go.", "score": 5, "replies": [{"body": "I've got everything booked. They apparently always do this, so I'm not concerned. Probably for security they keep details sparse. Or they are scrambling to get it all together lol", "score": 2, "replies": [{"body": "Elon not sure if he can make it. trump rally in bumfuck nowhere more important.", "score": 1, "replies": []}]}, {"body": "Such is the way of the poorly planned Tesler event", "score": 2, "replies": []}]}, {"body": "We will either come out looking like Buffett and Munger - or something slightly less esteemed. \n\nI need a win on this one Elon.", "score": 8, "replies": [{"body": "He hears you.  By the way, have you ever thought about all the criminals pouring into our border?  I think that's more important than anything Tesla has going on.  Let's use the event to let the world know how awesome Trump is.", "score": 9, "replies": []}]}, {"body": "https://preview.redd.it/6t1xa8y0ngtd1.jpeg?width=1284&format=pjpg&auto=webp&s=59877100be5d6238f4f7f02399731c5f6ef7f409\n\nI don’t know who runs the Tesla/Cybertruck accounts but I’m all for their humor 🤣!", "score": 6, "replies": []}, {"body": "When I’m at the event Thursday, I think seeing the Tesla bot in person will provide valuable insight for me as an investor. I hope it has some level of intelligence and moves decently on its own. This is what I expect to gain most from the event. It would make the next moonshot more tangible for my long-term mindset and TSLA investment.", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Lol too early for that maybe after we sell 100,000,000 of the Tesla Bot.", "score": 1, "replies": []}]}]}, {"body": "FSD drove me to the tractor supply. Didn't park itself but as soon as I touched the brake I was able to punch an auto park spot and it completed the move. \n\nBaby steps.", "score": 4, "replies": [{"body": "auto park is so good. i've tried really odd spots and it usually nails it. not hard to imagine banish! just picking a random spot and partking itself.", "score": 1, "replies": []}]}, {"body": "Damn all the 4 star hotels booked up hella fast! I got rug pulled 2 times as I was booking my stay.  Hotel Burbank for me now. Oh well.", "score": 5, "replies": [{"body": "Bring a black light ", "score": 2, "replies": []}]}, {"body": "https://www.instagram.com/reel/DA32bDGStp5/?igsh=MzRlODBiNWFlZA==\n\nTesla police Cybertruck unveiling.", "score": 4, "replies": [{"body": "its not gonna be used for patrolling but a drug abuse education program lol", "score": 4, "replies": []}, {"body": "Dystopian future has arrived", "score": 1, "replies": []}, {"body": "I couldn’t tell what it was until they pulled the sheet off", "score": 1, "replies": []}]}, {"body": "Just got the invitation to configure my CyberTruck.  As I recall, there were 450,000 reservations before I submitted my reservation.  Does that imply they've had hundreds of thousands of cancellations? Or is there a different explanation?", "score": 4, "replies": [{"body": "got my invite friday and i was 200k in line \n\ncheck my math, but the slope of the line between our two data points looks like ~50k invites per day?", "score": 3, "replies": []}, {"body": "I wouldn't necessarily call them cancellations but yes many hundreds of thousands are not configuring and getting delivered ahead of you. I think Tesla just keeps opening up reservations at a rate they can deliver at. I don't even see the reason for Tesla to cancel your reservation, leave it open they hold the $100. People might be waiting for rates to come down.", "score": 1, "replies": [{"body": "and waiting for the first few iterations bugs to be worked out and the \"I gotta have it first\" sticker price to drop", "score": 4, "replies": [{"body": "Yea, I wasn't really planning on making a decision until late 2025 or 2026.", "score": 2, "replies": []}]}]}]}, {"body": "pltr 💥🚀 💥🚀 💥🚀 💥🚀 🌕 ", "score": 7, "replies": [{"body": "100B soon", "score": 2, "replies": []}, {"body": "Congrats!", "score": 1, "replies": [{"body": "Congrats to all holders not just me. I am an ant with 11k+ chairs. Folks on the PLTR forum have close to 100k chairs or more lol ", "score": -3, "replies": [{"body": "Reality check. I have just under 2k shares, so you have almost 6x as many shares as me. My net worth is in the millions. You are not an ant. I am not an ant.", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Did he mention he drives a 15 year old Camry?", "score": 1, "replies": [{"body": "It’s 11 years old and it’s awesome ", "score": 1, "replies": []}]}]}, {"body": "lol it’s all relative. It’s all where you live and who you’re comparing yourself to.\n\nHere in Greenwich CT, I am a peasant. I’m inclined to compare up and not compare down. ", "score": -2, "replies": [{"body": "objectively you’re rich. 🤑 \n\nBeing “poor” in one of the richest zip codes doesn’t mean you’re not rich.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Chicken Mac gonna make us rip", "score": 6, "replies": []}, {"body": "Lol China pump", "score": 2, "replies": []}, {"body": "Why is my FSD still on 12.3.6? How do I get 12.5?", "score": 2, "replies": []}, {"body": "First McDonalds now [Anduril](https://x.com/anduriltech/status/1843756750031491497?t=j2byJeYCxfwU_lIEuy_eEQ&s=19)", "score": 2, "replies": [{"body": "we're in the other thread already", "score": 1, "replies": [{"body": "Ay caramba", "score": 2, "replies": []}]}]}, {"body": "🚀", "score": 6, "replies": [{"body": "🚀 🚀 ", "score": 1, "replies": [{"body": "🚀🚀🚀", "score": 1, "replies": []}]}]}, {"body": "some thing is know by select individuals ", "score": 4, "replies": [{"body": "Up 0.9% \n\nSad", "score": 2, "replies": [{"body": "“Doesn’t matter if you win by an inch or a mile; Winning’s winning.”\n\n😇", "score": 1, "replies": [{"body": "![gif](giphy|JxZKDvJDyFa1Um0ZOX|downsized)", "score": 1, "replies": []}]}]}]}, {"body": "I will keep my Camry for the foreseeable future but i would love to get the adult cyber quad.\n\nWould love to plow my driveway myself in the winter instead of paying $200-$300 per snow storm to have someone else do it (I have a long ass driveway, ~250 feet long or so)", "score": 4, "replies": [{"body": "I have just shy of 1,000' of driveway. I would love to have the cyber quad for running down to the mailbox.\n\n\nFor my Wisconsin winters I have a small tractor that mounts a 50\" snowblower. I can clear a 6\" snowfall in under an hour", "score": 4, "replies": [{"body": "A thousand feet! So almost a quarter mile of a driveway?! Goals right there\n\n💵💵😎💵💵\n\nWhat are property prices looking like by you? Where would you recommend buying if I was looking in Wisconsin? ", "score": 1, "replies": [{"body": "Look into the outskirts of Green Bay, best bang for buck.\nWe’ll party", "score": 1, "replies": [{"body": "Thanks for the tip. As a landlord, I’m always looking for the next place to buy a place. Will look at green bay Zillow on my commute home. ", "score": -1, "replies": [{"body": "I wouldn’t buy it for the people though. Buy it for all the space", "score": 1, "replies": [{"body": "Not people but for capital preservation and growth. Gates and Bezos are avid land collectors; I’m aspiring to do the same at my meager scale. ", "score": 0, "replies": []}]}]}]}, {"body": "I'm in southeast WI and prices are high down here, lots of demand. But East/West coasters likely see our prices as bargains.\n\n\n\nDepends on your desires. Big city with lots of amenities, small town with homey feel or the boonies with more elbow room but have to travel a bit for stores, etc. \n\n\nWe bought 12 acres about 20 years ago and that was going for $11,500 an acre. Now it's not uncommon for buildable land to go for $20-$50,000 an acre by us. This is land all ready to go to build. You can buy less expensive in a private deal but not common as you have to know someone who knows someone.\n\n\nPM me if you want more detail about WI locations. I've lived in a number of different communities, have family in others and used to travel in state for work quite a bit.", "score": 1, "replies": [{"body": "🏆🥇🏅🎖 ", "score": -1, "replies": []}]}]}]}, {"body": "No heated driveway. I expected more from C-suite exec.", "score": 5, "replies": [{"body": "Haha have you been to the north east?! It’s so incredibly predatory here. The second you do any work requiring a permit, your property tax jumps to excessive amounts. The neighbor diagonal from us is paying close to $80k in ANNUAL taxes.\n\nBecause of my approach and strategy, his property value went up and so did mine due to proximity, yet my tax base is about half of his, meanwhile I’m in the same posh neighborhood ;)\n\nMy favorite are the folks that left nyc and came to my neighborhood, overpaid for their Greenwich estates, and are now posting “ZOMG why did my taxes go up 50%?!?!” 😂😂😂\n\nCaveat emptor. Always. ", "score": 2, "replies": []}]}, {"body": "![gif](giphy|3o75218xzv3Hoe66go|downsized)", "score": 3, "replies": []}, {"body": "Which will come first: Optimus knowing how to shovel or Cyberquad.", "score": 2, "replies": [{"body": "lol good question from a good boy 🐶 ", "score": 2, "replies": []}]}]}, {"body": "A lotta shares dumped around $245. MMs working hard this morning.", "score": 3, "replies": []}, {"body": "Here’s a thought I had, why do I hold tsla when I could buy tsly? With my current holdings I could buy a lot of tsly which would pay 4000$ a month on dividends. Reinvest that monthly. I’m looking at 60k$ a year in dividends. Is this stupid?", "score": 3, "replies": [{"body": "It's essentially a covered call ETF that you trust and pay someone else to manage.\n\nIf TSLA dumps, TSLY dumps with it. The key is where yieldmax places the new CC to pay the ongoing dividends. If it places it wrong and TSLA moons, TSLY can be capped at a lower level.\n\nRepeat that a few times and it severely underperforms.", "score": 2, "replies": []}, {"body": "4000 * 12 is not 60000", "score": 1, "replies": [{"body": "With reinvestments it would close (according to quick napkin math)", "score": 1, "replies": []}]}, {"body": "It’s down over 60% in several months I think those high dividend etfs decay over time.", "score": 1, "replies": [{"body": "That’s what I would assume as well. But it’s been pretty good for the past year. Lowest 64 cents. Highest over 2$. All based around how tsla has been doing.\n\nEdit: I should also note it’s gone through a reverse split as well", "score": 2, "replies": []}]}, {"body": "I hold TSLA and sell CCs every week. That's essentially the same thing but the benefit is I hold TSLA and not some ETF that's only be around for like 2 years", "score": 1, "replies": []}, {"body": "The real question is, why hold tsly when you could hold literally anything else?", "score": 0, "replies": [{"body": "![gif](giphy|WhTC5v5qQP4yAUvGKz)", "score": 1, "replies": [{"body": "basically these aggressive covered call funds will underperform volatile stocks in just performance alone.  Add to that the fees that they collect, you're basically paying someone to give you a worse return than TSLA.\n\nAdd to that, the portion of the fund that is returning to you as a \"dividend\" is taxable, and you're even further behind.", "score": 2, "replies": []}]}]}, {"body": "Why hold tsly when you could buy tzler", "score": 0, "replies": []}]}, {"body": "https://x.com/dirtytesla/status/1843709570084110692?s=61\n\nDirty Tesla first drive clip of FSD 12.5.6. This includes the new speed profiles but it's still struggling with speed control. Perpetually drives slow and even after tapping the accelerator to speed up, it loses speed over time, eventually getting to well below the posted speed limit. Chris is using the \"Hurry\" speed setting too, which is supposed to drive faster. \n\nKind of disappointing that they just can't seem to fix these chronic issues.", "score": 4, "replies": [{"body": "looking forward to the shitshow come thursday", "score": 1, "replies": [{"body": "Buckle up gents and ladies", "score": 2, "replies": []}, {"body": "Are we ready for ~~300~~ 200?", "score": 0, "replies": []}]}, {"body": "https://x.com/tesla_na/status/1843709830118420659?s=46&t=mG-wx8ewMg03AyZIsmD4-g", "score": 1, "replies": [{"body": "I think Omar runs their Twitter feeds.", "score": 1, "replies": []}]}, {"body": "Main reason why I don't use FSD nowadays is that it drives like it's 70 with poor speed control, the software needs better quality gating imo", "score": -1, "replies": []}, {"body": "Sounds like they need some C++ code.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Venue moved to Four Seasons Landscaping.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}]}, {"body": "Not first!", "score": 4, "replies": []}, {"body": "Just took a family walk around the neighborhood, and thanks to my broken foot, I was able to kick back in the Cybertruck for kids, put my boot up on the front end, and drive along so I didn’t miss out on the walk on this nice night. Thanks, Tesla!", "score": 2, "replies": [{"body": "Hope the foot gets better 💯!\n\n\nI miss read this and didn’t realize it was the kids version so I had this WILD mental image of you with a broken foot sticking out the window ghost riding the Cybertruck with your family 🤣", "score": 1, "replies": [{"body": "Thanks. Lol, maybe next year when I get the real deal. 🤞", "score": 2, "replies": []}]}]}, {"body": "https://x.com/mayemusk/status/1843453579279118572?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nMaye mind virus", "score": 3, "replies": [{"body": "fucker went to the diddy island", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Already reaching the limits of HW4?", "score": 1, "replies": []}]}, {"body": "CNBC with another robotaxi video:  \n[https://youtu.be/Ym5pOLjsG-I?si=B9evqBBPgyK-\\_fKr](https://youtu.be/Ym5pOLjsG-I?si=B9evqBBPgyK-_fKr)\n\nThis one's actually pretty factual.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I think doors open at 5pm pacific. Event starts at 7pm.", "score": 2, "replies": [{"body": "4am for me 🐷 🔫", "score": 2, "replies": [{"body": "Same. Can’t miss it, will be up all night 🍿", "score": 3, "replies": []}]}]}, {"body": "I think doors open at 5pm and actual event is at 7", "score": 1, "replies": []}]}, {"body": "https://x.com/vincentoshana/status/1843448553844420783?s=46&t=mG-wx8ewMg03AyZIsmD4-g", "score": 0, "replies": []}, {"body": "https://x.com/tashaark/status/1843730180306788720?s=46\n\nFrom my fav gal Tasha", "score": 1, "replies": []}, {"body": "I can confidently say days like these test my thesis to hold cash till the EOY.\n\nMarket is ripping 🚀\n\nFeeling FOMO. But will resist 😎", "score": 2, "replies": [{"body": "I mean, the s&p just undid yesterday overall.", "score": 2, "replies": []}, {"body": "buy and hodl is the way to go. I hope your sells were all in tax advantaged accounts. ", "score": 1, "replies": []}]}, {"body": "Worth noting that Tesla seems to have dropped their practice of temporarily making Superchargers free along hurricane evacuation routes\n\nTimes are tight and Tesla is trying to hold onto its meager profits", "score": 1, "replies": [{"body": "It was always a marketing stunt, they just care less about marketing now because fuck growth", "score": 2, "replies": [{"body": "Cry", "score": -8, "replies": [{"body": "??", "score": 0, "replies": []}]}]}, {"body": "Cry", "score": -5, "replies": []}]}, {"body": "Is E going on 60 minutes and other outlets to promote robotaxi and alley fears of autonomous cars.", "score": 1, "replies": []}, {"body": "playing diablo, expansion seems nice so far", "score": 1, "replies": [{"body": "I have not heard “playing Diablo” in 20+ years ;)", "score": 2, "replies": [{"body": "I'm hoping the next Nintendo system will play Diablo IV", "score": 1, "replies": []}]}, {"body": "Great to see people having fun with game these days :) seems all too bleak otherwise. I'm deeply addicted to satisfactory at moment.. damn it is nice! Long time since I was excited for a game.", "score": 1, "replies": [{"body": "i mean games generally fall into two categories: games that you play to enjoy feeling powerful (diablo is in this category) or games where you feel like shit vs other players but you enjoy the challenge, like dota and starcraft", "score": 1, "replies": [{"body": "I love the challenge of the second category.. but not in multiplayer. I dont need the pressure. For that, I play The Long Dark. Great game, but not for people that need or want action. As for Satisfactory, it .. scratches the itch of making ever more complicated machines work well together. Its a challenge but also relaxed as there is no time pressure. Just.. make the most complicated beautiful thing imaginable.. :) Also, i love automating stuff.. something about that is just cool", "score": 2, "replies": [{"body": "You and I seem to have similar taste in games. I was binging The Long Dark for a few weeks in August until the Satisfactory 1.0 release. I just finally got the hover pack which makes building so much easier. Making my first aluminum plant now.", "score": 1, "replies": [{"body": "Ohh wow, you are mich further than me. I only have 2 hours or so per day if I really push it and I do push it. I just made my first oil factory, produced plastics, made a train line from the oil field to the base and set up a computer factory. Still need to automate sulfur and quarz, large frames and other stuff, always a lot to do! And I need somehow start the story line on S.A.M. .. not seen that stuff yet. Sure, I could look it up but I want the game to point me to it somehow. I started in the grassy fields and I build factories where the resource nodes are, only have a central area for collecting all the parts. Decided against a giant bus based factory. But yeah, getting kind of cramped there. Also need to design the holding building for the central storage system. It's kind of getting spaghetti.. 😂 \n\nI bet it's gonna get much worse when all the other liquids are introduced.", "score": 1, "replies": []}, {"body": "On the long dark.. I enjoy interloper a lot. My character is on day 280 ish. I want to live to 500 with him and complete faithful cartographer.. but he needs to wait until satisfactory has run it's course 😅", "score": 0, "replies": []}]}, {"body": "My wife loves TLD. I'm back on a Battletech kick lately.", "score": 0, "replies": [{"body": "The harebrained studios game? I've been meaning to try that one out.  Bought it years ago, but somehow keep playing front mission 3 instead, lol", "score": 1, "replies": [{"body": "Yes, that's the one. It's my jam right now. I like turn based games like that, Fallout 1&2, XCom 1&2, etc.\n\nIt's 100% worth the stock playthrough with the DLC. It also has a huge mod community for various universe timeline settings. BEX and BTA are the 2 biggest and most developed as I understand it. I'm going to throw myself into BTA until I get bored, play something else, and likely come back to the game again next year and give BEX another go.", "score": 0, "replies": [{"body": "Might want to check out the front mission series.  It's older, but it's the first thing I think of when I think of mech srpgs", "score": 0, "replies": []}]}]}]}, {"body": "Have you tried factorio?", "score": 0, "replies": [{"body": "Yeah.. but didn't get it.", "score": 0, "replies": [{"body": "Ah, I was obsessed with it for months.  Bounced off of satisfactory not because I thought it was bad or anything, but just got distracted by triangle strategy and never came back to it", "score": 0, "replies": []}]}]}]}]}, {"body": "Have you played *Factorio* or *The Crust*? I wasted many many many...many hours on *Factorio*. \n\nI tried and enjoyed *The Crust* and it's seems very promising but still being developed, and way too much manual grind and currently no templating which sucks.", "score": 0, "replies": [{"body": "I tried the demo but the ever present threat of the locals made it less enjoyable for me. On the other hand, the setting would be quite boring if the locals would not be so threatening. They have found a good balance. I almost got it though. It's a very cool concept and I applaud them for the game!", "score": 0, "replies": []}]}]}, {"body": "Hey wait, musk likes that too therefore it must be bad according to the sub", "score": 0, "replies": [{"body": "even a broken clock ...", "score": 0, "replies": []}]}]}, {"body": "https://x.com/niccruzpatane/status/1843489640923443407?s=46&t=mG-wx8ewMg03AyZIsmD4-g", "score": 1, "replies": []}, {"body": "What’s woodwork3r’s nanny up to today?", "score": 1, "replies": [{"body": "Cleaning the wood", "score": 2, "replies": []}, {"body": "Guapo papi", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well you aren't.", "score": 1, "replies": []}]}, {"body": "Dick gone limp. Someone twiddle TSLA's nipples or something.", "score": 0, "replies": []}, {"body": "GM Ultium skateboard is dead lol", "score": 0, "replies": [{"body": "What do you mean?", "score": 0, "replies": [{"body": "They're changing skateboard systems, probably better in the long run, but it's always been known to be poorly designed", "score": 2, "replies": [{"body": "Wonder how long they’ll support the ultium stuff or if it’ll be obsolete before warranty is up", "score": 1, "replies": []}]}]}]}, {"body": "Got FSD 12.5.4.1 today. Weather was a bit wet and it surprisingly did fantastic. Better than 12.5.4 did in sunny weather. We'll see if it continues or degrades over time but for now, I'm pleasantly surprised. It did kind of over-react to a construction worker crossing the street and it made a late lane change (no traffic so it was inconsequential) but I can't say it was dangerous like 12.5.4 could be.", "score": 0, "replies": [{"body": "Is that the newest iteration? You on HW3 or 4?", "score": 2, "replies": [{"body": "It's the latest non-early access version, yeah.  I'm on HW3. \n\nIt's still crap with speed control but the drives I had today were pretty decent overall. Really looking forward to updated highway stack so my commute is entirely end-to-end.", "score": 1, "replies": []}]}]}, {"body": "https://x.com/markmitbommel/status/1843371805391876198?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nFunny", "score": 0, "replies": []}, {"body": "https://www.reddit.com/r/TSLALounge/s/1pS4mo3qxs", "score": -16, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "That account is an alt of isjokecomrade?  No wonder they were booted from the mod team here", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "And he continues to deny it even though he openly admitted it when he created the alt IIRC.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’m not your brother, man.", "score": 1, "replies": []}]}]}, {"body": "Tf have I ever done that’s racist \n\nBold accusation to accuse someone of that", "score": -1, "replies": []}]}]}, {"body": "The AI did it", "score": -4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Go back to sipping espresso California man", "score": -5, "replies": [{"body": "You’re a fucking clown. No wonder you were begging for money for those shit memes.", "score": 10, "replies": [{"body": "Lmao can give it but can’t take it\n\nYou live in a glass house 🏡", "score": -2, "replies": []}, {"body": "Prius 😂😂", "score": -2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "😂👍", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "It is a violation of Reddit TOS to solicit this.  \n\n\n\nThe violation report function specifically states that:\n\n>Sharing, threatening to share, or soliciting intimate or sexually-explicit content of someone without their consent (**including fake or \"lookalike\" pornography**).\n\nis prohibited.\n\n\n\nAdditionally:\n\n[https://redditinc.com/policies/content-policy](https://redditinc.com/policies/content-policy)\n\n>Rule 3  \n\n>Never post **or threaten to post** intimate or sexually-explicit media of someone without their consent.\n\n[https://support.reddithelp.com/hc/en-us/articles/360043513411-Never-Post-Intimate-or-Sexually-Explicit-Media-of-Someone-Without-Their-Consent](https://support.reddithelp.com/hc/en-us/articles/360043513411-Never-Post-Intimate-or-Sexually-Explicit-Media-of-Someone-Without-Their-Consent)\n\n>Rule 3 prohibits sharing intimate or sexually explicit media of a person created or posted without their permission. \n\n>Intimate media include a depiction of the person in a state of nudity or engaged in any act of sexual conduct, **including depictions that may have been AI-generated or faked.**", "score": 5, "replies": [{"body": "Got it, understood", "score": -3, "replies": []}]}, {"body": "Am only classy one who said yes but make it stock related…", "score": -6, "replies": [{"body": ";)", "score": -8, "replies": []}]}]}]}
