{"title": "Option traders are expecting a ± 5.0% move when Apple Inc. (AAPL) releases earnings today after the market closes", "selftext": " \n\n## AAPL to Release Earnings on November 1\n\nApple Inc. **(AAPL)** is scheduled to release earnings on November 1, 2018, after the market closes, and will hold a conference call at 5:00 PM ET on the same day. The stock currently trades at 219.46, which is **8.9% higher** than the close following its last reported earnings, trading with a range of 197.31 to 233.47 since that time.\n\n### Expected Price Volatility\n\nCurrently, option traders are expecting a **± 5.0%** move for this earnings, and during the previous earnings release, the stock experienced a **+5.9%** move. Over the last 12 quarters, the absolute average move has been **± 4.5%**, with a minimum move of 0.3% and a maximum move of 6.6%. AAPL has experienced **7** larger-than-expected earnings moves in the last 12 quarters. ", "id": "9tawq8", "created_utc": 1541089264.0, "score": 68, "upvote_ratio": 0.91, "num_comments": 43, "comments": [{"body": "I'm too afraid AAPL will shit the bed with guidance I sold my calls today.  My main concerns: reports of reduced Chinese consumer demand, strong USD and weak CNY eating into margin, any mention of the \"T\" word by CFO.  The only reason I'm not holding puts is theres a chance that even with fairly crappy guidance it'll go up like FB because bad news is already priced in.", "score": 55, "replies": [{"body": "You were exactly right. Good call", "score": 30, "replies": [{"body": " No they were bad calls, that’s why he sold them. ", "score": 16, "replies": [{"body": "...good call on selling the would-be bad calls", "score": 2, "replies": [{"body": "He was joking lmfao. That was pretty obvious sarcasm", "score": 5, "replies": []}]}]}, {"body": "Honestly, I'm sure /u/badcat_kazoo is a *very* good trader. In this instance he made a great decision. But I don't think anyone predicted 170s by Dec. 1. ", "score": 1, "replies": [{"body": "Initially I thought it'd stop falling around $188.  Soon as I saw bear target was $165 I quickly realised it may be heading closer to that.  I think a lot of us are surprised but I suppose when you combine a bear market with bad news that is the result.  Good learning experience if I'm still doing this years to come.", "score": 1, "replies": [{"body": "Is there still a downside?", "score": 1, "replies": [{"body": "Appears to be trading with the market recently so looks like everyone that wanted out got out.  Now it depends on Fed and Trump-Xi trade talks.  If news causes market to spike AAPL should follow, if theres nothing substantial out of G20 market could go flat or down again.  Historically December brings with it a Santa Claus rally but with current trade tensions things may be different this year.  For AAPL I think theres more upside than down if we're going by that $165 target.  It's a good company and long term I believe it will adapt and pull through.", "score": 2, "replies": [{"body": "Anywhere you can find a graph of Apple’s cash reserve over time? I’ve been looking for one. That they have 250B in cash is just amazing. ", "score": 1, "replies": [{"body": "I've not come across a graph of it, may be a matter of digging through old fiscal reports.  No doubt their cash reserves have done nothing but grow over the past few years.", "score": 1, "replies": [{"body": "Ya. The year-long drop from like 2014-15 is a little scary. I wouldn't want to be caught with 1000 shares as we drop for a straight year. But I just wonder how big the cash reserves were back then. ", "score": 1, "replies": []}]}]}]}]}, {"body": "btw by \"Bear target\" do you mean \"falling 20% or more\"?", "score": 1, "replies": [{"body": "Thats the price target set by the prominent bearish analyst that predicted AAPL poor ER and guidance prior to its release.  He also has one of the lowest targets out there so I like to look at is as the maximum downside.  Got to hand to him, its gotten pretty damn close.", "score": 1, "replies": []}, {"body": "[Here](https://www.fool.com/investing/2018/08/21/why-this-analyst-is-wrong-about-apple.aspx) is an article about the analyst when he initiated his $165 target back in late August.  At this point everyone else's target was mid 200's.  Everyone thought he was way off, guess he showed them.", "score": 1, "replies": [{"body": "Oh wow. But I mean if it jumps from here was he really proven right? ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I was in HK the other day and there was a line out the door. I’ve been in China for a few weeks Huawei is very real competition here - however it’s clear IP stealing, unfortunately that’s the marketplace - companies go to China to “grow” but in reality they go for 2-5 years and teach a labor force what it takes to make a competitor. ", "score": 13, "replies": [{"body": "If that is the case, why is BB, Nokia and other phone makers are not competing?", "score": 5, "replies": []}]}, {"body": "great fucking call I’m jealous of ur insight  ", "score": 5, "replies": []}, {"body": "Great call I also had that feeling. Down from here.", "score": 4, "replies": []}, {"body": "You are probably right!!", "score": 5, "replies": []}, {"body": "Whats the t word? Trade war?", "score": 2, "replies": []}, {"body": "T word? Trade war?", "score": 2, "replies": [{"body": "The dreaded “tariff”.  In AAPLs case they were exempt in USA but future tariffs could affect supply chain. In addition, there is a growing fear they may be targeting by retaliatory Chinese tariffs if the situation continues to escalate.\n\n\n\nI don’t listen to many conference calls in full but in the few I have soon as tariff was mention the stock went off a cliff. Most notably with MU...and in their case they kept rolling down that cliff for a month from $48 to $34.", "score": 2, "replies": []}]}, {"body": "It’s gonna smash earnings, you chickened out", "score": -8, "replies": [{"body": "Hows them bags?", "score": 28, "replies": []}]}]}, {"body": "Noob question:so if the move is larger than expected, then a straddle is profitable?", "score": 18, "replies": [{"body": "Not if you have waited until now to do it. Near-term puts and calls are trading this morning at around 4-sigma (the implied standard deviation is 4 times the recent historical level). A this point the move would have to be greater than 5% to even break even on a straddle or strangle.\n\nEdit: Just repriced. At 1:30 PDT a 220 straddle would cost about $11 for tomorrow expiry. A 5% move would more or less be break-even. So to be clear, any move larger than that would be profitable.", "score": 17, "replies": [{"body": "You can sell straddles too. Or Iron Condors", "score": 6, "replies": [{"body": "Sell them?? Buy them! I have been sitting here for a week with Friday expiry 225 calls and 225 puts. Paid 2.44 for both legs.\n\nI am rather pleased that the aftermarket price is 208 or so. ", "score": 1, "replies": [{"body": "How did you manage to get both a that price? I call bullshit? If a call is cheap, corresponding put at the same strike should be in the money and should be expensive. ", "score": 3, "replies": [{"body": "Well not bullshit. A mistake. I was looking at the cost basis for another pair when I typed that out. I realized that I had something wrong just before I read this again.\n\nMy cost was 8.45. The put will still have a small premium at open that will vanish quickly so I expect to sell immediately at the open at more or less break even, give or take a small loss or gain. ", "score": 0, "replies": []}]}]}]}, {"body": "so selling is a good idea? I just sold 2 6.5 gpro calls expiring tomorrow. Unless it drops below 6.5 i make about 30 dollars for each and if it does drop below 6.5 then i make like 92 dollars on each but keep the shares. ", "score": 2, "replies": []}]}, {"body": "You would have to enter into the straddle right before close at the nearest strike, otherwise it could move up/down by close and a straddle would be less effective. ", "score": 3, "replies": []}, {"body": "Yup, it would've been profitable. Straddles right now are actually a pretty decent play on most stocks that have made big moves on previous earning reports. Now they're even more volatile due to the market's current state. You just gotta be careful with IV crush, so very short term exp wouldn't work too well with them", "score": 1, "replies": [{"body": "So say today apple moved to 208 today, would a straddle due this friday better, or something like a month from now?", "score": 1, "replies": []}]}, {"body": "About a month ago.\n\nThe 5% up or down move is priced into the options already.Hence the title.So if you think it would go down 8% or up 8%  you might be able to pull \\~2% off of it. Assuming one OTM contract expires worthless and your other one is liquid enough. Bid/ask spreads could be all over the place. You'll be wise to watch from the side lines on this one. However, personally i think they have a hard miss on earnings. I also don't think out look is going to be favorable. However, The watch might be able to fill that earnings gap as well as the outlook that will be left from poor iphone sales IMO. In which case you could use a neutral options strategy to capture the lack of volatility but that's not for the noob at all this isn't a short strangle situation. Maybe an iron butterfly but you'd have to look into it. ", "score": 1, "replies": []}, {"body": "Assuming you did it correctly, yes", "score": -3, "replies": []}]}, {"body": "All this analysis tells me is that these options are relatively fairly priced. The expected move is right above historical average and that makes sense given short selling is inherently riskier. \n", "score": 5, "replies": []}, {"body": "Great story. They'll miss earnings hard IMO. Nice short i'd say a 10-14% drop in the next five days.", "score": -1, "replies": [{"body": "posted this well after they missed", "score": 3, "replies": [{"body": "Future earnings. The next five days part. Welllllll now 4 days.(NYSE OPEN MARKET DAYS) Not after hours trading. ", "score": 1, "replies": []}]}]}]}
{"title": "Buy Apple ahead of earnings today?", "selftext": "\"Felt lucky\" ahead of Facebook (FB) earnings and put on an options trade.  Apple 1-month implied volatility is pretty rich ahead of earnings -- nearly 2.5 standard deviations above its 1-year mean.  \n\n&#x200B;\n\nSince the end of September, Apple is down 2.85%; Apple is down 3.94% since the end of August.\n\n&#x200B;\n\nPossible bounceback trade here in one of the best quality value \"tech\" stocks in the Nasdaq 100?", "id": "9t8uo8", "created_utc": 1541074345.0, "score": 42, "upvote_ratio": 0.77, "num_comments": 40, "comments": [{"body": "That's some wild speculation. No amount of TA will stop an options play ahead of earnings from being a straight up gamble.", "score": 54, "replies": [{"body": "Post was meant to be \"purely\" speculative to gauge sentiment. :-)\n\nLook, on our end, we are quants and multi-factor models to derive ranks for stocks...we use AI-powered research to put together our multi-factor models.  Sadly, it is the first of the month and our models are taking a bit to rebalance.  We have no real opinion about whether it makes sense to take a plunge though 2.5 SDs would suggest hedging volume is too heavy.  ", "score": -18, "replies": [{"body": "Your idea of gauging sentiment is a post on a relatively small subreddit full of casual investors most of whom are subject to the PDT rule? You're telling me you have all those models and complex TA and this is your sentiment analysis?", "score": 7, "replies": []}]}]}, {"body": "I imagine the new phone models are selling well and services are doing great. It's really gonna come down to guidance and if they lower guidance like many other company's did for 2019", "score": 21, "replies": [{"body": "They aren't selling well, at least by past standards.\n\nThe iPhone Xs was the first series of iPhones which didn't sell out on the first day of launch. It isn't doing well, I suspect this year's earnings to disappoint", "score": 9, "replies": [{"body": "Username checks out", "score": 14, "replies": []}, {"body": "I think we've reached a maturity point for smart phones in general. Consumers have everything they need at this point in speed, capacity and size. Planned time before upgrade has increased a lot. I think that's the reason for the significant increase in consumer prices for the new models as they want to make up for expected lower volume.", "score": 4, "replies": [{"body": "No it's just Apple. OnePlus has regularly innovated and there recently was a new Asian phone called Poco which had every single feature the new iPhone did, with better battery and software at HALF the price. Naturally, it made more than twice the money the new iPhone XR did in a few days, in about 5 minutes from launch. \n\nApple is struggling to compete in its most valuable market and I highly doubt their earnings won't plummet ", "score": -2, "replies": [{"body": "[Samsung, which ships one of every five smartphones globally, said mobile-division revenue dropped 10% to 24.91 trillion won, down from 27.69 trillion won a year earlier. Its mobile division profit nose-dived by a third.](https://www.marketwatch.com/story/samsung-profit-swells-but-phone-sales-a-worry-2018-10-30)\n\n>Consumers are balking at $1,000 phones and holding on to their devices longer than ever. But the South Korean technology giant was surprised this year by poor sales for its flagship Galaxy S9 handsets, a device marketed around its animated human emojis. \n\n&#x200B;", "score": 6, "replies": []}]}]}, {"body": "That may very well be because there are more phones to choose from this time around ", "score": 3, "replies": [{"body": "I think you made an error in wording. The sales aren't plummeting because there are more phones to choose from, the sales are plummeting because there are better phones to choose from. Apple's product line is getting more expensive and worse, day by day, and the company very likely has no future unless they start making some drastic changes ", "score": -10, "replies": [{"body": "did you actually just say Apple has no future unless they make drastic changes? \n\nlmfao you forgot the /s, right? ", "score": 2, "replies": []}, {"body": "Well i have no holdings but i’m still praying AAPL’s numbers are good. Like it or not, every single analyst out there has tied the rest of the outlook to how AAPL performs. If it doesn’t do well we’re all going deeper into the hole", "score": 1, "replies": []}]}]}, {"body": "On the other hand, this is the first time Apple's ever done a staggered launch, with the more expensive model coming out first.\n\nIt was iPhone 8 then X right after before.  This time it was XS with XR following.\n\nI think the XR will sell better than expected.  The XS didn't sell out because it's a very expensive phone.", "score": 1, "replies": [{"body": "It didn't \"sell out\" because it was a reiteration of last year's phone.  Last year the phone was supply constrained due to a new body.  ", "score": 1, "replies": []}]}]}, {"body": "Yep. They could blow the estimates out of the water with record earnings but still tank AH if their guidance sucks. Remember that stocks are priced on future potential earnings, not past earnings.", "score": 2, "replies": [{"body": "In this speculation based market, guidance is everything. ", "score": 2, "replies": []}]}]}, {"body": "Historically, every time analysts expect Apple to fall post ER, it goes up. ", "score": 5, "replies": []}, {"body": "I wouldn't buy anything with all this selling going on. Market is very volatile. A good ER might not matter and a bad ER will decimate the stock.", "score": 5, "replies": [{"body": "What’s sentiment on Apple like? If people are overly bearish anything other then a miss in earnings will pump the stock up. But if they are bullish then yeah I agree.\n\nBut at the end of the day don’t buy before earnings it’s no different from gambling.\n\nEdit: or just buy some options on it, but it’s still risky since idk how volatile it will be after earnings", "score": 1, "replies": []}]}, {"body": "Womp womp.", "score": 6, "replies": []}, {"body": "Never mess with the big boys during earnings, TA means nothing", "score": 8, "replies": [{"body": "Just buy options?", "score": -1, "replies": [{"body": "He meant the opposite of just buy options. Options can expire worthless which makes them a huge gamble for earnings. \n\nIf you go long and earnings miss, historically speaking, AAPL gives you your money back within a few months. I think the only even slightly level headed reason to use options on ER is if you're betting against the trend. Because if you short apple and ER is a beat, it's going to be tough to hope it crashes back down to get your $ back when a stock like AAPL rarely does", "score": 2, "replies": [{"body": "Yeah, but OP is looking to make a gamble on the ER.\n\nBuying the stocks for a short term gamble could easily be more expensive than buying an equivalent number of calls.\n\nIf the options expire worthless because AAPL went down, OP can consider if buying the stocks is worth it then.", "score": 1, "replies": [{"body": "could, but super unlikely. We're talking about AAPL here, so I don't think this applies unless we're in a full on bear market. AAPL isn't that volatile, I'd be extremely surprised if anyone going long will have lost more money on stock than options if the stock are held for a few weeks. options are 100% rekt and gone, but stock will very very likely come back up and return that capital to you. \n", "score": 1, "replies": []}]}, {"body": "Buying dip in Apple today with OTM Call spreads.  Total overreaction to earnings.  Totally agree with your analysis that Apple historically comes back after earnings sell-offs.", "score": 1, "replies": [{"body": "Cheers- I'm in as well my dude, got shares @ 208 during after hours last night", "score": 1, "replies": []}]}]}]}]}, {"body": "Their product release days before earnings makes me think they may be trying to excited investors ahead of poor earnings ", "score": 3, "replies": []}, {"body": "No", "score": 4, "replies": []}, {"body": "How much does the price have to jump or drop, for you to gain?", "score": 1, "replies": []}, {"body": "Dead cat bounce", "score": 1, "replies": []}, {"body": "no.", "score": 1, "replies": []}, {"body": "What do y’all believe it’ll do today ", "score": 1, "replies": []}, {"body": "Yeah these 3 days of green were nice. That shits over now.", "score": 1, "replies": [{"body": "Everything is fine still. We should be breaking $275 on SPY soon.", "score": 1, "replies": []}, {"body": "You are being too sour.  Buying the dip in Apple....OTM Call spreads.  Results really aren't that bad.", "score": 1, "replies": []}]}, {"body": "As it turns out, no.", "score": 1, "replies": []}, {"body": "Nice call!", "score": 1, "replies": []}, {"body": "The big issue is planned obsolesce or the lack there of now. Apple would periodically release updates that intentionally slowed older phone models down gradually with each update. It would get to the point that you device hardly worked. I was a victim of this. My phone was great when I got it, and it was slow as snot two years later. Everyone knew they were doing it, but then we had proof. France even sued them over it because that's actually illegal there.\n\nAs humans we are used to mechanical things \"getting old\" and slowing down, and we assume electronics work the same, but that's simply not how it works. A phone should function at the same speed regardless how old it is as long as it's not malfunctioning. People get frustrated and upgrade their phones.\n\nWell since February, they released an update under immense pressure that lets people disable this \"slowdown\". With this change, people will simply not feel as compelled to buy a new phone, and I expect phone sales will reflect this.\n\n&#x200B;\n\nI'm predicting a big miss today.", "score": -3, "replies": []}]}
{"title": "Apple’s earning call !", "selftext": "Personally , I believe APPL beats expectation since Tim looked very bright in new iPad announcement ! Lol .... APPL’s strategy shifted to sell product more expensive and actually it works cause APPL is now the only player can use IOS and it makes them special. All other players like Samsung or Chinese good value phones (include huawei) , they have no option but to use same android OS. I cannot resist to buy new iPad although I bought my 10 inch pro only a year ago .....\n\niPhone XS Max was in general most popular in Asia , and nevertheless of trade war , still iPhone is wanna be mobile phone in China and Asia just not anyone can afford it...\n\nThus , I have some confidence APPL should announce great result today , what do you think !?", "id": "9t7omd", "created_utc": 1541061399.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 48, "comments": [{"body": "CEOs looking bright is never a clue. Lisa Su of AMD was attending an F1 race three days before earnings and I thought wow everything must be going well.\n\nThen she shat on us a few days later. ", "score": 7, "replies": [{"body": "Yeh, good point ! But in fact , I felt a bit confidence from apple’s new fear pricing (iPad Pro & MacBook Air) and also their line up seems like they are not aiming good price , but aiming more and more premium price. If apple announce new iPad mini or iPad non pro line up like rumours (they had rumours in procurement industry) , I would say they are changing strategy because of revenue performance and I felt appl’s sales were good enough to support their current strategy (to premium product) ... just guess anyway couple hours to have APPL’s earning call and then everything should be clearer !", "score": 2, "replies": [{"body": "When is the earnings? Before the bell or after? ", "score": 1, "replies": [{"body": "It’s after trading hour today (1st Nov) ... i believe whatever result comes out , it should shake Nasdaq ....", "score": 1, "replies": [{"body": "OK. You confused me with the couple of hours though. ", "score": 1, "replies": [{"body": "Oops sorry , I’m in New Zealand so a bit far from UST ... technically , In fact it’s tmrw for me ! Lol", "score": 2, "replies": [{"body": "Quick give me market tips from the future", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I’m former sue lover and bag holder, and once I was in profit, I took the money and ran away from amd as fast as I possibly could lol. ", "score": 1, "replies": []}]}, {"body": "Seriously dont get why people are so into apple.. they sell a smartphone and tablets and their products are overpriced. Oh and by the way every other electronics manufacturer sells the same things.", "score": 3, "replies": [{"body": "They have one of the most loyal consumer bases there is that they can tap for pretty much anything. That, and they've successfully sold themselves as a luxury brand to boot. Their products tend to be better made than others as well. People who irrationally hate Apple have missed out on a lot of money over the years. ", "score": 3, "replies": [{"body": "Ok, \"better made\"... on what basis?", "score": 0, "replies": []}]}, {"body": "Yes I also think it’s expensive but people are buying it still and want to buy it.... like you can buy cherry motors (from China) which is minimum half or less the price of BMW but still people buys BMW and they want to have it ... ", "score": 1, "replies": [{"body": "Yeah but what I am trying to get at is WHY are they buying it? What does it really have that is an edge over the competitors? Does it's battery life last longer? Not according to this site\n\n&#x200B;\n\n[https://www.tomsguide.com/us/smartphones-best-battery-life,review-2857.html](https://www.tomsguide.com/us/smartphones-best-battery-life,review-2857.html)\n\n&#x200B;\n\nIt runs on iOS... ok so who gives a damn? iOS is nothing more than a RESTRICTIVE operating system meaning it is only unique to that one manufacturer and they control all the content. I agree that most people are sheep and they will continue to move in the direction everyone else moves in, but for me - fundamentally, apple doesnt have much to offer in terms of an innovative tech. company.", "score": -1, "replies": []}]}, {"body": "hahahahhahahhahhahhahahhah!!!! lloloololololololoololololololololoolol, hope that was a joke", "score": 1, "replies": [{"body": "Its actually not a joke haha", "score": 2, "replies": [{"body": "LOL.\n\nNext year Apple's non-iPhone/iPad sales will be over $80 billion.  Sure they only sell iPhones/iPads.  \n\n$80 billion in Watch, AirPod, Services, ect sales.\n\nFacebook last year only had $40 billion in sales, Google $110 billion.  So you really going to scoff at Apple's non-iPhone/iPad sales of $80 billion? LOL.\n\nPlus $60 billion of those sales are growing rapidly.  Airpods, Watch, and Services are growing 15-20% YoY.\n\nSo selling premium smartphones is a BAD thing?  LOL. Apple makes about 45% gross profit on iPhones with a $700-$800 averaging selling price.  How is that a bad thing? LOL.  \n\nSaying other electronic manufactueres sell phones too is like saying BMW is the same as Kia. LOL.", "score": 0, "replies": [{"body": "Yes, people will continually fall into the trap FOR SOME REASON? Maybe they are naive, maybe they like to waste money, etc. I am one of the people who buy a phone maybe every 6 years or so, once the last model is TRULY OUTDATED.\n\n&#x200B;\n\nWhat I am saying is FUNDAMENTALLY, they are really not doing anything groundbreaking or innovative that is deserving of the valuation. I do give them props for being the first company to make the smartphone, but now it is knocked off every way - and some which I think are better (a-la, expandable storage in the samsung models). ", "score": 0, "replies": [{"body": "LOL. Sorry bro but you are not a normal consumer.  Most will buy phones at least every 2 or 3 years.  Smart phones are extremely important for hundreds of millions.  People use their smartphones for EVERYTHING.  They use it for hours a day, every single day.  People are willing to spend $$$ because phones give a ton of utility.  For many their phones are mission critical for their job and life.  Paying a few pennies more a day for an iPhone that is reliable and easy to use it worth it.\n\nFundamentally they are doing something that no other company on the planet can match.  They are able to control the entire phone ownership experience.  Apple controls the hardware design, CPU design, GPU design, OS design, services stack, retail experience, and integration with their entire product line. No other company comes close to matching that.  Every Android maker is at the mercy of Google who controls the OS and builds the OS for their goals of maximizing advertising not user experience.  But Google is horrible at hardware design and retail customer service.  Also Google has ZERO control of the CPU and GPU design.  Apple is able to maximize performance and UI experience because they control the hardware, CPU, OS, retail experience and services.   No one is even close to being able to do that.  Every other competitor is missing at least 2 of those key components.\n\nThere is reason why iPhones are the choice of the riches and most educated people on the planet. In the $800+ range, Apple has about an 80% marketshare.\n\nYou can poo poo it all you want. But the fact speak louder than your opinions.", "score": 6, "replies": [{"body": "Many things you have stated are also opinions. The first smartphone I bought was an iphone 4 - I left the iphone because I thought it sucked. Their interface has absolutely nothing to offer over the competition, and in fact I feel it to be very clunky and slow compared to android. Also already mentioned the issue with controlling user content, hence why many owners feel the need to \"jailbreak\" their iphones. And to the largest mess - non-expandable storage. In the age of microSD cards, etc. why in the world would you not enable this feature? My wife still has a crap iphone and her number one complaint with it - lack of storage. Just the fact that they continually ignore this glaring flaw with their product is a testament to their ignorance.", "score": 0, "replies": [{"body": "LOL.  2007 is calling for its SD cards.  LOL.  \n\nexpanded memory is so old school. But keep living in 2007 while the rest of us are in the modern smartphone age.  There are so many reasons why expandable memory is such a horrible idea for smartphones.\n\nBut keep living in a dream world.\n\nThe consumer has spoken. They LOVE iPhones.  You hate from Apple won't change that, and you just missed out on MASSIVE GAINS in Apple stock the last 5+ years.", "score": 0, "replies": [{"body": "Ehhh thats fine apple will eventually fall under its own weight when everyone realizes they are a one trick pony. Now if they start to do some real innovation, maybe not.", "score": 0, "replies": [{"body": "people have been saying this for 20 years.......\n\nbut go ahead. Keep being wrong, while I enjoy my 2000% returns on my Apple stock. LOL.", "score": 3, "replies": [{"body": "What did I tell you about Apple?", "score": 1, "replies": []}]}, {"body": "put your money where your mouth is and short it.", "score": 1, "replies": [{"body": "Hell no cuz the sheep will keep following the herd", "score": 1, "replies": [{"body": ">Ehhh thats fine apple will eventually fall under its own weight when everyone realizes they are a one trick pony.\n\nlol. k.", "score": 1, "replies": [{"body": "Will take a bit longer, but like i said uf they dont innovate, they will fall. ", "score": 1, "replies": [{"body": "Which of apples competitors is innovating that is going to make them fall anytime soon?", "score": 1, "replies": [{"body": "Take a pick of consumer electronics companies. Samsung to name one.", "score": 1, "replies": [{"body": "Elaborate", "score": 1, "replies": [{"body": "[https://www.samsung.com/us/ssic/](https://www.samsung.com/us/ssic/)\n\n&#x200B;\n\nWow, business models that include more than smartphones!!! Eureka! LOL", "score": 1, "replies": [{"body": "[Samsung Q4 guidance shocks: Profit 18% less than the market expected](https://www.cnbc.com/2019/01/08/samsung-q4-guidance-.html)\n\n&#x200B;\n\nif samsung is so innovating, where are the gains?", "score": 1, "replies": [{"body": "Lol, did I ever tell you to invest in Samsung? I simply said that they had more compelling things going on", "score": 1, "replies": []}]}]}]}]}, {"body": "Apple... lmao", "score": 1, "replies": []}]}, {"body": "You can't really say Apple does not innovate.  That's just not a factual statement.  Their SoC's outperform the ones used in their Android counterparts and their smartwatches outperform their Android counterparts.  Just visit /r/android and you'll see people switching to iOS just because they want a watch that offers what Apple does and there is no other option available.  That doesn't happen without innovation.  ", "score": 1, "replies": []}]}]}]}, {"body": "What did I tell you about Apple?", "score": 1, "replies": []}]}, {"body": "aside from everything that u/streetsofrageTWO mentioned, he also didn't even bring up Apple's ***Ecosystem.*** \n\n&#x200B;\n\ni dont want to waste my time explaining this to you, but just watch this youtube video [by MKBHD on the Apple Ecosystem](https://www.youtube.com/watch?v=KB4_WIPE7vo)", "score": 1, "replies": [{"body": "What did I tell you about Apple?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Maybe if you invested in AAPL you could afford a phone more than every 6 years. BOOM ROASTED", "score": 3, "replies": [{"body": "Lol ... good one. Its not that I can't afford a new phone, its just there is really no significant updates from one version to the next to justify purchasing more frequently.", "score": 1, "replies": []}, {"body": "What did I tell you about Apple?", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "It's all about services growth now. I think we have reach peak phone demand so iPhone sales may be flat but Apple has pivoted from a hardware only company to a subscription based business. Yes, you still need to buy an iPhone but you don't have to upgrade every year for Apple to make money off of you now. Apple Music, Apple Pay, and iCloud should be the main revenue drivers going forward. Hopefully, they report strong earnings. If not, the whole market will crater", "score": 1, "replies": []}, {"body": "Apple will be the REAL $$$TRILLION$$$ Company if they deliver solid numbers today. ", "score": 1, "replies": []}, {"body": "AAPL will hit on earnings. Jobs report tomorrow will crush momentum. We end up back where we started. We all agree 2019 is the recession year. That is now less than 40 trading days away. NERVOUS", "score": 1, "replies": []}, {"body": "Sell calls before close or wait till the morning?", "score": 1, "replies": []}, {"body": "Is AAPL moving to China..?? I heard a rumor that the Chinese are giving AAPL tax free status..  What about GOOG..?? Are they moving as well..??", "score": 1, "replies": [{"body": "I heard that rumours but practically , APPL is iconic company in USA , it should not be able to focus on China only however in trading war , APPL’s position should be critical for T and X both. APPL makes most of product outsourced from China and also it has enough power to screw US stock market volatility ..... it’s just my guess but T cannot treat APPL as piece of shit (as even tariff exemption for their product) and X should know he needs to use APPL as leverage ....\n\nFrom my Chinese friend , I heard APPL’s fan base are still very solid ... it’s treated wannabe item ", "score": 1, "replies": []}]}]}
{"title": "The rally in global stocks continues for a third day with positive earnings results boosting sentiment as the US Midterm elections get closer", "selftext": " \n\n### US Stocks\n\n* The bounce back in global stocks continues for a second day as  positive earnings results boost investor sentiment as inch closer to the  US Midterm elections next week \n* US index futures are pointing to another positive day for US stocks  ahead of the NY open with the Dow Jones minis +0.51%, S&P500 minis  +0.45%, and Nasdaq 100 minis +0.43% \n* The current 2-day surge in the S&P500 is the biggest 2-day move since February 2018\n* **Apple (AAPL)** reports earnings today after the close -- investors will be closely following sales trends of the new suite of iPhones \n* The VIX is little changed this morning and is currently at 20.33 after closing at 21.23 yesterday\n* **Newscorp (NWSA)** November 16 OTM Puts, **SPY** November 16 OTM Puts, **IWM** December 31 OTM Puts and **XOP** March 2019 OTM Puts are the most actively traded options contracts today in the US pre-market\n* US 10-Year Treasury Bonds are lower with yields up 1.9 basis points to 3.1625%\n* The US Treasury 2s-10s Spread has widened 1.5 basis points to 0.29%\n* WTI Crude is currently down -1.31% to USD$65.31/bbl with the Brent-WTI spread up USD$0.81 to USD$8.18/bbl\n* Gold is currently up 0.74% to USD$1223.72/oz\n* Goldman Sachs reiterates its end of CY2018 price target of  USD$80/bbl for Brent as the investment bank believes demand growth will  continue to be resilient while US sanctions on Iran will impair global  supply levels – Goldman Sachs suggests OPEC is already operating with  low spare capacity and won’t be able to supplement lost production from  Iran \n\n### Stocks Trending in the News\n\nClick name for Q-Factor breakdown, latest price details, more financial info and sentiment data.\n\n* **BHP (BHP AU)**  will return a total of USD$10.4 billion to shareholders, the company  announced.  BHP will buy back USD$5.2 billion in shares starting this  month, buying shares off-market.  BHP will also return USD$5.2 as a  special dividend as well, to be paid later.  BHP reaped USD$10.8 billion  from sales of share assets and it is returning most to shareholders.   BHP  is rated “Neutral” In our Australia Large-Cap Global Top Stock  Ideas.\n* **Church & Dwight (CHD)**  reported 3Q EPS that beat expectations.  Church & Dwight 3Q EPS of  58 cents beat 54 cents expected.  Church & Dwight 3Q revenue of  USD$1.04 billion was above USD$1.02 billion expected.  Church &  Dwight affirmed full year EPS guidance of USD$2.28.  Church & Dwight  is rated “Top Buy” in both our US Large-Cap and US Consumer Staples  Global Top Stock Ideas.\n* **DowDupont (DWDP)**  reported 3Q adjusted EPS of 74 cents while 71 cents was consensus.   DowDupont reaffirmed its full year profit forecast.   DowDupont raised  its post-merger cost savings target to USD$3.6 billion, up USD$300mn.   DowDuPont is rated “Neutral” in our US Large-Cap Global Top Stock  Ideas.\n* **ING Groep (INGA NA)**  reported 3Q results that came above consensus.  ING Groep 3Q underlying  pretax profit of 2.12mn euros, compared with guidance of 1.91 billion  euros.  ING Groep net income of 776mn euros came well above 678mn  expected.  ING Groep is rated “Top Short” in our European Large-Cap  Global Top Stock Ideas.\n* **Novo Nordisk (NOVOB DC)**  reported 3Q results in line.  Novo Nordisk reported sales of 27.76  billion krona versus 27.78 krona expected.  Novo Nordisk increased sale  growth guidance to 0-1% growth up from -2-0% growth.  Novo Nordisk  expanded its share buyback program to 15 billion krona, up 1 billion  krona.  Novo Nordisk is rated “Attractive” in our European Large-Cap  Global Top Stock Ideas.\n* **Pfizer (PFE)** was  downgraded at BMO Capital Markets to market perform from outperform.   Pfizer’s price target was lowered to USD$46 from USD$47.  Pfizer is  rated “Attractive” in our US Large-Cap Global Top Stock Ideas.\n* **Royal Dutch Shell (RDSA LN)** reported  3Q results a touch below expectations.  Royal Dutch Shell reported CCS  earnings of USD$5.62 billion, below consensus of USD$ billion.  Royal  Dutch Shell generated USD$12.1 billion in free cash from operations,  above 11.2 billion expected.  Royal Dutch Shell said its next round of  projects has a breakeven price of only USD$40 for oil.  Royal Dutch  Shell is rated “Attractive” in both our European Large-Cap and United  Kingdom All-Cap Global Top Stock Ideas.\n* **Sumitomo (8053 JP)**  reported net income of 78.96 billion yen while consensus was 81.62  billion yen.  Sumitomo reported 3Q sales of 1.25 trillion yen.  Sumitomo  provided full year net income guidance of 320 billion yen.  Sumitomo is  rated “Neutral” in our Japan Large-Cap Global Top Stock Ideas.\n\n \n\n### European Stocks\n\n* **European stocks are advancing for a second straight day** with better than expected earnings results from large-cap stocks is booting investor sentiment \n* The Euro Stoxx 600 is currently up +0.75%, the FTSE 100 is higher  by +0.26%, the DAX has advanced +1%, and the CAC 40 has risen +0.41%\n* The Stoxx Europe 600 is now at its highest level in more than 2  weeks, though well below its high for October, which was hit on October  3rd \n* Investor sentiment for European stocks is positive with the advance/decline ratio for the Euro Stoxx 600 currently at 3.2x\n* Telecommunications (+2.56%), Travel & Leisure (+1.93%), and  Basic Resources (+1.56%) stocks are the top performers in the Euro Stoxx  600 today\n* Oil & Gas (-1.28%), Personal & Household Goods (+0.21%),  and Food & Beverage (+0.32%) stocks are the worst performers in the  Euro Stoxx 600 today\n* 54 stocks in the Euro Stoxx 600 are at 4-week highs while 13 stocks are at 4-week lows\n* 6 stocks in the Euro Stoxx 600 are overbought while 21 stocks are oversold according to the 16-day RSI Measure\n* VSTOXX, the European stocks equivalent of the VIX, is  moving down  this morning and is currently at 14.23 after closing at 20.3 yesterday\n* EUR€ is currently up +0.539% against the USD$ to 1.1373\n* GBP£ is currently up +0.846% against the USD$ to 1.2874\n* CHF is currently up +0.454% against the USD$ to 0.9962\n* German 10-Year Bunds are lower with yields up 2.6 basis points to 0.411%\n* UK 10-Year GILTs are lower with yields up 2.2 basis points to 1.459%\n\n### Asian Stocks\n\n* **Asian stocks, for the most part, finished positive in overnight trading** following signals from officials in Beijing that they plan on introducing new fiscal stimulus to jumpstart the Chinese economy \n* Japanese markets finished in the red following news that NTT Docomo  may launch mobile phone/data plans that are 20 to 40% below current  market rates – the new sparked as a sell-off as traders worries about  the impact to telecom industry’s profitability if it were about to enter  a “price war” for a prolonged period of time \n* The Nikkei 225 finished down 1.06%, the Hang Seng ended up +1.75%,  the Hang Seng China Enterprise up +1.39%, and the CSI 300 was +0.74%\n* Local traders remain skeptical about the recent rally in Chinese  and Hong Kong Stocks as the magnitude of earnings increases for global  stocks has decelerated and a rise in US treasury yields could cap gains\n* Investor sentiment for Japanese stocks finished negative with the advance/decline ratio for the Nikkei 225 closing at 0.97x\n* 4 stocks in the Nikkei 225 hit 4-week highs while 22 stocks reached 4-week lows\n* 0 stocks in the Nikkei 225 closed overbought while 14 stocks closed oversold according to the 16-day RSI Measure\n* Investor sentiment for Hong Kong stocks finished positive with the advance/decline ratio for the Hang Seng closing at 4x\n* 2 stocks in the Hang Seng hit 4-week highs while 7 stocks reached 4-week lows\n* 0 stocks in the Hang Seng closed overbought while 4 stocks closed oversold according to the 16-day RSI Measure\n* Japan 10-Year Government Bonds are higher with yields down -0.4 basis points to 0.123%\n* JGBs 2s-10s Spread has narrowed 0.4 basis points to 0.25%\n* JPY¥ is currently little changed against the USD$ at 112.99", "id": "9t8tfw", "created_utc": 1541074042.0, "score": 161, "upvote_ratio": 0.95, "num_comments": 47, "comments": [{"body": "It's a trap!", "score": 39, "replies": [{"body": "Sure is!", "score": 4, "replies": []}, {"body": "Seriously, lost all profit from 2018 and it it rebounded and y’all at happy \nLMFAO ", "score": 6, "replies": [{"body": "lol", "score": 2, "replies": []}, {"body": "That's because it's a buying opportunity.", "score": 3, "replies": [{"body": "Not quite yet, few more days, if it doesn't come crashing down and the institutional money starts pouring back in, then we're good to go. ", "score": 1, "replies": []}, {"body": "Lmao y’all stepping in a bear market \nGood luck scalping on the way down lol ", "score": -4, "replies": [{"body": "Bear market? Your inexperience is showing. How long have you been trading/investing?", "score": 3, "replies": [{"body": "Lol I said stepping into a bear market, meaning it’s just starting... \nlosing all your profits is def bullish lol", "score": -3, "replies": [{"body": "Why is everything \"lol\" or \"lmao\"? Where's the funny part? Maybe I don't understand your humor. You didn't answer my question about how long you've been trading/investing. Do you know a lot about bull/bear market cycles? Do you know about having a margin of safety in investing or value-based investing? Have you worked in the industry?\n\nI'm not convinced you know what you're talking about, frankly. Based on your opinion, it seems one should accumulate while the market is hot and selling when things are looking grim. That's the kind of conventional thinking that loses people money.", "score": 11, "replies": [{"body": "Lol it’s clearly buy the dips, sell the tips \nHaven’t you heard not to catch a falling knife? ", "score": 1, "replies": [{"body": "They must have not taught me that during my finance studies or during any of the time I worked at two hedge funds and a family office.\n\nQuestion for you. Let's take a security like MA, for example. Can you tell me fundamentally what has changed that has warranted a drop from $225 to $199? This is your time to shine.", "score": 3, "replies": [{"body": "Probably nothing changed fundamentally with MA \nPeople reallocate their assets into other asset classes possibly? ", "score": 4, "replies": [{"body": "> nothing changed fundamentally with MA\n\nThere you go. You said it. If the bottom line hasn't changed, why shouldn't I accumulate and add to a long position? Full disclosure, I added V today, but MA is also a solid company.\n\nCould the market sink further? Sure. I hope it does. You don't really want to do any buying until everyone else is panic selling. Dollar cost averaging.\n\nOne of the most simple, yet memorable things I've ever been told in the industry has been: \"buy wholesale, sell retail\". When everything is green and beautiful, you can bet funds are selling into that liquidity.\n\nAlso, most traders aren't keen on hedging their plays as well. A good hedge will save your ass in a volatile market.", "score": 2, "replies": [{"body": "I guess I just think the market is going to sink further, I wouldn’t assume new ATH for a while though, there could be a serious correction before an uptrend again \nDef doesn’t mean you can’t make money, short on the way down, if you get lucky you can buy the bottom and try to make a quick couple percents before next leg down but that’s risky \nIf you go long it’s probably gonna be a long time till profits but what do i know, just a guy looking from the outside with no formal education, just observing trends 🔮\nThis does seem like “wholesale” area though ", "score": 1, "replies": []}]}]}, {"body": "Not the OP, and don’t believe we are in a Bear market, but let me take a stab at it.\n\nIf we are indeed in a bear market, the fall in MA is totally warranted. After all they make money over people’s spending habits. In the time of recession people have less discretionary income, and thus spend less money (which is why Keynesian economy tries to trigger further spending). Considering the %4-7 less spending, it is normal to expect that to be reflected into the income of companies such as MA or V. In fact this would be eating out of their margins, since their cost is not shrinking at the same rate so it would be even bigger impact.\n\nTo keep it short, the people are pricing the risk. In case of a small chance of recession coming people take their position accordingly and unload portion of their portfolio that is heavily dependent on liquid markets.", "score": 1, "replies": []}]}]}, {"body": "I definitely agree that the bull run is coming to an end soon, but there’s certainly a years worth of runway or so left. 10-2 yield hasn’t flipped, but jobs are overheated, Fed is raising rates, and the tariffs are losing America money hand over fist. I’m still bullish tho. Up 10% as of this week on straddles and covered calls. ", "score": 0, "replies": [{"body": "Idk man I think people are pulling their money out and putting it elsewhere \nYou can def make money in a bear market but it’s hella easy to get rekt \nThis is where you short the shit out of everything ", "score": 3, "replies": [{"body": "I’m up on just about everything. I think you’re jumping the gun, but you do you", "score": 1, "replies": [{"body": "When did you enter market? ", "score": 1, "replies": [{"body": "Tail end of 15, but I sell covered weeklies mostly.  Hold relatively little in the market at any given time. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Because this whole market is fucked and it’s funny that the writing is on the wall and you think the market is about to recover \nRecession is imminent - fiat will disappear in ~ 5-10 years \nI’ve been trading for less than 5 years\nWhat’s there to know about bull/bear cycles? \nWhat would you like to talk about margins of safety? \nI’m generally curious what you think is gonna turn the market around? \nHigher interest rates perhaps? Lol", "score": -5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Those groceries will cost you five AMDs and one INTC please.  We don't accept cash.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Up is better than down.", "score": 1, "replies": [{"body": "Lmao 🙄", "score": 1, "replies": []}]}]}]}, {"body": "I read this in the Charles Schwab hold time news guys voice.", "score": 11, "replies": [{"body": "Call me crazy but every time I call Charles Schwab customer support that’s my favorite part. I listen to it intently.\n\nI also love CS support. So good.", "score": 5, "replies": [{"body": "I have a job where I call back office ops to all sorts of custodians; fidelity, wells fargo, the hundreds of small firms etc.  CS to this day - the best customer service and support out there, only runner up I've found is Voya and a close third with Fidelity.", "score": 5, "replies": [{"body": "I wonder if they have a live stream or podcast of that voice", "score": 2, "replies": []}]}]}, {"body": "I always do the same, glad it's not just me. ", "score": 2, "replies": []}]}, {"body": "defense stocks are currently in yeet mode\n\ni can dig it", "score": 9, "replies": [{"body": "They're definitely going to be volatile depending on what happens pre/post midterm.", "score": 1, "replies": [{"body": "considering theyve been volatile toward the core of the earth since the korean meetup, im thankful for the respite. i am invested in defense (and seriously wish i had more capital to throw at it now). however, im young, so this will be my first sort of election of sorts to experience. will be interesting", "score": 1, "replies": []}]}]}, {"body": "some rally - potus literally says talks with xi are positive and instead of a god damn bullet upward the sp barely budges. I think I actually heard the sound won wonnn in my head. ", "score": 10, "replies": [{"body": "Nobody should take anything that guy says at face value.", "score": 16, "replies": [{"body": "It's more like some kinda ass value...", "score": 1, "replies": []}]}]}, {"body": "You should be an Admin", "score": 2, "replies": []}, {"body": "Going up because it's been going down for so long. Just wait, next week dump town starts again, like it should because we are all overvalued. \n\n\n", "score": 0, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "How does the GOP rally the market and the Dems tank it. Serious question I don't know.", "score": 11, "replies": [{"body": "GOP policies are business friendly and Dem policies are not. Increasing regulations and taxes don’t help businesses grow.", "score": 2, "replies": [{"body": ">In the short term, I agree.  \n>  \n>  \n>  \n>In the long term, some (good) regulations lead to a healthier economy, and paying for our stuff (taxes) makes for stable and sustainable infrastructure.  \n\n&#x200B;", "score": 4, "replies": []}, {"body": "Ya if tanking the economy long run is good for business", "score": 0, "replies": [{"body": "Please, tell me how increase regulatory burden for businesses helps them? Trump cut *thousands* of regulations, and we are still here and the world hasn’t come crashing down. Not to mention the number of CEOs that have said deregulation and the tax cuts have helped spur the economy.  Jamie Dimon, who is rumored to be considering a presidential run and is currently CEO of JP Morgan agrees. Surely you and Maxine Waters know more than him, though.\n\nhttps://www.cnbc.com/2018/07/30/dimon-says-the-presidents-tax-cut-and-other-efforts-have-accelerated.html", "score": 2, "replies": []}]}]}]}, {"body": "The GOP keeps the Senate, Dems take the House.  Stocks go up a tiny bit.", "score": 1, "replies": []}]}, {"body": "got puts huh,", "score": 1, "replies": []}]}, {"body": "elastic aback shaggy six oatmeal rock boat bright ludicrous marry\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": []}]}
{"title": "AAPL ER Trade Suggestion", "selftext": "I'm sure there are people looking to play AAPL ER without just buying a vertical spread.  ATM Nov 2 call spreads are at least $1.35 from what I can see.  So how can you emulate a spread like this?  DIAGONALS THATS HOW.  Sell 215 11/2 call/buy 220 11/30 for .50 - .60 debit.  This play benefits off of iv crush affecting later dated options less while still being directionally bullish at half the cost.  HOWEVER, if the price rises or falls too much this play loses.  The further itm or otm you go the less the spread between the two matters.  Ideally we want a slightly positive ER to close tomorrow.  Alternatively if ER goes poorly you can let the closer dated call expire and then you just have AAPL long exposure until the end of the month for 50 bucks which isn't too bad of a deal.  If aapls price changes today you can do this with 220/225 strikes too.  Puts can be used for my bear gang bois.\n\nRecommended exit is 25-50% debit paid.", "id": "9tad1x", "created_utc": 1541085690.0, "score": 12, "upvote_ratio": 0.74, "num_comments": 47, "comments": [{"body": "Don’t touch Apple and day trade while riding the wave tomorrow.", "score": 42, "replies": [{"body": "That comment should be top comment. Have an upvote.", "score": 5, "replies": []}]}, {"body": "It's too late\n\nAlready balls deep in calls I should have cashed out when I was up 40% over a month ago", "score": 12, "replies": [{"body": "F", "score": 10, "replies": []}, {"body": "Calls are the only way to go. Have you seen the new iPad Pro? It's faster than any laptop ever made. GPU is better than Xbox one. \n\n\nI've spent over 3k on apple products in the last 3 months. Long AAPL", "score": 8, "replies": [{"body": "Nice DD, I'm all in", "score": 21, "replies": []}, {"body": "Faster than any laptop ever made?  What?", "score": 5, "replies": []}, {"body": "> It's faster than any laptop ever made.\n\nLol no it's not.  Whatever gave you that idea?", "score": 7, "replies": []}, {"body": "Faster than any laptop ever made...\n\nOn what parameter? Literally any gaming laptop or high end productivity laptop is going to be significantly better. Not to mention it's speed is part thanks to the fact it's running a mobile operating system. Put those specs on windows and it's going to be subpar at best.", "score": 5, "replies": []}]}, {"body": "F", "score": 1, "replies": []}, {"body": "just get out now if you can... they're gona scrutinize the shit out of this even if it's a good report", "score": 1, "replies": []}]}, {"body": "[Click Here to Vote to Remove this Submission](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=9tad1x&message=9tad1x) if it breaks the rules, is spam, or ought to be a comment in the Daily Discussion thread.\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=9tad1x)\n___\n ^comment ^will ^disappear ^--- ^27 ^shitposts ^removed ^this ^session ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 5, "replies": []}, {"body": "Best play here is  to buy the dip after earnings and go long", "score": 4, "replies": [{"body": "Think it'll tank then?", "score": 1, "replies": [{"body": "yes, because of the weather ahead and they need to lower Apple so more people buy in. either way, it will drop and then towards Christmas really pickup. Watch.", "score": 5, "replies": []}, {"body": "so I have enough for 1 more Appl put. Should I buy a 11/2 $209 put today?", "score": 2, "replies": [{"body": "Did you??", "score": 1, "replies": [{"body": "I did a 207.5 11/2", "score": 1, "replies": [{"body": "Jesus that’s ballsy gj", "score": 1, "replies": [{"body": "Let's not count the money yet. We have to see how tomorrow plays out. \n\nGood earnings, but wont disclose revenue and sales. Bearish sentiment. \nNo longer 1 Tril market cap. \n1/6th of Dow cap. \n\nwe'll see. I swear this market is against me. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "sell puts", "score": 0, "replies": []}]}, {"body": "never done a diagonal before, I don't really \"get\" them\n\ndon't like this play for such an important ER, either way ", "score": 2, "replies": [{"body": "I'm open to being critiqued but you just said you don't understand them so how can you know if you don't like them?", "score": 6, "replies": [{"body": "i don't know if I like them (in general)\n\nbut for such a crucial ER I wouldn't risk a play that doesn't like severe price movement, be it diagonal or anything else \n\nwhy not just do a butterfly if you think it won't move much? ", "score": 2, "replies": [{"body": "I could also do an iron condor but I was trying to find a lower cost/risk on AAPL.  It looks like butterflies are super cheap but I've never had good luck with the window of profit on those bad boys.", "score": 1, "replies": [{"body": "maybe try a broken wing butterfly then, it's similar to a vertical except you can hit that sweet spot for extra profit if price stays relatively neutral\n\nidk I'd prefer something like that I think but like I said I don't really understand diagonals too well, gona read up on them a bit since I hear WSB talk about them a lot ", "score": 1, "replies": [{"body": "Diag are a Vega play on top of direction ", "score": 2, "replies": [{"body": "so they're typically only worth it when you expect a large change in IV? ", "score": 1, "replies": [{"body": "Can be long or short Vega depends on the legs...", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "apple goin to the moon\n\nTO THE FUCKING MOON", "score": 2, "replies": []}, {"body": "I V C R U S H will take this trade under water tomorrow morning..", "score": 1, "replies": [{"body": "No.  The larger than expected move will hurt this trade.  Iv crush is actually good for this trade.", "score": 1, "replies": [{"body": "This trade has net positive Vega. So, a drop in vol means the long term option lose more value than the short strike.\nedit: all software calcs are done with constant IV assumption. So, P/L diagrams are not really that useful for diagonals and calendars. \n", "score": 1, "replies": [{"body": "True but close dated calls iv is crazy high(120% or something like that) as compared to the 60% in the further dated option.  So there will be an iv crush but not nearly as much as the one expiring tomorrow.  Or am I viewing this incorrectly?  I more or less expect the iv crush to be more substantial than the back dated options Vega.", "score": 1, "replies": [{"body": "Vega values for long term options are higher (like 2 to 3 times higher) than the short term options. So for every 1% drop in IV, the long term option loses more than the short term options. \n\nEven if you assume that the vol crush for long term strike is only half of the short term strike, there is not much to gain from the IV drop.\n \n", "score": 1, "replies": [{"body": "Iv crush on the front dated option was 3x more than the backdated this morning.  11/2 iv 120 to 20ish.  11/30 went from 60 to 28.   11/30 Vega wasn’t more than triple and so this gained from iv crush.", "score": 1, "replies": []}, {"body": "Trade is currently trading at 2.82 debit as compared to entry of .6.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This trade has net positive Vega. So, a drop in vol means the long term option lose more value than the short strike.", "score": 1, "replies": []}, {"body": "Not a fan of that trade, you generally should make the long and short legs wider. Also, you are putting up $500 to initiate the trade, you might as well right a far otm vertical put spread for a little more in credit. Its highly unlikely apple is going to go down by more than 5%.", "score": 1, "replies": [{"body": "How wide do you want the legs?  I assumed 5.00 for a one day trade seemed fine but the collateral is the restriction.  Wouldnt your credit spread be a similar play to mine with higher risk?  This was meant to be a cheaper play on a generally more expensive stock.  I've had ok luck with calendars on earnings due to iv crush but you would benefit similarly.", "score": 1, "replies": [{"body": "youre gonna want more like 5-10% wide on a critical earnings event like this one", "score": 3, "replies": []}, {"body": "Ideally I would also consider dropping one of the long legs if this was in a margin account. It increases the probability of profit. Anyway, try something like this:\n\nStrike|Exp|Amount|Cost\n---|---|---|---\n$210p|11/16|1|$430\n$220p|11/02|-1|$550\n$220c|11/02|-1|$530\n$230c|11/16|1|$315\n\n- Net credit: $360\n\n\n\n\n\n", "score": 3, "replies": [{"body": "interested in this spread... when would your exit be?", "score": 1, "replies": [{"body": "Whole position at open if the price movement is $2 or less. On a bigger move, I'd look at rolling to 11/16 and adding more money to the trade to defend the position.", "score": 1, "replies": []}]}]}]}, {"body": "Hehe", "score": 1, "replies": [{"body": "XD, things didn't turn out all that well, but futures up almost a whole percent. This thing is going to regain some of the lost ground tomorrow.", "score": 1, "replies": []}]}]}]}
{"title": "$SBUX Reports Q4 adj EPS 62c, cons 60c; Sees FY19 adj EPS $2.61-$2.66, consensus $2.64; Reports active Rewards membership in U.S. up 15%", "selftext": "Currently up 7%. \n\nBiggest pop I've seen from this shit stock in 3 years.\n\nbagholders rejoice", "id": "9td1vm", "created_utc": 1541103366.0, "score": 39, "upvote_ratio": 0.94, "num_comments": 40, "comments": [{"body": "Welp Daddy Ackman just made about 1\n$100,000,000 in 45 seconds", "score": 24, "replies": [{"body": "Jesus fuck the market really is fucked when Ackman is back in the game and Left is riding Elon's cock to Mars.", "score": 10, "replies": [{"body": "I wonder if he had insiders. He switched a day before tesla made a real profit", "score": 2, "replies": []}]}, {"body": "I'm still mad about VRX", "score": 8, "replies": []}]}, {"body": "Never bet against white girls. ", "score": 33, "replies": [{"body": "New strategy: 25% Starbs, 25% Ulta and 50% Lulu. \n\n", "score": 30, "replies": [{"body": "Anyone who calls it starbs is a basic white girl ", "score": 10, "replies": [{"body": "I’m not gay u r", "score": 8, "replies": []}]}]}, {"body": "AAPL tho", "score": 5, "replies": []}]}, {"body": "I feel sick. I sold before earnings. Like my hearts beating really fast and I feel like hot flashes. My body is actually tingling from how sick I feel. ", "score": 15, "replies": [{"body": "Thank you for your sacrifice. You are now being asked to go back to /r/TwoXChromosomes ", "score": 37, "replies": [{"body": "Lol that’s good. Thank you", "score": 4, "replies": []}]}, {"body": "I bought puts just before the earnings. 💓 💓", "score": 9, "replies": [{"body": "I bought Starbucks calls st open 59.5c held\n\nAMD 19-21 calls at Open \n\nSold my AAPL calls at EOD and bought 212.5 puts \n\n\nThis is my best day trading ever. Should probably just quit ", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Believe that! ", "score": 3, "replies": []}]}]}, {"body": "No one told me REEEEEEEEE", "score": 4, "replies": []}, {"body": "spent my loose change on some $60 fd calls yesterday since they were so cheap. I finally did something right..", "score": 4, "replies": [{"body": "great here comes imminent drop ", "score": 3, "replies": []}]}, {"body": "Nice. I liked Ackman's presentation so I bought some shares. Just a handful so I didn't make a ton, but still feels good after the past few weeks", "score": 3, "replies": [{"body": "All you need to know is the Chinese are getting hooked on coffee and it will be huge there. Opium wars 2.0", "score": 5, "replies": []}]}, {"body": "I only bought 2 62.5s.... ripppp", "score": 2, "replies": []}, {"body": "I just sold my January $60 calls.. FML ", "score": 2, "replies": []}, {"body": "I sold all my 57.5 earlier this week for 200% gains. Shit they would’ve been 2000% now. I got them under $1. ahhhhhhhhhh", "score": 2, "replies": [{"body": "> I sold all my 57.5 earlier this week for 200% gains\n\nLooking back on a W and framing it as a L isn't giving yourself credit. The true secret to long-term gainz.  ", "score": 7, "replies": [{"body": "Perspective, much needed", "score": 1, "replies": []}]}, {"body": "It’s all good man. 9/10 if you would of held for the potential 2000% gains you would of lost. 200% is great. ", "score": 3, "replies": [{"body": "You are probably right, it'll be alright", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks fren", "score": 2, "replies": []}]}]}, {"body": "I probably spend $1500 a year on Starbucks between myself and SO, so I have no goddamn clue why I didn’t load up on calls", "score": 2, "replies": []}, {"body": "The premium on the options were dirt cheap.", "score": 3, "replies": [{"body": "Yeah cause the stock hasn't moved since Nam", "score": 11, "replies": [{"body": "Viet. Fucking.  Nam. ", "score": 2, "replies": []}]}]}, {"body": "Been bag holding 184 11/2 61.5 calls @.45 and 100 1/18/19 65 calls @ .37. I'll definitely get the fist tomorrow.", "score": 1, "replies": []}, {"body": "Picked up 5 Nov 16 $60 calls for cheap a few days ago.  This could be good.\n", "score": 1, "replies": [{"body": "Same exact play. We gonna be eating good tomorrow", "score": 2, "replies": [{"body": "I dip my tendie to you Sir.\n\n", "score": 1, "replies": []}]}]}, {"body": "I bought shares at close. I feel happy.", "score": 1, "replies": []}, {"body": "I got 1 call for 60.5, i also got 13 buys of pandora calls and 3 buys of go pro calls so its been better days, considering im down over 90% all time lol just need stx to not die", "score": 1, "replies": []}]}
