{"title": "BP installs Tesla made battery to store wind and solar", "selftext": "", "id": "9x0gt3", "created_utc": 1542205004.0, "score": 39, "upvote_ratio": 0.91, "num_comments": 48, "comments": [{"body": "Top comment (emphasis mine):\n\n>**This good but small scale, like the batteries of 9 Tesla model S... or about 50 houses for 4h.** we need many hundreds of Megawatts-hour to get grid reliability that will allow to dismantle the coal burning power plants.", "score": 0, "replies": [{"body": "Yep, fairly meaningless as a single revenue item.", "score": 2, "replies": []}, {"body": "Its an indicator that the demand is there, but batteries are not. Once they deploy more gigafactories they will be essentially a money printing machine with no limits to profitability. ", "score": 4, "replies": [{"body": "Is Tesla going to start making the battery cells?", "score": 1, "replies": [{"body": "Moving the comment reply up here so everyone can see all the wrong things you either said or clearly implied.\n\n&#x200B;\n\n1.  \"[Battery cells are not a raw material.](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9r7c48) \" - You were wrong. Battery cells are a raw material in both Tesla Energy Products and their cars. [Raw materials are materials or substances used in the primary production or manufacturing of goods.](https://www.investopedia.com/terms/r/rawmaterials.asp) Panasonic Battery cells are used in the the manufacturing of Tesla power walls.\n2.  \"[Primary material is unmanufactured.](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9s3sn8)\" - You were wrong. Primary Materials can be manufactured like fabrics, plastics, lumber, batteries, or chairs. It's essentially just another word for raw materials.\n3.  \"[Car seats are raw material. Sure](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9s58sg)\"  - To be clear, this comment was sarcastic. This is only apparent when viewed in context. At no point prior to this comment did I mention car seats. It was a reply to me saying \" Primary material is just material not produced or manufactured by the company making the product. \" Your implementation was of course wrong. Car seats can certainly be Raw Materials. Its an interesting example because for some of Tesla's cars they are Raw materials and for others they are not. Before October 2017 Tesla [purchased their car seats](https://www.bizjournals.com/sanjose/news/2017/10/27/tesla-model-3-production-delays-tsla.html) from a different company, but after being angry with the firms quality Tesla decided to build the seats themselves. Seats purchased for their cars were raw materials. The seat Tesla built for their cars were not raw materials, but composed of raw materials (Manufactured fabrics / manufactured faux leather). \n4. \" [tell me why Tesla holds a competitive advantage for selling batteries](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9ske42) \" -  To be clear, Tesla doesn't sell batteries (battery cells) they sell battery packs and systems. They have tons of competitive advantages though. Tesla's partnership with Panasonic has Tesla Engineers working hand and hand with Panasonic engineers to produce the best cells on the market. They have the lowest $/Kwh. Of course the cells are only a piece of the puzzle Tesla's expertise in controlling the charge and safety systems also make their product leaps and bounds ahead of the competition, especially when combined with their drive train technology (also drastically ahead of the competition). \n5. [\"  Tesla puts them in a box. Much processing, wow.\"](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9uxti1)\\- As I said above, Tesla's energy products are not just cells in a box. Tesla designs their powerwalls and energy storage systems with advanced cooling and venting technology. This includes systems to regulate charge and discharge rates for near instant response to needs, and [advanced  safety systems prevent large fires](https://electrek.co/2016/12/19/tesla-fire-powerpack-test-safety/). Other smart home technology and energy inverters are also part of their final products that you evidently chose to ignore. If you just put the cells in a box you would be likely to burn down your house.\n6. [\" Where's the \\*privatization\\* \"](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9v9hud) \\-  Even Elon Musk himself said he was only [considering](https://twitter.com/elonmusk/status/1026872652290379776?lang=en) going private. It was always [contingent on shareholders](https://www.nbcnews.com/tech/tech-news/elon-musk-tweets-he-s-considering-taking-tesla-private-n898366) and ultimately the [shareholders/major investors were against it](https://observer.com/2018/08/elon-musk-ditched-tesla-go-private-plan-not-about-money/). Ultimately I was right. \n\nThe main takeaway is that you are wrong. Again.", "score": 1, "replies": [{"body": "My car is raw material to my household.\n\n>Even Elon Musk himself said he was only considering going private. It was always contingent on shareholders and ultimately the shareholders/major investors were against it. \n\nWhere's the shareholder vote?\n\nWhere's the funding?\n\nYou are raw material for this subreddit, btw.", "score": 0, "replies": [{"body": "He went around visiting all the major investors and shareholders to get their input and feedback. That’s the first part of the vote. Just like he said. Just as expected. \n\nFunding was secured at the time of tweet in the SA PIF per the SEC investigation. Better, more diluted funding was secured after that with assistance from GS and SilverLake. \n\nI mean, if the sub is reddits product and our time is an indirect raw material used to produce it then yes I suppose we are all a raw material in the most liberal use of the term. \n\nLet’s not forget all the other things you were wrong about too and how you don’t know what a raw material is. You essentially loose all credibility after you admitted to that. For anyone else reading see below for references to some of his incorrect statements and misinformation that he tried to spread: \n\n\n\n&#x200B;\n\n1.  \"[Battery cells are not a raw material.](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9r7c48) \" - You were wrong. Battery cells are a raw material in both Tesla Energy Products and their cars. [Raw materials are materials or substances used in the primary production or manufacturing of goods.](https://www.investopedia.com/terms/r/rawmaterials.asp) Panasonic Battery cells are used in the the manufacturing of Tesla power walls.\n2.  \"[Primary material is unmanufactured.](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9s3sn8)\" - You were wrong. Primary Materials can be manufactured like fabrics, plastics, lumber, batteries, or chairs. It's essentially just another word for raw materials.\n3.  \"[Car seats are raw material. Sure](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9s58sg)\"  - To be clear, this comment was sarcastic. This is only apparent when viewed in context. At no point prior to this comment did I mention car seats. It was a reply to me saying \" Primary material is just material not produced or manufactured by the company making the product. \" Your implementation was of course wrong. Car seats can certainly be Raw Materials. Its an interesting example because for some of Tesla's cars they are Raw materials and for others they are not. Before October 2017 Tesla [purchased their car seats](https://www.bizjournals.com/sanjose/news/2017/10/27/tesla-model-3-production-delays-tsla.html) from a different company, but after being angry with the firms quality Tesla decided to build the seats themselves. Seats purchased for their cars were raw materials. The seat Tesla built for their cars were not raw materials, but composed of raw materials (Manufactured fabrics / manufactured faux leather). \n4. \" [tell me why Tesla holds a competitive advantage for selling batteries](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9ske42) \" -  To be clear, Tesla doesn't sell batteries (battery cells) they sell battery packs and systems. They have tons of competitive advantages though. Tesla's partnership with Panasonic has Tesla Engineers working hand and hand with Panasonic engineers to produce the best cells on the market. They have the lowest $/Kwh. Of course the cells are only a piece of the puzzle Tesla's expertise in controlling the charge and safety systems also make their product leaps and bounds ahead of the competition, especially when combined with their drive train technology (also drastically ahead of the competition). \n5. [\"  Tesla puts them in a box. Much processing, wow.\"](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9uxti1)\\- As I said above, Tesla's energy products are not just cells in a box. Tesla designs their powerwalls and energy storage systems with advanced cooling and venting technology. This includes systems to regulate charge and discharge rates for near instant response to needs, and [advanced  safety systems prevent large fires](https://electrek.co/2016/12/19/tesla-fire-powerpack-test-safety/). Other smart home technology and energy inverters are also part of their final products that you evidently chose to ignore. If you just put the cells in a box you would be likely to burn down your house.\n6. [\" Where's the \\*privatization\\* \"](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9v9hud) \\-  Even Elon Musk himself said he was only [considering](https://twitter.com/elonmusk/status/1026872652290379776?lang=en) going private. It was always [contingent on shareholders](https://www.nbcnews.com/tech/tech-news/elon-musk-tweets-he-s-considering-taking-tesla-private-n898366) and ultimately the [shareholders/major investors were against it](https://observer.com/2018/08/elon-musk-ditched-tesla-go-private-plan-not-about-money/). Ultimately I was right. \n\nThe main takeaway is that you are wrong. Again.", "score": 1, "replies": [{"body": ">He went around visiting all the major investors and shareholders to get their input and feedback. That’s the first part of the vote. \n\nIt is not. A shareholder vote involves every available shareholder at an organised meeting. You are flatly wrong.\n\n>Funding was secured at the time of tweet in the SA PIF per the SEC investigation. \n\nThe SEC literally did not say that funding was secured. They charged Musk with securities fraud **because** funding was not secured. You are, again, flatly wrong.\n\n>Better, more diluted funding was secured after that with assistance from GS and SilverLake.\n\nThat was a presentation being given on how funding *might* be secured. Nobody ever confirmed their interest in participating, and one of the named sources denied it completely. You are, again, completely and totally wrong.", "score": 1, "replies": [{"body": "\"It is not \\[a shareholder vote\\]\" - It isn't a typical formal shareholder vote, but it doesn't have to be to cancel it. He never said that all the shareholders would need to vote before the deal was canceled. His actual exact words we \"\\*A\\* shareholder vote\", but once enough of the major players and investors say they don't want to go through with it a full vote becomes unnecessary because Elon Musk already knows what the result is. There is no point in presenting a motion to go private to all the shareholders if the major shareholders and investors already told you in person that they don't what you to go through with it. He kept his word. Honest to a fault, when enough of the shareholders/major investors told them they didn't want it to happen he put a stop to it. Essentially, no matter how you look at it you're wrong.\n\n&#x200B;\n\n\" The SEC literally did not say that funding was secured. \" - I never said they literally said that. The SEC \\*literally\\* released information showing that the PIF offered to [\"take Tesla private\"](https://www.reuters.com/article/us-tesla-musk-factbox/factbox-funding-secured-sec-gives-timeline-surrounding-tweet-from-teslas-musk-idUSKCN1M8139) at a reasonable price. Funding Secured.  The SEC literally failed to get a guilty verdict. Again I'm flatly right. \n\n\" That was a presentation being given on how funding *might* be secured. \" - False. It was a presentation on how the company could go private. SilverLakes presentation was specifically on how [They were confident it could be done.](https://www.nytimes.com/2018/08/25/business/elon-musk-tesla-private.html) Every dollar that the SA PIF didn't have to fund is better funding.  [' the majority of shareholders I spoke to said they would remain with Tesla if we went private\"](https://www.nytimes.com/2018/08/24/business/elon-musk-tesla-public.html) that is better funding. If you want to assume that he couldn't get a verbal agreement of a single additional dollar then I'll add it to my list of ridiculously incorrect things you believe. \n\n&#x200B;\n\nAgain you were completely and totally wrong. Here is a [link to the list of examples](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9vyjvb) of you saying other wrong things in this thread with references and reasons to why you were wrong. The best is of course that you don't know what a raw material is.\n\n&#x200B;", "score": 1, "replies": [{"body": ">He never said that all the shareholders would need to vote before the deal was canceled. His actual exact words we \"*A* shareholder vote\", but once enough of the major players and investors say they don't want to go through with it a full vote becomes unnecessary because Elon Musk already knows what the result is.\n\nPlease, write more about how you're wrong.\n\n>The SEC *literally* released information showing that the PIF offered to \"take Tesla private\" at a reasonable price. Funding Secured.\n\nHow much of the company would the PIF be buying? Musk doesn't know, at that point. Funding speculative. You are 100% wrong.\n\n>False. It was a presentation on how the company could go private. SilverLakes presentation was specifically on how They were confident it could be done. \n\nFunding speculative. Thank you for admitting that you were wrong.", "score": 0, "replies": [{"body": "\"Please write more about how you're wrong\" -  \"It is a shareholder vote at I pointed out. A shareholder voted.  Elon did it in the most cost effective way possible. Stopped when [enough](https://www.investopedia.com/terms/v/votingright.asp) \"No\" votes were cast. As always, you were wrong.\n\n\" How much of the company would the PIF be buying? \" - The company.\n\n&#x200B;\n\n\"  Musk doesn't know, at that point.  \" - Musk didn't know what they ultimately will end up buying only because he intended to dilute their offer with other investors. Musk did know how much they offered to buy though. They offered to take the company private. Not a part of the company. The company. [In their own words.](https://www.reuters.com/article/us-tesla-musk-factbox/factbox-funding-secured-sec-gives-timeline-surrounding-tweet-from-teslas-musk-idUSKCN1M8139) You are 100% wrong. As always.\n\n&#x200B;\n\n\" Funding speculative. \" - False. Funding was always secured in the form of the Saudi PIF.\n\n&#x200B;\n\n\" Thank you for admitting that you were wrong. \" - False. You have no evidence. No argument. No logic. As always, you were 100% wrong.\n\nNot surprising considering **you don't even know what a raw material is**. For a quick list of recent examples with cited evidence of how u/allIhavelearned is wrong [Click Here.](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9vyjvb)\n\n&#x200B;\n\n&#x200B;", "score": 1, "replies": [{"body": ">Musk did know how much they offered to buy though.\n\nHe told the SEC that he had no information on how much of the company the PIF was offering to buy. You are explicitly contradicted by Musk.\n\n>\"It is a shareholder vote at I pointed out.\n\nAn informal poll is not a shareholder vote. Continue being visibly and totally wrong, please.\n\n>Funding was always secured in the form of the Saudi PIF.\n\nIt was never secured. They offered to begin preliminary negotiations, nothing more. You are *so* laughably wrong.\n\n>False. You have no evidence. No argument. No logic.\n\nYou don't understand what any of those words mean.", "score": 0, "replies": [{"body": " \"He told the SEC that he had no information on how much of the company the PIF was offering to buy.  \" - Thats false. Adding it to the list of things that you said that were not true and flat out wrong. The SEC didn't question Elon on \"how much of the company the PIF was willing to buy\" and they specifically call out that the PIF said they wanted to [take Tesla private](https://www.sec.gov/litigation/complaints/2018/comp-pr2018-219.pdf) in their complaint. As always, You're wrong. \n\n\" An informal poll is not a shareholder vote. Continue being visibly and totally wrong, please. \" - False a shareholder vote is a shareholder vote.  You couldn't be more obviously wrong. If the main shareholders voted no then there is no need to go any further. Again Elon Musk was true to his word. It's just sad that you are completely incapable of realizing how weak you entire stance is. It must hurt finding out all of you views on Tesla are completely wrong all the time.\n\n\" It was never secured. \" - False. It was secured when the PIF offered to take the company private. Funding was secured. You're wrong as always.\n\n\" They offered to begin preliminary negotiations, nothing more. \" - They offered to take the company private. Funding secured. As always. You arguments are completely nonexistent.  The SEC failed to get a guilty verdict. The only thing laughable is you complete lack of any argument. What a joke. You have demonstrated once again that you have no understanding of business at all.  Not surprising considering **you don't even know what a raw material is**. For a quick list of recent examples with cited evidence of how [u/allIhavelearned](https://www.reddit.com/u/allIhavelearned) is wrong [Click Here.](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9vyjvb) \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;", "score": 1, "replies": [{"body": ">The SEC didn't question Elon on \"how much of the company the PIF was willing to buy\" and they specifically call out that the PIF said they wanted to take Tesla private in their complaint. \n\nYou know how I know you didn't read the complaint?\n\n\n>The July 31 meeting lacked discussion of even the most fundamental terms of a \nproposed going-private transaction. For example, there was no discussion at the July 31 meeting \nof **(1) any dollar amount or specific ownership percentage for the Fund’s investment in a going-\nprivate transaction;** (2) any acquisition premium to be offered to current Tesla shareholders; (3) \nany restrictions on foreign ownership of a significant stake in Tesla; (4) the Fund’s available \nliquid capital; (5) whether the Fund had any past experience participating in a going-private transaction; (6) any regulatory hurdles to completion of a going-private transaction; or (7) the \nboard approval process necessary to take Tesla private. Musk has acknowledged that the July 31 \nmeeting was the most specific discussion of a transaction to take Tesla private between him and \nrepresentatives of the Fund. \n\n>22\\. According to Musk, at the close of the July 31 meeting, the lead representative of \nthe Fund asked Musk to tell the Fund how he wanted to do a going-private transaction and \nrepresented that so long as the terms were “reasonable,” the Fund would be fine with them. \nMusk acknowledged that no specific deal terms had been established at the meeting and that \nthere was no discussion of what would or would not be considered reasonable. Nothing was \nexchanged in writing, and there was no discussion of confidentiality. Musk did not communicate \nwith representatives of the Fund again about a going-private transaction until August 10, three \ndays after his August 7 statements.\n\nNext:\n\n>False a shareholder vote is a shareholder vote. \n\nYes, a shareholder vote *is* a shareholder vote.\n\nTalking to a few investors is not a shareholder vote.\n\nThis is very simple.\n\n>It was secured when the PIF offered to take the company private. \n\nSee above. You are no less wrong than you always are.\n\n>The SEC failed to get a guilty verdict.\n\nBecause they didn't take it to trial, because while the securities fraud was astonishingly blatant, it also didn't matter that much in the grand scheme of things.\n\nWhy didn't Musk take it to trial? Why'd he set forty million dollars on fire and agree to never deny that he committed securities fraud?\n\nBecause he knows he'd lose.", "score": 1, "replies": [{"body": "LOL thats absolutely adorable! You thought that their interpretation of the fact was an actual question they asked Musk! I'm literally laughing so hard right now! You know how I know you never went to law school? \n\nI added it to the list. Thats just too funny. u/allIHaveLearned said, \" He told the SEC that he had no information on how much of the company the PIF was offering to buy. You are explicitly contradicted by Musk. \" **then shares THEIR INTERPRETATION of Musk saying the opposite!** Wow that's hilarious! A breakdown below for people who want evidence even though its so obvious how wrong you are.\n\n&#x200B;\n\nLet me make this really really simple for you. The sentence that starts with \"**According to Musk**\" was what Musk said. That happens to be Section 19. **The Section you left out.** The one with the SECs incorrect assumptions that forced them to offer a settlement is their **interpretation of said facts**. They aren't even remotely true.\n\nNot only did they discuss any dollar amount the PIF offered to buy it a any reasonable price. You posted it right there. \\[  **so long as the terms were “reasonable,” the Fund would be fine with them**.\\] Done that's a discussion of price. Musk asked how much. Saudis said just make it reasonable. A lawyer for the SEC might try to argue that they technically didn't say a specific dollar amount, but thats just them trying to get out of their lie. A reasonable price literally falls under the definition of \"any dollar amount\"\n\nNot only did they discuss percentages the PIF offered to buy the whole company.  \\[19. According to Musk, at the meeting the Fund’s lead representative told Musk that the Fund had recently acquired almost five percent of Tesla’s common stock on the open market, expressed interest in **taking Tesla private**.....\\] Notice how they said they wanted to take Tesla private and not that they wanted to have a percentage? 100% is still a percentage. A lawyer for the SEC might try to argue that they technically didn't say 100%, but that is just the SEC trying to get out of their own lies. \n\n&#x200B;\n\n\" Talking to a few investors is not a shareholder vote. \" He didn't just talk to them. Do I need to spell it out for you again? This really isn't that hard.\n\n&#x200B;\n\n\" Because they didn't take it to trial, because while the securities fraud was astonishingly blatant, it also didn't matter that much in the grand scheme of things. \" - False, Musk never committed securities fraud as the complaint shows. Funding was secured the whole time in the SA PIF.\n\n&#x200B;\n\n\" Why didn't Musk take it to trial? Why'd he set forty million dollars on fire and agree to never deny that he committed securities fraud? \" - The PIF said to the judge that they were worried they would loose. Tesla said it was only because trials are bad for investors and are often very long and time consuming. Musk can take it to trial at a later date when Tesla is in a better position essentially whenever he wants. $40M is a drop in the bucket and a slap on the wrist.\n\n&#x200B;", "score": 1, "replies": [{"body": "I don't even need to respond to any of this. Good work demonstrating you can't understand basic financial or legal matters.", "score": 0, "replies": [{"body": "Lol as always no argument. What a joke. Hold on, let me get all the links where you admit to not knowing what guilty means or what CapEx is or what a raw material is. Shouldn’t take me too long. The amount you don’t know about financial or legal matters is staggering. ", "score": 1, "replies": [{"body": "Good luck with that, buddy.\n\n>Hold on, let me get all the links where you admit to not knowing what guilty means \n\nYou mean yourself, right? I had to keep showing you the dictionary definition.", "score": 1, "replies": [{"body": "No need. You did all the work for me. I don’t do it for you or for me. It’s for everyone else out there. I want to make sure everyone who sees your posts knows how your always wrong. I want everyone to see how you don’t know anything about manufacturing or finances. How you’re entire thesis is a complete joke with no factual basis what so ever. That way you can’t spread any misinformation or lies. \n\nBtw\n\nFor a quick list of recent examples with cited evidence of how [u/allIhavelearned](https://www.reddit.com/u/allIhavelearned) is wrong [Click Here.](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9vyjvb) ", "score": 1, "replies": [{"body": ">you’re\n\nYour.\n\nReminder: Elon Musk is legally unable to say that he is not guilty of committing securities fraud.", "score": 0, "replies": [{"body": "False. Elon Musk is legally able to say he is not guilty of securities fraud. Per\nThe settlement, Elon musk is not and has never been guilty of securities fraud. As mentioned in the settlement, this is a fact. He cannot confirm not deny the allegations, but allegations are different than being guilty of a crime. U/allIHaveLearned has shown once again that he has no understanding of the law. [A person is only guilty if a court of law says so](https://en.m.wikipedia.org/wiki/Guilt_(law)).\n\nAnother classic example of how u/allIHaveLearned is wrong. He doesn’t understand the simple difference between being guilty of a legal crime and allegations. Elon Musk is free to say he is not guilty of securities fraud as much is he is allowed to say the sky Is blue and clouds are white because it’s an absolute fact without breaking the settlement. Not only that, but the settlement also states that he is not guilty.\n\n\n", "score": 1, "replies": [{"body": ">Elon musk is not and has never been guilty of securities fraud\n\nHe has not been *convicted* of securities fraud, sure. But guilt is a word that encompasses more than just whether or not you were convicted; it is a simple question of fact: did you do the thing?\n\nIf Musk says that he is not guilty of securities fraud, he is denying the facts asserted by the SEC. This breaks the settlement.\n\nYou are 100% wrong. Feel free to complain to the dictionary.", "score": 1, "replies": [{"body": "Guilty of a crime has only one single meaning.\n\nIt is not a simple question of “did you do a thing”. Again you’re 100% wrong. You need to be culpable or responsible. You are only culpable or responsible for a crime if a court says you are. Otherwise you are not responsible for it and you’re not guilty. \n\nI’ll say it nice and slow:\n\n[Guilty requires you to be culpable. ](https://www.merriam-webster.com/dictionary/guilty) . \nLiterally every resource say the same thing.  You are 100% wrong. \n\nYou cannot be culpable of a crime unless a court says you are. \n\n Elon Musk is not Guilty of securities fraud. Elon Musk has never been guilty of securities fraud. \n\nThe settlement says he is not guilty of securities fraud. \n\n[The Webster dictionary says he’s not guilty of securities fraud.](https://www.merriam-webster.com/dictionary/guilty)\n\n[The legal dictionary says he is not guilty of a crime](https://legal-dictionary.thefreedictionary.com/guilty) \n\n[Even the good old Wikipedia says you’re wrong. ](https://en.m.wikipedia.org/wiki/Guilt_(law)) \n\nGuilt is different then an allegation. Elon musk is free to say that he is not guilty of of securities fraud without breaking his settlement. \n\nAgain in case it wasn’t clear. You are 100% wrong. As always. You have no evidence. No logic. No argument. \n\nAnother perfect example of u/allIHaveLearned having no clue what he is talking about and spreading misinformation and lies. \n\n", "score": 1, "replies": [{"body": ">You are only culpable or responsible for a crime if a court says you are.\n\nWrong.\n\n>>culpable\n\n>/ˈkʌlpəb(ə)l/\n\n>adjective\n\n>deserving blame.\n\n>>responsible\n\n>/rɪˈspɒnsɪb(ə)l/\n\n>adjective\n\n>being the primary cause of something and so able to be blamed or credited for it.\n\nYou are culpable or responsible for a crime if you did it. That's the only criteria.\n\n(Let's watch as caz0 argues that the dictionary is wrong.)", "score": 0, "replies": [{"body": "The dictionary is right. You’re the only person completely wrong. Did you not read what you posted?\n\nResponsible “ Guess how you become responsible for a crime?\n\nSay it with me. “A Court Of Law Says So”\n\n“Deserving blame” - guess who decides if someone gets blamed for a crime? \n\nSay it with me. “A Court Of Law”\n\nThere was that so hard? \n \n\nAs someone who has an actual argument, here is an actual sourced definition: [meriting condemnation or blame...](https://www.merriam-webster.com/dictionary/culpable).  The only way to merit condemnation or blame for a crime is if you are found guilty by a court of law. The court is the only one who can decide if it’s merited or not. \n\nThank got your not a judge and your opinion doesn’t matter to anyone. \n\nAs always, you are completely wrong. Are you going to just ignore the fact that every single resource says the same exact thing? That’s incredible. Just a reminder for you:\n\n\n[The Webster dictionary says he’s not guilty of securities fraud.](https://www.merriam-webster.com/dictionary/guilty)\n\n[The legal dictionary says he is not guilty of a crime](https://legal-dictionary.thefreedictionary.com/guilty) \n\n[Even the good old Wikipedia says you’re wrong. ](https://en.m.wikipedia.org/wiki/Guilt_(law)) \n\nLiterally, even the definition that you posted says the same thing. \n\nFor a quick list of recent examples with cited evidence of how [u/allIhavelearned](https://www.reddit.com/u/allIhavelearned) is constantly wrong or spreading misinformation [Click Here!](https://www.reddit.com/r/teslainvestorsclub/comments/9x0gt3/bp_installs_tesla_made_battery_to_store_wind_and/e9vyjvb) ", "score": 1, "replies": [{"body": ">The dictionary is right. \n\nGlad to hear it.\n\n>Responsible “ Guess how you become responsible for a crime?\n\n>>being the primary cause of something and so able to be blamed or credited for it.\n\nHere you go, have another read of the dictionary definition of responsible.\n\n>Deserving blame” - guess who decides if someone gets blamed for a crime?\n\nThe person using the word in a sentence.\n\nAgain, guilt is not only about legal responsibility. It's also a question of fact: *did you do the thing?*\n\nWhy do you hate simple definitions of words?", "score": 0, "replies": [{"body": "“The person using the word in the sentence” - false. It depends on the sentence and who is saying it. If it’s a crime then only a court of law can. \n\n“Guilt is not only about legal responsibility”- if we’re talking about being guilty of a legal crime then it absolutely is only about legal responsibility. Believe it or not just screaming the word guilty doesn’t make it true. \n\nHow is it possible that you don’t understand how *words* work? Incredible. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "That’s completely irrelevant comment. Panasonic makes a raw material to their product. They are a long time supporter and Partner of Tesla. ", "score": 0, "replies": [{"body": "Battery cells are not a raw material.", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "https://www.investopedia.com/terms/r/rawmaterials.asp\n\nLearn.", "score": 1, "replies": [{"body": "Yep primary material used in constructing the product. In other words the product manufacturer doesn’t create it. \nAs always you fail to grasp even the simplest of terms. Amazing that you don’t even know what a raw material is. \n\n“materials or substances used in the primary production or manufacturing of goods.” I.e Panasonic’s batteries used in manufacturing Tesla’s energy products and cars. \n\nLearn", "score": 0, "replies": [{"body": ">Yep primary material used in constructing the product.\n\nPrimary material is unmanufactured.\n\nBattery cells are manufactured.\n\nDo you just put words in your posts randomly?", "score": 0, "replies": [{"body": "False. Primary material is just material not produced or manufactured by the company making the product. You just made that up. You literally have no idea what raw materials are. Its so sad. Do you know anything about manufacturing at all? I've never met someone wrong about literally everything they ever post. It's crazy how wrong you are all the time. I guess that's why you're short Tesla. ", "score": 1, "replies": [{"body": ">Primary material is just material not produced or manufactured by the company making the product.\n\nCar seats are raw material. Sure.\n\n>I've never met someone wrong about literally everything they ever post. \n\nWhich of us said that Tesla was going private?", "score": 1, "replies": [{"body": "If the car seats are purchased whole from a separate company and not made by Tesla, then they would be raw materials yes. \n\n\"primary material is unmanufactured\" wow.  this is going to be fun. You think that raw materials have to be unmanufactured. \n\nU/allIhavelearned thinks that raw materials are unmanufactured. wow.\n\nDo you think plastics aren't manufactured? Do you think the steel just magically forms in the ground in massive quantities ripe for the picking? Do you think that all paint for the cars just falls out of the sky? I'm guessing you think the wood planks in their example just grow out of the ground like that? \n\nNo, it's manufactured. Raw material doesn't mean unmanufactured. We're not talking about trader Joe's. \n\nUnless you honestly think almost no companies use any raw materials ever, even you should know how wrong you are. \n\nI'm going to share this with some other users here because this is just hilarious that you still don't know what a raw material is. \n\n", "score": 1, "replies": [{"body": ">You think that raw materials have to be unmanufactured.\n\nI think that producing lumber or ingots is fundamentally different from producing doors or car seats, yes.\n\nTell me: what do you call a thing which holds an electrical charge which you can use to power other devices?\n\nWho makes the parts of a Tesla which hold an electrical charge?\n\nBonus question: who owns the Gigafactory?\n\nNow combine the answer to all of these and tell me why Tesla holds a competitive advantage for selling batteries.", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": ">Lumbar and ingots are manufactured.\n\nThey're not the finished product. They are a raw material from which something entirely different is crafted.\n\nTesla puts the battery cells in a box.\n\n>\"What do you call the thing that holds an electric charge.\" Irrelevant. You can store an electrical charge in pretty much anything. Even unprocessed materials.\n\nYou have quoted something that I did not write. Congrats.\n\n>Wow. I can't believe I have to explain this to you too! Seriously, How do you make it through the day? \n\nWhat are your thoughts on constant personal attacks, /u/soooohatemods?", "score": 0, "replies": [{"body": "Mr.  u/caz0 please refrain from personal attacks.  It is beneath you.", "score": 1, "replies": [{"body": "Didn't think it was a personal attack. Just a question. ", "score": 1, "replies": [{"body": "It was.", "score": 2, "replies": [{"body": "Darn. This is hard. ", "score": 1, "replies": [{"body": ":)", "score": 2, "replies": []}]}]}]}]}, {"body": "The batteries aren't the finished product either. They are a raw material from which a completely different product is created. Just like they are a raw material for their car. Don't forget you said \"raw materials are unmanufactured\". \n\nAgain Panasonic batteries manufactured raw material for Tesla's batteries. Just like lumber. Just like the paint. Just like iron. \n\nYou are simply wrong in every way. \n\n\nEditing to keep one comment thread:\n\n“They’re not in the finished product” - Thats not a requirement for raw materials at all. Seem like you need to look up the definition of direct and indirect raw materials in the link you posted. ", "score": 1, "replies": [{"body": "Are you just typing out what you think I wrote from memory?\n\n>They are a raw material from which a completely different product is created. \n\nYes. Tesla puts them in a box. Much processing, wow.", "score": 1, "replies": [{"body": "They do a hell of a lot more than that, but that much is obvious and irrelevant. Batteries are a raw material. Power walls are the product composed of the cells and a plethora of other components. You were wrong. You said raw materials are not manufactured. You were wrong. You implied that car seats (not manufactured by Tesla) aren’t raw materials. You were wrong. As always. \n\n", "score": 1, "replies": [{"body": "Reminder that you keep quoting me and adding words and punctuation.\n\nE: I said that Tesla wasn't going private immediately after Funding Secured. Where's the privatisation?", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}
