{"title": "Next week YOLOS: ~$30k GOOGL puts, ~$105k FB calls, ~$57.5k twitter calls, ~$33k AMZN calls, ~$63k AMZN LEAPS.", "selftext": "[deleted]", "id": "90hnzb", "created_utc": 1532105676.0, "score": 739, "upvote_ratio": 0.98, "num_comments": 302, "comments": [{"body": "This guy fucks ", "score": 319, "replies": [{"body": "$GOOG expectations low already cause they missed Q1. Really seems unlikely they miss Q2, especially when MSFT IBM cloud services are heating up.\n\nIf anything will fuck up the market it will be the Xi Trump dick slinging. And also Trump giving the EU the middle finger on lowering auto tariffs.", "score": 36, "replies": [{"body": "didn't GOOG mentioned they're accounting that $5 billion fine into their next earnings? But market seems to have finished reacting to that already...", "score": 4, "replies": []}, {"body": "Google will yet again post weak AdWords numbers", "score": 1, "replies": []}, {"body": "IBM/MSFT have a lot of existing on-prem customers that they've been transitioning to cloud. Google doesn't.", "score": 1, "replies": []}, {"body": "But $GOOG was fined by 5b$ recently kek", "score": 1, "replies": []}, {"body": "What? $GOOGL beat Q1 earnings expectations heartily and the stock still went down.", "score": 1, "replies": [{"body": "The EPS beat was due to an adjustment claiming Uber gains as revenue.", "score": 1, "replies": [{"body": "Top of line revenue was also up in Q1, but spending overshadowed all. Coupled with the fine and GOOGL close to ATH, looks like it's setup to run down with little upside. Predicting at most +4% AH with a rundown shortly thereafter, or a miss will send the stock shooting down.\n\nIncreased competition from AMZN in online ad spend, though TAM maybe higher for all. ", "score": 1, "replies": [{"body": "Yes, but GOOGL has not run like AMZN and FB.  Stock has barely broken above January levels and expectations are low (where as FB and AMZN are priced to beat). They will still report around 18% growth.", "score": 1, "replies": [{"body": "Despite growth, I fully expect TAC to increase because of increased competition for ad dollars, but we shall see. Still expected a limited upside of 4% with drawdowns over the next few trading days. GLTA. ", "score": 1, "replies": [{"body": "I'm only long via QQQ. Just saying expectations are low so there is more chance to surprise. Still think GOOGL long term value is better than AMZN at current prices (largely due to bets in AI and Waymo).", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Himself.", "score": 5, "replies": []}, {"body": "Ya he do", "score": 2, "replies": []}, {"body": "I lost my shit on this one", "score": 0, "replies": []}]}, {"body": "But the real question is did you ask your poor millennial friends if they use this shit?", "score": 175, "replies": [{"body": "Next thing he will tell you his friends switched to Bing from Google.", "score": 72, "replies": [{"body": "I'm using Bing and IE for today off the back of my MSFT call gains out of respect.", "score": 54, "replies": [{"body": "I wouldn't use Bing even if MSFT paid double dividends to Bing users.", "score": 22, "replies": [{"body": "I use it for porn ", "score": 51, "replies": [{"body": "+1", "score": 1, "replies": []}, {"body": "genius", "score": 1, "replies": []}]}, {"body": "Yo I've noticed with the way Google has started over-curating/filtering their results that Bing actually has use if you need a total search. Find myself switching over to it for the occasional search.", "score": 8, "replies": [{"body": "> Find myself switching over to it for the occasional search.\n\naka ~~gay~~ porn", "score": 16, "replies": []}]}, {"body": "Bing isn't a competitor to google- it's a porn search engine. ", "score": 6, "replies": []}, {"body": "Closed out my positions for over 10x double dividend. Gotta pay my respects to my girl Amy Hood for that fat AF guidance.", "score": 2, "replies": []}]}]}, {"body": "Word has it Bing is the best porn search engine", "score": 17, "replies": [{"body": "Can confirm. It's the hover-to-preview video search feature.", "score": 15, "replies": [{"body": "Also the fact that it returns results from know porn sites rather than avoiding them like google seems to ", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bing you can just type an actresses name and hit 'video' and it's basically like browsing pornhub and every other streaming site directly all at once with hover-over preview ability from the results page. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I use duckduckgo", "score": 7, "replies": []}]}, {"body": "Also, some of those calls ive had for a while thats why they are so in the money. These are the calls that are way ITM:\n\n- FB 185 call (136% profit already)\n- TWTR 32 call (207% profit already)\n- AMZN leap (42% profit already)\n\nThe others I bought relatively recently.\n\nDetail of the way ITM calls can be found in this album: https://imgur.com/a/dGfhzl9", "score": 90, "replies": [{"body": "Damn boi lemme tug on that dick a little while. I heard about that big ol dick you got.", "score": 62, "replies": [{"body": "rackem, rackbah, rackem", "score": 10, "replies": [{"body": "Yes yes oh yeahhhhhh .....", "score": 3, "replies": []}]}]}, {"body": "AMZN $1800 2020, Sweet Lord!", "score": 11, "replies": []}]}, {"body": "remember guys: this is the $NFLX guy.\njust follow his plays and win big", "score": 146, "replies": [{"body": "This dude bought puts based off DD from his friends...\n\nAll in.", "score": 85, "replies": []}, {"body": "this aged well", "score": 8, "replies": [{"body": "indeed. rest in peace", "score": 1, "replies": []}]}, {"body": "Shit I followed his netflix play was up $800 couldn't sell cause PDT and lost it all the next day at open :( only got to profit like $50 lmao", "score": 28, "replies": [{"body": "that's what you get for being broke", "score": 57, "replies": [{"body": "Lmao you country hick keep watching your football and drinking beer ", "score": -22, "replies": [{"body": "Compliment or Insult?  Football, beer, and having enough money for land in the cut?  Can't hear your voice to tell the tone but sounds like fun.", "score": 26, "replies": [{"body": "i can hear the poor in his voice", "score": 21, "replies": [{"body": "Lmfao.  Never thought of \"poor\" as an emotion or tone before but I guess we caught this fool in his feelings, and his feelings are \"poor.\"  I was thinking some cool country dude was boning his boyfriend and he was jealous of that just-outta-the-city money.", "score": 2, "replies": []}, {"body": "I'm still laughing at this 2 days later, I'm gonna start using this when people complain abt their situation or talk down on the South (or country people in general).\n\nEdit: there to \"their\"  \nEdit 2:  forgot to say Thanks.", "score": 1, "replies": []}, {"body": "the richest people in america are rednecks. they got 10 acres of land with a corvette in the garage ", "score": 1, "replies": [{"body": "lol when a 50k car = rich.\n\nor acres of land in flyover states.\n\nthat isn't to discount rednecks being loaded though. it's just those two things don't necessarily equate wealth.", "score": 7, "replies": [{"body": "paid off 50k car is far richer than 72 month financing on a 75k car", "score": 4, "replies": [{"body": "i think that was my point though, maybe they're just leasing it like everyone else.\n\nin my area everyone and their mom is leasing pricey rides because they swap them every few years. for some of them the economics makes sense but i'm sure a number of them are just paycheck to paycheck.\n\nanyways my other point is that there are simply more $$$ status cars than a corvette (dont get me wrong, it's a sweet and ridiculously fast ride for the price).", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "you could have bought a put or call(opposite trade) at the price you wanted to lock in profits at the same strike. then next day sell both and you should still see your profit \n\n", "score": 1, "replies": []}]}]}, {"body": "Promoted you to a two star faggot /u/blueblarflubar. It means absolutely nothing *edit: yet*, but now you are the only person with two stars.", "score": 135, "replies": [{"body": "This changes everything, now I will follow his plays blindly with the ragiest of hard ons", "score": 34, "replies": []}, {"body": "I was wondering what that was about. Elementary school gold star system?", "score": 3, "replies": [{"body": "5 stars and the whole class gets PZZA", "score": 24, "replies": [{"body": "DPZ or GTFO", "score": 5, "replies": []}, {"body": "Making a note of this.", "score": 1, "replies": []}]}]}]}, {"body": "THIS is why I sub to r/wallstreetbets", "score": 244, "replies": [{"body": "[deleted]", "score": 151, "replies": [{"body": "Just check the[ DD flair search on the sidebar or top bar](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD) to see what people are putting money into. There's actually a reasonable amount of information if you poke around. Part of my recent flair Nazism is just to point that out and make it easier to find/use.", "score": 45, "replies": [{"body": "Doings God's work here my man.  The past year has seen such an influx of low level shit posting from broke bitches posting $200 moves.  ", "score": 11, "replies": [{"body": "Basically since Robinhood got options, it's been 'oh no guys this casino app lost me my McDonald's paycheck'", "score": 21, "replies": []}, {"body": "200 is barley enough for 1 share of a good company.... Who's trading with that amount.", "score": 3, "replies": [{"body": "Like half of all robinhood users", "score": 15, "replies": [{"body": "I use rh then again my 60k is tiny. I like me free trades man all about value.", "score": 3, "replies": [{"body": "Just get 100k in margin then", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Haha there was a post last night about some kid who was quitting trading because he lost “many hundreds of dollars.” ", "score": 23, "replies": [{"body": "That guy lmao ban the poor", "score": 2, "replies": []}, {"body": "last night was weird ", "score": 1, "replies": []}]}, {"body": "Idk but I'm gonna guess the second scratched out one is a 8/10 Disney call", "score": 1, "replies": []}, {"body": "why do u believe OP? He couldve photoshopped this", "score": -6, "replies": [{"body": "Fag. Got. ", "score": 1, "replies": []}]}]}]}, {"body": "Also dont cry for me if google blows earnings out of the water. There is no way that google hits earnings and facebook misses earnings. I will be happy if Google hits earnings because it makes the rest of the week WAAAAAY less risky.\n\nIf google misses then I stand to make more profit if the rest of the week plays out PERFECTLY, but it also makes it WAAAAY more likely some of the other companies miss in which case I go broke", "score": 57, "replies": [{"body": "This didn’t age well", "score": 19, "replies": []}, {"body": "They're going to include that EU fine into their earnings like they did the last one and get wrecked.", "score": 5, "replies": [{"body": "Nah they wont pay that shit for years to come and never the full amount ", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well shit, so they are.", "score": 0, "replies": []}]}]}]}, {"body": "Depends on if they include that massive fine. Also if the only reason they get fucked is the fine I'd say you're still set.\n\nI'm also biased as fuck because I'm betting big on FB (not quite 105k big like yourself)", "score": 1, "replies": [{"body": "Will they put that fine in this quarters earnings though? Seems like they'd put it in next ones. ", "score": 1, "replies": [{"body": "Depends. At the very least it shows up in guidance", "score": 1, "replies": [{"body": "I expect it shows up on guidance but I don't think they'll put it on this quarters report. Either way they're going to miss one of those unless analysts come up with new numbers. ", "score": 1, "replies": []}]}]}]}, {"body": "I actually may agree with you regarding GOOGL, I doubt they would beat and if they do, they will still need to address the EU fine.  \nIn addition to that, I think they're having issues with TAC increasing YoY, CPC, etc... Those may impact their earnings heavily.  \nThat said, I think you didn't account for one more important factor, the US-China trade dispute, US-EU trade dispute, NAFTA negotiations, all those can create volatility that could cause your options values to go down.  \nEither ways, good luck :)", "score": 1, "replies": []}]}, {"body": "Possible scenario:\n\nearnings are mixed and everything goes sideways and theta kills u", "score": 45, "replies": [{"body": "Well, if you checked the expiry on those contracts, you'd know that they aren't FDs.", "score": 12, "replies": [{"body": "holding through earnings will dick-slap that premium anyway", "score": 13, "replies": [{"body": "But a lot of them are already itm, which means they're no longer valued by just their premium. They have intrinsic value as well.", "score": 2, "replies": [{"body": "Autistic value is the opposite of that word you used.", "score": 3, "replies": []}]}]}]}]}, {"body": "AMA request:\n\n1. How old are you\n2. What do you do for a living\n3. What will you do if your positions net a 20%+ loss\n\nThank you", "score": 43, "replies": [{"body": "1. Graduated college last year\n2. Software engineer\n3. Do nothing and continue living\n\nmy parents are middle class immigrants who had no money until their 30s or something so even if I lost everything my standard of living would still be substantially better than what I had growing up, which is more than adequate for me.", "score": 104, "replies": [{"body": "That is not what 30 something Tinder women want to hear", "score": 20, "replies": [{"body": ">Graduated college last year\n\nThis guy probably isn't even 30 yet. With this speed he will either be on the street or on a yacht by the time he is in his 30s.", "score": 13, "replies": []}]}, {"body": "Respect.   I feel you.  My parents didn't have anything and we come from a rough place.  My mom figured a way out for us and when we got older our lives changed drastically.  Started eating at restaurants, vacations, nice house, paid for my college, etc.  Maybe from growing up poor and coming up in the world gives some people a higher tolerance for risk?  Either way, I've never been scared to lose money if it has a good risk-reward scenario.  ", "score": 12, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Damn, what do you do for a living", "score": 7, "replies": []}, {"body": "Probably no 1M for software developers, unless they stop working for someone else and start their own company. ", "score": 12, "replies": [{"body": "Not sure how it would be for software developers, but if you're in software engineering or other types of engineering you just head for management and eventually a VP role, one way to make a high salary.", "score": 2, "replies": []}]}, {"body": "pporfeg", "score": 3, "replies": [{"body": "ppoorerfeg", "score": 1, "replies": []}]}]}, {"body": "How did you get all this money if you just graduated from college?\n\n", "score": 8, "replies": [{"body": "YOLO calls, who cares? get yours.", "score": 21, "replies": [{"body": "I'm all in on the \"who cares\" ¯\\\\\\_(ツ)_/¯", "score": 3, "replies": []}]}, {"body": "Daddies money there is no scenario you get that right out of college even if invested in an early growth stock. Somewhere down the line he got contributions from someone. And a fresh graduate software engineer won't pull I'm that money. He's making this play cuz his parents are rich and he can afford to lose.", "score": -14, "replies": [{"body": "categorically untrue comment from some jealous guy\n\nto be clear, I got my money from taking my internship money, then betting on brexit at long odds, then Trump at long odds, then taking all that money and putting it in <cant mention or else I get banned> but it starts with \"c\" and ends in \"currency\"", "score": 50, "replies": [{"body": "How exactly did you \"bet on Brexit\" and on Trump? I'm not doubting you, I'm just curious because I was looking to bet against Brexit and couldn't find a financial vehicle for it.\n\nGood job on being one prescient and/or lucky motherfucker. Rooting for you with the upcoming ERs", "score": 1, "replies": [{"body": "a binary option prediction market called predictit", "score": 3, "replies": []}]}, {"body": "Alright seriously tho, explain how you can have that much to spend only a year out of college, as a software engineer? All evidence points to the money being given to you ", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "There are taxes, there are living expense (especially in the cities where they offer 100k+ salaries) there are loans you gotta pay back. There’s so much Shit. Your entire salary is not being deposited straight to your bank. After you pay all your shit you get to save maybe 40k tops and I mean tops if you live frugal as fuck. \n\nI’m not anti windfall or jealous of it, I’m getting almost  2m bucks in windfall, I don’t hide it or try to play it off as something I worked for. \n\nAnd no yolo calls by law of statistics never work long term. See: gamblers ruin ", "score": 0, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "To us people who actually know about the industry, you sound like an idiot. You are highly overestimating what these people make, or rather you’re are highly overestimating how much they take home ", "score": 0, "replies": [{"body": "No, he isn't.  I'm so sick of people spouting off bullshit about what engineers make.  Google is pulling in like $1.5M/year per engineer, you seriously think they're going to pay 50-70k like a backwater e-commerce company?\n\nYou can definitely save >50% of your post-tax pay too, you just have to live like a college student even though you're pulling in 200k\n\nSource: 10 years working for the big boys", "score": 10, "replies": []}]}, {"body": "Bro you are talking out of your ass from someone who knows personally many software engineers 1 in Google 2 in ibm 2 in facebook. I honestly dgaf what u think I have never seen or heard of that signing bonus on an entry level engineer. I am probably talking to delusional college kids thinking they are gonna make bank straight outta college. The kid inherited money. If you don't think that you are delusional.", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If you look he already made up a bs story to explain his gains that anyone with half a brain won't believe and it has nothing to do with being hired by a big boy as you call it. Your numbers are incorrect however. I know a 150k salary starting is possible with a signing bonus. However based on the unrealistic gains for a fresh graduate and the cost of living for the areas with these companies the gains are not realistic, which is why I was arguing that people are assuming he makes upwards of 250k as a fresh college graduate. Further phd and strong master students are considered over bachelor's with 0 experience except for a wonk internship.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I don’t get why you’re going through so much mental gymnastics to defend a guy who’s obviously lying. His story simply doesn’t add up. ", "score": -2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "No one making 100k a year can put 50k in a YOLO robinhood account fresh out of college. ", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "for all you know hes got a top 10 app in the apple store. Man up on why you think this is too much money for his age.", "score": 7, "replies": []}, {"body": "Uh if he’s is a top of line software engineer he can be pulling $150k+. Not to mention his internships throughout the years pulling in $30k/summer\n\n", "score": 9, "replies": [{"body": "Look, I'm not hating on him or anything and like what he's all about, but this roll wasn't done on 150/yr unless living somewhere dirt cheap. I make that and, after taxes and bills, it's not near that.\n\nHowever, I don't necessarily think it has to be someone else bankrolling him. It could just be he has been doing really well with investments and YOLOing. Could have gotten inheritance. Could have even been saving his whole life and now has a serious amount cash put away. Whatever it is, it wasn't done with one year of making 150 and having leftovers", "score": 7, "replies": []}, {"body": "and even a freshy SE can easily get $80k+", "score": 1, "replies": [{"body": "I would say he yoloed his way into this money tbh. Kinda hard not to make money last year.", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "An 80k signing bonus right out of college?", "score": 4, "replies": [{"body": "This place is infested with kids that haven't gotten a real job yet. They think entry level software engineers at Google are taking 250k per year. Delusional.", "score": 10, "replies": [{"body": "Pretty much, been in the industry 10 years now and most of Reddit is clueless.", "score": 3, "replies": []}, {"body": "Yea after this thread I realized most of WSB are kids still in shool", "score": 4, "replies": []}]}, {"body": "Maybe worked during college too", "score": 2, "replies": []}]}]}, {"body": "> there is no scenario you get that right out of college even if invested in an early growth stock. \n\nHURR DURR WAT R STARTUPS HOW DOES EQUITY WURK", "score": 0, "replies": []}]}]}, {"body": "haha, nice answer. I hope you don't lose.  \nOne more question: what's your total account value in RH?", "score": 1, "replies": []}, {"body": "i grew up rich, sux to sux", "score": -2, "replies": []}]}]}, {"body": "I mean you could do this of course, but you could also just PayPal me the money to get the pain out of the way. ", "score": 30, "replies": [{"body": "His plan works until it doesn’t work. He made like 200% off of shit Netflix dd", "score": 19, "replies": []}]}, {"body": "F", "score": 25, "replies": [{"body": "F", "score": 20, "replies": [{"body": "F", "score": 16, "replies": [{"body": "F", "score": 4, "replies": []}, {"body": "f", "score": -6, "replies": []}]}]}]}, {"body": "That moment when you accurately predict the market with $ROPE scenario ", "score": 24, "replies": []}, {"body": "THIS is the kind of post that got me interested in this sub in the first place.", "score": 23, "replies": [{"body": "I'm just here after seeing that high school kid YOLO his life saving of $900 and cash out two days later with $52k. That's the juicy stuff. ", "score": 15, "replies": [{"body": "What was the trade?", "score": 8, "replies": [{"body": "Pretty sure he shorted SPY with long puts expiring same day, and then did it multiple times and his mom took him to go see the big short. ", "score": 3, "replies": []}]}]}]}, {"body": "Awww, I miss this kind of WSB post. Not some stupid shit $205 yolo and $70 100% gain RH post.\n\nNext week is gonna be spicy.", "score": 40, "replies": []}, {"body": "Op on suicide watch ", "score": 20, "replies": []}, {"body": "Bruh", "score": 37, "replies": [{"body": "What's the story behind your flair lmao", "score": 16, "replies": [{"body": "I made a post a while back about going to vegas. Was a semi-joke turned actual idea because it was pretty well-recepted. \n\nConsensus was like fall-ish so when it gets close I'll make another post about it.", "score": 9, "replies": [{"body": "Word", "score": 1, "replies": []}, {"body": "Dear god my autism is twitching at the idea of meeting strangers from the internet and having to interact with them", "score": 1, "replies": []}]}]}]}, {"body": "lmfao. 0 for 2 now. ", "score": 16, "replies": []}, {"body": "Nice shit man good luck.\n\nIf Google shits the bed MUs going to $50 and half this sub will kill them selves ^(I’ll be right behind them)", "score": 18, "replies": []}, {"body": "op needs $ROPE", "score": 13, "replies": []}, {"body": "RIP", "score": 12, "replies": []}, {"body": "My god the balls on this guy. Good luck ", "score": 10, "replies": []}, {"body": "I appreciate you posting these.  Why do you think google will miss earnings?", "score": 10, "replies": [{"body": "Jews from eu r taking 5 bil", "score": 70, "replies": []}, {"body": "Last quarter wasn't a miss but people were upset about TAC and it dropped.", "score": 2, "replies": []}]}, {"body": "Can we get a F thread brother?\n\nF", "score": 10, "replies": [{"body": "F", "score": 3, "replies": []}]}, {"body": "If this is real god bless this sub", "score": 9, "replies": []}, {"body": "You ok bro?", "score": 8, "replies": [{"body": "Everyone here has felt his flushed face looking back at the phone 5 times a minute and planning how to make the money back in the next 2 days", "score": 8, "replies": []}, {"body": "Checking up on his progress. So far in feelsbadman territory. ", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "True- $100k+ is in FB calls which is up over 1.6% AH", "score": 2, "replies": [{"body": "get zucked", "score": 2, "replies": []}]}]}]}, {"body": "Oof , he nervous now", "score": 1, "replies": []}]}, {"body": "Gross", "score": 9, "replies": []}, {"body": "Nearly $300k riding on options. Jesus christ man. Hope you have some index funds or something as a backup plan.", "score": 38, "replies": [{"body": "do you know where you are", "score": 103, "replies": [{"body": "whats backup plan? is that like BJs?", "score": 29, "replies": [{"body": "BJ's had a good meat department..", "score": 1, "replies": []}]}, {"body": "Yeah I realize this place is full of degenerate retards who enjoy lighting their money on fire, but it’s typically in $10k-50k increments. This is the largest gamble I think I’ve seen here. Hope it works out but will be quite entertained if he loses as well. I love this sub.", "score": 24, "replies": [{"body": "> This is the largest gamble I think I’ve seen here.\n\n450k walmart guy wasn't too long ago", "score": 15, "replies": [{"body": "Link?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/8jz00w/450k_yolo_on_wmt/", "score": 3, "replies": []}]}]}, {"body": "To be fair the ratio of quality content (like this) versus memes and shitposts used to be a lot better than it is now.  ", "score": 10, "replies": []}, {"body": "You must be new... You seen martymoho's MU plays? That is one of the main reasons Mu is pumped so heavily here. Also the dude who put 100k or something into NVDA calls and pulled out over 1mil a year or 2 ago was big.", "score": 4, "replies": [{"body": "Nah I remember that. There was also that guy who lost $1.2M (or something like that) of other people’s money on VIX. But he didn’t post in WSB until he lost... just came here for a shoulder to cry on.", "score": 7, "replies": []}]}]}]}, {"body": "He's got $2 mill in an Ally account", "score": 13, "replies": []}, {"body": "If he has 300k in the first place, he probably knows what he's doing.", "score": 4, "replies": [{"body": "Not necessarily", "score": 7, "replies": []}, {"body": "You clearly forgot about the Walmart guy", "score": 5, "replies": [{"body": "Just looked him up -[ here are the final results](https://i.imgur.com/kjvKZuf.png)  Ouch.\n\n[Original YOLO post](https://www.reddit.com/r/wallstreetbets/comments/8jz00w/450k_yolo_on_wmt/)", "score": 3, "replies": []}]}]}]}, {"body": "The closest I'll ever come to being anything but a lurker in WSB is getting like 40% of my salary in $AMZN because I work there.\n\nAnd every time I sold that shit to diversify like a goddamn responsible adult, I made less money than if I'd just kept it all in JEFB futures, so fuck it. ", "score": 6, "replies": [{"body": "Fellow Amazonian.  Only sell enough to cover taxes!", "score": 3, "replies": []}]}, {"body": "ARE YOU STILL LONG ON AMAZON????", "score": 6, "replies": []}, {"body": "Hey fag, wanna hangout? You're not too far from me.", "score": 7, "replies": []}, {"body": "#baller", "score": 7, "replies": []}, {"body": "I got twtr calls, fb calls, and an amzn call spread. I'm riding with you! Obviously not the same level but let's do some fucking next week! ", "score": 6, "replies": []}, {"body": "You are either the most retarded person on wsb or a fucking genius. Let's hope it's the former", "score": 6, "replies": []}, {"body": "Thanks for the FB call advice. Please post more often\n\nAlso thanks to everyone who said V calls are free money you were right\n\nTime for a blunt to celebrate", "score": 6, "replies": [{"body": "lol hope you sold bruh", "score": 6, "replies": [{"body": "God damn this guy(original commenter) still doesn't get it. Do the opposite of the re re's", "score": 3, "replies": []}]}]}, {"body": "F ", "score": 5, "replies": []}, {"body": "Did you run this same play last ER? I think this is exactly what happened last time around - GOOGL missed and everything dropped, then FB and AMZN killed it", "score": 4, "replies": []}, {"body": "105k on FB is impressive, I bought in minutes ago as this was the confidence I needed to hold my pleb amount over the weekend. Best luck tendie boi fag", "score": 3, "replies": []}, {"body": "Take my energy ", "score": 5, "replies": []}, {"body": "He got one part right in the \"Most probable outcome\" scenario; the puts are worthless but the entire market has been lifted (so far). ", "score": 5, "replies": [{"body": "hahahahahaha", "score": 4, "replies": [{"body": "Holy shit. Just....  damn.  ", "score": 1, "replies": []}]}]}, {"body": "> my parents are middle class immigrants who had no money until   > their 30s or something so even if I lost everything my standard of  > living would still be substantially better than what I had growing up, > which is more than adequate for me.      \n  \nI guess you were ready for this based on your comment. I hope you saved some FB calls before the big crash!", "score": 4, "replies": []}, {"body": "What if AWS is not growing at the same pace as Azure?  Analysts are already saying MSFT now has a higher share of the cloud space.  Thoughts on this???", "score": 2, "replies": []}, {"body": "So.. if I had 1.5k which one do i join you in the fun for giggles lol", "score": 4, "replies": [{"body": "none, he bought into all this shit either a long time ago, or last week. you buying in now would be a different play. ", "score": 9, "replies": [{"body": "God bless this FOMO on this sub.", "score": 13, "replies": []}]}]}, {"body": "at this point i think you're not even yoloing. you're just  very rich and each of these plays is just a drop in the bucket. still a quality post.", "score": 3, "replies": [{"body": "He mentions in an old post if he lost everything, it wouldn't change much, so that tells you quite a bit -- even if he didn't have as much as now.  \n\nOne person's yolo is another person's Tuesday.", "score": 7, "replies": []}]}, {"body": "Now this.\n\nThis is podracing.", "score": 4, "replies": []}, {"body": "RIP ", "score": 4, "replies": []}, {"body": "This got me tingling ", "score": 3, "replies": []}, {"body": "What in the fuck", "score": 3, "replies": []}, {"body": "Why no $V? You slow or something?", "score": 3, "replies": [{"body": "You play with what you know.   All tech play here.  Maybe he works in tech field. ", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "He bought puts", "score": 2, "replies": []}, {"body": "Or he works for google and it’s inside info", "score": 1, "replies": []}, {"body": "Inside info ain’t bias, it’s illegal real.  ", "score": 1, "replies": []}]}]}]}, {"body": "Ballsy. Take my upvote ", "score": 3, "replies": []}, {"body": "What a beast ", "score": 3, "replies": []}, {"body": "You're forgetting about IV crush. If everything does pretty decent you will still lose money. ", "score": 3, "replies": []}, {"body": "Had to come back to see how much was put on googl puts. Shit is rekt tomm. Prob worth 5k", "score": 3, "replies": []}, {"body": "yeah, i'm back here too... waiting for an update from OP", "score": 3, "replies": []}, {"body": "The scenario that this guy forgot - they all beat but its not extraordinary and you get massive theta burn.  ", "score": 3, "replies": []}, {"body": "Wow, lost on GOOGL, destroyed in FB and now slaughtered on twitter calls too.\n\nThose AMZN LEAPs are long dated, but looking like his only hope. \n\nGuy said he closed most of the trade after the FB hit. Best move of his career.", "score": 3, "replies": []}, {"body": "Why Twitter calls? ", "score": 2, "replies": []}, {"body": "Long on the \"this will not happen but if it did I have to buy some rope scenario\".\n\nSeriously though good luck. Post an update after the 27th.", "score": 2, "replies": []}, {"body": "We are not worthy.  ", "score": 2, "replies": []}, {"body": "or the following scenario whether hit or miss, the entire market stays where it is and volatility crushes you up.", "score": 2, "replies": [{"body": "This.   I’ve seen this before.   Assumptions are eventually challenged.  ", "score": 1, "replies": []}]}, {"body": "fuck your goog puts, it better shoot to the moon, i've been waiting for 1200 since fucking january", "score": 2, "replies": []}, {"body": "Oh maaaan I was already excited for next week but now you've made me really excited. I'll get the popcorn ready.", "score": 2, "replies": []}, {"body": "I would buy Google puts if I could afford them. Their most recent acquisitions have been for Google Cloud Platform, which blows. on so many levels. It's hard for me to even. ", "score": 2, "replies": []}, {"body": "i would follow you (well like 10% of your stake) but i'm all out of margin. maybe i should sell some boring stock shares hmm.\n\nthanks for keeping the sub interesting!", "score": 2, "replies": []}, {"body": "If Amazon hits and Facebook hits and Twitter hits gonna need to find some female company. ", "score": 2, "replies": []}, {"body": "Or China retaliates to trump's suggestion of 505b tariffs, and the entire market slumps, regardless of earnings results", "score": 2, "replies": []}, {"body": "Congrats on the massive gains!!\n\nCurious when you bought the FB 185 and 207.5 calls? Was it during the data mess overreaction?\n\nFB at 150 was a gift from the stock gods!", "score": 2, "replies": []}, {"body": "Who has DD that will do the opposite of this guy? On GOOG? YouTube is a powerhouse on its own ", "score": 2, "replies": []}, {"body": "Its real shame this post isnt top of the sub ", "score": 2, "replies": []}, {"body": "damn dude... how are your positions after yesterday??", "score": 2, "replies": []}, {"body": "Hey /u/blueblarflubar your post is now on the [YOLO list](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3AYOLO). Re-flair this submission if this isn't a bold trade with some real money.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Congrats, you made it to MARKETWATCH and the NEWS... \n https://www.marketwatch.com/story/one-millennial-options-trader-was-killing-it-then-facebook-cost-him-180000-2018-07-26", "score": 2, "replies": []}, {"body": "When i grow up, i want to be as autistic as you", "score": 4, "replies": []}, {"body": "Do you think Google including the $5 billion EU fine in their earnings is going to make the stock sink?", "score": 1, "replies": [{"body": "That’s like a nickel of their cash on hand ", "score": 1, "replies": [{"body": "I get that, but because they're putting it on their quarter earnings, it essentially wipes out ~75% of the estimated quarter revenue. Should be interesting.", "score": 1, "replies": [{"body": "I’m saying they have $100 billion in cash whatever their earnings report. It doesn’t wipe out anything. \n\n", "score": 2, "replies": [{"body": "This wipes out something like 60% of their earnings. This fine wipes out much of their EPS. It's not just about how much cash they have on hand which I agree is more than enough to cover the fine.", "score": 1, "replies": []}]}]}]}]}, {"body": "I love this play. Great stuff.", "score": 1, "replies": []}, {"body": "Just curious...How long does it take you to do a proper DD. nvm your netflix DD", "score": 1, "replies": []}, {"body": "!RemindMe 14 days", "score": 1, "replies": [{"body": "!RemindMe 28 days", "score": 1, "replies": []}]}, {"body": "RemindMe! 4 Days \"This guy get cucked yet?\"", "score": 1, "replies": []}, {"body": "What amazon call should I buy? I believe 100% it will go up!", "score": 1, "replies": []}, {"body": "Now I feel like an idiot for holding 43.5 8/3 TWTR calls", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Do you have your sell limit order already in place?  Just curious how you go about getting out when things go your way quickly and you want to maximize profit.  ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "This should be gospel.  Thanks man! ", "score": 1, "replies": []}, {"body": ">If it goes against me I'll exit as quickly as possible for a loss and then put it all into calls\n\nWhat if it's a pop&fade like MSFT?  BEcause I think thats how many earnings will play out.  pop up on hype, and then fade and go lower by eow.  Then you'd be losing double the money?", "score": 1, "replies": []}]}]}, {"body": "This didn't age well", "score": 1, "replies": []}]}, {"body": "Shit. I'm commenting just to feel your balls.", "score": 1, "replies": []}, {"body": "I screenshotted the last scenario for later", "score": 1, "replies": []}, {"body": "What about the scenario where trump tweets something stupid and everything goes to shit?", "score": 1, "replies": []}, {"body": "Doesn't google not provide guidance?", "score": 1, "replies": []}, {"body": "Last scenario: trump says something stupid after google earnings and tanks everything.", "score": 1, "replies": []}, {"body": "I’m so hard rn ", "score": 1, "replies": []}, {"body": "Hope you do well simply by virtue of GOOGL puts.\n\nOnly tech company I irrationally dislike ~~despite never having a position open with them before~~ (forgot about a GOOGL play to preempt AAPL I did poorly on last quarter). I think it's the combination of Google+, not taking more advantage of their market share, and their overly sensitive feelings as you mention from articles I've read.\n", "score": 1, "replies": [{"body": "Drops multi-billion dollar government contract because it goes against the virtues of their employees. What the fuckkkk?", "score": 1, "replies": []}]}, {"body": "Sorry to be a pussy but maybe sit out GOOG and split that money between FB and AMZN. Seems like you really don't know how that's going to go", "score": 1, "replies": [{"body": "Thats the whole point of them. Theyre literally only there to be a hedge against his being uncertain on them.", "score": 1, "replies": []}]}, {"body": "I dig all of this, except the GOOG puts, which the whole plan hinges on a bit. I'm just riding GOOG shares and (probably?) playing calls on FB, AMZN, and TWTR. ", "score": 1, "replies": []}, {"body": "Google won't miss but they'll blow the call \n\nChartists say FB isg oin' down ", "score": 1, "replies": []}, {"body": "I don't know i think QQQ can push to 183.", "score": 1, "replies": []}, {"body": "This shit real ", "score": 1, "replies": []}, {"body": "What’s the DD on GOOGL flop?", "score": 1, "replies": []}, {"body": "This guy options and is a god.", "score": 1, "replies": []}, {"body": "i gotta see how this plays out..", "score": 1, "replies": []}, {"body": "Well, I hope your next play isn't to invest in rope - it's only money", "score": 1, "replies": []}, {"body": "Still can’t believe you missed every SINGLE call. $AMZN even tanking after beating earnings (wtf though). \n\nWhatever you did to get this much money for a play like this.... well your luck ran out.\n\nSorry bud, hope you sold the entire play at a decent time before you hit a 4-5 digit portfolio:(", "score": 1, "replies": []}, {"body": "You have a lot courage. But, I wouldn't be surprised if they all missed. \n\nDD:\nIn 2017, my little guitar making shop spent about $1kish on FB and google advertising/services etc. In 2018, I spent nothing. While they did help with awareness, they we're time consuming and didn't   produce much ROI when you factor all the time you spent dealing with people who have a sob story and want a free guitar. \n\nThe effect of tax cuts are more accurately estimated in Q3 than Q1-2. ", "score": 1, "replies": [{"body": "I'm guessing u are here from the link some1 supplied too but this is two months old", "score": 1, "replies": []}]}, {"body": "get fucked", "score": 0, "replies": []}, {"body": "Google will beat, amazon will miss HEAVILY, fb meets or a small miss, twitter beats.\n\nYou're screwed bud, find an insider buddy like me :)", "score": 0, "replies": [{"body": "Amazon will obviously beat ...", "score": 1, "replies": [{"body": "Nope, it's prime day was expected to be far better and it had a server shut-down. It's going to miss. Bigly, just like Netflix did.", "score": 0, "replies": [{"body": "This proves you dont know fuck all. AMZN is reporting on the quarter that ended in June meaning prime day isnt a part of this ER its in the next.", "score": 2, "replies": [{"body": "That was bait m8 of fucking course what do you think I think? That they'll compile last weeks earnings that aren't even definite sales together and publish it? \n\nThe guidance will be miserable and it will tank. It will miss though.", "score": 1, "replies": []}]}]}, {"body": "fb meets and small miss with bad guidance, google beats, wait for it.", "score": 0, "replies": []}]}]}, {"body": "Hey blueblarflubar you marked this submission as a YOLO. If this isn't an entertaining and/or risky trade with a reasonable amount of money then perhaps you should re-flair this before you get banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -11, "replies": [{"body": "Why would you ban our future leader?", "score": 15, "replies": []}]}, {"body": "You've marked this submission as a YOLO. If this isn't an entertaining and/or risky trade with a reasonable amount of money then perhaps you should re-flair this before you get banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -30, "replies": [{"body": "Fuck off bot", "score": 5, "replies": [{"body": "He's only following orders. He falls on his karma sword just to keep things organized. What a bro.", "score": 14, "replies": [{"body": "Well when you put it that way.....", "score": 4, "replies": []}]}]}]}]}
{"title": "If you've been losing money or just generally want to steadily make money, read this.", "selftext": "[deleted]", "id": "90hxi3", "created_utc": 1532107490.0, "score": 444, "upvote_ratio": 0.97, "num_comments": 199, "comments": [{"body": "You forgot one important thing is these kids have no money, thats why they bought OTM FD. Because they are cheap. 6 months ITM option for them? Ya, no way they can buy it.", "score": 212, "replies": [{"body": "Honestly, buying those cheap OTM options and not making any (or losing) money is a great way to learn WHY shits not working out, it's a tuition payment. ", "score": 110, "replies": [{"body": "[deleted]", "score": 59, "replies": [{"body": "How do you lose 15k on options that are worth $5 ? :O", "score": 29, "replies": [{"body": "[deleted]", "score": 50, "replies": [{"body": "Man, as a 19y old, if I had lost 1k on trading I would have cried so hard..\nI still like buying verticals though. Usually I buy calls and then I add one or two verticals on the same company, just for the fun of losing a few $ (worked extra well on TWTR two months ago )", "score": 32, "replies": [{"body": "Im down 2,5k in a pennystock and been so for 8 months", "score": 2, "replies": [{"body": ">Im down 2,5k in a pennystock and been so for 8 months\n\nhave  you bought them out of the money?", "score": 3, "replies": []}]}, {"body": "As a 19 year old I lost $2k trading lol", "score": 3, "replies": [{"body": "I just turned 20, 2 days ago and I’m headed towards that direction lol", "score": 3, "replies": []}]}]}, {"body": "AAPL is why I will never average down on options, only take out a new position further out.", "score": 1, "replies": []}]}]}, {"body": "How tf did you have 30k to gamble on otm calls at 19 years old ", "score": 16, "replies": [{"body": "[deleted]", "score": 36, "replies": [{"body": "You ran your girlfriend out of the country?", "score": 32, "replies": [{"body": "[deleted]", "score": 45, "replies": [{"body": "Right, so how can I get my GF to flee the country?", "score": 26, "replies": [{"body": "Show her your portfolio.", "score": 54, "replies": [{"body": "F", "score": 6, "replies": []}]}]}, {"body": "I’m in that boat, somebody please help me!!! Those are my tendies bitch! (ง’̀-‘́)ง", "score": 1, "replies": []}]}]}]}, {"body": "Naive (rich) parents", "score": -13, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "You're right I'm just generalizing from previous posters on wsb. Trust fund kids lighting stacks on fire\n\nEdit: also should have said I like this post and hope more people here take this advice, even though it's funnier if they don't", "score": 12, "replies": []}]}, {"body": "spotted the poorfag that didnt hustle while young", "score": 5, "replies": [{"body": "lol when I was 19 my part time jobs barely covered freshman fun money. I have to imagine it's pretty rare to save up 30k as a teenager from your own work. I'm 31 y/o and I have friends in careers that don't have 30 grand outside of their 401k", "score": 5, "replies": [{"body": "I'm 35 and I'm sure I have friends who don't have 30 grand inside of their 401k.", "score": 9, "replies": []}]}]}]}]}, {"body": "F", "score": 4, "replies": [{"body": "*Batman Symbol*", "score": 1, "replies": []}]}]}, {"body": "I think it's more that people don't scale properly. They'd rather buy 10 OTM contracts than 1 ITM contract for the same amount of capital.", "score": 5, "replies": []}]}, {"body": "hit it on the nose... the large amounts dont look feasible", "score": 1, "replies": []}]}, {"body": "What I've learned - a daytrader has a far better chance of making money trading options than they do in trading outright stocks/futures/ETFs.\n\nHOWEVER\n\nThis is only true IF the daytrader is able to understand the effects that time, volatility, and price play in the options market, and structure trades that profit off of the inter-relationship of all three variables. \n\nTrading outright calls and puts like lotto tickets is  sucker's bet 80% of the time.", "score": 61, "replies": [{"body": "Yup and an important destinction is you can bag hold a stock and the majority of the time you can break even even if it takes years but you can't baghold an option it eventually expires worthless ", "score": 25, "replies": [{"body": "Unless that stock is GE (though the dividends might make it work). ", "score": 9, "replies": [{"body": "Nah someone did the math the other day, it only reduced your potential loss by like 10% of you bought and held from 2000 till now", "score": 16, "replies": [{"body": "Good lord that’s awful ", "score": 11, "replies": []}]}, {"body": "Or Enron, Citi, Lehman, Deutsche, Banca Monte dei Paschi di Siena, Blackberry, Nokia. Stocks can also definitely expire worthless on bankruptcy or with a loss upon margin call.", "score": 2, "replies": []}]}, {"body": "What? I was told it's only a loss if you sell.", "score": 1, "replies": []}]}, {"body": "shut the fuck up, who i am going sell options to if you explain this? The markets already 80%+ algorithms. I only have WSB to rely on these days to sell IQ puts/calls", "score": 3, "replies": []}, {"body": "Day trading you can use 4x leverage. I was dabbling in it last year with AMD in the first 30 minutes of trading with 10k-20k shares. Worked until I got bored and tried to do it at 2:30...", "score": 2, "replies": []}]}, {"body": "Wait you can buy ITM contracts?", "score": 109, "replies": [{"body": "No that’s just a meme", "score": 59, "replies": []}, {"body": "But you would win less money... so it seems like purely a worse decision. ", "score": 6, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "I'm downvoting you for being a pussy.", "score": 5, "replies": []}]}, {"body": "Stats and options may not be for you. ", "score": 4, "replies": []}, {"body": "You are an idiot if you actually think that is a good reason ", "score": 1, "replies": [{"body": "Only if you are wrong right? As long as you are right, EZ tendies.", "score": 1, "replies": []}]}]}, {"body": "no", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 38, "replies": [{"body": "Explain your spreads strategy. You just sell the one that is green and wait for the other to go green too and you only lose if shit is sideways ?", "score": 7, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Trendlines?", "score": 2, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "LOL", "score": -2, "replies": []}]}]}]}, {"body": "A favorite spread strategy of mine is diagonal or calendar calls/puts when I have a strong read that a company will beat or miss earnings. \n\nASML had a better q then expected. They are the leaders in EUV semi conductor equipment technology that will drive 7nm development by fabs like TSM, Samsung, Gloflo & even sorry ass Intel. ASML is an  excellent play since not only are they the leaders in EUV lithography but the are based in the Netherlands so they won't get fucked by tariffs. They have already hit new new all time highs off the latest results. If you are thinking about buying AMAT calls or common  please don't bc they are losing market share to LRCX & EUV requires less etch & deposition meaning AMAT will have less customers. AMAT will likely end up the big loser in a few years in the semi equipment space.\n\nSo looking down the supply chain line you have MKSI & BRKS who are suppliers to ASML so I would look to sell calls in the week they report and buy calls further out (at least a month). The IV crush and theta decay will kill the premium on the calls sold while still reaping profits on the calls  I bought. I already have a small common position in MKSI so I probably wont do any options for ER with them but may look at BRKS call spreads next week. Still I don't like playing ERs. Its a huge gamble but that is what this sub is all about, right?", "score": 5, "replies": [{"body": "What are the deltas of the long and the short for your calendars?  \nTypically diagonals, if you think the underlying will go up after Earnings? ", "score": 1, "replies": []}]}, {"body": "One I love is long an ITM leg and short an OTM leg about equidistant from the price. You get a leveraged bet on the direction of the underlying within a range, and you don't pay for theta. If you're right you double by expiration, or you lose it all if it lands below your lower strike, but at least you had to be wrong to lose money.", "score": 4, "replies": []}]}, {"body": "Where can I buy vertical spreads on Su bae?", "score": 6, "replies": []}, {"body": "If I'm planning to sell out of the position well before the expiration date and roll forward to a later date, why would I ever want delta working both for and against me? obviously your further otm strike will have a lower delta than your itm leg, but idk why you'd want that penalty. Is the theta neutrality of the move actually worth the delta battle between the two legs in your opinion?", "score": 3, "replies": [{"body": "All these Greek letters man. Isn't the long leg just there to limit your potential loss?", "score": 7, "replies": []}, {"body": "Because if your itm leg becomes otm your losses will start slowing down because the two deltas start to converge. Of course this limits your gains as well but it's a lot less risky and easy af to daytrade if that's your thing.", "score": 5, "replies": []}]}, {"body": "I am just realizing the value of spreads. I’m trying to figure out why I shouldn’t open a bunch of vertical spreads for relatively strong companies like FB, V (eg 1/19 amzn 1820-1840)? What am I missing?", "score": 2, "replies": [{"body": "What you’re missing is black swan events. \n\nAn 1820-1840 spread on AMZN will mean that you have to put up a lot of your own cash to make a little. Sure the probability is low that AMZN goes below 1840 but not non-existent, say after earnings AMZN dips to 1820, you’re going to be losing a lot of money. ", "score": 1, "replies": [{"body": "In the few months I’ve been trading options now, I’ve really learned that lesson, and it isn’t just catastrophic black swan events.  With high valuations and even higher investor expectations each earnings report, it just takes a miss on low guidance to pummel a stock (e.g., like FB I mentioned in my original post--some “safe” somewhat ITM calls cost me a lot).\n\nWhat strategies do you prefer? Avoiding options? Using spreads on indexed funds like QQQ or SPY?  Personally I am sticking to about 10% of my portfolio in options, and those are almost all spreads with 3-6+ months call spreads, mostly in individual companies, but more and more in indexes like QQQ.", "score": 1, "replies": [{"body": "Yep you’re basically getting there and starting to see options for what they are. \n\nI’m sure you’ve heard this before, but risk management is key. What does that mean in relation to options? Well it means that you should   assume you’re going to take a 100% loss on every option trade you make. Options are not like stocks, you can’t hold them forever and eventually make your money back. Markets are designed to go up, so if you’re bag holding an index or a blue chip stable company, you’ll be okay with stock. \n\nIf you assume that you’re going to lose 100% of a single option trade, all of a sudden the amount of money you want to risk is drastically reduced. Start from there.  Now recognize that statistically speaking option traders are notoriously wrong (over 90% of the time) why is that the case? Well because options weren’t invented for gambling, they were originally created as a way to hedge. So when markets are down 2 or 3 days in a row, most hedge fund managers are buying PUTs as a way to protect from FURTHER downside. This does not mean they are BETTING on a market downturn this means they are PROTECTING from a further event. Meaning they hope they are wrong, and most times they are. They don’t care that their options expire worthless.  This means that if you’re trying to use options as a way to BET instead of PROTECT then you need to be doing the opposite, meaning when the market is down 2 to 3 days that’s when you buy CALLs. Don’t fucking buy CALLs after the market has been grinding up for a week. \n\nCombine that with some risk management and all of a sudden you have a decent trade with a pretty decent entry. Now since you’re not risking that much per trade, you can diversify further. Say tech is booming and financials are getting beat down, then you go and you buy financials and you sell tech, spread your risk across multiple trades with long time frames. (Although I don’t suggest trading PUTs to be honest)\n\nAnyway no strategy is good or bad, it’s all relevant to your risk tolerance. Risk management is the name of the game, all strategies are fine. Some people like straight calls, some like spreads, some like strangles or calendars...etc. all of these will blow you up if you don’t understand risk management. ", "score": 2, "replies": [{"body": "Thanks for the response—your suggestion is the approach I’ve been bumbling towards but haven’t ever articulated.  I plan to put your words to use. Cheers.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You have to stay in the game no matter what. When you are in the money with long expiry and it doesn't go your way you lose like 30% but 70% of your principal is still there which you can roll into something else that makes you money. On a fd yolo or weekly that doesn't go your way you get nothing or 90% loss. You then need your next trade or sequence of trades  to make you 1000% gainz to get back to where you started! Most people then start over trading and doing even riskier trades to try to get back up and end up getting $rope don't do that. Stay in the game. The real game is how to not lose your money. The rest doesn't matter  because stock market goes up forever ", "score": 36, "replies": [{"body": "This is exactly what happened to me..see my meme stock purge post", "score": 2, "replies": []}]}, {"body": "I’ve been lurking on this subreddit for a few month, as well as a few other investment subreddits because I was looking for other ways to invest to try and grow my portfolio (only sitting on 20k in stocks and 1k cash). I started looking into options trading because of this subreddit. I didn’t understand a fucking thing 75% of the post we’re talking about, So I read up on options and started piecing things together based off of research and reading post (even shitposts). Thanks for posting this because this was the kind of strategy that I started to recognize might be the best way to go to try and make some $$.", "score": 38, "replies": []}, {"body": "90% chance to make 20% or 50% chance to 400%. Yolo mofo\n\nWait. Meant to say 8% chance at 400% lol ", "score": 26, "replies": []}, {"body": "All in MU 7/20 90c's", "score": 64, "replies": [{"body": "There's still time!", "score": 15, "replies": [{"body": "Shitposts like these still make me smile as I'm down $7k on my MU calls. Half expire next month the other half in October.\n\nSanjay save me", "score": 11, "replies": []}]}, {"body": "Can someone tell me what “90c’s” means?\n\nI got a double B.A. in Finance & Economics. Felt like hot shit until I got here and don’t understand half of this sub’s terminology \n\nEdit: hi hello am v dumb ", "score": -5, "replies": [{"body": "Did you go to ITT tech? 90c’s means he bought calls at a $90 strike price. 7/20 is the exercise date and MU is the stock", "score": 24, "replies": [{"body": "this is the problem.....you should not be in wsb...until you have a basics options understanding....it will really fuck you over trying to follow if a call is a joke or not, if you dont understand the mechanics of greeks, probability, and on top of that.... market jargon. ", "score": 6, "replies": []}]}, {"body": "You sleep through \"History of FDs 101\" ?", "score": 14, "replies": [{"body": "I never went to class, read the entire textbook, bought test banks and YOLO’d through all four years - increasing my adderal take exponentially each semester. Good GPA. \n\nNow I’m buulin’ at the family business studying for the LSAT and GMAT trying to remember how the fuck selling a put works ", "score": 11, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Money. I have no “passion” or “dreams”. I see opportunity at the family business to restructure and adapt in an industry that is in trouble.\n\nIf I decide along the way there is more financial opportunity in Law (hahahahahahahahahahahahahahahahahahahahahahahhahahahahahahahaha) I’ll go there, but most likely get my MBA and jump into corporate finance. ", "score": 7, "replies": []}]}]}, {"body": "Only 2 grades, Winning and Losing", "score": 3, "replies": []}]}, {"body": "Calls with a $90 strike.", "score": 3, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}, {"body": "Nobody tell him", "score": 3, "replies": []}]}]}, {"body": "May as well buy stock, since the deeper ITM a call option is, the closer its delta will be to 1, which is basically the equivalent of owning 100 shares of stock. ", "score": 20, "replies": [{"body": "Deep ITM calls are basically the same as the old price change contracts. I do generally agree though. If you're looking at leveraging by buying deep ITM calls, I'd say you should consider buying shares and selling covered calls. ", "score": 11, "replies": []}, {"body": "Except that the option costs 1/100th and is leveraged by nature but if you plan to hold forever or want sweet 4% divs yes get the stock. I park idle cash in growth stocks that are borring but won't implode and basically guarantee 7-15% a year and pull money from that to trade shorter term things or options", "score": 11, "replies": [{"body": "And those stocks are....?", "score": 7, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Why not just go all in VGT at that point", "score": 3, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Good luck to you!", "score": 5, "replies": []}]}]}, {"body": "Love it, I did stock replacement strategy with my MSFT holdings at the beginning of 2018. I have already rolled them twice and now they are at 85 strike 2020 calls while banking a nice fat profit. I've also sold 2019 upside OTM calls to take advantage of the theta decay and offset drawdowns that may occur.", "score": 1, "replies": [{"body": "Nice job.  This is how it should be done.  What was your initial investment?", "score": 2, "replies": [{"body": "Cost basis on a little more then 200 shares was ~$70. Sold those & bought 2 July 2018 calls at the 70 strike to give me at least 2 ERs initially. I honestly didn't think MSFT could keep growing at that pace bc of its size but I've been happily proven wrong.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Meanwhile the post right on top of this one is some guy buying 250k of FDs", "score": 43, "replies": [{"body": "What is FD lol I took a break from here and come back to seeing it everywhere 🙄", "score": 7, "replies": [{"body": "Nobody tell him that it is an extremely short term way OTM call. MU $90 07/20, for example", "score": 23, "replies": []}, {"body": "First Derivative.\n\nThe first (and shortest time frame) option sold.\nSometimes a couple of days, mostly a week.\nThe highest risk option for that stock currently being sold.", "score": 12, "replies": []}, {"body": "Financial Derivatives.", "score": 11, "replies": []}]}, {"body": "Having done both strategies, you’ll make much more money this way and have way less stress. ", "score": 2, "replies": []}]}, {"body": "Who let this fag in? r/personalfinance is that way------------>", "score": 76, "replies": [{"body": "[deleted]", "score": 116, "replies": [{"body": "Do you have a second emergency fund to refund your main emergency fund? That way if something happens you wont have to wonder what you'll do to refund your emergency fund. ", "score": 42, "replies": []}, {"body": "If you don't have a 12 year fund, you shouldn't be buying faggies", "score": 24, "replies": [{"body": "[deleted]", "score": 46, "replies": [{"body": "and the second coming of christ causes massive price deflation on fish and bread\n\nbuy satan futures just in case", "score": 14, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Seems like a waste until your girlfriend wrecks her Porsche into your wife's BMW and they both lose all their diamonds while fighting and destroying each other's plastic surgery in the back part of your estate near indoor pool #2 and you don't want to bother with insurance because the whole thing would bring shame to your family if anyone found out. ", "score": 39, "replies": [{"body": "At that point it's cheaper to just shoot both and bury them under the pool while renovating it.\n\nI'd you're the kind of guy with a 144m emergency fund, you're probably capable of double homicide to keep that fund intact. ", "score": 11, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "r/gainit", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "otm qqq leaps got it", "score": 9, "replies": []}, {"body": "What about 3-6 months slightly OTM calls?", "score": 8, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "Are you just moving your risk around? If the stock price gets near the strike price then you lose more money than if you just had stonks?", "score": 2, "replies": []}, {"body": "Op you are using itm and otm interchangeably here wtf. Trying to get you thesis. Are you saying if stock price is 50 to buy otm eg 40 or buy 60? Thanks ", "score": 1, "replies": [{"body": "Having reread I get the impression the 60 so itm. Aren't options priced the same though factoring in that it is itm therefore cost more ", "score": 1, "replies": []}]}]}]}, {"body": "this is a simplification but ITM options tie up more capital for less change. for example:  \n\n$500 ITM option, if it goes up it goes to $600, if it goes down it goes to $500. so you gain or lose $100, (20%)  \n\n$100 OTM option. if it goes up it goes to $200, if it goes down it goes to $0. so you lose or gain $100 (double up or lose it all). it looks worse but the delta is around the same, which is why OTM is still attractive.   \n\nhe odds are of course better for ITM (More realistically, the numbers for OTM would be like, $100-> 0-180) at the expense for more capital so if you do have it then it's a better choice overall but OTM isn't the shittiest thing in the world. The same concept applies to short vs long time spans.", "score": 8, "replies": [{"body": "this is why ATM after a dip is my sweet spot", "score": 2, "replies": []}, {"body": ">this is a simplification but ITM options tie up more capital for less change. for example:$500 ITM option, if it goes up it goes to $600, if it goes down it goes to $500. so you gain or lose $100, (20%)$100 OTM option. if it goes up it goes to $200, if it goes down it goes to $0. so you lose or gain $100 (double up or lose it all). it looks worse but the delta is around the same, which is why OTM is still attractive.he odds are of course better for ITM (More realistically, the numbers for OTM would be like, $100-> 0-180) at the expense for more capital so if you do have it then it's a better choice overall but OTM isn't the shittiest thing in the world. The same concept applies to short vs long time spans.\n\nNever  traded  option, sorry I am noob.  Could  you explain to me please  the work around of this stuffin tre  words?  If  I acquire  Apple  aut of the money, what  does it  mean?  What  does it mean to purchase  an option OUT OF  THE MONEY?   The price  is  6$, an Out of the money  price  how much  would  yield  to you?  And  how  much  would  yield  an In the money price?", "score": 1, "replies": [{"body": "explaining doesn't do justice as trying it yourself. download robinhood app, and when u go to buy options, there are choices to pick. date and price. the farther the price is away from current stock price the cheaper it is, which means OTM. i had a hard time understanding options until i just tried it for myself.", "score": 2, "replies": [{"body": "> download robinhood app\n\nI am EU citizen... can I use robinhood to buy USA stock /options?", "score": 1, "replies": [{"body": "that i'm not sure, but doesn't hurt to try. otherwise go to your broker and look up \"option chain\" and look at all the prices. pick a few and buy some and monitor the price every day (every hour even)", "score": 1, "replies": []}]}]}, {"body": "> onths-year out ITM op\n\nexplanation of ITM and OTM and strike price\nhttps://www.tastytrade.com/tt/learn/strike-price", "score": 1, "replies": []}]}]}, {"body": "So I realize this play is OTM, but theoretically, $115 1/19 MSFT calls are not a bad move at all especially the way they’ve been performing and making huge investments in their cloud infrastructure. I can’t afford ITM 1/19’s, so what’s your take on this? It doesn’t seem like a $90 MU FD yolo. ", "score": 7, "replies": [{"body": "Microsoft is a monster. Imo that's a good otm bet.", "score": 2, "replies": []}]}, {"body": "I think you've hit the nail on the head. Although, I don't think steady lower percentage gains is really the preferred flavor around here. It has more of a red or black, +/- 100% type feel.", "score": 5, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "I can appreciate one of #option\\_sniper 's core principles which is get the \"get rich\" mentality out of your head entirely. It messes with your judgement in assuming more short term risk than is rational. Everyone wants to get rich quickly but the cruel reality is that increased time a requirement to increase the probability of success / profit. Anyone can randomly hit the success side of a low probability trade but it all goes back to that \"consistency\" bit.", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yachting.", "score": 5, "replies": [{"body": "Fuck yachts. Trade til I die ", "score": 2, "replies": [{"body": "brb longing $ROPE", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "In the world of investing, patience is key. If you don't have the patience, go deal drugs or tendies.", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Pretty much.", "score": 4, "replies": []}]}]}, {"body": "Only OTM in a week or so i try are bio stocks and some meme stock that is irrationally going up for no good reason on the cheap.\n\nEven then at best 10% of your money for a yolo", "score": 5, "replies": []}, {"body": "How deep ITM do you go? I have no real strategy, pretty much long everything ", "score": 4, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "The correct answer is whatever amount will not make you panic and make bad , emotional trading decisions if you see it 50% gone. I trade much worse if I try to use my entire stack ", "score": 12, "replies": []}]}, {"body": "So buying a amazon FD at a $1760 strike price would be safe?????!!!\n\nOtherwise I will get a Jan 2019 call in the money, say $1820 strike price", "score": 3, "replies": [{"body": "> FD\n\n> safe\n\nPick one", "score": 3, "replies": []}]}, {"body": "So at the moment I have 1000 $ in my Robinhood account what should I do to build this without risking so much on the cheap otm calls and puts. See my head is just telling me to save money at my minimum wage job but I’m 19 and have studying to tend to which makes trading a pretty nice way to make a little money. I’d like to do something I enjoy to make the money and option trading is fun. I like the analysis that goes into it and the return when you make a good call. I’d love to hear your opinion on my situation since you seem like a level-headed individual.", "score": 2, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Thank you for the advice, I would try to increase my funds right now but I'm trying to pay off my student loans as quick as possible by working as much as I can. I don't really want to take the gamble and try to pay off all my loans by trying to double my money or anything. I know it's smart to start investing early but I have to make a set amount of money each year before I can save the extra and deposit it into my account. I have another question regarding trading options safely. What do you think would be the safest spread to maximize chance of profit? Or do spread positions change depending on the company.", "score": 1, "replies": [{"body": "I actually haven't messed with spreads at all, so I'm hesitant to give you advice on them.  But the fact is that 1 well timed trade you had to wait 3 months for is better than 3 poorly timed hastey trades that lose you everything in a week.  The stock market is not a game of making money, but a game of how to not lose money.  \n\nWhat are you studying at OSU?  I was considering going there but they gave me nothing in scholarships.", "score": 2, "replies": [{"body": "Yeah actually I’m studying computer science and they do sort of hoard the scholarships. I mean they used to offer special ones for engineers. They got rid of those. It is easier to get scholarships after the first year though. You find a lot of different things at your school that you can do as well to lower costs like programs and communities.", "score": 1, "replies": [{"body": "Good field to be in at a good time.  You'll do well.", "score": 1, "replies": [{"body": "Thanks, you are seriously one helpful and uplifting dude. I’m gonna get serious about trading this year and hopefully I’ll post to this sub in the green.", "score": 1, "replies": [{"body": "Take it slow! And good luck!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Don't forget that liquidity is important too, ITM options don't give enough leverage so only MM will look to fill them. As a result they will have bad BA spreads. OTM butterflies are a great way to go into earnings a few weeks ahead, you usually can set it up so you get a small credit if you are totally wrong and gain a good amount of money if you are right.", "score": 2, "replies": []}, {"body": "OTM options can still be sold at a profit and not exercised. I make more selling selling the option that septupled in value than actually exercising the thing.", "score": 2, "replies": []}, {"body": "ban this YOLOphobe", "score": 2, "replies": []}, {"body": "good write up. i don't do options, but if i start ill probably start doing this", "score": 2, "replies": []}, {"body": "I've been swing trading stocks without much success (up/down mostly even) because it seems to be the most idiot proof method besides Ally/Index funds. Every time I try to learn options I give up pretty quickly and I'm not putting money into what I don't understand. Still, I'm not too stupid to learn them, just being lazy. Maybe I'll suck it up one day and look at medium term options as suggested above. Thanks OP.", "score": 2, "replies": [{"body": "Don't get too discouraged.  Yes there is a great deal of luck in this, but there's also a lot of skill in finding that luck.  Options is a very tricky thing to come to grasp with if you're not all that familiar with them.  They are a powerful tool though.", "score": 2, "replies": [{"body": "Any particular resource to learn your longer term strategy? It seems there's a ton of different methods out there and I imagine resources are quite varied.", "score": 1, "replies": [{"body": "Honestly for me?  Lose a lot of money.  I learned real quick how NOT to do it.  ", "score": 1, "replies": []}]}]}, {"body": "There's a lot of good material out there on Youtube if you bother to look it up.", "score": 1, "replies": []}]}, {"body": "Excellent advice really. This is a great strategy for those with patience. Thank you.", "score": 2, "replies": []}, {"body": "Okay, say I've got 10k to invest with another 5k every month until January. January is when I need to cash out(I can afford to lose it all, would just suck). I think Amazon is the safest bet around but I can't afford 6 month ITM calls. What are my options?\n\nI currently have it all tied in 3 week OTM calls that I fully expect to lose. ", "score": 1, "replies": [{"body": "MSFT calls 6 months out, maybe a 92.5C.  I'd only do that though if we see it dip below 105.  I don't think that'll happen though.  If you really want the safest bet yet still want to make something, $VGT is always good.  Buying stock.  ", "score": 2, "replies": []}]}, {"body": "How does this affect stock prices I see in memes?", "score": 1, "replies": []}, {"body": "Ok. What's your PYPL position. ", "score": 1, "replies": [{"body": "This is something I also wanted to touch on.  \n\n\nIF YOU DON'T KNOW THE STOCK, DON'T BUY OPTIONS.  \n\nI believe in PayPal, and I think the upcoming earnings will be good for them, but I will not sit here and act like I'm Mr. Know it all about PayPal, which is totally fine!  You gotta realize you can't know everything about everything.  But because I believe in them, I am holding 14k in just stock.  If earnings hits well and guidance is great, hey, maybe I'll make a few grand", "score": 1, "replies": [{"body": "Dude, do I buy calls or not?", "score": 2, "replies": []}]}]}, {"body": "What are your thoughts on 3-6 month options ~5-10% OTM? Extra risk not worth it? ", "score": 1, "replies": [{"body": "If you read above that's how I lost 15k as a 19 year old with Apple.  The prices of those look good, believe me, I know.  It's still a long shot risk though.", "score": 1, "replies": [{"body": "In the above I read the part where you say 5-10% OTM is a terrible idea *one week* out. But I'm talking 3-6 months out. So can you explain how that would go from being a safe ITM play to one where you can suddenly lose everything? I'm just not seeing it in practice, but i'll stop doing it if it actually is terrible and i've just been lucky. \n\nE.g. I typically see people buying long options or even leaps slightly above the money, not in or at the money. Take MartyMoho for example. ", "score": 1, "replies": [{"body": "Okay well I'll give you what happened to me. \n\nI bought 175C April 20th '18.  I bought like 15 grand.  Apple was sitting at 155/160 and it was like.. August.  So I was feeling really good.  Like damn this company can't mess up, they are the biggest, their customers would take a bullet for them, and they have great guidance in services.  So I thought I had a winner.  My average price was like, $9 a contract.  So my breakeven was $184.  Well you remember January, right.  January hit those hard.  So I decided to sell before it got worse.  So I sold, decided to try and make money back by investing my remaining 5k into VIX puts.  Guess where I bought?  10% OTM.  Ended up holding till $0.\n\nI'm not saying you and others can't pick good 3-6m OTM plays that make good money, but it's just not my thing.  I find that I can consistently make 25% of a position with ITM over the course of, what is typically, a month.", "score": 1, "replies": [{"body": "So in cases of extreme drops like the Jan-Feb chaos those ITMs would’ve only dropped like 50% instead 90% roughly do you think? \n\nI know I’m going to get into something eventually that tanks hard like that. So I should start going ITM or at least ATM then? Thanks man appreciate the info ", "score": 1, "replies": [{"body": "Yes, they would've dropped less and I would have felt more confident that I could recover a large portion or more of my initial investment.  The fact of the matter is that losing large amounts of money blows, a lot.  But don't just sit there and live in pity, try to really learn from it.  I mean make that money you lost worth something, get something back from it.  ", "score": 1, "replies": [{"body": "Yeah that’s really good to think about. Ez to focus on gains potential of riskier plays. But it would be a good idea for me to start thinking more seriously about when stuff goes seriously south, and risk reduction. ", "score": 1, "replies": [{"body": "And it's not something that comes easily immediately.  We all mess up and get greedy, we're just humans.  ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If you're getting the same returns as buying shares you're way way way too far ITM.  I'm talking like 10% ITM.  Just enough where you get past all the ridiculous breakeven prices and are working with a high intrinsic value option.  In cases like these you could purchase a $20 option on a 200 dollar stock, and both will move equally.  This allows you to get a 5% gain on what would be a .5% gain if you just held the stock.    ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think I might have messed up and caused some confusion in how I explained things in my above comment.  \n\nWe both mean the same thing.  By purchasing far out and genuinely quality stocks, you can help ensure the stock doesn't go down, but rather up over the long term.", "score": 1, "replies": []}]}]}, {"body": "Except that delta=1 gives you massive leverage. If you go otm, you have to hope that you move sufficiently to get delta through gamma. Also time doesn't fuck you much", "score": 1, "replies": []}]}, {"body": "What is the best app for trading options on your phone? Any free ones that are any good?", "score": 1, "replies": [{"body": "If you're in the US, Robinhood.", "score": 2, "replies": [{"body": "So to be clear only buy calls and NOT puts to keep from oweing robin hood money?", "score": -2, "replies": []}]}]}, {"body": "Why do you reckon institutional traders don't use this strategy? ", "score": 1, "replies": [{"body": "I think they'd have a hard time convincing a board of investors that betting 50-75% of their portfolio on a single stock is a good idea.  It's the same reason you're in wall street bets and not personal finance.", "score": 1, "replies": [{"body": "I didn't realise there was an implied all-in on this strategy.  Why can't it be used on a dozen stocks? ", "score": 1, "replies": []}, {"body": "PersonalFinance seems to be exactly that.  Nothing to do with trading financial derivatives. I can't see your point. I've worked in the financial markets for a long time because its interesting.  Muppets talking about credit scores is as boring as it gets. ", "score": 1, "replies": [{"body": "No you're right.  It could be used on a dozen stocks, given the capital and workforce needed to evaluate them.  \n\nI guess my point is that not everyone is like us, trying to get at least 20% gain from each trade.  In fact the majority just like to dump in a fund/stock/etf and ride it for years.  \n\nThese banks that are worth billions would have a difficult time pushing a trade past the higher ups where there's a possiblity to lose large amounts and not be able to do anything about it.  But who knows, maybe to some capacity they are doing some of this.  I haven't taken a look at JPM or Goldman's info to know whether or not their income is really coming from serious investments, lines of credit, bank accounts, etc.  I'm not sure.", "score": 2, "replies": [{"body": "I think I see the core thing here. An investment bank has a bunch of departments.\n\nWealth Management for rich private clients invest in generally boring stuff with a little PE to make the clients feel special.  Portfolio management stuff right out of the text books.\n\nAn equities trading desk would have no problem getting approval to take this kind of position/use this kind of strategy. But they don't do it.  Because it isn't worth doing.\n\nI'm not sure why you think market risk cannot be managed with this strategy. Nothing magical happens when you buy ITM rather than OTM.  Your option book picks up some greeks especially delta, gamma and theta.  Same as any other option position. The main reason for not buying ITM is that it's terribly capital inefficient. The same kind of return can be generated over the same time horizon using far less capital. \n\nShort version - big guys don't do this because it's not worth doing. ", "score": 1, "replies": []}]}]}]}, {"body": "They're not using their own money. They're using the firm's.", "score": 1, "replies": [{"body": "A traders performance is judged on returns. Their job is to make money. If this was a good way to make money, they would do this.\n\nWhen a trader uses 200mio of balance sheet to generate 30mio of profit in a low variance manner, he's getting a fucking fat bonus.  He really wants that.  He has alimony, coke and hookers to pay for. \n\nWhy doesn't he use this strategy? Remember, he really likes making money. ", "score": 1, "replies": [{"body": "I don't care how great your returns are if you don't know how to manage risk. It's entirely possible to get too cocky and end up losing over half your account because you thought you were right and refused to admit otherwise. ", "score": 1, "replies": [{"body": "Allow myself to quote myself\n\n\"in a low variance manner\"\n\nRisk management was explicitly addressed. I'm not even sure what your point is.  Was it a rough week in the markets? ", "score": 1, "replies": [{"body": "Reading back. My original point was that it's easier to manage risk when it's not your money. ", "score": 1, "replies": [{"body": "Nah, it's harder.  Lots of rules and oversight, and compliance or risk management is always on your ass about something.  Trading for your own account has no limits.\n\nPlus size is a disability.  There are a ton of things little accounts can do to make silly money that huge accounts cannot due to strategy capacity.  Some stuff can only be done small. And big guys can't be fucked because it literally isn't worth their time. ", "score": 1, "replies": [{"body": "There's a lot of of rules but there's no emotion involved. At least ideally. When it's your own account going up and down your emotions tend to get the better of you and you do stupid shit that you wouldn't do with another account. ", "score": 1, "replies": [{"body": "Dude that's called projecting.\n\nPlenty of people don't get mind fucked trading PA. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Hey Tyler thanks for the post - I just spend the last 30 minutes reading the entire thing and reading the comments because I'm here to learn. I've traded stocks and understand the basic mechanics of options (delta) but still trying to make sense of all the wild posts people make here\n\nMy understanding of what you are saying is that buying 6-months out ITM options is a way to leverage your gains on a stock while protecting yourself from short-term volatility. It's a less risky way to benefit from options while protecting yourself from blowing up your account.\n\nSo I went into my options platform and looked up MSFT call options for Jan 2019. There are various ITM options that range from Delta=0.99, 0.88, 0.71. ATM call option is  Delta=0.56\n\nAccording to your strategy which would you recommend?\n\nAlso when do you sell an option? Do you typically set a limit order in case the price spikes up and you can auto-sell at your price target? Do you check on a daily basis and act accordingly during news?\nIs it beneficial to wait closer to expiry date to sell?\n\nThanks man hope to hear back", "score": 1, "replies": [{"body": "So msft is going to be a little bit more tricky because they've already released earnings.  I'll tell you what I did with them.\n\nI bought 1/19 92.5C for $14/c.  This was end of day Thursday.  I knew that MSFT was a very solid company that would do well over the next 6 months.  So I knew I wasn't throwing away my money.  I wasn't exactly sure how their earnings would go, but due to the fact that I'm buying 6 months out, it didn't really matter to me.  I also bought so far ITM that I had a high delta.  I don't remember it but it was probably .80+.  \n\nI saw that they destroyed their earnings, and that they were jumping pretty hard after hours and pre market.  I just set a sell price for $17.05 and let it run and went to sleep.  Woke up and I had made a quick few grand.  Now if the earnings didn't go well, I'd just hold through for a month or two and sell when they are positive.  The beauty of ITM is that my decay is so little and I have so much time that I have no problem just holding for a while.  ", "score": 2, "replies": [{"body": "Thank you, that makes it clear. I will probably test out a similar strategy, this is great for beginners as well since you have a longer timeframe", "score": 1, "replies": []}]}]}, {"body": "what the  fuck I dont come here for good advice", "score": 1, "replies": []}, {"body": "The best way to make consistent income on options is by selling the premium. Buying options is a fool's game unless you have money to burn.", "score": 1, "replies": []}, {"body": "Or buy stock cause the breakeven is literally the price you bought it at. ", "score": 0, "replies": [{"body": "Missing some of the point.  If you buy a stock at $200 and it goes up $1 you made .5%.  If I bought a 6 month out  ITM option for $20 that has a high delta, I made 5%.  The option will react almost exactly to the stock.  It's just leverage.", "score": 2, "replies": [{"body": "Missing some of the point. By increasing your leverage and not playing with an expected value or edge, everyone here is increasing their risk of ruin closer to 100%. You also give up more edge by trading options. ", "score": 0, "replies": [{"body": "Oh really?  Damn dude who knew!  I'll come to you right away next time I want advice.  ", "score": 1, "replies": [{"body": "Why are you being sarcastic", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "respond to this if ur not gay", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Don't buy intrinsic value (ITM). Buy ATM or OTM. Buying intrinsic value is, best case scenario, a break-even strategy. If you want to break even, put your money in a cute little pink piggy bank, wait six weeks, break it open, and take out your \"gainz.\"", "score": 0, "replies": [{"body": "You're wrong in thinking that.  I encourage you to try and limit your risk.", "score": 2, "replies": [{"body": "Limiting risk is good. Buying intrinsic value is dumb. \nIf the price moves against you, the money you paid on intrinsic value is lost just the same as if you had the stock. \nIf the price moves in your favor, the money you paid for intrinsic value is just money you paid for intrinsic value.\nIntentionally paying for intrinsic value is just plain dumb. You cannot gain anything on that portion of your cost; you can only lose on it.\n\nBuy ATM or OTM. ", "score": -1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "You didn't make any gains on the intrinsic value. If the price moved in your favor, you made gains on the rise in price, not on the portion of the stock you *already paid for.* \nIf you had bought that same (call, I assume) ATM, you would have enjoyed the same gains from the rise in stock value.\n\nLet's look at a simple example:\n\nABC Co. is trading at $50.\n\nTyler77i buys an ITM $45 call that expires in August. He pays $5 (intrinsic) + $1 (time) for a total of $6.\n\nTRC1968 buys an ATM $50 call that expires in August. He pays $0 (intrinsic) + $1.25 (time, a bit higher ATM) for a total of $1.25.\n\nABC goes to $58 over the next two weeks.\n\nTyler77i's call is now worth $13 (intrinsic) + $0.50 (time). $13.50 - $6 is a gain of $7.50.\n\nTRC1968's call is now worth $8 (intrinsic) + $0.50 (time). $8.50 - $1.25 is a gain of $7.25.\n\nYou do **not** make money on your position buying intrinsic value. Yes, your call is worth more than mine, but you already shelled out $5 in intrinsic value, so that portion of the \"gain\" is *not* a \"gain.\"", "score": 1, "replies": [{"body": "Okay so what word would you prefer I use to indicate a rise in my position value, as gain is not an acceptable term.", "score": 3, "replies": [{"body": "Consider this: If ABC Co. drops in price to $44, I have lost $1.25 for my now-worthless option; you have lost $6.\n\nIf ABC Co. drops in price to $48, I have lost $1.25 for my now-worthless option, while your option is still worth $3. But since you paid $6, your loss is $3.\n\nThe point is, you don't make money on *intrinsic value.* If the price moves in your favor, you are making money on the change in price; the intrinsic value you previously paid for doesn't get bigger, or improve your return. The $5 you paid for the ($45 - $50) ITM portion of the option (intrinsic value) is still worth exactly $5 if the price moves in your favor.\n\nPaying for intrinsic value carries a risk of loss, with no potential reward of gain for that portion of your cost.\n\nYour gains came from favorable price movement into the then-out-of-the-money price territory.", "score": 1, "replies": [{"body": "You're scenarios are not taking into account key factors of this strategy that strengthen it.  I'm buying far out, my theta is significantly decreased compared to you.  Especially because I bought ITM.  With what you're doing, you're literally betting, and you'd be hesitant to place large amounts of money because you know so.  Whereas the benefit of purchasing far out allows me to ride things out just fine.  You won't be riding anything.  If OTM options are working for you, then continue. ", "score": 1, "replies": [{"body": "Your strategies, greeks, hold time, candlesticks, Bollinger Bands, Elliot Waves, Fibonaccis, stochastics, moving averages, position rolls, special industry knowledge, horoscope, and Magic 8-ball are *completely irrelevant.*\n\nIf you buy intrinsic value, that portion of your cost does not increase in value. $5 of intrinsic value will **never** be worth more than $5, no matter what. You can only **lose** what you paid in intrinsic value; you can never **gain** on that portion of your cost.\n\nPaying $5 for intrinsic value and holding it for 3 months, 6 months, 12 months, 5 years - it doesn't matter. *$5 of intrinsic value will never, under any circumstances, be worth more than $5.*\n\nThere are **plenty** of scenarios where it can be worth less than $5.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
