{"title": "Why $PYPL can bring you tendies TODAY", "selftext": "Today I will convince you to put your entire liquid net worth in $PYPL. All I ask is 3 minutes of your time, and by the time your done reading, I promise your four figure Robinhood account will already be margin call- swimming in tendies.\n\nIn two days it will be the 25th of July. Why is that date important, you may ask? PayPal. Earnings. \"Okay okay u/Sparkswont, PayPal reports their EPS on Wednesday, but why do I give a shit?\"\n\nVenmo. In 2013, PayPal whipped their dick out and made one of the best purchases in the history of the company. For the cheap price of $800 million, PayPal acquired Venmo. Since then, Venmo has exponentially increased the amount of cash they process on a quarterly basis. Since I know most of you faggots can barely read, I've put together a visual for you:\n\nhttps://i.imgur.com/9jDlR0L.png\n\nAs we all know, money isn't paper anymore, it's all 1s and 0s in a database. Only old man Buffet uses tangible money these days, the real money is in the arbitrary \"balances\" in all these fucking mobile cash apps. Trust me, the last time any of my friends paid me in cash was the stone age. It's all through Venmo.\n\n\"Okay sparkyboy, you're starting to make sense. But so what if Venmo is doing billions in transactions? They don't even monetize it.\"\n\nWrong. Venmo takes 3% in fees for every credit card transaction. PayPal is raking in this free cash all because kids these days don't care that 3% of their fucking money is disappearing under their nose.\n\nNow, all that is well and good, but let's look at some historical charts. PayPal is likely to report positive EPS, but we all know that doesn't mean shit (see $NFLX). Let's take a look at how $PYPL has reacted to earnings beats in the past.\n\n&nbsp;\n\nDate|EPS Forecast|Actual EPS|Stock Movement\n:--|:--|:--|:--\n04/25/2018|0.41|0.45|+4.05%\n01/31/2018|0.38|0.4|-5.88%\n10/19/2017|0.32|0.34|+9.09%\n07/26/2017|0.33|0.36|+5.17%\n\n&nbsp;\n\nOf the last 4 ERs, $PYPL has rallied on 3 of them. Fuck me, that's some good odds. Clearly there was a bit of a sell off in January, but it's probably just because of how extra monotone Daniel Schulman's (CEO) voice was sounding that day on the earnings call (trust me, I just listened to it and nearly fell asleep). Maybe people passed out and their head accidentally landed on the sell button, who knows.\n\nAnyways, there's a lot more DD I could do on this, but by now you're already buying $ROPE because of your $MU FDs, so all you need to know is **I am your hail mary.**\n\nLet's make some god damn tenders.", "id": "9187g8", "created_utc": 1532361094.0, "score": 193, "upvote_ratio": 0.97, "num_comments": 116, "comments": [{"body": "u convinced me, yolo PYPL", "score": 82, "replies": [{"body": "You convinced me to short by saying yolo. ", "score": 20, "replies": [{"body": "😂", "score": 0, "replies": []}]}, {"body": "See you on the other side, brother", "score": 18, "replies": []}, {"body": "Yeet", "score": 1, "replies": [{"body": "Haha sold before earnings ", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 58, "replies": [{"body": "You just summarized most of the people in the market. No one baghold long enough. Well unless you bought in GE and sears. ", "score": 34, "replies": [{"body": "Inherited some nice GE stock bought in 1999 @ $47, wishing there wasn't a 3k limit on capital losses", "score": 11, "replies": [{"body": "Lmao, you have my condolences", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "lol why", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I think he's asking why of all things to buy would you buy GE.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Savings account?", "score": 6, "replies": []}, {"body": "> i think ge is at the bottom rn\n\nHehe no disrespesct but I've heard that one for the past 30 FDs time. Why not \"gamble\" on a company you like that's actually poised for growth vs. crapshoot w/ opportunists-rebond.   ", "score": 5, "replies": []}, {"body": "Oh boy\n\n!remindme 6 months", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "GE and free money don't belong in the same sentence.\n", "score": 3, "replies": [{"body": "My father in law dumped a bunch into GE around $16/share. I told him not too bc GE sucks and just isn’t the future of anything. That being said, it is pretty temptingly low right now. Can’t remember if they finally cut the dividend yet or not but once that happens I may jump in. If they don’t cut the dividend I’ll probably stay out. Either way, seems like a gamble to me rather than an investment...", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "— someone who dumped SQ prior to the rally ", "score": 1, "replies": []}]}, {"body": "70% of my portfolio is in PayPal they cartel this fucking industry ", "score": 47, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "SQ inc owning the CASH app is a huge threat to PayPal and is PayPal's direct competitor and seems to be marketing directly against them in a CASH v Venmo battle, short term bullish on venmo/paypal.", "score": 8, "replies": [{"body": "Venmo is griwing more so than square cash, whilst square is a growing company PayPal has too much muscle to lose that battle ", "score": 3, "replies": []}]}]}]}, {"body": "I like it, I'm in lads.\n\nUpdate: Up 12% since I bought in. I owe you a chicken tender dinner.", "score": 34, "replies": [{"body": "Down 24% tomorrow, boy", "score": 10, "replies": [{"body": "I just bought in so probably", "score": 10, "replies": []}]}, {"body": "Let me know when you're free and we'll go grab that tender dinner.", "score": 1, "replies": []}]}, {"body": "solid dd going all in \n\nedit: thanks op my portfolio is almost green today because of you\n\nedit 2: op im green can i suck you", "score": 31, "replies": [{"body": "I'll have my guy contact your guy about getting together on my yacht.", "score": 1, "replies": []}]}, {"body": "I'd give this another day to find entry, it feels a little overbought right now", "score": 22, "replies": [{"body": "It's way overbought on the 5 minute chart, not as bad on the daily. I think you're right though, I think it met resistance at $89.25. Maybe see where it's at tomorrow morning. It's at ATH now, so it will probably keep going up until earnings.", "score": 3, "replies": []}]}, {"body": "Solid DD fag I'll throw some cash on it", "score": 16, "replies": []}, {"body": ">Venmo takes 3% in fees for every credit card transaction\n\nAre they really taking this whole 3% though? Some of it goes to the processors, some of it probably goes to various banks or accounts for risk. Wouldn't surprise me if they were only earning a small fraction of that.", "score": 13, "replies": [{"body": "And deposts are free from a linked bank account. How much of the transactions are via Credit Card? ", "score": 8, "replies": [{"body": "Yeah without this figure the nice visual OP made is useless.", "score": 2, "replies": [{"body": "Yeah but Venmo can get interest on the cash people leave sitting there. Especially if people forget about it. ", "score": 2, "replies": []}]}]}, {"body": "Not venmo, but Plastiq is a similar service. Eliot Buchanan did an AMA over on /churning. Different cards have different fees, really fancy cards are >2.4%, all major credit cards are >1.87%\n\n> Our costs (like almost any payment processor) are based primarily on the types of credit cards we accept. By types I am referring to a few things, namely the brand (Visa vs. MC vs. AMEX, etc.) as well as whether consumer vs. business as well as whether premium (eg; CSR) or basic.\n\n> With respect to the 1.87%, most credit cards that one would accept would cost more than that fee. There are a few exceptions (debit cards, basic [little rewards] cards, some prepaid. But, for example, the CSR card costs well over 2.4\\% to accept and there is no \"negotiation\" that comes with this cost even at scale.\n\n ", "score": 3, "replies": []}, {"body": "Yeah, I think this is the case. Usually CC companies charge 2.9% +$0.30 per transaction. \n\nI haven't dug through PayPals quarterly reports or anything but I was under the impression that PayPal was covering their own fees with this as opposed to really trying to make money.\n\nI actually think any of PayPal, Square, Visa, or Mastercard are good plays, but I'm not sure this DD is correct (I'd be happy to be proven wrong though). ", "score": 2, "replies": []}]}, {"body": "Already long 1/18/19 $100c\n\nEdit: now long the stock as well. Sold all my BA to go balls deep in this pick OP, I’m counting on you ", "score": 12, "replies": [{"body": "How are they doing now? ", "score": 1, "replies": [{"body": "I sold literally the next morning and took the gains. In hindsight I could make myself look smart for selling before the drop but the truth is I sold because the risk of holding through earnings freaked me out too much. ", "score": 1, "replies": [{"body": "I guess you did the right thing haha. How many contracts did you have? ", "score": 1, "replies": [{"body": "I had well over half my portfolio sunk into it in stock and calls, which is why I was freaked out. Not sure on the exact number though, I think it was just under 200 contracts across multiple strike prices. ", "score": 1, "replies": [{"body": "200 contacts? That's around $1.6m if they were executed. I completely understand your fear haha. ", "score": 1, "replies": [{"body": "Hahah no no no they were waaaaay otm, my cost basis was not even 1/3 that amount of money. Still a shit ton of money in my book though ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "God damn it please don’t turn one of my favourite companies into a meme stock", "score": 12, "replies": [{"body": "https://www.youtube.com/watch?v=GSB8p9OlZ5g", "score": 7, "replies": [{"body": "Fucking lol. That made my back to the 9-5 monday morning better.", "score": 8, "replies": []}]}]}, {"body": "Oh fuck off...  now my low key calls gunna be worthless. Damnit wsb", "score": 10, "replies": []}, {"body": " [From Third Point](https://twitter.com/FullySynergized/status/1021426077116370944?s=19)\n\n[Edit: full letter](https://www.valuewalk.com/2018/07/dan-loeb-q2-2018-full-letter-pdf-paypal/)", "score": 8, "replies": []}, {"body": "Okay thanks OP. If I end up in red I hope you get banned.", "score": 5, "replies": [{"body": "I’m no expert, but if you end up red it’s probably your fault for taking investment advice from an internet stranger. :^)", "score": 7, "replies": [{"body": "Wait. Not everything on the Internet is true? Are there really some fags who would play with people money?!?", "score": 2, "replies": []}]}]}, {"body": "All aboard the FD train", "score": 5, "replies": []}, {"body": "GG $PYPL [now a meme stock](https://imgur.com/a/PYgVSMu), you faggots are too easy", "score": 4, "replies": []}, {"body": "You got me. Calls bought", "score": 4, "replies": [{"body": "up 23%....keep this ball rolling", "score": 2, "replies": []}]}, {"body": "Ayy I'm in, let's do this", "score": 5, "replies": []}, {"body": "Thanks for the tip. I bought 10 $88.50 8/3 calls and I’m already up $600.", "score": 4, "replies": []}, {"body": "Been holding PYPL since $30, yea, I fuck", "score": 4, "replies": [{"body": "that's so hot", "score": 2, "replies": []}]}, {"body": "Convinced.  Going in in the AM", "score": 5, "replies": []}, {"body": "And theres a miss..", "score": 3, "replies": []}, {"body": "just purchased 20 contracts of FD's. $3k and change. Expiration 27th. LETS FUCKING GO! Maybe I will fit in finally. ", "score": 7, "replies": [{"body": "38% up, lets go", "score": 3, "replies": [{"body": "nice 23% here", "score": 2, "replies": []}]}]}, {"body": "$88.5 8/10 calls already up 5% thx bb", "score": 3, "replies": [{"body": "That’s what’s up", "score": 4, "replies": [{"body": "Sold this morning for 50% gains.  Might buy more with a higher strike at EOD ahead of earnings.", "score": 1, "replies": [{"body": "Thinking of doing the same", "score": 1, "replies": []}]}]}]}, {"body": "PapaBless - up 30% on a 7/27C. Love you OP. May the sun shine on you forever.", "score": 3, "replies": [{"body": "And you too, my son.", "score": 3, "replies": []}]}, {"body": "Typical of me, I thought I timed the top perfectly...but then it kept going up. 9/21 $90C and $92.5 C's. Thanks fam.\n", "score": 3, "replies": []}, {"body": "tldr; I'm all in", "score": 3, "replies": []}, {"body": "you are 100% right and i got in quick enough to be up 38% already today. THANK YOU", "score": 3, "replies": []}, {"body": "I worked at PayPal once. AMA", "score": 3, "replies": [{"body": "Hello Elon", "score": 4, "replies": []}, {"body": "When did you join/leave?", "score": 3, "replies": [{"body": "Got hired Halloween 2016 left Feb 2018. Shit workplace", "score": 2, "replies": []}]}]}, {"body": "Solid DD, OP. Why did you post it in here?", "score": 3, "replies": []}, {"body": "If Paypal goes up does SQ go up too?", "score": 3, "replies": []}, {"body": "What are your positions?", "score": 2, "replies": []}, {"body": "If I can get some dumb fuck to buy my $33 7/27 T calls I might just throw the rest out on this.", "score": 2, "replies": []}, {"body": "thanks for the DD! bought a few 7/27 $87.5 calls shortly after you posted this morning. already up bigly  \n\n\nalso helps that Third Point put out a positive note on $PYPL ", "score": 2, "replies": []}, {"body": "Zelle is going to pass up Venmo this year in user base size. It’s adding 100,000 users a day and backed by 30+ banks.  Source: https://techcrunch.com/2018/06/15/zelle-forecast-to-overtake-venmo-this-year/\n\nI still think PYPL will do good this quarter though. ", "score": 2, "replies": [{"body": "Shitty DD: Year to date every time a friend has paid me back has been through Venmo or FB messenger. I have never heard of anyone using Zelle.", "score": 7, "replies": [{"body": "Oh same for me too. \n\nI work in banking though and we’re gearing up for massive zelle integration. The more banks that integrate and advertise for zelle the more risk Venmo has of being edged out. ", "score": 1, "replies": []}, {"body": "Chase QuickPay  uses zelle.", "score": 0, "replies": []}]}, {"body": "Those stats are skewed. It seems like it’s counting anyone with a bank app (of those 30+ banks) as a user of Zelle.\n\nInteresting article nonetheless.", "score": 3, "replies": []}]}, {"body": "But what about snapcash? It got cancelled today and my 10/19 are doing fine.", "score": 2, "replies": []}, {"body": "Gonna go Yolo In tomorrow ", "score": 2, "replies": []}, {"body": "call @ 91.5 on 8/3.. Warm the tendies up, brother.. i'm in it with you.\n\n", "score": 2, "replies": []}, {"body": "YOLO", "score": 2, "replies": []}, {"body": "Buyin calls, brother ", "score": 2, "replies": []}, {"body": "You have my sword", "score": 2, "replies": []}, {"body": "fake news lol\n\nI suggest you look at a chart of the market jan 31  - february 08\n\nnote: am long pypl, but fuck me bought in run up to jan 31", "score": 5, "replies": [{"body": "You mean when the entire market tanked hard?", "score": 10, "replies": [{"body": "Yes. A good earnings report cannot be relied upon for the stock price movement all the time.", "score": 2, "replies": []}]}]}, {"body": "I would really love to get in on some of this, but it's super tough to get in since I got some PYPL by buying EBAY way back when it cost $20.", "score": 1, "replies": [{"body": "So, you have PYPL which is why it's tough to get PYPL? ", "score": 4, "replies": [{"body": "Tough to buy more after a 400% gain.", "score": 1, "replies": [{"body": "Yeah, why would you want to make even more money? Nevermind, remembered where I was.", "score": 3, "replies": [{"body": "I think it’s more than fairly valued at these levels, bruh.", "score": 1, "replies": [{"body": "I'd say that's a different argument. \"I don't want to see my percentage gain go down even though I'm making more money\" is what I was getting at. If you'd just said \"I'd rather stick my money in a larger growth vehicle\" I'd have kept quiet.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "15 7/27 ATM FD's checking in. ", "score": 1, "replies": []}, {"body": "Got my calls already ", "score": 1, "replies": []}, {"body": "Cash app > venmo ", "score": 1, "replies": []}, {"body": "FWIW,\n\n1. Most of Venmo's user base isn't using a Credit Card for P2P transfers. They use debit, bank, or funds already in the account.\n\n2. Venmo/PayPal still has to incur the credit processing fee when a credit card is used. For a company that size, I would imagine this would be in the ~1% range per transaction.\n\nPayPal as a company is still heavily reliant on eBay's revenue performance. This to me is a bigger factor than the Venmo factor - especially considering all the points you mentioned were still applicable to prior quarters and should have been adjusted for in earnings estimates.", "score": 1, "replies": [{"body": "Did you not see all the flash-sales from ebay this year? I'm sure the revenues are there... and their strategy is to make up the ebitda on the CC transaction models...\n\nThey are owning the space.\n\nEvil Geniuses.", "score": 2, "replies": []}]}, {"body": "sounds good, only problem is, expected EPS is .56, so actual needs to be .59+ for a positive stock movement. correct me if i'm wrong but based on the historical momentum (charts/table you put) it doesn't look like it'll hit .59, will it?", "score": 0, "replies": []}, {"body": "9/21 call at 105... is all I could afford this morning because I'm poor. Still up tho, who thinks I should hold through or sell before?", "score": 0, "replies": []}, {"body": "You've marked this submission as DD. This better be something useful that might help someone make a good trade. Otherwise you should re-flair this to Discussion or Shitpost before you get banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -13, "replies": []}]}
