{"title": "Alphabet To $7 Trillion By 2025?", "selftext": "We believe Alphabet (NASDAQ:GOOG) is positioned to grow its valuation by well over 3x from the already huge $2-trillion figure now – potentially becoming the world’s most valuable company by a huge margin – as its often-overlooked Waymo autonomous driving business quietly revolutionizes the transportation sector. This would take the stock to over $500 a share. Here’s why.\n\nFact: Waymo has grown the number of weekly paid rides from 10,000 to over 100,000 in the last 12 months. It went from 50,000 weekly rides to 100,000 just in the last six months.\n\nThe growth is compelling and the addressable market is massive\n\nCase in point: Uber does more than 200 million rides each week. Let’s let that sink in. So if autonomous rides can capture even half that market, that would mean 100 million rides per week. That’s about 1,000 times where Waymo is today. 200 million rides a week translates to about a billion a month and over 10 billion a year. At $30 per ride, we’re talking revenues of close to $300 billion per year.\n\nBut wait… there is more to the growth story\n\nIf Waymo is already delivering over 100,000 driverless rides, how many more people might switch from driving their cars to being driven by autonomous vehicles? The shift could be massive. For each person hailing a cab, there are at least 10 others driving their own cars. Many of these drivers might reconsider once they see millions of people relaxing in the back seat, streaming Netflix, while they’re stuck behind the wheel.\n\nIn fact, early data backs this up. According to Earnest Analytics, Waymo is already retaining riders at a higher rate compared to other ride-hailing services like Uber or Lyft. People enjoy the experience of autonomous vehicles. Safety could also be another attraction. Waymo published a report last year indicating that its autonomous vehicles achieved an 85% reduction in injury-causing crashes compared to national rates for human-operated cars.\n\nInvestors will soon recognize that the $300 billion revenue figure for the current ride-hailing market has substantial growth potential – it could easily expand by 2-3x. A $1 trillion market for autonomous rides isn’t out of the question. This growth would also translate to significant revenue opportunities for automakers like Tesla (NASDAQ:TSLA), which are working on their driverless vehicle technologies.\n\nBut wait aren’t so many automakers and tech players working on autonomous driving?\n\nYes, but not all of them are making the same progress. Waymo has a head start in the market. Its main competitor, General Motor’s backed Cruise lost its driverless permits in California after a serious accident, making Waymo the only publicly available robotaxi service in San Francisco. Uber exited its self-driving taxi program about six years ago and has partnered with Waymo to bring its services to the Uber app in some cities. While electric vehicle behemoth Tesla is seen as a leader of sorts in the self-driving space, given its large base of vehicles, it is only slowly getting into the space after the unveiling of its Robotaxi vehicle earlier this month.\n\nWaymo has some advantages in terms of tech as well. It uses a fleet equipped with high-resolution cameras, LiDAR, and radar systems, creating a comprehensive view of its surroundings. And don’t forget Google’s got a secret weapon. It crowdsources annotated data such as CAPTCHA codes from its massive user base, using that to train its machine-learning models. That’s a big advantage in terms of understanding complex driving environments.\n\nThe best part?\n\nThese are self-driving cars – no human drivers, no unions, no employee or contractor issues, and no human cost. While there will be other expenses, such as software development and battery costs, the absence of driver wages could lead to exceptionally high margins. Margins of 50% aren’t unrealistic when you consider that driver earnings account for a substantial portion of gross fares in traditional ride-hailing models.\n\nIf Waymo can capture about one-third of the $1 trillion autonomous rides market, it could generate annual revenues of around $300 billion. With a 50% margin, that’s a neat $150 billion in profits. What’s that worth? At a 30x earnings multiple, that would imply an additional valuation of about $4.5 trillion for Alphabet. Considering that Alphabet is worth roughly $2 trillion presently, this could take the company’s market cap to over $6.5 trillion, or over $500 per share.\n\nTo be sure, building this sort of scale can take a good deal of time – quite different from signing up for say a Google or Netflix account. However, investors will need to look well out into the future. Think 2030 (not 2025), maybe even more. The point is not to get stuck – if you’re concerned, look even further out, say 2035! The bottom line: Alphabet is growing Waymo quickly, has the technology and competitive edge, and is addressing a potentially massive market, making this high valuation within reach.\n\nSource: Alphabet To $7 Trillion By 2025? https://www.forbes.com/sites/greatspeculations/2024/10/23/alphabet-to-7-trillion-by-2025/", "id": "1ga9gk5", "created_utc": 1729686932.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 71, "comments": [{"body": "So alphabet more than tripling their market cap within a year? You start smoking early today?", "score": 160, "replies": [{"body": "The \"we\" is him and the weed.", "score": 48, "replies": [{"body": "He meant weed", "score": 3, "replies": []}]}, {"body": "Hope he started yesterday", "score": 5, "replies": []}, {"body": "Where's that extra $5T mkt cap going to come from? Israel becoming a U.S colony like Puerto Rico?", "score": 2, "replies": []}, {"body": "Have you forgotten NVIDIA? Also title was probably deliberately chosen provocatively. But yes, Waymo’s potential is immense. I recently read a Bloomberg article that, without AI, 2024 would probably have been the year of autonomous driving on the stock market.", "score": -36, "replies": [{"body": "Do you know how much wealth it is to add 5 trillion market cap? It's absolutely insane how much money it would take for this would happen by next year ......", "score": 8, "replies": []}, {"body": "> “I read a Bloomberg article”\n\nYou mean the propaganda rag the capital class uses to tell you which stocks to buy/sell that will further enrich them at your expense? What’s next, Business Insider?", "score": 7, "replies": []}, {"body": "What do you mean have I forgotten NVDA? What does NVDA have to do with this post? It’s just nuts to think one of the biggest companies is going to more than 3x its market cap in a year all because of… autonomous driving, a sector which doesn’t really exist currently outside of very small trial markets", "score": 19, "replies": [{"body": "Please read the article and not just the title:\n\n„However, investors will need to look well out into the future. Think 2030 (not 2025), maybe even more. The point is not to get stuck – if you’re concerned, look even further out, say 2035! The bottom line: Alphabet is growing Waymo quickly, has the technology and competitive edge, and is addressing a potentially massive market, making this high valuation within reach“", "score": -13, "replies": [{"body": "Bro, it’s your title in responding to and the bait and switch to 2030 happens in the very last paragraph. Don’t write sensational shit if you don’t want responses telling you how ridiculous it is", "score": 9, "replies": [{"body": "Its a Forbes piece, not my article", "score": 0, "replies": [{"body": "You chose the title you posted with, no?", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "So, the thesis is that waymo will fully capture the entire US ride-sharing market by....next year? And people will give up their cars and use those services as well by.....next year?\n\nAlso, waymo has to buy and maintain their own cars, unlike Uber. Therefore, they are likely to have much higher costs than Uber. How fast can waymo even manufacture their vehicles?\n\nNo offense, this reads like something ARKK would put out.", "score": 60, "replies": [{"body": "I don’t think even the entire worldwide ride share market would equate to 5 trillion in market share by 2025", "score": 6, "replies": [{"body": "UBER has a market cap of $168 billion. This argues waymo alone will be worth 50x that by next year.", "score": 10, "replies": []}, {"body": "It’s not just about the rideshare market. It’s about revolutionising the transport system. First taxis and Uber and Lyft will be replaced, then second cars and at some point people will also give up their first cars. Especially in urban centres. Furthermore it’s not just about the private market, but also about commercial goods transport. Personnel costs are the highest opex cost driver. Waymo is doing away with them. This is one of the markets in which AI will show the greatest benefit, its easy to see that.", "score": -4, "replies": [{"body": "Sounds extremely optimistic, a bit far fetched, but most important quote a ways away", "score": 2, "replies": []}]}]}, {"body": "It's the cathie woods model of vacation ", "score": 3, "replies": []}, {"body": "Not just this they will have multiple lawsuits if the cars are faulty and provoke accidents", "score": 1, "replies": []}, {"body": "The article doesn't say Waymo will capture the full market by next year, just that investors will start to price that in as that will eventually happen. I think they're smoking something. It's way too early to start making that assumption.", "score": 1, "replies": []}, {"body": "Their thesis is even more absurd if you google how many cities Waymo has expanded into in the last year or two, it's a number in the low to mid single digits. \n\nThat alone should tell you just how absurdly long it's going to take for Waymo to get anything close to being able to drive you from anywhere on East coast to anywhere on the West coast or vice versa. And until they can do that no one is going to give up their car, nor can they accomplish a number of other potential uses for self driving vehicles (like for example ditching drivers in delivery/shipment vehicles).", "score": 1, "replies": []}, {"body": "1. The title is just provocative. Please read further \n\n„However, investors will need to look well out into the future. Think 2030 (not 2025), maybe even more. The point is not to get stuck – if you’re concerned, look even further out, say 2035! The bottom line: Alphabet is growing Waymo quickly, has the technology and competitive edge, and is addressing a potentially massive market, making this high valuation within reach“\n\n2. Waymo will never have higher costs than Uber. The average Uber driver in the US earns $20/hour after all expenses are deducted. A year has 2080 working hours per a normal 40-hour week. That would already be a saving of $42,000 for Waymo. However, the Waymo AI driver does not have to sleep, so the vehicles will have a utilisation rate of 60-70%. Waymo easily saves $100,000 per year in operation compared to Uber. The costs for retrofitting and maintenance will be high, but are nothing compared to the savings.", "score": -5, "replies": [{"body": "1)I read that part. Why title it 2025 if you mean 2035? It's just pointless. It instantly discredits the whole piece. \n\n2) waymo saves on driver expenses, but they have vehicle expenses. Those vehicles need to be purchased, fueled, insured, and maintained. That costs money. Uber doesn't have those expenses because their drivers do it out of pocket. Waymo doesn't have zero expense. \n\nHow much does gas cost? Let's say a waymo gets 30mpg and gas is $3/gallon. If a waymo drives 100,000 miles per year they use 32,000 gallons of gas or $10,000. That's not a lot of driving for something going 24/7. Plus, maintenance. Plus, how much does a new waymo car cost to buy? That's also not a lot of miles driven.", "score": 5, "replies": []}, {"body": "There are a lot of assumptions here and if any of them are off just a little this gets a whole lot lower.  Will Waymo take market share from others? Yes.  Will it add value to Google?  Yes.  But I don’t feel it’ll be even remotely what the article claims.  \n\nI’m also interested to see what regulations will be tied to autonomous vehicles such as maintenance standards, maximum allowable age or miles/hours, insurance and other regulations they haven’t invented yet", "score": 1, "replies": []}]}]}, {"body": ">Alphabet To $7 Trillion By 2025?\n\nNo. You're welcome.", "score": 37, "replies": [{"body": "TLDR: No.", "score": 2, "replies": []}, {"body": "Google is dying their search is broken and everyone moving to chatGPT etc for search. Waymo wont offset the collapse in search ads that’s coming", "score": -6, "replies": []}]}, {"body": "$7 trillion is a bit out there, but yes, I am bullish on Google too. I expect it to double in 2 years. Google’s forward PE today is almost half of that of Apple, Microsoft etc. Google is positioned best right now with AI (own model, trained on own hardware, tons of data and their own cloud service). They also have some amazing long term bets like Waymo.\n\nThe main risk is regulatory, with all the talk of breaking up Google", "score": 15, "replies": [{"body": "The main risk is, imho, CEO&board that HATE making profit, let alone taking risks. \n\nIt's basically a advertisement company with a side job of being activist non-profit org right now. No new product for ages. \n\nbtw, they developed the transformer tech for AI - but still don't have any useable AI product. ChatGPT, facebook, microsoft, all seem to be way ahead of google", "score": 1, "replies": []}]}, {"body": "So Uber currently have 200million rides so therefore their revenue is 600billion? Somebody needs to tell Uber this, as they have misstated their  revenue quite dramatically.\n\nWhat a nonsense and poorly researched thesis.", "score": 8, "replies": []}, {"body": "This is looney tunes", "score": 6, "replies": []}, {"body": "NVDA to 10 trillion by 2025? Because it has a positive EPS with infinite scalability. Same with meta,  Amazon, pltr, Microsoft, and every other company that hasn't gone out of business yet.", "score": 3, "replies": []}, {"body": "This is way too optimistic. Lol. But yea, GOOGL is a still a long term hold for me. They have a lot going for them. My only concern is the leadership. They've got their hands on a lot of cool stuff that can potentially print them some money\n\nNotebookLM, Waymo, Wing, Calico, Verily, Isormophic labs. Plus their investments in Medical AI, robotics and Quantum Computing\n\nAnd they still got their golden goose is Search, Android , YouTube. GCP is also picking up.", "score": 5, "replies": []}, {"body": "Waymo in its current form is massively unprofitable. You can’t just scale up their numbers and assume they become a $6T company, because they’d literally go bankrupt from the trillions of dollars in losses it would take to operate that size of a fleet. \n\nTheir retrofitted cars cost something like $180k when they need to ideally be under $40k for the payoff to make any sense. That isn’t going to happen next year. Probably not for a decade. \n\nNot to mention Waymo rides are currently more expensive than a comparable Uber or Lyft ride. If they expect widespread adoption then their fares need to get cut in half, which circles back to the massively unprofitable issue.", "score": 4, "replies": [{"body": "It also takes an absurdly long time for them to rollout Waymo to new locations, which has resulted in them doing it in very few places each year. \n\nWorse yet, their methodology for solving self driving is going to make it absurdly expensive for them to roll out robotaxi's that can take you anywhere in the US. And this is going to seriously limit it's potential at being anything other than a taxi service (which IMO is where only a fraction of the market value will be once full self driving is solved on a nationwide basis)", "score": 2, "replies": []}]}, {"body": "Why would they be able to charge enough to earn a 50% margin in a competitive market. It relies on no one else being able to develop the same technology. That's a pretty big bet. And 3x in 11 years (based on your 2035 number, which is the only even slightly reasonable one)? That's only a 10.5% CAGR. Not amazing, considering the leap of faith you're taking in assuming no one can develop the same tech.", "score": 2, "replies": []}, {"body": "Just put the fries in the bag....", "score": 2, "replies": []}, {"body": "Alphabet will be split up and half their market cap is even more realistic", "score": 2, "replies": []}, {"body": "To double by 2025 would be wild. I honestly wonder if you understand the huge divide between billion & trillion. \n\nAnd then to say, “well just look out to 2035”. 10 years is an eternity in a public company. \n\nI think you’d do better to present a pro/con list of Waymo, address possible/likely challenges they’ll have in the next 2 years. People would appreciate this. \n\n7 trillion isn’t happening even by 2030. Hence why you can’t buy an option on it. Best wishes.", "score": 2, "replies": []}, {"body": "This ludicrous call just motivates me to sell all of my shares in Google from 2019 to be honest, if I were to do something drastic.\n\n\nI was wrong to say sentiment is in the trash can here. It's not, you have too many people thinking the stock is an uncovered gem, and it's why it won't return to its all time high to wrap up 2024 while the Nasdaq is probably at 99%+ to do it.", "score": 2, "replies": []}, {"body": "The best way to destroy your vision is to let Randos online discourage you. How about using there blindness as fuel to re-up and later come back with your gains. I’m already loaded up on Google and feel more validated with your post.", "score": 2, "replies": []}, {"body": "Ludicrously naive. \n\nFirstly there's tonnes of human cost to driverless vehicles. They need oversight, rescue, cleaning and maintainance, things which the driver usually does. \n\nIt's really not clear what waymos margin structure is like and if theyre making any profit at all it would be a shock given the high cost of the vehicles and the amount of mapping and monitoring they require. \n\nSecondly Google is getting it's search businesss, which makes 90% of it's profit, disrupted by chatbots while we speak. \n\nIf next gen chatbots are a similar step up then Google is done then.", "score": 2, "replies": []}, {"body": "A 7T mc? By 2025? I'm sorry, but what are you smoking?", "score": 1, "replies": []}, {"body": "Lina Khan says “hold my beer”", "score": 1, "replies": []}, {"body": "Source: my own article. Please click on my link as I'm desperately trying to drum up traffic.", "score": 1, "replies": []}, {"body": "Why not 10 trillion?", "score": 1, "replies": []}, {"body": "“If autonomous rides can capture even half their market?” \n\nPass me the weeeeeduhhh", "score": 1, "replies": []}, {"body": "Thank you ChatGPT", "score": 1, "replies": []}, {"body": "They're so many yappers who are just full of shit.", "score": 1, "replies": []}, {"body": "This post sucks", "score": 1, "replies": []}, {"body": "Okay. Interesting. Now OP can buy GOOGL. I won't compete with you for their shares.", "score": 1, "replies": []}, {"body": "Bookmarked to laugh at in a year. Either at you or myself, we'll find out which", "score": 1, "replies": []}, {"body": "Cathie Wood go to bed, you smoked too much man.", "score": 1, "replies": []}, {"body": "I've worked with tons of self driving cars startups in the Bay area as an advisor..most of them have shut down\n\n\nWhat a stupid thesis", "score": 0, "replies": [{"body": "Waymo gives 100 000 rides a week", "score": 4, "replies": [{"body": "Waymo is not the only player in this game. Neither is the US the only country.", "score": 0, "replies": [{"body": "Waymo is indeed the only player which has a functioning system on the street, giving 100 000 rides each week", "score": 1, "replies": [{"body": "This sub doesn’t allow YouTube links.\n\nGo to YouTube and search “CNBC China autonomous cars”\n\nYou want “functioning system on the street”? “Paying customers” maybe? Waymo has plenty of competition.\n\nStop assuming the US is the only player in town. Having tunnel vision is what’s going to lead to not knowing what hit you. \n\nCompetitions from overseas are every bit as sophisticated as what Waymo is capable of, and sooner or later you’ll need to face off with them.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think it has potential to add a lot of value to Google, but $7 trillion by 2025 is just an absurd notion. There's also a lot of assumptions made here that you can poke holes in.\n\nAlso, I might be in the minority, but I will never go full autonomous vehicles. One of my favorite things is driving my old ass Range Rover with the windows down on a sunny day.", "score": -1, "replies": []}, {"body": "TLDR: Autonomous driving is a trillion-dollar market that is not just about replacing Uber, Lyft or taxis, but about changing the entire transport sector. In this huge market, Alphabet, with Waymo as the technology leader, has the opportunity to gain huge market share which could result in billions of $ in annual profits.", "score": -17, "replies": [{"body": "Personally, I think your thoughts are spot on but too bullish.\n\n3-5 years to start to make a significant dent into Uber. 10-15 years to have it be more commonplace to replace a personal vehicle outside of niche early adopters", "score": 2, "replies": [{"body": "Thats too conservative. Waymo already does 100 000 rides a week. There are literally waitlists for new users. It will completly replace Uber and Lyft in the cities where the service is offered in the next 2-3 years. Why should anyone want to take a less reliable, more accident prone and more expensive car riding service?", "score": 1, "replies": [{"body": "Because it takes time to make/get that many cars", "score": 1, "replies": []}]}]}, {"body": "Why are you being downvoted? 😂. All you did was summarize the whole thing", "score": -3, "replies": [{"body": "People on Reddit hate Alphabet. I am 50 k in, 100% of my portfolio. Alphabet is cheap af and Waymos potential gigantic. We will see who is right in 2 - 3 years.", "score": 2, "replies": [{"body": "!Remind Me 3 years", "score": 2, "replies": [{"body": "I will be messaging you in 3 years on [**2027-10-23 13:26:16 UTC**](http://www.wolframalpha.com/input/?i=2027-10-23%2013:26:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1ga9gk5/alphabet_to_7_trillion_by_2025/ltc6ofd/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1ga9gk5%2Falphabet_to_7_trillion_by_2025%2Fltc6ofd%2F%5D%0A%0ARemindMe%21%202027-10-23%2013%3A26%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ga9gk5)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "For the records, I like Alphabet as a core business. I just think you're wrong about Waymo and your entire thesis revolves around that.", "score": 1, "replies": []}, {"body": "!remindme 3 years\n\nI'm not doing this to be an asshole, just curious", "score": 1, "replies": []}, {"body": "I don't think they'll hit 7 trillion in 2-3 years but I'm also bullish on Waymo and some of their other bets long term", "score": 1, "replies": []}]}]}]}]}
