{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1gatx8s", "created_utc": 1729742428.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 76, "comments": [{"body": "J SHAPED RECOVERY", "score": 15, "replies": [{"body": "Aged well", "score": 1, "replies": [{"body": "J allows for more time than the V, ok? could take a day or two", "score": 2, "replies": []}]}, {"body": "Gotta love this comment❤️", "score": 1, "replies": []}]}, {"body": "I know this is Nvidia, but the TSMC sub isn't very active.  Curious on thoughts about this analysis of semiconductor industry and stocks, especially the parts about TSMC and its competitors.  I'm not technically knowledgeable in the field of semiconductors, but it generally lines up with my knowledge of the current marketplace. \n\n\nFor reference, my portfolio is 30% Nvidia and 70% TSMC.  Yes, I know. \n\n\nhttps://irrationalanalysis.substack.com/p/extrapolating-asml-and-tsmc-earnings", "score": 6, "replies": [{"body": "Ai infrastructure is the way to invest right now. Demand will be super high for at least a little longer. And AI will be the hot trend of the year again. It’s stealing part of every industry", "score": 2, "replies": []}, {"body": "You’re going to do great, less great than if the ratios are the other way around, but still great", "score": 1, "replies": []}]}, {"body": "Jeeze how many morons shorted tsla into the report, why can't we have these clowns for our earnings calls", "score": 6, "replies": [{"body": "My TSLA shares are jumping for joy on top of these shorts!  🤑", "score": 3, "replies": [{"body": "10% left of 20%. Classic Tesla", "score": 1, "replies": []}]}, {"body": "I am slicing my balls off as we speak", "score": 3, "replies": [{"body": "When do ur puts expire?", "score": 2, "replies": [{"body": "I don't know, i bought TSLZ", "score": 2, "replies": [{"body": "Rip", "score": 1, "replies": []}]}]}]}, {"body": "I shorted up top after the price hike", "score": 2, "replies": []}]}, {"body": "140 never seemed so low!", "score": 6, "replies": []}, {"body": "I think im positively ret4rd3d. I opened a short on tesla afeter the huge spike. It just keeps going up. WTF?", "score": 4, "replies": [{"body": "Its tesla give it a week it will correct…", "score": 9, "replies": []}, {"body": "Why tf would open a short on the day after a good earnings report. Obviously it’s gnna go up", "score": 2, "replies": []}]}, {"body": "That dip and pump that just happened was totally manipulated lmao 🤣", "score": 3, "replies": []}, {"body": "Comfy holding and waiting", "score": 5, "replies": []}, {"body": "Rat basterd tsla stealing our bullish call volume mojo", "score": 3, "replies": []}, {"body": "Nice upward action going into end of day", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "Where's the recovery? What happened to NVDA $145?\n\n  \nDaddy Jensen, please save us.", "score": 5, "replies": [{"body": "The stock is fine lol . Totally natural movement", "score": 9, "replies": []}, {"body": "Brother its been 2 days", "score": 6, "replies": []}, {"body": "We’re cooked!", "score": 3, "replies": []}]}, {"body": "This stock is about to bust💦", "score": 2, "replies": [{"body": "I've been edging the whole morning. When will it bust, cuz I can't take it much longer.", "score": 4, "replies": []}, {"body": "What makes u think that?", "score": 1, "replies": [{"body": "A million reasons to bet on AI", "score": 1, "replies": []}]}]}, {"body": "What happees to tsla? Will it burst?", "score": 1, "replies": [{"body": "We need them to succeed and buy a shit tonne of chippos", "score": 2, "replies": []}]}, {"body": "https://novonordiskfonden.dk/en/news/denmarks-first-ai-supercomputer-is-now-operational/", "score": 1, "replies": []}, {"body": "Pour one out for the WSB’ers who bought TSLA puts on Monday expiring tomorrow.", "score": 1, "replies": [{"body": "Rip", "score": 1, "replies": []}]}, {"body": "I just woke up from a dream in which NVDA went up 69% in AH😩what a disappointing day.", "score": 1, "replies": []}, {"body": "I really thought this would pump today", "score": 1, "replies": []}, {"body": "Is there hope nvda goes back to 144 and above??? I literally bought 17k worth at 144 and feel bad. But today gave me a little bit of hope", "score": 1, "replies": [{"body": "You're acting like the stockmarket will close forever in a few days\n\nIts not possible to wait for a few weeks? \n\nForget Nvidia ... you need to purchase patience", "score": 9, "replies": []}, {"body": "sell covered calls and have it work for you in the meantime.  It'll surpass 144 in the near future", "score": 3, "replies": []}, {"body": "If you hold temporarily, you will get nothing.", "score": 2, "replies": [{"body": "I see what you did there. Lol", "score": 2, "replies": []}, {"body": "I'll hold till earnings and pray. I hope to get something!", "score": 0, "replies": []}]}, {"body": "Hold do not trade. ", "score": 2, "replies": []}, {"body": "Its a long term hold you put yourself in, down days are not bad days. The money from the impatient go to the wallets of the patient.", "score": 2, "replies": []}, {"body": "Absolutely no chance. Definitely dump everything pre-market tomorrow.", "score": 1, "replies": []}, {"body": "Hold for long term and don't think about it. You bought at ATH like people did in the summer, and we're just now seeing similar levels.", "score": 1, "replies": []}, {"body": "dumb", "score": -2, "replies": []}]}, {"body": "When will this go up", "score": 1, "replies": [{"body": "When you sell", "score": 3, "replies": []}, {"body": "After it goes down", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "As an Asian and a Taiwanese, I can confirm this is racist.", "score": 4, "replies": [{"body": "Only good stereotyping allowed, Lisa su jensen born w silicon in their veins", "score": 1, "replies": []}]}, {"body": "racist spotted", "score": 1, "replies": []}]}, {"body": "27 days until earnings. You scared? Or scared to sell? \n\nI’ll trim some on Halloween when mag 7 reports", "score": 0, "replies": [{"body": "Not really i’m in for 20 years", "score": 1, "replies": []}, {"body": "Now is a terrible time to sell. Nvidia has been flat for the past four months. \n\nThe same exact thing happened last summer, then it took off 200% in less than a year.", "score": 0, "replies": [{"body": "Lol.", "score": 0, "replies": [{"body": "Bro said \"loading at 125\" the other day. You mad?", "score": 3, "replies": []}]}]}]}, {"body": "Please get out of this stock. For people who want gains who joined later: you will not get it here. These people already made their money.", "score": -6, "replies": [{"body": "Why do you think it’s necessary to give people horrible advice ?", "score": 7, "replies": []}, {"body": "The future is AI. Don’t get overly concerned with daily stock price movements", "score": 2, "replies": [{"body": "Even if this stock grows. It’s the law of big numbers. Your growth will not be that high that fast. For people who were looking for growth that nvidia has early on and missed that, you will not get that here. It’s the truth, I may get downvoted. But you can admit this.", "score": -4, "replies": [{"body": "You're right though, the growth of the largest market cap stocks historically have been relatively low. This run up is only because its a 3B$ company that was 1B$ last year. There is no chance it runs up to 9B$ with another 3x next year.", "score": 1, "replies": [{"body": "You dropped a T.", "score": 2, "replies": [{"body": "Darn my whole argument is in shambles", "score": 3, "replies": []}]}]}, {"body": "I agree somewhat. AI still has huge room to grow but at the same time I just checked the SP500 index and it grew 92% over the last 5 years. I have to ask myself, will Nvidia be a $6T company in 5 years? If not then it might lag the index. Obviously past performance and all that but still something to think about.", "score": 1, "replies": []}]}]}]}, {"body": "the fucking manipulation in this ticker...cant wait for jensen to get arrested", "score": -14, "replies": [{"body": "You must be new here lol. Did you buy at $140+ lol.", "score": 8, "replies": []}, {"body": "Ok brojangles", "score": 2, "replies": []}]}]}
{"title": "$SBUX makes zero sense right now", "selftext": "They just had their worst quarter in recent years. EPS down 24%. The stock market indexes yesterday were blood red, yet Starbucks was up on the news. Who is buying at these prices and why? Forward PE of 27, guidance for 2025 removed, and a PEG that’s estimated to be anywhere from 2.5 to 3. Looks like it’s insanely overvalued.", "id": "1gb00iz", "created_utc": 1729768149.0, "score": 52, "upvote_ratio": 0.86, "num_comments": 72, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Take a look at the forward PE of Chipotle and the previous CEO name. Investors think the same will happen with Starbucks.", "score": 1, "replies": []}]}, {"body": "It's us vs all the girls drinking pumpkin spice lates and frappachinos", "score": 51, "replies": [{"body": "Not sure if the girls are actually doing that because of the calories and costs.  They now have to spend money on compounded tirzepatide and semaglutide to lose weight.  $400 a month or so.", "score": 12, "replies": []}, {"body": "The are all migrating to BROS, that is the problem for Starbucks, along with prices that drove others to other places like Black Rifle, etc.", "score": -10, "replies": [{"body": "Bros is a sugar coma crap for $9.\n\n\nLocal coffee shops are growing. Flight to quality all over, fake tequila with additives being replaced by additive free, etc etc. Consumers are getting good tastes with the proliferation of info. Doesnt help that 'cheap' stuff isnt even cheap anymore, makes the choice easy.", "score": 8, "replies": [{"body": "I’ve never even heard of Bros but had a chuckle because sugar coma crap is exactly how I’d describe Starbucks as well.\n\nGood to hear local coffee shops may be growing.", "score": 1, "replies": []}]}]}]}, {"body": "Same with Boeing. They literally can’t manufacture because their workers are still on strike, it’s been a month now.\n\nAny other company would have been shorted to hell. Market is fake, no one can change my mind.", "score": 95, "replies": [{"body": "To be fair, me buying Boeing calls was still a dumb idea", "score": 29, "replies": []}, {"body": "What other company has a decade plus of backorders totaling billions, that no competitor has capacity to steal even if the customer could cancel?", "score": 17, "replies": [{"body": "Based on Boeing's record the last 5 years, you need to factor in the liability that comes after fulfilling the backlog.", "score": 4, "replies": [{"body": "Air travel, even on a Boeing, is statistically safer than ever before. 2023 was the safest year on record, despite record amounts of travel.\n\n\nBoeing however has not improved like their competitors have.", "score": 1, "replies": []}]}, {"body": "I swear the market is *ripe* for one of Embraer, Dassault, Bombardier etc. to step up to making bigger planes. It would take a lot of investment but they all have what it takes to develop one. Boeing's ceaseless fuckups steal the headlines but Airbus has been tripping over themselves too.", "score": 4, "replies": [{"body": "Bombardier C series was talking off, US killed it to protect Boeing. Bombardier basically handed the whole plane to airbus. \n\nOnly true competitor would have to come from China, and that also won’t really fly in the US.", "score": 4, "replies": [{"body": "I'm not sold. Explain why it couldn't come from France or Brazil. You're saying that because Bombardier didn't have the resources to keep the cseries in-house implies that no one will ever be able to enter the market?", "score": 6, "replies": [{"body": "Bombardier didn’t sell the c-series. They handed it over, free for all intents and purposes. \n\nThe US played dirty. \n\nI’m saying unless there’s some kind of closed market protecting the new competitor (certainly not in France that already has Airbus, or Brazil which is still largely Americas backyard to fu@k with) the US has made clear that Boeing will be protected at all costs.", "score": 1, "replies": [{"body": "Bingo. Boeing is heavily protected and it’s the one company that you will get offed for if you dare whistleblow", "score": 1, "replies": []}]}]}]}, {"body": "Hear me out...\n\nTesla Aerospace", "score": 0, "replies": [{"body": "It might be a few years before I'm willing for board a plane from a company known for public beta testing, but the more the merrier", "score": 3, "replies": [{"body": "SpaceX just brought the astronauts back this morning from ISS.", "score": 1, "replies": [{"body": "SpaceX's first three launches all failed.", "score": 1, "replies": []}]}]}]}]}, {"body": "Why are there no antitrust cases against Boeing?", "score": 3, "replies": [{"body": "It's very long-duration and expensive to scale-up.  It's not that Boeing is gatekeeping, it's that anyone who wanted to compete with them already is, and is already at capacity (Airbus).", "score": 4, "replies": []}]}]}, {"body": "And I heard Boeing satellites are malfunctioning.", "score": 3, "replies": []}, {"body": "It's the regards banking on too big to fail, government strategic interests, and that they'll sort out the strike before Christmas\n\nIs me. I am regard", "score": 1, "replies": []}]}, {"body": "New CEO", "score": 20, "replies": [{"body": "People must think he is Jeebus or something. Ain’t no way I am buying this trash stock", "score": 25, "replies": [{"body": "Covid and Taco Bell exploded while he ran it. Maybe he had an effect, maybe it was a coincidence.\n\nStarbucks is gay. They peaked during covid. Too much other competition.", "score": 18, "replies": []}, {"body": "Exactly, remember the genius from Apple (who did the Apple Stores) that JC Penny hired, how did that work out? Different set of problems.", "score": 6, "replies": []}]}, {"body": "Who is doing jack shit", "score": 7, "replies": [{"body": "exactly, how much of a pass does he get? one more quarter? 2? a year? the stock was previously 75 without these current crap numbers, how can it be up 30% just on the new ceo?", "score": 11, "replies": [{"body": "hopium", "score": 4, "replies": []}, {"body": "US government keeps throwing money at them.  Even when they fail.  When you have people from the White House visit you when your workers go on strike, you're special.  He gets a pass forever basically.", "score": 1, "replies": []}]}]}, {"body": "Then technically people are “buying the dip” so to speak?", "score": 5, "replies": []}, {"body": "Analysts are trying to sound wise by trying to say weird shit like \"The bottom is in.  It can only go up from here.\"", "score": 1, "replies": []}]}, {"body": "They just hired a new, highly rated, CEO and kitchen sinked the quarter. They’ll get a pass for a Q or two to see if they can execute on a turn-around, would not attempt to short this", "score": 17, "replies": [{"body": "Right, that’s why it jumped from 75ish to 95, which if you ask me is already insane, no one person is worth 20B to a company, but let’s say it was already pretty low due to the previous CEO running it into the ground. So the new CEO should already be priced in with the bump since the announcement. Now comes this total mess of a quarter with really bad numbers and no positive, and yet it has zero effect on the stock price. I mean, looking at Starbucks, what could possibly be the growth story from here?", "score": 10, "replies": [{"body": "Well yea you got the bump from the CEO, and this mess of a Q was expected - that’s why they replaced the CEO! So the market cares more the company is trying to fix the problems (new CEO), and less about the problems it already knows about - it’s forward looking. So they’ll get a pass for a few Qs to see if things actually do improve", "score": 10, "replies": []}]}, {"body": "same store sales down down down... this will only get worse as their overpriced mid coffee gets outed more every day.  Long term sale.", "score": 1, "replies": []}]}, {"body": "Becky always has money to get her fix.", "score": 11, "replies": [{"body": "and votes for demagogues because they rant about the high cost of living", "score": 1, "replies": []}]}, {"body": "Yep, it's teaching me a lesson not to fuck with stocks like these.", "score": 7, "replies": [{"body": "I blame this guy.", "score": 3, "replies": [{"body": "Sorry should've bought calls.", "score": 1, "replies": []}]}]}, {"body": "They have \"concepts of a plan.\"", "score": 8, "replies": []}, {"body": "Markets stopped making any sense because of the constant bailouts for riches by the FED and the government.", "score": 16, "replies": []}, {"body": "Why buy Starbucks when you can pick up Google with pe of 23ish", "score": 5, "replies": []}, {"body": "i bought puts for months and all expired worthless ![img](emote|t5_2th52|31226)", "score": 4, "replies": [{"body": "My timing is usually too early, so I just bought some more.  Just a matter of time.", "score": 2, "replies": []}]}, {"body": "As usual it is Pump and Dump", "score": 4, "replies": []}, {"body": "The former Chipotle CEO just joined so it is expected to go through a transition period. SBUX finna moon", "score": 3, "replies": []}, {"body": "Starbucks isn't listening to Customers and it shows in their numbers.  Their answer to their ridiculous prices; shake up the menu? Who hired this F moron as CEO? I bought puts, going to buy more.", "score": 3, "replies": []}, {"body": "Look up $cvna and it will all make sense", "score": 2, "replies": []}, {"body": "Tesla really pumping on a missed revenue", "score": 2, "replies": []}, {"body": "It's me. Once a month, I take advantage of the $2 grande beverage in the Albertsons app and get a Cookie Crumble Frappuccino.", "score": 2, "replies": []}, {"body": "People all invest in passive index trackers. So automatically buy and hold Starbucks, Boeing,… no matter what the earnings are", "score": 2, "replies": []}, {"body": "I need my fucking Frappuccino and I need it NOW.", "score": 1, "replies": []}, {"body": "I sold all my SBUX mid year...was holding for over a year only for the dividends...but as growth it wasn't doing it for me anymore. Good luck all.", "score": 1, "replies": []}, {"body": "Why are you trying to make sense of anything?? It doesn't have to or need to make sense. That would be predictable. Warren has been saying for years that there are times when the market doesn't make sense.", "score": 1, "replies": []}, {"body": "BROS is where it’s at\n*up 3%at open and this was posted before open", "score": 1, "replies": []}, {"body": "Now do the same for CVNA. they punched another 52wk high today", "score": 1, "replies": []}, {"body": "Their 3 new fraps are gonna be big!!! Avocado Frap, Birria Au jus Frap, and Carnitas Frap!  New Chipotle Tex Mex influence with new CEO and his team from Chipotle!", "score": 1, "replies": []}, {"body": "As part of the revamp, New drinks will be coming in the future that will be laced with oral GLP-1 drugs to help people lose weight.  This will help all the people that have gained excessive weight over the years drinking the sugar laden beverages that taste good and make you fat.  The new CEO is genius.", "score": 1, "replies": []}, {"body": "Do you think Starbucks is going extinct?\n\nHow low do you think it should reasonably go?", "score": 1, "replies": [{"body": "Nobody said anything about going extinct, but at the very least I think it should fill the gap to the 80s if not retest the 75 low", "score": 1, "replies": []}]}, {"body": "Have a puts ex April 2025. I imagine they will do quite well", "score": 1, "replies": []}, {"body": "I prefer Schrute Bucks over Starbucks any day", "score": 1, "replies": []}, {"body": "It's called a pump and dump. Someone wanted to get out and had calls to sell", "score": 1, "replies": []}, {"body": "A Union to make coffee.  The new CEO has a mess on his hands. $10 coffee no way.  Perhaps they should start making Breakfast Burritos.", "score": 1, "replies": []}, {"body": "Adding more calls thx op", "score": 0, "replies": []}]}
