{"title": "Boeing wins $9.2B in DOD contracts in just 1 day", "selftext": "Boeing nabbed 3 major EOY Department of Defense contracts late on 30 Sept, totalling $9,176,740,755! Granted that's not earth-shattering for a company with $60B in revenue annually, but it's still major news: https://www.defense.gov/News/Contracts/Contract/Article/3921460/", "id": "1fuht90", "created_utc": 1727880069.0, "score": 242, "upvote_ratio": 0.89, "num_comments": 73, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 60 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Boeing are welfare queens why doesn’t the gov just nationalize this dogshit company", "score": 484, "replies": [{"body": "free market capitalists talk a big game until free market shit about to happen (let boeing die)", "score": 161, "replies": [{"body": "that's the key difference between \"pro-business\" and \"pro-capitalism\".", "score": 28, "replies": [{"body": "I’m pro capitalism and pro business for companies that can’t be ran without government intervention such as healthcare, insurance, transit, university to be ran by the government.", "score": 3, "replies": []}]}, {"body": "strawman argument. I don't know anyone -- much less free market capitalists -- saying anything but to let Boeing die. \n\nOnly people wanting the shit storm of a company of Boeing live are politicians and Boeing management...", "score": 4, "replies": []}, {"body": "all free market capitalists are OK with letting shitty companies die.  Corporatists are who bail out shit companies like Boeing and GM and Wells Fargo over and over", "score": 1, "replies": []}]}, {"body": "They use these companies to hide stuff that can’t be revealed by freedom of information", "score": 37, "replies": [{"body": "Yep, like kickbacks to consultants that just happen to be former DoD employees that knew how to price the contracts for winning bids.", "score": 13, "replies": [{"body": "How can I become a DOD consultant? I know a lot of ways to say “we need to make a bigger BOOM”", "score": 3, "replies": [{"body": "4288 UNITS! BOOM!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}]}, {"body": "Because most government employees are figureheads. They don’t have the ability to produce anything. It’s all done by contractors, who listen to the problems, present solutions, and build the solutions after the government rubber stamp.", "score": 24, "replies": [{"body": "You mean the same competent people will suddenly become figurehead once they become government employee?", "score": 12, "replies": [{"body": "Are you suggesting that being a contractor is a pipeline to a government job? That’s more rare than you think. Contractors generally make more than their federal counterparts. The people that choose government tend to be the midwits that want bureaucracy to insulate them from personal responsibility or work while also letting them feel important.", "score": 9, "replies": [{"body": "as a govt figurehead midwit I can confirm", "score": 7, "replies": []}]}]}]}, {"body": "because nationalizing it would make it worse. why do morons on reddit always think nationalizing something is the answer. fukin regards.", "score": 9, "replies": [{"body": "in what way?", "score": 1, "replies": []}]}, {"body": "Becuase nationalizing will turn it into whatever  is lower than dogshit .\n\nI remember reading Boeing and all the places they use or source from make up for 1% of the GDP They will always be safe and  too big to fail", "score": 8, "replies": []}, {"body": "Same reason the government has a hard time doing anything.... Government is corrupt, inefficient, thief's, and incompetent. ", "score": 5, "replies": [{"body": "Sounds a lot like Boeing bro", "score": 13, "replies": [{"body": "It is, because it's one revolving door. Boeing should fall but here we are. ", "score": 7, "replies": []}]}]}]}, {"body": "Are they still going to sell 10b worth of stock or did the govt bail them out.", "score": 69, "replies": [{"body": "What’s the difference?", "score": 17, "replies": [{"body": "One they bail them selfs out and fuck the shareholders the other they dont.", "score": 8, "replies": []}]}, {"body": "I suspect boeing won’t get the 10b right away. These DoD contracts typically pay chunks at a time for completion of various project milestones.", "score": 5, "replies": []}]}, {"body": "Thats like an entire Twitter", "score": 29, "replies": []}, {"body": "The problem is that Boeing only knows how to make money on \"cost plus\" contracts. Those are where Boeing is paid for the actual cost (including over runs) plus a premium. The premium being their profit.\n\nWith fixed price contracts, any cost over runs are on Boeing. Boeing only knows how to lose money on fixed priced contracts. If their final cost is greater than the contract, Boeing eats the difference as a loss.\n\nThe Pentagon used cost plus for years, but caught on recently and moved to fixed price. Many contractors adapted. Boeing is too slow and did not.", "score": 24, "replies": [{"body": "Question is can boing even adapt to lump sum works? Its not easy, doing fixed price contracts. Its takes a different breed of management", "score": 2, "replies": []}]}, {"body": "It's clear Boeing spends the money that SHOULD go to research, the employees, and towards quality control INSTEAD goes to CEO options, lobbyists in DC, and cutting corners.", "score": 10, "replies": []}, {"body": "It’s an IDIQ FFP contract. The ceiling is worth that much, doubt it’ll get anywhere close to that.", "score": 17, "replies": [{"body": "A single award IDIQ, no competition for future task orders. The Govt doesn’t set a ceiling they don’t intend to reach (why would they?!?), so while it’s not $9.2B immediately, it’s all but a given that it is future revenue for Boeing. ", "score": -8, "replies": [{"body": "You clearly don’t understand how government works contracts work. Very rarely are IDIQ contracts ever maxed out. And the ones that do get maxed out are intentionally lowered to avoid audit triggers at certain dollar thresholds.", "score": 22, "replies": [{"body": "Thank you, what I was trying to express with less words lmao", "score": 2, "replies": []}]}, {"body": "You think the government sets a ceiling they intend to reach? Not sure if you know how the DOD works, but it is full of idiots and in the acquisition arena we build in A LOT of wiggle room with our contracts due to getting burned by contractors and knowing there will be incompetence on our end.", "score": 3, "replies": []}]}]}, {"body": "Let me guess: It's a continuation of existing contracts, so not new business. That was the case last time people were posting about a big win.", "score": 6, "replies": []}, {"body": "“Boeing” too big to fail.", "score": 4, "replies": []}, {"body": "Sounds like executives deserve a $1B bonus", "score": 3, "replies": []}, {"body": "Uncle Sam to the rescue!!!", "score": 3, "replies": []}, {"body": "These are weapons programs. And the largest is a ceiling IDIQ UCA. All that means is the government over a decade plus of time COULD award Boeing a definitized contract award up to 6.9B. \n\nCmon WSBs. Do better and know how the DoD contracts. This isn’t an award. \n\n-career defense contractor", "score": 3, "replies": []}, {"body": "9.2B on 60 annually isn't earth shattering???", "score": 2, "replies": [{"body": "it is. not sure wtf they talkin aboot", "score": 1, "replies": [{"body": "No it is not. 9b is the maximum. If history teaches, it won't reach it. They did not receive a check for 9B, very far from it.", "score": 1, "replies": [{"body": "ok sir. that doesn't matter and you don't know what they'll get so guessing isn't the point of my comment. my point is that assuming all things correct and actual, 9.2b is a lot for a 60 per year company.", "score": 1, "replies": [{"body": "So you are ... guessing they'll get 9.2. Got it.", "score": 1, "replies": [{"body": "no ya fukin jerk. lets take boeing out of the conversation. and the contract is out of the conversation.  9.2 of 60 is a sizeable amount for a company is it not ? alright ? fukin jerk. IS ANYONE GONNA GET THAT ? WHO KNOWS THAT'S NOT THE POINT OF WHAT I'M SAYING YA JERK", "score": 1, "replies": [{"body": "And it is instantly less when I tell you \"up to\" 9.2. \n\n\"This car can drive up to 300km in one charge\" (considering ideal condition, down slope, ideal temperature). Will you consider 300 km as autonomy?", "score": 1, "replies": [{"body": "is 9.2b of 60b significant? yes, it is. doesn't matter if they get it or not. you literally are being obtuse for the sake of it.\n\nalso your example has nothing to do with whether or not 9.2 of 60 is a significant amount. but if I did answer your question. you said it yourself (considering ideal condition, down slope, ideal temperature). 300km IS possible.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "DoD officials are like \"what's the name of that contractor that keeps fucking everything up? Let's give them more contracts for stuff.\"", "score": 2, "replies": []}, {"body": "Must be a contract to make airplanes for Iran Air", "score": 2, "replies": []}, {"body": "Dude. That is not end of year money. That’s slipping in the award under the wire.", "score": 1, "replies": []}, {"body": "Who would have thought?", "score": 1, "replies": []}, {"body": "Lol awesome", "score": 1, "replies": []}, {"body": "i’m wondering how are they going to fulfill these when there’s a strike 🤔", "score": 1, "replies": []}, {"body": "And still can’t build anything due to their strikes and port strikes 🤡🌍", "score": 1, "replies": [{"body": "None of the awards in the article are for sites affected by the strike. Also defense equipment for the most part is made with US built parts, be sort of foolish otherwise. So port strikes aren't a concern either.", "score": 1, "replies": [{"body": "You would be surprised how many foreign parts are in our jets and tanks", "score": 1, "replies": []}]}]}, {"body": "So Boeing is already part of US government. Is Intel the grandma company too?", "score": 1, "replies": []}, {"body": "Feeling risque, bought 1 call $250 by 11/19", "score": 1, "replies": []}, {"body": "9 billion over how many years? LOL...", "score": 1, "replies": []}, {"body": "I told people who telling me boeing going bankrupt that they dont know shit. boeing always will get proc up by investor and the government, not because they doing a good job at what it does. but simply, its a strategic industry that happens to employ a lot of people through its supply chain.", "score": 1, "replies": []}, {"body": "Life support.", "score": 1, "replies": []}, {"body": "Govt bailout in progress.", "score": 1, "replies": []}, {"body": "Wait my dumbass BA calls are gonna print?![img](emote|t5_2th52|4260) I don't want this dirty money", "score": 1, "replies": []}, {"body": "A drop in the bucket.", "score": 1, "replies": []}, {"body": "Great idea let’s do contracts with a company that strands astronauts in space with a garbage rocket", "score": 1, "replies": []}, {"body": "Gotta fed those DEI engineers and screw SpaceX more", "score": 1, "replies": []}, {"body": "To DoD this is peanuts", "score": 0, "replies": [{"body": "That kind of money is significant. Especially to the army or the marine corps.", "score": 3, "replies": []}]}, {"body": "Buy Boeing now.  Its near the bottom.", "score": 0, "replies": [{"body": "WSB shitting all over Boeing means it’ll be up 20% in a month 🤣", "score": 1, "replies": []}]}]}
