{"title": "Why I think Intel is a Misunderstood, Undervalued Play – A Bet on 18A (+EV DD)", "selftext": "Alright boys, before you go full ape and call me smooth-brained for saying this again, let me follow up on [yesterday’s post](https://www.reddit.com/r/wallstreetbets/comments/1fye8fl/is_intc_undervalued/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) and explain why I think [Intel ($INTC)](https://finance.yahoo.com/quote/INTC/) is undervalued and why it might be a decent play right now. I know the market sentiment around Intel is absolute trash and trust me, there are valid reasons for that. But hear me out: I think people are being too negative, and that’s driving the stock price way lower than it should be, which is why I think this might be a solid gamble.\n\nNow, just to be clear, I’m not trying to convince anyone to follow what I’m saying here. This is just my take, and I’m throwing it out there for discussion and to give you some food for thought.\n\n**Intel is trading at book value, where does it go from here?**\n\nLet’s start with the basics: Intel is a massive company. We're talking about a company that is literally a cornerstone of U.S. tech infrastructure. This is not just some meme stock that goes up and down based on Elon’s tweets. Intel matters strategically to the U.S., which is why I think it’s important to look at it a bit differently. Right now, it’s trading at or near book value. For those who don’t know, that’s basically what the company’s assets are worth on paper. So if Intel is trading at book value, where the hell is it supposed to go?\n\nSure, stocks can drop below book value when a company is in deep trouble, but Intel isn’t just some random struggling company. Intel is too important for the U.S. to let it just die. We’ve seen it happen before—companies that are crucial to national interests often get government support or favorable treatment (throwing money at them) even when things go bad. So yeah, Intel’s price could dip below NAV (Net Asset Value), but it’s highly unlikely to go to zero. At this price, you’re paying for a pile of assets that aren't getting the love they deserve.\n\n**Bad market sentiment doesn’t always last forever**\n\nMarket sentiment is trash right now. Everyone’s convinced that Intel is finished because they’ve lost market share to AMD and Nvidia. Fair enough, those companies have been eating Intel’s lunch for a while. But sentiment can swing like a wrecking ball, and when the market hates something this much, that’s where opportunities often pop up. People love to bet on momentum, and when a stock starts free-falling, it's easy for everyone to scream “they’re gonna fail” without taking a step back and actually looking at the risk/reward setup.\n\n**What’s 18A and why it matters**\n\nNow, let’s get to the meat of this: 18A. Intel is basically betting the entire company on this process, and if they succeed, it’s a game-changer. 18A is their next-generation chip manufacturing process, and it’s a big deal because it could allow Intel to actually start competing again in the semiconductor space after getting dunked on by TSMC and Samsung for years.\n\nLet me be clear, I’m not saying 18A is a sure thing. It’s not. In fact, it could blow up in their faces, and everyone who’s short Intel will be popping champagne. But the upside here is massive if they pull it off. The downside is already baked into the stock price, in my opinion. The way I see it, Intel is trading as if 18A is already a failure, which seems too pessimistic given the progress they’ve made.\n\n**The Dice Roll Theory – Arbitrary, but it shows the risk/reward**\n\nSo here's a thought experiment: imagine the chance of Intel successfully pulling off 18A was completely random, like rolling a dice. Let’s say there’s a 1-in-6 chance of success. If they fail, the stock could drop to $10 (worst case scenario). But if they succeed, it could shoot up to $100 or more. This setup would give an expected value of $25. Obviously, these numbers are arbitrary, but they show the kind of risk/reward balance we’re looking at. The point is, the market is pricing Intel like 18A has already failed, and any chance of success would drastically increase the stock’s value.\n\nNow, if you assume the upside is $60 instead of $100, yeah, the bet becomes less attractive. In that case, it might not be a +EV gamble, which is why it’s important to consider your own risk tolerance. But for me, even if the upside isn't as dramatic, I still see value in the potential rebound, especially given how pessimistic the market is being right now.\n\n**The market is pricing in disaster, but the risk/reward equation here looks attractive, especially when you consider Intel’s importance to the U.S. government. They’re not just going to let Intel go bankrupt without trying to step in. Plus, Intel has other projects in the pipeline. They’re not just sitting on their hands hoping 18A works out. The company is actively trying to turn things around.**\n\n**The CEO and Intel's strategy – Misunderstood?**\n\nNow let’s talk about Pat Gelsinger, the current CEO. I think he’s actually making the tough but right calls here. The dude came back to Intel to fix the mess, and instead of trying to please the market in the short term, he’s gone all-in on fixing the core problems. They’ve sacrificed a lot of unnecessary projects and are basically saying, “We’re betting it all on 18A.” That takes balls, and I think the market is misunderstanding his approach.\n\nYeah, in the short term, this strategy makes Intel look like it’s bleeding cash, and everyone freaks out. But this is what happens when you cut the fat and focus on what matters. They’re essentially hitting the reset button, which can make things look worse before they get better.\n\n**What about Intel’s other businesses?**\n\nLet’s not forget, Intel isn’t a one-trick pony. They’ve got other businesses that are still generating cash flow. It’s not like they’re running on fumes. Even if 18A doesn’t hit as fast as we hope, Intel has enough going on to keep them afloat for a while. Plus, they’ve still got massive R&D going into new technologies. They aren’t just sitting around waiting for 18A to save them—they’re diversifying their bets.\n\n**The geopolitical angle – U.S. needs Intel**\n\nWith all the geopolitical tension going on, the U.S. isn’t going to let Intel just slip away into irrelevance. The U.S. government knows how important semiconductors are for defense, tech, and the economy. We’re seeing more and more government interest in building up domestic semiconductor capacity (CHIPS Act, anyone?), and Intel is perfectly positioned to benefit from that. More money is going to get thrown at them, either directly or indirectly, because the U.S. simply cannot afford to rely on foreign chipmakers forever.\n\n**Conclusion – Why I’m betting on Intel**\n\nTo wrap this all up, here’s why I think Intel is worth a gamble:\n\n* The market is too negative, and the stock is trading at book value.\n* Intel is strategically important to the U.S., so they’re not going to be left hanging.\n* The upside potential from 18A is huge, while the downside is likely already baked in.\n* The CEO’s strategy is misunderstood. He’s sacrificing short-term gains for long-term survival.\n* The U.S. government’s focus on building domestic semiconductor capacity is a tailwind for Intel.\n\nThis is not your typical meme stock play. It's not a hype-driven rocket to $1,000 overnight. But if you’re looking for something that’s undervalued and has a solid chance of turning things around, Intel could be the bet. I think this is a +EV gamble, and that’s why I’m taking it.\n\nI’m not saying it’s a sure thing, but given the risk/reward setup, this looks like a bet worth taking.\n\n**TL;DR:** Intel is being slept on, 18A is a potential game-changer, and the U.S. isn’t going to let them fail without a fight. High risk, high reward, +EV play.", "id": "1fyvlo8", "created_utc": 1728379205.0, "score": 162, "upvote_ratio": 0.8, "num_comments": 90, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 15 hours ago\n**Total Comments** | 3 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1fyvlo8/why_i_think_intel_is_a_misunderstood_undervalued/) \n**Account Age** | 10 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/gb0htyez3itd1.jpeg?width=800&format=pjpg&auto=webp&s=8cb9a7e56109794a2a09678820622880dcd889e3", "score": 176, "replies": []}, {"body": "https://preview.redd.it/b0aohxks3itd1.jpeg?width=320&format=pjpg&auto=webp&s=b24aeb96729fe3af4594c117941034a561510093", "score": 108, "replies": []}, {"body": "You could be right but nowadays the moment someone talks about Intel stocks, the first thing that comes to my mind is someone's grandmother.  For that reason alone, I won't touch Intel stocks.", "score": 137, "replies": [{"body": "That’s crazy because the first thing that comes to mind when someone talks about grandma is Intel and that’s why I won’t touch grandma.", "score": 41, "replies": [{"body": "I’m touching grandma..", "score": 9, "replies": []}]}, {"body": "Nana will never die... Intel could. But probably won't.", "score": 8, "replies": []}, {"body": "i'm immature. and i like how people leave this comment at 69 likes.", "score": 1, "replies": []}]}, {"body": "How many more grandmas have to die before these Intel buls get it ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 74, "replies": []}, {"body": "In Nana we trust", "score": 24, "replies": [{"body": "https://preview.redd.it/o8kmelw6qktd1.jpeg?width=1024&format=pjpg&auto=webp&s=4d1a9399e31ede646a959c7c79773a35d21c15e1", "score": 7, "replies": []}]}, {"body": "You’re just nana’s grandson with more words", "score": 14, "replies": []}, {"body": "You're betting your house on a book after only reading the summary on the back cover. The rot is deep, and it takes more than a few upsides to change its fortunes. 18A and all other things are GREAT strategies, and this is not the first time Intel made good strategies on paper. The problem with Intel in the last 10 yrs has been EXECUTION. You have not mention that in your thesis. The rot prevents execution and for all the best strategies in the world, unless it is carried out on-time and with managed costs, Intel will falter like the past decade.", "score": 31, "replies": [{"body": "I know the company has been through a lot over the past few years. I'm not saying this stock will definitely go up, but I think the chance of a turnaround is mispriced. On average, this play could be profitable. Of course, I can’t go into too much detail in a WSB post. It’s not about predicting exactly what will happen; anyone who claims they can predict the stock market is probably just kidding themselves. But I believe you’d come out ahead if we ran this scenario a bunch of times.", "score": 6, "replies": [{"body": "Fair point and I will wish you the best. I've been holding the INTC bag far longer than some people here are alive. It was around 20 dollars then, rode it to 60 dollars and now back to 20. I sat in a hall where execs came and proclaimed proudly \"our process node technology is at least 5 yrs ahead of our nearest competitor\", and a few years later \"our market share is still up in the 90%\". I believed it all then. Now I realized it's all emotions making decisions for me. I hope you're right though.", "score": 15, "replies": []}, {"body": "\"Of course, I can’t go into too much detail in a WSB post.\"\n\nLol'd", "score": 7, "replies": [{"body": "I've actually put together a detailed 53-page analysis on Intel, but I can't share it here. Trust me, there's a lot more depth to the story than what it might seem. From the impact of their new Lunar Lake architecture to their long-term strategies in the semiconductor market, there's plenty to discuss.", "score": 3, "replies": [{"body": "Why can't you share?", "score": 4, "replies": [{"body": "Because no soul would want to read a 53 page WSB post.", "score": 3, "replies": [{"body": "share it, I’d read.", "score": 12, "replies": [{"body": "What a coincidence! I wrote a 69 page paper on intel.", "score": 8, "replies": [{"body": "I bet that Grammys grandson wrote a 420 page paper", "score": 4, "replies": []}]}]}, {"body": "Share it, I'd read it", "score": 6, "replies": []}, {"body": "I would also read considering I own 351 shares. ", "score": 4, "replies": []}, {"body": "I’d like to take a peak too", "score": 2, "replies": []}]}]}, {"body": "I would like to see the analysis but with numbers. Please don't make it 53 pages. Just make it a story on how they could succeed. I can't read more than say 4 pages large font with pictures and graphs.\n\nJust to clarify, you are saying that Intel could succeed on 18A and then somehow that would make their chips better than AMD's and where could we see the reviews on that? Also if Intel succeeds on 18A, would they manufacture for Nvidia and AMD or would they try to take the market share?", "score": 3, "replies": []}, {"body": "Right on man. I agree with all you posted above but I would counter you on one thing. I don’t think INTC would ever go to $10, even in worst case scenario. \n\nIn my DD, absolute worst case scenario is 18A/Fab is a failure. Pat gets some cans of gasoline and just burns down all of the Arizona & Ohio plants. Doesn’t even bother to sell off the high NA machines. \n\nYou’re left with Intel Products, solely using TSMC, which is earning an annual operating profit of $10Bn/yr. PE ratio goes to ~5. Share price goes up immediately. \n\nSo even in worst case scenario, Intel actually goes up from where it is now. Have you thought about this? Or am I mad?", "score": 1, "replies": []}]}]}]}]}, {"body": "They are behind technologically in their major market, once they have 18A competition will be a step ahead again. Best case they will be bought", "score": 8, "replies": []}, {"body": "Bull case:\nA) 18 A\nB) The stock is beaten to death, there is not much room tbh, market is always regarded and irrational\nC) Foundry business- they have ALL the capacity to be second to TSMC. They cannot be the leader, they are in the US and labor law matters here, shooting margin lower and TSMC is just too far ahead and will not make the same mistake as they did.\nD) lunar lake looks promising, its really giving ARM a run for their money.\n\nBear case:\nA) Shitty management - the board and the ceos in the past decade, have been assholes. They just missed each leap that the world has taken in semis. You can miss one turn and that's acceptable. But if you miss all of them, it's cultural. They did not have and still don't have any answer to the competition - AMD, Nvidia, TSMC.\nThey simply cannot be trusted. They haven't done anything to earn the trust of the investors. They ran a company that lost market share to AMD that was close to bankruptcy and still are. There are too many leadership issues- this is well known and public domain news. This can be fixed but it's gonna take a really long time.\n\nB) the bet is too big - they are trying dual front - PC design and at the same time manufacturing. Manufacturing is tough and it's a big deal, you have to actually make th chip and not just design a chip and bail out. So far, yet to hear good news on  18 A status. Betting a company does not mean anything if you can't get the products to customers. The world simply don't give a fuck.\n\nC) Lunar lake manufacturing - Lunar lake was not manufactured at Intel. It was made using TSMC 3 NM process.\n\n\n\nIf you are thinking about a 10 year horizon, there are better ways to make money,. If you keep your eyes open, keep shuffling your portfolio and don't take crazy bets you can still make returns that will be far better than INTC.\n\nI simply don't trust these guys. They fucked up and will fuck up again. It's just in their blood now and they are just too stubborn to admit that.", "score": 8, "replies": [{"body": "I see the biggest opportunities when the entire market has a solid opinion about something. That's where you can find prices that are irrational or mispriced. It doesn’t mean going against the crowd is always a winning strategy, but if you just follow what every retail trader is doing, you won't get great returns. For those looking to play it safe, ETFs like the S&P 500, QQQ, or MSCI World make a lot of sense and can provide decent returns.\n\nWhen I think about the next 10 years, I'm not too sure what will happen. I'm more focused on the next 1-3 years. Sure, you can jump on the NVIDIA train and the whole AI hype, but while AI is a hot topic right now, we've seen four waves of AI before, each bringing new revolutionary advancements. I’m skeptical about how “smart” these LLMs really are, and there are many other forms of AI that have potential too. Additionally, NVIDIA's valuation is influenced by factors like demand for gaming GPUs, data center growth, and the overall semiconductor market trends. However, with a $3 trillion market cap, I'm curious to see if they can maintain that level. It seems heavily tied to momentum and hype, and we all know hype can fizzle out.\n\nIf you're looking to play it safe over the next year, maybe consider investing in a few broad and diversified ETFs, and perhaps look into some China and India indexes, too. Overall, I think investing in Intel could be a good addition to your portfolio, but I wouldn’t recommend putting your entire portfolio into it.", "score": 4, "replies": []}]}, {"body": "Last time there was a post like this intel tanked. Puts for grandma", "score": 7, "replies": []}, {"body": "What in the actual hell is with so many of these posts all written in the same format? \n\nLike don't get me wrong the point of it is fine and I get the overall argument but are these all just chat GPT cut and pastes or what's going on here?", "score": 5, "replies": [{"body": "Because he used chatGPT because maybe his grammar sucks It didnt mean that it was fully made by AI.\n\nDid you have any evidence?", "score": 0, "replies": []}]}, {"body": "Wait you didn't hear? INTC was supposed to hit $60 two weeks ago. It should be trading at 200 by now according to all of the experts on here", "score": 4, "replies": []}, {"body": "Rycey has gone up 100% in the last year when you morons have been circle jerking intel losses", "score": 3, "replies": [{"body": "On my list. I forgot why though.", "score": 1, "replies": []}]}, {"body": "I don’t know, but I’ve been bagholding for 2 years and I need other regards to see the vision.", "score": 3, "replies": []}, {"body": "Impressively stupid", "score": 4, "replies": []}, {"body": "1. No king rules forever\n2. Nvidia/TSMC are the kings of design and manufacture.", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 7, "replies": [{"body": "Lol. Lmao even", "score": 5, "replies": []}]}, {"body": "Here for grandma jokes ...", "score": 3, "replies": []}, {"body": "RemindMe! 2 years", "score": 3, "replies": [{"body": "I will be messaging you in 2 years on [**2026-10-09 02:20:57 UTC**](http://www.wolframalpha.com/input/?i=2026-10-09%2002:20:57%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1fyvlo8/why_i_think_intel_is_a_misunderstood_undervalued/lr19eno/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1fyvlo8%2Fwhy_i_think_intel_is_a_misunderstood_undervalued%2Flr19eno%2F%5D%0A%0ARemindMe%21%202026-10-09%2002%3A20%3A57%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fyvlo8)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Poor guy. Grandma must have just passed away.", "score": 3, "replies": []}, {"body": "INTC!", "score": 4, "replies": []}, {"body": "If they get their tech straight they'll only be one step ahead, you need at least to be two steps ahead for it to be considered a win for intel. Market sentiment for Intel is probably chronic at this point and will not swing in their favor easily. When it comes to diversification as of now Intel is the jack of all trades and is a master of none. Lots of vultures are circling around and is probably setting up to rip it apart, this play is one of the riskiest there is so tread carefully.", "score": 3, "replies": []}, {"body": "To clarify, my positions in INTC were opened fairly recently, and my average price is around $22.70 right now. I’m not sharing this perspective out of frustration or because I’m a long-term bagholder like some might think.", "score": 5, "replies": [{"body": "It’s evident your new to Intel.  You’re highly regarded.  You talk about semis like they’re all the same.  Intel designs & fabricates CPUs.  Nvidia and AMD design GPUs.  18A is not for GPUs.", "score": 4, "replies": [{"body": "I get the differences between Intel, NVIDIA, and AMD, and thanks for sharing your thoughts! Just to clarify, Intel mainly makes CPUs, while AMD does both CPUs and GPUs. What really grabs my attention is how NVIDIA leads in AI and innovation, which affects the whole semiconductor industry. They’re a great example of how a company’s market cap can be way different from its net assets. Even though Intel isn’t focusing on GPUs, they’re working on improved integrated graphics in their newer chips, so I’m looking at how all this plays into Intel’s situation.", "score": 3, "replies": [{"body": "NVDA leads, because its CUDA framework was the staple among the compute/AI frameworks when the AI wave hit. AMD (and even INTC) are able to design similarly impressive HW, but they could not catch up on the API situation (years of under-investment) nearly as fast.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It was never about using CPUs for LLMs, you are missing the point here.", "score": 3, "replies": []}]}]}]}]}, {"body": "Is your nana alive?", "score": 2, "replies": []}, {"body": "I don't know a lot of companies that want Intel as a vendor to create their shit. Everybody wants tsmc tho.", "score": 2, "replies": [{"body": "Basically they do not trust TSMC", "score": 1, "replies": [{"body": "Did you read what I commented?", "score": 1, "replies": [{"body": "https://preview.redd.it/p4h6of5m1wud1.png?width=663&format=png&auto=webp&s=c75bd10a6e4c1d9c4e3baf3a01e6f5f04c79be34\n\nLet me add some crayons so you can follow the conv", "score": 1, "replies": []}]}]}]}, {"body": "Nana's ghost is putting in overtime haunting WSB regards.", "score": 2, "replies": []}, {"body": "I agree a lot because I know book value doesn’t reflect actual value of their assets, but all the companies that have the money to buy intel are basically chip companies because of their stock growth and those are the companies that would value being able to manufacture their own FABs thaf said it’s gone down at least 1% everh single day since I bought so maybe jist short it and make an 800% return in a year", "score": 2, "replies": []}, {"body": "Ah yes. The daily intel dd", "score": 2, "replies": []}, {"body": "Intel is still a giant on CPU market and its stability for data center has been proved. I would expect it to be at least 40 in the long term ( 1-2 yrs)", "score": 2, "replies": []}, {"body": "Can someone tell me the exact share price that is = to book value?", "score": 2, "replies": []}, {"body": "[Grandma’s Boy](https://en.wikipedia.org/wiki/Grandma's_Boy_(2006_film)) Part Deux?", "score": 2, "replies": []}, {"body": ">We’ve seen it happen before—companies that are crucial to national interests often get government support or favorable treatment\n\nYes, I bought stock in GM in 2006 on this thesis.  I was right, too; US gov't stepped in and forced labor to come to the table and negotiate.   Senior, mezzanine and some junior debtholders were made whole; the remaining juniors were forced to refi but eventually got paid; UAW workers got a large share of ownership in the restructured company, and the new company got all the IP of the old one for $1.\n\nOf course, common was wiped.  My investment went to $0.", "score": 2, "replies": [{"body": "Intel’s in a totally different league. GM had debt, unions, and legacy issues dragging it down, while Intel is focused on tech, innovation, and national security. The U.S. needs Intel for its chips: way more critical than cars. Plus, Intel isn’t drowning in debt like GM was. What’s really important is that Intel has scrapped its old plans and is investing heavily in new factories and a structured recovery plan. If they hadn’t, they’d be on a slow path to decline and, eventually, failure.\n\nSecond, it’s not only about whether Intel gets help or not. They’re making strides on their own. Government support is just one piece of the puzzle. Intel's new chips show they’re making progress, even if it's not a home run yet. They’re getting back on track either way, and that’s what really matters.", "score": 2, "replies": [{"body": "I hope you're right, I'm not one of those who takes pleasure in a good company gone bad.  But their track record is shit.  They went from industry leader to repeat laughingstock in 10 years.  I know a lot of Bay Area engineers and none would touch a job at Intel for any amount of money - it'd be career suicide for them.  The deck is stacked against them.  Their valuation may be \"book\" - look up goodwill if you want to see what's written in the book - but they are priced at book value for a company that was expected to be an industry leader in about 10 different areas.  Their future plans don't include industry leadership in any area and they are exiting more than half of the markets they've been working in (and borrowing money to do $XX billion capex in.) \n\nIt's no joke to spend $20B on capex in the hope of entering a market, and then exit that market.   It's no joke to do that in 5 different markets in 10 years.  It's no joke to put out a quarterly report showing you lost $9 billion in 3 months, after your turnaround was supposed to have been under way for a year and a half.  As an investor you have the option to invest in other companies, ones that don't flush $100 billion down the toilet.  The idea that they've gotten away with it for this long is not a bull pitch; it means there are a set of entrenched managers there who think it's OK to run their business this way.\n\nI'll be interested when the stock price hits $10-12 and I start hearing that people want to work there, because I think that's about where you'd start seeing a chance for meaningful upside from a turnaround.  At $23 all the good things you're hoping for are priced in.", "score": 2, "replies": []}]}]}, {"body": "For decades intel was a company of top engineering talent, led by engineering talent.  From everything I've read/ heard, starting in the early 2000s they changed to being a company of more marginal engineering talent led by beancounters.\n\nSame thing is now playing out with Boeing.  All the old long-time time Boeing employees who retired 10+ years ago are dismayed at how the company culture today is nothing like it was years ago.  It was a company that took pride in its culture of engineering, safety, etc.  Now it's top focus is earnings.\n\nUntil Intel addresses this issue, nothing else they do will really move the needle (stock price) positively.", "score": 2, "replies": [{"body": "dude their current ceo has been an engineer for 30 years", "score": 1, "replies": [{"body": "And yet they keep getting their butt's kicked by AMD, broadcom, nvdia etc", "score": 1, "replies": []}]}]}, {"body": "Seriously you guys need to stop looking at turnarounds and look at stocks that are skyrocketing.  There is a reason people are buying these stocks like NVDA hand over fist. Why wait for a turnaround of extreme difficulty when companies like ZETA are going bananas?", "score": 2, "replies": [{"body": "Good luck investing in a company that's primarily capitalizing on AI hype and their monopoly on CUDA. I can hardly fathom how a $3 trillion valuation could remain unscathed in the long run. Even if it doesn't, it briefly held the title of the most valuable company in the world: what do you think are the real opportunities here?", "score": 1, "replies": [{"body": "In the next year NVDA gonna be fine and price will grow far faster than Intel. If you believe in Intel maybe wait until they have 1 or 2 good quarters and you are seeing some evidence of traction. In the meantime there are so many stocks that will gain more. ZETA up over 6% today for example.\n\nThe Intel turnaround opportunity, if it exists at all, won't show any real gains for a while, why not put your money in something else while you wait and see?", "score": 3, "replies": [{"body": "I’m not into investing in overhyped stocks that have already skyrocketed. Look at NVDA—it's insanely overpriced because everyone and their mom is buying it, thinking the line will just keep going up forever. These companies have PE ratios over 60, which is ridiculous. It’s starting to feel like the Dotcom bubble, but this time with AI. Honestly, outside of a few specific uses, AI is kind of useless in its current state and nowhere near as “smart” as people think.\n\nWith the massive investments going into AI, the returns needed to justify them are just unrealistic. Sure, in the short term, the AI boom might keep pushing tech stocks and the market up, but once the returns don’t materialize fast enough, the bubble is going to pop. I’m not saying AI is a total flop, but we’re not there yet, and the market is way too impatient.\n\nMeanwhile, Intel is in a much better spot strategically. They're still super important for the U.S., consumer PCs, and cloud computing, and there's still huge demand for energy-efficient chips. Over the next two years, I think Intel will outperform NVIDIA by a lot.", "score": 3, "replies": []}]}]}]}, {"body": "Intel and Boeing, are both to big to fail but it's gonna take some time to right the ships and may take 5-10 years. I may invest in them in the future but there are better opportunities out there right now.", "score": 3, "replies": []}, {"body": "Me reading the title 😐 \nMe remembering i made money on intel back in april 😏\nMe placing a put and a call 😏\n i guess I'll see 🤷🏽", "score": 1, "replies": []}, {"body": "I was in when the got a gov fund for largest chip manufacturing plant, and the stock was down. I moved to NOV", "score": 1, "replies": []}, {"body": "Intel is not manufacturing automotive electronics... If you want to bet on EV buy $TXN $NXPI $ADI ![img](emote|t5_2th52|4260)", "score": -1, "replies": [{"body": "No automative is only like 2% for nvda.", "score": 1, "replies": [{"body": "🤨", "score": 1, "replies": []}]}]}, {"body": "...now they're an ev play?  how drunk are you?", "score": -6, "replies": [{"body": "He meant Expected Value not Electric Vehicle. Did you even read the post or just skimmed the TL;DR?", "score": 8, "replies": [{"body": "ah, yes. the \"expected value gamble!\" and \"expected value play\"  what?  that makes zero sense.", "score": 0, "replies": []}]}, {"body": "You truly madly and deeply belong here, regard.", "score": 4, "replies": []}]}]}
