{"title": "Don’t ruin Nvidia ", "selftext": "[removed]", "id": "1g3x112", "created_utc": 1728957863.0, "score": 172, "upvote_ratio": 0.87, "num_comments": 73, "comments": [{"body": "Every time someone posts something moon related or  meme-ish, the default response should be to ask them how many GME shares they used to have.", "score": 51, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Bed Bath and Beyond bag holder here. Learned my lesson the hard way.", "score": 8, "replies": [{"body": "Bbby and amc bagholder here… I feel you", "score": 2, "replies": []}]}]}, {"body": "Or how many NVDA shares they have. It’s usually never that many", "score": 8, "replies": []}, {"body": "I agree, to much dreaming about how much and when to sell.  It’s a hold stock for me and many others, including Hedge Funds.", "score": 4, "replies": [{"body": "Nvidia develop products that will be an integral part of this century. This a hold", "score": 2, "replies": []}]}]}, {"body": "Tbh they don’t influence the price at all.", "score": 23, "replies": [{"body": "Yeah. I'm not worried about that at all. Nor do I care when (idiots) sell. But I wish people on here were more informed. I've been doing my due diligence since I bought in 2016. Sharing my knowledge to elevate the discourse in this sub. HODL.", "score": 6, "replies": [{"body": "How much you holding for curiosity sake", "score": 4, "replies": [{"body": "Gauging skin in the game? A % might be more informative.. i only have 5% of the entire portfolio (in NDVX) and I know you’re not supposed to love a stock but I have outsized passion for this to succeed more than my other 95%", "score": 1, "replies": [{"body": "I mean money amount and percent would be better", "score": 0, "replies": [{"body": "60k shares. ~70% of my NW.", "score": 2, "replies": []}]}]}]}, {"body": "The GOAT!!!", "score": 2, "replies": []}]}, {"body": "Yea they barely hold on to 5 shares waiting for a $10 jump for new sneakers.", "score": 2, "replies": []}]}, {"body": "tbh NVDA will still go to the moon anw. let's go to $200 by the end of next year 🙏", "score": 18, "replies": [{"body": "We need the help of the bros at r/wsb and r/gme to get us there. Someone send out roaringkitty signal", "score": 1, "replies": []}]}, {"body": "Let people enjoy some gains, man.", "score": 11, "replies": [{"body": "LOL.  Ain't no one gonna listen to him anyways.  People are people.  We will always learn it the hard way at least once.\n\nI do not like how people trying to compare Nvidia to meme stuff.  Nvidia actually produce goods and services.\n\nSo what?  Who TF am I to say what anyone should do.\n\nI am not opposed to people selling as some people need money and some people just doesn't have the gut or the endurance.  We all start differently and end differently.  Can't impose your financial ideology into someone else even unless they want it.\n\nLook at the bright side, there have to be losers so there can be winners.", "score": 4, "replies": []}]}, {"body": "Jensen is our glorious king", "score": 14, "replies": [{"body": "Rumor has it a few of these \"to the moon\" redditors are sporting a Jensen baby bump..... \n\nI mean people will do anything for a stock tip these days  🤣😂😂", "score": 0, "replies": []}]}, {"body": "It’s coming down. Overextended", "score": 6, "replies": []}, {"body": "I don’t agree with it either but you should let people say what they want", "score": 12, "replies": [{"body": "Freeeeeeedommmmmmmmmm", "score": 2, "replies": []}, {"body": "You’re right I should but it’s upsetting when it’s them attacking others for being bearish or for selling. Just childish really", "score": 4, "replies": [{"body": "Right . Just the Reddit eco system . Hope you make tons of money on this stock", "score": 3, "replies": []}]}]}, {"body": "🚀 🚀 🌙 🍆", "score": 7, "replies": []}, {"body": "💎 🙌", "score": 3, "replies": []}, {"body": "but it's funny.", "score": 3, "replies": []}, {"body": "You gotta remember, this is also:\n- reddit\n- the internet\n\n>we should really act like it and stop this nonsense.\n\n😂😂😂", "score": 4, "replies": []}, {"body": "NVDA 🚀🚀🚀", "score": 4, "replies": []}, {"body": "Speak your yourself I have options I need this bitch to moon 😂 but for real….. if anyone thinks someone taking profits is bad, even if they have 10,000 shares, they are insane. Shit moves mountains on a daily, all of the shares in this group combined is a drop in the bucket. Take profits, hold till next year. Who cares.", "score": 4, "replies": [{"body": "People who come into fast money lose that money just as fast. Same reason why lottery winners go bankrupt or sports players lose it all despite having millions.", "score": 1, "replies": [{"body": "Exactly because it’s never enough.", "score": 1, "replies": []}]}]}, {"body": "Santa rally $250", "score": 4, "replies": []}, {"body": "Guys, stop saying to the moon. We’re better than that. Instead say to Mars.", "score": 4, "replies": []}, {"body": "Apes lol", "score": 2, "replies": []}, {"body": "What is the exit price for Nvidia?", "score": 2, "replies": []}, {"body": "Amen", "score": 2, "replies": []}, {"body": "Haha. Thanks for posting this as it mirrors my internal feelings exactly. But I was more amused than annoyed by the recent wsb-esque posts. I know my game plan and wasn’t gonna be swayed by reddit but I sure had a few good chuckles here.", "score": 2, "replies": []}, {"body": "Did someone say 20 trillion market cap by year end??!!!", "score": 2, "replies": []}, {"body": "If a stock surges and get crazy popular, everyone will get in on it and then you will get stuff like you are complaining about. Your post is in the category of \"old man yells at cloud\" unfortunately. \n\n\nThe simple solution is to not be in Reddit and just read Yahoo finance and other good sources. You can just control yourself, not others.", "score": 2, "replies": []}, {"body": "I don’t think that Reddit affects Nvidia even 1%. This is bigger than every crypto combined. \n\nThere’s like 300 people with half of all USD $. And they are glazing Jensen for 1 gpu", "score": 2, "replies": []}, {"body": "But papa Jensen sending it to the moon any I’m Yoloing with diamond hands.", "score": 2, "replies": []}, {"body": "Welcome to reddit...", "score": 1, "replies": []}, {"body": "Try building a tiny AI app that can predict a Y coordinate given an X coordinate and a slope and you'll cry when you realize how many hours it takes even if you only have 365 samples a year.\n\nNow imagine you do the same thing but Y is now a person's response and X and the slope are just 2 out of million variables, it's impossible to do it with your desktop or high end servers.\n\nNVDIA builds chips that can perform AI-intensive calculations to enable you to the example above. That's why their stock is skyrocketing, it isn't that bullshit DOGECOIN by ELON.", "score": 1, "replies": []}, {"body": "Now that you say this it’s going to $150 EOW", "score": 1, "replies": []}, {"body": "Lol I've been calling papa Huang since 2018. He has been hailing the future of intensive compute and the rise of computer agents. All in on papa huang", "score": 1, "replies": []}, {"body": "To the moon 🌕🚀!!!!!", "score": 1, "replies": []}, {"body": "Lol kinda late to be saying this, it’s gonna happen to all of em", "score": 1, "replies": []}, {"body": "$175 EOY. Told you", "score": 1, "replies": []}, {"body": "![gif](giphy|Ogak8XuKHLs6PYcqlp)", "score": 1, "replies": []}, {"body": "NVDA is doing fantastic", "score": 1, "replies": []}, {"body": "Once in a lifetime!", "score": 1, "replies": []}, {"body": "Says don’t meme..and immediately says 20tn 🤣🤣🤣", "score": 1, "replies": []}, {"body": "is it really that bothersome? Sure the language is childish, but I find it harmless.", "score": 1, "replies": []}, {"body": "Yeah this isn't Wallstreetbets, I'm here bc sometimes people post real substance but there definitely is too many posts that are just noise. Btw I have nothing against crypto, I own some but too many noise posts ruin the subreddit sometimes.", "score": 1, "replies": []}, {"body": "i am still gonna say it. papa jensen is a god. nvda to the mooooon", "score": 0, "replies": []}, {"body": "U on Reddit fam fuck u expecting? lol like you said “enjoy the journey “  so be it.it upset you lol 🤦🏽‍♂️ cmon fam .Anyways to da moon 🤣.", "score": -1, "replies": []}, {"body": "It’s not ruinable", "score": 0, "replies": []}, {"body": "Where my nvda short apes at", "score": 0, "replies": []}, {"body": "A person of culture 👏 bravo 🥂 hehe", "score": 0, "replies": []}, {"body": "RDDT to the moon!   \nI see more and more comments and posts on RDDT  \nNVDA to the moon too!", "score": 0, "replies": []}, {"body": "Like that's going to influence anything", "score": 0, "replies": []}]}
{"title": "2 years ago I was mocked for buying nvda at 144 pre split! They said I was dumb and the stick was going to 80 a share!", "selftext": "I was mocked in stocks/r about 2 years or more when i said I'm a buyer at 144. Same time that Cramer was saying \"NVidia is a loser and I'm short the  stock!\" There's a clip on youtube. Search nvda a loser cramer.\n\nAnyways,  these snot noses probably living at home with mommy were  saying \"dude, you're an idiot!! It's going to $80 a share! Go buy and index cause you're a loser!\"\n\nWell 2.5 years later my shares went from 144 to about 1380 before the current 10 for 1 split!\n\nNow they're calling people stupid for saying it's could go to $200 in a year. Same old thing all over again while they sit making peanuts on the sidelines and being jealous.\n\nDon't listen to bears with $5k portfolios driving for door dash that know nothing about the stock market!\n\nNvda is gonna hit 150 by years end imo!\n\nLet's go team!", "id": "1g3xhdr", "created_utc": 1728959295.0, "score": 104, "upvote_ratio": 0.81, "num_comments": 93, "comments": [{"body": "Try in 2018, telling people it'll be a $1T one day. \n\nLiterally got told it was a 'weird' choice and they called it \"little gaming company\". Argued about data centre marketshare, and was told over and over that Intel would forever hold that moat.", "score": 28, "replies": [{"body": "Bought in at cents per share years ago, convinced some family @ ~$2.50. \n\nI just liked gaming and thought it would be neat owning some of the company who makes my GPUs. \n\nRemind family of how much my gaming hobby, which they all mocked, has changed their lives. \n\nIngrates.", "score": 5, "replies": []}, {"body": "Yes", "score": 3, "replies": []}, {"body": "Similar boat. Got family to buy AMD stock at just below $4 and $11-15 when they just announced/launched Ryzen and still holding with occasional sales at new ATHs for gaming desktop upgrades lmfao. I was indifferent on Nvidia until recently, now I'm joining the suffering squad (post-split $100 / $40 and $60 on NVDL) on multiple fronts longterm", "score": 1, "replies": [{"body": "AMD and ENPH were my first market runners before TSLA exploded. Somehow people got ENPH over AMD, but I had a similar thesis with AMD. Especially after the lawsuit with INTC, but AMD eating into the desktop and cheaper cost with higher performance was a hard buy to me.", "score": 2, "replies": []}]}, {"body": "I was told around that same time that both NVDA and AMD always disappoint and never live up to expectations.  This was by an MD at Guggenheim partners. \n\nI bought it because I believed in self driving cars and AI.  I was only partially right. I had 4700 shares at a 91.50 per share cost pre split. Now after cashing in over 50% I can let it ride and see where it goes.  I’d be happy with 175-180 by next year.", "score": 1, "replies": []}, {"body": "And now see how far Intel has fallen.", "score": 1, "replies": []}, {"body": "Im a noob here, can someone explain exactly what nvidia did to become so profitable and how it ties into AI. I thought they make graphics cards, lmao ..", "score": 1, "replies": [{"body": "NVIDIA used to mainly make GPUs for gaming. But as AI became more important, companies realized that NVIDIA’s GPUs were also perfect for training AI models and handling massive amounts of data. NVIDIA jumped on this opportunity, developed specialized hardware and software for AI, and now dominates the AI computing industry, which is driving their massive profits and stock growth.", "score": 2, "replies": [{"body": "do they have something to do with semiconductors as well", "score": 2, "replies": [{"body": "They design them but they partner with companies like tmsc who actually make them", "score": 2, "replies": [{"body": "Is TSMC a good stock? Why is TSMC not having the same explosive growth as Nvidia", "score": 2, "replies": [{"body": "Provider vs service provider. Investor perception and all that\n\nI think tsm is a very good stock to own", "score": 1, "replies": []}, {"body": "There you go a free 10% pop today", "score": 1, "replies": [{"body": "We memed it into happening", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I bought it at 134 and 127. I do what I do, and I really don't care about others' opinions. They know as much as I do, which is basically nothing. No one knows where a stock is going, so your opinion is the only one that counts. They can put their own money on the opposite side if they are so smart.", "score": 8, "replies": [{"body": "I followed advice at a coffeeshop to buy Nvidia and my gut told me it will probably be good. Wish I bought more sooner and did not sell any to rebalance my account. ", "score": 1, "replies": []}, {"body": "Why didn't you buy 2 years ago?....", "score": -13, "replies": [{"body": "OP posts about being mocked for their investment decision, and their reply to a sensible comment about people doing what they want with their money is to borderline mock the commenter for not doing what OP thinks they should have.", "score": 14, "replies": [{"body": "OP is just a hypocrite.", "score": 5, "replies": [{"body": "Ahahhaok", "score": -11, "replies": []}]}, {"body": "sharp hard-to-find cheerful simplistic afterthought literate impossible foolish command market\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 3, "replies": []}, {"body": "Ahaha", "score": -7, "replies": []}]}, {"body": "That is like asking why people didn't buy Apple shares in the 90s when they were on the verge of bankruptcy. People didn't buy a stock because they didn't. Nvidia is an incredible company, but a few years ago they were a play on crypto and gaming, both of which are good, but also boom bust in terms of trading cycles. This AI stuff took off and finally found some really cool use cases. That was the reason to buy Nvidia and no one knew when this AI stuff was going to pay off.", "score": 5, "replies": [{"body": "I did!", "score": -1, "replies": [{"body": "Do you still own the Apple shares today? If so congrats and well done.", "score": 1, "replies": [{"body": "Bozos on cnbs were saying to sell aapl at 165 a while ago! I didn't listen cause I know they're all working for hedge funds!", "score": 2, "replies": []}, {"body": "Yup. Aapl msft googl lrcx unh lin lly cost meta nvda etc", "score": 0, "replies": [{"body": "I have a large position in XLG that has all of those companies. It has treated me very well over the years.", "score": 1, "replies": []}]}]}]}]}, {"body": "Bro, I don't know. I just trade.", "score": 3, "replies": [{"body": "Why don't you hold? You want to have no retirement at 65?", "score": 0, "replies": [{"body": "The least amount of time I spend in the market, the better. Plus, if we look at it that way, I should have bought AMZN at 16 a share and just held on. No one knows the future. AOL was the big leader at that time and AMZN was \"just a bookstore\". Who could have possibly known? Hindsight is always 20/20 vision. ALWAYS.", "score": 3, "replies": [{"body": ">The least amount of time I spend in the market, the better\n\nIt's clearly the opposite, but to each their own", "score": 2, "replies": [{"body": "Only two things are clear concerning the market. 1. Uncertainty 2. Anything can happen at any time. \nThe end.", "score": 1, "replies": [{"body": "I like the old adage \"time in the market beats timing the market\" \n\nPlenty of anecdotes around here about people timing NVDA (and other stocks) and selling too soon. \n\nBut I'm not here to change anyone's mind, I just like the stock. The end.", "score": 2, "replies": []}, {"body": "Dudes making no sense.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Now what's all this chest pounding about, and snorting around. It's gonna be up and down up and down soooooo.", "score": 5, "replies": [{"body": "Not anymore!", "score": 0, "replies": []}]}, {"body": "I was mocked at an investment firm for buying this stock in 2019 based on “ridiculous valuation” at an equivalent price of $3 per share today. So glad I ignored them all.", "score": 5, "replies": [{"body": "Yes ma'am! I agree", "score": 1, "replies": []}, {"body": "Why don’t you call them out?", "score": 1, "replies": [{"body": "I did and I still do. They also have to face the fact that they didn’t take my recommendation to include the best performing S&P 500 stock widely across a book of £35bn AUM.", "score": 1, "replies": [{"body": "No? I have yet to read what compamy", "score": 1, "replies": []}]}]}]}, {"body": "Honestly is there another company in another niche that's like nvidia and just below $10 a share i could purchase? Because really missed a chance to buy nvda in 2018-19", "score": 4, "replies": [{"body": "SOUN", "score": 1, "replies": [{"body": "Damn appreciate that man, soundheard AI, interesting!", "score": 2, "replies": [{"body": "And you are welcome!", "score": 2, "replies": []}]}, {"body": "Could you recommend 1-2 more like this", "score": 2, "replies": [{"body": "I haven’t found any others that look as promising as SOUN. Honestly I’m still looking for the next golden goose. I’ll definitely let you know when I do. I Promise. And you do the same please", "score": 1, "replies": [{"body": "Oh sounds good! I see that it was around $10 seven months ish ago and has dropped to half\n\nBut company has good foundation", "score": 1, "replies": []}]}]}]}]}, {"body": "Most people don’t understand the moat that NVIDIA has built. That’s why you had financial analysts thinking the true value was 25. If you’re on the bandwagon for FOMO then this stock is not for you. If you understand why it’s so important than hold it long term.", "score": 3, "replies": []}, {"body": "Cramer made this comment in context of the time. IF you listen to the clip, he makes a point. He has been a big believer on Nvidia for all other times before and after this clip.", "score": 4, "replies": [{"body": "OP didn’t post the clip but everyone knows Cramer is a long time NVDA lover", "score": 2, "replies": []}, {"body": "What point did he make when all he or anyone had to do was hold and be patient?...", "score": 2, "replies": []}]}, {"body": "It’s hilarious how little you can tell some folks know about anything really when they make no mention of the underlying business.  \n\nJust a wall of text saying “stonk go up, look at stonk price”", "score": 2, "replies": [{"body": "Yup. That's all I care about!", "score": 0, "replies": [{"body": "Quite literally.", "score": 2, "replies": []}]}]}, {"body": "100% Right! Cant stand all the NVDA hand wringers who seem to want to prevent people from growing their wealth because THEY don’t have the cajones to get in (and stay in) themselves!", "score": 2, "replies": []}, {"body": "I invested nearly all my cash at around $260 (pre-split) but I had to sell it because I needed cash. \n\nI even tried to remortgage my apartment but a missed payment on an ex-partner’s washing machine that I wasn’t even aware of nuked my credit rating so my only option was to sell. It pained me as I knew it was going to be the biggest company in the world. \n\nBought back in for 6 figures at ~$100 post split so not awful but damn, I’d have made a killing if it wasn’t for that damn washing machine.  \n\nWatch out for white goods. They can be a killer", "score": 3, "replies": []}, {"body": "berserk skirt badge shocking screw advise expansion ghost insurance attempt\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 1, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "How many shares do you own ?", "score": 1, "replies": [{"body": "500 million shares", "score": -2, "replies": [{"body": "Pff those are rookie numbers I thought you owned at least 1Trillion dollars at the minimum 😏", "score": 1, "replies": []}]}]}, {"body": "Sounds about right those guys are haters . I am in a group even now all I hear is how it’s overrated. I bought at much higher and got the same thing .", "score": 1, "replies": []}, {"body": "And people were saying “what a better stock - Zymergen or DNA” when both went to zero later. ", "score": 1, "replies": []}, {"body": "I member :)", "score": 1, "replies": []}, {"body": "They", "score": 1, "replies": []}, {"body": "I work in a family firm. BEGGED my uncle to invest in Nvidia and was laughed out of the room by him and my cousin. My mother and I went in. We’re laughing at our stupid gain.", "score": 1, "replies": []}, {"body": "I bought it 20 years ago for cheap - I forget how much.  I sold it several years later when it doubled and I felt like the wolf of wall street (even that movie had not come out yet).  I sold because I wanted (not needed) a larger down payment on a new home so I could take a lower mortgage, have a  lower mortgage payment.  So many lessons to be learned with this dumb move as I'd be retired toady had I kept it not to mention I could have refinanced that mortgage along the way to lower rates or simply paid off my home had I kept the stock.  Buy and hold long can be a tough lesson to learn in life.", "score": 1, "replies": []}, {"body": "I bought at 230 before the split. 40 shares. It split and now I have 400 shares. And it's up 450 percent since I bought it. It's up over 150 percent this year alone.", "score": 1, "replies": []}, {"body": "Nice job OP. Wish I had stock stories like this verses me buying Tesla at IPO and selling a couple of weeks later when it ran up.  Would have had an island by now.", "score": 1, "replies": []}, {"body": "Screenshot of said post or GFY", "score": 1, "replies": []}, {"body": "Yea, what a dummy /s", "score": 1, "replies": []}, {"body": "I bought at $0.85 😶", "score": 1, "replies": []}, {"body": "Are you sending this from the year 2055 when nvidia is $2,400 per share?", "score": 1, "replies": []}, {"body": "Same like the “the experts “ said TSLA will go below $100 from $150 , and it went the opposite to $240.00 \nIf you strongly believe in something, do it and live with the consequences. For better or worse. No regrets.", "score": 1, "replies": []}, {"body": "remind me in 1 year", "score": 1, "replies": []}, {"body": "Slow your roll, you have years to see how all this pans out. Just be happy you’re positive. \n\nAt the end of the day it’s fundamentally overpriced.\n\nAlso you sound pathetic as fuck, you’ll be humbled either by NVDA or another.", "score": 1, "replies": [{"body": "So don't you loser", "score": 1, "replies": [{"body": "lol ok", "score": 1, "replies": [{"body": "You sound jealous.... ahahahahahahaaaa", "score": 1, "replies": [{"body": "Sure am glad you can tell 😗", "score": 1, "replies": []}]}]}]}, {"body": "Lol. How will I be humbled if I've ridden it from 14 a share up?  If it goes back there, which it won't (sorry YOU missed out ahahaha!) I'll just buy more", "score": 1, "replies": [{"body": "Broken clocks correct twice a day. Though I doubt you still beat the market. 😭\n\nShare your 5yr and 10yr annualized  performance.", "score": 1, "replies": [{"body": "My 5 year is around 10x because I bought aapl in 2020 and nvda in 2021", "score": -1, "replies": []}]}, {"body": "Why are you being an asshole for lol?", "score": 1, "replies": []}]}]}, {"body": "Bro acting as if he knew all about LLMs before anyone knew about it.", "score": 1, "replies": [{"body": "Bruh, it was literally that price and lower at ChatGPT day.", "score": 1, "replies": []}, {"body": "I did", "score": 1, "replies": []}]}]}
{"title": "Google to buy nuclear power for AI datacentres in ‘world first’ deal", "selftext": "https://www.theguardian.com/technology/2024/oct/15/google-buy-nuclear-power-ai-datacentres-kairos-power\n\nGoogle has signed a “world first” deal to buy energy from a fleet of mini nuclear reactors to generate the power needed for the rise in use of artificial intelligence.\n\nThe US tech corporation has ordered six or seven small nuclear reactors (SMRs) from California’s Kairos Power, with the first due to be completed by 2030 and the remainder by 2035.\n\nGoogle hopes the deal will provide a low-carbon solution to power datacentres, which require huge volumes of electricity.\n\nThe US company, owned by Alphabet, said nuclear provided “a clean, round-the-clock power source that can help us reliably meet electricity demands”.\n\nThe explosive growth of generative AI, as well as cloud storage, has increased tech companies’ electricity demands.\n\nLast month, Microsoft struck a deal to take energy from Three Mile Island, activating the plant for the first time in five years. The site, in Pennsylvania, was the location of the most serious nuclear meltdown in US history, in March 1979. Amazon bought a datacentre powered by nuclear energy in March from Talen Energy.\n\nThe locations of the new plants and financial details of the agreement were not revealed. Google has agreed to buy a total of 500 megawatts of power from Kairos, which was founded in 2016 and is building a demonstration reactor in Tennessee, due to be completed in 2027.\n\nMichael Terrell, the senior director for energy and climate at Google, said: “The grid needs new electricity sources to support AI technologies that are powering major scientific advances, improving services for businesses and customers, and driving national competitiveness and economic growth.\n\n“This agreement helps accelerate a new technology to meet energy needs cleanly and reliably, and unlock the full potential of AI for everyone.”\n", "id": "1g47oik", "created_utc": 1728998805.0, "score": 518, "upvote_ratio": 0.96, "num_comments": 76, "comments": [{"body": "Glad to see Nuclear is being considered by Google as Carbon Neutral.", "score": 234, "replies": []}, {"body": "I’m telling, y’all… Google is ahead of the game and is so undervalued because of DOJ. I’m long 200 shares", "score": 189, "replies": [{"body": "Waymo, 10% of SpaceX, the Reddit AI Deal…\n\nAll of that for a forward PE below 20 and double digit growth every year? Crazy undervalued", "score": 82, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "im listening", "score": 8, "replies": []}]}, {"body": "I think its 7% of spacex. The 10% figure includes fidelitys investment.", "score": 1, "replies": [{"body": "GOOG's % of that deal is unknown", "score": 2, "replies": []}]}]}, {"body": "im with ya! remember, the 2 ceo's of google deepmind just won a nobel prize too...", "score": 41, "replies": [{"body": "One of them in Toronto! ( My home city )", "score": 8, "replies": [{"body": "Geoffrey Hinton doesn't work for Google anymore.", "score": 4, "replies": []}, {"body": "This is the piece of DD I was missing", "score": 1, "replies": []}]}]}, {"body": "Damnn, i'm only 20 shares in whats your avg price?", "score": 11, "replies": [{"body": "$167. But I keep adding", "score": 10, "replies": [{"body": "Nice mine is $135 i plan to keep adding too", "score": 10, "replies": [{"body": "Beautiful", "score": 4, "replies": []}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Tough times of his own making", "score": 1, "replies": []}]}, {"body": "We really expecting Google to follow through on a project that is going to take 6+ years?\n\nThey are quick to cancel things at the first sign of trouble and nuclear projects are rarely smooth.", "score": 27, "replies": [{"body": "They also said that about Waymo. Look at it now.", "score": 50, "replies": []}, {"body": "Consumer products without a good path to profitability. They cancel those quickly. Youtube, GCP, and Waymo have all had long periods of large net losses while google has kept them going.", "score": 7, "replies": []}, {"body": "That's one of the reasons I have 279 shares of Google, because they try a lot of things and cancel shit if they know it won't make them more money. That's a plus for me.", "score": 3, "replies": []}, {"body": "I don't even trust google maps anymore and now I gotta worry about them using nuclear reactors.", "score": -2, "replies": []}]}, {"body": "Um? Sam Altman “Oklo” and Amazon", "score": 2, "replies": []}, {"body": "Same for me I bought 50 unfortunately at 188$ and 100 more at 154$", "score": 1, "replies": []}, {"body": "DOJ kept FB stock down for a long time.\n\nI think GOOG Needs AI more than AI needs Goog. Search might be reduced A LOT MORE for the 'tech savy' And Apple is going to make AI easier to use.\n\nLlama is open source so people who want to invest in AI can go to NVDA,Google,Meta, sorta MSFT. Google has Gemini and map/search data but they seem late to the game. Google has room to grow but is it the better buy over MSFT,NVDA, meta? I'd pick it over Intel but both sorta have leadership/hype issues.", "score": -4, "replies": []}]}, {"body": "This is cool, but didn’t MS already announce a deal to restart and buy nuclear power from Three Mile Island a few weeks back?", "score": 57, "replies": [{"body": "Yea I remember reading something similar about AWS. To me this isn't a first or only option, but something all DCs will likely be doing (if they can afford it) soon. It's the ultimate answer. Clean reliable power that will back feed the grid. Nuke plants don't want to run partially loaded, they are designed to run full tilt. This will help solve the US weak grid problems. \n\nBullish because this shows goog and others are looking to stay innovative. I'm long on a grip of shares.", "score": 18, "replies": [{"body": "whats a DC? digital company?", "score": 1, "replies": [{"body": "DATA CENTER", "score": 7, "replies": []}]}]}, {"body": "Yes, all big tech is after power. \nWSJ had a whole podcast on Microsofts deal with Three Mile Island\n\nHeadline is misleading thinking Google is an outlier", "score": 3, "replies": []}, {"body": "Amazon signed a deal for nuclear power with Talon Energy.  \n\nOracle proposed a new DC powered by SMRs.   \n\nMicrosoft signed a deal for nuclear power with Constellation at Three Mile.  \n\n And there’s a record number of gas-powered capacity being proposed to fill the gap unfortunately. **AI currently consumes 4% of total US electricity consumption and will more than double by 2030.**", "score": 3, "replies": [{"body": "Thinking to my buttons there are two reasons energy consumption should not grow exponentially. 1. Hardware evolves to be more efficient 2. AI modelling should stabilise as, I imagine, companies will sell pre-processed data down the business pipeline, thus lowering the consumption to produce new AI models.", "score": 1, "replies": []}]}, {"body": "Silicon valley in general loves nuclear. They just lack the attention span to get one built", "score": -2, "replies": []}]}, {"body": "I am long nuclear. Funny thing is this announcement didn’t do anything. Stock keeps going down so I keep buying more.", "score": 17, "replies": [{"body": "same lol its early days in my opinion", "score": 6, "replies": [{"body": "What are nuclear stocks", "score": 2, "replies": [{"body": "Stocks that are about to blow up.", "score": 8, "replies": []}, {"body": "URA is a good ETF with exposure to the fuel used in reactors (uranium) and some other nuclear stocks", "score": 1, "replies": []}]}]}, {"body": "Which company/companies are you watching in the nuclear sector?", "score": 6, "replies": [{"body": "TLN. Holy fuck my calls are printing.", "score": 2, "replies": []}]}]}, {"body": "So do i invest in uranium now?", "score": 12, "replies": [{"body": "+1 on uranium", "score": 1, "replies": []}]}, {"body": "Skynet needs power and money. BTC and uranium for the win!!!", "score": 16, "replies": []}, {"body": "Made good money in the past year and a half withan nuclearetf. Nuclear or Fusion Energy will be the future !!!", "score": 10, "replies": [{"body": "Until they won't be enough.  \nThen AI will create artificial humans to suck energy from, and create the Matrix to keep them happy.", "score": 4, "replies": []}, {"body": "I didn't invest very much but % wise I did well with Uranium myself over the last two ish years. Probably related?", "score": 1, "replies": []}, {"body": "Ok, can you explain this then? \n\n  \n[https://www.reuters.com/business/energy/nuscale-power-uamps-agree-terminate-nuclear-project-2023-11-08/](https://www.reuters.com/business/energy/nuscale-power-uamps-agree-terminate-nuclear-project-2023-11-08/)\n\n  \nNuclear is the most costly energy", "score": -5, "replies": [{"body": "Don't know why this is downvoted, you're absolutely right. Nuclear may sound great on paper, but in practice it's usually one of the most expensive power sources we can build. \n\nIt also takes so frigging long to build a nuclear plant (much longer than other energy sources) that it's simply not viable to just shift to 100% nuclear energy to combat climate change. Sure, we could in theory speed up that production by rolling back a bunch of safety measures and government red tape, but do you really want to be the guy who rolled back safety measures the next time there's a Fukushima or 3 Mile Island event that turns everyone against nuclear for another decade or two?", "score": 4, "replies": [{"body": "nuclear was never going to be the sole answer, but it will be the foundation that cyclical renewables are build off of. There is a lot of innovation in this space to bring that the cost of a reactor, like the SMR's mentioned in the post, Bill gates terrapower, and adjusting bureacracy to not double costs and maintain safety", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Your comment is complete bullshit. \n\nOne Google search reveals that you only Need about 22m acres. Everything included\n\nRenewables are the Future and a must.", "score": 4, "replies": [{"body": "You are correct. I deleted my original comment to not spread misinformation.", "score": 2, "replies": []}]}]}, {"body": "We are 20 years behind. We should have started building new nuclear plants in the early 2000.", "score": 3, "replies": []}]}, {"body": "Currently yes, that’s why I am investing right now", "score": 1, "replies": []}]}]}, {"body": "Alphabet is always ahead of the game", "score": 8, "replies": []}, {"body": "“World first” lmao seems like everyone forgot about the Microsoft 3 mile island deal", "score": 14, "replies": [{"body": "It’s the first commercial deal for SMRs", "score": 21, "replies": [{"body": "Micro-smr", "score": 0, "replies": [{"body": "This deal is for SMRs. 50MW demo unit then 75MW production units. Microreactors are usually 3-15MW", "score": 3, "replies": []}]}]}]}, {"body": "Wise move nuclear is the power of the stars no primitive BS", "score": 2, "replies": []}, {"body": "Finally some decent sci-fi shit happening.", "score": 2, "replies": []}, {"body": "noice", "score": 2, "replies": []}, {"body": "Incredible", "score": 3, "replies": []}, {"body": "Bullish", "score": 3, "replies": []}, {"body": "I work for facilities at Google, and have been pitching this idea to my teams for the past year! So happy to see this moving forward. Can’t wait to work on these projects.", "score": 2, "replies": []}, {"body": "This is the bridge that is needed to become a Type 1 civilization. Microhard is doing the same thing with 3 mile island (a reactor site)", "score": 2, "replies": []}, {"body": "This is fantastic, by 2050 ill have my own portable nuclear power plant to power my AI PC", "score": 1, "replies": []}, {"body": "Always on my watch list.", "score": 1, "replies": []}, {"body": "I guess they let the ai run the powerplant. Let's see how long the ai takes to kill everyone in a giant radius... Though it is \"clean\" energy which is good.", "score": 1, "replies": []}, {"body": "Why would they choose kairo and none of the other more established companies (preferably the public ones) ?", "score": 1, "replies": []}, {"body": "Good luck! I haven’t noticed any nuclear power plants in US has not been significantly delayed and cost escalated in the last 50 years.\n\nPicking a company that has zero experience in building a nuclear power plant can only add more headaches down the road.", "score": 1, "replies": []}, {"body": "Sold my stocks due to this news. I cannot trust a company making such dumb decisions.", "score": -5, "replies": []}]}
{"title": "Who is more regarded? a) Threw out hard drive with 8,000 bitcoins? or b) Started with $88k, made $415 million from $TSLA and lost it all", "selftext": "", "id": "1g40pv5", "created_utc": 1728970641.0, "score": 202, "upvote_ratio": 0.94, "num_comments": 80, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 712 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Clearly the Tesla guy.\n\nLet's be honest, crypto bros were not ahead of their time. It was a bunch of nerds that were like \"omg no one sees my money\", and then they got lucky.\n\nTesla guy chose to be regarded.", "score": 316, "replies": [{"body": "Exactly. Bitcoin was valued at around $100 each in mid 2013, so the maximal size of his 'loss' was around $800k-$1m, and the rest was hypothetical. Everyone has lost when looking back in hindsight. The Tesla guy's options hit the jackpot and then he leveraged himself even more to lose it all within two years.", "score": 45, "replies": [{"body": "Bitcoin was like $0.08 in 2010 I think...", "score": 3, "replies": [{"body": "It was. I spent 76 on a $10 Xbox gift card to buy the gears 2 dlc 😭", "score": 2, "replies": []}]}]}, {"body": "Tesla guy went full regard.", "score": 27, "replies": [{"body": "At least he got wined and dined by the private banks.", "score": 5, "replies": [{"body": "The bank even got him to donate several million to the bank's charity. They got theirs.  \n\nEdit: They got him to donate $25 million. Holy shit.", "score": 9, "replies": [{"body": "Gotta tip the dealer if you are on a heater, you know that", "score": 3, "replies": []}, {"body": "Lmao I just wanna see what his private banker received come bonus time.", "score": 2, "replies": []}]}]}]}, {"body": "100%", "score": 17, "replies": []}, {"body": "Bruh. I was just trying to buy LSD on the dark web back in the day. I spent $120 when it was like $3 a coin.", "score": 8, "replies": []}, {"body": "I was buying BTC for $500 a pop for the black market when I first started using it. Man if I could go back in time. I just liked the anonymity", "score": 9, "replies": [{"body": "I bought bitcoins when it was 14 USD a piece and sold when it hit 100 because i thought anyone would be insane to buy it for that price lol. And it zigzagged for a while at that price too", "score": 11, "replies": [{"body": "I tried buying bitcoin in 2013, but coinbase wanted a full copy of my drivers license, I was like “erf this isn’t anonymous at all”.\nI reluctantly tried to do it, but realised my license had expired and I needed a new one, by the time I got it I never went back to bitcoin. \n\nI was only going to throw in about 500 bucks. But that’d be over $300k today 😕😕", "score": 6, "replies": [{"body": "Only if you HODL’d", "score": 6, "replies": []}, {"body": "When could you buy Bitcoin on Coinbase? The earliest, I mean…", "score": 2, "replies": []}]}]}]}, {"body": "He didn't choose to be regarded. Poor guy was born that way", "score": 1, "replies": []}, {"body": "I disagree. In 2013 we(cryptobros) were all just trying to get high in countries where it wasn't legal. I probably bought like 20g of subpar weed valuated at  usd 300k. In today's btc back in those days, you think that sounds like something a regard would do??? That's what I thought.", "score": -6, "replies": []}, {"body": "Okay I can't argue with this", "score": 0, "replies": []}, {"body": "\"no one sees my money\"? Everybody see your money. You dont know anything and chose to speak about topic.", "score": -1, "replies": []}]}, {"body": "bitcoin guy was stupider.  he had $1m worth of bitcoins on a drive.  he had an extra drive that he was throwing out but didn’t double check it wasn’t the bitcoin drive.  he asked his wife to throw out the trash in the morning and his partner refused.  so he decided to wait till morning to double check the drive.  he wakes up late and turns out his wife threw out the trash after all.  \n\ndude didn’t label the drive and had doubts he was throwing out the correct drive and decided to wait till next day to check.  atleast the tesla guy could blame financial professionals for failing their fiduciary duty.", "score": 89, "replies": [{"body": "That just... blows my mind. Like my dude had $1m dollars lying around and he couldn't even be arsed to double check the fucking drive!? He would have 100% lost every single pound anyway because he is truly regarded, as in the medical diagnosis regarded.", "score": 36, "replies": []}, {"body": "This is definitely much more stupid than TSLA guy. Why was he in such a massive rush to throw the drive out anyway, it's not like it would have spoiled and started rotting.", "score": 6, "replies": [{"body": "What else was on it is why.", "score": 6, "replies": [{"body": "midget porn? Understandable.", "score": 1, "replies": []}]}]}, {"body": "i've lost a couple grand because i was too lazy to get my phone , but if I had 1M at stake im rising from the dead to get that hard drive if it's in the trash.", "score": 2, "replies": [{"body": "Last I heard, the guy is assembling a team to dig through the trash at no cost to the city, and will give the city 10% of the BTC proceeds, but the city is still rejecting it. They should bump that up to 30 ~ 40% at least.", "score": 1, "replies": []}]}, {"body": "Maybe there was some weird shit on that hard drive. Seriously why the rush in throwing out a hard drive. It’s not like it takes up a bunch of space. I’m a neat freak and I’d definitely take another week just to be safe", "score": 1, "replies": []}, {"body": "You know those European apartments are so small that drive was taking up half his office space lol", "score": -8, "replies": [{"body": "Reframing, I like it... It was actually a good thing to lose $600mil, at least I'm not a hoarder", "score": 2, "replies": [{"body": "I thought that comment was hilarious but I got downvoted to the basement floor, sheesh", "score": 1, "replies": [{"body": "Europeans, like my son's soccer refs, seem to be very sensitive individuals", "score": 2, "replies": [{"body": "They hangout in WSB ? lol 😂 they know their apartments are small , they invented tiny IKEA furniture to go inside them lol", "score": 2, "replies": [{"body": "IKEA should make a storage bin for Bitcoin hard drives and name it after this guy", "score": 2, "replies": [{"body": "Oh that would be next level hilarious lol it should come with labels in a few different languages that say “ do not throw away “", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "they should fight to find out\n\nbumfights style, not youtuber boxing bs", "score": 15, "replies": [{"body": "Choking, spitting and fingering allowed", "score": 4, "replies": [{"body": "That’s more like Evolved Fights style than bumfights style", "score": 2, "replies": []}]}]}, {"body": "The 400 million guy is more regarded. He had the money cash, and could touch it. Losing hard drive guy never had a chance.", "score": 13, "replies": [{"body": "Idk, he did try to seek professional help though. That's more sense than any of us regards here", "score": 2, "replies": [{"body": "Any professional would never let him YOLO to begin with. It was his YOLO beliefs that got him that 400mill in the first place.\n\nAny \"professional\" would simply tell him to invest in SPX and bonds.", "score": 4, "replies": []}]}]}, {"body": "Definitely b). \n\nIn 2013 bitcoin is worth at most \\~$250 so he lost around 2m. The price now does not matter in his case since at the time he lost it, it could either go to the moon or zero.", "score": 26, "replies": [{"body": "Ye, I also casually lose 2M by chucking out the trash.", "score": 17, "replies": [{"body": "Well, run your jet into the hanger? poof.\n\nGet run over by a car? Lot worse than 2M.\n\nShit happens.", "score": 1, "replies": []}]}, {"body": "Good point. People tend to evaluate something based on what it could have been, often to dramatize the number.", "score": 6, "replies": []}]}, {"body": "Definitely anyone buying puts on nvda or spy last 7 trading days.", "score": 16, "replies": []}, {"body": "Intel guy. ", "score": 16, "replies": [{"body": "that's not a done deal yet.\n\n(long intc)", "score": 1, "replies": []}]}, {"body": "When I enter a competition for the biggest regard, and those are my opponents", "score": 5, "replies": []}, {"body": "I managed to speak to bitcoin guy a few years ago.\n\nHe's pissed.", "score": 4, "replies": []}, {"body": "The Bitcoin guy wins for the dumbest blunder of all time, but the $TSLA rollercoaster is a true crash-and-burn legend.", "score": 3, "replies": []}, {"body": "The \"investors\" who have been supporting the coin guy for a decade now to get a cut from his immence wealth once it emerges from the landfill. On the other hand he is a pretty clever freeloader, who lives from the stupidity of others using an unverifiable claim to vast riches.", "score": 3, "replies": [{"body": "Like every startup's pitch 😅", "score": 2, "replies": []}, {"body": "Just like Uber", "score": 2, "replies": []}]}, {"body": "How do you turn $88K to $415 million. Ridiculous.", "score": 2, "replies": [{"body": "And losing it all is both ridiculous and hilarious.", "score": 8, "replies": []}, {"body": "0dtes?", "score": 2, "replies": [{"body": "Probably. I mean if he made that much with just $88K,\n\nit shouldn't be too hard for him to gain back some of the losses.", "score": 1, "replies": []}]}, {"body": "I would like to learn that trick too.", "score": 1, "replies": []}, {"body": "IIRC, he just bought it on a margin and it kept going up (freeing up more margin), so he kept buying more... until the trend reversed and he f'd up his margin calls.", "score": 1, "replies": []}]}, {"body": "not even a contest, Tesla guy is an order of magnitude more regarded. And of course when he loses he sues the brokerage because in his words \"why didn't you know I was a stupid moron?\" Banker: \"Why did you check the box saying you had 10 years experience in trading options?\"", "score": 2, "replies": []}, {"body": "B", "score": 1, "replies": []}, {"body": "The question is moot, because racing to the bottom is a team effort. And we, ladies and gentlemen, are part of the team.", "score": 1, "replies": []}, {"body": "Coin guy reads like a pathetic scam.", "score": 1, "replies": []}, {"body": "He will spend his whole life thinking about this now.", "score": 1, "replies": []}, {"body": "one is canadian and other is british, it is good both didn't get their hands on the large sum of money.", "score": 1, "replies": []}, {"body": "Plot twist, they’re the same guy.", "score": 1, "replies": []}, {"body": "Honestly if that happened to me I would’ve gone long on rope no joke.", "score": 1, "replies": []}, {"body": "B for sure", "score": 1, "replies": []}, {"body": "Both regards of the highest order.", "score": 1, "replies": []}, {"body": "TSLA guy was tru regard, it was right in front of him and he lost it", "score": 1, "replies": []}, {"body": "Crypto guy. \n\nWho the hell throws out a hard drive? I get spring clean outs, but hard drive takes up 6 inches of space. Even if you end up throwing it out, at least drill it. And when you drill it, you will always check the contents. \n\nHow many people just find a hard drive and toss it? You can’t defeat stupid I guess.", "score": 1, "replies": []}, {"body": "He must have the worst PTSD. Every day, hour, second. I bet you he will put a bullet in his head soon", "score": 0, "replies": []}, {"body": "If only they bought gold.", "score": -1, "replies": []}, {"body": "Elon still trying to stay relevant?", "score": -2, "replies": []}]}
