{"title": "Exclusive: Tesla files paperwork to make electric motors for airplanes, boats, and more", "selftext": "", "id": "103b3v3", "created_utc": 1672857282.0, "score": 189, "upvote_ratio": 0.93, "num_comments": 80, "comments": [{"body": "Now that it's clear this wasn't the company itself, I'm taking this post down. It's only relevance is that it might move the stock price for a short period before people notice the truth of the matter. Not sufficient.", "score": 1, "replies": []}, {"body": "> Update: A Tesla fan filed the trademark on behalf of Tesla – seemingly without the company’s knowledge.", "score": 17, "replies": [{"body": "Thank you. I promptly deleted this story from my mind. This never happened.", "score": 5, "replies": [{"body": "Generally best to ignore stories/submssions from electrek, in my experience. They do very little if any journalistic fact checking, i.e. checking their 'facts' before they go to print.", "score": 3, "replies": []}]}, {"body": "Ahhahahahaha \n\n\nSomeone trying to bump the stock to make their call options print.", "score": 1, "replies": []}, {"body": "The identity verification processes of the trademark office must be pitiful.", "score": 1, "replies": []}]}, {"body": "Turns out it was fake", "score": 12, "replies": []}, {"body": "I can't emphasize enough how much more i would have liked Elon spend 44B on developing a VTOL, supersonic, EV jet than on Bird App. The Boeing/Airbus duopoly is unbearable and innovation has completely stagnated, they are happy being \"competitive\" with 2% here or there. Yes yes, battery density isn't quite there yet but there is plenty of other tech to develop in the meanwhile.", "score": 71, "replies": [{"body": "There are only so many engineers working at Tesla. Spending more money won't spend up projects like this. Also part of it is waiting for battery density to increase which they're already working on.", "score": 31, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "10 billion dollars a year for PS2 HD graphics", "score": 13, "replies": []}]}, {"body": ">waiting for battery density to increase\n\nWith that $44B maybe they go from \"waiting\" to working on the problem and developing the technology faster?", "score": 2, "replies": [{"body": "They are already spending capital as fast as possible.", "score": 1, "replies": []}]}, {"body": "> There are only so many engineers working at Tesla. \n\nIf you have money (a small fraction of 44B), you can hire more engineers and managers.\n\nImagine the headlines of \"Apple/Google/DeepMind/Microsoft avoids important project because \"we only have so many engineers and aren't willing to hire more, so we'll let someone else nab that market space we wanted\"", "score": 4, "replies": [{"body": "Actually there are not enough good engineers. At any price.", "score": 6, "replies": [{"body": "Like any category. The bulk of the workers are just drones.", "score": 3, "replies": []}]}]}]}, {"body": "You don't have to start with the huge passenger planes either, same as the car master plan.\n\nStart with a dual seater sporty toy and work through and up\n\n44bn wasted.", "score": 19, "replies": [{"body": "Sorry but you are all missing the point. \n\nAll US corporations, when reaching a significant size, had to gain control of some media outlet. \n\nThere is no exception, and Elon has no choice neither. \n\nTo prove the point, AOC is still on Twitter and so are all the reps.", "score": -2, "replies": [{"body": "Most people have totally missed that point. You can’t be mega rich without political influence. Even more so you can’t change the world.", "score": 5, "replies": [{"body": "Particularly if you don’t do paid advertising.", "score": 2, "replies": [{"body": "What if they also just did PR and paid advertising...  \n \nEspecially if many are forecasting \"too much cash\" becoming their \"problem\"", "score": 1, "replies": [{"body": "> PR and paid advertising  \n\nThis also costs money, I reckon about $44Bn", "score": 1, "replies": [{"body": "Gary reconned less than a million a year for a PR department, that one seems like a no brainer", "score": 1, "replies": [{"body": "Apparently, Tesla has given PR responsibility to the relevant executives. For example, in China they did massive PR campaigns to alleviate the fake news. These were done by Tom Zhu, who you may have heard has been promoted to the most senior Tesla employee after Elon. I saw this in this interview with someone from Tom's team (former employee).  \n\nBut we are not just talking PR here. We are talking advertisements, lawsuits and many other things that cost proper money - not a million a year.  \n\nFurthermore, when Elon bought Twitter it was not just about Tesla or just about Tesla's current problem. As we said, you can't be rich without having a strong way to apply political influence to both the population and it's leaders alike. Preferably a global way, definitely in your home country. Elon didn't have any.  Even more so if you aspire to improve the world.", "score": 1, "replies": []}]}]}, {"body": "PR probably not going to hurt, paid advertising, contrary to common belief Tesla is already selling every car they make, but I’m sure at some point.", "score": 1, "replies": []}]}]}]}, {"body": "- twitter is not a media outlet.  If it was, it would suddenly have to pre-review/edit all content posted there\n\n- Facebook and Google have not bought media outlets.  Bezos (not Amazon) has, and it wasn't necessarily an asset for \"controlling the narrative\" about Amazon warehouses, etc", "score": 3, "replies": [{"body": "It might not ONLY be a media outlet, but can you elaborate on why you don’t think it’s a media outlet at all?", "score": 2, "replies": []}, {"body": "Twitter is 100% a media outlet.", "score": 2, "replies": []}]}, {"body": "Your point would hold water if Elon Musk hadn't done this so ineptly. He clearly didn't want to buy Twitter. He clearly thought his lawyers would get him out of the deal, and didn't realize until it was too late that he was trapped. \n\nThen when he took over, he completely exposed himself as not nearly as smart as he had led us all to believe. Everyone that supported him before last year is now embarrassed by him. The people that support him now are people that don't even believe in global warming.\n\nThe reason you gain control of a media outlet is to get favorable media coverage. Elon destroyed his own reputation in the biggest unforced error of all time. Now no one trusts anything he says.", "score": 2, "replies": [{"body": "Agreed. Contrast this with Jeff Bezos's purchase of the Washington Post. Very little takeover drama or publicity of the event. The Post now quietly posts favorable stories every once in a while without being such a shill as to be exposed as a sham platform. It mostly continues to function as a legitimate news organization.", "score": 4, "replies": [{"body": "LOL … Legitimate news organization? \n\nHelp all of us by defining such concept!", "score": -3, "replies": [{"body": "Ok, now it's clear you're a troll.", "score": 4, "replies": [{"body": "Well, I am trying to make the point that \"legitimate news organization\" chased to exist when the money stopped coming from the readers.\n\nThe loyalty of every organization goes to the people paying their paycheck, like it or not and please provide some example of \"legit news orgs\" that produce negative press for major Advertisers just to fill up content.\n\nAnd who gives legitimacy to an organization? Come on, we cannot keep on taking the high ground, keep on repeating what we think is right and  do not accept or even question the fact that news orgs are just a political tool for the owners. \n\nFor the past 15 years there has been an armed race at controlling the narrative on social media, who can and cannot speak on it and what content can and cannot be distributed. \n\nWe can agree that we do not like what EM twits but not be so naive to not understand that without Twitter or a similar acquisition he would have been at serious disadvantage against the demagogues FROM BOTH SIDES of the legislative.\n\nDo you remember what happen at NASA budgets in the late '60 and '70? or what happen to the green movement in the '90?  or the Nuclear industry? They got attacked or hijacked by BOTH SIDES demagogues, pushing for their own interests.\n\nON the opposite spectrum, shall we talk about Disney and how, by controlling ABC and a large sector of the entertainment industry, basically had copyright laws made just for them and is immune of scrutiny from congress? I do not say that is a bad company or they have done anything bad, just that they are just so powerful that nobody really want to pick up a fight against them.", "score": 1, "replies": [{"body": "Whoa. That was actually not the troll response I expected. Yeah, you’re right. All news today is advertising, because people refuse to pay for legitimate news.", "score": 1, "replies": [{"body": "Unfortunately you are totally right. I thought a lot about this. I refuse to think that we should accept this sad status. I remember when I could watch the news without second guessing the intent…", "score": 1, "replies": []}]}]}]}]}]}, {"body": "He snookered himself with his big mouth and ego", "score": 1, "replies": []}]}, {"body": "If you want a controlled positive media presence buying a social platform & spouting crap about free speech whilst banning people isn't the way.", "score": 0, "replies": []}, {"body": "Huh?", "score": 1, "replies": []}]}]}, {"body": "Makes no sense. Twitter was fine to buy because there was no conflict in employee talent pool or rare minerals and resources.\n\nEVTOL essentially requires Tesla engineers mixed with SpaceX engineers. It would literally slow down both businesses and pull away key engineers while adding significant risk to both businesses.\n\nWhile EVTOL would be great and clearly it is something Elon would like to work on, it was never a viable alternative, no matter how much money was spent.", "score": 7, "replies": [{"body": "Elon also doesn’t like flying jets for personal use over cars in tunnels.", "score": 1, "replies": []}]}, {"body": "But it’s not something that you can throw money at. Tesla’s capital spend is relatively small. Money is not the problem, it’s finding the time and people to do this. Tesla are busy on new cars and robots but I’m sure they’ll turn their attention to boats and planes soon enough. In fact it seems from this article that they’re already thinking about it.", "score": 2, "replies": []}, {"body": "But would Elon have done it himself as a new venture, or as an offshoot to Tesla? As he seems to be doing now?\n\nI'm not expecting anything from this soon, with the possible exception of the Cyberquad.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Doubtful", "score": 1, "replies": []}]}, {"body": "We are not there yet.  Building the energy systems and battery technology IS developing the VTOL.  Tesla knows how to time things, this is definitely in thought but still 10-20 years away.  Tesla just acquired the rights for some lithium rich land to expedite the mining of the resource.  The right things are happening and underway.", "score": 1, "replies": []}, {"body": "Too early, because of energy density as you said, probably start the project in 10 years and deliver prototype in another 5 years. Tesla Bot will have a much larger impact in 10 to 15 years, better spend energy on that. But in the meantime no reason why Tesla can’t build and sell electric engines for basically anything, Tesla has the capability to make the best electric engines bar none, and with not that much energy spent. Twitter is not slowing down anything.", "score": 1, "replies": []}, {"body": ">Elon spend 44B \n\nThat's his personal wealth not Tesla's cash balance. Investors or the business have zero claim on Elon's money, or on how he spends it. Despite taking a lot of money off the Tesla table, he has more skin in the Tesla game than any founder/CEO of a large public company. \n\nTesla will have $24+B  cash balance after Q4, plus the ongoing FCF of many billions every quarter despite spending CAPEX as fast they can without being wasteful. Money is not why Tesla hasn't started more business ventures. It's about focusing and growing the resources on right priorities and business risks. \n\nElon is one of the greatest business resource allocators and high-stake decision maker that the world has ever seen. His track record of exponential growth with ruthless fiscal discipline speaks for itself. It also helps that he has been right on the most consequential bets and decisions in the long run. He and the rest of the Tesla leadership are well equipped with right kind of systems-thinking for identifying the right timing for tech convergence and viability of business-economics to justify spending resources (human + capital) on new projects.", "score": 1, "replies": []}, {"body": "I can't emphasize enough how much more I would have liked Elon spend 44B on developing an eco friendly weed strain rather than the bird app.", "score": 1, "replies": []}, {"body": "why should he spend his personal money on that", "score": 1, "replies": []}, {"body": "If Elon had sold $5B or $10B to pour into SpaceX no one would have cared. It wouldn't have surprised anyone.\n\nBut buying a money losing social media network was beyond dumb.", "score": 1, "replies": []}, {"body": "An aerospace division seems like a better fit at SpaceX. They can then borrow various engineers from Tesla as needed. Maybe it makes me a heretic, but I think SpaceX should get into defense. It's stagnant there as well with gluttonous cost overruns", "score": 1, "replies": []}, {"body": "I wouldn’t say innovation has stagnated. Their military ventures are best on the planet by far.", "score": 1, "replies": []}]}, {"body": "This actually makes sense. Their carbon wrapped Model S motors are absolutely insane. A single motor of that kind drives the entire Semi with a full load. Three model 2 motors handle all the control surfaces and grid fins on the Starship platform. Those motors can hit 20k RPM easily. Seriously insane tech.\n\nBear in mind that this paperwork doesn't imply they're going to make these vehicles too. Only that they'll make the motors for them.", "score": 10, "replies": [{"body": "> A single motor of that kind drives the entire Semi with a full load\n\nIsn't that three motors, but two can delink for efficiency when cruising?  \n \n>Three model 2 motors \n\nModel 3 I assume?", "score": 4, "replies": [{"body": "Three yes. 1 drives the truck, two and three are there for load balancing when the driver needs max torque all at once. As per the presentation.", "score": 1, "replies": []}]}]}, {"body": "Lol got trolled", "score": 2, "replies": []}, {"body": "How would an electric motor work for jet aircraft?..", "score": 2, "replies": [{"body": "It wouldn't for a ramjet, but a ducted fan is also a jet.\n\nEdit: not sure why either of us got downvoted. Your question was a fair one.", "score": 2, "replies": []}]}, {"body": "If there is a way to do an electric cargo ship that can travel between China and USA for cheaper than current gas powered ships then this is a serious money maker.", "score": 2, "replies": [{"body": "They can import their own cars this way too.", "score": 2, "replies": [{"body": "It will probably start with that, like the semi-trucks.", "score": 1, "replies": []}]}, {"body": "And make it autonomous!", "score": 1, "replies": []}]}, {"body": "I suspect they plan on just selling raw motors to other companies, so they will become a supplier essentially.", "score": 1, "replies": [{"body": "Jetliner engines are so important and expensive that they are sold separately from the fuselage that Boeing or Airbus sell. I don’t think Tesla will be in the big aircraft engine business anytime soon, but, my point is they could just be parts vendor, but thst can be quite substantial.", "score": 1, "replies": [{"body": "Tesla doesn’t do catalog engineering. I doubt they have interest in being a supplier.\n\nEdit: They’ll sell FSD to other OEMs. That’s pretty easy to sell.", "score": 1, "replies": []}]}]}, {"body": "Tesla VTOL will beat fsd to robotaxi… in 2035", "score": 0, "replies": [{"body": "If they add machine vision to to aircraft are they legally allowed to call it Autopilot? /s", "score": 3, "replies": [{"body": "There is already autopilot for aircraft and been around with that name for 50 or 60 years or more. No legal issues.", "score": 1, "replies": []}]}]}, {"body": "Yes! I’d buy a Tesla electric outboard in a heartbeat.", "score": 1, "replies": []}, {"body": "That must be because Elon has lost sight of innovation and core business, and has put the motor team to make motors for the robot.  \n\nWhen will we get a CEO that will take care of operations and other important stuff? I heard this guy Herbal Ditch or something is available?\n\n/a", "score": -3, "replies": []}, {"body": "\"BuT TeSlA OnLy MaKeS CaRs!\"", "score": 0, "replies": []}, {"body": "Sharing the obligatory [best explanation of electromagnetism](https://youtu.be/oWiYsRi2Dss) I’ve ever seen, aka how motors actually work.", "score": 0, "replies": []}, {"body": "VTOL is a weak kill streak soon as I see one out I switch to the raal mg with AP\nRounds and take it down before it gets a kill\n\nNice try elon", "score": 0, "replies": []}, {"body": "The timing of this is so petty. Tesla obviously feels the need to pad the stock price.   \nSame with holding a Investor day after a 70% fall in 2022 - incidentally the same period Elon sold 40 billion worth of stock.", "score": -6, "replies": [{"body": "Tesla is doing what they want and need to do, they should not even look at all the BS.", "score": 4, "replies": [{"body": "Yeah, gets kinda hard without a marketing dep. The BS never gets taken out.\n\nBut as you say, execution is key, annny day now :)", "score": 0, "replies": []}]}, {"body": "Said the user “yolo is the way”.", "score": 0, "replies": [{"body": "'Since 2016' - You should remember that Elon has been dangling that VTOL supersonic electric jet and HVAC products for quite some years now. The timing is dubiously petty - all i'm saying.\n\nMr HulkHunter :)", "score": 1, "replies": [{"body": "Filling legal epigraphs is not an announcement. The article comes from outsiders.  And yes, I’ve been around for six years now , enough to understand that everything around Tesla is always on perfect timing… to tank it.", "score": 0, "replies": []}]}]}]}, {"body": "Can't get their software to work, might as well focus on hardware manufacturing I guess so they can continue to fake it til they make it.", "score": -6, "replies": [{"body": "LoL!  Have you seen competitors’ software implementation?  I guess legacy could go back to using mechanical buttons.", "score": 2, "replies": [{"body": "Whataboutism. I don't own competitors cars, I own 2 Tesla's and it's getting embarrassing for them.", "score": 1, "replies": []}]}]}]}
