{"title": "Vix too low", "selftext": "So what's the plan? Wait for vix to go back up? I literally can't find stocks to sell puts on with the rally and dump in the vix.", "id": "10b454q", "created_utc": 1673640566.0, "score": 34, "upvote_ratio": 0.93, "num_comments": 85, "comments": [{"body": "Do nothing?", "score": 32, "replies": []}, {"body": "Maybe don't look at everything as options selling?", "score": 12, "replies": []}, {"body": "Buy leaps?", "score": 17, "replies": [{"body": "When VIX hits under 17, I buy me some leaps.", "score": 5, "replies": []}, {"body": "you'd buy leaps when vix is high. imo vix low and the market is up might mean a reversal is coming.\n\nputs.\n\nbut vix is one indicator. if vix was high say 30-45 i would buy leaps", "score": -23, "replies": [{"body": "Typically you would be a net seller of options when volatility is high (credit spreads and other net credit options) and be a buyer of of options (debit spreads and other net debit options) when volition is low. \n\nThe reason for this is that volatility tends to be mean reverting. In other words if you sell options with low volatility there is a good chance that volatility will rise making the options you sold more expensive (and therefore losing you money). \n\nIt may still work out ok because you will have theta working for you and maybe delta depending on the price relative to the strike. \n\nMy preference is to have both theta and Vega helping me out because I suck at predicting future stock prices.", "score": 15, "replies": []}, {"body": "Why'd you want to buy leaps when VIX is high? You'd then just pay more into extrinsic value then?", "score": 10, "replies": [{"body": "I think he's conflating two separate issues. The VIX being high, and being at a market bottom.  \n\nIf the VIX was only something like 25-30, it could just be one of the many temp bottoms on the way down; any short term recovery may not be enough. Buying a leap then exposes you both to the directional risk and the IV crush. \n\nWhat he is suggestioning only would make sense if you truly hit the bottom so well that a snap-back on the direction was a big enough move to offset the IV crush, and you could ride the LEAP out for a long bull run... particularly if you bought deep enough to mitigate some of the temporarily-elevated extrinsic.", "score": 2, "replies": []}]}, {"body": "Worst advice I've ever seen.", "score": 2, "replies": []}, {"body": "You guys know you can buy LEAP puts right?", "score": 2, "replies": []}, {"body": "A good way to lose money", "score": 1, "replies": []}]}]}, {"body": "Anything that can benefit from volatility expansion. Namely calendar, diagonal & debit spreads.", "score": 9, "replies": []}, {"body": "Calendar and Diagonal spreads are the way to go in low IV environments", "score": 14, "replies": [{"body": "Can you elaborate why calendar spreads are the way to go in such environment?", "score": 2, "replies": [{"body": "Short legs won’t gain as much in terms of vega/IV as the long leg. Additionally you’re short theta compared to buying a put or a straddle. Bare in mind you should be placing OTM calendars as your vega will increase the closer the stock gets to ATM so you’re gaining from not only the large move in the underlying but the “moneyness” of your option.", "score": 7, "replies": []}, {"body": "Time spreads are long volatility meaning they make money when vol expands. I’ll sometimes use double or triple calendars to hedge my SPX strangles.", "score": 4, "replies": []}]}]}, {"body": "CC on VIXY", "score": 7, "replies": [{"body": "I was thinking bull/put spread", "score": 3, "replies": [{"body": "Put spread can't make money. Because the market is pricing the VIXY can't go lower", "score": 2, "replies": [{"body": "Isn’t that the point of a bull spread?  Or maybe I’m missing what you are saying which is the options are too cheap?  In which case buy a call.  \n\nEdit: I just looked at the chain and see what you are saying.  Trade the VIX", "score": 2, "replies": []}]}]}]}, {"body": "Look for [high IVR stocks](https://i.imgur.com/Vq0rvdU.jpg).", "score": 5, "replies": [{"body": "Thanks this is good stuff. Where do you find these IVR rankings?", "score": 2, "replies": [{"body": "This is from the [Tastyworks platform](https://start.tastyworks.com/#/login?referralCode=RVN86QQ4GR). \n\nLooks like volafy and market chameleon show this as well.", "score": 2, "replies": []}]}]}, {"body": "I bought a couple puts 2 weeks out, 15% IV is too low to resist.  Can't wait for Wall Street to ask for rate cuts and not get them.", "score": 11, "replies": [{"body": "But you'll get destroyed if the pivot doesn't happen. Your 18P will be worth nothing Powell is like ... guys, I'm not gonna give up early. Eat 5% for YEARS", "score": 2, "replies": [{"body": "It probably won't stay at 5%, but the long term average isn't going back to .5% any time soon without another crisis.", "score": 1, "replies": [{"body": "But the market is pricing in interest rates backing off by the end of the year, and I think he's said he's not going to bring them down until inflation reaches like 2%", "score": 1, "replies": [{"body": "That's the problem, the market is still disobeying the Fed and they're getting annoyed.  They aren't going to back off this year unless something bad happens which will also cause a decline in equities.\n\nConsidering late 2018, I don't think the market can have a whole year of 4.5 - 5% without something breaking.", "score": 1, "replies": [{"body": "So long story short, you can't buy a VIX 18P in any month because who knows when everything will go south :)\n\nI have a 24 straddle I keep rolling until it's time to let it expire. If things don't fall apart, I earn a bit of premium. If things do, then I earn a lot of delta. And if things go north of 24 within 2-3 weeks, then I sell 30 or 35 calls.\n\nAlso have some VIXY CC that do the same thing, but I'm much more aggressive with it's strikes, since if it goes to like 15, I can just keep wheeling it down", "score": 1, "replies": [{"body": "Pretty much, I'm looking at VIX *calls* for the next few months.  Buying puts with it this low is a bad idea.", "score": 1, "replies": [{"body": "Ohhhhh. Our whole argument was because I thought you were buying VIX puts. But now I realize you meant you were buying SPY puts or something.\n\nI'm conflicted about VIX calls. They decay too fast and their chance of paying off is too low. Like right now, the Feb 24 call is $1. And you're not sure that we're gonna crash in Feb. If the real day we crash is 1-3 months in the future, and you keep buying 24C every month for $1, then you need 27 just to break even. I think selling a high put might be better because then you get to be short the vol, letting you earn the premium while still getting the positive VIX exposure\n\nAnd high puts is better than low puts because you don't need as many contracts. The VIX can be ruthless on the downside too. So you don't want to get caught shorting like 10 contracts of 18P when you could be shorting 2 contracts of 24P. That way you won't get creamed if it does print 17.5 or 17. And since it's not a stock, you can even buy it back at that price, unlike the VIXY. So that's why I'm willing to be much more aggressive with VIXY than VIX. Because if the bottom drops out on VIXY, I can still buy at the same price", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "We are sellers. Buying is a fools game.", "score": 2, "replies": [{"body": "Buy low, sell high.", "score": 3, "replies": []}]}]}, {"body": "Sold Amazon 80put today for 2/17 for 1.03 credit, is that not good enough? Planning to close it before earnings.", "score": 5, "replies": [{"body": "wont IV increase ahead of earnings limiting the potential to make anything on this trade?", "score": 5, "replies": [{"body": "Sold the 85 put for February 17 yesterday and I am up 35% today", "score": 1, "replies": []}, {"body": "I feel next big catalyst will be earnings which is still couple of weeks away and till then don’t think big movements will happen. Frankly if Amazon tanks I really don’t mind it holding at 80 for a while.", "score": 1, "replies": []}]}, {"body": "It goes up 10% in a week and ur selling puts??? Could u explain?", "score": 4, "replies": [{"body": "I had sold 70$ put last week same expiry and closed today for 90% profit today, so opened this trade. 52wk low is 81. Don’t see any big events before earnings, so took this risk.", "score": 2, "replies": []}]}, {"body": "What’s %", "score": 1, "replies": []}]}, {"body": "Low VIX is definitely tough for selling premium.  You can still do it but either have to risk selling closer to ITM or just accept the current conditions and play it safe selling further OTM.  Maybe a little of both", "score": 6, "replies": [{"body": "Agreed. \n\n\nJust depends too. It’s obviously not a high / low binary application of vix. So if it’s just too low / market too tight, then maybe skip if you don’t see anything good. Can’t lose if you don’t play.", "score": 2, "replies": []}]}, {"body": "When VIX is low you want to do poor man's covered calls.", "score": 4, "replies": [{"body": "that's a good point.  pmcc is a diagonal as others have suggested.", "score": 1, "replies": []}]}, {"body": "So now normal vix is too low", "score": 5, "replies": [{"body": "What I was thinking.", "score": 1, "replies": []}]}, {"body": "Like Tom says, \"just do the other side!\"", "score": 3, "replies": []}, {"body": "Vix is a lie.", "score": 3, "replies": []}, {"body": "Why not selling puts on value stocks for now while waiting for the other stocks to pull back?", "score": 2, "replies": []}, {"body": "Sell puts on boil…live dangerously", "score": 2, "replies": [{"body": "Haha 😂 need some of the new boil owners to post some loss porn please-", "score": 1, "replies": [{"body": "I’m sure I’ll be there soon enough haha.", "score": 1, "replies": []}]}]}, {"body": "Seriously? You really can't find a play other than CSP?\n\nTry researching what you can do in low-volatility environments today. There's a good one you should do in low volatility that is net theta positive", "score": 5, "replies": [{"body": "I hate PMCC", "score": 1, "replies": [{"body": "Brother that is my fav. Especially now when prices and volatility are low? You know your boy has been stackin them", "score": 3, "replies": [{"body": "My hatred comes from a lack of understanding.  I’ve never traded one.  It seems like a neutral to slightly bullish strategy and I sell 42 DTEs condors when I’m feeling that way or a bull broken butterfly OTM. \n\nIm paper trading an AAPL PMCC and getting slaughtered but was just one trade and probably didn’t go far enough out on the long call.\n\nEdits(i keep coming up with more questions)\nCan you give and example?  I’m savy, just give me an open trade order from the past and I’ll do the rest.\n\nWhat happens when the market drops and you’re selling calls below or close to your original long strike?  Does it turn into a debit calendar spread?\n\nIf your stacking the ched why aren’t you just buying the underlying?", "score": 1, "replies": [{"body": "I actually don't trade PMCCs like I would with ICs. I trade them as if I was buying shares and selling CCs on them. So I won't open a PMCC spread and close it weeks later. It is a long term play on companies I want to own long term. And I actually typically open my first shorts as a calendar, not diagonal.\n\nWhy don't I just own the shares? Leverage on the long and a higher ROI on the shorts. This is where I'm most comfortable at with my risk tolerance.\n\nBut what about risk on the long? That's why I stick to leaps which are at less risk to short term volatility. Longest DTE possible, but may buy 2nd longest depending on liquidity. Hedge the account with other assets. Not a good idea to do PMCC with anything other than leaps. Some argue that they should be ITM. I disagree. Be patient with buying leaps and don't let the MMs make too much on the liquidity premium.\n\n>Can you give and example?\n\nSure. In December I bought RKLB 5c leaps both dated to 24 and 25 after it's fall from above $5 for an avg price of about 1.7. I sold Jan 5c in December shortly before the dip at an avg price of .17. During the dip (which I was down overall) I bought more leaps at the 5c using the short income and reduced my cost basis. Just this past week I closed those shorts as I saw the rally happening for about 0.03. So within a span of about a month I made 0.14 from a 1.7 investment, nearly 8% ROI in 1 month. I pretty much rolled that into shorting feb 5cs for an average of .22, well above my 10% ROI/month goal!\n\nRight now those shorts are down over 100% since I sold them (mark at 0.525), but I keep an eye on the greeks and made sure delta is positive so I am still overall positive despite my shorts being underwater. However, it's in the danger zone and I am heavily exposed to negative gamma and may need some action to take so that this trade doesn't go sour. But I love PMCCs, because there are so many ways to manage your position because you have soooo much time between the long and short. So despite me being in the danger zone, I'm not worried because time is on my side and I have a few ideas of how to manage this. The long term plan is to open diagonal spreads as the underlying increases.\n\n>What happens when the market drops and you’re selling calls below or close to your original long strike? Does it turn into a debit calendar spread?\n\nEven though I open with calendar spreads, there's a few things you can do if the underlying goes down below your ability open shorts. Buy more leaps at a lower strike, have a calendar/diagonal put spread making a disfigured form of an IC to hedge, or roll your leap calls down to a lower strike. Yeah you'll lose on the roll, but that'll mostly appreciate back if the underlying revives and it's better to make income with shorts while you wait instead of just sitting on decaying leaps. But I would save the roll down unless you think the stock will stay down. Time is on your side with this trade. Honestly, I could keep this trade going for decades with rolling and I will make money as long as time goes by (I'm theta positive) and the underlying doesn't deviate too far against my overall exposure, which I can easily change depending on my outlook.\n\nA big goal for a PMCC is to sell enough shorts over time to cover your initial leap cost. It is *doable* with proper management and the right amount of luck. See my above ROI.\n\nIf you are interested in how I will manage my trade as it's in the danger zone rn, feel free to pm me to see what I'll do in the coming month.\n\nMind you, my strategy is much more risky than what theta gang would typically approve of. The general consensus here seems to be long ITM leap with a delta of 0.7 and short 45 DTE with a delta of no more than 0.3 and best at 0.2. Much less risky, but much less profitable. But really, it's a long term hold with leverage and income generation. How could anyone hate that?", "score": 2, "replies": [{"body": "Thanks for the comprehensive response.  Much appreciated.  I just don’t have the nuts to buy a LEAP on anything right now.  I’m just grinding away on SPY ICs and all kinds of credit spreads.  Just can’t get my head around buying a LEAP and then selling calls against it.  If I buy I leap Im wanting it to go up aggressively.", "score": 2, "replies": [{"body": ">If I buy I leap Im wanting it to go up aggressively\n\nYeah, I think that's where your disconnect is, unfortunately. I look at leaps as dynamically leveraged shares. Very little theta decay. I honestly see positions only as exposure and try to maintain a certain exposure depending on my outlook. That's why I sold those calls on my example. It had a solid \\~40% run-up. I look at it the same way as if I sold shares that I bought earlier. It's nearly the same thing. Nearly. Reduce exposure and take profits.", "score": 1, "replies": [{"body": "That’s were my disconnect with PMCC is 100%.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Buy calls on VIX?", "score": 2, "replies": [{"body": "Sell puts on VIX ;)", "score": 3, "replies": []}]}, {"body": "Know when to hold ‘em, know when to fold ‘em.\n\nHappy dogs don’t chase parked cars.", "score": 1, "replies": []}, {"body": "Amc have fat premium", "score": 0, "replies": []}, {"body": "BBBY has IV over 300% - so stop complaining :)", "score": 0, "replies": []}, {"body": "I’m selling plenty of call ratio spreads.", "score": 1, "replies": []}, {"body": "That is a good thing because last 12 months when the vix drops the market peaks then tanks which is a bad time to sell puts \n\nI might actually buy some mid feb 370 spy puts", "score": 1, "replies": [{"body": "Buy or sell?", "score": 2, "replies": [{"body": "Buy spy puts or sell sqqq puts", "score": 1, "replies": []}]}]}, {"body": "Condors", "score": 1, "replies": []}, {"body": "Just wait or go long on stocks or spy or you can lower the premium collection on the puts , you don’t win every day", "score": 1, "replies": []}, {"body": "Yeah it is so low. I think earnings next week will hopefully bring a little change. I'm just going to stay cash or buy long dated puts/long dated volatility calls.", "score": 1, "replies": []}, {"body": "0DTE SPX IC's.", "score": 1, "replies": [{"body": "Also not as good when vix lower.", "score": 1, "replies": []}]}, {"body": "Find  stock you like, or just be patient.", "score": 1, "replies": []}, {"body": "Earnings trades.", "score": 1, "replies": []}, {"body": "Calendars, TQQQ put diagonal, Close some long positions, open some short positions, buy more gold stocks. Easy money", "score": 1, "replies": [{"body": "Close some Puts and sling some SPY condors.", "score": 1, "replies": []}]}, {"body": "Increase the DTE of short strangles. It's either vol or DTE. I do /ES strangles. And I will add SPX calendars in low vol as well.", "score": 1, "replies": []}, {"body": "vix too low? buy calls?", "score": 1, "replies": []}, {"body": "Sell calls on spy and buy UVXY puts", "score": 1, "replies": []}, {"body": "LTHM puts are pretty sweet right now", "score": 1, "replies": []}, {"body": "I want to start a campaign in the finance industry to rename the VIX to OPI, Options Premium Index.  I have seen  calm markets with relatively high VIX and crazy markets with low VIX.  Supply and demand is what determines options premium prices and the ViX only reflects that supply and demand. It does necessary mean the market is volatile.\n\nBut honestly, the industry likes confusing terms because they make the so called experts look smarter.", "score": 1, "replies": []}, {"body": "Just a tiny few of my favorite stocks had high enough IV this week to sell some premium. I sold just one delta 30 put in INTC yesterday. I do have quite a few long puts on SPY and a few others to hedge short put positions.\n\nLastly, I am buying a few VIX calls every few days. \n\nBored bored bored", "score": 1, "replies": []}, {"body": "Strangle and straddles. I'm expecting rising IV and bigger price movements next couple of weeks.", "score": 1, "replies": []}]}
{"title": "Massive TSLA losses, and this is before market open so with calls I’m probably down $50kis at market open", "selftext": "", "id": "10av54v", "created_utc": 1673618185.0, "score": 173, "upvote_ratio": 0.82, "num_comments": 84, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|8 months ago\n**Total Comments**|45|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Should have bought puts like me two weeks ago.   Ive already been down 50k fucker. 😁", "score": 52, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "The ones that keep printing money are 😁", "score": 4, "replies": []}]}, {"body": "Look at all the BBY ones from yesterday. They will be baggies.", "score": 3, "replies": []}]}, {"body": "How is this a loss when you’re up $17,766? People of WSB really be regarded as fuck.", "score": 29, "replies": [{"body": "His last post was a flex also.", "score": 15, "replies": [{"body": "I know, flexing his half mil 😂😂", "score": 8, "replies": [{"body": "https://preview.redd.it/h7x3hq926xba1.jpeg?width=1284&format=pjpg&auto=webp&s=c02aa35c4330c00859540acb59371a5be43c7e0d", "score": -8, "replies": [{"body": "You know u can calculate account value w the percentage right", "score": 13, "replies": [{"body": "‘twas but a flex", "score": 2, "replies": []}]}, {"body": "Almost lost a Model 3.", "score": 3, "replies": []}, {"body": "$2 mill, that it?", "score": 2, "replies": [{"body": "it's actually $2,975,054.83. check your privilege and thank you very much. \n\n&#x200B;\n\n![img](emote|t5_2th52|4640)", "score": 5, "replies": [{"body": "You don’t do maths, eh?", "score": 3, "replies": [{"body": "no, I'm on /r/wallstreetbets because I can't do math \n\n&#x200B;\n\nam I not on the right subreddit?", "score": 4, "replies": []}]}]}]}]}, {"body": "Twas but a flesh wound", "score": -6, "replies": []}]}]}]}, {"body": "This is the loss porn I come for! ![img](emote|t5_2th52|4271)", "score": 11, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I wish LMAO", "score": 9, "replies": [{"body": "It's only down 2 bucks", "score": 1, "replies": []}]}]}, {"body": "\"Massive\" loss yet still up 24k.  Ok bud", "score": 7, "replies": []}, {"body": "Anytime you take a screenshot to post you sell. \n\nLook at all the BBY ones from yesterday. They will be baggies.", "score": 13, "replies": []}, {"body": "Probably gonna buy $30k in puts expiring today to bring my loss to break even", "score": 11, "replies": [{"body": "Oh yeah, that's the kind of regard acting that makes this sub so great.", "score": 63, "replies": []}, {"body": "if only it was that easy", "score": 6, "replies": []}, {"body": "Nah dude just take the L and make another play next week.", "score": 4, "replies": [{"body": "Im here to surf the vol dudeee", "score": 1, "replies": []}]}, {"body": "This is the way!", "score": 1, "replies": []}, {"body": "Sounds like a great idea!\n\n-No one ever", "score": 0, "replies": []}, {"body": "Please post screenshots", "score": 1, "replies": []}]}, {"body": "Aren't you the one who posted the other day about what you should do while you were up, flxing your 500k position? You didn't listen?", "score": 3, "replies": []}, {"body": "Bro this is not massive. There’s people looking 80%+ here. Youll be fine!", "score": 2, "replies": []}, {"body": "Are you the same guy that was up like 46k yesterday?", "score": 2, "replies": []}, {"body": "No point in blocking out the balance if you show us that 30k is 1.39% of your account 😅", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "Buy BBBY and hold, try to make your money back", "score": 2, "replies": []}, {"body": "Why not get more responsible with that kind of money?  What this is is gambling, pure and simple.  Win a lot or lose it all.  Get a financial planner and get off Reddit for Gods sake", "score": 2, "replies": []}, {"body": "Definitely an overreaction from the market. This will drive demand through the roof and their margins were already really good to where they can afford this. Would not be surprised at all to see green EOD.", "score": 1, "replies": []}, {"body": "Question, why can I only post pictures with the NSFW tag on there?", "score": 1, "replies": []}, {"body": "https://preview.redd.it/e15zfji13vba1.png?width=1284&format=png&auto=webp&s=ddeff1ceab506d381cb06b0c9c45422c7a250115\n\nThis makes me optimistic kinda", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "The expected fall in commodity prices this year, plus the better margins in their new facilities should help offset the price cut somewhat. The price cut was pretty expected, they had to get the model y below the msrp cap for the tax credit. It's now by far the cheapest EV suv for the range.", "score": 4, "replies": []}]}]}, {"body": "It’ll be fine. The market is realizing the price cuts will prob lead to more sales and TSLA will be slightly up or flat by end of day.", "score": 0, "replies": [{"body": "Lol its been doing that same pattern q day.", "score": 1, "replies": [{"body": "Pattern schmatern", "score": 1, "replies": []}]}]}, {"body": "Will it be red or green eod for TSLA", "score": 0, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "I do not trade for the purpose of making a profit. I trade to increase my net worth.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": -4, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Highly regarded. ![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "On what platform (broker) is this?", "score": 1, "replies": [{"body": "Think or Swim", "score": 2, "replies": [{"body": "Thanks man", "score": 2, "replies": []}]}]}, {"body": "just curios what broker is this?", "score": 1, "replies": [{"body": "Think or Swim", "score": 0, "replies": []}]}, {"body": "Should’ve put it in $CVNA 🤓", "score": 1, "replies": []}, {"body": "Even your battery is bailing out ![img](emote|t5_2th52|4640)", "score": 1, "replies": []}, {"body": "I’ve never seen a lick above 10k in my life, you live in a fantasy! I can’t even imagine having so much left after losing so much ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "On the other hand my PUTS are growing like weeds", "score": 1, "replies": []}, {"body": "Take puts next time!", "score": 1, "replies": []}, {"body": "Good.  You deserve to lose.  Fucking dumbass.", "score": 1, "replies": []}, {"body": "Max pain did a pretty good job of predicting the price movement in TSLA this week. \n\n[https://maximum-pain.com/options/tsla](https://maximum-pain.com/options/tsla)", "score": 1, "replies": []}, {"body": "You guys made money once and now this is just a sad thing where everyone goes broke", "score": 1, "replies": []}, {"body": "so far....", "score": 1, "replies": []}, {"body": "How is it doing now", "score": 1, "replies": []}, {"body": "Lets get regarded in ha lets get regarded in here", "score": 1, "replies": []}, {"body": "Don’t play short term options. Way to volatile", "score": 1, "replies": [{"body": "I’ve probably made around $2m in short term options", "score": 1, "replies": [{"body": "That’s amazing way to go.  Sounds like you should keep up what your doing. I would say your results are vastly different then most people trading short term options.", "score": 1, "replies": []}]}]}, {"body": "Tesla keeps coming back lol, so fun to watch on the side.", "score": 1, "replies": [{"body": "https://preview.redd.it/t129nwyl6xba1.png?width=1283&format=png&auto=webp&s=cd91de82ed7f058a2cfb3324e753a6131b62f6ad\n\nMade some on the bounces", "score": 1, "replies": []}]}, {"body": "not bad considering your liquid youl get it back hold your head look for a solid runner EV's running besides TSLA+ bio's moving youl be good TSLA is a tricky 1 imo unless your goin long from these levels 💯", "score": 1, "replies": [{"body": "I do believe TSLA will go lower, it’s almost inevitable, but any day now Elon is going to appoint a ceo to Twitter and this is gonna up at least 10%", "score": 1, "replies": []}]}, {"body": "The stock Fonu.  Is a buy", "score": 1, "replies": []}, {"body": "The old saying goes, \"If it's good enough for a screenshot, it's time to sell.\"", "score": 1, "replies": []}, {"body": "sucks to be you.....\n\ncharge your phone\n\n&#x200B;\n\nHODLing 3 shares\n\n![img](emote|t5_2th52|4263)", "score": 1, "replies": []}, {"body": "What a clown.", "score": 1, "replies": []}, {"body": "Sell calls all the way down, or get out and find something else to trade", "score": 1, "replies": []}, {"body": "Hope you held it, closed at $122 by end of day.", "score": 1, "replies": []}, {"body": "When will it turn?", "score": 1, "replies": []}]}
