{"title": "The unemployment rate recorded at 3.6% in March, below market expectations. How do you think these data will affect the stock market?", "selftext": "[removed]", "id": "tuavev", "created_utc": 1648875330.0, "score": 9, "upvote_ratio": 0.78, "num_comments": 8, "comments": [{"body": "No excuse for the fed. More aggressive rate hikes.", "score": 10, "replies": [{"body": "Hopefully not too aggressive until after the midterms to help us in the election.", "score": -6, "replies": []}]}, {"body": "Rates are going to increase, probably somewhat aggressively. For the past two years The Fed has been explicitly stating that lower unemployment is more important than fighting inflation - thus 0% Interest Rates and Negative Real Rates. The Labor Market is strong meaning The Fed can focus on reducing inflation - which is now their primary concern.\n\nThe issue is whether The Fed can increase interest rates to neutral without damaging the labor market. Which... no one knows. The Fed says they can, but they also said Transitory Inflation for two years...\n\nHow will it influence the market? I mean, the market knows interest rates are going to increase, the big question is how much and how quickly?\n\nI personally wouldn't be in zero revenue growth companies. Look for companies with low debt and solid balance sheets. Companies that have been binging on cheap credit for expansion are going to hit a serious wall. \n\nI'd expect companies like NKLA to collapse as rates rise and companies with leveraged expansion and risky balance sheets with large liabilities to become distressed. I'd expect a down rating of various corporate bonds as rates rise.\n\nBasically.... Solid companies with good balance sheets are good. It'll be a fairly generic 'Risk-Off' environment with raising rates. Doesn't mean you shouldn't invest in growth - but you need to be a lot more careful with regard to balance sheets.", "score": 8, "replies": []}, {"body": "It won't, because it's obviously fake.\n\nYour strategy hinges on how long you expect the market to play along until faith in our institutions is fully eroded.\n\nPersonally I think we are nearing the end of that faith, and so I'm heavy on oil and natgas. I'll probably get beat up for a few more weeks, but the government is so scared that they are *already* tapping our reserves in a panicked effort to quell the rising price of energy. A mistake that will make things worse. It is only a matter of time before the market rushes into commodities.", "score": 6, "replies": [{"body": "Bingo.", "score": 3, "replies": []}]}, {"body": "Seems negative. We have a large labor shortage and low unemployment means there are few people for companies to tap.\n\nCompanies are going to need to contract and thus earn less revenue.", "score": 2, "replies": []}, {"body": "Yeah giving 0% probabilities is just plain old unrealistic. We have no idea what the next 6 months to a year will hold", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "tug3hg", "created_utc": 1648896527.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 12, "comments": [{"body": "OP is being disingenuous. He was painting a much different picture a month ago implying that Tesla 'fanboys' are lying about Tesla's delivery period in European countries. He was told that Tesla ships their vehicles in batches for logistical reasons but insisted it may not be true. Just click on his profile and check his posts. People who corrected him were being called fanboys.\n\nHis previous post:\n\n[https://www.reddit.com/r/stocks/comments/t5tnzx/made\\_a\\_post\\_earlier\\_of\\_tesla\\_sales\\_in\\_norway/](https://www.reddit.com/r/stocks/comments/t5tnzx/made_a_post_earlier_of_tesla_sales_in_norway/)\n\nHere are 2022 EV sales by brand:\n\n[https://i.redd.it/9k7gm7pxqkq81.jpeg](https://i.redd.it/9k7gm7pxqkq81.jpeg)\n\nIn his previous post, he said Tesla couldn't even crack top 20 for February somehow implying that Tesla's demand is not high.\n\nOP keeps using the phrase, 'as expected.' Uhhh, no, you didn't 'expect' this. You didn't expect Tesla to lead Norway in EV sales by double the next auto brand for year 2022 despite having no European manufacturing plant until their Berlin factory opened last week.\n\nNow you're saying the competition is 'eating' away at Tesla's growth and that it is expected but Tesla is going to sell more than 18k cars in Norway due to their Berlin factory opening. They delivered 180k EV's in Q1 last year. They just sold 310k EV's Q1 of 2022. 2020 Q1, they delivered 88.4k EV's... So in two years, they tripled the amount of EV deliveries. Norway is projected to do around 30k Tesla EV sales by the end of this year.", "score": 5, "replies": []}, {"body": "But I thought Tesla was doomed because other car companies are ramping up production?", "score": 12, "replies": [{"body": "VW has nothing to ramp up anymore. They're missing the parts for them left and right.", "score": 4, "replies": []}, {"body": "I don't think anyone is saying tesla is doomed. The company will probably do just fine, the stock is what we are here to discuss. They are still very popular, but their stock will some day probably get hurt as they won't be able to grow at the same rates as before.", "score": 3, "replies": [{"body": "The question is when do they stop growing?  20 mil by 2030 is their plan. They are already very profitable selling 1 mill cars and executing every quarter. The stock is expensive but you can justify why people are excited.", "score": 5, "replies": []}]}, {"body": "Toyota sells in a month what Tesla sells in a year. yet by market cap Tesla is more valuable. \n\nTesla is not doomed, but they're not gonna be anywhere near as dominant or powerful as the Tesla cult likes to imagine. the valuation is bonkers.", "score": -4, "replies": [{"body": "Now compare EV's....", "score": 10, "replies": []}, {"body": "Wtf is this kind of argument in this sub? TSLA is an EV company not ICE. Toyota doesn’t even compete in EV yet. Further, as TSLA sells more EVs, they are taking away market share from ICE companies. Toyota will resort to cannibalizing their ICE shares and lose shares to new EV companies.", "score": 9, "replies": []}]}]}, {"body": "expect tesla sales to increase in norway.", "score": 3, "replies": [{"body": "Yeah definitely. When i take the buss i count teslas on the road. Its a lot", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Exactly... Seems like a hit piece on Tesla. Anyone who knew Tesla's operations in Europe knew it was delivered based on batches. Now OP is saying the competition is 'still' increasing when his sentiments were, a month ago, that Tesla can't even be a top 15 seller of EV's in Norway. Tesla completely destroyed the competition in Norway.\n\n[https://i.redd.it/9k7gm7pxqkq81.jpeg](https://i.redd.it/9k7gm7pxqkq81.jpeg)\n\nNearly double the EV sales of the closest competitor, Audi, for year 2022. Mind you, this is with ZERO auto manufacturing plants in Europe. As Berlin ramps up, this will solidify Tesla's position. OP can't seem to admit that Tesla is much stronger than he initially believed. Model Y also seems to be increasingly popular in Norway. Higher margins on those Y vehicles.", "score": 2, "replies": []}]}, {"body": "They’re on pace to greatly surpass 18k Norway deliveries in 2022. Not sure how you could come to any other conclusion. They’ve already sold more than 5k in Q1 and this will be their lowest production quarter of the year. \n\nAlso on pace to grow their Norway market share in 2022 which shouldn’t come as any surprise", "score": 1, "replies": []}]}
{"title": "Unionized Amazon Warehouses could be a win for the Company. Contracts define worker requirements also", "selftext": "[deleted]", "id": "tulwg7", "created_utc": 1648914535.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 14, "comments": [{"body": "next year's headline: \n\n>Amazon union boss arrested for embezzlement\n\n....\n\n>Good employees will be compensated properly and stay. Bad ones will leave. \n\na union will typically *prevent* bad workers from getting booted. \n\nunions tend to favor group raises, not individual compensation for superior performance.", "score": 10, "replies": [{"body": "I work in Vegas, where the culinary union rules. There's no such thing as an individual raise. It's literally not allowed. Everybody of the same position must get paid the same.", "score": 5, "replies": []}, {"body": "Exactly.  Beat me to it.", "score": 4, "replies": []}]}, {"body": "Unions are not good for company profits. I work with clients with unions… everything is more painful as it has to be bargained… this means additional cost to the employer.", "score": 2, "replies": []}, {"body": "Unions do not force bad employees out, they create a safe environment for them to languish unhindered, protected by civil law.", "score": 4, "replies": [{"body": "They also bring reasonable work conditions.... maybe there will be less drivers pissing in bottles and shitting in bags, less random firings that amazon is famous for, less wage theft due to security screenings. ect ect.... There is a reason for the high turn over at amazon and its intentional.", "score": -1, "replies": [{"body": "The turnover is high because it's a shitty job and they expect you to work and they higher a significant amount of people who care not to.", "score": 1, "replies": [{"body": "maybe it wouldn't be so shitty if they had a union...", "score": 2, "replies": [{"body": "No.  It would be just as shitty but they would get paid more.", "score": 0, "replies": [{"body": "Paid more, makes it a less shitty environment to work... I know it seems silly to not be purchasing moon real estate to park bezos yacht on. But maybe the laborers can have a couple more crumbs of cheese.\n\nBut also it's kind of dumb to think that labor practices wouldn't change either.", "score": 1, "replies": [{"body": "Free will.  If they don't like it, don't work there.  Go get a better job.", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lots of assumptions there. 🥸", "score": 0, "replies": []}]}, {"body": "Yup, the free will to form a union.... why do corporations need to infringe on it?", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Unions are good for workers, great for bad workers and bad for companies.  It sounds like you don't have a lot of experience with unions.", "score": 2, "replies": []}]}
{"title": "European Inflation Soars to Record 7.5% in March", "selftext": "*Source:* [*https://uk.news.yahoo.com/charting-global-economy-european-inflation-090000565.html*](https://uk.news.yahoo.com/charting-global-economy-european-inflation-090000565.html)\n\nEuro-zone inflation surged to a record 7.5% in March from a year ago as Russia’s war in Ukraine further boosted already soaring energy costs.\n\nWhile that’ll cost consumers about 230 billion euros ($254 billion) this year, household savings should help cushion the blow. In the U.S., the Federal Reserve’s preferred inflation gauge rose to a fresh four-decade high, and China’s Covid lockdowns threaten to disrupt supply chains and push up prices even more.\n\nHere are some of the charts that appeared on Bloomberg this week on the latest developments in the global economy:\n\n**Europe**\n\nEuro-zone inflation accelerated to a fresh record high as Russia’s invasion of Ukraine roiled global supply chains and provided a fresh driver for already-soaring energy costs. Combined with inflation overshoots this week from Spain and Germany, the data prompted investors to bring forward bets on when the European Central Bank will end almost eight years of negative interest rates.\n\nThe energy crisis gripping the euro area will inflict an extra bill on consumers equivalent to 1.8% of its gross domestic product, according to analysis by Bloomberg Economics. Increased heating and electricity costs, along with higher prices of fuel for motorists, will combine to add 230 billion euros ($255 billion) to households’ expenses, Jamie Rush and Maeva Cousin estimate.\n\nU.K. households saved less of their income in the final quarter of last year to maintain living standards in an early sign of the pressures they face from runaway inflation.\n\n**U.S.**\n\nThe U.S. added close to half a million jobs in March and the unemployment rate fell by more than expected, highlighting a robust labor market that’s likely to support aggressive Fed tightening in the coming months.\n\nInflation-adjusted consumer spending declined in February, suggesting the fastest pace of price increases in four decades is starting to temper demand. Spending on goods settled back after the prior month’s surge, while a decline in Covid-19 cases supported a pickup in outlays for services.\n\nU.S. business profits surged 35% last year, the most since 1950, driven by strong household demand as the economy bounced back from the pandemic. In all four quarters of the year, the overall profit margin stayed above 13%, a level reached in just one other three-month period during the past 70 years, Commerce Department data show.\n\n**Asia**\n\nChina’s Covid lockdowns are putting the economy under strain and threatening to disrupt global supply chains, prompting Beijing to call for more contingency plans to deal with the risks. Purchasing managers’ indexes for March showed lockdowns in the technology and trade center Shenzhen and automotive city Changchun cut factory activity in the month. Services have also been hit hard.\n\nJapan’s factory output in February eked out the first gain in three months, offering only a tepid sign of resilience amid fears the economy has slipped back into reverse. The fractional gain comes at a time when the Japanese economy needs strong manufacturing to help the economy avoid a contraction this quarter and to power a recovery going ahead.\n\n**Emerging Markets**\n\nColombia surprised markets with a smaller-than-expected interest rate increase after the central bank was criticized by senior politicians. Analysts had expected a bigger boost given recent inflation shocks and an economy that is now operating close to full capacity. Central banks in Chile, Czech Republic and Mozambique were among those that also hiked rates.\n\nAn exodus of foreign workers from Saudi Arabia started to reverse after a year and a half as the economy recovers from the pandemic and oil prices rally. Job creation is the biggest challenge facing Crown Prince Mohammed bin Salman, the kingdom’s de facto leader, as he reshapes an economy dependent on exporting oil and importing foreign labor.\n\n**World**\n\nGovernments are not sufficiently aware of the longer-lasting economic fallout from Russia’s invasion of Ukraine, says Laurence Boone, OECD’s chief economist. Earlier this month, the Paris-based OECD estimated that the conflict’s effects will reduce global growth this year by more than 1 percentage point and drive up inflation another 2.5 percentage points from already-high levels.", "id": "tup35r", "created_utc": 1648922586.0, "score": 77, "upvote_ratio": 0.95, "num_comments": 16, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Gas and oil has more impact in Europe than US.", "score": 9, "replies": []}, {"body": "12% in the Netherlands :(", "score": 4, "replies": [{"body": "Het is fucking leip. Ik doe mn verwarming niet meer aan", "score": 3, "replies": []}]}, {"body": "\"Household savings should help cushion the blow\" Excuse me, what.", "score": 3, "replies": []}, {"body": "Must be Biden", "score": 17, "replies": [{"body": "US, EU, Canada all printed money like there was no tomorrow. Now neither is at fault because inflation happened somewhere else too?", "score": 23, "replies": [{"body": "Biden said it's not because of monetary policies, it's all Putin invasion's fault. Sure western politicians love Putin as he gives them a good excuse for their own demagogy :-D", "score": 12, "replies": [{"body": "Day by day, Biden starts to sound like Erdogan when it comes to monetary policy.", "score": 2, "replies": []}]}, {"body": "It wasn’t just Biden. The former guy twice impeached one term loser is just as responsible. Supply chain is largely the reason and Russian sanctions exacerbated the problems.", "score": 0, "replies": []}, {"body": "EU inflation has nothing to do with montary policy and everything with gas prices rising 600% YOY because of a failed transition policy. Source i live in the EU and face the consequences.", "score": 1, "replies": []}, {"body": "what would have the post-covid economy looked like without that printing though? It could have been a recession", "score": 1, "replies": []}]}]}, {"body": "Maybe inflation is up 7.5% but cost of living is like 15-20% up.", "score": 4, "replies": []}, {"body": "Fucking bidan", "score": 2, "replies": []}, {"body": "I live in Europe, and I've counted till 7.3% , fake news", "score": -4, "replies": []}]}
{"title": "Using VIX standard deviation to swing trade", "selftext": "Ok, listened to the compound podcast- heard something about VIX having a mean of 20 and a standard deviation (sigma) of 8. Guy also mentions that 20 and 36 are inflection points. I compared VIX and SPY on a chart and found this to be generally true- 36 VIX is typically a good time to buy a dip and 20 VIX can be a good time to sell if you had previously bought at 36. If you had bought at at VIX lower than 20, then 20 is a good time to sell. Obviously there will be exceptions, and VIX has gone much higher during 2008 and 2020 crashes, up to 60 and higher. EDIT: a 2 sigma move represents a 95% statistical probability. So hypothetically this method represents a 95% chance of working, with 5% risk, not including paying the premiums on the options. \n\nIt appears to me that because wall street may use these metrics of the VIX as a trading signal that the charts end up reflecting large trading activity by investment banks and institutions. You also wouldn't want to speculate on individual stocks using VIX- more like using VIX as a signal to trade options on SPY.\n\nIt would theoretically look like this:\n\n1. VIX hits 36. Buy slightly OTM calls 3-6 months+ to exp.\n2. VIX approaches 20. Sell calls. Buy puts with stop loss. Same with slightly OTM, 3-6 months+\n3. Sell puts when VIX spikes, buy calls again. Repeat as desired.\n\nCurrently VIX is at 19.62, just below 20. We appear to be at an inflection point where either the bull market is going to recover or we are headed for another leg down as rate hike fears, supply chain problems, and inflation hurt corporate earnings.", "id": "tusnmp", "created_utc": 1648931995.0, "score": 22, "upvote_ratio": 0.93, "num_comments": 17, "comments": [{"body": "2 standard deviations is 95%.", "score": 10, "replies": [{"body": "Updooted", "score": 0, "replies": []}]}, {"body": "Sry. What?\n\nVol high -sell options\nAnd reverse. \n You seem to be suggesting opposite", "score": 7, "replies": [{"body": "Well you mean sell calls when VIX spikes?", "score": 1, "replies": [{"body": "Sell call or sell puts. Both are inflated because of high volatility ( which is what VIX measures )", "score": 6, "replies": [{"body": "I wouldn’t sell calls.  Volatility skew will favor the SPX puts when VIX is high, plus there is a greater chance for a move higher which will threaten those calls.", "score": 2, "replies": []}, {"body": "So you’d be profiting off of IV crush on that trade", "score": 1, "replies": [{"body": "Sure but theta as well depending on DTE.", "score": 6, "replies": []}]}]}]}]}, {"body": "Possibly works until it doesn’t.\n\nhttps://assets.bwbx.io/documents/users/iqjWHBFdfxIU/r8LCxXQ4CfqU/v0", "score": 7, "replies": [{"body": "Haha I have no intention of manipulating the VIX. And yeah, stop losses would help prevent excessive loss if it goes the wrong way.", "score": 1, "replies": [{"body": "I’m fairly certain that takes leverage by multi-billion dollar firms. Which is just another example in this HFT casino.", "score": 4, "replies": []}]}]}, {"body": "It sounds like the 102 of what you're considering is something closer to this: https://www.reddit.com/r/VolatilityTrading/comments/ttb46o/image_for_oleg/", "score": 3, "replies": []}, {"body": "I don’t trade options but the general point you’ve raised—to a fair amount of unreasonable criticism—is widely accepted; namely, when VIX crosses 20, it typically comes with a massive sell-off.\n\nYou’re suggesting using this widely known phenomenon as an option trading strategy. I don’t see the issue with that. Understand that the VIX is just one indicator among many of emotional sentiment among investors", "score": 2, "replies": []}, {"body": ">We appear to be at an inflection point where either the bull market is going to recover or we are headed for another leg down \n\nSo it could go either up or down? Gee, thanks nostradamus", "score": 2, "replies": [{"body": "You know as well as I do that predicting an event driven market is impossible. I expect bearish action to start the week but I could be absolutely wrong.", "score": 1, "replies": []}, {"body": "It could also go sideways.", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "tu5tcp", "created_utc": 1648859021.0, "score": 22, "upvote_ratio": 0.93, "num_comments": 10, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|21|**First Seen In WSB**|2 years ago\n**Total Comments**|58|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tu5tcp)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tu5tcp)", "score": 1, "replies": []}, {"body": "Bought towards EOD as futures were accelerating down. Pushed the premiums a bit lower and purchased near close. Market tends to make some major moves in the last 10 minutes of trading. Speculative trade based on release of delivery numbers tomorrow", "score": 2, "replies": []}, {"body": "Nice. I also picked up 10x 1150 for 4/14! Nice to see the after hours move!  God speed!", "score": 2, "replies": [{"body": "Awesome!", "score": 1, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "fuck yeah. I own way more calls than is responsible", "score": 1, "replies": []}, {"body": "What the hell is delta Theta gamma vega?", "score": 1, "replies": [{"body": "\"The Greeks\" in options trading", "score": 1, "replies": []}]}, {"body": "I burned through my excess gambling money, otherwise I would have been right there with you!", "score": 1, "replies": []}, {"body": "Have same contract as OP. Hope we rip this week!", "score": 1, "replies": []}]}
{"title": "Do you guys think I will survive considering the amazon strike ?", "selftext": "", "id": "tu6j09", "created_utc": 1648861224.0, "score": 11, "upvote_ratio": 0.76, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 week ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|2 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tu6j09)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tu6j09)", "score": 1, "replies": []}, {"body": "Yes you ignorant cunt", "score": 7, "replies": [{"body": "Thanks dad", "score": 2, "replies": []}, {"body": "I got fucked on SPY calls past 2 days and needed the reassurance", "score": 2, "replies": [{"body": "Same. Im out til next Thursday which means it'll rally 140pts Monday since I sacrificed  80% of my port to lucifer this week", "score": 1, "replies": [{"body": "Sorry to hear that bro, Were gna have a great week coming up tho I know it !", "score": 2, "replies": []}]}]}]}, {"body": "Jes, it's fukn skynet, er, Amazon! Not financial advice, but I see 4100 as the target, sir.", "score": 2, "replies": [{"body": "PUT YOUR HANDS UP jetgeek_99!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "The bottom is a debit. FYI", "score": 1, "replies": []}, {"body": "You guys have to realize my break even for Monday, April 4 is 3288, Thats a pretty base price for amazon \n\nhttp://opcalc.com/Joq", "score": 1, "replies": [{"body": "You have a solid shot bro", "score": 1, "replies": []}]}, {"body": "I love how all this talk sounds. It's way above my head though.", "score": 1, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "The April is fucked.", "score": 1, "replies": [{"body": "And why is that ? I was planning on making some tendies", "score": 1, "replies": [{"body": "Oof. Agreed on the April. You’ll be down what, like $900 if we open flat on Monday to where we closed after the long green power hour candle today?  \nLove the June plays, plenty of upside on catalyst news (split, upcoming earnings, etc). Things seem volatile and sideways for now, and it is a pure gamble to hold this over the weekend into next week while theta comes for you. Good luck! \nPositions: nothing! I’m buying calls or puts at the start of the day and I’m out by 9 and during power hour (cash gang/degenerate)", "score": 2, "replies": []}]}]}, {"body": "I wanna say: maybe, but most likely not.", "score": 1, "replies": []}, {"body": "no", "score": 1, "replies": []}]}
{"title": "4/1/22 SPY (apple) weekly TA", "selftext": "[removed]", "id": "tu6ugu", "created_utc": 1648862250.0, "score": 30, "upvote_ratio": 0.89, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|135|**First Seen In WSB**|1 year ago\n**Total Comments**|1220|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/skp8ci/24_spy_recap_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tu6ugu)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tu6ugu)", "score": 1, "replies": []}, {"body": "Great stuff. Thanks for the knowledge.", "score": 3, "replies": []}, {"body": "in my life (40s) any time there was this much volatility, i noticed large drops", "score": 2, "replies": []}, {"body": "Had 30 DTE puts. Could have made an nice 10k instead I am down 5k today. I am going to see how this Wednesday turns out. This money is a loan and many people have lent me cash. Hoping for a really big break. Only have 32K left in cash reserves, hope this week we finally see the mid 440s to start the trend. Additionally, what are your thoughts on everyone saying April is historically the best month? I think we have outdone ourselves and this hyper inflated SPY is going to crumble when actual news starts to hit the street.", "score": 2, "replies": [{"body": "No offense but using loans and borrowed $ from others is bad idea for tradeing, unless you are in a institute.", "score": 2, "replies": [{"body": "Agree 100%. My bearish play calls have worked and then greed takes over and not selling for profits is the biggest mistake. My main goal is to return back to where I started at 50K", "score": 1, "replies": []}]}, {"body": "So you’re saying you don’t know how to take profits?", "score": 2, "replies": []}]}, {"body": "This month was pretty good. I don’t really day trade steady but I did most days this month. Wound up with 35k in realized gains, at least half that was from selling far otm cash secured puts. I went hard with them. good month. 🤙", "score": 2, "replies": []}, {"body": "https://mobile.twitter.com/AdamMancini4/status/1510312979795005447\n\nAnother viewpoint", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "In the end that’s all anyone can do. You draw trend lines, support and resistance levels and see what happens . Nobody knows the future, no way of predicting where price is headed.", "score": 2, "replies": []}]}]}, {"body": "this is alot of words for someone whos always wrong. stonks only go up", "score": 3, "replies": []}, {"body": "Always great!", "score": 1, "replies": []}]}
{"title": "here before next bubble burst", "selftext": "", "id": "tuje38", "created_utc": 1648907663.0, "score": 97, "upvote_ratio": 0.89, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|34 seconds ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tuje38)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tuje38)", "score": 1, "replies": []}, {"body": "You literally posted a meme template.", "score": 14, "replies": [{"body": "the wh0res at FED increased interest rates by 10bps", "score": -10, "replies": []}]}, {"body": "Did it burst already?", "score": 2, "replies": [{"body": "It won't \"burst\" I hope the fed raises rates like they would in the 80s to get inflation under control but I don't see them doing it. Prices will drop when mortgage rates go up and up but there won't be a burst.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Yea exactly rates have gone up over 1 percent in the past 4 months but house prices haven't dropped yet. That's my point.  It won't burst just decline", "score": 7, "replies": [{"body": "Demand is still high. COVID cash savings and real estate flips are still inflationary pressures. If it's supposed to burst, you'll need to give it a year or so, assuming FED and ECB raises raised as planned.", "score": 4, "replies": [{"body": "That's cool and demand will be higher than supply for a long time.  2008 happened because people were getting bad loans and getting loans just showing 2 pay stubs.  It is nothing at all like that now.  Sorry bud, you can buy a house cheaper in a year but it won't crash like you want it to.", "score": 2, "replies": [{"body": "Did i say i wanted it to crash? Chill.", "score": 1, "replies": []}]}]}]}]}, {"body": "Is that so? How do you know that? Honestly, not trolling.", "score": 1, "replies": [{"body": "Demand is much higher than supply.  There is no reason it would just crash", "score": 5, "replies": []}]}]}, {"body": "about time", "score": 0, "replies": []}]}]}
{"title": "Consulting Firms and the Beast of Amazon Inc. - Breaking down How Growing Companies are Sabotaged/Consulted into Bankruptcy", "selftext": "[Beast of Amazon Inc.](https://youtu.be/7WrAwxyRn2I)\n\nAnother short story for the weekend fellas!🥳 This time I'm focusing on consulting firms like BCG and their entire process of consulting companies into bankruptcy for their corporate overlords.😑 We know Ryan Cohen has been mentioning them since their lawsuit against his company so I'd thought I'd spread awareness through this fun and hopefully informative short.🤓\n\nThe music/art is mostly my own and I hope you enjoy it!😀", "id": "tumkq7", "created_utc": 1648916326.0, "score": 143, "upvote_ratio": 0.86, "num_comments": 16, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|35|**First Seen In WSB**|1 year ago\n**Total Comments**|9|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/s75i5i/etf_shorts_drs_shares_and_the_meme_stock_market/) \n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tumkq7)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tumkq7)", "score": 1, "replies": []}, {"body": "Amazon is 100% the Final Boss. Coming for you, Bozo!", "score": 31, "replies": []}, {"body": "I hope that’s your real voice.", "score": 13, "replies": [{"body": "It is🤓😁", "score": 10, "replies": []}]}, {"body": "never gave that a thought, now I have something to think about all weekend, thank you for giving![img](emote|t5_2th52|4641)", "score": 10, "replies": []}, {"body": "RIP Toys R Us. Fuck Bain Capital and Fuck Mitt Romney", "score": 18, "replies": [{"body": "If you know, you know😉", "score": 9, "replies": []}]}, {"body": "This video was complete dogshit. Not only did you not break down anything at all, you only reinforced my opinion that people who make these kind of claims have no idea what they are talking about. Not a shred of evidence posted, not even tangentially related information which gets poorly shoehorned into an unrelated narrative which is usually the standard post here. At least get an intro to your videos so you dont immediately send the viewer into your imaginary conversation between the bad guys. Seriously it watched like a fucking looney toons scene. At least you are posting to the right place for these other morons to watch.", "score": 32, "replies": [{"body": "“Blah blah blah profits blah blah blah corporate overlords blah blah blah bankruptcy”. It like little kids that heard their dad talking on a work call parroting words they heard.", "score": 4, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Hahaha insulting but not wrong ![img](emote|t5_2th52|4260)", "score": 2, "replies": []}]}]}, {"body": "Same comment as this guy but using different words to say the same thing. Didn’t even go into the WHY.", "score": 5, "replies": []}, {"body": "This what happens when people who actively call themselves tards and claim to work at Wendy’s start thinking they understand corporate structure. \n\nThese consulting firms save companies millions of dollars by avoiding internal hires / departments that are not needed long term.", "score": 10, "replies": [{"body": "In Europe we have a name for corporate consultants, we can them \"the Americans\" and they are the nr1 predictor of employee churn and culture bankruptcy. You know your company is he going down the drain when the Americans start showing up", "score": 1, "replies": [{"body": "I’d say that’s one way to observe it but another way to observe it “a bunch of failing companies that tried a last ditch effort to hire consultants ended up failing anyway”", "score": 1, "replies": []}]}]}, {"body": "Literally no substance. No facts, no information. Just rambling conspiracy theories. This is some Alex Jones shit right here.", "score": 3, "replies": []}]}]}
{"title": "Will Tesla stock go down next week?", "selftext": "[removed]", "id": "tund4x", "created_utc": 1648918249.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 16, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|11 seconds ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|19 hours|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tund4x)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tund4x)", "score": 1, "replies": []}, {"body": "Yes, the company announced it this morning that they will lower their stock price next week. So far its got a lot of criticism", "score": 15, "replies": [{"body": "Really wish they would announce how low they're going through make the price so i can buy in when it gets that low.", "score": 3, "replies": []}]}, {"body": "Go ask Pelosi or her gold fish", "score": 5, "replies": []}, {"body": "Probably going down.\n\nCould go up though!", "score": 2, "replies": [{"body": "Maybe....", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "If course not it only goes up", "score": 1, "replies": []}, {"body": "Deliveries were pretty much on point with estimates. Factory opening in Austin this week. Should be bullish if the black bird doesn’t fly to the left.", "score": 1, "replies": []}, {"body": "Black or red ? This is a casino.", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Interesting fact: in the US we have 0 and 00 while in most EU they only have 0 cutting the house odds in half.", "score": 1, "replies": []}]}]}, {"body": "Yes\n\nIt will also go up\n\nAnd sideways", "score": 1, "replies": []}, {"body": "Let me consult my crystal ball", "score": 1, "replies": []}]}
{"title": "Tesla delivers 310,048 electric vehicles in the first quarter", "selftext": "https://www.cnbc.com/2022/04/02/tesla-tsla-q1-2022-vehicle-production-and-delivery-numbers.html\n\n\nLora Kolodny\nTesla just reported first-quarter vehicle production and delivery numbers for 2022.\n\nHere’s how they did.\n\nElectric vehicle deliveries (total): 310,048\n\nElectric vehicle production (total): 305,407\n\nOver the same period last year, Tesla delivered 184,800 electric vehicles and produced 180,338 cars.\n\nModel 3 and Model Y vehicles comprised 95%, or 295,324, of deliveries in the first quarter of 2022, according to Tesla.\n\nThe company produced 4,641 fewer cars than it delivered during the quarter citing “ongoing supply chain challenges and factory shutdowns.”\n\nAnalysts expected deliveries of 317,000 vehicles for the first three months of 2022, according to estimates compiled by FactSet as of March 31. The estimates ranged from a low of 278,000 vehicle deliveries to a high of 357,000.\n\nDeliveries are the closest approximation to sales numbers reported by Tesla.\n\nThe company recently opened a new factory in Brandenburg, Germany, and had a ribbon-cutting ceremony on March 22. Tesla also plans to host a grand opening and “cyber rodeo” event on April 7, at another new vehicle assembly plant it’s building in Austin, Texas.\n\nTesla moved its headquarters to Austin officially as of Dec. 1, but still operates its first electric car factory in Fremont, California.\n\nGlobally, Tesla’s operations during the quarter, which ended March 31, were weighed down by a Covid surge and new health restrictions in China, requiring temporary production halts at its Shanghai plant. In the fourth quarter, Tesla delivered 308,600 EVs, marking a record for the company. \n\nTesla, along with the rest of the auto industry, has also been hurt by widespread parts shortages, and inflation. Critical components like semiconductors remain in short supply, and prices have increased for raw materials like nickel and aluminum after Russia launched an invasion of Ukraine in February. In the U.S., Tesla has been leaving customers waiting for months before filling their car orders.\n\nTesla CEO Elon Musk warned in mid-March of inflationary pressures on the business, and hiked the prices of its cars in both the U.S. and China.", "id": "tupu14", "created_utc": 1648924533.0, "score": 53, "upvote_ratio": 0.88, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|39|**First Seen In WSB**|2 years ago\n**Total Comments**|167|**Previous DD**|[x](https://www.bloomberg.com/news/articles/2020-02-17/apple-doesn-t-expect-to-meet-revenue-guidance-for-march-quarter) [x](https://www.reddit.com/r/wallstreetbets/comments/ff46j2/puts_on_uk_ewu/) [x](https://www.reddit.com/r/wallstreetbets/comments/fd4xum/amazon_seattle_employee_tested_positive_for/) [x](http://www.cnbc.com/2020/04/09/oil-jumps-ahead-of-make-or-break-opec-meeting.html) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tupu14)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tupu14)", "score": 1, "replies": []}, {"body": "below estimates but it's TSLA, so who the fk knows what'll happen on Monday", "score": 17, "replies": []}, {"body": "Yes, we have two in our house. But I’ll tell you right now, TSLA is getting crushed on this one come Monday morning and I’m sad.  They needed to report 320k or more so it looks like TSLA puts are going to print next week", "score": 15, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "We’ll find out Monday morning, both at 7 am in before hours and 9:30 on full trading start. It’s Tesla, anything can happen. I’m just taking a guess here though that the street will be singularly focused on that delivery number, interpret it as a miss, and we end up with a ‘sell the news’ Monday.  \n\nI hope I’m wrong and you’re right.", "score": 2, "replies": [{"body": "Here’s my outlook as a long term shareholder:\n\nI think you’re right that the numbers aren’t going to wow. So the stock rocketing up is probably out of the picture. What we don’t know is what the expectations are. I could see it being disappointing and the stock trending down as you suggest. But I could also see the positive spin of Q1 still doing okay despite covid shutdowns and supply issues. \n\nOne interesting thing to look out for is earnings. Q4 had Elon’s stock option package heavily decrease EPS. So there could be some surprise there if EPS is significantly higher despite similar deliveries.\n\nReally though, WS expects 2022 to be good. Earnings this year won’t change much in terms of the stock price. But their estimates for 2023 and beyond imply significantly lower growth. So if Tesla shows it can continue it’s >50% growth beyond 2022, then the stock should rise significantly.\n\nTLDR: this year will probably be flat with huge upside starting around Q4 2022 as WS adjusts for further growth", "score": 2, "replies": [{"body": "Spot on analysis.  Even as Tesla bulls, we can be honest and realistic about what to expect.  LOL at people thinking stocks NEVER go down, even the good ones. Of course they do and those are the entry points to grab a few extra shares 👍\n\nIf we are right on this, I’m going to be looking at all entry chances below $1,000 before the inevitable ramp up to $1,500 (pre split pricing).", "score": 1, "replies": []}, {"body": "Looking flat to open today, so you nailed the initial reaction - props to you on this one 👍", "score": 1, "replies": [{"body": "Ha yeah slightly green even as of now. Not bad!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Be careful when buying puts… They almost doubled their production compared to last year. Tesla seems to skyrocket on the slightest hint of good news. Or do what you want but for the love of god sell your puts before daddy Elon puts you to bed himself.", "score": 5, "replies": [{"body": "I can’t imagine ever HOLDING Tesla puts, how many times does Elon need to prove everyone wrong before they learn? Lol.  \n\nThat said; puts can always win because stocks don’t ever just shoot straight up, every day. The people that had balls of steel to go against Elon with puts last Friday are probably going to feast Monday, but if I’m them I’m banking my gains ASAP that morning. Because all Tesla dips have been proved to be buying opportunities in the end.", "score": 1, "replies": []}]}, {"body": "Everyone and their uncle want a Tesla", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "Not me or my uncle", "score": 1, "replies": []}]}, {"body": "wine slim silky public subsequent smell provide edge screw flag", "score": 0, "replies": [{"body": "Some of the vehicles that Tesla delivered in Q1 were paid for in Q1. Of 2021. Depending on specs, you could be waiting a while for your car that you put a deposit on and agreed to pay for to be delivered. I’m fairly certain the wait period is down to way less than a year at this point for most models, but there’s still a huge wait for some.\n\n\nIt’s a measure of their ability to keep up with demand and scale production to meet demand.", "score": 1, "replies": [{"body": "S and X models, in particular. They’re doing ok on the mass market 3 and Y, the waits are weeks, maybe a short number of months. But new luxury models are over 6 month waits unless you go used (and even that inventory is limited and gets snapped up when the features someone wants matches up with availability).", "score": 2, "replies": []}]}, {"body": "They don't recognize the money for the sale on their balance sheet unless it has been delivered. That's also why price increases showing up on the balance sheet lags when they announced it.", "score": 1, "replies": []}]}]}
