{"title": "I've heard of covered calls even tried it myself and always been told to set it OTM.", "selftext": "[deleted]", "id": "u3yydd", "created_utc": 1649993596.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 15, "comments": [{"body": "There is no insane premium for itm , buying at 160 and selling at 150 is itself a $10 per share loss, so $1000 loss total minimum, the 150 strike call in this example would be 1000 plus very little extrinsic like 100 or so. So basically the profit is only 100 or so not the 1100 which looks like great premium.", "score": 10, "replies": [{"body": "Thank you for the info, I knew I overlooked something but I didn't know what. This cleared things up then.", "score": 3, "replies": []}]}, {"body": "LOL. GL on timing that.", "score": 4, "replies": [{"body": "Purely hypothetical", "score": 1, "replies": [{"body": "Ideally if you could time it by selling ITM before it drops and the buyer goes to NTM to OTM, then you’d make the most premium for CC. Including it not getting exercised. But…HFT and volatility in price movement with timing the “top”.", "score": 2, "replies": []}]}]}, {"body": "It’s the exact same P/L graph as selling a put at $150. B/A spreads will probably be worse on the ITM call (though maybe not because it’s AAPL) and it’s less capital efficient than selling the put (you are actually using margin/cash when buying the shares and selling the call, whereas with the put you could still have your cash invested). \nWith that said, I have done this on dividend stocks and just rolled the call from month to month. One example is UNM. I think I bought around $26, sold the $25 call, rolled month to month and collected a 4%+ dividend. Will most likely be losing the stock on the May expiration with it in the $32 range.", "score": 3, "replies": [{"body": "Thank you for the info, and the real world application. Maybe one day I can try something like this.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "Personally I would sell a put too. But that is the way I roll. \n\nI am a premium pig. And old.", "score": 3, "replies": [{"body": "I couldn’t have said it better", "score": 2, "replies": []}]}]}, {"body": "Lol wait so you wanna sell a call ITM that’s below your cost basis? So from what I’m understand, you basically wanna sell for a loss. RIP", "score": 0, "replies": [{"body": "Well this question was just something I was wondering. I was focused on premium and not the overall. It's been cleared up already  up in the comments.", "score": 0, "replies": []}, {"body": "It’s not a loss. He gets premium. It’s bearish at best. Kind of stupid.", "score": 0, "replies": []}]}, {"body": "Google “max pain” sell your premiums at that point.  Play the MM’s game", "score": 1, "replies": []}, {"body": "It is equivalent (other than friction cost) to just selling a $150 cash secured put on AAPL (and holding no shares), which is a decent and popular with thetagang strategy -- a lot has been written about its upsides and downsides.\n\nWith your version, keep in mind if AAPL did not move, you only profit the extrinsic of the option, not its full cost, as AAPL shares get called away at $150 when you could have sold them for $160. But as long as AAPL doesn't tank, yes, it's profitable.", "score": 1, "replies": []}]}
{"title": "Selling options - my thoughts and advice", "selftext": "Hi. Chances are you've heard about how risky options are. That you should stay away from them or risk losing everything.  \n\n\nFor me, that was the same talk I heard about stocks before I got into those. I will cover selling Put options and Call options. (buying them is vastly different!)  \n\n\nWhy sell a put or call? Chances are you use limit orders for buying or selling stock. You offer price X for 2 weeks and if it doesn't hit that price your offer dissapears forever. Imagine someone PAYS YOU for that same order. The main downside? You need to pay money back to cancel the offer.  \n\n\n**I warn you however**. Do not sell options for stocks you want to keep or would not ever want to own!  \nThe option replaces a \"I'd be fine with buying or selling at this price\" but it's not a MUST sell or buy.  \nMany options expire without triggering the contract so don't use an option for a buy or sell you can't miss out on. Another thing to note is that an options contract is for 100 shares. Selling 1 contract for a 7USD stock = 700 USD possible purchase or sale. Selling it for tesla stock? Means 100x985USD right now (almost 100K!)  \n\n\nSelling options are represented by these kind of charts. These however DO NOT accurately show the possible (and most probably) scenarios. \n\nhttps://preview.redd.it/21c8wjg6qrt81.png?width=823&format=png&auto=webp&s=1956a4a22de98fefbe4817058bd50311dca853ba\n\nBoth the sale of put and call option chart examples will show a huge loss potential in exchange for limited and fixed upside potential. What these charts do not cover is the potential for the purchased/kept stocks future.\n\n&#x200B;\n\n**Selling a PUT option**   \nThis contract means you have to buy the stock at the agreed price. Say I sell 1 put contract for ASE stock. I'm willing to guarantee 6,5 USD price per share. I offer this guarantee untill 30/04/22.  \nThe buyer, seeking certainty, is willing to pay me 50 USD for this price and time period. If the price of ASE is 6,51 or above. The buyer will not make use of our contract and he won't sell the stock to me on 30/04/22. Meaning I earned 50 bucks in 2 weeks time.   \nSay the price is 6,20. I buy 100 stock at 6,50. Meaning I pay 650 USD but I received 50 in advance. My net purchase is 600 USD. If I sell right away I still make 20 USD.\n\nAssume the stock is 550 USD. I \"lose 50 USD\". But that's not a real loss untill sold + if I was interested in the stock at 650 and I Just bought at 650. I would be down more than with the put sale. The chart does not show the scenario where I end up buying the stock, keeping the 50 bucks, holding the stock and selling it at 900 USD. A very possible scenario.\n\nMost options only get triggered at the end of the contract, most allow the buyer to trigger them at any time but they rarely do. The best times to sell puts is on days the market drops as people are panicking.\n\n&#x200B;\n\n**Selling a CALL option**\n\nFor this option you need to own more than 100 stock of a company. This option means you have to sell your stock at price X for a certain time. The beauty is combining this with the put option from before.  \nI ended up buying 100 ASE stock for 650. (disregarding the premium from the put sale)\n\nI'm ok with owning this company for a while so I sell a call option for 7,5 USD/share and receive 20 USD to guarantee 750 USD untill 28/05/22. If the price is under 7,5, I won't have to sell. Meaning I keep the stock and I keep the 20 USD. I can sell the call option over and over untill it sells.  \n\n\nIf the stock sells at 750, I get the 750 and the 20 premium for selling the call option.\n\nIf the contract expires in may but I keep it and don't sell calls, but the stock goes to 9/share in june. I can still sell for 900 to be sure of the profits or sell calls again at the higher strike price.\n\n&#x200B;\n\n**Final piece of advice**\n\na sold put/call gains value as time passes as the time you guarantee the price shortens. 1 day of guarantee is not worth as much as 1 year. Signing short contracts works highly in your favor as for every expired contract you lock in gains and it's far easier to keep track of your possible debts.", "id": "u4k8za", "created_utc": 1650063945.0, "score": 63, "upvote_ratio": 0.87, "num_comments": 19, "comments": [{"body": "They call me up to put me down", "score": 6, "replies": []}, {"body": "Very well written. Options are only dangerous if you dont know how they work.", "score": 7, "replies": [{"body": "Thank you :)", "score": 3, "replies": []}]}, {"body": "I have no clue how options work and I’ve been trying to educate myself on it but it’s all confusing to someone that is fairly new to investing in general. Getting useful tips and serious advice is hard to find on her lol", "score": 6, "replies": [{"body": "This was written for nubelets. Did you read it?", "score": 7, "replies": [{"body": "Can apes read?", "score": 1, "replies": []}]}, {"body": "[https://www.youtube.com/watch?v=VJgHkAqohbU](https://www.youtube.com/watch?v=VJgHkAqohbU&t=202s)\n\n&#x200B;\n\nSadly David 'misrepresents' the selling of a call option as he focuses on a \"naked call option\" Something you should not do + many brokers don't allow.\n\n&#x200B;\n\nThe covered call is what I covered above. \n\nRemember while watching this that most information focuses on the buying side. Meaning that the downsides at the end of the video are actually a big upside for you as a seller.", "score": 3, "replies": []}, {"body": "Look for a book called futures options and other derivatives by hull it’s ~$200 but worth every penny if you are serious about options", "score": 1, "replies": []}]}, {"body": "thank you man!", "score": 2, "replies": []}, {"body": "The way I look at selling options is a bit different. First let's look at call contracts:\n\n1)only sell covered calls - if you sell 5 contracts, then you must own 500 shares of that stock. Selling a naked call has unlimited risk potential, and many brokers will not allow...\n\n2) I also disagree from the above statement - only own stocks you want to keep - why would you own stocks you do not like? I know some folks will say if you sell covered calls on that stock - it could get called away from you? Yes and if that happens and I still really like the stock - then I sell Cash protected puts to buy back in - or just buy the stock again...\n\n3) the way I describe selling covered calls to non-investing folks: I am renting out my stocks for income - its rent to own. Kinda like Air bnb for stocks...\n\nSelling Puts:\n\n1. so if there is a stock I do not own - but want to buy I cann sell puts to buy the stock at a discount in the near future. If the stock gets put to me I am happy - I now bought that stock at a discount and got paid a premium as well.\n\n2)Only sell cash protected puts - either have the cash or cash-type object in your portfolio - or have the cash elsewhere that could be moved into your account...\n\n&#x200B;\n\nI run a small hedge fund and use this strategy - called the options wheel strategy...\n\n&#x200B;\n\n&#x200B;\n\nESP", "score": 0, "replies": []}, {"body": ">Selling a CALL option\r  \n\r  \nFor this option you need to own more than 100 stock of a company. This option means you have to sell your stock at price X for a certain time. The beauty is combining this with the put option from before.\r  \nI ended up buying 100 ASE stock for 650. (disregarding the premium from the put sale)\n\nWait this is incorrect right? I can buy an call option, have it in my possesion and sell it off if the value has increased? Effectively, I'm selling my bought option.", "score": 1, "replies": [{"body": "Both are correct. As the buyer of the call, you can sell it to another person or entity for market price. The original seller of the call now has a contract with the new buyer. \n\nIf the original seller of the call wants cancel the contract, they can “Buy to Cover”, meaning they purchase the exact same call they sold.", "score": 2, "replies": []}, {"body": "Selling a bought call is not the same as selling a call option.  \n\n\nSelling is a bit of a tricky word and it's why they use the word writing an option. You sell the right to buy. I sell the obligation to sell the stock. Vastly different.  \n\n\nI'm writing a call option on the stock while you are passing your right to someone else.", "score": 1, "replies": []}]}, {"body": "Good explanation. One caveat, to sell a call option you don't necessarily have to own 100 shares of the stock. You can also own a call option at a slightly higher strike price, which would protect you from large losses if the stock price rises significantly. Furthermore, you can also sell a \"naked\" call option, i.e., without owning the stock or a higher call option; however, that is wayyyy too risky and not recommended (if your broker even allows it.)", "score": 1, "replies": [{"body": "While both are true, my post was not meant to mention all the possibilities with puts and calls. It was meant to show my strategy as this kind of option use is very straightforward and for people who usually don't want to trade options in any other way.", "score": 1, "replies": []}]}, {"body": "I am trying to understand this, I currently have 200 shares of BMO, I only ever wanted 100, I puchased more to lower my average, so I am looking at selling 100 in an option. Correct me if I am wrong, when I sell this option, I set the strike price and expiration. Example, Sept 2024 Strike Price $105. I am being asked what limit would i price this at and I dont understand that portion. The dollar value that is being represented is $91.94, Shouldnt the number be less like more like $12? I thought I set the premium above the current? Or do I list the price so example, I say I want $100 per share, on the current price thats a $7 premium? Im not sure if I am explaining myself well but any help would be appreciated.", "score": 1, "replies": [{"body": "Hi, you want to sell a call option. 1 being 100 shares.  \nthe limit on the call option is the premium you are setting.  \n\n\nThe premium depends on its own market and the volatility. The longer you open the option for, the higher the premium. In general I would advise you to sell the same option many times for many smaller premiums. You want the option to close constantly. The short time frame is your biggest ally as a seller.  \n\n\nSelling a call quite above market price will not net you much, so if you want to sell it above. you will likely have to give a long timeframe after all.  \n\n\nIf the stock ends above 105, you will sell 100x105 USD  \nIn any case you keep the premium.", "score": 1, "replies": [{"body": "There’s no risk to selling calls correct? Risk being I lose money", "score": 1, "replies": [{"body": "No, you know what the possible sell price is. You either sell or don't.  \n\n\nYou always keep the premium. As long as it's a covered call, but most brokers don't let you sell calls when you don't have the 100 stocks.", "score": 1, "replies": []}]}]}]}]}
{"title": "What exactly is an \"analyst note to client\" and does anyone here get one?", "selftext": "So in financial news you often hear something like:\n\n>Netflix is spending too much money on content, said Needham analyst in a note to clients. Needham downgraded Netflix to a hold. (this is made up quote)\n\nSo who exactly are these clients and what are they paying these firms? For example:\n\n* Is Needham actively managing these clients' accounts? \n* Or are clients simply paying for random emails that drop in their inbox?\n* Why would I pay Needham for this service if I can just read about this in the news?\n* Is Needham happy or sad that these notes get leaked?\n\nI love input from everyone. But especially interested if you are/were a client who gets these notes from investment firms.", "id": "u48z5d", "created_utc": 1650032020.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 16, "comments": [{"body": ">Is Needham actively managing these clients' accounts?\n\nNo Needham provides analysis for banks, pension funds etc.\n\n&#x200B;\n\n>Or are clients simply paying for random emails that drop in their inbox?\n\nMore often than not, it is much more complex than that. They also include DCF models, models with important metrics (like subscriber growths etc) and comparing that to other competitors.\n\n&#x200B;\n\n>Why would I pay Needham for this service if I can just read about this in the news?\n\nCause to create all those models, researching competitor and the business itself is a lot of work. If you are a pension fund with a few portfolio managers and a few analysts , it is much cheaper to buy the research.\n\n&#x200B;\n\n>Is Needham happy or sad that these notes get leaked?\n\nNothing got leaked. Needham provides a service. It is similar to outsourced IT, or outsourced payments. You could do it yourself -  but depending on your company structure it is much cheaper to pay someone.", "score": 4, "replies": [{"body": "OMG this makes so much sense thank you.\n\n> They also include DCF models, models with important metrics (like subscriber growths etc) and comparing that to other competitors.\n\nAh I see. So we're just getting the tldr version of things. Is the deeper dive and models available elsewhere on the internet?\n\nLike for example say I'm the pension fund manager for Dallas School District and I subscribe to Needham. Couldn't I find a buddy who manages the Miami City Government pension fund who subscribes to say JP Morgan and trade notes with him?", "score": 1, "replies": [{"body": ">Is the deeper dive and models available elsewhere on the internet?\n\nYeah we are getting the TLDR. For the models you have to pay. As those companies spends lots of money on their analysts, they guard them like treasure. \n\n&#x200B;\n\n>Like for example say I'm the pension fund manager for Dallas School District and I subscribe to Needham. Couldn't I find a buddy who manages the Miami City Government pension fund who subscribes to say JP Morgan and trade notes with him?\n\nIn theory yes. However many don't do it -  as sharing is not allowed. If they catch you, no one would want to sell you research again. Compared to the massive amount of capital they manage, or the cost of analysts that they would have to employ. It is cheap. \n\nFor you and me, who invest their own money , it is super expensive.", "score": 1, "replies": [{"body": "But is the deeper dives *that much* more valuable than the tldr we get? I mean we're already getting their price target, their position (hold, buy, sell), and T-ranks even tracks analyst history. \n\nThis is a fascinating world thank you for explaining it to me.", "score": 1, "replies": [{"body": ">But is the deeper dives that much more valuable than the tldr we get? I mean we're already getting their price target, their position (hold, buy, sell), and T-ranks even tracks analyst history.\n\nYes. You can more often than not ignore the tldr from analysts. There are two reasons for it: The first is, that they rating (hold, buy, sell) and price target often gets changed from higher-ups(for example the Tesla target price from Banks who do business with Tesla is by an order of magnitude of 3 higher than those who don't). T-Ranks gets scewed by this as well.\n\nThe second reason is that they create those rankings with portfolio management in mind. For example if they would set Netflix on Sell, chances are high that some institutions would sell and the price would supress a lot, thus they would have to set it on buy -  and the price would get back up. The only one winning from this, would be the brokers not the institutions who buy the research.\n\n&#x200B;\n\nThe best thing to do as a retail investor, is reading lots of analysis from Seeking Alpha and Blogs, who do good research (there is tons of stuff). The more you read and the more business you analyse yourself, the easier it will be to differentiate between the good and bad stuff.", "score": 3, "replies": [{"body": "Oh my god this explains so much thank you. Did you use to work in the industry? You seem very knowledgeable about this system.", "score": 1, "replies": [{"body": "I did an internship, but most of my knowledge came mostly from just googling things that interested me. So i just accumulated the knowledge over the years. If you have any questions feel free to message me.", "score": 2, "replies": []}]}, {"body": "Three orders of magnitude? Pop pop!", "score": 1, "replies": [{"body": "Yes companies like citibank have the price target at around 250-400, whereas Morgan Stanley and GOldman Sachs (both of which Tesla do business with) have their price target over 1100", "score": 1, "replies": []}]}]}, {"body": ">But is the deeper dives that much more valuable than the tldr we get? I mean we're already getting their price target, their position (hold, buy, sell), and T-ranks even tracks analyst history.\n\nYou have to rember, the costs for that sort of thing are passed through their customers via whatever their fee structure is. The information is basically free once they have enough money under management.", "score": 1, "replies": []}]}]}]}]}, {"body": "These analysts are called “sell side” analysts. These clients are “buy side,” which is typically discretionary buyers (ie., non-ETF) of securities such as hedge funds, pension funds, etc. \n\nThese analyses are provided by the sell side to induce activities or trade flow from the buy side to the specific banks/brokerage that provides the analyses.\n\nThe bulk of the analyses are much more detailed than a buy, sell, or hold rating. You need that to justify putting a couple hundred millions into a trade/investment. Also, buy side will do their own analyses of the analyses themselves too.", "score": 2, "replies": [{"body": "Ah I see. This makes more sense now. Thank you so much.", "score": 1, "replies": []}]}, {"body": "Well, yeah; big investors get more timely and more useful information about how to make profits than the small investors get. \nBrokers/hedge funds want the big customers because they come with big investments and big fees. \nIn return, the investment firms must provide a higher ROI, or the customer moves his money. \nWatch the movie Wall St. for a good illustration of this. (Although, in the real world, the information is not always gathered illegally.)", "score": 2, "replies": []}]}
{"title": "Citi Trends (CTRN) DD", "selftext": "Hi All,\n\nBelow is an overview of Citi Trends (CTRN). This investment memo is not financial advice. Please do your own due diligence.\n\n**Abstract:**\n\nI believe Citi Trend’s current share price of $32.54 is an appealing entry point. My target price of $63.59 implies 96% upside.\n\nTwo activist investors are involved: Macellum Capital Management (MCM) and Soviero Asset Mgmt.\n\nMCM refreshed the board and fired the existing CEO.\n\nMCM handpicked David Makuen as CEO, an experienced executive who helped run the same playbook at Five Below (50% CAGR over a ten-year period).\n\nManagement has repurchased $115 million worth of shares over the past three years at an average share price of $84.\n\nAfter the Q4 2021 quarter report, the board increased their share repurchase program by an additional $30 million. Bringing the total share repurchase program to $60 million.\n\nThe company generated significant cash flows during the COVID-19 pandemic and during the Great Recession which provides a sense of security for investors if another recession occurs.\n\nThe stock is down over 60% year-to-date and short interest on the stock stands at 44%. \n\nNear-term asset sales over the next 12 months will unlock significant value. Proceeds from the asset sales equate to over $75m dollars which could be used for share repurchases, new store expansion, or renovation.\n\n**Company Overview**\n\nCiti Trends (CTRN) is a leading specialty value retailer for Black and Latinx families selling apparel, accessories, and home goods. Citi is the largest retailer dedicated to the multicultural consumer in low-income neighborhoods with a highly engaged and loyal customer base. There are 609 locations in 33 states with 70% of the stores in Black markets and the remaining 30% in other multicultural markets. A majority of locations are based in the southeast.\n\nThe company owns a 70K sqft. headquarters office in Georgia, and two distribution centers. On March 14, 2022, the company entered into a sale and leaseback agreement for one of their distribution centers which should be finalized in the coming months. The company is exploring a sale and leaseback for their other distribution center.\n\nThe store base is unique as it is essentially a one-stop shop for “under-retailed” families with 70% of the store base located in neighborhoods without a comparable national apparel retail chain.\n\n**Activist Investors**\n\nMacellum Capital Management (MCM) underwent a lengthy proxy battle between the prior management team and board when Jonathan Duskin, CEO of Macellum first started acquiring shares in 2019.\n\nMacellum Capital Management has owned multiple apparel and retail brands including Collective Brands, Charming Shoppes, Warnaco and Hot Topic. Macellum also underwent successful proxy battles on The Children’s Place and Christopher and Banks.\n\nSoviero Asset Management recently acquired 500K shares for 5.9% ownership.\n\nMacellum claimed the old management team was inefficient, lacked merchandising expertise, overpaid themselves and traded meaningfully below peer competitors:\n\nThe high turnover rate in corporate executives resulted in an inconsistent merchandising strategy, driving a decline in sales per store.\n\nCiti Trends was paying the former Executive Chairman $877,000 per year and the former CEO $1.5 million per year for poor performance and effectively having two CEOs.\n\nMCM believes Citi Trends trades meaningfully below peer competitors due to the prior management’s poor performance.\n\nThe board of directors has been refreshed and a new CEO and Chairman is leading the company.\n\nPeter Sachse was the first independent director Macellum put on the board. Sachse is now serving as executive chairman. Sachse is a 34-year veteran of Macy’s.\n\nDavid Makuen became the CEO in March 2020. Prior to Citi Trends, Makuen was EVP of Marketing and Ecommerce at Five Below, which during his tenor Five Below experienced a 50% compounded annual stock appreciation for ten years.\n\n**Share Buyback Program**\n\nMarch 2020\n\nSince reinstating the prior $30 million share repurchase program that was initially authorized in March 2020, the Company has repurchased 618,796 shares of its common stock at an aggregate cost of approximately $18.1 million. As of December 22, 2020, approximately $11.9 million remains available under this share repurchase program.\n\nDecember 2020\n\nThe Company’s board of directors announced the authorization of another $30 million share repurchase program as the next step in its continued capital return program.\n\nJune 2021\n\nThe board authorized another $30m share repurchase program.\n\nOct – Dec 2021\n\nIn the fourth quarter of 2021, the Company repurchased approximately 95,000 shares of its common stock at an aggregate cost of $8.1 million. For fiscal 2021, the Company repurchased approximately 1,370,000 shares of its common stock at an aggregate cost of $115.3 million.\n\nMarch 2022\n\nAs of January 2022, $30m remained available under the Company’s stock repurchase program. In March 2022, the company announced that its board of directors approved an additional $30m stock repurchase program, for a total of $60m available in the program.\n\n**Real Estate Plan**\n\nIn late 2021, the Company underwent a comprehensive evaluation of its owned real estate. As a result, the Company has entered, on March 14, 2022, into an agreement to execute a sale-leaseback of its distribution center located in Darlington, SC for a purchase price of approximately $37 million, subject to due diligence and other customary closing conditions.\n\nIn addition, the Company retained an option to enter a similar sale-leaseback for its distribution center located in Roland, OK for a purchase price of approximately $35 million pending the result by the Company of a network optimization study.\n\nThe Company intends to use the net proceeds from these transactions to provide additional liquidity and for other corporate purposes, including share repurchases as determined by the Company’s board of directors\n\n**Management Growth Plan**\n\nIn addition to the large one-time asset sales, Citi Trends is currently in growth mode. The new management team plans to increase the store base to 1,000 stores over the next few years. This would only cost $160 million as each new store costs $350-400k to open. Management has guided that they will see a payback of under two years and would add over $560 million in revenues based on the average revenue per store of $1.4 million.\n\nManagement is remodeling their old store base which costs around $150,000 per store, with plans to remodel 150 stores by the end of 2023 ($22.5 million investment). Management has suggested they are seeing a larger in-store conversion with remodels and higher store efficiency that should overall increase the sales per store and drive operating income higher.\n\nIncreasing store counts makes sense for under-retailed and low-income demographics. The DTC consumer skews towards high-income and highly educated. Having disposable income, means high-income consumers have the ability to subscribe to DTC brands at a higher rate than low-income families.\n\nAccording to a Pew Research study, online purchasers below the $60K - $100K income bracket significantly drop off.\n\nTwo Drivers\n\nLow-income family's internet access rate is 50% less than high-income families.\n\nLow-income families believe the internet is more likely to be seen as a place where sending credit card or personal information is more troublesome than it is a convenience for shopping.\n\n**Short Interest**\n\nUsing Ortex data, reported short interest has reached 44%. This seems overly aggressive given the backdrop of a multi-year growth story, continued share repurchases, revamped management and board, and decent underlying fundamentals.\n\n**Financials**\n\nFinancial commentary\n\nAnnual sales grew YoY by 26%, achieving $991m in 2021. Sales drivers included stimulus checks to low-income families.\n\nGross margin on average improved 2% in 2020 and 2021 versus 2018 and 2019. This was a result of a refreshed mgmt. team and board.\n\nSG&A on average has decreased YoY. SG&A as a percent of net sales averaged 32% in 2018, 33% 2019, 35% 2020, and 31% in 2021. Drivers were reduced executive compensation from old mgmt. and board.\n\nEBITDA YoY growth of 94% in 2021.\n\nStores increased from 565 in 2018 to 609 in 2021.\n\n**Valuation**\n\nComparable Retail Sector Stocks\n\nCiti Trends currently trades below the median and competitors on EV/EBITDA, P/E, and Price to Sales metrics. Yet, Citi Trends is above the median in terms of Gross Margin and generates more revenue per employee than Burlington and TJ Maxx.\n\n**Base case DCF**\n\nAssuming a 15% discount rate, 5% terminal growth rate and free cash flow generation growth equivalent to forecasted EBITDA growth, I arrive at $63.59/share. This figure implies an upside of 96% from the current share price.\n\nAs a reminder, this valuation does not include or assign any value to the increasing levels of short interest, cost to borrow, or utilization, which combined with a $60m share buyback program could induce a short squeeze.\n\nIn March 2021, the share price reached $110.\n\n**Valuation commentary**\n\nCiti Trends underwent a substantial re-rating of the stock price and valuation during 2021 as stimulus payments combined with pent-up demand increased revenues and operating profit.\n\nIn late 2021, management revised their Q4 targets downward (lapping stimulus payments in the first quarter) along with full year 2022 results which sent the stock plunging downward. At the peak Citi Trends had a valuation close to $1 billion.\n\nIn March 2022, mgmt. advised low to mid single digit growth in 2022. Q1 and Q2 2022 comparable performance could be flat to slightly negative, as 2021 was a high growth year.\n\nMgmt. expects sales to accelerate into Q3 and Q4 due to renovated stores, new locations opening, and revamped product mix.\n\n**Merits**\n\nExperienced mgmt. team and revamped board\n\nActivist investor with retail experience\n\nStore locations cater to their targeted demographic\n\nContinued share repurchase program\n\nAsset sales increasing available cash\n\nGrowth plan to expand stores and improve product mix\n\nNo financial debt outside of operating leases and LOC\n\nI firmly believe the market has overlooked the company’s growth plans, share repurchase program, and asset sales.\n\nI believe the market reacted too harshly to the company’s revised 2022 guidance.\n\nI believe if the company repurchased $115m worth of shares at an average price per share of $84, they would aggressively repurchase shares at $32/share.\n\n**Risks**\n\nQuarter over quarter comps\n\nDue to high growth in 2021 driven by stimulus checks and demand, Q1 and Q2 2022 could result in flat to negative sales growth.\n\nCOVID-19\n\nAny reemergence of COVID-19 could cause locations to be temporarily shut down.\n\nReduction in stimulus checks\n\nCiti Trends caters to lower income demographics. These individuals received stimulus which was spent at Citi Trends. With the reduction in stimulus, we could see a pull back in sales growth.\n\nInflation\n\nHigher costs could reduce basket sizes and negatively impact same store sales. Citi Trends is monitoring COGS and consumer wages to determine the impact of inflation.\n\nSupply chain distributions\n\nCiti Trends relies on third party supplies for inventory. If their suppliers run into supply chain issues, Citi Trends could be negatively impacted.", "id": "u4hfqy", "created_utc": 1650055689.0, "score": 12, "upvote_ratio": 0.85, "num_comments": 17, "comments": [{"body": "CTRN has been on my barrel-bottom dip screener for a while now, but I just can't pull the trigger because I don't trust that TTM EPS spike.  I mean, EPS popped 197% YoY, but revenue was only up 27% YoY.\n\nAlso, I've never seen one of these stores, so I have no idea what the deal is. It just sounds like...Target.\n\nI kinda don't want to buy a Target competitor, because even though I think Target is presently overvalued, they're also killing it.", "score": 4, "replies": [{"body": "Ya I get the hesitation. It might be tough for them to continue that kinds sales and eps growth. Mgmt did put out guidance that they would most likely see flat to down sales growth in the first quarter. Also, it’s not a competitor to target. They sell to a specific demographic, minorities and low-income. I would say their competitor is TJMaxx, Burlington, and maybe dollar general/tree.", "score": 3, "replies": []}]}, {"body": "I just stumbled across CTRN this and am trying to make sense of it.  Thx for the write up.", "score": 2, "replies": [{"body": "Happy to answer any questions.", "score": 1, "replies": [{"body": "The more I look at it the more I like it.\n\nWhat is the best articulated bear argument?  Put another way, what would have to be true for the short sellers to be correct?\n\nSomething like this right?\n\nInflationary pressures will reduce sales consistently (i.e, the clientele they serve isn’t going to have money to shop there) and/or their product offering is no longer trendy or in vogue.  This was a one time success because of stimulus.  Nothing more. \n\nThis is a rational line of thought. How would\nYou respond to this claim?", "score": 2, "replies": [{"body": "I think your inflation argument is valid. Inflation hurts low income families the most and that is citi’s demographic. However, citi sells more than clothes which should insulate them to a degree. Also, higher gas prices mean less driving for those families and they are typically under-retailed which means few competitors to citi have stores located near low income neighborhoods while citi does. This means citi could be the only retailer geographically close to that consumer. \n\nRegarding trends, I citi has enough diversification in terms of brands they sell that trends will come and go and not significantly hurt them. \n\nThoughts?", "score": 2, "replies": [{"body": "Interesting counterpoints.  I’d be interested to see DCF valuations with even thinner than 6% margins to see where that lands if they have to lower prices to offset the decrease in sales. Like I wonder what DCF looks like with 3% margins", "score": 2, "replies": [{"body": "I can update my model with those assumptions. I would be interested as well. I ran a few different scenarios but can’t remember them off the top of my head. \n\nAlso check out CPS - Cooper Standard Holdings. Interesting situation. They have $1.6bn in PPE and their market cap is sub $200m.", "score": 1, "replies": [{"body": "I’ll take a look. Thx for the lead and thx again for the write up", "score": 2, "replies": [{"body": "Of course, appreciate you taking a look and poking holes in my thesis. Makes us all better investors.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "just bought some!!", "score": 2, "replies": []}, {"body": "You lost me at Latinx. \n\nCiti Trends sucks. Have you ever been in one?", "score": 1, "replies": [{"body": "Ya I assumed that. I think some of the renovations will improve the in store experience", "score": 1, "replies": []}]}]}
{"title": "Which school of thought do you more agree with as concerning the macroeconomy?", "selftext": "Read a bunch of macroeconomic articles and there appears to be at least four schools of thought.  Of course the answer is nobody knows for sure, but wondering what your thoughts are.  \n\nOne school of thought is that inflation is runaway, hard to tame, and we will get into stagflation.  This school of thought usually touts the \"commodity supercycle\" and the \"energy supercycle\" and other cyclical stocks.  High inflation, recession.\n\nA second school of thought is that Powell will raise rates, inflation will remain higher than usual (think hovering around 4-5% instead of the usual 2-3%).  We will be able to avoid a recession though as Powell will not be as hawkish as feared or the economy is strong enough to weather his hawkishness.  Usually, this view is pro the \"reflation trade\" of value stocks like banks and industrials, and to a lesser extent than the first school of thought, energy and materials.  High inflation, no recession.\n\nThe third school of thought is that Powell will be able to tame inflation but will have to raise rates to do so and will trigger a recession.  This view usually favors value and big cap tech with wide moats like Microsoft.  Low inflation, recession.\n\nThe fourth school of thought is that Powell has this all figured out and can orchestrate a soft landing.  This view is relatively rare right now because everyone seems so bearish but may gain traction later.  This view is generally bullish on the stock market, especially favoring tech and winners from the past 10 years.  Low inflation, no recession.\n\nThoughts?", "id": "u4j4pz", "created_utc": 1650060582.0, "score": 12, "upvote_ratio": 0.81, "num_comments": 16, "comments": [{"body": "I’ll give a 5th take which is the one I believe.\n\nInflation already peaked and the market already bottomed. The most recent inflation figures show the rate of change has slowed overall and under the hood the primary drivers of overall inflation have actually started to decrease month over month like cars and oil/gas. The rest of the basket will follow suit and yoy for December will likely be around 3-4%. \n\nIf you look at the bond market everything was already priced in with the yield curve and the fed doesn’t really do anything other than implement the policy required to align to the figures the bond market prices in for them. \n\nThe big bond players have started adjusting their positions already and speaking openly to the inflation having peaked with the same 4% end of year estimates I’ve called out. \n\nMarkets will go back to risk on as per their standard annual cycle where things crank back up in May after the first quarter chop and risk off we always have has passed. Strong Earnings cycle over the next couple of weeks and monthly updates showing inflation abating will propel the market to new highs and then we’ll have another cooling in September and October as always and then another end of year rally and then similar crap for different narrative reasons will cause the same long term patterns to emerge next year.\n\nThe media will try to keep you scared and confused all throughout because that’s what they’re paid to do to keep you trading as dumb as you possibly can. \n\nSave this post and see how accurate everything I’ve said plays out ;)\nCall me nostradumbass \nI’m the idiot savant that can see the future so clearly but no one would believe since it’s all too simple and obvious and contradictory to the brainwashing that gets put out there by the people who pay the media to keep you scared and confused.", "score": 5, "replies": [{"body": "I completely agree.  I also think tech has likely bottomed short-term (i.e. for at least the next 6 months or so).", "score": 2, "replies": [{"body": "With margins still over 30%? No way. Tech has a long way left to fall. Wait until the EPS misses start rolling in", "score": 2, "replies": []}]}, {"body": "I like the cut of your jib, sir", "score": 2, "replies": []}]}, {"body": "Nr 3 for me. Although i dont agree with the tech conclusion of it. \n\nInflation is to high, powel will tryvto tame eith rate hikes. But it wont be enough. A recession will come (its long overdue) \n\nRecession proof stocks are the way to go: grocery stores, energy stocks, commodity producers.", "score": 3, "replies": [{"body": "* The tech part has to do with the tech companies' quick recovery.  e.g. If you look at the charts for MSFT around 2008-2010, you will see that MSFT recovered rather quickly compared to stocks like banks that languished for a long time.\n* Grocery stores are good for recession.  Energy may be ok.  Commodity producers, however, are a different story.  If construction and manufacturing activity dries up due to the recession, some raw materials (e.g. lumber, steel, aluminum) stocks may plummet.", "score": 3, "replies": [{"body": "But today is not like 2008. Today is like 1970", "score": 7, "replies": []}]}]}, {"body": "I've heard both 2 + 3 mentioned. \nBut it might be possible to avoid a recession and have a somewhat higher rate of inflation than in the recent past where it was around 2%", "score": 1, "replies": [{"body": "This is my view tbh, but I think the markets will continue to tank before we get there. 3% inflation isn't really that concerning it's just whether the FED can get us there without a recession -- which I think they probably can assuming the RU/UA conflict doesn't escalate further and the China lockdowns come to an end relatively soon. So a lot of ifs, but I think that's probably what's most likely to happen.\n\nThe FED would prefer to have 2% inflation, but they're unlikely to risk a recession for it. If they can get it down enough that they don't have to worry about runaway inflation expectations then my bet is that the doves will start to come out -- especially if there are signs of economic weakness in the US or a recession in Europe. Plus it's not like the FED hits that 2% target perfectly anyway. We've had sub-2% inflation plenty of times in recent years so I don't see why a 3% would necessarily be any more concerning so long as it wasn't trending up.\n\nOne of the problems as an investor right now is there is very little certainty in any outcome. Even if a recession isn't most likely scenario if the market suspects there is a 30-40% chance of one in the 12 months it's still going to drop until it's clear a recession isn't on the table. Betting on any outcome is probably a mistake, even if someone has to be right. Near term market will probably continue to see selloffs followed by strong rallies as sentiment shifts to and from recession to growth scare and back again.", "score": 2, "replies": []}]}, {"body": "1 or 3 I think are likely and possibly both happen. My money is on 3 first then 1 following.", "score": 1, "replies": []}, {"body": "Definetly not the last, mayby second?", "score": 1, "replies": []}, {"body": "Number 3. Over the past decade (post 2008) there has been loose monetary policy. That has led to massive asset bubbles everywhere (real estate, tech, crypto) you see fueling more and more unproductive investment. Very little productive investment has taken place. The only way to keep this charade going was with very low interest rates. But inflation means interest rates have to rise. But much of the money is locked into unproductive investments which will not materialize when you go calling upon them. The rot runs deeper than real estate or crypto bubbles. We are headed for a recession.", "score": 1, "replies": []}, {"body": "He can’t and won’t do jack", "score": 1, "replies": []}]}
{"title": "Implications: $TSLA 's neural net will run on #Dojo 5-10x faster than on #GPUs. Major advantage for Tesla, learning overnight vs. every week; but Dojo is no threat to $NVDA's #GPU: Too inflexible for others to adopt, and will always materially lag GPUs in terms of ecosystems. 5/6", "selftext": "", "id": "u3xt7j", "created_utc": 1649989775.0, "score": 64, "upvote_ratio": 0.93, "num_comments": 16, "comments": [{"body": "If Dojo's only achievement is to improve NN training speed by a factor of 5-10, then it will be an incredible investment. It doesn't need to match or beat NVDA in terms of ecosystem, it just needs to provide a simple way Tesla to quickly iterate on their AI projects (FSD, and bot).", "score": 36, "replies": [{"body": "DOJO is also their first iteration of a NN Supercomputer, lessons learned will go into DOJO2", "score": 3, "replies": [{"body": "Right. They explicitly said during AI day that they were already working on V2", "score": 2, "replies": []}]}]}, {"body": "Dojo is not inflexible the architecture can run any ML training model. It is in fact agnostic to ML model and has enough hardware logic to run general purpose application. The only limitation is that it has slow access to system memory and system storage so the workload must fit in the SRAM or it needs to be partitioned to the multiple SRAM blocks of adjacent cores. This means database application can run on Dojo but it will be very slow. Fluid simulation and other similar application could run on DOJO not as efficient as ML application but it could run fast enough to be competitive with other HPC hardware.", "score": 3, "replies": []}, {"body": "Tesla’s neural net is created/trained on Dojo.  It RUNS in the car.", "score": 5, "replies": [{"body": "DoJo is not currently training shit", "score": 3, "replies": [{"body": "True statement. Elon suggested dojo may go into use this summer but prob won’t reach GPU parity for about a year. I assume that means they’ll be tweaking configurations and reworking code on both sides to optimize.", "score": 2, "replies": []}, {"body": "Let me explain in greater detail so you understand.  The neural net runs on the inference chip that is in the car.  It is trained at headquarters where the supercomputer resides.  EVERYONE knows that Dojo is in development and that the primary supercomputer being currently used is NVIDIA, so your comment provided zero value.\n\nDo you now understand the gist of my point, or do you need further clarification?", "score": 0, "replies": [{"body": "So had I said \"Dojo is not currently training shit, the NVIDIA GPU cluster is\" would that have prevented your panties from getting in a bunch or would that have been redundant since EVERYONE knows Dojo is in development and the team has not switched over to using it?", "score": 1, "replies": [{"body": "Doesn’t matter.  You’re missing my point entirely.  Pierre Ferragu incorrectly stated the neural net will run on Dojo, when in fact it will run on the neural net inference chip.\n\nYou apparently did not understand my point and jumped in with an observation everybody already knows.\n\nBottom line is that you’re adding zero value to the conversation.", "score": 1, "replies": []}]}]}]}]}, {"body": "You don’t get it. It’s about communication bandwidth. Tesla doesn’t take on just ventures without there being both necessary in terms of performance and financially beneficial to the company. No one has a communication fabric of this capability. Also the processor is general purpose, not specialized as stated.", "score": 1, "replies": []}, {"body": "I feel like we’ve been hearing for years about how great Dojo is going to be.   When does this thing actually start working?  We need it badly FSD beta hasn’t improved at all.", "score": -11, "replies": [{"body": ">FSD beta hasn’t improved at all.\n\n... Since last week?", "score": 10, "replies": [{"body": "No for many months", "score": -2, "replies": []}]}, {"body": ">When does this thing actually start working?\n\n[This was what Elon said in Q4 earnings](https://www.fool.com/earnings/call-transcripts/2022/01/27/tesla-tsla-q4-2021-earnings-call-transcript/)\n\nDojo appears to be on track for doing something useful in the summer this year. The -- I think the threshold that really matters is at which point -- when does it become more competitive than a GPU cluster for training? And, obviously, the GPU cluster is getting better, so it's a moving target.\n\nBut that's the goal I've set for the team is the -- if the FSD team running our GPU supercluster needs to tell me that they want to use Dojo instead. That's -- where -- that's the, you know, obvious sort of threshold. And I don't know when that will -- I wouldn't say like success is 100% certain here. I think, we just generally want to overestimate meeting options and underestimate ourselves.\n\nBut it does seem as though we might pass that threshold next year with Dojo if, you know, we execute well. Dojo is not needed for full self-driving but it is a cost optimization on creating vast amounts of video data. Cost optimization also, a rate of improvement. You know -- so if you can train models faster, have a shorter iteration interval then you can make progress faster.\n\nSo not everything can be distributed to zoning GPUs. There's some elements of serialization there. So -- and then if Dojo is competitive, then, you know, it does seem like the kind of thing where we would offer it to other companies that want to do neural net training. Those are very much a neural net training optimized system.\n\nYou know -- but in theory, it should be better than a generalized computing platform or say, GPUs, which were not really intended for, you know, the pixel shader. It is not directly intended for optimizing training of neural networks. They just happen to work better than CPUs in most cases. So we should think like Dojos like a giant ASIC optimized for neural net training, especially video, or video-like things.\n\nBut as -- like I said, we're not saying for sure Dojo would succeed. We think it will. We would encourage those who think this is an interesting problem to join Tesla, and -- yeah.", "score": 6, "replies": []}]}]}
{"title": "Leak: “Today Tesla China had a meeting with suppliers around Shanghai to ask if there are difficulties in resuming production on 4/18. So Giga Shanghai will resume work, maybe next Monday, definitely next week.”", "selftext": "", "id": "u44ffl", "created_utc": 1650015855.0, "score": 85, "upvote_ratio": 0.97, "num_comments": 13, "comments": [{"body": "With army currently in Shanghai trying to maintain order I'm only going to believe it when it actually happens.", "score": 21, "replies": [{"body": "Maybe, but restrictions on populace are different from restrictions on industry. Tesla is a high profile prestige project for the Shanghai leadership.", "score": 13, "replies": [{"body": "And strategically China benefits the most from electric cars replacing oil while also relying on global trade to make them.\n\nIt's a good example of a trade deal where both sides genuinely benefit.", "score": 16, "replies": [{"body": "Exactly - a big net positive, instead of the frequent zero sum outcome.", "score": 5, "replies": []}]}, {"body": "Even really wealthy people had to beg for food.\n\nI don't think China leaders give or care about a prestige project.", "score": 2, "replies": []}, {"body": "The factory worker is the populace isn't it?", "score": 1, "replies": []}, {"body": "This is really the battle of the Jiang Ze Ming faction (Shanghai capitalists) versus the Xi Jin Ping group. Look up Shanghai faction on wiki!", "score": 1, "replies": []}]}]}, {"body": "Also this tweet suggests the earlier rumour of may 15 restart date was fake\n\nhttps://twitter.com/dkurac/status/1514895250820857858?s=21&t=dwWosHHa9ZHyKbKPHzfVVQ", "score": 9, "replies": [{"body": "The only source was GJ", "score": 4, "replies": []}]}, {"body": "I guess the white suits beat all the covid out of people?", "score": 3, "replies": []}, {"body": "I hope we get more down days. Accumulating at lower prices.", "score": 0, "replies": []}, {"body": "![gif](giphy|lptjRBxFKCJmFoibP3|downsized)", "score": 1, "replies": []}, {"body": "bloomberg radio was reporting that workers are getting calls to get ready to go back to work next week.", "score": 1, "replies": []}]}
{"title": "Daniel Ives from Wedbush just updated his price target of TSLA to 3000$", "selftext": "Breaking news: Daniel Ives from Wedbush just updated his price target of TSLA to 3000$ on Elon Musks Twitter offer. Ives said \"TSLA is now a social media tech robot factory producing green company\" and should trade at 10x multiple of expected 2045 earnings where he expects the company to produce 100 million cars per month that also functions as robots being able to solve any task given to them including flying to the outer rim of the solar system to harvest rare metals that the owner can sell for profit\n\nCredit. I saw this on yahoo finance board.", "id": "u47wq5", "created_utc": 1650028770.0, "score": 23, "upvote_ratio": 0.74, "num_comments": 11, "comments": [{"body": "Elite Pump & Dump incoming", "score": 18, "replies": []}, {"body": "We’ve gotten to a point where I can’t differentiate satire from fact.", "score": 14, "replies": [{"body": "\"100 million cars per month\" lmao", "score": 6, "replies": [{"body": "Crunched some numbers… the world currently makes ~80 million cars per year and this grows 1.3% yearly. At this rate, we’ll be making 100m cars *per year* in 2045. \n\nSo the auto industry would need to 12x in 25 years, and Tesla would have to own the whole market. \n\nGot it.", "score": 2, "replies": []}]}]}, {"body": "Saw this in my deep mind in the back of my head, space x merges with Tesla and neurolink dogs will go to Mars , soon we enslaved the monkeys to Mars to mind for gold , price target $ 100000", "score": 5, "replies": []}, {"body": "Dan Ives is a Giga Chad ![img](emote|t5_2th52|8882)", "score": 3, "replies": []}, {"body": "He’s gonna buy Twitter and put the Tesla “T” in front… \n\nWe thought Bezos would take over the world but Elon said hold my beer", "score": 5, "replies": []}, {"body": "Literally this dude is the absolute worst analyst in this country.  Either retarded or pumping and dumping.  Go read just his calls since January.", "score": 2, "replies": []}, {"body": "Guy is a hardcore tesla bull, priced in", "score": 1, "replies": []}, {"body": "Jacked to the titts!\n🚀🚀🚀", "score": 1, "replies": []}, {"body": "Is it bad I can't tell if this is satire. Dude thinks if he says \"supercycle\" enough he can pump anything.\n\n10/10 either way", "score": 1, "replies": []}]}
{"title": "ARKK invest updates Tesla price targets", "selftext": "ARKK has released a new 2026 Tesla PT based off their Monte Carlo model. They have a new 2026 PT of $4641 per share and a bull case of $5784 per share. Tesla has earnings next week on 4/20/2022. At 4835 per share Tesla would be a 4 Trillion dollar company.  As of 3/31, Tesla remained the only holding in ARKK invests top 10 holdings that wasn’t down more than 10% YTD.", "id": "u499es", "created_utc": 1650032837.0, "score": 13, "upvote_ratio": 0.81, "num_comments": 16, "comments": [{"body": "So is she saying we will have 400% inflation?", "score": 13, "replies": []}, {"body": "I'd fuck cathie in the 🧠", "score": 9, "replies": [{"body": "I don’t think she has one.", "score": 9, "replies": [{"body": "Remind me in one year how ARKK is doing. Meanwhile show me the 5 year chart.", "score": 6, "replies": []}]}]}, {"body": "Why would anyone pay attention to price targets?", "score": 2, "replies": [{"body": "A gauge of sentiment?", "score": 1, "replies": [{"body": "Haha true enough.", "score": 1, "replies": []}]}]}, {"body": "Unironically retarded", "score": 2, "replies": []}, {"body": "i didnt go into amc cause it felt way to retarded maybe this is my chance to redeem myself in retardation", "score": 1, "replies": []}, {"body": "Maybe if there is a reverse stock split.", "score": 1, "replies": []}, {"body": "Wow! I wonder what prices will reflect once this gets passed onto the consumer. I hope they do an update on the Pros/Cons of this decision in a year.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/Economics/comments/dczxrr/this_california_city_just_voted_to_give_a_30/f2db21a/)*", "score": 0, "replies": []}, {"body": "With stock split maybe? I mean if it’s a 5-1 and then goes up a bit I dunno but me and my calls are here for it.", "score": -2, "replies": []}, {"body": "Wow. I own FB, my monte carlo method shows PT of 4000 by the next earnings", "score": 1, "replies": []}, {"body": "You’d be better off going to Monte Carlo than following anything the Ark idiots say. Arkiots? Is that a phrase yet I might start using it", "score": 1, "replies": []}]}
{"title": "Elon Musk does not like the fact that his tweets are scrutinized by regulators. He was subpoenaed by the SEC in November after he asked his Twitter followers if he should sell 10% of his Tesla stock. Then, he accused the SEC of \"harassment\" and Twitter not allowing free speech.", "selftext": "[deleted]", "id": "u49fmz", "created_utc": 1650033323.0, "score": 34, "upvote_ratio": 0.95, "num_comments": 11, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|39|**First Seen In WSB**|1 year ago\n**Total Comments**|77|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=u49fmz)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=u49fmz)", "score": 1, "replies": []}, {"body": "This whole sub bitches about billionaires fucking with GameStop, but are perfectly cool with this billionaire fucking with another company.", "score": 14, "replies": [{"body": "The one difference is that lots of common people have also made money when Elon musk uses twitter to influence stocks and crypto. Whereas when it comes to GameStop, only the big dogs make the money. Musk is all good in my book.", "score": 4, "replies": [{"body": "My guy, for every dollar you made with Elon must, some other dude lost it.", "score": 2, "replies": []}]}]}, {"body": "Little do we know that Elon is 10 steps ahead in this. \n\nAlot of fuckery is about to unfold before our eyes. Enjoy the show.", "score": 8, "replies": []}, {"body": "Gonna trigger a bunch of butthurt soy boys with this.  Tell us where daddy elon touched yall....on second thought, noone cares. Let's go elon!", "score": 10, "replies": [{"body": "Dude is the original short buster, how can anyone hate that? LFG!", "score": 3, "replies": []}]}, {"body": "\\>get subpoena.  \n\\>scream \"HARASSMENT!\"", "score": 3, "replies": []}, {"body": "Why would he be?  He has made a lot of money by manipulating stocks through tweet.", "score": 1, "replies": []}, {"body": "Because the SEC is corrupt…", "score": 1, "replies": []}]}
{"title": "How will NETFLIX close following their Earnings Report on April 19?", "selftext": "NFLX earnings is 04/19 aftermarket. Answer will resolve to NFLX's 04/20 day performance.  \n\n[View Poll](https://www.reddit.com/poll/u4axjo)", "id": "u4axjo", "created_utc": 1650037525.0, "score": 9354, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Hahaha - 23% ouch", "score": 21, "replies": [{"body": "Turns out losing 200,000 subscribers is bad when people expected you to gain 2 million subscribers!", "score": 7, "replies": [{"body": "That's what they get for not being in wsb math club . F em 🤣🤣🤣🤣", "score": 4, "replies": []}]}]}, {"body": "I felt like this was a given of -7+…", "score": 3, "replies": []}, {"body": "resolve|15179496", "score": 5, "replies": [{"body": "W", "score": 1, "replies": []}]}, {"body": "Redditors, I think this is the beginning of a beautiful prediction", "score": 1, "replies": []}, {"body": "This based off 4/20 open or 4-19 close?", "score": 1, "replies": [{"body": "Depends on how it closes Tomorrow", "score": 1, "replies": []}]}, {"body": "Lulz oof", "score": 1, "replies": []}, {"body": "Big oof", "score": 1, "replies": []}, {"body": "Fk", "score": 1, "replies": []}, {"body": "Nailed it baby", "score": 1, "replies": []}]}
{"title": "Will TESLA's stock close UP/DOWN more than $42.00 the day following their earnings?", "selftext": "TSLA's earnings is 04/20 aftermarket. Answer will resolve to YES if TSLA's stock price close on 04/21 with greater than +/- $42.00 movement compared to 04/19 close price. \n\n[View Poll](https://www.reddit.com/poll/u4f7w5)", "id": "u4f7w5", "created_utc": 1650049357.0, "score": 11439, "upvote_ratio": 1.0, "num_comments": 15, "comments": [{"body": "Up or down and the options are yes or no. \n\nSo no means it lands on 42 exactly?", "score": 4, "replies": [{"body": "So \"No\" is between and includes  -$42 to +$42 , Anything else is a yes", "score": 5, "replies": [{"body": "Oh I’m braindead. This makes sense", "score": 9, "replies": []}]}]}, {"body": "OP is a moron.", "score": 6, "replies": []}, {"body": "I got a straddle on this so it better", "score": 2, "replies": []}, {"body": "I wondered if Saudi Arabia setup Musk when he wanted to take Tesla private? \n\nNow people are crying about suiting Musk because of violating reporting rules. \n\nNo one is crying because apparently Saudi Arabia has flaunted all sorts of reporting rules all over secuities, but if Musk gets this he can screw Saudi Arabia not just out of their long term hold position in Twitter, but may also blow the whistle on Saudi Arabia secret holdings and deals they didn't report.\n\nThis is going to get messy. Wonder how long until Saudi Arabia agrees to side with Russia if Putler will just kill Musk?", "score": 1, "replies": [{"body": "Why would Putin want to kill Elon?", "score": 1, "replies": [{"body": "Elon challenged Putler to a real life claymation death match.\n\nWhere have you been?", "score": 1, "replies": [{"body": "Clearly not where I ought to have been.", "score": 1, "replies": [{"body": "But where was your money?\n\n![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}]}]}]}, {"body": "resolve|15183566", "score": 0, "replies": []}, {"body": "Whoomp! There it is! Play has begun.", "score": 1, "replies": []}, {"body": "boy oh boy did i make dem gainz", "score": 1, "replies": []}]}
{"title": "It feels like Groundhog day in here.", "selftext": "There used to be a time when this sub wasn't: \n\n1) Snippet of news articles with Jim Cramer saying X but the joke, guys, is that it's in fact the opposite?! Get it? It's the exact opposite of what this man is saying! That's the joke! Holy fuck, isn't it absolute genius. It was funny the first time so it'll continue to be funny the 39847293492147th time! Right? Right?! \n\n2) Some fucker that invented Tesla and is now buying Twitter. Same problem as above. I really haven't seen enough memes about this guy. There needs to be MORE, I say. More memes of the same exact drivel and recycled jokes, because I just like you, am truly brain dead and unoriginal. Who is this Elon guy? Nobody has heard of him, ever. What's a twitter?\n\n2) GME. Apes. GME and Apes. Apes and GME. I'll let you in on two huge secrets. First, there exists no other ticker in the market apart from GME. It's only GME. Except for when there's TSLA, or AMC, or for some fucking reason, TLRY, but even then it's only GME. GME gme GME. The other secret is that you're all retarded.\n\nLife is already repetitive and mundane as is. I used to come here for variety and intelligent discussion, amidst the actually funny jokes. Don't get me wrong, I still enjoy the once in a rare moon masterpiece of a gif someone churns out. But you gotta [diversify](https://c.tenor.com/GJ19mHTZJ6EAAAAC/gza-you-need-to-diversity-you-bonds.gif) the jokes. Diversify your jokes like you're supposed to diversify your portfolios.", "id": "u4gws5", "created_utc": 1650054145.0, "score": 28, "upvote_ratio": 0.79, "num_comments": 15, "comments": [{"body": "sub is dead just accept it , whenever you need to feel smart and not as retarded as you really are come take a peek, jerk off or whatever and leave", "score": 16, "replies": [{"body": "Only since the poors made it on gme. Silence the masses", "score": 4, "replies": []}]}, {"body": "diversify?", "score": 3, "replies": []}, {"body": "Diversify , let’s not just lose money on AMC, GME, TSLA. We can do better less lose money on entire market.", "score": 2, "replies": []}, {"body": "Instructions unclear buying more AMC", "score": 2, "replies": []}, {"body": "Ban", "score": 1, "replies": []}, {"body": "Got it! will make sure to do the opposite and keep the same jokes.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Lost causes, this entire place", "score": 8, "replies": []}]}, {"body": "Isn’t this a sub for gamblers?", "score": -1, "replies": [{"body": "gambler doesnt automatically mean degenerate humor goblin", "score": 4, "replies": []}]}]}
{"title": "Elon Musk’s bid for Twitter spells trouble for Tesla investors — here’s why", "selftext": " For [years](https://www.newconstructs.com/more-broken-promises-from-tesla/), Elon Musk has used hype to prop up Tesla’s stock. It’s worked so well that other companies have followed his lead. But now we think the world has seen that the emperor has no clothes. \n\n \n\nThe attempted Twitter [**TWTR,** **-1.68%**](https://www.marketwatch.com/investing/stock/TWTR?mod=MW_story_quote) takeover is yet another example of Musk bullying his way into what he wants and underscores how his superstar status cannot always convince people to overlook his irreverent, reckless and potentially illegal behavior. As the [recent lawsuit against](https://www.marketwatch.com/story/twitter-shareholder-sues-elon-musk-over-delayed-disclosure-of-his-stake-11649805803?mod=home-page&mod=article_inline) Musk shows, he is not completely immune from the consequences of his actions.\n\nTherefore, despite recent gains, investors should consider selling Tesla [**TSLA,** **-3.66%**](https://www.marketwatch.com/investing/stock/TSLA?mod=MW_story_quote) before institutional money bails.\n\n&#x200B;\n\n[https://www.marketwatch.com/story/elon-musks-bid-for-twitter-spells-trouble-for-tesla-investors-heres-why-11650024190?siteid=yhoof2](https://www.marketwatch.com/story/elon-musks-bid-for-twitter-spells-trouble-for-tesla-investors-heres-why-11650024190?siteid=yhoof2)", "id": "u4hgr5", "created_utc": 1650055773.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 19, "comments": [{"body": "Marketwatch = Click bait opinion articles.", "score": 19, "replies": [{"body": "As all their articles. Trust me bro articles. Not investigation and believing that choosing one random guy from a hedge fund with the investment performance of a hamster.", "score": 1, "replies": []}]}, {"body": "Lulz. Trash", "score": 14, "replies": []}, {"body": "The SEC targets musk on everything he does. Plus what did the SEC do about the corruption for GME shutdown? Nothing. Some of the stuff he does is sleazy aka buying his brother's bankrupt company (solarcity)", "score": 10, "replies": [{"body": "Brother?  Elon thought up SolarCity while at BurningMan and told his cousins to do it.  He took it over when the going got rough... it will pay off longer term.", "score": 2, "replies": []}]}, {"body": "Stfu no it doesn’t", "score": 7, "replies": []}, {"body": "Take it easy Cathie Wood", "score": 5, "replies": []}, {"body": "Lol these clowns in the main stream media, 'Elon buy back at a lower price' , so he and retail can get diluted more?\r  \n\r  \nSuch grift, much wow", "score": 3, "replies": []}, {"body": "OP is holding puts clearly.", "score": 2, "replies": []}, {"body": "TSLA is the ingredient the nasdaq needs for a truly epic crash. Elon 💎👐 is what got it this far. If he sells to get cash to swing around, TSLA stock comes crashing down. Their valuation has been absurd for years, but so is holding that stock like Elon has.", "score": 3, "replies": []}, {"body": "He would have to sell 50bill of tesla to buy twitter \nIt will be wild", "score": 1, "replies": []}, {"body": "ITT: Musk simps who wish he would just give up the charade and sell his bath water.", "score": -4, "replies": []}, {"body": "So funny how all the muskrats just deny all these claims outright. Hope they hold the bag forever, it will be (comparatively)worthless in 5-6 years tops.", "score": -6, "replies": [{"body": "Eh, it's like AAPL or MSFT - when the 'founder' wanders off the company value will go up 2-5 times over the next decade.  Like last October when Elon STFU and let the adults handle the earning call, the stock took off.", "score": 2, "replies": []}]}, {"body": "Marketwatch, Ha ha... PROFF or BAN!", "score": 1, "replies": []}, {"body": "he can loan against his shares", "score": 1, "replies": []}, {"body": "Lol..marketwatch", "score": 1, "replies": []}]}
{"title": "Tim Apple Cucks the Zuck", "selftext": "", "id": "u4jldt", "created_utc": 1650061975.0, "score": 39, "upvote_ratio": 0.81, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|27|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=u4jldt)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=u4jldt)", "score": 1, "replies": []}, {"body": "I love seeing Zucc get cucked but I think he might like it too", "score": 11, "replies": [{"body": "Island of Kauai resident here. Mark knows who I am. Speaking from experience, he does, in fact, like it.", "score": 3, "replies": []}]}, {"body": "Tim Apple? Isnt that what trump called him", "score": 7, "replies": [{"body": "I ONLY DID IT TO SAVE TIME!!!  something that the Radical Left knows nothing about!  he was there, and I said Tim, and he said yes, and then I said Tim Apple meaning Tim Cook from Apple but I had already said the name and I'm so good when it comes to saving time and I just simply and very innocently said Tim Apple, which again saved a lot of time let me tell you,  and the Fake News had a heart attack.   \"oh, Trump doesn't remember the name!\" when I remember names, I remember all the names.  I remember every single name of every person that I've ever met.  my IQ is like at genius levels, and don't forget, I had a perfect score on the Presidential Test.  Obama couldn't do it, neither could George Junior.  I'm probably the smartest person ever in the history of our World!!!", "score": 0, "replies": [{"body": "Wow, such a rant. A yes would have sufficed.", "score": 3, "replies": []}]}]}, {"body": "Lizard men are cold blooded so Tim Apple will have an advantage if he cranks that AC", "score": 4, "replies": []}, {"body": "Tim probably would too.", "score": 2, "replies": []}, {"body": "Tim “the hypocrite” Cook. I love how this guy talks shit about other people considering he allows contractors for Apple to be treated like 3rd class citizens.", "score": 6, "replies": []}, {"body": "Meta stock is so cheap right now. Oversold.", "score": 2, "replies": [{"body": "Meta is a total piece of shit company.", "score": 8, "replies": [{"body": "Based on what?  They are a cash machine. Instagram, WhatsApp, Facebook. Don’t have to like them but they are generating profits and are in front of half the world population.", "score": 6, "replies": [{"body": "Have you considered that I’m deeply misanthropic? Therefore, piece of shit company. I saw a person say something I found SILLY and NON-AUTHORITATIVE. It’s all over.\n\nSeriously what the fuck is income I’m just here to make market-wide price predictions based on my residual anger at Justin Beiber’s fame from when I was a kid.", "score": 2, "replies": [{"body": "In that case… carry on.", "score": 2, "replies": []}]}, {"body": "Their main demographic also subscribes to AARP.", "score": 1, "replies": []}]}]}, {"body": "Jimmy Coke Cramer?", "score": 1, "replies": []}]}, {"body": "Who TF is Tim Apple?", "score": 0, "replies": []}, {"body": "No way this will backfire, greedy shites", "score": 1, "replies": []}]}
