{"title": "Time to sell TSLA!? And yes I am the one that lost a lot by using margin", "selftext": "After loosing almost half of my investment by using margin and posting it here, I sold all the shares with the plan to buy them back after they go down a bit.\n\nWell I made almost 20% until today. Time to sell? How much further can we ride that green wave? Nobody here has a Time Machine I am aware of that. But I‘d appreciate some feedback if that is okay!\n\nAnd isn’t the wave slowing down a bit already? \nMy plan would be selling and then buying them back as they go down again.\n\nI really had a lucky timing with the buyback. Am I stretching my luck?\n\nEdit: some people did read into the post that I am using margin again - which I won’t/don‘t.\nLearning from greedy mistakes is already a closed chapter thanks", "id": "tjlhof", "created_utc": 1647895316.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 62, "comments": [{"body": "Half the sub (including myself) will tell you Tesla is valued on ridiculously rosy forward projections, and that up should take profit while you can. (Especially with the margin)\n\nThe other half will tell up Tesla has incredibly rosy growth prospects, and that you’d be a fool not to hold.\n\nMake your own decision.", "score": 34, "replies": [{"body": "One of those two groups are completely full of shit. Are you smart enough to figure out which?", "score": 12, "replies": [{"body": "Stylistically, it’s not the type of investment i want. If I’m wrong and it moons? Cool. My index money will benefit. If I’m right and if crashes to reality? Cool. It’s too expensive to short.\n\nIt’s like watching the Superbowl every year. I’m a Cowboys fan, so i have no dog in the fight. But I sit on the sidelines and think I know the better team ahead of time.", "score": 8, "replies": []}, {"body": "Both are full of shit, for long term results ETF's are better.", "score": -4, "replies": [{"body": "One side is much more realistic than the other.", "score": 3, "replies": []}]}]}]}, {"body": "Trying to time the Market while at the same using Margin is just one big recipe for disaster.", "score": 15, "replies": [{"body": "Using margins is one step shy of options.\n\nOptions *require* timing...  \n\nTo make a small fortune, start with a big one.", "score": 3, "replies": [{"body": "not all option strategies require timing the market", "score": 3, "replies": [{"body": "So... Buy and hold?   How?", "score": 1, "replies": [{"body": "by theta decay, by selling option premium you are taking the opposite trade of those who buy options when you lose money on options by being wrong about market timing who do you think is getting that money?", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "And you’ll never over perform it.", "score": 1, "replies": []}]}]}]}]}, {"body": "If I have to choose, I would choose long option over margin any time. Main reason is that it is impossible to get in debt with long options. (not talking about naked calls/puts.)", "score": 1, "replies": []}]}]}, {"body": "I’m holding Tesla the same horizon I’m holding VTI and Amazon.", "score": 8, "replies": []}, {"body": "It hit 1.200 at the beginning of 2022, now gas/oil prices are soaring, everybody installs solar panels and buys EVs.  \n\nI bet on growth. No options, just some stocks, but I will not sell until 1.500 at least.", "score": 10, "replies": [{"body": "I don't doubt it'll make it back to $1200, but I'm sure it'll be a slow ascend.", "score": 2, "replies": [{"body": "Already $945", "score": 1, "replies": [{"body": "$985 😂", "score": 2, "replies": [{"body": "Who knew? I wish I would have sold some puts at $760.", "score": 1, "replies": []}]}]}]}, {"body": "I prefer a hybrid option of something like the RAV4 prime. Runs on gas and 60 miles on a charge. Great for ppl that have a short commute to work.\n\nMy mistake. It is 42 miles", "score": 1, "replies": []}, {"body": "Tesla doesn't have a car the masses can afford. They also don't have the capacity to even keep up with current orders. There is zero chance people switch to Tesla for 5$ a gallon.", "score": -4, "replies": [{"body": "What does that matter as long as there are enogh masses that can afford all the cars they can build (now and for the foreseeable future)?\n\nTesla will build an affordable car when that market starts to dry up (at 30% profit margin they can afford to). Right now it would be just a stupid business decision.", "score": 4, "replies": [{"body": "It matter in relation to the comment I was responding too.", "score": -1, "replies": []}]}, {"body": "This. Honestly I wonder how many peeps that said petrol is too expensive now time to get an EV actually dumped their petrol car and actually went out to buy an EV. As if anyone decides to just switch cars because petrol cost increased abit.", "score": -2, "replies": [{"body": "It is making me want my next car to be an EV", "score": 6, "replies": []}, {"body": "No, but people considering switching cars either way in this period will surely have a look towards EVs and with the popularity Tesla enjoys it will be one of the first options.", "score": 2, "replies": []}]}]}, {"body": "They get to 1,500 then they are about a 1.8 Trillion dollar company 😂😂, if they get to that in a year then the P/E would be over 1k", "score": -5, "replies": [{"body": "This assumes that everything else besides stock price remains the same. Tesla is already expanding in speeds not seen before.", "score": 2, "replies": []}]}]}, {"body": "I am the biggest bear when it comes to tech preferring to invest in commodities and dividend stocks.  But with that said, the Nasdaq is sitting on it's 50 DMA on the 3 month charts.  It could easily find support there as fall back to lower levels in the beginning of March.  This really is a make or break time for tech stocks.  If you are bullish on them long term this would not be the time to sell unless we get confirmation that the Nasdaq 50 DMA is not providing support.", "score": 5, "replies": []}, {"body": "Stop buying on margin and trying to time the market. It is clear that you do not know what you are doing. \n\nRead lots of books like \"One up on Wall Street\" and \"Margin of Safety\" and mostly put your money into index funds until you learn a lot about stocks.", "score": 6, "replies": [{"body": "> index funds until you learn a lot about stocks.\n\nETF's outperform 80% of fund manager in one year and 95% in two years, you can guess how much they outperform after 3 years. No amount of learning will make stocks better over the long run.", "score": 0, "replies": []}]}, {"body": "Cybertruck and IA from robot will take this stock 1200 in no time. I hold a little more.", "score": 3, "replies": [{"body": "AKA, minecraft truck and silver man group", "score": 1, "replies": []}]}, {"body": "Tsla will probably hit 2k by the end of the year.", "score": 10, "replies": [{"body": "Lmao 2trillion dollar market cap 😂", "score": -3, "replies": []}]}, {"body": "Puts on Tesla using margin... Now this is the way, ha!", "score": 2, "replies": []}, {"body": "Good, you're a fifth of the way there. Just 80% more to go!", "score": 2, "replies": []}, {"body": "I think it will hit $1,000 by Friday.", "score": 7, "replies": [{"body": "Wow, now we are getting day-by-day predictions.  This sub is a wealth of information.", "score": 8, "replies": [{"body": "RemindMe! Friday", "score": 1, "replies": [{"body": "Whether you are right or wrong is irrelevant to whether you know what you are talking about.  If I say it's going to rain on Friday because my dog licked his ass three times this morning, my method doesn't become justified if it actually rains.", "score": 2, "replies": []}, {"body": "I will be messaging you in 3 days on [**2022-03-25 00:00:00 UTC**](http://www.wolframalpha.com/input/?i=2022-03-25%2000:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/tjlhof/time_to_sell_tsla_and_yes_i_am_the_one_that_lost/i1lkcyr/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Ftjlhof%2Ftime_to_sell_tsla_and_yes_i_am_the_one_that_lost%2Fi1lkcyr%2F%5D%0A%0ARemindMe%21%202022-03-25%2000%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20tjlhof)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Already hit 995 today (Tuesday).", "score": 2, "replies": [{"body": "This aged well lol", "score": 1, "replies": [{"body": "1009 today", "score": 3, "replies": []}, {"body": "Max of Tuesday 997.8", "score": 2, "replies": []}]}]}]}, {"body": "There cutting the ribbon on the German plant tomorrow. I'd hold for at least a few more days", "score": 3, "replies": []}, {"body": "I've been buying and holding Tesla since 2019. It's run up a lot since then, but you'd be crazy to sell Tesla even at today's price. They're opening 2 new gigafactories while beating analyst expectations every quarter. People are still valuing Tesla as just a car company rather than a technology company, and that's why the bears will continue being proven wrong no matter how much Tesla hate they spread.\n\nIf you look at their advances in energy, robotics, and AI, plus the speed that they're ramping, it's clear they have enormous growth coming this decade.", "score": 3, "replies": []}, {"body": "I'm bullish on Tesla because my inside people tell me they are working on Tesla Coils for home defense.  \n\n\nGame. Changer.", "score": 1, "replies": []}, {"body": "Trading on margin will lead to the closing of your account", "score": 0, "replies": [{"body": "That’s a lie— efficiently trading on margin can actually put a person years ahead of another who’s using a cash account.", "score": 6, "replies": [{"body": " I meant he will end up paying for the borrowed money lost, which could lead to losing all his money. Hence account closed", "score": 2, "replies": [{"body": "Dude that’s still not how investing on margin worked. I closed DOCU at a $200 loss my account still open. All he has to do is make sure his debt to equity is fine and he’s able to bring in more than he pays in interest. \n\nWarren Buffett brokerage was a margin account and he utilized it like a 3%  mortgage loan leveraging 20% of his portfolio. You know not what you speak. \n\nWhat you’re saying is what would happen to you if you invested on a margin. It’s actually people out here doing what you say and are achieving the opposite you speak of.", "score": 1, "replies": []}]}]}]}, {"body": "Sell.  With talks of recession and the nickel/Russia thing all EVs are going to take another hit", "score": 0, "replies": []}, {"body": "In some not distant time Tesla will be thought as another car manufactuer similiar to DeSota, Cadillac stocks. That time frame is not far away.", "score": -1, "replies": []}, {"body": "I was planning to buy 50 shares of tsla on a margin but I wake up too late every day.", "score": -6, "replies": []}, {"body": "short term bearish", "score": 1, "replies": []}, {"body": "Only if you like money", "score": 1, "replies": []}, {"body": "You’re asking for gambling advice.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "tjcwq9", "created_utc": 1647872438.0, "score": 104, "upvote_ratio": 0.87, "num_comments": 61, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|14|**First Seen In WSB**|1 year ago\n**Total Comments**|471|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/tf29r7/dd_hedgefunds_best_kept_secret_until_now/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tjcwq9)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tjcwq9)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 31, "replies": [{"body": "Easy money selling covered positions to degenerates. \n\nI may not make millions but my ror is better than average.", "score": 10, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}]}, {"body": "and he is up 80%. # options", "score": 3, "replies": []}]}, {"body": "The ceo literally sold the top and basically said there’s a chip shortage and yet you think this already overvalued stock is going higher?", "score": 27, "replies": [{"body": "The CEO literally had $7 stock options expiring to exercise... and now owns more stock.  Leave it to WSB to keep parroting this.", "score": 7, "replies": []}, {"body": "Look, I understand a lot of people thinks it's an overpriced stock. But, just look how much time people wait in line to buy a Tesla vehicle. They sell everything they build, and they are opening two new factories soon, pushing their number of cars built per month even higher in the near future withough extra investments. They reduced debt, too. I don't know where will it hit their ceiling, but I know it wont be soon.", "score": 3, "replies": [{"body": "Teslas really aren't that nice and there is real competition coming from all angles.  I'm bearish long term.", "score": 1, "replies": [{"body": "You sound like the guys who didn't get the Apple ecosystem in 2008. Called it niche and all that.", "score": 1, "replies": [{"body": "You sound like someone who hasn't driven a Tesla.\n\nGo take an S out for a spin.  It isn't nice.  Their lead was self driving and it never happened.  The rest of the auto industry is pumping out quality, good-looking electric vehicles now.  Tesla lost their lead while promising self driving for years.  Maybe they will find success in another industry but in auto, the party is ending.", "score": 1, "replies": [{"body": "My friend group and I all own Teslas (X, Y, S) and have moved from BMWs, Benz, Audis, and Lexus vehicles.\n\nJust have different perspectives I guess. The cars from the \"rest of the auto\" industry are just not up to par.", "score": 1, "replies": [{"body": "I rented an S 2 weeks ago and regularly ride in a 3.  I was expecting much more out of the S but it felt like a Nissan.  You are drinking that musk koolaid if you actually think it is anything like sitting in a luxury vehicle.\n\nAgain, their lead is evaporating and their stock price doesn't reflect it.  Open your eyes and look at what everyone else is scheduled to release over the next couple years.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Did you watch the market lately?", "score": 2, "replies": [{"body": "Yea....  We've topped out....  Lol.  You seriously think we are going to see more runs like we saw in 2020/21?", "score": 2, "replies": []}]}]}, {"body": "You should sell it before you lose that profit", "score": 5, "replies": []}, {"body": "So buy puts on TSLA, got it.", "score": 10, "replies": []}, {"body": "Why are we looking at a \"$5k yolo\" that's literally *one* contract... wtf is this shit nowadays lmfao", "score": 9, "replies": [{"body": "Would it be more interesting for you if I bought 50 $100 contracts?", "score": 5, "replies": [{"body": "It’d be more interesting if you had more skin in the game and/or you had some DD to explain why …", "score": 2, "replies": [{"body": "[here’s my skin in the game, about 5 years investing but nothing super crazy](https://ibb.co/xmqhtxH)\n\nShorthand DD: market corrected 12% because of Russia, some may say inflation as well. However we’re at all time high for employment and has returned to precovid levels, high inflation is bad but some companies can get away with it if their consumers are price inelastic-cmg for example doubled profit from price increases alone. \n\nHigher gas prices directly from Russia sanctions means EV sales should be up for Q1 2022 which get reported on april 27. Tesla also does solar sales which indirectly get boosted from high gas prices. Supply chain issues are still prevalent, however I’m confident with Tesla’s German factory launch that they should have enough economies of scale to offset supply chain challenges. Tesla also has a small chance of splitting considering google and Amazon have set the precedent, depending on how high Tesla goes (they may want to be considered for the DOW so a split would make sense). Overall, supply chain is the only fear for Q1 earnings, but with Covid cases going down and hopefully future mutations are less deadly and more spreadable (similar to what happened to the Spanish flu) shouldn’t be a huge impact.\n\nOverall, this lead me to be bullish on Tesla, and I’m holding through earnings on hopes of a good Q1 report, but iv creep should soften any blows especially since I’m holding for a month.", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|4270)", "score": 2, "replies": []}]}]}, {"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "Bro FFS please take your profits and then buy another OTM call with winnings or do something else.", "score": 4, "replies": [{"body": "no", "score": 7, "replies": []}]}, {"body": "So...what's your problem again?", "score": 2, "replies": [{"body": "Trying to make back my profits to 20k, down 58% from portfolio peak", "score": 10, "replies": []}]}, {"body": "Tesla brought me back from the ashes when I blew up my account… I see this and now I’m thinking the void beckons yet again 🥲", "score": 2, "replies": [{"body": "TSLA giveth and taketh . God speed. If you dip your toes back in, just one toe. Not all 10.", "score": 3, "replies": []}]}, {"body": "Never heard of IV crush?", "score": 3, "replies": [{"body": "i don’t think you understand 6 month option plays. I’m actually going to make a lot of money the week of and week before their earnings report from iv going up. Day after IV will still be high", "score": 5, "replies": [{"body": "You belong here.", "score": 15, "replies": [{"body": "Have you heard the tale of Q3 earnings?  It's not a tale the WSB would tell you.\n\n\nEarnings were on Oct 20th.\n\n\nIV30 was at 35.5\n\nWithin 1-3 weeks it doubled to 70+\n\nhttps://marketchameleon.com/Overview/TSLA/IV/\n\nThe real risk is whether Elon will ramble on the call about random crap that may or may not pan out in 5+ years.   The Oct call just had the adults, not Elon, so Wall Street reacted favorably.", "score": 1, "replies": []}]}]}, {"body": "In that case it would be best to sell the option the evening before earnings, right? Implying that the reported earnings will beat expectations.\n\nI'm a complete retard and an nvidia calls bagholder, just trying to understand, please explain", "score": 2, "replies": [{"body": "Yes he’s referring to IV crush that comes the day after an earnings release because if a big move is implied that means IV will be high up until the day the earnings have been released.\n\nHowever, IV is related to the Vega Greek, how price sensitive the option price is to changes in IV, meaning that a sharp drop in IV the day after the report will cause a sharp drop in the option price.\n\nBut what the previous commenter didn’t note is that if you have a high delta increase from an after hours earning pump, meaning the price sensitivity of an option contract related to a one dollar increase or decrease of a share price (depending on Call or put), can offset the decrease in Vega.\n\nTldr: IV crush might lower my call’s price the day after earnings unless there is a move high enough that the delta increase negates the decrease in vega", "score": 6, "replies": [{"body": "Thank you very much for the explanation, I appreciate it. Now I understand why my Nvidia calls got fucked after earnings and were at 200% the day before. You explained it well to a complete idiot, I googled IV crush before, but didn't quite get it. I will consider that before tomorrows event of Nvidia, still not sure if I should hold or sell before their investor day tomorrow.", "score": 2, "replies": []}]}]}]}, {"body": "[old post](https://www.reddit.com/r/wallstreetbets/comments/tf73ci/my_last_yolo_up_22k_to_up_2k_overall_selling_day/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 2, "replies": []}, {"body": "We only see these posts come out of the woodwork during a TSLA bullrun. I wish I could see these fan boys when they get ass fucked the other 75% of the time", "score": 0, "replies": [{"body": "TSLA fuck me the right up in Jan during the run. Got greedy, but was fun. Now I'm back to selling covered calls to get some degen $ to play again.", "score": 1, "replies": []}]}, {"body": "Wsb sucks", "score": -1, "replies": []}, {"body": "Finally some Elden Ring updates.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/evilbuildings/comments/hzngf2/you_dun_fucked_up_pissing_off_ghandi/fzk2z58/)*", "score": 0, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "8/19 1000C TSLA", "score": 3, "replies": []}]}, {"body": "This will be ITM EOW. Might be worth cashing this Friday.", "score": 1, "replies": [{"body": "That is on my radar, if Tesla goes unprecedentedly up I will probably cash out. But if it’s a slow melt up over the month I’ll hold", "score": 1, "replies": []}]}, {"body": "I’d sell and reposition.", "score": 1, "replies": [{"body": "There hasn’t been a point in the past week where if I sold at the top for the day I could buy an option at a lower strike price for same expiry", "score": 1, "replies": []}]}, {"body": "Nobody tell him about IV", "score": 1, "replies": [{"body": "It expires 8/19. It’s gonna be a 4 month out call by earnings, not worried about IV and if I were, I’d just sell day before earnings", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You’re assuming that IV was significantly higher because of the FOMC which simply isnt true, IV has been around 60% before FOMC hype which is actually low for Tesla options. IV during last quarter earnings was around 160%, so the short run decrease in IV from the FOMC hype -which iv didn’t even increase that much before the meeting, would be completely offset by next quarter earnings assuming IV goes up above 100% like it usually does before earnings", "score": 2, "replies": [{"body": "So your plan was just waiting for earnings and in the meanwhile maybe the stock price would go up a bit because of FOMC?\n\nsorry if I’m not still seeing the full picture I’m just blown your play worked out so well", "score": 1, "replies": [{"body": "No, this trade was done unrelated to FOMC meeting, I’ve posted my short hand dd in the comments already.\n\nWhen I bought the call I thought we were way oversold from the outside factor of Russia and Ukraine and that the 12% drop in spy was solely related to Russia, and somewhat related to inflation.\n\nI’ve mentioned inflation isn’t entirely negative for equities, while it is detrimental for the economy. As price instability can reduce household net worth and cause a slew of issues related to employment and other factors. However, I think Tesla is in a great position for Q1 earnings, and the market has priced in most bad news. They’re launching their Berlin factory, and are fulfilling backlogged orders. Essentially, I bought the call where I believed Tesla was at its local minimum, and believed once the fud from Russia and inflation was over, the stock would return to where it was before the fud and some.\n\nPlanning on diamond handing till earnings, but if this pump goes too quickly I might paper hand, but as of now should be on track to hold for the month ahead\n\nEdit: about inflation, high inflation at 7% means it’s bad to hold cash, a lot of money flocks to bonds and equities because not investing is a guaranteed -7% in purchasing power, whereas equities and bonds can shelter your purchasing power from inflation", "score": 2, "replies": [{"body": "Thanks for explaining! yea I would have choked trying to call this lol great job man", "score": 1, "replies": [{"body": "Yeah I go fucking bonkers on the daily watching the price.\n\nHowever I’m motivated by my past trade that I paper handed. I bought a $400 Amazon leap call during the Covid crash at the bottom and caught the falling knife, paper handed for 500$. I check back a month or two later during earnings, and that same call was worth 30k.\n\nIt seems really counterintuitive holding a depreciating assset as an option contract for a longer timeframe than day or intraday trading, but if there are black swan events like Covid or Russia, it can be pretty lucrative.\n\nCan’t really brag about the trade yet as it’s unsettled, but we’ll see. I’ll update next week", "score": 2, "replies": [{"body": "“We look to your future with great interest 😂", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Spending almost 6K on a call that is 250$ OTM...  SMH....  This is why it's important to actually learn how to trade VS making random as fuck bets holding your nuts and praying to the stonk gods your shitbet pays off bigly.", "score": 1, "replies": [{"body": "So if I set a stoploss at 9k how is this a random fuck bet versus a good play lmao\n\nEveryone has their own tolerance for risk", "score": 1, "replies": [{"body": "You're spending almost 6K on a contract that is 250$ from having any actual value....  There are a lot of others plays you could've made with that money instead of just throwing it to the wind and hoping for a winner...  If you think what you did was in anyway smart or good investing/trading I urge you to withdraw your money know and just stick with a day job.  There's high risk and then there's this, and if you don't know the difference......  Withdraw your money and stick with a day job.  I'm just being realistic man.  You may need to step away from WSB for a minute and I genuinely hope this is just a play account with extra fuck around money.", "score": -1, "replies": [{"body": "$250 away from having actual value in 6 months.\n\nYour logic makes anyone who buys leaps sound idiotic, but there’s plenty of different strategies.\n\nArguably, longer dated options are easier plays than weeklies or short dated because they’re less volatile and you can sell before a massive trend change.\n\nThe hard part is already over from holding through last week, I’m in enough profit to be able to sell before I would ever lose money so it’s only upside from here, either way I’ll be exiting with profit.\n\nGoes back to risk tolerance.", "score": 3, "replies": []}]}]}]}, {"body": "August? Ooo that baby will be deeeep ITM", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|8882)", "score": 1, "replies": []}]}, {"body": "Just please be careful of that IV crush. ER is 4/25? I'd personally not pass up >80% profits, I would sell, buy a shorter DTE expiring a few weeks after earnings (more impact from IV spike) and take advantage of that sweet sweet IV pump. \n\nI also don't trade TSLA at all.", "score": 1, "replies": []}]}
