{"title": "If things get real bad how low will AAPL go?", "selftext": "[removed]", "id": "tqtq0c", "created_utc": 1648536279.0, "score": 0, "upvote_ratio": 0.15, "num_comments": 69, "comments": [{"body": "What is the point of this post? I mean, what do you want? Some mathematician to calculate the probability or what? Stupid post.", "score": 22, "replies": [{"body": "Then don't look. Its a free country last time I checked.", "score": -30, "replies": [{"body": "Free enough to call this post a turd.", "score": 24, "replies": [{"body": "Yep thanks.", "score": -8, "replies": []}]}, {"body": "what country? you know reddit is global right", "score": 4, "replies": []}]}]}, {"body": "3.50", "score": 7, "replies": [{"body": "Yeah ok", "score": -5, "replies": [{"body": "Financial advisor Issac Newton says it will hit the ground.", "score": 3, "replies": []}]}]}, {"body": "0 obviously.", "score": 5, "replies": [{"body": "Your iq.", "score": -13, "replies": [{"body": "Strangely that’s still higher than yours apparently since you’re asking the dumb question.", "score": 4, "replies": [{"body": "Ahajahahaahaa", "score": 0, "replies": []}]}]}, {"body": "The way Apple operates it'll go to -50 and you'll have to pay them to take their shares back.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I see you're a follower not a leader. Have a great life cookie cutter.", "score": -2, "replies": [{"body": "Do you think Batman could beat Superman? That's the answer to your question except when it's not.", "score": 2, "replies": [{"body": "Wow you're so clever...... Mommy's basement I bet...", "score": 0, "replies": []}]}]}]}, {"body": "AAPL is pretty much done growing and I don’t really get it as an investment at current prices. QQQ or SPY will provide similar returns and more diversification over the next 2-3 years.\n\nWould much rather own a solid reliable bet to grow substantially like Tesla tbh.", "score": -3, "replies": [{"body": "Yeah ok!.... AAPL is done growing 😆\n\nTSLA is way overvalued! Even Cramer said it tonight!\n\nWhen we get a sell off TSLA will go to $700 and AAPL will go to $150 maybe!", "score": 0, "replies": [{"body": "The one person that gave you a respectable response to this stupid post and you go ahead and laugh his opinion off. You asked for an opinion, don't get mad when it doesn't align with yours", "score": 8, "replies": [{"body": "Its not respectable! Dan Ives says AAPL will hit $3 trillion this year and $5 trillion in 3 years. Get a clue!", "score": -5, "replies": [{"body": "Ok then, just keep buying since you've already convinced yourself. What the fuck was the point of your post? Get a clue", "score": 4, "replies": [{"body": "Ahahahahaaa", "score": -2, "replies": []}]}, {"body": "Dan Ives also has a price target of $1900/share for Tesla. \n\nSo which is it? Tesla is overvalued or what Dan Ives says matters?", "score": 3, "replies": [{"body": "Yeah?", "score": 1, "replies": []}]}]}]}]}, {"body": "Did spy return 400% last 5 years like AAPL?!\n\nAAPL will be $400 in 5 years easy!", "score": -2, "replies": [{"body": "That would make them a $6T company lol. What makes you think they could gain over $3T in value in 5 years? \n\nI’m afraid your only chance is hyperinflation with that one.\n\nEdit: 5 years", "score": 1, "replies": [{"body": "You'd of said the same thing with them going from $1 to $3 trillion.  Dan Ives says they're going to $4 trillion by the end of next year.\n\nYou know nothing....", "score": -1, "replies": [{"body": "I mean if we see back to back 20%+ SPY yearly gains again then I guess it’s possible. But I doubt it.", "score": 1, "replies": [{"body": "Almost every stock I own has 4xed over sp500 last 5 years alone. \n\nYou gotta know the good companies.\n\nFor example.\n\nVTI last 5 years right now is 89% return\n\nMy MSFT from 5 years ago is up almost 400% ....STILL!\n\nMy UNH is up over 200% last 5 years vs. 89% sp500!\n\nAnd yet people still think indexing is the way to go....\n\nIt isn't!", "score": 0, "replies": [{"body": "The only thing that tells me is that you missed out on the sweet sweet 20x gain that was Tesla", "score": 1, "replies": [{"body": "I don't care.  I still beat the sp500!", "score": 1, "replies": []}, {"body": "And the others memes stocks but you can't blame yourself for not buying every meme stocks lol. If had known we would have all loaded up in tesla to then switch to the brick and mortar video game store.", "score": 1, "replies": [{"body": "Lol I know. It was more of a joke cuz OP thinks he’s so brilliant.", "score": 1, "replies": [{"body": "Oh yeah, I understand lol. I mean, I can relate, everytime I have a stock that do 300% I tell myself, that it, I am a genius, I could just do this full time instead of my job. To then be reminded the next week why I don't do this full time.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "> What makes you think they could gain over $3T in value in 5 years?\n\nIt looked just as insane when they first crossed 1T that they would go to 2T that fast", "score": 1, "replies": []}, {"body": "Lets be honest I would also have laughed at the idea of apple being worth 3 trillions 5 years ago and even more about tesla being worth 1 trillion in 5 years.", "score": 1, "replies": []}]}, {"body": "Unlikely. Close to 300, I could maybe see it. Will probably outperform spy. But then again, there will be other choices that will outperform apple.", "score": 1, "replies": [{"body": "Nobody knows.  AAPL is better than a bond that's for sure.", "score": 0, "replies": []}]}]}, {"body": "Really depends if Apple can find new fields to expand into. Whether their core business has any significant growth left is up for debate.", "score": 1, "replies": []}, {"body": "Both qqq and spy pretty much get carried by aapl, tsla and few tickers. If the tech sector is fown growing spy and qqq also are.", "score": 1, "replies": []}]}, {"body": "Zero.  And yes apple will go to zero eventually as everything eventually will", "score": 0, "replies": [{"body": "Short AAPL then.... Let's see this! Ahahahahahahaagahaaaaa!!", "score": -1, "replies": [{"body": "Even if he believe it. He probably believe he will be dead by then.", "score": 1, "replies": []}]}]}, {"body": "From October 1928 to August 1929 Coca Cola went from 120 to 155 to 122 to 101 during the 1929 crash .", "score": 1, "replies": [{"body": "Point?......", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You need a life dude....", "score": -4, "replies": []}]}]}]}, {"body": "Troll post. \n\nApple is recovering right now. \n\nWtf you on about OP?", "score": 1, "replies": [{"body": "Do you read op post? AAPL going to $300 next week now!", "score": 1, "replies": [{"body": "😂", "score": 0, "replies": [{"body": "😆", "score": 1, "replies": []}]}]}]}, {"body": "The lowest it could go is $0. Realistically if the bubble explode I'd say probably close to $30. I dou t it will happen but dunno.", "score": 1, "replies": [{"body": "$30?  You are naive! Ahahaahaa.", "score": 1, "replies": [{"body": "Too low or too high? $30 was pretty much the price before its went parabolic. I was in long before that, never expected to get this kind of return with apple.", "score": 0, "replies": [{"body": "If you actually think AAPL will be $30 any time soon, sorry that's the most stupid thing I've ever heard! It won't even go below $100!\n\nEven if \"the bubble\" (whatever that means) pops AAPL at best would get to $100 in worst case.", "score": 1, "replies": [{"body": "Just noticed your username lol, you are the troll guy.", "score": 1, "replies": [{"body": "Well if you think AAPL is going to $30 you're not too bright", "score": 1, "replies": [{"body": "You literally asked for the worst case scenario lol. Its went to $50 2 years ago and it wasn't even an actual crash. It could clearly fall under $100 if there is a crash, I don't think it will happen but I also don't think there is some magical floor at $100.", "score": 1, "replies": [{"body": "Yeah in March 2020 it dropped from $80 to $65.  Not from $178 to $90! And that was post split share price.  The actual share price at the time was higher.\n\nThe floor is most likely $125 nowadays worst case.  People and institutions move money during crashes. They don't really sell.  They move the money around.\n\nCash is crap and institutions can't hold boat loads of it so they find the next best things to bonds.  Fang stocks.\n\nAlso in a high inflation environment, names like AAPL MSFT and GOOGL will do well.", "score": 1, "replies": [{"body": ">Also in a high inflation environment, names like AAPL MSFT and GOOGL will do well.\n\nYeah most of my money is in GOOG and MSFT (I sold Apple and Amazon in Feb 2020 after holding for 10 years and don't like buying back what I previously had haha)", "score": 1, "replies": [{"body": "What percentage GOOGL and MSFT of your portfolio?\n\nIm about 40% tech all together. Mostly AAPL GOOGL MSFT and about 4% NVDA.\n\n10% of my portfolio his UNH.", "score": 1, "replies": [{"body": "About 30% right now, but I am 60% cash lol. I sold at the end of 2021 and have been buying back slowly.", "score": 2, "replies": [{"body": "I might be about 50% cash come the end of april depending on how large my portfolio gets!\n\nSooner or later this thing's going down! .... But who knows what will happen.....  I wouldn't be shocked to see the sp500 at 5000 at the end of 2022!!\n\nI mean if inflation stays high, which it will, where the heck are people gonna put their money?\n\nSolid blue chip stocks I would guess over negative real bond returns.\n\nCrazy times! 😆", "score": 1, "replies": [{"body": "Yeah for me my portfolio is pretty much my hedge for my real estate investment, so I just didn't want to risk it. If something bad happen I want to have some cash to fall on. I am still very bullish, but I wanted to be liquid just in case. I am in Canada and our real estate market seem to be overheating, there is pretty much no way that I will be under water, but I still want to be as healthy as possible.", "score": 1, "replies": [{"body": "Cool! I wished I could afford a rental property. Safer than stocks I think.\n\nEven to have a solid $1000 a month profit coming in is nice.\n\nPeople always need a place to live.\n\nIf I could start over at 25 or so I would've bought a nice 2 family and lived on the top and rent out the bottom instead of my 800sf. Single family home.", "score": 1, "replies": [{"body": ">If I could start over at 25 or so I would've bought a nice 2 family and lived on the top and rent out the bottom instead of my 800sf. Single family home.\n\nYeah its always a good idea, to be fair, there was no way we could know that the real estate market would shoot up so quickly. Its has been pretty crazy here (Canada)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Get in now before it’s too late", "score": 1, "replies": []}, {"body": "0", "score": 1, "replies": []}, {"body": "you see the PE of facebook and intel.\n\nI wonder what will happen when these tech stock start having problem growing.", "score": 1, "replies": []}]}
{"title": "Splits all over the place", "selftext": "With Amazon split (20:1) and Google (20:1) announced along with Tesla (tbd), I’m curious what the group thinks.  \n\nInvest in Amazon and Tesla now?  Or wait till after the split.  I’m torn here.  Valuation wise it’s same but advantage is once they split and the stock climbs I can climb with them vs. but after the split and get it a higher price.  But they can also decline for the first few days.  \n\nWhat does the group think?  Ideally Amazon or Tesla is a good buy.  So is Google.  But can’t get all three.  \n\nRight now…\nGoogle is 2,873\nAmazon is 3,386\nTesla is 1,094", "id": "tr0g0t", "created_utc": 1648562517.0, "score": 26, "upvote_ratio": 0.79, "num_comments": 65, "comments": [{"body": "With the disclaimer that I own AMZN and GOOGL but not TSLA, I think GOOGL is the safest bet of the three companies. A lot of people seemed to not want (or be able) to buy fractional AMZN shares, so I still think it has the potential to generate the most buying pressure post split. \n\nTSLA is one I haven’t got into as I feel like I substantially missed the boat. However, if it’s a company you believe in, it could be a good punt. I think it’s likely that the continued interest in the media combined with post split “lower price” (ie per share) will see more people who are on the fence / happy to own a small amount and be part of the ride jump in.", "score": 18, "replies": [{"body": "As a TSLA owner since 2019 I have not bought additional shares and I probably won’t again as it is my second largest holding. I do think people should have some exposure as I see it growing as long as they continue to execute. \n\nGOOG to me, is a no brainer. I’ve bought as recently as February and I see it having the most upside out of the mega tech without the risks. I nearly bought AMZN when it went below 3000 but I don’t see nearly the upside as I do with GOOG.", "score": 6, "replies": [{"body": "Why do you feel that?  Google main source of revenue is ad generated content (on their search engine, YouTube). Their cloud service is roughly 7-10% of the market share.  Where else does their revenue come from?\n\nAmazon has the eComm play, but their AWS has roughly 40% market share and growing fast.  Their Alexa brand is popular and nearly in every home. \n\nWhy is Google a better play?", "score": 5, "replies": [{"body": "Go check the earnings. They're both good plays. \n\nBut... Google just took over a lot of ad revenue that was going to Facebook before Apple's privacy move", "score": 2, "replies": [{"body": "I agree. Both the good plays.  Trying to see decide which one to go after since getting both is not an option (at this time)\n\nMy fear with Google is major revenue is ad based and that could start to decline in a few years.  There was a time when AOL was a major player, MySpace was dominate social platform.", "score": 1, "replies": [{"body": "i believe google has a better balance sheet compared to amazon. but its been a while since I seen it.", "score": 1, "replies": []}, {"body": "Thats why you have to do qualitative analysis and realize that the \"Search\" business is evolving into the \"Youtube\" business.\n\n50% of searches will eventually be just [youtube.com](https://youtube.com) searches. Imagine that, a company that has the foresight to see and also... shape consumer trends.", "score": 1, "replies": [{"body": "That’s a far reach.  While videos are popular I highly doubt that YouTube will the be sole search engine for content.   Then again who would have thought Google would be the premier search engine.", "score": 1, "replies": [{"body": "Yea not that far reaching. YT is almost 15% of AD revenue.\n\n20-25% in a few years. And before you know it…", "score": 1, "replies": [{"body": "Still long ways to go.  New platform like TikTok and existing ones IG and TW are slowest allowing videos and search capabilities.", "score": 1, "replies": []}]}]}]}, {"body": "While ad revenue is a big factor for Google, they have some massive moats and monopoly / duopolies. Sure, privacy changes may hurt their core ad targeting on Android devices, but the Android OS itself and Play store is a duopoly with Apple’s OS and App Store. YouTube is an absolutely revenue (again, as noted by others in this thread, primarily ad) generating machine, and doesn’t really have direct competition at what it does. \n\nWhile Google have failed to land a number of innovations (killed by Google is both a site and a meme at this point), it’s still synonymous with search. While I get your point that the landscape can change, Google is no longer just search. They’re also in a lot of verticals, including those they completely dominate. With tens of billions of revenue per quarter, it’s no longer comparable to an AOL. In the same way that Facebook detractors talk about social media sites like it’s 2007 and another might just pop up… despite Meta’s enormous revenue generation. No one else is realistically going to unseat Google in search at this point.", "score": 1, "replies": []}]}]}, {"body": "They have a lot of long shots.  Waymo, quantum computing, AR, etc.", "score": 1, "replies": []}]}]}]}, {"body": "It feels a bit like they're trying to squeeze every last drop of market cap out of the waning bull market to me.", "score": 24, "replies": [{"body": "100% they all want in on the retail craziness", "score": 2, "replies": [{"body": "Woot", "score": 1, "replies": []}]}, {"body": "Squeeze the wealth out of the middle class*", "score": 3, "replies": []}, {"body": "Lol the bull market is just getting started", "score": 2, "replies": [{"body": "Then you'd better get buying!", "score": 3, "replies": []}, {"body": "whoop whoop!", "score": 2, "replies": []}]}]}, {"body": "You say 'invest'...but what what you mean is 'gamble/trade'.\n\nFor investors a split makes no difference to the investment decision as it has nothing to do with the company fundamentals.", "score": 19, "replies": [{"body": "Where does selling covered calls fit in there? Im not really wanting to put up 280k into Google at this point, but I'll happily buy 100 shares at 140", "score": -1, "replies": []}, {"body": "Me say now it finally makes sense for me to get 5 Google or Amazon shares because after the split I will have a 100 shares of each. Where as before I would be putting a lot of money for only 5 shares. Yes, fundemently nothing has changed but the split is happening for a reason. Part of it so new investors can enter the market for the company. Not everything is a gamble.", "score": -1, "replies": [{"body": "You can buy fractional shares - so there was never a hurdle to entering the market. People who think \"I won't get 5 shares at 1000 but after a  split I'll buy 50 shares at 100\" need to take their money and run far, FAR away from the stock market - because they will only get burned with that kind of lack of understanding.", "score": 3, "replies": [{"body": "Not everyone has the option to buy fractional shares. For example in Canada only 1 Brokerage offers something similar to that. In some countries not even an option.", "score": 5, "replies": []}]}, {"body": "Agreed.  And after the split, anyone that missed the boat last time can get onboard this time.  Roughly the split will take Amazon from $3300 down to roughly $165/share with room for growth. \n\nPersonally trying to see if I should get *both* even if it’s 4-5 shares…", "score": 0, "replies": [{"body": "How exactly does a split create 'room for growth'? And if you really think it does you should taker your money and run, far, FAR away from the stock market because you fail at most basic logical reasoning.", "score": 0, "replies": []}, {"body": "Same but if I had to pick one, I think I'll go with Google.", "score": 1, "replies": [{"body": "Why do you feel that?  Comparing Google to Amazon it’s not evident why Google is to choice.   As posted in another reply, Google revenue is highly tied to its ad generated content and other products haven’t reached significant market shares.   Amazon AWS and eComm and Alexa has a good market share and good revenue source for growth.  \n\nWhy Google?", "score": 1, "replies": [{"body": "You are right, their revenue is highly tied to ads however the potential for google to develop and acquire market share in other areas is massive. I am betting they are able to get off their ass and capitalize on their under appreciated assets. I am sure both Amazon and Google will do great in the near future so wouldn't mind holding either, but just my preference.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "If you're going to invest in any of the names, the percentage play would be to invest ASAP, as historically these companies have trended upwards.", "score": 3, "replies": []}, {"body": "Milking it for the last bagholders before the bull run ends.\n\nWe're either headed for a high interest rate recession or stagflation.  Neither is good for the market.", "score": 6, "replies": [{"body": "You must be fun at parties..", "score": 2, "replies": [{"body": "This is an investing sub.  I save the emotions for the party.", "score": -1, "replies": []}, {"body": "More fun than someone who's username is \"Retirement Goals\"... Lol. Must've taken an astounding burst of creativity to come up with that one : )", "score": -11, "replies": [{"body": "Took a whole 60min but felt like an hour.", "score": 15, "replies": []}]}]}, {"body": "Holy shit this guy must be worth 100M over here. Because of how sure and certain they are of \"interest rate recession\" or \"stagflation\". Wow, the foresight is 20/20 and im sure they are holding MASSIVE short positions on the market.\n\nO whats that? They don't even have $1M in capital deployed? Well shit. I guess its just dumbass kids with dumbass opinions on the internet then.", "score": 2, "replies": [{"body": "Lmfao", "score": 1, "replies": []}]}]}, {"body": "I think they are all overpriced.", "score": 8, "replies": []}, {"body": "A stock split does not impact the business fundamentals.", "score": 2, "replies": [{"body": "Yes, and?", "score": -1, "replies": []}]}, {"body": "Tesla will be a 2:1 split from what I've heard.", "score": 2, "replies": [{"body": "Think they might do 5:1 split.  That will bring their shares to the same expected level as Amazon and Google post split.  Just a gut feeling but Amazon and Google would be priced at $150-200 post split.", "score": 4, "replies": []}]}, {"body": "Of those three, TSLA. We can't time the market.", "score": 1, "replies": []}, {"body": "Can't ya just buy fractional shares at whatever price you can afford now?", "score": 1, "replies": [{"body": "Most places do not allow fractional shares.", "score": 4, "replies": []}, {"body": "Options pricing bro", "score": -1, "replies": []}]}, {"body": "How does the split affect ETF or Mutual Funds that has Google or Amazon?  \n\nLike QQQM, does shares of those also go up?", "score": 1, "replies": [{"body": "There should be no change in price or value. For as much as the price goes down you receive in additional shares. Same goes for ETFs", "score": 2, "replies": []}, {"body": "also they could be added to DOW", "score": 1, "replies": []}]}, {"body": "I think you mean where to gamble now?\nInvesting has nothing to do with stock splits, you are just hoping the stock goes up because more people can afford the shares. \nThat’s not a thesis, you have no credible reason to believe those stocks will rise after the splits.. \n\nBut, with that being said. I think Amazon might rise the most in the short term. \nSo I’d bet on that.", "score": 1, "replies": [{"body": "If we were talking about AAL or T then I would agree.  No safe bet that those would rise post split.  But, c’mon.  We talking about Amazon and Google and to some extent Tesla.  These companies will go up.  They have solid balance sheets, market shares and investments to grow not to mention cash flow…", "score": 1, "replies": [{"body": "Yes…. Not because of the stock splits", "score": 1, "replies": [{"body": "Again, the stock splits **allows** more investors who wouldn’t normally buy the stock. The split gives a way in to more (not rich) investors.", "score": 1, "replies": [{"body": "And again, that’s not provable. \nThat’s just ur opinion", "score": -1, "replies": [{"body": "What is not provable??  That the stock value will be lower?  That more investors will buy the stock they have been eyeing for a while??  That the stock will be more affordable??  That hasn’t been proved??", "score": 1, "replies": [{"body": "Nope its speculation", "score": 1, "replies": [{"body": "Okay. Then I speculate the sun will come up tomorrow.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You are assuming these stocks will go up before/after the split as a result of the split.  Any comments here are just guesses.", "score": 1, "replies": [{"body": "Yes, of course. If I could predict which direction a stock will go I’d be a kajillionaire.\n\nMost stocks post split do go up.  Look at SHW as an example. \n\nBesides it’s a good bet Amazon and Google and Tesla will go up after the split.  We’re not talking about AA or T here. Lol.", "score": 1, "replies": [{"body": "I hear ya.  I personally bought GOOGL in 5 share increments to sell CCs post-split.", "score": 2, "replies": []}]}]}, {"body": "Forward splits are tasty. More please. 😋", "score": 1, "replies": []}, {"body": "I'd wait for a pullback on TSLA. I'm bullish on TSLA, but for Pete's sake, it ran up more than F and VW combined solely on news of a stock split lol\n\nIt should pull back a bit in 800land and then fire away... It has the highest potential upside out of all of the forementioned", "score": 1, "replies": []}, {"body": "I'd get shares in Amazon and Google at least a few weeks before the splits.  Liquidity does funny things and those newly split shares will appreciate like crazy, at least for a while.", "score": 1, "replies": []}]}
{"title": "Kodak entering the EV battery market; insiders betting big", "selftext": "Legacy companies with outdated business models have become all the rage in the past year for speculators seeking to revive essentially dying brands. We’ve all seen the resurgence of Gamestop—the sleepy brick-and-mortar retailer selling a product that everyone just buys online. Similar gains from AMC/Bed, Bath, and Beyond/etc. make it clear—there is an entire herd of downtrodden companies poised to make a comeback. Traders can either sit on the sidelines with their thumbs up their ass, or they can join the party. **Kodak will be the next big thing, with options poised to moon.** Here’s why.\n\n# History\n\nKodak is one of those ancient companies that literally goes back to the days of Thomas Edison. It was founded by George Eastman and Henry Strong in 1892, and eventually became a near monopoly in the photographic film industry. They adopted the razor-and-blades/printer-and-ink business model. They’d sell a camera for a relatively low price, then make their money selling the film. For almost a hundred years they made serious tendies doing it.\n\nThen digital cameras became a thing, spelling Kodak’s imminent demise. Ironically, Kodak was actually the first to develop a digital camera, but the smooth brain executives pushed back against it. The rest was history. Kodak sales declined year over year, ultimately sending the company into bankruptcy in 2012.\n\nBankruptcies are always messy, but Kodak was actually able to navigate it pretty well. It certainly helped that they owned all kinds of random assets that they were able to sell off in partial fulfillment of debtors’ claims. What kind of assets? Well, obviously they had some IP, and a lot of it had nothing to do with their core competencies, so that was easy to sell, and that sale in fact brought in over $500 million. They also owned a [coal-fired power plant](https://www.wxxinews.org/economy/2013-09-03/sale-of-power-plant-at-eastman-business-park-completed), a lease on a Times Square billboard, and all other kinds of random crap they were able to sell off. All told, they were able to exit bankruptcy relatively unscathed. Following the bankruptcy, Kodak tried to rebrand itself for the modern era. For example, in 2017, they developed a [smartphone](https://www.cnet.com/reviews/kodak-ektra-review/) , which was obviously a total failure. It became time for them to move on.\n\nAfter replacing most of the executive leadership in 2019, Kodak pivoted their focus to what they know best: photography-related businesses (film and printing), and chemicals (an industry that goes hand-in-hand with the film business). Now, although Kodak still sells its old-fashioned film to consumers, it is now primarily a business-to-business company, with two main divisions: commercial printing and advanced materials and chemicals.\n\n# Fundamentals\n\nThe driving force behind Kodak’s resurgence will be its Advanced Materials and Chemicals (**AMC!**) segment. This segment of the company reflects Kodak’s deep institutional experience in chemistry, which comes from over one hundred years in film manufacturing (again, a process deeply intertwined with chemical engineering). There are four main initiatives in the AMC segment: (1) EV battery material manufacturing; (2) light blocking technology; (3) transparent antennas; and (4) reagent manufacturing. While all of these AMC initiatives are set to deliver significant gains in the future, the one with really deep fucking value is EV battery material manufacturing. Here's how it works:\n\nKodak has spent the last year developing a “pilot coating facility” that will provide services to battery developers, including batteries to be used for electrical vehicles. The coating is applied to substrates in the batteries so that the batteries can more effectively store energy. Coating production is currently around 3 million square meters, with current maximum capacity of 80 million square meters. They are in the process of increasing production levels and are exploring other “[strategic relationships with battery companies](https://investor.kodak.com/static-files/31c5a002-cb7f-4209-bc6f-ea5b4f3166da),” as noted in their last 10K.\n\nHere it is worth reminding you that one of Kodak’s first partnerships with a battery developer was with a company called [Plug Power back in 2019](https://fuelcellsworks.com/news/plug-power-expands-manufacturing-in-new-yorks-finger-lakes-region-with-the-grand-opening-of-its-facility-in-rochester/). Plug was itself a WSB darling last year. Plug partnered with Kodak to use their high-speed coating process to enhance their “membrane electrode assembly technology.” They have used the technology to help build zero emission hydrogen fuel cells.\n\nA few weeks ago, Plug Power announced that it was opening a [new manufacturing facility](https://www.governor.ny.gov/news/governor-hochul-announces-groundbreaking-plug-powers-55-million-manufacturing-facility-albany)in Albany County. The initiative is intended to complement the State of New York’s “aggressive pursuit of economic development opportunities that align with \\[their\\] nation-leading clean energy goals.” The facility will be used to expand Plug’s “GenDrive line,” which provides fuel cell solutions for electric trucks. New York, for their part, has committed to provide $45 in tax credits.\n\nThe economic impact of all this should be obvious.  As oil rpices continue to set new records, the demand for electric vehicles is only going to increase.  Consumers are getting pissed, and their interest in electric vehicles has nearly [doubled](https://www.wsj.com/articles/high-gasoline-prices-have-consumers-thinking-electric-11648027800?mod=Searchresults_pos11&page=1) since just a month ago.  Even when the war in Ukraine dies down, oil prices are not going to crash anytime soon.  To the contrary, prices are expected to explode up to [$240 a barrel](https://fortune.com/2022/03/09/worst-case-oil-forecast-240-per-barrel-global-recession/)this summer.  For better or worse, electric vehicles are the future, and Kodak is positioned to profit handsomely.\n\n# Financials\n\nThe company’s financials already reflect strong growth, as shown by the recently reported 2021 figures. Revenues increased 12% over 2020 to $1.15B. Net income increased to $24 million, whereas 2020 saw a net loss of $541 million. And the end-of-year cash balance increased to $362 million, compared with $196 million at the end of 2020. I know what you’re thinking: “oBvIOusLy 2021 financials improved, 2020 was the height of the pandemic!” Yes, but the trend was already underway even before Covid hit. Take a look at their balance sheet from 2019 (pre-pandemic) compared to end-of-year 2021:\n\n&#x200B;\n\nhttps://preview.redd.it/b2hoyxrt2cq81.png?width=624&format=png&auto=webp&s=54dd2c421c61033dadb05fdce8f26c72606a6396\n\n  \n\nTechnical analysis, to the extent anyone cares, also supports the bullish case. The recent price action pushed Kodak firmly above its 200-day moving average, reflecting both short-term and long-term bullish sentiment. \n\n&#x200B;\n\nhttps://preview.redd.it/p4kegoky2cq81.jpg?width=468&format=pjpg&auto=webp&s=7b348df985d23faea6bb0d8419805f085c0e0ecc\n\n  \n\nAs shown in the TA, the price has already moved up a bit over the last couple weeks, but this is still a beaten down company—there’s a *ton* of upside on the table. \n\n# Insider Purchases\n\nPerhaps most telling, Kodak experienced huge insider purchases over the last few weeks.  Between 3/18-3/21, Director Kennedy Lewis purchased a total of[2,434,179 shares](https://investor.kodak.com/static-files/f64ebe1c-5880-44bf-b16c-197a0647b41c)  at an average price of $5.73, and last month, CEO James Continenza exercised options to acquire [100,000 shares](https://investor.kodak.com/static-files/644bff99-459a-4c02-a6b4-2fbcd423b650), bringing his personal stake to 888,631 shares—a little over 1% of the company.\n\nRemember that Kodak is the kind of company where insider purchases are especially noteworthy.  Flash back to mid-2020, when the Covid vaccine was still in development.  [On June 23, 2020, Continenza purchased 46,737 shares at a weighted average of $2.22.](https://www.kodak.com/content/products-brochures/Company/Report-to-the-Special-Committee-09.15.2020.pdf) Board Member Phillipe Katz also purchased 10,000 shares, at around a similar price.  A month later, on July 27, the company awarded Continenza and various other executives millions of options, with strike prices generally in the $3-4 range.  The next day, July 28 , President Trump announced to the world that the federal government (through the U.S. International Development Finance Corporation) [approved a loan](https://www.dfc.gov/media/press-releases/dfc-sign-letter-interest-investment-kodaks-expansion-pharmaceuticals?CID=exit&idhbx=dfcrelease) of **$765 million** to Kodak for the purposes of facilitating the production of pharmaceutical ingredients, sending the share price up over 2,000%.  **Put simply, if history teaches anything, Kodak insiders don’t make big purchases based on a general notion that the company is doing well; they buy when something major is about to happen.**  \n\n# Short Interest\n\nKodak has a fairly elevated short interest, currently around 8.2%, consistent with the general practice of institutions shorting seemingly obsolete companies.  Granted, 8.2% short interest doesn’t particularly make it primed for the same level of short squeeze associated with GME, AMC, etc., but there is room for a squeeze here.  \n\n# Tl;dr\n\nKodak failed to capitalize on the digital era years ago, and it paid dearly for that.  But the company is now in the hands of forward-looking management, and they’re developing products that go far beyond film.  Specifically, as the EV-industry continues to advance, Kodak is well-positioned to itself gain value, as it has recently developed technology to assist in the manufacturing of fuel cell batteries, as well as green-energy technology more generally.  Newly announced manufacturing facilities by strategic partners and massive insider purchases also suggest that something big is about to go down.  \n\nPositions: 10c 5/20, 10c 7/15, 12.50c 7/15\n\n#", "id": "tr1ndz", "created_utc": 1648564728.0, "score": 59, "upvote_ratio": 0.75, "num_comments": 64, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|69|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/tqascz/kodak_to_become_a_major_player_in_the_ev_battery/) [x](https://www.reddit.com/r/wallstreetbets/comments/tqb051/kodak_to_become_a_player_in_the_ev_battery_market/) [x](https://www.reddit.com/r/wallstreetbets/comments/tr1ndz/kodak_entering_the_ev_battery_market_insiders/) \n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tr1ndz)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tr1ndz)", "score": 1, "replies": []}, {"body": "I have a disposable camera from 20 years ago I need to develop", "score": 35, "replies": [{"body": "Wait.. it'll develop into a battery.", "score": 10, "replies": []}]}, {"body": "Up 47% the last month, am I dumb enough to buy options", "score": 19, "replies": [{"body": "Yes", "score": 5, "replies": []}, {"body": "Did you see their share price during the KodakCoin debacle? The price went nuts for a bit. Fuck Kodak though. They will remain irrelevant no matter how hard they resist it, now and forever.", "score": 2, "replies": [{"body": "Geez. Did they open your camera before rolling the film back? Or did someone take your photos from the cubby on accident?", "score": 3, "replies": [{"body": "¿Que?", "score": 1, "replies": []}]}]}]}, {"body": "Did this company not became a pharmacy last year ?", "score": 17, "replies": []}, {"body": "Oh yeah? We’re they not into bitcoin too", "score": 14, "replies": [{"body": "Exactly this. Management has a history of jumping on the Next Big Thing", "score": 10, "replies": []}]}, {"body": "Isn't the headline \"Kodak is going to...(some industry name)\" an indicator that it's at the top?", "score": 13, "replies": []}, {"body": "How can I not trust a guy named shit-piss-fuck? I'm in for 3 contracts! https://ibb.co/FqtjRQf", "score": 25, "replies": [{"body": "I am with you I just got 3 contracts how can i go wrong with such a classy name as shit-piss-fuck", "score": 6, "replies": [{"body": "Lol me too!", "score": 2, "replies": [{"body": "I'm not down almost 50%. Haha not going great", "score": 1, "replies": [{"body": "Options do that. But technicals are good and it was up in the aftermarket. We’ll see on Monday. And there’s plenty of time.", "score": 1, "replies": []}]}]}]}, {"body": "Omg lol!", "score": 3, "replies": []}]}, {"body": "Movie theaters buying large shares of mining companies, camera makers selling batteries.. this all makes sense to me.\n\nTime to shove some taquitos in my ass and hope I dont get mouth diarrhea.", "score": 10, "replies": [{"body": "Kodak has been making small batteries (i.e. AAA) for years. I guess now they want to hop on the EV bandwagon.", "score": 4, "replies": []}]}, {"body": "They are going to enter the ev battery market in a flash", "score": 13, "replies": []}, {"body": "I recommend watching the current episode of Smarter Every Day. Kodak’s capabilities are mind blowing.", "score": 5, "replies": [{"body": "Do they mention anything about the ev batteries?", "score": 2, "replies": [{"body": "Not in the first part (two more parts coming). But it shows how capable they are.", "score": 1, "replies": []}]}]}, {"body": "I used to work for Kodak. My degree is in old school photo processing and technology.\n\nOne thing is for sure, they had what it took to develop the infrastructure to build and manage highly complex things/ processes with an incredible amount of moving parts and a ton of innovation. And then scale that globally and profitably. Having seen up close how incredibly complex everything was, almost 20 years later, it still makes my head spin. Whatever you think it took to develop your film at scale, you have no idea. The complexities of that business.... And they did it well.\n\nThe question is, if they still have what it takes after all these years to take on something so complex?\n\nIf you were to ask me 20 years ago, then yes. Absolutely. \n\nBut today.... They have been so far removed from the complex game for so long. Is that talent something they can just turn back on? Knowing all the movers of the time are all long retired, and they sold off so much of their infrastructure (That wouldn't likely have helped much anyway). \n\nAll they have going from them is a solid name, and a history of complex things. We just can't forget they also have a history of not seeing the writing on the wall. Putting their heads in the sand and not changing with the market.\n\nMy money banks on this failing big as a venture. But that's not to say the stock won't produce tendies in the mean time. I would absolutely love to be wrong though. The brand still has a spot in my heart.", "score": 8, "replies": []}, {"body": "Awesome DD and great writing, as well. Not only did I enjoy reading this, but I was also persuaded by your style of writing. I kind of missed not seeing the, now taboo, “This is not financial advice”, but the research is so strong that I don’t even think that disclaimer was warranted. Followed!", "score": 3, "replies": [{"body": "PUT YOUR HANDS UP GeologistOk5310!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Google \"KodakCoin\"", "score": 4, "replies": []}, {"body": "Wait, how about Kodak’s property in Rochester NY (Eastman Park) that apparently made it through restricting in 2013? According to the Eastman website they still control 700 acres and 10M sqft of building space. Per articles, Kodak collected $14-$15M from tenants in ‘21. A 30% increase from 2020. So what’s the value of this property? Sure seems like it may not be carried on their balance sheet since it’s from the year 1890. If it’s not free and clear, depreciated, etc at this point, they need a Dave Ramsey in their life. In all seriousness, how much is it worth? Guesses? 700 acres with a power plant, railroad, wastewater treatment plant that can treat 36M gallons daily and 10 million square feet of building space bringing in $15M/year and increasing at 30%. So you have cash of $362M + Eastman Business Park asset + $1.2B overfunded pension that now continues to rise as rates increase I’m told.  Should this be a $1B Mkt cap with just those assets alone? How about add in Transparent Antennas with GM , EV Batteries moving into production with battery manufacture and multiple others in pilot testing. Imo someone soon will break this news who actually has some followers. No one sees my tweets, I have basically no followers in the scheme of things and no one follows a “film company”. Going to catch people off guard imo at some point when bright minds connect the dots and media begins to spread.", "score": 4, "replies": []}, {"body": "If the WSB post starts with “insiders” it’s a sign to inverse the DD.", "score": 7, "replies": []}, {"body": "Damn Kodak black moving from rap to stocks", "score": 7, "replies": []}, {"body": "Weren’t they supposed to make medicine for trump", "score": 11, "replies": [{"body": "And Cuomo don’t forget. It was a deal both the Feds and NY liked at the time.", "score": 3, "replies": []}, {"body": "Aint no medicine going to fix that /s", "score": 9, "replies": []}]}, {"body": "yea I loaded 25$ calls lol!!!!", "score": 3, "replies": []}, {"body": "loading the 1-20-23 $25 calls all we need is one day about $15 I made 1000% but I seriously think this will go to $100", "score": 3, "replies": []}, {"body": "I am in and will hold as long as SMA 200 holds", "score": 3, "replies": []}, {"body": "Let us ride.", "score": 3, "replies": []}, {"body": "Kodak bears are pretty scary doe", "score": 3, "replies": []}, {"body": "LFG", "score": 3, "replies": []}, {"body": "It doesn’t sound like they have enough capital to do what they say they want to do.", "score": 6, "replies": [{"body": "They closed on a $225 million initial term loan with Kennedy Lewis.  The thing I like about this deal, apart from the access to capital, is that Kennedy Lewis also bought 1 million shares at a price of $10 per share, i.e., at a $3 premium.  Press release from KL's attorneys [here](https://www.akingump.com/en/news-insights/akin-gump-represents-kennedy-lewis-as-kodak-announces-new-capital-sources-and-debt-structure-to-further-strengthen-financial-position.html).", "score": 8, "replies": [{"body": "But that's also a fair amount of new convertible debt (i.e. potential dilution)", "score": 1, "replies": []}]}]}, {"body": "Interesting analysis, however it seems to already be prised with a p/e of 25 - what’s your expectation ?", "score": 5, "replies": [{"body": "I can't give a firm estimate, but I'm holding $12.50 calls, so above that.  On the fundamentals, if you compare it to Plug, it's possibly a 5x gain (Plug moved up more than 10x, but Kodak isn't totally comparable).  On the more speculative side, if you account for any meme-stock reactions or short squeeze, then perhaps far more.  Who knows though", "score": 4, "replies": [{"body": "we could see a squeeze of magnum proportions with this float and how little is left for the public with insiders buying", "score": 3, "replies": []}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "This has gone up 100% in the last two weeks. Thanks for the heads up!", "score": 6, "replies": []}, {"body": "When you already should be in retirement but you come back for Pharma and Lithium. Nice Kodak, I used to take pictures with you. That's over.", "score": -2, "replies": []}, {"body": "Nahhhhh....WE BUYING GME HERE FOR 2022 MOASS", "score": -9, "replies": []}, {"body": "If you’re not already following @LongInvestors on Twitter (Long_Investor on StockTwits), I’m doing a deep dive on KODK which includes transparent antennas with General Motors. (I haven’t mentioned GM yet, but coming up soon)", "score": 1, "replies": []}, {"body": "Kodak has much going on behind the scenes with patents between GM/Kodak working with design company owned by Boeing/GM. So much. There’s a reason imo insiders bought $15M+ after the 10-K and subtle disclosures in it. Remember this isn’t Jeff Clarke, Kodak’s crypto promotional CEO. Jim C appears to be complete opposite, flying under radar, adding jobs for “high volume production coating” in the EV battery space. Notice the founder of Paychex invested $100M in 2021 in Kodak. Did he invest for better Kodak 100 film? Or did he see that the new CEO pounds table that he’s not going to spend money, not going to work on projects unless it’s driving by customer(s). So then if he’s working on EV batteries and Transparent Antennas, there must be a company driving it, right? Right, and that’s what my series is about. Much more to it, but that’s high level. Enjoyed the article above btw, glad to see someone researching as Kodak pivots.", "score": 1, "replies": []}, {"body": "And how about the pension plan that is evidently overfunded to the tune of $1.2B at today’s rates. I’m told there’s a chance they can convert this into cash. While there would normally be tax consequences, sounds like because Kodak has net loss carryovers, that’s not really a factor. So you have $362M cash + potentially a net of $800M from overfunded pension. Isn’t this a $500M market cap? Is EV, Transparent Antennas, Boeing, General Motors and everything else in the works just a bonus?", "score": 1, "replies": []}]}
