{"title": "Who shorts $TSLA with a 30%!?", "selftext": "", "id": "by0lmo", "created_utc": 1559945659.0, "score": 86, "upvote_ratio": 0.84, "num_comments": 45, "comments": [{"body": "Dont forget the energy transmission and distribution sector. All the electric utility companies will be competing with solar + battery", "score": 10, "replies": [{"body": "Will solar cost them less than what EVs will bring them?", "score": 3, "replies": [{"body": "Elon wants everyone to have solar. He’s making it damn cheap.", "score": 1, "replies": [{"body": "Yes but it’s not conceivable to have 100% of solar, especially in Certain countries.", "score": 3, "replies": [{"body": "With Solar + Batteries and Ultra-high-voltage transmission it's totally possible. \n\nWith today's cost of solar and battery cells the cost of 100% day/night solar is comparable to nuclear and maybe coal in sunny countries. By using UHVDC transmission lines like they are building in China with 1100KV DC voltage (1.1 million volts) their longest transmission line is 3400km long from Zhundong–Wannan. That's a comparable to the distance between Seattle, Washington to the north-most point in Alaska or around 48 degrees north from the equator. \n\nYou could totally economically viable power the entire world with 100% solar using today's technology and costs, assuming you could ramp up production up indefinitely while maintaining the same costs.\n\nReally you may not even need the batteries that much because 45 degrees around the Earth gets you around 3 hours of time zone difference so import power from those who are 3 hours behind you when it gets dark and export power to those who are 3 hours ahead of you and you can cut 6 hours off the 12 hour long nights.", "score": 3, "replies": [{"body": "You are so wrong, it’s not even funny.  \n\nEconomically viable to build hundreds millions of transmission lines?  Loss rates of transmission.  To have zero understanding of solar irradiance and efficiency.  The short term nature and incredibly small size of batteries.  To say nothing of land use issues.  \n\nNot to mention you apparently can’t do math, or understand the seasonality of daylight.", "score": 2, "replies": [{"body": "You’re thinking too far in the box. With solar at 70 cents per watt and batteries at $250/kWh, you could design a >90% capacity factor solar plant with an LCOE of about $150/kWh. Not at parity with coal yet, much less CCGT, but pretty close to (new) nuclear in practice. \n\nThe plant would be 200 MWdc, 25 MWac, with 600 MWh storage. There would be a lot of clipping in the summer since that is sized to provide 100% capacity factor in the winter.", "score": 1, "replies": [{"body": "If by in the box, you mean rooted in reality, then guilty as charged. \n\nIf you make up your numbers, it helps. Try adding another 40c to your solar. I also can’t quite figure out your other numbers. Are you saying a 200MW pv plant with a 25mw/600mwh battery????", "score": 1, "replies": [{"body": "70 cents per watt is a reasonable figure for utility scale solar now that panel prices are in the neighborhood of 30-40 cents per watt. This is the sort of cost developers are looking at for new projects (2020/2021 build, 2021/2022 operation). This is also post-ITC and assuming tax appetite.\n\nI also knocked off a few cents because of far fewer inverters and AC work as a result.\n\nThe hypothetical plant is 200 MWdc and 25 MWac to provide the daily energy for full capacity factor. i.e it is a 25 MW plant. It is DC coupled to a battery (LFP) of 600 MWh. I did not specify the power of the battery but by implication it is 175 MW charge, 25 MW discharge.", "score": 1, "replies": []}]}]}]}]}, {"body": "They won’t lose 100% of their profits, so they shouldn’t be worried?", "score": 1, "replies": []}]}, {"body": "*The Chinese are.", "score": 2, "replies": [{"body": "In the past, yes. Now, Tesla has agreed to too much capacity at the NY Gigafactory and just needs to get rid of piles. They dropped their price 30% or so a few weeks back because of it.", "score": 2, "replies": [{"body": ">just needs to get rid of piles. \n\nYou're more accurate than you might think.\n\n[Piles](https://translate.google.com/#view=home&op=translate&sl=fr&tl=en&text=piles)\n\nAlso, https://en.wikipedia.org/wiki/Voltaic_pile", "score": 1, "replies": []}]}]}]}]}, {"body": "Um, utilities love evs.", "score": 2, "replies": []}, {"body": "That's unlikely. Musk expects we'll need a LOT of additional capacity to move to electrical transportation. He's working on bridging some of that gap. The utilities are likely to be customers, not competition.", "score": 1, "replies": []}]}, {"body": "3.7 trillion dollars fighting against Tesla. That just goes to show just how valuable Tesla could be.", "score": 15, "replies": [{"body": "This isn't $3.7T fighting against Tesla. \n\nLaunch providers aren't even competing against Tesla. Shit, SpaceX **is** a launch provider... \n\n\"Automotive advertising, media relations and PR\", \"Parts Makers\"  are getting their money from Automobile Manufacturers, so that money is being counted twice. The PR companies aren't spending that money themselves from thin air...\n\nHalf of this money are oil related who have low enough margins (9%ish)  that the vast majority of their money is going into actually producing products, not fighting against Tesla. \n\nAt most it's a fraction of $3.7T. This infographic is ... silly at best, but I'd even suggest it's misleading.", "score": 14, "replies": [{"body": "Maybe the totals might be off a bit but this clearly illustrates how many industries have something to lose if Elon has his way.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yep.  Folks who hate Elon hate Tesla.  Harder to attack spacex because they aren't public.  Though the reverse is also true.  Some folks who love spacex / Elon invest in Tesla because it's their only option...", "score": 2, "replies": []}]}, {"body": "This is true, but on the other hand, this infographic leaves out $Ts in other industries that Tesla and SpaceX are about to rub-up against.", "score": 1, "replies": []}, {"body": "If it makes you feel any better, that number didn’t include launch providers. Not that it would make a difference", "score": 0, "replies": []}]}]}, {"body": "Now do all of the national and local governments that are directly and indirectly subsidizing EVs", "score": 8, "replies": [{"body": "Lets assume 2M EVs are currently sold a year globally.  Assuming an average of $5000 (just making this up), we are looking at $10B in EV incentives.", "score": 2, "replies": [{"body": "EV incentives are not everywhere. In Australia there's zero incentives. Fucking auzzie cunt politicians", "score": 3, "replies": [{"body": "> EV incentives are not everywhere.\n\nWhere there are no plug-in incentives, there are no plug-in sales.", "score": 1, "replies": []}]}]}, {"body": "The incentives don't even come close to the amount of money spent lobbying against electric vehicles.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "There is a huge community of people on Twitter, Reddit and traditional media who have made it their full time job to hate on Tesla. That is why. Do you really not know about this?", "score": 9, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Ok sure, it’s weak to get bothered by that. But what about the other side? Your logic doesn’t apply to them? It’s not weak to devote your entire life to hating a company and hating a person?", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Coz they are tweeting 20 times a day.", "score": 6, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Yes they are koala bears.", "score": 6, "replies": []}]}]}]}]}, {"body": "It's not just one random person. There's a ton of people. And in some cases, it's pretty obvious it's a coordinated effort by some groups.\n\nWhen you see people disparaging entities that you like, it's perfectly normal to be bothered. That's human nature.\n\nYour arguments make no sense and it seems like you're just coming in here intentionally trying to deflect and make straw man arguments. You're not fooling anyone.", "score": 0, "replies": [{"body": "Ok.  So it is 1000 people.  100,000 , a 1,000,000 people.   \n\nSo what?    My question is the same. \n\nWhy do are people so weak that they are affected by what a ton of anonymous people say about a company?   Especially since they don’t even respect these anonymous people.  \n\nBtw, you may want to look up what a straw man argument is before you accuse people of making them.", "score": 4, "replies": [{"body": "Let's say YOU ran a company or invested in a company you cared about. And let's use your number and say there were one million people hating on this company, actively spreading misinformation, bashing it, mocking the ceo, doing anything they could to bring it down, hoping and praying it goes bankrupt.\n\nAre you trying to tell me that wouldn't bother you? Are you trying to say that anyone who is bothered by that type of behaviour is weak?\n\nIs that seriously what you're trying to argue?\n\nI really don't understand what you're trying to argue. It sounds like you're trying to say that people shouldn't be aggravated by things that are clearly aggravating.\n\nBTW - You made a straw man when you tried to paint the problem as one unidentifiable random stranger on the internet. The problem is much larger than that and you know it. Volume matters. It's not a problem if it's one or two people. It *is* a problem when it's hundreds or thousands of people.", "score": -6, "replies": [{"body": "First, you are trying to equate someone who is running a company with my comment about a fan of the company (who may not have even invested in the company). \n\nYou assert that these “things are clearly aggravating”, that is not at all clear unless the person just isn’t strong enough to hear a negative opinion on the internet. \n\nCurious, do you get the same aggravation when you read a misinformation, bashing, mocking comment from someone praying for bankruptcy, on a day that Tesla’s stock skyrockets than when it dives?\n\nAs for the straw man, No, I used the one identifiable random person as an example of something that would trigger someone.  I never said the problem is just that one person or that there is only one person.\n\nEdit.  I own shares in apple, Microsoft, Netflix and other companies that plenty of people don’t like.  I don’t care.  There aren’t enough hours in the day for me to be outraged or saddened by some negative comments on the internet.", "score": 8, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Why are you referring to us as ladies?  Is that supposed to be an insult?  In 2019?  Seriously?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "> How can people be so weak that that would bother them in the slightest? Oh no, @randomdudeoninternet said a nasty about Tesla...help me rebut it!\n\nWe had this conversation a number of times before. You can find a way to disagree with people respectfully.\n\nAlso, that's a misrepresentation of the point. It isn't about criticism per se. The question that's being asked is: Why are some people so obsessive about dismantling Tesla or other Musk ventures.", "score": -1, "replies": [{"body": ">\tnumber of times before \n\nAFAIK we had that conversation once, sort of. \n\nI was asking about why there are some people who are so bothered by it.  I did not disrespect the person who asked the question. \n\nAs far as the question being asked, It wasn’t only about “dismantling Tesla” , it included people who make negative comments about Tesla (now, if that is categorized as dismantling Tesla, we can agree to disagree).  That is the premise I was asking about.", "score": 1, "replies": []}]}]}]}]}, {"body": "Is this supposed to tell me not to bet on Tesla's stock because Tesla is facing too much competition and other interests? Got it!", "score": 2, "replies": [{"body": "Great! I see you are smartish, good luck!", "score": 0, "replies": []}]}, {"body": "Noting of course the obvious overlap between these groups. Especially the short sellers who could be part of any group", "score": 1, "replies": []}, {"body": "Love this... probably best summarizes the stock moves.", "score": 0, "replies": []}, {"body": "Launch services providers excluding SpaceX? Do people think shorting TSLA will substantially impact SpaceX in their favor?", "score": 1, "replies": []}]}
{"title": "Final YOLO", "selftext": "Blew up my account all in on puts this week, and was already PDT restricted. So when I closed my puts yesterday got trading banned. \n\nThx to whoever told me to YOLO AMZN FDs \n\nhttps://imgur.com/a/gzn6VW6\n\nGonna hold one and chill. Thx RH for the break. Thx wsb for the company. Y’all gay AF 😘", "id": "bxv10e", "created_utc": 1559916457.0, "score": 113, "upvote_ratio": 0.99, "num_comments": 40, "comments": [{"body": "Let me guess you are close to breaking even", "score": 55, "replies": [{"body": "Nah https://imgur.com/a/1dGTkwq", "score": 179, "replies": [{"body": "Lol fuck", "score": 82, "replies": []}, {"body": "Seems like you lost 75% of your portfolio on one YOLO play", "score": 35, "replies": [{"body": "Oh fuck put your glasses on, did he?", "score": 22, "replies": []}, {"body": "Me irl but for mu calls last year", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "1.4k is quite literally nothing bro \n\nTrust me", "score": 16, "replies": [{"body": "If my positions are only down 1.4k by the third friday of June, I'll be a happy man", "score": 10, "replies": [{"body": "If you think that then reverse your positions", "score": 3, "replies": []}]}, {"body": "It's not literally nothing it's relatively nothing.", "score": 3, "replies": [{"body": "shut up science bitch", "score": 10, "replies": []}]}]}]}, {"body": "Yikes!\n\nI'll be in my bunk", "score": 4, "replies": []}, {"body": "I had a bad day all around. This made me realize I’m doing ok. Thanks.", "score": 3, "replies": []}, {"body": "Lmao", "score": 3, "replies": []}, {"body": "nigga u got problemz", "score": 3, "replies": []}, {"body": "HOT DAMN", "score": 1, "replies": []}, {"body": "Jesus Christ", "score": 1, "replies": []}, {"body": "I love the tiny little spike before everything goes downhill", "score": 1, "replies": []}, {"body": "You're a true fucking hero.", "score": 1, "replies": []}]}]}, {"body": "If it's your first FINRA violation you can get a one time forgiveness.", "score": 14, "replies": [{"body": "How does one go about this?", "score": 3, "replies": [{"body": "Do you have an internet connection?", "score": 2, "replies": []}]}]}, {"body": "F", "score": 5, "replies": []}, {"body": "You can’t yolo when your down 27k", "score": 5, "replies": []}, {"body": "Thats why i love this sub. Cause people here just fucking gamble. Great to see what noobies do.", "score": 4, "replies": []}, {"body": "God damn man. I dont understand. I have no idea what I'm doing, but I'm up 30% overall. How do you fuck up so tremendously?", "score": 11, "replies": [{"body": "You’ll see.  I said the same thing.", "score": 21, "replies": [{"body": "Thats fair, except my portfolio is over 2 years old, I'm pretty confident in my ability to not take on absurd amounts of portfolio-demolishing risk. I also understand that I'm at WSB and you guys dont know what \"risk assessment\" is over here lol", "score": -1, "replies": [{"body": "Good for you then!  It was more of a “dad” comment to you ( in jest)", "score": 4, "replies": [{"body": "Yeah i mean youre still right, it could go tits up but it wont happen from one single yolo. I know that much. Ill enter a call or put and sell as soon as i hit 30% return or 20% losses lol, I dont have strong hands.", "score": -4, "replies": [{"body": "That’s a different risk:reward ratio then I normally see.  What made you pick that?", "score": 0, "replies": [{"body": "Haha honestly, they just sounded good to me. If i adhere to these guidelines i only need to be successful in about 6 out of 10 trades, or something like that.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "That’s why it’s a gamble", "score": 10, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3AYOLO). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "You can charge your phone finally", "score": 2, "replies": []}, {"body": "wait for market to reach 294 on spy.\nthen buy JNUG Calls 1 year out for like 1-1.3 dollars. buy it as cheap as possible. as far out as you can buy. get alot. collect tendies.", "score": 2, "replies": [{"body": "Ie bet on recession?", "score": 1, "replies": [{"body": "Basically. They say we’re overdue for one, \nBut who knows, if one will happen. The play can make money if people freak out and sell like a few weeks ago. \n\nAustralia is just now about to have their first recession in 30 years. Idk what that means cause I sub to wallsteetbets.", "score": 2, "replies": []}]}]}, {"body": "Oof", "score": 1, "replies": []}, {"body": "What AMZN FD's did you buy? I might do the same come monday..\n\n&#x200B;\n\nEdit ok nvm you bought 5 700ish contracts..", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "bxvs98", "created_utc": 1559920535.0, "score": 34, "upvote_ratio": 0.95, "num_comments": 46, "comments": [{"body": "They forgot to turn off the pump machine.", "score": 63, "replies": [{"body": "Sound like a flesh light.", "score": 10, "replies": []}]}, {"body": "[deleted]", "score": 30, "replies": [{"body": "Must be the tariff man fucking it up for everyone again", "score": 1, "replies": []}, {"body": "This is true. I'm the Market Prof and I say so.", "score": 1, "replies": []}]}, {"body": "Here’s why... i bought SPY PUTS today and did all my 3 day trades for the week. So I can’t do another one. So it only makes sense for every thing to rise because I’m destined to lose money", "score": 48, "replies": [{"body": "I just spent 55 bucks to buy a 291 SPY CALL expiring 6/12 because nothing makes sense anymore.", "score": 3, "replies": [{"body": "If it goes up you make money. If it goes down I make money. So I think we figured out what’s gonna happens. It will go sideways", "score": 8, "replies": [{"body": "I’ll IC that real quick and we share the losses 1/3, 1/3, 1/3?", "score": 3, "replies": [{"body": "So did you do it.", "score": 1, "replies": []}]}, {"body": "Yup\n\nIf it stays the same....\n\n\n\n:(", "score": 2, "replies": []}]}]}, {"body": "Why is this sub so obsessed with SPY? Not being rude just honestly confused about WSB obsession with it pls explain", "score": 5, "replies": [{"body": "Cheap options premiums for big potential movement.\n\nPlus it only goes up; except for the times it doesn't.", "score": 36, "replies": []}, {"body": "[deleted]", "score": 22, "replies": [{"body": "ThTs what she said", "score": 12, "replies": []}, {"body": ">not as easily manipulated\n\nJpow and Tariffman literally control the market.", "score": 0, "replies": []}]}]}]}, {"body": "Isn't this easily explained by the dollar getting relatively weaker lol", "score": 15, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "what?\n\nmonetary policy is market manipulation.", "score": 10, "replies": [{"body": "Yeah that's like it's whole thing.", "score": 1, "replies": []}]}, {"body": "So when we recession, do the bond markets overflow or people will get out of that as well?", "score": 1, "replies": []}, {"body": "Federal reserve threatening to cut rates isn't manipulation?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Of course.", "score": 1, "replies": []}]}]}]}]}, {"body": "Market wants all puts and shorts out.. and it wants them out today and next week..  \n\nThere is something happening June 21st or before, and those behind the market are making sure they have it where they want it before that happens.", "score": 11, "replies": [{"body": "It’s an artificial, market wide short squeeze by institutional investors. Spy to 300, QQQ to 200. Then ATH fears to justify the dump. A technically legal pump and dump. Then the recession hits hard, millions lose their jobs. Bunch of companies go under. We go to war with someone, probably somewhere in South America, to pull us out of recession/depression. Genius.", "score": 11, "replies": [{"body": "You had me in the first half, not gonna lie", "score": 9, "replies": []}, {"body": "Iran is the next in line for war I believe.  John Bolton is the fucking national security advisor. He specializes in starting fake wars in the middle east and needlessly getting Americans killed for profit.", "score": 9, "replies": [{"body": "Americans *and* many innocent civilians and foreign soldiers who are simply defending against an armed imperialist invasion.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you on [**2019-12-07 19:54:14 UTC**](http://www.wolframalpha.com/input/?i=2019-12-07 19:54:14 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/bxvs98/seriously_what_is_happening_vix_bond_stock_gold/eqap3bk/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/bxvs98/seriously_what_is_happening_vix_bond_stock_gold/eqap3bk/]%0A%0ARemindMe!  6 months) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! eqap6hh)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Oh a solstice play spicy", "score": 3, "replies": []}, {"body": "Can you tell me where the date June 21st came from?  Thx", "score": 2, "replies": [{"body": "It is from a big options expiration date. Look at QQQ June 21st.", "score": 5, "replies": []}, {"body": "It came from June on the 21st.", "score": 5, "replies": []}]}, {"body": "Sounds like you're watching a movie written by a failing film student.", "score": 1, "replies": [{"body": "Sounds like you need to go long the market this week then.", "score": 1, "replies": []}]}]}, {"body": "What if the entire wall street is doing a massive pump and dump\n\nThey know something's coming", "score": 6, "replies": []}, {"body": "Exactly. It’s people who are trying to make one last final payday before we get to a huge cliff while simultaneously shoving their earnings into gold and other safe havens. This “eerie” feeling that you should be feeling right now is EXACTLY how I felt in ‘08", "score": 9, "replies": [{"body": "(Pumped Up Kicks plays quietly behind market charts)", "score": 3, "replies": []}]}, {"body": "Deal made with Mexico preventing tarrifs", "score": 1, "replies": [{"body": "That caused the VIX to rise?", "score": 2, "replies": [{"body": "The question asked to address 5 areas. I just said the latest news because I'm lazy and to address each is ludicrous as no one really knows.", "score": 1, "replies": [{"body": "I like your moxy", "score": 1, "replies": []}]}]}]}, {"body": "everything bubble my G. creditors keep calling but powell keeps changing the number", "score": -1, "replies": []}]}
{"title": "I sold two AMZN ITM covered calls expiring today. Break even price was 1807. I still have my shares after hours. Wondering if I'm in the clear now or did I fuck up and they'll get exercised on Monday?", "selftext": "", "id": "by0mm8", "created_utc": 1559945810.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 44, "comments": [{"body": "The only piece of important information is the strike and you left that out. Good job.", "score": 26, "replies": [{"body": "1790", "score": -4, "replies": [{"body": "Yeah you getting assigned", "score": 14, "replies": [{"body": "even if break even price is higher than where it is at right now?", "score": -4, "replies": [{"body": "Your options could have been bought and sold multiple times, the person owning them might have a much lower break even.", "score": 3, "replies": [{"body": "so thats how it works", "score": 0, "replies": [{"body": "But anytime it's beyond the strike it'll get exercised.", "score": 6, "replies": []}]}]}, {"body": "That is your break even price. Not the break even price of the person holding the contract. If the share price is above the call strike price at expiry, it's getting assigned.", "score": 4, "replies": [{"body": "Yo thanks for the info, I clearly didn’t know enough", "score": 3, "replies": [{"body": "If you have to capital to sell Amazon covered calls, at least you're doing something right!", "score": 2, "replies": []}]}]}, {"body": "They are getting your shares for 1790. \n\nMeaning you will receive, per call contract:\n\n100 x 1790\n\nand you keep the credit from the sale of the contract. So essentially you sold your shares for 1807. Just buy them back Monday, for probably less than 1807 or sell a put and get more premium", "score": 1, "replies": [{"body": "Thank you for the info. We’ll see where everything is on Monday", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Do you not know how options work?", "score": 5, "replies": [{"body": "only FDs", "score": -5, "replies": [{"body": "Not even that apparently lol", "score": 5, "replies": [{"body": "Not trolling about it, I’ve been building my own account by buying options but never to exercise and now due to circumstances have to manage a grown ups account by doing the opposite (selling) so I’m new to that", "score": 1, "replies": []}]}]}]}, {"body": "OP, do you really not know how this works?", "score": 5, "replies": [{"body": "My option trading knowledge only covers FDs", "score": 5, "replies": []}]}, {"body": "The good news is you have 360k to invest with", "score": 4, "replies": []}, {"body": "You sold itm calls and you don’t want to lose your shares? Just wtf did you think was going to happen?", "score": 3, "replies": [{"body": "It’s not the end of the world, I was just wondering about the process. At the time I clearly didn’t know enough", "score": 1, "replies": []}]}, {"body": "Friday is the last trading day for options, but they don't technically expire until Saturday. The calls will probably be automatically exercised tomorrow, but you might not see any changes in your account until Monday.", "score": 3, "replies": [{"body": "Okay thank you for the response. Completely new to this side of the game", "score": 1, "replies": []}]}, {"body": "Take that $360K from the shares and all in 1850 FDs", "score": 2, "replies": [{"body": "Orange man tweeted Mexico deal is done so that’s not a bad idea at all", "score": 1, "replies": [{"body": "Except the fact that it will be priced  in almost instantly come Monday morning.", "score": 1, "replies": [{"body": "300% play today. Why is it my most idiotic offhanded suggestions are the ones that end up working the best", "score": 2, "replies": []}]}]}]}, {"body": "Hold fuck you are selling ~$20k worth of contracts and you don’t know how this works. This is why the market makers rob the fuck out of us.", "score": 2, "replies": [{"body": "20k? They were worth 4k on Friday. I’d have to sell two very long dated calls to get 20k", "score": 1, "replies": []}]}, {"body": "Depends on the other party", "score": 1, "replies": [{"body": "Do they still have the option to exercise on Monday?", "score": 1, "replies": [{"body": "Everytime i get assigned to sell my shares it doesn't happen til Monday morning when the Options Center opens", "score": 1, "replies": [{"body": "Oh Boi, praying that whoever bought those calls cant afford to buy those shares", "score": 1, "replies": [{"body": "someone didn't buy \"those calls\". Someone bought a call, and if he decides to exercise then a random seller is assigned", "score": 1, "replies": [{"body": "Okay thank you, I learned something important today", "score": 1, "replies": []}]}, {"body": "ITM options always get exercised.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes. You will lose your shares monday morning. Contract gets exercised afternoon saturday. You will see a alert or email on sunday usually.", "score": 1, "replies": [{"body": "Just got the notification, thanks for the heads up", "score": 2, "replies": []}]}, {"body": "What broker", "score": 1, "replies": [{"body": "etrade", "score": 1, "replies": []}]}, {"body": "Me too. Theyll be taken from you tomorrow.", "score": 1, "replies": []}, {"body": "they will be exercised tomorrow afternoon. you'll get the notification.", "score": 1, "replies": [{"body": "Understood. Thank you!", "score": 1, "replies": []}]}]}
