{"title": "Help me analyze what happened with this options trade?", "selftext": "I'm fairly new to options trading, but I've done my reading and understand at least the basic concepts involved.  I've been steadily losing money paper trading options due to one stupid mistake or another (and learning along the way).  \n\nOn Friday, May 24th, I correctly predicted a small intraday movement downwards in IBM, and bought Put contracts hoping to profit from the move.  However, even though the stock moved down as I expected, the value of my Put contracts actually went down instead of up!  Instead of taking a 4% profit, I took a 4% loss.  Here's the trades I made:\n\nBuy 27 Jun 2013 200-strike Puts, filled for $1.61 (or $161 per 100 shares) at 12:33pm (IBM was $205.79 at the time, and the contract spread was $0.03)\n\nSell 27 Jun 2013 200-strike Puts, filled for $1.56 at 3:24pm (IBM was $205.51 at the time, and the spread was still $0.03)\n\nBetween the time I bought and sold, the implied volatility stayed roughly the same (changed from 16.7 to about 16.3, as reported by my trading platform), and the delta also remained the same (-27).\n\nI've been trying to figure out how the Put could have moved down 8% lower than I was expecting.  Surely the time decay couldn't account for that steep of a drop in a mere three hours?  \n\nDoing the math, here's what I expected:\n\n(205.79 - 205.51) * 0.27 = 0.0756 expected gain in Put price\n\n\n0.0756 + 1.61 = 1.68 expected value of contracts at sell time\n\n\n(1.68 / 1.61) - 1 = 4.69% expected gain in Put price\n\nWhat happened instead is that I had to sell for $1.56, which makes no sense to me.  Here's the [IBM chart with relevant parts shown](http://i.imgur.com/auEgWJx.png).\n", "id": "1f39n0", "created_utc": 1369590609.0, "score": 6, "upvote_ratio": 1.0, "num_comments": 23, "comments": [{"body": "Did you buy the ask and sell the bid?  Do you have the theta and vega values?\n\nedit:  Also there's a three day weekend, so three days of time decay may be priced in.", "score": 3, "replies": [{"body": "I placed a market order.. and if I remember correctly it matched the ask and bid (bought at ask and sold at bid) when it was filled.  I assume a market order automatically does that?  Or do I have to specifically do a limit order at the ask/bid to get those?  \n\nI don't have the exact theta and vega values for when I sold, but when I bought:\n\nvega was 0.19 and theta was -0.08.  At market close (roughly 30 minutes after I sold), vega was 18.2, and theta was showing as 0 (although I'm not sure if that's correct... it's just what my trading platform is reporting).\n\nAnd yes, I'm wondering if the time decay of the three day weekend is resolved in the options pricing by the end of day friday?  I've never heard anyone discuss these sorts of details.  Does this also mean that you should expect all contracts to lose value more rapidly every friday because of the weekend in general?", "score": 1, "replies": [{"body": "Market order is supposed to get you the best available price, if that's the bid/ask that's what you'll get.  Limit orders allow you to set the exact price or better that your order will be filled.\n\nWith IV dropping from 16.7 to 16.3 you have an IV loss of .4, lowering the price of the contract by $.076 (.4*.19).  -.08 theta is lowering the contract by $.08 every day that passes.  \n\nI'm pretty tired, so this math might be messed up but...  Assuming you bought/sold at the ask/bid, we can assume the real theo price is somewhere in between the bid/ask.  With a $.03 spread, we can assume the theo price when you bought was $1.595 and $1.575 (midway between the $.03 spread) when you sold.  Price movement should increase the price to $1.6706 (.27*.28 + $1.595).  Now we have to subtract IV loss and time decay.  So, $1.6706 - .076 =  $1.5946 after the IV drop.  To reach the assumed theo price of $1.575 when you sold, we would have to subtract $.0196 due to time decay.  I would assume that the traders who bought at $1.575 are either using a different pricing model, different inputs into a model, were willing to pay higher than theo for the contracts (which would give them a higher IV), or were subtracting time decay periodically throughout the day (I would expect more time decay to be subtracted this late into the day, so it might be a combination of the above).\n\nAs for weekends affecting time decay, from my understanding and observations its up to the trader.  If a trader wants to subtract Sat/Sun on Friday he can and that will be his theoretical price for the option.  There's no set rule for when time decay has to be factored in, the variable is simply plugged into an option's pricing formula and out comes a number.  If the only trader in a particular market decides to offer a price with weekend decay removed, that's the only price that you're going to see offered.  Whether or not that's the true price of the contract I guess would be up to debate, but that's what we have markets for.\n\nEdit:  Guess I should also add that Vega/Theta aren't constant.  They're going to change as price changes, which would slightly alter the values I calculated.", "score": 2, "replies": [{"body": "Thanks, this explains everything.\nI didn't consider that time decay and IV loss could affect options pricing so drastically.  I'll have to go study the math behind all of this before doing any more day trades of options.  ", "score": 1, "replies": [{"body": "http://www.amazon.com/Trading-Option-Greeks-Volatility-Bloomberg/dp/157660246X/ref=tmm_hrd_title_0?ie=UTF8&qid=1369601410&sr=8-2\n\nKind of pricey new, might be cheaper elsewhere.  Could also buy used if you're not opposed to that.", "score": 1, "replies": [{"body": "Just purchased an e-book version.  Thank you.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Options are not purely directional.\n\nIf you thought IBM was going down, you should have sold short.", "score": 2, "replies": [{"body": "I understand that options have a lot of complex parameters that determine their price, but I thought that at the very least, I covered the major ones.  It seems from the way things worked out though, that something big and incredibly important is missing from my view of how options pricing works.  I mean, the stock went down, and the put options went down.  \n\nThere's a few reasons I don't sell short.  First, even though I'm paper trading with a margin account, I don't use margin, because when I start actually trading, I will only have a cash account with no margin.  Non-margin accounts can't short stock.  Also important here is that the downward move in IBM was fairly small... not enough to beat the commission of making the trade.  With the Jun 200 Put, I was getting a leverage of 35, so even though IBM moved down 0.13%, the contract price should have (theoretically) moved 4.7%. With shorting stocks I don't get that sort of leverage.", "score": 1, "replies": []}]}, {"body": "Isn't black scholes a model (ie it's not going to perfectly predict prices)? ", "score": 1, "replies": [{"body": "No.  It only estimates what the price should be.  The market sets the price.\n", "score": 1, "replies": []}, {"body": "Yes.  But that doesn't explain why the option behaved as it did.  I would love to know what conditions I failed to see that would have at least told me that black scholes was going to be unreliable.  Had I at least known that, I would not have traded at all that day.  ", "score": 1, "replies": []}]}, {"body": "Did you use a market order?  If so, you should never do that.  That includes stop orders (which turn into market orders when triggered).", "score": 1, "replies": [{"body": "Yes, I did use a market order both times.  But isn't a market order supposed to get me the best possible price at the time of order placement?  I figure had I placed a limit for what I wanted, it wouldn't have gotten filled anyway, since the market price is what the market was willing to sell the option/buy the option from me at.", "score": 1, "replies": [{"body": "Typically option price spreads are terrible. Try putting a limit price in the middle of the bid ask spread, the chances of filling is rather high. Stops should still be at market though.", "score": 1, "replies": [{"body": "Strictly speaking, shouldn't stops for day-trading always be limit stops? I mean, the odds of the stock gapping through the stop during the day are low, and in the off chance of a micro-crash, like that one we had because of some twitter post where the markets spiked down and then instantly recovered, you ride out the spike and don't sell at a huge loss.  Does that make sense? I know that limit stops have a tendency to gap, but I thought that mostly happened between market closes and opens.", "score": 1, "replies": [{"body": "What if it was a crash that doesn't recover immediately? There should always be catastrophic stop market orders that should get you out if shit happens.", "score": 1, "replies": [{"body": "I guess there's two categories of crashes: those that bounce back and those that don't.  Market stops work great for when they don't bounce, but will always lose you money for crashes that just spike down and recover quickly.  Maybe it's best to have a triggered market stop of some sort? Like, if the stock/option price reaches the stop value, start a timer for X seconds/minutes.  When it expires, if it's still being triggered, place a market order, if not, then just reset the timer and wait again.  This way you'd step over the little crashes that spike down and back up, but also get stopped out in a matter of minutes if there's a crash.  I figure the crashes that don't recover immediately are also not as steep... there's usually a bit of warning and at least a few technical indicators as something somewhere tries to keep the market up.", "score": 1, "replies": [{"body": "You wouldn't know apriori how far it can drop in a matter of seconds, and how long it will take to bounce up. Such a system would not sit fine through the flash crash of May 2010. It is still better to define your risk every trade and just take the loss if it ever hits.\n\nYou could always set stop limit orders to get out if your stop is touched above where your stop is placed, and then place a stop at a worse price that will trigger in the event of a catastrophic crash that doesn't recover.\n\nJust look at any bearish day and you can see the 1st stop run, a tiny bounce before it goes even further down. How much higher it can bounce is also unknown. If you can figure all of that out, obviously you have an awesome strategy and you shouldn't worry about black swan events (just get yourself stopped out).", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Other's have explained the math of the situation pretty well.  I think the big thing to take away from this situation is that the implied volatility on the options is going to fluctuate throughout the day, and so option movement from the noise caused by fluctuating IV can often overwhelm the option movement created by small moves in the underlying.  If the underlying only 0.1%, IV changes are going to make a huge difference.\n\nIn terms of predicting IV changes, it's probably possible to scalp based on predicted changes in IV, and if one was to investigate how IV moves throughout the day on different stocks, under different conditions, following potential IV changes intraday for a couple months, and testing different hypothesis, they could likely find trade-able patterns there.  My gut instinct says the first place to look would be to examine what happens with IV when stocks move outside their 5 day ranges, and their 20 day ranges, and to compare that behaviour with stocks that open inside their 5/20 day ranges, and trade the entire day within those ranges.  Their also might be some interesting IV behavior when stocks move outside their opening range.  That said, it's a form of trading that I have no experience with, and so I don't know if there is opportunity there or not.", "score": 1, "replies": [{"body": "sloppy.    behavior != behaviour in same comment", "score": 1, "replies": [{"body": "You'd hate to see some of my code. Pretty sure I have classes with variations of that spelling. ", "score": 1, "replies": []}, {"body": "Your completely right.  The change of spelling was sloppy.  How about the content of my comment?", "score": 1, "replies": []}]}]}]}
