{"title": "[deleted by user]", "selftext": "[removed]", "id": "omwvl4", "created_utc": 1626634696.0, "score": 10, "upvote_ratio": 0.82, "num_comments": 24, "comments": [{"body": "IMO, Bank of America is a decent, but not the best banking stock. JPM would be my bank stock pick if I had to make one as they have a rock solid balance sheet and a experienced CEO. Banks are gonna have a good time though, as share buybacks and dividend hikes will become more common post-pandemic.\n\nIf you don’t know anything about investing, put the money in to an index fund that tracks the S&P 500. It is an index that follows the 500 biggest companies in the US and goes up as the companies inside the index go up. And as you dip your toes, you can learn about stock picking.", "score": 10, "replies": []}, {"body": "What’s your cost basis?", "score": 3, "replies": [{"body": "Like $2.79", "score": 8, "replies": [{"body": "my god lol", "score": 15, "replies": []}, {"body": "Solid.  So about 13-14K after taxes.\n\nIt’s not a good long term growth stock, but it’s up to you to use it or your cash.", "score": 3, "replies": []}, {"body": "Do you want to pay the taxes on the gain now? Will you have a lower tax bracket in the future? I would probably use the cash. & find a place to put the remaining cash like a mma or bonds or s&p 500.", "score": 1, "replies": [{"body": "My tax bracket is very low right now as is. Does this make a difference w capital gains? My husband and I don't make very much. We are lucky to live in a family home where we are only paying 4k in taxes a year, so no mortgage", "score": 1, "replies": [{"body": "I was thinking 401 k. Sorry, it makes no difference.", "score": 1, "replies": []}, {"body": "If you're under $40k, your capital gains are 0%.", "score": 1, "replies": []}]}]}]}, {"body": "Mines like $9.  Bought it during the mortgage scandal in 2011", "score": 2, "replies": []}]}, {"body": "There’s an adage that some of the best gains are made by portfolios that have been forgotten about. Your cost basis is incredibly low. BAC will continue going up over time. Will it out pace the market, I don’t know. But this is found money, a very solid company and pays a decent dividend. And for whatever it’s worth Berkshire increased their BAC position while eliminating most other financials so Buffett believes in them", "score": 3, "replies": [{"body": "My Uncle has told me this. He said I should reinvest my dividends. I do like the comfort of knowing BAC won't tank completely. I really don't know much about investing and I need to educate myself. I know its not smart to just have over 30 k in a savings acct when it could be invested", "score": 2, "replies": [{"body": "It all depends. Sometimes sitting on cash is the right thing to do, if you need the cash in the next few years. You never really want to invest money you could potentially need because then you have to time your exit from the market and could be forced to do so at an unfavorable time. \n\nThere’s tons of investing advice and risk tolerance levels that go into the decision. But simply letting yourself forget about this stock and checking back in another decade or two really isn’t a bad option.", "score": 1, "replies": []}, {"body": "Neither will MSFT and NVDA and GOOGL.  I'd sell bac and put it in faang stocks.  WAYYYYYY more growth!", "score": 1, "replies": []}]}]}, {"body": "There’s a few separate things to answer here.\n\n1) You should invest your disposable income. Make sure you have enough money in your checking/savings accounts to comfortably cover your cost of living (which includes IVF), and invest the rest. $32K - $18K = $14K - if that’s more cushion than you need, consider investing some of it.\n\n2) Having your entire stock portfolio composed of a single stock is not ideal. The best approach for casual investors (such as yourself) is to spread their money evenly across the entire market, which mitigates risk and is pretty much guaranteed to go up in the long run. The way I would suggest doing this is to purchase the stock ticker VOO, which is Vanguard’s S&P 500 ETF. So I’d sell all your BAC and instead hold VOO.\n\n3) You will owe capital gains taxes when you sell BAC, which is 15% * the profit you made. The profit you made depends on the share price when it was purchased, which could be nothing if purchased in 1998 when the price was the same as today, or a lot if purchased in the early 90s when it was lower. Regardless of how much capital gains tax you owe, it’s still beneficial to sell / buy an index fund / ETF like VOO. Just make sure to hold some of the proceeds for when you file your 2021 taxes.", "score": 2, "replies": []}, {"body": "Depends how it’s invested, if it’s in a tax sheltered environment move some to SPY to diversify things and pay for IVF with savings. If it’s not, you will take the tax penalty when you sell. How it’s invested depends on how you should proceed. Tax sheltered I’d move 90% to SPY and pay for IVF with savings. If it’s not sheltered, Pull half of it out to pay help pay for IVF and get some of that savings into a diversified discount broker or do what I love to do, Bag-hold SPY. Bank of America is to big to fail so one day it will be back at 40, I just can’t tell you when. it’s at 37 now, in the grand scheme of long term investing that’s basically 40. You were never going to call the absolute peak. Good luck to you", "score": 2, "replies": []}, {"body": "The default for people who dont know anything (which is you) is buy an index fund & leave it there. If you want to extract, extract; but usually its better to let it grow", "score": 2, "replies": []}, {"body": "All major banks got approved to raise their dividends so you would get some better returns on that investment over the long term as opposed to a savings account but if it’s just going to sit there forever then I would just sell it and do what you want with the money.", "score": 1, "replies": []}, {"body": "I would sell some BAC in a little and diversify with well known tech you know will be around forever.\n\n…but also stocks are at all time highs. \n\nI’d do 50/50. As in invest half and just hold half because when the market crashes (which could happen anytime in the next 5 years) you’ll wish you had money to invest.\n\nBut this is just my opinion and predicting when a crash will happen is *almost* impossible.", "score": 1, "replies": []}, {"body": "Yeah, I agree with most of the comments here about diversifying.  I'd sell 75% of it and then find three other companies YOU like to do business with.  If you go to McDonald's or Starbucks for breakfast, buy one of those two.  If you go grocery shopping at Walmart or Costco, buy one of those two.  And then maybe one of the faang stocks for the last of three, like Apple, Facebook or Google.\nThen with your cash money, just set for maybe two hundred dollars a month to go into VOO or something similar.  You'll have a lot more fun that way and be protected.", "score": 1, "replies": [{"body": "Why do you have to go to McDonald's or Wal-Mart to invest in them?  Do you think by going  there that makes you some kind of expert?", "score": 1, "replies": []}]}, {"body": "Diversify is take away #1.  Don’t exit the stock market.  Pretend like you don’t have the money. \n\nPersonally, I think you should sell 50% of it and reinvest in multiple stocks of differing sectors to balance your portfolio out.\n\nI have some BAC myself purchased at $9/share.  Appreciate your post as I had the same question. It was climbing and climbing and then bombed like a freight train.", "score": 1, "replies": []}, {"body": "I would sell 50% of BAC and put it in MSFT GOOGL NVDA and TSLA.\n\nSign up with Fidelity.com and open an IRA.", "score": 1, "replies": []}]}
{"title": "Top Social Stocks of the Week!", "selftext": "This post is in continuation of a series of posts I made in the previous weeks. The response I received was amazing and a lot of you were asking for continued weekly updates.  You can find last week's post [here](https://www.reddit.com/r/wallstreetbets/comments/oi4nmn/i_built_a_program_that_tracks_mentions_and/). I have rebranded it since a lot of you were getting hung up on the title. \n\n&#x200B;\n\nThere is no way easy way to put it. It has been a devastating week in the market for almost all the most popular stocks. SPY also finished 1% down after its continuous rally over the past month. \n\n[ ](https://preview.redd.it/5b0kk7h1azb71.png?width=1246&format=png&auto=webp&s=31d886a04a31f2b96d247347c289125f3d8cf88f)\n\nEven though SPY has been up 4% over the last month, there have been speculations [about the bull market losing its steam](https://stocknews.com/news/spy-inx-dia-iwm-qqq-is-the-bull-market-running-out-of-steam/). The above heatmap showcases that the majority of the gains have come from FAANG stocks and a few other well-known large caps with the rest of the stocks being in the red. Some pundits are stating that this is not a healthy bull market and investors are just buying into easy stocks. Whatever the case may be, let’s jump to\n\n**Most Discussed Stocks of the Week**\n\n[ ](https://preview.redd.it/yfehe0e4azb71.png?width=1044&format=png&auto=webp&s=807d965b5eab9db27b2ef7791f4c0eeb08061297)\n\nKeeping up with the pattern from last week, SPY continues to generate the most amount of discussions. Virgin Galactic became technically the most discussed stock following their historic space launch and then the stock fell every trading day since the space trip, erasing all the gains since early June in the worst week ever for the stock. By Friday, it was down 39% for the five-day period. The main reason for the fall after the successful launch was the dilutive capital raise. Rest all of the stocks are regulars in the list with Tesla and BlackBerry making a comeback to the top 10 list.\n\n**Top Growing Stocks of the Week**\n\n[ ](https://preview.redd.it/7g9inig5azb71.png?width=1233&format=png&auto=webp&s=5ce7c33fdf71bae81bc4d0573f3da13d9306b5c2)\n\nMost of the stocks in the group were generating chatter due to their earnings release\n\n**JPMorgan Chase($JPM):** JPM released their [earnings report](https://www.jpmorganchase.com/content/dam/jpmc/jpmorgan-chase-and-co/investor-relations/documents/quarterly-earnings/2021/2nd-quarter/e5628b2a-f923-4c04-8008-58236a2f7999.pdf) with both the EPS and revenue beating analyst expectations. You should take the returns with a pinch of salt as JPMorgan also released another $3 billion of reserves previously stored away for loan losses back into earnings, which provided a $0.75 benefit to EPS.\n\n**Bank of America($BAC):** BAC also released their quarterly earnings report with them beating on earnings but missing the expectations on revenue. They also followed JPMorgan’s path with the bank releasing $2.2 billion worth of reserve used to protect against losses on bad loans as the risk of a wave of defaults triggered by the pandemic subsides.\n\n**Levi Strauss($LEVI):** LEVI had a delayed trend as the stock [crushed earnings](https://www.cnbc.com/2021/07/08/levi-strauss-co-levi-reports-q2-2021-earnings.html) with the retailer raising the 2021 forecast. This was majorly driven by strong consumer demand from the US and China. [This](https://www.reddit.com/r/wallstreetbets/comments/oiru5g/2020_people_got_bigger_pants_didnt_levi_dd/) hilarious and informative DD on how people got bigger due to the pandemic and how that would lead to more sales for Levi’s was also contributing to the discussion.\n\n**Nokia($NOK):** NOK stock was up more than 9% on Tuesday after the company announced that it will revise its previous guidance upward for 2021. The management confidence is mainly driven by the healthy upgrade cycle as 5G networks expand. Even though the company belongs in the bucket of meme stocks, the company is positive in cash flow from operations and has more cash and short-term investments than debt.\n\n**Tilray($TLRY):** TLRY was generating discussion as the stock has fallen continuously for the last 5 days with the stock ending the week on -14%. While there has not been any specific negative news from the company, the drop can be predominantly attributed to the broad-based selling of all marijuana stocks. Investors were wondering if this would be the ideal time to buy into the stock.\n\nInteresting **insights:** There has been a 940% spike in chatter related to CPI (Consumer Price Index). This shows that inflation is still a major concern for investors and Fed's stance on it is creating even more apprehension in the market.\n\n*Disclaimer: I am not a financial advisor.*", "id": "omr5g2", "created_utc": 1626617185.0, "score": 82, "upvote_ratio": 0.85, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|53|**First Seen In WSB**|6 months ago\n**Total Comments**|195|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/n940ns/i_analyzed_9000_trades_made_by_us_senators_in_the/) [x](https://www.reddit.com/r/wallstreetbets/comments/og6wr4/does_index_inclusion_positively_affect_stock/) [x](https://www.reddit.com/r/wallstreetbets/comments/kl4fhj/one_more_stock_indicator_to_consider_before_your/) [x](https://www.reddit.com/r/wallstreetbets/comments/mtehdq/i_analyzed_all_700_buy_and_sell_recommendations/) [x](https://www.reddit.com/r/wallstreetbets/comments/oawsxf/i_analyzed_last_15_years_of_news_articles_to_see/) [x](https://www.reddit.com/r/wallstreetbets/comments/lbtp0q/dont_paper_hand_gme_due_to_boomer_bots_real/) [x](https://www.reddit.com/r/wallstreetbets/comments/ok4l9c/i_analyzed_the_performance_of_companies_in_the/) [x](https://www.reddit.com/r/wallstreetbets/comments/o70k70/i_analyzed_the_last_3_decades_of_stock_market/) [x](https://www.reddit.com/gallery/kl4ixe) [x](https://www.reddit.com/r/wallstreetbets/comments/njxv95/a_dd_on_inflation_how_it_affects_stock_prices_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/mnho9j/i_built_a_program_that_tracks_mentions_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/nsvma5/i_analyzed_all_the_controversial_trades_made_by/) [x](https://www.reddit.com/r/wallstreetbets/comments/ny6wpp/i_analyzed_3600_ipos_over_the_past_two_decades_to/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Fuck banks, no way they’re a good gamble.", "score": 19, "replies": [{"body": "So you're saying puts on banks", "score": 3, "replies": []}]}, {"body": "Hey guys,\r  \n\r  \nIt's u/nobjos back again with this week's post. I post a similar list every week.\r  \n\r  \nSome FAQ’s:\r  \n\r  \nHow does the program work: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth. I added sentiment analysis to the findings so as to check the general sentiment (whether what is being talked about the stock is positive or negative).\r  \n\r  \nCan I use the code/is it open source: Yes.\r  \n\r  \nWhat is sentiment: It's calculated using natural language processing with a modified version of vadersentiment. You get pre-trained models which classify whether a given statement is positive or negative. I have modified it to analyse financial comments also ( eg. Calls, puts, moon, gain, loss etc). It then classifies the statement between -100% and +100% depending on if it's negative or positive respectively. The numbers you are seeing here is the average across all the comments.\r  \n\r  \nCheers!", "score": 16, "replies": [{"body": "Thanks bro. Great job.  \nA colleague of mine tryed to do something similar, using python as well, but your work is excellent.\n\nPlease keep on it", "score": 2, "replies": []}]}, {"body": "Nok is the only one green here lol", "score": 6, "replies": []}, {"body": "[deleted]", "score": 11, "replies": []}, {"body": "So, Red basically.", "score": 3, "replies": []}, {"body": "Nokia will be $10+ soon ! Golden hand 🚀🚀🚀", "score": 3, "replies": []}, {"body": "+u/user_simulator theirongianttt", "score": 2, "replies": [{"body": "what is this?", "score": 6, "replies": []}, {"body": "For the other way around, the more expensive in America, I can still find a house... buy it.. tear it down to a layperson why some people choose to pay out of pocket by then if it was vegan food. For example, a group of people, and they can go further in the first two and the courts.\n\n ~ theirongianttt\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)", "score": 1, "replies": []}]}, {"body": "Had a data question. Not sure if any of you know it here.\n\nCan we get historical data for technical analysis indicators? For eg. Can I get the data for how many times the cup and handle pattern has occurred over the past 10 years across years?\n\nSo using this we can analyze and finally put to rest the age-old question of whether the technical analysis is a horoscope for men or whether we can actually beat the market using the analysis and patterns", "score": 2, "replies": [{"body": "If relationships are very non-linear, one can conceivably automate some of the less \"voodoo\" methods with specified rules [https://www.cis.upenn.edu/\\~mkearns/teaching/cis700/lo.pdf](https://www.cis.upenn.edu/~mkearns/teaching/cis700/lo.pdf). Extremely unlikely to beat something as simple as ARMA though.\n\nI'd also imagine most of the \"useful\" stuff can be specified in a Markov switching model.", "score": 2, "replies": []}]}, {"body": "LAC Is going to hit $15+ this week!", "score": 0, "replies": []}, {"body": "BNGOorNOGO", "score": -1, "replies": []}, {"body": "It’s spelled stonks", "score": 1, "replies": []}, {"body": "Delicious", "score": 1, "replies": []}, {"body": "I could see tlry but it seems nothing agrees with weed stocks at the moment….though democrats would get ball rolling but seemed like a bull trap", "score": 1, "replies": []}]}
