{"title": "thoughts on  AMD? They will be making the CPUs / GPUs for both the XBOX 720 and the PS4. they are sitting at $2.60 after dropping hard in Nov '12. Is there a reason no one is buying them?", "selftext": "[deleted]", "id": "184mvp", "created_utc": 1360327546.0, "score": 21, "upvote_ratio": 0.84, "num_comments": 33, "comments": [{"body": "Bulldozer/Piledriver performance architectures didn't show the performance that was hoped for and Steamroller is behind schedule, suggesting that the APU design overall may not be ready to take over the market in their current form.  Full implementation of the Fusion design has been delayed multiple times, now slated for 2014.  Die shrinks are a generation behind Intel on current roadmaps and is likely to get worse.  They really [shot themselves in the foot on Llano parts](http://www.theverge.com/2012/7/19/3170455/amd-q2-results-are-in-net-income-down-to-37m-revenue-down-11-percent/in/2361164) when they didn't allocate resources for making the required motherboard chipsets, which caused a large stockpile of the CPUs to build up; piles which they didn't deal with before releasing Trinity CPUs which [weren't good enough to compete with Intel's Ivy Bridge](http://www.pcworld.com/article/255838/amds_trinity_processors_vs_intels_ivy_bridge.html), compounding the slow Llano sales.  AMD first ignored the netbook market, then entred the game just in time for it to be killed by tablets, and then they ignored the emerging ultrabook market, ceding it entirely to Intel.  Now AMD is splitting their focus further by jumping into the ARM processor design area, possibly to try and fix their failure in the mobile space, but [they're starting with server level Opterons](http://www.anandtech.com/show/6418/amd-will-build-64bit-arm-based-opteron-cpus-for-servers-production-in-2014), the opposite end of the spectrum.  There are some rumors this is less a technology choice than it is to make the company more attractive for a buy-out.\n\nTheir leadership has been spotty the past few years (including CEO Hector Ruiz stepping down in 2008, CEO Dirk Meyer being kicked out in 2010, and interim CEO nee CFO Thomas Siefert resigned a few months ago) and last year their final bastion of stability, former graphics [CTO Eric Demers, left to work for Qualcomm](http://www.engadget.com/2012/05/21/qualcomm-hires-eric-demers/).  Qualcomm was the group that [bought AMD's mobile unit and tech back in 2009](http://www.digitaltrends.com/mobile/qualcomm-buys-amdatis-mobile-graphics/) (which is now Qualcomm's Adreno GPU in the Snapdragon CPU powering Galaxy S and other Android phones).  [AMD sold their Austin campus](http://www.theverge.com/2012/11/28/3703632/amd-plans-sell-austin-campus-raise-cash) to raise money, but is now leasing the space back.  The $1.25B settlement from Intel is no longer available to help plug financial holes.\n\nThe xbox720 and PS4 wins aren't likely to make a huge dent in AMD's income woes, as they are rumored to be one-time design agreements, and not long-term manufacturing agreements.  Afterall, AMD has effectively gone fabless after [selling off their Global Foundries stake](http://www.xbitlabs.com/news/other/display/20120304221107_AMD_Sells_Remaining_Stake_in_Globalfoundries.html)\n\nI'm an AMD stock holder and a fan since before the K6 days, but in many ways they've sold off their money-making arms in order to shore up their books in the short term, and with the APU design not showing the real-world performance that was hoped, they're in for a rough near future.  Even being the CPU in the world's largest super computer [wasn't worth mentioning in press releases](http://www.washingtonpost.com/blogs/innovations/post/oak-ridges-titan-supercomputer-is-worlds-fastest/2012/11/15/8fb35754-2f67-11e2-9f50-0308e1e75445_blog.html) about the machine - a huge PR failure on AMD's part. (http://www.anandtech.com/show/6421/inside-the-titan-supercomputer-299k-amd-x86-cores-and-186k-nvidia-gpu-cores)\n\nIf AMD is going to survive, this would likely have to be the low point.  However, I'm almost expecting a full buyout before I expect them to regain their ~2005/2006 position.", "score": 18, "replies": [{"body": "So what happens to your stock if they are bought out? ", "score": 2, "replies": [{"body": "Depends on the details of the buyout.  If someone buys AMD at $3/share, one day I'll have $3 * # of shares show up in my brokerage account.  Not bad if someone bought today at $2.50, but painful if someone bought at $8.50 a year ago.  It could also be cash plus shares of the other company, or just a direct trade of shares. ", "score": 2, "replies": [{"body": "This. Whether AMD succeeds on its own or is bought out does not matter, there is profit to be had.\n\nA buyer just has to worry about the company going completely under with nobody looking to buy them out. Which I think is unlikely.", "score": 1, "replies": []}]}]}, {"body": "I thought the \"Ultrabook\" thing was a branded deal, sort of like when they had \"Centrino\" laptops, and it meant \"Specific Intel CPU,  chipset, and network card.\"  I also heard the Ultrabook brand itself failed to acquire the traction that Intel had hoped for-- basically creating a premium category that competed well with a MacBook.\n\nAlso, I wonder if the Xbox/PS4 deals are in part a branding play-- I can't help but recall the very prominent ATI badge on the GameCube.  not to mention that there might be a fair number of developers who stick with AMD parts during testing and porting because they can expect more predictable behaviour from it.\n\nI also own AMD shares, bought slightly south of $2 in like 2007.\n\nFrankly, what annoys me, from a consumer perspective, is poor availability.  I can get super-cheap AMD desktops and things like the Thinkpad X120 series with those anemic E2-series APUs, but if you want an A6/8/10 machine, you're not gonna see it advertised nearly as much.", "score": 1, "replies": [{"body": "It is, though in the same way it's 'like a MacBook Air', there is the brand, and then the category;  Ultrabook-like that would include MBAs and AMD systems.  They aren't selling massively, but they have a higher profit margin than $300 netbooks, and are 2 (or 3 depending on how you classify them) of the top selling models of 2012; #1 being an ARM chromebook for $250.\n\nYou make a good point about the branding opportunity with the game consoles.  I hadn't considered that.", "score": 1, "replies": []}]}]}, {"body": "Simple reason: Tablets. They have no foothold in what many consider the only real growth market. NVDA is everywhere in that space. ", "score": 7, "replies": [{"body": "So would NVDA be a good investment then?", "score": 2, "replies": [{"body": "Hard to say, since their position in the mobile sphere is probably priced in by now. I'd say if you want to have some chip stock in your portfolio, they're not better or worse than, say, INTC. \n\nPersonally, I would wait a month or two to see if the recession in the US can be avoided (again). If recession hits (and macro data isn't clear currently, the good stuff being highlighted in the media is mostly lagging indicators), the tablet space would suffer quite a bit I imagine.", "score": 1, "replies": [{"body": "thanks for the insight. I forgot that the debt ceiling negotiations are beginning yet again, and will probably cause the market to tank.", "score": 1, "replies": []}]}]}]}, {"body": "because AMD is still (sadly,) losing over 2 Billion cash every year still to this day, while Intel/Nvidia are raking in over 40 Billion.  It would be wise for China to now strike and buyout AMD, to destroy the Intel/Nvidia monopoly.\n\nChina did say it was entering the manufacturing process by 2020, to give us $10 CPU's.  Now would be the right time.  Also, there is a big hidden agenda, as to why Intel recently announced cessation of Motherboard Production in 18 months.  There is a storm brewing in the computing world, many new things on the horizon, and I sincerely hope it is someone to come out with Atomic/Molecular computing, to send all these dinosaurs out into pasture.\n\nMeanwhile, I will be playing GT6 on the PS4 powered by AMD :D", "score": 4, "replies": [{"body": "It's sad. I love this company. I always have. My first real gaming card was the ATI 9800. ", "score": 5, "replies": [{"body": "Same. One of the best things i ever bought was the AMD Athlon, which was rock solid at an amazing price. I recently had to get a new setup and chose the AMD APU A10-5800K and the performance for the price ($120 or so) was incredible. To put together the CPU  / GPU separately would have cost me easily $300. I consider their APU units to be modern miracles. Sadly no one seems to care. ", "score": 1, "replies": []}, {"body": "I agree from a user's perspective. I like their desktop products a lot more than NVDAs. I know of countless NVDA cards having died from heat problems, had several die on me as well. No ATI card died on me yet, and they run a lot cooler so no surprise.", "score": 1, "replies": []}]}]}, {"body": "S&P MAINTAINS HOLD OPINION ON SHARES OF ADVANCED MICRO DEVICES\n|\n\n15 days 22 hours 29 minutes ago - S&P Capital IQ's\nWe are narrowing our 2013 per share loss estimate by $0.08 to $0.36 based on better gross margins and introducing '14's at a $0.12 loss. We expect 2013 to be a challenging year for AMD as it continues to work through cost-cutting and product transitions in an attempt to broaden its exposure outside of the computing market. Although management guided to H2 13 profitability, we remain below guidance as we are cautious on revenue growth in the back half. We see few catalysts for the shares, but no near-term liquidity issues.", "score": 3, "replies": [{"body": "Thanks, this helps explain a lot. But the language that's used - can you EILI5?", "score": 1, "replies": [{"body": "the company is posting a loss but, not having issues with their debt/assets. it's basically saying you should low-ball any buy orders and there may be some struggling during the second half of the year to post profits", "score": 3, "replies": [{"body": "Thanks, I appreciate you taking the time to explain it!", "score": 1, "replies": []}]}]}]}, {"body": "How analysis price a security is by percentages, in the case.  Percentage chance AMD has PS4\\Xbox multiplied by expected profit and projected  sales.  They do this for all the product lines.\nIf you think their analysis is wrong you either buy or sell.\n", "score": 2, "replies": []}, {"body": "It's **expected** that the new PS4 (unveiling on Feb 20th) and the new Xbox will run AMD.  The big question is if these expectations are already factored into the share price? or will there be a small pop upon confirmation that these games systems are indeed running AMD?", "score": 1, "replies": [{"body": "That's exactly my question.", "score": 2, "replies": [{"body": "I've invested in 100 shares at $2.57 on the belief that there will be a slight increase.  As for whether it's already included in the share price, I believe everyone figured it out from [This AMA with an AMD gpu designer](\nhttp://www.reddit.com/r/gamingpc/comments/o777r/iama_amd_gpu_design_engineer/) which is over a year old.  Still, good news is good news.", "score": 1, "replies": [{"body": "where to buy stocks? broker?", "score": 1, "replies": []}, {"body": "The institutions/millionaires that actually control share prices don't read AMA's on Reddit for their buys. I would say it is NOT already factored in. Simply because institutions tend to not buy a year ahead on rumours. They look at charts and all the charts say AMD is doing terrible.\n\n", "score": -1, "replies": [{"body": "As a CFA I can assure you that is not how institutions price securities.\n", "score": 2, "replies": []}]}]}, {"body": "The answer to your question, is yes. The market knew the news long before it was actually in the news.", "score": 1, "replies": []}]}]}, {"body": "I made the mistake and bought them when it was at $2.80. I am hoping the PS4 announcement will bring them back some glory. ", "score": 1, "replies": []}, {"body": "last year was the first year i actually used Intel since like 2002. i've always been amd and i only switched because of the bad state of the company. it's too much of a gamble on nvidia right now.", "score": 1, "replies": []}, {"body": "Oh, they aren't making the new graphics cards this year. Like wtf is going on with them.", "score": 1, "replies": []}, {"body": "Taking a gamble on AMD.  Bought today at $2.70 as I like the company.  ", "score": 1, "replies": []}, {"body": "I'm new to stocks but am a gamer my whole life. It's too early to tell if the new systems will flop because we have no information on them. Personally, i believe people have had it with the consol games and are resorting to casual games that you can buy for a dollar for on the phone.\n\nI'm curious from an investors point of view though.", "score": 0, "replies": [{"body": "Have you played Assassin's Creed?!  \n\nRegardless I think there will always be a market for a specific gaming device... and Xbox and PS have quite the power behind them. ", "score": 1, "replies": [{"body": "The xbox and ps3 was an attempt to emulate the PC market on the consoles. 360 and ps3 no longer can compete with a top PC because it is outdatted. If people really want to play high end games they would just buy a PC at this point. Microsoft and Sony would need a different approach to games than to release a high end system that can potentially leave them bankrupt", "score": 0, "replies": []}]}]}]}
