{"title": "Would it be worth it to sell OTM put options?", "selftext": "Example- let’s say spy or tsla is trading bullish and I see I’m able to sell a put option that expires in 48 hours at a price in which the stock will never reach (99% chance of profit). Would it be worth it to sell 10-20 options for a lower premium credit? (Naked put)", "id": "wqylyu", "created_utc": 1660766584.0, "score": 60, "upvote_ratio": 0.84, "num_comments": 93, "comments": [{"body": "Picking up pennies in front of a steamroller.  The premium collected is negligible compared to the massive losses you could realize.  Not worth it in my opinion.", "score": 153, "replies": [{"body": "Brilliant analogy.", "score": 32, "replies": [{"body": "Few others have commented how great this strategy can be actually. I agree with these two comments. The amount of effort and time it would take to scrape off such low premiums from stocks over and over again to make anything worthwhile to then move up to trade more is a long time and not worth it. The only time I could see doing it is once a week on something like SPY to try to make $5 total to pay for your streaming service lol (with a CSP).", "score": 8, "replies": []}]}, {"body": "He can do spreads too. Not that big of a risk so long as you don't allow the opportunity for pin risk to happen.", "score": 4, "replies": [{"body": "Not really. Spreads mean you have to go closer to the money to find higher premium. Ex: 25% OTM for .05 but to get the same .05 you need to go 15% OTM short leg to sell and buy the ~20% OTM long leg to get the same .05. Otherwise you'll make maybe .01 per spread for at least 10x the downside risk. It's better to do CSP (or at least half secured)", "score": 4, "replies": []}]}]}, {"body": "Yes I utilize this as my main strategy except I am looking at 2 standard deviations and 30-60 DTE. \n\nThe strategy you are looking at is called spellings “LOTTOS”. Go to r/pmtraders and search lottos to get a better understanding of the strategy. \n\nThey are hard opportunities to find but u/somuchranch turned 200k to 1 million in 2 or 3 years I forget and 50% of his profit came from selling lotto’s which are far OTM short DTE puts. \n\nThe general practice is to use a stock scanner too find options that are 25%+ OTM with 1-2 DTE with a bid size of .10+ and ensuring that the stock does not have earnings, mergers or anything else that could cause a large price movement in near future. Staying away from bio pharmaceutical, meme, and small cap stocks is important as well. \n\nIt basically comes down to finding stocks that people are for some reason buying far OTM options on for no other reason then hoping to get lucky and selling their retarded asses those options. \n\nOne thing to note that with this strategy it is most efficiently used with portfolio margin which can allow you to sell hundreds and thousands of puts with a relatively low amount of capital. If you do not have portfolio margin you’ll be limited by the amount of puts you can sell. It’s also important to understand that buying power requirement increases as the position moves against you and in a regular account the brokerage will automatically liquidate your shit even if they are still OTM. In a portfolio margin account they will not liquidate your positions but give you a grace period to liquidate the positions of your choosing to bring you back into good standing. During the grace period you can only close positions and not open any other positions. \n\nPortfolio margin sellers will load up way beyond their buying power on Friday and be “locked” from opening positions and be asked to liquidate positions on Monday but the options expire after market close so it all works out.", "score": 24, "replies": [{"body": "I keep a list of tickers that I like to sell puts on and every Friday I scan them for .07+ bid 25% OTM puts and use up all my remaining buying power (20,000) to sell puts against them and it makes me an extra 100 a week.", "score": 6, "replies": [{"body": "Hell yeah. Something is better than nothing. Go for it. Assuming you have webull no fee. DO IT. I have TDA. I make 200k selling options and I’ve still got a lot to learn. Why anyone would discourage this fella is beyond me. He is SO far out he can’t lose. I sell TSLA puts and CC weekly on my shares. You’re fine OP.", "score": 1, "replies": [{"body": "I use TDA and I got my contract fee down to .35. WeBull doesn’t allow you to sell naked puts unfortunately, neither does robinhood.", "score": 1, "replies": [{"body": "I'm down to 35 cents as well but I asked for lower a month ago.  Can I ask you how many contracts you trade per week?  I would hope this would matter, and I'm sure it does, but it seems they're pretty damn subjective and stingy about lowering fees.  I spend about $500 a month on fees, and I have at this moment 354 contracts open (mostly CC and CSPs, just a few are long options; 90% weeklies, rest further out).  Just looking to compare numbers of activity with other people for the sake of argument with TDA to lower my fee more....or not!  Thanks Zach....", "score": 1, "replies": [{"body": "I sell about 100 naked puts a week which was roughly 260$ a month in fees but now it is 140$ a month. I basically told them that since I am selling far OTM contracts with low bids my strategy only makes sense if I can have a lower contract fee or else I would switch to webull or Robinhood. It was a bit of a bluff since those two brokerages don’t offer naked short options. Luckily the pressure of losing active retail investors to those brokerages was in my favor", "score": 2, "replies": [{"body": "Dude I got about 600 per month in commish.  BUT it's the cost of doing busyiness I guess!  I DO try to buy back below .05 to save that 35 cent fee when I can!!", "score": 2, "replies": []}]}, {"body": "I imagine that you could only get the rumored .05$ or .1$ fee if you have over a million dollars and are actively using portfolio margin to sell a butt load of options", "score": 1, "replies": [{"body": "Yes, I have over a couple million dollars with them and honestly sell plenty of both sides.  I'll bug them for another 5 cent drop at end of month.  I'd rather not move, for example, my AAPL shares (4000) just to save 35 cents on 40 CC contracts because yes, I want to go FAR OTM but on a 0.08 priced option, that fee adds up over time. And my GOOG and GOOGL? well the split jacked up my commission fees 20x as well. Thanks for the response.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'm doing this and it works, except I go for longer DTE and use about 30% of my BP. The \"pennies in front of a steamroller\" and \"you will lose everything\" people are most likely small account holders or have never actually tried it, or both.\n\nYou need a 6 figure account to qualify for portfolio margin. It's best to contribute aggressively and don't take on too much risk (deep OTM credit spreads) until you get to that account sirze. When you have PM, your buying power is calculated differently. You get a favorable BP calculation for options on big stable indexes like SPX as well. \n\nYou still have to manage risk. Big buying power is not some magic trick. But 30% or so of PM buying power is noticeable for sure and  gives you some leverage to work with.\n\nYou don't \"lose everything\" if a put gets exercised. You are assigned 100 shares of the underlying at the option strike price. I've been assigned 4 times from about 3000 trades, and it's actually no big deal if you are smart about risk management. I've been margin called on two of those assignments, because I was in long stock instead of cash. Just stay calm and sell the underlying for the best price you can get. Your broker will automatically adjust your cash balance to cover the margin call when you sell.\n\nI sell puts on high quality underlyings that have recovered for a small profit on the next day, even in the doomsday, steamroller, worst case scary scary assignment and margin call situation. Manage your risk and you will be ok.  If you are risking your entire account balance on meme stocks then yeah you are most likely paying the stupid bill sooner or later. If you have a smaller account, you can't afford much risk and your income will be small. That's just the way it works. Stick to your day job and keep chucking cash in for awhile to grow your account. \n\nLeverage is awesome if you are  smart about it, and leverage can generate some real money. Lottos are basically selling hedges to whales, which is fine with me. With patience and luck I plan to be a hedge buying whale myself someday.", "score": 10, "replies": [{"body": "Extremely well said. The main thing about selling far OTM puts as you’ve said is how you manage your risk. It is by no means a zero sum game when you position size so that you have the capability to acquire shares in the event that you get assigned. You’ve said that you’ve sold 3,000 puts and only been assigned on 4 puts. That’s incredible. So far I’ve sold 350 puts and haven’t been assigned as of yet. When you are assigned that far OTM on fundamentally stable stock their is generally always a rebound. The one time a stock went past my strike it rebounded back above it and still expired worthless. So far I haven’t had to do this but rolling out is always an option as well", "score": 7, "replies": [{"body": "At a certain point, far OTM puts at 0.1 Delta on high cost indexes still earn a decent premium.  The BP required is high, and smaller account holders will criticize the BP requirements as \"capital inefficient\". For the most part, capital efficiency=risk unless you get lucky on an oddly priced option. \n\nYes, this year's nosedive has tied up some BP as I rolled out and down for a small credit. You can roll out and down every few days with SPY and GTC orders. Some small account holders will criticize rolling as \"just hiding a loss from yourself\" and an inefficient use of capital. Well, Rule #1 in this game is to not lose money. If I roll out and down for a small credit, the following things happen- I keep the credit from the original trade, I get a small credit for rolling (sometimes it's a decent premium), I lower the strike and thus the cost of recovery if needed, and recover the Delta that I sold at originally (might take a few rolls). And I don't lose a dime.\n\nYes, I made less money on options this year than last year. I suppose that's the way it is, selling puts in a bear market. Having said that, I made decent dividend income on my longs and didn't sell any shares at all. I think you have to look at the big picture and consider that a \"low profit\" should somehow include the losses that were avoided. I will be well prepared to make serious money when the market turns up again, mostly because I've protected and increased my capital.\n\nI see a lot of traders step up their game and take on more risk when they are not really ready for it. I spend years learning and growing  while a lot of posters seem to take weeks or less. You have to watch things like the recent bear rally to see how it's really going to affect you. \n\nAs the account grows, I will be in a position to finally have some fun with small, risky YOLO plays. At this point however every dollar is important and I keep my probabilities high. I just can't afford it. Of course I'm envious when I see people making huge gains on GME and such, but there is no way in hell I am putting myself in a loss porn type scenario until I have 8-9 digits to work with.", "score": 4, "replies": []}]}]}, {"body": "If you don't have PM use futures..", "score": 1, "replies": []}]}, {"body": "Selling covered puts is great. A great alternative to a limit order for a ticker you are bullish on imo. \nSelling naked puts is asking for trouble. \n\nIf you have to ask, then imo, you should never sell a put or call you are aren't ready to have assigned.\n\nEDIT: cash secured put, as clarified below", "score": 18, "replies": [{"body": "Just to be clear a \"covered PUT\" is a position that combines shorting a stock and selling a PUT. It is a bearish play. \n\nI suspect you're thinking about a spread. For example, sell an Out of the Money (OTM) PUT and buy an even further OTM PUT.", "score": 2, "replies": [{"body": "Nah he's talking about CSP's (as opposed to naked)\n\nPut up cash as collateral to buy the shares at the strike if you get assigned", "score": 12, "replies": [{"body": "Likely so, just wanted people to be aware that there's literally a strategy called a \"Covered PUT\" that's very different than what's being described\n\nMy cash secured puts (CSPs) on BBBY have been rocking this week!", "score": 4, "replies": []}, {"body": "yeah, this one", "score": 1, "replies": []}]}, {"body": "Na he talks about cash secured puts", "score": 1, "replies": []}]}]}, {"body": "This seems like one of those things where you could skim some small profit at the risk of losing everything you have plus a lot more.", "score": 41, "replies": [{"body": "But honestly, the worst case scenario is he/she owns SPY and can just sell covered calls against it", "score": 7, "replies": [{"body": "Assuming puts are cash secured, yes. I'm doing this myself. But OP offers to sell naked puts which are not better than naked calls.", "score": 23, "replies": [{"body": "Yea agree if you have the cash then that’s the way to go and then basically wheel it if you get assigned. Even a week out Tesla otm $800 put is basically $300 bucks you can collect. Granted Tesla can certainly move that much by next Friday. I def sell cash secured put if I lost my shares when selling ccs.", "score": 1, "replies": []}]}, {"body": "That would today be a $42,665 initial investment, or hold if you went short the other way.  Makes a difference.  Just sayin’ ….", "score": 1, "replies": []}]}, {"body": "It doesn’t just seem that way- it is that way. You don’t bet your house for a chance to win free tickets to disneyland", "score": 2, "replies": []}, {"body": "What if you have nothing to begin with🙃", "score": -12, "replies": [{"body": "You need a big account to do the trade. You can’t do the trade with a tiny account.", "score": 15, "replies": [{"body": "That’swhatshesaid.", "score": 0, "replies": []}]}, {"body": "Then you file bankruptcy or lose future money. You do you but this seems risky.", "score": 9, "replies": [{"body": "It was just an idea I had. I don’t wanna blow up my port over something stupid. But it made me think how many other people might do this.", "score": -1, "replies": [{"body": "Better to ask.  Keep asking questions.", "score": 1, "replies": []}]}]}, {"body": "You’d also need to put up collateral in case the stocks drops.  The trading firm won‘t even allow you to make the trade. When you owe the trade firm thousands (margin call), they have to eat the loss.", "score": 1, "replies": []}, {"body": "Then you’re not likely to be approved to sell naked puts.", "score": 1, "replies": []}]}]}, {"body": "Selling puts is an income generating strategy used often. Make sure you know what you’re getting into though. You should be selling high IV puts on stocks you’d be just fine owning. The easiest way to think about this is that you’re getting paid to put in a resting order to buy the stock below market price. If the stock goes below your put price, you own the stock and got paid the premium to buy it at that price. If it doesn’t, you keep the premium. Win win. This all hinges on you wanting to own the stock in the first place. Otherwise you can get stuck holding some stock you don’t care to own.\n\nSelling naked puts on margin is another story. Eventually you’re going to get assigned on them and even 100 wins won’t make up for the 1 loss. Easy way to wipe out an entire portfolio.", "score": 7, "replies": []}, {"body": "Google tail risk…. Spoiler no it’s not worth it.", "score": 7, "replies": [{"body": "No, naked call should scare you", "score": 1, "replies": []}]}, {"body": "Famous last words.  Ask the guys who are down 30 or 40 percent.   “It’ll never drop that far”.  Or my favorite “I wanted to own the stock anyway”.", "score": 4, "replies": []}, {"body": "Sell puts when implied volatility is high. Watch the width of the spreads as they will kill you on entry and exit. Better to sell closer to the money and make it worth your while. \n\nWould you be cool selling a lottery ticket for a penny knowing if your customer hit it would bankrupt you? And it cost you 42 dollars to open the trade? \n\nNo you would want to sell the lottery ticket for 1500 to cover the cost of the transaction.", "score": 3, "replies": []}, {"body": "The words naked put scares me Op..", "score": 7, "replies": [{"body": "No shitadel business here. I was wondering bc in my case, I see spy puts at 400 for maybe 0.04 or so, and I thought it might be an okay idea to sell multiples because spy hasn’t seen 400 since late July and is riding the 420 area.", "score": -2, "replies": [{"body": "Also don’t forget the cost to make that trade at least on tos is $13", "score": 1, "replies": []}, {"body": "You’d sell 10 or 20 calls for $4 each and collect $40-$80 now the likeliness SPY loses 4.5-5% in two days is very unlikely you’re right about that. However, you say 99% that it won’t you’ll make 99 trades just to loose your house on that 100th. Why spend so much time just to loose everything on one trade? You’d be better off finding something in a trend and making directional trades. Even with little money you can make a directional plays with wiggle room. Any strategy using theta decay typically needs capital to play it cuz you get a small amount for the amount risked. This is usually paired with owning shares not always. You technically risk 40k to get $4 granted spy isn’t going to $0. That is neither here nor there. You’d be better off scanning and finding a decent growth stock and owning shares cuz the return would be better and much less risk. Also 20 calls at 400 is “799,960” potential loss I highly doubt if you have little money your broker would even let you make that trade. Also risking 800k to make $80 seems really dumb. Go wait for TSLA to break out a bull run and play the break out. You won’t loose your ass and you’ll get a better return lol.", "score": 0, "replies": [{"body": "Thank you good sir. I will head your advice. It just seems that no matter how I try and put in my due diligence, I always seem to be wrong, or fail to see the profits I expect so I fail to sell when I should. It’s something I’m getting better at, Your comment’s opened my eyes.", "score": 2, "replies": [{"body": "Another way to make $40-$80 would be sell 2 $15 puts same expiration on MARA worst case you buy shares for 3k and sell calls the following week that strategy is called the wheel. You’d make $88-$90 on the puts in 48 hours. You could also sell a $33 put on UPST for $1.30 same expiration and risk $3300. If you didn’t want shares do a longer expiration and not as close to the money. So you have wiggle room to exit at $80 or $100 whatever your target profit is.", "score": 0, "replies": []}]}]}]}]}, {"body": "Keep in mind the collateral requirements, and the fact that you will eventually lose. \n\nA person could do it conservatively and pick up a few pennies. Do it on full margin and one of the times you lose will cost the entire account. \n\nGiven that selling 10 or 20 contracts requires a substantial account, we may be talking about financial ruin.", "score": 4, "replies": [{"body": "You’re not losing anything, you would just have to buy. A LOT", "score": 2, "replies": []}]}, {"body": "Naked no, covered yes. And not so far otm. That's been my best strategy all year so far for index etf's. Boring and profitable.", "score": 2, "replies": []}, {"body": "By 10-20 options you do realize if you are a smart ass and sell naked, that you are obligating yourself to 1000-2000 shares of Tesla currently around 900 a share - 900,000- 1,000,000 . \n\nSuppose an announcement that Twitter won the suit happens - Tesla drops to 450- margin call where is your 450,000 -500,000?? \n\nWhy don’t you just forget it ?", "score": 2, "replies": [{"body": "No matter how out of the money you go - anything can happen - naked puts selling against Tesla? Not", "score": 2, "replies": []}]}, {"body": "Ya there is a guy in thetagang that has been doing this for like more than a year. He’s on heavy margin but makes something like 40k a week selling an insane amount of OTM options for like .01 or .02 premium. They say it works until it doesn’t but it certainly keeps working for him", "score": 2, "replies": []}, {"body": "I've done some backtesting on this for weekly bitcoin call selling. Fixed delta and some leverage leads to pretty decent returns.", "score": 2, "replies": []}, {"body": "Only sell puts at the strike of the stock you would be happy to purchase add shares at", "score": 2, "replies": []}, {"body": "To little reward for etf's.  If I were invested in this strategy, I would sell IRON Condors with .10 Delta or less. 1st, there is a hedge involved. 2nd, make sure your breakevens are really far apart. 3rd, with 30+ DTE you can keep rolling your 'wings' (breakeven pts.) by selling more premium. 4th, you can sell massive amounts of contracts at a minimum of premium - each 'wing' is a hedge against the other so the brokerage house doesn't carry the burden of risk", "score": 2, "replies": [{"body": "I forgot, IV has to be extremely high to max out premium and IV crush. Open interest should also be high", "score": 2, "replies": []}]}, {"body": "This works great until it doesn't.\n\nJust using an example right now in real time, the .01 delta SPY put expiring tomorrow (48 hours) has a $.03/.04 bid/ask.  That is $15 OTM currently.  So your plan is to collect $3 on the assumption that SPY won't drop $15 in 2 days.  Odds are very good that you're going to win and keep your pennies but it's also possible that you could get wrecked, hence the phrase picking up pennies in front of a steamroller.", "score": 2, "replies": [{"body": "Well that didn't take long.  Last Friday would be a good example of the previously mentioned steamroller.  SPY opened at 419 and closed at 405 which could have been a total train wreck.  I don't know where the .01 delta put was at the open but there is a fair chance it got wrecked by the close.", "score": 1, "replies": []}]}, {"body": "I have been burned on naked options before. I won't make that mistake again.", "score": 3, "replies": []}, {"body": "You like playing Russian roulette?", "score": 2, "replies": []}, {"body": "Sad to say ,but I wouldn't listen to most people here. Ask them how do they make money with options ! I make money all three ways and I wouldn't say anything wrong about the other ways! \n\nThe answer is yes I don't a naked short straddle on apple made $500 , people will say stuff, don't care about people that's not making money that's there ego and problem.", "score": 2, "replies": []}, {"body": "Agree with the general consensus that low-delta near-expiration naked options are not a sustainable strategy long term, but naked options in general are ok as long as you keep your trades small relative to portfolio size and manage risk. I sell 16-20 delta naked options in high vol underlyings regularly and close the trade if I lose more than twice the premium I collect. Losses are common, but the gains outpace the losses. Just keep the BPR for each trade at less than 2% of your total account and trade multiple underlyings simultaneously in different directions (some puts some calls) so that if the market moves fast in one direction you don’t lose on every trade in your portfolio.", "score": 1, "replies": []}, {"body": "If you control your losses with stops the steamroller will break down before it gets to you.   Just do not get greedy and especially do not make a few successful trades in a row then go closer to itm because you think you can get a little more premium.", "score": 0, "replies": []}, {"body": "You can sell a csp with a stop loss. So it doesn’t run you over.", "score": -1, "replies": []}, {"body": "The only naked option Ill ever take is the option to be naked with my girl. 🤣🤣", "score": -2, "replies": [{"body": "You mean our girl?", "score": 4, "replies": []}]}, {"body": "this worked for me until i did it on coinbase. the next day it moved like %20 against me", "score": 1, "replies": []}, {"body": "If Spy is at 427 and you're selling 420p at 48hr exp... ABSOLUTELY. The real question is whether you have enough margin to afford such", "score": 1, "replies": []}, {"body": "I sell puts on shit I want but not leaps.", "score": 1, "replies": []}, {"body": "Obviously, you dont need to wait until the expiration, if you buy it back at a cheaper price, then you're in the clear. I wouldn't sell those options and then close my eyes & hope for the best though, you will have to manage them.", "score": 1, "replies": []}, {"body": "Isn’t this just a cash secured put?", "score": 1, "replies": [{"body": "Yes, without the cash secured part", "score": 1, "replies": []}]}, {"body": "It was worth it 2 months ago. The “1% chance of loss” will blow up your account if/when it happens. Picking up nickels in front of a steamroller. Does no one remember Long Term Capital Management?", "score": 1, "replies": []}, {"body": "As a rule you don't want to sell naked puts that you can't cover in some way. What you're talking about could blow up in your face. The proper way to do it is to have at least 50% of the purchase price on whatever you plan on doing available. It can be wrapped up in other things but you generally don't want to over-leverage your account. With every short option you put on you have to think about what you would do in the worst case scenario and or have a planning place that moves with your deltas", "score": 1, "replies": []}, {"body": "Freak in the sheets but never getting naked in this game playboy", "score": 1, "replies": []}, {"body": "You would likely not be allowed to, with the massive amount of collateral you may need to let you make the bet.  Worst case is that you have to buy a fuck ton of stock that you won’t have the money to buy.", "score": 1, "replies": []}, {"body": "If you do it I would sell calls as well then set a stop. You can only lose in one direction so if the market drops the gain on the calls will help offset the loss on the put side.", "score": 1, "replies": []}, {"body": "Sure … if you can get it paired.  There comes a point where the strike is so unlikely, nobody wants it or tying up the money for a dollar + or - the option fees isn’t worth the trouble.  Like one of my trading circple says, “Nobody wants that gem!”", "score": 1, "replies": []}, {"body": "Yes sell them around Fed”s meeting. You will make a killer!", "score": 1, "replies": []}, {"body": "Only do this on stocks you wouldn’t mind owning long term… and never naked. That’s just dumb.", "score": 1, "replies": []}, {"body": "At least make it a credit spread to limit your losses", "score": 1, "replies": []}, {"body": "The risk vs reward just seems like you are risking 90K for a chance at a free combo meal. 2 DTE seems easy but you are also getting the shittiest premiums ever with 5 figures as collateral.", "score": 1, "replies": []}, {"body": "1. It works great until it suddenly doesn't.\n2. Does your strategy beat the S&P 500?", "score": 1, "replies": []}, {"body": "This is a dumb question but selling a naked put is essentially selling the contract with no actual way to purchase the shares if assigned?", "score": 1, "replies": []}, {"body": "I'd hold off in case this is a bear market balance.", "score": 1, "replies": []}, {"body": "the problem with 1/100 chances is the 1 time it hits you get ruined for months or years. Stay away from it.", "score": 1, "replies": []}, {"body": "I would go with long date sell puts when a good stock dips.like NVDIA WILL after earnings!", "score": 1, "replies": []}, {"body": "99% chance of profit sounds like \"free money\". Anytime I have referred to a trade as \"free money\", I lost money.\n\nSelling next to zero day to expiration options is a bad move due to increased gamma risk. If you don't know what gamma risk is, than don't sell options yet (not being rude, just direct. I hope you learn all the things!)\n\nGo to Tasty Trade's website and crawl through their videos. They have excellent information for selling premium that is derived from decades of trading experience and back testing strategies. \n\nIt's all numbers and math based there. Great way to learn. \n\nStart by typing, \"tasty trade selling put\" into Google. (Or \"tasty trade short put\")", "score": 1, "replies": []}, {"body": "Imagine having over $25K and a level 3 or level 4 trader and doing this. Give me your money dude, give me $2500 and I will pay you back $5000. Oh man srsly this life gives money to people who don’t know nothing.", "score": 1, "replies": []}]}
