{"title": "Tesla, Inc. 2022 Annual Meeting of Stockholders", "selftext": "", "id": "wgbgx6", "created_utc": 1659645268.0, "score": 126, "upvote_ratio": 0.98, "num_comments": 93, "comments": [{"body": "Elon seems really happy and relaxed here. I'll take it as a good sign.", "score": 89, "replies": [{"body": "Yeah, this might be the best I've ever seen him. Super super natural.", "score": 39, "replies": [{"body": "And no needlessly antagonistic throw away lines to create distracting headlines (yet... 🤞). On good form.", "score": 17, "replies": [{"body": "Well…. He did say he’s going to return to his home planet.  Hit piece from the WSJ coming in 3… 2… 1…", "score": 10, "replies": []}]}]}, {"body": "yeah he's in the zone today", "score": 17, "replies": [{"body": "He let it slip that he really is from another planet. Although given his confidence that earth can and will be saved, Elon isn't returning to his home planet anytime soon. \n\n\nI am surprised how low are Nvidia and amd on the list of most desirable places to work \n\n\nPS a wild Gary Black appeared", "score": 10, "replies": []}, {"body": "E̶̥̲̗̱̎̈́̏̉͝ͅľ̵̢͔̫̟̟̯͎͈̭̔̏̈̾͛̎̀̍o̵͚̣̙̼̼͆̇̔̓̾̒̚͝ͅn̵̤͇͉̒̏́͗͘͘ͅ ̶̩̙̫̹̟̀ͅi̶̺̮̾̽̿͘͠ś̶̡̛̩̻̜̰̘̂͘ ̶̢̘͙̠̅̿͋̄͠ṃ̵͖͖̲̼͕̩̬̆͒̀̐i̵̤̖̺̞̲͗͝c̷̢̨͕͍̣̳͚̙̭̓ṛ̶̡̮̩̬̠̞͇̐͋o̵̱̻̣̭̘̗͔͊ ̸̻̙̰̝͍̹̿̄͆͗̈͜͝ḑ̵̝͕̮̳̊̎̀̎̓̾̈́͠ó̶̧̜̞̰̞s̴̛̹͇̱̣̳̳͂͗̏ḯ̷̭̰̅̔͒̑̍̽ͅṅ̶͎͖̞̦̹̪͎̟̥̏̏͌̊ģ̵̘͕͔̩̤̄̋́͐̍̾͘", "score": 1, "replies": []}]}, {"body": "He said “buying opportunity”", "score": 10, "replies": [{"body": "Mars and cars, chips and **dips**", "score": 5, "replies": [{"body": "I’ve seen this before! What was the time of the tweet?", "score": 1, "replies": [{"body": "It's the description on his twatter- been there now for at least two weeks: https://twitter.com/Elonmusk", "score": 1, "replies": []}]}]}]}, {"body": "we are in the #ElonMust reaction day. Almost falls after Elon gives a speech.", "score": 0, "replies": []}, {"body": "Is anyone else happy to see Elon admit that sometimes he says stuff that hurts himself. It's a self acknowledgement that's appreciated.", "score": 1, "replies": [{"body": "I never thought that he denies that he never says things that hurt himself, I think he just doesn’t care that he does.", "score": 1, "replies": [{"body": "Right, but I like what he said here. Rather than saying \"I say what I want whenever I want and I don't care what people, including the shareholders, think\"", "score": 1, "replies": []}]}]}]}, {"body": "Get your bingo cards out", "score": 15, "replies": [{"body": "We need to add Chucks Left Turn to the bingo card", "score": 13, "replies": []}]}, {"body": "“Hurr durr, I don’t have a question I just want to waste everyone’s time with cringey fanboying”", "score": 53, "replies": []}, {"body": "Is Rob at this no live stream from him?", "score": 12, "replies": [{"body": "Yes, he's there.", "score": 11, "replies": []}]}, {"body": "Elon said he's half Canadian :-) Love it. He mentioned that he might be ready to announce another factory location. Any guesses where?", "score": 9, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Indonesia Thailand or Malaysia has always been my guess for the next factory. Indonesia is a nickel producer and Australia is right next door with massive Lithium production.\n\nDownside is corruption and dodgy governance. Slightly worse than Malaysia and Thailand. Thailand has an existing car industry so would be potentially viable. Malaysia had the proton car factory not sure if that still exists. Any of the 3 would work. \n\nAustralia has a deep pool of all the skills required plus all the battery mineral resources  but it's expensive to locate there. The subsidies that kept the local car industry alive were removed a decade ago by the just exited conservative govt, so gathering the skilled factory workers back might be tricky, they'll have moved on. Factory could easily be run on 100% renewables electricity without much trouble though which is a plus\n\n I'd stick it as a maybe but lower than Asean countries. .", "score": 3, "replies": []}, {"body": "Please stop with India nonsense. Tesla sells premium vehicles, so population size is irrelevant, what counts is the number of people with enough money. As an example, Brazil has 2x more sales of premium cars than India.", "score": 1, "replies": []}]}, {"body": "I think somewhere in Asia", "score": 3, "replies": []}, {"body": "Somewhere In the US or China", "score": 2, "replies": [{"body": "based on his reaction to the question about geopolitical tension with China I highly doubt Asia is on the cards", "score": 3, "replies": [{"body": "I disagree, his reaction to the china question was clearly \"i am studiously avoiding making any comment that will blow up\" \n\nAsia is not just China anyway. SEA is a very probable location. Low cost labour, educated workforce, most of them carefully neutral between US & China (or mildly China negative)", "score": 2, "replies": []}]}]}, {"body": "South America", "score": 3, "replies": [{"body": "México", "score": 3, "replies": []}, {"body": "Lol no way. Infrastructure is so bad there. Likely Indonesia before South America. Canada, us east, UK, Australia, Japan all more likely.", "score": 5, "replies": []}]}, {"body": "My guess is a second one in Europe, perhaps in Spain or Czech Republic. \nCould also be a second in the South of China, but that puts too much risk in the company. \nAlternatively, Japan, but the establishment there would make it very hard", "score": 1, "replies": [{"body": "I don’t think so because a) first European experience was by far the worst of the three gigafactories and b) they’re just beginning to ramp their European GF, no reason to start another in their smallest major market until they have it maxed out.", "score": 0, "replies": [{"body": "Europe will be the largest EV market, next to China. Makes perfect sense.", "score": 0, "replies": [{"body": "Hm I don’t think so - Last time EU+UK+EFTA-Malta had more passenger vehicle sales than the US in a year was 2011 (and their lead in 2008-2011 was due to the recession/bankruptcy/bailout). Do you see that shifting? (Genuinely curious)", "score": 1, "replies": [{"body": "Nothing to do with general market size. It's about EV demand, which is much higher in Europe than us.\nEspecially after this Russian invasion, people want to ditch gas and oil", "score": 0, "replies": [{"body": "We’ll see, perhaps that’s true temporarily. Over time though the US will be the #2 market for Tesla as EVs become more and more the norm.", "score": 2, "replies": [{"body": "I think us will be #3. European market might even become #1, at least in revenue", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "I'm a Tesla driver, stock holder and supporter of the mission... But don't you guy feel weird having all those cheers,  \"thank you for saving the world\" messages and talks about other Musk companies in a shareholder meeting?\n\nI'm not saying it has to be all silence, suits and professional, but you have an hour to ask company questions, why not focusing on business and future growth instead of wasting this valuable time?\n\nAlso, why only the CEO at a shareholder meeting? I would love to hear from other C levels as well.\n\nI know I will be destroyed by downvotes, but that's my feeling watching the recording.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Actually I didn’t hear much that was new.  A stronger statement that they’ll announce the next factory site by end of year, but I can’t think of anything elee?", "score": 11, "replies": []}]}, {"body": "Great answer on China/US question, he knows how to play politics well. It was a perfect answer for China, you could in fact say it was answered in Chinese.", "score": 10, "replies": [{"body": "I can't believe that question made it there. What a foolish thing to ask...", "score": 9, "replies": []}]}, {"body": "These idiot activists are unbearable", "score": 34, "replies": [{"body": "Has 3 minutes to address shareholders to win their vote. Begins the speech with \"Dear chairman and Board\", doesn't mention shareholders. Runs out of time. In a recorded message.  \n\nAnd this mess of a person works for a fucking investment fund.  \n\nWHAT THE ACTUAL FUCK", "score": 33, "replies": [{"body": "At least their performance matched their cognitive capabilities accurately.", "score": 5, "replies": []}]}, {"body": "Yeah I was scratching my head on that.  \n\nYou want to change the direction of one of the biggest companies in the nation, you want to get the attention of Tesla shareholders.  So you make a petition and get your 3 minutes of attention.  And do you fly to Texas to make your case in person?  No.  You use a scratchy cell phone speakerphone and nobody can understand you because it sounds like you're driving on the highway.  \n\nI don't get it.  If you really believe the proposal will make your stock price go up, why not spend the couple hundred bucks and fly to Texas to make your plea in person?  Or at least find a real phone and/or a good quality headset?  \n\nAnd if you KNOW you have 3 minutes exactly, how stupid do you have to be to submit a >3min *recording* when you know it'll be cut off?  \n\nAt least that one person bothered to actually show up rather than (literally) phoning it in.  Seems to me if you really think your idea will increase shareholder value (including your own) you'd buy a plane ticket and be there in person.", "score": 2, "replies": []}]}, {"body": "lol the audience clapping 🤣", "score": 18, "replies": [{"body": "It's the same activist and woke investors every year. Most if not all of the proposals are unnecessary or just hinder the company's ability to execute.\n\nAnd immediately downvoted. Lmao.", "score": 32, "replies": [{"body": "Using woke as a pejorative doesn't do you any favors, friend", "score": -15, "replies": [{"body": "I don't believe it is used for anything but a pejorative nowadays but ok.", "score": 15, "replies": [{"body": "Hah, not remotely 😁", "score": -20, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}, {"body": "It does actually.", "score": 7, "replies": []}, {"body": "I beg to differ", "score": 3, "replies": [{"body": "That's nice.  So? 😁", "score": -4, "replies": []}]}]}]}]}, {"body": "nuns.... ugh", "score": 12, "replies": [{"body": "I tuned them out. Didn't want nun.", "score": 10, "replies": [{"body": "No nuns! No nuns, none!", "score": 2, "replies": []}, {"body": "My anaconda don't want nun", "score": 1, "replies": []}]}]}, {"body": "Pie in the sky, but do you think they have the original Cybertruck prototype on display to show the difference and roll out the new final design at the meeting? One can hope.", "score": 7, "replies": [{"body": "My guess is no, but I hope for me to be wrong.", "score": 7, "replies": []}, {"body": ">Pie in the sky\n\nGood thing we got SpaceX rockets for that. Impossible is nothing for Elon", "score": 2, "replies": []}, {"body": "I was thinking the opposite for the Roadster, it was nowhere to be found unfortunately", "score": 2, "replies": []}]}, {"body": "oohhh...cool ~~cowboy~~ cowboy-inspired-trap-beat-post-modern-industrial music is coming on!", "score": 8, "replies": []}, {"body": "🚀 🚀 🚀", "score": 4, "replies": []}, {"body": "Can anyone provide the link to the annual report, I can't seem to find it on the https://ir.tesla.com website.", "score": 3, "replies": [{"body": "No report expected today. Tesla makes the reports quarterly and they should already be on ir.tesla.com", "score": 5, "replies": [{"body": "Ahh yes of course, the 2020 one was the last one. Forgot about that. A bit annoying to be honest - a decent AGM pack is a good resource\n\nThanks", "score": 3, "replies": []}]}, {"body": "Do they do an annual report? I don’t remember one from last year.", "score": 2, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Annual report is here:\n\nhttps://www.envisionreports.com/TSLA/2022/16A04MY22E/default.htm?voting=false\n\nReally confusing to get to. Had to click the virtual meeting link on the ir.tesla.com site.", "score": 2, "replies": []}]}, {"body": "He’s so awkward.  I love it.", "score": 11, "replies": [{"body": "Don't drop the akward-card when it is not due. No - today he was really relaxed and looked pretty damn handsome!", "score": 14, "replies": []}, {"body": "his awkward silence lapsuses are the best, is like he has to constantly pull himself back to earth", "score": 2, "replies": []}]}, {"body": "I like your idea of simply posting the main video -- wonder if we should do that at r/TeslaMotors.  Usually we detail time info but maybe it's not necessary.", "score": 7, "replies": [{"body": "Me too, the video includes a countdown which I find more useful than having to convert time zones.", "score": 6, "replies": [{"body": "Yeah, I will try to do that. Next time, most users are mobile anyway.\n\nEdit: iOS Auto punctuation sucks on iOS 16 beta… lol", "score": 0, "replies": []}]}]}, {"body": "hey guys, I want this music in my playlist on Spotify, is anyone going to compile one?", "score": 4, "replies": [{"body": "Wouldn't be surprised if this is one of Elon's personal playlists lol. Try tweeting at him.", "score": 3, "replies": []}]}, {"body": "Wonder if someone will ask about Tesla expanding into Shipping i.e. Sailing Ships making a return but also with Battery powered propulsion etc.", "score": 1, "replies": [{"body": "Don't think we have good enough batteries for that yet,  Even if the entire top of the ship was solar panels.", "score": 2, "replies": [{"body": "There is a lot of weight in the bottom of ships, with some protection couldn’t that weight be batteries?", "score": 3, "replies": [{"body": "Yes, I suppose it would depend on how far you wanna go.  If it's crossing the English Channel, then you could probably build a ferry that charges inbetween loading.  If you wanna go from China to half way across the world I don't think we are there yet.", "score": 3, "replies": [{"body": "\\+ ports would need megachargers x5 while docked to recharge.", "score": 2, "replies": [{"body": "Would there be fuel savings? I dont know what they pay for fuel on ferries.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "But they wouldn't have to use Batteries constantly simply used the Wind to push the Ships via Sails.", "score": 1, "replies": [{"body": "I think they are trialling a ship like that now... or they are designing one.  I can't remember as I saw the article ages ago.  \nEdit: with Sails I mean.", "score": 1, "replies": []}]}]}, {"body": "No, not enough energy density for batteries", "score": 1, "replies": []}]}]}
{"title": "2 Fast 2 VERUious", "selftext": "# Alright, you plebs. Sit down and let me tell you a story about $VERU and its little friend, Sabizabulin.\n\n**You might be asking, da fu\\*\\* is Sabizabulin?**\n\n**Read the results of the study yourself:**\n\n**RESULTS**\n\nA total of 204 patients were randomly assigned to treatment: 134 to sabizabulin and 70 to placebo. Baseline characteristics were similar. Sabizabulin superiority was demonstrated by a planned interim analysis for the first 150 randomized patients. Sabizabulin treatment resulted in a 24.9 percentage point absolute reduction and a 55.2% relative reduction in deaths compared with placebo (odds ratio, 3.23; 95% CI confidence interval, 1.45 to 7.22; P=0.0042). The mortality rate was 20.2% (19 of 94) for sabizabulin versus 45.1% (23 of 51) for placebo. For the key secondary end points, sabizabulin treatment resulted in a 43% relative reduction in ICU days (P=0.0013), a 49% relative reduction in days on mechanical ventilation (P=0.0013), and a 26% relative reduction in days in the hospital (P=0.0277) versus placebo. Adverse and serious adverse events were lower in the sabizabulin group compared with the placebo group.\n\n**CONCLUSIONS**\n\nSabizabulin treatment resulted in a 24.9% absolute reduction in deaths compared with placebo in hospitalized patients with moderate to severe Covid-19 at high risk for ARDS and death, with a lower incidence of adverse and serious adverse events compared with placebo. (Funded by Veru, Inc.; [ClinicalTrials.gov](https://clinicaltrials.gov/) number, NCT04842747.)\n\n# You: But 👑 Plebs, I'm an idiot. What does this even mean?\n\n“Its demonstrated ability to improve outcomes in those at high risk of acute respiratory distress syndrome (ARDS) and death distinguishes sabizabulin from MRK's Lagevrio and PFE's Paxlovid, indicated for milder disease and for which respective US government procurement contracts worth $2.2B and $5.3B have been awarded,” Gershell commented. **“With the global pandemic showing little sign of abating and BARDA to be allocated $9.25B in additional COVID-19 funding, we believe sabizabulin will serve critical roles in the US and abroad.”**\n\nTo this end, Gershell reiterated an Outperform (i.e. Buy) rating on VERU shares, while boosting the price target from **$25 to $36.** Think you’ve missed the boat on this one? Think again. **Gershell’s target makes room for gains of \\~200%.**\n\n# TL;DR VERU made RONA pills and will go BRRRRRR\n\n# You: What about for my homies in the back that only care about squeezes?\n\n&#x200B;\n\nhttps://preview.redd.it/wh8qn1zvmpf91.png?width=1080&format=png&auto=webp&s=de6bca57c6e320e1d1d1da424ec8a2a8f566a4fa\n\nWell, good news, you little autists. $VERU currently has **42.84% SI with 80,070,000 outstanding shares.**\n\nIf only it had some sort of catalyst coming up that could trigger a run on the stock…\n\n**The European Medicines Agency's (EMA) Emergency Task Force (ETF) has started a review of Sabizabulin for treating COVID-19.**\n\n**You: So what?**\n\n**Me: \\*slaps you\\***\n\nOnce the EMA completes its findings, Sabizabulin will be authorized to be used in all member states. That means VERU is going to sell the ever-living shit out of Sabizabulin to the EU running up into flu season. Not only that, approval by EMA also helps FastTrack approval for the US (see above multi-billion dollar contracts.\n\nThat's not all!\n\nOn June 6th, Veru also submitted Veru has submitted an [application](https://verupharma.com/news/veru-submits-emergency-use-authorization-eua-application-to-u-s-fda-for-sabizabulin-its-novel-oral-antiviral-and-anti-inflammatory-drug-candidate-for-hospitalized-covid-19-patients-at-high-risk-f/) seeking emergency use authorization (EUA) from the US Food and Drug Administration (FDA) for a 9mg dose of oral sabizabulin to treat moderate to severe hospitalised Covid-19 patients.\n\n**“We have also scaled up manufacturing of sabizabulin 9mg capsules to meet the needs of patients in the US and are building our US infectious disease commercial franchise.”**\n\nThey already started making enough supply to sell to the US immediately. Just like the EMA, the US also fast-tracked the approval process and should be approving it any day now.\n\n**So to recap:**\n\n1. VERU is making an oral RONA pill that reduces deaths by 25%\n2. Sabizabulin is getting fast-tracked by the FDA\n3. Sabizabulin is getting fast-tracked by the EMA\n4. Over the course of the next 30-days, we will get 2 announcements of Sabizabulin being authorized for emergency use in the US and EU and they have already started making supply to prep for this.\n5. Oh yeah, they have earnings on August 11th, but more on that later.\n\n# You: So who's buying?\n\nFU\\*\\*ING EVERYONE! And you should be too. Even pharma bro legend [/u/martinshkreli](https://www.reddit.com/u/martinshkreli/) got in on it thanks to Huzzies main squeeze, Jupe. Here he is on his [Trading Competition: Day 4](https://youtu.be/IZ-mhhWbsHc?t=16191) stream, buying shares and putting together his own DD.\n\n# You: What's the flow?\n\n# Me: Here is a snapshot of the order flow from yesterday.\n\n&#x200B;\n\nhttps://preview.redd.it/fxczapbzmpf91.png?width=3572&format=png&auto=webp&s=340881f9bdbc23e3f70d06cedc8e0367c1d58a8c\n\n# You: How about Dark pools?\n\n# Me: Here is a purchase for 1,000,000 shares at 12.34. How do you like them, Dark Pools?\n\n&#x200B;\n\nhttps://preview.redd.it/va8lcq64npf91.png?width=1788&format=png&auto=webp&s=fc0ddeadaf25ddfe8f201f0ede5b7c912c004465\n\n# You: Look, this is all a bit over my head. I am a simple autist who plays with crayons in the corner. How high can it even go?\n\n# Me: Conservative PT is around $32 dollars, with some bullish cases up to $76.\n\n&#x200B;\n\nhttps://preview.redd.it/x5qc9153npf91.png?width=589&format=png&auto=webp&s=0910b0996493f13912249dfb62c8bec47e15f987\n\n# Me: Here are your crayon drawings, kids.\n\n&#x200B;\n\nhttps://preview.redd.it/8ho26wu4npf91.png?width=1356&format=png&auto=webp&s=88d8589e703cb3ac6d9a0d13ab24f2fc5d5935df\n\n&#x200B;\n\n[shout out to Flash](https://preview.redd.it/1hsahyl5npf91.png?width=1275&format=png&auto=webp&s=7a803bbcbd74c0c233c6ff94b3ca7a229191feb6)\n\n&#x200B;\n\nhttps://preview.redd.it/7lks4507npf91.png?width=1440&format=png&auto=webp&s=accd69e274251422efd11967ee109f452bfe9abf\n\n# You: But I'm kind of 🌈 🐻 curious, what's the bear case?\n\nOppenheimer & Co Inc closes position in VERU / Veru Inc\n\n*2022-05-11 - Oppenheimer & Co Inc has filed a 13F-HR form disclosing ownership of 0 shares of Veru Inc (US:VERU) with total holdings valued at $0 USD as of 2022-03-31. Oppenheimer & Co Inc had filed a previous 13F-HR on 2022-02-02 disclosing 19,194 shares of Veru Inc at a value of $113,000 USD. This represents a change in shares of -100.00 percent and a change in value of -100.00 percent during the quarter.*\n\n$VERU has $13.03M in Revenue with a Net Profit Margin of -108.82%. Read all of the financials [HERE](https://finance.yahoo.com/quote/VERU/financials?p=VERU). It doesn't really matter. This is pharma world where small companies make the perfect drug and moon. See MRNA for an example of this. VERU's small/kind-of poor company outlook only increased the SI, which is good for us and bad for them.\n\nThat's it. That is the bear case. Sabizabulin is overwhelmingly a positive result and should pass…even according to Oppenheimer, who probably regrets selling 19,194 shares right about now.\n\n*\"Oppenheimer said that a new analysis conducted by Veru (NASDAQ:VERU) on mortality rates in a phase 3 trial of its COVID-19 therapy sabizabulin assuages concerns* ***and will lead to an Emergency Use Authorization from the U.S. FDA.\"***\n\n&#x200B;\n\nhttps://preview.redd.it/q5mknba8npf91.png?width=586&format=png&auto=webp&s=d9329b4b21b917462f04884fc5a4a392fd8412f9\n\n# You: Okay, okay. This all sounds pretty bullish, but when will this even happen?\n\nT**he review of sabizabulin was started on 27 July 2022** under Article 18 of Regulation 2022/123, following a request from Germany. EMA’s Emergency Task Force (ETF) will conduct the review in accordance with Article 18 (3) and send recommendations to EMA’s Committee for Medicinal Products for Human Use, which will issue the Agency’s opinion.\n\n# You: Yeah, but that could take months!\n\n# Me: Nuh-uh.\n\nI read the charter that created the EMA's Emergency Task Force (ETF) Typically, reviews of studies take up to 200 days. However, they established the ETF in 2022, **which is authorized to rush COVID-related studies.**\n\n*Article 15, section 7: The ETF shall perform its tasks as an advisory and support body separate from, and* ***without prejudice*** *to, the tasks of the scientific committees of the Agency as regards the authorization, supervision, and pharmacovigilance of the medicinal products concerned and related regulatory actions to ensure the quality, safety and efficacy of those medicinal products.*\n\nBecause we are technically in a state of emergency, they are granted special privileges \"without prejudice\". According to the charter,\n\n# Me: Now pay attention. This is the most important part.\n\n*Article 16, section 2: Where a developer engages in an accelerated scientific advice process,* ***the ETF shall provide the advice referred to in paragraph 1 free of charge at the latest 20 days after the developer submits a complete set of the requested information and data to the Agency. The advice shall be endorsed by the EU member states.***\n\nThe EMA meets on a monthly cadence, but because we are in a state of emergency, member states are allowed to hear the ETF's findings and vote via remote meetings. This means that the very latest they will present findings to the EMA is August 16th. EMA has scheduled meetings on August 16th, 17th, 18th, and 19th.\n\nAt the very latest, we should know if Sabizabulin will be approved for use by the EMA on **August 16th, if not earlier.**\n\n# You: Is there anything else?\n\n# Me: Yes!\n\n**Veru has earnings on August 11th.** Because of this, we will see a ramp in IV leading up to that date with a potential drop-off, pending whatever news they drop on that call... All this is, is another opportunity to buy at a lower IV. When the EMA announces the approval of sabizabulin later this month, it won't even matter. Shorts will get squeezed, our dicks will get hard, and we will get paid.\n\nNot to mention the upcoming emergency use of sabizabulin by the FDA. Some rumors have that being approved tomorrow, 60-days from when it was submitted. That is why you see a massive options order flow for 8/5.\n\n# You: I am dumb and can't read so good. What is the TL;DR?\n\nThis play has something for everyone. High short interest, pharma squeeze with options, and a guaranteed bullish event on the horizon. It's also a value play once Sabizabulin gets approved because it will unlock a potential $9.25 B in funds from BARDA, which \"*Sabizabulin will serve critical roles in the US and abroad.\"* That is just potential US contracts. It isn't even touching on the contracts it can secure in the very near future from the EU. This baby only has a Market Cap of $985 M right now. There is sooo much room to run. Add a little squeeze juice on top of that, and we have ourselves a perfect storm.\n\nSome of you have been asking this week, “what stock can make me a millionaire that costs $12.50?”\n\nVERU can. \n\n# Positions:\n\n[8/19 $16c](https://imgur.com/a/IB76s63)\n\n[8/19 $26c](https://imgur.com/a/eiN3LWP)\n\n[9/16 $26c](https://imgur.com/a/elOMANG)\n\nMy positions - Just shy under $16k [https://imgur.com/a/4eAVuQ7](https://imgur.com/a/4eAVuQ7)\n\n8/19 $16c x 40\n\n8/19 $26c x 150\n\n9/16 $26c x 15\n\nGod speed, you degenerates.", "id": "wg3c2f", "created_utc": 1659624990.0, "score": 68, "upvote_ratio": 0.83, "num_comments": 90, "comments": [{"body": "You had me at “slaps you”\n\nIn with 12k on margin.", "score": 16, "replies": []}, {"body": "In for 5 $13c 9/2's because there are no other plays on here.", "score": 13, "replies": [{"body": "Did you hold through earnings today?", "score": 1, "replies": [{"body": "I wish! They hit my limit and sold for $400. I was happy with the profit. Was. Didn't see the rocket till just now.  Thanks! What are we getting into next week??", "score": 1, "replies": [{"body": "More VERU on the dip. FDA hasn’t even announced approval yet and if that goes through, it’s going to $40+.  I have about $3k on the sidelines waiting for a pullback and then I’m going to either add to my 9/16 $26c more or leaps", "score": 2, "replies": [{"body": "I will watch for a dip this week and reload. Hmm, any idea how long FDA approval takes?", "score": 2, "replies": [{"body": "FDA a while. EUA depends on the trials and facilities, but we are close. I’d say end of this month or early September probably.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I already have 200 shares. Getting more ;)", "score": 9, "replies": []}, {"body": "Before you get too hooked on the hopium: Sabizabulin may be effective in COVID, but unlike Paxlovid or Veklury which are virus-specific inhibitors, Sabizabulin is a chemotherapy with the same mechanism of action as the taxanes (e.g. Paclitaxel and Docetaxel). These compounds are grossly mutagenic (cause cancer) and particularly in immune cells, which is where the presumptive site of action for Veru's drug is (https://pubmed.ncbi.nlm.nih.gov/10618175/).\n\nThere is no mutagenicity data available for Sabizabulin because it has only previously been tested in cancer where the FDA does not require mutagenicity tests. I expect them to ask for these before EUA is granted.\nThe FDA is going to be much more picky about authorizing a chemotherapeutic for COVID patients when non-carcinogenic therapies like Paxlovid and Dexa are available, especially if Sabizabulin patients have a high likelihood of developing leukemia down the road.", "score": 14, "replies": [{"body": "Interesting take. Thank you", "score": 2, "replies": []}, {"body": "https://www.onclive.com/view/novel-therapy-appears-safe-effective-in-metastatic-castration-resistant-prostate-cancer \nThey talk about your concerns in this article.", "score": 2, "replies": [{"body": "Thanks for the article. Unfortunately, mutagenicity/genotoxicity is impossible to assess in this type of trial with this short of a duration. A typical mutagenicity safety profile could only be established with an observation period >5 years. As I mentioned, trials in cancer do not require genotoxicity profiling. The potential caveat is that the FDA may disregard potential mutagenicity if patients would otherwise die from COVID and there is no alternative treatment. However, with the introduction of dexa, paxlovid and the monoclonals, I don't think the FDA will be forced to make this choice anymore. \nHere is a discussion on the relevant question: https://pubmed.ncbi.nlm.nih.gov/19782117/", "score": 3, "replies": [{"body": "Yup, Afaik sabizabulin is much less toxic than dexa, remdesivir, and velkury. As long as it beats those I can’t see the FDA declining the drug.", "score": 2, "replies": []}, {"body": "The drugs safety profile is partially from some cancer trials conducted at <60MG dose over several years", "score": 2, "replies": [{"body": "Either way FDA already said the safety profile met the EUA requirements", "score": 2, "replies": []}]}, {"body": "You just proved why cancer is not a concern. SHORT TERM low dose treatment. likely only one time in a patients entire life…good try though.", "score": 1, "replies": [{"body": "A single dose of integrating virus is known to cause leukemia in gene therapy patients in the 90s, 1 exposure to mustard gas caused multiple hematologic malignancies in WW1 & 2, and there are hundreds of other compounds/agents that cause cancer after a single exposure. You clearly don't have a basic understanding of biology - I'd caution against you trying to interpret the data.", "score": 3, "replies": []}]}]}]}, {"body": "Side effects is what these companies feed on, and guess what, they have ”medicine” for that too", "score": 0, "replies": []}, {"body": "This is a blatant lie.. look into it. 100% false..", "score": 0, "replies": []}, {"body": "Yeah 21 days or less of a lower dose is going to give you cancer…", "score": 1, "replies": []}, {"body": "Slide 21:\n\n[VERU August Corporate Presentation ](https://d1io3yog0oux5.cloudfront.net/_5f1057a071797403fec715b2d0d20014/verupharma/db/2224/20983/pdf/Veru-Corporate-Presentation-August-2022.pdf)", "score": 1, "replies": []}, {"body": "Given that the use case is for severe cases of covid in hospitalized patients and that it cut the death rate by 55%, the benefit appears to outweigh the unknown risk.  Given that there are no cures for ARDS and it has a high mortality rate, Sabizabulin could become the standard for care for ARDS if it truly has such a dramatic reduction in mortality.", "score": 1, "replies": []}]}, {"body": "I have not enough capacity in my brain after eating too many crayons to understand what you wrote but I picked up 100 shares at 11,99.\n\nAnd fuck you if I don’t make any money", "score": 12, "replies": [{"body": "Upvoted and same here, lol...", "score": 12, "replies": []}, {"body": "u/King-of-Plebs Thanks OP. Made a decent chunk of money in todays rally, so no fuck you this time around", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}]}, {"body": "I've been in Veru for over a year, love this company.  I only wish this drug came out sooner, considering the potential of how many people it could have saved. Regardless, I'm hopeful for quick approval. Nobody needs to lose another person to covid ARDS.", "score": 11, "replies": [{"body": "Am covid icu nurse, agreed. Fuck ARDS. This shit is needed bad.", "score": 5, "replies": [{"body": "Am covid icu patient, agreed. Fuck ARDS *wheeeeze*", "score": 3, "replies": []}]}]}, {"body": "Read up on this more last night. This isn’t too fucking dumb but it’s definitely dumb enough to work. Full port shares, second port some lotto ticket calls.", "score": 5, "replies": []}, {"body": "yyayayyayayay i been on this wave lets gooooooooooo", "score": 3, "replies": []}, {"body": "Locked in 16c 8/19 prolly gonna degen it up and buy some 12.5c 8/5 🤣", "score": 4, "replies": [{"body": "Post them gains!!", "score": 1, "replies": []}]}, {"body": "cannot believe this is going crazy. like what is the issue why are the degens not being degens.", "score": 4, "replies": [{"body": "Algo didn’t like my DD so it got squashed by memes ![img](emote|t5_2th52|4260)", "score": 2, "replies": []}]}, {"body": "Best DD I have seen. Got 3000 shares. Ride or die.[BUY MORE VERU!!!](https://imgur.com/a/UmYBWO5)", "score": 4, "replies": []}, {"body": "Z A D D Y", "score": 6, "replies": []}, {"body": "I’ve literally been in this for months. Average $7 for 5000 shares. Great write up. Can’t understand how people aren’t pouring into this one. Even if you forget about the current EUA, this company should be double its price. I will just keep adding, I honestly think this is the best opportunity out there at the moment. Guaranteed short squeeze as well. Let’s make some 💰", "score": 6, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Pardon?", "score": 1, "replies": [{"body": "You said a potty word ![img](emote|t5_2th52|8881)", "score": 1, "replies": []}]}]}]}, {"body": "Expect FDA approval within the month. Would appear they are waiting for confirmation of manufacturing. Remember, they stopped the trial early and asked to submit. Honestly people in 2 months time will be kicking themselves for not getting in here, I’m in so deep", "score": 6, "replies": []}, {"body": "Ok buying puts!", "score": 3, "replies": [{"body": "Thanks for your sacrifice", "score": 5, "replies": []}]}, {"body": "You have no mention of the EUA in the US? \n\nYou know it’s under reviews right?", "score": 3, "replies": [{"body": "Link?", "score": 1, "replies": [{"body": "Can read about it in a seeking alpha article:\n\n“The market's response to Veru's data was a surge in its (fast declining) share price to ~$15, and although stock quickly fell back to $8, it surged again as the FDA confirmed the Phase 3 interim data would be sufficient for an EUA filing. The filing has been submitted, and the likelihood appears to be that the FDA will approve an EUA imminently, meaning there's an exciting short-term upside opportunity in play for Veru investors.”", "score": 3, "replies": []}, {"body": "I think their investor presentation on their website. Also look at other DD on WSB. Expected median return time was by the end of this week. Looks like it’s more likely by end of next week or the 19th. Price spiked to 18 when people got wind, then fell again to 12", "score": 2, "replies": [{"body": "My bet isn’t on the FDA. That’s a cherry on top. My bet is for the EU which is guaranteed to be presented no later than 20-days after the review was kicked off. Did you even read the DD? Also, I did some googling on your comment and found jack shit. FUD", "score": 2, "replies": [{"body": "It says so right here on their website: https://verupharma.com/pipeline/\n\n“After a pre-EUA meeting with FDA, we submitted a request for FDA emergency use authorization on June 7, 2022. FDA granted Fast Track designation to the Company’s COVID-19 program in January 2022.”", "score": 3, "replies": []}, {"body": "What? Investor presentation EUA was submitted in June? CEO says they expect a response by August 5?", "score": 1, "replies": [{"body": "Sorry, this is my bad. I misunderstood your message.\n\nI thought you were saying that the EUA’s ability to fast track VERUs drug was under review and therefore paused. That is what I was googling and of course I wasn’t able to find anything.\n\nI did just reread the presentation and you are correct ![img](emote|t5_2th52|4270)", "score": 2, "replies": []}]}, {"body": "This is common knowledge. Deadline for EUA is within 60 days, which is august 5th. Not sure I trust your googling skills.", "score": 1, "replies": [{"body": "There is no deadline for eua. 60 days is for fast track designation or priority review. People gonna be awfully upset tomorrow when no eua cuz they misunderstood what the 60 days deadlines are for.", "score": 2, "replies": [{"body": "Not sure what the ceo was talking about in the company presentation.", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit Inc. has banned Seeking Alpha articles sitewide.\n\nTo get around this, please repost your comment/thread with the link removed, and the relevant parts of the article copy and pasted. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "This needs to be getting a lot more attention. \nThis is huge!", "score": 3, "replies": []}, {"body": "Excellent write up", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Admins banned my main and won’t give it back. But you’re welcome", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "$40", "score": 1, "replies": []}]}]}]}, {"body": "I'm in deep with 1,400 shares lfgoooo", "score": 5, "replies": []}, {"body": "goddam you were right", "score": 2, "replies": [{"body": "Miscalculated on EUA approval, but yes. Buy the dip dawg. It still hasn’t even squoze. That was just people buying from bullish guidance. We are just getting started.", "score": 1, "replies": [{"body": "Shoulda followed you the first go. It’s too late 🥺", "score": 2, "replies": [{"body": "No it’s not. I’m still buying 9/16 $20c. FDA approval on the horizon end of month/early September. $40 inbound", "score": 2, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4263)", "score": 3, "replies": [{"body": "yo can I get a bj", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}]}, {"body": "I will also take a bj", "score": 4, "replies": []}]}, {"body": "scooped up some", "score": 3, "replies": []}, {"body": "you’re such a king & you will be a millionaire by september", "score": 3, "replies": []}, {"body": "Bear case their trial is too small and they get rejected for safety concerns, which plummets the stock to around 4 bucks.  Shorts loooove Biotech", "score": 2, "replies": [{"body": "Except the FDA halted the Phase III clinical trials due to \"overwhelming safety and efficacy\" of the drug. It's not really that small of a sample size. Besides, it's the p-value that matters in these studies, which was 0.0042. In statistics we usually agree that a p-value less than 0.05 is statistically significant.", "score": 7, "replies": [{"body": "Shhh let him buy puts ![img](emote|t5_2th52|4271)", "score": 5, "replies": [{"body": "I’m super bummed I didn’t buy puts, not that any regard here swayed that decision lol", "score": 1, "replies": []}]}, {"body": "Name a Covid drug that has been granted EUA from the FDA with a trial where n was >1000", "score": 1, "replies": [{"body": "ENTADFI", "score": 2, "replies": [{"body": "Cancer drugs are commonly approved with smaller trial sizes also", "score": 2, "replies": []}]}]}, {"body": "It was also originally developed as a cancer treatment and has had several other test trials over the past couple years.  Should significantly ease any safety concerns.", "score": 1, "replies": []}]}]}, {"body": "You know the trial was trash right? Won’t get approved.", "score": -5, "replies": [{"body": "According to you & some kid writing a short report?", "score": 1, "replies": []}]}, {"body": "So will the owners of Saz be murdered in their own home just like Hydroxy owners?", "score": 1, "replies": []}, {"body": "Good write up. Just for clarification am holding 3000 Shares myself. \n\nToday veru had it's earnings released - it was bad we all know. But why did the price jump?", "score": 1, "replies": [{"body": "Todays news was not about the money.  Everyone knows they are spending a LOT of money to prepare for US, UK and EU authorizations for their covid drug.  The news on being close to having the paperwork done for the UK,  waiting on 2 sites(Brazil and Belgium) from study to be visited for US EUA, and the true significance of the EU initiated review means they might really months from breaking out of the Small Cap category.\n\n&#x200B;\n\nI am poor so only 1k shares", "score": 2, "replies": []}]}, {"body": "u/King-of-Plebss Still no news on the Euro EMA decision?", "score": 1, "replies": []}, {"body": "F for all of you that lost your ass on this play.", "score": 1, "replies": []}]}
{"title": "The ultimate guide on how to trade CPI week/ day", "selftext": "&#x200B;\n\nhttps://preview.redd.it/gdj81xvu7sf91.png?width=497&format=png&auto=webp&s=a6971ae74fa565e1f5266d013e869234461474b5\n\nOf the last 7 CPI days.. we have seen SPY open up red 5 out of 7 times and of those 5 times 4 out of the 5 times have been >1% red. Of the 2 out of 6 times that have been green both have opened less than 1% green. \n\nLooking at the actual intraday movement of CPI days there has only been one two times when SPY closed HIGHER than its opening price on CPI days… That means that 5 of the last 7 CPI days we have closed below our opening price regardless of whether we open red or green. The average % close below opening is  0.924%. On the two days that have closed HIGHER than opening price (April and July CPI) we have seen an average of +0.83%.\n\nOf the last 7 CPIs the two days before CPI releases is averaging a total drop from open to close of -0.35%... however, if we look at the last four CPIs (April, May, June and July) we are averaging a two day drop of -2.61%. That’s a pretty massive drop for two days…\n\n**Should we swing overnight puts?**\n\nIn general overnight puts are almost the golden ticket to success… interestingly enough lets look at if we bought puts for CPI and we were wrong (such as in January and April). \n\nFor the January 12th CPI which opened 0.6%+… on January 11th we open a ATM 469P. Premium at 415pm is 1.35 and it opened at 1.75. So even though that morning SPY would have opened 0.6% green your puts due to the lovely IV pump of a 0dte would have been profitable had you sold IMMEDIATELY at open… you would have sold for 29% profit however, hold it any longer then that and it would be worthless and never see green again. \n\nFor the April 12th CPI which opened +0.71%... On April 11th EOD we buy an ATM puts 439. Premium at 415pm would have been 2.7 and had we sold (and I mean IMMEDIATELY at open) you would have sold for 2.7. However, if you held for even 5minutes you would be looking at a premium of 1.98 which would give you a net loss of 27%. The other intriguing thing about this is that had you just held (and you woulda held through some big red) by 305pm you would have been back to even and by and by 325pm you would have been up 27% and able to close them for profit. (note you would be playing a 1dte here not a 0dte here due to the CPI being on a Tuesday so that saves you from some of the drop).\n\nSo the only two days it opened green we actually would be breakeven or profitable…. Now lets look at the smallest open day as comparison. \n\nMay 11th opened at -0.02%. If we bought a May 11th 0dte ATM 399put at 415pm the day before our premium would have been 3.79. When markets opened the next day it would have opened at 3.81. This would give you a measly 0.5% profit. However that first 5minute candle would have seen a spike to 4.74 for a profit of 25%. However after that these puts would have dropped to absolutely worthless by 1130am. Had you diamond handed them though by EOD market close you would be looking at a premium 6.96 for a 83.6%. \n\nOkay so that 3 examples of when a over night put even if you were wrong (or barely right) was essentially a free play…. Now lets look at had we been correct (im only going to show the June and July as there were the most impressive opens)\n\nJune 10th CPI a 0dte ATM 401p woulda opened at 160%... and by 1030am that put would be worth 315%... \n\nJuly 13th CPI a 0dte ATM 380p woulda opened at 101% and by 935am would be worth 121%... however, we all remember what happened that day… had you diamond handed these by 1040am you would be back to even and from there it would never see green again…\n\nSo what does this show you… well it shows you pretty much CPI puts ATM… are worth the gamble in my opinion… Of course all overnight plays should be considered lottos and should be lotto sized… no full ports. \n\n**Intraday movement before CPI**\n\nThe January 11th, February 10th and March 9th (days before CPI) were all considered flat days. However, When we look at the last four CPI days (April, May, June and July) all four of them have had pretty significant dumps frm about 1pm to close. If you had bought puts around 1pm almost all four of these days you would have ended up extremely profitable. \n\nThe average drop of the last four CPIs from 1pm till EOD is 1.425% with the smallest being 0.8% in April and the most being 2.3% in June. \n\nIntraday puts are almost certainly the play once the morning chop is over. \n\n**Day of CPI SPY trends**\n\nJanuary 12th- rallied. dumped... then traded sideways all day.\n\nFebruary 10th- rallied till 1030 then dumped 2.35% \n\nMarch 10th- rallied till 1015 dumped till 1130 then rallied 1.5% by EOD\n\nApril 12th- rallied till 945am then dumped 2.08% by EOD\n\nMay 11th- rallied till 1130am then dumped 3% by EOD\n\nJune 10th- dumped all day \n\nJuly 13th- rallied till 3pm and then dumped 0.7% EOD (1pm to 2pm did dump 0.8% before recovery)\n\n**What do I expect CPI to be?**\n\n&#x200B;\n\nhttps://preview.redd.it/hvgshh5w7sf91.png?width=975&format=png&auto=webp&s=a7e7813bbe5c76b801ca35fbcf691ec94ba51635\n\nSomething very interesting about this current CPI print and something I cant remember about any of the other CPIs… is that the TEForecast is actually higher than consensus. The consensus and forecast are almost never different from eachother let alone predicting higher… Arguably I am not an economist or expert in CPI but in general having the consensus lower then the forecast and lower then previous CPI is bound to be a big deal if that misses…\n\nOkay so the Fed is predicting 8.9%... once again they are trying to say we have “peaked” and or slowed at least. Why does this matter? Well in May they attempted to say Inflation peaked also calling for a 0.3% drop in inflation and actual inflation came in 0.2% higher then expected. \n\nThe market when they heard that at 830am had a beautiful 2% sell off, however, “magically” climbed back to about breakeven by open and then later that day dumped from from its high to low 3.08%. \n\nWe have been averaging 0.3% higher than expected the last CPI. Which if we miss by 0.3% that would be 9.2% which is not only higher then expected obviously but its also higher than the previous CPI by 0.1%. \n\nhttps://preview.redd.it/itpzjqrw7sf91.png?width=975&format=png&auto=webp&s=b36da484d9cc31db909b2a042d0009bc0813b7a4\n\nThis chart comes from the Cleveland feds website and so does the next. \n\nhttps://preview.redd.it/ozmx6n7x7sf91.png?width=975&format=png&auto=webp&s=699add32638d270c8a6a3a842c383e7b40333722\n\nSomething that is interesting about the Cleveland fed prediction of YOY cpi is that they are almost ALWAYS 0.3% lower then what actual inflation is… which means for this July CPI print they are expected 8.82% + 0.3% gives us a magical number of…. 9.1% CPI. Which would be higher than consensus.   \n   \n \n\nNow why does this matter? \n\nhttps://preview.redd.it/u51sodpx7sf91.png?width=500&format=png&auto=webp&s=2c2037ada94f7bda73f87328dd2f77a21bb3bdbd\n\nAs you can see currently there is an 87% “consensus” that the Fed is going to do a 50bps hike come September. So if we get a higher than expected CPI rating on August 10th this is going to put additional pressure on the feds. A higher than expected CPI shows that we the rate hikes have still not calmed down inflation. \n\nhttps://preview.redd.it/49ajei6y7sf91.png?width=975&format=png&auto=webp&s=07a441fe977b028e8d96ae2f767b39e451c97da0\n\nSomething else to be interested in is the fact that JPOW himself said “im more concerned about PCE then CPI” and the PCE right after he said that was dogwater… with a terrible PCE, GDP now double negative and a terrible CPI print… the fed is going to be forced to get more aggressive. \n\nThe markets pretty much are running under the impression JPOW saved the day cpi has peaked, inflation is over and the rate hikes are going to be 50bps or no rate hikes. However, this inflation is going to rock the markets I feel. \n\nMarkets shook the last CPI off because they already expected the feds to do a 75bps hike. However, expecting a 50bps hike there is no way if CPI keeps going up that we are going to get a 50bps hike. And markets are going to recognize this. \n\nAlso unique is that the next FOMC is not till September 21st and we will have the CPI on August 10th and another CPI prior to this meeting on September 13th. \n\n**So whats the play? How am I going to play CPI?**\n\nRemembering like FOMC I trade off the data I have analyzed and what the highest probability risk to reward is… I will be opening a Wednesday expiration put ATM Tomorrow (Friday) before market closes at 415pm. I plan to open a SPY put (I am also holding an Apple out which I most likely will average down too). \n\nFrom there my plan is to let these puts run until Tuesday before market closes. If we happen to get a massively red day on Monday (think 2-3% red) then I will take profits that day. If Monday is a green day or a wash day (doji) then I will hold till Tuesday. If neither of these days drops then I will hold till expiration in hopes of a June CPI repeat. \n\nOkay so besides that I plan to open an overnight put Tuesday night. I will do an ATM put 0dte for Wednesday. Depending on what CPI comes in at and what we open at (red wise) I will close the put at open. I would be hesitant to hold any puts past open just because of how Julys CPI played out. If I happened to be wrong on that 0dte put play I would immediately sell at market open Wednesday. \n\nAll position sizes will be small.", "id": "wgfp8g", "created_utc": 1659656034.0, "score": 94, "upvote_ratio": 0.93, "num_comments": 91, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|248|**First Seen In WSB**|1 year ago\n**Total Comments**|2348|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/uxvyrg/52522_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuwx6/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/veuz82/61722_spy_weekly_recap_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/v8vbnd/6922_spy_daily_ta_bonus_cpi_day_trade_breakdown/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwhw7o/how_to_trade_cpi_day/) [x](https://www.reddit.com/r/wallstreetbets/comments/ur9t1w/51622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w5k3q1/the_only_fomc_week_ta_dd_youll_ever_need_to_read/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpf4gi/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vpezp3/7122_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthspd/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w5m6n6/72222_spy_es_futures_weekly_ta_and_recap_bonus/) [x](https://www.reddit.com/r/wallstreetbets/comments/spxvil/spy_210_the_bear_rages_on/) [x](https://www.reddit.com/r/wallstreetbets/comments/wgdzsm/8422_spy_es_futures_and_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/wgfp8g/the_ultimate_guide_on_how_to_trade_cpi_week_day/) [x](https://www.reddit.com/r/wallstreetbets/comments/vikp3b/62222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vcewfy/61422_spy_daily_ta_and_a_breakdown_of_how_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/vydqkl/71322_spy_es_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vm7yov/62722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/us0d0d/51722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w9qbik/72722_spy_es_and_apple_futures_daily_ta_and_fomc/) [x](https://www.reddit.com/r/wallstreetbets/comments/w29gw7/71822_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rj1up5/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/v23784/53122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v9jfp2/61022_spy_weekly_review_fomc_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjbyng/62322_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uyxorz/52722_spy_pre_market/) [x](https://www.reddit.com/r/wallstreetbets/comments/v6ewtr/6622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5w3m/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/up5xtr/51322_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vmx21o/62822_spy_es_futures_daily_ta_bonus_qqq_and_apple/) [x](https://www.reddit.com/r/wallstreetbets/comments/skp8ci/24_spy_recap_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/lyng6s/buy_the_rumor_sell_the_news_hear_me_out_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/wdrnb4/8122_spy_es_futures_and_apple_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w33way/71922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vd6j6u/61522_spy_daily_ta_and_fomc_trade_review/) [x](https://www.reddit.com/r/wallstreetbets/comments/riyt4w/december_17th_spy_recap_and_next_week_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/usqmwy/51822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v2sj0k/6122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/walbtb/72822_spy_es_futures_and_apple_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vz5ejc/71422_spy_es_futures_and_amd_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdk8h/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v7clxo/6722_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vzz7j9/71522_spy_es_futures_vix_uvxy_and_amd_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vjy8l2/62422_spy_weekly_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w3x7sj/72022_spy_es_futures_daily_ta_little_fomc_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vw7sc0/its_time_to_go_long_on_vix_uvxy_calls_july_is/) [x](https://www.reddit.com/r/wallstreetbets/comments/uwdhxd/52322_spy_daily_ta_bonus_fomc_minutes_reaction_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v3mubg/6222_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vs0b13/breakdown_of_fomc_minute_days_and_how_to_trade_it/) [x](https://www.reddit.com/r/wallstreetbets/comments/wen4ay/8222_spy_es_futures_and_apple_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/wendr5/8222_spy_es_futures_and_apple_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v82mas/6822_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vnphqa/62922_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvrv2/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdvtju/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdwm4u/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/rgqp0q/spy_dec_14th_recap_and_dec_15th_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/wbhcrj/72922_spy_es_futures_and_apple_weekly_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/vwukf1/71122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vdzrud/61622_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/uthl4s/51922_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/w4rgvv/72122_spy_es_futures_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/ux4ri2/52422_spy_daily_ta_fomc_minutes_prediction/) [x](https://www.reddit.com/r/wallstreetbets/comments/vbnl4b/61322_spy_daily_ta_and_fomc_anticipation/) [x](https://www.reddit.com/r/wallstreetbets/comments/vt2tn2/7622_spy_es_futures_daily_ta_and_fomc_minutes/) [x](https://www.reddit.com/r/wallstreetbets/comments/vhms2v/62122_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/wfhi4n/8322_spy_es_futures_and_apple_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/vojpv5/63022_spy_daily_ta/) [x](https://www.reddit.com/r/wallstreetbets/comments/v48yk1/6322_spy_weekly_ta_and_analysis/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wgfp8g)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wgfp8g)", "score": 1, "replies": []}, {"body": "thanks for the excellent analysis\n\nso much hopium priced in now\n\nyour play will probably be right", "score": 14, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "You still planning to play these puts?", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Cool, I am trying out a strangle for 8/12. Probably won't work out.", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "HAhaha for reals, he doesn't push any stock just provides market observation. Shit flinging, and meme wars happening elsewhere in the halls of WSBs.", "score": 7, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Haha. I guess don’t read it that way, to me a lot of the market moves together unless they are on their own news. AAPL is a monster worth keeping an eye on as you do.", "score": 3, "replies": []}]}]}]}]}, {"body": "If it’s less than the 9.1 of last months spy will go up as they will assume inflation has peaked", "score": 11, "replies": [{"body": "I'm yoloing everything I've got into calls Tuesday afternoon. I think it of at 8.5% and the spy goes ape shit up", "score": 2, "replies": []}]}, {"body": "Love it, thanks man. You can go back almost every month and read a CNBC article about how inflation is peaking “this time”. Ridiculous. Also very strange that the forecast is higher than the consensus. A common theme I’ve heard is “because oil/gas prices have gone down, inflation(and CPI) will too”.  If there is a surprise to the upside though, this could be the catalyst for the next leg down and the end of this bear market rally.  Gonna tail you.", "score": 9, "replies": []}, {"body": "CPI is rigged.  Fact.", "score": 6, "replies": []}, {"body": "I’ll board this bear train with 10k and pray to gods for a bountiful harvest 🙏🏼", "score": 10, "replies": [{"body": "I'm in selling Tuesday. Not getting cucked again. Might jump in Thursday reversal. Maybe daddy d can do a deeper dive.", "score": 5, "replies": []}, {"body": "Prepare to get rekt", "score": 2, "replies": []}]}, {"body": "Noticed that the day after cpi the market reversed what it opened. Would open red and end the day green or barely red. Open green and finished red.", "score": 5, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Seems like may is the only one that didn't move more than 1%.", "score": 3, "replies": []}]}]}, {"body": "My prediction will be CPI still high, over 8% but trending down as the main driver, oil has been trending down.", "score": 5, "replies": []}, {"body": "Love the analysis as usual man. Truly next level. My one question on your strategy would be, if we are red tomorrow say 1% or so, are you still buying an ATM put at close?", "score": 5, "replies": [{"body": "I'm still jumping in. Probably going to be chop like today. Watch vix in July it spiked when spy dumped.", "score": 3, "replies": []}]}, {"body": "I don’t know I’d get too freakin short here folks. Like Daddy said, take small swipes. This isn’t a bet the ranch moment. The recession narrative took a big hit today with the labor numbers and as the market action showed, the economy (and corporate earnings) can likely weather higher rates. Now don’t go long to the lungs on me but understand what the “baffling” market response to bad news may be trying to tell us. \n\nHave a great weekend all. Hope you had a deep green week!", "score": 4, "replies": []}, {"body": "Looking forward to it.", "score": 3, "replies": []}, {"body": "isn't July a historical deflationary month? Even in the 1973 with terrible inflation they had a fake peak in July, then it skyrocketed.", "score": 3, "replies": []}, {"body": "ah my puts at 13th July waiting more than 1 min at open![img](emote|t5_2th52|4260)", "score": 3, "replies": []}, {"body": "So does today’s action change your plan? Or still buying puts at close?", "score": 3, "replies": []}, {"body": "i was thinking about opening short yesterday when i saw the huge bounce off 4170 on SPX and now i kick myself for it ... the jobs numbers went out the window but it seems to be recovering upwards so i think this short game until wednesday is still in play\n\ni'm waiting for the todays remaining peak and loading up on shorts 8)", "score": 3, "replies": []}, {"body": "!remindme 1d yolo", "score": 2, "replies": [{"body": "I will be messaging you in 1 day on [**2022-08-06 02:16:30 UTC**](http://www.wolframalpha.com/input/?i=2022-08-06%2002:16:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/wgfp8g/the_ultimate_guide_on_how_to_trade_cpi_week_day/ij02lbi/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fwgfp8g%2Fthe_ultimate_guide_on_how_to_trade_cpi_week_day%2Fij02lbi%2F%5D%0A%0ARemindMe%21%202022-08-06%2002%3A16%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20wgfp8g)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "will buy vwxy call for next week!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "All we need is a flat or higher cpi next week and that might do us in for the next leg down. \n\nMy October 370P will be happy lmao.\n\nOr the market will just ignore the numbers again..", "score": 3, "replies": []}]}]}, {"body": "Weren’t you hilariously tragically wrong last month? Or was that the fomc meeting?", "score": 4, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "So it was the fomc meeting then?", "score": -1, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "how do you deal with vix calls? Just sell them one day before expiry? Since theyre AM cash settleD?", "score": 3, "replies": []}, {"body": "You definitely did a post about last fomc meeting that was wildly wrong", "score": -6, "replies": [{"body": "[removed]", "score": 9, "replies": [{"body": "That was it. You said a drop was coming next day that never showed up. That’s significantly less than 1000% correct.", "score": -8, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Nah you wrong then and you wrong now. Markets goin green on cpi coming in slightly under expectation. Reading of the fed model is all wrong", "score": -4, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "That person is just trying to get a rise out of you. Keep doing the good work.", "score": 4, "replies": []}, {"body": "Told you. Another big miss for you", "score": -1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I predicted 8.6 in several places. \n\nI’ll wipe my tears away with all the money I made this morning doing the opposite of what you said", "score": -2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Did you just admit your predictions are as accurate as a coin flip? That’s probably true. Cause you just look at what’s happened before and assume it’ll happen again. Which is about 50/50.\n\nI was looking at all of the data that was indicating inflation would be coming down this month.", "score": -2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Real inflation did come down…. Remains to be seen if it will stay that way. First 10 days of the month indicate another decline next month. But shit could change.\n\nDon’t tell me you’re also one of those shadow stats morons?", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "If you think he is wrong, why bother reading it? Just move along.", "score": 4, "replies": [{"body": "Why are you so defensive of shills", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Dude give him a break. Vix didn't go to 40. Big whoop. It went from 24 to 28 briefly. It's still 30%. If you can do better dd/ ta by all means get er done. If you want to troll ppl on here with your 16 day old account gtfo.", "score": 10, "replies": [{"body": "Give a break to a dude trying to shill his shitty day trading advice product? Pass. Sorry if you got suckered into buying it", "score": -9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "He’s shilling his shitty advice product what the fuck are you talking about", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "The analysis here is inherently flawed because it doesn’t account for the inherent bias in the feds inflation predicting model. It will always underestimate when inflation is rising and always overestimate when it’s falling. Cause it uses the last month as it’s anchor point and just adjusts for oil and gas prices. It’s not a very sophisticated model and is really only useful in “normal” inflationary environments.\n\nI’m calling inflation coming in under 8.9. Probably 8.6 or 8.7.", "score": 1, "replies": [{"body": "So how is the market going to react? What's the 🔮 telling you? Don't live in usa.", "score": 3, "replies": [{"body": "Slight green as chances of 50 bps increases and 75 bps decreases.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Bruh. Anything under expectation increases odds of 50bps. Especially if jobs report comes in as expected and shows a big slowdown. The fed is signaling 50bps hard. They have to be forced to not do it.", "score": 3, "replies": [{"body": "well since now the job numbers are out and missed totally, we might have the holy trinity of bad numbers next week... this is looking more and more like a slope down until next fed meeting", "score": 2, "replies": [{"body": "Chances of 75 bps shot up considerably today for sure. But, I think when inflation comes in expectation we’re Gona see the chances of 50 bps go back to where it was yesterday. Bought SPY calls as soon as I saw the drop. Will sell them after CPI", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "Your analysis is incredibly flawed. The Cleveland fed inflation forecast methodology is absolutely terrible. They take the last cpi, and adjust it for oil and gas prices over the month, and call it a day.\n\nThis works fine in normal inflationary environments. It works terribly in abnormal inflationary environments. \n\nIt always underestimates when inflation is rising, and always overestimates when inflation is dropping. It’s the nature of the model. If inflation is set to drop, it’s basically baked into the model that the prediction will be high.", "score": 3, "replies": [{"body": "Interesting. How is the consensus rate figured out? That’s increasing as well anyways right?", "score": 2, "replies": []}, {"body": "But almost everything in the cpi is increasing besides energy, especially services. We could get a much higher core cpi than expected which would still be bad as that means inflation is here to stay.", "score": 2, "replies": [{"body": "Core has been decreasing for 3 months. Food has also come down. What data says core is increasing?", "score": 2, "replies": []}]}]}, {"body": "CPI will be much much lower. The biggest contributors to CPI increases have now steadily fallen and we are watching demand getting destroyed. Not oil and gas because CPI was already trending higher before the war. The biggest contributors I mentioned are- housing and used car prices. Housing market is slowly returning to norm, while used car prices are no longer enjoying any premiums. At one point both these line items were 40%+ YOY. My estimate CPI in the lower 8s", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Maybe, Maybe not. However, market has been trying to price in a mild recession for a while now, but Friday's job report shows labor market implying we are not in a recession. So, does market \"un-price\" the recession risk?", "score": 3, "replies": []}, {"body": "8.5% flat from 2021 July. Next month will be even lower as energy savings gets passed on in form of logistics (transportation, warehousing etc). Food will follow. Shelter is lagging and may take a little bit longer to come down. Uptrend in CPI has been stopped.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah I don’t know where they got those energy numbers from.  Last I checked, natural gas was expensive as hell and futures actually went up with this cpi release lol", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Inflation was increasing quickly before therefore predictions were hard.. now it’s stabilizing and predictions will most likely be accurate. It’s common sense", "score": 1, "replies": []}, {"body": "I will go on record and say this month’s CPI will not matter one bit for the market. The market is already anticipating a pivot by the Fed and unless Powell himself comes out and reverses everything he said last month, all of this “historical” and backwards views are irrelevant. \n\nThe market is forward-looking and CPI (and PCE) are backward-looking. There’s absolutely nothing stopping this melt up rally now until FOMC reverses course in September and that won’t happen unless CPI prints above 10% or something.\n\nMy own thesis is that M/M will show first drop and we’re off to the races, though by Wed I think S&P will be knocking in 4300. Nothing is stopping this train now…", "score": -4, "replies": []}]}
