{"title": "The DOW is nearly down 1000...", "selftext": "How do you think we’re gonna open? And what are the plays you guys are considering for tomorrow’s possible breaker?", "id": "fnafkx", "created_utc": 1584922909.0, "score": 27, "upvote_ratio": 0.92, "num_comments": 27, "comments": [{"body": "Bloodbath", "score": 26, "replies": []}, {"body": "Triple breaker kind of day! Woooooo", "score": 21, "replies": []}, {"body": "Not possible but definite breaker tm. I’d say that for us poor chumps who failed to get in on some puts last week, short term calls could be an option since the last three times we had the circuit breaker trip the next day was green. However, I can totally understand why you wouldn’t want to buy calls since the situation is very negative at the moment. Heck, even I haven’t been buying calls at these moments even though I was correctly calling that the next day the market would recoup some of its losses. But keep it in mind, it’s just a pattern I noticed these last several weeks, although that doesn’t mean it will necessarily repeat itself this time.", "score": 19, "replies": [{"body": "Buy sqqq shares. ride the wave up.  Should still be a great return.", "score": 9, "replies": [{"body": "was going to sell Friday but the Market was green, feeling pretty good now. thoughts and prayers or the corona+ people", "score": 1, "replies": []}]}, {"body": "Buy short term calls to hedge your longer puts.", "score": 4, "replies": []}, {"body": "Show me the numbers bro,", "score": 1, "replies": [{"body": "Wait which numbers are you referring too? Are you just talking about the dates where the circuit breaker was triggered?", "score": 1, "replies": [{"body": "The dates, how much we were down, and then how much we were up the next day. This is solid, I’d go in deep tomorrow with concrete DD. I’ll get in this as well tomorrow... I’m if you have them let me know what you’ve got... thank you.", "score": 1, "replies": [{"body": "I’m assuming you have access to stock market charts and that you know that a circuit breaker is triggered when the markets fall 7% or more. That said, I can give you the dates where that happened so you could inspect the price movement during the day and the following one. \n\nMarch 9: -7.7% move. Following day market is up 5.17%.\n\nMarch 12: -10.66% move. Following day market is up 8.7%.\n\nMarch 16: -9.2% move. Following day market is up 2.97%.\n\nKeep in mind that these numbers are based off the S&P500’s daily candlestick chart on tradingview.com and not SPY’s chart so there may be a slight discrepancy between the two’s closing prices(since the S&P factors in after hours and premarket trading while SPY does not). Hope this is the info that you were looking for.", "score": 2, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 13, "replies": [{"body": "I just view futures prices as an extension of how the stock will be trading. If my memory serves me right, the last several times we’ve hit limit down in futures the markets have all hit the circuit breakers. It looks particularly bad for tm too since the futures are still hovering close to -5% whereas other times they managed to regain 1-2% or so. Gonna be mega brutal, brace yourselves.", "score": 8, "replies": [{"body": "Yeah I’m offloading hella puts tomorrow and buying me a blue chip or two", "score": 1, "replies": []}]}]}, {"body": "Cmon VXX, don't fail daddy. TO THE MOON", "score": 9, "replies": []}, {"body": "Gonna be flat as fuck and everyone will lose tendies", "score": 4, "replies": []}, {"body": "Short LYFT, MGM, PTON", "score": 2, "replies": [{"body": "Why PTON?", "score": 2, "replies": [{"body": "Irrational exuberance recently made it pop. Some dumb analyst thinks people will spend +$2K +50/mo subscription because everyone is staying home. \n\nWhat this idiot doesn't realize is that people are losing their jobs and the economy is suffering hard. If you lose your job, are you going to drop thousands on a stupid bike?\n\nThe company burns cash, is and has been way overvalued, and now faces competition doing the exact same thing. \n\nFitness trends are always hot fads that fade away. This is no different.", "score": 2, "replies": []}]}]}, {"body": "The real question here is will UBER and WWE will follow the downward spiral like the rest of the market.", "score": 1, "replies": []}, {"body": "Red open, we'll see how the re vote fares.", "score": 1, "replies": []}, {"body": "And, futures are up!", "score": 1, "replies": []}, {"body": "down", "score": 1, "replies": []}, {"body": "How do I buy shorts Before market opens at after hours prices?", "score": 0, "replies": [{"body": "😂 u can’t buy before the market opens. Unless someone you know personally transfers you their option contracts.", "score": 3, "replies": [{"body": "Sorry I was unclear on stocks I can buy in the after hours market right? That’s what I’m asking about. Thanks.", "score": 2, "replies": [{"body": "No the price fluctuation that happens after hours is a reflection of the changes in price that happen to the question orders that are going to be exercised on opening bell.", "score": 1, "replies": []}, {"body": "Sorry I meant “Queued Orders”", "score": 1, "replies": []}]}]}]}]}
{"title": "Stock-Market and Stock-Buying Opportunity", "selftext": "This is from personal experience and opinions based on historic facts. For those who have saved enough money to be able to invest (LONG-TERM) in stocks, the current stock market status (Recent historic drop) represents a great opportunity and it is highly possible that the stock market low in 2020 will be the lowest we will see in our lifetimes. Most stocks currently have retreated 30% or more and even if it goes down a little further, this is a great time to dive into large cap stocks (e.g. MSFT, KO, PEP, JNJ, etc.) or stock funds (Preferred). One of my favorite funds is VTI, Vanguard's total market ETF. For people who are newer, I recommend reading about long-term stock investing, Bogle 3-fund portfolio, and dividend-growth/dividend-compounding stocks. I am sharing my opinions based on strong research and this is not expert advice. Feel free to comment and I'll pitch in where possible.", "id": "fne9ls", "created_utc": 1584939430.0, "score": 25, "upvote_ratio": 0.93, "num_comments": 25, "comments": [{"body": "If you had 10k to invest in. Starting now.. what are you doing and when?", "score": 5, "replies": [{"body": "I would invest half of the $10K into VTI or any similar fund that closely follows the DOW or S&P 500. I then would dollar cost average the remaining. For example, drop $1K per month into the fund whether market goes down or up. Keep in mind that following the S&P 500 or DOW beats stock investors 90% or more of the time.", "score": 6, "replies": [{"body": "I like the idea of trickling in. I played with the idea of doing half into VOO probably fairly similar to VTI. The. Investing in some solid individual stocks. Mostly good companies that should make it through all this. But maybe it’s better to bail on individual stocks all together? It’s just hard to see the discount of individual stocks like MSFT, SBUX, DIS, GE and not want to get in", "score": 1, "replies": []}, {"body": "Ive done some basic analysis, and determined that for BEAR markets, you should Dollar Cost Average (DCA), and in BULL markets you should Lump Sum invest.\n\nLets look at **$VTI, in a BEAR year (2008)**\n\nIf you lump sum invest in $VTI on Jan1, 2008, at the end of 2008, your returns are:\n\nStockReturn + DivReturn = TotalReturn\n\n61.52% + 1.533% = 62.05%\n\nNow, if you slowly DCA'd starting on Jan1, 2008 to the end of 2008, your returns are:\n\nStockReturn + DivReturn = TotalReturn\n\n70.01% + 1.29% = **71.42%**\n\nNow, lets look at **$VTI in a BULL year (2009)**\n\nLump sum invest $VTI on Jan1, 2009. At the end of 2009, your returns are:\n\n123.68% + 2.405% = **125.086%**\n\nDCA $VTI 2009:\n\n119.49% + 1.473% = 121.058%", "score": 1, "replies": []}]}, {"body": "I would dollar cost average (DCA), but I wouldn't start right now, because nobody knows where the market is going and where it will be in a month. I would wait until any indicator normalizes. Like, at least until 50-day moving average flattens. Or longer.", "score": 2, "replies": []}]}, {"body": "Sorry but all these blue-chip stocks are still overvalued even with the recent drops. Just because they’re cheaper that doesn’t mean they’re a good deal since they were overpriced starting out.", "score": 4, "replies": [{"body": "Right. It depends on the stocks. Certain stocks have the lowest P/E ratios in years and some in well over 5 years. Not all are deals but I would recommend everyone to look at P/E ratio history on the stock of interest.", "score": 1, "replies": []}]}, {"body": "Oh that is helpful. There many to chose from, I think I would do a mix of safe stocks, some personal research, and eft or mut* funds.\n\nThanks for the advice. I need to use money to make money and live life on autopilot and get comfortable like many People do.\n\nI just need  to get to graduate school and acquire more money and acquire assets/wealth whether through stocks or other methods\n\nBest regards!", "score": 2, "replies": []}, {"body": "But how do you know it will go down only \"a little further\"? In 2007/2008 indices and funds like VTI have dropped ~54%. Many investors believe this crisis could be much worse than 2007.", "score": 3, "replies": [{"body": "The reason is that data shows we have been in a sound financial state up until the health crisis began. Unemployment was low, no mortgage and loan problems from the banks, and the economy was strong for the most part. Overall, there was a lot of spending going on and not troubled spending (Borrowed money). The current meltdown's root cause is the virus and once the virus is controlled, everything else will fall in place. You cannot say the same for 2008. I agree with your concern and that this is a very unique spot we are in. Worst-case, this virus issue stretches out 4-6 months. If the virus problems are worse at end of year, then we have a critical issue in our hands but I doubt it'll be worse. The reason why I suggested to dollar-cost average in the other comment as well is because even the so-called best experts cannot predict the bottom. These are the times when everyone will have all kinds of prediction but if you invest for the long-term, it's a good investing point.", "score": 3, "replies": [{"body": "Yes, everything was sound financially before the epidemic.\n\nI'm basing my thoughts mostly on European economies, but the US economy seems to be following.\n\nNow:\n\n1. Trade fairs / conventions / exhibitions closed. It means that thousands of companies won't show their new product lines, won't find customers for machines they invested in designing for past 7 years. Some industries rely on trade fairs (you cannot choose textiles for your factory online etc). Some trade fairs happen only every 5 years and every world industry player is there. Many have been cancelled, some have been moved a year forward.\n\n2. All sorts of service industries closed. Some can't cope with 3 month closure. Means insolvency, means unemployment.\n\n3. People are not driving, oil industry suffers.\n\n4. Airlines suffer, oil industry suffers.\n\n5. Even small stuff like beauticians, hairdressers, barbers - suddenly no work, no income. Suddenly they are not using all these stockpiled products like hair dyes, shampoos and stuff. Chemical companies suffer. And so on.\n\n6. Mid-sized companies that were thriving now are facing insolvency in 3-4 months. It's a damage you cannot undo. The big companies will survive, but all these orders for materials/machines/services from small companies will be gone next year, and the year after.\n\n7. All those cancelled surgeries, medical procedures, because hospitals need space for Covid victims. At least in Europe that's happening.\n\n8. In 2007-2008 crisis some of my family and friends were worried about potential unemployment. In the end, 2 lost their jobs, and a few had to agree to salary cuts. This year 2 friends lost their jobs, and like ~30 people have serious threat of unemployment.\n\nAll these small things add up to financial shitstorm in my book... I might no be right, of course, but I choose to be wary and very conservative stock market-wise right now.", "score": 4, "replies": [{"body": "Fair points. I don't disagree with you at all. We are in a huge case of uncertainty to state the least. The root cause in the virus will have a domino effect to the global meltdown and the hope is it doesn't last too long. I appreciate the sharing of thoughts.", "score": 3, "replies": []}]}]}]}, {"body": "If you think we don't have further to go this year you aren't paying attention.", "score": 1, "replies": [{"body": "Thanks for the feedback. That's why the discussion of DCA is big in this post. If everyone knew market is going up, it would automatically be lump sum.", "score": 1, "replies": [{"body": "Sorry, wasn't trying to sound like a dick. But yes I think if you are doing DCA you will be fine. I think we have awhile to go this year and will be flat for awhile but I will be pumping quite a bit of money into Amazon as this drags on.", "score": 1, "replies": [{"body": "All good. We are all here to share as much knowledge as possible. I definitely would not be surprised if the next quarter continues to be extremely rocky. I wish I would have gotten into Amazon a years back; what a run it had.", "score": 1, "replies": [{"body": "I had about 70% gains on my portfolio due to TSLA, SPCE, and AMZN and somehow got lucky enough to time the market and pull it all out. I am Long on AMZN and MSFT though, they will come out of this stronger for sure.", "score": 2, "replies": []}]}]}]}]}, {"body": "For popular Vanguard funds like VTI, the MF equivalent has higher fees than the ETF. It could, however, be different for other funds and firms.", "score": 1, "replies": []}, {"body": "26% gain. That is approximately the increase in the overall market (Using S&P 500) since I wrote the original post suggesting a great buying opportunity 19 days ago. Of course the market could have dropped further depending on surprising updates/news but we were definitely in oversold conditions. The S&P 500 was just over 2200 points at the time and now we are sitting ~2789. We are at an interesting point now and could swing in any direction. Hang on tight!", "score": 1, "replies": []}, {"body": "I ma gonig to start buying some safe stocks such as amazon,Microsoft, Pepsi, etc.\n\nBut I am stuff between mutual funds and etfs. \nFor Mfs, you have to buy ata minimum of $3,000 and a high margin ratio\n\nWhile\n\nETFs, have a lower margin ratio but are actively traded throughout the day", "score": 0, "replies": [{"body": "I guess it greatly depends as there are huge varieties of ETFs and MFs. If I'm not mistaken, the MF equivalent of VTI has a higher fee so I wild def prefer ETF in this specific instance.", "score": 1, "replies": []}]}, {"body": "One word “depression”", "score": -2, "replies": []}, {"body": "dont buy etfs, they have higher fees that traditional mutual funds. Those fees eat at your returns which and compounded fuck you over. Just do traditional mutual funds if that's what you want", "score": -4, "replies": [{"body": "Did you mean that the other way round?  As far as I know, actively managed mutual funds have higher fees then passive ETFs?  Or am I missing something?", "score": 3, "replies": [{"body": "Look up the difference between etf and regular mutual fund like swppx", "score": 1, "replies": []}]}]}]}
{"title": "Boeing....not a \"should I buy question\"", "selftext": "[deleted]", "id": "fnafnt", "created_utc": 1584922920.0, "score": 15, "upvote_ratio": 0.87, "num_comments": 23, "comments": [{"body": "You do realize GM went bankrupt in 09 and the    shares in old GM were cancelled and worthless, right?", "score": 20, "replies": [{"body": "Yes that’s what I’m afraid of", "score": 10, "replies": []}, {"body": "I was 16 when that happened. They turned into Motors Liquidation. \n\nHow is it that the \"old GM\" died and a \"new GM\" appeared?", "score": 7, "replies": [{"body": "american bankruptcy law", "score": 9, "replies": []}]}]}, {"body": "Why does everyone want to gamble on boeing when you can gamble on literally any other stock?", "score": 9, "replies": [{"body": "Any particular ones you’re eyeing ? :D", "score": 1, "replies": [{"body": "Every single credit card company looks good right now.\n\nIf you want something more fun Wendy's is afaik the only fast food chain with YoY revenue growth. \n\nThe beauty store ULTA looks like its going to the moon.\n\nEdit: QSR Restaurant Brands(Tim Hortons, Burger King, Popeyes) is actually growing YoY, but Tim Hortons specifically isnt doing so hot.", "score": 2, "replies": [{"body": "DAL, RCL?", "score": 1, "replies": [{"body": "I dont want airlines if they can't pay dividends and idk anything about cruises.", "score": 2, "replies": []}]}]}]}, {"body": "Probably because they're almost down to 1/5th of their highs, so anyone expecting them to fully recover is thinking about the huge gains to be had. Assuming the stock doesn't become worthless...", "score": 1, "replies": []}]}, {"body": "Wouldn't consider the situations similar but I still do not believe it is worth the risk.", "score": 4, "replies": []}, {"body": "In my honest opinion, I doubt Boeing will bounce back after this downturn blows over. The stock was already on the decline due to the 747 Max, and their balance sheet was delicate at best. \n\nThey would need a bailout + a Massive overhaul in order to have a sustainable recovery (All of this is my opinion)", "score": 4, "replies": [{"body": "Here's a factor that won't show up on a balance sheet: Boeing's management must be fucking *terrible*. Starliner, SLS, the 737 MAX, the KC-46, it just keeps fucking happening.", "score": 10, "replies": [{"body": "It’s too early to see how good of a job Dave Calhoun will do. However i do agree that Muilenburg was a **terrible** CEO.", "score": 7, "replies": [{"body": "There's something wrong with the culture at Boeing. That's hard to change quickly.", "score": 3, "replies": [{"body": "It's not just Boeing. Way to many companies are run by money people who don't really understand the specifics of their business.", "score": 2, "replies": []}]}]}, {"body": "777X has problems too, and in the past it's been said that the 787 may never be profitable (don't know how that will actually work out).", "score": 2, "replies": []}]}]}, {"body": "Why own Boeing when you could just buy puts?", "score": 1, "replies": [{"body": "I don't know anything about puts to be honest", "score": 3, "replies": [{"body": "It’s too late now cuz the premiums are higher than me in high school.  But you pay for the right to sell something at a certain price in the future.  For example.  I bought SBUX puts a few weeks ago at $1.80 for the right to sell Starbucks stock at $65 in 3/27.    It’s trading in the 50s right now.", "score": 11, "replies": [{"body": "You mind linking me resources to how this works? Any good puts to buy now? Thanks man. Would you actually explain your SBUX example? And how much money would you make?", "score": 1, "replies": [{"body": "Starbucks was trading in the 70s.  Yeah bought an option to sell it to someone at $65 on or before a set date. The option cost me $1.80 at the time.  If the stock was trading at $66 at the date of expiration I would not exercise the option and I would just be out my premium.  If the stock was trading at $64 I would exercise and I would lose a total of 80 cents.   If the stock is trading at $60 I would exercise and I would turn that $1.80 into $5.    You don’t have to hold them until the exercise date.  I can sell them to someone else.   The farther out into the future and the more volatility in the market the higher the price of the option. Volatility is high and no there are no good values anymore.  \n\nGoogle it.", "score": 1, "replies": [{"body": "I mean, you just have to be okay with the breakeven price right? or is the volatility way too high right now?", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Would this not be the perfect corona investment", "selftext": "I am a 15 year old entering the stock market at historic lows. I originally invest 3000 split 50/50 between SPY and QQQ after getting advice from a stock broker friend of my dads. I was left with 500 to sorta play around and learn with. I came across an ETF called OILU, which is a ProShares UltraPro 3x Crude Oil ETF. 3 months ago the price per share was just over 23 dollars and at close last Friday the price had fallen to 40 cents per share. Is this too good to be true? Assuming I put 100 dollars in and it climbs to the original 23 eventually, that investment would go to 5750. Regardless of if it ever bounces up that high, it seems like the returns would be too good to be true. Should I put a large portion of my 500 in that or take a safer more well known bet like Disney or apple.", "id": "fne2y0", "created_utc": 1584938518.0, "score": 8, "upvote_ratio": 0.65, "num_comments": 30, "comments": [{"body": "All these other people are missing the real issue. A 3x etf is not a long term investment. It is a short term trading tool.\nGo google 3x etf...\n\nWhether oil is where you want to be is a different question.", "score": 22, "replies": [{"body": "this.", "score": 4, "replies": []}]}, {"body": "People say crude oil is bad to invest in, I disagree. At least for our lifetime, oil will ALWAYS have a place, no matter what. you really dont have much to lose at 40 cents a share, and if you do make bank, you will make BANK", "score": 5, "replies": [{"body": "So which oil company would you invest in?", "score": 1, "replies": []}]}, {"body": "Dude do some research on crude oil. You’ll understand why", "score": 4, "replies": [{"body": "I’ve done some basic googling and yea it’s wayyyy down and the lockdown and everything else about corona is hitting it super hard. But I couldn’t find anything suggesting why it may not be able to bounce back besides an eventual electric takeover.", "score": 3, "replies": []}]}, {"body": "Lmao this guy is betting on crude oil right now", "score": 12, "replies": [{"body": "If I hold it for say a year and wait for corona to pass wouldn’t that be a good thing. Wouldn’t now at a low be a good time to enter the crude oil industry.", "score": 3, "replies": [{"body": "It would, your mentality of entering low is definitely correct. If you're planning on holding this for 20 years without looking at it, now is perhaps a good price to enter.\n\n I'm just saying there's no need to jump the gun, look at the factors causing this price drop. The oil trade war between Russia and Saudi Arabia just began *two weeks ago*. There is expected to be an oil glut for at least a couple years https://www.npr.org/2020/03/20/818457109/were-barreling-toward-an-epic-glut-of-oil\n\n Not to mention coronavirus growth beginning to become rampant in several countries. \n\nThe thing is there is little harm in waiting 3 months to see how things shake out. The risk you take by waiting, is maybe now really is the bottom and you don't get quite as good value in 3 months.", "score": 4, "replies": [{"body": "I have been told by others that this particular ETF is liquidating and since it’s triple leveraged it’s not a good idea to hold for a long time but I didn’t know about the oil war so it’s probably a good idea for me to hold off on that", "score": 4, "replies": [{"body": "Leverated ETFs are definitely not designed to be held long. Swing and day trading only", "score": 4, "replies": [{"body": "Imagine getting schooled by a 15 year old on investing.\n\n\nStop giving out advice on this sub.", "score": 5, "replies": [{"body": "You say you're 15? What qualifies you? \n\nI'll post whatever I damn well want to.", "score": -7, "replies": [{"body": "I’m not 15. OP is though.", "score": 1, "replies": [{"body": "He asked a question and I answered it. What are you going on about?", "score": 6, "replies": [{"body": "A 15 year old is asking opinions on investing in 3xleveraged oil commodity funds.\n\nAnd you’re encouraging him and telling him its a good idea.", "score": 1, "replies": [{"body": "I said it wasn’t a good idea you illiterate bastard", "score": 1, "replies": [{"body": "OP: Wouldn’t now at a low be a good time to enter the crude oil industry\n\noarabbus: It would.", "score": 1, "replies": [{"body": "...If you plan to hold for 20 years. And then I go on to say to wait regardless.\n\nNow go home and get your fuckin' shine box.", "score": 1, "replies": [{"body": "Fite me", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "If you think oil will still be a main player in 20 years your high every year the market for oil shrinks a bit, may always be around but most countries are looking to cut its use as other alternates become increasingly more cost effective", "score": 1, "replies": []}]}]}]}, {"body": "You'll be better off waiting for some better news from the Russia/Saudi standoff before investing in oil. You can't time the bottom perfectly, but it's better to mistime it on the rebound rather than on the way down.", "score": 2, "replies": []}, {"body": "If your going to just buy and hold it just do something simple like XLE, buy it and hold onto it. The coronavirus is adding to the price dropping like a rock but one of the main things is what is going on between Russia and OPEC. That's whats hurting it so heavily. XLE is also way down. Priced into things like Exon and Phillips. While those are directly oil. They do have a trickle down affect based on the price per barrel.\n\nEdit: Also, leveraged ETFs are pretty much day trading tools / short term, and are risky not meant for long term investing.", "score": 2, "replies": []}, {"body": "The fund is closing at the end of the month and theyre liquidating it, youll lose all your money", "score": 2, "replies": []}, {"body": "Hmm. Think ahead to the future. Imagine a utopia emerging with incredible new technologies. Where does oil and gas fit within this new paradigm?\n\nYeah, oil and gas will recover but not much. The world wants to get off fossil fuels.\n\nI'd look into manufacturing, cannabis, gold and biotech if I were you. Plenty of ways and reasons that these four sectors will have the highest rate of growth in the next year and longer.", "score": 2, "replies": []}, {"body": "Regarding oil: it’s not just the virus, there are geopolitical issues and Russia is targeting the North American shale oil industry and have outright said as such. Until the industry gets permanent damage, the oil war will continue.\n\nRegarding 3x levered oil etf. Go look at the chart of any levered etf that were around during the 2008 crisis. They all decayed during volatile times.\n\nStick with index funds with real money and do mock trading if you want to learn.", "score": 1, "replies": []}, {"body": "Leveraged ETFs work in a similar manner as Options, in that as time passes the value of the ETF drops dramatically due to time decay. If anything the 3x Leveraged ETF will go to zero.", "score": 1, "replies": []}, {"body": "This is not a 15 year old", "score": 2, "replies": [{"body": "I don’t know how to respond to that. I am fifteen though", "score": 7, "replies": []}, {"body": "Lol I was thinking the same thing....", "score": 0, "replies": []}]}]}
{"title": "Why is no one talking about Alphabet?", "selftext": "A lot of buy talk over Microsoft and Disney, but Google isn't as much in the discussion. I'm a beginner and just wondering if I'm missing something.", "id": "fnj2iz", "created_utc": 1584966207.0, "score": 4, "upvote_ratio": 0.71, "num_comments": 25, "comments": [{"body": "I’m guessing more expensive stock, volatility of the market, and economic uncertainty makes people tighter to splurge on $1000+ stocks.", "score": 19, "replies": [{"body": "Google seems wildly undervalued compared to the other big growth tech stock names.", "score": 3, "replies": [{"body": "I’m not saying it’s bad stock, I’m speculating why people are not talking about GOOG. I think it’s going to go below $1000.", "score": 2, "replies": []}]}, {"body": "Fidelity, M1 Finance, and other platforms offer fractional shares of Google.", "score": 1, "replies": []}, {"body": "That doesn't matter today, fractional shares have changed that. Its down 30%, itll recover, your dollar amount doesn't matter, 30% is still 30%.", "score": 0, "replies": [{"body": "I’m just speculating why no one is talking about it.\n\nEdit: fractional or not, it’s still an expensive stock and most people don’t like buying stocks that are fractional.", "score": 7, "replies": [{"body": "They don't??? I wish we had that option in Denmark. Sooo much easier to let something be exactly 10% of your investments when your capital isn't that much", "score": 1, "replies": [{"body": "Honestly, don’t know that many investors are i in fractional investment of 1 stock.", "score": 3, "replies": [{"body": "I don't get the turnoff? Unless you really care about dividends sure don't do it. Other than that your investment still gets the same return. You want big money, spend big money. Its really just simple math at that point.", "score": -2, "replies": [{"body": "How do you explain the lack of interest of GOOG?", "score": 1, "replies": [{"body": "I can't and I agree with OP that it doesn't make sense, they are down 30%", "score": -1, "replies": [{"body": "That’s what I thought. Again, as I repeated before, I was speculating. I literally said “I’m guessing”", "score": 2, "replies": [{"body": "Yup, and my response refutes what you're saying. Thats what a debate/discussion is.", "score": 0, "replies": [{"body": "You completely ignored what OP was asking and responded with a tangent to me. I can’t debate how you feel and what you feel. But, I responded to OP’s question, maybe you should too. But, you didn’t.\n\nEdit: you did not refute All of my points, you literally said you didn’t understand why. You did not address the economic uncertainty and volatile markets. I hope google goes below $1000", "score": 1, "replies": [{"body": "Lol fractional share = refutes your point", "score": 0, "replies": [{"body": "Edit: the lack of interest you didn’t address. Lol", "score": 1, "replies": []}, {"body": "Why isn’t anyone talking about GOOG?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I bought GOOGL at $1065, I think it’s a good choice, they are not even closely hit by the virus as other companies and I believe they will be one of the first to go back up. The price decrease seems to be just panic", "score": 11, "replies": [{"body": "I believe the virus will impact google, though indirectly. Last I saw Google makes around 85% of their revenue from ads. If many businesses are making less money (or go out of business completely), then they may choose to cut their marketing budget. Companies bid on ad words from google. Google ad words are sold to the highest bidder. So less competition > less bidders > lower prices for ad words > less revenue.\n\nI am long Google.", "score": 11, "replies": []}]}, {"body": "I'm poor bruh", "score": 6, "replies": [{"body": "Fractional shares bruh", "score": 2, "replies": []}]}, {"body": "Microsoft and Disney cost a lot less than Google but if you have the funds to purchase then I think they're a buy.", "score": 2, "replies": []}, {"body": "Thanks for the replies everyone. I've been waiting for it to drop below $1000. I'll buy with more confidence now.", "score": 2, "replies": []}, {"body": "I’m about to buy a share or two.. trying to be patient", "score": 1, "replies": []}, {"body": "they never are in these discussions. to grab ad market i would rather take fb than ever flopping google", "score": -1, "replies": []}]}
{"title": "How do you guys think Amazon will handle the corona crisis?", "selftext": "I have quite a large percentage of my portfolio invested in amazon. I bought back in 2018. At appropriately $1200. I’m worried that amazon will have to send a large part of their employees home. \n\nDo you guys think amazon will be effected by this? If so how much, and how come?  \n\nThanks, I’m fairly young and a trader looking to learn:)", "id": "fnk9av", "created_utc": 1584971357.0, "score": 7, "upvote_ratio": 0.78, "num_comments": 21, "comments": [{"body": "[removed]", "score": 14, "replies": [{"body": "Thank you, I did not know this. Where are you reading this information? I’d love to get to know more sites that writes about American stocks", "score": 2, "replies": []}]}, {"body": "I cant imagine anything short of an apocalypse taking Amazon down honestly lol.", "score": 11, "replies": [{"body": "[https://medium.com/@hassansky/the-amazon-juggernaut-a07333f6a363?source=friends\\_link&sk=44f644a7092cc2c7de81ac0a5771fc3f](https://medium.com/@hassansky/the-amazon-juggernaut-a07333f6a363?source=friends_link&sk=44f644a7092cc2c7de81ac0a5771fc3f)", "score": 1, "replies": []}]}, {"body": "a) They'll be fine. They have far more work than they can possibly do right now since people aren't going out. Prime deliveries of non-staple goods are being delayed by weeks in some cases because they don't have the capacity to deliver their current orders. \n\nb) \"affected\"", "score": 6, "replies": [{"body": "Sorry. I’m danish so English is not my first language", "score": 8, "replies": [{"body": "No worries. I talk to a lot of people from other countries and they all prefer to have that pointed out. I was trying to be helpful, not critical. Sorry if it came across as critical.", "score": 2, "replies": [{"body": "No not at all, just thought I’d excuse myself to not come across as ignorant and stupid.", "score": 2, "replies": []}]}]}]}, {"body": "One of the best companies positioned for success in all of this.\n\nRead: [https://medium.com/@hassansky/the-amazon-juggernaut-a07333f6a363?source=friends\\_link&sk=44f644a7092cc2c7de81ac0a5771fc3f](https://medium.com/@hassansky/the-amazon-juggernaut-a07333f6a363?source=friends_link&sk=44f644a7092cc2c7de81ac0a5771fc3f)", "score": 2, "replies": [{"body": "I Will thanks", "score": 1, "replies": []}]}, {"body": "They’re literally hiring thousands of workers right now. Maybe take a look at the news.", "score": 2, "replies": []}, {"body": "I’ve been working at amazon and the new hires are already starting work here \nVolume has not gone down", "score": 1, "replies": [{"body": "Thanks for the heads up :))", "score": 1, "replies": []}]}, {"body": "I'm buying into Amazon every day. My buddy says they're working round the clock.\n\nFractional shares are where it's at. I buy about 5$ worth a day.", "score": 1, "replies": [{"body": ">I buy about 5$ worth a day\n\nDont get greedy bud lol at that rate you might own a whole share by the time the next bull market hits", "score": 6, "replies": [{"body": "Fractional shares, invest in many great companies at once to diversify. PM me if you'd like my portfolio.", "score": 1, "replies": [{"body": "Post it here!", "score": 1, "replies": [{"body": "It gets removed by the auto mod", "score": 1, "replies": [{"body": "Oh I realized I replied to another one of your comments without even realizing it LOL. DM me bro 💪", "score": 1, "replies": []}]}]}]}]}, {"body": "Thanks buddy, let’s hope to both see some growth 💪", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "fnn68q", "created_utc": 1584982028.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 19, "comments": [{"body": "Like where the f do you invest in Samsung?", "score": 4, "replies": [{"body": "It’s on the KRX", "score": 1, "replies": [{"body": "I’m using Robinhood and I don’t see it...", "score": 1, "replies": [{"body": "Because it’s on the KRX", "score": 2, "replies": [{"body": "I’m new to all this so I have no idea what the is😂😂", "score": 1, "replies": [{"body": "That’s just the Korean Exchange so that’s why it’s not on RH lol", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What is the ticker for Samsung?", "score": 3, "replies": []}, {"body": "Oh no", "score": 2, "replies": []}, {"body": "1/20", "score": 1, "replies": []}, {"body": "Stock being totally overvalued because many people wanted to be rich and got greedy. Now everyone is scared panicselling pressing the price down each day. And from how it looks like it won't stop falling just yet maybe 400-500?\n\nI'm not experienced with Samsung or what affects it so I'm really not sure how low it can go", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You mean 1290 right? Are you looking right?\n\nBut as I said yeah many stocks were totally overvalued. 1st hit was correcting everything. 2nd hit corona. 3rd hit panic. Now at roughly 800.\n\nThe only way I see it being affected otherwise is.\nOverseas shipping being reduced worldwide factories closing down, supply chains being broken. And generally people only wanting to buy food now nothing else.\n\nEdit 800", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Urgh I see what you mean now but I didn't see that value on other sites.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Samsung also had a stock split 50:1 in 2018 which would reduce the price per share quite drastically.", "score": 1, "replies": []}]}]}, {"body": "I think I solved the problem. I think the graph shows 120000 in Korean currency and 2020 in usd.\n\nHaha.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes but that in 2017 defenetily show Korean currency.\n https://www.finanzen.net/aktien/samsung_adrs-aktie\n\nFor example. In EUR.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No problemo, but honestly a crash from 120000 to 800 would have been some record shit right there.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah haha.\n\nBut honestly I will probably invest into companies that produce physical goods in about 1 month.\n\nWas planning on investing in VW as soon as they prolong lockdown next month. Should panic investors quite a bit next month.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Will check it out.\n\nI just need that wow feeling next month, because I still think we are at the very beginning right now and depending on what government does due to corona I will decide.\n\nBut currency is about to be worthless soon enough due to ezb and fed starting to flood the market.", "score": 1, "replies": []}, {"body": "You should also check out Brent oil this week.\n\nRussia has been doubling down every day since trade war with OPEC started.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}
{"title": "Boeing", "selftext": "How in the good fuck is BA up after news on closing facilities but agreeing to still pay employees? Rtn lmt gd are all down on the day, significantly. \n\nGot a call credit spread -99 strike +100 strike for 3/27. Got faith in BA getting back to 90 by week's end. Thoughts?", "id": "fnpi40", "created_utc": 1584989446.0, "score": 8, "upvote_ratio": 0.8, "num_comments": 26, "comments": [{"body": "Goldman Sachs upgraded it today", "score": 6, "replies": [{"body": "This. Larger firms recommendations CAN move stock prices in direction that doesn’t make sense at all.", "score": 4, "replies": [{"body": "They upgraded first thing in the morning the stock didnt pop until after the stock was halted around 1230", "score": 2, "replies": [{"body": "It was still up around 4% in the morning. Rest is probably short sellers covering up to lock profits since this upgrade “might” move stock price up. Just my 2 cents.", "score": 2, "replies": [{"body": "Covering was what I originally thought but didn't think there were enough people covering to pump the stock like 25% from it's intra low.", "score": 1, "replies": []}]}, {"body": "Wait, why was the stock halted today???", "score": 1, "replies": [{"body": "For pending news.they shut down a plant in Washington and confirmed they will pay their employees thru shutdown and the stock jumped like 20 percent on that news", "score": 1, "replies": [{"body": "They can just halt all trading if they want? Wtf. Companies can do that?", "score": 1, "replies": [{"body": "Apparently more should.. huge post halt bump apparently", "score": 1, "replies": []}, {"body": "yes, they can.  We saw the same thing when the FAA announced that 737Max won't return to flight at the end of Jan this year.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "A day after Goldman Sachs called for s&p to bit 2000. Contradictory statements. \n\nStill more negative news is coming out about BA right now and it is not tanking, they just threw in the halting of their production of certain military instruments and stated issues with delivering 787s out of South Carolina due to lack of pilots.\n\nJefferies estimates the suspension that was announced by Boeing today at 12:30 will cost the company 4.3 billion per month. But the stock went up fuckin 18 percent and is still up nearly 10.", "score": 0, "replies": []}]}, {"body": "Im a complete noob but let me speculate. \n\nLonger term they have alot going for them, prob 10 billion in 737 max inventory waiting to delivered when clear, the 777x is on track looking great, and their previous stock buy backs while days were sunnier will still benefit them when things improve.", "score": 2, "replies": [{"body": "Solid speculation. These are all great things for the company, but none would explain today's explosion. 20 percent over a year would make sense based on the info you provided not 20 percent in an hour", "score": 1, "replies": [{"body": "https://www.google.com/amp/s/www.fool.com/amp/investing/2020/03/23/why-boeing-stock-popped-65-this-morning.aspx", "score": 2, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}]}]}, {"body": "Because this company can't fail and it's super discounted right now. People need to realize the big boys don't bail after retail bails. They buy buy buy.", "score": 2, "replies": []}, {"body": "I’m not sold on Boeing. 737 Max mismanagement. Now with the virus, airlines are struggling to just not go under. I don’t foresee a big order for Boeing anytime within the next year or two.", "score": 1, "replies": [{"body": "If it's not Boeing, who will produce airline fleets? Boeing is not going anywhere my friend they are critical to the economy. It takes decades to be a main player in the aircraft industry. I don't see other companies in the industry rising to their level.", "score": 3, "replies": [{"body": "Airbus opened up a production facility in the us some years back.  If Boeing keeps dropping the ball Airbus could realistically expand into that vacuum and set itself up as a new American manufacturer.", "score": 1, "replies": [{"body": "US wont allow this simply because airbus is european", "score": 2, "replies": [{"body": "And Airbus is positioning themselves to become at least partially an American airplane manufacturer to compete against Boeing.  Airbus was burned in 2010 when they won the contest for the next USAF tanker over Boeing's submission but had it taken away from them by Congress for not being an American company.  In response they opened a large aircraft manufacturing plant in Alabama and are currently mass producing a320 aircraft there.  \n\nTheir intended goal is to be considered an American aircraft manufacturer to directly compete against Boeing for even USAF contracts.  It's been a slow ramp up because Airbus got hammered by Boeing in the latest rounds of aircraft sales.  The recent weakness of Boeing sales MAY turn new orders from airlines to Airbus planes moving forward.  With that increase of revenue it would be a very good time for Airbus to continue their expansion into the us and directly threaten Boeing as the primary American aircraft manufacturer.", "score": 2, "replies": []}]}]}]}]}, {"body": "Where is the best place to get these kind of bits of news as it comes out?", "score": 1, "replies": [{"body": "I use thinkorswim but Yahoo finance does a good job. Bloomberg tv / their website too.", "score": 2, "replies": []}]}, {"body": "Vote up. \nI work there as well! Im skiddish, i dont think we’ve bottomed yet, of course these market influencers buying heavy could change that, but it just feels early.", "score": 1, "replies": [{"body": "How about trump pumping BA during his addresses the last two nights... Crazy", "score": 1, "replies": [{"body": "I know it, the enormity of the export dollars they rake and Boeings massive supply chain are a gigantic factor in a high performing economy and he knows it. \n\nPersonally i dont think they need huge cash right now but the supply chain does and they are critical.", "score": 1, "replies": []}]}]}]}
{"title": "Good time to invest after 3M Announcement?", "selftext": "[removed]", "id": "fnf791", "created_utc": 1584944354.0, "score": 12, "upvote_ratio": 0.66, "num_comments": 22, "comments": [{"body": "I am not sure what the Dev's at Robinhood where thinking when they released this Corona Expansion, hopefully the Oil War Patch makes it a bit better.  This 3M buff is kind of bullshit, there was nothing wrong with them, why buff them?", "score": 24, "replies": [{"body": "I don't know; I'm having more fun playing the RH app than I ever have before. I literally spend hours every day on it now.", "score": 4, "replies": [{"body": "It’s to fast for me, I preferred the Trump Pump expansion way more.", "score": 5, "replies": []}]}]}, {"body": "LOL.  I mean come on.  The whole economy is in danger, and you think having more respirators will help?  We are all staying inside so we don’t have to use those fucking things.  Use that brain yo mama gave ya.", "score": 49, "replies": [{"body": "Nice try! You won’t keep me from making money!!", "score": 7, "replies": [{"body": "Show your call positions then.", "score": 3, "replies": []}, {"body": "Have you bothered to even see what % of 3M's business is making masks?  Even when you multiply that by the increase, what % are we talking?  5% tops?", "score": 1, "replies": [{"body": "Didnt 3M invent the Post-It Note?  I had that on a old Post-It Note somewhere.", "score": 1, "replies": []}]}]}]}, {"body": "No they are not a pure play mask maker.", "score": 7, "replies": []}, {"body": "Yes if you can tell me what % of their total income this represents", "score": 9, "replies": [{"body": "I’ve tried for a month to derive it, it I got like 2/10ths of one percent. That’s when I realized I’m autistic and not retarded and moved on from this exact play.", "score": 12, "replies": []}]}, {"body": "It will go down with the market. The announcement won't change that.", "score": 4, "replies": []}, {"body": "#ricedIN\n\n(Also ban)", "score": 3, "replies": []}, {"body": "What's their profit margin on each one? Do your DD bitch", "score": 3, "replies": []}, {"body": "Depends. They giving it away for free or pulling a Shkreli? Demand and Supply amirite?!?", "score": 3, "replies": []}, {"body": "Respirators are face masks, not ventilators.\n\nImagine if we actually needed 35million ventilators. 1/10th of the US population hooked up to machines to breath for us.", "score": 3, "replies": []}, {"body": "Invest? I’m confused. What does that mean?", "score": 4, "replies": []}, {"body": "Nope", "score": 1, "replies": []}, {"body": "I played 3M when the whole beershit started. They’re masks only account for little part of their business. Puts. Because I say so bitch.", "score": 1, "replies": []}]}
{"title": "I'm up 300% on TSE:HXD! But Wealthsimple Trade won't let me sell... x2 leverage bear market", "selftext": "[removed]", "id": "fnl6ty", "created_utc": 1584975043.0, "score": 8, "upvote_ratio": 0.6, "num_comments": 22, "comments": [{"body": "you dumb dawg it's a reverse split", "score": 18, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "hxd *is* an inverse ETF dude they just took 4 of your shares and combined them", "score": 1, "replies": []}, {"body": "An inverse on an inverse ETF isn't an inverse. Whoosh", "score": -1, "replies": []}]}]}, {"body": "Nobody cares", "score": 8, "replies": [{"body": "Hate it cause you are down 50%", "score": -10, "replies": []}]}, {"body": "I own that as well but they had announced a stock split over a week ago. \n\nRatio 1:4\n\nEdit: your units should be converted by tomorrow. That is what RBC is telling me anyways. With all this stimulus spending I may as well bend over and gap my ass open now.", "score": 5, "replies": [{"body": "Do I keep the GaInS? Didn't see that in the news thanks for the infos!", "score": -2, "replies": []}]}, {"body": "ugh, I hate Betapro ETFs and the poor communication brokers provide Bout these splits.... they announce it on the day of leaving you no time to pull your money, and while saying you must call in (you barely can these days). I feel your pain. As this happened last month with HQU. IT TOOK 3 DAYS with NBDB for the funds to \"settle\" -meanwhile, no easy way to get out.", "score": 2, "replies": [{"body": ":o", "score": 1, "replies": []}, {"body": "I am also with NBDB and have 1000 HOU I bought last week at $0.87.  With a 10:1 split I know it's not what it looks like.  They updated the new share price but nothing with the amount of shares (says I still have 1000 shares and up 600% when I should have 100 now).  Didnt knowing will take 3 days for that to update.  I'm just gonna let it ride, my loss so far is quite minimal.", "score": 1, "replies": []}]}, {"body": "What the fuck is a TSE:HXD? I believe the phrase “play stupid games, win stupid prizes” applies here", "score": 7, "replies": [{"body": "TSE is the market and HXD the stock", "score": 0, "replies": []}]}, {"body": "Rule #1: Don’t trade Toronto stocks", "score": 3, "replies": [{"body": "With the value of the canadian dollar vs the USD, I feel like I don't have the choice...", "score": 1, "replies": []}]}, {"body": "Horizons just did a bunch of reverse splits. As par the course.", "score": 2, "replies": []}, {"body": "Sellar job, dumbfuck", "score": 1, "replies": []}, {"body": "Update: there might be something about the disband of this etf on the broker... What will happen now?", "score": -7, "replies": [{"body": "u broke.", "score": 6, "replies": [{"body": "U mean my mortgage I just put in the market isn't worth anything now? Maybe not my mortgage but still", "score": -1, "replies": []}]}, {"body": "Bend over", "score": 2, "replies": [{"body": "I'm not a 🌈🐻", "score": -5, "replies": []}]}]}]}
{"title": "Is Zoom in a bubble?", "selftext": "[removed]", "id": "fnmf9y", "created_utc": 1584979476.0, "score": 15, "upvote_ratio": 0.82, "num_comments": 22, "comments": [{"body": "I believe PE stands for “portfolio envelope”", "score": 22, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "What’s my PE ratio then?", "score": 12, "replies": [{"body": "incredibly high", "score": 15, "replies": []}, {"body": "Lol. PE is price to earnings ratio. A 1500 difference shows that their earnings don't support such a high share price.", "score": 0, "replies": []}]}, {"body": "Dooley noted", "score": 2, "replies": []}]}]}, {"body": "Whole markets a bubble", "score": 14, "replies": []}, {"body": "no it's conference call software", "score": 6, "replies": []}, {"body": "Zoom will likely get companies to sign contracts and once it's baked into the yearly budget it's staying. Don't bet against them yet.", "score": 4, "replies": []}, {"body": "Yes puts are a smart move.", "score": 4, "replies": []}, {"body": "I literally thought about doing this exact thing. But I'm a little bit of a re", "score": 3, "replies": []}, {"body": "Zoom zoom zoom", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah please do that", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Omg this is a level of retardation I can get behind.", "score": 3, "replies": []}]}]}]}, {"body": "I’ve heard lots of complains about Zoom as far as their pricing/licensing models from people that have demo’d or used it. We don’t really know the full numbers right now, and this huge bump is mostly speculation. But with how aggressive their purchase agreements are they may have locked in enough customers to put out some good financials when the time comes.", "score": 3, "replies": [{"body": "Definitely cheaper / better models than their competitors. Unless something changed when I priced them out for my company 1+ year ago, Zoom was way more favorable than Webex/Cisco and BlueJeans.", "score": 1, "replies": []}]}, {"body": "TDOC is in a bubble too. PUTS!", "score": 1, "replies": []}, {"body": "Puts and shorts", "score": 1, "replies": []}, {"body": "Too many free alternatives or cheaper. Robin Hood trap nest stock", "score": 1, "replies": []}, {"body": "While I’m super pro-Zoom I don’t think they’re going to be able to monetize this as much as their stock currently shows. So many people using the free version must be having a significant toll on their infrastructure and their costs are going to skyrocket without seeing the revenue gain to make it worthwhile. I exited at $125 - but still bullish on them as a company as they really do have the best product out there for the price.", "score": 1, "replies": []}, {"body": "Wouldn’t they come up again for EC? In the next quarter?", "score": 1, "replies": []}, {"body": "Naw. Companies are learning to work more efficiently at distance. Puts on MAR.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "fnmy5b", "created_utc": 1584981255.0, "score": 26, "upvote_ratio": 0.94, "num_comments": 30, "comments": [{"body": "Buffett personally coughs in every bottle of ketchup and mustard that leaves the plants", "score": 47, "replies": []}, {"body": "Yo guys I feel like people dont really understand what it means for a stock to move up 50%. That means you think this company will go from being worth 27Billion to 40 Billion. Thats a 13 Billion dollar difference, because they sold a bit more during a pandemic? Thats not how shit works lmao.", "score": 29, "replies": [{"body": "If you ask the feds then this is exactly how it works lmao", "score": 17, "replies": []}, {"body": "You're assuming the market is currently rational", "score": 6, "replies": []}, {"body": "There’s only one type of Fundamental now, and it goes like this:\n\nWhen the fed’s a Funda, the market gets Mental. \n\nWith volatility as high as it is, fundamentals lose all meaning on a short term basis. Heinz’ll spike on positive news in a sea of red. It doesn’t matter if it’s sustainable, just matters if you can get in at a good price and not get too greedy.", "score": 2, "replies": []}]}, {"body": "Once people stop panic buying though, so what?", "score": 11, "replies": [{"body": "Are you suggesting we make plays >1 week out?", "score": 6, "replies": []}, {"body": "Yeah this panic buying of Kraft Mac and Cheese is mostly temporary. Eventually pantries are going to run out of room.", "score": 4, "replies": []}]}, {"body": "I deal with KH as a vendor. Honestly, an awful company to deal with.", "score": 8, "replies": [{"body": "I don’t doubt that at all, but I would rather stick my dick in a pencil sharpener than eat hunt’s ketchup instead of Heinz. KH all day", "score": 2, "replies": [{"body": "I agree, however they have a lot of products. The problem is. I may order 20,000 cases total of 5 items. They may send me 15,000 of 2 items I did order and 5,000 of an item I didn't. Then they make you jump through hoops for them to fix their mistake. I honestly dont understand how they are a profitable company.", "score": 3, "replies": [{"body": "Theyre not really. May I direct you to their 5 year chart...", "score": 2, "replies": []}]}]}]}, {"body": "I'd be more confident in it if it weren't already down.", "score": 2, "replies": []}, {"body": "I’ll ride it with ya.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "KR calls are better. They are doing very well. This quarter will be a beat.", "score": 1, "replies": []}, {"body": "This stock was 95 dollars three years back", "score": 1, "replies": [{"body": "That's because 3g capital is a dog shit company with moron Brazilians and their cronies running everything. Take a look at $BUD and $QSR, they were dropping way before beer flu.  That said, I think this stock can pop with all the panic buying.  The premiums are insanely cheap, 4/3c $22.00.  Come on, 20 contracts for $2,300. these are barely otm right now.", "score": 1, "replies": []}]}, {"body": "I'm in there and GIS too.", "score": 1, "replies": []}, {"body": "Agreed. But I think we need to be careful about timing - don’t think the stock will pop before earnings. Markets needs some catalyst to believe in these guys again.", "score": 1, "replies": []}, {"body": "Didn't he dump Kraft for Kroger?", "score": 1, "replies": [{"body": "Khc was sucking so then he went and bought kroger.", "score": 1, "replies": []}]}, {"body": "lol and they were floating around 52 week low before shit hit the fan. Only bull case for this is if Buffet decides to buy more (which i doubt since there are way better companies to buy atm)", "score": 1, "replies": []}, {"body": "I thought that said KFC 'n now im hungry", "score": 1, "replies": []}, {"body": "I've been sitting on 5/15 32.5c for weeks. Ready for that ER pump", "score": 1, "replies": []}, {"body": "My autism mustve leveled up cuz i thought you meant golden corral type of buffets", "score": 1, "replies": []}, {"body": "Who tf cares about ketchup? Think bigger man", "score": 1, "replies": [{"body": "Who the fuck cares about Buffet, think bigger you autist", "score": 1, "replies": []}]}]}
{"title": "BA?", "selftext": "[removed]", "id": "fnoqkm", "created_utc": 1584987017.0, "score": 18, "upvote_ratio": 0.83, "num_comments": 27, "comments": [{"body": "[removed]", "score": 21, "replies": [{"body": "shouldn’t traditional retards have already come to that conclusion from how integral boeing is in our society", "score": 7, "replies": []}, {"body": "The workers are still going to be paid for 10 days. 4 of the 14 days are already weekends. expenses arn't going to drop that much. plus they are going to spend a lot of deep cleaning everything.", "score": 1, "replies": []}]}, {"body": "idk money printer go brrrrr    \njet engines go brrrrr  \ngood enough for me!", "score": 26, "replies": [{"body": "Good DD, thanks for clearing it up!", "score": 10, "replies": []}]}, {"body": "Discounted puts!", "score": 6, "replies": [{"body": "positions?", "score": 1, "replies": [{"body": "105$c 4/03", "score": 1, "replies": []}]}]}, {"body": "So here's the basic DD for you retards who don't understand BA. First you have to realize that BA's business itself was never in trouble. BA always has a huge backlog of planes to build, like 10 years worth of planes, so their business is rock solid. A factory shutting down for a week or month is completely irrelevant, they can always run extra shifts later.\n\nThe risk to BA was always their CUSTOMERS being unable to pay BA for those planes. Payment deferments and stuff would fuck up BA's cashflow real quick. This is why BA asked for a 60 billion bailout of the aerospace industry (rather than a bailout for itself).\n\nBack to your question, why did BA spike today? Some good news came out for airlines stimulus. The House version of the bill includes around 22 bil in cash grants for airlines, instead of only loans. As written above, cash for airlines means cash for BA. Hence the spike.\n\nI'm holding 100 BA shares I picked up at $100 and have been writing weekly covered calls. Sold one last week that expired worthless, tendies for me. Sold one earlier today when the price spiked, 3/27 125c for $700. Free money is free money.", "score": 10, "replies": [{"body": "I bought it at $103 last week and sold a covered call at $110 4/17 for $22.  I'm actually hoping it gets executed.  Would be a quick +30% so I hope it gets executed.  Just shocked at a 20% jump after bleh news regarding the closing of the plant.", "score": 2, "replies": []}, {"body": "Can u do UAL next u fuck ass", "score": 2, "replies": [{"body": "I don't fuck with airlines, too many of them and their financials are too complicated. Rode some puts on the way down that's about it.", "score": 2, "replies": []}]}, {"body": "Good analysis. I'm in for 100 as well and will sell a covered call against it as well with these premiums.\n\nI had a small bull call spread on BA that expired on Friday so of course it pops today. It needed to move quite a bit to print though.", "score": 1, "replies": []}]}, {"body": "Goldman Sachs", "score": 3, "replies": []}, {"body": "Maybe a big buyer from Omaha", "score": 5, "replies": [{"body": "He’s smart enough to dig deep on their books. He’d rape them on price", "score": 1, "replies": [{"body": "Very true but this might be one of those great business he always talks about. Make a few management changes and set off selling planes and defense aircraft again. There has to be massive value in both IP and equipment and material etc", "score": 1, "replies": [{"body": "At their current debt load, their liabilities exceed their assets by tens of billions. He’d be betting that there’s a cheap way to get the MAX back in the air to cash in on those orders - in a time when airlines suddenly and unexpectedly don’t need more planes. \n\nIt’s better for Boeing to declare bankruptcy so they can shed the debt - then Buffett could buy them and have a way forward.", "score": 1, "replies": []}]}]}]}, {"body": "Degenerates at Goldman upgraded them", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "What is google?  I have AOL online.  Will that work?", "score": 6, "replies": []}]}, {"body": "Boeing 'doesn't' produce planes and run facilities. They have tons of umbrella companies. Boeing is just a giant holdings company just like me holding in my cum during nofap", "score": 1, "replies": []}, {"body": "Plant closure.  L2 CNBC", "score": 1, "replies": []}, {"body": "Don't worry, it's closing flat or negative", "score": 1, "replies": []}, {"body": "I'm sitting back. Took tiny loss buy, this shit is weird. Asap gonna start ridding TVIX like Ron Jeremy ridding Tyra Banks.", "score": 1, "replies": []}]}
{"title": "Why the simpack didn't drop.", "selftext": "[deleted]", "id": "fnr6fi", "created_utc": 1584994950.0, "score": 47, "upvote_ratio": 0.89, "num_comments": 18, "comments": [{"body": "You just said there is a big green dildo coming, but then bought Starbucks and Disney puts.", "score": 57, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Long Puts, Short Calls", "score": 11, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "But you said you already bought them?", "score": 3, "replies": []}]}]}]}, {"body": "I’m losing all kinds of money on my Disney puts", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 18, "replies": [{"body": "I'm fuckin dead inside.", "score": 4, "replies": []}]}, {"body": "My only concern is that they do it Thursday when the unemployment numbers come out and we get another sideways day. We need it Friday so we can have a bloody Thursday and a massive bounce the next day.", "score": 8, "replies": []}, {"body": "Retard Alert 🚨", "score": 10, "replies": []}, {"body": "Maybe. Or it doesn’t get passed at all ;)", "score": 4, "replies": []}, {"body": "My calls finna print when the simpack drops", "score": 4, "replies": []}, {"body": "How do you trade with all the drool on your keyboard?", "score": 3, "replies": []}, {"body": "> The longer the foreplay, the bigger the green boner. \n\nyou are a true poet my autistic friend", "score": 3, "replies": []}, {"body": "Stimulus Edging.", "score": 3, "replies": []}, {"body": "Dammit.  You made me drop my cigarette and it went flying off my quarantine balcony and into the ocean.  \n\nThe fed put is turning tricks at the bus station; there aren’t any retail investors to catch knives; so playing the VIX means shorting the S&P with significant leverage... but you are advocating a bottom?  \n\nI’m confused.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I have a color printer, does anyone have a $100 I can borrow?", "score": 1, "replies": []}, {"body": "Ban", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "fnrdjl", "created_utc": 1584995611.0, "score": 27, "upvote_ratio": 0.86, "num_comments": 27, "comments": [{"body": "Why tf would you buy Netflix puts when the entire world is locked in their house with nothing else to do?", "score": 29, "replies": [{"body": "My autism peaked and I thought wHaT gOes Up MuST gO DoWN fml", "score": 12, "replies": [{"body": "Is your next move betting against Purell and face masks?", "score": 22, "replies": [{"body": "Purell is a private company.", "score": 1, "replies": []}, {"body": "Donnie just declared the virus over with so oBviOuSlY", "score": -2, "replies": []}]}]}]}, {"body": "ROKU $100 or $110 Calls for 4/17 is a sleeper pick boys. Premiums are not that high yet either for it.", "score": 6, "replies": [{"body": "what'd you pay for your 110c", "score": 3, "replies": [{"body": "I got in at $1.70 a little before close. They were cheap as fuck this morning I wish I spotted them. Trading at around $2 now and roku is up after hours.", "score": 2, "replies": [{"body": "Yeah it’s at 2.09 now...a little more steep", "score": 1, "replies": []}]}]}, {"body": "I have similar calls. How long you holding for? I’m tempted to ride out this week, Roku May have entered the Zoom bull trajectory", "score": 2, "replies": [{"body": "Yeah I’m definitely riding it out for a bit here. Got to feel it out and see how high we can go!", "score": 1, "replies": []}]}, {"body": "Now this was some serious foresight.", "score": 1, "replies": []}]}, {"body": "Yep. Roku too...had puts on it...", "score": 6, "replies": []}, {"body": "We are never going out of our yards again and you buy putz. Bwahhhhhhhhh ahahahahah you might actually be too retarded for this sub.", "score": 6, "replies": []}, {"body": "It’s not just NFLX, tech in general has been stubbornly resilient. I don’t get a lot of it. Like why the fuck is PTON not crashing? Work from home yah yah, who the fuck is going to spend thousands on a fucking bike when they just lost their job? Could give many more examples, but you get the idea.", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": []}, {"body": "Waiting for next earnings to come out and this bitch will sink. Waiting to jump in on the inevitable fall of Chipotle.", "score": 1, "replies": []}]}, {"body": "It’s also the easy play for any ol person off the street... That and amazon are the easy wins for someone not combing the markets for deals", "score": 2, "replies": [{"body": "Isnt this why u short it?", "score": 1, "replies": []}]}, {"body": "fucking retarded for thinking netflix is going to crater when literally all the countries that has a population that can actually afford netflix is under lockdown.", "score": 2, "replies": []}, {"body": "Switch to ROKU. Looks like it may be beginning a run after a huge drop.", "score": 1, "replies": []}, {"body": "AYTU....  gonna moon", "score": 1, "replies": []}, {"body": "OP retardedly tried to short a company whose entire bussiness model is preimer home entertainment during a world wide quarantine. Jesus fuck I can hear the autistic screeching from here, and I can't stop laughing boys.\n\n#The fuck is wrong with you lmao?", "score": 1, "replies": []}, {"body": "Out of all the companies to buy puts you chose netflix.\n\n&#x200B;\n\nYou sir are the true autist.", "score": 1, "replies": []}, {"body": "Wow you are fucking retarded.", "score": 1, "replies": []}, {"body": "It makes sense that it would go up. People are forced into quarantine, and are most likely going to spend it mindlessly watching Netflix", "score": 0, "replies": [{"body": "But more Netflix watching doesn’t make Netflix anymore money so.... yeah that thesis doesn’t work. Subscriptions remember? Netflix makes the same whether you watch 2 hours or 20. The boost in these so called quarantine stocks I feel is all a sham.", "score": 4, "replies": []}]}]}
{"title": "Aggressive Options, PTON-AMZN-WDC-FEYE", "selftext": "Today  I included the aggressive orders, PTON seems really aggressive, but the IV is so high now I think it may be too late to jump into it.\n\nThese  options orders are on or above the ask. Many have the same expiry and   strike. Also lots  of the orders were sweeps so these ppl were breaking down their order to get filled faster.\n\nHere - [https://imgur.com/a/diURZDG](https://imgur.com/a/diURZDG)\n\nAlso   all these orders volume of the contracts exceeded the open  interest  in  multiple trades so it's most likely not closing positions. Either  buy  to open orders or sell to open orders and based on the     aggressiveness  of the orders one can infer its buy to  open.  Some of  these may be  hedges and some most likely not.\n\nAMZN put orders seem very short term and possible hedges since the movement in the stock would have to be huge for a return on those weeklies. FEYE and GLD orders have more time and are closer to ATM so those are decent. For the longer term their was orders for WDC for strikes almost double the current price.\n\nDon't   just enter YOLO's in positions based on this data alone in most cases.   Use  technicals/fundamentals/options data/market feelings all combined   instead of just 1 of these.   Use protection like spreads if you worry   about losing what u put in and be  smart,  understand the  risks of   putting $ into weekly expiry's, consider a longer expiry. Learn IV AND  IV CRUSH!!\n\nAlso  with the market going lower use technicals/fundamentals/options  data-flow all combined.\n\nEDIT   - Wanted to add, I make these posts a lot with different tickers, when  I  am most confident I make a whole thread for one ticker. Like I did  in  the past with MSFT/AAPL/TSLA/DIS, I am saying this because I have   different levels of confidence the orders will work out. These orders   today are aggressive but not super super aggressive. So the confidence   level is lower than something extremely aggressive and unusual like SBUX   order flow.\n\nEDIT  - We are in uncertain times so these orders have less of an impact.  Technicals say there is more room to fall in the indexes so most  companies should follow.", "id": "fnrt2k", "created_utc": 1584997078.0, "score": 44, "upvote_ratio": 0.99, "num_comments": 25, "comments": [{"body": "I hope the $PTON guy is right", "score": 4, "replies": []}, {"body": "\nI’ve seen your posts in the past and enjoy these aggressive play posts. \n\nGlad to see the calls on Uber.  I have some as well with a higher strike 4/17 29c.  And not nearly the same level of investment you have...", "score": 9, "replies": [{"body": "ty", "score": 5, "replies": []}]}, {"body": "Following you, these are always worth a look. Plus, today's list also strokes my confirmation bias (holding some PTON $24p 4/17) which definitely feels nice.", "score": 3, "replies": []}, {"body": "does _AA = above the ask?", "score": 3, "replies": [{"body": "yes", "score": 3, "replies": []}]}, {"body": "If they exceed open interest wouldnt it likely indicate hedge positions being opened?", "score": 2, "replies": [{"body": "not normally, it would depend on how the order is placed to infer if it is a hedge or not. Usually a hedger won't sweep the exchanges to get filled on and above the ask that is 2 aggressive parts to that order. Then if it exceeds OI I see that normally indicate an opening position. Sometimes they are hedges, usually not for this type of order.  These exceeded OI in multiple sweeps. Usually I see single trades that exceed OI are more likely to be hedges, these exceeded it in multiple sweeps", "score": 3, "replies": [{"body": "Oh good point. Interesting stuff....lets see if some tards around here can explain more", "score": 2, "replies": []}]}]}, {"body": "Any YOLOs you have seen today?", "score": 2, "replies": [{"body": "nothing really interesting today, lots of T puts but that's all", "score": 3, "replies": []}]}, {"body": "$UBER calls...dafuq? Has to be hedging, no way eats and this new medical device delivery is going to keep them up.", "score": 1, "replies": [{"body": "I will say these are weeklies and weren't as aggressive, 2 orders is different from 20 orders for example", "score": 3, "replies": []}]}, {"body": "I watch a guy on YouTube who live streams his trading. The WDC calls OTM were all him and the people who copy his plays.", "score": 1, "replies": [{"body": "can u link who", "score": 1, "replies": [{"body": "Look up TradingFraternity on YouTube", "score": 2, "replies": []}]}]}, {"body": " [https://www.youtube.com/watch?v=WGFLPbpdMS8](https://www.youtube.com/watch?v=WGFLPbpdMS8)", "score": 1, "replies": []}, {"body": "Again on this one, PTON and AMZN.  I am wondering if these were sells to collect premium....", "score": 1, "replies": [{"body": "That is possible, PTON still has time left. For amzn maybe. I think I will exclude amzn for going foward as they are most likely more prone to hedges. Some tickers are like that such as QCOM which I don't ever look at anymore. This data isn't 100%. It works some and doesnt work other times.\n\nLike one time I posted these for FEYE calls and the next day they had buyout rumors and a shootup in prices for feye. Another time for FEYE I saw and posted here about calls the next day a major bank upgraded their price and it shot up again. Some tickers are better than others.", "score": 1, "replies": []}]}, {"body": "You think Amazon is going down...? Are you stupid", "score": -6, "replies": [{"body": "haha. Well I am just showing the orders, I don't think it, others do. It may be a hedge but for weeklies I am unsure who would hedge just for weeklies.", "score": 6, "replies": [{"body": "I hedge for weeklies during ERs.    \n    \nMay as well do it for the new volatility era.", "score": 1, "replies": []}]}, {"body": "I do.  I've lost 80% on my puts in the last week as its risen huge, but I still believe its going down.  I almost feel bad shorting it, since they're literally the last resort in this situation, but honestly my few hundred bucks doesn't mean crap to that company or anyone else.  Anywhoo, I think that bezos has done a great job at managing the stock price, the hiring 150,000 people was a smooth move.  Unfortunately I think there is just so much risk in it and they are one of the few stocks still near their highs.  I don't think it's completely ridiculous to feel that even they may succumb to the market eventually, if you quickly peruse their site almost everything is sold out that ships directly from  them, this is a double edged sword.", "score": 1, "replies": []}, {"body": "Citroen just put massive puts down on amazon", "score": 1, "replies": []}]}]}
{"title": "You wife's new boyfriend is the fed, and he is balls deep right now.", "selftext": "You don't think it's weird that not a single fucking news anchor has asked why businesses aren't expected to have emergency funds?  \n\nWhy would big business need an emergency fund, when the FED will simply take it from you.  And don't fucking think for a second that the trillions in emergency spending is coming from anyone but you.  Your $500 in gains from your $50 put bet is going to be worth nothing when this is all over, because the fed is chewing it up while slapping your wife's ass, whispering slowly in her ear, \"Your tendies are now my tendies, bitch\"\n\nHave you heard the code words present in every single financial interview?  It goes like this... \"we have to fund these businesses who are in dire need through **NO FAULT OF THEIR OWN**\".   \n\nI guarantee these same economists would tell any autistic cry baby whining about being IV crushed that \"you should have had a six month rainy day fund\", without pause or any sense of irony.  \n\nMake no mistake this is the biggest transfer or wealth in history and every single news source is completely in on it and feeding the narrative of how this emergency bailout, that isn't a bailout, is absolutely necessary in order for you to keep grandma alive for six more hours.  \n\n\nTL;DR : It doesn't matter what ticker I put here, either way the fed is eating your gains and giving it to their friends. \n\nTL;DR 2 : SPY 140c 12/22  (just to stay at break even after inflation)", "id": "fns60p", "created_utc": 1584998234.0, "score": 134, "upvote_ratio": 0.94, "num_comments": 24, "comments": [{"body": "Fed is blowing its load too early. They are just putting an off brand bandaid on a decapitated head.", "score": 57, "replies": [{"body": "They just want to get as much cash hoarding in as possible before the sense of emergency passes and their window of butt fucking opportunity is gone.", "score": 14, "replies": [{"body": "I’m holding my puts. This shit is not done.", "score": 6, "replies": []}]}, {"body": "Basically. This is a fiscal issue", "score": 2, "replies": []}, {"body": "I've heard this the last month... No more ammo left?", "score": 2, "replies": [{"body": "Yeah. Dropped rates to basically zero, and now doing unlimited QE. On top of all the stimulus shit. But the point is.... THIS IS A FUCKING VIRUS. no one can utilize this help because people are literally stuck inside their houses. And this stupid ass administration has given zero clarity on what they have been doing.", "score": 7, "replies": [{"body": "Pretty sure they’re gonna just sacrifice the boomers in the name of the economy. Messed up thing is boomers take social security so it will probably help the gov a lot", "score": 1, "replies": []}]}]}]}, {"body": "Lessons learned in 08: Don’t fight the fed\n\nLessons forgotten in 2020: Don’t fight the fed\n\nKeep buying puts at these levels, fellow autists. Can’t possibly go tits up.", "score": 28, "replies": [{"body": "So we’re not supposed to fight the fed. \n\nThat means we fight beer flu?", "score": 2, "replies": []}, {"body": "I’m selling puts to autists", "score": -3, "replies": []}]}, {"body": "Right in the feels. I hate my wife’s boyfriend even more now.", "score": 8, "replies": []}, {"body": "[https://www.youtube.com/watch?v=\\_fHfgU8oMSo](https://www.youtube.com/watch?v=_fHfgU8oMSo)\n\nWatch this and tell me you'll still listen to spoon fed information.", "score": 8, "replies": [{"body": "This is extremely dangerous to our democracy!", "score": 4, "replies": []}, {"body": "That's hilarious. But well known in the industry. Local news stations receive their stories from the parent company. What's even better is the parent company often just purchases these stories from some other company who's only business is to create and sell stories. Welcome to capitalism.", "score": 4, "replies": []}]}, {"body": "They’re not asking because their network is owned by one of those corporations.", "score": 3, "replies": []}, {"body": "Everybody already knows all that.  Will there ever be a day when their nonsense doesn't work anymore? \n\nMaybe they should just close all the markets and the Fed could publish imaginary prices once a day.", "score": 7, "replies": [{"body": "Fed’s imaginary prices are already priced in", "score": 1, "replies": []}]}, {"body": "lol you expect the largest businesses in the world to have enough savings for one month?", "score": 2, "replies": []}, {"body": "Oh yeah let's let the economy collapse for 300mm while a handful of degenerate gamblers get fabulously wealthy.\n\nSeriously though, you can't blame them for doing everything they can to stop the bleeding.", "score": -4, "replies": [{"body": "Everyone keeps saying this phrase, \"economy collapse\".  What the fuck does that even mean?", "score": 4, "replies": [{"body": "Small businesses can't get loans, pay employees, close doors. Large companies have big layoffs. Unemployment hits 30%. Retirement accounts are wiped. Everything is shit for next 6-10 years", "score": -2, "replies": [{"body": "Oh, I see.  We each get to make up what \"economic collapse\" means, and then argue about the possibility of it, while the fed pulls our wallet out of our back pocket.", "score": 13, "replies": [{"body": "Wait why do YOU think the fed is offering interest free lines of credit on any class of asset? What do you think their motive is- to fuck YOU personally? Get real", "score": -2, "replies": []}]}]}]}]}, {"body": "BAN", "score": -4, "replies": []}]}
{"title": "Russian perspective", "selftext": "Oil prices continued to be a drag on the Russian financial markets, as Brent crude shed another 4% to fall below $26 a barrel Monday afternoon. As countries go into lockdown, sapping global energy demand by as much as 10% according to Raiffeisen Bank, and Saudi Arabia ramps up its production, analysts at the Austrian bank expect the price to fall even further in the coming weeks.\n\nMoscow open, March 23:\n\n— With little signs of a recovery in oil prices, the ruble remained under pressure as the trading week got underway in Moscow. The currency stood at 80.8 against the U.S. dollar, 1.2% weaker than at the end of last week.\n\n— The Russian stock markets plunged at the open, with the RTS Index losing 5.5% and the MOEX Index down 4%.\n\n— Forecasts for the economic fallout of coronavirus continue to darken as more and more countries enter lockdown and the spread of the disease shows few signs of slowing. The CEBR, a British think tank, warned Sunday that GDP will fall twice as sharply as during the 2008 financial crisis, adding that the task of governments should be to prevent the coronavirus recession turning into a 1930s-style depression.", "id": "fnt0jl", "created_utc": 1585001071.0, "score": 21, "upvote_ratio": 0.84, "num_comments": 23, "comments": [{"body": "Not great, not terrible.", "score": 28, "replies": []}, {"body": "Russia is purposefully flooding oil supply to destroy US shale. Their balance sheet is strong, they can last 6+ years at these lows.", "score": 11, "replies": [{"body": "The question is how long can we?", "score": 3, "replies": [{"body": "They can't. Balance sheet is meaningless when the system survives on corruption, which makes the balance sheet inaccurate. This false sense of confidence in \"stability\" is one of the greatest risks.", "score": 3, "replies": [{"body": "Right, can the saudis survive at these prices? Sure. Russia? Nah", "score": 1, "replies": []}]}]}, {"body": "yeah but once this dumb virus goes away oil demand will increase and OPEC has a larger influence on supply pricing than russia does", "score": 1, "replies": []}]}, {"body": "Positions or ban", "score": 6, "replies": [{"body": "BA $3p 3/27", "score": 10, "replies": []}]}, {"body": "As long as the Russians have vodka, they're good.\n\nAlso, Putin is basically God in Russia.", "score": 6, "replies": []}, {"body": "Puts on Putin", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Puts on Russia = gulag", "score": 4, "replies": []}]}, {"body": "in russia the stocks trade you", "score": 4, "replies": []}, {"body": "Yada yada yada... Post ticker and exp dates", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "Russia is crazy cheap for me now.", "score": 2, "replies": [{"body": "I bought ERUS NILSY OGZPY today long Putin heterobull", "score": 2, "replies": []}, {"body": "You are from Russia? Or visiting there or living there as an expat?", "score": 1, "replies": [{"body": "I'm half Russian, gonna move there after I have a certain amount of money to live like a king", "score": 1, "replies": [{"body": "Really autistic decision if you are currently live in the first world coubtry", "score": 1, "replies": [{"body": "I know what it's like", "score": 1, "replies": []}]}]}]}]}, {"body": "Positions or ban", "score": 2, "replies": []}, {"body": "Comrades! It’s time we band together and take what rightfully belongs to the working class! Who’s with me!?", "score": 1, "replies": []}]}
{"title": "Death to the VIX", "selftext": "[deleted]", "id": "fntg21", "created_utc": 1585002567.0, "score": 22, "upvote_ratio": 0.78, "num_comments": 27, "comments": [{"body": "VXX puts", "score": 33, "replies": [{"body": "If we can be even close to green at open tomorrow, these VXX puts gonna print like a motherfucker", "score": 8, "replies": []}, {"body": "Remember the guys post yesterday I think? The avg of vix is 45-50.", "score": 5, "replies": []}]}, {"body": "So for those of us with longer dated options (late april-early may) and not playing weekly... how does this translate.", "score": 14, "replies": [{"body": "Fucked", "score": 8, "replies": [{"body": "Double down then. Got it.", "score": 20, "replies": [{"body": "Absolutely double down on long puts. The average idiot has moved his 401k into something more durable but most of the douches with 401ks are actually literally fucking retarded and are still holding on. There *has* to be another volatility spike/ bear run before we go back to business as usual.", "score": 3, "replies": [{"body": "I've turned 1500 into 10k. Kept 5 in reserve because idk when im going back to work. I'll let em ride, j don't have anything of major value expiring until end of april.", "score": 2, "replies": []}]}]}]}]}, {"body": "Yea, I'd like to be able to buy cheaper puts soon plz before all the economic data starts coming in.", "score": 9, "replies": [{"body": "IVs usually hike up in the lead up and immediately drop after results are out (whether good or bad).", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "It is an eye of the storm you retard.", "score": 5, "replies": []}, {"body": "its good for everybody in long run, the volatility was really fucking up massive gains", "score": 6, "replies": []}, {"body": "VXX puts not unfortunate", "score": 3, "replies": []}, {"body": "Am I having a severe stroke or do I not detect a strike and expiration???", "score": 6, "replies": [{"body": "Stroke for sure", "score": 4, "replies": []}]}, {"body": "Can we shut the fuck up about VIX? None of you fuckers know.\n\nEdit: SPY 170p 05/01", "score": 3, "replies": [{"body": "I’m balls deep with you 185p 05/01", "score": 2, "replies": [{"body": "You think 185p 04/20 too premature? May reset on next sideways day like today, was thinking sell at the 218 low today and roll out to may.", "score": 2, "replies": [{"body": "Rolling it out a bit would be best in my opinion.", "score": 4, "replies": [{"body": "Alright thanks, hopefully we get another 215-218 point in the next few days.", "score": 1, "replies": [{"body": "Remember 💎🖐🤚", "score": 2, "replies": [{"body": "Yeeep, bought more, up to 45 contracts. 💎🙌", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "B", "score": 1, "replies": []}, {"body": "4/17c $75 wya?", "score": 1, "replies": []}, {"body": "[vix gang](https://imgur.com/gallery/X9LbiQI)", "score": 1, "replies": []}, {"body": "Bought 3k worth of VXX puts when it was $74, the fryers are working over time rn", "score": 0, "replies": []}]}
