{"title": "looking for a very long term stock", "selftext": "[deleted]", "id": "6zz8bi", "created_utc": 1505353676.0, "score": 57, "upvote_ratio": 0.91, "num_comments": 109, "comments": [{"body": "BRK.B. Set it and forget it.", "score": 59, "replies": [{"body": "Charles Munger and Warren Buffett are 93 and 87 years old respectively. To be completely honest, I would wait for a death dip and buy it.", "score": 0, "replies": [{"body": "Those guys are never going to die.", "score": 10, "replies": [{"body": "Heroes never die.", "score": 11, "replies": [{"body": "Heroes get remembered.  Legends never die.", "score": 2, "replies": [{"body": "I was quoting Overwatch. \n\nhttps://www.youtube.com/watch?v=zcj3XmD8YaM", "score": 2, "replies": []}]}]}]}, {"body": "im wondering how the company will run with the two gone so im not sure id buy in.", "score": 2, "replies": [{"body": "Its success relies on far more than just two people and the companies it already owns are valuable in their own right.", "score": 2, "replies": [{"body": "oh yeah i can see that however id be worried if the company decided to change up its strategy once they were gone", "score": 0, "replies": []}]}]}, {"body": "death dip lmao", "score": 1, "replies": []}]}, {"body": "And if you don't have a quarter million dollars to throw away?", "score": -22, "replies": [{"body": "BRK.B is trading at like $179. You're thinking of BRK.A, which is at $268,000.", "score": 34, "replies": [{"body": "Don't I look like a fool", "score": 66, "replies": [{"body": "Eh, it happens. Wasn't like you were way off base.", "score": 5, "replies": []}]}]}]}]}, {"body": "Visa. Shits never going away.", "score": 37, "replies": [{"body": "Bought right before earnings and am up 11%. Only regret is only purchasing 11 shares lol", "score": 5, "replies": []}, {"body": "What are your thoughts on Mastercard", "score": 3, "replies": [{"body": "It is not necessarily a bad option, but if you are investing in the credit card realm VISA wins out and you might as well go VISA. Steady, steady, growth. 323M cardholders vs Mastercards 191M. \n\nI guess if you wanted to avoid the all eggs in one basket you could split it, but heck if the sector fails or gets hit VISA will probably be the one standing strongest. ", "score": 2, "replies": []}]}, {"body": "What about the blockchain? Why can't it provide the same infrastructure Visa has?", "score": -8, "replies": [{"body": "They have Visa cards where you can use crypto currency.", "score": 1, "replies": [{"body": "Crypto is set for a big fall.", "score": 6, "replies": [{"body": "Why's that?", "score": 1, "replies": [{"body": "http://kdal610.com/news/articles/2017/sep/14/bitcoin-exchange-btcchina-says-to-stop-trading-sparking-further-slide/ \n\nthis for starters", "score": 2, "replies": [{"body": "ðŸ™„", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "$VOO", "score": 36, "replies": [{"body": "Serious question, and one that I have whenever I look at ETFs in this price range: What's the point in investing $1000 in an ETF that costs nearly $250? That's only four shares. The average quarterly dividend looks to be a little less than a dollar. Say $16/year in dividends reinvested is 0.07 shares per year. That's... not a lot.\n\nIs that really worth it, especially since this bull market will eventually stop at some point in the next twenty years? I assume he won't be actively managing it. Why not buy a savings bond or some other type of fixed income and guarantee the investment has appreciated some when the kid is age 18?\n\nAnd if you're going to take the risk, why not just buy an index fund that's cheaper per share?", "score": 2, "replies": [{"body": "The cost of the ETF doesn't matter. Also, you should look at dividends as being % based, sure 1.6% isn't great, but it's about in the middle of value vs growth.\n\nAlso, VOO has an expense ratio of .04, index funds won't be cheaper (and if they are, they probably have an initial investment of well over $1000)\n\nI think for a set it and forget it situation, VOO is about as good as it gets. You're not gonna have 20k in 20 years, but you should get some decent returns and at least double your investment. ", "score": 1, "replies": []}]}, {"body": "Only correct answer", "score": -15, "replies": [{"body": "thats not a stock. incorrect. ", "score": 16, "replies": [{"body": "Etf. Close enough", "score": 4, "replies": []}, {"body": "What is it if its not a stock ", "score": -4, "replies": [{"body": "An exchange traded fund. ", "score": 2, "replies": []}, {"body": "ETF, there are fees that go along with ETFs, something to consider.", "score": -1, "replies": []}]}]}]}]}, {"body": "BAC - Bank of America is around $25 a share and just got a $5 Billion buy from Buffett.  Expect good things in the future.  We all already know a large bank like BAC isn't going anywhere.", "score": 9, "replies": [{"body": "While it's unlikely, [never say never.](https://en.wikipedia.org/wiki/List_of_largest_U.S._bank_failures)", "score": 1, "replies": [{"body": "BAC has what I'll call \"plot armor\" because there is a 0.0000000% chance Trump will allow BANK OF AMERICA to fail", "score": 1, "replies": []}]}]}, {"body": "SPY, UPRO, QQQ, VOO, or VTI. ", "score": 9, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "With TD Ameritrade I don't think there is a drip fee.", "score": 0, "replies": [{"body": "I've never heard of a fee to reinvest divs", "score": 4, "replies": []}]}]}, {"body": "BRK.B or some solid ETF. I'm in EEM and feel comfortable with it", "score": 8, "replies": []}, {"body": "Visa", "score": 5, "replies": [{"body": "I dunno. The blockchain could easy disrupt Visa.", "score": -5, "replies": [{"body": "\"Easy\" is a massive overstatement.", "score": 8, "replies": []}]}]}, {"body": "Nep with drip", "score": 3, "replies": []}, {"body": "Quantum computers without any hesitation. ATOS & IBM.", "score": 3, "replies": [{"body": "Just looked up ATOS. Very good financials with room to move. Thank you I will buy some this morning.", "score": 2, "replies": [{"body": "I don't know much about pharma, but ATOS looks like a dumpster fire to me. Am I missing something appealing about it?", "score": 1, "replies": [{"body": "ATOS SE", "score": 1, "replies": [{"body": "Ah ha, that makes much more sense. Cheers", "score": 1, "replies": []}]}]}]}]}, {"body": "How about GE?\n\nIt's the only stock continuously part of the Dow 30 from when the Dow index was expanded to 30 stocks in 1928.\n\nThat's a pretty decent indicator of the relevance of the company to the US economy over the years.", "score": 3, "replies": [{"body": "GE is in a major downtrend.  This whole year, anytime I thought the downtrend was going to break, it just kept going down.  I'll still be waiting for that breakout before buying.", "score": 1, "replies": [{"body": "I think the stock sucks from a current return standpoint. And as a former GE employee I own more of it than I'd like to. But the original post was about a long term hold so that is why I replied as I did. ", "score": 2, "replies": []}]}]}, {"body": "Surprised nobody has stated the obvious yet - I would throw it into a Vanguard Total Market or S&P 500 Index Fund. ", "score": 3, "replies": []}, {"body": "Apple or baba", "score": 9, "replies": []}, {"body": "I'd stay away from green energy, vertical farms, GMO. These are not long-term stocks because many of them are not viable. A long-term stock is something that is viable right now, otherwise you're just guessing.\n\nLook at what Warren Buffet is investing. He embraces old businesses that have been around and are not going anywhere. These are the type of agricultural businesses, for example, that buy vertical farm companies and GMO companies. Or old energy companies that buy green energy companies -- the type who are stable and not all bluster.\n\nThink about transportation and construction: someone needs to make the parts. Someone needs to make the parts that make the parts.\n\nAfter 2008, I invested in rail stock because I noticed it was actually stable. It then skyrocketed and remains very high today. This was partly because of energy prices but also a resurgence on the convenience and cheapness of rail to move goods. No one was telling anyone to invest in rail in 2008 -- and still not much today. I still think it's the best type of stock. After all, we're not importing the wagons. We make them here. High speed rail doesn't count.", "score": 5, "replies": [{"body": "No indication the subsidies are about to get pulled out, but most of these companies couldn't survive without them. Not what I would call a safe bet at all.", "score": 1, "replies": [{"body": "Yeah, the green industries are very risky.", "score": 1, "replies": []}]}]}, {"body": "AGRO\n\nThey own farmland in South America and a number of ethanol plants. With the world population growing to 9 billion by 2050 and the quantity of arable land necessarily limited, ownership of the lowest cost, highest productivity agricultural land is a great long-term investment. Plus their ethanol assets should benefit from a long-term trend of moving towards renewable fuels (biofuels included).", "score": 2, "replies": []}, {"body": "Are you wanting a gamble or a long term stock? I am currently gambling on $EDIT and $CRSP these are biotechs working on gene editing. However they very easily could be worth zero in a few years. ", "score": 2, "replies": [{"body": "I've been thinking a lot about these lately, just haven't been able to pull the trigger... The whole gene editing scene is still so uncertain especially on the regulatory side.\n\nI applaud you for the risk taking, hope you reap great rewards from the great risks. ðŸ‘ðŸ¼", "score": 2, "replies": []}]}, {"body": "JNJ - had it for decades always solid performance.", "score": 2, "replies": []}, {"body": "ADBE", "score": 2, "replies": [{"body": "Seems too good to be true its recent growth. Any reasons its not going to slow or fall? It can't keep up that level of growth ", "score": 1, "replies": []}]}, {"body": "CWEB. Its a 2x leveraged ETF and its growth potential is magnificent.\n\nTop 4 holdings: \nBABA\nBaidu\nTencent\nJD\n\nVery great growth potential for a long while. It has almost tripled in value since a year ago.\nIts riskier for sure but for high growth that is to be expected. I see those top four holdings being strong contenders even a decade later too.", "score": 2, "replies": []}, {"body": "BA is perfect for \"long term\" purposes.", "score": 2, "replies": []}, {"body": "Google!", "score": 2, "replies": []}, {"body": "Once the tech is available, go for the space mining company.", "score": 2, "replies": [{"body": "SpaceX?", "score": 1, "replies": []}]}, {"body": "AMZN or DIS because they will own everything in the future. ", "score": 3, "replies": [{"body": "How in any sense will Disney own everything?", "score": 11, "replies": [{"body": "Disney owns media, a large chunk of media. They are also the owners of every girls heart. I would say they have at least a good start to owning everything. ", "score": 4, "replies": [{"body": "Tell that to the stock.  -Bagholder since 2015.", "score": 2, "replies": []}]}]}, {"body": "Disney Planet is just a TV channel right now. In the future, it will be an actual planet, and Disney will own it. ", "score": 8, "replies": [{"body": "They will have their news there and all of the sports will be played. \n \nEdit: Can't spell ", "score": 1, "replies": []}]}, {"body": "Scary but I tend to agree. Regulators seem fine with multi-billion dollar companies buying others as long as it's all in different sectors.", "score": 2, "replies": []}]}, {"body": "I will never sell my DIS.", "score": 3, "replies": []}, {"body": "BLDP - they are a sleeper and just starting to rumble. Will be a major player in fuel cell tech", "score": 4, "replies": [{"body": "I just read an article that they are now able to manufacture fuel cells with almost no platinum. I usually don't buy penny stocks but, they look like they actually have a future. Have to look into them more. ", "score": 1, "replies": []}]}, {"body": "DLR. they own data centers.", "score": 2, "replies": [{"body": "Not that I'm Warren Buffet or anything, but my fear with DLR is that massive data centers will not be necessary in the future. Chips are being made that are much smaller and use less silicon, which may lead to DLR being irrelevant 10 years down the road. ", "score": 3, "replies": [{"body": "That's a good point but data centers are not just cold storage. They are active and there's a ratio of storage to cooling/space required. That ratio changes but so does the amount of data/bandwidth needed. ", "score": 1, "replies": []}]}]}, {"body": "BZUN ", "score": 2, "replies": [{"body": "China to da moon.\n\n>I'm okay with taking a big gamble\n\n$BZUN\n\n$BABA\n\n$CQQQ or\n\n\n$KWEB ($CWEB - double leverage)\n", "score": 2, "replies": []}]}, {"body": "$ATVI ", "score": 2, "replies": []}, {"body": "Being a Canadian Investor, I would personally buy some shares of $BAM.A or even $TD if I was looking at individual companies. Like others have said, however, the best answer is probably just grabbing some low cost index tracking etfs ($VOO or what have you).", "score": 1, "replies": []}, {"body": "$HTM with current 30 year PPAs in place, they will be afloat for some time now. If they can ever execute on new PPA's, liftoff.\n\nWhy not just 3 shares of $TSLA though? Price per share makes no difference. A 10% change is a 10% change regardless of whether you have 3 shares of Tesla or 30 shares of Intel.\n\n$NOK with DRIP otherwise. They are one of a handful of telecomm equipment vendors, and once 5G adoption picks up, they will be sitting pretty.\n\n", "score": 1, "replies": []}, {"body": "SQ on the next dip", "score": 1, "replies": [{"body": "SQ to the moon!", "score": 1, "replies": []}]}, {"body": "I would do a smallcap value etf.", "score": 1, "replies": []}, {"body": "Disney. Perfect for a kid, reliable company and is at a decent entry point right now. ", "score": 1, "replies": []}, {"body": "Go for a drone company ", "score": 1, "replies": []}, {"body": "For *true* set-and-forget, I'd say it really only makes sense to go with some total-market ETF.\n\nI mean, Tesla might seem interesting, but 18 years from now who the fuck knows where they'll be?\n\nHeck, even Visa, which I'd agree is a great company that's not going away any time soon, who knows what disruption fintech will sow?\n\nSame even with Berkshire. If Buffet eventually passes away, is there a guarantee BRK will continue as well as it did in the past?\n\nGreen energy... too much uncertainty about who'll be the big player.\n\nThese are all not bad considerations for long term stocks of someone who will still keep an active eye on things just in case entire market realities change.\n\nFor set and forget, the problem is that *any* company, no matter how large, might eventually fall on hard times.\n\nI'd say a US total stock market ETF would be much safer while still having potential for amazing gains. Why? Because the US economy will keep growing. You guys (I'm not from the US) just capitalism and consumerism too much for it not to. The only way US stocks fail is if somehow US consumers go on strike and say: \"You know what, our phones, computers, cars, homes, all that? They're good enough now. Nobody is gonna invent better ones now. And nobody is gonna invent new products that we might want to buy. This is it, the best we can do and ever will\".", "score": 1, "replies": []}, {"body": "Why not use a mutual fund? Would be the easiest way to protect an investment you're not watching.", "score": 1, "replies": []}, {"body": "Lol tan. Solar is a dumpsterfire and can't compete with china since the Chinese r pumping huge amounts into their companies. Just look at that 5 year and that's in a bull market. U better off buying jnj or high growth like shop", "score": 1, "replies": []}, {"body": "TSLA.  \n\nThe Model 3 is going to make it the iPhone of automobiles.  The waiting list already north of 500,000 and growing at last count by 1800 a day.\n\nBuy the stock now, get on the waiting list, and by the time they can deliver the car it will be free.  Possibly by then, you might want a Model S instead - it will be free too.", "score": 1, "replies": []}, {"body": "United Parcel Service $UPS", "score": 1, "replies": []}, {"body": "V, GXF, CWEB, PYPL, CIBR, EDIT, LRCX", "score": 1, "replies": []}, {"body": "Buy him a few shares of Apple.... Literally not going anywhere. Won't stop growing, will be a trillion dollar company soon. ", "score": 1, "replies": []}, {"body": "TSLA", "score": 2, "replies": []}, {"body": "baba, you can choose to hold baba until Jack Ma retires.", "score": 1, "replies": []}, {"body": "I second TAN, with the addition of FAN.", "score": 1, "replies": []}, {"body": "$TSLA", "score": 1, "replies": []}, {"body": "I think your goals are a little bit at odds with each other.\n\nImagine this kid turns 18 or graduates college or whatever, and you say to him or her \"Sorry, I tried investing in your name and blew it on a green energy stock that shit the bed in the Great Recession of 2025.\" What is s/he supposed to do with that information? What does that accomplish?\n\nIf the goal is to provide your nephew or niece with something they can actually use, either to help pay for college or make a down payment on their first house or whatever it is they might do, then you should just park some money in something that's safe, like a total market ETF. Gamble with your own portfolio, not with someone else's.", "score": 1, "replies": []}, {"body": "We are at the start of a Republican presidency, military contractors will be solid bets $BA, $RTN ect. ", "score": 0, "replies": [{"body": "Already priced in", "score": 3, "replies": []}]}, {"body": "solar stocks", "score": 0, "replies": []}, {"body": "Secure bonds. Forget the stocks for baby shamis", "score": -1, "replies": []}]}
{"title": "I need AMD buyout today or tomorrow please.", "selftext": "", "id": "70276w", "created_utc": 1505395551.0, "score": 424, "upvote_ratio": 0.97, "num_comments": 143, "comments": [{"body": "im not one to laugh at someones misfortunes but.. lol", "score": 187, "replies": [{"body": "this was some expensive ass reddit karma", "score": 137, "replies": [{"body": "Lol.", "score": 18, "replies": []}, {"body": "Just a little over 200 of em!", "score": 5, "replies": []}]}]}, {"body": "Your mod application has been accepted.", "score": 154, "replies": []}, {"body": "AMD17??? LOLLLOLLOLLOLLLLOOOLLL\n\nI am bag holding at $7k at $14 but jesus, you drank the koolaid with that one. 17... fucking 17.... \n\n", "score": 130, "replies": [{"body": "Its 2017, only makes sense to buy AMD17", "score": 199, "replies": [{"body": "fair point. you're an alright guy.", "score": 96, "replies": [{"body": "WSB: where you can do something retarded but be forgiven by memeing about it. ", "score": 36, "replies": [{"body": "We've all made some retarded decisions", "score": 6, "replies": []}]}]}, {"body": "This DD checks out. Pack it up boys. ", "score": 18, "replies": [{"body": "bake em away toys!", "score": 5, "replies": []}]}]}, {"body": "I had $17 calls back for those nasty 4/20 earnings. It was almost at $15 when I bought those calls though.. lmao", "score": 6, "replies": []}, {"body": "yeah i buy it when it hits 11.XX and sell it at 12.9X or higher\n", "score": 1, "replies": []}]}, {"body": "\"4k on black\"\n\n\"Sir this is blackjack\"\n\n\"Did i stutter?\"", "score": 91, "replies": [{"body": "I too like to live DANGEROUSLY. ðŸ˜", "score": 16, "replies": []}]}, {"body": "Please , stop trading. You have no idea what you are doing. ", "score": 371, "replies": [{"body": "No! Trade harder!", "score": 118, "replies": [{"body": "[deleted]", "score": 45, "replies": [{"body": "NAKED CALLS , BAKED CALLS, RAKED CALLS. ALL THE CALLSSSS", "score": 11, "replies": [{"body": "> BAKED CALLS\n\n", "score": 7, "replies": []}]}]}]}, {"body": ":'(", "score": 66, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "Bought $17 shortly after AMD spike after 2Q earnings. And I bought the others to average down while AMD just got shit on", "score": 49, "replies": [{"body": "[deleted]", "score": 112, "replies": [{"body": "Serious question- what to you constitutes a runup?  Was it ran up at 6?  I get what you're saying and personally agree but struggle with that - most of my best trades have been buying high and selling higher ", "score": 12, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Fair enough, that makes sense- obviously its up to personal risk tolerance but 10% feels right- especially for meme stocks like amd or shop.  Need to be more disciplined this earnings season about jumping into companies that beat ", "score": 2, "replies": []}]}, {"body": "dont forget he brought options.  he cant just hold and wait. ", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 12, "replies": [{"body": "No wonder you have so much anger towards AMD I've been in margin from assigned puts on AMD for awhile. The reversal just started.", "score": 3, "replies": [{"body": "> reversal\n\nLooks sideways to me.", "score": 1, "replies": []}]}, {"body": "No wonder you have so much anger towards AMD I've been in margin from assigned puts on AMD for awhile. The reversal just started.", "score": 1, "replies": []}]}, {"body": "I would've been even afraid to go $15 :/ Sucks mate, but you got the right spirit. Keep it up! ", "score": 4, "replies": []}, {"body": "Yeah, that's not good. Earnings run ups are temporary a lot of the time. What happens is the investors who were already in before earnings take profit during the run up, while at the same time, other investors open short positions. These two things lead to a price decline. Everybody makes money off this except the people who buy in reaction to the news.\n\nNow you know better. Go to YouTube and watch some videos about \"IV crush\" with regard to options.", "score": 1, "replies": []}]}]}]}]}, {"body": "I can understand yoloing on 14 calls, but the rest are 2000 bucks wasted. Guess you made some writer rich", "score": 77, "replies": [{"body": "how do we initiate takebacks?", "score": 55, "replies": [{"body": "Just show them your receipt ", "score": 38, "replies": [{"body": "Only works on Robin Hood", "score": 21, "replies": []}]}]}, {"body": "I personally mailed him a thank you", "score": 4, "replies": []}]}, {"body": "Jesus dude. I'm usually a supportive guy, but you're a complete and utter moron. ", "score": 77, "replies": [{"body": "please send help", "score": 65, "replies": [{"body": "[I am a huge Twin Peaks fan.](https://lh5.googleusercontent.com/h2f2_LVKKoMZp5e2p79jvZrVFzImVrISC5Tn65e97EtlDVYennhtHT2BchH22gLXUbV-e_ILXmkWo0m7IEgrKbNTSLhjxmBNSumK22j8J5vG2dyLFFV7lX9VRRGBEdKh5F6z7n2Z)", "score": 3, "replies": []}]}]}, {"body": "The odds is not zero.\n\nGod speed", "score": 46, "replies": [{"body": "[So you're telling there is a chance?](https://media.giphy.com/media/ToMjGpKniGqRNLGBrhu/giphy.gif)", "score": 18, "replies": [{"body": "Appropriate", "score": 2, "replies": []}]}]}, {"body": "Is this how you get a WSB flair? Am I doing it right?", "score": 48, "replies": []}, {"body": "[Thanks bro](https://imgur.com/a/XmYfQ)", "score": 41, "replies": [{"body": "Hello I would like to return my options, they are defective. ", "score": 63, "replies": []}]}, {"body": "Oh no what is you doin bb??", "score": 30, "replies": []}, {"body": "If your wife saw that screen do you think she'd stop loving you?", "score": 25, "replies": [{"body": "[removed]", "score": 13, "replies": [{"body": "Way to be a one upper.  Now show yours", "score": 10, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Pussy", "score": 42, "replies": []}]}]}, {"body": "Yeah right? I've lost 6.5k and currently holding 2k calls, plus 600 shares at $12.5. \n\nNext worst is Google at -3.6k\n\nNokia: -2k\n\nQQQ: -1.7k\n\nAugust was rough.\n\n", "score": 2, "replies": []}]}, {"body": "->implying OP isn't an unlovable gargoyle faced troll", "score": 6, "replies": []}, {"body": "its only several g's, nothing to divorce over", "score": 4, "replies": []}]}, {"body": "You fool", "score": 16, "replies": []}, {"body": "what the fuck bro", "score": 15, "replies": []}, {"body": "Try and ask for a  refund", "score": 14, "replies": [{"body": "I see you've been on /r/RobinHood ", "score": 6, "replies": []}]}, {"body": "When did you buy these? ", "score": 11, "replies": [{"body": "I bought these shortly after the AMD spike after 2Q earnings, mistakes were made", "score": 22, "replies": [{"body": "Yikes. Sorry for your loss rip", "score": 2, "replies": []}, {"body": "TARD", "score": 7, "replies": []}]}]}, {"body": "So this is where all that free efx money is coming from", "score": 8, "replies": []}, {"body": "I have December 13 and 14 calls. My first options play ever. Please tell me this isn't my future.", "score": 8, "replies": [{"body": "Well 13 and 14 is not 14 to 17. Not a bad move actually", "score": 13, "replies": [{"body": "If I actually manage to make money on my first option play, I'll be pleasantly surprised.\n\nActually, I think that's called faggot's delight.", "score": 15, "replies": [{"body": "If you manage to make money on your first options your bloated ego will make you swiftly burn all your cash in insane trades", "score": 19, "replies": [{"body": "That's why I'm here!", "score": 14, "replies": []}, {"body": "Word.", "score": 2, "replies": []}, {"body": "Can confirm.", "score": 1, "replies": []}]}, {"body": "I'd sell the 13 at the first decent profit and keep the 14 to yolo, but what do I know, we're all dumb faggots here", "score": 4, "replies": []}, {"body": "A faggots delight is a weekly earnings play. You're actually doing it semi right ? Congrats. AMD been trading cyclically and consistently. What did you pay for those contracts? What was the underlying price? I'd sell as soon as you're in the green a little bit. ", "score": 2, "replies": [{"body": "Ok, so I paid 0.91â‚¬ ($1.08) for the 13 calls and 0.60â‚¬ ($0.71) for the 14 calls. Both were up like 5 percent yesterday. $AMD was trading @ $12.20. But I'm quite sure I actually bought options on the European AMD traded in Boerse, which is now trading @ 10.30ish (â‚¬) Which turns my 14â‚¬ call into a $16.66 call expiring in December. So pretty worthless, right? I mean, if AMD were to rise to 13-14 next week, would I make money from selling the calls with a higher premium? \n\nAlso, if you could explain IV and it's importance to me, I'd appreciate it. I know that IV of some AMD 14 November options in 50ish, but I have no idea what it means or what I should do with that information. ", "score": 2, "replies": [{"body": "Damn dude better find out for sure where you bought those options from... being far out of the money is very very high risk.  \n\nIV tells you the expected probability and magnitude of a price swing of an option's underlying stock in the next year. Let's apply to AMD - 50% IV at a price of $12 (to make things easy) means there is a 68% chance that in the next year, AMD will trade between $6 to $18 a share (the 68% comes from the definition of one standard deviation, read links below for more info). This will help you in deciding what strike and expiry you may want to take a position in. IV is also a component in the formula to price an option's premium. You can think of it this way, a high IV means the premium is \"relatively expensive\". This is due to the uncertainty aspect (risk) of where the prices may end up in the future. It's also very important to be aware of what IV crush is. More below. \n\nDecent rundown here:\nhttps://www.tastytrade.com/tt/learn/implied-volatility\n\nMore technical explanation:\nhttps://www.ally.com/investing/options/what-is-implied-volatility/\n\nIV Crush: \nhttp://www.schaeffersresearch.com/education/volatility-basics/volatility-and-options/volatility-crush\nhttp://tastytradenetwork.squarespace.com/tt/blog/implied-volatility-crush", "score": 2, "replies": [{"body": "Alright, thank you so much. So if I wanted to YOLO on the Q3 ER, should I buy In or Near the money options? Like, if I were to buy US options, let's say $13 and $14 calls expiring in January? I'd obviously sell the options instead of exercising them.", "score": 1, "replies": [{"body": "Yeah basically... you got the idea. ITM and near ITM somewhat limits both your possible upside and downside vs. far OTM. You could also have a spread - 20% of contracts OTM, 40% near ITM, 60% ITM for example. In general you want to trade near ITM anyway or ITM, where the volume is greatest. (You may have difficulty selling far OTM options, they are less liquid and have a larger bid-ask spread).\n\nDamn this feels like telling kids to get hooked on shooting up heroin.", "score": 2, "replies": [{"body": "Well, I have some money I'm willing to either double or lose lol. ", "score": 1, "replies": [{"body": "Weeklies are like roulette. Only spin the wheel with money you're willing to lose anyway. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Nah, FD's are when you buy weeklies and inevitably get crushed by volatility and/or premiums. Buying a month or two out aren't considered FD's. ", "score": 1, "replies": []}]}]}, {"body": "your play is much much better than this lmao. $14 EOY is more realistic than this mess..", "score": 4, "replies": [{"body": "Thanks, but I'm afraid I'm still a huge retard.\n\nSee, I'm a Eurofag, so I might have accidentally bought EUROPEAN OPTIONS. So, it's not $14, it's actually ($14*1.19) = $16.66! Not so realistic anymore, lol. Might sell tomorrow at open for a small gain though :)", "score": 5, "replies": []}]}, {"body": "What was the premium? / what's your break-even?", "score": 1, "replies": [{"body": "0.91 for the 13 call, 0.60 for the 14 call (in euros though). How do I calculate my break-even lmao?", "score": 2, "replies": [{"body": "First, very important advice: you should absolute make sure you know these things before you buy these contracts. If you don't know your break-even, you can't really be sure if you are making a good decision or a bad one, even if you think you know a stock's future movement. \n\nBreakeven is the price where you'd be profitable on the option directly, without adding in time value. \n\nYou combine your option premium (Going to use dollars to normalize against strike price) $91 for 13 strike with your comission, let's say $20 to be cautious. That's $111 dollars, or $1.11 per share. \n\nSo, that 13 strike would need to hit 14.11 (and increase of $1.11)  to \"break even\" - and every penny above that is in the black. \n\nA reason why this is important is, say, you think AMD reliably fluctuates between 12 and 14 (as a lot of people on this subreddit do). \n\nYou'd buy your 13 strike, thinking \"hey, I'm going to make some bank when it hits 14\", but some quick math shows you that if it only hits 14, but never any higher, you won't intrinsically be able to profit off this options play without a ton of time value (which, again, you'd have to pay for). ", "score": 8, "replies": [{"body": "Oh shit\n\nI just used this to calculate profits:http://www.optionsprofitcalculator.com/calculator/long-call.html and thought I'd make a cool 126% profit if $AMD hits 15 after ER. The fuck should I do now? Am I not going to make money with this?", "score": 5, "replies": [{"body": "Holy fuck these are European options. So of course the underlying asset is the $AMD traded in fucking Frankfurt, and it's currently @ 10.36â‚¬ - So, my \"14â‚¬ call\" is actually a $16.50 call, if the AMD share price in Frankfurt correlates with the SP in US.  And the option expires in December. \n\nProbs gonna sell, haven't lost any money yet. Sucks to be a eurofag though.", "score": 7, "replies": [{"body": "It gets worse. You just reminded me - pretty sure Euro options can ONLY be exercised on the expiry date (rather than at any time prior all the way up to, like American options can). \n\nI'm not 100% sure on that, but I would definitely check were I you.\n", "score": 3, "replies": [{"body": "But why would I exercise my options, when I could just sell the premium? Both 13 and 14 December 13 calls are actually up 5% today, and if we're green tomorrow, I think I'll be able to sell both for a â‰ˆ10% gain?", "score": 1, "replies": [{"body": "selling shorter-term premium on longer calls is essentially best when you have a really good idea of what you think the growth is (ideally, you'd like to sell the premium with an upwards trend but have it still expire worthless each week, while still able to either exercise your position to close or sell it at a deep ITM premium). \n\nAre you that confident you can predict AMD's momentum?", "score": 1, "replies": []}]}, {"body": "Alright, just checked it, you're right. Europeans options are weird. But I'm still gonna make money selling the premium, right?", "score": 1, "replies": [{"body": "please post an update", "score": 1, "replies": [{"body": "UPDATE: My calls are up 50%", "score": 2, "replies": [{"body": "good stuff", "score": 2, "replies": [{"body": "thank", "score": 1, "replies": []}]}]}, {"body": "I will. I might get fucked tomorrow, though. Of course this stock had to close below 12.30.. ", "score": 1, "replies": []}]}, {"body": "You may seriously want to check into the structural limitations and rules around what you are attempting. I'm not familiar enough with euro-style options to comment; I just remember from a prior experience about the significant difference in excercise rules.", "score": 1, "replies": []}]}, {"body": "What the fuck. How the hell do you play Euro options then? That's insane. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I hear ya bud, good luck.", "score": 8, "replies": []}, {"body": "The thing that'll suck for you, is the pop that will happen right after these expire.... You could buy some with October or November expy to cover your losses ;)", "score": 7, "replies": []}, {"body": "Hope you didn't need that money.", "score": 6, "replies": [{"body": "who needs money anyways? xD Happy reddit bday!", "score": 6, "replies": [{"body": "Thanks Saga!  ", "score": 2, "replies": []}]}]}, {"body": "Dude.", "score": 6, "replies": []}, {"body": "I'm on the same boat, along with NTNX calls :/ ", "score": 5, "replies": [{"body": "you definitely won't have a boat for long with those loses.", "score": 7, "replies": []}]}, {"body": "OMFG... :( I feel you. I got a $13.50.", "score": 3, "replies": []}, {"body": "Isn't $0.50 expensive af for 17C weeklies?\n\nEdit: How/why the hell did you pay more for the 17C than 16C?", "score": 3, "replies": [{"body": "I bought these at different times, was averaging down as AMD went into the dirt.", "score": 3, "replies": [{"body": "You don't average down on calls since they have an expiry, that's a long term securities strategy.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "LEAPs are pretty long term though.", "score": 1, "replies": []}]}]}]}]}, {"body": "This isnt how you make daddy proud.", "score": 3, "replies": []}, {"body": "hooooooly shit muthafukka!!!", "score": 2, "replies": []}, {"body": "Mod material right here.", "score": 2, "replies": []}, {"body": "holy shit those are fucking terrible calls.", "score": 2, "replies": []}, {"body": "The moment you realize you should choose another hobby....", "score": 2, "replies": []}, {"body": "Feels.", "score": 2, "replies": []}, {"body": "Wow", "score": 2, "replies": []}, {"body": "Holy shit you're retarded...", "score": 2, "replies": []}, {"body": "I wrote some 15$ sept15calls earlier this week and was wondering who the poor soul was that bought them.  ", "score": 2, "replies": []}, {"body": "Somebody explain this to me? No idea why people think OP is a moron.", "score": 2, "replies": [{"body": "Dude bought a couple grand worth of Options contracts and chose a strike price of $14/15/16/17. Unfortunately, they expire tomorrow, and without the underlying stock rising above any of those strike prices by tomorrow afternoon, OP is fucked out of all his cash. ", "score": 2, "replies": []}, {"body": "Because there's no way any of his calls are going to come true. It was a bad bet.", "score": 1, "replies": []}]}, {"body": "$17.00!!!! wtffff", "score": 2, "replies": []}, {"body": "Change -98% \n'One of us... one of us'", "score": 2, "replies": []}, {"body": "my god. \n\nmaybe calls are cheap for a reason...", "score": 1, "replies": []}, {"body": "Hey it's cool man, I YOLO'd into $RAD in June. There are plenty of us Traderps out there. ", "score": 1, "replies": []}, {"body": "just buy more faggot my yacht needs a new jetski", "score": 1, "replies": []}, {"body": "Butter up your angus behind. ", "score": 1, "replies": []}, {"body": "roll out", "score": 1, "replies": []}, {"body": "Goodnight sweet prince.", "score": 1, "replies": []}, {"body": "Oh baby, what is you doin?", "score": 1, "replies": []}, {"body": "See, this is why selling options always wins ðŸ‘Œ", "score": 1, "replies": []}, {"body": "Glad I bought more when it dipped to 12.19 in AH when everyone freaked out about NK lol. Green tomorrow. Futures already heading green ", "score": 1, "replies": []}, {"body": "LOL I've been there bro you will learn from it. You trade options, you are going to blow some shit up once in a while or a lot lol", "score": 1, "replies": []}, {"body": "TIL you can still sell AMD calls 50% outside the money and one day from expiry and get 4 actual nuggets per.", "score": 1, "replies": [{"body": "I bought these over 2 months ago", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Also an option noob, won't these just expire worthless and he is just out the premium?", "score": 1, "replies": [{"body": "If AMD ends below 14, which it probably will, that's a couple thousand dollars of premium down the drain. Of course it might go to moon and op becomes the next billionaire, but I wouldn't count on it", "score": 5, "replies": [{"body": "So he paid 0.45 * 15 * 100 = $675 for the 16 calls?", "score": 1, "replies": [{"body": "Yes, 663 of which have evaporated", "score": 4, "replies": []}]}]}]}, {"body": "The further OTM calls are usually much cheaper, so if the stock ever approaches that strike, the increase in the option value will be a significantly larger percentage increase than your ATM calls. \n\nDoing a spread lets you play a variety of risk vs reward scenarios. OP's play was completely retarded because no amount of DD in the world points to AMD hitting 17 any time soon, so he pretty much threw his money away. ", "score": 1, "replies": []}]}]}
