{"title": "Tesla Q3 2022 Earnings Q&A", "selftext": "", "id": "y3ypuo", "created_utc": 1665765373.0, "score": 53, "upvote_ratio": 0.92, "num_comments": 41, "comments": [{"body": "This earning better save us. Or hold us. My ass hurts.", "score": 9, "replies": []}, {"body": "Say still wants me to type in my broker username and password for it to SAVE and then count my shares.. \n\nNo way in hell I am doing that.", "score": 17, "replies": [{"body": "Yeah, no one should do that, and they sure as fuck shouldn't be asking for it. That puts a huge target on their back.", "score": 11, "replies": [{"body": "My broker even has a public API that you CAN grant read only access to properly!", "score": 3, "replies": []}]}, {"body": "This is a 3rd party service, it’s read only, it’s same 3rd party service that you use to link your back account to broker account (in this case it’s read only).", "score": 1, "replies": [{"body": "The 3rd party service SAVEs your primary account credentials and then polls with them.  (Edit: or at least it does for questrade.com and some others)\n\nDoesn't matter if SAY doesn't have access PLAID DOES.. THAT is the problem. PLAID is not safe as they are saving the full user name and password..\n\nHow do I know?\n\nI have MFA enabled on my broker account and IF you give them the credentials they try to sign in repeatedly to keep the count up to date.\n\nThis is instead of using the proper API that does NOT grant any access other than read access.\n\nSo ya, I am NOT handing over full access to my broker account to PLAID.\n\nedit: corrected PLAID", "score": 5, "replies": [{"body": "When you say \"PAID\" here, I think you're referring to PLAID. Am I right?", "score": 1, "replies": [{"body": "Yes, auto correct messed that up and I didn't catch it.. Fixed", "score": 1, "replies": []}]}]}]}, {"body": "Agreed. I will never give any third-party my brokerage credentials. That's insane.\n\nMore brokerages need to provide API hooks to allow read-only visibility to third parties like Say/Plaid.", "score": 1, "replies": [{"body": "My questrade is my broker and they offer a published public read only API.. PLAID just doesn't bother to use it.", "score": 1, "replies": [{"body": "It also doesn't help that Plaid seems really sketchy to me.", "score": 1, "replies": []}]}]}, {"body": "Ugh yeah, why not just accept a handshake token which many brokers offer, I'm not giving out my password", "score": 1, "replies": []}]}, {"body": "🙏 Please ask and vote good questions 🙏", "score": 18, "replies": [{"body": "Wishful thinking lol", "score": 10, "replies": [{"body": "4 out of the top 5 questions seem pretty reasonable asking about Production plans and resource allocations", "score": 5, "replies": []}]}, {"body": "\"when is the stock split?\"", "score": 9, "replies": [{"body": "\"When dividend/buyback\"?", "score": 6, "replies": [{"body": "Haha , yep", "score": 2, "replies": []}]}, {"body": "Please tell me you forgot a /s", "score": 1, "replies": [{"body": "Lol just everyone and their mother was asking it last time habs", "score": 1, "replies": [{"body": "I remember lol.  \nBut now it would be unforgivable given that the stock split happened already 😂", "score": 1, "replies": []}]}]}]}]}, {"body": "A buyback at this price is a great investment idea for the company. This is a sweet ass discount price for them. Most times I would say “fuck that, use the money to expand and improve the company!”\n\nBut in this case EM has already said they are spending as much money as possible without wasting it. Expanding lines, ramping, possible new GF and what not. They are using as much money as fast as they can without literally setting it on fire.\n\nA buyback would be very smart for the company because in a year they will 2x the money", "score": 3, "replies": []}, {"body": "I think the top questions are good. They just never give a thorough answer to the questions.", "score": 4, "replies": [{"body": "Elon never gives straight answers. He always twists them for different reasons. For example, for keeping things secret like Optimus, fsd or if something is not going well with the product road map like 4680", "score": 0, "replies": [{"body": "I think he answers as much as he can, at the time, with what he knows.", "score": 7, "replies": [{"body": "Yeah the opposite is a Mary Barra type who just says bubbly, exciting, and vapid things with no real thought.", "score": 1, "replies": []}]}]}]}, {"body": "Still can't vote :/ At least the questions are okay, considering there are no questions regarding Twitter or something.", "score": 2, "replies": []}, {"body": "Really need to do a share buy back.  Especially with elon getting stupid on twtr and selling tsla for a dog shit company", "score": -10, "replies": [{"body": "So agree to use up all of teslas cash to buy back less than 2% of the company and give all the leverage and financial strength away that tesla has? No thank you. Maybe once tesla is cash flowing 10s or billions per year I’d be down. In the meantime the short term fluctuations shouldn’t matter to a long term shareholder. Who gives a fuck if the stock is down right now on some stupid tesla noise, just wait a few years until tesla is selling millions of cars per year.", "score": 2, "replies": [{"body": "Did I say all?  No\n\nLeaps used to be safe.  But not for tsla", "score": 0, "replies": [{"body": "Well buying back less than 2% is pointless", "score": 0, "replies": [{"body": "Well then, better drop tesla solar cause 2% etc is shit\n\nTesla energy is like 6% of revenues and tesla solar is like 25% of that, therefore < 2% of total profits and is dog shit.  \n\nBasically share buy back is worth more than tesla solar.  Get fucked true believer downvoters", "score": -1, "replies": []}]}]}]}, {"body": "Hate to say you are right. They need to do a huge buyback.", "score": -2, "replies": [{"body": "Yeah, should buy back with their cash, and use their new credit rating to take loans for their factory development", "score": -2, "replies": [{"body": "For what reason though? That's what I don't understand....why take out debt you don't need?", "score": 1, "replies": [{"body": "Why does apply have $102B in debt when they have like $62B in cash?  \n\nBusiness is about risk and reward.  Seek as much reward as you can at a level of risk you can manage.  Tesla can get a much better return on that capital than what they pay to borrow the capital.  Therefore they should take the opportunity and increase their returns.\n\nGood ROI, and IRR.  IRR specifically is what Im talking around.  Tesla IRR is much higher than the risk free rate so they would be better off using the funds to maximize IRR capture.\n\nIf tesla can get capital at 10% and make 25% on share buy backs, they should do that.  If tesla can make 100% on factory investments they should do that too.  They should take as much leverage (to invest in the above opportunities) as they can reasonably maintain payments on in a worse case scenario.  \n\nDave Ramsey is not a business strategy.  Especially when you have extreme growth tesla does and still relatively low interest rates. His methods are for ppl that can’t manage their own risks.", "score": 1, "replies": [{"body": "This is true - however, Elon has made it clear that their growth is not cash limited and that trying to grow more quickly by throwing cash at it would simply result in wasted money, ie a lower rate of return. IMO we don't need more cash. \n\nBut *if we did* why burn the cash you have for buybacks and simultaneously *raise* more cash through debt?", "score": 1, "replies": [{"body": "https://stocks.apple.com/AdqyQ-jX8Q5-w_Pf6lfRC8w", "score": 1, "replies": [{"body": "How much can they buy back? $4B a year? that's half a percent of their market cap. As you noted above, they can easily raise their market cap much more than 0.5% by investment over time .\n\nTesla doesn't have a ton of money sitting around - they only have $1.1B more cash than their current liabilities.\n\nAnd the biggest reason of all why they shouldn't try to raise their market cap with buybacks is that we're in a recessionary bear market environment. This environment is by far the largest driver of their stock decline IMO. When the economy rebounds in a year or so the stock, which is seeing increasingly compressed P/E, will rebound.\n\nI guess I wouldn't care if there were $200M/quarter in buybacks or something but I don't think Tesla has the cash to execute an impactful buyback.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Elon does give straight answers, he just never discloses the secret sauce", "score": 1, "replies": []}, {"body": "The most important question: what are TSLA’s estimated Q4 deliveries (not production)?", "score": 1, "replies": []}]}
{"title": "Warning from BANK OF AMERICA", "selftext": "", "id": "y404ap", "created_utc": 1665768798.0, "score": 115, "upvote_ratio": 0.91, "num_comments": 43, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|1 year ago\n**Total Comments**|952|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y404ap)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y404ap)", "score": 1, "replies": []}, {"body": "He's back ![img](emote|t5_2th52|4735)", "score": 43, "replies": [{"body": "![img](emote|t5_2th52|4735)", "score": 21, "replies": [{"body": "![img](emote|t5_2th52|4735)", "score": 17, "replies": [{"body": "![img](emote|t5_2th52|4735)", "score": 10, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4258)", "score": 5, "replies": []}, {"body": "I wonder what color ASICS he’s wearing", "score": 3, "replies": []}, {"body": "god", "score": 2, "replies": []}]}, {"body": "“Tell me you’re short, without telling me you are short”", "score": 21, "replies": [{"body": "So short it picks up chicks with personality", "score": 7, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 10, "replies": [{"body": "I’m goin in boys", "score": 4, "replies": []}]}]}, {"body": "Okay—\n\n Hi!  my name is Savita Subramanian…", "score": 2, "replies": []}]}, {"body": "BAC reports earnings next Monday, it's almost as if they're warning us what they'll be.", "score": 11, "replies": []}, {"body": "![img](emote|t5_2th52|4735)", "score": 8, "replies": []}, {"body": "BofAAAAA", "score": 6, "replies": [{"body": "DEEZ PUTS", "score": 7, "replies": []}]}, {"body": "“Plz don’t take ur money out and spend it on ‘the dip’, we really need your deposit liquidity to sell expensive business loans rn. Thx.”", "score": 7, "replies": [{"body": "The banks are sitting on a ton of cash right now. Check out amounts on the reverse repo market.", "score": 3, "replies": []}]}, {"body": "At least legalize weed so I can pass this storm in a happy place", "score": 7, "replies": []}, {"body": "Thx buying calls now", "score": 12, "replies": [{"body": "Let’s see the proof!", "score": 4, "replies": []}]}, {"body": "There are like 5 bubbles popping and 2 perfect storms and then Biden is just a colossal trip and fall type person", "score": 7, "replies": [{"body": "Need some LifeLine Fall Protection", "score": 2, "replies": [{"body": "Dang at least get gramps the smart watch with fall-ID, geez", "score": 1, "replies": []}]}]}, {"body": "Only reason there's liquidity problem is banks are rigging the price making the market not want to trade. Run on cash", "score": 5, "replies": []}, {"body": "Nasdaq yes.  \n\nOthers not sure to be honest", "score": 2, "replies": []}, {"body": "He’s back and he looks… concerned.", "score": 2, "replies": []}, {"body": "Wsb members every day 'should I sell? Everything is tanking' 'Buy puts we are fcked ' 'sky is falling, bubble gonna pop'\n\nWsb after a bank says those things. 'Nice try fuckers, calls it its, you're not fooling me'", "score": 2, "replies": [{"body": "You can try to fix the economy but you can’t fix stupid!", "score": 1, "replies": []}]}, {"body": "And you belong here if you did not see today coming- either today or Monday.    Maybe both.", "score": 2, "replies": [{"body": "I have about 170k in shorts that I opened up yesterday afternoon. But today has nothing to do with what they’re warning about", "score": 1, "replies": [{"body": "Sure it does- yesterday was a combination of a buy the dip crowd jumping in combined with a short squeeze as it gained steam.  It was pretty obvious it was not going to last.", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}]}, {"body": "BofA deez nuts", "score": 2, "replies": []}, {"body": "That’s a long way of saying, “buy puts.”", "score": 2, "replies": []}, {"body": "Fuk Bank of America and fuk Russias bank drain Russias fake economy bank to higher stocks 😂", "score": 1, "replies": []}, {"body": "The same dipshits that changed their lending guidlines based on racism.  Yeah BOA definitly knows what theyre doing.  Glad i closed my account this week!", "score": 0, "replies": [{"body": "You had to go there and close it? Usually they close it for you for Insufficient funds", "score": 2, "replies": [{"body": "no... by phone", "score": -1, "replies": []}]}]}, {"body": "That is correct", "score": 0, "replies": []}, {"body": "Warning from bofa deez…", "score": 0, "replies": []}, {"body": "so line go down?", "score": 1, "replies": []}]}
{"title": "Founder of Nikola Is Convicted of Fraud. Ladies and Gentleman, we got him", "selftext": "[https://nytimes.com/2022/10/14/business/trevor-milton-nikola-fraud.html](https://nytimes.com/2022/10/14/business/trevor-milton-nikola-fraud.html)\n\n&#x200B;\n\n# Trevor Milton was accused of boasting about nonexistent technology to inflate the stock price of Nikola, a maker of electric trucks.\n\nA federal jury on Friday found Trevor Milton guilty of defrauding investors by lying about the supposed technical achievements of Nikola, the electric truck maker he founded.\n\nMr. Milton was convicted of one count of securities fraud and two counts of wire fraud, the most serious of which carry a maximum prison sentence of 20 years. He was acquitted on an additional count of securities fraud. The jury in U.S. District Court in Manhattan delivered the verdict after about four weeks of testimony and about six hours of deliberation.\n\nProsecutors portrayed Mr. Milton, 40, as a serial fabricator who wooed investors by falsely claiming that Nikola was close to producing long-haul trucks that could run emission-free on cheap hydrogen.\n\n“Trevor Milton is a con man,” Jordan Estes, assistant U.S. attorney, said Thursday as she summarized the government’s case. “He lied to investors to get their money, plain and simple.”\n\nDefense attorneys argued that Mr. Milton did not intend to defraud anybody and that his statements were not responsible for a plunge in Nikola's stock price that wiped out billions of dollars in value.\n\nMarc Mukasey, a defense lawyer, acknowledged that Mr. Milton sometimes spoke in the present tense about things Nikola hoped to achieve in the future. “He loved Nikola,” Mr. Mukasey told jurors on Thursday, likening Mr. Milton to an overenthusiastic parent who brags about his child.\n\nOn Friday, Mr. Mukasey said, “We respect the verdict, but we’re going to keep fighting.”\n\nMr. Milton, who had appeared cheerful during much of the trial, shook his head in apparent disbelief after hearing the verdict. His wife, Chelsey Milton, leaned her head against the back of a courtroom bench and sobbed.\n\nU.S. District Judge Edgardo Ramos, who presided over the trial, allowed Mr. Milton to remain free on a $100 million bond until sentencing in January.\n\nThe case provided a lesson in the hazards of investing in fledgling “pre-revenue” electric vehicle makers that have ideas but limited or nonexistent sales. With the exception of Tesla, new carmakers have struggled with manufacturing problems.\n\nIn a recent example, [Rivian](https://www.nytimes.com/2022/10/07/business/rivian-recall-steering.html), a maker of electric pickup trucks, said last week that it was recalling almost all of the vehicles it has produced because a small number have an improperly tightened fastener that could cause the steering to malfunction.\n\nThe Milton trial was also a was a test of prosecutors’ ability to hold managers of publicly traded companies accountable for statements they make on social media and other public forums that can cause share prices to gyrate. Mr. Milton was a prolific user of Twitter and frequently appeared on podcasts and business news programs.\n\nA college dropout with no formal training in engineering, Mr. Milton founded Nikola in 2015 in the basement of his Salt Lake City home. The company listed on Nasdaq in 2020 by merging with a special purpose acquisition corporation, or SPAC, called VectoIQ Acquisition Corporation. VectoIQ is managed by Stephen Girsky, a former high-ranking executive at General Motors. The deal with the so-called blank-check corporation allowed Nikola to avoid some of the regulatory scrutiny usually applied to initial public offerings.\n\nAfter the stock market listing made him wealthy, Mr. Milton, who [owned 25 percent of Nikola shares](https://www.nytimes.com/2021/07/29/business/nikola-trevor-milton-fraud.html), went on a spending spree, buying luxuries including a Gulfstream jet and a multimillion-dollar home in the Turks and Caicos Islands. In about six months during 2020, according to testimony, Mr. Milton spent more than $80 million.\n\nNikola shares peaked near $80 in June 2020, when the company was worth more than Ford Motor. Shortly after, the investment firm Hindenburg Research issued a [report](https://hindenburgresearch.com/nikola/) accusing Mr. Milton of making numerous false assertions about the company's technology, pointing to a video in which a truck was rolled down an incline to make it look like a working prototype.\n\nMr. Mukasey dismissed the video as mere “special effects.”\n\n“It’s certainly not a crime to use special effects,” Mr. Mukasey told jurors. “Otherwise the government would have to indict the Energizer Bunny.”\n\nMr. Milton [resigned](https://www.nytimes.com/2020/09/21/business/nikola-trevor-milton-resigns.html) as executive chairman a few weeks after the Hindenburg report. Nikola shares closed Friday at $3.06.\n\nLast year, Nikola agreed to pay a [civil penalty of $125 million ](https://www.nytimes.com/2021/12/21/business/nikola-sec-fraud-investigation.html?searchResultPosition=2)to settle a fraud investigation by the Securities and Exchange Commission. The company did not admit wrongdoing as part of the settlement.\n\nNikola aspired to be the Tesla of the trucking industry — both companies took their name from Nikola Tesla, a pioneer in developing alternating-current technology. Nikola planned to build trucks that would be powered by emission-free hydrogen fuel cells. The company would build a network of hydrogen fueling stations along major highways, much as Tesla built a network of charging stations.\n\nDuring the trial, prosecutors played video interviews in which Mr. Milton claimed Nikola was already producing “green” hydrogen with renewable energy for less than the cost of diesel, a major milestone. “Game is over for diesel,” Mr. Milton said on Twitter.\n\nIn fact, Nikola had produced “not one molecule” of hydrogen, Ms. Estes said. Others in the fledgling green hydrogen industry are still struggling to produce the gas cheaply enough to undercut diesel.\n\nMr. Milton also said he had billions of dollars in binding contracts with trucking companies to buy Nikola vehicles. The “contracts” were just reservations that could easily be canceled, prosecutors contended.\n\nAmong the witnesses was Scott Damman, a senior manager at General Motors, which planned to build a battery-powered pickup truck, the Badger, with Nikola. The announcement of the Badger in February 2020 caused a spike in Nikola's stock price.\n\nMr. Damman testified that G.M. would have manufactured the truck and supplied all of the engineering and technology, while Nikola contributed some of the design and marketing.\n\nNonetheless, according to testimony, Mr. Milton said on Twitter and other forums that Nikola was responsible for “100 percent” of the technology in the Badger, portraying G.M. as little more than a supporting player. G.M. pulled out of the partnership soon after the Hindenburg report, and the Badger was never produced.\n\nOther Nikola executives including Mark Russell, the chief executive, and Kim Brady, the chief financial officer, warned Mr. Milton repeatedly that his statements could backfire, prosecutors contended. The executives even staged an “intervention” where they tried, unsuccessfully, to get Mr. Milton to hew to the truth, according to witnesses.\n\nMr. Mukasey, the defense lawyer, pointed to internal Nikola emails in which the executives praised Mr. Milton’s media appearances. “They were telling Trevor what a good job he was doing,” Mr. Mukasey said.\n\nThe convictions include a charge that Mr. Milton defrauded a man who sold him a ranch in Utah. Mr. Milton paid for the ranch in part with Nikola stock options that proved to be worthless.\n\nThe acquittal on one of the securities fraud counts offered Mr. Milton a bit of relief. A conviction on that charge would have exposed him to a maximum sentence of 25 years.\n\nNikola, based in Phoenix, continues to operate, producing a limited number of battery-powered trucks in cooperation with established companies including IVECO, an Italian truck maker that is manufacturing Nikola vehicles in Germany. Michael Lohscheller, an auto industry veteran who was previously the chief executive of the German carmaker Opel, was named president of Nikola in August. \n\nStefan Hartung, chief executive of the German electronics maker Bosch, said in an interview this month that he still believed in Nikola. Bosch, one of the world's largest makers of components for the vehicle industry, is supplying fuel cell technology for Nikola trucks being developed.\n\n“We are now pretty far in terms of industrialization capability,” Mr. Hartung said. “This vehicle can be built.”", "id": "y46ero", "created_utc": 1665784480.0, "score": 67, "upvote_ratio": 0.94, "num_comments": 39, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|5 months ago\n**Total Comments**|67|**Previous DD**|\n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y46ero)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y46ero)\n    \n>TL;DR: Trevor Milton was convicted of securities fraud and wire fraud after lying to investors about the technical achievements of Nikola, the electric truck company he founded. He faces up to 20 years in prison.", "score": 1, "replies": []}, {"body": "And he got everyones money. We still lose.", "score": 20, "replies": [{"body": "hindenburg got your money ..", "score": 3, "replies": [{"body": "As they should.\nFor identifying the fraud", "score": 7, "replies": [{"body": ":-D .. yeah right .. that was their only goal .. helping the human race .. dream on ..", "score": 0, "replies": [{"body": "No, their goal was making money. are you even following this comment thread?", "score": 1, "replies": [{"body": ".. ok .. Hindenburg = Good … Milton = Bad .. i get it .. i think massively increasing short positions before releasing the report and making hundreds of millions this way is completely legit ..", "score": 0, "replies": [{"body": "They can't do their research for free. I'd rather they exist and make money than not exist. Without Hindenburg, NKLA investors still would have lost their money, in fact more of it because they would have kept piling more money in while the rugpull would have been delayed. In a better world, regulators would actually do their job and there wouldn't be a use for Hindenburg, Muddy Waters, etc.", "score": 2, "replies": [{"body": ".. yes .. i’m with you on that .. unfortunately corporate or personal greed is and has always been a problem .. not a fan of Milton .. but i really like Nikolas current development .. shame it’s getting all this hate because of the past .. regarding Hindenburg i see it a little different from you .. but a different view on things is completely normal ..", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "![img](emote|t5_2th52|18632)", "score": 0, "replies": []}]}, {"body": "you deserve to go to jail if you call pushing a truck downhill “special effects”", "score": 11, "replies": []}, {"body": "Is this the truck that rolled downhill but looked like it was  on a flat road?", "score": 8, "replies": [{"body": "it is", "score": 3, "replies": []}]}, {"body": "Who is next? \n\nCEO of Hyliion?", "score": 4, "replies": []}, {"body": "But is this already priced in or not?", "score": 4, "replies": []}, {"body": "Looking forward to the Netflix special 😎", "score": 3, "replies": []}, {"body": "I saw a nikola truck the other day on a trailer it was actually pretty cool.", "score": 5, "replies": []}, {"body": ".... bullish?", "score": 2, "replies": []}, {"body": "Dat NKLA be crazy", "score": 2, "replies": []}, {"body": "Whenever you feel bad just remember, some people bought Nikola at 90", "score": 2, "replies": []}, {"body": "Fucking finally, what a bitch. He made me lose alot of money. Hope you drop the soap and your carreer will roll down a hill like your shit vehicles.", "score": 6, "replies": [{"body": "There is a famous company called Tesla and then you invest in a company called Nikola? Geez, I wonder why you are losing money.", "score": 14, "replies": [{"body": "It worked until it didn't", "score": 4, "replies": []}, {"body": "K bye", "score": -11, "replies": []}]}, {"body": "Lmao. Its all you. Stop blaming others for your own incompetence. Imaging investing in Nikola lmao", "score": 3, "replies": []}, {"body": "... i think hindenburg has got your money", "score": 1, "replies": []}]}, {"body": "I remember him being on squawk box or something and the host kept asking him how expects to make up from the accusations and he just kept repeating that they all have their heads down working hard or something and I've never felt the pain in my stomach from utter disgust like this before. It was horrendous listening to that filth I just wanted to punch his face.", "score": 3, "replies": []}, {"body": "good, now do Elon", "score": 3, "replies": []}, {"body": "I am sure that the share will rise again in the foreseeable future. I assume that the court case against Trevor Milton has been awaited and that the positive news will now be released (e.g. the Hydrogen Hub, see https://eu.azcentral.com/story/news/local/southwest-valley/2022/10/14/nikola-zero-emission-truck-maker-buys-920-acres-in-buckeye/10497945002/).\nWith Peter Lohscheller we will soon have an absolutely serious, competent and in the industry super networked top man as CEO, who will regain trust with business partners and investors.\nTogether with the good news, which in my opinion will arrive soon, this is a very good basis to create a significant turnaround in the share price.", "score": 2, "replies": [{"body": "I like the stock!", "score": 1, "replies": []}]}, {"body": "Who cares.", "score": 0, "replies": []}, {"body": "Puts on NKLA first thing Monday - wish I had thought about it today.", "score": 0, "replies": []}, {"body": "Maybe 48 months in the Fed CC for 100 Million?\n\n&#x200B;\n\nWhere is the sign up sheet?", "score": 1, "replies": [{"body": "This won't be some country club.  This will be Federal Pound Me in the Ass Prison.", "score": 2, "replies": [{"body": "He might like the pounding very much …. He will\nbe a changed man !!! Honey I am hoooome …..", "score": 1, "replies": []}]}]}, {"body": "Puts on Nkla were my first options and i made thousands.  They grow down fast 🥲", "score": 1, "replies": []}, {"body": "He doesn’t look 40", "score": 1, "replies": []}, {"body": "who cares, the money is still gone...", "score": 1, "replies": []}]}
{"title": "SPY Last Three Days Explained", "selftext": "&#x200B;\n\n[Recap of the price levels](https://preview.redd.it/ev2mn0czhut91.png?width=1419&format=png&auto=webp&s=6e3910e31b6f89c5c7f8d50fd124ff9be13fed6d)\n\n**Wednesday: (Sideways)**\n\n* Before CPI participants get prepared:\n   * Buy puts to protect their long positions \n      * Market maker sells puts (long position) and shorts shares (short position) to get delta neutral \n   * Short stocks \n      * Maker buys shares (long) and buys puts (short) to get delta neutral \n   * Institutions and retail have their cash ready \n   * This interest in puts shows up in the VIX which was elevated all Wednesday going into close. \n\n**Thursday: (Up 1%, Down 3%, Up 5.5%)**\n\n* Market is closed:\n   * Futures drift up on hopium that the report is not as bad as expected \n   * The CPI report comes out and the market drops 3% in the pre-market \n   * The market moves a lot because there is a lot less liquidity, wider bid-ask spreads and the moves become exaggerated \n* The Market is Open:\n   * This means the options market is open as well \n   * Put holders sell, this brings VIX down \n      * Market maker closes their short shares position, buying shares \n   * Short sellers close, which is a buy in the market, driving prices higher \n      * Market maker closers their short put positions, which causes others to buy shares \n   * The VIX collapses \n      * This is counterintuitive because normally when SP falls, VIX goes up, but it was the closing of put positions which drove this decline in VIX\n   * Investors with cash in the sideline see a new 52 week low, and start to buy \n   * Sellers are overwhelmed by the rebalancing of puts, shorts and new longs - we move \\~5% off the lows \n\nEVERYONE TAKES PROFITS ON SHORTS, WE GO UP\n\n**Friday: Up 1%, Down 2%** \n\n* The wave of shorts covering and puts closing has subsided\n* The wave of new cash on the sidelines is gone \n* Reality sets back in as the overall market, as opposed to the short term participants/market makers, continue with the overall downward trend\n* All of the gains from Thursday are erased\n* We stop close to where we started before the CPI report comes out \n\n&#x200B;\n\n**Bearish things to keep in mind going into next week:**\n\n* Oil might continue to fall going into midterms, market maker (the US Gov), but it is [headed higher for longer](https://www.reddit.com/r/wallstreetbets/comments/xrtkjs/the_bull_case_for_oil/)  \n* Dollar doesn't seem to be slowing down \n* 2YR and 10YR yields remain elevated and it looks like they will continue to rise \n* Bank of England is removing support \n* It is consensus that .75 will be the next hike, with a meaningful chance at a 1.00 hike \n* Inflation is not subsiding, there is more work to be done, employment remains high, Powell is committed to the job and is most likely going to overcommit \n* Mega caps, and [TSLA specifically](https://www.reddit.com/r/wallstreetbets/comments/y1dtf7/tsla_is_dying/), are about to finally succumb to the selling pressure and capitulate. Anyone holding TSLA beware - its not going to \"fair value\" its going to overshoot to the downside \n* Housing and rent basically can't go down (sorry to all the housing crash enthusiasts) with supply constrained. No one wants to be building, no new housings coming on the market, existing owners (should) have 3% interest rates and can't/won't sell. Everyone has to rent or bid up assets further. A decade of under building precedes this market environment. There can't be \"demand destruction\" if there is a greater number of \"sellers destroyed\" by even greater market dynamics than rates \n* Russia running out of options. Even if peace/deal is reached globalization is over and the west hasn't quite realized that\n\n&#x200B;\n\n**How to win:** \n\nSell call spreads until we test the low, then sell put spreads why SPY is around 348-350 level. Don't buy puts until VIX is under 27/28 otherwise IV crush and theta can eliminate nearly all your gains (this is why your long options are net losers).", "id": "y470da", "created_utc": 1665785974.0, "score": 73, "upvote_ratio": 0.92, "num_comments": 48, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|2 years ago\n**Total Comments**|222|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/xn2wn6/how_to_win_the_week_of_926/) [x](https://www.reddit.com/r/wallstreetbets/comments/xrtkjs/the_bull_case_for_oil/) [x](https://www.reddit.com/r/wallstreetbets/comments/xurrbx/tsla_time_to_sell_calls/) [x](https://www.reddit.com/r/wallstreetbets/comments/xwd4zs/trading_spy_next_9_days/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y470da)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y470da)\n    \n>TL;DR: Market is most likely going to go down, but there are a lot of things that can cause it to go up. Don't be surprised if we test the lows, but you will lose money long if you buy puts now and don't sell calls until SPY drops down to 348-350 or below. You might make money buying calls when VIX is at 22-25 and selling around 27/28.", "score": 1, "replies": [{"body": "No, this is not a good TL;DR.", "score": 2, "replies": [{"body": "Wtf did vis mod post the TLDR?\n\nWhat are your plays for next week?", "score": 1, "replies": []}]}]}, {"body": "Nice post\n\nMy only critique is that housing will drop as unemployment goes up and reality sets in to the new regime of 8% mortgage rates. There is a (relative) ton of new housing in the queue in more suburban areas with demand dropping of a cliff right now (I’ve gotten a few calls recently from realtor friends out of the blue looking to “catch up”). As jobs dry up and people hit the unemployment line and Airbnb finally starts to slow down via inflation more housing will come back on the market from over leveraged owners. \n\nPhoenix is the canary in the coal mine for this and rents are already falling off a cliff there. This will start creeping into more desired locations and will get nasty if unemployment gets above 6% via a serious economic downturn that gets out of the feds control (like 08). You say can’t/won’t sell but it’s hard to pay even a 3% mortgage without a job and layoffs are just beginning.", "score": 12, "replies": [{"body": "Fair counterpoint. I think some housing, some markets and some types of housing’s which might be in a bubble could come down. But whatever is coming, it won’t be another 2008 because the over-leverage isn’t in housing in my opinion. Housing could come down a bit, but it won’t be housing that brings the market down. \n\nI feel like the mortgage rate will stop all speculation and stop the rising costs of housing but it won’t necessarily drop as much as people expect. Just a supply and demand question in my head but admittedly I don’t have a ton of research into it.", "score": 6, "replies": [{"body": "Agreed, no crash is a replica of the previous ones. ARMs aren’t really a thing like they were in 2008. But who knew what a credit default swap was in 2008? We learned how to regulate some financial instruments. What we also learned is that there are all sorts of instruments that aren’t on the radar of regulators and it only takes a critical mass of over leveraged financial institutions (hello England pension funds) OR individuals (homeowners) OR unemployed people for the wheels to start to fall off the cart.\n\nThrow in a war, energy, and food crisis and the bolts holding the wheels on don’t look nearly as sturdy as they used to.", "score": 3, "replies": []}]}]}, {"body": ">Sell call spreads until we test the low, then sell put spreads why SPY is around 348-350 level. Don't buy puts until VIX is under 27/28 otherwise IV crush and theta can eliminate nearly all your gains (this is why your long options are net losers).", "score": 10, "replies": [{"body": "This is perfect", "score": 8, "replies": []}]}, {"body": "\"Not really, but that's alright. Next caller!\" - Jimmy Shill\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "In other words: you fukked", "score": 6, "replies": [{"body": "profound contribution", "score": 7, "replies": []}, {"body": "Only if you are buying calls", "score": 1, "replies": []}]}, {"body": "There's actually quite a bit of new inventory in the pipe line for housing, thats only thing i would disagree with here", "score": 3, "replies": []}, {"body": "I agree with most of your post outside of housing.", "score": 3, "replies": [{"body": "Yea as an anecdote, people in my subdivision are trying to rent at rates to cover their mortgages. The houses are sitting for lease on the market for months. Too high to rent. Then they try to sell and are setting prices for what they may have gotten at the top of the market. They’re likely doing this because it’s the minimum they need to cover their mortgage and all fees.\n\nSeems like they’re fucked tbh.", "score": 3, "replies": []}]}, {"body": "u think Vix can drop again?", "score": 2, "replies": [{"body": "We will see 40 before we see 20", "score": 5, "replies": [{"body": "u think any chance we bounce or is this gonna be straight down ride?", "score": 1, "replies": [{"body": "we will find another new low before the next bounce in my opinion", "score": 1, "replies": [{"body": "Got it, I’ll go long next week when we make that new low. I’m thinking when we close a daily under that moving average cuz that’ll make everyone bearish and is a good spot for a squeeeeze", "score": 1, "replies": []}]}]}, {"body": "🤣🤣🤣", "score": 1, "replies": []}]}]}, {"body": "Look forward to your posts homie. Made me some bread last two weeks. Keep it up 🔥🤘🏽", "score": 2, "replies": [{"body": "Awesome glad to hear it. Will try to keep putting these together regularly", "score": 3, "replies": [{"body": "Please do. Every weekend, for instance, to prepare the reader for the next week?", "score": 1, "replies": [{"body": "will try", "score": 1, "replies": []}]}]}]}, {"body": "Thanks for this information OP. I pulled over a grand today from multiple bear call spreads that I otherwise wouldn't have made if not for your explanations here", "score": 2, "replies": [{"body": "Legendary. This is the way", "score": 3, "replies": [{"body": "does it still stand even after this big rally? bear calls until VIX down to 20-ish?", "score": 1, "replies": [{"body": "That is what I am selling. Just give yourself a bit more time.\n\nIf it rally’s again? Sell late mid November \n\nIf it rally’s so hard we get vix to come way down, and you are feeling confident, buy puts", "score": 1, "replies": [{"body": "November? shit man I'm doing 0dte's. Made another $800 today but I dont know how long this will last, starting the day high and dropping over the course of the day", "score": 1, "replies": []}]}, {"body": "I don’t think vix is getting to 20 for a while… I’m a put buyers at say 25-27 vix", "score": 1, "replies": []}]}]}]}, {"body": "so the weekly spy calls I bought at close are totally fucked? wanted a contrarian play for next week but I feel like there's no hope or catalyst to save me next week.", "score": 0, "replies": [{"body": "What strike did you buy?\nSell the next strike down creating a call spread. You will be net short calls, and be collecting theta", "score": 2, "replies": [{"body": "367", "score": 0, "replies": [{"body": "Will be tough. If you get a bounce next session I would use it to sell the 366 in the same quantity", "score": 1, "replies": [{"body": "if I get a bounce, im just gonna sell my calls and prob not enter a credit spread. I know enough to know the fundamentals of it, but not use it as a strategy to actually make money lol", "score": -1, "replies": [{"body": "just ask yourself \"am I making money buying options\" then look at your portfolio all time graph. \n\nIf the answer is no, then ask the question \"who made money on all my trades?\"\n\nAnswer is: the person who sold you those options.", "score": 1, "replies": [{"body": "lol yes I am up. but obviously got crushed on some\n\nedit: thanms for the downvote on my last post though. petty", "score": 1, "replies": [{"body": "It wasn’t me. I rarely downvote and I appreciate the comment", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Good stuff here OP. IMO the insane bounce was a mixture of momentum and an “inflation as peaked” mentality. Can’t fight the trends though especially until PIVOT is in sight.", "score": 1, "replies": []}, {"body": "What if I can’t afford two calls at once 🙃 Off to Wendys", "score": 1, "replies": []}, {"body": "I need a refresher. Why does the market maker have to buy shares if traders close their put positions?", "score": 1, "replies": [{"body": "MM wants to be \"delta neutral\" \n\nif they sold a put, that is long delta, so they short shares of the underlying which is long delta. \n\nto close that position, they do the opposite.", "score": 1, "replies": []}, {"body": "I assume to close their short shares", "score": 1, "replies": []}]}, {"body": "I like you", "score": 1, "replies": []}]}
