{"title": "Snap investors, do you still trust Evan Spiegel?", "selftext": "[https://www.marketwatch.com/story/snap-investors-do-you-still-trust-evan-spiegel-11666315465?mod=home-page](https://www.marketwatch.com/story/snap-investors-do-you-still-trust-evan-spiegel-11666315465?mod=home-page)\n\n&#x200B;\n\n>When Snap Inc. went public in 2017, this column boiled down the entire investment opportunity to one, simple question: [Do you trust Evan Spiegel?](https://www.marketwatch.com/story/investing-in-snap-ipo-is-an-impotent-bet-on-unproven-executives-2017-02-23?mod=article_inline)  \n>  \n>As Snap [**SNAP,** **-0.64%**](https://www.marketwatch.com/investing/stock/SNAP?mod=MW_story_quote) stock heads toward its lowest prices since March 2020, and potentially even lower, that question is even more important, and answering “yes” should be even harder.  \n>  \n>Three months ago, amid the beginning of a huge slowdown in the ad business, [Snap initiated a unique dividend meant to ensure that the founders maintained control ](https://www.marketwatch.com/story/as-snap-melts-down-its-founders-make-sure-to-protect-the-people-who-matter-themselves-11658452231?mod=article_inline)of the company, even if they sold their stock — protecting themselves. [Then in August, news came that Snap was laying off](https://www.marketwatch.com/story/snap-plans-to-lay-off-roughly-one-in-every-five-employees-according-to-report-11661890384?mod=article_inline) one in five employees. As Snap again reported disappointing results Thursday and saw the stock plunge again, the company decided now was the time to initiate a stock buyback plan, promising to spend up to $500 million to offset the dilution from employee stock plans — in the past nine months, Snap has spent $937 million on stock-based compensation.  \n>  \n>On the face of it, this seems like an investor-friendly approach — Barron’s pointed out earlier this year that i[nvestors were suffering while employees were faring better with the hefty stock-comp plans](https://www.marketwatch.com/articles/snap-stock-ipo-grants-51653411013?mod=mw_quote_news_seemore&mod=article_inline). But it’s also worth pointing out who the biggest investors in Snap are: Spiegel and his co-founder Bobby Murphy.  \n>  \n>As the company’s largest individual shareholders, Spiegel and Murphy are among the key beneficiaries of Snap’s plans to buy back stock, which usually leads to a boost in the stock price. Those two still control over 99% of the voting power of the company’s capital stock, and as the parent of Snapchat reminded investors in its annual report, “Mr. Spiegel alone can exercise voting control over a majority of our outstanding capital stock.”  \n>  \n>Shares of[ Snap tumbled an additional 25% to just under $8 in after-hours trading](https://www.marketwatch.com/story/snap-stock-plunges-25-as-advertising-slows-down-executives-decline-to-offer-forecast-11658435618?mod=article_inline), putting them near the lowest prices since March 2020. On Thursday, the company ended regular trading hours with a market capitalization of around $17.91 billion, but that was headed toward $13 billion with the after-hours collapse.  \n>  \n>Besides protecting themselves and their investment, Snap’s executives have shown little ability to head off big issues, nor offer any worthwhile solutions to the current ad downturn. In the third quarter, its revenue grew a paltry 6%, down from the most recent second-quarter revenue growth of 13%. Snap appears to be in a steady revenue slowdown, from its peak growth of 116% in the June 2021 quarter.  \n>  \n>Snap has blamed both privacy changes that Apple Inc. [**AAPL,** **-0.33%**](https://www.marketwatch.com/investing/stock/AAPL?mod=MW_story_quote) made to the iPhone that affected ad tracking, and more recently, the macroeconomic advertising climate, while avoiding one of the biggest factors — the rise of TikTok. Top executives didn’t seem to see any of those challenges coming early enough, and did not do enough about them once they did.  \n>  \n>“The company was slow to react — or acknowledge — the significant headwinds faced by privacy initiatives, compounded by competition, and more recently macro headwinds,” Colin Sebastian, an analyst at Baird Equity Research, wrote in a note.  \n>  \n>The competition factor, mostly from China’s TikTok, was addressed briefly on the company’s call with analysts, but was not really acknowledged by Snap leaders.", "id": "y9qfxc", "created_utc": 1666349163.0, "score": 28, "upvote_ratio": 0.8, "num_comments": 51, "comments": [{"body": "Did anyone trust him in the first place? Especially as he sold stock hand over fist.", "score": 39, "replies": [{"body": "He’s the prototypical tech bro. There were some leaked emails many years ago from his days at Stanford that if they were released in the last couple of years would have definitely caused him to resign.", "score": 12, "replies": [{"body": "What were in the emails?", "score": 1, "replies": []}]}, {"body": "He bought a $150 mansion recently, that might be why. His wife is also a Victoria's Secret model and probably has expensive tastes.", "score": 4, "replies": [{"body": "Wow, that's some pretty serious crooked dealing if you could buy a mansion for only $150. A kickback from some business deal?", "score": 31, "replies": []}]}]}, {"body": "This company was once 'valued' at $130 billion.", "score": 20, "replies": [{"body": "That's insane, but then again look at zoom, docusign and peloton at their peaks peloton was I think a 50+ billion dollar conpany", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Don't know enough about docu tbh do all they do is electronic signatures?", "score": 1, "replies": []}, {"body": "I know where you’re coming from but it is widely used tbf", "score": 1, "replies": [{"body": "You can sign documents on your iphone now, so it will probably be used less and less in the future..", "score": 1, "replies": []}]}]}]}, {"body": "13% of 1 trillion dollars.  \nAll for a piece of software that young people like to use?  Something better could come along the next day and half of them delete the app.", "score": 2, "replies": []}]}, {"body": "TikTok took over Snapchat in the Gen Z category and it caused IG (Facebook) to change IG towards reels and longer clips.", "score": 18, "replies": [{"body": "im really shocked people havent caught on. literally snap is playing catch up to tiktok and instagram. this ticker and zoom were always gonna fail.", "score": 4, "replies": []}, {"body": "Whats a tick tock?", "score": -7, "replies": [{"body": "Time for bed grampa", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Really not hard to do that when you have unlimited $$$$$", "score": 6, "replies": []}]}, {"body": "Bad taste in women and business. He got lucky once and now is paranoid.", "score": 3, "replies": [{"body": "Miranda Kerr is bad taste? Be for real lol", "score": 1, "replies": []}]}, {"body": "Yes, I do. in the past 4 years,[i've built a multi million dollar business](https://www.businessinsider.com/ar-studio-made-nearly-4-million-designing-lenses-for-snapchat-2022-8?utm_campaign=sf-bi-main&utm_source=facebook.com&utm_medium=social&fbclid=IwAR1P8ksevgt_iXCHcclvS6lZ4NEEeoGZi9L_Ft_PQDS78NHs0VLtgU6mRoU) on Snapchat with AR.   \n\n\nIt is easy to compare them to FAANG but they are still a start up figuring out their business. I do have concerns with their ad focus business model.\n\nHowever, I am a believer in their long terms strategy with AR. I believe Snap needs an enterprise AR business model and I believe they have it with Camera Kit. Brands like Disney Photo Pass, MLB and many others are already integrating Snap's Key AR tech in their app.\n\n  \nA lot of user don't realize but Snap is their default content creation app because it is so easy and I believe in their AR vision. I think the current arguments against them is 100% valid but this metaverse/AR is a 10 year battle. Let's see a decade from now what happens.", "score": 8, "replies": [{"body": "How much money do they make from non advertising means?", "score": 1, "replies": [{"body": "Not much. That’s why they doing Snapchat+. Their business is like 95% ad", "score": 2, "replies": [{"body": "I can't see Snapchat+ taking off to be honest. Youth get such a good free service elsewhere do no want to pay.\n\nWhat makes your confident in their AR?", "score": 1, "replies": [{"body": "I agree. I don’t think Snapchat + is the right move. Specially when the release those features later. \n\nWith AR, I’m confident in it because all the other big players like Meta and Apple are doing similar things. We see strong results from e-commerce brands that use AR tech like make up, shoes try on, clothing and even furniture placement in a room using LiDAR. \n\nAnd AR utility like room scan from Apple will start to show how AR can simplify or convenient our life’s. AR HUD on car is another example", "score": 1, "replies": [{"body": "I agree with all the above on AR. It's huge! \n\nHow does this relate back to Snapchat? How will they capilise making money from this?", "score": 1, "replies": [{"body": "Ya good question. Right now Snap is the only company that has direct AR ad products that drive app install or purchases directly from the app while other companies like Meta or Tiktok have to rely on stories or links in Bio. So if AR becomes huge, brands can get better results and data from Snap and want to advertise there.\n\nCamera Kit, which is another huge upside is allows any brand to use all the Snapchat AR technology. Hopefully they do a Unreal type of deal like licensing the tech so they can dominate enterprise. \n\nDownside is that they are still an ad based business model, which is def challenging right now.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Nope. And we don’t trust Zuckerberg either", "score": 10, "replies": [{"body": "You're mistaken, a lot of Meta investors would dump their holdings without Mark Z at the helm.", "score": 26, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "He's definitely not a dumbass but he's not infallible either. Huge shame they gave up on building their own mobile OS after the HTC First Android phone with Facebook Home didn't get traction.", "score": 3, "replies": []}, {"body": "Lol, he created one social network in a long line of social networks. His luck was targeting only college kids desperate to fit in, to belong, all while the other big networks were bleeding users (like Facebook is today, hence all bots).\n\n\n\n\n\nWhat has he ever done since? Wasted investor money on buying one competitior after another and delivering *nothing*. He's been unable to face TikTok, TikTok is crushing Zuckers whole \"social media network\" and he can't do shit about it. Go ahead, stay invested and learn why its called being a \"Zucker\"", "score": 3, "replies": [{"body": "Well, you forgot that small little detail that half the population uses their platforms, aaand they make tens of billions of profit that keeps growing each year.", "score": 3, "replies": []}]}, {"body": "Redditors are emotional and hive minded… this stock is insane value territory soon. This isn’t the first time people at the company abandoned zuckerberg (back when they refused yahoo acquisition he said the entire team except for a few quit). This time around a lot internally don’t trust the metaverse vision so buying the company here is a bet on solely his capability to turn it around (or step down and meta pulls off a Lisa su circa AMD)", "score": 0, "replies": []}]}, {"body": "Id consider buyin em up", "score": 2, "replies": []}, {"body": "Replace \"investors\" with friends, and \"helm\" with non-public information, and you are correct.", "score": 0, "replies": [{"body": "doesnt even make any sense", "score": 10, "replies": [{"body": "Maybe its just time to exercise your mental gymnastics.", "score": 2, "replies": []}]}]}]}]}, {"body": "\\> Snap has blamed both privacy changes that Apple Inc. AAPL, -0.33% made to the iPhone that affected ad tracking, and more recently, the macroeconomic advertising climate, while avoiding one of the biggest factors — the rise of TikTok.\n\nOr perhaps it's possible this isn't the reason? User growth isn't the issue, the reason the stock is dropping is because of ARPU... Seems like the author is just making stuff up and providing no reasoning for her arguments... Also it seems she has a bit of an issue with \"tech bro\" founders from her recent opinion pieces slamming both Zuck and Elon.\n\nAnyway, to answer the question, no. I actually kind of like it when founders of innovative companies have control over the company. It's hard to innovate when your shareholders are acting like spoilt brats.", "score": 4, "replies": []}, {"body": "Apple has obliterated the online ads market. They gonna rise from the ashes. Companies like Snap and Meta are dead men walking.", "score": 2, "replies": []}, {"body": "Not investor but he always seemed off/weird. Especially in the show Sillicon Valley...", "score": 2, "replies": []}, {"body": "I mean snap was a crap investment to begin with.", "score": 2, "replies": []}, {"body": "Snap probably won't be around in 10 years. The only use for it seems to be to send nudes.", "score": 1, "replies": []}, {"body": "he’s taking Snap down the toilet! Enjoy", "score": 1, "replies": []}, {"body": "Evans the man", "score": 0, "replies": []}, {"body": "never hear of him. Trust your own research.", "score": 0, "replies": []}, {"body": "Snap gamblers????", "score": 1, "replies": []}, {"body": "Never trusted him been shorting it in 50s, 60s but I was getting in and out due to Infinite QE last year or so.. should have held in hindsight", "score": 1, "replies": []}, {"body": "i actually have shares and i do trust him. So everything below is subject to my bias.\n\nThe app always gets better, ive watched it and many apps develop over the years grow and am developer by trade so i can see their work put in. They have a vision for the products they want to create, i liked their Spectacles and was impressed at their ability to produce quality product. Their platform feels more holistic and their partnerships seem sound. \n\nThe stock price right now is not a great reflection of the companies capability. When economic concerns became an issue, Speigal responded quickly by cutting jobs, which other tech companies followed and are still cutting today. Cuts suck be he identified the need early, and i think thats important. \n\ndidnt realize there was so much negativity towards the guy", "score": 1, "replies": []}]}
{"title": "The VIX is down 6% over the last few days and we have record fund inflows", "selftext": "[removed]", "id": "y9gz5q", "created_utc": 1666318454.0, "score": 8, "upvote_ratio": 0.64, "num_comments": 43, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|12|**First Seen In WSB**|2 months ago\n**Total Comments**|46|**Previous DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y9gz5q)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y9gz5q)\n    \n>TL;DR: The stock market has recovered from its October 13th dip and is currently enjoying a period of calm. This is due in part to the fact that more investors believe that the bottom is forming and are allocating more money to stocks. However, BofA analysts believe that this optimism is premature and that the worst is not over yet for the stock market.", "score": 1, "replies": []}, {"body": ">The stock market is going to crash.", "score": 33, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Username checks out", "score": 4, "replies": []}, {"body": "We'll see in exactly 12 days.", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}]}, {"body": "How far?", "score": 2, "replies": [{"body": "0", "score": 5, "replies": []}, {"body": "Hopefully far enough so I can get even better dollar cost averaging", "score": 4, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "[removed]", "score": -10, "replies": [{"body": "OP's name checks out.", "score": 4, "replies": []}, {"body": "Negatory. Long way to go", "score": 6, "replies": []}, {"body": "What does this company do?. Never really heard of it.", "score": 1, "replies": []}]}]}, {"body": "This is the denial stage", "score": 10, "replies": [{"body": "I think you're right\n\nRemindme! 90 days", "score": 5, "replies": [{"body": "I will be messaging you in 2 months on [**2022-12-20 05:37:59 UTC**](http://www.wolframalpha.com/input/?i=2022-12-20%2005:37:59%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/y9gz5q/the_vix_is_down_6_over_the_last_few_days_and_we/it669n6/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fy9gz5q%2Fthe_vix_is_down_6_over_the_last_few_days_and_we%2Fit669n6%2F%5D%0A%0ARemindMe%21%202022-12-20%2005%3A37%3A59%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20y9gz5q)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Could the inflow be caused by the PPT or Fed or both? Don’t know anyone who is pushing their money into the market at this time.", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "The market is down the last few days. \n\nSo even if there are “net buyers,” the sellers are more enthusiastic at panicking than the bargain hunters are at buying. The market could still go down.", "score": 3, "replies": []}, {"body": "Bottom is in when qqq 50% off highs. Spx 38% off highs . Indu 23% off highs.  It will flounder there for an indefinite amount of time til fed says so. In the meantime notes lookin good 2yr 4.5% and climbing. \n\nMy unprofessional opinion. Not investment advice..lol", "score": 5, "replies": [{"body": "Just curious how you got to these price predictions?", "score": 2, "replies": [{"body": "Anal cavity spelunking", "score": 6, "replies": []}]}]}, {"body": "Wasn't the 'since 2008' part a tell to anyone?", "score": 2, "replies": []}, {"body": "Every months some1 manipulates vix and get litte $ fine. If they even get caught Nothing new", "score": 2, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "yes, AI and IOT is the future and the chips will get us there. Who makes the chips? Semiconductor companies!", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I believe the entire semi market is headed for a temporary crap canal. The effects of this China/Taiwan/United States-related matter won't be felt until at least the third and fourth quarters of next year, and everyone in high-level positions is meeting with lawyers to ascertain exactly what it means. Once they get a clear handle on what we can and cannot achieve from a technological standpoint, they will be able to make more accurate projections, but forecasts are already falling the the millions. A multitude of these businesses have enormous backlogs that will sustain them into at least the third and fourth quarters of next year. It is a cyclical business, so there will be a strong emphasis on R&D and engineering collaboration until the economy improves or a new administration takes office and eases up a bit. Nevertheless, iot and ai are the future, they are everything, and they all originate from the semiconductor industry; therefore, what falls down must rise.", "score": 1, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I don't put much stock in an article from Market Watch, even if it tells a story that could be partly true. Options plays aren't the only thing going on.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "come back when your dumber. \n\n&#x200B;\n\nsoorry i dont really mean this, just thought its a funny come back :P", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4641)![img](emote|t5_2th52|18630)", "score": 1, "replies": []}, {"body": "No where in the world left to hide. Not surprising. Inflation is impossible to control in this scenario with the tools the fed has.", "score": 1, "replies": []}]}
{"title": "FAT DD - COIN: An Impending Earnings Miss", "selftext": "[deleted]", "id": "ya1rel", "created_utc": 1666379047.0, "score": 69, "upvote_ratio": 0.96, "num_comments": 32, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 month ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ya1rel)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ya1rel)\n    \nHey /u/thepinionator, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "Did the OP get banned? He shouldn’t given that his stated strategy is to not take a position int week of earnings… don’t ruin this dialog plz", "score": 1, "replies": []}]}, {"body": "I completely agree but why not buy them now?  Is the predicted IV increase so small until the week of earnings that its not worth it?", "score": 7, "replies": [{"body": "[deleted]", "score": 12, "replies": []}, {"body": "so you can gamble on weeklies the week of earnings😭😂", "score": 5, "replies": [{"body": "Wonder how much the iv premium is for a weekly vs a 1-2 day . Might make sense to then do a weekly vs just a 1-2 day play.", "score": 1, "replies": []}]}]}, {"body": "Cathie Wood buying even more before earnings...bearish?", "score": 3, "replies": []}, {"body": "Nice. Will buy puts just because I hate crypto but this helps with my bias ![img](emote|t5_2th52|4887)", "score": 2, "replies": []}, {"body": "Awesome breakdown. I bought some 70p and 60p last week  expiring 11/4 (day after earnings) I’m already up about 100%. Going to sell half and hold rest through earnings. Crossing fingers.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yeah I know it’s a gamble to hold through. I’m essentially banking on a larger drop post earnings so I can sell at a gain when market opens", "score": 1, "replies": [{"body": "Same position as you friend ($62p 11/4 expiry), up 70% but are you worried about IV crush?", "score": 1, "replies": [{"body": "I am, which is why it’s a gamble. Trading volume is down, which means revenue from fees is down. The wildcard is will they see net revenue from interest increase because of fed funds rate going higher and ppl willing to just store balances. The only comp I have here is Robinhood which reported 75% QoQ increase in revenue from net interest, accounting for 35% of total revenue. It helped them beat estimates.", "score": 1, "replies": [{"body": "Makes sense. I sold before close, looks like their earnings came in terribly so you’ll make out pretty nicely", "score": 1, "replies": [{"body": "I sold 60% still have some 60p 11/4 that I may recover some money on even though COIN is surging. Just needs to calm down a bit with this green dick action.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Is there any chance they could just lie, and everyone will believe them?", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Their earnings. They could use some accounting trick to make it seem like a much smaller loss.", "score": -1, "replies": []}]}]}, {"body": "Lets talk about 2030- is it 350$ stock??", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I have no clue but a lot of hope 🙃", "score": 1, "replies": []}]}]}, {"body": "Well done, I hope you're right!", "score": 1, "replies": []}, {"body": "How much money your putting in?", "score": 1, "replies": []}, {"body": "How are you accounting for the June layoffs?  Should be a large cut in expenses that wasn't reflected in their Q2 statement.\n\n\\*Edit: And do you know whether the revenue figures you have account anything they would get through the Blackrock partnership?", "score": 1, "replies": []}, {"body": "Very thorough DD. OP - If understanding your thesis right, you expect the miss on EPS (versus any miss on revenue) to drive most of the price movement? If your rev range is right (which I agree w the logic), it seems like it won’t fall more than +/-5% from guidance( Q3 rev guidance = $646.7M). Did I capture your thinking right?", "score": 1, "replies": [{"body": "Also - any evidence that COIN changed their fee structure for trading fees over the L3M? In theory, that could affect the V:R - ie if trading volume fell, but fees were increased enough to offset some of the drop. I don’t think they could get away with a fee hike in a deteriorating market (charging more per transaction), but wondering if you came across anything. Much appreciated!!", "score": 1, "replies": []}]}, {"body": "Never heard back from OP on my f/u questions, welp, but still bought puts 60 11/18 and happyI\n I did 😃", "score": 1, "replies": []}, {"body": "Curious your thoughts on Stablecoin and whether or not the revenue from that will be significant enough to offset losses. I think in the long term we might see COIN do well as interest rates continue to rise", "score": 1, "replies": []}, {"body": "OP fucked us", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Any comments now?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I didn't, I got calls and sold this morning. I bookmarked your post though because it was interesting to see such a wall of text of someone really trying to convince themselves of a dubious position. Unfortunately I think a lot of people believed you.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I thought it would go up! Interest income, maintaining userbase, long term believer in crypto in one form or another. It's a gamble but to some extent everything is. \n\nLong painstakingly performed due diligence doesn't mean much in the end even if it was true because markets can be irrational. Maybe in the course of figuring out where you went wrong, you may consider why you perform and write up such extensive analysis especially since its \"not financial advice.\"", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I know enough to know that I don't know enough to share with the world. Keep at it and good luck to you!", "score": 1, "replies": []}]}, {"body": "PUT YOUR HANDS UP ActualCartoonist3!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "TSLA investors forgetting Elon needs to sell more shares", "selftext": "", "id": "ya5iqx", "created_utc": 1666388295.0, "score": 296, "upvote_ratio": 0.93, "num_comments": 46, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|83|**First Seen In WSB**|6 months ago\n**Total Comments**|1521|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/weqw4k/the_fud_never_ends/) \n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ya5iqx)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ya5iqx)", "score": 1, "replies": []}, {"body": "I love how the majority of this sub was bullish when TSLA was over 1 Trillion market cap and bearish when it’s fallen 400b in market cap. Really puts things in perspective", "score": 60, "replies": [{"body": "Welcome to WSB!", "score": 19, "replies": [{"body": "I thought this was Wendy’s", "score": 3, "replies": [{"body": "No, this is Patrick", "score": 4, "replies": []}, {"body": "Wendy's Shimp Basis", "score": 1, "replies": []}]}]}, {"body": "It's more that the people who thought TSLA was an overvalued fanboy cult stock just didn't say shit while it was still going up.", "score": 8, "replies": [{"body": "I mean, only hourly if you follow the daily thread. There really is a diversity of opinion, but people have been calling for Teslas return from orbit for years. It's never made sense and I think is a biorodict of delusional VC culture.", "score": 2, "replies": []}]}, {"body": "Because there are 12 million people here and most people shut up when they are wrong to avoid heat. It was still a great tool to get rich with but the NOT A CAR COMPANY shit was hilarious.", "score": 4, "replies": [{"body": "Imagine how dumb this is going to read in 5 years.", "score": 0, "replies": [{"body": "Ive heard that sinfe 2014, 15, 16 and 17... 5 years marks keep arriving and yet...", "score": 1, "replies": [{"body": "Are you serious? They were right, dumbass. Lmao", "score": 1, "replies": []}]}, {"body": "Considering tslas growth for the next 10 years was priced in 1 year ago it won't change anything", "score": 1, "replies": [{"body": "What crystal ball did you get your earnings foresight from?", "score": 0, "replies": []}]}]}]}, {"body": "Exactly. This place is full of exactly what they claim to be. They scream it with sarcasm, so others won’t say it with conviction.", "score": 0, "replies": []}]}, {"body": "His perfume sales should cover it.", "score": 10, "replies": []}, {"body": "I just buy more and ignore. It rhymes so it should work eventually", "score": 4, "replies": []}, {"body": "Maybe Tesla can buy Twitter for $69/share so Musk doesn’t need to sell anything.", "score": 7, "replies": [{"body": "SEC won't allow that", "score": 2, "replies": [{"body": "Wish Elon could just buy SEC.", "score": 3, "replies": []}]}]}, {"body": "I see a path where shorts still haven’t closed soo…. More than Saudi A and JP Morgan combined", "score": 4, "replies": [{"body": "\"Not really, but that's alright. Next caller!\" - Jimmy Shill\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}]}, {"body": "TSLA and FB will be holding hands in no time lol 😂!", "score": 1, "replies": []}, {"body": "Apparently they're going to do a $5 billion to $10 billion share buy back in 2023. 🤦‍♂️\n\nTSLA is still way way overvalued imho.", "score": -5, "replies": [{"body": "So a shareholder funded buyout of Twitter while ensuring their daddy stays breakeven?", "score": 6, "replies": [{"body": "Sounds liked it.", "score": 3, "replies": []}, {"body": "If he wanted to do that then the buyback would of happened this year before the new taxes in 2023.\n\nAnnounce buyback to pump, sell to cover twitter at the higher price. It didnt happen tho", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You are missing the point.  He had the cover to do it.\n\nHe didnt.", "score": 2, "replies": []}]}]}, {"body": "If he wanted to do that then the buyback would of happened this year before the new taxes in 2023.\n\nAnnounce buyback to pump, sell to cover twitter at the higher price. It didnt happen tho", "score": 1, "replies": []}]}, {"body": "What we talking about NIO numbers and XPeng in the future ?...ouch", "score": 0, "replies": []}]}, {"body": "So?  Sell shares.  No biggie.  TSLA has no glut problems.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "And then a pump", "score": 0, "replies": [{"body": "Then a bigger dump.", "score": 1, "replies": []}]}]}, {"body": "No he doesn’t", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Not going to happen, he will just have to stop being a threat.", "score": 2, "replies": []}, {"body": "People like you make me want to burn it all down.", "score": 2, "replies": []}, {"body": "The people giving him a loan to buy Twitter is the national security threat. Couldn't they just say that he's still on the hook to buy Twitter but he needs to find alternate funding.", "score": 1, "replies": [{"body": "This thread needs to grow a brain.", "score": 3, "replies": []}]}]}, {"body": "Hahahahahha this made me feel better cause I’m regarded", "score": 0, "replies": []}, {"body": "\"Needs to\" negative. They also have bitcoin to sell, so there is options", "score": -2, "replies": [{"body": "Wouldn’t it be at a loss?", "score": 5, "replies": [{"body": "absolutely", "score": 1, "replies": []}]}]}, {"body": "What if you can see the chick in the red dress and go long until it happens?", "score": 1, "replies": []}, {"body": "What movie this is?", "score": 1, "replies": [{"body": "The Matrix", "score": 1, "replies": []}]}]}
