{"title": "Get Assigned or Roll ? (I want the stock, but feel like it's smarter to roll)", "selftext": "I'm in a difficult situation, I can basically choose to get assigned on my AMD CSP $63 that expires today or roll it to Nov 18 for a credit (I don't know if I want to go with 60 or 65 strike but in both cases it would be for a credit).\n\nThe fact is I am bullish on AMD and feel like getting assigned now would be a good thing (I will have a cost basis of $57)\nAt the same time I feel the smart choice is to roll for a credit untill the credit is substantial and I can get It with 30/45 DTE\n\nSo I want to see your opinions, what would you do ?", "id": "y91wq2", "created_utc": 1666281200.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 43, "comments": [{"body": "I always tell myself that I'll take assignment and shift to CCs but I end up panic rolling the afternoon of.\n\nYou believed in the stock and this strike when you sold it so you *should* take assignment, but I just wanted to be clear that I haven't always followed my own advice.", "score": 10, "replies": [{"body": "Yhea same, it would be easier if I couldn't roll a month out for a good credit then I would just get assigned and be happy with it. Problem is I have the choice and feel not rolling is like wasting it.", "score": 2, "replies": []}]}, {"body": "Hi u/Cris257,\r  \n\r  \nProbably not the answer that's going to help you with today's trade, but my humble advice: define rules and follow them.\r  \n\r  \nI wheel what I think are the best tickers for my portfolio, but delay assignment as much as possible. If I can roll for a credit within my original trading parameters (max 45 DTE), I roll...no debate. I also contemplate rolling out & down for a very minor debit (comissions basically).\r  \n\r  \nThe \"wheel stocks you don't mind owning\", \"rolling is no magic, it's locking a loss\", etc...are a neverending story over here. Come on, we all mind owning falling stocks (so I delay that as much as possible) and rolling -for a credit- helps me taking losses without hesitation, which is the main cause for traders blowing up their accounts. Period (in my case). \r  \n\r  \nSo find rules that work for you (track your performance!!), and follow them. Don't lie to yourself. Forget about the noise. \r  \n\r  \nPD: In this case, I'd roll out and down to 60.", "score": 4, "replies": [{"body": "Actually this is probably the best answer.\n\nAlso I agree with you and would roll in other circumstances for sure, this time I want to be exposed to AMD earnings so I have to factor that in (maybe rolling my put and buying a long dated call). \nI normally follow rules very similar to yours and that's what made me do this post (wanting to roll but also wanting exposure to AMD for it's earnings)\n\nThank you !", "score": 1, "replies": []}]}, {"body": "I wish you had asked this on the morning of 10/7. Gamma makes the roll a lot tighter now. \n\nBe that as it may, I've been in many Reddit fights over what it means to roll.\n\n\"Rolling is just taking a loss! Is an accounting sleight of hand! Either take assignment, or buy to close, give up on the underlying and move to a different trade!\"\n\nHeard it all, couldn't disagree more.\n\nI'm assuming you like AMD long term. Fair enough.\n\nIs this an IRA or non-qual?\n\nYou btc 10/21 $63 for $4.92 and STO 11/18 $60 for $5.30:\n\n1.) If its a taxable account, yes, for IRS purposes you are taking a loss. (I don't know what you originally sold it for... but it's almost certainly a loss). Congratulations, you get to offset some gains. Or, you get to allow it to offset your earnings income if you have more losses than gains this year.\n\n2.) You are increasing your cash position by $38.\n\n3.) You are reducing your purchasing obligation by $300.\n\nThese three facts coalesce to make this roll a win, all day long.\n\nMore cash, lower obligation, tax deduction. Remind me how this is a loss?\n\nUnless you _really_ don't like AMD anymore, then I see no downside to this roll.\n\nAMD goes down further? You'll be glad you did. Saved yourself $338.\n\nAMD goes starts a bull run? The liability of the short 11/18 $60P will drop like a rock, and you'll BTC for much less than you STO'd for. And you'll STO a new put, same date higher strike. Chase it up.\n\nThe art is knowing how far out to go, then if you ought to double down by selling 2 contracts.\n\nHow much do you like AMD? You can roll out to 11/4, 2 contracts of the $57P for 2.73 × 2... $5.46.\n\nMore premium, out of the money entirely, lower basis, but twice the obligation.\n\nBut I would not give up on AMD, and I would sure as hell not take assignment.\n\nGood luck with whatever you do, my friend.", "score": 3, "replies": [{"body": "Quality comment ! \nThank you.\n\nWe think alike and in fact I normally roll in similar situations, but this time I just wanted to be long before AMD earnings so I will take assignment... Maybe I'll just sell a call just before earnings to capture the IV crush", "score": 1, "replies": [{"body": "Okay. You want to be 100 delta going into earnings, and are willing to do so at a $6/ share handicap.\n\nI'm not in love with the idea, but I hope it works out for you.\n\nI've got a short put on AMD as well, but I'm deep otm. Like... my goal is 5% annual return on risked capital type deep. I'll be very cautious until at least after the election.", "score": 1, "replies": [{"body": "Actually I did sell multiple puts on AMD so it won't be a $6 handicap... My cost basis would be $57 if assigned\n\nYhea you are probably older than me and with a much bigger capital, in your position I would be targeting that % too.\nRight now I want to be aggressive and feel like it's ok even if my stocks go down and stay there for a while", "score": 1, "replies": []}]}]}]}, {"body": "This is a mind game. The difference is not what you are saying.\n\nRolling is booking the loss and opening a new position where you pretend that the credit received makes up for the loss\nIt's an accounting trick.\n\nIn the meantime you've extended your investment by another month or whatever for nearly no return.\n\nWhy is this the \"safe\" play?", "score": 3, "replies": [{"body": "Actually it's not true the \"for nearly no return\" I'm actually positive on the trade (my break even is $57), and I'm looking to get assigned sooner or later. I'm just not sure if it's better to roll it down to 60 to get an even better cost basis or just get assigned now to not miss the opportunity.", "score": 1, "replies": [{"body": "It's the same theory.\n\nRolling is closing then opening. There is nothing magical.\n\nSo do you want an option position or a stock position for your NEXT position", "score": 1, "replies": [{"body": "Of course, it's not my first wheel.\nWhat I'm saying is I feel like I'm missing an opportunity not rolling it lower for a credit.\nWould have been easier if it was not possible to roll down and a month out for a credit.", "score": 1, "replies": [{"body": "I guess my point is.... You're not missing that opportunity. It was always there.\n\nIt might seem like a subtle distinction but it's meaningful.\n\nPretend to close your current position.\n\nNow, would you get in at that new strike or would you take the share position?\n\nThe money is the same exact same regardless.\n\nBy thinking that the roll is somehow affording you a new opportunity that didn't exist before you are clouding the truth. That it's all the same in the end. The question is what do you want your new position to be?\n\nThe roll isn't getting you there any differently than just opening a new position.", "score": 2, "replies": [{"body": "The fact is the wheel strategy it's not for going long, it's an income strategy that in the worst case scenario gets you shares of a company you like at a price you like. If we consider this, rolling until reasonable it's the best way to apply the strategy.\nI have to add that in this specific case I want to be long for AMD earnings, so I will probably choose to get assigned or to roll my put but buy a long dated call, or just roll the put out and up.\nI'll think about it.", "score": 2, "replies": [{"body": "Ahh, you didn't mention wheel in original post.\n\nI run the wheel straight up. (Actually double wheel) but I let what will be will be.\n\nI don't roll to stay on one side longer, that would be a wheel with a flat spot!\n\n🤣", "score": 1, "replies": [{"body": "What’s the double wheel?", "score": 1, "replies": [{"body": "[https://media.discordapp.net/attachments/750842185766666280/953367545279303690/unknown.png](https://media.discordapp.net/attachments/750842185766666280/953367545279303690/unknown.png)\n\nGives an extra premium opportunity at the (potential) cost of carrying 200 shares", "score": 1, "replies": [{"body": "So a covered strangle.", "score": 1, "replies": [{"body": "In the middle ya", "score": 1, "replies": []}]}, {"body": "Thank you for sharing this.  I have been doing it, but not realizing it was a strategy.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You can look at it like that. But I feel it's not the better way.\n\nYou're just throwing good money after bad so that in the end the P/L is green at the cost of staying in the same similar position and tying up that capital for the sake of saying you won.\n\nTaking the loss and applying new money  to a better location  is always superior. If that's in the same ticket, so be it.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Right on", "score": 1, "replies": []}, {"body": "Interesting! What’s the one ticker?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "What the fuck are you talking about lol\nNo one said free lunch, also owning 100 shares it's not the same as having a short put.\nPlease go learn a bit better before doing this type of comments.", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Not at all.\nWith 100 shares you are exposed to a bigger loss and unlimited profits. With a short put your max profit is capped, but your max loss is smaller.\nAlso there are a lot of other things to consider, like you know... Theta.\n\nPlease go learn something.", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "At this point you don't deserve a constructive answer, bye.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It depends on whether or not your bias has changed. If you’re bullish neutral, I’d roll it down and out and try for a better price, if you’re full blown bullish, take assignment and sell covered calls. If you’re bearish, exit position.", "score": 1, "replies": [{"body": "Yes the fact is I feel is smarter to roll down and out for a better price but at the same time I might regret loosing this cost basis. I'll probably be thinking about it until the last minute :/", "score": 0, "replies": []}]}, {"body": "What I’ll usually do it continue to roll down and out until I can’t anymore because it’s better to farm extrinsic value which will lower your breakeven than bet on you being able to sell covered calls which will inherently have less collectible value if the stock keeps going down. If I can’t roll down and out, sometimes you could just roll side ways (same strike next expiration) but that depends on how low you’re willing to see the stock go and it’s harder to get out of an ITM option and an ATM one.", "score": 1, "replies": [{"body": "I would generally agree with you, but in this case I feel I want to be exposed to AMD earnings and rolling would give me low exposure. I'll think about it, maybe I can roll the put and buy a long dated call", "score": 0, "replies": [{"body": "I’m always on the side of limiting my exposure around earnings no matter how bullish or bearish I am, but what you are describing is similar to a jade lizard. I like your style.", "score": 1, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}]}, {"body": "Typically you enter a CSP 30-45 days before and with a CSP you are bullish (generally) so when it comes closer to expiration and you have to make that call most will roll out because depending on the delta you didn’t expect to be assigned but here you are. \n\nYou are long term bullish short term bearish because the price of the stock moved down in the time you held the CSP\n\nSo now your like we’ll it could go down even more why would I take assignment now. So your original thesis is now broken. \n\nI’d take the credit keep your cash in a money market fund collecting 2.5 interest and wait and see. Since you end up with a credit you’ll eventual basis will be much lower.", "score": 1, "replies": [{"body": "I did actually do multiple CSP on AMD and now it's time to decide because this is the first time it is ITM at expiration. \nAs I said it would be much easier if it was not possible to roll for a good credit around a month out, I'll just get assigned.\nBut in this case (especially when I did post) the premium for rolling my put lower and a month out was very good, good enough to make me think if it wasn't better to just roll.", "score": 1, "replies": []}]}, {"body": "Why not do both if your cash permits?  By that I mean: take assignment then sell a new put one month out.  You'll have the shares you wanted, and a new CSP if you think the premium is still worth it.", "score": 1, "replies": [{"body": "I don't want to be overallocated on AMD so I have to choose", "score": 2, "replies": []}]}, {"body": "Take assignment and then Sell CCs and use premium to buy Puts till we bottom in case this isn’t it. I love AMD and got assigned at $60 and it’s been almost a year since I could be long it due to excessive valuation. I have a ton of free cash so I’m Selling Puts and CCs right about 5% OTM till I get a full position that fits the size of the other ones in my portfolio. If you don’t have cash on hand then do the above. Basically a Married Put at that point. I only roll if I’m avoiding assignment because I was speculating.", "score": 1, "replies": [{"body": "I didn't roll it, so assignment it is ! \nAlso I will probably sell CCs on it, but not before earnings \n\nDo you use any support/resistance to choose your short strike ? I just went near the money because my initial plan was to be assigned before earnings.\nNow my cost basis will be $57 and I like it.", "score": 1, "replies": [{"body": "No on something like AMD I want to own I do weeklies. Stocks move too much on monthlies to predict. Since the market is in a downtrend I’ll Sell my CCs at 5% above my cost basis so if it runs I make money and can Sell Puts back at my cost basis. For now I have a quarter position so I’ll Sell weekly Puts 5% OTM till I get assigned which will bring me to a half position then I go 10% OTM till assigned then my goal is to wait to buy the last quarter till we get the all clear or something drastic happens. I’m hoping to get a full position around $40 if inflation persists a few more months. If not I’ll just keep buying shares with the premium I receive from the CCs and CSPs till we actually bottom. Im never in a hurry I’ve waited 4-6 months many a time before averaging down.", "score": 2, "replies": []}]}]}]}
{"title": "the future of #tesla ....", "selftext": "", "id": "y8j13a", "created_utc": 1666225385.0, "score": 4, "upvote_ratio": 0.62, "num_comments": 44, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 day ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|1 day|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y8j13a)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y8j13a)", "score": 1, "replies": []}, {"body": "Feels bad man. Elon keeps popping up in too many extracurricular activities for comfort if ur a pickin up what I’m a puttin down.", "score": 8, "replies": [{"body": "Also they say he needs to sell a few billion more Tesla stock to finance his twitter purchase.", "score": 7, "replies": [{"body": "Guess these 1.67$ strike puts r gonna print...", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 8, "replies": [{"body": "He is slowly ostracizing himself and his brand from the public psyche. Why would you buy a weird car from a crazy guy when you could just plug your ford in?", "score": 10, "replies": [{"body": "Agreed. The dude is toxic. I’d love an EV but absolutely never a Tesla", "score": 3, "replies": []}, {"body": "Not slowly, at all. This guy blows", "score": 1, "replies": []}]}]}]}, {"body": "Everyone seems to have forgotten that the car business is a terrible one, and the EV business will be the same. Super competitive and low margins. So all these ridiculous valuations for EV companies will come back down to earth.", "score": 12, "replies": [{"body": "They bought into this idea that he was going to create subscription cars and revenue streams for your car though autonomous driving. \n\nEnd of the day it’s a shitty car company and maybe a shitty taxi cab company and it will be worth Toyota and Uber combined, at best.\n\nAnd the crazier Elon gets the more chance we have of him imploding in spectacular fashion.", "score": 5, "replies": [{"body": "Yea it's sad.\n\nThey always get angry too. The stock market is un-hinged due to the zero educated newcomers style of \"investing\".", "score": 3, "replies": []}, {"body": "Agree overall with the gist. But pushback on the autonomous driving. It would be a game changer. It sure as fuck won't happen at tesla and jury is out whether it is even technically possible with an acceptable  amount of safety.", "score": 3, "replies": []}, {"body": "Oh he’s going to implode. A lot things won’t age well. Including Tesla", "score": 1, "replies": []}]}, {"body": "But but but tesla's not just a car company! \n\n--tesla fanbois", "score": 2, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I never understood this. I always asked k what else are they selling ?", "score": 1, "replies": []}]}]}, {"body": "Elon is broke and thought his tsla money printer would forever brrr", "score": 6, "replies": [{"body": "Good thing he will be buying the absolute goldmine that is twitter! /s", "score": 8, "replies": [{"body": "It might be better than buying a literal gold mine?", "score": 3, "replies": []}, {"body": "At a good price", "score": 1, "replies": []}, {"body": "Does he still have to buy it if he becomes an enemy of the state. He does have rockets. I’m not suggesting he will go that far but if he’s mentally Ill and under a lot of stress. And has access to rockets gps and rocket fuel. Idk I m a bit scared.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "Puts", "score": 2, "replies": []}, {"body": "I’m long.  Cars is a small part of the company.  Tesla is a technology company, like apple, not a auto maker.  Cars just happen to currently be the main product.  \n\nThe Optimus program has the potential to grow legs.  I’m gonna take a chance and ride it out.  \n\nBut tomorrow is gonna hurt.", "score": 0, "replies": [{"body": "Cars are basically the only part of the company. Everything else is a sideshow and Optimus is pretty clearly another half baked idea that’s going nowhere.", "score": 7, "replies": [{"body": "You’ve got your opinion and I have mine.  Musk isn’t the genius some people make him out to be, he is a bit of a clown show sometimes but he has surrounded himself with very smart people.  And I’m invested in them more than anything else.\n\nLots of good stuff in solar and stored energy that has a solid footing in the marketplace.  And the cars really are the top of the ev market with lots of room to grow.  \n\nMeanwhile he’s got other projects like Optimus that can possibly turn into something.\n\nThe twitter thing is a fucking mess and it’s going to hurt him but Tesla can survive it and prosper.", "score": -1, "replies": [{"body": "You think smart people have stuck around for his antics, sudden firings, department liquidations, wild E-Mail overnight policy shifts, uncontrolled twitter drama, peer pregnancy scandals, etc etc? No. They vest and bail.", "score": 6, "replies": [{"body": "Yep, I even know some of them.  Look at shotwell.  She came to SpaceX when everyone thought Elon was a crazy idiot.  I think things have gone pretty well for the two of them.", "score": 0, "replies": [{"body": "SpaceX isn’t exactly doing great as a company, you know that right? Every few months he sends an email telling all the staff they’re teetering on bankruptcy and Starlink has no conceivable business model that makes it profitable.", "score": 2, "replies": [{"body": "Well you’re in the right Reddit for a regard.", "score": 4, "replies": []}, {"body": "Almost seems your DD is based on your feelings...", "score": 2, "replies": []}, {"body": "Well you’re in the right Reddit for a regard.", "score": 1, "replies": [{"body": "Rockets doing backflips doesn’t actually generate any money. News at 11.", "score": 7, "replies": [{"body": "LOL, you think there is no market for space flight!  You really are regarded!!!!  What did you think of the Wright Brothers stupid idea for an aero plane?", "score": 1, "replies": [{"body": "Did Elon invent space flight or something? He is just another player in a kind of crowded market and he’s betting the rocket farm on Starlink.", "score": 2, "replies": [{"body": "Lol, tell me you’re a troll without saying your a troll.", "score": 0, "replies": [{"body": "What am I saying that’s wrong exactly?", "score": 2, "replies": [{"body": "Other than all of it?  \n\nWe have a difference of opinion about the company.  You seem to be pushing me away from Tesla very hard.  What do you care if I lose money on a crackpot?  \n\nOr is it you want to be right and can't handle that anyone would disagree.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "A con would imply there was nothing there.  Tesla cars are real and they are for the most part are good reliable cars.  They have problems here and there but are no more than any other car manufacturer.  I prefer my Tundra and Corvette right now.  But Tesla is a real product that people buy around the world.  \n\nNo con here, but certainly Musk could cut back on some of the theatrics.", "score": 1, "replies": [{"body": "People don’t seem to get it even though Elon has said it over and over. The company is FSD, not the car. FSD has been way oversold, and without it Tesla is Toyota with a 7x P/E which means a 20-40 stock price.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Yep, smart people have what we in Wsb call, options baby, sir this is a casino", "score": 1, "replies": []}]}, {"body": "He’s burning out those smart people. It’s unfortunate how toxicity kills innovation faster than I can fart after eating Taco Bell", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Elon Musk says Tesla (TSLA) could soon be worth more than Apple (AAPL)", "selftext": "", "id": "y8qqz6", "created_utc": 1666248101.0, "score": 11, "upvote_ratio": 0.65, "num_comments": 43, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 week ago\n**Total Comments**|5|**Previous DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=y8qqz6)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=y8qqz6)", "score": 1, "replies": []}, {"body": "Elon is the most blatant stock manipulator of our time. And he gets away with it every single time.", "score": 43, "replies": [{"body": "I don’t think it will continue. He used to be a quirky rich guy but his political statements are painting him in a villain light imo", "score": 3, "replies": []}]}, {"body": "and i say i will be worth more that those two shity companys combined. does it make it true?", "score": 11, "replies": [{"body": "How can I buy shares of you?", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4641)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4887)", "score": 6, "replies": []}, {"body": "\\*\\*Waits for all the fanboys\\*\\* -  \"But Tesla is NOT a car company\".  \n\n\nApple could buy Tesla outright with the loose change they have in their company coffers.", "score": 16, "replies": [{"body": "Might be a good time for Tim Apple to make an offer….say, $54.20 per share?", "score": 10, "replies": [{"body": "You mean Tesla pays apple 52 a share", "score": -5, "replies": []}]}]}, {"body": "He is pumping because he needs to sell 4 billion for twitter.", "score": 3, "replies": []}, {"body": "I think we're seeing the emergence of a new class of people: Teslatards", "score": 6, "replies": []}, {"body": "[removed]", "score": 5, "replies": [{"body": "So solar cells, power management, and supercharging aren't products that work together with electric cars?\nAlso, cars are a much bigger investment for households ($30k - $200k) than computer products ($500 - $50k). The enterprise market for Tesla may be better than Apple as well.", "score": 3, "replies": [{"body": "To get to apples arena try reaching over 1 billion consumers first.", "score": 3, "replies": [{"body": "Well that was the growth case Elon talked about on the call. Only ~1% of the global fleet is electric at the moment. No other manufacturer is close to Tesla's scale.", "score": 2, "replies": []}]}, {"body": "Difference is that apple actually makes money on those tertiary products instead of losing it", "score": 5, "replies": [{"body": "Those tertiary products help build an ecosystem/moat for Tesla products. Government initiatives like the Inflation Reduction Act will drive demand for Tesla products.", "score": -1, "replies": [{"body": "Probably not a good product if it’s success relies on outside incentives.\n\nVs a product like the iPhone where everyone *has* to have it even though it’s ridiculously priced and relies on no incentives", "score": 4, "replies": [{"body": "When the iPhone first came out, carriers subsidized the cost of the phone in case you don't remember. \n\nOutside incentives are there to nudge consumers to make choices that benefit the general population instead of self-interest.\n\nEdit: The only reason people HAD to have iPhones was when they introduced iMessage and the blue chat bubble between iPhones and Apple devices. Tesla does the same thing with the supercharger network, but obviously is higher-minded than Apple for desiring an open network where any electric vehicle can charge.", "score": -1, "replies": [{"body": "No they didn’t… they folded the cost of the phone into your plan via financing haha. No one ever got a free lunch on a phone plan.", "score": 1, "replies": [{"body": "They folded the cost of the phone into your plan via financing? No, they sold you a data plan that was required to use the iPhone to its full potential. Anyways, the iPhone was not a positive externality like a Tesla is.\n\nRead this about Apple's subsidy:\nhttps://money.cnn.com/2012/02/08/technology/iphone_carrier_subsidy/index.htm", "score": 0, "replies": [{"body": "You realize the carrier is paying the cost up front and downloading to consumer right? \n\nWhich is completely different than the tax payer funding a government subsidy.  There is no comparison here", "score": 2, "replies": [{"body": "The nature of the subsidy does not matter. Carrier subsidizes phone for you and you pay the carrier through your increased phone plan costs. Government subsidizes car for you and you pay through your taxes. \n\nOnce again, obviously the government wants to encourage the positive externality that is electric vehicles. Both for climate change mitigation and higher energy independence.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Tesla has not the quality to have loyalty customer like apple.", "score": 4, "replies": [{"body": "Apple doesn’t have loyal costumers. Apple has addicted costumers that need the products. Once you get in the apple eco system it’s impossible to get out without major head aches and withdrawls. Once you go apple you never go back. It’s the bbc of consumer products.", "score": 5, "replies": [{"body": "bbc implies they enjoy it. Once they realize apple products are overhyped devices which don't perform any better than other phones/laptops/$20 air pods you can find on amazon, people will easily go back. It's just a matter of consumers growing up and trying new things like I did", "score": 2, "replies": [{"body": "You know what people and water have in common?  They take the path of least resistance even if it seemingly makes no sense and there are better options.  Companies know this.  People used to get a Gillette razor and pack of Marlboro cigarettes on their 18th bday.  Think the companies were trying to be nice?", "score": 2, "replies": [{"body": "Key word \"used to\". Nobody is paying me or giving me a gift to be on reddit/wsb except that it's addicting but also I can find new information. Same with google searches. Same with computers. \n\nTimes are changing and people are wising up. Likewise, even the average hip person would rather have $5k saved up for emergencies rather than wear the new supreme brand clothes.\n\nIt's not about least resistence to fun device anymore, it's about least resistence to fun life and that includes not wasting money on overpriced brand items to fuel things like owning your own home and going on a trip", "score": 2, "replies": [{"body": "My guy I'm the same way but you know what the kids refer to as a green bubble?  If not check it out.  Apple has the next generation on lock like few others possibly could", "score": 3, "replies": [{"body": "Well I dont disagree with that considering how much younger people can be glued to tiktok\n\nLike im not anti new age but the trends are definitely there", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Well one bedazzles old android tech and one is flying to other planets so...", "score": 1, "replies": []}, {"body": "Ye it’s true. It’s true like „go in the casino, u could win the jackpot", "score": 0, "replies": []}, {"body": "Yeah, and I tell my virgin gf that my D is bigger than anyone elses D. Blatant lie though", "score": 0, "replies": []}, {"body": "Musk can't keep getting away with his stock pumping scams. Is the SEC just toothless?", "score": 0, "replies": []}, {"body": "Where is electrek getting that Elon said it would be \"soon\"? He said it would be very difficult, require a lot of hard work and luck.", "score": 1, "replies": []}, {"body": "doubt", "score": 1, "replies": []}, {"body": "Old mate says a lot of shit. A fraction of it is correct- at the time or proven to be correct in time - but that’s all the Cult of Elon remembers", "score": 1, "replies": []}, {"body": "How course! Just like share buy backs.  It's all hype with this", "score": 1, "replies": []}, {"body": "When Tesla releases an ecosystem of mobile computers that are more powerful and popular than the iPhone, Apple Watch, AirPods, and soon to be released MR glasses then I'll believe him.", "score": 1, "replies": []}, {"body": "Real fucking shame he just sold all those shares.", "score": 1, "replies": []}, {"body": "Not if Apple start making cars. Oh wait. Foxconn is making cars. Hmmmmm", "score": 1, "replies": []}, {"body": "If my aunt had balls, she’d be my uncle.", "score": 1, "replies": []}]}
