{"title": "Visualizing the longest bull markets of the modern era", "selftext": "Graph of this issue:\nhttps://pbs.twimg.com/media/Df-Pag6W4AEj8Fi.jpg\n\n\nDuring the longest bull market in modern history, the S&P 500 surged a whopping 418% over the 9.5 years between November 1990 and March 2000.\n\n\nThis was during the famous economic expansion that took place during the Clinton era, in which job growth was robust, oil prices fell, stocks soared, and making money was as easy as throwing it in the stock market.\n\n\nIn mere months, this famed bull market may lose its title as the “longest” in the modern era.\n\n\nThat’s because, according to data and analysis from LDL Research, the current bull market will take over the claim to fame in late August 2018.\n\nBy looking at duration, total rate of return, and annualized rate of return, it really gives a sense of how these bull markets compare.\n\nThe current run, which will soon become the longest, didn’t have the same level of intensity as other high-ranking bull markets. Critics would say that it was artificially propped up by ultra-low rates, QE, and other government actions that will make the market ultimately less robust heading forward.\n\nRegardless, the current run ranks in fourth place among the markets above in terms of annualized return.\n\nWhat Ended Each Bull?\n\nThe market psychology behind bull and bear markets can be fascinating.\n\nBelow we look at the events credited with “ending” each bull market – though of course, it is actually the actions of investors (buying or selling) that ultimately dictates market direction.\n\n1. The Great Expansion\nThe bull run lasted 9.5 years, ultimately capitulating when the Dotcom Bubble burst. From the span of June 1999 and May 2000, the Fed raised interest rates six times to try and get a “soft landing”. Market uncertainty was worsened by the 9/11 attacks that occurred the year after.\n\n2. The Post-Crisis Bull Run\nStill ongoing…\n\n3. The Post-War Boom\nThis boom occurred after WWII, and it ended in 1956. Some of the sources we looked at credited the launch of Sputnik, Eisenhower’s heart attack, and the Hungarian Revolution as possible sources of market fear.\n\n4. That ’70s Growth\nThe Iranian Revolution, the 1979 Energy Crisis, and the return of double-digit inflation were the factors blamed for the end of this bull.\n\n5. Reagan Era\nThis bull market had the highest annualized return at 26.7%, but the party came to an end on Black Monday in 1987 – one of the most infamous market crashes ever. Some of the causes cited for the crash: program trading, overvaluation, illiquidity and market psychology.\n\n6. The Hot Aughts\nStocks did decently well during the era of cheap credit and rising housing prices. However, the Financial Crisis put an end to this growth, and would cut the DJIA from 14,000 points to below 6,600 points.\n\nHow long do you think the current bull market will continue?\n\n", "id": "8s1pex", "created_utc": 1529345637.0, "score": 196, "upvote_ratio": 0.85, "num_comments": 53, "comments": [{"body": "You should give these guys credit for their graph, they do amazing stuff;\n\n[http://www.visualcapitalist.com/visualizing-longest-bull-markets-modern-era/](http://www.visualcapitalist.com/visualizing-longest-bull-markets-modern-era/)", "score": 95, "replies": [{"body": "OP did the same thing over in /r/investing, not only did they not bother to give credit or provide a link, but they butchered the graphic too.", "score": 44, "replies": [{"body": "What the shit! Why did OP not just link the awesome site instead of copying/pasting their whole great writeup here making it look like he had some thoughts of his own?\n\nShame, shame, shame....", "score": 6, "replies": [{"body": "And now the authors don't get any traffic to a great blog article. Damn I haven't see OP fuck up this bad in days, reset the counter..", "score": 1, "replies": []}]}]}]}, {"body": "Although I'm unsure of the hype about a \"trade war\" actually happening, if it did seems that would be the likely candidate right now. combined with high consumer debt/ generally low savings could put a big strain on the economy", "score": 23, "replies": [{"body": "I think we're not seeing a major hit to the market because people trust that this trade war is just sabre rattling and will go away. But tarrifs are expected to go into effect this July. And they are huge tarrifs on all sides. I think people are delusional to think this won't have a bigly effect on the market and economy as a whole. ", "score": 20, "replies": [{"body": "I agree, if the tariffs go through it will be a big deal. I also would bet it is going to happen. Been shifting more and more to a cash position, don't know if that's the right move but there seems to me to be a lot of downside risk here, with little upside.", "score": 10, "replies": [{"body": "May I ask how it will be a big deal when China accounts only 3% of our economy? [Serious question]", "score": 4, "replies": [{"body": "Consumer goods become more expensive, and company profits go down. [Campbell's Soup](https://www.cnbc.com/2018/05/18/commerce-secretary-ross-claim-that-tariffs-wouldnt-hurt-campbells-soup-just-blew-up.html) is an example.", "score": 4, "replies": []}]}, {"body": "Agreed. ", "score": 2, "replies": []}, {"body": "Agreed. Unstable times. So much for #MAGA ...RIP.", "score": -3, "replies": [{"body": "[deleted]", "score": 4, "replies": []}]}]}, {"body": "The tariffs instituted are balancing measures. Start thinking about which companies should benefit and get in on the ground game. If you haven't noticed the US is shutting down Bretton Woods and all that entailed. We are bringing manufacturing back; so look to domestic producers, China cannot ship a ceiling fan to the US without our guaranteed safety of shipping lanes. The US is slowly realizing we don't need the rest of the Globe.", "score": -4, "replies": [{"body": "I think you are 100 percent wrong, and I hear most economists agree with me, These tarrifs will ultimately shoot the US in the foot. America is not realizing they don't need the rest of the world, the world is realizing they don't need America. I anticipate dark times in the near future for us. And the impact of us alienating our closest allies will have lasting effects even after this dumbass leaves office. ", "score": 4, "replies": [{"body": ">America is not realizing they don't need the rest of the world\n\nTh.. they aren't?\n\n>the world is realizing they don't need America\n\nTh.. they are?", "score": -1, "replies": [{"body": "Did I stutter? \n\nNo, but I guess you did. Quite the cognitive issue to have via keyboard!", "score": 3, "replies": [{"body": ">but I guess you did\n\nI... I did?", "score": 1, "replies": [{"body": "[T...t...t...today Junior!](https://media1.tenor.com/images/39df5ef46e275407ebc3d60ce49104be/tenor.gif?itemid=3427680)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I can only imagine that high leveraged households have less disposable income because they are servicing large loans and it puts a sizeable dampener on their spending. That seems to be happening in my neck of the woods. ", "score": 8, "replies": [{"body": "Correct. Assuming consumers are responsible (big assumption) they will spend less when there’s nothing in their savings accounts. When people have enough in their savings to feel comfortable, they’re much more inclined to eat out, buy TVs, go to concerts, travel, etc etc", "score": 3, "replies": []}]}, {"body": "Funnily enough, just finished my a2 economics exam and remember writing about the Harrod Domar model.", "score": 3, "replies": []}, {"body": "really? you dont see how in a downturn people not having money and being highly leveraged could be a bad thing?", "score": 2, "replies": []}]}, {"body": "Listening to a podcast this morning and trump said in the 80’s and 00’s that America is getting the short end of the stick. I would bet it happens, it’s just when. Trump has literally talked about this for decades", "score": 2, "replies": []}]}, {"body": ">Some of the sources we looked at credited the launch of Sputnik, Eisenhower’s heart attack, and the Hungarian Revolution as possible sources of market fear.\n\nSeriously? Sputnik wasn't launched until nearly a year after August of '56, Eisenhower's heart attack took place over a year earlier and and the Hungarian Revolution wasn't until late October of '56 and lasted less than 3 weeks before returning to the status quo that existed before. \n\nHowever,it's interesting to note that Egypt nationalized the Suez canal in July of '56 which brought on the 2nd Arab-Israel war as well as GDP that peaked at just over 7% in '56 and dropped to just over 2% the following year ", "score": 7, "replies": []}, {"body": "Another 10 years", "score": 24, "replies": [{"body": "Ya we’ve had some corrections the last 8 years that the others bull markets didn’t have.\n\n2011-12 was a shitty year, 2015,2016 two 14% corrections, and this last one. The SP hasn’t even got new highs yet ", "score": 12, "replies": []}, {"body": "Extremely unlikely ", "score": 7, "replies": [{"body": "But not impossible.", "score": 20, "replies": [{"body": "Of course, anything is possible. ", "score": 1, "replies": []}]}, {"body": "black swan", "score": 2, "replies": []}]}]}, {"body": "I dont think we'll have a recession as everyone freaks out about - most likely just lower rates of returns the next 5 years (5-6% vs 10%). My guess is as good as any other. ", "score": 7, "replies": []}, {"body": "I think we found the guy shorting the S&P", "score": 3, "replies": []}, {"body": "This poster is the    bullmarkets.com douchebag", "score": 1, "replies": []}, {"body": "We’re going to have a pause in 2020 and depending how the market views the outcome of that election, that will determine what happens.", "score": 0, "replies": [{"body": "Kind of like how everybody said a Trump presidency would tank the markets?\n\n....But it didn't", "score": 15, "replies": [{"body": "We'll see how good the market is doing at the end of the year.  If Trump continues to get his way, we could very well be in full on trade war.  I personally know smaller businesses that are already feeling it.  History will tell.", "score": 1, "replies": [{"body": "How do smaller businesses get impacted? They don't trade with international partners as much as mid-large cap stocks. The Russell 2000 is killing it this year.", "score": 4, "replies": [{"body": "Smaller businesses that use steel parts to make their products", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I'm not just talking about small caps generically.  I'm talking about steel tarifs.  The increased prices, price volatility, and shortage are hurting smaller companies that use steel parts.  It could just be growing pains, but if a full on trade war ripples into other industry we could see far larger problems.", "score": 2, "replies": []}]}]}, {"body": "I didnt hear anyone say a Republican in office would lower confidence for corporations? Youre getting the economy and the stock market mixed up, they dont always mirror each other.", "score": -4, "replies": [{"body": "Here is one from CNN \"A Trump win would sink stocks. What about Clinton?\"", "score": 7, "replies": []}]}, {"body": "Well sure never said that.  I argue with my liberal friends about how the market took off soon as he got elected.  Like you can actually see it on the chart but “that’s Obama’s economy”  \n\nIf dude isn’t elected again we might see a down turn.", "score": -5, "replies": []}]}]}, {"body": "Sorry but can someone ELI5 a bull market?\n\nedit: I got it, I got it, jeez. It's an easy concept. I thought it's more complex.", "score": -5, "replies": [{"body": "It's where people trade bulls, the male uncastrated bovine.  We generally consider the market to be doing well when the bull market is trading excessively.  It means a lot of beef producers are getting their money back when they sell their product.\n\nIn contrast, a bear market happens when people stop consuming beef.  In those situations governments often start propping up local circus (and bread producers).  This causes a boom in the bear sales along with a decline in the bull market.\n\n/s", "score": 23, "replies": [{"body": "This explanation is economically sound", "score": 4, "replies": []}]}, {"body": "Google it.. it’s like going into a fish subreddit and asking what swimming is ", "score": 30, "replies": []}, {"body": "It can be a whole event or just one auction within a larger event. But the ELI5 is when farmers get together to sell their bulls, which only happens so often due to birthing and seasonal cycles, they call it a bull market. You may have heard of a bear market too.. same thing just with bears. Key takeaway though is you never can host a bear and bull market together, as that's too much animal for one area ", "score": 4, "replies": []}, {"body": "Shit goes up.  ", "score": 5, "replies": []}]}, {"body": "Can you still call it a bull market if the Dow is down 6.4%, S&P 500 is down 2.3% over the past five months? To be fair, the NASDAQ is up 3.2% since the peak of the other two, January 26.", "score": -6, "replies": [{"body": "Only with the benefit of hindsight! Sort of like recessions, they're best seen in the rearview mirror.", "score": 6, "replies": []}, {"body": "Nice cherry picking the DOW; when Trump was elected the Market reached all time highs. Now it is resettling and you give us the last five months. For a solid year we reaped the benefit and you're going to attempt to disparage the US economy by only including the last five months. You know that terrorists have hardly killed anyone statistically if you start counting 9/12/01. ", "score": -1, "replies": [{"body": "Sorry you're butthurt and think I've disparaged your God Emperor, but my question is, is it still a bull market if it's been lower than the peak for 5 months? It's not cherry picking, because the peak was 5 months ago. There's nothing political about that, it's just a fact.\n\nTo me it looks like a correction for the previous irrational exuberance that especially characterized the last few months of 2017. In that case it might still be a bull market, a continuation of the Obama bull run that paused during the election campaign.\n\nBut technically speaking, is it still a bull market now, even when it's mostly going sideways?\n\nSince you seem to not know where I got this data, here's [a link to the DJIA](https://www.google.com/search?q=dow+jones&oq=dow+jones) and the [S&P 500 index](https://www.google.com/search?q=s%26p+500).", "score": 1, "replies": []}]}]}, {"body": "This bull market will end when Trump has done enough to stop it.", "score": -1, "replies": []}]}
