{"title": "Alright enough is enough. ZM puts back on", "selftext": "9% on no news? \n\nIt’s a fucking video chat! Half the users don’t pay for it they have a ton of competition from the big boys. Microsoft. Google. Even fucking Facebook\n\nYes schools are going online. So what. They won’t all chose zoom. Also zero chance they are able to grow at the same rate. They pull it all forward \n\nI think it goes back to 200 after earnings \n\nAny zoom bulls out there able to justify this price ?", "id": "huxabs", "created_utc": 1595291130.0, "score": 11, "upvote_ratio": 0.72, "num_comments": 80, "comments": [{"body": "Like my boy Chimpu said the other day, remember that you aren't here to be right, you're here to make money", "score": 15, "replies": [{"body": "End is near for this shit product", "score": 0, "replies": [{"body": "Post your loss porn before you long ROPE", "score": 10, "replies": [{"body": "Zoom is literally fucking garbage. You’ll long rope if you hold calls", "score": -1, "replies": []}]}]}]}, {"body": "Puts - are really bad idea on this bullish stock.", "score": 22, "replies": [{"body": "Bullish until it’s not. Has nothing going for it besides a fucking FaceTime that no one pays for", "score": -2, "replies": [{"body": "FaceFuck Time. Interesting, I like it", "score": 3, "replies": []}, {"body": "So why would you bet against it if it keeps going up on nothing? Your going to lose over and over trying to time the cliff", "score": 5, "replies": []}, {"body": "Do people pay for FaceTime?", "score": 2, "replies": [{"body": "No", "score": 0, "replies": [{"body": "Then your comment was retarded", "score": 5, "replies": [{"body": "You’re a fucking moron people buy the iPhone for a lot more than FaceTime. Why the fuck would you buy zoom? Your comment makes no sense dummy", "score": -6, "replies": [{"body": "You're full on angry retard it seems. Good luck with with that", "score": 4, "replies": [{"body": "People pay $1000+ to have FaceTime on their phone.", "score": 1, "replies": []}, {"body": "😂at you realizing you’re a moron. It’s ok kiddo you get older and wiser", "score": -6, "replies": [{"body": "You're just angry your retard ZM puts have killed your account when even 14yr olds are making money.", "score": 8, "replies": [{"body": "You’re 14 oh man go back to school kiddo 😂😂", "score": -4, "replies": [{"body": "You lack comprehension and use emojis like a teenager would.", "score": 1, "replies": [{"body": "Aww guess you’re not looking forward to a school year on zoom huh kiddo", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "👍", "score": 0, "replies": []}]}]}]}, {"body": "I can see you don’t do corporate meetings with over 85 people....", "score": 1, "replies": [{"body": "I do. Our company isn’t autistic though and we use Microsoft teams :)", "score": 1, "replies": [{"body": "My company uses both, but tends to use zoom for larger meetings with over twenty people or for company wide broadcast meetings.", "score": 2, "replies": []}]}, {"body": "No I don’t. Not many people do you’re in a huge minority", "score": -2, "replies": []}]}]}]}, {"body": "Also, as someone who uses it every day, the product is trash.", "score": 17, "replies": [{"body": "I use teams for work it’s so much better", "score": 5, "replies": [{"body": "I have used teams and also frequently use Webex from Cisco. Zoom is fucking terrible", "score": 7, "replies": [{"body": "Yup that’s why they are trying to do something else quickly. But a fucking tablet? Give me a fucking break", "score": 3, "replies": [{"body": "I mean buy long dated puts and short dated calls as a hedge and you can just cash out any profitable calls to buy more puts 😂", "score": 2, "replies": []}]}]}, {"body": "i disagree, but whatevs", "score": 1, "replies": []}]}, {"body": "At least 90% of the products sold at WMT are trash too, but people still buy them. You have to use whatever some corporate fuk boi tells you to use.", "score": 1, "replies": []}]}, {"body": "Don't touch ZM puts. I'm a victim. It will win. You will lose.", "score": 9, "replies": [{"body": "Same here. I still have an August 190 left. But need to do another one. This thing will crater after earnings", "score": 2, "replies": []}, {"body": "You want to start a support group built on the ashes of my many ZM puts?", "score": 2, "replies": []}]}, {"body": "You have to wait out the FOMO and dipshits.  It's a great idea to put.  But everyone loves this stock and buys it.  It is a horrible business model.  That is why it will take 4-16 mo's to prove this out.  It's about timing, you can't buy short term puts into a shit company while everyone is buying it thinking it will make money hand over fist until this shit subsides.  Let it ride up into fall and covid starts to subside, then make your move.\n\nYou are correct, but have to wait until everyone sees it.  I see great FOMO's on here all the time, but the timing is awful because they are using reasonable assumptions.", "score": 4, "replies": [{"body": "True and IV on puts is nuts so the premium would bleed off for a long while on puts right now", "score": 1, "replies": []}]}, {"body": "ZM must be the real cure for Corona. Jesus tittyfucking christ today sucked donkey-dick on a pogo-stick. \n\nIt was overpriced at 200 a share, but apparently nobody cares and everything is random.", "score": 3, "replies": [{"body": "Yup. Huge pump / short squeeze. It’s gonna be an epic tumble", "score": 1, "replies": [{"body": "If they don't correct a fair bit over the next couple days I'm gonna have to pimp out my German Shepherd to furries to buy food \n:\\", "score": 2, "replies": [{"body": "😂😂", "score": 1, "replies": []}]}]}]}, {"body": "I sold my position today. This stock scares the hell out of me. I can’t pinpoint it’s actual value at all. Could go to $350, could go to $100. Either way, I don’t think it’s worth the ulcers being in it anymore.", "score": 3, "replies": [{"body": "Good exit. It’s value is $100 if that", "score": 1, "replies": []}]}, {"body": "Stop trying to throw yourself in front of the nearest freight train. Trade what the market is doing or just don’t trade. Fundamentals have literally nothing to do with short term options trading.", "score": 4, "replies": [{"body": "Ain’t this the truth!", "score": 1, "replies": []}, {"body": "I’d buy a winter put if I moved enough money to actually buy one at this point", "score": 1, "replies": [{"body": "That’s dumb. You’re just gonna bleed out waiting. It could go to 400 and then crash and you still won’t be up. Stop letting your fantasies about what you think the market should do get in the way of making money.", "score": 1, "replies": [{"body": "lol nah they report in September. They. Be down like 20% on those earnings then will decline from then", "score": 1, "replies": [{"body": "Fine, learn the hard way. All you post on here about is 1) why whatever stock is too high and 2) your puts expiring worthless. Toss another couple thousand out the window and see how you feel.", "score": 1, "replies": [{"body": "My latest all hit. Bought mrna puts and Nio jmia calls on Friday", "score": 0, "replies": [{"body": "I’m sure you’re doing great YTD then", "score": 1, "replies": [{"body": "Still got a lot of contracts out there. Puts Are still in play", "score": 1, "replies": [{"body": "‘Still in play’ is something people only say when they know they’ve made a mistake and they’re just hoping it can be salvaged", "score": 1, "replies": [{"body": "Lol it’s the stock market. Everyone makes mistakes 🤦🏻‍♂️😂", "score": 1, "replies": [{"body": "Hopefully not the same ones over and over", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Zm is my favorite type of ice cream flavor", "score": 2, "replies": []}, {"body": "Puts for the long term, like a year or so out. Problem is, these quarter earnings might actually be decent for them.", "score": 2, "replies": [{"body": "They can’t. Only reason they popped was rate of growth cause literally everyone got on zoom. But now that no one is using it that Growth is gonna be nothing", "score": 3, "replies": [{"body": "!RemindMe 4 days", "score": 1, "replies": [{"body": "There is a 23 hour delay fetching comments.\n\nI will be messaging you in 4 days on [**2020-07-25 04:58:37 UTC**](http://www.wolframalpha.com/input/?i=2020-07-25%2004:58:37%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/huxabs/alright_enough_is_enough_zm_puts_back_on/fyqj7az/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhuxabs%2Falright_enough_is_enough_zm_puts_back_on%2Ffyqj7az%2F%5D%0A%0ARemindMe%21%202020-07-25%2004%3A58%3A37%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20huxabs)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}, {"body": "I'm with you on this one, this company has retard strength. It might hit 100B market cap and chill, but I don't want to be right they suck.", "score": 2, "replies": []}, {"body": "Dude I was looking for you, and here I found you.  Those MRNA puts were looking good until they shut down trading.  You still holding?    Trying to decide if I should sleep in tomorrow and should just hold til expiration on Friday for 75 and 65 p.", "score": 2, "replies": [{"body": "I’m gonna hold mrna til Friday most likely to c how it goes. But yah this zoom thing is dumb strong I need to not hate buy puts. I’ll probably buy once they break and hold below 250. That should signal the retraction down", "score": 1, "replies": []}]}, {"body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=huxabs&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=huxabs&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=huxabs)\n___\n ^comment ^will ^disappear ^--- ^20 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 1, "replies": []}, {"body": "Dont go bullish till it validates out", "score": 1, "replies": []}, {"body": "i started believing in ZM once i heard the public referring to conference calls as ‘zoom calls’, just as they refer to searching as ‘googling’, or to video games as a ‘nintendo’ \n\nnot just random people; TV anchors and radio presenters haven’t stopped saying it \n\nand now, if i’m a random consumer wanting to host one of these ‘zoom calls’, where am i gonna go? 🤓", "score": 1, "replies": [{"body": "Ugh again those are all free accounts", "score": 1, "replies": []}]}, {"body": "markets can stay irrational longer than you can stay solvent", "score": 1, "replies": [{"body": "Oh man I’ve never heard that. Thanks !\n\nI have zoom puts. So yes I already know this", "score": 1, "replies": []}]}, {"body": "How much did you lose", "score": 1, "replies": []}, {"body": "One of my best friends is a VP at zoom. Buy calls.", "score": 1, "replies": [{"body": "Nice try SEC", "score": 6, "replies": []}, {"body": "Why. How are they gonna monetize the Millions who don’t pay for it. And how are they gonna keep the rate of growth up? Literally no one I know does zoom parties anymore", "score": 2, "replies": [{"body": "$600 video device thingmajobz!!!!", "score": 2, "replies": [{"body": "😂😂 in iPad minus all the good shit that an iPad does\n\n\nWhat the fuck was the triangle thing called from the office. Just like that", "score": 2, "replies": []}]}, {"body": "Data?", "score": 1, "replies": [{"body": "Um personal data? We all use to zoom. Now no one does ...", "score": 1, "replies": []}]}]}]}, {"body": "Zoom is perfect tool while working from home , so for big meeting we are using Zoom , also for interviews, for small meetings with a team  Microsoft Team. FB Apple FaceTime is not serious for corporations (privacy,limited participants etc )", "score": 1, "replies": [{"body": "Yah we just use teams.", "score": 1, "replies": []}]}]}
{"title": "Too poor to enjoy AMZN quarantine tendies but still hungry? UPS will deliver", "selftext": "  \n\nUPS has earnings on 7/30 and it should be a good tendie-ing opportunity. Obviously there has been an uptick in the parcel delivery service based on the increase in online shopping due to COVID-19. FedEx, the other big parcel delivery company, had earnings on 6/30 where they reported EPS of $2.53 vs. consensus estimate of $1.42. Revenue was down YoY by 2.5%. This caused share price to jump 12% (140 -> 158) overnight:\n\n[FDX Jump](https://preview.redd.it/39cn8pp0c7c51.jpg?width=1913&format=pjpg&auto=webp&s=4fb85bcffab89ab3e3ec319e3fe476cdba6a4a82)\n\nAt the same time UPS jumped up and has been hovering around the same:\n\n&#x200B;\n\n[Hang in there bby](https://preview.redd.it/q7mt4a5fc7c51.jpg?width=1919&format=pjpg&auto=webp&s=24a8f8596c501254ad2c159e5431311a9170ce49)\n\nFedEx has a much lower contribution margin per package delivered as they are trying to cut prices to compete against UPS, which is approx. 3x larger anyway.  Anecdotally, I watch the UPS truck pull up to my apartment building and stay for around 30-45mins every day delivering packages, while I see the FedEx truck come maybe 2x a day where the driver will deliver one or two package.  It is my belief the UPS, as the king of logistics, has a much more efficient delivery system which allows more packages to be delivered per trip and thus increases the contribution margin of each package delivered by reducing variable costs related to vehicles and wages.  This is why UPS is going to kill earnings even harder than that guy in the FedEx costume killed that judge.\n\nI personally have 7/31 $125 and 8/7 $125c.\n\nTLDR: Get free money because people are scared to go outside\n\nEdit: Down a bit but I’m not too worried. I was doing a little reading and found that UPS used a fuel surcharge to cover that cost of their business right. But it’s set for a contract period, meaning that there is a lag between fuel prices actually changing and the fuel surcharge being adjusted. I’m thinking since fuel has been cheap across the board since Covid started they are probably making extra bank on their charge. Basically if they’re charging at or near pre covid fuel surcharge but paying nothing for gas should be extra profit", "id": "hv6el8", "created_utc": 1595334168.0, "score": 160, "upvote_ratio": 0.95, "num_comments": 90, "comments": [{"body": "UPS literally has ‘up’ in its name. Can’t go wrong with this play", "score": 182, "replies": [{"body": "The true DD", "score": 38, "replies": []}, {"body": "FDX has FD in its name", "score": 9, "replies": []}, {"body": "My buddy runs one of the buildings where all boxes are distributed. He said he's been working XMAS hours for the past few months working every Saturday even though he never does in the summer.  \n\nHe also said that they just recently told Amazon that they will cap how many of Amazon's packages they will deliver. This way they can guarantee delivery times and maintain good relationships with other companies they have contracts with at higher rates than the Amazon one.", "score": 8, "replies": []}, {"body": "Stonks onlys goes ups", "score": 5, "replies": []}, {"body": "Im sold", "score": 1, "replies": []}, {"body": "lmao", "score": 0, "replies": []}]}, {"body": "On a side note my mail man is JACKED TO THE TITS with EBay boxes like every day. \n\nWeak ass DD I know but the eBay people are probably right.", "score": 36, "replies": [{"body": "I’m in", "score": 5, "replies": [{"body": ">an is JACKED TO THE TITS with EBay boxes like every day.  \n>  \n>Weak ass DD I know but the eBay people are probably right.\n\nCaught the Ebay wave a couple weeks ago, 2 long horizon calls with 1k profits each. Felt too good to hold.", "score": 4, "replies": []}]}]}, {"body": "Been sitting on these and further out August for a couple of weeks. Here’s to hoping it pays off", "score": 27, "replies": [{"body": "Glad to see others in it as well", "score": 4, "replies": [{"body": "I was thinking 125 call 8/28 but how likely is it they beat earnings as a company?", "score": 6, "replies": [{"body": "Maybe buy early and sell half to keep some of the gains from the run up and hold through ER. It’s a toss up to know exactly how COVID has impacted their results, but I think it’s easy to see a possibility that it could’ve helped them more than hurt", "score": 9, "replies": [{"body": "Yeah I have been preaching it for a while now. There SHOULD be a run up to earnings. Look at fedex and it hopefully will give an indication", "score": 2, "replies": [{"body": "That’s my thought. Regardless of results the run up should be big just riding the wave off of FedEx", "score": 2, "replies": [{"body": "I’m gonna yolo 10k how do you feel about that lol", "score": 3, "replies": [{"body": "I love it", "score": 1, "replies": [{"body": "Gonna sell my nvda calls lmao", "score": 3, "replies": [{"body": "UPS is the new meme, just give it a week lmao", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "UPS earnings priced in after huge FDX beat", "score": 15, "replies": [{"body": "Just not true. UPS is not at its high yet whereas FDX passed its high. The buzz off the FDX beat will cause UPS to run up to near Covid highs before ER just like every other stock", "score": 3, "replies": []}, {"body": "that’s what they said last time when ups was trading around 115 and then it spiked to 118-120 now and has stayed around there", "score": 2, "replies": []}]}, {"body": "Couldn’t afford the $125 call so I went for $135\n\nedit: but also the ups driver stole my package last week I should buy puts", "score": 14, "replies": [{"body": "Can’t go tits up. Make sure you watch out for IV crush", "score": 6, "replies": []}, {"body": "They are paid 100k/yr, I doubt he was the thief.", "score": 1, "replies": []}]}, {"body": "I grabbed some $117 7/31 calls when they were still OTM when I heard that our local terminal had a 3 day backlog. That shit doesn’t happen even during Christmas and it wasn’t a staffing issue. Diamond handing those mofos.", "score": 12, "replies": [{"body": "Good anecdotal evidence to support brother", "score": 5, "replies": []}]}, {"body": "Thanks !! Should i buy eod Or get in early ?", "score": 8, "replies": [{"body": "I would try to get in as close to 117 or 118 as possible. It doesn’t really seem to want to go lower than that except for in broadly red market days. Maybe get in sooner rather than later and then average down by buying an extra if we have a red day", "score": 6, "replies": [{"body": "👍👍", "score": 2, "replies": []}]}]}, {"body": "UPS has more deliveries (to your building) because of their subsidized almost exclusive contract with Amazon.   Fedex is doing the opposite of what you think, they are delivering at their own prices which Amazon can't afford.", "score": 7, "replies": [{"body": "Considering that AMZN is recently phasing out using UPS to create their own shipping line I think this opinion is a little outdated. If you go into FDX 10K you can see that their revenues have been declining consistently", "score": 3, "replies": []}]}, {"body": "Yeup, this one seems like a no brainer to me...  but 120c 08/07 seems more appealing.\n\nIt also gives you a better leverage in case you want to hold through earnings. All options also seem decently priced too.", "score": 11, "replies": [{"body": "Sounds like a winner", "score": 3, "replies": []}]}, {"body": "I agree but the spreads on some of the 7/31s are retarded.", "score": 4, "replies": [{"body": "I waited for a red day and spreads were a lot better", "score": 4, "replies": [{"body": "Got ya", "score": 2, "replies": []}, {"body": "How much did you pay per 125C 7/31? I bought in a few weeks ago UPS 122C 7/31 and feel like I got a pretty good price (it was before the recent run up).", "score": 1, "replies": []}]}]}, {"body": "I roll with you and put some cash down on that lottery scratcher.", "score": 4, "replies": [{"body": "😘😘", "score": 2, "replies": []}]}, {"body": "Have been in on 3 7/31 127C for about a week now, down about 40% right now but expecting a run-up pre ER. Anecdotally, our UPS driver has said they have been swamped and they have even delivered in Budget trucks, which I’m taking as a good thing.", "score": 4, "replies": [{"body": "I got 7/31 125c. Friend is a driver and is working 60 hour weeks here in Phoenix. They said they’re swamped and haven’t even cut anyone due to Covid.. just an insane amount of e-commerce. Also he said they do about 1/2 of amazon deliveries here. Let’s gooo", "score": 5, "replies": []}, {"body": "Absolutely. UPS is the king of cutting costs and is probably one of the best suited companies for dealing with this massive uptick while still keeping their contribution margin high", "score": 4, "replies": []}]}, {"body": "I need more puns or I’m out.", "score": 3, "replies": []}, {"body": "you son of a bitch I'm in!", "score": 3, "replies": [{"body": "🤑🤑😍😍", "score": 1, "replies": [{"body": "thanks for the tendies bruh.", "score": 2, "replies": []}]}]}, {"body": "It's a rigged game of earnings manipulation my boy.", "score": 3, "replies": []}, {"body": "I literally just quit options last week. Mother fuck you, I’m in.", "score": 3, "replies": []}, {"body": "You absolute hero.\n\nI literally clicked buy when I saw your anecdote on the UPS truck, thanks for sharing the tendies.", "score": 3, "replies": []}, {"body": "Thanks for the tendies stranger", "score": 3, "replies": []}, {"body": "OP, your amazing DD got me 7x 😘😘👏🏼👏🏼 kisses and claps for you my king.", "score": 3, "replies": []}, {"body": "Sounds good, I'm in.", "score": 2, "replies": []}, {"body": "They already popped after FedEx ER couple weeks back. That said, I’m also in on some 7/31, $120c.", "score": 2, "replies": []}, {"body": "Thanks for the DD. Just bought some 8/7 $125c", "score": 2, "replies": []}, {"body": "Literally cannot go tits up", "score": 2, "replies": []}, {"body": "So you bought 7/31 $125 and 8/7 $125c, calls on both?", "score": 2, "replies": [{"body": "Different timing on diff red days.", "score": 1, "replies": []}]}, {"body": "you son of a bitch, I'm in.", "score": 2, "replies": []}, {"body": "I have 7 contracts 122c 7/31. Will probably sell 3 or 4 before ER though.", "score": 2, "replies": []}, {"body": "UPS UPS and AWAY (which actually is a travel tech ETF tightening into a nice potential squeeze, lol)", "score": 2, "replies": []}, {"body": "Fact is UPS profits are down. UPS and fedex make most of their actual profit on B2B, which is hella down right now with so many closures. They make very little delivering amazon bullshit daily. So now their costs are going up(overtime for all the extra amazon bullshit) while margins have shrunk. Their overall revenue may have increased but profits are down for sure. But fuck it yolo. In 2020 the facts don't actually decide the stock price.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Lokemere don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I'm going JMIA cause I'm too poor to go Amazon", "score": 1, "replies": [{"body": "SE also if you can time it", "score": 1, "replies": []}]}, {"body": "RemindMe! 3 days", "score": 1, "replies": [{"body": "There is a 21 hour delay fetching comments.\n\nI will be messaging you in 3 days on [**2020-07-24 16:43:53 UTC**](http://www.wolframalpha.com/input/?i=2020-07-24%2016:43:53%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/hv6el8/too_poor_to_enjoy_amzn_quarantine_tendies_but/fys4083/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhv6el8%2Ftoo_poor_to_enjoy_amzn_quarantine_tendies_but%2Ffys4083%2F%5D%0A%0ARemindMe%21%202020-07-24%2016%3A43%3A53%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20hv6el8)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "remindme! 7days", "score": 1, "replies": []}, {"body": "What program is this?", "score": 1, "replies": [{"body": "TradingView", "score": 1, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}, {"body": "OP, how are your calls doing today?", "score": 1, "replies": [{"body": "Down a bit but I’m not too worried. I was doing a little reading and found that UPS used a fuel surcharge to cover that cost of their business right. But it’s set for a contract period, meaning that there is a lag between fuel prices actually changing and the fuel surcharge being adjusted. I’m thinking since fuel has been cheap across the board since Covid started they are probably making extra bank on their charge. Basically if they’re charging at or near pre covid fuel surcharge but paying nothing for gas should be extra profit", "score": 1, "replies": [{"body": "nice, also when do you expect them to go up?", "score": 1, "replies": []}]}]}, {"body": "Op, how you feel about the pump today?", "score": 1, "replies": [{"body": "Feels nice. I think maybe correlation with SPY going away a little and being replaced  by earnings buzz", "score": 2, "replies": [{"body": "You holding your 7/31's till after earnings or taking advantage now", "score": 1, "replies": []}]}]}, {"body": "OP, When are you thinking of selling? Holding through earnings or selling before?", "score": 1, "replies": [{"body": "I might sell before if I get enough profit. It’s never a sure thing and with FOMC meeting and Covid nothing will be as stable as we want it", "score": 1, "replies": []}]}, {"body": "have you actually tried using UPS lately. Theyre a fucking joke. half the time packages get sent to fucking culver city or some other bum fuck town, or never get delivered at all, their customer service is basically a 50 year old divorced black woman named brenda who absolutely hates her job and dont even get me started on international shipping....", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Well it closed at 140 on 6/30 and then opened at 158 on 7/1. So no", "score": 3, "replies": [{"body": "I think he’s confusing Fedex with UPS", "score": 2, "replies": [{"body": "If only there was a picture right below that quote or something", "score": 1, "replies": []}]}]}]}, {"body": "Nobodies scared to go outside tf you talkin about", "score": -7, "replies": [{"body": "How were things 3 months ago pal", "score": 5, "replies": []}, {"body": "you obviously dont live in a city...", "score": 0, "replies": [{"body": "I live in Queens ny bozo", "score": 1, "replies": []}]}]}]}
