{"title": "The Market Starts a Descent BEFORE a Recession", "selftext": "Title (check out the link below). Quite simply, SPY just hit a yearly high, the Fed is about to pause…is this the quiet before the storm? The Fed is basically counting on the economy to slow, and the market is forward looking, so aren’t we about to get screwed?\n\nhttps://finance.yahoo.com/news/could-the-stock-market-power-through-a-recession-this-would-be-rare-191840412.html", "id": "148zy2f", "created_utc": 1686722299.0, "score": 30, "upvote_ratio": 0.69, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|8 months ago\n**Total Comments**|447|**Previous Best DD**|\n**Account Age**|10 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": ">The stock market is always forward-looking, so it's possible that it could power through a recession. However, this would be rare and would likely require significant intervention from the Federal Reserve.", "score": 29, "replies": []}, {"body": "So you’re saying that I should yolo all my money on SPY calls because there’s no possible way that it can go tits up? I’m in!", "score": 64, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 10, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}, {"body": "GET TO THE CHOPPA!!!", "score": 15, "replies": [{"body": "PUT DAT COOKIE DOWN", "score": 3, "replies": []}, {"body": "You are one ugly mutha-", "score": 2, "replies": []}]}, {"body": "Whatever. \n\nAs long as they keep lying about real inflation and companies are soaking up record profits the market will forever trend green.", "score": 49, "replies": [{"body": "Facts ![img](emote|t5_2th52|27189)", "score": 6, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "Includes most things people use like cost of food, fuel. Utilities, internet services, gas and electric, housing and rent cost, vehicles and vehicle maintenance, clothing\n\nThey don’t include “volatile” categories.\n\nOf course they don’t, those are where the real inflation numbers lie.", "score": 6, "replies": []}]}]}, {"body": "This top has more to do with people still having too much money then what the economy is doing in my opinion. No guarantees the regards won't continue to pump the market.\n\nWe are in a regarded market", "score": 17, "replies": [{"body": "Gotta unpause those students loans and get people hurtin again", "score": 15, "replies": [{"body": "think bigger, this is a global thing now. It's very easy for anyone in the world to invest in the US stock market and any alternatives suck in comparison. You'd need a global recession, even a US local problem wouldn't make this pump go away.", "score": 13, "replies": [{"body": "You sonofabitch. I'm in!", "score": 5, "replies": [{"body": "If he's in I'm in ![img](emote|t5_2th52|27189)", "score": 3, "replies": []}]}]}]}, {"body": "*some* people have too much money. The kind of rich regards that throw it at stonks. It has little bearing on the real economy, which is a shit show for the lower class. The wealth gap is really regarded.", "score": 11, "replies": [{"body": "absolutely true. But you can also see the other side of the coin, people with little money, no perspectives of a good future, dead end badly paid job, hard to buy a house. And this is mostly global now, not a US thing. So they try their luck in the stock market, even if you lose things can hardly get any worst. The YOLO generation.", "score": 1, "replies": [{"body": "Also true, and because there are so many of those fuckers it can actually have an impact. It just exacerbates the problem. The rich still get most of the reward and if things do go south they get bailed out, ride it out or buy the dip.", "score": 3, "replies": []}]}]}]}, {"body": "Hey keep in mind the last time a bear was right they made a movie about him.", "score": 6, "replies": []}, {"body": "You’re telling me people will spend less during the summer into the holiday months…. Sure okay \n\nMeanwhile despite high prices travel sector is raging", "score": 3, "replies": [{"body": "So at what point in the year do people spend less money?", "score": 4, "replies": [{"body": "Maybe January and Valentine’s Day. Lol jk they never quit", "score": 3, "replies": []}]}]}, {"body": "You 🌈🐻are so insufferable, can’t you just enjoy making money now that inflation is coming down", "score": 6, "replies": [{"body": "🌈🐻 are kinda limited in that sense. They have an opportunity to make some money for a couple months every 10 years and they can't let go so they just lose it all to try again in 10 years.", "score": 6, "replies": [{"body": "The market is basically flat this year if you strip out the big tech that is pumping on AI hopium. Yup, great chance to make money buying expensive mega cap tech trading at negative real earnings yield when every permabull on WSB has figured out that AI is going to be the next big thing. The \"market\" can always pump more, so long as there are more fools than money. Good luck if you think we are on the brink of the next 10 year bull market when the starting point is at valuations significantly above the average of the prior decade.", "score": 5, "replies": [{"body": "cry more", "score": 0, "replies": [{"body": "Who's crying? Good luck to you. I'll just stick to my TIPs and linkers and earn some nice tax free real yields while you geniuses all get rich following the herd.", "score": -1, "replies": [{"body": "You're crying. More text = more losses.", "score": 4, "replies": [{"body": "lol, would like to see you explain how one makes a loss buying TIPs with a positive real yield... good luck", "score": -1, "replies": [{"body": ">lol, would like to see you explain how one makes a loss buying TIPs with a positive real yield... good luck\n\nIt's called opportunity cost. TIPs provide the lowest return because of the amount of protection they give against losses. This return can be detrimental depending on your long term strategy. If you choose a low return investment early while assets are at a lower price you will have to pay a higher price later for the same assets. This in turn can negatively impact your overall return long term if you plan to hold those assets long term. If you only plan to hold TIPs long term there's no downside.", "score": 7, "replies": [{"body": "Aww, did you put that into ChatGPT just for me? Thanks", "score": 3, "replies": [{"body": "I actually most likely know way more about investing than you but I guess if it makes you feel better you can think that.", "score": 2, "replies": [{"body": "If you think so. Good luck out there with that self confidence of yours.", "score": 2, "replies": [{"body": "I don't care man. Do what you do. You asked. I explained something. You obviously didn't know this. You're obviously an investor that is still quite inexperienced because you try stuff out. You get there. You're the one being a weird person here with your ChatGPT insults and you injecting yourself when others talk. Chill out.", "score": 4, "replies": []}]}]}, {"body": "Why are you embarrassing yourself in public?", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Clown ass stayed in cash all year instead of accumulating, didn’t you", "score": 1, "replies": [{"body": "Aha, another genius, where did I say I was in cash all year?", "score": 2, "replies": [{"body": "You’re being a 🌈assed🐻 so I assumed your money was stored in your asshole", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Good luck buddy.", "score": 2, "replies": []}]}]}]}, {"body": "They wouldn't be 🌈🐻 otherwise", "score": 1, "replies": []}]}, {"body": "Dude the spy was down like 24% last year… it already happened and the sooner you realize it the better…", "score": 6, "replies": [{"body": "Down where it should be because that 20 month COVID pump was as fake as this one.", "score": 6, "replies": [{"body": "So you’re saying we should buy calls?", "score": 2, "replies": []}]}, {"body": "So the recession didn't come when everyone expected...so now it's not coming? Riiiiiiiiiiiiight.", "score": -1, "replies": [{"body": "“Market Is forward looking” - you", "score": 1, "replies": [{"body": "So the market is looking through the upcoming recession?  Nah, this is all short covering and momentum.  Big downside ahead.", "score": -1, "replies": []}]}]}]}, {"body": "What you mean we? ![img](emote|t5_2th52|4271)", "score": 5, "replies": [{"body": "Would you say you’re an extremely bearish gay, or an extremely gayish bear?", "score": 11, "replies": [{"body": "I would say I've been expecting total financial collapse and have yet to be proven right.\nSo rather than fuck around in a casino, I'm content to watch and be a bore till then. \nI leave the losing money to y'all.", "score": 7, "replies": [{"body": "What’s your thesis? They just increased the debt limit. Billions more are flooding into the economy. Hyper inflation or stagflation, right?", "score": 4, "replies": [{"body": "I think the amount of unaddressed problems finally overwhelm a dying system. Printing money is great but it's not going anywhere except to rich idiots who might be fucked anyway. Climate collapse, escalating war, rebellious working class, aging elite class , and 15 other fucking things I'm probably unaware of bursts through the chest of globalism.\n\nIt's just going to take time. And fuck it, if I'm wrong I'm set anyways. That's the best part. ![img](emote|t5_2th52|4271)", "score": 7, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "I appreciate the sentiment and advice.", "score": 2, "replies": []}]}, {"body": "That's not a bear thesis that's an ammo and canned food thesis. Let's say you are right, hell let's say you time it perfectly. If all the shit you layed out happened your trillions would be worthless.\n\nEdit: or is that what you are saying with not having a position currently? I took it to mean you gave up on puts because the circus has so far continued.", "score": 2, "replies": [{"body": "I have no puts. I have stocks but no real attachment to them. Good permanent job that survives almost anything but total collapse. \nThanks to this sub I also know I can rebuild from most stupid decisions as well.", "score": 1, "replies": []}]}, {"body": "Don’t forget about the aliens.", "score": 3, "replies": []}, {"body": "Thats why no one will remember you. Either you lose money or die trying babeyyy.", "score": 1, "replies": [{"body": "Leaving no trace is fine for an outdoorsmen.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Where is this regarded meme coming from? I’m out of the loop", "score": 2, "replies": []}, {"body": "You gay bears love missing out on gains. Had you just bought the spy a month ago you would have made more money than you have at Wendy’s over the last month. It’s starting to annoy me", "score": 3, "replies": []}, {"body": "Stonks only go up you gay bear", "score": 2, "replies": []}, {"body": "These posts remind me of how unprofitable WSB is. The writing is always on the wall and the biggest crash known to man is always around the corner. Heard it a million times and it never pans out 🤷‍♂️", "score": 2, "replies": []}, {"body": "There is no recession, the labor market is strong AF as 1+ million people died during Covid thus unemployment is low af and immigration is on the downturn, so jobs still aren't being filled.", "score": 0, "replies": []}, {"body": "this is crazy! I’m already upto my neck in calls.. I’ll find out if I can borrow some money.. maybe a junk loan?", "score": 1, "replies": []}, {"body": "The market only runs on 2 things: sentiment and greed.", "score": 1, "replies": [{"body": "And my put premiums.", "score": 2, "replies": [{"body": "Lol fair enough", "score": 1, "replies": []}]}]}, {"body": "Nope, stop say dreaming and wake up... 5trillion $ printed into market, USA will grow and grow and grow again with that money.. wouldn't market be twice at what it was in 2020 with that amount of money? It's not like $ weakened", "score": 1, "replies": []}]}
