{"title": "The single greatest lie in Real Estate. And the California exodus bubble.", "selftext": "You know it by heart now. \"Californians are being ***forced*** to ***flee*** California.\"\n\nAnd in the exact same breath. \"OMG, everyone's buying homes with CASH.\" \"The housing market's booming right now!\"\n\nLet me rectify your observations for you. Cash strapped Californians are not \"forced\" nor \"fleeing.\" They're conquering your neighborhood and causing a unsustainable housing bubble. My cousin sold his equity in his California townhouse, and bought a 4000 sqft Mc'mansion with cash to spare.\n\nIt's 100% driven by the riches of California, and will end once the finite number of rich Californians leave and realize rural/sub urban homes outside of California depreciate in value faster than the homes they originally sold.\n\n&#x200B;\n\nhttps://preview.redd.it/1tqimrqw1n3b1.png?width=525&format=png&auto=webp&s=18b276cb367fbd821bf64eae817da55ea2b1b8ee\n\nhttps://preview.redd.it/soixlr822n3b1.png?width=529&format=png&auto=webp&s=a409d62c3ced632af4a8d25a08e075f3769c3732\n\n&#x200B;\n\n* Other factors:population growth slowing\n* developers pumping out homes (some choosing to HODL'ing with ARMs)\n\n# Thoughts on how to play?\n\nEdit/rant: Anecdotal evidence can also be seen on youtube. Homesteading channels are on the decline. Farm tourism only works when you're not surrounded by other farmers doing the same for 20 years and being better at it.\n\nBut I think this has got more to do with property taxes. When your crop is barely enough to pay for taxes due to lack of skill\\*, youtube income dries up, and you alienated yourself from the local farming community; You're shit out of luck.\n\n\\* Skill here includes futures contracts and managing droughts, I've not seen a single homesteading video cover this. And even then a flood of money into futures contract is just going to worsen the crash as Idiots buy/sell futures thinking they're cash settled. There was this one farmer near where I'm at who happened to know his counter party, ended up with a rotting pile of corn on his field one year.", "id": "13yiu4r", "created_utc": 1685726635.0, "score": 53, "upvote_ratio": 0.75, "num_comments": 68, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 years ago\n**Total Comments**|2831|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: BTFD, but expect a correction by early 2021.", "score": 1, "replies": []}, {"body": "State Farm also just said they will no longer offer new home insurance in CA because their insurers won’t insure their insurance fwiw. Insurance inception.", "score": 51, "replies": [{"body": "Are you saying we now need to buy insurance for our insurance?", "score": 1, "replies": [{"body": "Reinsurance has been around since insurance. \n\nTime to offer re-reinsurance for re-regarded investors.", "score": 0, "replies": [{"body": "What about buying insurance for your insurance for your insurance?", "score": 1, "replies": []}]}, {"body": "Buy Munich Re.", "score": 1, "replies": []}]}, {"body": "that's t he wild part is all these insurers reinsure each other\n\ni feel like this works well when one area, and only one area, like Florida gets wacked with a hurricane or whatever\n\nthere's gotta be some systemic risks to the system tho if everyone insures each other in one big circle", "score": 1, "replies": []}]}, {"body": "You say rich Californians will all of a sudden realize their homes are depreciating and leave. One, they’re rich and don’t give af about depreciation. Two: a home is a long term purchase. They’re not just going to sell it like you dump your failing puts. You are a complete idiot", "score": 13, "replies": [{"body": "Existing home sales says otherwise.\n\nCalifornians are the decedents of gold miners - the original YOLO'rs. Speculation is in their blood.", "score": 1, "replies": []}]}, {"body": ">There are a few ways to play this. You could short the homebuilders, or you could buy put options on the SPY ETF (which tracks the S&P 500). Alternatively, you could buy inverse ETFs that rise when the stock market falls.", "score": 16, "replies": [{"body": "Even the bot knows the collapse is coming.", "score": 28, "replies": []}]}, {"body": "[deleted]", "score": 41, "replies": [{"body": "Ah, the real golden rule: the one with the gold makes\nThe rules.", "score": 12, "replies": []}, {"body": "Oh they love our money but keep telling us to leave for no reason", "score": 1, "replies": []}]}, {"body": "Lol no matter what, Californians are the bad guys.\n\nIt's funny the obsession some people have with that state.", "score": 30, "replies": [{"body": "I believe the saying goes \"they hate us cuz they aint us\"", "score": 28, "replies": [{"body": "I thought it was “they hate us cuz they anus”", "score": 12, "replies": [{"body": "Actually the nation is afraid we will have to pay for CA pension costs, the reason I left the state.   I lived in Alameda, the town employees made 125% of what the average working person in town made.  This is using CA figures which greatly distort your pension costs.  I was a financial advisor, my average govt employee client had a pension of $75k.  With interest rates during the Obama & Trump presidencies, the $75k pension is equivalent to the private sector gifting $2.5 million dollar bonus.  When I asked the town how they were going to address the upcoming shortfall, I was told that they will just raise taxes.\n\nWhy should we pay for your bloated government costs?  Your roads are terrible, your schools are worse and your cost of living cause homelessness.", "score": 5, "replies": [{"body": "I tried to leave before COVID, but just missed it. Leaving in the fall with a pure remote job. Yes, the pension liability is going to be a bloodbath for CA.", "score": 1, "replies": []}]}]}]}, {"body": "I left during covid for the southern usa from cali. \n\nThey hate us for all these wierd non tangible reasons but their property values have tripled and now something is being done about the rampant methheads. \n\nThey are obsessed with CA but have never been. Many have never left the county which blows my mind\n\nI hate it here, the locals are all either super religious or on drugs. Leaving soon\n\nIt's cheap and pretty though", "score": 2, "replies": [{"body": "Which state??", "score": 1, "replies": [{"body": "Tn", "score": 1, "replies": [{"body": "Oh yeah! someone I know moved there and bought a huge house for 300K.", "score": 1, "replies": []}]}]}]}]}, {"body": "You may be correct about the housing market declining in California but you're way way off on declining homesteads. Homestead numbers are sky rocketing and have been since the beginning of covid. That's not going to change at all as long as society continues to deteriorate here in the US.", "score": 20, "replies": [{"body": "Do you, perchance, have income related to homestead?", "score": -7, "replies": [{"body": "No.", "score": 6, "replies": [{"body": "Are you lying?", "score": -13, "replies": [{"body": "You're shit at arguing a point and you're shit at reading the room. Go touch grass.  Since covid scared boomers and millennials are now looking to escape the bullshit American dream of a cookie cutter sub division life I've personally witnessed a massive spike in small land parcel purchases here in the Midwest. People that watched those homesteading videos in the past are the same people too busy raising chickens to watch dumb videos now. Multiple friends and family members have purchased rural properties as a hedge against possible recession since covid. r/homestead went from 230,000 when I joined to 2.5 milliom now so there's definitely a public interest in the matter.", "score": 19, "replies": [{"body": "So, yes. You were lying. Got it", "score": -15, "replies": []}, {"body": "That I agree with, but also not sustainable. That’s over saturating a market.\n\nTo the Californian’s benefit, this year’s pretty shitty for crops so small scale farming remains profitable, but next year’s is looking to be a great crop (based on models).\n\nNot sure how new farmers are going to be able to compete next year.", "score": -4, "replies": [{"body": "Obersaturated market? For not being homeless? I live in Cali and seriously think you're off base when it comes to how fed up people are here with housing prices. You could buy / rent three properties for the cost of living here on JUST HOUSING. 'Upkeep' means nothing when you're paying 3x anyways month to month with no financial stability. You could just save the 2x over for a complete rebuild and be fine.  All you have to do is get past the rural vs city life and it's heaven.", "score": 10, "replies": [{"body": ">\tCali\n\nNot from California", "score": -1, "replies": [{"body": "Yeah, you live my life for me. I'm wrong, you're right. How silly of me to know where I live. My bad!", "score": 3, "replies": [{"body": "For some reason, people have it in their head that no one from California calls it \"Cali\".", "score": 4, "replies": [{"body": "wtf I say cali all the time", "score": 3, "replies": []}, {"body": "I don't even use that word. My phone auto corrected when I was getting off lunch and I didn't want to type more to change it. Low effort regarded people here though, was expected.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "the models are predicting a hot and long summer next year. and the rich folk of california simply aren't going to be able to handle the farming when it gets tough. big farms are going to love the heat though, and drain the aquifers.\n\nas for breaking up an already small farm. maybe a few of the lucky ones that initially drove up the price and got in on a good deal, but farmland prices went up way faster initially than building improvements. Those that bought the last 2 years are going to be stuck with 50% unrealized loss with no income.", "score": 3, "replies": []}]}]}]}, {"body": "hahahaha. Gold.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "2020 is when tech companies allowed WFH. It’s California green wave, just waiting on layoffs and pulling workers back into office to sink back in.\n\nLean’s great if you want stagnation, but innovation requires people to be in the same room.\n\nI’m purely guessing here, but I’m thinking half the people that left are going to find pressure pushing them back to California. Either they fail to adapt, or their startup sets them back negative due to recession, or they miss being an innovator, or simply miss the Californian weather. O and as a mid western boy, the crushing depression and hard drugs will rip a hole though any IQ - seen it play out one too many times amongst friends, you can’t stop it.\n\nSo guessing demand drops out while realtors/builders are leveraged to the tits during a recession.", "score": -8, "replies": [{"body": "\"Innovation requires people to be in the same room.\"\n\nMaybe it used to. But it sure as fuck doesn't anymore. How old are you??", "score": 13, "replies": [{"body": "It's a phrase used by regards who've never innovated anything in their fucking lives...\n\nKool Aid drinking c-level simps. What actual engineers need to innovate is uninterrupted focus time, it's not rocket science.", "score": 8, "replies": [{"body": "OP must be Elon.", "score": 3, "replies": []}]}, {"body": "Call me daddy.", "score": -2, "replies": []}]}]}]}, {"body": "Love CA! Glad y’all are leaving!  Whiny whimps! Adios!", "score": 5, "replies": []}, {"body": "Who’s Fred", "score": 2, "replies": []}, {"body": "As a Californian who sold their boomer inherited McMansion and rental and moved to Virginia your wrong. This bubble is just gettin started. Already bought me a brand new f350 cash bro. That’s job creation right there. And you know what Ima buy me a boat too cuz fuck you bro this is America. Is that a Rollie on my wrist? You damn right son.They hate us cuz they ain’t us. Stonks only go up!", "score": 2, "replies": [{"body": "Pray\n\nEdit:\n\nAlso job creation is good for economy but not necessarily housing as migrations back to office centers will drive a large selling boom.", "score": 1, "replies": []}]}, {"body": "California is a mess.", "score": -2, "replies": [{"body": "For the poors", "score": 29, "replies": []}, {"body": "Most of the rest of the usa is way worse", "score": 20, "replies": []}, {"body": "Lol, have you been to PA or IL or the southern usa? California is paradise", "score": 5, "replies": [{"body": "Can’t say I’ve seen the homelessness in CA anywhere else.", "score": 0, "replies": [{"body": "So you've been to CA?", "score": 2, "replies": [{"body": "I have been to many states frequently and have many friends in CA as well.", "score": 1, "replies": []}]}]}]}, {"body": "https://californiaglobe.com/articles/why-did-352-california-companies-flee-to-other-states-in-three-years/", "score": 0, "replies": []}]}, {"body": "Fuck CA", "score": -7, "replies": []}, {"body": "My rich cousins both moved their families out of San Fran to increase property values in other states.   No one wants to step on needles.  They kept there homes at 15k monthly rentals no need to sell now.", "score": -3, "replies": [{"body": "Property values and rent are high because people actually WANT to live in Cali.  The needles must not be that bad.", "score": 4, "replies": [{"body": "There are no bubbles in the most desirable state in the Union to live…", "score": 1, "replies": []}]}]}, {"body": "Thank you for your wonderful post!![gif](emote|free_emotes_pack|feels_good_man) I've been studying this issue and I have some links to articles here, that fully back your premise:  \n“The Californians are Coming. So is Their Housing Crisis,” by the New York Times  \n[https://www.nytimes.com/2021/02/12/business/economy/california-housing-crisis.html](https://www.nytimes.com/2021/02/12/business/economy/california-housing-crisis.html)\n\n“California's Home Shortage is Making Everyone Else's Worse - Sightline Institute.”  \n[https://www.sightline.org/2020/09/09/californias-housing-shortage-is-making-everyone-elses-worse/](https://www.sightline.org/2020/09/09/californias-housing-shortage-is-making-everyone-elses-worse/)\n\n\"Housing costs are a main reason inflation is still high\"  \n[https://www.marketplace.org/2023/03/14/housing-costs-are-a-main-reason-inflation-is-still-high/](https://www.marketplace.org/2023/03/14/housing-costs-are-a-main-reason-inflation-is-still-high/)\n\n\"Rents are rising at fastest pace in 40 years. Why it's bad for inflation, the Fed, and you.\" by USA Today  \n[https://www.usatoday.com/story/money/economy/2022/09/13/soaring-rent-impact-on-inflation-rate-fed-consumers/10365417002/](https://www.usatoday.com/story/money/economy/2022/09/13/soaring-rent-impact-on-inflation-rate-fed-consumers/10365417002/)\n\n\"Rising rent prices are keeping inflation high, Shelter prices rose 0.7 percent in August, the biggest monthly jump since 1991.” by Vox Magazine  \n[https://www.vox.com/policy-and-politics/2022/9/14/23351128/inflation-rent-prices-high](https://www.vox.com/policy-and-politics/2022/9/14/23351128/inflation-rent-prices-high)\n\n\"Inflation, Soaring Rents, And The Housing Crisis,\" by Forbes Magazine.  \n[https://www.forbes.com/sites/richardmcgahey/2022/03/25/inflation-soaring-rents-and-the-housing-crisis/?sh=21f2ef916f5](https://www.forbes.com/sites/richardmcgahey/2022/03/25/inflation-soaring-rents-and-the-housing-crisis/?sh=21f2ef916f5)\n\n\"Ketchum, Idaho, Has Plenty of Available Jobs, but Workers Can’t Afford Housing,\" by The Wall Street Journal  \n[https://www.wsj.com/articles/ketchum-idaho-has-plenty-of-available-jobs-but-workers-cant-afford-housing-11625659200](https://www.wsj.com/articles/ketchum-idaho-has-plenty-of-available-jobs-but-workers-cant-afford-housing-11625659200)\n\n\"As locals are priced out, Colorado mountain towns fight to keep workers.\" Communities are turning to innovations, like lease limits and new taxes, to confront a housing shortage worsened by remote workers and second-home owners.\"                                                                                                       \n\n[https://www.nbcnews.com/news/us-news/locals-are-priced-colorado-mountain-towns-fight-keep-workers-rcna17970](https://www.nbcnews.com/news/us-news/locals-are-priced-colorado-mountain-towns-fight-keep-workers-rcna17970)\n\n “Glorified homelessness”: Even tiny Silverton is experiencing the housing crisis that’s crushing mountain workers,\" Colorado’s housing shortage is exacerbated in remote Silverton, where there are no suburbs to commute from and little space to expand.\"  \n[https://coloradosun.com/2021/10/20/silverton-colorado-housing-shortage/](https://coloradosun.com/2021/10/20/silverton-colorado-housing-shortage/)\n\n\"Crested Butte's housing affordability crisis is turning into an employment crisis,\" by Denver 7  \n[https://www.youtube.com/watch?v=g4Zc1MkSW7M](https://www.youtube.com/watch?v=g4Zc1MkSW7M)\n\n“Remote Work Drove Over 60% of House-Price Surge, Fed Study Finds,” by Bloomberg News: [https://www.bloomberg.com/news/articles/2022-09-26/remote-work-drove-over-60-of-house-price-surge-fed-study-finds#xj4y7vzkg](https://www.bloomberg.com/news/articles/2022-09-26/remote-work-drove-over-60-of-house-price-surge-fed-study-finds#xj4y7vzkg)\n\n “This Town Was Paradise, Then Everyone Started Working From Home,” by Vice News [https://www.youtube.com/watch?v=WhElNHGN9KY](https://www.youtube.com/watch?v=WhElNHGN9KY)\n\n“Remote Work Drove Over 60% of House-Price Surge, Fed Study Finds”               [https://www.bloomberg.com/news/articles/2022-09-26/remote-work-drove-over-60-of-house-price-surge-fed-study-finds#xj4y7vzkg](https://www.bloomberg.com/news/articles/2022-09-26/remote-work-drove-over-60-of-house-price-surge-fed-study-finds#xj4y7vzkg)\n\n “10 Cities Where Rich Out-of-Towners Have Driven up Home Prices”                    [https://money.com/cities-remote-workers-increase-home-prices/](https://money.com/cities-remote-workers-increase-home-prices/)\n\n“Colorado mountain towns facing housing crisis, dwindling workforce”  \n[https://www.youtube.com/watch?v=99DL9OMsGIM](https://www.youtube.com/watch?v=99DL9OMsGIM)\n\n“The softening of real estate prices in the hottest pandemic markets only confirms that the surge in remote work created the illusion of a housing shortage”  \n[https://www.businessinsider.com/the-surge-of-remote-work-has-created-the-illusion-of-a-housing-https://www.businessinsider.com/the-surge-of-remote-work-has-created-the-illusion-of-a-housing-shortage-2022-11shortage-2022-11](https://www.businessinsider.com/the-surge-of-remote-work-has-created-the-illusion-of-a-housing-https://www.businessinsider.com/the-surge-of-remote-work-has-created-the-illusion-of-a-housing-shortage-2022-11shortage-2022-11)\n\n“The Short- and Long-Run Effects of Remote Work on U.S. Housing Markets”  \n[https://eig.org/remote-work-and-housing-markets/](https://eig.org/remote-work-and-housing-markets/)\n\n“Ketchum considering tent city for workers amid 'crushing inequality,' scarce affordable housing.” 'These are the people who work at your school. These are the people that work at your local business. These are the people who serve you.' by KTVB News, Boise  \n[https://www.ktvb.com/article/news/local/growing-idaho/affordable-housing-ketchum-rent-blaine-county-crisis-park-tents/277-6dcd3da9-7ce7-4722-81de-b1e379e0300a](https://www.ktvb.com/article/news/local/growing-idaho/affordable-housing-ketchum-rent-blaine-county-crisis-park-tents/277-6dcd3da9-7ce7-4722-81de-b1e379e0300a)\n\n\"Yes, it is Californians that made Colorado so unaffordable,\" by KDVR News  \n[https://kdvr.com/news/data/californians-colorado-unaffordable-migration/](https://kdvr.com/news/data/californians-colorado-unaffordable-migration/)\n\n\"As locals are priced out, Colorado mountain towns fight to keep workers.\"   \n[https://www.nbcnews.com/news/us-news/locals-are-priced-colorado-mountain-towns-fight-keep-workers-rcna17970](https://www.nbcnews.com/news/us-news/locals-are-priced-colorado-mountain-towns-fight-keep-workers-rcna17970)\n\n\"Welcome to America's new 'Zoomtowns,' where an invasion of remote workers with big-city paychecks is driving long-time locals into tent cities and homeless shelters\"  \n[https://www.businessinsider.com/zoom-town-inequality-remote-workers-work-from-home-big-cities-2022-4](https://www.businessinsider.com/zoom-town-inequality-remote-workers-work-from-home-big-cities-2022-4)\n\n“Inequality Grows in Western Zoom Towns. As demand for housing grows, small Western towns are experiencing skyrocketing housing costs and rising displacement.” by Planetizen  \n[https://www.planetizen.com/news/2021/12/115462-inequality-grows-western-zoom-towns](https://www.planetizen.com/news/2021/12/115462-inequality-grows-western-zoom-towns)\n\n“Who can afford to live in the American West when locals can’t?” by The Guardian  \n[https://www.theguardian.com/society/2021/aug/26/american-west-income-inequality](https://www.theguardian.com/society/2021/aug/26/american-west-income-inequality)\n\n“Pandemic Profiteering: How Remote Workers Left Rural Communities Struggling,”  by AllWork. [https://allwork.space/2023/02/digest-pandemic-profiteering-how-remote-workers-left-rural-communities-struggling/](https://allwork.space/2023/02/digest-pandemic-profiteering-how-remote-workers-left-rural-communities-struggling/)", "score": 1, "replies": []}]}
