{"title": "Your stock picks and strategy for 2019?", "selftext": "What are your top stock picks for 2019? And also, what is your investment strategy for your portfolio for this year, given the turbulent nature of the markets lately. We've seen some gains in the past 5 days however the trade deal with China & government shutdown could bring back the violent volatility from the October to December period in a heartbeat. \n\nMy top picks for 2019 are:\n\nBoeing - I think they're going to crush revenue expectations and aircraft orders this year. Coupled with their strong balance sheet and strong free cash flows, this is definitely one of my picks to outperform this year.\n\nWalt Disney Company - With Disney Plus arriving soon, analysts on Wall Street are going to have to look at Disney differently considering they're going to be integrating the Netflix model as a part of their overall business. I think the content they're slated to have and their plan to undercut Netflix is going to result in massive subscription numbers. \n\nMy strategy this year will be to invest in strong cash-flow companies with low leverage, which pay dividends. ", "id": "af4rsz", "created_utc": 1547274242.0, "score": 30, "upvote_ratio": 0.85, "num_comments": 55, "comments": [{"body": "Disney is truly an interesting pick. As long as they keep doing the same job they've been this year and their streaming service works (and i am sure it will), their stock can strongly increase. I am a little scared because of the next crisis and how they affect entertainment sectors, but Disney will probably survive.", "score": 14, "replies": [{"body": "I like DIS but I dont like how little the stock moves. Seems like your money could sit there doing nothing for years.", "score": 3, "replies": []}, {"body": "I just want to say - I told ya so ;)", "score": 2, "replies": []}]}, {"body": "Visa, MSFT and CGC. Looking for maybe one more in the energy sector, but I might just go into an ETF for that.", "score": 11, "replies": []}, {"body": "Buy good companies. I want to focus more on buying well run companies rather than riskier plays. Of course i still will be picking growth stocks, I want to anchor my portfolio more with companies like MSFT, TGT, PFE, etc. ", "score": 5, "replies": [{"body": "As a Minnesotan, I approve of TGT. We started using their product subscriptions (repeat deliveries basically) for things like coffee and diapers. \n\nThat said, targets grocery is the worst of the bunch. They don't have a niche. Some groceries are cheap, some are expensive but have more selection, some are luxury. Target just kind of exists in the more expensive but with poor selection niche.", "score": 1, "replies": [{"body": "I'm curious why you used Target's product subscription instead of Amazon's.", "score": 1, "replies": [{"body": "Main Reason - Amazon doesn't have target brand diapers. We have 3 kids, 2 in diapers. Target diapers have been fantastic over the last 5 years we've used them. Better than huggies and way cheaper.\n\n&#x200B;\n\nSecond reason - Amazon has screwed up so many deliveries for us lately. On top of this, they have been delivering packages at 8-9pm at night. Our kids are sleeping by then, and despite the 'Do not ring doorbell, sleeping baby' sign, they still ring the doorbell. At this point, our amazon subscription is about the video content they have and has zero to do with their shipping benefits.", "score": 2, "replies": [{"body": "That's really interesting. Question in that case for you, why Amazon Video instead of Netflix? Out of everyone I know, I'm the only one who goes with Amazon Video instead of Netflix (but that's because I also utilize their shipping and Amazon music), so I'm curious as to why you'd pick Amazon Video over Netflix since Netflix seems to have a better selection.", "score": 2, "replies": [{"body": "We do both. With 3 kids, we don't have time or money to get out much, so the $24/month or so is well worth it. During NBA season, I get sling for sports, then cancel out of season. \n\nWe don't actually watch much amazon original content, but shows like Daniel Tiger are watched heavily by our kids. At some point we may switch from amazon to hulu.", "score": 2, "replies": [{"body": "That makes lots of sense. Thanks for taking the time to write out your reasonings.", "score": 2, "replies": []}]}, {"body": "Prime Streaming is way better than Netflix for kids.  I have both but my kids watch way more from prime.  This is for originals and licensed content.", "score": 1, "replies": []}]}]}]}]}, {"body": ">Buy good companies. I want to focus more on buying well run companies rather than riskier plays. Of course i still will be picking growth stocks, I want to anchor my portfolio more with companies like MSFT, TGT, PFE, etc.\n\nLook into McCormick. They have solid growth on both earnings/revenue and dividend. They have a sub 50 payout ratio as well. They also have recession resistant product lines (they only fell \\~25% during the great recession).", "score": 1, "replies": []}]}, {"body": "I’m holding", "score": 5, "replies": []}, {"body": "PATIENCE! I think people underestimate how important patience will be during these times.  I wouldn't be buying until we see some real resolution with the trade war and everything thats going on in the trump administration.  Yes you might miss buying the perfect bottom, but you could also be buying right before another 10 - 20% dip in spy.    Id rather miss out on some profit then get stuck with a red 2019.   Mostly Cash for now ", "score": 7, "replies": [{"body": "This is how I'm playing it.  I can't say I'm mostly in cash, but I'm holding more cash than before.  I've sold chunks of my growth stocks that are near their highs.  Even if they go higher now, it feels like a bumpy enough road that they'll also be back lower in the future.", "score": 2, "replies": []}, {"body": "Yea I’m pretty much just waiting for the dust to settle to see what my next moves are. Although seeing the jobs report for this past month has given me some confidence that things are still looking good economically. ", "score": 1, "replies": []}]}, {"body": "SQQQ all day baby, lets get this recession party started", "score": 7, "replies": [{"body": "> SQQQ \n\nwhy?", "score": 1, "replies": []}]}, {"body": "Buy ACB. I know a guy ", "score": 5, "replies": [{"body": "Are they addressing their stock dilution? I am  holder, but that is one of the things that concerned me.", "score": 3, "replies": []}, {"body": "What u know?", "score": 3, "replies": [{"body": "Buy. Big. ", "score": 2, "replies": [{"body": "Done. ✅", "score": 7, "replies": [{"body": "RemindMe! 1 year ", "score": 10, "replies": [{"body": "I will be messaging you on [**2020-01-12 07:56:58 UTC**](http://www.wolframalpha.com/input/?i=2020-01-12 07:56:58 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/af4rsz/your_stock_picks_and_strategy_for_2019/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/af4rsz/your_stock_picks_and_strategy_for_2019/]%0A%0ARemindMe!  1 year ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! edvkha1)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 2, "replies": []}, {"body": "remindme! one year", "score": 1, "replies": []}, {"body": "RemindMe! 1 year \n\nEdit I’m back can’t believe it’s been a year", "score": 1, "replies": []}, {"body": "Remind me! 1 year", "score": 1, "replies": [{"body": "Remind me! 1 year", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "RemindMe! 1 year", "score": 1, "replies": []}]}]}]}]}]}, {"body": "RemindMe! 1 year", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It won't", "score": 3, "replies": []}]}, {"body": "amzn, msft, googl, and adbe for cloud, v and ma for payment, apple for hope and innovation(I hope it will do eventually). For disney, if the new streaming business is successful and able to compete with netflix, it will be a great stock.", "score": 1, "replies": []}, {"body": "Hoping for China relations to smooth so my jd recovers. I'm expecting sq to be big, I've been seeing it a lot more in the wild lately and they just released their sdk. I'm hoping they expand into more digital stuff. HRTX is my biggest bet, fast track for fda approval, replaces opioids for 72 hours after surgery which is the highest risk time for addiction and is apparently 90% effective which is pretty good. I'm hoping it gets approved (I think April something is the date) at which point it would jump a lot I'm sure", "score": 1, "replies": []}, {"body": "Bogleheads 2019 Hedge Fund Contest. Rules: Up to three long and three short, minimum one of either. Must use equal allocation among everything selected. No using leverage. Must pick a Russell 3000 stock (no ETFs). No trades possible: Buy or short Jan 1 and close at Dec 31 close. The picks are locked in prior to the open on Jan 1.\n\nhttps://docs.google.com/spreadsheets/d/1GGy1FuMRcZlPjy060OknFyAgboONF4qFP7WvdiwyyIs/edit?ts=5c2ccada#gid=0\n\nBogleheads 2018 Hedge Fund Contest: https://docs.google.com/spreadsheets/d/1_kEogD5ds_ivRkvzKlosJT_phd9J1LSkugVRr1NzkNs/htmlview\n\nTanelorn Capital *Better to be lucky than good* (user tanelorn at Bogleheads) did really well in 2017 and 2018. Their strategy is to pick a company that looks like it will tank and short it. Not doing well so far this year though... SHLDQ is Sears Holdings. I might short it now that it's up a little.", "score": 1, "replies": []}, {"body": "I’m going big and long on Constellation Brands (STZ). It’s a great buy-in point right now and the company has a strong history. It’s only a matter of time until it climbs back to the top. They also have a substantial stake in CGC for those that want to venture into the marijuana sector. ", "score": 1, "replies": [{"body": "First purchase into stocks was last week where i bought stz at the 170 mark before it crashed to 150 where my stop loss kicked in and i lost money. Real slap to the face that one but i have faith in them and canopy growth to go big", "score": 2, "replies": []}, {"body": "I just bought TAP (Coors Light in my Roth IRA). It was between TAP and STZ.", "score": 1, "replies": []}]}, {"body": "I started in Sept alot of mistakes but I've learnt from them panic selling hurt me the most  ", "score": 1, "replies": []}, {"body": "That 12% loss in a day was killer, my condolences brotha. You’ll make it back", "score": 1, "replies": []}, {"body": "Short anything remotely related to enterprise resource management. CRM and WDAY are insanely overvalued. ", "score": 1, "replies": []}, {"body": "My #1 pick for 2019 and long term is $VZ. Verizon is undervalued and overlooked still. The future, 5G and forward, will rely heavily on wireless data. AT&T does not have the customer service or leadership to compete. They had a massive advantage with Apple only giving them the iPhone and still do not have a larger market share than Verizon. P/E on top of that says it all here. I am still loading up", "score": 1, "replies": []}, {"body": "Switching over to 40% bonds, 40% div etf, 20% weed stocks.", "score": 1, "replies": []}, {"body": "Honestly, it's going to be difficult. Prepare yourselves.\n\n", "score": 1, "replies": []}, {"body": "Dump it all ASAP", "score": -2, "replies": []}, {"body": "Disney's dead..nothing good coming out of them in the future. Just look how they ruined the star wars franchise...talk about money lost..it will take generations forgetting what they did to ever fall in love with that series again.\n\nIn addition the  way they treated fans of star wars that could of been revenue streams..completely ostracized. Don't think smart people or nice people are working for disney..I'd keep my money far away.", "score": -7, "replies": [{"body": "Marvel Studios would like to have a chat.", "score": 5, "replies": []}, {"body": "/r/StarWars - go away", "score": 11, "replies": []}, {"body": "They are printing bricks of money in the back of Disney.\n\nStarwars is just one of their many vessels they use to print money. \n\nDisney is a strong pick.", "score": 3, "replies": []}, {"body": "While I agree. I also disagree. Disney will always grow. Don’t look at the products. Look at the business. They are doing amazing business. Visit their facilities. Then compare them to any others in the industry. Not only that, but they are making strides in the world of being green. Disney is a double down. Hold long. Say what you will about the Star Wars franchise, while I agree it doesn’t appeal to the purest. It has grabbed the younger generations. They don’t target the purest, Also, them re-hashing all of their originals is brilliant. They look amazing. ", "score": 5, "replies": []}, {"body": "I feel the same. Look at the YouTube rewind video. That’s how I feel about the course of Disney’s recent projects. ", "score": 0, "replies": []}]}, {"body": "MU ", "score": 0, "replies": []}, {"body": "Small or mid cap stock addiition from dividend proceeds through the year. \n\nI may divest my bond ETFs in favor of municipals if rates rise (taxable acct only).\n\nOtherwise I like my holdings right now in my accounts. If the market we're to really tank (sp500 to 2150), I would liquidate my bond holdings and buy VOO or VTI.", "score": 0, "replies": []}]}
{"title": "58 Million Dollar AMZN Put. $1980 Strike. 1/17/2020 Expiration", "selftext": "Saw this gem in my weekly report that I published today.\n\nhttps://preview.redd.it/3smwjd5e3x921.png?width=948&format=png&auto=webp&s=ce812e6c63360e239d2d28a1c96c3f72d8fe882e\n\nYou can find that report here: [https://www.reddit.com/r/wallstreetbets/comments/af3qwt/weekly\\_unusual\\_option\\_activity\\_report\\_week\\_ending/](https://www.reddit.com/r/wallstreetbets/comments/af3qwt/weekly_unusual_option_activity_report_week_ending/)\n\n&#x200B;\n\nI think it is very unlike that this is a hedge due to how in the money the strike is.\n\nEDIT: I may be wrong. Honestly after finding these two otm calls and looking at their tables on optionsprofitcalculator, I'm not sure what the play here is, so I learned my lesson and will not be commenting on it.\n\nhttps://preview.redd.it/9j9jnnavdy921.png?width=776&format=png&auto=webp&s=4454e26655ce9a3105870f2cdd7e263b9c195517", "id": "af3sqf", "created_utc": 1547266346.0, "score": 40, "upvote_ratio": 0.87, "num_comments": 58, "comments": [{"body": "Sorry that was me guys, just a small hedge for my long position.", "score": 63, "replies": []}, {"body": "Maybe it's MacKenzie Bezos already blowing the cash in hopes Bezos fails.", "score": 48, "replies": [{"body": "Yes, she's shorting herself.... Moron.", "score": 7, "replies": [{"body": "She's hedging for when she dumps her share of her investment. ", "score": 19, "replies": []}, {"body": "Yes yes she is", "score": 4, "replies": []}, {"body": "She’s a r/wsb user ", "score": 3, "replies": []}]}]}, {"body": "I really wonder what their stop losses are and hedging options are.. I slightly understand the reasoning behind the play..\n\nAmzn is on a downtrend.. They're probably expecting a 20% profit in the next few months. It also failed to break out of some resistance levels on tuesday and started on a small decline since then. So they probably expect at least a 10% drop or something..\n\nI wonder how much profit they're really expecting to take out of it though..when they'll decide to take their profit or cut their losses. Will they hold through next earnings or sell right after?\n\n\nPersonally I've failed too much at options..", "score": 12, "replies": [{"body": "with leaps there's going to be a wide spread. This person is fairly confident that Amazon is going down, they just don't know when. They will probably milk it until Amazon shows a reversal", "score": 5, "replies": [{"body": "I looked at the potential profits/losses using: http://www.optionsprofitcalculator.com/calculator/long-put.html\n\nHere is the biggest image I can fit on my screen to take a screen shot but you can edit those numbers to see further losses/profits: https://imgur.com/a/m4knoke\n\nIt's also not super accurate but it is kinda close..\n\nAnyways to me, potentially it looks like a really good play. Like although the price for 1 option was 40 k. It doesn't seem excessive to me. The potential losses don't seem too bad. So that is why I wonder how tight the stop losses are. I also wonder what the guy was looking for to make such a huge play like this. Perhaps an IV low enough etc.\n\n\nFor me I've learned I need to take small profits and keep tight stop losses first sign of a reversal like you said. Even if the reversal is tiny and a bull trap.. Because potentially bull traps aren't actually bull traps but actually a full and complete reversal.", "score": 5, "replies": []}]}, {"body": "Talking about resistance levels and 1 year options in the same sentence lol", "score": 1, "replies": []}]}, {"body": "That's incredible, amzn if you will", "score": 28, "replies": [{"body": "Go home.", "score": 4, "replies": []}]}, {"body": "Wait can you decipher for me? Did they buy it on January 8? Why would they pay such a premium for that? ", "score": 6, "replies": [{"body": "Yeah they bought it on Jan. 8th. Expires on Jan 17th 2020. My guess as to why the strike price is so high is that they are trying to limit the chances of losing their entire investment.", "score": 7, "replies": [{"body": "No that’s not why. Implied volatility is extremely high. If you bought atm strikes you’d be paying a lot of extrinsic value. They bought deep ITM strikes because they want to limit the premium they’re paying for the option and have the option move more closely to a short position. These strikes will move nearly 1:1 with the stock price. ", "score": 10, "replies": [{"body": "I traded my first ITM options last week and now i fully appreciate the the flatter theta curve. Good way to trade some profit for less risk.", "score": 2, "replies": []}]}, {"body": "I see. Would this indicate a bearish sentiment to you or a cautious sentiment ", "score": 3, "replies": [{"body": "In my opinion this is a major bearish move from them. You don't dump this much money in a put with that high of a strike price for any other reason than you believe the stock is going to fall. The thing you have to be careful of with large puts is they could be hedges for much larger equity positions, but you would expect to see a strike price that is closer to the current price of the stock with that type of trade.\n\nEDIT: It looks like I was wrong. See the edit to my post. There are two major otm calls, which are likely linked to this put, making this a net bullish position. I assumed any other options would be used to hedge risk on the put because of its price tag, but I was wrong.", "score": 11, "replies": [{"body": "how is it a net bullish position if he paid WAY more in put premium?\n\nthe calls could be the hedge...", "score": 4, "replies": [{"body": "Yeah that is what I was thinking, but when someone called me out as wrong and I saw the matched calls he referenced I was inclined to believe he was correct. After looking at the option profit calculators for these two trades, I'm not really sure what the play is here.", "score": 3, "replies": [{"body": "The calls will only hedge if there is a huge pump next week. They are so far OTM that theta and IV crush will ruin them.\n\nThey also expire before earning.\n\nNot sure why they got the calls at all, it's cheaper to just use a stoploss. \n\nCould it be someone selling the calls to offset the theta of the puts? That's a way to hedge stock position.", "score": 3, "replies": [{"body": "I have your answer: \n\nIt's someone on WSB who doesn't know what he's doing. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Remember when someone was on WSB saying that you'd get a friend to sell an option so you could give money to them when it went against you, and therefore you'd be able to give nothing to your ex?\n\n&#x200B;\n\nYeah, I think Jeff Bezos is giving this a shot. Got a long way to go tbf", "score": 4, "replies": []}, {"body": "Probably looking from Bezos divorce, its gonna come down. Not a bad call", "score": 3, "replies": [{"body": "Strange thing is the trade was made on Tuesday, before the divorce was public knowledge.", "score": 7, "replies": [{"body": "You mean this might be insider trading?", "score": 7, "replies": [{"body": "There is no way the SEC doesn't at least acknowledge a move of this magnitude. If it were insider trading you would expect them to hide it in much smaller option trades. Anyone who looks at unusual option trades will pick this thing up immediately.\n\n&#x200B;\n\nThe funny thing is due to the government shutdown the sec is operating with limited staff rn...", "score": 18, "replies": [{"body": "maybe elon is starting to diddle other billionaires' companies rather than just his own. this is his spit in the face of the SEC.  \n  \ni mean this is most assuredly not the case, but i'm gonna just assume i'm right, like every other thing i'm wrong about. ", "score": 9, "replies": []}]}, {"body": "lmao if you think you can make any real money trading without insider knowledge\n\n", "score": 1, "replies": []}]}, {"body": "Let's help Sec", "score": 2, "replies": []}]}]}, {"body": "> I think it is very unlike that this is a hedge due to how in the money the strike is.\n\nYou would be wrong. ", "score": 3, "replies": [{"body": "Could you explain why I am wrong?", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Thanks for taking the time to write out a reply, and I hope you have a good weekend too. I'll start with my game here. I post to this sub because I know there are people on here who know a lot more than I do, and will call me out if I'm wrong (like you did). \n\nI assumed that any calls matched with this put would be used to hedge risk, since this is the put trade has the highest price tag of any option trade all week. Looking at the data, I can see 1951 otm call contracts worth 26 Mill that have the same expiration date as the 58 Mill put. I think that is strong evidence in support of your argument.\n\nI referenced the high strike price because I was thinking it could be a hedge for a large long position, but its my understanding that a severely itm put would not make sense for that move, as an atm or otm put would be much more cost effective downward risk mitigation.\n\nAs for the weekly report, it is really just a reorganization of data provided barchart's unusual option scanner, as their list of option activity is not very easy to sort through and only provides the last day's trading activity.\n\nThanks again for pointing me in the right direction.", "score": 9, "replies": [{"body": "Thanks for doing something around here. I appreciate you.", "score": 10, "replies": []}]}, {"body": "more money was spent on puts than calls, and if it it goes bearish less money will be lost on the calls\n\nSeems like the person thinks amazon is going to lose a bit of value, but if it ends up rebounding then they'll have a bunch of calls to help ease the pain. The person expects a rebound, if it happens, to occur sooner than later. If Amazon rebounds the calls will likely double in price or better which will cover the value loss from the puts.\n\nMy interpretation is that this is essentially a bet on a large bearish move with the calls being the hedge. It's also a volatility play.", "score": 3, "replies": []}, {"body": "I care", "score": 5, "replies": []}, {"body": ">brain damaged monkey here whats the best resource to learn more about options? also if I have a put that is in the money with robin hood. I don't but if I did how would I exercise it? do I call them?", "score": 1, "replies": []}]}]}]}, {"body": "Remind me in a year!", "score": 2, "replies": []}, {"body": "I don't understand. For a put don't you want the price to go down? Why is the strike 1980? ", "score": 2, "replies": [{"body": "So they retain some of their initial investment if the price rises. An at the money strike would be worthless if the stock price were to increase. With their current position, if the stock increases modestly, they lose some of their investment, but not all of it.", "score": 6, "replies": [{"body": "That logic dont make sense.\n\n&#x200B;\n\nWhy not just invest less money by buying an at the money put?", "score": 7, "replies": [{"body": "Its just like a leveraged short with no possibility of a squeeze. Higher strike means that you are less likely too lose all your money if it rises where if you do ATM you will. Also changes the greek variables.", "score": 4, "replies": []}, {"body": "ya i never got hedging tbh. if youre afraid of something going wrong then just put less money in lol", "score": 2, "replies": [{"body": "If AMZN goes down even just a small amount, the cost of having bought a put is less than the loss you incur from having sold the same dollar-value of shares.\n\nExample:\n\nAMZN is trading at $1640.56 per share today. You own 100 shares. You want to hedge against the price of AMZN falling. You can either\n\nA) Buy a $1980 put expiring 2020/01/17 for $408.40 * 100 = $40,840.\n\nB) Sell some of your shares.\n\nIt's January 17th, 2020 and AMZN is trading at $X. \n\nIn Scenario A, the value of your investment is the value of the put minus its cost when you bought it. 100 * max($1980, $X) - $40,840. **Worst Case**: $157,160. **Best Case**: AMZN is trading above $1,980 and you are only out the $40k it cost to buy the put. [Plot A](https://i.imgur.com/9KT1K2q.png).\n\nIn Scenario B, the value of your investment is $X * (100 - C) + $40,840, where C is the number of shares you sold. Let's say you sold $40,840 worth of shares --- about 25 of them --- instead of buying the put. Your investment is worth $X * 75 + $40,840. **Worst Case**: $40,840. **Best Case**: $40,840 more than Scenario A. [Plot B](https://i.imgur.com/jGD8srY.png).\n\nLooking at the value of your investment in Scenario B minus the value of your investment in Scenario A, you can clearly see that AMZN doesn't have to fall much at all before Scenario A is the winner. [Plot of B minus A](https://i.imgur.com/TqruAXr.png).", "score": 6, "replies": []}]}, {"body": "The time premium is cheaper further out.  As of close Friday the time premium for a 1980 put is $68.  For an ATM put, it’s about $200.  So break even is $1569, vs $1437 for the ATM.  ", "score": 2, "replies": []}, {"body": "ATM and far OTM you get more greeks for your buck, this this has negative effects too. \n\nITM protect you more against the stock price going against you \\[delta, gamme\\] and against time decay and volatility  (there is not much time  value to decay\\]. \n\nWith ITM, you might gain maybe 50% instead of 100%, but you will lose 25% instead of 50% before you have time to react and close a bad position.\n\n&#x200B;", "score": 1, "replies": []}]}, {"body": "In this case, it only makes money if the price drops further away from the strike, if it get close to the strike price then it’s pretty much worthless... correct?", "score": 1, "replies": [{"body": "Basically it's still itm if under the strike but it's not break even if it's like near 1980 during expiration ", "score": 1, "replies": [{"body": "Whoever bought this is some serious bear... like a legit king of bear!!!", "score": 3, "replies": [{"body": "It's probably someone from WSB on their new Robinhood account who has lots of capital but has no idea what he's doing ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "RemindMe! 1 year", "score": 1, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": []}, {"body": "That was me", "score": 1, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": []}, {"body": "HAHAHAHA He opened on my birthday. That's definitely going to go against him considering the bad luck charm I am.", "score": 1, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": []}]}
