{"title": "$50 to $1300 in a week with $AAPL and $FB CALLS", "selftext": "", "id": "952enu", "created_utc": 1533570530.0, "score": 404, "upvote_ratio": 0.94, "num_comments": 132, "comments": [{"body": "Shame you didn't put in 1000", "score": 230, "replies": [{"body": "Now he can", "score": 82, "replies": [{"body": "[deleted]", "score": 204, "replies": [{"body": "The circle of autistic life.", "score": 107, "replies": [{"body": "The markets giveth and the markets taketh ", "score": 22, "replies": [{"body": "And then the government (taxes) taketh and the circlejerk is sad :(", "score": 23, "replies": []}]}]}, {"body": "That's also the spirit", "score": 6, "replies": []}]}, {"body": "That's the spirit", "score": 2, "replies": []}]}, {"body": "I did put in 1k. Pussied out when i got $300 in profit\nKill me\n", "score": 16, "replies": [{"body": "At least you made a profit, look at some of the YOLO's and how much they lost that should make you feel better", "score": 18, "replies": []}, {"body": "Gainz are gainz man. ", "score": 7, "replies": []}, {"body": "No one ever went broke taking profit", "score": 4, "replies": [{"body": "Nice try, Ally rep.", "score": 5, "replies": []}]}]}, {"body": "Shame he didn’t put 10000", "score": -3, "replies": []}]}, {"body": "Now put it all in MU 17 Aug $54 calls.", "score": 62, "replies": [{"body": "So you're saying theres a chance?", "score": 18, "replies": [{"body": "Always a chance my man.\n\n*Caveat: I'm not a firm believer in max pain, though I am collecting data on some stocks and will do some data analysis in a few months to see how effective it is for those stocks at predicting future values*\n\nMax pain for 8/17 MU is $57.50.  It's a monthly expiration date which some argue (and I don’t have the data yet to argue against, yet, but I’m colleting it as we go) that MU tends to finish within a very tight window of the max pain value for monthly expirations.  So buying $54 calls right now would be fairly cheap ($72 per contract) and if MU somehow did finish at $57 next Friday they would be up 3.16x ($300 vs $72) which is pretty damned good.  Of course as more people buy lower strike prices, the max pain value will change.  I wouldn’t be surprised at all if MU max pain for 8/17 *on* 8/16 is probably going to be $55.  All that said on 7/20 max pain was $55, the day before MU was at $56.22, and with zero negative news at all MU finished that Friday at $55.02.\n\nI’m not doing it, though, not calls at least.  I might consider spreads if MU can have a *few* flat/green days this week.\n\nFor the weekly values for the last few months MU has typically missed by at least 3%, and that’s on the downside.  Plus max pain changes day to day depending on options outstanding.  Consider the 8/3 value.  Max pain for 8/3 *was* $55 at one point, and then by week’s end it was down to $54 (and MU finished at $52.81).\n\nSomething similar has happened with 8/10 max pain.  It was at $55, then last Friday it was at $54, and now it's at $53.", "score": 16, "replies": [{"body": "Max Payne was pretty cool. The game. Not the movie.", "score": 23, "replies": [{"body": "Max Payne was one of those few games that had a plot perfectly fit to be an absolutely killer movie, and then Hollywood just found a way to fuck it up anyway.", "score": 5, "replies": []}]}, {"body": "I don't know anything; where do I collect max pain data?", "score": 1, "replies": [{"body": "I use this\n\nhttp://www.opricot.com/ticker/mu/optiongraphs", "score": 5, "replies": []}]}]}]}, {"body": "does that mean i only pay 54 bucks? ", "score": 1, "replies": [{"body": "$54 strike, each contract was going for $77 just befor market close.", "score": 2, "replies": []}]}]}, {"body": "Imagine you worked at mcdonalds one more day and had $100 to start with in your account ", "score": 132, "replies": [{"body": "WSB talks shit about RH constantly. Plenty is deserved.\n\nBut the barrier to entry just went away. Anyone can play, now.", "score": 90, "replies": [{"body": "Yeah but if all your friends drive Ferraris are you going to brag about how cool your civic is? Us robinhood fags need to hold each other accountable.", "score": 36, "replies": [{"body": "We may be fags but at least we know our place.", "score": 10, "replies": [{"body": "PM me.", "score": 1, "replies": []}]}, {"body": "Damn if you paid for that civic with cash you can brag. We need to stop pretending people who use this site actually have money. We all broke on this blessed day. ", "score": 3, "replies": []}]}, {"body": "Anyone could play on E*Trade in the 90's. Now you can play while you're taking a shit at work for 45 minutes.", "score": 5, "replies": [{"body": "Are you following me?", "score": 4, "replies": []}]}, {"body": "What was the barrier to entry?", "score": 4, "replies": []}]}]}, {"body": "Sell man. Take profits and take longer plays.. trust me. Your luck with fds will run out", "score": 103, "replies": [{"body": "My luck ran out before I started ", "score": 21, "replies": [{"body": "...Update when you’re back to $50", "score": 2, "replies": [{"body": "Actually, I lost on all my good, safe spreads. The only time I was raw-doggin it on a straight FD call was apple earnings and I got paid. \n\nNow I just day trade SPY and it's way better.", "score": 3, "replies": [{"body": "I did a single FD of $19 8/10 $AMD call when it was at $18.20 and sold today as soon as it hit $19.50. I made a nice $40 off that and promptly decided never to do that again. ", "score": 4, "replies": [{"body": "I held a call on apple that I picked up right after their earnings when everybody was getting hyped about them maybe hitting $1trillion market cap. Held it overnight and woke up to see that I had $278 profit on a $243 position. Was very happy and sold immediately. Helped undo the damage of my Facebook spread that got blown the fuck out ", "score": 3, "replies": []}]}]}]}]}]}, {"body": "How the fuck", "score": 25, "replies": [{"body": "here are the main plays\nhttps://imgur.com/a/V9wonYe", "score": 23, "replies": [{"body": "Charge your phone", "score": 35, "replies": []}, {"body": "$10 put on snap. Thad be close to the lowest it’s ever been. I like it. ", "score": 5, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Idiot", "score": 0, "replies": []}]}]}, {"body": "How do you spending less than $100 on calls I can't hardly find a trade that cheap unless these are FD$", "score": 18, "replies": [{"body": "I think you answered your own question", "score": 54, "replies": []}, {"body": "Lol. This is wsb. Everything's an FD.", "score": 10, "replies": []}, {"body": "Dude, you think he went long on $50!?", "score": 12, "replies": []}]}]}, {"body": "How do I join your chat room for tenders ", "score": 16, "replies": [{"body": ">tenders\n\n", "score": 24, "replies": []}, {"body": "That's not a chat room it's an app", "score": 1, "replies": [{"body": "which app?", "score": 1, "replies": [{"body": "Grindr ", "score": 18, "replies": []}]}]}]}, {"body": "Now you need to max out credit loan and do it again. ", "score": 16, "replies": []}, {"body": "Leave some tendies for everyone else big guy.", "score": 13, "replies": []}, {"body": "10K to 50. 50 to 1.5k ??", "score": 11, "replies": []}, {"body": "How do you even afford an FB call with $50?", "score": 9, "replies": [{"body": "Very far OTM. $.50 a share ", "score": 6, "replies": []}]}, {"body": "How did you buy those calls with only 50 bucks", "score": 5, "replies": [{"body": "Super OTM calls", "score": 23, "replies": []}]}, {"body": "Wait a few days back to 50, and then buy some $ROPE", "score": 3, "replies": []}, {"body": "I'm impressed. With such little amounts of capital, people tend to fail with options.\n\nNow double down on $MU and learn what rape feels like.", "score": 3, "replies": []}, {"body": "Sorry if this is a stupid question, but why are the last four digits gold?", "score": 4, "replies": [{"body": "This is a stupid question but they're red because he took a screenshot at 9:46am when the market was open and prices were fluctuating up and down", "score": 7, "replies": []}]}, {"body": "Must be nice ", "score": 2, "replies": []}, {"body": "HOW DO YOU FUCKS DO THIS ", "score": 2, "replies": []}, {"body": "Gains is gains. \n\nGood play.", "score": 3, "replies": []}, {"body": "Weeklies or longer? What's your average time frame?", "score": 1, "replies": []}, {"body": "Great, now take it to $33,800.", "score": 1, "replies": []}, {"body": "Teeennnnnbahgggaaaahhh", "score": 1, "replies": []}, {"body": "How did you get a premium for APPL/FB less than $50?", "score": 1, "replies": []}, {"body": "1000% !!!!!", "score": 1, "replies": []}, {"body": "What did you call I don’t understand?", "score": 1, "replies": []}, {"body": "Dude i did the same thing but it was more like 1000 to 50 in a week", "score": 1, "replies": []}, {"body": "I'm thirsty for these kinds of gainz.", "score": 1, "replies": []}, {"body": "What app is this", "score": 1, "replies": []}, {"body": "Can someone tell me how risky this is and bad of an idea it is to copy (please)", "score": 1, "replies": [{"body": "These are past trades you cant copy. ", "score": 3, "replies": [{"body": "Oh I meant options trading like this in general", "score": 1, "replies": []}]}]}, {"body": "what app is this?", "score": 1, "replies": []}, {"body": "Hold or sell my $192.5 and $200 FB 8/24 calls??", "score": -4, "replies": [{"body": "Hold until you're back to $50", "score": 55, "replies": [{"body": "will do ", "score": 2, "replies": [{"body": "How do you buy options so cheap?", "score": 4, "replies": [{"body": "You can trick the RH app by setting your phones clock a few hours back and buy at a better price", "score": 30, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "It's not tho", "score": 2, "replies": [{"body": "Fine I'll delete that shit. ", "score": 2, "replies": []}]}]}]}, {"body": "But really shit options with no chance of being worth anything in 4 days from now when they expire ", "score": 2, "replies": []}]}]}]}, {"body": "We come here for losses. ", "score": 10, "replies": []}, {"body": "Theta ramps up during the final 20-30 days so your fighting an uphill battle by holding.", "score": 2, "replies": []}, {"body": "I would sell the FB 200 calls, keep the 192.5. ", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}]}, {"body": "Double down, pussy.", "score": 0, "replies": []}, {"body": "WHat apps do you guys use?", "score": 0, "replies": []}, {"body": "This, this is what I need to learn.", "score": -8, "replies": [{"body": "Oh man. Please just save for awhile first. ", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": -8, "replies": []}, {"body": "Wait? Don't you need to buy 100 shares for it to work? Like how did you get it with 50?", "score": -10, "replies": [{"body": "bruh", "score": 5, "replies": []}, {"body": "Lmao wut ", "score": 6, "replies": [{"body": "How do you buy calls with only 50$? The minimum is 100 shares which should cost a lot for Apple and Facebook. ", "score": -4, "replies": [{"body": "Upovoted for visibility... this guy thinks you have to actually buy the shares lol", "score": 16, "replies": [{"body": "Then what are you buying?  I admit am a noob with enough cash. Just dont want to lose it quickly. ", "score": 0, "replies": [{"body": "Pro-tip: don't buy options since you clearly have no idea how they work. You will probably lose everything... even when you DO know how they work, they can be dangerous due to immense leverage and poor risk management that seems to be common among people. \n\nOptions let you have leverage by enabling you to have a contractual right or obligation to buy/sell 100 shares of the underlying asset per option contract. ", "score": 5, "replies": [{"body": "Honestly never found a video or forum where it's actually explained clearly. Thought you guys might know something. ", "score": -4, "replies": [{"body": "this is the worst possible sub to ask questions because it assumes knowledge beforehand. other subs can be more helpful.  \n\nAnyway, today's your lucky day. Here's a briefer.  \n\nSay stock A trades at $100. if you buy a share you spent $100. If A goes to 105, you made $5 off $100 investment.  \n\nNow say there is an option to buy 100 shares of A at 103. That option costs $100. Now, if A goes to 105, 105-103 = 2, x100 = $200 cash off $100 investment. Since it costed $100, 200-100 = $100 actual profit. If A goes to 106, then you profit $200; for every point above 103 A goes to, you make $100.   \n\nNow, say A shits the bed and drops to $50. Your share drops from 100 to 50, losing $50. Since there is no point in purchasing A for 103 when it is at 50, the contract is worthless. However you do not lose more than how much you paid for the contract, so you lose $100. So it's very safe downside with huge unlimited upside.  \n\nSo what's the catch?  \n\nThere is an expiration date for contracts. The above example is considered a cheap contract, expires in a week. If in 1 week A goes to 102.9, your option is worth $0. You lost $100. However if you had a share, you still profit $2.90. For this reason, options are bought if you expect a huge change in price. If the options don't move, or if it goes down even slightly, you will lose money.", "score": 10, "replies": []}, {"body": "Watch TastyTrades intro to options. \n", "score": 8, "replies": []}, {"body": "Googling 'how do options work' was too hard?  All of the first 200 results explain it clearly", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Are you serious??? Lol", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "What do you do with the contracts? Is that what your buying and selling with options? Not stocks?", "score": 1, "replies": [{"body": "I'm not sure what the guy you replied to was thinking or if he unintentionally made a typo, but options are themselves contracts. Each contract deals with 100 shares of the underlying, not \"100 contracts\".\n\nWhen you buy options, you are essentially purchasing the option to buy or sell shares of a particular stock from or to somebody at a specific price within a specific time range for some amount of money (the premium).\n\nSo, if I buy a call option for AAPL with a strike of 206, I now have the ability to buy 100 shares of AAPL stock at 206 per share. \n\nYou can see why having to hold 100 shares of AAPL stock in order to buy more AAPL stock doesn't make sense.", "score": 4, "replies": []}, {"body": "Wow dude Google.  Get out of here", "score": 2, "replies": []}]}]}]}, {"body": "I've been using RH for about a week now but i don't undersatnd this.. what is a call, how do you get an apple call for only $50 if apple stocks are worth $200 +?", "score": -22, "replies": [{"body": "If you've only been investing for a week, I highly suggest not trading in options. Buy currency futures on margin.", "score": 24, "replies": []}, {"body": "no one tell him", "score": 38, "replies": [{"body": "Honestly it's probably better we don't.. for his own good", "score": 22, "replies": []}, {"body": "maybe his country don't have teh googles", "score": 8, "replies": []}, {"body": "He knows he is a dumbass. Nothing left to say.", "score": 1, "replies": []}]}, {"body": "Buy $50 worth of apples call your mom. ", "score": 6, "replies": []}, {"body": "If you buy calls at $50 they give you the $150 cause that’s how much it’s worth. It’s the easiest way to make money that not many people know about", "score": 5, "replies": []}, {"body": "How the fuck can you not know what a call is if you’ve been browsing WSB for more than 10 minutes?", "score": 6, "replies": []}, {"body": "Lol... just wow.  Google is your friend.  ", "score": 1, "replies": []}]}]}
