{"title": "The U.S. Trade War is starting to ramp up. How are you positioned to profit from it?", "selftext": "Oil slips as trade war worries outweigh Iran sanctions - https://www.cnbc.com/2018/08/31/oil-prices-dip-on-concerns-sino-us-trade-conflict-could-escalate.html\n\n\nHere is a summary of my current positioning and trades. \n\nClosed Positions Thursday \n\n1. Sold VIX Calls\nSeptember-19th-12 Strike\nBought at 2.80 & 2.15\nSold at 2.65\n(7.82% Gain)\n\nOpened Positions Thursday \n\n1. Bought More GDX Calls\nSeptember-21st-20 Strike \nBought at .11\n\nCurrent Short Term Outlook:\n\n1. Bullish Gold Miners\n2. Bearish Oil & Gas Co's\n\nCurrent Open Positions:\n\n1. Long GDX Calls Sept-21st-20 Strike\n(.53 Average Cost Basis)\n\n2. Long XOP Puts Sept-21st-42 Strike\n(Cost 1.16)\n\n13.38% Average Gain per Trade in August \n\n15 Closed Trades in August\n200.81% on all Closed Trades", "id": "9bsoqy", "created_utc": 1535713818.0, "score": 123, "upvote_ratio": 0.87, "num_comments": 95, "comments": [{"body": "Not worried. Trade War talks and tariffs have been going on for awhile now. The ones that did worry sold a lot already and went more cash, yet we have still been rising steadily for a few months now. If some other news on stricter tariffs happens, the market will go done for a week, then keep rising again. It's all still just news. Like Brexit, Trump tweets, Turkey, whatever. One bad week, followed by a couple months of gains.\n\nI think it will take 1 or 2 really bad quarterly reports in a row by major companies hurt directly due to the tariffs that would turn the economy for the worse. But until then...just keep enjoying the ride up. ", "score": 67, "replies": [{"body": "Good input.  \n\nLike your take on this subject.", "score": 13, "replies": []}, {"body": "Yup, plus the market turned more positive on the initial US-Mexico trade framework being made, once Canada joins a trade deal it'll ease a lot of market anxiety. It's all a bunch of dick waving till then. ", "score": 6, "replies": []}, {"body": "Definitely agree with your reasoning.  But I learned to never underestimate how much dumb money is in the market, especially this year.", "score": 0, "replies": [{"body": "This year? Hahaha please. People have been talking about this dumb money since when I started in early 2015. And I've only been in the game for 3 years. Yes the market will go down big at some point. Who cares if you're young. It will go back up again. Stocks are not overly valued either.", "score": -1, "replies": []}]}, {"body": "I'm with you on this.  There isn't anything looming in the distance that will really drive the market down (except maybe increase in fed interest rate).  The tariffs won't affect the majority of companies.  The market is strong, unemployment is low.  If there is anything good to be said about Trump it is he knows how to get the economy churning.\n\nAdditionally, he is hard on our allies for defense spending.  Since the US sells 40% of the world's arms this will help the defense sector.", "score": 1, "replies": [{"body": "isnt there concern about new tariffs that may affect more companies?", "score": 1, "replies": []}]}]}, {"body": "Took some profits, paid some loans. Waiting a bit now with higher liquidity. ", "score": 38, "replies": [{"body": "Good move. ", "score": 5, "replies": []}]}, {"body": "I'm reducing my debt, refinancing my house to a shorter loan and lower interest rate.  I don't know what the trade war will do to the economy, but I'm battening down the hatches, so to speak.", "score": 54, "replies": [{"body": "It's good to take precautions now before it's too late. ", "score": 20, "replies": []}]}, {"body": "How do you really prepare yourself to minimize losses though?", "score": 6, "replies": [{"body": "Raise cash.  Reduce your risk exposure. \n\nThis way if anything crazy does happen you can take advantage of much lower asset prices than current levels.", "score": 25, "replies": []}]}, {"body": "$MRO’s domestic production will be strengthened. I’m going to hold that. ", "score": 3, "replies": [{"body": "Domestic companies will definitely fare better in an international trade war. ", "score": 4, "replies": [{"body": "Not necessarily when there are equal tariffs that domestic companies export to.", "score": 4, "replies": [{"body": "I'm talking about U.S. companies that don't do business overseas.", "score": 6, "replies": []}]}]}]}, {"body": "“Relative advantages” are weakening, reduce exposure to international conglomerates \n\nI haven’t had a strong divergent thesis for a while so I’m diversified \n\nStocks climb a wall of worry tho so I’m barely holding any more cash than I normally would. I’ll take my money out when the doomsayers get in, not holding my breath. \n\nWill buy up when scared headlines come", "score": 4, "replies": [{"body": "We have been seeing scared headlines for awhile now...  yet no major decline", "score": 4, "replies": [{"body": "That’s why I’m >80% in stocks now\n\nIf they tel me the sky’s falling ill got 100% or more, etc", "score": 2, "replies": []}]}, {"body": "Good point. ", "score": 1, "replies": []}]}, {"body": "Buy more Square? They don't seem to give a shit about trade wars.", "score": 4, "replies": [{"body": "Your probably right lol. ", "score": 2, "replies": []}]}, {"body": "Profit? \n\nhahahah\n\nI'm JD, IQ bagholder. We march to hell.", "score": 3, "replies": [{"body": "Yikes.   Sorry man. ", "score": 2, "replies": []}]}, {"body": "Long VIX", "score": 6, "replies": [{"body": "Probably moving higher in September ", "score": 7, "replies": []}, {"body": "What these Roman numbers refers to?", "score": 4, "replies": [{"body": "You're kidding right?", "score": -3, "replies": [{"body": "No, I'm Eloning", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Yes it could. ", "score": 1, "replies": []}]}, {"body": "Shorting the VIX", "score": 3, "replies": [{"body": "Ok. \n\nSo your betting that this is all noise and that a deal will be done sooner rather than later?", "score": 4, "replies": [{"body": "While I wouldnt short vix I agree with what you took away from that and I personally see much of a chance for China especially if new deals get negotiated with the rest if the western nations.", "score": 2, "replies": [{"body": "Ok cool. Thanks for your input. ", "score": 1, "replies": []}]}]}]}, {"body": "Just buying dips. America always comes out on top. \n\nTake profit from your winners. Keep a pile of cash to buy when the dumbasses at CNN freak out over something. Buy. Take profits. Rinse repeat. ", "score": 14, "replies": [{"body": "American public isnt giving away their shares anymore on news. We smartened up.", "score": 3, "replies": []}, {"body": "Honestly this is right. Let the fake news stir the illogical into a sell off, then buy the dips that they have made.", "score": 1, "replies": [{"body": "Yep.  Couldn't agree more. ", "score": 4, "replies": []}]}, {"body": "I agree.  \n\nGreat input!", "score": 2, "replies": []}]}, {"body": "Economy remains strong and yet to overheat although inflation is likely to eventually cause consumer spending and confidence to fall. But in the interim weakness into late September and another buy opportunity then into November. S&P500 by 3000 by end of this year early next year. \n\nTariffs are price increases to offset price increases industrial production must increase. You can see this in capacity utilisation data beginning to tick up. Demand is there and absorbed by companies who will continue to hire. More jobs equals more spending and hence higher earnings. Inflation is the risk on the horizon and must remain vigilant by monitoring data.\n\nI post updates on Twitter too \nhttp://www.twitter.com/markettim3r", "score": 2, "replies": [{"body": "Thanks for your input. ", "score": 2, "replies": []}]}, {"body": "Most of my savings are in Gold ETFs, house upgrade was financed through 5-year fixed/low interest rate debt.", "score": 2, "replies": [{"body": "So you’re slowly bleeding away your savings?", "score": 6, "replies": [{"body": "Nope, still cashing in from the rest while I also sleep well knowing gold will take off when biowaste will hit the fan.", "score": 2, "replies": [{"body": "Yeah and it will keep going down otherwise. Silly.", "score": 2, "replies": []}]}]}, {"body": "Cool ", "score": 1, "replies": []}, {"body": "This is very dumb. Very very dumb. A little bit of gold is okay but most of it? Are you serious :/", "score": 1, "replies": [{"body": "Yes, gold around at a very late economic cycle is very dumb. Let's go all-in in inflated stocks instead.", "score": 2, "replies": [{"body": "How do you know it's a late cycle? No one knows for sure given how strong all economic indicators are. Have fun losing money every day by keeping gold lmao\n\nhttps://www.bullionvault.com/gold-news/gold-bullion-08312083", "score": 1, "replies": [{"body": "Well: 1. Time/length of this cycle 2. Interest rates creeping up 3. Indebted consumers (US households as indebted as in 2008) 4. The total all-in behaviour of investors like yourself ('be fearful when others are greedy'). Gold is stable value, I simply changed today's gains in exchange for tomorrow's value opportunities.", "score": 0, "replies": [{"body": "1 is noise. 2 is fine and actually long overdue if the economy is strrong. 3 are you kidding me? Debt has been a problem for a while. All in behavior? hahaha i'm not even all in. What kind of moron goes all in stocks. What I am however is invested in stocks long for a few years now. You sound very ignorant. You'd be better of reading up on investing principles including dollar cost averaging and time in the market > timing of the market. Also for the record 15-20% of savings in gold is fine and probably good as a hedge. I just think you're incredibly silly to have most in gold.", "score": 3, "replies": [{"body": "'Interest rate hike long overdue' as economy is strong based on credit fueled consumption, and a one time tax cut boost. Households are as leveraged as you get, housing inflation way outstrips wage increases. So if this doesn't ring off the alarm bell, then go on, you will be among those losing on the next crash - who will be silly at the end?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "shorted the US", "score": 1, "replies": [{"body": "Shorted the US Dollar or US stock market?", "score": 5, "replies": []}]}, {"body": "If I had more liquidity atm, I'd be accumulating China e-commerce, which has taken a big hit.  No rush though, could get worse before it gets better. ", "score": 2, "replies": [{"body": "I agree that when the trade war is resolved, China e-commerce stocks should come roaring back. ", "score": 3, "replies": []}, {"body": "I think the entire Chinese economy is a house of cards.  \n\nRead a report this week that says the average Chinese person makes less than the average Mexican.  The majority of the population doesn't have enough income to keep the economy moving forward, especially with tarrifs in place.\n\nBanks are going to start calling real estate loans and then start to collapse with no available reserve while sitting on a pile of foreclosed assets that they can't get rid of because nobody has money.", "score": 3, "replies": [{"body": "Can't say I know anything about that. I just know the Chinese e-commerce market already dwarfs the U.S. market, and half the country doesn't even have internet yet. ", "score": 1, "replies": []}]}]}, {"body": "MRO is hitting their cyclical high at <$22. Good time to buy puts for $21 2-4 weeks out. It will go back to around $19 ", "score": 1, "replies": [{"body": "I agree. Thanks for your input. ", "score": 2, "replies": []}]}, {"body": "Putting more in Sq, dbx, weed stocks and lot more into crypto than in past ", "score": 1, "replies": [{"body": "Nice. Thanks for your input and positioning. ", "score": 1, "replies": []}]}, {"body": "Some fundamental bullish underpinnings for crude to be aware of\n- Iranian sanctions (as you mentioned)\n- Congestion in permian infrastructure looking to constrain crude growth from here to about this time next year\n- 19/20/21 have an ‘air pocket’ of non opec offshore supply growth. Basically the capex that wasn’t spent by Brazil Russia ect during 14/15 on long lead projects is finally showing up (after seeing start ups over the last 4 years from projects that were started in 11-14)\n- inflation is present and yeilds have had some response to it. They playbook here is to go long commodities for the late stage rally. Crude isn’t really exempt from these as the inflation of other commodities (Steel copper ect) will raise the supply cost of crude. More of a 2 yr affect but still there. ", "score": 1, "replies": [{"body": "Thanks for your input. ", "score": 1, "replies": []}]}, {"body": "Wow awesome.\n\nI just posted something similar (not near as detailed) about going long barrick gold and agnico gold.", "score": 1, "replies": [{"body": "Nice.  Definitely long term value plays here. ", "score": 2, "replies": [{"body": "I sure hope so.  I keep hearing some pretty negative opinions on my move.  I did barrick and angico.  My money's already in so I wont be moving it anytime soon.", "score": 1, "replies": [{"body": "There's always negative news during a major correction in a sector. ", "score": 2, "replies": []}]}]}]}, {"body": "I have always worked in sales.\n\nBut I just switched from one that is purely commission (and more susceptible to a bad economy) to to one that has a fairly good base salary.\n\nGood job security at both. \n\n", "score": 1, "replies": [{"body": "Ok. So you want to make sure you have Security with your income no matter what happens.  I feel you. ", "score": 2, "replies": [{"body": "Yup. Also there were other factors that didn’t directly involve finances, such as my Work-life balance being better and getting paid OT if I worked OT. \n\nSo far looks like a good move, and if the economy tanks then it will be a great move.", "score": 1, "replies": [{"body": "Sounds like a great move no matter what happens. ", "score": 1, "replies": []}]}]}]}, {"body": "I'm positioned all in Chinese stocks because this will pass and when it does, China will be flying.", "score": 1, "replies": [{"body": "So you feel that this trade war will be resolved relatively quickly and if that's the case the beaten down Chinese market should outperform the U.S. market. \n\nThanks for your input and position. ", "score": 2, "replies": [{"body": "Am I the only skeptic on all of this. All of you seem so convinced of doom and gloom with China. As far as I'm concerned it's simply another buying opportunity in the market and people won't be interested until the stocks have already rocketed. ", "score": 5, "replies": [{"body": "You could be right.  And if the trade war gets resolved quickly you will profit immensely. \n\nThanks for your stance and your input. Investors need to hear both sides. ", "score": 2, "replies": [{"body": "Thanks. I mean how else does one profit?? Buy the fear. It's not rocket science. May take some patience for resolution, but everything gets resolved in time. Once the trade war resolves, the next topic will arise in the market, scare people out, and then I'll swoop in. ", "score": 1, "replies": [{"body": "I agree.  Great input!", "score": 1, "replies": []}]}]}]}, {"body": "Trade war will also hurt the U.S. It will fuel inflation, and could prompt the FED for rate hikes. High enough rates will make the indebted households stop consuming.", "score": 1, "replies": [{"body": "That's true. But then the Fed could come back and lower rates to support the market.", "score": 1, "replies": [{"body": "If the Fed does that, then the inflation will be boosted again - and inflation target is their goal #1 if I'm not mistaken.", "score": 1, "replies": [{"body": "Stability is their # 1 goal. ", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Don't you think a lot of that is priced in over the last 25 news flashes/tweets from Donnie?", "score": 1, "replies": [{"body": "No, a lot of people dont fully realize the extent to which some of their companies steal IP from the us. It's going to hurt a few of em", "score": 1, "replies": []}]}]}]}, {"body": "Buying BABA on the dip", "score": 1, "replies": [{"body": "Ok cool", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yes it is. \n\nThe question is is this the dip in BABA or is there much further to go?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol I feel you bro", "score": 1, "replies": []}]}]}]}]}]}, {"body": "My only position right now is Long AMD and it's 80% gain. Will be holding till it reaches 35. ", "score": 1, "replies": [{"body": "So that means you have a lot of cash for Opportunities that might come up.  Nice. ", "score": 1, "replies": []}]}, {"body": "By not holding Chines stocks\n\nUS stocks with minimal trade exposure \n\nBought VXX \n\nHave cash on hand ", "score": 1, "replies": [{"body": "Cool.  Thanks for your input and position. ", "score": 1, "replies": [{"body": "Alger Small Cap Fund is doing fantastic \nSmall cap no trade problems \n", "score": 2, "replies": [{"body": "Great.  Investors need to hear this.  Thanks. ", "score": 1, "replies": []}]}]}]}]}
{"title": "Trump considers indexing capital gains to inflation", "selftext": "", "id": "9bsmo2", "created_utc": 1535713246.0, "score": 104, "upvote_ratio": 0.9, "num_comments": 164, "comments": [{"body": "Anyone else notice the massive amounts of people posting in here lately who aren't greedy sociopaths? \n\nFucking commies. ", "score": 164, "replies": [{"body": "Poor greedy sociopaths would be in favor of money redistribution in their direction. ", "score": 42, "replies": [{"body": "They need to just stop being poor.", "score": 32, "replies": [{"body": "But they need money for that.", "score": 4, "replies": []}, {"body": "Yeh! Pitchforks! Fire! Yeh! ", "score": -6, "replies": []}]}, {"body": "I realized something long ago that actually gave me a newfound respect for poor communists: **they're actually just capitalists in disguise**.  \n\nI'm sure we'd gladly approve of someone using conniving or even illegal measures to improve their financial situation. Communists want just that: to steal other people's money and put it into their pocket. The true capitalist way.  \n\nTrue bleeding hearts are too busy off in the congo or whatever shit helping people who live 5 families to a 500sqft mud hut and not what-the-fuck-ever concerned about the inequality between americans.", "score": 20, "replies": [{"body": ">they're actually just capitalists in disguise.\n\nno shit theres a podcast popular with reddit commies and those fuckers rake in [$105,355+ a month](https://www.patreon.com/chapotraphouse) on patreon to spew whatever commies like to hear while living in some lofts in nyc.", "score": 16, "replies": []}]}]}, {"body": "Long term stability is good for business. ", "score": 2, "replies": []}, {"body": "For real lol. \n\nI'm honestly surprised at the level of Trump hate in this sub sometimes. You think it would be less REEEEE than the rest of Reddit but it's still up there ", "score": 3, "replies": [{"body": "Reddit is like if you beat your sister enough in the head she joined antifa. That’s the level of socialism this site supports by and large ", "score": 1, "replies": []}]}]}, {"body": "what's the inflation on 1 week?", "score": 34, "replies": [{"body": "6", "score": 8, "replies": [{"body": "So half dozen?", "score": 3, "replies": []}]}]}, {"body": "If I hold cash, can I report capital losses due to inflation?\n\nHell, just doing that would net me a better result than the trading I'm doing.", "score": 26, "replies": []}, {"body": "While we're at it, eliminate the dividend tax. That's actual double taxation. ", "score": 18, "replies": [{"body": "I prefer to make dividends an expense to the corporation, giving it the same treatment as salaries, interest, etc. Then make it regular income to individuals.\n\nThe strength is that it’s more progressive and plays much better policitically. (LSC would remain retarded, but it’s easier to explain “company gave the money to people who paid taxes” than “rich person didn’t pay taxes because a corporation paid them for him”.)\n\nThe weakness would be a further departure from GAAP, but tax policy always does that anyway.", "score": 5, "replies": [{"body": "Sure, I'd be okay with that too. I think eliminating the dividend tax would be a lot easier to do than changing accounting rules significantly ", "score": 2, "replies": []}]}, {"body": "How do you figure? It's income.", "score": -1, "replies": [{"body": "As a shareholder, I already pay taxes on corporate profits. Dividends are distributed from post-tax income. \n\nThen, when I as a shareholder, receive my share of profits from Dividends, I have to pay taxes again. ", "score": 12, "replies": [{"body": "You pay taxes, get paycheck, risk money by buying stocks, stock goes up, you pay taxes on it again. Is there anything this government won't tax?", "score": 2, "replies": []}, {"body": "> As a shareholder, I already pay taxes on corporate profits....Then, when I as a shareholder, receive my share of profits from Dividends,\n\nAnd how does that tax rate compare to your marginal income tax rate? My guess, it’s a lot less. Not to mention the tax benefit of unrealized capital gains.", "score": -1, "replies": [{"body": "Moron\n\nOk now that’s out of the way, let’s do some extremely simple math.\n\nCorporate income tax:21%\nLeftover: 79%\nQualified dividend tax rate: 15%\nLeftover: 63.75%\nTotal tax rate: 36.25%\nUsed to be a total rate of 45% before the tax change.\n\nLet’s do capital gains while we’re-oh yeah it’s the same.\n\nOne more for good measure - Moron", "score": 2, "replies": [{"body": "You realize that there’s a difference between the corporate income tax rate and the effective corporate income tax rate right? Most publicly traded companies pay an effective tax rate well below 21%. When the rate was 35% Apple, which mints money, was paying an effective rate of 25.8%. And you never did mention what your marginal income tax rate is. Here in California the marginal tax rate I pay on $1 of extra income is 40.5%.", "score": -1, "replies": [{"body": "You do realize if it were effectively half which it absolutely isn’t especially for multinational companies it’d still be a 25% rate.\n\nIt’s ok, you’re a moron and you were wrong. Just let it go. Even when confronted with how dumb your point was, and an easy tutorial to compute it, you tried to defend it again, still seemingly unable to do the simple computation that shows you’re wrong.\n\nCompanies out there aren’t paying 10% on their income and if they were you’d still be wrong.\nWhy even comment?", "score": 2, "replies": [{"body": "By my math a 25% rate is a lot less than the 40.5% marginal income tax rate I’d pay on $1 extra dollar of income.\n\n> Companies out there aren’t paying 10% on their income and if they were you’d still be wrong. Why even comment?\n\nDamn bro, you suck at math. What is your marginal income tax rate? Is it more or less than 25%?\n\nhttps://itep.org/the-35-percent-corporate-tax-myth/", "score": 1, "replies": [{"body": "Median income is $60k, making the median marginal rate 22%\n\nEven by halving the effective rate, you’re still wrong.\n...and here you are smug about it.\nIt’s almost impressive. Almost", "score": 2, "replies": [{"body": "Lol, how much money are these middle class households investing in the stock market outside of tax advantaged retirement accounts?", "score": -1, "replies": [{"body": "On WSB?\nProbably 90% minimum.\n\nBrother put down the shovel the grave was deep enough hours ago.", "score": 2, "replies": [{"body": "LOL, you buried yourself a few posts ago with your ignorance.", "score": -1, "replies": [{"body": "Pure denial as a tactic... yeah it might work.\nIt won’t make your assertion that dividend taxation isn’t double tax any less wrong and moronic, but it may be a good exit strategy.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Cheeto man does it again", "score": 54, "replies": [{"body": "[removed]", "score": -14, "replies": [{"body": "I guess you don't understand what that means as much as I do. ", "score": 2, "replies": []}]}]}, {"body": "Good for MU?", "score": 27, "replies": [{"body": "If you have to ask...", "score": 11, "replies": []}, {"body": "This is bad for MU.", "score": 1, "replies": []}]}, {"body": "Next Step: Pardon Martin", "score": 23, "replies": [{"body": "I wonder if we can start some kind of petition for this ", "score": 4, "replies": [{"body": "Yes, yes we can ", "score": 2, "replies": []}]}]}, {"body": "oh donald you are a fucking madman!  juice the market more more more", "score": 5, "replies": []}, {"body": "Obviously this is going to be a popular idea on this sub but to put things into perspective, this is basically a $100 billion tax cut for people who are already extremely wealthy, at a time when the national debt is ballooning dangerously, at a time when defense spending has been needlessly increased by $74 billion, and when Trump just cancelled federal workers inflation adjustments to their salaries because he claims the budget can't afford the extra $25 billion.\n\nCapital gains tax laws are already very generous to investors who admittedly are taking on risk, but who often make enough passive income in gains/dividends to easily beat inflation and not have to work for a living. The laws should stay as they are.", "score": 134, "replies": [{"body": "[deleted]", "score": 31, "replies": [{"body": "Wait until the hangover hits.", "score": 12, "replies": [{"body": "ima store all my cash in bottlecaps so i can buy the dip after the apocalypse", "score": 3, "replies": []}]}, {"body": "its a game of chicken don't hit my tendies between the FEDs raising rates to unwind the Quantitative tendies and the WH wanting a strong econ leading up to re-election.\n\nwhats left is cutting gov't programs the biggest of which is SS and Medicare which is like playing with fire of the rage of older voting demographic who would shit a brick if they touched their SS or Medi even though the rest of us know its just a mater of time before SS is insolvent because politicians taking money out for side projects. He won't decrease military spending the second biggest drain because it keeps jobs. What else is left? he is already gutting departments. My guess is with all these tax breaks we are just passing the buck to the next generation to pay our tab.", "score": 3, "replies": []}]}, {"body": "Call me crazy, but won't this just one-time raise PE? Companies need people to buy their crap, in other to grow. Wouldn't it be better to give the money to Federal employees?\n\nI like free money. But, wonder if it affects growth and PEG ratio.", "score": 8, "replies": []}, {"body": "What the fuck is it with r/ politics in here lately?", "score": 70, "replies": [{"body": "Midterms approaching. ", "score": 40, "replies": [{"body": "They're here to educate us silly capitalist", "score": 33, "replies": [{"body": "I now see the error of my ways! Secure my funding fellow redistributers! ", "score": 23, "replies": [{"body": "Cut 90% off all your tendies", "score": 6, "replies": []}]}]}]}, {"body": "ugh it's the worst. I'm here to gamble, not get all political.  ", "score": 38, "replies": [{"body": "People saying the political shit are not in the stock market, I guarantee it. \n\nAny time pro Trump news drops, the market explodes up. Stop pretending you're one of us. ", "score": -3, "replies": [{"body": "Politics effects the market.... your comment makes no sense.", "score": 7, "replies": []}]}]}, {"body": "When politics cause massive swings in the market it's kind of hard to avoid.", "score": 5, "replies": []}]}, {"body": "Doesn't this incentivize investing in the US though? \n\n\nI get the perspective on wages. That's sucks but it's also nothing new. Wages have been stagnant for years while inflation goes up 3%. That's been the case since 2000 at least. \n\n\nIn the meantime though, you can get people that have even a little bit to pool their money into the US economy via the stock market which would grow business. What the result is of growing business is, idk. Depends on the companies I suppose. ", "score": 20, "replies": [{"body": "Tell me how of this magical grow business by pouring money into the equities market mechanism. ", "score": 42, "replies": [{"body": "You don’t know about the trickle down tendies?", "score": 50, "replies": [{"body": "I love nuggets ", "score": 2, "replies": []}, {"body": "trickle down sauce", "score": 1, "replies": []}]}, {"body": ".... Aphria just entered into a bought deal wherein they agreed to supply stock to an investor at a set price over a set period of time. \n\nThe higher that stock price is at the time of the deal, the more money the company can raise. \n\nThe stock price is raised by people buying stock. ", "score": 5, "replies": [{"body": "Sounds like a shit deal for Aphira.", "score": 1, "replies": [{"body": "It’s the exact way you raise capital through equities. ", "score": 3, "replies": [{"body": "They could have just bought some FDs and made 10x ", "score": 3, "replies": []}]}]}]}, {"body": "Simple: if there’s more money chasing US equities, it will be easier for US businesses to finance themselves through equity. On the margin, this means that many potentially great companies will have an easier time getting off the ground", "score": 2, "replies": []}, {"body": "I'm not saying its guaranteed. Depends on the company and what they do with the funds.\n\n\nI'm not necessarily a trump supporter or hater, just as a disclosure. However I think he's looking at how he can keep rich people's money in the stock market in the US specifically. This incentivizes US investing. The result of that depends on those companies receiving the money. But it is a good thing to have more money concentrated in the US, imho. ", "score": 0, "replies": [{"body": "(Money doesn’t go to the company post IPO)", "score": 5, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Pretty much why AMD did not move for the LONGEST time was because they were simply diluting the fuck out of their shares. Good companies like AAPL don't have that issue, and are retiring stock faster than they are issuing. I want to say the most common reason is for employee and executive incentives, but I'm sure some companies leverage their shares for capital.\n\nhttps://www.macrotrends.net/stocks/charts/AAPL/apple/shares-outstanding\n\nhttps://www.macrotrends.net/stocks/charts/AMD/amd/shares-outstanding", "score": 2, "replies": []}, {"body": "They can do that, but typically don’t because it may dilute their prior shares, depends on how they do it. HMNY is a great example.\n\nTypically public companies finance through debt.", "score": 2, "replies": []}, {"body": "S&P 500 companies don’t really. I don’t know figures on publicly traded companies in general, but in a low interest rate economy companies prefer to use debt rather than equity to fund expansion. ", "score": 2, "replies": [{"body": "Doesn't the amount that they can borrow depend in part on their equity?", "score": 1, "replies": []}]}]}]}, {"body": "Fuck off poor person. EA calls till I hit billionaire status.", "score": 3, "replies": []}, {"body": "What funds are you talking about?", "score": 2, "replies": []}]}, {"body": "Holy shit you don’t know what primary market securities sales are for.\nGet these economically illiterate morons away from my tendREEEEEEEES\n\nSeriously though how do you not know how stock sales enable companies? ", "score": 0, "replies": []}]}, {"body": ">In the meantime though, you can get people that have even a little bit to pool their money into the US economy via the stock market which would grow business. What the result is of growing business is, idk. Depends on the companies I suppose.\n\n​\n\nI think the economy would probably benefit from the masses having the disposable income to buy all of this shit we're selling.  If your wages are allowing you to scrape by and you're spending that bit of free money on investments, who are these companies selling to?", "score": 13, "replies": [{"body": "Not me cuz that's exactly what I do lmao. Consumerism big gay I'm here to get rich and retire live in a 10 dollar cabin in the woods ", "score": 7, "replies": [{"body": "My man!", "score": 5, "replies": []}]}, {"body": "Import more migrants, artificially explode demand. We are a national of immigrants after all. ", "score": 1, "replies": []}]}, {"body": "There is no lack of capital though. It's not like businesses are starved for cash and aren't growing because they need funds. The biggest limiter on US growth is a dwindling middle class and increasing healthcare costs.", "score": 2, "replies": []}]}, {"body": "It would be nice to talk about “fair” without having a pre-determined side about who you do and don’t want to win.\n\nI think indexing capital gains is very reasonable, but should then be done *instead* of the lower rate not in addition to it. Index, then tax at regular income. That strikes me as fair.\n\nBut I do agree, this is a ridiculous thing to say immediately after cancelling a cost of living raise. The man has no self-awareness. (And talking to his supporters I don’t think he needs to.)", "score": 2, "replies": []}, {"body": "Yeah, not gonna convince me that keeping more of my money is a bad idea. The government is honestly the least efficient user of capital and if the deficit concerns you it should be addressed through cuts in government spending, not taxes.", "score": 6, "replies": [{"body": "there are two problems with cutting gov't spending, one Medicare (28%) and SS (24%) account for the largest entitlements and old people vote and they will die on those hills in mass, second FED agency spending (16%) Military spending (15%) is basically a big jobs program. What else are you going to cut interest liabilities (6%)? you can't hope to believe that politicians will stop spending money on pet projects and pork barrel circle jerks that's just fantasy land.\n\nI agree we need to cut federal spending but the options are not politically attractive to anyone making the decisions, so they don't happen and we just borrow until someone calls us on it or we go broke and rot from the inside like the Romans.\n", "score": 3, "replies": []}, {"body": "Why not both? Economy was just doing just fine before the tax cuts. Cut spending and raise taxes until we balance the deficit. THEN start pulling taxes back.", "score": 2, "replies": []}]}, {"body": "Democrats only care about the deficit when they can use it to oppose tax cuts. Republicans only care about the deficit when they can use it to oppose spending increases on projects they don't like. Nothing to see here...\n\nThe current taxation regime is extremely progressive, not to mention extremely high; we pay a literal assload of taxes by any historical measure. It's not the end of the world to make it a little less stupid by stopping taxation of phantom income, even if that makes it ever so slightly less of a burden on the 1%, who already pay 40% of income taxes on the most over funded and bloated beauracracy in history.", "score": 7, "replies": [{"body": "The only time the deficit has been reduced in the past 40 years has been under democrats. Clinton nearly balanced it. Bush undid all his work. Obama cut it by half. Trump undid all his work. ", "score": 2, "replies": [{"body": "look man sometimes we need money for wars in the middle east. Those Iraqi civilians aren't going to kill themselves!", "score": 7, "replies": [{"body": "Actually Iraqis are happy to kill each other. Where the fuck have you been getting your news from?", "score": 3, "replies": [{"body": "Over 100,000 Iraqi civilians have died as a direct result of the war we started in 2003. Remember when the government lied about having top secret intelligence that said they were developing WMDs? ", "score": 1, "replies": [{"body": "Well most people don't refer to the UN as a \"government\", but otherwise yes I remember it well.\n\nAlso: indirect result. When a Sunni terrorist bombs a Shiite mosque and there's not an American around for miles, that would be the definition of an \"indirect result\".\n\nBut just to back up, you said Iraqi civilians don't kill themselves. And I'm saying they absolutely do. Regardless of my opinion on the invasion then or now, your statement is straight-up false.", "score": 1, "replies": [{"body": "It's actually not look this shit up you can see the numbers for yourself. Also the CIA are the ones who originally had the \"intelligence\" about the WMDs. America fucked up iraq no way around that. It's pointless in even arguing I mean what are you trying to say? The invasion was a giant waste of money, human lives, time, or any other metric it failed.", "score": 2, "replies": []}]}]}]}]}, {"body": "My copy of the Constitution says that tax and spending bills originate in the House of Representatives. If your copy says it’s the President doing so, I’d love to see it.\n\nI mean I’d like to agree with you that Trump is an ass and Republicans these days are spend-happy too. But I vividly remember the 90s and it was Newt Gingrich pushing to balance the budget. Clinton specifically said he didn’t want it to balance for 10 years, which is why we had a shutdown in 95-96. ", "score": 1, "replies": []}]}]}, {"body": "> this is basically a $100 billion tax cut for people who are already extremely wealthy, \n\nWhile simultaneously trying to cut the COLA salary increases of federal employees. You can’t make this shit up.", "score": 4, "replies": []}, {"body": ">Obviously this is going to be a popular idea on this sub but to put things into perspective, this is basically a $100 billion tax cut for people who are already extremely wealthy,\n\nGood. They'll find something productive to do with that money, instead of squandered at the fed. \n\n>at a time when defense spending has been needlessly increased by $74 billion,\n\nCase and point. \n\n>nd when Trump just cancelled federal workers inflation adjustments to their salaries because he claims the budget can't afford the extra $25 billion.\n\ncase and point. \n\n>Capital gains tax laws are already very generous to investors who admittedly are taking on risk, but who often make enough passive income in gains/dividends to easily beat inflation and not have to work for a living. The laws should stay as they are.\n\nIf you're paid to sit on your ass, then the labor supply dries up and wages are forced up. ", "score": -1, "replies": [{"body": "case IN point lmao", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Blue is my favorite color and also I play way too much Dungeons & Dragons.", "score": 3, "replies": []}]}, {"body": "oBvIouSlY ThIS Is GOiNG TO Be a POpulaR IdEa On thiS suB bUT TO puT thINGs iNto pErspeCTivE, tHis Is BAsICallY a $100 BILLiON Tax cut FOr pEOpLe wHo aRE ALreAdy ExtRemElY WEaLTHY, At A TimE wHen The nATionAL DEbT is BALLOOning DANGerouSLy, AT A tiME WHeN deFENse SPENdINg hAS beeN nEeDlesSLy iNCREAseD by $74 BILlIoN, aNd WheN trumP just cAnCELlEd FederAl workeRs InFlATIOn aDjustmENTS TO THeIr saLAriEs BECAUsE he CLAimS THE buDgET can't AFForD The eXtRA $25 BIlLion.  cAPitAL GAIns TAx lAWS are alREAdy vErY GeNerous TO INvEStOrs whO AdMITTEdlY ARe tAkinG On rISK, BUt WhO OFTEN MakE eNouGh PASsIVE IncoME IN gAins/DivIdeNdS to EaSILY bEAt InfLatiOn aND noT havE to worK FOr A LiVINg. THe lAWs sHoULd sTAy aS ThEY ARE.", "score": -5, "replies": [{"body": "for the love of god, learn to type like a normal person.", "score": 3, "replies": []}]}]}, {"body": "Adjusting taxes based on inflation is an interesting concept, but doesn’t make much sense when applying it to capital gains during the longest bull run in modern US history. There is clearly no problem getting investors to put their money in the stock market. Trump should be looking at ways to boost other aspects of the economy.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "you hate to love him, there's a difference.", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "What's that difference? Income from running a business is also taxed. So are lottery gains. Taxation has no correlation with risk.", "score": 79, "replies": [{"body": "For one thing, business losses are deductible 100%, where as capital losses are limited to only $3000 per year. Why are losses limited but they are happy to tax all the gains? ", "score": 38, "replies": [{"body": "Double taxation is theft and they shouldn’t be allowed to do it. I’m 100% with you guys. ", "score": 44, "replies": [{"body": "Same. And I'm really tired of the liberal commies getting into this sub and acting like an antifa protest over shit that is common sense. ", "score": 12, "replies": [{"body": "Lmao", "score": 0, "replies": []}]}, {"body": "It's not double taxation though.  You're only taxed on gains and can claim losses as a tax credit.  I don't agree with different tax rates between short and long term gains, but I guess that's there to encourage long term investing.", "score": -4, "replies": [{"body": "You were taxed on the money when you made it, and now you’re getting taxed again on investments as if they are a sure thing, and they don’t even have the decency to adjust for inflation. It’s fucked up. ", "score": 8, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I’d agree with you, if they did not cap losses you can take. ", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "You can only PARTIALLY claim losses as a tax credit. $3k/year against your income, meanwhile they'll always tax 100% of your income.  \n\nAnd if you don't invest, inflation outpaces you and your money loses money. So you're forced into investing to just keep the value of your money on par, and then they tax your fucking gains that you had to spend your own fucking money to earn. IF you were just at parity with inflation, you're now below inflation again. And the $1 you end up with isn't even a full $1 because sales tax and other shit means that your $1 has the buying power of like $0.80.  \n\nFor every $1 you spend you had to actually earn like $2.", "score": 3, "replies": []}]}]}, {"body": "Can you deduct lottery losses?\n\nAgain *taxation has no correlation with risk*.", "score": 17, "replies": [{"body": "Yes. But I think it’s itemized ", "score": 11, "replies": []}]}]}, {"body": ">  Taxation has no correlation with risk.\n\nso what your trying to say is you can't get a tax break (taxation) for a failed investment (risk), when in reality you can write off losses on taxes up to a certain amount.", "score": 1, "replies": []}, {"body": "You've already been taxed on the income once in the form of wages? ", "score": 0, "replies": []}]}, {"body": "This is some pure, distilled autism.", "score": 15, "replies": []}, {"body": "So, from what I'm seeing here, you are a firm believer that banks should not be taxed?", "score": 5, "replies": []}, {"body": "This comment being positive on upvotes is why America is in the state it’s in. ", "score": 16, "replies": [{"body": "Shocking that a comment wanting less taxes on a money sub is upvoted", "score": 20, "replies": []}, {"body": "You’re on reddit. This place in no way embodies even a notable minority of America.", "score": 3, "replies": []}, {"body": "Yeah, I kinda just let out a long sigh as I read it.", "score": 0, "replies": []}, {"body": "Hitting stride in economic gains, far and away the world's eminent superpower and top 2 in median income?\n\nOh shit, I forgot. You watch tabloid news that thinks the POTUS paying off a porn star 10 years ago is a national crisis. My bad. The country is on fire.\n\nIf you care so much, donate. Don't entrust it to the federal racket. But that would require actual sacrifice on your part.", "score": 0, "replies": [{"body": "FYI: Trump paid off a porn star during the campaign using illegal campaign contributions, not 10 years ago. ", "score": 2, "replies": [{"body": "Ah ok. Now my life is measurably more ruined.", "score": 0, "replies": []}]}, {"body": "gamers rise up \n\nbottom text", "score": 0, "replies": []}]}, {"body": "It’s ok he’s 15", "score": -3, "replies": []}]}, {"body": "I disagree, I think income should be taxed the same regardless of whether it is earned on a W2, schedule K, or long/short term gains.\n\nAnd I would be hit hard as most of my earnings are non W2!", "score": 4, "replies": [{"body": "So you should have to risk your post-tax income to get more income and then also be taxed on that income?", "score": 6, "replies": [{"body": "Yes, I don’t see why not.  Any new income I bring in should be taxed like any other income.", "score": 0, "replies": [{"body": "That money has already been taxed at every turn. Tax when the company made a sale, tax when someone gets income from their work, tax when they make money off the stock. How many times do we need to tax the same money? Our government is already bloated and full of redundancies and unnecessary spending. And our debt is ballooning. Capital gains tax doesn't do anything beneficial for our country's people, just gives the military and congress more fun money to justify bigger loans and debt.", "score": 5, "replies": [{"body": "Then fix the spending issues and inefficiencies and then cut taxes. You don't start working hours anticipating you will spend less in the future. You spend less and once your house is in order you can think about reducing income.", "score": 1, "replies": [{"body": "The government isn't just going to stop spending the money we give them at the rate they have been. Why would they? It's easier if we provide them with less money to spend. I promise the government isn't going to fail, they'd just have to find a way to stop spending so much and I'm confident they could. ", "score": 1, "replies": []}]}]}]}, {"body": "If you invest money to open a business, you pay taxes on your profits. What’s the difference?", "score": -1, "replies": [{"body": "Because he doesn't want to pay taxes. All their arguments are nonsense. They just want to profit off of society without contributing to it. Pure and simple.", "score": 1, "replies": []}, {"body": "Just because something can be taxed doesn't mean it should be. You can only count up to $3000 as a loss to offset your gains, but you can be taxed endlessly on how much you make? The argument I'm trying to make isn't that it's not already happening, it's that the government already misuses so much of our tax money that restricting the opportunities the government has to tax us is beneficial. The government will not hurt too badly because of it, at the worst they would have to rethink how much money they are spending and wasting at every turn on stuff that we both didn't ask for and don't need.", "score": -1, "replies": []}]}]}]}, {"body": "if they cut the capital gains tax, then any losses from investments we can claim would also be reduced. There is no free lunch I suppose.", "score": 1, "replies": []}, {"body": "Especially considering the money you use to invest has already been taxed as income ", "score": -5, "replies": [{"body": "This comment was made elsewhere and has 17 upvotes at the time of my response.  Yours has -3.  LOL r/wsb wyd?", "score": -5, "replies": [{"body": "> LOL r/wsb wyd?  \n\nJust not upvoting repeat content to keep discussion focused. The way that the upvote/downvote system is intended. The upvote button isn't an agree button.", "score": 0, "replies": [{"body": "Ah, yes, the old \"this is what the upvote is really for\" only when convenient", "score": 1, "replies": []}]}]}]}, {"body": "You're 100% right and many, more civilized countries (including in Europe which is generally far on the left of the US politically) don't have capital gains taxes. Smaller countries even manage to function without income taxes... I'm appalled that this is even a debate in the US, you guys should be in the streets demanding that your government stop confiscating your tendies for no fucking reason. I hate Trump as much as the next guy but this is a step in the right direction (though he needs to earn that $100 billion somewhere else, fact which is not clear he's aware of).", "score": -1, "replies": [{"body": "> and many, more civilized countries\n\nROFL\nBack to /r/politics please \n\n", "score": 5, "replies": []}, {"body": "Europe has capital gain tax. Quit your bullshit. It's taxed right before hitting your account.", "score": 1, "replies": [{"body": "To my knowledge, Belgium, Switzerland and Monaco have no capital gains tax at all and Germany has a 0% rate for long term gains. And I may be forgetting some other countries. I believe you are confusing with dividends, which are the only thing being taxed before hitting your account. Soo you probably live in a country which doesn't have capital gains taxes lol", "score": 0, "replies": [{"body": "https://www.accountancyineurope.com/articles/capital-gains-tax-europe/", "score": 2, "replies": [{"body": "Very interesting, thanks!", "score": -1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "It's net gains on the year. But it's taxed at a different tax rate than normal income and it's only taxed once. ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Only partially.", "score": 1, "replies": []}]}]}, {"body": "Can you imagine the selling on the day this is instituted? I’ll be one of them.. ", "score": 3, "replies": [{"body": "I'm pretty sure the exchanges would literally explode.  That and vanguard would lose 80% of its value ", "score": 5, "replies": []}, {"body": "The day of? No.  \n\nThe day before it's repealed? Yes.  \n\nWhich is a threat against repealing.", "score": 3, "replies": [{"body": "The volatility when politicians threaten repeal, tho. 🍆", "score": 1, "replies": []}]}, {"body": "If i had long term capital gains, i would too.\n\nThere is ZERO chance the next administration would let this rule stand.\n\nIts just like the fucking foreign tax holiday. Letting people bring money back at a reduced tax rate only encourages them to stash it away more in anticipation of the next holiday.", "score": 2, "replies": []}]}, {"body": "for short term capital gains does this even do anything? we all do short term... half of us do FDs... how does 1 week inflation adjustment help us?", "score": 1, "replies": []}, {"body": "I’m retarded. Is this good or bad for a greedy MU 90c player?", "score": 1, "replies": []}, {"body": "He should index it to net worth. Us poor fags keep everything and millionaires pay bigly.", "score": 1, "replies": []}, {"body": "God fucking dammit.", "score": -4, "replies": [{"body": "Why would you not like this?", "score": 21, "replies": [{"body": "He’s torn, because he hates trump, but this article made him hard as a rock.", "score": 59, "replies": [{"body": "Can confirm. Am Dem. Don't like Trump.     \n     \nBut, my portfolio...📈🍆.     \n     \nI'm also a big fan of protecting IP from China and ending their currency manipulation.", "score": 3, "replies": []}]}, {"body": "It doesnt benefit short term traders in any meaningful way, so it should not impact this sub much at all.\n", "score": 3, "replies": []}, {"body": "My logic was that it would have bigger repercussions but now that I think about it, it really won't. It exists on a personal level and those unhappy with this aren't \"do-ers\"  so there won't be much backlash.", "score": 1, "replies": []}, {"body": "As a socialist, he either plays and loses FDs every week to spread his wealth, or wants any actual gains he makes taxed and distributed as a handout.", "score": -5, "replies": []}]}]}]}
