{"title": "Why is Wall Street constantly wrong about Apple?", "selftext": "[deleted]", "id": "95ylqf", "created_utc": 1533836361.0, "score": 151, "upvote_ratio": 0.88, "num_comments": 156, "comments": [{"body": "I do agree that there seems to be undue pessimism. Not sure why.\n\nWhat really gets me is when these bozos talk about AMZN breaking $1 trillion mkt cap with a P/E of 130 like it’s awesome, but when AAPL gets there first with a P/E of 19, it’s “yeah yeah ok” *forced applause*. Or when some are bullish on TSLA with its negative earnings, but hardly acknowledge AAPL’s $300 billion cash hoard.\n\nBuffett gets it though. We’re in good company 👍", "score": 202, "replies": [{"body": "Buffet is like the best guy to follow for individual investors. ", "score": 67, "replies": [{"body": "RIP IBM", "score": 18, "replies": [{"body": "Now we know Buffett has gotten his one bad investment out of the way for the next 10 years.", "score": 8, "replies": [{"body": "IBM was definitely the worst, KHC is up there too. USG and WF have definitely been mediocre to bad investments too (for the past 5 years, or so).\n\nI will always be long BRK.B and love Buffett, but he's not infallible.", "score": 3, "replies": []}, {"body": "GE", "score": 3, "replies": []}, {"body": "He won't be alive in 10 years. ", "score": -5, "replies": [{"body": "Was that a threat?", "score": 15, "replies": []}, {"body": "Probably not. I have a feeling the day he dies may be one of the most slam dunk dip buys of all time. Brk would probably drop a good chunk initially but rebound very quickly. The people who’d take over for him are all likeminded individuals and follow his principles", "score": 3, "replies": [{"body": "The day BRK sells below book value, I'll mortgage my children's future on LEAPs. ", "score": 2, "replies": []}, {"body": "Pretty sure his death is ready baked into the price. And they have had a succession plan for a very long time. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Why follow when you can just buy BRK.B?", "score": 0, "replies": []}]}, {"body": "honestly I believe it's because AMZN and TSLA still have their CEO/Founder at the helm and investors put a lot of faith in their vision and ability to execute.", "score": 30, "replies": [{"body": "Ole Musky is off the wire recently. He's lost his marbles. Bezos is a straight up genius from the start of Amazon. You should read, \"The Everything Store.\" Bezos is hard but smart, passionate, and realistic. Musk is just smart and passionate.\n\nThese people are needed, but not as CEO's. Look at Woz. Without him, Apple wouldn't exist...but without Jobs, it still wouldn't exist. Without one or the other, it would have never taken off. Jobs was arguably the biggest influencer on it's survival, but Woz was the king of the birth.\n\nMusk is the Woz. He birthed these great things, but he can't sustain them alone.", "score": 18, "replies": [{"body": "You’re wrong on Musk. Why is he “off the wire”? ", "score": -11, "replies": [{"body": "Maybe because he’s calling people pedophiles, tweeting obsessively about the stock price, and can’t stop thinking about short sellers and the media.", "score": 9, "replies": [{"body": "Yup this. ", "score": 2, "replies": []}]}]}]}]}, {"body": "exactly.\n\nI would not mind if analysis and idiots on TV would be equally critical of other tech companies. But they are not.  ", "score": 14, "replies": []}, {"body": "> they’re bullish on TSLA\n\nmost shorted stock, wallstreet is anything but bullish on tesla", "score": 7, "replies": [{"body": "If they were anything less than bullish the stock would’ve disappeared years ago. Not one profitable year in all its existence.", "score": 3, "replies": [{"body": "Retail investors", "score": 0, "replies": [{"body": "Please. Retail investors only account for 10% of all trading activities. There simply aren’t enough of us to even make a dent or prop up a stock like TSLA. ", "score": 1, "replies": []}]}]}, {"body": "There’s an immense difference between wallstreet and wallstreetbets you goober.", "score": 3, "replies": []}]}, {"body": "Nobody really gives a shit about Market Cap, AMZN has grown 98% over 12 months AAPL has grown 51%. Thats why AMZN is better right now.", "score": -7, "replies": [{"body": "They don't? lol\n\n", "score": 9, "replies": []}]}, {"body": "$300bn cash hoard is a negative in my mind.  It means they don't know what to spend it on.  Yes they have amazing products but innovation has definitely been on a downward trend.  These are reasonable arguments from analysts who are not as bullish on AAPL (not short just not as optimistic).", "score": -20, "replies": [{"body": ">but innovation has definitely been on a downward trend\n\nAh yes, the same ol' Apple spew. People have been saying this for years, and guess what... they're still selling more and more products as the years go on. So maybe, just maybe, consumers are happy with their products. Maybe the real innovations are the ones that make using Apple products a better experience than the other guys. \n\nTheres a lot to be said about Apple doing something like creating FaceID, and adding a notch to their phones... and seeing how many other OEMs are now doing the same thing. Maybe this \"innovation\" everyone keeps waiting on has been there all along, were just too busy taking it all for granted.  ", "score": 20, "replies": [{"body": "Just please watch Steve jobs talk about innovation https://youtu.be/_1rXqD6M614\n\nThis is EXACTLY where apple is at. You can see it in their products, in their design choices. Ffs they designed a wireless mouse that needs to be charged upside down. The last innovation in the laptop space they had was the macbook air. The last innovation they had in the the phone space was \"retina display\". They have a stylus that needs to hang out of the bottom of an Ipad.\n\nDo they make good products yeah, but they are missing the future from the lack of innovation. They will continue to print money and that's okay. But they will miss things right in front of them.\n\nSteve jobs knew the user experience needed to be good. He saw problems and worked on pushing them into the consumer space. Jony Ive designs some nice products, but doesn't have the innovation and vision necessary on changing an industry.\n\nApple is becoming a stale company. They sell a lot of products, but I think the \"apple cult\" is slowly dying.", "score": 4, "replies": [{"body": ">the “apple cult” is slowly dying\n\nTotally agree. And all the indie apps are dead as well, well at least 99.9% of them.\n\nBut the ones that remain are strong. Apple went from being a hipster “cult” thing to becoming mainstream.\n\nAll “respectable” tech companies in London are like 90% macs now. 5-6 years ago you would struggle to find a single one.\n\nIt has just gone mainstream.", "score": 1, "replies": []}]}, {"body": "Everybody bitched when they removed the headphone jack, I did too. Now everybody is walking around with AirPods or a blue tooth device. Apple knew the future was wireless, that’s why the keep winning. I do miss being able to unlock my phone with my finger but only because it doesn’t always work when I have sunglasses on. Also, just because a company has $300 million available doesn’t mean they don’t know what to spend it on, it gives them tons of leverage to use banking institutions money for research and development. Apple just built a 2.8 million square foot building, “hording,” cash and, “not knowing,” how to spend it. lol", "score": 2, "replies": [{"body": "I’m still pissed about the headphone jack", "score": 8, "replies": [{"body": "I was until I started wearing Bluetooth headphones. Now I get pissed off if I forget my BT headphones before I go anywhere. You don’t realize how inconvenient it is to have a wire running from your phone to head until you do without for a while. The AirPods I haven’t gotten yet because I like being able to take a head phone out on one side and have them rest on my neck. \n\nThe Beats BT neck band is pretty nice though and they are cheaper at $99. I tried a few other brands from Amazon but the quality is really sketchy for any under $50. In my opinion quality BT headphones are a must if you listen to a lot of music or podcasts.", "score": 1, "replies": [{"body": "Im with you on the wireless part. Got beats x and i fucking love it. BT all the way", "score": 2, "replies": []}, {"body": "You can use one earbud at a time with the AirPods. In case you didn't know. ", "score": 1, "replies": [{"body": "Yes I know, but I just prefer the neck band honestly for a few small reasons. ", "score": 1, "replies": [{"body": "Fair enough. Just didn't want you rule out AirPods too quickly because I love mine. ", "score": 2, "replies": []}]}]}, {"body": "I don’t mind the wires at all. I have tried to use the single but it always gives me the error message about it not being the right kind of accessory and I have to unplug and plug them back in. Sucks when you’re running. \n\nPlus BT can’t transfer the full bitrate on most of my music like a wire can. If you’re just downloading music from iTunes it’s ok - but not if you have lossless files. \n\nAnd just FYI [beats headphones are total garbage](https://www.digitalmusicnews.com/2015/07/28/if-you-read-this-review-and-still-buy-beats-headphones-youre-an-idiot/). ", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m not saying they need to be bullish, but if they weren’t so pessimistic they wouldn’t be so surprised as AAPL soars through record highs and makes history. All I’m saying is that a majority of headlines and media coverage tend to go to these “highflyers“ like NFLX & AMZN, instead of focusing on more value-oriented stocks that are more retail-investor-friendly. ", "score": 3, "replies": []}, {"body": "viewing $300 billion as a negative.....LOL.\n\nTalk about spinning a positive to a negative.  You might have had a point when the cash was stuck overseas (because of high taxes) but those laws have changed and Apple has free access to its cash now.\n\ninnovation on the downward trend? LOL.  People were saying the same thing in 2012. LOL. \n", "score": 11, "replies": [{"body": "Chemtrails and UFOs brother", "score": 2, "replies": [{"body": "UFOs maybe. \n\nChemtrails... 40 iq - 1D chess", "score": 1, "replies": []}]}]}, {"body": "Yea having cash is def a bad thing. For sure ", "score": 4, "replies": []}, {"body": "Could just be they make money too fast to invest", "score": 1, "replies": []}]}]}, {"body": "Actually I think AAPL has faced this far less than AMZN. The only legitimate time to have been concerned was when Jobs passed, but Tim has more than proven himself.", "score": 26, "replies": [{"body": "Amazon at least has a reason to be skeptical of a pullback. Their P/E ratio has been increasing like crazy past few years.\n\nBut what analysts seem to be forgetting is that the market is made up of people, most of which are poorly informed and nowhere near as rationale as they think. Even if the price becomes harder and harder to justify, more people everyday start to view it as a safe play. I’ll freely admit I got burned in terms of potential valuation, as I rode it again from 900 to just under 1400, and got left in the dust. I’m still waiting on a pullback, even to 1700, but beginning to think I kay be waiting awhile/forever  ", "score": 3, "replies": []}, {"body": "AMZN deserves it more than AAPL tho.", "score": 2, "replies": [{"body": "Yea, but not at the P/E it sits at. I've bought and sold the stock a few times, but I am too skeptical to get back in again.", "score": 6, "replies": []}, {"body": "Agreed. Apple logically approaches problems. Amazon just throws cash at new endevors and prays they work out. Not to mention they target extremely concrete and tough industries. ", "score": -6, "replies": []}]}, {"body": "Amen to this. A-Freakin’-Men", "score": 0, "replies": []}]}, {"body": "Because the people on TV that you listen to don’t know what they are talking about. They do what they do to get attention. ", "score": 18, "replies": [{"body": "I'm not an expert on stocks but I would have to say that TV in general makes a great deal of its money on sensationalism so this would make total sense", "score": 6, "replies": [{"body": "Also the analysts for TV shows are there for a reason (read: they're not good enough to actually work markets) ", "score": 1, "replies": []}]}, {"body": "Bloomberg tv > CNBC ", "score": 9, "replies": []}]}, {"body": "Simple answer: market manipulation. Wall Street isn’t dumb, theyve manipulated Apples price before ER a ton of times. They know how great Apple is, trust me it’s no accident.", "score": 27, "replies": [{"body": "And that's why I bought AAPL before the earnings and sold afterwards. Someone said it before: never bet against Apple.", "score": 1, "replies": []}]}, {"body": "> They always say, \"they did awesome this quarter....but the future looks bleak.\" They have been saying this for 6 years in a row.\n\nMake enough predictions, one of them will come true eventually. \n\nBesides, how do you expect those \"This guy predicted AAPL's crash, you won't believe what he thinks will happen next\" articles if no one makes the predictions?!", "score": 5, "replies": []}, {"body": " I remember when it was 120 because of icahn and people were very bearish on them and the stock went down to $116 or so after a while ", "score": 5, "replies": [{"body": "It went down to $90.", "score": 5, "replies": []}]}, {"body": "They under estimate the sale of a cell phone year after year and upgrading", "score": 4, "replies": [{"body": "even homeless people have iPhones.\n\nthey ain't goin' anywhere, I agree.", "score": 1, "replies": []}]}, {"body": "I really think It's because Steve Jobs is no longer around and people believe that these innovative tech companies will cease innovating and fall off without the guidance of their visionary founders.", "score": 3, "replies": [{"body": "In all fairness They have had huge missteps since his departure. ", "score": 7, "replies": [{"body": "What missteps are you thinking of specifically? I can’t imagine they had fewer mistakes under Jobs", "score": 2, "replies": []}]}, {"body": "They haven't innovated anything since his passing. I was never an Apple fan but I had an iPhone and are one point had a Macbook (10 years ago) because they provided things others didn't do. The opposition has caught up in so many ways.\n\nApple has not had an innovative product in awhile. Yes they have made slight improvements on things but I mean true innovation.\n\nThings like the Macbook air, iPhone, iPad. They created markets for things people didn't even know they wanted.\n\nI posted this on another comment here, but just watch this video https://youtu.be/_1rXqD6M614\n\nThat is who Apple is today", "score": 9, "replies": [{"body": "Nothing new?  What about Apple Watch?  Airpods?  Apple Pay?  Touch ID?  FaceID?  ", "score": 6, "replies": [{"body": "Apple watch is neat, but it isn't a must have and Apple really has to try to explain its purpose. I have a smartwatch and I love mine but it came out before apple watch and does same if not more.\n\nAirpods again a nice idea, but they are wireless earbuds, nothing.\n\nNFC was already out for 6 years before apple started doing it.\n\nBiometrics have been out for years.\n\nFace ID like technology has been out for years. It is essentially a kinect with updated sensors, and it created the awful notch.\n\nNone of those things are major innovations that become a money maker for apple.\n\nOther companies also innovate and come up with better things than them. That is what successful companies do. Apple isn't industry leading tech anymore.", "score": 3, "replies": [{"body": "Apple never was though.. MP3 players existed before iPod, blackberry/other smartphones existed before iPhone. Apple’s almost never *first* to market, but they’ll often have the best implementation. \n\nWhat did Apple get right that makes it special then? The ecosystem - that’s software/hardware integration, the App Store, and the “walled garden” approach to their hardware. Other big tech companies are just now starting to play catch up to Apple here. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Google, Valve, Oculus, Huawei, Microsoft, Amazon...that was hard.\n\nIncase you are wondering why.  Waymo, VR, gorgeous hardware design with function, surface, surface go, surface studio, quantum computing, hololens, Amazon AWS, cashierless store.  Apple is boring now.", "score": 2, "replies": []}]}]}, {"body": "The Apple doomsayers always seem to forget about all of these innovative products that have changed the world and it really pisses me off.", "score": 1, "replies": []}]}, {"body": "100% agree. They are excellent marketers and offer nothing new...it just doesn't feel like they can keep this up. I had a MacBook ,yeah it was solid but overpriced. Pretty much all their stuff you can get cheaper or much better at the same price if you don't fall victim to the marketing/ fad", "score": 1, "replies": []}]}]}, {"body": "Everyone likes to see the #1 guy/team/company fail. I was one of those Apple pessimists for a 3-4 quarters a couple years ago, but since then I learned to never doubt Apple.\n\nI feel like Amazon is about to start down that same hot streak where the stock is unstoppable for like 5-8 years like Apple was (and still is) from the early iPhone years to the today.", "score": 3, "replies": []}, {"body": "Its impossible to predict cult behavior.  When compared fairly, their products/services are not technically worth the premium price, but people pay it anyway.  That behavior could change at any time.  ", "score": 3, "replies": [{"body": "A cult that has a BILLION members?  Sounds more like mainstream than a cult to me.", "score": 1, "replies": [{"body": "Yeah, \"cult\" is probably not the best word, maybe \"religion\" is a better word for it.  And they can stubbornly persist for eons.", "score": 2, "replies": [{"body": "whatever makes you happy I guess.", "score": 1, "replies": []}]}]}]}, {"body": "Wallstreet doesn't understand that AAPL isn't a brand. It's a lifestyle, and it will continue to outlive other brands because of this.", "score": 5, "replies": []}, {"body": "Manipulation.", "score": 10, "replies": [{"body": "this lol. most grades and ratings are to make moves in price so big guys can get a better price. it's all bull. they gain nothing from giving dumb money the right choice.", "score": 8, "replies": [{"body": "The one time to worry will be before an ER that the pundits DONT say they’re worried about Apple’s future. ", "score": 3, "replies": []}]}, {"body": "Yep. And people forget over time. Until people like OP brings it up. \n\nThats why each instance is effective", "score": 1, "replies": []}]}, {"body": "I agree OP. ", "score": 2, "replies": []}, {"body": "Lots of reasons why the market (not just \"Wall Street\") is constantly wrong in its appraisal of Apple's intrinsic value... full disclosure, these are thoughts from my investment firm Titan. More at r/titanvest\n\n**What are people missing / why are they constantly wrong?**\n\n* Concerns about product concentration risk. Over 60% of its sales come from iPhones, and smartphone growth has slowed in recent years due to highly saturated markets in the U.S. and Western Europe. Bears are very concerned about this.\n   * While we agree that smartphone growth will continue to slow in Apple's more mature markets, it has plenty of untapped pricing power on the iPhones it sells. Although unit growth may slow, prices should continue to rise, yielding continued sales growth.\n* Lack of ability to estimate brand equity and ecosystem value. These are intangibles that don't show up in the company's EPS or other financials, so many investors don't know how to ascribe value to them.\n   * Apple's brand and closed ecosystem creates a loyal community of users with high switching costs, where even if they might prefer some non-Apple device better, the ecosystem (iTunes, apps, etc.) keeps them with Apple. This gives Apple a wide economic moat.\n* Classification of Apple as a hardware company instead of a consumer brand. Hardware companies are typically valued at much lower multiples of earnings and cash flow due to the cyclicality of products and the existential risk of technological obsolescence.\n   * Apple is becoming more and more recognized as what it really is: a consumer brand, not just a hardware company. This is a key tenet of Buffett's long thesis on Apple.\n   * Its unique ability to combine beautifully designed hardware with its easy-to-use software/app ecosystem makes it more of a consumer company than a technology company. It's priced far too cheaply for a leading consumer brand.\n* Ignorance of \"moon shot\" growth investments that penalize near-term earnings but could yield massive long-term payoffs.\n   * The consistent free cash flow from its software and services business enables it to enter markets that investors don't yet anticipate. Many of these bets will be home runs but are not yet reflected in the stock's valuation.\n* Under-appreciation for the stickiness and network effects of Apple's software and services ecosystem, which is rapidly growing.\n\nThe list goes on... plenty of reasons to be excited as an AAPL shareholder.", "score": 2, "replies": [{"body": "rip", "score": 0, "replies": []}]}, {"body": "Bought my first apples shares yesterday -  already up 2% :)", "score": 4, "replies": [{"body": "how ya doin", "score": 2, "replies": []}, {"body": "I wanted to say \"buy high and sell higher\" but i dont see any reason why this wont be considered a low period in a year or two\n", "score": 1, "replies": []}]}, {"body": "Several reasons for this.\n\nNot saying apple products are bad, but they don't provide a lot of value for your money.\n\nBesides a few well placed hits, they're rarely very evolutionary.\n\nCompetition is hard, and always getting harder. There are products that are faster, cheaper, prettier etc.\n\nThere is no size fits all, that is why they didn't win the pc war, there is a risk the same will happen in mobile. They have a small product portfolio.\n\nMarketshare is slowly falling.\n\n\nA lot of the company rests on 1 product. The iPhone. If the iPhone \"dies\" a lot of their service revenue will as well.\nThat might bring the company down.\n\n6 years is not a long time, and all/most giants have gone to the top, only to fall again.\n\nMany investors are biased, if they themselves do not like the product they dont believe they will be able to sustain it.\n\n\n\nThat seems more or less to be it. ", "score": 3, "replies": [{"body": "Yeah but the difference is if the iPhone goes under apple has a huge cash pile to sustain them. Other companies don't. And to think the iPhone is just going to \"go under\" without anything else coming down the pipe is ludacris. I'd be willing to bet Apple has dozens of products nobody has even heard about in R&D.", "score": 8, "replies": [{"body": "I'm not saying it's just going to go under.\nBut it can go faster than you think.\n\nLook at Nokia when the iPhone came.\n\nLook at Petrochina in 2008.\n\nLots of other examples if you look into it.\n\nBut even if it happens in 5 years or 10 years, it would still break the company.\n\nAnd no, I do not think they have tons of groundbreaking guaranteed success just waiting in R&D.\nCompared to their size, Apple spends very little on R&D.\n\n\nThis is not to bash Apple, this is a realistic analasys of what shortcomings they have. ", "score": 3, "replies": [{"body": "Nokia at is peak wasn't 10% of the company that Apple is today. That is a very bad compare.", "score": 3, "replies": [{"body": "You've never had sex? Bigger isn't always better.\n\nJust because Apple is bigger, I don't see a difference. I didn't use Nokia as an example because they're in the same business, but due to the speed at which they fell. Because they were like Apple seem by many as someone who couldn't loose their grip.", "score": 1, "replies": [{"body": "Its not about size.\n\nNokia was a pure hardware play.  Apple is hardware, software, services, lifestyle, and prestige brand. Huge difference.\n\nAgain comparing Nokia to Apple is beyond silly and shows only a surface knowledge of Apple.", "score": 1, "replies": [{"body": "Then why did you bring up size?\n\nNokia is/was/has been all these things.\n\nDo you know how many patents they have created through their time?\nApple holds around 10k VS. Nokias 30k+\n\nNokia has been in lifestyle with withings (failed)\nThey have been in music streaming (as one of the first). Later rebranded and sold of.\n\nThey've had their own app store, and sales of software to other hardware vendors.\n\nIt is dangerous if you cannot see the potential risks when investing. \n\nApples biggest strength is their ability to design products. Not just the way they look, but they way they utilize their power, the cost of producing them, the quality etc.\n\nThat their range of products is so narrow also helps on the margin. This is however also one of their short comings. They're very vulnerable. ", "score": 1, "replies": []}]}]}]}, {"body": "I agree to some extent but think the iPhone is practically what Windows was for Microsoft. It's a superior product in comparison to its competition IMO. My concern is that they came out with a string of revolutionary products like the iPhone, iPad and iPod but haven't come out with anything 'game changing' since. Could be because of Jobs passing, who knows. I still see them sticking around and not being dethroned for awhile. That being said, its hard to be king and they will eventually be second fiddle to another company that out-does them if they don't come out with some completely new products. ", "score": 1, "replies": [{"body": "The thing that Apple is good at is not being first.\nAnd I mean that in a good way. It usually comes out of not being desperate.\n\nMost companies spend a lot of money developing something, and as soon as they have a working device. Even though you could still argue that it's a prototype. It's functioning, but it's not perfekt.\n\nThen they release it, so get some quick cash.\nWe're Apple usually wait a bit longer, and deliver a product that might not be the top of the top in tech, but where it has been refined to deliver a good experience.\n\nThey have joined the smart speaker battle. One that I however don't believe is going to be a cash cow, as it's more a gimmick in my opinion.\n\nThen there is the VR. I also have my doubts here. It does give a more immerse experience than a regular screen, but it's also more of a Hassle.\n\nI see a niche for it in gaming, experiences, work and education.\nBut not mainstream.\n\n\nThe question is then, what?\nThe car business? That is a business very difficult and expensive to enter. Not impossible.\n\nThe TV market is shrinking, and it took a long time to get good smart TVs. But I believe Apple could've made a killing there in the beginning with high end screens.\n\nThe quality of the smart TV's is however high now, but still leaves something to desire. Perhaps enough?", "score": 1, "replies": [{"body": "Apple to buy out Tesla confirmed!", "score": 1, "replies": [{"body": "Source?\n\nGoogle doesn't show anything. Also never heard of Tessa.", "score": 0, "replies": [{"body": "Tesla...Auto correct error. It was a joke ", "score": 1, "replies": [{"body": "Oh.. Rumors did say that they wanted to enter the car market, and wanted to do so with another party.\nWould make sense, just not with tesla and the value they hold. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What about Apple Watch? \n\nThat was pretty innovative. A wearable computer that actually works and people actually want to wear.\n", "score": 1, "replies": []}, {"body": "There is more to innovation than creating the product with the best specs. That's something no other company does. And that's why Apple is so cash rich. ", "score": 1, "replies": [{"body": "I can agree with part of that, Apple is good at refinement and you can consider that innovation.", "score": 3, "replies": [{"body": "And their marketing is top notch. They have really carved a cult following. ", "score": 3, "replies": [{"body": "Having 1 billion users does not qualify as a cult. sorry.", "score": 1, "replies": [{"body": "Why not?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "My theory is that, everybody say Sony and Nintendo rise to the top of the world then fall, and they assume Apple will do the same. I disagree personally.", "score": 1, "replies": []}, {"body": "Who is saying this?  Analysts or the talking heads on CNBC?\n\nSeems like AAPL consensus is a strong buy... and I imagine it's been that way for a while.", "score": 1, "replies": []}, {"body": "Everyone expects their earnings to stop growing but they keep finding new revenue streams ", "score": 1, "replies": []}, {"body": "Wall street knows they try to drive the price down to pick up shares cheap.\n\nThen they change their stance to bullish, dump for a good profit and turn bearish again later. Rinse repeat", "score": 1, "replies": []}, {"body": "Smart phones will become commoditized eventually, just like with radios, televisions, desktops, digital cameras... most consumer electronics. Then Apple will no longer be able to charge a premium price.", "score": 1, "replies": [{"body": "Exactly, people are not paying premium for the newest tv-tech, latest graphic card or a system camera... Oh wait", "score": 0, "replies": []}]}, {"body": "I think guidance plays a huge role. Like if AAPL is expected to sell so much and they meet that expectation with a little bit more what else are they gonna do? AMZN had been completely demolishing industries. There are talks of amazon getting into travel and gas stations of all things. AMZN still hasnt even really touched Asia and they already have 5% of all online sales. Plus there biggest money maker is the cloud. I own apple and have been holding like you but lets be real; One shitty iphone in combination with a recall could be devastating. The other thing that worries me about AAPL is its a huge retail investor stock. The first stock a lot of people I know ever bought was AAPL. They dont have the stomach for crazy price fluctuations. Another thing to be careful about is how heavily they are represented in ETF's. If there is talks of a black swan in various sectors it could effect a selloff. Lastly, they are doing a lot of stock buybacks. How long can that go on for?  ", "score": 1, "replies": [{"body": "1 recall of a phone will not be devestating. It could push back revenue a few months but not long term.  People won't just give up on their iPhones. Their retention rates are ridiculously high and the user base is growing double digits every year.\n\nI find it hilarious that you have these worries about AAPL which has a forward PE of 14 and is literally printing money every quarter. They generate about $70 billion in operating cash flow a year.  Yet you have confidence in Amazon which has a PE of 1000 and has profit margins in the low single digits? ", "score": 1, "replies": [{"body": "PE and AMZN is irrelevant. AMZN value is based on guidance. I am not worried about AAPL I hold AAPL. If you ask a question for possible reasons and then get a few possible reasons and find hilarity why pose the question? ", "score": 1, "replies": [{"body": "AMZN PE is irrelevant until it isn't. That is the tough truth about growth stocks.\n\nAMZN is priced to beyond perfection. Its priced to become something the world has never seen before.  To me that is a MUCH bigger risk then AAPL.", "score": 1, "replies": [{"body": "ok.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think it's because it's too obvious. If investors could all just 'buy apple' then people wouldn't need the services of Wall Street funds. \n\n", "score": 1, "replies": []}, {"body": "Because you can more easily be sued for being too positive than for being too negative and negativity gets better ratings than positivty. Maybe a little manipulation here and there but overall the incentives line up with the news outlets to have a negative perspective on most things.", "score": 1, "replies": []}, {"body": "Why do you think they do it?  To convince people not to buy.  Do as they do not as they say.", "score": 1, "replies": []}, {"body": "Bc Melissa Lee and the rest of the idiots on CNBC are a fuck ton of losers. Nothing more. Nothing less. ", "score": 1, "replies": []}, {"body": "Look, I'm a hardcore Windows/Android guy on the consumer end. I like the customizability that I can get with it. However, I would be totally remiss to neglect that Apple has made some serious advancements. To say that Apple has stopped innovating is both true and untrue. Sure, their hardware is no longer as up-to-date as other phones/computers, but where they continue to make leaps and bounds towards improving ease of use on the operator's side, which is where most people value the product more than anything else. While other tech companies focus on having the latest internal components, where Apple stands out is perfecting those improvements. It's less of a gamble on Apple's end and what most consumers care about. Their user interface is one of the best out of the box solutions you can get, whereas Android and Windows users have to tweak their UIs a bit to get like they want, which requires some form of technical know-how. Not a lot, but enough to discourage your average consumer from attempting it, which makes them flock to Apple. As a result, while I will be sticking with Google and Microsoft's solutions for a while, it would be stupid of me to ignore Apple's ability to know what it's users want, and therefore, it's money making abilities as a company.", "score": 1, "replies": [{"body": "Strangely, Apple appeals to both my mother and my CS-classmates. Quite an achievement!", "score": 2, "replies": []}]}, {"body": "What is the basis of this comment ? Literally 0 sell ratings on AAPL for like 18 months now. I have no idea how this subreddit comes up with stupid shit like this all the time on Wall Street sentiment. [https://i.imgur.com/AZkmcXn.png](https://i.imgur.com/AZkmcXn.png)", "score": 1, "replies": [{"body": "What app is that you're using?", "score": 1, "replies": [{"body": "Bloomberg Professional", "score": 1, "replies": []}]}]}, {"body": "Because they want to buy it cheap", "score": 1, "replies": []}, {"body": "apple likes to sandbag their earnings guidance\n\ndumb analysts dont know how to use brain believe everything they hear", "score": 1, "replies": []}, {"body": "Who are you calling \"wall street\"? Certain analysts?", "score": 1, "replies": []}, {"body": "They have to buy cheap, they don't care about people reading their comments they care about their P&L", "score": 1, "replies": []}, {"body": "Because the stock does not represent actual value ", "score": 1, "replies": []}, {"body": "They buy when you sell. ", "score": 1, "replies": []}, {"body": "This is in part because of how Apple releases their information. They're generally very hush hush about any new products, and most if not all of those analysts that you talked about use the notion of the worst case to judge moving forward when investing in the stock.\n\nWhile I personally do not care for Apple products, I don't buy them, and I dislike their business plan and outlook on running service for their products, one thing is true; They know how to get great turnover and profit on consumer electronics. This is something that is historically very hard to do.\n\nFrom many veteran perspectives, Apple's consumer base looks like a bunch of people buying into a fad (throwback to the days when many crazy people would wait outside Apple stores to get the new phones like you now see at Supreme stores).", "score": 1, "replies": [{"body": "fads don't last for decades.\n\nApple gives its users real value. Yes their products may cost more upfront.  But they save their customers time and stress (easy to use) and command much higher resale value (trade in iPhone) and last much longer ( Macs and iPads)\n\nI've done cost analysis between an iPhone and a premium Android phone.  And every time the iPhone is actually cheaper to operate when trade in is part of the calculation.", "score": 1, "replies": []}]}, {"body": "Pundits always wrong. Its what you do when you cant beat it\n\nThose who cant do...teach", "score": 1, "replies": [{"body": "Those who can't teach, teach gym. 😉", "score": 1, "replies": []}]}, {"body": "lol love this", "score": 1, "replies": []}, {"body": "They're a company that owes its success to innovation and it hasn't innovated in 10 years", "score": 2, "replies": [{"body": "Bingo!", "score": 2, "replies": []}, {"body": "uh, which company has innovated in the last 10 years in the consumer electronic space?\n\nI think iPad, Apple Watch, Airpods, TouchID, FaceID, and Apple Pay is as innovative as anything any other consumer electronic company has done.", "score": 1, "replies": [{"body": "Apple wouldn't be around if not to the iPod and iPhone, which were revolutionary. Your list is a bunch of features/minor advances and to answer your question, entire industries and been created since 2007/8", "score": 1, "replies": [{"body": "What about Apple Watch?  Its the first legit and mainstream wearable computer in mankind's history.", "score": 1, "replies": []}]}]}, {"body": "Really? Nothing in 10 years huh?\n\niPad? (Still under 10 years old)\nFirst consumer 5K all-in-one computer?\nARKit? (Before Google mind you)\nSwift?\nAirPods?\nFaceID?\nProMotion 120Hz in a frickin tablet?\niPad pencil with tilt and pressure sensing?\nHomePod (the audio portion of it)\nAppleWatch\n\nAnd that’s just off the top of my head...\n\n", "score": 1, "replies": []}]}, {"body": "To go from 1 million dollars to 2mil it's easy. \nFrom 10billion to 20billion it's harder.\nFrom 1 trillion to 2 trillion. Its never been done.\nAlso think about all the,money in the world. It is estimated at around 75 trillion. Does Apple really have a value of 1.3% of all the,money in the world? Not really relative just food for thought.", "score": -1, "replies": [{"body": "People could have used the same 'logic' when AAPL was worth $500 billion.  And look where we are now.\n\nApple generates about $70 billion in free cash flows a year. So yes they easily are worth $1 Trillion and much more as they continue to grow services revenue, buy back more stock, and grow the install base.", "score": 9, "replies": [{"body": "Totally agree with you and I believe Apple is worth every penny. I know that it's not a solid logical arguement. But a company cannot grow at 20% plus forever. It may last 50 years or more, but not forever.", "score": 2, "replies": [{"body": "sure not forever. \n\nBut there is no reason a company cannot out perform the market in the long term. \n\nApple also has the ability to buy growth - stock buybacks to increase EPS, and buying other companies and technologies.", "score": 2, "replies": []}]}]}]}, {"body": "Android users have a weird vendetta against Apple so any analyst with an Android phone shits all over them. \n\nEdit: This defensiveness proves my point, congrats if it doesn’t effect you but it definitely effects lots of people. ", "score": -4, "replies": [{"body": "Lol \n\nDumbest post of the day right here boys  ", "score": 3, "replies": [{"body": "To deny phone tribalism effects peoples decision in investing is dumber. ", "score": 0, "replies": []}]}, {"body": "I'm an Android user and have only owned 1 Apple product.  Been long since 2004.", "score": 2, "replies": [{"body": "Same here. I hate apple products, but I like the company and have owned the stock for several years.", "score": 2, "replies": []}]}]}, {"body": "AAPL is like TSLA its a cult", "score": -12, "replies": [{"body": "sorry bro.\n\nAAPL has over 1 billion active devices in the world. That isn't a cult. That is as mainstream as it gets.\n\n", "score": 9, "replies": []}, {"body": "Really? Since when did Tesla get profitable?", "score": 3, "replies": []}]}]}
{"title": "[DD] Making WSB Great Again - Micron DD and $150k YOLO - ABSOLUTE CONFIDENCE", "selftext": "[I've](https://www.reddit.com/r/wallstreetbets/comments/95g8cr/time_to_get_long_on_mu_chart_attached/e3sgp6m/) [been](https://www.reddit.com/r/wallstreetbets/comments/93sgct/peak_mu_despair/e3fmbef/) [seeing](https://www.reddit.com/r/wallstreetbets/comments/95pa3c/my_return_on_mu_is_almost_positive_so_its/) [a](https://www.reddit.com/r/wallstreetbets/comments/95gmh3/rip_mu_tt/e3sjuej/) [lot](https://www.reddit.com/r/wallstreetbets/comments/95pk4b/at_least_micron_didnt_have_a_red_day_celebration/e3uhgnj/) [of](https://www.reddit.com/r/wallstreetbets/comments/95kdor/mods_are_asleep_upvote_pictures_of_actual_mu_stock/e3tcx9z/) [Micron](https://www.reddit.com/r/wallstreetbets/comments/951ouz/micron_i_accept_defeat/) [bears](https://www.reddit.com/r/wallstreetbets/comments/951ouz/micron_i_accept_defeat/) [on](https://www.reddit.com/r/wallstreetbets/comments/949p9c/is_micron_dead_here/e3jamtz) [this](https://www.reddit.com/r/wallstreetbets/comments/949p9c/is_micron_dead_here/e3jaxdd) [subreddit](https://www.reddit.com/r/wallstreetbets/comments/93h6ep/disappointed_in_mu_performance_today_after/e3d6ywz) [recently](https://www.reddit.com/r/wallstreetbets/comments/93qu32/fitch_assigns_bbb_first_time_rating_for_micron/e3f9ag0) (except for [this guy](https://www.reddit.com/r/wallstreetbets/comments/9525pb/when_is_the_mu_run_up_happening/e3qnbnu/) who has the confidence this subreddit needs, but may not deserve); this should be as good of a reason as any to go long (why would you follow people too scared to sell naked calls and who probably think that selling naked puts has more downside risk than buying 100 shares of the underlying?).  In case you want some \"justification\" for your \"thoughtful investing decisions\", here is some Micron DD\\* (see footnote). Micron is in the business of making memory chips including: 1)  [DRAM](https://en.wikipedia.org/wiki/Dynamic_random-access_memory), used in everything from computers and graphics cards, to video game consoles and mobile devices for dynamic, volatile memory storage; and 2) [NAND memory](https://en.wikipedia.org/wiki/Flash_memory) used for persistent storage in things like SSDs and USB keys. If you've been subscribed to this subreddit for any length of time, you're probably well aware that their forward P/E **is below 4.6** and their 12-month trailing P/E similarly attractive (just under 5.4). They've worked this year to become net cash-positive by paying down debts and announced plans to commence a $10B stock buyback program and otherwise return 50% of free-cash-flow back to investors starting in the next fiscal year (September).\n\n**DRAM**\n\nDue to the ubiquitous and interchangeable nature of DRAM chips, many analysts consider DRAM manufacturers to be producing a commodity--while this is true to an extent, there are barriers to entry that make competition from new entrants somewhat difficult, and the interchangeable nature of memory chips helps to mitigate some of the downside (e.g., tradewar) concerns that people have. Typically, commodity manufacturers have to work to distinguish themselves -- either really push efficiency and squeeze every last ounce of margin out of the product, or have flashy branding, or better quality, etc. Soybeans are a commodity; toasters are a commodity, GoPros (i.e. mobile recording cameras using relatively unsophisticated technology in their manufacture), are a commodity--cheap knockoffs are trivial to manufacture, so GoPro may lose market share if they don't aggressively market their brand.\n\nDRAM has one characteristic that distinguishes it from the above products: it is still hard to manufacture and requires skilled, technical know-how and execution. It's only \"easy\" in the sense that the process is *straightforward provided you already have* established fabrication labs and process technologies-- look at how much trouble Tesla had establishing a car production line from scratch, despite employing smart, capable people. Now imagine building from scratch a process that creates physical chips requiring nanometer scale precision with fewer than 1.4 defects per million chips. For reference and sense of scale, a human hair is \\~100000nm wide, a human cheek cell is \\~60000nm in diameter, and a strand of DNA is \\~2.5nm wide. Samsung and Hynix, two of the three primary global manufacturers of DRAM, each experienced in DRAM production and efficiencies, both have announced difficulties and delays in manufacturing the next generation of 10-nanometer (i.e. sub-20nm) DRAM, showing that it's not easy for even sophisticated incumbents to roll out the required tech. I mention all of this to address concerns people have about Chinese entrants into the market; these manufacturers are only now beginning *trial production* of 30-nanometer DRAM, and plan to scale down to 20-nanometer DRAM later this year. Even if fully successful, volume will be very low, and additional capacity won't come online for several years yet. It's unclear whether these producers even have the IP rights to sell chips outside of China (the counter argument is that China doesn't care about selling outside of China when they have such a large domestic population; this doesn't seem to be an unreasonable argument, but realization of this is still years away and organic demand growth will certainly help mitigate this -- perhaps the tariffs will cause movement on Chinese policy here, perhaps the TPP will come back, perhaps there will be some other solution in the intervening half-decade that brings China to western norms of IP protection). All of this is not to say that that China won't eventually be able to be a viable competitor in the marketplace, but that it is, at best, many years away.\n\n**NAND**\n\nThe other major item that Micron produces is NAND \"flash\" memory, used in USB keys and SSDs. This carries lower margins generally, and is limited in margin/sales price by the availability of HDDs as a competitor for long-term storage. There are five total major market participants in the NAND memory space, which lends itself to a higher risk of incumbent participant overproduction than the three participants in the DRAM space, which accounts for some of the lower margins. Similarly, manufacture of the chips requires somewhat less sophisticated technology except for when pushing the extremes of memory density. Moore's law has come close to running it's course in a the X-Y plane, forcing memory chips to build layers in the Z-dimension to add memory capacity; this is also not trivial feat, but something that Micron (along with Intel) is doing well in.\n\n\\*Breaking DD: Chinese competitor in NAND market\\*\n\nThere was a [thread last night]([https://www.reddit.com/r/wallstreetbets/comments/95ryef/china\\_to\\_mass\\_produce\\_3d\\_chips\\_next\\_year/](https://www.reddit.com/r/wallstreetbets/comments/95ryef/china_to_mass_produce_3d_chips_next_year/)) about an upstart competitor from China producing 96-layer NAND chips. [This thread from a few hours ago]([https://www.reddit.com/r/wallstreetbets/comments/95uqb5/why\\_that\\_article\\_on\\_yangtze\\_memory\\_going\\_to/](https://www.reddit.com/r/wallstreetbets/comments/95uqb5/why_that_article_on_yangtze_memory_going_to/)) has a reasonable rebuttal, and I would like to add just a few things to it: 1) the second thread is indeed correct to question the notion of a NAND \"glut\" -- prices are simply off record levels, and have stabilized; 2) [this article]([https://www.anandtech.com/show/13166/yangtze-memory-unveils-xtacking-architecture-for-3d-nand-up-to-3-gbps-io](https://www.anandtech.com/show/13166/yangtze-memory-unveils-xtacking-architecture-for-3d-nand-up-to-3-gbps-io)) mentions them using 180nm technology in it which is seemingly ancient technology and this tech supposedly **doubles** the throughput of their competitors' highest-end product? If true, could be very good for them, but I'll wait to see this magic chip. In any case, I'll have to, as the lab is supposedly small and capacity won't scale for years at the earliest.\n\n**Industry-wide (Non)-Ease of Scaling to Provide Additional Supply**\n\nScaling to provide new additional DRAM is, following on the above reasons, much more difficult than it was in previous years.\n\n[https://imgur.com/AW72QOq](https://imgur.com/AW72QOq)\n\nThat means that any attempt to scale will require much more CapEx than past generations of DRAM--the barriers to entry are higher, and also the incentives to not overproduce.\n\n**Growth Case**\n\nThe vision for growth in the memory space relies on four major areas: 1) Cloud; 2) Mobile; 3) Automotive; 4) \"Internet of Things\"; 5) Consumer PC. Each of the four above growth areas rely in part on the \"virtuous cycle\" thesis, wherein the potential for data-driven decisions push demand for data storage (NAND-based) and then building software that can effectively mine this data using DRAM to provide in-process memory for that software; a marginal investment in one drives marginal investment in the other, and as computer learning gets better, there is more justification for either of the above. Growth for DRAM is expected to be \\~20% y/y for the foreseeable future and \\~40% for NAND.\n\n*Cloud*\n\nFar and away the biggest market segment for Micron and industry participants is the Cloud and server/PC sector. Accelerated compute ideal for AI applications have been driving, and are expected to drive, premium cloud offerings over the next few years and are DRAM intensive. Please note that every. single. company. connected to cloud services this earnings cycle continues to show good profitability and good forecasts for profitability into the future (if you are able to show me a company that reported bad cloud forecasts, please do, and I'll show you a company you should probably short). It's worth noting that one of Micron's competitors, Samsung, reported in their most recent earnings good sales and forecasts for DRAM and NAND memory in the cloud sector going forward (consistent with everyone else). Every graphics card that AMD or NVIDIA that becomes operational in the cloud for emergent computing needs, or is sold to a consumer, might have Micron memory underlying it.\n\n*Mobile*\n\nEvery cellphone/tablet/ etc that is manufactured requires both flash storage and DRAM for in-app memory. There have been some \"storm clouds\" here as consumer replacement cycles for mobile devices have increased from 23 months to over 30 months, and (for example) Apple reported approximately flat iPhone unit sales (even as iPhone revenues increased) in their last quarterly earnings. Even so, current projections still anticipate rich mobile application needs to drive average DRAM/phone to double and NAND usage to triple over the next few years. Anticipated enterprise mobile client requirements are 12GB of DRAM and 1TB of NAND in flagship products.\n\n*Automotive*\n\nAs autonomous and quasi-autonomous vehicles begin to be produced, I want you to imagine a world where all of the data collected by every sensor on the car is stored and uploaded to the cloud for future analysis/datamining --- driving not only better autonomous algorithms, but being used to identify locations on the highway or particular intersections where lots of \"near misses\" occur -- things like this already happen in modern commercial aircraft, where things like airspeed and flap position and engine parameters are recorded every 0.25 seconds for the duration of the flight, uploaded instantly via wifi to servers upon arrival of the airplane at the destination, and datamined with all of the other available data. Every sensor on every quasi-autonomous vehicle manufactured in the future will not only require storage space onboard the vehicle, but storage to analyze the data later. Even if companies like Tesla aren't currently storing all data generated by every car, eventually one of them \\*will\\* move to an opt-out data collection process; it's just a matter of time.\n\n*Internet of Things*\n\nThis may feel like one of the more \"pie-in-the-sky\", perpetually 10-years away growth opportunities, in part because the current market segment is extremely small and somewhat abstract, but allow me to point out one current market on this list: \"Smart\" internet-connected security cameras (home or otherwise) -- these are cameras capable of storing and uploading video footage to the cloud; this requires not only cloud space, but memory on the device to buffer against temporary internet outages; memory growth needs in this segment is anticipated to be 16x for both DRAM and NAND within the next five years. It's worth pointing out that this is the smallest current driver of projected growth and current business, so if none of this segment pans out, little of Micron's value is affected, but if it does pan out--it'll be good.\n\n*Other Consumer*\n\nThere's not too much to say here -- consumer laptops and PCs aren't going anywhere and storage/memory needs continue to grow.\n\n*Additional DD from the Flash Memory Summit 8/8/2018*\n\n[https://www.anandtech.com/show/13184/flash-memory-summit-2018-micron-keynote-live-blog-qlc-flash](https://www.anandtech.com/show/13184/flash-memory-summit-2018-micron-keynote-live-blog-qlc-flash)\n\n**StOrMy ClOuDs**\n\nRecently, a Chinese court issued a preliminary injunction against Micron, prohibiting them from selling *certain* DRAM chips in China. These chips in China account for \\~1% of annual revenue and Micron has since reiterated that this action does not change their forward-looking revenue guidance range. Here is where the commodity-like status of DRAM and NAND chips, together with the relatively inelastic supply of these chips, work into Micron's favor. Chinese consumers of these chips need to get them from *somewhere* \\-- so they'll go to Micron's competitors. These competitors, however, only have a limited supply, so to the extent that they are able to supply Chinese consumers, they are similarly unable to provide chips to other world-wide consumers-- allowing Micron to step in and fill the gap world-wide and serve those consumers that SK Hynix and Samsung no longer have the capacity to supply. This is similar to what happened in soybeans -- initially, after the soybean tariffs were announced, the futures markets crashed due to traders in Asia offloading risk from US soybeans to Brazilian soybeans. Then, hours later, as Europe woke up -- they don't have a preference between US and Brazilian soybeans, so they'll take the cheaper US soybeans -- soybeans futures recovered fairly quickly.\n\nI don't mean to understate it--soybean farmers have been having a tough time--but a good part of that is weather-related: this has been a good growing season for soybeans (and so lots of available supply). Soybeans have since rallied a fair bit off the lows driven by tariff speculation. Even if everything blows up and China kicks ALL of Micron out of China -- all that means is the market shifts around. Yes, it's disruptive to existing supply chains and relationships, but also n.b. that is not a positive or desired outcome, from China's perspective, for their internal consumers of memory chips scrambling to fill supply from the two remaining supplier, at higher prices. N.b., further, that China has still specifically not targeted Micron products in the trade war.  I believe the trade war fears have been oversold.\n\n*US Tariffs on Semiconductor Industry*\n\nDiscussed [here](https://www.reddit.com/r/wallstreetbets/comments/95gmh3/rip_mu_tt/), the US announced tariffs on semiconductors from China. This isn't as bad for Micron as it may first appear-- they have manufacturing facilities outside of China for import of those chips *into* china, for inclusion in other derivative products. They also have manufacturing facilities within the US that sell to and around the US. The primary hit that Micron will take from the tariffs would be the impact of reduced demand for derivative products (e.g., cellphones, laptops) manufactured in China using Micron components and then exported back to the US. Much more directly impacted would be the companies selling those laptops and cellphones (i.e., Apple, Dell, etc). The exact impact on demand is likely to be complicated and dependent on the specific product and niche it occupies -- Apple may be willing to eat most of the cost of the tariffs (by taking a lower margin on the phone) to keep demand up, but low-margin, super cheap laptops and knock-off phones may not have any choice but to pass increased costs onto the consumer; the ultimate impact on sales then depends on the elasticity of the demand curve--which I suspect is at least somewhat inelastic: cellphones are not highly discretionary purchases at this point.\n\n**Return of Shareholder Value**\n\nHere's the kicker that really sweetens the pot. Micron has already approved a stock buyback program wherein $10 billion will be used to purchase Micron shares, starting in September and lasting for nine-months. For context, using MU's average daily trading volume of \\~45.5 million, and let's assume an average buy-back price of \\~$60/share (n.b. that if micron stock price stays deflated, the following number goes UP), then over the next nine months, approximately ($10B / $60/share / (5 trading days/week \\* 4.5 weeks/month \\* 9 months ) / 45.5 million shares) \\* 100%  = \\~1.7% of Micron's daily trading volume, each trading day, will be used to *indefinitely remove shares of MU stock from circulation*. This should theoretically produce \\~$8 of stock rise in the absence of any other input. Additionally, they have pledged to return 50% of free cash flow to investors starting in FY 2019 -- we will see in earnings what these might be projected to be, but holding 2017 numbers steady would equate to a yield of \\~10% based on current valuation, assuming no potential for future growth in an industry that everyone believes will have future growth -- eat your heart out ALLY SAVINGS.\n\n**Conclusion/Reiteration of the Fundamental Case**\n\nWhen previous market cycles found an overproduction of computer memory, there were far more market participants and hence higher pressure to produce chips and drive down margins; marketplaces with so few participants more rarely see overproduction, and with such a recent history of it, the management of all the incumbents are likely to be hesitant to expand production beyond what they view as surely sustainable. Micron just doesn't carry the same risks the industry had several years ago to warrant a P/E ratio of 5, trailing earnings: they do not have unsustainable dividends; they do not have a flooded marketplace likely to overproduce (indeed, Samsung and SK Hynix announced plans to delay expansion, precisely so that the industry would be sure to not overproduce); they are producing into and for a sector with organic growth, increasingly (if not completely) isolated from the cyclicality of the PC and mobile phone markets; concerns over the Chinese ruling are overblown, with the ruling not even affecting the company's guidance for the quarter.\n\n**TL;DR:**\n\n* [Sanjay and Papa Bezos be like](https://imgur.com/b90Dmgi)\n* [Sanjay and Satya Nadella be like](https://imgur.com/4bc1L23)\n* [Sanjay and Larry Page be like](https://imgur.com/khb4U6h)\n* [Sanjay and Lisa Su be like](https://imgur.com/31BEfXq)\n* [Sanjay and the entire cloud-based industry be like](https://imgur.com/sCMnuG5)\n* [It's time to get on the MU train](https://imgur.com/sHI5jHP)\n\n**Proof of long position**:\n\nAlbum link b/c I've got money spread across several different brokers/accounts: [album](https://imgur.com/a/FUo7BpM)\n\n**Footnote/Disclaimer**: I am not an investment advisor and none of this is investment advice. \"FOR ENTERTAINMENT PURPOSES ONLY\"... you fucking sheep\n\n\n\\* Edit: formatting\n", "id": "95vtp4", "created_utc": 1533816158.0, "score": 414, "upvote_ratio": 0.98, "num_comments": 137, "comments": [{"body": "I read the first few paragraphs and then saw how much more reading there was and then scrolled to the bottom without reading the rest to comment the following.\n\nThe length of this DD has given me enough confidence to buy 2k worth of calls. ", "score": 272, "replies": [{"body": "Good im not the only one who came to this conclusion ", "score": 55, "replies": [{"body": "Note to self write like 3 paragraphs of half assed analysis then copy and paste a book into the body of the post then do the opposite of the post", "score": 18, "replies": []}]}, {"body": "Smart play. No successful man wastes his time researching, reading, or doing other nerd shit. They have advisors who do it for them and tell them what they should do. \n\nLook at Elon Musk. You think he sits in his office all day reading about profitability and other nonsense? Hell no. He hops on Twitter and shitposts. And when those bonehead analysts tried to ask him boring questions he shut them down and moved onto YouTube. \n\nSo you're doing the right thing here.", "score": 29, "replies": []}, {"body": "$DIS is great (DD below)\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. $DIS is good.\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. $DIS will go up.\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. All the cool people like $DIS.\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. $DIS is good.\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Smart stocks people like $DIS.\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. People who hate $DIS support terrorism.\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. $DIS has many powerful wizards.\n\n   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah.   Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. Blah blah blah blah blah blah, blah blah. You should buy $DIS.\n\nTLDR: Buy $DIS", "score": 14, "replies": [{"body": "next time I suggest using [bacon ipsum](https://baconipsum.com)", "score": 6, "replies": []}]}, {"body": "I am in awe at the size of this DD", "score": 4, "replies": [{"body": "I read the first two paragraphs and then scrolled to the bottom. Bought DIS calls ", "score": 4, "replies": []}]}, {"body": "The length of the first two words, then auto scrolling to this and reading it has caused me to want to buy calls and then I just kept wanking and playing donkey Kong on my switch. \n\nWhat is this life.", "score": 4, "replies": []}, {"body": "Are you ok man ", "score": 1, "replies": [{"body": "Contemplating suicide actually ", "score": 1, "replies": [{"body": "Damn. Don’t die ", "score": 1, "replies": []}]}]}]}, {"body": "With the amount of effort it took to put this together the least I can do I buy more calls.", "score": 220, "replies": [{"body": "this is like an autistic gofundme page. getting some calls in tribute of this 'spergers boi", "score": 85, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": ">Any DD over 3 lines long\n\n\nIs it even DD at that point?", "score": 5, "replies": [{"body": "is it even DD if it's more than 5 words long and not put into a medieval painting meme?", "score": 5, "replies": [{"body": "I want to see someone make a DD entirely conveyed through memes. I think the autism here could make it happen.", "score": 5, "replies": [{"body": "https://i.imgur.com/a8LXHNE.jpg", "score": 5, "replies": []}]}]}]}]}]}, {"body": "This is significantly longer than my attention span. I am A L L  I N.", "score": 62, "replies": [{"body": "r/me_irl", "score": 4, "replies": []}]}, {"body": "Good DD: Check.\n\nBig position: Check\n\nBig balls: Check\n\nHave an upvote and welcome to team MU.", "score": 131, "replies": []}, {"body": "isn't it great to live in a world where TSLA can burn cash with a flamethrower and still have a higher market cap than micron? ", "score": 83, "replies": [{"body": "That's because Sanjay is a shitty ceo. Maybe if he spent less time fucking around at the office and more time talking shit on Twitter MU would be doing better. ", "score": 46, "replies": [{"body": "This triggered me", "score": 18, "replies": []}, {"body": "Thank you come back again!", "score": 4, "replies": []}]}, {"body": "Elong Dong is like Jesus, dont mess with him.", "score": 16, "replies": [{"body": "Crucifixion wen", "score": 5, "replies": []}]}]}, {"body": "I swore off this shit stock after losing 20% of my portfolio in 1 week and I just broke even again but your post convinced me to pick up some calls", "score": 37, "replies": [{"body": "Are you me?", "score": 11, "replies": []}, {"body": "talk to me when you lose 80% in a day on it", "score": 2, "replies": []}]}, {"body": "**I NEED A STRIKE PRICE AND AN EXPIRATION**", "score": 33, "replies": [{"body": "[deleted]", "score": 58, "replies": [{"body": "Could you even imagine", "score": 7, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Can we make SMP an official WSB measurement?\n\nAlso this scenario made my willy move and I don't even own any MU calls.", "score": 17, "replies": [{"body": "> Can we make SMP an official WSB measurement?\n\nWe can try.  Oh and happy to be of service to your willy\n\n", "score": 3, "replies": []}]}, {"body": "Fuck. Fuck. The non-zero chance of this is going to make me buy calls again on this shit pile of a stock so that I'm not the only poorfag left.\n\nIt's like when your co-workers team up for Powerball. I know I'll lose, but I would buy $ROPE if they actually won while I toiled my life away.", "score": 6, "replies": []}, {"body": "This is the real DD right here. Tim is the God of supply chains. Going in for $1k worth of monthlies.", "score": 5, "replies": [{"body": "lol, my $55s at $3.95 cost basis are rooting for you", "score": 2, "replies": [{"body": "Update https://i.imgur.com/k9qK7TM.png", "score": 11, "replies": [{"body": "ABSOLUTE MADMAN\n\nalso jesus h tapdancing christ $387 in commissions, get yourself a robinhood account\n\n/u/JohnnyCupcakes or /u/MechaFuckboy do your newly-designated duty and get this man a fucking flair cc /u/SwineFluPandemic", "score": 6, "replies": [{"body": "Yeah TDA charges 75 cents per contract. Sucks.", "score": 1, "replies": []}, {"body": "btw this didn't work out", "score": 1, "replies": [{"body": "I know.  I held my $55s to the end", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "110$ January 19", "score": 4, "replies": [{"body": "oh my", "score": 2, "replies": []}]}, {"body": "I’ve learned the SOP here at WSB is just to BUY! BUY! BUY! No money? Borrow some and BUY! BUY! BUY! Besides, OP drafted an essay. ", "score": 4, "replies": []}, {"body": "55 Jannies lookin like a snacc", "score": 1, "replies": []}]}, {"body": "excellent DD have an upvote.\n\nThe stock buy back program is a good reason to buy in on this.", "score": 25, "replies": []}, {"body": "tl dr solid info bro took out a 200k loan with 600/mth interest all in muuuuuuuuuuu", "score": 22, "replies": [{"body": "First post in this location: Took out 15k and purchased September 14 $53 strike calls. Along with 2 June 21, 2019 $65 calls.....", "score": 3, "replies": [{"body": "#oneofus", "score": 2, "replies": [{"body": "I honestly don't know why people don't do this more. It's worked out a few times for me...eventually I'll get hit. Not a big deal. Basically a car payment that gives me the ability to make a significant bump.  Let's see what happens. \n\n\\---Sidenote: My friend's son just took out a $75k loan and is playing options/investing. He's 19 and spent a solid year building credit to attempt this. Father says he can go bankrupt and deal with negatives for 7-8 years if it goes bad. Figures YOLO and if he \"wins\" he can do better than being saddled with 125k in school debt. ", "score": 8, "replies": [{"body": "yolo or die trying", "score": 3, "replies": []}, {"body": "Such a good strategy.  I wish I did this 20 years ago. ", "score": 2, "replies": []}]}]}]}]}, {"body": "You sold me when I spent 5 minutes reading only to find out I’m like halfway through.\n\nTime to dump all my money into a meme stock that has historically murdered the portfolios of several people here.", "score": 21, "replies": [{"body": "He got some solid points regarding more dram and nanad uesage. Especially the cloud part. My employer with 1500 employees is doing our first project using azure and we already using office365 and azure ad. Microsoft is pushing hard for their cloud as well.", "score": 7, "replies": []}]}, {"body": "can't forget those 2 shares on RH\n\nalso, good DD", "score": 15, "replies": []}, {"body": "I want to hear what Marty thinks.", "score": 13, "replies": [{"body": "Marty is currently in hibernation until $MU goes up. It's probably way too frustrating to come here and read this shit that is so obvious to him.", "score": 17, "replies": [{"body": "I'll start posting again when there's some actual new information or unexpected development, good or bad.", "score": 10, "replies": [{"body": "I too have become numb ", "score": 4, "replies": []}]}, {"body": "I feel his pain.\n\nSo do my calls.", "score": 2, "replies": []}]}, {"body": "Lol, check his recent comments, he mentions dram or some shit", "score": 1, "replies": []}, {"body": "Fuck Marty, he was pushing those 7/20 90 calls lmao", "score": 1, "replies": [{"body": "Proof or ban.", "score": 7, "replies": [{"body": "Oh hey Marty lol\nSo i looked and you were pushing Jan 70 calls. \nBan it is", "score": 1, "replies": []}]}, {"body": "Not seriously.", "score": 2, "replies": []}]}]}, {"body": "That's one *long* post", "score": 12, "replies": []}, {"body": "If there's one bull for Micron, it's our impatient rich person /u/martymoho himself.", "score": 7, "replies": [{"body": "I'm unloading at least half of my position the next time it hits low $60s.", "score": 3, "replies": [{"body": "After all this time :D\n\nYeah, can't imagine the mental pressure all those ups and downs cause, especially when you know that the company is undervalued as fuck, yet the market doesn't react that way.", "score": 2, "replies": []}, {"body": "What if it doesnt hit $60 again ? LOL", "score": 1, "replies": []}]}]}, {"body": "I'd say it's not just the DRAM and NAND markets but the nascent XPoint memory market. They split development with Intel and plan on providing memory to the server/cloud market while Intel takes the consumer market.\n\nXPoint would really shine on servers over consumer products as it'd provide lots of hybrid RAM/Storage accessible through the commonly used DDR interface which would reduce the need for both DRAM and SSD/HDD. While this sounds great (it's like 100x faster than SSD),  it's 10x slower than DRAM which would cause noticeable slowdown on consumer products. It'd probably be best for low end consumer computers and solely as a storage solution for very high end consumer products however is currently cost prohibitive to low end products.\n\nIf it were to catch up to DRAM in speed and/or low end storage as far as cost it'd just make the case better for server use.", "score": 5, "replies": [{"body": "> It'd probably be best for low end consumer computers and solely as a storage solution for very high end consumer products however is currently cost prohibitive to low end products.\n\nBut for these low end consumer products they can roll both memory and storage into one component. That would be a huge architecture simplification. The hottest data will still live in the cache, so your best case data access times don't change, your worst-case improves drastically, and most-common case gets worse. Without actually doing out some back-of-the envelope math I'd guesstimate a 2-5x slowdown overall. Then there's reduced overhead from having memory and storage as one space.\n\nI can see this being extremely useful in netbooks, maybe some low end phones and tablets. Of course that's assuming the cost-per-gigabyte is competitive.", "score": 3, "replies": [{"body": "True but again DRAM is still 10x faster at the moment so anything less than that at the moment would be a major downgrade. You'd need massive caches on the processor to make up for the slow XPoint hybrid storage. The computers would be moving like an early 2000s PC. Given the current cost per gb of XPoint it would still be too expensive. It'll need a few years to mature before it's ready for that.", "score": 3, "replies": [{"body": "Not really, its workload dependent.  Most consumer workloads would experience little to no performance degradation switching from DRAM to 3DXP but there are countless scenarios where there would be massive performance increase from switching from 4GB DRAM to 16-32GB of 3DXP in phones, for example.  Imagine truly instant on phones and apps never having to reload at all even when switching between numerous apps.", "score": 5, "replies": []}]}]}, {"body": "No evidence that 3DXP will be a serious money maker any time in the next several years.  Ignore it exists for now until we see how cost competitive Gen2 will be and what kind of volume the Intel DIMMs will generate.", "score": 2, "replies": []}]}, {"body": "DD that has a lot of writing... Sold. I'm all in. ", "score": 6, "replies": []}, {"body": "Following you with 40k on MU @53.35 ", "score": 5, "replies": []}, {"body": "The only two micron bears I care about are ubs and ms. Those cucks cost me more than Elons Twitter trolling", "score": 5, "replies": [{"body": "Hey, tons of people bought Tsla OTM FD call . It is now trading at 355. They are dead bro. $380 call fd was at $1600 per contract yesterday. Now it is at $59. Lmao", "score": 8, "replies": [{"body": "Woof.", "score": 2, "replies": []}, {"body": "Fuck.....", "score": 1, "replies": []}]}]}, {"body": "Excellent DD, this is good for MU. ", "score": 5, "replies": [{"body": "nothing is good for $MU", "score": 4, "replies": []}]}, {"body": "Holy shit, lets fucking go ", "score": 11, "replies": []}, {"body": ">you fucking sheep  \n  \nno you're fucking sheep", "score": 8, "replies": [{"body": "you, fucking sheep", "score": 4, "replies": [{"body": "*IN SOVIET RUSSIA, SHEEP FUCK YOU*", "score": 4, "replies": [{"body": "This is my fetish", "score": 2, "replies": []}]}]}]}, {"body": "Elongate is here.  tl;dr", "score": 3, "replies": []}, {"body": "My shit european broker doesn't sell international options. Im gonna buy some 10× leveraged $44 Dec 2018 turbo's instead and buy some more shares. Tnx", "score": 3, "replies": []}, {"body": "OP add this in there.\n\nThere's lots of positive investor news surrounding MU, but historically this news takes time for retail investors to absorb. Most institutional investors are sketchy about MU because of lack of breakout, but with positive earnings, continued expansion and a bullish economy i'd take a guess within a month we could be back up to $60.", "score": 3, "replies": []}, {"body": "WHAT CALLS SHOULD I BUY HOW MUCH AND WHAT DAte? I’m new", "score": 3, "replies": []}, {"body": "My $40k in shares and $20k in calls salute you good sir.", "score": 3, "replies": []}, {"body": "ASSHOLE READY !!", "score": 6, "replies": []}, {"body": "Let me sum it all up for you guys. WSB it's bearish on MU. Now go all in", "score": 2, "replies": []}, {"body": "Call strike price and expiration? ", "score": 2, "replies": []}, {"body": "What’s a good strike and expo for a poorboi?", "score": 2, "replies": []}, {"body": "But what about my Oct 60 calls?  Oh...those ded. ", "score": 2, "replies": []}, {"body": "It also has nice technicals", "score": 2, "replies": []}, {"body": "Given that you are so bullish on memory instead of anything specific to Micron, why not long Samsung or SK Hynix instead? Spending free cash on shareholder benefits is not necessarily indicative of a strong future in the long term.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Samsung and SKH both have a PE of 6 as well. Although Samsung also sells other products which makes it not a pure memory play.", "score": 1, "replies": []}]}, {"body": "Exactly what I was thinking, I'd like to see an answer for this as well.\n\nAll of what was mentioned in the post can be applied to Samsung / Hynix. \n\nIn fact, Hynix has the #2 market share and is trading at 4.44 P/E, while MU is at 5.29. So what is then the argument for Micron over Hynix?", "score": 1, "replies": []}]}, {"body": "DO WE STILL HAVE ABSOLUTE CONFIDENCE", "score": 2, "replies": [{"body": "Why the fuck do I keep listening to DD from you fuckers. I’d have like 4 extra paychecks if I just inversed every DD post I’ve followed", "score": 1, "replies": []}]}, {"body": "This guy fucks", "score": 4, "replies": []}, {"body": "Hey /u/LongLiveTheCloud your post is now on the [WSB DD list. Click here to read more DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nIt's important that anything marked DD is useful information for other traders. No shitposts, short and vague guesses, unexplained news links, etc. If you misused the flair please change it so people don't come here and be disappointed. You might be banned otherwise.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Slightly OTM Jan 19 look good for YOLO purposes IMO ", "score": 1, "replies": []}, {"body": "Great post. Going to sit on the sidelines for a few days then jump in with some 10/21's. Holding till right before earnings then cashing out.", "score": 1, "replies": []}, {"body": "Well. I hope 1/19 is far enough out and we get a big move. I'm so OTM. ", "score": 1, "replies": []}, {"body": "Are those Vanguard shares in an IRA?  I don't have enough money in Vanguard so trades cost $7 thus I'm stuck with Robinhood until I can get into the big ballers club.", "score": 1, "replies": []}, {"body": "ive got 62 jan 19s - im holding but should i consider rolling/adding at this price", "score": 1, "replies": []}, {"body": "Good DD. No way i see this going below $50 no matter the ER.", "score": 1, "replies": []}, {"body": "ANOTHER WELLS FAGO! I don't feel so alone anymore!", "score": 1, "replies": []}, {"body": "Solid DD. Tomorrow marks the beginning of the breakout.", "score": 1, "replies": []}, {"body": "I'll be curious to see if their margin falls in line with their estimates at these prices.", "score": 1, "replies": []}, {"body": "Thanks for the DD. I'm already bag holding MU, but it's nice to have jerk off material.\n\nAny thoughts on Western Digital?", "score": 1, "replies": []}, {"body": "Great DD, but until they start paying a dividend I won’t touch it; it’s the most non- insider manipulated stock out there ATM.", "score": 1, "replies": []}, {"body": "All of what was mentioned in the post can be applied to Samsung / Hynix. \n\nIn fact, Hynix has the #2 market share and is trading at 4.44 P/E, while MU is at 5.29. So what is then the argument for Micron over Hynix?", "score": 1, "replies": []}, {"body": "Oh man, I actually found another person who has options on Vanguard.  It's like finding a unicorn.\n\nI really like the performance history/cost basis tab despite VG being horrid for anything outside of really basic long-term option plays, though I usually use TW to check things out first before setting up any orders.", "score": 1, "replies": []}, {"body": "crazy play... hope it works out well....", "score": 1, "replies": []}, {"body": "This aged well", "score": 1, "replies": []}, {"body": "must have been bad for MU", "score": 1, "replies": []}, {"body": "How we doin this morning?", "score": 1, "replies": []}, {"body": "Flare this man", "score": 1, "replies": []}, {"body": "All i know is that was a long post and I think I got BUY JAN 2020 $120 MU from it all. thanks ", "score": 0, "replies": []}, {"body": "much words", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Jim Handy is an analyst who has been calling for the peak of memory prices for the last 3 years. Hasn't happened. His premise is also only valid if you believe no demand will increase from growing secular trends (AI, Cloud, IoT, Mobile memory, etc), hence causing an oversupply and a domino effect that would lead to an -80% drop in prices.\n\nThe only thing surprising about this article is that Handy had the balls to tell all the semiconductor people that prices would fall -80% at the Flash Memory Summits. They must have thought he was crazy.\n\nIf you read the article carefully again, it begins to state that memory prices are cyclical and thus concludes they must drop. Hardly a convincing argument given the explosion in memory since 2016 isn't coming from PC cycles of which Handy is basing his premise on. ", "score": 2, "replies": []}]}, {"body": "I bet you wanted to go to buy calls beforehand so you did this whack ass DD to make yourself feel better ", "score": 0, "replies": []}, {"body": "Doubling my position tomorrow bb\n\nMay Lord Sanjay bless you with tendies", "score": 0, "replies": []}]}
{"title": "Update on Tesla Puts", "selftext": "", "id": "95z3ue", "created_utc": 1533839747.0, "score": 451, "upvote_ratio": 0.97, "num_comments": 129, "comments": [{"body": "Fucking nice job. ", "score": 263, "replies": [{"body": "He already lost way more than this on puts lats week. If he doesn't sell immediately he will lose this too\n\nAlways remember: Bears are retarded", "score": 162, "replies": [{"body": "Let's see the calls you bought today", "score": 169, "replies": [{"body": "I buy and own shares because elon ensures my financial security with his tweets", "score": 168, "replies": [{"body": "SEC , here's the guy you're looking for.", "score": 53, "replies": []}]}, {"body": "Hey man, who cares, you have plenty of money, ", "score": 3, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "I know but I had a bunch of retarded tesla bulls messaging me \"RIP\" earlier this week so I had to post an update.", "score": 34, "replies": [{"body": "ah, puts out of spite are the only puts if you ask me.", "score": 24, "replies": []}, {"body": "Lmao people actually use the messaging on reddit ", "score": 10, "replies": []}, {"body": "You da fucking man, lol I covered at 350. This bitch is going to 250", "score": 3, "replies": []}]}]}]}, {"body": "Yeah those dumb bears. Everyone knows companies that turn negative profit are sound financial investments ", "score": 50, "replies": [{"body": "*Negative ROI(C) ", "score": 2, "replies": []}, {"body": "stupid bears have never heard of amazon lol", "score": -6, "replies": [{"body": "I’m not sure what you’re getting at.. Are you trying to say amazon is not profitable ?", "score": 21, "replies": [{"body": "He meant it took years before it made a profit. People who downvoted him were probably still in high school during those years and didn't know or just didn't do their research.", "score": 0, "replies": [{"body": ">He meant it took years before it made a profit.\n\nIt took most of a couple of decades for Amazon to post a profit, but Amazon has been operating cash flow positive since like 2001.", "score": 4, "replies": [{"body": "A couple decades?? 1994 AMZN was created ", "score": 1, "replies": [{"body": "But they IPO'd in '99. If we're going by that metric, Tesla is fifteen years into its existence and still hasn't become cash flow positive.", "score": 1, "replies": []}]}]}, {"body": "> He meant it took years before it made a profit\n\nIt took amzn about 6 years to be profitable from inception. TSLA has been around for 15 years and still digging their self into deeper financial debt, with no sign of any profit in the foreseeable future.\n\n> People who downvoted him were probably still in high school during those years and didn't know or just didn't do their research.\n\nSounds like you are the child not doing your research ", "score": 3, "replies": [{"body": "\"How much are the oil companies paying you?\"", "score": 1, "replies": []}]}]}]}, {"body": "I feel like we need a /teslamotors sub member bingo board with this comment being the free square", "score": 11, "replies": [{"body": "\"How much are the oil companies paying you?\"", "score": 10, "replies": [{"body": "Yeah because you know Ford and gm share all he money they make with them, that's the dumbist shit you could reply. Like how much is Edison electric paying you. ", "score": 3, "replies": []}]}]}, {"body": "Amazon is still a stupid bet. Just because you can make money trading it doesn't mean it's a good investment ", "score": -5, "replies": []}]}, {"body": "Came here to say Amazon and Apple ;)", "score": -11, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "They’re just companies? ", "score": 5, "replies": [{"body": "station label existence ludicrous squash cooperative offend quiet bored consider", "score": 1, "replies": [{"body": "Just sometimes they use more than they make ", "score": 10, "replies": []}, {"body": "Hello, I’m Harvard. Want an economics degree scholarship? ", "score": 2, "replies": [{"body": "late north party yoke pet shy punch towering rain sable", "score": 2, "replies": []}]}]}]}]}, {"body": "Lol dude that was when the market tanked as well, so nobody was buying shit. What is musk excuse ", "score": 2, "replies": []}]}, {"body": "exactly why he wants to go private. bears / analysts to concerned about quarter to quarter results. he started a car company from the ground up which is already unheard of ... its going to take a sec to become profitable. factories, employees, operations, logistics cost a lot of money, and it might be a while before he turns a profit. not sure why that is so difficult for you guys to understand. sure have ur fun quarter to quarter and shit on the company, but most of you fail to see the bigger picture and only see $$ signs cuz ur greedy fucks :)", "score": -2, "replies": [{"body": "He’s had 15 years mate ", "score": 1, "replies": [{"body": "he started a car company dude. an electric car company from the ground up. whatever, can't wait till he proves everyone wrong, too many haters for what he's actually trying to accomplish and how it can help our environment. too many mindless herd mentality bears who fall easily to the propaganda against him. you guys should look up who manipulated this entire short / bearish sentiment. chanos is a piece of shit known for trying to put enough negative pressure on a company so they go into bankruptcy., he's done it before.", "score": 0, "replies": [{"body": "Why don't you just suck the dude off?", "score": 1, "replies": [{"body": "stop ur hurting my feelings", "score": 0, "replies": []}]}]}]}]}]}, {"body": "So salty.", "score": 4, "replies": []}, {"body": "That's true for everyone here. Either post only your losses and be hailed as the next god or post all your winnings and be hailed as the next god. \n\nNobody cares about people who can be both right and wrong. ", "score": 1, "replies": []}, {"body": "He only lost 23k.... ", "score": 1, "replies": []}]}]}, {"body": "You flippin the switch right about now?", "score": 62, "replies": [{"body": "Sold most of 8/10s that I bought this week", "score": 47, "replies": [{"body": "[removed]", "score": -9, "replies": [{"body": "Bitches that are above average on the attractivness scale. The ones that you will likely never fuck.", "score": 61, "replies": []}, {"body": "Options that expire August 10th. They're short term options that are the delight of the faggots around here aka FDs", "score": 41, "replies": [{"body": "I'm new to options, why buy short term? Sorry if that's a very broad and generic question. I'm assuming they are cheaper and riskier because it's likely not going to hit the price in such a short time, but you obviously make more when they shoot up quick right?", "score": 1, "replies": [{"body": "That's exactly why FDs are \"popular.\" Higher payout for lower investment, but easy to go bust.", "score": 6, "replies": [{"body": "I'm just confused with who buys the contract when you sell it with like a day before expiration?", "score": 3, "replies": [{"body": "Somebody who's more of a masochist than you I guess\n\nAlthough there's always someone looking to exercise itm contracts", "score": 4, "replies": []}]}]}, {"body": "Correct", "score": 2, "replies": []}]}]}, {"body": "Nobody tell him", "score": 14, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Don't mess with the bull young man, you'll get the horns", "score": 7, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Lurk moar", "score": 2, "replies": []}]}]}, {"body": "Good job guys, next puts are on me", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 45, "replies": []}, {"body": "Good man right there. This was the time to short. ", "score": 33, "replies": []}, {"body": "well played, i had 4 10/19 $300 puts that i just made 70% on, holding in the fiya.", "score": 29, "replies": [{"body": "I guess that 70% just shrank a bit...", "score": 5, "replies": [{"body": "huhhuh... orrr did it?", "score": 2, "replies": [{"body": "It's a very active stock :D", "score": 2, "replies": []}]}]}, {"body": "That was a good opportunity to sell", "score": 1, "replies": []}]}, {"body": "What do the people on this sub do for a living to afford to do this shit?long live wsb ", "score": 22, "replies": [{"body": "Yeah, I mean we know for fact they don't make their living doing this.", "score": 17, "replies": []}]}, {"body": "Also short 250 shares at 375", "score": 19, "replies": []}, {"body": "sell b4 he tweets again", "score": 17, "replies": []}, {"body": "Now buyout HMNY", "score": 9, "replies": []}, {"body": "Seriously, why the fuck do people with 200k+ accounts still use Robinhood? That shit breaks every other day.", "score": 54, "replies": [{"body": "Haven't had a problem yet and i like free options.. still use etrade for shorting and long term positions", "score": 53, "replies": [{"body": "Why not Tastytrade?", "score": 3, "replies": [{"body": "ETrade (or tda post negotiation) is cheaper after like 8 contract plays", "score": 1, "replies": []}]}, {"body": "This. I don't have six figures in RH yet but I'm more than half way there.", "score": 6, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "To be fair, he probably started with 6 figures ", "score": 6, "replies": []}, {"body": "Hey man not everyone can be swinging a big dick. There's a good reason I'm still a robinhood fag", "score": 1, "replies": [{"body": "I only have 3 figures in my RH account. Still trying to come to terms with my own mental disabilities. ", "score": 1, "replies": []}]}]}]}, {"body": "Is it really free? What about the spread? ", "score": 1, "replies": []}]}, {"body": "Yeah I came over from TDA which was expensive but always worked and they have ToS. Went to Robinhood, and although free trading is awesome, I've woken up many a morning to find my current trades showing $0.01 when they still had another 3 months on them until expiration. An hour later the correct value was displayed, and this has happened numerous times. I already opened an account on tasty trade and will be moving over there in September. I'm worried I won't be able to get out of a trade when I need to, or open one for that matter, like we already saw a week or two ago.", "score": 2, "replies": []}]}, {"body": "Positions or ban", "score": 31, "replies": []}, {"body": "What the fuck.", "score": 6, "replies": []}, {"body": "Did u sel b4 close", "score": 7, "replies": [{"body": "No", "score": 2, "replies": [{"body": "Ouchh", "score": 19, "replies": []}]}]}, {"body": "Nice play, big balls paid off.", "score": 5, "replies": []}, {"body": "What was the expiration and strike, because I feel like you should be doing better than %15 no offense. ", "score": 13, "replies": [{"body": "I don't think he put his entire 200k account into TSLA FDs. ", "score": 31, "replies": [{"body": "Only 40k was in puts and only about 5k of that were FDs", "score": 18, "replies": [{"body": "20% in a meme stock and still getting called out. Love this sub.", "score": 38, "replies": []}]}]}]}, {"body": "Lol  look how it ended the day", "score": 3, "replies": [{"body": "Because people somehow think that the board meeting next week to discuss details of a buyout is a good thing.. usually the board would have the details before the CEO announced a buyout and price with secured funding. After hours trading is a fugazi", "score": 6, "replies": [{"body": "Normally yes but this is Tesla the board is the bitch of Musk. There's a reason they made his contract the way they did, they either live or die by his hand they know that. So I doubt they will be a against buyout. I suspect most investors want the buy out at 420+ and the board probably will likely approve. What really matters is who Musk is referencing when saying \"Funding secured\".", "score": 12, "replies": [{"body": "Think of it logically why would anyone pay 420 when they could literally go to the market and buy all of the company for 350 per share? ", "score": 1, "replies": [{"body": "LBO. This will be one of the largest ever, if it actually goes through.", "score": 1, "replies": []}, {"body": "Because that's not how buy outs work. The buying company always has to pay a premium to acquire the shares. That's why stocks always go up in price when a buyout is announced. ", "score": 1, "replies": [{"body": "Yes, but this is not a buyout dude, that's when another company buys your stock publicly. And tell me why is this stock not trading at 420 and is only 350 because musk is full of shit. There is no offer. Wake up and get short.", "score": 1, "replies": [{"body": "How is this not a buyout? To take the company private all the shares would have to be bought. It also doesn't matter if there is no offer or not, because in the end its tesla. It's a cult stock an it's not rational so in the end I dont think it needs the buyout to cross 400. ", "score": 1, "replies": [{"body": "Yes dude, and where does one get 70 billion to do such a buyout? It's bullshit all of it. There would be details, the board would know in advance, I'll bet here is what happens the board comes back and says since we are doing so great we are not going to sell for 420 we believe we are worth more. Blah blah blah. Buy 250 strike puts and make yourself some $$$$", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Gg ", "score": 5, "replies": [{"body": "You think this is a fuckn game?", "score": 29, "replies": [{"body": "Robinhood isn’t a video game?", "score": 6, "replies": [{"body": "Looks like a game to me. Big numbers going up and down all the time!", "score": 3, "replies": []}]}]}]}, {"body": "Way to get caught up, my dude.", "score": 3, "replies": []}, {"body": "inb4 SEC freeze", "score": 3, "replies": []}, {"body": "Sell all of it, buy calls in the dip.", "score": 7, "replies": [{"body": "Nah", "score": 3, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Nah", "score": 13, "replies": []}]}]}]}, {"body": "Who the fuck buys 200k in Tesla puts ", "score": 6, "replies": [{"body": "This is my whole account, I've got about 65k in puts right now. Didn't make sense to screenshot holdings because I've sold 12k today.", "score": 21, "replies": [{"body": "so you are about even overall I take it? you just had about 30k worth of puts expire worthless last friday but your longer term ones are profiting now?", "score": 7, "replies": [{"body": "Still down about 15k", "score": 17, "replies": [{"body": "Your in the right side this is bullshit there aint no buyer the board is going to review the \"offer\" and then vote against it ", "score": 2, "replies": [{"body": "What kind of buyer would be like \"I'd buy your company but ONLY if its really expensive\" its so stupid shouldve got some poots", "score": 1, "replies": []}]}]}]}]}, {"body": "Someone with a lot a money that can afford to lose a portion. ", "score": 1, "replies": []}]}, {"body": "Wait, I thought you bought puts before earnings when it was trading around $300. How the heck are your puts making money when it's up over 16% since earnings? Did you sell at a loss then enter again after the spike?", "score": 2, "replies": [{"body": "Put another 20k in various puts since earnings", "score": 7, "replies": []}, {"body": "Of course he did", "score": 2, "replies": []}]}, {"body": "Those are rookie numbers!", "score": 1, "replies": []}, {"body": "You have a 200K bankroll and you trade on Robinhood?", "score": 1, "replies": []}, {"body": "JP Morgan does that shit all the time. Good ol' Jamie Diamond sees something he likes, calls it crap and the people who buy it stupid. Then when it drops down, he has his investors pick it up at a discount. It's been a running joke for years.", "score": 1, "replies": []}, {"body": "How come no one is scared of sharing their portfolio value? Wtf lmao", "score": 1, "replies": [{"body": "Scared of what exactly?", "score": 1, "replies": [{"body": "russian hackers obviously", "score": 2, "replies": []}]}]}, {"body": "Congratz! I was too chickened out to pull the trigger.", "score": 1, "replies": []}, {"body": "Suhmahdick", "score": 0, "replies": []}, {"body": "[deleted]", "score": -14, "replies": [{"body": "Fortnite mobile", "score": 42, "replies": []}, {"body": "Wall Street Kid for the Nintendo Entertainment System.", "score": 4, "replies": []}, {"body": "Can I connect to the internet while my mom is in the phone? What?? ", "score": 2, "replies": []}, {"body": "Robinhood", "score": -1, "replies": [{"body": "No it's fortnite. What universe are you living in? ", "score": 6, "replies": []}, {"body": "To you, *Robinput*", "score": 2, "replies": []}]}]}]}
{"title": "Musk's correspondence with the investor willing to finance Tesla leaked.", "selftext": "", "id": "9615kq", "created_utc": 1533853645.0, "score": 12119, "upvote_ratio": 0.93, "num_comments": 127, "comments": [{"body": "[deleted]", "score": 1502, "replies": [{"body": "This is fucking next level gold", "score": 282, "replies": [{"body": "Someone give this man Platinum", "score": 70, "replies": [{"body": "Someone needs to tweet this straight to Elon ", "score": 42, "replies": [{"body": "Don't worry, it's entirely possible that he lurks WSB on an alt account anyway", "score": 17, "replies": [{"body": "alt-sexual", "score": 3, "replies": [{"body": "We have got the best fetishes; don’t we folks??? \n🇺🇸🇺🇸🇺🇸", "score": 3, "replies": []}]}]}]}, {"body": "I will, I just need gold to unlock that feature in my account", "score": 6, "replies": []}, {"body": "Giv'em Guld!!", "score": 7, "replies": []}]}]}, {"body": "Hello 👋 ", "score": 31, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "no u", "score": 5, "replies": []}]}]}, {"body": "This sub has the best shitposts.", "score": 3, "replies": []}, {"body": "I could smell it from the frontpage.", "score": 4, "replies": []}]}, {"body": "Funding secured. 👌", "score": 1061, "replies": [{"body": "No worries just temporary bureaucratic snafu ", "score": 213, "replies": [{"body": "Use a wire via Western union to this international number.  The transaction is 100% risky free. ", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": 66, "replies": [{"body": "Grug fomo\n\nGrug tsla", "score": 13, "replies": []}]}, {"body": "#F U N D I N G S E C U R E D", "score": 18, "replies": []}]}, {"body": "Cleared of all charges lol", "score": 144, "replies": []}, {"body": "Not enough misspellings or grammatical errors.", "score": 443, "replies": [{"body": "That’s how they got him", "score": 236, "replies": [{"body": "His intellect was only so foolproof", "score": 59, "replies": []}]}, {"body": "As someone who worked on trying to stop idiots getting scammed on a classified ads site, I can tell you that “I will like to” is such a feature of Nigerian scammer English that we had the system automatically flag up any message containing it", "score": 30, "replies": []}, {"body": "Well he is a prince, so...", "score": 1, "replies": []}]}, {"body": "Most likely source of funding. ", "score": 100, "replies": [{"body": ">implying the rampant autism within this sub alone couldn't indefinitely fund his endeavors.\n\nWew", "score": 15, "replies": []}]}, {"body": "[deleted]", "score": 269, "replies": [{"body": "Whoa whoa whoa, mine was $69k. Was I scammed?", "score": 74, "replies": [{"body": "Are you sure you didn’t try to send in 69 applications? Because that’s 1k each ya know.", "score": 7, "replies": []}]}, {"body": "$420.69*", "score": 14, "replies": []}]}, {"body": "**You know what fags, when the son of the deposed king of Nigeria emails you directly, asking for help, you help! His father ran the freaking country! Ok?**", "score": 102, "replies": [{"body": "bippity boppity gimme the zoppity.", "score": 24, "replies": [{"body": "Hey, that’s our saying. ", "score": 8, "replies": []}]}]}, {"body": "Haven't laugh so hard in a long time lmao", "score": 31, "replies": []}, {"body": "[deleted]", "score": 28, "replies": [{"body": "Please do the needful.", "score": 13, "replies": []}]}, {"body": "Scamming a billionaire for $250 is a thought that cracks me the fuck up ", "score": 26, "replies": []}, {"body": "$250 tax on all that funding seems legit", "score": 53, "replies": []}, {"body": "@sec, see?", "score": 35, "replies": []}, {"body": "That's all the DD I need, all in on calls @ open, you fags getting on this yacht or nah?", "score": 17, "replies": []}, {"body": "Dank", "score": 41, "replies": []}, {"body": "I fucking love this place ", "score": 24, "replies": []}, {"body": "[deleted]", "score": 33, "replies": []}, {"body": "I don't understand 99% of what goes on in this sub but fuck do i love this place and I don't know why or how. ", "score": 21, "replies": [{"body": "Musk lied about having funding to go private.", "score": 4, "replies": [{"body": "it was a definite lie?", "score": 3, "replies": [{"body": "I mean nobody can prove the nonexistence of something, but he has done literally jack to show the existence of it...", "score": 3, "replies": []}]}]}]}, {"body": "Wasn't that guy in Black Panther?", "score": 35, "replies": [{"body": "Wasn't that guy Black Panther?\n\n", "score": 24, "replies": [{"body": "Wasn't that guy Black ?", "score": 3, "replies": [{"body": "I dunno man. I don't see color.", "score": 2, "replies": [{"body": "How can you completely disregard someone's culture and heritage like that?\n\nI thought we were just playing a word game anyway.", "score": 1, "replies": [{"body": "WOOSH", "score": -1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Wasn't black", "score": 10, "replies": [{"body": "Wasn't", "score": 8, "replies": [{"body": "#", "score": 4, "replies": []}, {"body": "Was", "score": 4, "replies": [{"body": "Wakanda forever", "score": 12, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "Will", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Wasn't that guy in Black Panther?", "score": -6, "replies": [{"body": "name checks out", "score": 9, "replies": []}]}]}, {"body": "Welcome to good burger.", "score": 2, "replies": []}]}, {"body": "4 😏 20 😎", "score": 8, "replies": []}, {"body": "Looks legit.  I'm all in.", "score": 5, "replies": []}, {"body": "I really love this place ", "score": 5, "replies": []}, {"body": "We’re all missing the fact that the Prince knows he needs to file a 8-k but not Musky. ", "score": 5, "replies": []}, {"body": "Prince Okowango", "score": 8, "replies": []}, {"body": "👌", "score": 3, "replies": []}, {"body": "this is fake. no spelling mistaks", "score": 3, "replies": [{"body": "Read it over again, it’s legit. ", "score": 4, "replies": []}]}, {"body": "Serious question, is this number $70,000,000,000 ‘seventy thousand million’? Or...?  ", "score": 6, "replies": [{"body": "yes but in US english that means billions", "score": 17, "replies": [{"body": "Oh, thanks! I always thought a billion was a million millions, but I guess In US it means a thousand million... so 70 billion it is then. Not too shabby, Elon!", "score": 5, "replies": [{"body": "could you *be* more continental?", "score": 5, "replies": []}, {"body": "yea where i live (south america uruguay) a billion is a million millions which for people that dont know much about the matter causes a lot of confusion when reading online or books in english and the such", "score": 5, "replies": [{"body": "wait holy shit how has this never come up in my life before? so like if i read a uruguayan / swedish / etc. newspaper the \"billions\" would be, what? \"trillions\" in the US?! i don't know why, but i find that stupefying beyond belief. that actually makes absolutely no sense-- WHY DOES THE WORLD NOT MAKE ANY SENSE?? HOW COULD WE LET THIS HAPPEN?\n\n(also, totally apropos of nothing: uruguay is amazing-- one of my favorite places i've ever visited!)", "score": 4, "replies": [{"body": " should I go?? What'd you like about it?", "score": 1, "replies": []}, {"body": "That's actually the original way. Lot's of old British people also learnt that system. A billion (10^9 ) was called milliard. What we (by we I mean most people from the Anglosphere now) call a trillion was billion. It was basically in the intervals of thousand a thousand, million, milliard, billion, billiard, trillion, trilliard and so on. Actually analyzing the prefixes, the system is fairly logical and more logical than our current system. \n\nOur current system's billions and trillion's prefix is fairly random in the sense they are not connected with bi(2) and tri(3). It is 10^(3*prefix + 3). The random plus 3 is weird. Whereas the original is 10 ^(6 * prefix). And every thousand of a prefix made it an prefix-ard. \n\n", "score": 1, "replies": []}]}, {"body": "Same for Sweden, Norway and Denmark. ", "score": 2, "replies": []}]}, {"body": "https://en.wikipedia.org/wiki/Long_and_short_scales", "score": 2, "replies": [{"body": "That is so stupid.", "score": 2, "replies": []}]}]}]}]}, {"body": "This is fucking perfect! Tesla is going to $420!!! Buy now! ", "score": 3, "replies": []}, {"body": "You know what Toby, when the son of the deposed king of Nigeria emails you directly, asking for help, you help! \n\nhttps://youtu.be/lC5lsemxaJo", "score": 3, "replies": []}, {"body": "Seems legit, yolo calls.", "score": 3, "replies": []}, {"body": "Believed it all the way up to “thingy”.\n\nBut I’m just scared cause I bought puts after the tweet. ", "score": 3, "replies": []}, {"body": "My aunt sent over $600k to Nigeria thinking she was getting millions in cash delivered to her house.", "score": 3, "replies": []}, {"body": "[https://imgflip.com/i/2flql4](https://imgflip.com/i/2flql4)", "score": 5, "replies": []}, {"body": "10/10", "score": 2, "replies": []}, {"body": "This doesn't look legit. Switch the comas and the periods.", "score": 2, "replies": []}, {"body": "why haven't I seen this on Bloomberg?", "score": 2, "replies": []}, {"body": "No bamboozle", "score": 2, "replies": []}, {"body": "See the problem is none of us responded to the prince.. Elon's taking risks and reaping rewards! ", "score": 2, "replies": []}, {"body": "Looks legit. ", "score": 1, "replies": []}, {"body": "Yes! This is all the proof I need to baghold ", "score": 1, "replies": []}, {"body": "This could be my fault, i got a text asking me to hold 2mill € i dindt respond.   \n  \nSorry musk!", "score": 1, "replies": []}, {"body": "!RedditPlatinum for you good sir. ", "score": 1, "replies": []}, {"body": "Fucking gold. All will be ok, yes", "score": 1, "replies": []}, {"body": "Instant Classic !", "score": 1, "replies": []}, {"body": "The Nigerian Maneuver.", "score": 1, "replies": []}, {"body": "When I worked at a bank THE Fucking Attorney General Jeff Sessions personally e-mailed a customer about a $10mil inheritance the world bank was holding for said customer. All he needed to do was send the $650 application fee and his account information. \n\nSo I said to him “you better fucking do it, and let me tell you about our annuities.” ", "score": 1, "replies": []}, {"body": "If you could please give me your bak accant details ", "score": 1, "replies": []}, {"body": "This Nigerian Prince..", "score": 1, "replies": []}, {"body": "!wave", "score": 1, "replies": []}, {"body": "Is this the same nigerian prince Michael was talking to?", "score": 1, "replies": []}, {"body": "If you don't send the money, you're a paedophile.", "score": 1, "replies": []}, {"body": "Solid", "score": 1, "replies": []}, {"body": "Seems legit", "score": 1, "replies": []}, {"body": "LOL!!!", "score": 1, "replies": []}, {"body": "Mod this stable genius!", "score": 1, "replies": []}, {"body": "Think of all the rupees you could by for 70 Bs", "score": 1, "replies": []}, {"body": "Can we stop using the term leaked. ", "score": 1, "replies": []}, {"body": "I was so excited. \n\nThen I clicked. \n\nI'm still kind of excited. \n\nWell done, sir. ", "score": 1, "replies": []}, {"body": "#It's you're not your.  Totally fake.", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "“Mr. Musk”", "score": 1, "replies": []}, {"body": "now way this could go tits up", "score": 1, "replies": []}, {"body": "[brought enough for everyone in the thread, hopefully](https://resources.cleanitsupply.com/LARGE/USSCO/236119.JPG)", "score": 1, "replies": []}, {"body": "LMFAO! Giving gold, especially because my bear call spread is almost profitable again", "score": 0, "replies": [{"body": "Downvoted for giving gold? Only on wsb...where getting money is a bad thing ", "score": 1, "replies": []}]}, {"body": "Damn thats hilarious, but can’t help but chuckle at all the salt being passed around by the shorts these days ", "score": 0, "replies": [{"body": "It’s almost as funny as Tesla fanboys who treat traders shorting their precious stock as some kind of boogeyman. ", "score": 5, "replies": [{"body": "As someone who has no dog in this fight, I’m truly enjoying the banter. ", "score": 3, "replies": []}]}]}, {"body": "Your a god", "score": -1, "replies": []}, {"body": "I am new here....this is fake right?", "score": -2, "replies": [{"body": "Looks legit to me.", "score": 3, "replies": []}]}, {"body": "Sounds Japanese name but bank of Nigeria????", "score": -4, "replies": [{"body": "Yeah, I think it's fake.", "score": 4, "replies": []}]}]}
