{"title": "TSLA Put/Call Prices", "selftext": "Looking at the Apr 15 225 and 230 Strike put/call prices. \n\n$11.65 for 225 Call\n$11.80 for 225 Put\n\n$9.25 for 230 Call  4 times the Open Int as the Put\n$14.60 for 230 Put\n\nWhat am I supposed to gleen from this parity? 230 Put options are expensive(overpriced)? In short supply? Is it best to avoid the 230 put in this case?\n\nThanks\n\n", "id": "4cg1ys", "created_utc": 1459266990.0, "score": 7, "upvote_ratio": 0.9, "num_comments": 20, "comments": [{"body": "Good observation! There is always a put skew, with puts usually more expensive then calls. But with the binary event on 31Mar and its recent run up to the moon, I guess most people want to be short.Also, is it hard to borrow? This would drive more skew also towards the puts. ", "score": 2, "replies": [{"body": "What binary event it is?", "score": 1, "replies": [{"body": "They are unveiling their Model 3, which is a $35,000 electric car with a 200+ mile range. The company has been working towards the goal of bringing electric cars to the masses for about ten years, and the Model 3 is the culmination of that goal. Could either break the company if it flops, or it could go down as our generation's Model-T. But if there is one stock that whips around like a loose sail in the wind, regardless of the actual reality, it is TSLA. So who know what is it going to look like on Friday. ", "score": 3, "replies": [{"body": "I sold 190 PUT, 250 CALL Strangle 10 days ago unaware of that binary event. I just bought it back :) Lost only $40.\n\nThe IV is not that high but I knew something was up with this high pricing.\n\nLesson learned - check for binary events, not just earnings.   ", "score": 1, "replies": [{"body": "FYI, earnings are also binary events, meaning it's going higher or lower, based on one event.", "score": 1, "replies": [{"body": "Rught. TOS shows earnings and dividends on the platform. Other announcement should be research.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Puts are always pricier, in general.  I remember reading an interesting piece talking about the crash of 87 and its relevance to the persistent premium that puts now command.\n\nI would say 4 times calls open interest vs. puts means traders are looking to the upside, bullish.\n\nBoth are well above their theoretical value.\n\nAre you talking about buying the puts or selling?", "score": 1, "replies": [{"body": "Buying", "score": 1, "replies": [{"body": "Well if you have strong conviction, and don't mind losing a lot of that premium if you're wrong, then that is your guide.  I have rarely ever purchased puts.  I sell them a lot.  And most of the time I've purchased, it was to create a collar around a stock I own.\nUsing them speculatively by buying is a very hard game to win at because you have to be right, whether they are priced cheaply or dearly.\nAlso, consider, the elevated volatility priced into them will dissipate rapidly.\n\nIf you actually like TSLA, my play would be to think about where would I like to own the stock at, and sell puts down there and get paid to wait.", "score": 1, "replies": []}]}]}, {"body": "TSLA is a volatile, news driven stock with a high share price. This is reflected in the high prices in both puts and calls. ", "score": 1, "replies": []}, {"body": "The 230 puts are more expensive because they have intrinsic value.  Looking at the prices on the 225 strike the underlying would have been trading slightly below 225 at the time you grabbed these prices.  That's all that means.  Look up [put-call parity](http://www.investopedia.com/terms/p/putcallparity.asp).\n\nIf the stock is trading 225 the 230 puts will be trading the price of the call +$5.00.  If that difference ever dropped below $5 and the stock was still trading 225 someone can buy the put, sell the call, and buy the underlying for a [riskless profit](http://www.investopedia.com/articles/optioninvestor/05/011905.asp) (ignoring fees).", "score": 1, "replies": []}, {"body": "So what did you do?  Stock is at 233.", "score": 1, "replies": [{"body": "Still holding 230 puts.  Added some at 160 for a penny for fun. \n\nHad multiple chances to break even last two days but didn't bail. \n\n", "score": 1, "replies": [{"body": "Well you could still win.  I mean the hype of the new model could disapate quickly.  It's gonna be close.", "score": 1, "replies": [{"body": "Agreed. This is totally speculative and I'm fine with it either way.  I'm actually placing an order tonight.  ", "score": 1, "replies": [{"body": "Sell to close?  What price?", "score": 1, "replies": [{"body": "Order for a Model 3.  ", "score": 1, "replies": [{"body": "How about your short puts?  Hangin in?  At least it's down the after hours today.", "score": 1, "replies": [{"body": "Closed this afternoon. About 70 percent loss.", "score": 1, "replies": [{"body": "The stock was down big in today's premarket, but now it's at 241.  You could very well have those finish in the money, but still lose, because all the time and volatility value has evaporated.  I imagine you know that.  Not trying to annoy, btw.  I've just taken an interest.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "Predicting the Markets - 3-28-2016", "selftext": "Hey guys, Matt here.\n\nToday's weekly update comes in the form of a video podcast. [Take a look](https://www.youtube.com/watch?v=OXuX5lHU2nE)\n\nWe do these every Wednesday at 7:00 EST, and Sunday 6:00 EST. We take tickers from you guys and we do our analysis live and on the spot if you want second opinions, we also cover all the majors.\n\nIn short: The SPX doesn't look so hot these days, the VIX is bottoming out, oil has broken it's support for it's long move up and is looking to consolidate the high 30's. Financials are showing weakness in the bull side today. Retail was doing pretty decent, but not much else was. The dollar had a down day but the trend is still up, this is leaving commodities weak.\n\nAnd if you watch that video, please see the one where I show the difference between what is and what isn't a bull market. This is not a bull market. [Here](https://www.youtube.com/watch?v=IS5JZDeMk0Q)\n\nProtect yourself traders. The end of the move up is near... very near. And with the numbers we've been crunching showing the quickness the SPX is deviating from historic rolling MA's, if there is a crash this is likely to be the worst one we have ever had. Welcome to the dawn of leveraged ETF's being the horse that drives the underlying. If we saw the power and burden on Credit Suisse when DWTI drove /CL down into the ground, well my friends, SPXS will make that trade look like a walk in the park.\n\n", "id": "4cd5ey", "created_utc": 1459212976.0, "score": 29, "upvote_ratio": 0.94, "num_comments": 22, "comments": [{"body": "What is it about leveraged ETF's that are going to make this sell-off so extreme?", "score": 5, "replies": [{"body": "Simply put: they took futures trading out of the hands of the professionals and into the hands of the public. Now you can run the futures markets for $1-$5 a share with UWTI and TVIX and whatever else. Panic rates exponentially worse when uncontrolled and amateur people handle leveraged money. The great depression started with a massive market crash of a highly leveraged market, and although leverage is highly regulated now, the banks have repackaged the same risk into these leveraged ETF's which can now drive the market on leveraged speculation just like it did in the roaring 20's\n\nThe oil short this year was just a taste of how severe shorting can get on leverage. Fall from $60 to $38, then $38-51 in three days? 33% in three days?! This is very uncommon. But that's the swing power of liquidation of these highly leveraged instruments. :/", "score": 8, "replies": [{"body": "Anyone know the size of the leveraged etf market?", "score": 3, "replies": [{"body": "~30 billion usd", "score": 2, "replies": [{"body": "Unless that money makes some *dramatic* swings in a critically vulnerable market I don't see how that poses a substantial risk.", "score": 2, "replies": [{"body": "Nah. It's more about the 3 trillion is the etf market. That's where the real economic risk is imo. Disclaimer I don't have a full understanding of the market", "score": 1, "replies": [{"body": "They're working on figuring it out, I saw an article not too long ago about how indexes and etfs are affecting stocks in predictable ways that other participants are either attempting to game or cater to. I wish I could remember what it was.", "score": 2, "replies": []}]}]}]}]}, {"body": "That's a shame. I'm loving NUGT as of late. ", "score": 2, "replies": []}]}]}, {"body": "http://lplresearch.com/2016/03/24/when-is-overbought-really-another-word-for-bullish-maybe-right-now/", "score": 5, "replies": [{"body": "Great insight into the bull side of things. I always like to see both sides of the trade. Thanks for posting.", "score": 4, "replies": []}]}, {"body": "Great video Matt. Watched it last night.", "score": 4, "replies": []}, {"body": "Thank you!", "score": 3, "replies": []}, {"body": "Coooool Vid Insightful as always. I agree with retap B resistance on S&P and then we go DOWNNNNNNNNN to that 1930.", "score": 3, "replies": []}, {"body": "Hi,\n\nDo you guys chat about the European markets or is just North America markets ?\n\nCan an European interested in European markets also join the chat ?\n\nThanks!", "score": 2, "replies": [{"body": "Yep! Emailed you. ", "score": 1, "replies": []}]}, {"body": "As you have noticed S&P and Crude oil have been rising and fall together for the last 6 months. What are your thoughts about this?\n\nWhat has been your track record predictions in the past?\n\n ", "score": 2, "replies": [{"body": "They're being bought and sold by hedge funds at least is apparent from the COT. Oil is jut part of a bull basket so it explains the move with the market. Usually once the commercial's buy contracts for the year, oil and SPX start holding hands :)\n\nAs far as track record not sure how to gauge that. I'm thorough! That a good enough answer? I'm just as right and wrong as anyone else out there.", "score": 1, "replies": []}]}, {"body": "good analysis, but i really don't thing a stock market crash will hit the market this year. that is my opinion, i stand to be proven wrong.", "score": 2, "replies": [{"body": "Not with the fed staying dovish, you're probably right ", "score": 1, "replies": []}]}, {"body": "my favorite etfs are tza and sjb", "score": 2, "replies": [{"body": "is this a parody account?", "score": 1, "replies": []}]}]}
{"title": "On the AMZN Echo, like pretty much sold out forever. Who makes the core components? Worth looking into that manufacturer of components as a stock pick?", "selftext": "Think this is the hottest product in years, as a GOOG contact tells me, \"looks we're all supposed to be working on an \"Echo Killer\", but we know AMZN just nailed it. We all have Echo's at home.\"\n\nSo, is it worth looking at component manufacturing stocks for the Echo? \n\nWell not sold out forever of course, but sure hard to find. Stores say they have it (Home Depot), but they don't when you get there. ", "id": "4cfgo9", "created_utc": 1459258881.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 30, "comments": [{"body": "Can anyone name one person they know who has an echo? I can't. OP is probably an Amazon shill. ", "score": 9, "replies": [{"body": "I know a couple. Live near SV. ", "score": 1, "replies": []}, {"body": "Everyone in California has one...\nWhere do you live?", "score": 1, "replies": []}, {"body": "I have one, it's pretty cool and they add features once every two to three weeks. It's got smart home potential and it's pretty nifty that you can treat it like a voice controlled bluetooth speaker. I'm the only one in my circle who has one though. ", "score": 1, "replies": []}, {"body": "I have an Echo", "score": 1, "replies": []}, {"body": "Holly Molly, r u in Silicon Valley? Or NYC?  Everyone has an Echo here if they can find one. WOZ just said it's going to be as big as the iPhone, and AMZN just announced $100M in VC funds, just for Echo. Sold out everywhere.\n\nThat's $100M just for Echo startups. Our AI friends are going bonkers over it.\n\nWhen WOZ says, it's the next big thing, suggest he knows what he's talking about. \n\nhttps://www.youtube.com/watch?v=Naha9KI2dSE\n\n", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Ok fair enough, what's your opinion of WOZ saying it's \"the next big thing?\"", "score": 0, "replies": []}]}, {"body": "I don't think you'll get far from the manufacturers however it is a sign that AMZN is going in the right direction since they're there first.\n\nThe Echo is one of those things that you won't know is very useful until you actually have and use it because we're not use to interfacing with technology through voice on a regular basis (yet).\n\nI have it and I'm getting 2 more (Amazon Dot). I recommend it to anyone that listens.", "score": 2, "replies": [{"body": "Thanks for your input. \n\nHad an amazing meeting in NYC yesterday with an MBA professor, and a VC investor. The way we talked about the Echo reminded me so much of the enthusiasm we had back in '94 over the internet.\n\nIt's just something new that has stirred us. Like stepping into a new field of snow on a winters day. Health care of course came up first. Have not felt that much excitement about a new venture in years. We were generating ideas a mile a minute.\n\nA friend called it \"the ear of the internet.\" Like your line here: \"I recommend it to anyone that listens.\"\n\nCompared to putting an iPad in the hands of an 80 year old (we're working with seniors and pre dementia, Alzheimer's patients, trying to keep them out of nursing homes and on their own) for out next project, vs Echo, there is no question Echo is the way. We pivoted on the spot. Sure we'll have the iPad, but Echo is the main way patients will interface with our app.\n\nBelieve a boredom factor has hit the current landscape, another food delivery service? \"Tired.\" An Echo in an ICU?  Now that's \"Wired.\" And when you do your homework, and discover NO one has done that one yet, it's just like the proverbial kids in a new candy shop. Wow. :-)\n\nPlaced an order for a Dot last night. Alexa tells me, sold out to July 28. That's the longest have ever seen for a back ordered product in years. Times are a changing, and that is a good thing for us. We're the new kids on the block, and that candy is just there for the picking.\n\nWe went with the Python libraries. Our Python coder dived into his first Echo \"Skills\" project Monday, today we're demo'ing to our first investor. Like to sit down with an NYC hospital (one of those multi-billion $$$ health care organizations here, over 100,000 ER visits a year is average), super soon. That's one heck of a compressed development cycle for us.\n\nSource: New and Emerging Technologist, AKA \"An Echo Head.\"\n", "score": 1, "replies": [{"body": "That is pretty awesome to hear. \n\nAlso keep in mind, the echo is only the conduit. Not only can you build against the existing API, Amazon also will allow hardware to to use the echo service, so potentially that medical device can be more than just the Echo. I don't think many people are aware of that.", "score": 2, "replies": []}]}]}, {"body": "The rumor is that Google is coming out with an Echo clone.   I suspect that when they release it will slow down Echo.", "score": 1, "replies": [{"body": "Competition it the tech industry is a great thing.\n\nConversations generally go like this:\n\nSo you work at google?  Wow, cool.\n\nSo you work at amazon? Wow, cool.\n\nSo you work at apple? Wow, cool.\n\nHey, are you all going to Burning Man? Lets share an RV.  :-)", "score": 0, "replies": []}]}, {"body": "Lol, I can assure you that most googlers do not own an echo.  It records all the time and many value their privacy.", "score": 0, "replies": [{"body": "LOL you clearly do not understand the device.", "score": 1, "replies": []}, {"body": "It does not record all the time.", "score": 0, "replies": []}]}, {"body": "Unless I'm missing something I can't imagine the core components are that unique.\nAll it does is record audio and transfer it to the Amazon servers, then a speaker for the response? ", "score": 1, "replies": [{"body": "Think it has state of the art microphones. Pushed to the limits in that technology. \n\nI'm kind of stunned that people here are not that familiar with it. In the AI circles, and deep learning, it's so hot, it's like being the first on the internet in '94.\n", "score": -3, "replies": [{"body": "Microphone technology isn't somethign that can really be 'pushed to the limit' in this case. It's a microphone so really, the most they can do is make them smaller and use seven of them in this case.\nThe teardown lists a lot of Texas Instruments parts, including the DMP. Qualcomm wifi/bluetooth, Sandisk storage and Samsung ram.", "score": 2, "replies": [{"body": "https://www.ifixit.com/Teardown/Amazon+Echo+Teardown/33953\n\nTear down list.\n\n> the company created the Echo because it had seen interesting possibilities arising out of advances in microphone technology\n\nhttp://www.nytimes.com/2016/03/10/technology/the-echo-from-amazon-brims-with-groundbreaking-promise.html?_r=0", "score": 1, "replies": []}]}, {"body": "Do you talk like a shill all the time? Like when you're out for coffee? \n\n", "score": 1, "replies": [{"body": "Hmmm, Ok, I own zero amazon stock. Zero. \n\nWhat about the NYTs?  What's your view of their senior tech editor's view on the Echo?\n\n\nThe Echo From Amazon Brims With Groundbreaking Promise\n\n> Yet at the moment, the most promising candidate for the Next Great Gadget isn’t made by Apple, Google, Facebook or Microsoft. Instead, it is the Echo, a screenless, voice-controlled household computer built by Amazon — a company whose last big foray into consumer electronics, the Fire Phone, was a humiliating flop.\n\nhttp://www.nytimes.com/2016/03/10/technology/the-echo-from-amazon-brims-with-groundbreaking-promise.html?_r=0\n\n\n\n\n", "score": 1, "replies": [{"body": ">even describing its utility is difficult.\n\nThat's what he says. If you can't describe the utility of something it's dead.\n\nThe iPhone is a phone.\n\nI read that article and I still don't see a use-case scenario that interests me or Anyone I know. \n\n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "Wow, I'm blown away that people don't see what's going in in AI and deep learning. Let me lay low, but love to see what reactions are to this WOZ video. \n\nhttps://www.youtube.com/watch?v=Naha9KI2dSE\n\n> Apple co-founder Steve Wozniak expressed his love for the Amazon Echo, declaring it 'the next big platform for the near future' in an interview with CNBC.\n\n\n", "score": 1, "replies": [{"body": "No one I know will drop $180 on something that googles things for you just like Siri has been doing for five years, even if it's doing it a little better. Every single feature listed is something you can do with a couple flicks of your thumb. Not only that but unlike your smartphone it doesn't go everywhere with you. ", "score": 1, "replies": [{"body": "Speechless. :-)  It's way beyond Siri. Did you see the WOZ interview?\n\nWe're already working on getting them into the hands of early stage Alzheimer's patients (50% of the USA population will have ALZ by 85). Now they can connect with their families, and MDs. This is total disruption with a capital D. \n\nPr-dementia patients can speak, but they are for sure not flipping any fingers on iPhone screens.  ", "score": 0, "replies": [{"body": "When you say \"we\" do you mean you work for Amazon?", "score": 5, "replies": [{"body": "Do not work for Amazon, and don't own a share. Just bored of the internet, and this is the next big thing (IMHO).\n\nOnce WOZ went on record as saying Echo was going to be big, that sold me. Diving into the programming end of things (Python), and see it as a major disruptive tech for the health care industry. We're a nano sized startup in NYC.\n\nOur goal is to empower early stage Alzheimer's patients, with a focus on keeping them out of nursing homes. We'll release everything as Open Source when we get to the stage of a viable product.", "score": 1, "replies": []}]}, {"body": "So they have that Alzheimer and dementia demographics cornered? Old people generally don't buy into fancy new technology. The echo will have a niche market like the Apple Watch for people who love new technology for it's own sake, but don't expect this to impact their stock even a little bit.", "score": 2, "replies": [{"body": "The patients are not buying it. The insurance companies are footing the bill. Everyday they can keep a someone out of a hospital, that's money in their pocket.\n\nThis recent NYTs article is a nice overview of the tech.\n\n> Scot Wingo, the chairman of ChannelAdvisor, an e-commerce consulting firm, said the early signs suggested that the Echo was on a path to become Amazon’s next $1 billion business.\n\n\nhttp://www.nytimes.com/2016/03/10/technology/the-echo-from-amazon-brims-with-groundbreaking-promise.html?_r=0", "score": 1, "replies": []}]}, {"body": "Dude. Woz is a great man but he made a computer 40 years ago. \n\nHe loves gadgets. There's no way I'd invest in every gadget he plays with.", "score": 1, "replies": []}]}]}]}]}
{"title": "[meta] Raise the minimum price of discussed stocks to $1?", "selftext": "[deleted]", "id": "4ci5m1", "created_utc": 1459294482.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 18, "comments": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Obviously before but that is funny. ", "score": 3, "replies": []}]}, {"body": "A better suggestion, start flaying fucks that double post topics.\n\nSomeone posts about acad, less than 1/2 hour later /r/the_mighty_mango felt the \"need\" to post the EXACT same shit", "score": 10, "replies": []}, {"body": "So what about EVLV - I yolod, posted about it, got banned, and am up 100%.  Real company (local), not pump and dump, etc.  lots of legitimate companies that fall on hard times are under a dollar", "score": 4, "replies": []}, {"body": "Have you submitted your trouble ticket # for review? I think there was one in the filing cabinet for minimum $100m MC. Please send your confirmation and we can go from there.", "score": 7, "replies": [{"body": "Can you tag this \"ACTUAL worst post in WSB history\"?", "score": 2, "replies": [{"body": "Nope, because I believe in the title. I didn't read all of the words, but I imagine they carry the same message. ", "score": 2, "replies": []}]}]}, {"body": "I'll support this if you'll make an exception for TPIV.  That stock is going places with a ton of new studies launching this quarter, including a big pharma partnered combo trial with a checkpoint inhibitor.\n\nI also DD'd this particular stock when it was at .78 - it just closed at 1.22 and has more catalysts lined up.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/461tak/yoloing_galena_gale/\n\nWhile I like the sentiment of your post, the one-size-fits-all approach isn't exactly great either.", "score": 2, "replies": [{"body": "I like that you just pitched a penny stock.", "score": 2, "replies": [{"body": "TPIV's been a darling of this sub for quite a while now.  I got in and made profit from it thanks to WSB.  A bunch of us have.  I turned into a true long investor because I am a firm believer in the science.", "score": 1, "replies": [{"body": "stfu", "score": 1, "replies": []}]}]}]}, {"body": "Sit down for this one: there's a technique called short selling that's going to completely revolutionize your understanding of how stocks work.", "score": 1, "replies": []}, {"body": "Why can't we be following actual winners. Two months and all I've gotten out of wsb is lot of talk about aro, sune, bblu, line, next is mnkd. All fucking losers. All of them. Where is the talk about a winner like cpxx, under armor, Fedex.", "score": 1, "replies": [{"body": "bro the cpxx guy posts here, i talk UA all the time and am looking for options this week, i know i saw people hit on fedex and were mad that they sold day 1.\n\njust keep talking to people ask specifics if you see a post on something you are interested in. not everyone on here is sheep.\n\nwas talking to someone bout nvda yesterday, me not thinking it would break highs because ive had some for a long time, and sure enough today it did. eye on it all day, starting to think about puts for earnings and calls building up 2. \n\ntheres lots of companies just get people talking when you see someone mention one u are watching.\n\nsub needs more talk. seeking alpha boards are really good level of knowledge and insult/defending positions.", "score": 1, "replies": []}]}, {"body": "dude your the problem with this sub. stop being an elitist prick.\n\ni posted my first two options trades after learning here in a daily thread and just got flamed and meme'd because i wrote too much. they werent penny stocks either. i didnt make $, i could have made a bunch, and i didnt lose much. now im a few weeks in and doing better with my options trades.  i know a ton about tech and bank and a few other industries and try to talk things when i can. maybe ill try to make some stuff DD/analysis in the future, but if i get toxic replies why would i bother.\n\nid love to post more but it seems no one wants to learn. just flame and yolo and meme.", "score": 1, "replies": []}, {"body": "There are stalks under a buck worth mentioning too. WLC -soon to be LAC- just sold a 50% stake to a lithium producer that is going to tale this company out of penny stock range.  Check it out.  Lithium is coming.  We should at least see SUNE all the way or the door if we came this far", "score": 1, "replies": []}, {"body": "That would have excluded companies like Gerdau S.A. not that long ago.  No thanks.", "score": 1, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.7811  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/46963)", "score": 0, "replies": [{"body": "Do you really have small hands?", "score": 2, "replies": []}]}]}
