{"title": "Lawsuit NVDA", "selftext": "Anyone concerned about this? Why yes and why no in that case? \n\nhttps://www.foxbusiness.com/technology/nvidia-sued-authors-over-ai-use-copyrighted-works\n\n", "id": "1bbpaja", "created_utc": 1710115419.0, "score": 3, "upvote_ratio": 0.62, "num_comments": 34, "comments": [{"body": "nothing burger", "score": 23, "replies": [{"body": "Elaborate", "score": 0, "replies": [{"body": "What would the damages be even if they had standing?", "score": 1, "replies": [{"body": "You better believe we've got standing, bub.", "score": -1, "replies": []}]}]}]}, {"body": "Poor authors trying to steal some money from nvidia 😞", "score": 7, "replies": [{"body": "[deleted]", "score": -6, "replies": []}]}, {"body": "Not concerned. Like suing Microsoft Word for plagiarism.", "score": 7, "replies": []}, {"body": "lol not even the least bit concerned. Nvdia will get sued by thousands. Doesn’t mean those cases will actually win let alone put a dent on a company that literally holds the USAs interest in such a high regard. Nope I think it’s all just minor noise in the big scheme of things.", "score": 6, "replies": [{"body": "I read that earlier in 2023 a similar thing happened: https://www.theverge.com/2023/11/23/23973673/valeo-nvidia-autonomous-driving-software-ip-theft-lawsuit\n\nIs this the same case, it seems similar but I am not so familiar with it.", "score": 1, "replies": []}]}, {"body": "Imagine if an author couldn’t be inspired by other copyrighted books…", "score": 5, "replies": [{"body": "Computers can't be inspired. They only copy/emulate data. That's all the authors work is to the computer. Data to create patterns that might help generate desired output", "score": 1, "replies": [{"body": "I think a decade ago no one thought a computer could do what they do today too.  But if you just want to get into semantics I would argue humans can only copy/emulate and there’s just so many things whether from nature or previous works it gets all combined into random patterns with various outputs - some marketable and most not", "score": 1, "replies": [{"body": "It's not possible for humans to be only able to copy/emulate because we would not be where we are if that were true. There's a reason computers have to be \"trained\" with so much data and using so much processing power. Because they are simply processing information. A human being doesn't need training to create.", "score": 1, "replies": [{"body": "The traditional view holds that inspiration is a uniquely human phenomenon, characterized by sudden, often profound insights that lead to creativity and innovation. This perspective suggests that artificial intelligence (AI) is inherently different, capable only of copying and emulating human outputs without the capacity for true inspiration. However, a closer examination reveals that the processes underlying human inspiration and AI \"creativity\" are not fundamentally distinct but rather are part of the same continuum.\n\nHuman inspiration, at its core, involves synthesizing information, experiences, and prior knowledge to generate new ideas. This synthesis is not created from nothing; it is the result of absorbing, processing, and recombining existing elements in novel ways. Every piece of art, invention, or theory that has seemingly sprung from a 'eureka' moment can be traced back to the creator's previous exposures and experiences. Essentially, what we consider human inspiration is a complex form of pattern recognition and reapplication, deeply rooted in mimicry and emulation of observed phenomena.\n\nAI operates on a similar principle. Through techniques such as machine learning and neural networks, AI systems analyze vast datasets, identify patterns, and apply these findings to generate new content. Whether it's composing music, creating art, or proposing novel solutions to complex problems, AI's process mirrors the human capacity to draw upon a wealth of prior examples and reconfigure them into something new. Just as humans do, AI \"learns\" from existing data, adapts it, and applies it in innovative ways.\n\nThe crux of the argument lies in the source of \"inspiration.\" If we acknowledge that human creativity is largely the product of reassembling existing information into new configurations, then the distinction between human inspiration and AI creativity becomes less about the nature of the process and more about the origin of the intelligence conducting it. Both are engaged in a sophisticated dance of absorbing, integrating, and repurposing knowledge to push the boundaries of what is known and create something previously unseen.\n\nIn conclusion, to argue that AI cannot be truly inspired is to misunderstand the nature of inspiration itself. Both human beings and AI systems operate by assimilating and reinterpreting the world around them, using the building blocks of existing knowledge to forge new creations. The essence of inspiration, therefore, lies not in the exclusivity of human thought but in the universal process of innovation through imitation and emulation, a process that transcends the boundaries between organic and artificial intelligence.", "score": 1, "replies": [{"body": "\"AI\" doesn't have \"experiences\". Nothing exists within the \"AI\" without massive amounts of data being put in. Humans do not need to imitate and emulate. Like I said, we would not be where we are if what you're claiming were true. \n\nYour quote is simply trying to reduce humans to the mechanical level the \"AI\" operates on so that they can make their point.", "score": 1, "replies": []}]}]}]}]}, {"body": "That is not what happened here. Read up on it if you're interested. Sit on your hands if you're not.", "score": -2, "replies": [{"body": "Well the article above wasn’t the most articulate bit of an author goes to college and is trained on classic works I feel it’s all fair play.  Being an artist is all about taking what you think is great and recreating it to your vision and needs.", "score": 3, "replies": [{"body": "Thanks for telling me what my work is all about, but the difference between classic works and current works is that living authors actually have to live on the proceeds of our work. You buy my book and read it? I get 42 cents, and I hope you like it. You lend it to half the people you know? I get no more money, but it's all good. Ditto if you take it out of the library.\n\nBut you use my book to teach a machine to write books just like mine? I get no money and I can't sell my future books because a machine is writing just like me, and I have to give up eating, which is one of my habits.\n\nAt this time, you can actually ask ChatGPT to \"write in the style of dear midnight\" and it will do so.", "score": 5, "replies": [{"body": "But that’s not defensible with humans if they choose to write a book with your style either.", "score": 3, "replies": [{"body": "Several humans have tried to write books in my style and a couple have even gotten them published. But it took them years to do it, and it was no threat to my livelihood. \n\nThis is different. AI is different. Everyone on this sub is always saying AI is a gamechanger. Well, it is. And it will come for all of our jobs in the end.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Edited to add:\n\nAfter reading the comments on this thread, I see I have to take this down a few levels.\n\nYou know how you can get AI to write something for you?\nThat's because AI was trained on my books.\nI'm really writing it for you.\n\n\n***\nThis isn't a money grab because Nvidia's rich. This is a new legal situation created by the existence of AI. Publishers and copyright lawyers all over the US, and probably all over the world, are talking about this a lot right now.\nIn fact, several people have told me that it's the number one topic of conversation these days.\n\n***\nNBD to you, and NBD to me as a NVDA investor, but a very, very big deal in my little niche profession.\n***\nThis will happen eventually in your line of work as well. AI can help, yes, but it's also going to hurt people's livelihood. Mine today, yours tomorrow.\n***\n\n\nI'm a working author and hence automatically a party to that class action lawsuit, because the books I've written have been used without permission to train AIs.\n\nI did nothing to make myself a party, so don't downvote me, kthx. I'm a party because like nearly every working author in the U.S. my books were used without permission.\n\nHere's the deal.\n\nFrom time to time folks in internetland forget that books are actually the intellectual property of the person who wrote them. So the books get used in some way without permission or compensation. (Almost any time you see a book by a living author online \"for free\", for example.) Google Books was an example of that, back in the oughts. In the end Google was ordered to pay us all $40 per title for stealing our work, though I personally have yet to see that money.\n\nIn the case of the AI training-- and there are several companies involved, and several cases, of which the Nvidia one is just the latest-- the number of authors involved is huge. Most of the authors I know had their work used.\n\nI could argue about why this was wrong, but let's take it as read that that nobody cares. So what it means to you:\n\nAs someone else said, yes, my livelihood is a nothingburger. If Nvidia ends up being asked to pay us all $40 a book, that'll be $8 million total for all of us authors, and it won't be paid for years, if ever. It's less than some people here have made off their shares. It's barely a hair of Nvidia's hide.\n\nI personally am hoping it's more than $40 a book.", "score": 5, "replies": [{"body": "If it’s only 8M total they should 2x if not 10x it and give it to authors.", "score": 1, "replies": []}, {"body": "Depends on how the material/data was accessed and ingested. Those \"terms of use\" and fine print on Amazon, Google, etc. are constantly changing and you're often paying a price and agreeing to terms and conditions in return for your product being listed on the platform. It'll come down to a fair use interpretation.", "score": 1, "replies": []}]}, {"body": "Nope, they’re suing them for essentially using their book to read and gain knowledge.", "score": 2, "replies": []}, {"body": "It also looks like the market is not overly concerned about this issue. $NVDA +4.5% in the pre-market as of now, from $850 (after hours lows on Friday) to $890", "score": 2, "replies": []}, {"body": "If these lawsuits go anywhere , Microsoft, openai, Google would be the most affected...and they don't seem to be so far.", "score": 2, "replies": []}, {"body": "AI-ist is what it is! When a person reads a book, betters themselves from it, and uses their new knowledge for profit, nobody asks where they got it from, and it is all ok. But when AI does this, it suddenly is an issue 🙄  /s", "score": 2, "replies": []}, {"body": "I still don't understand how this is being handled so causally. These companies are engaged in massive ip theft to create software that then mimicks that ip.", "score": 1, "replies": []}, {"body": "Lawsuit filed from San Francisco that tells me all I need to know Thanks. \nBunch of slackers and past has been broke losers trying to get paid. F-that town it’s a cesspool of filth ask Nanci & Paul for a loan from there NVDA earnings losers", "score": 1, "replies": []}, {"body": "Everyone is cheering for AI and hoping it becomes the next big thing the way the internet changed the game for so many things:\nE commerce\nOn line banking and investing\nYouTube\nWe all do everything, every day using the internet \n\nAI is the greatest theft of human authored works ever! That’s what “generative AI / AI machine learning models” really are\n\nAnd yes they all will be sued relentlessly. Because all of these companies have been scraping all human authored works and ingesting them into their AI learning models without human author permission. \n\nWho is stealing everyone’s music(including my 1000 compositions and sound recordings) books, articles, legal opinions, photos, videos, graphics, medical writings, recipes, instructions, tutorials, history books, science books, fiction writings, etc. etc…..? \n\nNVDA, META, OPEN AI, GOOGLE, MSFT, ADBE, ….you get the idea. \n\nThese companies have been stealing all intellectual property in the world and ingesting everything they can into their “AI learning models” and they have been doing it without direct permission from the original creators and owners of the intellectual property. \n\nSo yes….law suits will be endless and relentless and it will be a concern for all of these companies listed above.", "score": 0, "replies": []}, {"body": "I smell, “What is ‘fair use’ of copyrighted works in relation to machine learning.”", "score": 0, "replies": []}]}
{"title": "Someone bought $780 MILLION worth of NVDA call options on Friday", "selftext": "", "id": "1bcbw8h", "created_utc": 1710185427.0, "score": 24, "upvote_ratio": 0.96, "num_comments": 28, "comments": [{"body": "lol yeah if you’re long on Nvdia you should feel pretty safe. Just like someone pointed out in those comments though, if you’re doing weeklies you better get in and out quickly while you’re up", "score": 18, "replies": []}, {"body": "Don’t know anything about options. What does this mean for NVDA?", "score": 9, "replies": [{"body": "Not a lot really, except someone feels pretty confident that the stock will rise. An option is sort of like a coupon for a stock, it let's you buy it for a specific price and for a certain amount of time. \n\nIf you had a coupon that let you buy a $1m house for 600k it would be worth a lot, perhaps up to 400k. If it was good for 10 years and house prices were rising you might pay a bit more than face value even. That's what a call option is. You can buy the right to buy or sell the stock at some price later, for a fraction of the price of the stock. They can make people lots of money or expire worthless", "score": 40, "replies": [{"body": "This is very helpful!", "score": 5, "replies": [{"body": "The caveat is that if house price goes down. You can also lose a lot of money.", "score": 1, "replies": []}]}, {"body": "Also not very knowledgeable about options. But arent they essentially betting? I.e. you buy a call option for NVDA at 1,200 for July. So this means that if the stock price is 1,200 or higher in July, you wim the call option and get money, like lets say 5-7x your investment. No?", "score": 1, "replies": [{"body": "Technically betting is when you know the house wins in the long run, this is speculating:)\n\nYeah that's basically it. You can also buy safer variations of the same thing. A $400 July call would be worth about $400 today, and if it the stock went to $1200 it might be worth double that, but if the stock fell it would hold more of its value. \n\nThey're very powerful and risky, but if the trade goes the way you think you can do very well.", "score": 1, "replies": []}]}]}, {"body": "Someone with a lot of money is betting that the share price will go up this year", "score": 6, "replies": [{"body": "For every buyer there is a seller. So there’s also one or more sellers that thought selling those calls would be profitable - so knowing the strike price and expiration would be helpful here.", "score": 7, "replies": []}, {"body": "Elon Musk", "score": 0, "replies": [{"body": "Nancy pelosi", "score": 3, "replies": []}]}]}]}, {"body": "Jiminy Christmas!!", "score": 5, "replies": [{"body": "Jimothy", "score": 1, "replies": []}]}, {"body": "ooof and its down over 35%", "score": 4, "replies": []}, {"body": "Yowza", "score": 2, "replies": []}, {"body": "Nancy, is that you?", "score": 2, "replies": []}, {"body": "Waited for a big dip, smart person.  I sure hope he's right!", "score": 1, "replies": []}, {"body": "Big trades are going on all day.\n\n[just a short time frame at the end of the day](https://ibb.co/gv6PVTz)", "score": 1, "replies": []}, {"body": "💎🙌those who support the cause of A.I will be forever grateful imo 🥳", "score": 1, "replies": []}]}
{"title": "Nvidia is sued by authors over AI use of copyrighted works", "selftext": "", "id": "1bbqvgf", "created_utc": 1710119837.0, "score": 206, "upvote_ratio": 0.9, "num_comments": 26, "comments": [{"body": "bullish", "score": 42, "replies": [{"body": "We know you’re shorting it", "score": 11, "replies": []}]}, {"body": "I feel like this is gonna make it hit an all-time high", "score": 13, "replies": []}, {"body": "**EDIT** My bad. Jumped the gun and got the article wrong. Thanks u/Expensive-Meeting658 for point it out.\n\n# After reading the article, it got me thinking. Would this be like companies trying to sue google for linking to and showing previews of their websites in google's search results?\n\n  \n----------------------------------------\n\nWait, shouldn't the users of said AI be the one being sued? We are suing hardware makers of platforms for the actions of users now?\n\nSo should Intel and AMD, or cisco and Microsoft be sued by the IPR center and IRAA for users who use PC for sharing pirated content?", "score": 55, "replies": [{"body": "Read the article first. Not only the title. It say that Nvidia used someone's books to train its NeMo AI.", "score": 28, "replies": [{"body": "My bad. Thanks for pointing this out.", "score": 2, "replies": []}]}, {"body": "Nice conclusion... Next time I get one of those red letters through the mail for downloading, I'll reply, referring them to Intel, ASSrock (good luck getting a helpful response from them too 😅, I certainly didn't), Samsung (for providing the storage media), and my ISP.", "score": 14, "replies": []}, {"body": "If Google would show the entire content of your website,on their platform, you would get exactly 0 visits. That would mean Google steals your content and use it to their benefit, with you making $0 from your work. Yes, everybody would sue Google.", "score": 3, "replies": []}]}, {"body": "Not a big deal.", "score": 12, "replies": []}, {"body": "Sue the government for paving roads that allow car accidents", "score": 12, "replies": [{"body": "I'm going to sue the first fish to walk on land everything afterwards is all downhill smh", "score": 2, "replies": []}]}, {"body": "free publicity for Nvidia", "score": 8, "replies": []}, {"body": "[removed]", "score": 7, "replies": [{"body": "Yeah, maybe this will finally get them the exposure they need to finally get noticed by the broader market.", "score": 5, "replies": [{"body": "Lol Nvidia is one of the most talked about stocks I see in articles. Even outside of reddit", "score": 3, "replies": [{"body": "Yep", "score": 1, "replies": []}]}]}]}, {"body": "Red tomorrow", "score": 2, "replies": [{"body": "!remindme 1 day", "score": 2, "replies": [{"body": "I will be messaging you in 1 day on [**2024-03-12 21:53:33 UTC**](http://www.wolframalpha.com/input/?i=2024-03-12%2021:53:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/1bbqvgf/nvidia_is_sued_by_authors_over_ai_use_of/kufjwj2/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2F1bbqvgf%2Fnvidia_is_sued_by_authors_over_ai_use_of%2Fkufjwj2%2F%5D%0A%0ARemindMe%21%202024-03-12%2021%3A53%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201bbqvgf)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "this aged well LMAO. 7% gain on the day", "score": 1, "replies": []}]}]}, {"body": "Time to short this and give the bubble riders a ride for their money :D", "score": 1, "replies": []}, {"body": "I think some people knew a day before and that explains the selloff on friday", "score": 1, "replies": []}]}
{"title": "Tesla: The Disappointment Continues (NASDAQ:TSLA)", "selftext": "", "id": "1bcfu7l", "created_utc": 1710194568.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 24, "comments": [{"body": "Everyone is scared. Time to buy", "score": 14, "replies": [{"body": "Reddit is a circlejerk of anti-Elonism and isn't indicative of the adult world's views of the company. Warren Buffet would agree with your sentiment about getting greedy when everyone is scared.", "score": -2, "replies": []}]}, {"body": "Super undervalued, even Morgan Stanley says so. They are the only company with massive AI actually out on the streets. 400,000 real world AI computers and climbing. They aren’t even being valued correctly for the 2 million cars they sold last year. ‘Competition’ all but failed, unless you want a Chinese Bonk wagon, LOL. I’d say correct fair price is 500-600 a share before 2027. Long time horizon. No one knows where the market goes in its entirety until then. For perspective Meta, Netflix even NVIDIA, got cut down 50-90 percent of their value less than a year ago. And look where they are today! Super bullish! This article is fake fud.", "score": 14, "replies": [{"body": "Lmao. The fact Morgan Stanley is openly trying to pump it means they are worried about their bags. What these money managers and institutions put out in public means nothing. They are known manipulators. They aren’t honest. What they believe in privately can be vastly different than what they put out openly for the public for free. \n\nand please. They can’t even get fucking wipers to work correctly. There’s no chance in hell this company gets FSD to work. Not until they finally add sensors back.\n\nVision only will never work, they literally can’t see jackshit at all if it’s raining hard. If it’s snowing, if it’s too foggy, etc etc. \n\nNo one is paying an extra 12k for this bullshit lol. FSD subscription growth is basically nonexistent.", "score": 4, "replies": [{"body": "It’s not a pump, it’s a valid analysis. Tesla has a 10 year lead on every western EV company. They wrote the book. It’s the end of ICE vehicles in real time. EV’s have only begun taking over. Tesla doesn’t need to advertise, and model y is the most sold car the last calendar year. Now they have a headstart in AI and robotics. They will forever be ahead of everyone. You are just talking out your butt, like doodoo after doodoo words LOL", "score": 5, "replies": []}, {"body": "You make some valid points but your anger ruins your argument.", "score": 0, "replies": []}]}, {"body": "The “chinese bonk wagon lol” who are you Elon from ten years ago? He’s shitting his pants over that legitimate competition right now.", "score": 2, "replies": [{"body": "The ‘competition’ who? LOL Rivian and Lucid and Fiskar all zombie mode now. BYD say no no America, lemme guess NIO bhahahhaha BONK BONK!", "score": -2, "replies": []}]}, {"body": "FSD with cameras only is never going to work. It’s easily confused by sun low in the sky, shadows etc. Too many failed projects like the Semi, bot and CT. Early adopter wave of EV buying is coming to an end. Q1 is going to be abysmal.", "score": 2, "replies": [{"body": "The only thing you even remotely argue that was a fail is the semi. It met its objectives but isn’t doing any volume. It was never going to be a revenue driver , it was always more about removing ICE trucks as much as possible as is their mission. I think this is why it’s on a slow track - it’s simply not important to shareholders as it’s never going to be a revenue driver.\n\nThe bot was never going to be ready by now. To say it’s failed is a very strange claim for something so far premarket. However the bot depends on FSD. If FSD architecture functions, than bot will use the same NN architecture.\n\nThe cybertruck has great reviews. Range was a disappointment from reveal on the high end. But better at the mid range than the reveal. Price is far more, but is competitive. And charging speed is poor, but we will see how it does with v4. Otherwise people love it . It’s selling very well, resale prices are double retail. Again, too early to say it’s a fail. Time will tell how it does and how manufacturing costs change.\n\nBack to FSD. Elon claimed their limiting factor is compute. Who knows if this is true. If it is, they are scaling 5x in compute power this year, plus they scaled 5x last year and havnt been using that compute for long. So if FSD12 was trained in a few months, than tripling the time and 10x the compute we should see large improvements. \n\nThat being said, I’m skeptical it’s the limiting factor. FSD12 is far more capable; but it’s unclear if it’s safer, if you know what I mean", "score": 1, "replies": []}, {"body": "False. All of what you said is wrong. “The internet will never replace anything” energy here.", "score": -1, "replies": []}, {"body": "I would have said camera only FSD would never work only a couple of years ago, but with modern multimodal networks I think we will eat those words.", "score": -1, "replies": []}, {"body": "It’s weird that none of the three “failed projects” you mention are actual failures. They’re all in their nascent form…but that isn’t failure.", "score": -1, "replies": []}]}]}, {"body": "Teslas meteoric rise was fueled by left wing climate warriors and Wall Street opportunists.  Now the left wing hates Elon and the Wall Street has moved their money into ai.    The days of insane Tsla valuations are over.", "score": 6, "replies": [{"body": "Yes.  And Elon shit posting does not make all that left wing money come back to Tesla that’s for sure.  Time for Elon to find a new home.  Rekindle the romance with the center left and relight this rocket", "score": 6, "replies": []}]}, {"body": "I think that Tesla is a pretty good company, but it continues to trade at a stretched valuation even under pretty aggressive bull case growth assumptions. And while that valuation was somewhat justified in the past, recent slowdown in growth and declining margins simply make the stock look expensive. I might be a buyer if the stock ever dips below $100 per share, but at the current price I rate Tesla stock a STRONG SELL.", "score": 4, "replies": [{"body": "They are great company but their shares should be around $20 or less. The king is naked.", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "Elon is on drugs and it has messed up his mind. He is also addicted to Twitter, spending most of his time on it. Now that he owns it, he is justifying the time he spent on it by considering it as part of his \"80 hour work week\".\n\nBasically no one is running the company it's on autopilot. He butts in when convenient .That's the reason for all the product missteps and massive delays.", "score": 1, "replies": []}, {"body": "lets talk about some facts , tesla is selling more cars, and FSD V12 is getting way better than any version before, Optimus is getting better. but ppl just ignore this things , and focus on the stock price, and say tesla is disappointing ..... maybe just ppl with high hope????\n\ni mean i buy 1000$ tsla per month , since 2021, yes i bought tsla at 1200$ lol!!!  i'll hold it till 2030 or elon no longer be the ceo of tesla", "score": 1, "replies": []}, {"body": "The amount of negative articles on TSLA lately, seems like a hit job. Most of them are old news, or something that is not a big deal. What happened to the save the planet and stop the global warming crowd. Instead they tried to burn the Tesla factory.", "score": 0, "replies": [{"body": "Obviously this is the capitalists abandoning TSLA, now that the market has got hot money flowing into the AI channel, the capitalists have been on a harvesting spree", "score": 1, "replies": []}]}, {"body": "nobody cares.  repeat of before.  stock will fly again, all you broke as short term emotional twats will miss it.  as always.  its why you just are angry at everyone else", "score": 0, "replies": []}]}
