{"title": "Overview of S&P 500 corrections since year 2009", "selftext": "Graph of this issue:\nhttp://pbs.twimg.com/media/DZsKrS8XcAAKdxp.jpg\n\nRemember the last time stocks fell so hard? You probably don’t, and that’s making today’s market seem harsher than it is.\n\nIt’s a fact of the life of the mind -- things always seem worse in the present. In reality, they’re not. In this bull market alone there’s been five other corrections like this one, and it’s taken around seven months on average for equities to climb out of their hole. Based on that path, the current jitters won’t be fully eradicated until August.\n\nJust because bouts of losses are normal doesn’t mean they’re painless, especially when momentum stocks are leading the way lower. But the statistic is a reminder that it’s unrealistic to expect a market recovery to involve a straight line back up.\n\n“This is very stressful stuff,” said Michael Purves, Weeden & Co.’s chief global strategist. “It’s like going to the gym and lifting weights after you haven’t been to the gym for two years. Part of it is just a very normal psychological, emotional reaction.”\n\nSince 2009, the average correction in U.S. stocks has lasted 200 days and lopped 14 percent from the S&P 500. That means if this one ended this week -- an unlikely prospect, given the index just posted its fourth consecutive move of greater than 1.5 percent -- it would be the second shortest and second shallowest of them all.\n\nIt seems even worse because of how placid markets have been since the last disruption. While individual stocks are regularly rising and falling 5 percent nowadays, consider that in 2016 and 2017 the S&P 500 went through several multi-month stretches without posting a single up or down day of more than 1 percent.\n\nThat hasn’t been the case lately. The S&P 500 dropped 1.7 percent on Tuesday, erasing more than half of the previous day’s 2.7 percent rally. Futures on the gauge rose 0.3 percent at 8:05 a.m. in New York.\n\nStock turbulence as measured by the benchmark anxiety gauge, the Cboe Volatility Index, is much higher. At 22.5 now after rising for the third time in four days, the measure is nearly twice its level for the previous two years. There have already been 22 days in which the S&P 500 moved more than 1 percent in the first three months of the year, triple the total for all of 2017.\n\n“You had this incredible low-volatility environment, but markets are supposed to go up and down,” Michael O’Rourke, JonesTrading’s chief market strategist, said by phone. “Relative to how markets should be and how they behaved most of my career, thus far this selloff is not a major event. At this point the selloff relative to history is just a blip.”\n\nSo the rupture is back-to-normal, and normal is usually hard. Take the action in tech mega-caps, a group that lured investors with gains more than triple the market since 2016. They’ve been cited by money managers as the most crowded trade in Bank of America’s March survey for a second month.", "id": "88zejp", "created_utc": 1522676753.0, "score": 170, "upvote_ratio": 0.92, "num_comments": 86, "comments": [{"body": "“The Stock Market is designed to transfer money from the Active to the Patient.”\n— Warren Buffett", "score": 90, "replies": [{"body": "Your portfolio is a bar of soap. The more you handle it, the smaller it gets. \n                                    - somebody", "score": 45, "replies": [{"body": "But it never gets bigger :(", "score": 13, "replies": [{"body": "Just like my penis", "score": 1, "replies": []}]}, {"body": "Nice. ", "score": 2, "replies": [{"body": "-Michael Scott ", "score": 4, "replies": []}]}, {"body": "But if you just leave it there it's get's mushy and dissolves ", "score": 1, "replies": [{"body": "True, true. I have made as made smart moves as dumb \"should have done this or that\" moves.", "score": 1, "replies": []}]}]}, {"body": "\"The stock market is a place for a few people to take money from a lot of people\".    -  \nRay Dalio ", "score": 13, "replies": [{"body": "Stocks socks and rocks ", "score": 1, "replies": []}]}, {"body": "From the impatient to the patient.", "score": 3, "replies": []}, {"body": "And the patient people pulled back waiting for real buying opportunities. How many billions in cash is Buffet sitting on? ", "score": 1, "replies": []}, {"body": "Warren Buffetts first investment was right after the crash 1929, of fucking course just hodling would pay off more than ever.", "score": -6, "replies": [{"body": "Lol what. Buffet wasn’t investing back then buddy..he’s only 83-85 IIRC", "score": 8, "replies": [{"body": "The recovery after 29’ didnt happen over a day.............. see the growth in his early days. ", "score": 1, "replies": []}, {"body": "Warren is like 109 bro.", "score": 0, "replies": []}]}]}]}, {"body": "I'm still confused \n -me", "score": 26, "replies": [{"body": "-all of us", "score": 5, "replies": [{"body": "-Michael Scott", "score": 3, "replies": [{"body": "-Wayne Gretzky", "score": 3, "replies": []}]}]}]}, {"body": "Just keep buying and holding. I'm down almost 7.5% since the bloodshed started, but am still investing and holding like normal. We be ight. ", "score": 25, "replies": [{"body": "When did you start? I got serious about investing around 2009 so I'm doing okay. Though a shitty number of my positions went into the red, WTF is up with that? ", "score": 3, "replies": [{"body": "Been in about a year, pretty new relatively. I'm no expert, but did probably a full year of research before getting in, and came in realizing that the run-up I got in at was going to come to an end. Just unclear when of course. ", "score": 2, "replies": [{"body": "Well, don't sweat it. Do what I do, when things are bad, head over to /r/stockbets and look at the funny memes. When shit goes down, I a) do something beneficial to my company, which benefits me overall, and b) try to buy something in reasonable increments, though \"nibble not bite\" and \"wait for a floor to be established\" are what I learned from my former stockbroker.\n\n(He's my *former* stockbroker because he talked me out of AMZN at $399 a share,)\n\n", "score": 5, "replies": [{"body": "The subreddit you are looking for does not seem to exist. Someone has deleted it from the Jedi archives.", "score": 3, "replies": [{"body": "They go away from time to time, then come back", "score": 1, "replies": []}, {"body": "/r/wallstreetbets", "score": 1, "replies": [{"body": "Do you think that's what he meant to type?", "score": 1, "replies": []}]}]}, {"body": "Yeah it's no fun to see so much red, but economic fundamentals are still good. Just a big, strong bull finally succumbing to it's fate. \n\nAlso, ouch. That one probably stings a bit. ", "score": 2, "replies": [{"body": "Happily I live in Japan. Right now it’s 3 AM, so it’s very reasonable to get drunk at this time of evening. （＾Ｏ＾）", "score": 2, "replies": []}]}]}]}]}, {"body": "idk about buying right now dude, at least wait for the volatility to simmer down. you're just catching a free falling knife right now if you buy", "score": 6, "replies": [{"body": "Sorry should've clarified. I didn't mean buy right this second but rather just keep thinking business as usual, because over long term periods, corrections become less significant. ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Are you paying attention?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ah ok. When I first read your comment I thought you were implying a dip that already happened (i.e. Feb). ", "score": 1, "replies": []}]}]}, {"body": "You can wait forever to buy \"the dip\", but over the long haul you'll be hard pressed to find whatever it is that we're currently in on a chart.", "score": 1, "replies": []}]}, {"body": "ROFL.   ", "score": -2, "replies": [{"body": "You sold I take it? ", "score": 4, "replies": [{"body": "Not completely out. 70% credit notes, 30% stocks. \n\nCut way back starting on Jan 22. Raymond Jame's said their model pointed to a pullback and having been in RE I've seen markets go crazy up before. When the increase is crazy a crash is going to happen. Can't say exactly when but it'll drop low, low, low. ", "score": 1, "replies": [{"body": "Yeah this was bound to happen at some point. But with a timeline of 30+ years (I'm 27), I'm sure this won't be the worst I'll see.\n\nAlso, I'm down less than the S&P is in that time so I've gotta be doing something right. This too shall pass. ", "score": 3, "replies": [{"body": "I'll go back in later. When it's down 20% plus", "score": 1, "replies": [{"body": "do you mean -20% from now on?\n\nI can see DJI going down to 16-17k and still be bullish on a weekly chart.", "score": 1, "replies": [{"body": "20% from the top on 1/26", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I think this is apples to oranges. The corrections in the graph occurred during falling interest rates and between consecutive QEs, we're now in a rising rates and QT environment.", "score": 15, "replies": [{"body": "Agreed. This was my suspicion since Feb, which is why I didn't buy any of the dips. Thankfully I'm hedged and in the green for now", "score": 3, "replies": []}, {"body": "Could someone please explain what this means layman's terms?", "score": 1, "replies": [{"body": "The fed controls short-term interest rates as a way to keep inflation in check, so when inflation looks like it's getting higher than where they want it (typically 2%), they start raising interest rates. QE is quantitative easing, which was a set of programs set into motion after the last recession. The goal was to save the financial market and the method was to buy up government bonds and mortgage-backed securities from institutions that couldn't sell them on the open market without taking a major loss. That way, banks that held these bad assets could get them off their books and be infused with cash, possibly preventing a run on the banking system.\n\nAfter QE1 and QE2, the Fed implemented Operation Twist where they basically swapped out a bunch of the short-term debt they had bought during QE1/2 for longer-term debt. This meant that the Fed was not only controlling the short-term interest rate as it normally does, but now it was heavily influencing long term interest rates because their buying made long term yields drop.\n\nAnyway, with yields dropping for all maturities, institutions that heavily invest in bonds as a safe way to generate a return stream (like pension funds) couldn't meet their expected returns. They had banked on making 6-8% but bonds were yielding less than half of that, so to meet expectations, they were forced further into the equity markets, thereby pushing up the stock market with in influx of capital that would normally reserved for safer assets. \n\nEarly last year, the Fed finally started to hike up short-term interest rates and later in the year, they started unloading their balance sheet by selling back some of those bonds that they were holding on the open market. Their tentative plan is to increase the rate at which they unload these bonds every three months (I think, fact check that). So now you basically have the opposite effect: their selling pressure pushes yields up and all those institutions can start moving back to the bond market. That naturally means they have to lighten up on the equity side, so you have a situation where liquidity in equities is being drained out slowly. \n\nThere's some things I left out and definitely some nuances I will have missed, but that's a pretty basic picture of what's going on as I understand it.", "score": 16, "replies": [{"body": "Thank you", "score": 2, "replies": []}, {"body": "> the Fed implemented Operation Twist \n\nCongrats. So few of the \"investors\" here know what's happening", "score": 0, "replies": []}]}]}, {"body": "Simple rule. Rates go up P/Es must go down.", "score": 0, "replies": []}]}, {"body": "Don't forget the 7 years it took back from 2000.  Besides US debt, there is nothing wrong with this economy.  Still have 10% cash if things get actually bad", "score": 10, "replies": [{"body": "That's debatable. The debt is bad, but the structrual redistribution of wealth from bottom to the top (which is also debt financed) is going to make it rough to be in domestic consumer cyclicals. \n\nThe leadership of the country is not particularly stable (and markets love stability). ", "score": 10, "replies": []}]}, {"body": "Quick tip: learn to take neutral and short positions in times like these \n\n", "score": 2, "replies": [{"body": "Quick tip: short positions can lead to even greater panic.\n\nPlan accordingly.", "score": 2, "replies": [{"body": "there are ways to have a short position other than strictly short selling", "score": 1, "replies": [{"body": "Certainly true - but all lead to shorting a market that trends upwards in the long term, and therefore one should plan, rather than  panic, when the trend returns unexpectedly to the mean.", "score": 1, "replies": [{"body": "Well yeah long term, but I’m talking about short term. And there’s been 8 year stretches where the S&p has remained flat (net) so definitely short opportunities there ", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m not so convinced we’re not about to hit a serious wall. Frankly the amplitude of the volatility has been fairly big considering the relatively small triggers behind it. This had been a very bullish market, so I’m mot surprised that corrections are happening on mild news. But we have 3 more years of Trump making grand statements at least, increasing global tensions with Russia, a tariff war that might just be starting, Brexit not even happened yet and still a large unknown...\n\nI’m holding firm, but I’m not buying the dip - not convinced we’re close to it yet.", "score": 3, "replies": []}, {"body": "Not a correction. The market is crashing because of the impending trade war with China.", "score": 2, "replies": [{"body": "Yea, that was my exact thought. ", "score": 0, "replies": []}]}, {"body": "This is soooo HEALTHY!!! ", "score": 2, "replies": []}, {"body": "Thanks for this post and the effort you put in. Makes me feel better and shitty days like this :)", "score": 1, "replies": []}, {"body": "OOPS. I missed this\n\n\n\nEnded 3 hours ago\n\n\nStock market is getting destroyed. Here’s why you should be worried", "score": 1, "replies": []}, {"body": "It's happening!!!", "score": 1, "replies": []}, {"body": "Please do not forget. This is only one of many charts we have to look at. We also have to consider the debt levels, bond interest rates and the government's international relations. Without we're sorely missing out on information.", "score": 1, "replies": []}, {"body": "Damn, I had left in a low ball offer for MSFT and it triggered.\n\nShould have offered less", "score": 1, "replies": []}, {"body": "S&P 500 broke the 200MA .. this isn't good.", "score": 1, "replies": [{"body": "Just \"Dollar Average\" and don't \"realize your losses\"  \nDenial is critical in defeating cognitive dissonance ", "score": 3, "replies": []}]}, {"body": "For the love of God, people need to make graphs that starts at zero. These always make them look even more skewed.", "score": 1, "replies": [{"body": "A long time ago I got a similar reply when I posted a chart of a stock. I wrote the guy off as an idiot because stock charts don't start off at 0. Starting off at 0 is either the beginning of the stock market in 1920, or beginning of the stock when it IPO'd(which is never 0).\n\nAnyways I'm not calling you and the 4 people who up voted you an idiot. I'm questioning on why are you saying \"start these graphs at 0\" which is impossible since the Vertical axis is in dollars, and the Horizontal axis is in years. Neither of which ever started at 0.\n\nSo why are you saying this?", "score": 8, "replies": [{"body": "I should have specified and said the vertical chart. Here is why:\n\nhttp://www.dummies.com/software/microsoft-office/excel/start-the-vertical-scale-at-zero-on-trending-charts-for-excel-reports/\n\n\"...the vertical scale of a chart can have a significant impact on the representation of a trend.\"", "score": 0, "replies": [{"body": "I'm not trying to sound patronizing.. But have you ever seen a stock chart before? Do you understand what OP's chart is supposed to represent? The purpose OP has in showing the chart?\n\nThis website explains it better than me: https://qz.com/418083/its-ok-not-to-start-your-y-axis-at-zero/\n\nI'd really like to know what goes on inside of the head of people who think like you. I am assuming that either such people don't invest and hardly ever look at stock charts. Or they were forced to learn something misleading by a disgruntled math teacher as a child. Kinda like when Religious people taught people sex and masturbation was evil.", "score": 1, "replies": []}]}]}]}, {"body": "Take out a loan and buy tesla- me", "score": 0, "replies": [{"body": "Ya, that's how most people buy cars", "score": 3, "replies": []}, {"body": "You could potentially cash Big!!!!!!!! ", "score": 2, "replies": []}]}, {"body": "Next correction, next recession will not be the same!", "score": 0, "replies": []}, {"body": "BUY ON MARGIN!!!\n\nThe market only goes up\n\n~~Throw good money after bad~~         Dollar Average!!", "score": -3, "replies": [{"body": "Hold your USD they'll be worth much more when the market crashes.", "score": 2, "replies": []}]}, {"body": "So sell and wait for July? ", "score": 0, "replies": [{"body": "No you don't want to be in around the mid term elections \n\nJust sell ", "score": -4, "replies": [{"body": "Should I wait for the next uptick?  ", "score": 1, "replies": [{"body": "Don't try and time the market. You won't win. If you keep putting money in you will reap the benefits of more upside when it turns around", "score": 2, "replies": [{"body": "I do need to liquidate some for a property buy in the next couple of weeks.  That was going to be easier to do before these recent hits.  ", "score": 1, "replies": []}, {"body": "In 10 years", "score": 1, "replies": []}]}, {"body": "Eeeeeh. How high is that uptick going to be? \n\nProbably better than today but by how much\n\nI left starting in Jan and have kept reducing since then. The only things left for me to pull out of are mutual funds and they take a while to sell so I had to just hit the button today and hope we're up a tad tomorrow and Weds. But overall. Get out", "score": -2, "replies": []}]}]}]}]}
{"title": "Best TSLA Trade to make: Bearish Debit Spread. No IV, No Theta", "selftext": "", "id": "88zdfj", "created_utc": 1522676517.0, "score": 128, "upvote_ratio": 0.93, "num_comments": 81, "comments": [{"body": "[deleted]", "score": 66, "replies": [{"body": "I hope he wears protection.", "score": 1, "replies": []}]}, {"body": "To do this in RH are you covering with cash/shares on spreass? I want to open a spread but RH doesn't  account for the max loss as required acct value, for me it says I have to have cash or shares to cover any option I sell, regardless of other legs", "score": 10, "replies": [{"body": "You have to buy the option first, then it says you'll have enough shares to cover for a sell. So like in my spread for example, I had to buy the $250 first before selling the $245 which is really annoying for people with low account values.", "score": 5, "replies": [{"body": "Ah ok, glad to know it can at least be done. I doubt many RH users like myself are willing to put up 25k on a single trade haha. Thanks for the help!", "score": 2, "replies": [{"body": "Well you actually only need $2000 or less for this trade, you just need to buy the call for $20 (or so) a share and then sell the other one for $18 (or so a share), so you get all your money right back, just need to the Initial capital (usually even more expensive contracts trade for around $4000 total), so once you get past that, it's spread city in this bitch.", "score": 2, "replies": [{"body": "Ah gotcha. My worry was that you needed not only the capital to buy the contract but the capital to cover assignment on the sold option, regardless of overall position", "score": 1, "replies": []}, {"body": "Yeah, but you can't do this with just the $2000 though even if you are covered like you are.", "score": 1, "replies": []}]}]}]}]}, {"body": ">No Theta\n\nOTM Debit spread.\n\nlol.", "score": 10, "replies": [{"body": "Considering I sold a put with almost equal theta, my theta equivalent is ~0, so yes, very limited to no theta", "score": -1, "replies": [{"body": "That's a synthetic short with a covered put then, which is a bit different from the position you linked. ", "score": 3, "replies": [{"body": "Kid, I'm telling ya, I bought a put and sold a put with the same theta, therefore canceling out. That's not a synthetic short. That would be if I bought a put and sold a call, which I didn't", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Haha fair, that's true, but even then, theta isn't gonna comepletely eat my tendies, it'll be relatively miniscule.\n\nTo put it simply, relative to the $54 I'd lose everything day in theta, not including theta increasing as time goes on, I'm not stressing the couple of dollars I lose in theta from this deal", "score": 0, "replies": [{"body": "Hey guys can we use smaller words please thanks. ", "score": 6, "replies": [{"body": "Sure, https://www.twitter.com/realdonaldtrump", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "back to 254. RIP OP..", "score": 9, "replies": [{"body": "Not quite buddy, it's an April 20th experation, and the market is eating shit rn, to think it won't be below 245 by 4/20 is insane ", "score": 0, "replies": [{"body": "shouldve stick with weedstocks for 4/20. fits the theme better.", "score": 11, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "Someone's gonna be eating their words...and daddy Elon's cock", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That's why do this beautiful thing called a bullish debit spread.\n\nIf I'm right, I get paid $300.\nIf I'm wrong, I get paid $200.\n\nIt's easily a 50/50 bet, and maybe even more in favor of them missing due to the fact they're out of cash and the employees probably have shit morale from thinking they're about to be unemployed.\n\nThere was no reason to not take that bet, my risk reward ratio is quite favorable for a 50/50 bet", "score": 0, "replies": []}]}]}]}, {"body": "How are you not down on the put that you sold?", "score": 19, "replies": [{"body": "It's called a bearish debit spread, I am down on the put I sold, but the delta of that put is less than the one I bought. It's a fantastic trade because I risked $200 to make $300 if TSLA closes below 245 by 4/20, and I'm guaranteed profit when TSLA is below 248, which it obviously will be. It's a bet on direction rather than price, highly recommend looking it up.\n\nTendie machine on these high IV stocks", "score": 68, "replies": [{"body": "I threw on a skewed iron condor. Already had a long put spread at 300/305. Shit is indeed a tendy machine. I've been waiting for this for a long, long time.", "score": 14, "replies": [{"body": "TSLA is a shit company, anyone who didn't see this coming needed to get their head out of Elon's ass", "score": 23, "replies": [{"body": "I bought April 20 300 puts for $1.20 on Feb 26. Sold for $5. They are $53 now :(", "score": 20, "replies": [{"body": "my fucking god man the tendies", "score": 13, "replies": [{"body": "Yeah I had 100 :(", "score": 6, "replies": [{"body": "this is a lesson\n\ntake some profit and let some ride\n\n@ 5x you could have sold 20 and still be riding 80 to the moon", "score": 4, "replies": []}]}]}, {"body": "Feel bad for you son.", "score": 1, "replies": []}]}]}, {"body": "dude sell that shit now", "score": 3, "replies": [{"body": "Why??\n\nEDIT, 9:30 AM: This is fine.", "score": 3, "replies": []}]}]}, {"body": "> which it obviously will be.\n\nI will take that bet.", "score": 3, "replies": [{"body": "Oh yeah, I'd take that bet every day of the week, TSLA is $246.02 at the time of writing this, so it's relatively safe", "score": 1, "replies": [{"body": "Still feeling relatively safe?", "score": 8, "replies": [{"body": "Rekt ", "score": 3, "replies": []}, {"body": "You're kidding, right? I'm absolutely feeling relatively safe.\n\nYou would be the dumbass that tries to claim I'm wrong after only an hour of it going back up.\n\nIt's back at 252, the option is for fucking APRIL 20TH.\n\nI have 3 weeks, calm your sensitive titties \n\n", "score": 4, "replies": [{"body": "No U", "score": 3, "replies": []}, {"body": "> I have 3 weeks,\n\nRemindMe! in 3 weeks", "score": 1, "replies": []}, {"body": "Where’s your god now?", "score": 1, "replies": []}, {"body": ">  I'm absolutely feeling relatively safe.\n\nHow about now? At 283???", "score": 1, "replies": []}]}]}, {"body": "How about now, Tesla at $280? Still feeling good?", "score": 1, "replies": []}]}]}, {"body": "\"Which it obviously will be\", I hope you get destroyed you faggot\n\nEdit: this faggot got raped", "score": 2, "replies": []}, {"body": "Really like this, can see it going below 200 this week", "score": 1, "replies": []}, {"body": "Geez I always got the impression that the plebs in here shun limited risk trades. Good to see you coming with the skill.  Big ups!", "score": 1, "replies": [{"body": "I know people usually do but the upside on this play is quite a bit higher than the downside, making this a pretty fantastic limited risk trade.", "score": 1, "replies": []}]}, {"body": "How do you handle when to sell the options when you spread like this? Once you are in the money early you can sell whenever. When you do a spread do you tried to hold closer to expiration or sell as soon as the stock splits the spread? ", "score": 1, "replies": [{"body": "If I'm relatively confident in the option ending profitable, I'll hold to experation to obtain max profit. Otherwise, I'll sell when it looks dim", "score": 1, "replies": []}, {"body": "Best strategy is 50% of max profit.  ( Is more common to hit 50% that waiting)\n\nSo he should sell or roll at 150. \n\nMax profit is at exp and both legs need to be deep in the money.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "well yes I didn't invent the strategy. \n\nwhats more likely? you hit 50% in 18d or Elon takes your tendis at exp with a twit?", "score": 0, "replies": []}]}]}]}, {"body": ">and I'm guaranteed profit when TSLA is below 248, which it obviously will be. \n\nSo here we are 3 weeks later and TSLA is at $283....", "score": 1, "replies": []}]}, {"body": "I'm pretty sure the option is up that percentage but he's down that much on it. ", "score": 2, "replies": [{"body": "robinhood displays options all fuck'd up. \n\nthis is how this strategy looks in TW https://imgur.com/a/Pv2ls \n \nup $81.5 in the short. \n\ndown $90 in the long. \n\nas SPY price goes down the long position will be up and the short will be down. \n\nwe reach a max profit of $200 at expiration when both legs are deep ITM. \n\n", "score": 1, "replies": [{"body": "That's what I said though. Robinhood displays what the option is up on the day as if you were long, even if you're short. ", "score": 2, "replies": [{"body": "Yes, I was adding to your point. \n\n\nAnd I'm sure this post got up voted because ppl think he is up in both legs. ", "score": 1, "replies": [{"body": "And the fact that he said 'no theta' when there is theta but just not as much. Also, he's probably down a lot right not. ", "score": 2, "replies": [{"body": "I think he is down ~~45~~ 57 . \n\nyou can buy/sell that position at ~~160~~ 143. he bought at 200. \n\nbut that's the advantage of the spread. max loss is 200. \n\nalso, in RH can you close the position in the same order? or leg by leg? ", "score": 1, "replies": [{"body": "You have to open and close leg by leg. It's the main reason I won't do spreads on RH. ", "score": 1, "replies": [{"body": "and that fucking UI. \n\nyou get what you pay for. \n\n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "RIP", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This is a company that burns insane amounts of money and doesn't have the cash to pay it back.\n\nTheir bonds are absolute shit.\n\nThe only way for them to make money is to issue stock, which we know once they do that, the gig is over.\n\nIf they get bought out, it'll be for the patents, and I guarantee every company lets them fall to 5 Billion Market Cap before they swoop in and purchase them. Trust me, I absolutely think the no company is gonna take that risk to save them when they can purchase them in a couple months for dirt cheap.", "score": 4, "replies": [{"body": "I’m sure developing electric vehicles and battery factories from scratch is expensive, another company might not want to invest as much has tesla has into this risky and expensive segment, giving tesla a competitive advantage. Model 3 review are absolutely glowing and tesla has a cult following. They will be the only company to offer an electric hyper car or a semi truck and are led by a charismatic young leader that founded the company. Most projections support their eventual return to profitability. Even if other automakers make electric vehicles no luxury shopper is ever going to aspire to own anything out of the ford or gm parts bin.", "score": 4, "replies": [{"body": "If they ever start delivering cars the company will be worth 500 bill.", "score": 3, "replies": []}]}, {"body": "If I were in your position (or more one of the reasons why I am not in you position) is that they could at anytime also use their stock value to acquire a cash rich company.  SpaceX (no idea of cash flow) is talked about at times to be a possible one.  I suspect that may have been Musk's goal on the planned $2.6 billion compensation from Tesla. something like continuously dumping all of that into cash, then into SpaceX (along with other money) then merge the companies.  Would still dilute Tesla Stock holders, but (legal?) less shocking to stock holders, and Musk may not lose ownership share.", "score": 1, "replies": []}]}]}, {"body": "GL OP. I would have waited until the model 3 Q1 production numbers came out before making this play.  I went the other way and bought a $250 strike call and sold a $300 for next January.  Nothing can keep Elon down.", "score": 3, "replies": [{"body": "Thanks for the good luck wishes.\n\nWay I'm looking at it, 50/50 bet with a lot of media sources saying they're going to miss.\n\nPlus, $300 Upside for every $200 downside, seems like a relatively good risk-reward for a 50% bet, so I had to take it just for the sake of it being statistically favorable.", "score": 1, "replies": []}]}, {"body": "How is it working out for you today?  Oh yeah nm you said you have until 4/20.  (Although in all honesty I do like these for the fact you limit your losses)", "score": 3, "replies": [{"body": "Yeah updates please..", "score": 1, "replies": [{"body": "he is down $90  ", "score": 2, "replies": [{"body": "Yeah I guess thats not much. Good for him", "score": 1, "replies": [{"body": "that's the point of the spread. \n\nyou can only lose a max of 200 in this position. \n\n(the diff between the premium of the put we sold and what he pay for the put)\n", "score": 2, "replies": []}, {"body": "now if he can recoup more than 20 he is lucky. \n\nhe'll ride the vertical till expiration in hopes of a down turn. ", "score": 1, "replies": []}]}]}]}]}, {"body": "all you are doing is make your long put position cheaper by capping your upside. low risk low return\n\nand you do have IV and theta, just not on day one. you will get cross gamma'd into them.", "score": 2, "replies": [{"body": "Yea but it'll be highly insignificant. And yes, I'm capping my upside, but at a much higher percentage relative to my risk", "score": 1, "replies": []}]}, {"body": "My man", "score": 2, "replies": []}, {"body": "Daddy Elon just called. He wants his shares back.", "score": 2, "replies": []}, {"body": "What is this black magic shit", "score": 1, "replies": []}, {"body": "I've got a long put butterfly on right now at 235/240/245 with 11DTE. looking good so far...", "score": 1, "replies": []}, {"body": "I'm sitting on 18JAN19 340 P.  They touched +116% today.  That dude talking about $1.20-->$53... That's nuts. I'd like to see the exact contract.", "score": 1, "replies": []}]}
