{"title": "Favorite 10 stocks", "selftext": "These were chosen out of a pretty much unfiltered list (all US stocks >100M market cap) one by one.\n\n# *Selection criteria:*\n\n\n\n1. The first rounds of filtering were based on the overall trend of revenue growth over 20, 10, & 5 years. All must be positive\n\n2. The second round is based on the actual current size of revenue & total equity growth. Generally it must be at least +30% rev & eq combined\n\n3. Third round, consistency. Any \"weird\" financials, inconsistencies are tossed\n\n4. Soft fourth for value, taking into account PEG and other price:financial metrics\n\n5. Fifth leaves us with around 50. Sorted by the criteria above, keep top 10.\n\n\n\n# *List*\n\n|Ticker|Name|Industry|Revenue Growth y/y%|Total Equity y/y %|\n|:-|:-|:-|:-|:-|\n|1. VITL|Vital Farms|Eggs|39%|35%|\n|2. TSM|Taiwan Semi|Semiconductor|33%|13%|\n|3. NVDA|Nvidia|Semiconductor|122%|111%|\n|4. IESC|IES|Industrial|32%|37%|\n|5. FIX|Comfort Systems|Industrial|40%|33%|\n|6. AMZN|Amazon|Consumer|10%|40%|\n|7. MELI|Mercado Libre|Consumer|42%|62%|\n|8. GOOGL|Google|IT|14%|13%|\n|9. MSFT|Microsoft|IT|15%|30%|\n|10. HEI|Heico|Industrial|37%|22%|\n\n", "id": "1gbl5kl", "created_utc": 1729827229.0, "score": 263, "upvote_ratio": 0.93, "num_comments": 84, "comments": [{"body": "Took a quick look at VITL. Those earnings reports are crazy. The one-year return is great. But the overall since inception, which I'm sure there's a reason, would make *me* cautious. Overall, it looks like they're doing all the right things at this point. Do you own it? I'm interested, and I never thought eggs would make it on my radar.", "score": 85, "replies": [{"body": "stock price? I think that's explained by it was originally issued at a much higher than fair price to maximize capital, lots of stocks especially small do it like that. \\*And\\* they also had shrinking income -> negative going into that stretch down you're talking about. My guess is they bought new farms -> higher expenses -> income goes down with stock price -> revenues finally catch up -> back to the upside.\n\nI both own the stock and buy the eggs they sell. That's what sealed the deal for me, I googled it and realized I buy these eggs half the time, my friend said the same thing", "score": 25, "replies": [{"body": "What's the appeal of VITAL from a qualitative perspective? I'm interested to understand what has been driving the financials, and whether those conditions will hold in the future.\n\nDo they have some long term competitive advantage (better quality eggs, low cost production, brand value, distribution channels)? Or have the past few years just been a windfall from abnormal market conditions?", "score": 6, "replies": [{"body": "They sell pasture raised eggs. So they legit can roam around outside. Much better than cage free. You see a nice color yolk when you crack then open. I think they have a really strong market share for people that care about that type of thing", "score": 10, "replies": []}]}, {"body": "I was asking more from an interest of making a trade, not to bash your research. Wasn't written to offend. I am genuinely interested in finding something in a new sector, and it's harder these days with the hype from sector rotations and AI hype. Definitely seems to have long-term strength.", "score": 3, "replies": [{"body": "I would do  a short term investment, i dont like leverage because you can get margin calls and potentially liquidated after a slight short move , as you can see what happened in Q2 it fell 13% after earnings even if it was positive but then it continued to grow, i think imma buy many shares at earnings and sell after a 20%-50% gain or even 100% based on how strong will  the earnings be (regardless of how long this will take)", "score": 1, "replies": []}, {"body": "Yea not too sure about short term trade potential, i guess it would be roughly the same as the returns of holding mid-long term (5Y+) split by how short term you go, with a little more volatility being added the shorter you make it. Definitely an oversimplification though\n\nThen again ive never been on the short term trade boat for very long, i can appreciate the tangibility in returns/growth of long term investments, it makes it harder for stock price to not appreciate with so much tangible $ behind it\n\n1 month revenue growth on the average of that list is +3%, price can go wherever it wants revenue has nothing to do with it. But 5 years? +300%. It’s too significant for price not to at least acknowledge it", "score": 0, "replies": []}]}]}, {"body": "Wonder how bird flu outbreaks affect VITL stock prices. If they're pasture raised and less susceptible, great, but can't imagine they are \"moated\" from the risk.", "score": 2, "replies": [{"body": "There will always be threats to any stock. MCD is the current example in the food industry.", "score": 5, "replies": []}]}]}, {"body": "Honestly those are good stocks, The egg company is a great discovery. I would like to see your opinion on ANET, It may be expensive, butcyou own Nvidia and TSM...", "score": 25, "replies": [{"body": "TSM is fairly priced at 35 PE, and NVDA at 65. 5 years down the line, both TSM and NVDA PE on cost will be around 10, lets say they'll stay above 20 PE, thats over 20% CAGR in stock price. I can wait 5 years for it to settle out.\n\n  \nANET is a nice one, that one flew under my radar, it is a tad more expensive per growth than TSM & NVDA though", "score": 3, "replies": []}, {"body": "Never heard of this egg company. Did some research. Financial statement looks good to me. Just bought me some egg company stocks, for a purpose of diversifying a bit as well", "score": 1, "replies": []}]}, {"body": "Thank you for posting, I appreciate both the effort and the sharing!  Good read, I enjoyed it.\n\nI hold 6 of the 10.  I like those Vital Farms eggs too, until I read your post, I never thought of investing in VITL.  I’m watching it now.", "score": 11, "replies": [{"body": "Thanks for such a wonderful reply! TheGratitudeBot has been reading millions of comments in the past few weeks, and you’ve just made the list of some of the most grateful redditors this week! Thanks for making Reddit a wonderful place to be :)", "score": -2, "replies": []}]}, {"body": "5 year est. PE on cost\n\nVITL 6.3\n\nTSM 8.4\n\nNVDA 8.5\n\nIESC 6.2\n\nFIX 5.9\n\n~~AMZN 17.9~~\n\n~~MELI 10.1~~\n\n~~GOOGL 11.4~~\n\n~~MSFT 14.5~~\n\n~~HEI 15.3~~\n\nCoincidentally works out that the top 5 in order are also the better value half. Eggs, 2 semiconductor, 2 industrial installation", "score": 19, "replies": [{"body": "What is eggs?", "score": 2, "replies": [{"body": "Something chicken lay and humans eat them. Very tasty.", "score": 11, "replies": []}]}, {"body": "Why not AMD? It fits the criteria.", "score": 1, "replies": [{"body": "Because nvda has a bigger growth potential against AMD", "score": 4, "replies": []}, {"body": "Not as much as TSM & NVDA.\n\nMy philosophy is if you want to invest in NVDA or AVGO or AMD, just get TSM, they make their chips and have the financials to back it up. \n\nLook up any of those 3 side by side to TSM. Sure NVDA & AVGO are higher but TSM is cheaper and more consistent", "score": 1, "replies": []}]}]}, {"body": "I'm very tempted to deploy heavily into TSM after the White House memo today on AI and the news that TSM's new US operations are going well.", "score": 13, "replies": [{"body": "I did so a year ago, wished I invested more though. They're well positioned for the next few years.", "score": 2, "replies": [{"body": "Yeah same here. I was afraid to buy more because of China / Taiwan tensions", "score": 1, "replies": [{"body": "if you held off because of china, best to wait until after the election. trump/elon are pro china", "score": -4, "replies": [{"body": "What? Pretty sure Trump is anti China and will stonewall chip tech even more than Biden is doing", "score": 5, "replies": []}, {"body": "I think I'll wait until after the election and the dust settles to make any moves. I'm not a trader, just an investor, so I don't have much use for the volatility. If we get a big correction, that will be when I start moving the rest out of money market and into equities.", "score": 1, "replies": []}, {"body": "There's no such thing as a pro china politician. He may be friends with dictators but remember who started the trade war and who jailed Meng Wanzhou WHILE he was dining with Xi Jinping? It was trump.", "score": 1, "replies": []}]}]}]}]}, {"body": "I didn't know \"eggs\" is a category for industry. Shouldn't it be something like farming or agricultural products?", "score": 10, "replies": [{"body": "Yes probably. I like “eggs” though", "score": 26, "replies": [{"body": "Well, me too. It's fairly descriptive :D \n\nI just thought that is it a common category elsewhere (I assume you are in the us?) Not a industry category in my home country at least", "score": 2, "replies": [{"body": "Yea im def wrong if we’re talking about using the absolute proper terms", "score": 2, "replies": []}]}]}]}, {"body": "TSM has such a large advantage that I'm surprised they're only a 1T company. Definitely feels weird saying \"only 1T\". Unless there's just a huge downturn in the the semi sector soon.", "score": 5, "replies": [{"body": "They just reported huge earnings and really didn't get as much of a bump as I expected afterwards (accounting for the entire time since earnings).\n\n\nAll the mega cap stocks will release earnings next week, so that'll tell us how much they're currently spending on AI.  Quite a bit of which funnels down to TSMC of course.  Then Nvidia on Nov 20th.  Smartphone chips and some other parts of the semiconductor industry are stagnant or in some decline currently, but not the bleeding edge stuff, for which demand greatly outstrips supply. ", "score": 1, "replies": []}, {"body": "I hold TSM. They will always be weighed down by China risk. Arizona expansion will help. Yield quality is good and a U.S. presence will help institutional investor confidence. However Trump will be awful for this stock because of trade war nonsense. He just said on Rogan yesterday they stole the U.S. fab industry and he will impose tariffs to get them to fabricate more in the U.S.", "score": 1, "replies": [{"body": "Trump isnt elected yet", "score": 0, "replies": []}]}]}, {"body": "FIX selling off today despite a solid earnings.", "score": 4, "replies": [{"body": "Yum", "score": 2, "replies": []}]}, {"body": "This list is in order btw", "score": 7, "replies": [{"body": "Top 3 \n\nVITL, TSM, IESC", "score": 4, "replies": []}]}, {"body": "some are rational, some are irrational. \n\nASTS RKLB LUNR AMZA ET BWLP MAIN RYCEY LYG ABR", "score": 5, "replies": [{"body": "> some are rational, some are irrational.\n> ASTS RKLB LUNR AMZA ET BWLP MAIN RYCEY LYG ABR\n\nthese are your faves?", "score": 1, "replies": []}]}, {"body": "I agree those metrics would be great for selecting GROWTH stocks but it could be biased toward high P/E stocks at bubbles...", "score": 5, "replies": [{"body": "For value I'd chop the list in half;\n\nVITL, IESC, FIX, AMZN, GOOGL.\n\nNVDA is tricky cause the growth is so extreme which also means predicting future growth is so much harder, which makes judging PE fairness very hard. Erring on the side of caution\n\n\\*\\*Side note that high enough growth can \"break through\" a high PE in a reasonable amount of time, ex. Take MELI for example, PE of 74.7 (Jeez!). Given another 5 years of its current revenue growth rate, your PE on cost would be 13.9, another 5 and its 2.6. I think that's what Buffet calls margin of safety. If the stock price doesn't move for 10 years you'd be able to buy the company outright, sell it for parts and make a profit", "score": 8, "replies": [{"body": "You should check out the “Joy of Compounding” by Gautam Baid, a Buffett disciple — he writes similarly about the growth in long-term compounders providing a margin of safety", "score": 1, "replies": []}, {"body": "I just don't believe myself that I could tank the bear market drop. I automatically skip stocks of average 7 year pe higher than 30.", "score": 0, "replies": [{"body": "That does not account for significant growth. PE (/under 30) only really matters with low growth. Which would you rather have, a stock with a PE of 50 with 50% growth or PE 20 with 20%. Within 5 years, which will have a higher IRR?", "score": 0, "replies": [{"body": "THERE IS NO BUSINESS DOING 50% ANNUAL GROWTH FOR MORE THAN 5 YEARS.", "score": -8, "replies": [{"body": "I was about to say it was just a hypothetical... then i checked MELI... 5 years annualized revenue +58% CAGR | total equity CAGR +35% and \\*consistent, we're not talking about those sporadic biotech stocks\n\n[https://www.macrotrends.net/stocks/charts/MELI/mercadolibre/revenue](https://www.macrotrends.net/stocks/charts/MELI/mercadolibre/revenue)\n\n  \n\\*10 year annualized revenue 42% CAGR", "score": 5, "replies": [{"body": "Good job you found the gold. If you are good at finding gold, you go ahead. I am a coward and less skillful ordinary person. I will take less profit. Thanks for your insight.", "score": -8, "replies": [{"body": "🥲", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "People should be careful having “favourite” or pet stocks. The ones I like change but right now 2 are APP, GEV, PLTR. Watching TSLA and BTC carefully although BTC isn’t a stock", "score": 2, "replies": []}, {"body": "I honestly think Nvidia is undervalued since it’s hard for us to fathom what kind of market they’ve created. They are revolutionizing computing and everyone will rely on GPUs moving forward. They basically have infinite scale and I’ve heard Tom Lee say they’re on track to eventually do $1T in annual sales. Could they become a $10T company? $20T? $30T? Who the heck knows.\n\nAmazon has been a slow mover since the pandemic and sells off everytime it’s about to make a run. I think Jassy will finally pivot to profitability but the days of 50%+ growth are behind us. Also Trump winning will cause this stock to randomly sell off over the next 4 years as he berates Bezos in public and works behind the scenes to screw Amazon over. He interfered on the Pentagon cloud procurement process which cost AWS a $10b contract. He’ll also come at their retail business and keep the antitrust suit going. \n\nGoogle is definitely undervalued but antitrust and perceptions of complacency and other AI companies taking share from them will keep it weighed down. Investors like Meta because of the perception Zuck is hungry to innovate and win. I believe Google is well positioned moving forward but they don’t give investors the same sense of confidence as other big tech names.", "score": 2, "replies": []}, {"body": "Fun fact: vital farms will send 36 eggs per year to investors with at least 15 shares.", "score": 2, "replies": []}, {"body": "I own VITL and IESC. The latter is my best performing stock I have owned - have owned off and on since $14 and my current position is up about 700%. \n\nI like ESOA in the same space and for similar reasons. Part of a macro trend of electrifying everything, solid growth and what seems to be smart, conservative management", "score": 2, "replies": [{"body": "> I own VITL and IESC. The latter is my best performing stock I have owned - have owned off and on since $14 and my current position is up about 700%.\n\ndo you prefer vitl or iesc?", "score": 1, "replies": []}]}, {"body": "Mstr...", "score": 3, "replies": [{"body": "Take the orange pill and explore the rabbit hole. Soon discover the red pill. Stay laser focused.", "score": 6, "replies": []}]}, {"body": "I wonder if this list could be split into two ? Mega cap vs everything else.", "score": 1, "replies": [{"body": "Small; VITL, IESC, FIX, MELI, HEI\n\n\nLarge; TSM, NVDA, AMZN, GOOGL, MSFT", "score": 3, "replies": []}]}, {"body": "!remind", "score": 1, "replies": []}, {"body": "Thoughts on asts?", "score": 1, "replies": [{"body": "highly speculative", "score": 2, "replies": []}]}, {"body": "Op you recommend Iesc, vitl?", "score": 1, "replies": []}, {"body": "Late to this conversation - I’d like to point out that 33% of VITL’s floating shares are being used to short.\n\nNot that the long term prospects of this company are bad, but I’d take this into account before opening a position expecting the short term uptrend to continue. ", "score": 1, "replies": [{"body": "Interesting, I didnt know that. That caught me off guard a bit. Thank you for the info", "score": 1, "replies": []}]}, {"body": "yeah we'll see how VITL does if/when there's every regulatory backlash to price gouging of recent years \\*which is definitely what's happening in their recent revenue bumps\\*", "score": 1, "replies": [{"body": "Not too sure about them price gouging, their gross margin is less than 10%. I think theyre actually growing", "score": 2, "replies": []}]}, {"body": "#DJT", "score": -4, "replies": []}, {"body": "This is all very well, but IMO anyone wanting to return some profits would have Microstrategy and Tesla in their top 10 holdings.", "score": -2, "replies": []}, {"body": "Ain’t my port so it’s trash", "score": -8, "replies": []}, {"body": "Look up High Tide, great financials in a beaten down sector - Cannabis industry", "score": -11, "replies": [{"body": "Big fan of MSOS, if you’re into the Cannabis sector I’d recommend checking it out. It’s the largest ETF covering the sector in terms of AUM and I got in at $7 a share, I think it’s still a bargain.", "score": 5, "replies": [{"body": "The massive downvoting is a good sign lmao, always inverse Reddit, especially r/wallstreetbets and r/stocks", "score": 5, "replies": [{"body": "See Teslas recent earnings for a wonderful example of inverse wallstreetbets", "score": 1, "replies": []}]}]}, {"body": "not great financials at all", "score": 7, "replies": [{"body": "Recently profitable, growing fast with a good gross margin? Where do you see the issue?", "score": -1, "replies": [{"body": "they are not growing fast. their revenue growth is not even 4% / year, total equity negative %. As for fundamentals, I'm a stoner myself but the actual business side of any sort of intoxicating/drug main product is always going to be volatile and not in a good way. Look at any alcoholic beverage stock", "score": 4, "replies": [{"body": "2024 isn't as high in a growth revenue because it has recently become profitable. Revenue has 5x'd since 2020 with Price to sale ratio of 0.6. That's undervalued even in the industry", "score": -2, "replies": []}]}]}]}]}]}
{"title": "It ain’t much but it’s honest work ", "selftext": "Mostly just NVIDIA calls (with a little bit of Google, RobinHood, and Microsoft). Mostly in cash right now waiting for a big bang to go all in", "id": "1gc4t7r", "created_utc": 1729890512.0, "score": 352, "upvote_ratio": 0.95, "num_comments": 68, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 months ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/qbrqhhuha0xd1.png?width=466&format=png&auto=webp&s=a1a7a7ca2343d19c79be2e5c369b791ae4f94f8b", "score": 136, "replies": [{"body": "Darren Hodges chattanooga coke", "score": 4, "replies": []}, {"body": "Haha now just change the photo to generic Wall Street guy or bank exec", "score": 4, "replies": []}]}, {"body": "how long is all time? \nwhat strike/expirations do you target? \n\ncongratulations - this is awesome", "score": 42, "replies": [{"body": "All-time is 3 years! I always do long (1+ year) ITM call, and then double down when my positions go against me. \n\nThank you!", "score": 53, "replies": [{"body": "I have a similar strategy, just know you can also sell otm calls at low deltas with a shorter expiration date against your long calls for steady additional gains\n\nhttps://preview.redd.it/2g6c7me8r1xd1.jpeg?width=1179&format=pjpg&auto=webp&s=0e0e69de36ab47c2679f00a4baa27e102de6c6ab", "score": 16, "replies": [{"body": "I used to do that a lot! But I would get burned when the shorter call expired ITM (probably just because I’m using RobinHood). Now, I’ll sell an OTM call at the same expiration", "score": 3, "replies": [{"body": "Yeah absolutely has happened to me too. I was selling at like .16 deltas and because of the current market’s volatility sometimes still getting burned, so I when lower than that when I sell. Also have to make sure to know when earnings is before selling something because I’ve made that mistake lol", "score": 1, "replies": []}]}, {"body": "Can you elaborate on this strategy?", "score": 2, "replies": [{"body": "Yeah it’s called a poor mans covered call (PMCC) or a call calendar spread. In order to sell an OTM call we normally need 100 shares, but that’s super expensive. An alternative is to buy a call that is ITM or a least less out of the money. If you do that at the same expiration date it’s just a regular spread. But if you buy a long dated in the money call you can use it as the collateral repeatedly over the course of that long dated calls life. We call long dated calls like this LEAPS (long term equity anticipation securities). Now when selecting a LEAP it’s important to take into mind the delta of it. You want the delta to be somewhere around .70 or .80. Maybe 0.6 if you’re stingy and don’t want to pay a lot. Now fundamentally a long dated call like this is a very bullish bet, because you are hoping this call will go up in value. \n\nHalf of my portfolio is a single SPY call with 1/17/25 exp at strike $435 that I bought for $6500 and is now worth $14900. With that SPY call so in the money I can sell OTM calls against it at shorter expirations. It’s recommended to sell something between .16 delta or 0.3 because you want them to have a very low likelihood of ever getting in the money. I personally have been sticking to the lower end , 0.16, because the market has been so green lately that on some occasions I’ve had to buy back my short calls. The nice thing about the big delta spread between the short and long call is if the stock goes up you the money you make on the long call offsets the money you lose on the short call to a greater degree. It only digs into your gains, rather than is a loss. This can change though if your long calls delta is too low, and the acceleration of delta on your short call (charm) outpaces that of your long call. But if you set it up smart you will only lose money if the underlying stock tanks and your long call loses lots of value. This is what I do on most stocks I am bullish on. I have spy, nvda, tsm, aapl, TJX, NTRA, RTX, EAT in my portfolio.\n\nOh another thing is the short calls your selling, its best to sell them 30-45 days to expiration because that’s when theta decay accelerates the most. Just be wary of earnings or any other events that can affect big price movements", "score": 3, "replies": [{"body": "Thank you for the detailed explanation, much appreciated!", "score": 2, "replies": [{"body": "If you have questions I recommend watching the tasty trade YouTube videos on it. They’re options stuff is very good", "score": 2, "replies": []}]}, {"body": "I have 2 LEAP on Amazon. I never thought about this. Thanks for the explanation. Im gonna start doing this.", "score": 2, "replies": []}]}]}, {"body": "damn u gotta show me how to do this", "score": 2, "replies": [{"body": "You just gotta have level 3 options enabled on a margin account and then open a spread. If you have a long call RH will have that long be used to cover the short in case of assignment. You won't be able to sell that call unless you're out of the short tho, because RH doesn't allow naked shorts", "score": 2, "replies": []}, {"body": "I wrote a long comment to another dude, check it out", "score": 1, "replies": []}]}]}, {"body": ">and then double down when my positions go against me. \n\n\nWhat if the double position goes against you?", "score": 3, "replies": [{"body": "Triple down", "score": 9, "replies": [{"body": "What this guy said", "score": 2, "replies": []}, {"body": "*Monsieur Le Martingale has entréed le room*", "score": 2, "replies": []}]}]}, {"body": "I want you to know that if you understand macro economics and a handful of micro economics and do this on bull runs you will out preform the best trading firms. You genuinely can only do that if you buy on bigger dips", "score": 5, "replies": []}]}]}, {"body": "Hey Bud,\n\nCongratulations! Wrt \"It ain't much\", Don't underestimate your earnings. It's a lot. It's 200+%. Not everyone can achieve that.\n\nKeep repeating it. Good Luck!", "score": 16, "replies": [{"body": "Thank you!", "score": 3, "replies": []}]}, {"body": "Narrator: “It was, in fact, not honest work.”", "score": 13, "replies": []}, {"body": "So you do mostly leaps?", "score": 6, "replies": [{"body": "Yup!", "score": 6, "replies": [{"body": "How are you picking your entries?", "score": 1, "replies": []}]}]}, {"body": "That $50M margin rate. Is that mostly just to look more legit?\n\nAre there any accounts on HOOD using anywhere near that? Even Schwab probably doesn’t have too many.", "score": 8, "replies": [{"body": "I don’t think I understand the question. I don’t use margin", "score": 3, "replies": [{"body": "There is basically an ad in the screenshot. Talking about the margin interest rate on HOOD if you borrow over 50 million. \n\nIs *anyone* on HOOD doing that? Do they have accounts that large?", "score": 10, "replies": []}]}]}, {"body": "If you had 700 dollars right now what would be your best call right now to make it grow nicely", "score": 4, "replies": [{"body": "I don’t trade with anything less than a few thousand.", "score": 27, "replies": [{"body": "sigma response", "score": 13, "replies": []}]}, {"body": "2024 is the year of nvda calls", "score": 4, "replies": []}]}, {"body": "Is it tho?", "score": 2, "replies": []}, {"body": "Honest only if you made it on the war stocks lol", "score": 2, "replies": []}, {"body": "Just curious, are you a day trader? Is this your full time job?", "score": 2, "replies": [{"body": "I’m a software engineer", "score": 4, "replies": []}]}, {"body": "40k richer than me", "score": 2, "replies": []}, {"body": "Guys, what app is this", "score": 2, "replies": []}, {"body": "Gambling is NOT honest nor is it WORK!", "score": 3, "replies": [{"body": "Put the fries in the bag bro", "score": 24, "replies": [{"body": "Too busy dealing with all this garbage in my dumpster.", "score": 3, "replies": []}]}]}, {"body": "Easy money", "score": 1, "replies": []}, {"body": "By \"big bang\" you mean large drop? If so, what strike and date are you thinking? How far ITM call?", "score": 1, "replies": [{"body": "Yes I do. I always try to trade ATM 1+ year to expiry", "score": 2, "replies": []}]}, {"body": "biggest winner and losers?", "score": 1, "replies": [{"body": "Winners: NVDA\nLosers: Google", "score": 4, "replies": [{"body": "nice and how much did that net you", "score": 1, "replies": [{"body": "You look at the screenshot? 😂😂😂", "score": 1, "replies": [{"body": "I meant from just NVDA in a single trade?", "score": 2, "replies": []}]}]}]}]}, {"body": "What app is this?", "score": 1, "replies": []}, {"body": "Earnings report next month", "score": 1, "replies": []}, {"body": "I think the real question here is who the fuck has a 50 million dollar margin loan at Robinhood?", "score": 1, "replies": []}, {"body": "Nice work, fam! Keep at it!", "score": 1, "replies": []}, {"body": "Good job man", "score": 1, "replies": []}, {"body": "Were you using nexustrade for this?", "score": 1, "replies": [{"body": "I used it to test the strategy idea with leveraged ETFs, but I didn’t execute the trades with the platform (I haven’t implanted live trading yet)", "score": 1, "replies": []}]}, {"body": "its literally the opposite of honest work. its degenerate gambling.", "score": 1, "replies": [{"body": "Fries. Bag.", "score": 1, "replies": []}]}, {"body": "What is a long call?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Play long options! You won't regret it!", "score": 4, "replies": []}, {"body": "Get a job", "score": 3, "replies": []}]}]}
