{"title": "My take on the robotaxi businesss", "selftext": "The business plan for Tesla is to sell cars, and continue to make money of them through the whole life of the car from robotaxi  profit sharing. Tesla will operate the platform and sell the cars, but private owners will operate them. These can be purpose built cybercabs and cybervans, or any car that supports FSD.\n\nTesla will make money by selling the cars, selling or renting FSD, and profit sharing from rides. Their operating costs are the platform and FSD training/development, but owners cover charging, cleaning, maintenance, and insurance. Cars become a money printing machine.\n\nIn contrast, Waymo has to cover all operating costs, plus the cost of the cars. \n\nThis is why Elon has said repeatedly the future of the company depends on FSD. It really does! I've been using it since version 10.x, and I'm convinced they'll get to unsupervised FSD within the next 2 years. I know there are a lot of skeptics, but let's say it does happen. If it doesn't then Tesla is in fact just one more car company, but if it does, the upside potential is enormous.\n\nThe main issue is going to be regulatory approval. but they should be approved to operate FSD unsupervised relatively quickly in the areas where Waymo already operates. Changing the laws to allow autonomous cars at all is the hard part. But it should be only a matter of certification in the locations where they are already allowed. \n\nIt'll become easier as the technology is proven to be safer than humans. It will become really hard to argue it should not be allowed if 10x more miles per accident is achieved. Of course safety won't be the only argument, and there will be also be arguments about job losses and whatnot, but it'll get to a point where it just becomes indefensible not to allow it.\n\n", "id": "1g1pgvl", "created_utc": 1728696930.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 71, "comments": [{"body": "> Cars become a money printing machine.\n\n\n\n\nIf you can produce money printing machines that print $30,000 a year, why would you sell them for $30,000?", "score": 29, "replies": [{"body": "Because Tesla will get a cut on all the miles.", "score": 1, "replies": [{"body": "As opposed to keeping all of the revenue for themselves.", "score": 9, "replies": [{"body": "Well, not all revenue. If they operate the fleet, then they have to cover all operating costs themselves.", "score": 2, "replies": [{"body": "It’s either profitable or not. \n\nIf it’s profitable they’d be doing it themselves.\n\nIf it’s not it would be stupid for consumers to buy them.\n\nTesla will not leave money on the table and throw profits to their own customers.", "score": 8, "replies": [{"body": "This is not speculation. Tesla has repeatedly stated they'll sell the cyber cab and owners of FSD capable vehicles will be able to join the robotaxi platform.\n\nThey'll never going to operate the fleet themselves. Their goal is to produce and sell as many cars as possible, and collect revenue from them through their whole life.\n\nWhy would they deal with all the overhead of provisioning and maintaining the charging hubs and the vehicles. Think about all the overhead of leasing, permitting, and building each location; the attendants they need to hire, and the overhead of dealing with them; the depreciating fleet inventory; having to throttle your production to match operating capacity. Just doesn't make sense.\n\nOn the other hand, you can sell the cars, the software, the charging, and receive a portion of the ride revenue.", "score": -4, "replies": [{"body": "> Tesla has repeatedly stated they'll sell the cyber cab and owners of FSD capable vehicles will be able to join the robotaxi platform.\n\nTesla says a lot of things. They're lying here — they won't be selling the cybercab to consumers, because as multiple people have already tried to explain to you, the economics do not make sense for them to do so. \n\nThey're going to start service with self-owned vehicles, and at some point do a sheepish \"oops, we changed strategy\" — it's that simple.\n\n> Why would they deal with all the overhead of provisioning and maintaining the charging hubs and the vehicles. Think about all the overhead of leasing, permitting, and building each location; the attendants they need to hire, and the overhead of dealing with them; the depreciating fleet inventory; having to throttle your production to match operating capacity...\n\nBecause doing all of that is more profitable than throwing XX% of your revenue to individuals.", "score": 6, "replies": [{"body": "Why is Uber not operating their own fleet then?", "score": -1, "replies": [{"body": "In many cases they are. That said, Uber isn't an automotive OEM. They extract value from depreciated contractor cars, and do not have the possibility of a single-model fleet or OEM repair costs.", "score": 4, "replies": [{"body": "Tesla also has pay for their cars, at cost if you will, but they are not free. \n\nBut that’s not why. The reason is scale. If they operate their own fleet, the growth of the network is limited by their operating capacity.\n\nWhat you guys can’t understand is that yes, you make less per car, but  the potential size of an owner operated fleet is orders of magnitude larger than if they operate it themselves.", "score": 1, "replies": [{"body": ">Tesla also has pay for their cars, at cost if you will, but they are not free. \n\nTesla doesn't actually need to pay for their cars — if the network is day-one profitable they get quasi-infinite buy in from institutional investors. Saudi PIF or similar will happily front the cash. Zero problems. Tesla itself already has enough capital to immediately begin production, but external quasi-infinite-scale funding isn't an issue. \n\n>The reason is scale. If they operate their own fleet, the growth of the network is limited by their operating capacity.\n\nAgain, if the network is day-one profitable, there is no practical limit here. Saudi PIF or whomever will front the cash to spring up thousands of sites with the snap of a finger. The rest is easily outsourced to Hertz or similar. Zero issues there. The limiting factor would be vehicle manufacturing speed.", "score": 5, "replies": [{"body": "Except they won’t have the capacity to operate the fleet. But anyway, we’ll find out in due time. The idea they’ll operate the fleet is ridiculous, but no point going around in circles.", "score": 1, "replies": [{"body": "> Except they won't have the capacity to operate the fleet.\n\nI'm literally telling you they can get as much capacity as they want if the economics are as good as they say.", "score": 3, "replies": [{"body": "Sure dude, a Saudi prince and Hertz is the answer :)", "score": 0, "replies": [{"body": "There are many 'answers'. \n\nWhat isn't the answer is selling these direct to consumer. \n\nNot happening.", "score": 3, "replies": [{"body": "Remindme! [5 years]", "score": 0, "replies": [{"body": "This isn't going to end well for you, my dude.", "score": 3, "replies": []}, {"body": "**Defaulted to one day.**\n\nI will be messaging you on [**2024-10-14 02:25:01 UTC**](http://www.wolframalpha.com/input/?i=2024-10-14%2002:25:01%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/teslainvestorsclub/comments/1g1pgvl/my_take_on_the_robotaxi_businesss/lrnu95z/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fteslainvestorsclub%2Fcomments%2F1g1pgvl%2Fmy_take_on_the_robotaxi_businesss%2Flrnu95z%2F%5D%0A%0ARemindMe%21%202024-10-14%2002%3A25%3A01%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201g1pgvl)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "1. It’s not revenue that counts, but profit.\n2. Then they wouldn’t get the $30k for the car.", "score": 0, "replies": [{"body": "I really want to know what you think you're adding to the conversation with that first point.", "score": 3, "replies": [{"body": "I am sorry it went over your head. \n\nYou were the one who brought up revenue. It seemed you were unaware of the fact that profit is what really counts. Otherwise, why are you bringing revenue into the discussion?", "score": -1, "replies": [{"body": "Because revenue is what you want to keep more of to increase profits. Hope that helps.", "score": 3, "replies": [{"body": "Not necessarily. There are many cases where that is not true. Have you not studied business or economics at all?", "score": -1, "replies": [{"body": "As always, your continued attempts at little 'gotchas' is just unproductive. You haven't actually done anything here. Find better things to do with your time, yeah?", "score": 3, "replies": [{"body": "Insults are often a refuge of those who lose the argument. Just so you know, everyone reading this can see your obvious attempt to deflect.", "score": 0, "replies": [{"body": "Cool, great chat.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "If Tesla sells the robotaxi, they get immediate revenues without having to cover the significant capital cost of building out the global scale robotaxi/robovan fleet.\n\nSure, they could do it all themselves and focus on profitable large cities first, leveraging existing charging and service locations/employees perhaps, reallocating, refurbishing and replacing the fleet where they see fit...\n\nBut do they really want to operate this globally including lower-profit smaller towns and rural areas or just sell them to fleet operators who will worry about local operations \\[while Tesla still gets ongoing revenues on the fsd subscription, ride-app and parts/repair side\\]\n\nThe former sounds like less hassle, profit off selling robotaxis and robovans to companies, fleet operators, transit authorities and enterprising individuals", "score": 0, "replies": [{"body": ">If Tesla sells the robotaxi, they get immediate revenues without having to cover the significant capital cost of building out the global scale robotaxi/robovan fleet.\n\nExcept this isn't a real, valid dichotomy. If Robotaxi is profitable, then Tesla gets favourable institutional money to build, or so an easy raise / dillution. There is no realistic situation where they \"go it alone\" funding the build-out, that's not how any of this actually works.", "score": 2, "replies": []}]}]}]}, {"body": "That doesn’t include the cost of FSD.", "score": 1, "replies": [{"body": "So he's going to sell a cybercab that doesn't have a steering wheel or pedals that can't drive itself, for $30k? Got it. ", "score": 5, "replies": [{"body": "The cyber cab is dumb. Very few want or need a two seater autonomous vehicle at that price. At the least, it should have had 4-5 seats. Tesla has lost its way with this dipshit at the helm. Can’t believe the model 2 died for this. Ugh.", "score": 5, "replies": [{"body": "Yes, a 4 seat minimum is needed. Much more versatile to address a larger user base.", "score": 4, "replies": []}, {"body": "The cybercab and cybervan are just purpose built vehicles that will be sold to fleet operators. But any FSD capable car will be able to join the robotaxi network, so there’ll be plenty of different choices.", "score": 0, "replies": [{"body": "Focusing on this above a model 2 which would have sold like bananas is an insane mistake by Tesla. FSD is years and years away from being unsupervised and very few people will be allowing strangers to ride in their cars unsupervised. \n\nI love my Tesla. I want a second one to replace our Mazda 3 as the city runaround but we don’t need another big car like the Y we have. A 3 doesn’t work as we need a hatchback due to having dogs and a kid whose child seat sits permanently in the second row. A 2 would have been perfect and I bet this fits with the majority of potential customers. \n\nPrioritizing a 2 seat autonomous vehicle targeted to fleet only when their lineup so badly needs something small and practical under the 3 is just insane. \n\nI’ve pulled my stocks out of Tesla. I could deal with dipshit Elon so long as Tesla was heading in a reasonable direction. This is not reasonable and I fear it’s the beginning of the end for teslas dominance (tbf, the cybertruck was probably the start of the end but anyways).", "score": 3, "replies": [{"body": "The low cost compact based on the new architecture is still happening on the first half of 2025. They reiterated that on the last conference call and is stated in the 10-Q.", "score": 1, "replies": [{"body": "I hope you’re right and this isn’t another roadster or cybertruck situation. Suppose we will see.", "score": 2, "replies": []}]}]}, {"body": "They Robovan is the same as the Cyberquad. Vaporware.", "score": 2, "replies": [{"body": "Yeah, they pulled that out their ass. I don’t think it will exist like that, but at some point there will be a van.", "score": 1, "replies": [{"body": "Probably. It won't look like that, though. I expect something much more conventionally like a Sprinter or Transit.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Because of scale. You are still getting a portion, 50%?, of the $30K/yr, but you don’t have any of the costs in both money and logistics associated with operating the machines.", "score": 0, "replies": [{"body": "And how much are the costs and logistics associated with operating the machines per year?", "score": 5, "replies": [{"body": "The costs per car don’t grow at the same rate as your profits per car. Think about how much it would take to park, clean, charge, and maintain millions of cars. Compare that to only having to sell the cars, and let the buyers worry about the parking, cleaning, charging and maintaining of 1-100 cars each.", "score": 2, "replies": [{"body": "Every person who buys a robotaxi for the purposes of making money will have to factor in the cost of the car, the cost of maintenance, parking, car insurance, the revenue share to Tesla AND most importantly the liability for the safety of the passengers. If numbers don’t add up it won’t scale as people wont buy it. Tesla could do all of the things I just mentioned at a much lower cost. This whole thing smells like Tesla trying to sell shovels at a fake gold rush.", "score": 8, "replies": [{"body": "Of course people will take this into account and they won’t buy a cybercar or join with their existing FSD capable cars if the numbers don’t make sense. This is not different from Uber, where owner also carry all operating costs. \n\nWhy lease, permit, build, and operate your own locations all over the country where cars go back to be charged and cleaned? Why keep a fleet of depreciating inventory? \n\nA network of cars generating passive income is what makes sense.", "score": 1, "replies": []}, {"body": "Im confused. Did Tesla say they would be seeking the robotaxi to consumers?", "score": 0, "replies": [{"body": "Yes, the cybercab will be sold to consumers. And any FSD capable car will also be able to join the robotaxi network if they wish.", "score": 1, "replies": []}]}]}]}]}, {"body": "The implication here is you think it costs $15k per year, per car just to operate them. I'd encourage you to think hard about that number.", "score": 1, "replies": [{"body": "I understand what the implications is, but that’s a very simplistic way of looking at it. At a scale of millions, it would cost you a lot more than $15K per year. \n\nThe bottleneck is actually real estate. If they operate the fleet, they’ll need hubs where cars go back to charge and get cleaned. Leasing, permitting, building, and operating these hubs takes a lot of time and money. This means you can only produce cars and grow the network at the rate you can open hubs to operate new cars, otherwise you’ll be just accumulating inventory, which is a big cost in itself. \n\nIf owners operate the cars, then they’ll instantly have a network of densely distributed locations where cars go back for cleaning and charging, at not cost to you.", "score": 1, "replies": [{"body": ">At a scale of millions, it would cost you a lot more than $15K per year.\n\n1. Costs typically go down with scale, not up.\n2. To say the least, $15k is... unrealistic.\n\n>Leasing, permitting, building, and operating these hubs takes a lot of time and money. This means you can only produce cars and grow the network at the rate you can open hubs to operate new cars, otherwise you’ll be just accumulating inventory, which is a big cost in itself.\n\nSure, let's just chuck half of our revenue into the bin instead.\n\n>If owners operate the cars, then they’ll instantly have a network of densely distributed locations where cars go back for cleaning and charging, at not cost to you.\n\nYou are pretty straightforwardly describing a system with costs.", "score": 2, "replies": [{"body": "Costs typically go down with scale, but not for physical locations because each one is different and they need to be distributed through the operating area. \n\nWhy do you think Uber doesn’t operate its own fleet?", "score": 1, "replies": [{"body": "Uber does, actually, run (and in fact contract out) fleet management services. They are not, however, an OEM, unlike Tesla.", "score": 2, "replies": []}]}]}]}]}, {"body": "It is so obvious and simple why a company that is scaling to mass produce cars to sell at a profit, then profit even more would want to let thousands of other people run hundreds of experiments solving the actual running-of-the-fleets side of the equation.\n\nImagine how complicated it would be to have a single top down approach to figure out how to park, clean, charge, and shepard a million cars for Tesla. Is Tesla supposed to have an extra 75,000 leases of various sizes in various locations to park in?\n\nIs Tesla going to and fire and monitor 250,000 employees sheparding car fleets and adjust to meet supply and demand?\n\nBut all these random nutjobs are downvoting you? Like even if they disagree, why downvote you? Why are they so mad? I don't get it.", "score": 1, "replies": [{"body": "Haha, I know. \n\nAs you say, it’s so obvious, and not even innovative. After all, that’s they way all existing ride sharing companies operate. \n\nAnd what Tesla has been saying they’ll do!", "score": 2, "replies": []}]}]}, {"body": "You can PROFIT from building and selling the car  \nthen make RECURRING REVENUE from the car miles driven\n\nSo choices are  \n  \n1. \"Make >60,000$ for every car that costs you 20,000$ to build\" and then let hundreds or even thousands of individuals/groups do experimentation, problem solving, recharging and cleaning solutions, fleet management etc. while focusing on being a car and software company.\n\nOR\n\n2. Possibly make 'slightly more money' but need to come up with business plans, hire hundreds of people, deal with all the complication and hassle.\n\n1 sounds better.\n\nAlso individuals owning a Cybercab and not using it as a robotaxi will be a real thing.\n\nI would LOVE to have a a Cybercab that can drop me off in front of the restaurant I want to eat at that has piss poor parking and then have it come get me when I'm done.\n\nAlso car-sharing. A group of 3 friends could share 1 Cybercab and after it drives each of you to work, it could go back home and be ready for the next person.\n\nI've been extremely poor and lived with 1-2 cars shared between 4-5 people, so maybe it is easier to see how much Cybercab is going to help make people's lives easier.", "score": -1, "replies": []}, {"body": "One any Tesla with FSD can be a robo taxi. So they can’t just charge 100K for the cyber cab. People will just buy a 48k model 3 with fsd. \n\nTwo if the cyber cab costs 90k it’s not going to be cheaper for the end custom to use vs uber or lift! Because the owner needs to charge high fees to over the 90k car payment", "score": -1, "replies": []}, {"body": "Avoids a monopoly to have car buyers own a portion of the AV fleet.", "score": -1, "replies": []}]}, {"body": "I think this will happen, but not on the timeline anyone thinks. Unsupervised FSD in 2 years is a stretch IMO. \n\nI’ve been using AP/FSD on my 2017 S since I bought it in November 2017 and there have been tons of improvements but I think everyone is underestimating the regulatory and public acceptance aspect. \n\nWill it happen? Yes. Will it happen in 2 or 5 years? Probably not. As an investor I’m happy to be wrong and have my shares 10X again, but I’m way more hesitant to believe any timelines than I was in 2018/2019", "score": 10, "replies": [{"body": "Yeah, 100% it’ll happen, but hard to guess at timelines. \n\nRegarding FSD, I feel like it’s very close and progress is accelerating. But it can also be the case that the last 1% takes 90% of the time. Not to mention regulatory approval, which is completely unpredictable.", "score": 0, "replies": []}]}, {"body": "Just a big big heads up. Unsupervised fsd with cameras only will only get through in Texas and that will be with some serious payoffs to campaigns. Pedestrians will die and will ruin robot taxis image for all others. Camera work by taking in photons to a sensor. The problem is when sensors get a blast so photons aka from the sun or large light source, it makes the useless and they cannot see living objects or cars. They work for 99% of cases but that’s the easy part of self driving. The hard part is edge cases and those are when humans will be killed.", "score": 1, "replies": []}, {"body": "\"Wake up son! School starts over 40 minutes!\"", "score": 1, "replies": []}, {"body": "You are delusional when it comes to approval.  It's not going to be easy at all.\n\nIn fact I am willing to bet that there will be states that will defacto ban Tesla's approach to Self-Driving. For example they can stipulate that a L4+ autonomous car needs to have an active primary sensing method, ie Lidar.", "score": 1, "replies": []}, {"body": "I would disagree on speedy regulations in pre-existing areas. Waymo weren’t the first in San Francisco but still had to negotiate as if they were the only autonomous company with several different authorities (for the same area). Until national regulations are in place nothing will be speedy and Level 5 simply cannot exist (regardless of the capabilities of the manufacturer).", "score": 1, "replies": [{"body": "> Until national regulations are in place nothing will be speedy and Level 5 simply cannot exist (regardless of the capabilities of the manufacturer).\n\nWait until China streets are full of Level 5. US regulators will think quick.\n\nThis is like the race for the moon landing in the 60´s.", "score": -1, "replies": [{"body": "I believe that Chinese companies are already testing in California! You’re not wrong about the Moon race!", "score": 0, "replies": []}]}]}, {"body": "I have an observation from Thursday's event: Elon said we could buy the robotaxi, and it would be under 30k. that means this will be a car with mandatory included FSD for under 30k. It has no wheel and pedals, therefore, FSD must be included as standard. \n\n\nIf robotaxi gets included FSD, it will be hard to sustain the current pricing models for FSD on the other models, I would think. My theory is that the cost of FSD will continue to drop over time, or be built into the cost of the product such that every Tesla has FSD standard. ", "score": 1, "replies": [{"body": "Yeah, good point. I was also thinking about it earlier and here's my take:\n\nThe cybercab is not intended to be operated as a personal vehicle and will be tied to the robotaxi network. They can give FSD away for free because the car will be used exclusively for revenue generation.\n\nThe intended customers will operate them as a fleet. This is why there's no charge port. They are not intended to be charged at home, but at a business where they'll install the induction chargers and cleaning robots.\n\nFSD on cars with wheels and pedals will become more expensive when it becomes unsupervised. But the cost can be offset by enrolling the car in the robotaxi network when not in use.", "score": 1, "replies": [{"body": "It doesn't seem inconceivable Tesla will sell a home wireless charger.  HEVO offers home installation (I don't know much about it, just see the option on the request form).  The Cybertruck also has a port for a WPT pad.", "score": 1, "replies": [{"body": "Yes, it’s totally possible. I just thought the installation would be too complicated/costly for home applications since you need to route wiring through the floor. But maybe it can be done on top.", "score": 1, "replies": [{"body": "For home use I assume it would just be a receiver pad sitting on your garage floor with a wireguard to prevent tripping on the wires running to the wall where the control unit is mounted.\n\nShouldn't really be any more involved than installing a wall charger today, other than positing the pad so it's aligned under your car.\n\nWhereas a commercial product presumably would be more robust and potentially allow flush mounting in a parking lot \\[Maybe in a concrete parking garage surface mounting is more desirable; saving flush mounting for outside asphalt parking lots!?\\]", "score": 1, "replies": []}]}]}]}]}, {"body": "At some point there will be other cars with fully autonomous driving. How much faster will Tesla be than the others is the question determining whether robotaxis will print money or not (and for how long).", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "do you think this is Quora?", "score": -2, "replies": []}]}]}
{"title": "Sus on economy", "selftext": "[removed]", "id": "1g2b3bv", "created_utc": 1728770767.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 69, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 5 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "There is only one perfect key measure to determine if the economy is dog shit. If strippers increase their prices and at the same time see less clients AND notice a decline in their total earned average revenue for the night, even after an increase in prices, that's when you know things have gone... soft.", "score": 36, "replies": [{"body": "Where can I find the data on this", "score": 9, "replies": [{"body": "You can’t afford it if you have to ask.", "score": 11, "replies": []}, {"body": "my uncle bruiser", "score": 3, "replies": []}]}, {"body": "Strippers and lipstick are the most accurate indexes an economist can use to determine the health of an economy.", "score": 7, "replies": []}, {"body": "between this and people stop spenidng money on onlyfans when the sex isnt selling well all is lost", "score": 2, "replies": []}, {"body": "What if immigration has increased the supply?", "score": 4, "replies": [{"body": "Latinas are spicy.\n\nIn Europe all we get are skinny Ukrainian women with knives and Adidas.", "score": 10, "replies": [{"body": "Latinas are indeed spicy. 10/10 do recommend.", "score": 7, "replies": []}]}]}, {"body": "Need to start calling bear economies flaccid economies", "score": 1, "replies": []}]}, {"body": "Something global will happen to tank the market. Only a matter of time. Until then, ride the euphoria wave.", "score": 26, "replies": [{"body": "Then when it does happen, Burry & 🐻 🌈 will come out and say I told you so![img](emote|t5_2th52|4271)", "score": 9, "replies": []}, {"body": "Thank you for your wise words. Do you have any deets on when the eta might be? This prediction is as useful as \"winter is coming\", yeah, duh, every year. But when it happens and what happens meanwhile are the details that matter.", "score": 2, "replies": [{"body": "to determine when winter will arrive, look outside.\n\nAre the skies clear? Have the been for the last month or two? (in trading, is  IWM > 50MA?) then you have a pretty good estimate.\n\nIts not about determining when winter will come, its about determining if you need a new coat because yesterday you were cold", "score": 3, "replies": []}, {"body": "If I knew I’d be on a yacht somewhere in the Mediterranean, not posting here. Point is everyone thinks the market will continually hit new highs and  they buy every dip, but one day that won’t work and it could take years to recover", "score": 1, "replies": [{"body": "That is a risk you take with investing. If anyone ever said that investing is a free money tree - they lied. \n\nYou'll just have to try to manage your risks the best you can. And not investing is also a risk, you will lose out on all of the economic growth that is very likely to happen and you will certainly lose out to inflation if you just sit on your money.", "score": 1, "replies": []}]}, {"body": "It's like game of thrones. The dragons are coming. When are they going to get here? Who knows.... but they're coming.", "score": 1, "replies": []}]}]}, {"body": "History has shown us that History is not a reliable measurement for future stock market price.", "score": 9, "replies": []}, {"body": "We're all gonna be luddites soon. Don't worry about it.", "score": 8, "replies": []}, {"body": "No…it wasn’t a true 50bps.  It was a catch up 50bps.  Should have cut but didn’t so they tacked 2 25bps.  So it’s not the economy is shit that they are cutting 50bps.  Economy is strong.  Restaurants are packed still and so is Starbucks…", "score": 4, "replies": [{"body": "Restaurants, coffee shops and real estate activity is all slowing down here in California", "score": 2, "replies": [{"body": "Short SPX with your thousand dollar portfolio bud", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4271) gottem", "score": 2, "replies": []}]}]}]}, {"body": "Yeah there is a big mismatch between the jobs that exist and the jobs that people want to work. The government thinks it can just create infrastructure jobs, but most people don't want to build a fucking highway professionally. Most people want some cushy WFH computer job. At some point there will be a reckoning, I just don't know when.", "score": 4, "replies": []}, {"body": "The dollar bill has the word “trust” written on it because u have to trust it will be worth something tomorrow.\n\nThe national debt is going to break that trust at some point…..", "score": 13, "replies": [{"body": "National debt doesn't mean anything when you can just print money. Don't bother with the inflation rebuttal because we just witnessed them bring it back down.", "score": 0, "replies": [{"body": "Found Powell’s burner", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}, {"body": "Yeah because they did quantative tightening for a year lmao", "score": 0, "replies": [{"body": "Yup. Thanks for explaining the obvious", "score": 1, "replies": []}]}, {"body": "Ur kidding yourself…..", "score": 0, "replies": []}]}]}, {"body": "Yes, the economy is sus, problematic, cringey, and not based.\n\nYou gotta chill on the FOMC lingo home skillet.", "score": 6, "replies": []}, {"body": "The government and companies need to refinance debt at a lower rate.", "score": 3, "replies": []}, {"body": "I’m releasing Covid 20 next week so my puts can go in the money", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "The economy does seem a little gay, yesterday I caught it beating it to pictures of Powell 🤨", "score": 5, "replies": []}, {"body": "Just let it be what it is. The numbers are coming down? Okay then. That means things are getting better. Play both sides. Don't perma bear.", "score": 2, "replies": []}, {"body": "I think all the hi gf frequency trading makes this shit never go down anymore. Every dip is just bought and reversed", "score": 2, "replies": []}, {"body": "Your post feels sus.", "score": 2, "replies": []}, {"body": "I believe financial markets are quieter than they should be. If they were more volatile given the low profits and high price-to-earnings ratios, I wouldn't find it suspicious; that's just part of the market dynamics. \nAlso, I question the accuracy of the reported unemployment and inflation data. It seems as though certain items have been removed from the calculation to present a more favorable picture.\nBut hey, i might be just a regular paranoid regard.", "score": 2, "replies": []}, {"body": "Israel getting ready to launch attack on Iran and Iran is likely to answer the 5x the missiles they sent a week and a half ago and likely shut off the strait of Hormuz. Get your popcorn ready", "score": 3, "replies": []}, {"body": "You are happy\n\n\nYou are content\n\n\nEverything is fine", "score": 2, "replies": [{"body": "Is this from what about Bob ?", "score": 1, "replies": []}]}, {"body": "Inflation not bad hiring good. A lot of tech start up in the future so most signs pointing up", "score": 1, "replies": []}, {"body": "Nah", "score": 1, "replies": []}, {"body": "The problem is that you're trying to apply a historical precedent that doesn't exist, and you're trying to apply it to a unique situation. Inflation in 2022 and 2023 was the result of economic disruptions from Covid. Unemployment has been low, debt service as a percentage of income is very low, delinquencies on mortgages are at historical lows, household equity is stratospheric, the balance sheet of banks is pretty solid, and new business formation has remained at a significantly elevated level that we have seen since the late 1990s. \n\nThe Fed has two missions: Control inflation and keep Americans employed. With inflation pretty much tamed at this juncture, the Fed is switching emphasis to ensuring that unemployment doesn't rise further.", "score": 1, "replies": []}, {"body": "Love those semi doomer/conspirationnist post and comments section lmao. Thanks for the laugh", "score": 1, "replies": []}, {"body": "I still think we’re in a state of stagflation. Jamie Dimons says it’s a good possibility. That’s why when things start to look good the next report says otherwise. With that said, inflation has been relatively tame.", "score": 1, "replies": []}, {"body": "The market has been in a bull run since 2010. Honestly, the market has been in a bull run since inception; it just goes thru small phases (crash, pull backs, rallies, etc.) I agree it doesn’t seem like the market can continue the momentum and a harsh pull back is likely to occur soon.", "score": 1, "replies": []}, {"body": "The 50 basis point cut doesn’t mean there is a problem. There is a theoretical neutral rate of interest where inflation isn’t going up and employment is still good. Nobody knows what that is and it changes all the time, but the estimate right now is 2.5% to 3.5%. The Feds target rate was up over 5%. A rate that much higher than neutral should keep pushing inflation down, but will end up hurting employment. Inflation is almost at the Feds target, so keeping rates high risks an overshoot, inflation getting too low and a lot of people getting laid off. The 50 basis point cut is an indication that they are way over the neutral rate and want to get to it a little bit quicker. They are being proactive. They think they have inflation beat, and don’t want to keeps squeezing things so tight that they tank the job market.\n\nAnother way to look at it is right now inflation is at about 2.5%, but you can get over 4% in an FDIC insured HYSA or a treasury bill.  Basically you can increase your real wealth around 1.5%- 2.5% a year completely risk free,  not by working hard, starting a business or making smart investments, just dropping your money in a savings account. That’s pretty unusual historically. The Fed thinks they have inflation beat and is trying to get stuff back to normal.", "score": 1, "replies": [{"body": "I respectfully disagree because we have to ask ourselves why would an investor be satisfied with a 4% return in bonds if the average YOY return for the S&P over the last 10 years was 13%? \n\nThe answer is the investors don’t see future growth staying at 13% which is a sign of a slowing economy if they would rather invest in bonds over the equities. That’s why the fed cut 50bps to stimulate investment and curtail bond buying.\n\nUnemployment increases because future revenue is hard to match so companies have to cut costs to keep the quarterly earnings high, again a sign of slowing future growth. \n\nEveryone keeps thinking it’s different this time but it really is not the Fed follows the same playbook everytime and it never works (perhaps on purpose?)", "score": 1, "replies": []}]}, {"body": "No, I'm not.", "score": 1, "replies": []}, {"body": "I got some advice for you. You only know you are in a recession way after the fact. The rule is you should not speak or say you are in a recession because merely saying that you are causes consumers and businesses to tighten their belt. \n\nThis will exacerbate any economic downturn 10 fold. This is why the media constantly lies and cooks the books. Because the truth would cause things to be so much worse.", "score": 1, "replies": []}, {"body": "I have stopped adding guac on my chipotle. No one is spending money.\n\nAlso show your puts", "score": 1, "replies": []}, {"body": "The problem with 50 bp cuts is that they are ambiguous. Either FED cuts, because it sees the economy as weak, or it cuts, because it sees the government debt spiraling out of hand with high IR. Or it could be a bit of both. Anyway, it is not a very reliable indicator of future economic prosperity, IMO.", "score": 1, "replies": []}, {"body": "youre trying to fit square pegs in a round hole... no one can really know how this will go as there were no structural issues with the economy when we stopped it cold in 2020. \n\nWith the bullwhip effect disappearing they were able to cut the rate as they are now focusing more on unemployment (Dual mandate). You're not factoring in the nuance of the situation we are in.", "score": 1, "replies": []}, {"body": "I'd argue the reason people tend to feel sus is that the entire market can look fine, but there are sectors and regions where its not good.  Powell has admitted to this as well, that they're looking at the full economy and not at the regional variance.", "score": 1, "replies": []}, {"body": "People who were around during the 2008 crisis. Was it like this as well? Nothing but good signs? Because it does feel a lil sus ![img](emote|t5_2th52|52627)", "score": 1, "replies": [{"body": "This is worse.\n\n\nAlso it's not all good news:\n- layoffs ongoing\n- Boeing with huge layoffs coming\n- striking workers (various places)\n- everyone squeezed by costs\n- least affordable housing\n- long term unemployed continues to grow ( sign of permanent job destruction)\n\n\nIt's all teetering on a cliff. They weren't going to do squat about the housing market in 2008, but realized the whole economy relies on homes as their piggy bank. So they let private equity come buy up homes to drive up the price.\n\n\nThey paint 2008 as something caused by NINJA loans, but that was only a contributor. Ultimately, it comes down to wealth destruction. The wealth destruction of an \"everything\" asset bubble popping is going to be worse than 2008.\n\n\nBut what do you do? \n\n\nIf wages catch up to assets to bring affordability back in line, then profits drop. Profits dropping will reduce stock prices. Stock prices dropping means less total comp for tech workers and they can't buy million dollar homes anymore. Home prices dropping causes people to feel less rich and spend less. People spending less put fringe businesses out of business. This causes job losses. People spend less because they don't have a job. This puts more businesses out of business. Repeat.\n\n\nIf you pop the asset bubble and wages stay the same, then people still feel less rich, spend less, etc. Still a recession.\n\n\nYoung people without savings benefit from both scenarios, if they are employed.", "score": 1, "replies": []}]}, {"body": "$35+ trillion in debt, unions striking cuz they can't make it here anymore, crumbling infrastructure, and massive layoffs everyday... people can't even afford French fries 🍟 anymore but economy is good!!!", "score": 0, "replies": [{"body": "Have you tried buying calls?", "score": 4, "replies": [{"body": "I'll try it Tuesday morning .What should I buy a call on?", "score": 1, "replies": [{"body": "I heard RadioShack is poised for a comeback", "score": 1, "replies": []}]}]}, {"body": "Isn’t the debt increasing 1 trillion every 100 days ?", "score": 1, "replies": []}]}, {"body": "Unregulated AI mass wave layoffs combined with insurance industry dropping out of property as the reinsurers back away… I believe 2025 will be a WILD ride!\n\nSo market will stay green most likely", "score": 0, "replies": []}, {"body": "After understanding the mechanics behind gold, I’ve decided that stonks go up just makes sense. Why would the price ever go down? Currency is being deteriorated with record national debt. Inflation is going to reanimate", "score": 0, "replies": []}, {"body": "🌈🐻", "score": 0, "replies": []}]}
