{"title": "Jim Cramer says \"Charts suggest inflation could soon come down substantially\"", "selftext": "CNBC’s Jim Cramer on Thursday said that inflation could soon decline, leaning on charts analysis from legendary technician Larry Williams.\n\n“The charts, as interpreted by Larry Williams, suggest that inflation could soon cool down substantially — soon — if history’s any guide,” he said.\n\nCramer's comments come after the Federal Reserve on Wednesday raised interest rates by another 75 basis points and reiterated its hawkish stance against inflation.\n\nTo explain Williams’ analysis, the “Mad Money” host first examined a chart of the current Federal Reserve sticky price consumer price index (in black) compared to the burst of inflation in the late seventies and early eighties (in red).\n\nhttps://preview.redd.it/y5rf8lxkwlp91.png?width=887&format=png&auto=webp&s=f915ed7c71dc7fccb93544871a2d043c26fb0d1c\n\nWilliams notes that the current trajectory of sticky price inflation has closely hugged this historical pattern, Cramer said.\n\nHe added that when situated in the pattern of inflation in the late seventies and early eighties, current inflation is roughly in the 1980 point of the trajectory — which is around when inflation peaked then.\n\n“Today, unlike back then, the Fed knows exactly how to beat inflation,— and Jay Powell has shown that he’s willing to bring the pain. That means it should peak sooner,” Cramer said.\n\nSource: [https://www.cnbc.com/2022/09/22/charts-suggest-inflation-could-soon-come-down-substantially-jim-cramer-says.html](https://www.cnbc.com/2022/09/22/charts-suggest-inflation-could-soon-come-down-substantially-jim-cramer-says.html)\n\nJim Cramer has said \"Charts suggest inflation could soon come down substantially,\" citing a chart comparing the Fed's current sticky price consumer price index and the burst of inflation in the late 70's and early 80's. Do you agree with Cramer?", "id": "xlwyb0", "created_utc": 1663938052.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 30, "comments": [{"body": "Technical analysis for economics? What an idiot. Magic lines don’t work against rent hikes last year that are hitting inflation now…", "score": 17, "replies": [{"body": "Or my Sky High Electric, House Insurance, Car insurance or grocery bill that has increased every month….", "score": 1, "replies": []}]}, {"body": "Thanks Cramer, we are doomed now", "score": 6, "replies": [{"body": "Coke Rat once again delivers the kiss of death", "score": 1, "replies": []}]}, {"body": "Imagine having a national platform to pump ur investments and manipulate retail traders. Wouldn't that b nice 🤣🤣", "score": 3, "replies": []}, {"body": "No, no and no.  Been grocery shopping lately?  Those prices are not coming back down.", "score": 8, "replies": [{"body": "Inflation coming down doesn't mean prices will come down though. It means they will increase at a slower pace.", "score": 17, "replies": [{"body": "More people need to understand this", "score": 2, "replies": []}]}, {"body": "```\nInflation is the rate at which prices for goods and services rise.\n```\n[source](https://www.investopedia.com/terms/i/inflation.asp)\n\nKey word is rate aka `how much prices change`.  \n\nFor what its worth, deflation isn't good either.", "score": 3, "replies": [{"body": "Depends. For things like electronics it's normal for prices on that item to deflate over time which is great when you don't always want the latest and greatest thing. Deflation can also happen by productivity increasing eg factory farming.", "score": 0, "replies": []}]}]}, {"body": "He forget to mention it will take the rest of market with it first.", "score": 2, "replies": []}, {"body": "When is he ever right?  More times than not its dead opposite of what he says", "score": 2, "replies": []}, {"body": "More Cramer nonsense and attention whoring.\n\nHey, Jim take a vacation before you go broke /s", "score": 2, "replies": []}, {"body": "PCE print is next Friday 30th…..bears have until then to break the stocks June low…..at the moment it looks like they’ll do it but the 2 year Treasury looks to have topped out which is an indication bond market expects PCE to start dropping! It’s preferred measure of Fed! \n\nIt’s possible we get a technical plunge and a neck strain rally at same time next week!", "score": 2, "replies": []}, {"body": "Fuck sake, inflation is definitely not coming down now that this muppet has said it", "score": 2, "replies": [{"body": "I know. what an asshole", "score": 1, "replies": []}]}, {"body": "By the theoreme of Invert Cramer the world is f**** up. Was nice to meet you all !", "score": 2, "replies": []}, {"body": "Bro is a paid actor, he says good things while him and his buddies follow suite with the “smart” money.", "score": 2, "replies": []}, {"body": "Never listen to Cramer. This time he’s trying to push inflation going down🤣", "score": 1, "replies": []}, {"body": "Can’t believe he hasn’t been fired yet", "score": 1, "replies": [{"body": "i kind of can believe it. if you listen to his callers. many of them sound kind of dumb. sad that they think Cramer is going to give them real help. lol", "score": 1, "replies": []}]}, {"body": "Cramer is clueless and the last person I would listen to here. If his stock calls are bad his economics is even worse. Simply a guy using charts and any other tools to suit his speculative narrative. Be a student of the markets and economics and understand what’s really going on. Yea inflation will come down but what will it take to do that? And when? And then to what extent will central banks pivot. Do you own analysis and avoid Cramer. Guy is box office for the uninitiated", "score": 1, "replies": []}, {"body": "Did you catch the media's favorite word in his prediction-  **COULD.**  The media loves that word because they use it so often that people don't even hear it anymore and assume it is going to happen because someone with the title of expert or insider said it.", "score": 1, "replies": []}, {"body": "Oh god why did he had to open his mouth.\n\nIt was well to know you fellas, good luck.", "score": 1, "replies": []}, {"body": "https://twitter.com/CramerTracker", "score": 1, "replies": []}, {"body": "And Josh Brown said the VIX was hardly moving before this week's FOMC, as if the VIX can predict what the Fed is going to do.", "score": 1, "replies": []}, {"body": "TV inflation is not real inflation.  \n\nThe CPI is the government misinformation number.  The real number is like double.  Once the mid term elections are done, you will start hearing more of the truth.  Gas prices will go up again, we will find out we've been in a recession this year, interest hikes will continue well thru next year, and inflation will never be down to 2% ever again.", "score": 1, "replies": []}, {"body": "I've been hearing Cramer's bullshit since back in the early 2000s. He is just a better shill than he was then.", "score": 1, "replies": []}]}
{"title": "Unique Request - Take a Gander at my 110-Stock Portfolio", "selftext": "As the title says, I have a portfolio with 110 different stocks.  A question I hear all the time, \"*Why not just own an ETF?\".* Simple answer - no ETF is perfect and why not create my own portfolio with stocks I have high conviction in? I have a nice mix of growth, dividend, income, speculative, international, etc. etc. \n\nSome background on me - I have a degree in Finance, have worked in the field for 4.5 years and have been doing my own investing for about 6.5. I like to pretend I am good at what I do, but let's be honest, I just got lucky in the decade-long bull market like most new investors and have been able to outperform the market in all years but one (I'll let you decide which of those years I got heavy into options trading lol).   \n\n\nI do a quarterly deep-dive on my stocks, keep up on all relevant daily news, and spend 1-2 hours at night reading relevant publications (Barron's, Kiplinger, Seeking Alpha, Various Fund Letters), so I feel pretty confident in my ability to keep up on the stocks. But I love getting outside feedback.   \n\n\nIn descending account % order, here is my portfolio - do you all see any glaring weak stocks that I may be overlooking or things that are weighted oddly?   \n\n\nENPH  \nUNH  \nMSCI  \nULTA  \nSIVB  \nDECK  \nLULU  \nMA  \nCELH  \nACN  \nWSM  \nWSO  \nWING  \nDRI  \nDG  \nMSFT  \nLHX  \nHSY  \nUNP  \nHCA  \nGTLS  \nRACE  \nLOW  \nTSCO  \nJKHY  \nCHDN  \nSPG  \nPYPL  \nAJG  \nBX  \nRTX  \nWM  \nCRWD  \nHLI  \nMAA  \nTGT  \nCRM  \nAWK  \nKRUS  \nLVMUY  \nPGR  \nDOV  \nTTD  \nAMZN  \nGXO  \nNDAQ  \nAXON  \nSITE  \nABNB  \nAPO  \nABT  \nGOOG  \nGTLB  \nETSY  \nICE  \nPFGC  \nUFPT  \nXPO  \nGLBE  \nTXRH  \nMODG  \nBFC  \nDOCN  \nXPOF  \nPGNY  \nCWEN  \nTHRY  \nBE  \nBROS  \nSONY  \nHTZ  \nONEW  \nWRB  \nEDR  \nPAR  \nXPEL  \nHDB  \nMAXR  \nSMPL  \nCHS  \nENVX  \nZVIA  \nIAC  \nGENI  \nINFY  \nPL  \nPCOR  \nCDRE  \nHIMS  \nAMPL  \nSRAD  \nTREX  \nNAPA  \nFWRG  \nTHBRF  \nHRMY  \nFSR  \nASLE  \nCLAR  \nRIVN  \nU  \nBFLY  \nGFF  \nCSEE  \nWOOF  \nRKLB  \nGCI  \nOLPX  \nFREE  \nSOND", "id": "xlj69v", "created_utc": 1663895287.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 21, "comments": [{"body": "I think you need some more stocks", "score": 15, "replies": [{"body": "Intuit has been looking pretty tasty at these levels.   \n\n\nReally, what's the difference between 110 and 111, right? ![gif](emote|free_emotes_pack|shrug)", "score": 3, "replies": [{"body": "I hate quickbooks. That's all.", "score": 2, "replies": []}]}]}, {"body": "If you truly are managing this portfolio, that amount of time would be much better spent earning wages. I say own the indices and be overweight your 10-20 favorite companies. This is outta hand.", "score": 7, "replies": []}, {"body": "Why do you have so many, how do you keep track of them, and what is your buying/selling criteria?\n\nNo judgment at all, just curious how this monster was born.", "score": 3, "replies": [{"body": "I wouldn't be offended if there was judgement - it's a lot of damn stocks lmao.   \n\n\nGenuinely, I didn't plan on owning this many. I was between 30-50 for the majority of my investing, and as I got further and further into my research, there were just so many compelling stocks I found my account ballooning lol. Over the long-term, I do see myself falling back under 100 easily. 110 is my hard cap and I have about 5-10 stocks I still want to buy at some point, but as some of my speculative drop off/names under-perform, it'll be easier to cull the portfolio.   \n\n\nKeeping track is a big task. I use Seeking Alpha/The Fly for my daily news alert/analyst PTs/etc. I also utilize VIC/Barron's/Motley Fool/CS-provided research for in-depth articles, and have subscriptions to WSJ/Kiplinger for macro news. Each quarter I do a full portfolio review, going over earnings, financials, news, outside opinions, etc. I put each stock into a category in my own spreadsheet - labelling them \"Keep\", \"Anchor\", \"Spec\", \"High Conviction\", \"On Watch\" - I also add in my own commentary as to what I like/dislike about the stock.   \n\n\nWhen it comes to buying/selling - it all varies around the type of stock. I try to keep my buys close to reasonable P/E, P/S, and PEG ranges - but obviously give more/less leniency depending on the type of stock I am looking at. Obviously we want to see outperformance on at least the 5-yr, if not the 10-yr. A dividend is good, but not necessary. I look at Rev/EPS growth rates and have specific ranges for the type of stock - also looking for FCF growth. Buybacks are also a huge thing - I try to avoid stocks with a lot of SBC. Sometimes I will also buy to enter a specific market. I bought HDB and INFY specifically as bets on India long-term. Selling is a little more succinct. If I go down 25% on any stock, that's immediately a review (this year has been fun lol). Continued earnings misses, slowing growth, inept management, etc. I've also been trimming a lot of my big wins, like ENPH and CELH as their P/E's skyrocket.", "score": 2, "replies": []}]}, {"body": "Looks good, great mix of value/growth/dividend/ and speculative stocks.", "score": 3, "replies": [{"body": "It honestly does look good. Mastercard, Celsius, good solar plays, ENVX, TGT. lot of good ones \n\n\n\n\nHonestly he could probably add some higher risk like SKIN ( off Ulta), gambling stocks, few other beaten down low cap despacs maybe", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "So January will roughly be the end of my 7th year. If market conditions hold, this year I will slightly outperform. Outside of that, I have outperformed four other years by an average of 15-20%, had parity one year (I think ended up literally being like 12 bps down), and underperformed once (it was my second year and I decided to try options and shorting lol)", "score": 2, "replies": []}]}, {"body": "That’s certainly quite a few companies to watch. As much as I would love to own a stake in all the great companies of the world, I simply don’t have the time to look through them all. That’s why I just have 21 holdings that I individually track when every earnings season comes around, with a sheet that tracks their business growth/operations/profitability/ and cash flow metrics. With this, I try to make a judgement on how they’ll do for the next few quarters. Can’t forget about logging the highlights in the conference calls as well as any potential red flags management might address in the business. The story/narrative is just as important to follow! The individual sheets are very useful to keep up with, and it’s always great to learn how a company tracks their finances :-)", "score": 2, "replies": []}, {"body": "Simply: No way you did in depth research on all (or probably any) of these companies. This looks more like a gambling problem than anything else. (If you did do any kind of research you would certainly be able to make a ranking and eliminate the bottom 105 or so of your stocks)", "score": 3, "replies": [{"body": "Agreed! Impossible to claim to have done that much research. Beyond ≈50 stocks the benefits of diversification do not increase while the difficulty of achieving alpha increases.", "score": 0, "replies": []}]}, {"body": "110? Why? Why not just buy the index at that point?", "score": 3, "replies": []}, {"body": "A portfolio of over 26 non-correlated stocks is effectively identical in risk profile to the broad market. You say no ETF is perfect, and that may be true but you won't see a marked outperformance with a portfolio of that size. Mathematically, there's little reason to own more than ~20 positions, and if you find yourself with more, an \"imperfect\" ETF will still perform just as well.", "score": 2, "replies": [{"body": "Respectfully, I disagree - partially. I believe my overall portfolio beta still sits around 1.3-1.4. In theory, if every stock I owned high-performer (not saying each one will be a winner), or even just repeated their performance over the last 5/10 years, I would handily beat the market in that time-frame going forward. Obviously there are a lot of assumptions going into that lol.   \n\n\nOverall - I don't look to double the market return long-term or some other super ambitious pie-in-the-sky goal, but if I can beat the market by 5-10% on average, i'll take that for sure.   \n\n\nThat being said, I am nowhere near naive enough to think that all the stocks I hold are destined to be winners and my portfolio will eventually be culled to a smaller size. IMO, I think 70-80 very solid stocks, 20 that *might* be winners if their theses play out correctly, and 10 lotto tickets that I keep tight stop-losses on to limit losses. So far the strategy has worked for me, but I will be curious to see what happens if the market bottoms out in a true recession/how we perform in the years after that!", "score": 1, "replies": [{"body": "If your beta is 1.3 and you beat the market by 5-10% that would underperforming based on the amount of implied risk. With a beta of 1.3, that implies that your portfolio will go 1.3x what the market does (up and down).\n\nAlso, the fact that you describe some stock as Lotto tickets makes me question your assessment of risk.", "score": 1, "replies": []}]}]}, {"body": "Why not GOOGL?", "score": 1, "replies": [{"body": "I have GOOG, buried right around the middle of the portfolio. Actually plan on buying more shares soon.   \n\n\nA little ambivalent on the voting rights, so really don't have a preference on GOOG vs GOOGL", "score": 3, "replies": []}]}, {"body": ">I have a portfolio with 110 different stocks\n\nthis seems excessive IMO. there are good, professionally managed mutual funds with *entire teams* of full-time analysts that don't have 100+ stocks in the portfolio. \n\ne.g., the Dodge & Cox stock fund DODGX is in many 401k plans, large cap value-leaning, has been around since the 1960s and has 83 stocks https://fundresearch.fidelity.com/mutual-funds/composition/256219106?type=sq-NavBar and their international fund DODFX has 81 stocks https://fundresearch.fidelity.com/mutual-funds/composition/256206103?type=sq-NavBar\n\nthe T Rowe Price Blue Chip fund has 81 holdings https://fundresearch.fidelity.com/mutual-funds/composition/77954Q106?type=sq-NavBar\n\nthe Jensen Quality Growth fund has 31 stocks https://fundresearch.fidelity.com/mutual-funds/composition/476313101\n\nVanguard Wellington fund has 76 stocks https://investor.vanguard.com/investment-products/mutual-funds/profile/vwelx#price", "score": 1, "replies": []}]}
{"title": "The Great Reckoning", "selftext": "I was just thinking about how between 2020-2021, a bunch of people in my life all started investing in stocks. People who were never interested in it before all of a sudden could just download an app and start trading.\n\nThere was a flood of Financial Youtubers and Tik Toks on trading/investing, and there was a massive surge of naive retail investors/traders who thought it was a get rich quick scheme. Think of all the idiots who made piles of money on NFT's, Crapto, Meme stocks, Themes like innovation/biotech/Metaverse (ARK et al). This is all a result of the cost of capital (Interest rates) going to effectively 0 (actually negative on real terms).\n\nIt just made me think that this year, and probably for the next few years as we tackle this inflation issue (which won't go away as quickly as everyone hopes because of structural issues), the market will be a very difficult place as Bonds compete for cash. The history of the 1966-1982 period seems to be the most apt comparison. During that time, they managed to get rates above inflation when it was around 7-8%, and there was a recession. The Fed held the rates above inflation for about a year and a half even during the recession, and then started lowering them once inflation came down. Guess what? Inflation came back even stronger when rates started going down. It was only when Volcker came in with 20% interest rates and the oil crisis of 1973 and 1979 were dealt with that inflation was finally killed.\n\nWith all the retail noobs who got suckered in thinking they were geniuses, and the absolute excess of wealth that was created from asset price inflation (including assets that have no real value like NFT's), I think history will look back and call this period The Great Reckoning.", "id": "xm9l4h", "created_utc": 1663967965.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 26, "comments": [{"body": "Just like the dot com bubble in 1999.", "score": 13, "replies": [{"body": "There are similarities with the dot com bubble for sure, but I think inflation is the real issue that everyone is underestimating. It's an incredibly sticky and insidious thing, that when you think is dead, can come back stronger than before.\n\nThe geopolitical situation certainly isn't helping either.", "score": 5, "replies": [{"body": "That’s pretty much what Burry has been saying. He said it will peak several times before finally going down.", "score": 6, "replies": [{"body": "I have got spy puts in the meantime", "score": 2, "replies": []}]}, {"body": "The comaprison like the pe value? \n\nthe S&P 500 pe ratio during the dotcom bubble was more than double the current pe ratio. They are not even close to comparable", "score": 2, "replies": []}]}]}, {"body": "Yep. Times are different. \nThe 70s struggled as the world came off of the gold standard and on to the petrodollar standard. \n\nThe internet boom was a natural boom/bust, based on this new communications platform. Even after the crash, the S&P was up 50%, and the Nasdaq even more. \n\n2008 was bankers scamming their clients, lying about the quality of the MBS and the mortgages in them. \nThe money printing problem we have now started then as the Gov printed \n$11T, about half of that inflationary. \n\nStill buying crappy MBS when Covid hit, all of the major governments borrowed billions. The US borrowed $10T. \n\nSo now out $10T GDP os priced  at nearly $30T, all due to Gov borrowing money that didn’t exist before the loan. \n\nNow the bankers and economists act suprised that all prices must rise to match the money available.", "score": 8, "replies": []}, {"body": "The economy and world in 2022 is significantly different than it was back in the 1960s and 1970s. A lot of posts and comments point back to that era as an indicator as to what will happen with our economy going forward. I don’t think we can take what happened 40-60 years ago and apply it to what will happen over the next decade. \n\nThen again, what do any of us really know?", "score": 12, "replies": [{"body": "Agreed the economy and world is different today, but inflation is inflation at the end of the day. When it starts seeping into wages and Owners equivalent rent like it has at 6%+, it's extremely difficult to get Core CPI down to the 2% target without a recession.\n\nForward looking earnings estimates are 235 for 2023. That puts us at around a 15.5x multiple (235 x 15.5 = S&P 3643). But, earnings have not come down yet, and the average recession see's a 25% drop in earnings.\n\nSo that would put us at around 180 EPS for 2023. If you consider that markets are likely to overshoot to the downside because of multiple contraction, 180 x 15 P/E = S&P 2700.\n\nObviously this is not a crystal ball and there's much more to it than just P/E, but it's a useful framework for thinking about the potential range we could see to the downside.", "score": 0, "replies": [{"body": "Can you explain why the P/E would stay at 15 if earnings dropped 25%?", "score": 1, "replies": [{"body": "Because the added uncertainty during recessions means investors are not willing to pay a higher multiple, so you get earnings compression + multiple compression.", "score": 0, "replies": []}]}]}]}, {"body": "People like to say that this time it’s different and it is. The fed has to raise interest rates/ unload their balance sheet. Forgive me if I’m wrong but wasn’t the 08 debacle avoided due to lowering interest rates and doing QE? Tools which are now put away? I think we are in new territory and more akin to a great reset lol", "score": 6, "replies": [{"body": "Completely different situations. 2008 wasn’t an inflation problem it was financial institutions gambling with maximum leverage on MBS and CDOs. It’s completely different to the current crisis. Low interest rates and QE are tools for stimulating the economy and to increase demand. That’s what the fed did after bankers sent the world into a Great Recession. They needed to stimulate the economy. The feds are doing the opposite now, trying to decrease demand and increase unemployment (even if they won’t say this out in the open.) They can certainly use QE and low interest rates again if they hike into a deep recession.", "score": 1, "replies": []}]}, {"body": "This has nothing to do with NFTs and noobs in the market, corporations and institutions filled their pockets with money with the covid relief funds.", "score": 5, "replies": [{"body": "> This has nothing to do with NFTs and noobs in the market\n\nwell, the noobs bid up Dogecoin to be worth more than Ford and Met Life, for a brief moment of lunacy. \n\nthe noobs might have something to do with this mess", "score": 1, "replies": []}]}, {"body": "As mentioned by the OP, far more people have access to the market due to online brokers like Robinhood, this is a biggie. I know retail, in small doses, doesn't have a big impact on the market, but more and more people are turning to the stock market.", "score": 1, "replies": []}, {"body": "Lost me at no real value like NFTs. If you don't see the utility of NFTs at this point, you're going to miss out on a lot of opportunity. That being said, plenty of people have been suckered in to the casino since the pandemic and it will not end well.", "score": -16, "replies": [{"body": "What is the utility of NFT’s?", "score": 5, "replies": [{"body": "Future utility example- Own a copy of a movie as an nft. Rent it out when you're not watching it. Sell it when you're done with it. Be your own Blockbuster. Imagine not renting from YouTube, but renting to or from a real person p2p. Cut out the middleman aka decentralize. \n\nBe a musician, make an album as an NFT, get royalties everytime someone sells a copy the NFT. This is not possible with CD's and consumers don't own albums on iTunes, only a license to play them. You actually would own an album as an NFT. This is a current utility.", "score": 2, "replies": [{"body": "You think a movie studio or music production company will let that fly? Or the artists? And how would that work to have a movie as an NFT? The ones I’ve seen barely have animation. Or do you mean make a whole platform where you use NFT’s to pay for movie rentals same as you do with Amazon prime? I think ur being vastly optimistic on what can be done with NFT’s. About the same as the ones that talk about putting real estate transactions on blockchain to “cut out middlemen” when it’s not possible to execute the immense amount of paperwork involved with multiple parties and government entities using “smart contracts”. It’s not even how they work.", "score": 0, "replies": [{"body": "I'm in a band, I made an NFT music video for one of our songs. I can sell it to whoever for whatever price. I'm literally already doing it and it's super easy! Independent film studios are already doing it. Eventually the big players will enter the game. Mint a movie as an NFT, sell it, not so different than producing a dvd and you continue to profit as it's resold. If it's profitable, it will be adopted. Maybe I don't understand the techinal/legal stuff, and you raise good points, but the practicality is obvious.", "score": 5, "replies": []}]}]}]}, {"body": "NFTs are useless without utility. It’s a fad. No one intelligent is holding jpegs.", "score": 1, "replies": []}, {"body": "So he lost you at the second to last line? What do you think about everything else?", "score": 1, "replies": []}, {"body": "I see some value in the utility of NFTs (eg. as DRM), but I don't see the value of an NFT. I've never owned nor will I ever own an NFT for the purpose of capital appreciation.", "score": 1, "replies": []}]}, {"body": "What happened in 73 and 79 oil", "score": 1, "replies": [{"body": "[https://en.wikipedia.org/wiki/1973\\_oil\\_crisis](https://en.wikipedia.org/wiki/1973_oil_crisis)\n\n[https://en.wikipedia.org/wiki/1979\\_oil\\_crisis](https://en.wikipedia.org/wiki/1979_oil_crisis)", "score": 2, "replies": []}]}]}
{"title": "Why not short the market now with SQQQ or WEBS?", "selftext": "Just thinking about it, why wouldn't it be a bad idea to short the market for the next month or so? We broke June support levels today, more pain ahead as well.\n\nRay Dalio said that stocks could drop a further 20% if rates hit 4.6% as is the case the Fed announced. It hasn't all been priced in considering the bloodbath. [https://www.reuters.com/markets/us/bridgewaters-ray-dalio-expects-stocks-fall-20-if-rates-rise-45-2022-09-15/](https://www.reuters.com/markets/us/bridgewaters-ray-dalio-expects-stocks-fall-20-if-rates-rise-45-2022-09-15/)\n\nNext month's CPI report on Oct 13 could be interesting, but how about shorting from now until Oct 7 and packing in the gains from SQQQ or WEBS?", "id": "xmbqgc", "created_utc": 1663973244.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 21, "comments": [{"body": "FOMO works on the way down as well…", "score": 34, "replies": []}, {"body": "Lol you’re a month late", "score": 22, "replies": []}, {"body": "Because the moment after you buy it will go up and you will lose 20% just like that. I sold mine today. TQQQ next week? I'm not brave enough for that, lol, maybe. We'll see how it goes.", "score": 9, "replies": [{"body": "Bought 70 spy calls today", "score": 3, "replies": []}, {"body": "Samezies lookin to grab some tqqq then sqqq then repeat.", "score": 1, "replies": []}]}, {"body": "Now is not the right time, the indices just dropped to a support level and are oversold in the short-term. The time to short is after we get a relief rally and then short the lower high.", "score": 16, "replies": []}, {"body": "Because as soon as you do it there will be a rally", "score": 8, "replies": []}, {"body": "Short when hitting resistance levels, not support levels.", "score": 6, "replies": []}, {"body": "Your 6 months late to the party", "score": 10, "replies": []}, {"body": "I did today, so it should be green all next week. You're welcome.", "score": 3, "replies": []}, {"body": "We didn’t break the June support levels", "score": 3, "replies": []}, {"body": "For everyone saying your too late…I bought Wednesday and sold today. Made 19% definitely not too late, there will be more red. But we are due for a little run, so I’m waiting for that before I get back in.\n\nEdit: my long term thesis is very bearish. Every time I get in, I do so feeling perfectly content with SQQQ as a bag in this environment.", "score": 3, "replies": []}, {"body": "Buy the the UUP. Shorting the QQQs will be a bumpy road.", "score": 2, "replies": []}, {"body": "Sqqq came up the right side of cup pattern and will probably at least drift down a bit before continuing the drop. So you could potential buy at the handle as it breaks this point in a week or so and catch some gains.", "score": 2, "replies": []}, {"body": "Lol do it!", "score": 0, "replies": []}, {"body": "Bear markets are very volatile, there will be individual days of huge gains wiping out your shorts. And, the big indexes are upwards trend following, they drop anything that doesn’t perform well enough, so they are not ideal to short in the big picture. My belief, and remember, don’t listen to me, I’m just a dog and I may be on acid, but my belief is that it’s tough to beat the indexes on the way up, but it’s easy to beat them on the way down.\n\nIf you must, maybe you should pick some individual sectors ETFs that are likely to fall and bet against those instead of the top of the whole market.", "score": 1, "replies": []}, {"body": "Cause it could go up", "score": 1, "replies": []}, {"body": "Timing shorts is even more difficult than timing longs. With longs, you can always wait out the storm.\n\nAnd there is always some clever guy who confirms your prediction, as there is a clever guy who refutes your prediction. In the end, the market price represents the equilibrium of what everybody thinks they know.", "score": 1, "replies": []}, {"body": "what's your hit/miss ratio for predicting moves in the market?", "score": 1, "replies": []}, {"body": "The market maker have the intel and are always months ahead of you. That is exactly why little guys like us get crushed when they ride the wave because it is usually too late.", "score": 1, "replies": []}]}
{"title": "Index like vix to hedge your portfolio?", "selftext": "Is there an index like vix to directly hold? \n\nI don’t like indexes like vxx or uvxy to hedge my portfolio because it decreases in value in bull markets vs vix that stays relatively flat with spikes for market sell offs which is perfect but sucks because you can only own the options not the stock. \n\nSo I kindly ask? Is there any direct ownership etfs like Vix to hold?", "id": "xlxu2e", "created_utc": 1663940238.0, "score": 9, "upvote_ratio": 0.8, "num_comments": 25, "comments": [{"body": "That’s like asking for free car insurance. If you want insurance you have to pay.", "score": 14, "replies": [{"body": "Problem is because options expire it doesn’t necessarily even protect the whole portfolio", "score": -8, "replies": [{"body": "Insurance expires as well, gotta re-up", "score": 12, "replies": []}, {"body": "Protecting the whole portfolio is just basically taking the opposite position. You only need to protect some of the portfolio otherwise it’s no longer a hedge it’s another position.", "score": 1, "replies": []}, {"body": "..... Insurance PREMIUMS", "score": 1, "replies": []}]}]}, {"body": ">Is there an index like vix to directly hold? \n\nYou can't hold an index.  There aren't shares in an index.\n\nVIX *is* the volatility index.  /VX is the volatility futures.  \n\nVXX, UVXY, SVXY are all etfs that track VIX in different ways.   \n\nJust like how you can't own shares of SPX so you instead buy SPY, and you can't own shares of NDX so you instead buy QQQ.", "score": 6, "replies": []}, {"body": "What exactly are you trying to hedge against? E.g., are you trying to protect against a drop in specific underlyings, are you trying to minimize volatility in your portfolio, etc.? What you’re trying to accomplish will determine your best course of action.", "score": 4, "replies": [{"body": "I am trying to neutralize the risk in credit spreads by structuring a hedge. Hypothetically holding a large Vix position would do this but that’s not possible so looking for the second best thing. Hope that makes sense", "score": 0, "replies": [{"body": "You can do debit spreads, put on an opposing credit spread, or buy/short shares to delta hedge. \n\nDepending on the underlying you could also use futures, but one of the above should work well enough.", "score": 2, "replies": []}]}]}, {"body": "Might as well just buy puts on SPX,XSP or SPY. What about an inverse stock like SQQQ?", "score": 3, "replies": [{"body": "Problem with puts is they expire worthless making insurance attempts expensive and sqqq has the same problem as uvxy they decrease overtime making owning the equity as insurance worthless.", "score": -7, "replies": [{"body": "Longer dated puts are pretty cost effective.", "score": 2, "replies": [{"body": "What do you mean? The problem is by the last few months they can be worthless", "score": -1, "replies": [{"body": "Your car insurance policy doesn't last forever either.  \n\n\nIf you want to hedge you're going to pay for it.", "score": 6, "replies": []}]}]}, {"body": "Try ZEBRA’s if you’re worried about the puts expiring. Or just out right shorts on SPY or failing that short an equivalent S&P ETF if you’re already holding spy and don’t want to sell for tax reasons. \n\nShort sell the ETF and buy bonds to offset the interest from holding the short position.", "score": 1, "replies": []}]}]}, {"body": "SARK is the best. It just shorts the worst least profitable stocks.", "score": 5, "replies": [{"body": "Prob best solution so far thanks but prob is bull markets it will prob decrease like a vxx chart", "score": -4, "replies": [{"body": "Good thing we aren't in a bull market", "score": 4, "replies": []}]}]}, {"body": "you can hold vix etf's, its important to note that vix isnt nescesarily a hedge...", "score": 2, "replies": [{"body": "You can’t buy VIX :( unfortunately just options which doesn’t make senses and sucks", "score": -2, "replies": [{"body": "Like i said. There are vix etf's. Options can make sense if you know how to use them.", "score": 4, "replies": []}, {"body": "VXX exists.  SVXY exists.  UVXY exists.", "score": 2, "replies": []}]}]}, {"body": "To hold.  It used to be gold.  Lately precious metals do not work to hedge.", "score": 2, "replies": []}, {"body": "In short, no.\n\nVXX and UVXY are intended to be used for very short time frames as they will 'decay' over time due to roll yield (for VIX and VIX related ETP wonks, I recognize that's an oversimplification).\n\nBasically \"Long VIX\" ETPs have a target duration and have to regularly roll futures to maintain that duration.  With VIX usually in contango, that means they are selling cheaper near term futures to buy longer term more expensive futures.  Buy selling low and buying high regularly, you lose over time.  \n\nIn backwardation the process is actually reversed and you 'gain' from this structure but that is not the norm for VIX.", "score": 2, "replies": []}, {"body": "UVXY / VXX", "score": 4, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "xlkdlf", "created_utc": 1663898537.0, "score": 21, "upvote_ratio": 0.9, "num_comments": 23, "comments": [{"body": "Listen here you bourgeoisie pig. That's our sauce. We picked the tomaters, we run the squeeze machines. Your time is up. You will not win the sauce war.", "score": 17, "replies": [{"body": "How bout you listen here you greedy sauce gobbler.  The shit ain't free, it cost real money,  we don't factor in sauce in our margins at all, so every time you want to indulge in 1 package of sauce per nugget just remember it's gonna cost you in other places you don't expect", "score": 6, "replies": [{"body": "I’m willing to cut back on many things due to inflation but I draw the line at sauce, sir.  No!  I will not go quietly into the sauceless night nor even the less saucy night.", "score": 4, "replies": []}, {"body": "*Sauce Goblin if you please! Throw some respek on that name. Do you know how hard it is to keep a straight face when asking for horsey sauce with my damn coffee?\nIt’s a fuckin ART, my mane.", "score": 1, "replies": []}]}]}, {"body": "Sauce? or ban.", "score": 8, "replies": [{"body": "Did you not read the title?  I'm a highly ranked Wendy's Employee", "score": 5, "replies": [{"body": "Ok, I'll have 3 sachets of ketchup and 2 of mustard.", "score": 3, "replies": []}]}]}, {"body": "ok but what about my 4 for $4", "score": 6, "replies": [{"body": "Yeah, what about his 4 for $4?", "score": 3, "replies": []}]}, {"body": "yeah ill have a baconator and some tendies", "score": 4, "replies": []}, {"body": "If a man does not have sauce, then he is lost. But the same man can get lost in the sauce.", "score": 5, "replies": []}, {"body": "Sir, this is a hedge fund.", "score": 5, "replies": []}, {"body": "Inflation is really hitting me where it hurts, my oatmeal went up in cost by 22% in the last 2 months", "score": 2, "replies": []}, {"body": "Post has paragraphs...must be smart. IM ALL IN.", "score": 2, "replies": []}, {"body": "Fuck you im not payin .25$", "score": 2, "replies": []}, {"body": "Real money’s out back behind the dumpster. I’ve met some swell dudes.", "score": 1, "replies": []}, {"body": "Lol 😆😂 honest question....do you feel Cathie wood is capable of managing a wendys?", "score": 1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|3 months ago\n**Total Comments**|30|**Previous DD**|\n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xlkdlf)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xlkdlf)\n    \nHey /u/WashingtonRefugee, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Extra sauces condiments are no longer free since the pandemic but are showing up at Amazon.", "score": 1, "replies": []}, {"body": "I want that fucking sauce. You should be accounting for that shit in your margins. It ain't shrink. \n\nGive me that sauce!", "score": 1, "replies": []}, {"body": "It makes sense! No free lunch but free sauce is a thing! At Costco, we have free pickles, onions, ketchup and 2 types of mustard! They even have inflation protected pizza and hot dogs!", "score": 1, "replies": []}, {"body": "This post gives sweet n’ sour an extra bit of yummyness.", "score": 1, "replies": []}]}
{"title": "Raytheon (RTX) has won a $985 million Pentagon contract to develop prototypes for hypersonic attack cruise missiles", "selftext": "The Pentagon on Thursday said it awarded Raytheon Technologies (RTX.N) a $985 million dollar contract to develop prototypes for a hypersonic attack cruise missile, putting the firm well ahead of rivals in the race to become lead developer of the strategic weapons.\n\nRaytheon beat out Boeing (BA.N) and Lockheed Martin (LMT.N) to continue its development of the weapon. The award is a significant advance in the development of hypersonic weapons for the United States, and puts Raytheon in an early lead for a series of related, and high-value, contract awards in the years ahead.\n\nHypersonic weapons travel in the upper atmosphere at speeds of about 6,200 km per hour (3,853 mph), more than five times the speed of sound.\n\nThe hypersonic attack cruise missile (HACM) is an air launched hypersonic weapon being developed in cooperation with the Australian government.\n\n\"With advanced threats emerging around the globe, the Hypersonic Attack Cruise Missile will provide our warfighters a much-needed capability,\" said Wes Kremer, president of Raytheon Missiles & Defense.\n\nThe Air Force expects delivery in fiscal 2027.\n\nThe United States and China are engaged in an arms race to develop the most lethal hypersonic weapons, a top Air Force official acknowledged late last year, as Beijing and Washington build and test more and more of the high-speed next-generation arms.\n\nSource: [https://www.reuters.com/business/aerospace-defense/raytheon-wins-985-mln-pentagon-hypersonic-weapon-contract-source-2022-09-22/](https://www.reuters.com/business/aerospace-defense/raytheon-wins-985-mln-pentagon-hypersonic-weapon-contract-source-2022-09-22/)\n\nRaytheon (RTX) has won a $985 million Pentagon contract to develop prototypes for hypersonic attack cruise missiles. RTX is currently trading at $81.96 (-1.79%). Do you think we might see a bounce in RTX off this news?", "id": "xlywi7", "created_utc": 1663942808.0, "score": 22, "upvote_ratio": 0.82, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|288|**First Seen In WSB**|4 months ago\n**Total Comments**|88|**Previous DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xlywi7)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xlywi7)", "score": 1, "replies": []}, {"body": "Our taxes wouldn’t go up if everyone just hugged each other.", "score": 9, "replies": [{"body": "Fuck you man, I’m not hugging you.", "score": 1, "replies": [{"body": "Enjoy your taxes going up", "score": 1, "replies": [{"body": "You're paying yourself if you're invested.", "score": 1, "replies": []}]}]}, {"body": "I mean you joke but the way I see it the happiest day of my life will be when I no longer make money on my DoD stocks.", "score": 1, "replies": []}]}, {"body": "You sure it's not billions? Because a cruise missile costs millions already", "score": 10, "replies": [{"body": "This is a development contract, not a production order contract", "score": 7, "replies": [{"body": "Omg... I'm in the wrong business, that's just for R&D? Holy shit", "score": 8, "replies": [{"body": "You’re definitely in the wrong business but hypersonic missiles are some of the most difficult things to make. Just about a decade ago people didn’t even think it was possible", "score": 6, "replies": []}]}]}]}, {"body": "And every navy ship became obsolete with the invention of the hypersonic cruise missile, just send one of these bad boys up in the air and watch them go sinkity sink sink", "score": 5, "replies": [{"body": "I wouldn't say each, but yeah. Larger ships are now a waste of money for sure.\n\nThe goal now should be to produce missile frigates, destroyers, and subs.", "score": 1, "replies": []}]}, {"body": "Dark pool money and classified spending doesn’t boost stock price. Sorry kiddo.", "score": 4, "replies": []}, {"body": "good, but it will be four years before even the start of production", "score": 3, "replies": []}, {"body": "Calls on military-industrial complex.", "score": 3, "replies": []}, {"body": "Already priced in bro 😎", "score": 2, "replies": []}, {"body": "MIC go brrrrrr", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "The danger of hypersonic weapons is an overhyped fraud from the military-industrial complex\n\nhttps://www.youtube.com/watch?v=fTEhG8zzftQ&t=691s", "score": 1, "replies": []}, {"body": "I don't really understand the hate against Raytheon.", "score": 1, "replies": []}]}
{"title": "My biggest day yet 💰🤑 (TSLA & SPY) *TONIGHT HOOKERS R ON ME!!!", "selftext": "", "id": "xm6uqc", "created_utc": 1663961411.0, "score": 70, "upvote_ratio": 0.87, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|13|**First Seen In WSB**|5 months ago\n**Total Comments**|50|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xm6uqc)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xm6uqc)", "score": 1, "replies": []}, {"body": "This has isnpired me to go balls deep(life savings) on spy puts", "score": 14, "replies": [{"body": "o7", "score": 8, "replies": []}, {"body": "positions or ban?", "score": 2, "replies": []}]}, {"body": "What is that? Puts?", "score": 8, "replies": [{"body": "yessir swung overnight", "score": 8, "replies": [{"body": "You pimp you, congratulations 🎊 👏", "score": 6, "replies": []}, {"body": "Fuck you, and congrats", "score": 5, "replies": []}, {"body": "I was looking at the $370 puts for $87, and it turned into $400ish", "score": 2, "replies": []}, {"body": "position?", "score": 1, "replies": []}]}]}, {"body": "The second picture is so much less impressive than the first lol", "score": 5, "replies": [{"body": "it’s impressive when u know that i started trading with 7k n now this is only 17%", "score": 4, "replies": [{"body": "how did you get started what kind of strategy did you use, I'm in a similar starting position", "score": 1, "replies": []}]}]}, {"body": "Don’t forget the blow", "score": 5, "replies": []}, {"body": "Hey bro you got a dollar for a broke mf?", "score": 6, "replies": [{"body": "i got hookers if that works", "score": 10, "replies": [{"body": "I can be a hooker too for a dollar /s\n\nEnjoy your money King and don't spend it on Monday 😂💵", "score": 4, "replies": []}]}]}, {"body": "Fuck you and congratulations!", "score": 3, "replies": []}, {"body": "Congrats!", "score": 3, "replies": []}, {"body": "Gg enjoy the weekend", "score": 3, "replies": []}, {"body": "Lets roll", "score": 3, "replies": []}, {"body": "What do you want me to wear?", "score": 3, "replies": [{"body": "pink skirt with nothing underneath", "score": 1, "replies": []}]}, {"body": "Congrats bro!", "score": 2, "replies": []}, {"body": "Hi I’m here for the gangbang …", "score": 2, "replies": []}, {"body": "Paper trading account", "score": 1, "replies": []}, {"body": "I expect more out of a million dollar account", "score": 0, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "How much did  you make?\nHow much were you contracts and how much did you sell them for?", "score": 1, "replies": [{"body": "everything’s in the pic brother, put in 25k combined and made 192k in profits", "score": 4, "replies": []}]}, {"body": "bro printed money for like a month and disappeared, must have got raided by the feds.![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}
