{"title": "March 16 2020, The Day the Dow Fell 3,000 | As it happened with Market Moving Events.", "selftext": "", "id": "xh5luf", "created_utc": 1663470986.0, "score": 79, "upvote_ratio": 0.94, "num_comments": 23, "comments": [{"body": "That’s right, and you know what else happened that day. Congress was briefed on the severity of Covid.", "score": 11, "replies": []}, {"body": "so many on here seem to get off on bad news.....", "score": 9, "replies": []}, {"body": "This was fascinating I want to see more of it.\n\nI'm not looking for loss porn as much as days/events of importance + your commentary.", "score": 3, "replies": [{"body": "What just the time lapses? I download the ones for full days during covid. I’m trying to get tickerTape for other cool days such as the bottom and some of the crazy rally days in April.\n\nYou have to manually contact ICE for the raw tape which is 6h:45(6GB) which has to be compressed down. You can only directly download the most recently completed trading day directly, if it’s past you have to contact NYSE for an archive", "score": 1, "replies": []}]}, {"body": "I put this up as people right now are panicking about the selling seen on the US equity market now. This right here is panic. We've had some bad days, but the selling has been orderly. We are not in a dire situation, and for better or worse the market is not panicking.", "score": 5, "replies": [{"body": ">but the selling has been orderly.\n\nlol I still rather have a quick 30% drop than a slow one that last months.\n\nQuick pain is better than slow pain.", "score": 4, "replies": [{"body": "True, but this allows you to quantitatively ease yourself out of the drops with leverage", "score": 1, "replies": []}]}, {"body": "One of the best days to buy lol", "score": 2, "replies": [{"body": "Considering the market would continue to sell off another 1500 the following day…", "score": 6, "replies": [{"body": "I didn’t say the best, I said one of the best", "score": 3, "replies": [{"body": "Reddit is cruel if you don’t pick the exact valley or peek your an idiot", "score": 6, "replies": [{"body": "I didn’t mean it like that, if you’re in for the long haul, bottom fishing is not a reliable strategy. “Time in the market beats timing the market”", "score": 2, "replies": [{"body": "I just need my 0dte options to work once and I’ll be set for life", "score": 1, "replies": []}]}, {"body": "IKR stating the facts and got downvoted", "score": 1, "replies": []}]}]}]}]}, {"body": "Yet", "score": 1, "replies": []}]}, {"body": "I was 100% cash just waiting.  I did miss the huge runup sept19-jan of 20,  but we were in euphoria mode and no way was I buying it.  Hardest part for me was trying to hold on the upside after april 2020.", "score": 2, "replies": [{"body": "You and many others, if you recall in June 2020 after the 10% pullback people are on CNBC saying that a revisit to the lowest was likely. As well as put premium up until early July implied that there was a greater probability of revisiting the lows than not.", "score": 5, "replies": []}]}, {"body": "So is everyone just holding cash for the turn around? 🤔.  I think they are pricing in the 1.00 raise", "score": 0, "replies": []}, {"body": "It was just starting of covid.This was the best time to buy some stocks which are worth good amount in 2022.For more tips [https://stockxpo.com/](https://stockxpo.com/)", "score": 1, "replies": []}, {"body": "Funny story, I work on wallstreet and started coughing during this day. My boss told me not to go home because it’ll look bad as the market was collapsing. Turns out I had covid.\n\nI sat outside the offices of a c-suite executive and he got covid from me.\n\nFun times.", "score": 1, "replies": []}, {"body": "What’s moving the market? Right now it’s inflation. We’ve been down trending since Powell spoke. Inflation reported higher than expected YoY and was 3x higher than expected MoM, we’re now going to price in a 1% interest rate hike which is highly likely at this point, provided the Feds still want to front load inflation, which they do. This means that we’re going to have a recession, people will lose jobs, people will lose houses, it’s an unfortunate consequence. The more insane thing is that it’s going to be on a global level due to every country having done the same thing, print money to avoid a Depression, which still isn’t out of the question, provided the Feds want that 2% goal…..  BigBoyBets_bbb on TikTok, i make calls on the market, made $5k last week, had a 45% profit day on my account in a single day. Only been doing this for 14 weeks, have put huhdreds of hours into studying and also learning some economics and what influences the market. I made my predictions days before the moves, could be worth checking out :) Good luck traders, this is your “once in a lifetime” moment.\n\nFU Sleepy Joe, we’re in a Recession, it’s just a matter of time before you guys can’t lie about it anymore", "score": 1, "replies": []}]}
{"title": "Ray Dalio's co-chief rang the alarm on inflation, recession, and a global financial bubble this week. Here are the 10 best quotes.", "selftext": "* Greg Jensen warned the Fed's rate hikes could spark a market downturn and a deep recession.\n* The Bridgewater Associates boss predicted stubborn inflation, slower growth, and weaker earnings.\n* Jensen said the US is at the center of a global financial bubble that may be about to burst.\n\nInvestors are delusional if they think the Federal Reserve can vanquish inflation without tanking asset prices and plunging the US economy into a major recession, Bridgewater Associates' Greg Jensen has warned.\n\nThe co-chief investor of Ray Dalio's hedge fund predicted stubborn price increases, slowing growth, and a decline in corporate earnings, speaking at the SALT hedge fund conference in New York this week.\n\nHe also said the US is at the heart of a global financial bubble, argued the pandemic has permanently transformed the world, and highlighted regions and markets where he sees bargains.\n\n# Here are Jensen's 10 best quotes, lightly edited for length and clarity:\n\n1. \"The biggest mistake priced into markets right now is the belief that we're going to return to pricing similar to pre-COVID. That inflation is expected to come down to a little under 3% over the next 18 months or so, and that will happen without much of a recession.\"\n\n2. \"The markets aren't pricing in how constrained policymakers are — how impossible it will be to have the markets' expected combination of reasonably good earnings growth and low inflation.\"\n\n3. \"It's a mistake to think things can revert to normal, that we've had the drawdown, and the worst is behind us. We're still in the early phase of dealing with a radically different world than pre-COVID.\" (Jensen highlighted examples of what's changed: less globalization, a shrinking role for financial markets, and more government influence.)\n\n4. \"You're going to have inflation staying stubbornly higher than markets are expecting, as growth starts to turn down. That's when it gets really tricky, and that's what's going to create the more risky part of the downturn — when it becomes clear that earnings are falling, and rates are still rising.\"\n\n5. \"The downturn feels big, but asset prices are still quite high by historical standards. The decline is quite small, relative to the change in the underlying fundamental conditions. There's a lot more to come, and it'll get scary when everybody thinks it's not a temporary blip, but a more permanent phenomenon. That's when the bottom will start to come in.\"\n\n6. \"The recession will probably be longer, more grinding than a crash. It's not easy to say if it will be three years or one year, but the magnitude of it is likely to be large and difficult.\"\n\n7. \"There's a decent chance that the market isn't going to react to the European crisis until it's deeply upon us, which I think will be in the next couple months.\" (Jensen was referring to Russia's invasion of Ukraine driving up food and energy prices, eroding economic growth, and heaping political and fiscal pressure on European governments.)\n\n8. \"The worst thing for the US is it's priced to be the greatest economy going forward, and not to have major problems. The US is the center of a financial bubble, and it's the most at risk from liquidity being pulled.\" (Jensen noted that assets that don't generate cash flows to support their valuations — such as cryptocurrencies — are most at risk of declining when the Fed hikes interest rates and reduces the money supply.)\n\n9. \"Bear markets can go on for a long time. You can be in Japan and you can have a 25-year bear market. You have to know that's a possibility, and you have to prepare for that now.\"\n\n10. \"There are places in the world that are having very different cycles than the US, UK, and Europe. It's difficult in a tightening world of rising risk premiums and declining liquidity, but there are areas that look relatively attractive.\" (Jensen pointed to parts of Latin America, and commodities that haven't received sufficient investment and are less growth sensitive than other assets.)", "id": "xhd7uj", "created_utc": 1663497142.0, "score": 18, "upvote_ratio": 0.76, "num_comments": 21, "comments": [{"body": "Same guy who said China was a better investment than the US in 2020?\n\nhttps://www.marketwatch.com/story/ray-dalio-chinas-ascension-u-s-challenges-pose-a-very-special-moment-for-global-market-shift-11605377679", "score": 3, "replies": [{"body": "Yes same guy that operates the world’s  largest hedge fund with consistent alpha over the market’s benchmark. \n\nIf you think you’re being smart by saying he got one call wrong you have no idea how trading works.\n\nTrading is managing risk and making money even when your thesis is wrong. What you are trying to pass off as a flaw is actually a strength.", "score": 11, "replies": [{"body": "What’s his mutual fund’s ticker?", "score": 2, "replies": []}, {"body": "Don’t be a sucker. He’s talking his book.", "score": 2, "replies": []}]}, {"body": "This guy and Charlie Munger must be morons. /s", "score": 0, "replies": []}]}, {"body": "I think there is a large misunderstanding of the history of the US of A. Greed and chutzpah will continue to grow the American markets as they always have been. And most notable, US is not Japan so even referencing that is ridiculous.", "score": 0, "replies": [{"body": "US resembles 1980s Japan in a lot of ways.\n\nThe US is bankrupt in a high interest rate environment. Our investments have been frivolous and wasteful. Our people are stupid, sick and obese. We depend on cheap oil to function. Honestly we're worse than 1980s Japan.", "score": 1, "replies": [{"body": "Let’s see how it plays out. That will answer it. My point however is that it’s not constraints that define the outcome, its ingenuity and resolve to take on big challenges. \nAnd by the way we aren’t stupid.  If you think that, you too need to read up on history.", "score": 0, "replies": []}]}]}, {"body": "So...what's the actual \"most attractive\" alternative to US Stock Markets and the US dollar?\n\nThere really isn't one.\n\nHe'll- there isn't even a distant 2nd place right now.\n\nChina? Lol. Europe? Lol. Japan? UK?  \n\nGet outta here, daddio.", "score": 1, "replies": [{"body": "Did you read? It literally says what he thinks in the next sentence...", "score": 1, "replies": [{"body": "\"Parts of\" Latin America? Who is this guy even kidding?\n\nLatin America doesn't have the basic size necessary to be the most attractive market out there. Among other factors.\n\nIn the words of Happy Gilmore: The Price is Wrong, (Bob Barker)!", "score": 1, "replies": [{"body": "Never heard of development? I wouldn't doubt it if Latin-America is the next market. Look at China 40 years ago. They barely had the infrastructure to support themselves back then. Now look at them. Yeah they are going through their economic shit but so is the rest of the world.\n\nAll \"next\" markets are never big enough when they first start out. That's why people invest in them to make them bigger, and get rich in the process because of the explosive growth that inevitably happens because of it. Whether they stay growing like China or go belly up like El-salvador is up to a number of factors but the fact is that Latin America probably is the next market, why wouldn't they be? I'd trust this guy over anyone here on Reddit, that's for damn sure.", "score": 1, "replies": [{"body": "I mean - I love Latin America - but the countries are way too politically unstable. And they're tiny markets other than Brazil and Mexico. You know what I mean - they're not a unified market. They're 20 separate, similar markets. \n\n(There is no real \"next best market\" besides Europe or pretty much China...as gross as that really is, and I wouldn't really invest directly in China - I would invest in American stocks that do business in China, like Costco or Apple, etc. I would look for a US stock that is expanding into China - that's what Peter Lynch would do. )", "score": 1, "replies": [{"body": "Ah fair enough, you may be right about Latin America. But Europe? As an *emerging* market? (Or next best, whatever) Idk man I'd say they are older than the U.S markets lol. I don't see how they could be good markets to invest in. When the bubble pops, they will be just like America only without the threat of a large military and the Euro instead of the dollar. They are going to feel the pain *WAY* more than anyone else. \n\nAnd China... unfortunately you're right, that's where the smart money is going, if we are being honest. And that may be what does America in. China's money investing in America and American money investing in China. Except China uses their investments and take that profit home to China and Americans take their profits and invest in China too.", "score": 2, "replies": [{"body": "Yeah. Colombia is one of the most attractive Latin America countries right now - and they just barely are out of a 50 Year Civil War. Lol. Yikes! My friend bought a farm there recently. \n\nWe sold ourselves into debt to China and called it a Trade War so people would \"feel cool\" while we were surrendering Trade. Lol that's Capitalism, baby.\n\nEurope doesn't really have tons of natural resources. So that's an issue for them. The Unification of Europe seems like it's still a good thing - and still early. 20 years or so is still pretty new. In the grand scheme of things- it's barely economically integrated after 20 years - compared to America.", "score": 1, "replies": []}]}]}, {"body": "As someone who works in freight can confirm Lat Am might be good to look at. A lot of companies started moving their supply chains there when the trump tariffs were going on with China. Wouldn’t be surprised if the US gov’t is talking to companies behind closed doors about doing this more and more as all of our supply chains being in East Asia is a major national security risk if we are becoming more hostile with China.", "score": 1, "replies": [{"body": "That's what I figured. The division between East and West is definitely widening and its going to be a cold war style of battle where we are going to see who can last and who crumbles in the decade or two, if we don't get into an actual World War 3 first. China is partnering with Russia and the Middle East more as far as trade goes and we are definitely looking to expand which countries we extort or use for our trading partners as well.", "score": 1, "replies": [{"body": "Also why once this recession is over, I would go HEAVY into any kind of renewables. If China is partnering with the Middle East the US is going to have to develop better and better EVs, to the point they are efficient enough for war. I’m not necessarily saying there will be a war, but for national security reasons they need that to be something China can’t just turn off the fuel for.", "score": 1, "replies": []}]}]}, {"body": "I live in Brazil and I’d say it’s a great time to invest here, but not for the reasons you’re imagining. I don’t think we’ll see growth explosion, but rather normal growth coupled by a market that is already very cheap. If you know how to choose great companies at great prices you gonna do well in this market.", "score": 1, "replies": []}]}, {"body": "Spoken like someone who has never been outside a resort in Latin America. Bruv, I assure you, there are places where standard of living and wealth is way higher than average usa.", "score": 1, "replies": [{"body": "Yeah- everyone knows there's small pockets of rich people everywhere. That has nothing to do with whether a country is a good investment. There's small pockets of rich people in Russia, and Moscow is like New York or Paris.\n\nLatin America doesn't have the political stability necessary for major investments. It doesn't have the infrastructure to attract big companies. It doesn't have lots of engineers for manufacturing or innovation economies and it doesn't have big consumer markets besides Mexico and Brazil. \n\nBrazilian GDP is smaller than Italy.  There's 150 million more people in Brazil than Italy. \n\nLatin America is all lovely. It just doesn't have those things that investors require for investment. It's slightly more organized than Africa and has possibly more natural resources than Southeast Asia- but it's also located far away from most manufacturing markets.\n\nArgentina is 1 million Square miles - it's the 8th largest country in the world by land and it can't stay solvent. The interest rate is 75%? And they've nationalized oil companies - like they basically stole assets from Chevron within the past decade.\n\nBrazil is on the brink of an auto-coup by Bolsonaro. \n\nMexico is nearly corrupted by cartels.\n\nColombia just had a 50 year Civil War. \n\nChile just crushed a Dictatorship within recent memory. Chile has the Highest per capita GDP in Latin America or South America- it's 60th in the world.\n\nAll the biggest markets of Latin America are within an eyelash of political instability or nationalization- and that's what keeps Public US Corporate investors away.\n\nhttps://www.visualcapitalist.com/wp-content/uploads/2022/02/trading-partners-1990.html", "score": 1, "replies": []}]}]}]}]}]}
{"title": "March 9, 2009: WJS Article Day of the Bottom", "selftext": "JUST HOW LOW can stocks go?\n\nDespite Friday's small gain, the Dow Jones Industrial Average marked its fourth consecutive week of losses as it tumbled through the 7000-point mark and spiraled to new 12-year lows. The Standard & Poor's 500-stock index is trading below 700 for the first time since 1996.\n\nAs earnings estimates are ratcheted down and hopes for a quick economic fix fade, the once-inconceivable notion of returning to Dow 5000 or S&P 500 at 500 looks a little less far-fetched.\n\nA decline to 500 on the S&P is 183.38 points and 27% away. The index already has lost 881.77 points, or 56%, since its peak in October 2007. The index, which lost 7% last week, hasn't been below 500 since 1995, when the tech-stock bubble was just beginning. After dropping 6.2% last week, the Dow is 1626.94 points and 25% above 5000, a level it also hasn't seen since 1995.\n\nAnalysts and investors looking at valuations, history and stock-price trends are mostly predicting the indexes will avoid plumbing those lows, although all concede that, in this market, anything is possible.\n\nEven Wall Street strategists are crunching the numbers, while sticking to forecasts of a second-half rally.\n\nGoldman Sachs's David Kostin in late February presented three scenarios for the S&P, including a \"bear case\" that put the index at 400 to 500. Although Mr. Kostin says he doesn't anticipate the index will fall that low, \"these are the cases that different types of investors are making,\" he says.\n\nLooking solely at valuations, namely price relative to earnings estimates, the S&P at 500 isn't necessarily a wild stretch.\n\nThe current 2009 earnings estimate for S&P companies is about $64 a share, down from about $113 last April, according to S&P. Goldman is now predicting $40, having cut its forecast from $53 in late February. Bank of America Merrill Lynch estimates $46 a share, and Citigroup is predicting $51. At $64, the S&P is trading at about 11 times earnings. At $40, the index is at about 17 times. \n\nA level of 500 on the S&P is \"possible, but I wouldn't put it in the realm of probable,\" says Thomas Lee, chief U.S. equity strategist at J.P. Morgan. Mr. Lee on March 2 removed a tentative \"buy\" recommendation he had placed on the S&P in February.\n\nMr. Lee sees a tentative bottom for stocks in mid-2009, together with a trough in the economy. From there, he is still \"really comfortable\" with the prospect of the S&P heading toward 1100 by year end.\n\nThere's a good chance the market could keep going lower,\" says Bill Strazzullo, chief market strategist at Bell Curve Trading.\n\nHis firm's targets are 500 on the S&P and 5500 on the Dow, using charts of buying and selling trends. A small bounce may come around 650 for the S&P as short sellers take profits around that level, Mr. Strazzullo says. Long-term buyers have also been \"active\" at about those levels and may help push prices higher temporarily, he says.\n\n\"Some people may say that is the bottom, but I think there is another leg to go on this,\" Mr. Strazzullo says. \"That last leg will probably be the general public throwing in the towel.\"", "id": "xhfati", "created_utc": 1663503888.0, "score": 46, "upvote_ratio": 0.9, "num_comments": 21, "comments": [{"body": "\"Some people may say this is the bottom, but I think there is another leg to go on this\" \n-Mr. Strazzullo, at the exact bottom", "score": 24, "replies": []}, {"body": "If I'm remembering correctly, I think when the market bottomed, the intra-day low on the S&P500 was 666.", "score": 18, "replies": [{"body": "666.79 yep", "score": 11, "replies": [{"body": "That's wicked", "score": 5, "replies": []}]}, {"body": "A Plunge protection team set it at 666.", "score": 7, "replies": []}]}, {"body": "a 12-year low would put SPY at $110. If spy hits $110 im selling my kidney and taking the biggest loan possible to buy as much as possible.", "score": 35, "replies": [{"body": "As much as I despise bottom  fishing, I can't disagree with", "score": 9, "replies": []}]}, {"body": "I like how this article puts the 2008-2009 declines into perspective using time. I see so many posts now claiming the bottom is in but only citing percentage declines and not time. Right now, the S&P 500 is at the same level it was  roughly a year and a half ago. While that certainly represents a big decline, it pales in comparison to reaching 12-year lows like we did in March of 2009.", "score": 44, "replies": [{"body": "In 2009 there was genuine concern that the whole banking sector was going to go under.  There was a “second wave” of foreclosures that most of the “smart” people were sure was right around the corner.  I remember friends asking me if the stock market could reach zero, and the consensus response was “yes.”\n\nDo not compare today’s fed taper tantrum 2.0 to 2008.", "score": 19, "replies": [{"body": "The whole banking sector may have (and still might) had they not turned on and kept on quantitative easing.  Initially it ran up to $2 trillion, then $4 trillion and now it's at $9 trillion.     \n\nIt seems like the monetary policy from the 2008 (QE) will never be able to end, that the life support (balance sheet) will never be able to be turned off.  And that this has a direct impact on all markets.", "score": 8, "replies": []}]}, {"body": "Only during the brief period following the collapse of Lehman. 1 year later the S&P was back within 10-20% of all time highs. 2009 was pure panic selling, the worse time in history to sell, and \"experts\" were calling for more 20-30% drops.", "score": 10, "replies": []}]}, {"body": "The Dow was in the 6000s.  After 12 years of quantitative easing it peaked at 37,000 and sits ~31,000 now (even after falling from peak).  The s&P was in the 600s and is now ~3,900.  \n\nThat's 5-6x in roughly a decade.  So if inflation is catching up now, that would mean a $1 can of soda in 2009 would be $5-$6 now and imo unless the liquidity is removed from the system it will be.  \n\nHere is an overlay of quantitative easing (the Fed balance sheet) and the S&P:  \nhttps://www.currentmarketvaluation.com/posts/2021/07/Fed-Balance-Sheet-vs-SP500.php", "score": 10, "replies": [{"body": "So not really correlated, you're saying", "score": -1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "A 2 year old could see the balance sheet was flat from 2014 to 2020 yet stocks rocketed. A 2 year old could tell you the balance sheet was flat, then quickly spiked, 2010 to 2014 yet stocks climbed at the same rate throughout. Two lines that both end higher is not a correlation. \n\nI guess I'm just better at math than you are.", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Cool article.  Look at the earnings revisions for the S&P - good context for comparisons to the current market.  2020 and 2008 feel relatable, but right now feels more 2000 ish.", "score": 5, "replies": []}, {"body": "Perfect example of how no one can predict the stock market. Best we can do is make theoretical assumptions off past performance and even then it's still hit or miss.", "score": 5, "replies": []}, {"body": "Tom Lee of Fundstradt, then JP Morgan chief strategist, making a bull call in dark times. \n\nThe more things change, the more they stay the same?", "score": 10, "replies": []}, {"body": "The bottom is when fed wants to reduce the interest rates. Fed decides the trend", "score": 1, "replies": []}]}
{"title": "Thoughts on MRVL? (Marvell Technology)", "selftext": "Semis are in a rough spot right now, Nvidia especially is struggling but so is the rest of the market. I like MRVL for the growth potential and with a PE ratio of 23 at the moment I feel they are priced relatively fairly compared to the rest of the semiconductor market. \n\nI don’t see them talked about much on here so I was just curious what other people thought about them. I do have a small position (10 shares) I want to keep adding over the next few years.", "id": "xhj66q", "created_utc": 1663513817.0, "score": 23, "upvote_ratio": 0.85, "num_comments": 23, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "It's highly dependent on the tesseract", "score": 21, "replies": []}, {"body": "Marvell is positioned at the front of 5G with stellar management. They do it all: augmented and virtual reality,  wearable tech, data integration, drones, cloud services and robotics.\n\nThey have- so far- remained under the radar. I think it's a ten-bagger.", "score": 4, "replies": []}, {"body": "I never see them mentioned either. Have a small position, I mainly started to invest in them because they're an American semiconductor business. It was either them or tsmc but with the stuff they're going through I wasn't biting.", "score": 4, "replies": [{"body": "Yeah I think them being an American company is super important. TSMC is an amazing company but the Taiwan/China stuff just makes me very wary.", "score": 3, "replies": []}, {"body": "They have different business models. \n\nTSMC is a third party manufacturor that take designs from their customers and produce customer's product to spec. \n\nMarvell is more of a traditional semiconductor company.", "score": 3, "replies": []}]}, {"body": "Don't know too much about it but my investment broker bought me about 30 shares of it", "score": 3, "replies": [{"body": "MRVL is a (Hold) on the Zacks Rank, with a VGM Score of B. Additionally, the company could be a top pick for growth investors. MRVL has a Growth Style Score of B, forecasting year-over-year earnings growth of 41.4% for the current fiscal year.", "score": 1, "replies": []}]}, {"body": "NVdA is in a “price discovery phase”. Gauging it against SMH and SPY daily to see where it deviates for 5 or more days. I think that could be a possible bottom.", "score": 2, "replies": [{"body": "I've started buying pretty heavily added a decent chunk Fri in that premarket low.", "score": 2, "replies": []}]}, {"body": "Fwiw Cramer hypes this stock up like every other week lol", "score": 2, "replies": []}, {"body": "We could convince enough people to buy MRVL stock right before a massive Marvel movie release…", "score": 2, "replies": [{"body": "MRVL sits at a Zacks Rank 3 (Hold), holds a Growth Style Score of B, and has a VGM Score of B. Earnings and sales are forecasted to increase 48.4% and 38.8% year-over-year, respectively. 11 analysts revised their earnings estimate upwards in the last 60 days for fiscal 2023.", "score": 1, "replies": []}]}, {"body": "ride to $80", "score": 1, "replies": []}, {"body": "I'm not a regular on here, but I'll add my 2 cents.  \n\nMarvell was the first wifi chip used IN Apple phones. They hit a niche market nobody wants. They've perfected they next chip for AI \n\nI say, watch for them to hit big with iPhone, ipads tablets et.  Everything AI .  \n\nIt's only a matter of time.", "score": 1, "replies": [{"body": "I’ve been accumulating for the past year.", "score": 1, "replies": []}]}, {"body": "I’ve heard Jim Cramer, one of the best traders in the world, talk a lot about Marvell, he says he likes the stock and company..  \n\nHaving said that, I don’t understand the company too well like I can understand Appl, AMD, or even a qualcum..", "score": -2, "replies": []}, {"body": "They are an overvalued company in my opinion.  They have been supporting their subsidiaries like QLogic,  Aquantia and the rest.  Now if one of them breaks out and adds a significant amount of revenue to the pot then they have a good shot at going higher", "score": 1, "replies": []}]}
{"title": "i have a noob question about CSPs and using them to dca in more efficiently during a bear market raher than just market buying the stock", "selftext": "Say i want to sell the 18th november $9 put for MPW, costing $0.33 (MPW is a reit i already own and want to buy more of). MPW trades at around $13 rn, why is it cheaper to buy the $9 strike than say the $12 strike? Wouldn’t that just mean you are unlikely to get assigned and you just collect the premium and the option expires worthless? What i’m asking is, is writing cash secured puts that are way below current price extremely risky or what?", "id": "xhhxcn", "created_utc": 1663510828.0, "score": 12, "upvote_ratio": 0.78, "num_comments": 20, "comments": [{"body": "The farther out of the money, the cheaper the price of the option, because (naturally) the probability of an option expiring in the money drops the further the strike gets from the current price.\n\nAs a seller, further out of the money is arguably 'safer\" because it's less likely to end up being assigned, but you have to weigh that against the smaller premiums--at some point, it's not worth collecting just a few pennies to take on even a small amount of risk.", "score": 20, "replies": [{"body": "good reply, ty", "score": 2, "replies": []}]}, {"body": "Writing cash secured puts below the current market price is less risky than at the money or in the money. You will receive less premium the further OTM you sell, because the probability of that option expiring in the money is lower. \n\nSell cash secured puts can be a great way to DCA into stocks if you have the cash to do it. \n\nHere’s an example: let’s say stock XYZ currently trades at $10 and you think that’s a bargain of a price. So you sell a $10p expiring in 4 months and receive $2 in premium. In 4 months if the stock is at or below $10, you now have to buy that stock for $10. But actually, because you received $2 in premium, your cost basis is $8. So if the stock is now at $9, you only paid $8, even though it never touched $8. If the stock is above $10, you don’t get to own the shares (bummer), but you made $2/($10-$2) = 25% on your collateral in 4 months. So essentially you agreed contractually to buy the stock at the current price 4 months from now, but you were paid to have a lower cost basis and a 25% margin of safety just in case the market continued to fall. \n\nThis is the same strategy I use to open positions. Just fyi it works best when the stock price is close to fair than not.", "score": 10, "replies": [{"body": "ty for the in depth reply", "score": 2, "replies": [{"body": "Yes that’s a perfect answer.  I’m currently in a position where I sold a CSP on generac (GNRC) at 195 strike and collected $500 in premium.  GNRC is currently at $200 a share, when I sold the put GNRC was at $230 so if I were to BTC I’d lose around $800 just because the underlying has dropped so much since I opened the short position.  It expires 10/21, so if I get assigned it’s like I purchased 100 shares at $190, which I wouldn’t be to upset about.  So my cost basis would be $19,000.", "score": 3, "replies": [{"body": "and if you don’t get assigned you can still buy the shares assuming they are still trading at $200, while pocketing the premium. Nice", "score": 3, "replies": []}]}]}]}, {"body": "No, they are less risky, therefore there is less reward for selling them.\n\nConversely, if you are buying, far out of the money are more risky, therefore cheaper than strikes nearer the money.", "score": 3, "replies": [{"body": "ty sir", "score": 1, "replies": [{"body": "It's worth remembering the tail risk with selling options.  What if MPW opens at $9 tomorrow and keeps dropping all week?", "score": 2, "replies": [{"body": "Then it looks like we'll be holding for a while.\n\nThe general idea is don't sell puts unless you really want to own the underlying. Again, not financial advice, and I'm sure there are exceptions.", "score": 1, "replies": []}]}]}]}, {"body": "MPW is a good buy at this price. I would prob just buy in a little at a time right now rather than take a small premium and end up without more stock.", "score": 3, "replies": [{"body": "this is also a good point", "score": 1, "replies": []}]}, {"body": "If it's at $13 right now why do you think selling a $9 CSP is more risky then a $12 CSP", "score": 1, "replies": [{"body": "the issue is i don’t think that at all, that’s why i thought it might be risky, cause i might not fully understand CSP’s if i don’t think it’s risky", "score": 1, "replies": [{"body": "Think of a CSP as an obligation to purchase the stock at a predetermined price and date. If you sold a CSP at 9 there is less chance of you having to buy it then 12, hence the reason you collect less of a premium.....but if in the option time frame the stock goes to $5 your still paying 9 or 12 or whatever minus the premium you collected. Google wheeling. It sounds like that's what you want to do to increase your position.", "score": 2, "replies": []}]}]}, {"body": "If your ultimate goal is to own the stock then you focus on the strike. It's a balance of how soon do you want it vs where you'd like to buy in at. Farther OTM is obviously better but you can be writing multiple puts and maybe never get assigned if the stock rallies.", "score": 1, "replies": [{"body": "true, i only chose a $9 strike cause it was a lot cheaper", "score": 1, "replies": [{"body": "If you believe in the company's long term prospects then <$9 is a great price to buy in at but if it never dips that far you won't be assigned and the low premium isn't much of a consolation prize either. \n\nIf you have the funds you can do a latter of strikes, at $11/10/9 to DCA, which should give you some shares, a decent cost basis, and premiums for the farther strikes that don't hit. Just be prepared for them all to hit.", "score": 2, "replies": []}]}]}, {"body": "Straddles", "score": 1, "replies": []}]}
{"title": "The market is crashing, so Inverse me because I'm tripping", "selftext": "you heard it here first folks, market crash  is coming hard, and fast. almost like a gme type of exhilarating ride. you can believe me, last time i was on this trip, It was just before GME tanked  after having held steady for who knows how long in the $300 range.  it's consolidating they said, its, they ran out of shorts they said,  just hodl. and and on  and on \n\nSo  market close on Friday was bullish, so strong, and because of that clear cut indication.  the sheer amount of glee for the sudden reversal that was so in quad witching hour is undoubtedly the greediness of the pigs, that they deserve to be slaughtered. but its those who have faith that can rejoice, for their wager, might be what pays for the bills.\n\nSo inverse me who unversed wsb.  Spy ATH Guaranteeed! \n\n&#x200B;\n\nTLDR: Stonks only go up.  and all money is fake anyway.  \n\n1 385P 9/19 exp", "id": "xh5r0a", "created_utc": 1663471414.0, "score": 15, "upvote_ratio": 0.7, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|540|**Previous DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xh5r0a)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xh5r0a)\n    \nHey /u/01Aleph, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "[position proof](https://imgur.com/gallery/JnEEtNo)", "score": 1, "replies": []}]}, {"body": "Friday was short gamma. Pain coming.", "score": 7, "replies": [{"body": "Yes indeed! But for who? We will find out! Hang on tight cuz this ride is just starting. ![img](emote|t5_2th52|4641)", "score": 4, "replies": []}, {"body": "How do you know it was a short gamma?", "score": 2, "replies": []}, {"body": "Care to elaborate?", "score": 1, "replies": []}]}, {"body": "U just want WSB to inverse you because that would then make your position the “inverse WSB position” and then you would win big. Nah fuck that, I can see through your mind games OP. Not gunna work on me", "score": 7, "replies": []}, {"body": "Calls on ornamental gourds", "score": 6, "replies": [{"body": "OH MY GOURD! ![img](emote|t5_2th52|18630)", "score": 1, "replies": []}]}, {"body": "Aight buying calls", "score": 2, "replies": [{"body": "There we go! Rejoice!  ![img](emote|t5_2th52|8882)", "score": 1, "replies": [{"body": "The broken are the more evolved?", "score": 1, "replies": []}]}]}, {"body": "Smoke some more, you doing good!!!", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4270) I’m trying my best", "score": 2, "replies": []}]}, {"body": "Gme is headed far lower, now fear is rampant and cash liquidity crisis\n\nPuts indeed for the win 🏆", "score": 1, "replies": []}, {"body": "\\>1 385P 9/19 exp  \nwhat does this mean tho", "score": 1, "replies": [{"body": "A spy Put at 385 that expires 19th sep", "score": 6, "replies": [{"body": "Why wouldn’t he want a 22 expiry lol", "score": 2, "replies": [{"body": "More lucrative if he's right.", "score": 1, "replies": []}]}]}]}, {"body": "Look at this fucking hot take.", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4271)About as hot as this trip.  ![img](emote|t5_2th52|4267)", "score": 1, "replies": []}]}]}
{"title": "In a Bear market maybe we pivot? Do regards get smarter? Even some Apes learn after 10-20 mistakes. 5-10% of years is a bear market, you cant trade like its 2020/2021. You want to buy puts or low float stocks that are profitable?", "selftext": "I know a ton of you “Regards” don’t want to hear it. Easy money, quick money is not going to be the same anymore. 2020/2021 was the Black Swan event.\n\nFree money everywhere\n\nCasinos closed\n\n.125% Fed runds rate\n\n0 commission free trading\n\n……\n\nNow Fed funds is set to be near 4% or higher by years end. 4% in just 1 year! I know, Apes cant comprehend. But basically, in a nut shell your company that is losing money can not borrow money in this environment and will be forced to shaft you!\n\nYOUR COMPANY THAT MAKES 0 MONEY WILL SHAFT YOU!!!\n\nThis is because they can no longer get a loan! So do the “Regards” keep buying memes of companies that are a disaster? Or do they pivot before they get shafted?\n\nAs I said above 2020/2021 was a different animal. You have to know when to hold them and when to fold them!\n\nThe SP500 is trading at 17x earnings, earnings will be going down… Here are 5 companies with a PE ratio under 5! They have good financials, less than 200 million shares.\n\nThey pay you dividends, buyback shares or make acquisitions to grow there business. NOT SHAFT YOU!\n\nThe stock market is a popularity contest, despite what you heard, but fear and bad companies shafting you means pivot!\n\nZIM – PE Ratio under 1! Will give you 30% of earnings 2023 in the form of dividends\n\nTX – PE Ratio of near 2, metals maker, they make cash! They have the power to pay of all debt and give dividends or buyback\n\nONEW- PE Ratio near 3, They keep buying competitors the financials are very strong!\n\nANDE – PE Ratio near 7, check our their earnings last 4 quarters. They make cash! Strong financials\n\nBXC – PE Ratio near 2. This 600 million market cap company announced a 100 million buyback. They are a builder, down because of interest rates!\n\nThe reason you look at these companies in a bear market because you don’t need to pray other Apes, Regards, boost your stock! These companies make cash themselves, stay in business and can buy back shares or pay dividends, they don’t need retail to bid up the stock so they can shaft them next.\n\nI rather buy BXC with 9.3 million shares outstanding.. and not care if its short… Did we see HKD ? Those fly because no shares available. You want companies that can fend for themselves. These 5 companies do not have shares available. It does not need a short squeeze. It will squeeze when people wake up!", "id": "xho6dk", "created_utc": 1663525712.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|25|**First Seen In WSB**|1 year ago\n**Total Comments**|2790|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xho6dk)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xho6dk)", "score": 1, "replies": []}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}, {"body": "Zim is currently trading at Cash Value", "score": 5, "replies": [{"body": "They actually have 6+ billion cash and about 2 billion debt.\nThey are trading for less than cash at the moment", "score": 1, "replies": [{"body": "Current Cash Value is $27.54 / Share", "score": 1, "replies": [{"body": "Not sure where they get that from\nCurrent total assets is 11.5 billion\nTotal debt 4.5 billion\n\nCash and receivables are about 6 billion\nShort term liabilities is about 2 billion leaving 4 billion\n\n120 million shares. It is about 36..\nJust saying\n\nI have been trading since I turned 14 in 1994\n\nI do have Zim avg about 46", "score": 1, "replies": []}]}]}]}, {"body": "Op's a guy who says GME is worthless, I would be cautious of what stocks he's pumping.\n\nWere earnings a bit shitty, yes. Worthless? Damn no. Only hedgies call GME worthless", "score": 4, "replies": [{"body": "Lol\nGme is worth about 600-750 million or 2 dollars a share\n\nWhere it traded at when it was profitable in the year 2018!\nThey used to give dividends too!\n\nNow they shaft retail\nGood luck", "score": -1, "replies": []}]}, {"body": "Lol zim", "score": 2, "replies": [{"body": "quiet gir", "score": 1, "replies": []}]}, {"body": "This post just put me in a state of depression.", "score": 2, "replies": [{"body": "It is tough my friend, but we can watch all our tendies burn up in smoke or find other ways to tendie town", "score": 1, "replies": [{"body": "I just want things to go back to how they were. Waaah!!", "score": 2, "replies": []}]}]}, {"body": "Can we assume that this is financial advice?", "score": 2, "replies": [{"body": "Lol, every post is trying to give people some ideas.\nI am buying shares of cash cows or puts on high fliers.\n\nYou can consider it your entertainment. It is what I am doing", "score": 2, "replies": [{"body": "I see the opposite. I see a warning not to invest money in most", "score": 3, "replies": [{"body": "Agreed 💯\nIf you are going to buy stocks, at least buy something very profitable.\n\nI'm doing puts but I do have Zim, trade ande and tx often", "score": 3, "replies": []}]}]}]}, {"body": "You might want to check out how those companies performed during the last recession", "score": 1, "replies": [{"body": "We haven't had a recession since 2008...", "score": 0, "replies": []}]}]}
{"title": "The recession is not canceled", "selftext": "", "id": "xhqwwe", "created_utc": 1663532328.0, "score": 343, "upvote_ratio": 0.95, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|109|**First Seen In WSB**|3 months ago\n**Total Comments**|67|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xhqwwe)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xhqwwe)", "score": 1, "replies": []}, {"body": "JPow said the recession is a floater.", "score": 16, "replies": [{"body": "Reminds me of that gas bloated dead whale video.", "score": 4, "replies": [{"body": "More like a turd that won’t go away.", "score": 3, "replies": [{"body": "Oh one of those floaters..", "score": 3, "replies": []}]}]}]}, {"body": "Old fucks can’t even print to PDF, or in Yellen’s case, handle OPSEC of material while in public,  but they’re going to save the economy.", "score": 11, "replies": [{"body": "lmao", "score": 1, "replies": []}]}, {"body": "The recession said something bad on twitter cancel it!!!", "score": 5, "replies": [{"body": "Dig through the old tweets, see if the recession said something wrong in 2008", "score": 8, "replies": [{"body": "Dude this guy on Twitter says recession hurts minorities. And recession did not even denyit!!!! Cancel the recession!!", "score": 3, "replies": []}]}]}, {"body": "Remember when when inflation was 4% YOY and unemployment was 4%. All this could have been avoided with moderate rate hikes. But they didn't do that why? Because they are trying to inflate away our debt?", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|19738)", "score": 3, "replies": [{"body": "Perfection lol", "score": 1, "replies": []}]}, {"body": "I am hearing it from the admin too! so i guess inverse it and get the put's profit.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Call 1-800-GME", "score": 3, "replies": []}, {"body": "Call???\n\nIf you want goes for it and any call is good so i will be happier with my put.", "score": 1, "replies": []}]}]}, {"body": "Lol 😂😆\nNow we have to be ready, what will we do about it", "score": 1, "replies": []}, {"body": "Just spit out my sangria, fuck haha", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4641)", "score": 1, "replies": []}]}
{"title": "Stock chart history disappearing", "selftext": "i know i remember seeing amazon over 1k on charts and tesla near 800-1k during the pandemic but now when i go through chart history neither have even been over 650$ what’s going on.", "id": "xhqzlt", "created_utc": 1663532507.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous DD**|\n**Account Age**|2 weeks|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xhqzlt)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xhqzlt)", "score": 1, "replies": []}, {"body": "Please don’t trade", "score": 30, "replies": []}, {"body": "Must be Mandela Effect  homie....  \n\n&#x200B;\n\nShhhh... dont tell him", "score": 20, "replies": []}, {"body": "You're not gonna believe this, but GME was over $300 once and the government covered that up too.", "score": 15, "replies": []}, {"body": "Covid brain fog bro…never happened", "score": 14, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 6, "replies": []}, {"body": "Whose gonna tell him", "score": 9, "replies": [{"body": "Not me.", "score": 3, "replies": []}]}, {"body": "Lol", "score": 6, "replies": []}, {"body": "Yes I know I wasn't the only one who thought this either. Also have bigfoot in my closet!", "score": 3, "replies": []}, {"body": "Most likely split-adjusted...", "score": 8, "replies": [{"body": "This isn't the place to answer questions.  You fell for the troll", "score": 15, "replies": []}, {"body": "This….", "score": 4, "replies": []}]}, {"body": "I've noticed this too. And also, they changed the Bearenstein Bears to the Bearenstain Bears. And they took Curious George's tail off too. Shits fuqqed", "score": 1, "replies": []}, {"body": "2 weeks old accounts with critically no knowledge should not be allowed to post. Duh.", "score": 1, "replies": []}, {"body": "Are you living under a rock?", "score": 1, "replies": []}, {"body": "He’s definitely one of us.", "score": 1, "replies": []}, {"body": "The miracle of stock splits", "score": 1, "replies": []}, {"body": "Stock splits bud", "score": 1, "replies": []}, {"body": "Qanon strikes again!  They cant help but meddle", "score": 1, "replies": []}, {"body": "Omg you’re right! How has no one noticed before ![img](emote|t5_2th52|4887)", "score": 1, "replies": []}, {"body": "Nobody tell him", "score": 1, "replies": []}, {"body": "All in bby to the moon regard![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}
{"title": "AAPL - Disproportionately large volume 9/16/2022", "selftext": "Friday's close saw the 4th largest trade since at least 2011.  Maybe longer.  (Maybe forever?).  \n\nA few stats on that trade:\n\n\\-44M shares. \n\n\\-$6.6B \n\n\\-361x average size. \n\n\\-Largest trade since 12/17/2021  \n\nI have no read other than to say that the next move, whichever way it goes, is likely to be strong and lasting.  Institutional volume like this is extremely rare.  \n\nFurther - cumulative AH volume, which is often institutional positioning for the next session, was the 6th largest in history.  57M shares ($8.6B) changed hands between 4pm and 8pm that day.\n\nI have no position.\n\nhttps://preview.redd.it/yx08nz55goo91.png?width=1365&format=png&auto=webp&s=f1b4b093e6e56195334439cf414e2b10d37f0680", "id": "xhr7qs", "created_utc": 1663533062.0, "score": 7, "upvote_ratio": 0.64, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 month ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xhr7qs)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xhr7qs)", "score": 1, "replies": []}, {"body": "Is there any chance this was APple buying back stocks?   I am pretty sure they still have a lot of money set aside for stock but backs and with the new tax laws coming up seems like a good time to buy.", "score": 5, "replies": [{"body": "Always a chance.  No way to know.  🙂", "score": 3, "replies": []}]}, {"body": "Quad witching", "score": 2, "replies": []}, {"body": "What does this mean or what do y’all take away from this?", "score": 3, "replies": [{"body": "Disproportionately large volume tends to lead to disproportionately large moves.  \n\nInstitutions are positioned here.  It's an important pivot, so use this level as a guidepost.  \n\n\nRisk can be defined against this region once price starts to move.\n\nBullish above, bearish below.", "score": 8, "replies": [{"body": "Ok so depending on how the stock moves this week it is a good indicator to how it’s going to trade for awhile? Or am I wrong on that.", "score": 5, "replies": [{"body": "Correct.\n\nOf course, new information arrives all the time.   What works today may not work tomorrow, which is why it's important to continue to watch what institutions are doing.  They can push price almost at-will, for any reason at any time.  \n\nFor example:  TSLA may react differently Monday (now that OPEX is behind us) than it will on Wednesday when the FOMC news is released.  Or maybe not.\n\nThat's why watching these institutional block trades is so useful/important.", "score": 3, "replies": [{"body": "Basically, it could go up, but it also could go down.", "score": 7, "replies": []}, {"body": "Thank you for your advice I really appreciate it. One more question and I’m sorry for pestering you but where can I monitor institutional block trades? Thanks again for your advice as a young kid trying to learn you don’t know how much this means to kids like me.", "score": 3, "replies": [{"body": "[volumeleaders.com](https://volumeleaders.com) tracks all of this information. You can create an account and follow along.", "score": 3, "replies": [{"body": "Thank you.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Bearish long term", "score": 2, "replies": []}]}, {"body": "Institutions are now rushing for the exit in appl.", "score": 3, "replies": [{"body": "How do you know they weren’t the ones buying?", "score": 2, "replies": [{"body": "Why would they be buying over inflated equities right now? This is Wall Street we’re talking about not wallstreetbets..", "score": 1, "replies": [{"body": "Why would anyone ever buy over inflated equities? Every time a share is sold, one is also bought. The buyer obviously believes they’re getting the better end of the deal. I’m just asking why the assumption is that institutions are on the sell side just because volume is high?", "score": 1, "replies": []}]}, {"body": "Told you.", "score": 1, "replies": [{"body": "??", "score": 1, "replies": []}]}]}]}, {"body": "I am long $AAPL for over a decade and I think the answer is Warren Buffett. Everyone thought iPhone 14 is going to flop cuz it's almost the same as iPhone 13. So,  \nTesla (TSLA) loses infamous ‘most shorted stock’ title to Apple (AAPL)  \nAAPL share price becomes really cheap. Later to discover iPhone 14 is awesome with satellite connection:  \nApple picks Globalstar for emergency satellite service on iPhone 14  \nShorts are going to get a wedgie aka squeeze. imo", "score": -2, "replies": []}, {"body": "Got yourself a nice picture of a cup and handle right there", "score": 1, "replies": []}, {"body": "Warren dumping?", "score": 1, "replies": [{"body": "There's no way to know who traded here.  These trades are anonymous, just as ours are.\n\nBut it doesn't matter \"who\" and it doesn't matter \"why.\"  It only matters that somebody with very deep pockets chose this specific area to open or close a position of great size.  That information can be useful, especially when coupled with other forms of analysis that might be able to corroborate a specific thesis.", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit Inc. has banned Seeking Alpha articles sitewide.\n\nTo get around this, please repost your comment/thread with the link removed, and the relevant parts of the article copy and pasted. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "it’s interesting, another one of your posts showed tesla having the 2nd biggest trade ever on friday. something to the tune of 22.4 million shares, $6.8 billion if im remembering correctly? fascinating stuff, would anyone with some understanding care to provide any explanation?", "score": 1, "replies": [{"body": "23.6M @ $304 is what I see for Friday at 1600EST", "score": 1, "replies": []}]}, {"body": "All I remember is Cramer said AAPL was going down.... ie the largest short in the market rn. \n\nYou know what that means.", "score": 1, "replies": []}]}
