{"title": "Stock Market Crash is irrelevant to Reddit users?", "selftext": "[deleted]", "id": "9n7h94", "created_utc": 1539239296.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 10, "comments": [{"body": "What is the underlying meaning of the question??  You expected stories on your local news about Reddit users jumping out of windows in Manhattan??", "score": 2, "replies": [{"body": "I could jump out of my window but I live on the ground floor :(", "score": 3, "replies": [{"body": "hahaha. What happened to your stocks?? Or did some cunt walk out on you??", "score": 1, "replies": []}]}, {"body": "I'm just surprised that I could not immediately find some discussion on this topic.   Plus I admit I did have a few drinks.  I usually don't care much about a crash, but this one has my spidey senses tingling.   Is it the big one?", "score": 1, "replies": [{"body": "I think it's mainly the tariffs on China and China's response has people spooked.  Maybe an excuse for a \"market correction\". Doubt if it's \"the big one\" just yet. Maybe late 2019--2020 things could get more serious.  Don't stop drinking though. I highly recommend it.  Bourbon is good for the Winter months my friend.", "score": 2, "replies": [{"body": "Yes, I was also thinking about the blackout period for corporate share buybacks timed into this, and also the 3.2% 10 year treasuries causing big sales of stock.   \n\nI am thinking the robot traders will be reset tonight and take advantage of huge AAPL tailwinds and the coming earnings reports season,   \n\nMy feeling on the China tariffs is that it is nothing significant.   Trump merely needs to be seen \"fighting\" and that is good enough,  The actual outcome will all be a wash.", "score": 1, "replies": [{"body": "The Trump tariffs aren't going to be \"a wash\" if he enforces them it will take a shave off GDP, maybe not a \"big\" one, but it will take away some economic growth.  It depends on if he follows through.  It's a major \"walk back\" if he doesn't and trump is not good at admitting he's wrong on ANYTHING", "score": 1, "replies": [{"body": "Yes, but who knows if anything will really play out for any amount of significant time.   I feel that it is posturing and bravado.   You know already that Trump can never be wrong about anything - you have to buy into that.   Even when he is wrong he is right, and hey - he is probably the only president to not start a war -  so far :).  It's the fight that counts here  - not the result.  The result is already decided.   It's just a show.     I feel the real story is the low volume trading for a decade, and the blackout period, and the raising of interest rates, and the lack of quantitative easing next year.", "score": 1, "replies": [{"body": "yeah, trump is amazing. Great points. You have a deep vision, same as trump", "score": 2, "replies": []}]}]}, {"body": "Dialog Semiconductor - AAPL just did some deal and that stock is up right now,   Its a ray of hope and worthy of attention.  AAPL is making money faster than can be believed right now - and they haven't even released the \"flagship for the rest of us\" iPhone XR model yet!   More addictive than tobacco!  Smartphones!", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Are we close to the big crash?", "selftext": "Alot of people are calling red flags about a market crash in the near future maybe in a couple of years. When do you think it will happen and why?\n\nI know nobody can see the future but I'm searching for indicators that possible could tell where we're heading and at what pace.", "id": "9n7uvt", "created_utc": 1539243692.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 17, "comments": [{"body": "In 2008-2009 the Dow literally collapsed to half it’s all time high value. Do you think it’s going to fall to 13500 anytime soon?", "score": 3, "replies": []}, {"body": "I think that this is just a correction for so many days going up. Yes, at the moment it seems scary, but the reasoning behind the last recession was due to many people and company’s doing dumb things. Hold your stocks if you feel like you can survive without the money you have invested for six months or so and we should start seeing the economy finally reach 27,000 on DOW. \n\nSide note: these elections can also have an impact on the economy. Personally, I think that if a bunch of Democrats get voted in then we will see a big dip in the economy. If trump gets the people he wants into office, then the economy can continue to rise like it was doing. \n\nEnjoy the ride. ", "score": 9, "replies": [{"body": "It would make sense, buts it’s been looked at a lot, and there’s no correlation between political party and market\n\nIt’s not like Clinton and Obama were bad for the market", "score": 1, "replies": [{"body": "Uhhh, yes they were...", "score": -12, "replies": [{"body": "No they weren’t \n\nhttps://m.benzinga.com/article/8659827?utm_referrer=https%3A%2F%2Fwww.google.com%2F", "score": 8, "replies": []}]}]}, {"body": "And that boost in the economy associate with Trump is based off of? Investor sentiment or any actual policies that he's enacted?", "score": 1, "replies": [{"body": "Both. ", "score": 8, "replies": []}]}]}, {"body": "Actually in 2013 (under Obama) the S&P 500 had a return 32+%, in 1996 (under Clinton) it returned 31+%.   It took almost 2 years under Trump's presidency to get to around 31%.\n\n\nHave look [here.](https://www.macrotrends.net/2482/sp500-performance-by-president)\n\n\nYou will notice the returns have been more favorable under the democratics.\n\n", "score": 7, "replies": [{"body": "When will people realize the markets and fed act independently of sitting presidents? JFC", "score": 7, "replies": [{"body": "Is this why the markets took off the day after Trump was elected? Was that just a coincidence?\n\nNo. It had to do with the sweet, sweet tax breaks the market knew was coming under a Republican-controlled unified government. Who was sitting in the White House mattered very much to the markets. \n\nArguing otherwise is stupid.\n\n(This comes from a person that hates Trump and the Republicans from the very core of my being.)", "score": 8, "replies": [{"body": "maybe for a short term bump or drop yes.....but the fed deciding QE was good back in 08 and below market interest rates set the stage for this next recession. Which will have nothing to do with a president's policy.  ", "score": 1, "replies": [{"body": "1. Define short term? Define \"bump\"? Going up and staying up 30% in a year or two is a big deal. Also, if you don't think corporate tax rates affect the market, you're just so wrong I don't even want to argue about it.\n2. Presidents select the chairman of the Fed and can also remove them \"for cause,\" an unexplained and highly abusable provision. So their policies are not unrelated to who controls the executive branch (and maybe the Senate, in cases of impeachment).\n3. Recessions are cyclical and happen eventually anyway. It sounds like you just hate the idea of the Fed, is my guess.", "score": 1, "replies": []}]}]}, {"body": "They do operate independently.  But do their policies and decisions effect the market.  Yes.\n\n\nYou would have to be a complete moron to say that when Trump announced tarrifs that it had no impact on the market.  \n\n\nIn fact if some companies have been exempt from the applied tarrifs, because if they hadn't it would cost them more to make the product.  Which would show up in quarterly earnings.\n\n", "score": 5, "replies": []}, {"body": "That would be true if the sitting president didn't put in place tax cuts and tariffs.", "score": 1, "replies": []}]}]}, {"body": "From the look of it, tomorrow.  Why?  Because people are greedy short sided trolls. ", "score": 1, "replies": []}, {"body": "Yes, 2020 is my prediction. If I had to pick a month I'd say... February. Why? Because that's what my tinfoil hat told me. I know usually it's supposed to prevent voices in your head, but in my case it tells me the future. ", "score": 1, "replies": []}, {"body": "Be on the watch for 2019, specifically October. ", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "9n5eg1", "created_utc": 1539220065.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 10, "comments": [{"body": "Ok so I didn't realize I would write an essay on Salesforce at 7:30am, but I got on a roll and  here we are 20 minutes later.. hope this helps.\n\nHere's what I know, and a lot of it is from personal experience using them or attending events by them.\n\n* They're taking the market share for other CRM, ERP, systems and pretty much anything else you need to run a company of any type. Think Oracle, for example, who has been stagnant in the market and with news.\n* They buy up companies and integrate their tech constantly. \n* They just bought up a 40 story building in NYC for more offices. \n* Once you buy into their ecosystem, it's a one stop shop and you never need to leave - in fact having to leave would be such a pain, you're probably a customer for life. \n* They churn account managers yearly who push for you to buy things before their term is up because that's their paycheck, so account growth is constant. \n* they charge a ton for their services because they work and once you're in their ecosystem, you need to either use what they have, find another ISV, or build it yourself - which is great because you can indeed go around them but still benefit from the Salesforce platform. The startup cost to get you hooked is actually free btw.\n* they offer free training for admins and developers to learn their Apex code and ecosystem. In fact, a concern I hear from customers constantly is that there aren't enough Salesforce developers (probably why the training is free)\n* They support companies with free \"Ignite\" sessions to help you with issues or help you develop something innovative. \n* They have a yearly event called Dreamforce that shuts down San Francisco for a week and they have to get a cruise ship every year to act as a hotel in the harbor because the event is so popular it fills up every single hotel in the city and around it. \n* They're more than just a CRM company, which is why I bought so many shares last year. You want something that you can code once and have it work on all devices while pulling data from your CRM? Done. They bought Heroku. You want to manage inside and outside sales people and plan delivery routes using data from your CRM? Done - get MapAnything and install it into your Salesforce instance. Erp system? Done. Ascent. Marketing ? Done. Marketing cloud or Pardot. Service and sales? Done. Sales cloud. You want to build a custom website with no coding experience and essentially pennies per license for named users and gated content from your CRM? Done - use their built in Communities. Want to deliver e-learning and track all results with data in your CRM? Done. Use Appinium's LearnTrac/ViewTrac products. \n* What I'm saying is, their ability to make ridiculous tech stacks already exists and companies are flocking to Salesforce because of it. Theres still huge potential for growth from new customers and existing customers. Red Cross just hopped on recently and that is a HUGE win for Salesforce. Developers are also flocking to Salesforce app exchange to build apps or API connectors they can offer to have their platforms sync with your Salesforce database.\n\n\nThe company is fresh, fairly new, branded well, and is growing in so many ways, I see it growing consistently for years to come. Mark Benioff has a laid back, can do and will do attitude, which really helps considering its San Fran founding. The guy grew up in Hawaii so he passes along a lot of that laid back chill mentality to his company. I genuinely have a lot of fun at Dreamforce and I can see why people like working there. Hell, I'd love a job there.\n\nTldr; buy and hold.", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don't see anyone really as a near equal at this point given all that stuff I posted above. I honestly see site makers like SquareSpace, Shopify, and Wix as the next big competitors for Salesforce. Salesforce has the potential to do everything those 3 companies do, but they need a simpler way to do it that won't need a programmer while leaving the option for programmers to get their hands dirty.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You know.. my experience with them is.. meh. Their internal teams do not communicate so you end up with duplicate products or broken functionalities. I tried to get Captivate and Connect for my company and it was a hassle. It was like I was dealing with 2 different companies when working with their sales teams.  \n\nTheir core products are a part of life if you do any of that work and the subscription service definitely helps their bottom line.. they're definitely trying with the Marketing Cloud/Pardot style products, but again, they just seem disjointed. There's not a solid company goal I can identify, it's just \"let's see what sticks\" and I don't like it as a consumer using their products.  I'm worried to adopt anything that's not a core product because it just disappears one day from your Creative Cloud app. \n\nI wouldn't consider them a Salesforce competitor until til they have a solid path and vision.", "score": 1, "replies": []}]}]}]}, {"body": "You had me at \"they bought heroku\"", "score": 2, "replies": [{"body": "Username checks out.", "score": 1, "replies": []}]}, {"body": "Despite all these 'advantages', they are still priced at in excess of 100X earnings.\n\nUsually such 'advantages' would translate into higher profits.  If such 'advantages' are actually useful for investors.\n\nIt may or may not be good technology, but if they can't turn such into shareholder  (owner) returns, then what's the point?", "score": 1, "replies": [{"body": "In my opinion, they're in a growth phase and all these acquisitions and strategies will come to fruition as they have been piece by piece. Their market share as a CRM is overtaking all the dinosaurs like Oracle. The talk among my business professionals at other companies is that they believe they're going to switch to Salesforce in the near future. One just did actually - Aptim, another massive company born from CB&I. They're just getting their toes wet with the platform. I think the SF stock price is going to be driven up by speculation on the strong values and programs they have. They're like $V for me.", "score": 1, "replies": []}]}]}, {"body": "For me, I try to play on the safer side with tech stocks and buy companies that have been able to keep competition away for several years (ex: AAPL, MSFT, ADBE). I don’t see CRM holding onto any cloud computing edge longer than a few years (at most). Short-term (<2-5 years) it may be a winner, but I’m personally passing on it. Personally I’m eyeballing MTCH, biggest online dating platform and its profitable. ", "score": 5, "replies": []}, {"body": "I might go in personally if it continues to dip. I have a number of years under my belt working with Salesforce. Sure there are many CRMs out there but their product is the gold standard when it comes to business CRMs although it costs ALOT. They are focusing heavily on AI and building/have a very strong ecosystem/suite of products. I don't see them going away anytime soon but anything can happen, as usual take what I say with a grain of salt. \n\n&#x200B;", "score": 4, "replies": []}, {"body": "Could be a decent $5-$10B company at 20X earnings.  Definitely not 'worth' $100B+.  \n\nSeverely overvalued.  ", "score": 2, "replies": []}]}
{"title": "Trading up? MSFT for AAPL.", "selftext": "Since the market is down currently, would it make sense to trade two shares of Microsoft for one share of Apple? If I had the money I would buy Apple straight up but sadly do not. Would this be a bad idea?", "id": "9n7ds7", "created_utc": 1539238213.0, "score": 25, "upvote_ratio": 0.68, "num_comments": 19, "comments": [{"body": "Apple or pear?\n\nBoth good fruits. Swapping them is not worth for most people.", "score": 54, "replies": []}, {"body": "[deleted]", "score": 37, "replies": [{"body": "Jesus christ is that graphic accurate? I knew advertisement is majority of where facebooks revenue comes from but didn't expect it to be 97%. Seems like they really are pretty fucked with the user growth rate going down.", "score": 6, "replies": [{"body": "It's literally the only way they make money. Everything is free for the consumer end, their only asset is user data and behavior. That's why their stock has been so volatile and they're desperately pushing into media like a Youtube/Netflix/Amazon Prime. The same went with Google before they made android.", "score": 1, "replies": []}]}, {"body": "Novice here, where can I find more revenue diversification charts like this one? It seems incredibly helpful even if it is slightly dated", "score": 3, "replies": []}]}, {"body": "How long have you held MSFT for? If less than one year you will have to pay income tax on any unrealized gain at your marginal ordinary rate. If longer than one year you pay long term capital gains tax on the gain. Why pay the tax - hold on. MSFT is an incredible stock to own which is diversified in many high growth high margin segments. It’s a great long term choice.\nHonestly - forget you even own it. ", "score": 18, "replies": [{"body": "It's 2 shares. At most it would be about $24 in income tax", "score": 3, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "gotcha, that makes more sense", "score": 3, "replies": []}, {"body": "I read it as they own 2 shares of MSFT likely on RH instead of 1 share of Apple. MSFT is about half the price per share so it makes sense. ", "score": 2, "replies": []}]}, {"body": "If the OP only has 2 shares then $24 is a lot to them (and there’s literally no reason to pay tax just because it’s only $24) so please don’t minimize that. ", "score": 4, "replies": []}]}, {"body": "How much is long terms capital gains tax ?", "score": 0, "replies": []}]}, {"body": "Don't trade for apple. ", "score": 8, "replies": []}, {"body": "Thank you all for the replies. I am pretty new to investing so this helps greatly. I will sit and forget MSFT.\n\nSide question: I took a few losses this year and a few wins selling short term. Looking at my monthly sheets it appears I've taken more losses than gains so far for the year. When I hand over the monthly statements to my accountant, I'm guessing they know what to do when it comes to factoring in losses and gains for the year? Sorry if the question is very newb.", "score": 6, "replies": [{"body": "You'll get a tax form from your broker with everything consolidated. You can deduct up to $3000/year of realized losses from your taxes. Realized losses carry forward as well, $3000 is just the max per year. ", "score": 6, "replies": []}, {"body": "Your brokerage should provide you with an annual statement.  You can even upload the whole thing directly into a tax software.", "score": 4, "replies": []}, {"body": "I use an accountant as well.  Just provide the documentation that Robinhood provides and you will be fine.  You'll probably be charged since it's another form to fill out.", "score": 2, "replies": []}]}, {"body": "Keep whatever you're in. Transaction fees and capital gains would kill your gains for the year or years to come. Instead maybe look at brokerages that will let you purchase fractional shares.", "score": 4, "replies": []}, {"body": "I would home on aapl for a bit. It is down but not by much. Msfl is a good sell if you need money but i would just hold on that anyhow. ", "score": 2, "replies": []}, {"body": "Neither, both are still way overvalued.", "score": 2, "replies": []}, {"body": "When China gets mad APPL will pay for it ", "score": 1, "replies": []}]}
{"title": "I'm a little confused on how stock commissions work", "selftext": "If I buy 100 stocks of Microsoft for 100$ ea are the commissions per share or per translation for an online broker like Fidelity or Schwab? Say commissions are 5$ per trade. (Assuming I bought them all at once) I just want to make sure I understand this before I jump into buying stocks and bonds.", "id": "9nd0hp", "created_utc": 1539285692.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "It says per trade. So ideally if using a broker with a trade commission the larger your buy the lower % basis that goes into the commission. \n\nI personally try to keep my basis lower than 1% so if you have a $4.95 trade commission I would buy in lots of at least $500. \n\nAlso the commission is on both the buying and selling side in case you didn’t know. ", "score": 6, "replies": [{"body": "Wouldn’t u need a thousand cause it costs to sell also", "score": 2, "replies": [{"body": "I’m investing not trading so anything I’m buying I wouldn’t be selling for a very long time horizon. \n\nBut if you are trading that % would be determined by the gain or loss of the trade itself. ", "score": 1, "replies": []}]}, {"body": "Thanks for your insight! ", "score": 1, "replies": []}]}, {"body": "Depends on the broker. Some will have say $0.01 per share with a minimum fee and a maximum fee. \n\nFor instance my broker is $0.01 per share or $4.95 (whichever is more) up to a max of $10.95 per trade. \n\nSome brokers say $5 per trade. Which mean that the entire trade (all 100 shares) will have a $5 commission on them, not per share. \n\nRead the fine print. Sometimes if you are buying non board lots which means not in divisions on 100 then there are ECN fees which can add up. ", "score": 2, "replies": [{"body": "Thank you very much for clearing this up for me!", "score": 1, "replies": []}]}, {"body": "You could use Robinhood and not pay for that scam ", "score": 4, "replies": [{"body": "Who would down vote this? If you're just doing simple trades and not complex option strategies, RH is a great alternative. It's free! I would also suggest M1Finance. M1 is free, DRIP and you can buy partial shares too!  ", "score": 2, "replies": []}, {"body": "I'm definitely trying to get into index funds, mutual funds, as well as stocks so for all practical small investor diversification purposes I really do.", "score": 1, "replies": [{"body": "Just about anything you can do with mutual funds, you can do with ETFs! Not to mention they are more liquid and have options available. ", "score": 3, "replies": [{"body": "If that’s your plan then I’d suggest tdameritrade and get commission free etfs as long as you don’t trade the etf within 30 days (I believe) there is no commission on the trade and you get a lot more onsite than Robinhood", "score": 3, "replies": [{"body": "I'm committed to Fidelity should be ok I think tho.", "score": 1, "replies": []}]}, {"body": "I'll try that out thanks!", "score": 1, "replies": []}]}]}]}]}
{"title": "When do you normally make orders for stock?", "selftext": "I'm kinda new to the scene and wondered if it was stupid to make a market order (planning on buying MSFT) after hours - or is it better to wait until, say, around noon when the overreactions to the morning opening are settling down?", "id": "9ndk3g", "created_utc": 1539289335.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 9, "comments": [{"body": "When my dick gets hard", "score": 4, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "Doesn't matter. I do limit orders ", "score": 5, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "1", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I was saying Boo-urns", "score": 1, "replies": []}, {"body": "1s1", "score": 0, "replies": []}]}]}]}]}, {"body": "The stock is going to move a bit up and down all day. No sense trying to time that for such little gains. Just buy at a price you think is reasonable ", "score": 1, "replies": []}, {"body": "Aside from limit's watch it from 9:50 to 10:20 and 2 - 3 to see what daily lows are \n", "score": 1, "replies": []}, {"body": "Never on Monday mornings. Actually, mornings in general have a bullish predisposition. After 3:00pm EST is when I usually look to add. I typically short in the AM. ", "score": 1, "replies": []}]}
{"title": "Dow Jones Sitting at 50 Day MA", "selftext": "[deleted]", "id": "9ndtd8", "created_utc": 1539291095.0, "score": 26, "upvote_ratio": 0.76, "num_comments": 14, "comments": [{"body": "You've got your numbers mixed up somewhere. The 200 day SMA is at 25140, and it closed below that. The 50 day SMA is at 25989, which is crossed yesterday. Are you looking at the 50 week SMA?", "score": 4, "replies": []}, {"body": "What concerns me that this is serious is that the mortgage industry is going crazy again, and it began weeks before anything we are currently seeing. Since August it took more than a 15% hit in new mortgages being issued, and at a 30 year low for number of mortgages being refinanced. That's highly concerning. \n\nThe mortgage index is down 10% even before this tech issue. It's been being hit hard since August. \n\nNot to mention the latest unemployment report showed almost half a million more people forced the take second jobs over this time last year, a mind boggling 5% change from 7.3 million to 7.7 million in just a year. There has also been a massive third of a percent increase in employment over 55, signaling that older people feel increasingly less financially secure and are taking more jobs. \n\nSo it's absolutely not just some emotional overreacting, there is definitely some really bad economic indicators that are driving this as well. \n\nIf the mortgage market is saturated it may cause a significant decrease in sales and prices, and then an increase in defaults as people go underwater on their mortgages. \n\nSomething is not normal. \n\n", "score": 19, "replies": [{"body": "I just took at the first mortgage default rate...it's up this month but it's at a 5 year low...and slightly lower than February. *This* is not the same as 2007/2008; that was speculation-driven.\n\nI do feel some of the selling is emotional—everyone is on edge; a trade war, deficit spending on tax cuts, QT, a white-hot equities market, Fed interest raises —people are looking for a shoe to drop. For me, the worrisome aspect is historically low unemployment and stagnating wages (as you also stated). This is contrary basic supply/demand. \n\nI also wonder about the decline of China's economy, and the effect on T-Bond rates. China has been a regular purchaser of our debt, but with their market being way down this year...how does that impact bond yields if they're not at the auction (which they still might be). Higher bond yields are not good for equities.", "score": 14, "replies": [{"body": "The mortgage issue is very different than 2008. We don't have sub prime mortgages to suddenly crippled the market, but the market for qualified buyers is drying up at a concerning rate. There is a finite number of qualified buyers, and the market has to respond as they become saturated and demand dries up.\n\nDefault rates increased significantly in LA and Chicago, and the default rates in Texas and Florida are also insanely high compared to the northern US, which is extremely worrying as well. Miami is almost twice the average default rateright now. That was where the majority of mortgage fraud happened pre-2008, more than the entire rest of the country combined.\n\nSo that is absolutely the strongest indicator to watch. \n\n", "score": 9, "replies": [{"body": "So are they continually giving out loans to unqualified buyers ..? ", "score": 2, "replies": [{"body": "No, the qualified buyers seem to be drying up because they cant issue sub prime mortgages anymore. \n\nDemand goes down, prices go down, defaults go up.", "score": 1, "replies": [{"body": "Well I mean the future batch of buyers are millienials /recent college grads which have...their ass handed to them by student loans ...how can anyone expect these folks to buy such outrageously priced homes in a rising mortgage interest environment.\n\nSomething has to give. ", "score": 5, "replies": []}]}, {"body": "They're trying but it's a little harder. A friend of mine was offered $250k on a $30,000 salary with 3.5% down I think. She has great credit but could never pay that note and survive. They've relaxed the standards A LOT to keep the party going, I think you can get a federal loan with a credit score in the high 500s.", "score": 1, "replies": []}]}]}]}, {"body": "Lows in mortgage refinance because everyone who could refinance has done so already when rates were lower.\n\nHousing market is much healthier with stronger underwriting and initial down payment requirements.\n\nIt’s a good thing that less mortgages are being written because home values have been increasing and therefore less people are qualified  income wise to buy. It’s a sign of stronger underwriting.\n\nThis was not true 10 years ago where rampant speculation and lax underwriting allowed a vicious cycle of pushing prices up to unsustainable levels.", "score": 1, "replies": []}, {"body": "Some good points, but regarding mortgage activity...bearing in mind that rates are still just beginning to rise off historical lows, should it be a seen as a surprise or even as a problem that refi’s are slowing down? To me this just says that everyone has already taken advantage of low mortgage rates, and fewer people are refi’ing because it simply makes less sense to do so. \n\nSimilarly, the overall housing market appears to be slowing somewhat, but again I would expect that with rates on the rise and I’m not surprised one bit to see home prices begin to soften as a result. \n\nWhat I’m seeing is slower growth, but still growth. Am I wrong not to be concerned about housing as long as there are no increased levels of mortgage delinquencies and/or declining home prices across the broad market?\n\nLast, regarding boomers staying in the workplace longer. I see this as a direct result of their collective reckless behavior leading up to and during the Great Recession. I realize I am making sweeping generalizations here, but this is the generation that maxed out CC’s to buy SUV’s, cashed out the equity in their homes to buy tech stocks or to pay for their kids’ college, fell underwater on their homes and couldn’t stay current on their mortgage payments, and went into bankruptcy. They wiped out their retirement savings in the middle of all that, and now they can’t afford to retire. \n\nI see the boomers’ current situation as a scar left behind by the Great Recession, and not because of any economic headwinds of today. Not to say that there aren’t any, this just isn’t one of them. \n\nThought I would just throw my thoughts out there and I’m curious to hear all of yours’. \n", "score": 1, "replies": []}, {"body": "Default would have to come from loss of income, so even if their home is under water they could still tread water. Our economy would have to take a downturn or increased inflation would need to hit I think to cause the next catastrophe", "score": 1, "replies": []}, {"body": "Tech is just the canary, imo.  Too much easy, VC money.  It goes out as quick as it comes in when shit starts getting tight.", "score": 0, "replies": []}]}, {"body": "The Dow is meaningless.  Don't make market decisions on 30 big companies.  \n\nJPM reports tomorrow.  They could have something great or bad that kills or helps their stock a lot that doesn't have broader market implications and that one stock could decide the fate of the Dow.", "score": 12, "replies": [{"body": "Somewhat. But the Mortgage Index is based on solid numbers and not on speculating. A 10% hit to mortgages significantly before the current downturn is a sign that there were some genuine economic issues that can't be attributed to market emotions.\n\n", "score": 2, "replies": []}]}]}
{"title": "SEC and Tesla support the approval of a settlement", "selftext": "", "id": "9n8t40", "created_utc": 1539254490.0, "score": 32, "upvote_ratio": 0.93, "num_comments": 15, "comments": [{"body": "Settlement secured. \n\nNow please come back to $300 bae 🙏", "score": 9, "replies": [{"body": "Do you think it can hit $300 before the Q3 Numbers and conference call?\n\nI could see back in the $270-$280 range maybe.\n\n(Just asking, I’m on the fence on this one with tech stocks as far down as they are)", "score": 8, "replies": [{"body": "I don't think so personally, unless tech sector recovers. ", "score": 5, "replies": [{"body": "Yea the macro environment isn’t setting Tesla up for a pop on good news. Could all change tho, time will tell.", "score": 5, "replies": [{"body": "> Could all change tho\n\n*This. Is. Teslaaaa.*\n\nChange is basically the only reliable thing about it at this point, lol. For all we know some Elon tweet or god knows what could come out and move it in the other direction. There's no telling where it's gonna go on short time frames.\n\nI'm opposite of the shorts, hoping that it'll recover so that they don't run into more trouble with their debt. Car companies are hard enough as it is.", "score": 2, "replies": []}]}]}]}, {"body": "nasdaq in generall is down. maybe a correction is in the works", "score": 1, "replies": []}]}, {"body": "[Link](https://drive.google.com/file/d/1hu8wUfvZJHcqVM3BBITSD_294BwrctWP/view) for those interested.\n\n  \n\nThis is a good piece of news and removes one aspect of uncertainty.", "score": 0, "replies": [{"body": "What aspect of uncertainty does this remove? I thought it was a given that they would make a joint statement after the judge ordered that they do so. The judge still has to approve it, which is where I think all the uncertainty around this SEC thing was at this point.", "score": 10, "replies": [{"body": "The was an open black swan event possibility.. \n\nGiven Musk’s misguided goad at the SEC in the recent tweet. They (SEC) could have tried to pull out sighting a pattern of behaviour and not submitted a joint statement or not something supportive..\n\nChance of the happening was very low, but still a non-zero possibility.", "score": 5, "replies": []}]}, {"body": "It's not this primarily what causes the volatility around Tesla.\n\n\nThe Volatility is largely based on making no money, if they did that they could weather any other storm that comes their way.\n\n\nThese things with the SEC and musk's firing from the hip style are just things that give more reasons to get out of the stock for investors", "score": 7, "replies": [{"body": "It’s fair to say that finical performance directly influences the current price.\n\nIt doesn’t drive volatility, especially not short term as much as external factors, including SEC situation, tweets etc..\n\nVolatility tends to be the markets reflection of human emotions, be it short-term changes in sentiment or just ‘animal spirits’ to coin a phrase.\n\nTake emotion out and your less likely to see the wild swings.\n\nThis is why you can, and people do make good money on short term swings where you can see the swing is emotional and country to the fundamental reality. (Albeit a persons view of reality.)", "score": 1, "replies": [{"body": "> or just ‘animal spirits’ to coin a phrase.\n\nI don't think you coined that phrase \\^\\^ maybe the better way to say it would be \"to use the idiom\".\n\nEDIT: Whoops, dialect difference!: https://www.collinsdictionary.com/dictionary/english/to-coin-a-phrase", "score": 5, "replies": [{"body": "Yeah, I think that phrase goes back to Keynes in the 1930s. 😃", "score": 2, "replies": []}, {"body": "Wow, thanks. I learn something every day.. didn’t know/had never considered the original meaning of that.\n\nHowever, I use it in the British context of using a cliché.\n\nhttps://www.collinsdictionary.com/dictionary/english/to-coin-a-phrase \n\nIs this not a typical thing to say in the US? With the cliché meaning? \n\nFunny how language can betray ones origin. Recently watched the Unibomer series on Netflix and that was the crux of that investigation too. “Eat your cake and have it too”\n", "score": 1, "replies": [{"body": "Oh, I get it!! It's ironic/cheeky in British English :D like pretending you invented the phrase, when everyone knows you didn't? Or maybe that's not how it feels when you use it that way. In American English, I've only heard the \"to invent a phrase\" meaning. I stand corrected!", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Me today after selling all my Apple 10/12 $230 puts Monday thinking the market was recovering. Little did I know", "selftext": "[deleted]", "id": "9n54n1", "created_utc": 1539217817.0, "score": 73, "upvote_ratio": 0.91, "num_comments": 11, "comments": [{"body": "I sold my amzn 1870 puts yesterday...for a 1k loss", "score": 22, "replies": [{"body": "I feel like I just got kicked in the sack from reading this ", "score": 23, "replies": [{"body": "i woulda rather been kicked in the sack by Ronaldo", "score": 6, "replies": []}]}]}, {"body": "What could have possibly made you think the market was recovering on Monday?", "score": 8, "replies": [{"body": "He's trying to protect his loan , check his post history lol he abandoned his AMZN yolo ", "score": 3, "replies": [{"body": "Yeah lmao you got me fucked up if you think I’m gonna buy in that. I’ll find an entry next week, eying Microsoft and Apple when this mess is done ", "score": 1, "replies": []}]}]}, {"body": "I did the same somehow losing on TQQQ puts this week.  !@@@@@@!!!!", "score": 4, "replies": []}, {"body": "I feel you.  I had BABA and AMD puts - which I sold for a minor profit on Friday.\n\n...", "score": 3, "replies": []}, {"body": "How I feel about my 27$ 10/12 AMD puts. Got cold feet and sold at $26.82 it dipped below 24$ today ", "score": 4, "replies": [{"body": "Same here. Sold at $26. Then tried to get fb puts at $155 but stupid robinhood didn't allow me saying I just sold high volatility puts and can't reuse funds until tomorrow. Now fb at $150 :(", "score": 2, "replies": []}]}]}
{"title": "What are the actual chances for a bear market under Trump", "selftext": "[removed]", "id": "9n58pi", "created_utc": 1539218753.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 14, "comments": [{"body": "Id say 50/50", "score": 16, "replies": []}, {"body": "All in puts, yes.", "score": 8, "replies": []}, {"body": "I am all in. It is not going well.", "score": 4, "replies": []}, {"body": "0 chance. The Fed knows Trump won't agree to QE like Obama. There would be no reason to crash it under him.\n", "score": 1, "replies": []}, {"body": "This post has been vote removed.\n\n___\n\nIf you think this was an error you can vote to restore this thread and punish the volunteer moderators responsible in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "The 6th bankruptcy is always the charm", "score": 1, "replies": []}, {"body": "It's Obama's market now.  It'll be Trumps again soon tho", "score": 1, "replies": [{"body": "Right. Who started the tariffs? ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "With tariffs and trade deals etc I would say he has influence", "score": 14, "replies": [{"body": "He did nominate the current Cuck running the fed reserve", "score": 2, "replies": []}]}]}, {"body": "none. he doesn't mean shit aside from a few bumps.", "score": -1, "replies": []}, {"body": "The Jews want to influence the mid term elections. The market will recover after. ", "score": -2, "replies": [{"body": "edgelord", "score": 2, "replies": []}, {"body": "*wringing hands*", "score": 1, "replies": []}]}]}
{"title": "The Berkshire Hathaway portfolio", "selftext": "How is it up if EVERYTHING in it is red? My puts are doing nothing", "id": "9n605o", "created_utc": 1539225046.0, "score": 5, "upvote_ratio": 0.72, "num_comments": 10, "comments": [{"body": "Papa Buffet is the fucking Oracle you dipshit. Never. Ever. Bet against him. ", "score": 39, "replies": [{"body": "All hail Pappa Buffet the Portfolio Slayer", "score": 8, "replies": []}]}, {"body": "Its portfolio is full of construction, f&b, insurance, and railroad sectors. It’s quite unique and old fashioned compared to a lot of other etf stocks. ", "score": 13, "replies": []}, {"body": "Because when it starts going south he just announces he bought millions more in shares of his top holdings. They rise, his stock rises.", "score": 5, "replies": []}, {"body": "Think of what the market might look like when papa buffet passes away one day....", "score": 5, "replies": [{"body": "Red day for sure.\n\nI wonder how his companies stock will react? ", "score": 1, "replies": [{"body": "I’m curious that as well", "score": 1, "replies": []}]}]}, {"body": "Because people buy it anyway. ", "score": 1, "replies": []}, {"body": "Because people that have shit tons of money are putting their money in it to avoid losing it in other stocks. When the red wave comes, run to papa at Berkshire!", "score": 1, "replies": []}, {"body": "You yolo at the wrong ticker ", "score": 1, "replies": []}]}
{"title": "What are the chances of my 2k 1/19 AMZN calls coming back :/", "selftext": "[removed]", "id": "9n605p", "created_utc": 1539225046.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 10, "comments": [{"body": "Nobody knows my dood. ", "score": 3, "replies": []}, {"body": "Not out of the question with the holidays coming up, no one buys shit in stores these days so I like your chances.", "score": 3, "replies": []}, {"body": "Not impossible but youre gonna bave to just delete RH till then because there will only be pain", "score": 2, "replies": []}, {"body": "There's a 25% chance that AMZN expires above $2000 in the January monthlies. So the chance of you profiting is less than that.", "score": 2, "replies": []}, {"body": "REEEEEEE", "score": 2, "replies": []}, {"body": "U still got plenty of time, my itm calls I bought for earnings are way otm now ", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Bought one and then bought another trying to catch it, don’t really know if I want to go from 66% to 100% in amazon calls", "score": 1, "replies": []}]}, {"body": "That would depend on ER", "score": 1, "replies": []}, {"body": "This post has been vote removed.\n\n___\n\nIf you think this was an error you can vote to restore this thread and punish the volunteer moderators responsible in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}]}
{"title": "I need some stories to make this feel better. My shit story over the last week. Some of you must be raking in tendies off of PUTS.. I've been too afraid to even look anymore", "selftext": "This is an absolute bloodbath. I've stepped away since it started last week, and my account is basically zero now..completely fucking wrecked.. even fucked up so stupidly that I put the remaining cash in my account into $TQQQ hoping for a bounce back this week, looked like it might recover a couple days ago when it closed slightly green, but then the rest of the week came and just dick slapped that last ditch effort.. I haven't even checked RH all week..\n\nNow I'm regretting burying my head and not taking advantage of this fucking massacre and selling whatever is left in my account and switching to PUTS on literally ANYTHING, and I could have made some of my losses back already..\n\nI know there has to be some Autists out there that luckily had some far fetched OCT 19 $AMZN $1800 PUT which seemed completely retarded 2 week ago.. now that fucking dude is getting absolutely paid...\n\nWho of you have made massive tendies profiting off of this market pullback? and do you think it's wise to try and jump in now? this train seems to only be picking up steam.. fucked if I don't try something. Lost $7k, basically all the savings I had set aside to play options with, in the last month and a half.. just one wrong move after the next..", "id": "9n8axd", "created_utc": 1539249257.0, "score": 13, "upvote_ratio": 0.85, "num_comments": 13, "comments": [{"body": "My account was worth $170k before facebook earnings. Then facebook earnings hit, and then amazon earnings caused a selloff. Account went down to $130k USD. \n\nI switched all my share positions to Jan-19 expiry options. Amazon, Facebook, Spotify mainly. Amazon started getting weaker after the $1tn day, but recently started regaining strength - until the minimum wage hike. Facebook was about to hit $180 and we got the fucking hack. On Monday, with Amazon at $2000+ my account was still worth $130k USD. I am long $1800 and $2000 jan19 calls. Total downside $80k on those.\n\nToday I woke up to an account worth $63k. One third of the yearly high. -45% YTD. \n\nI am terrified of what will happen next. Normally when you get a day like this it continues further. ", "score": 20, "replies": [{"body": "If you think it’ll continue further, why not short it. ", "score": 10, "replies": [{"body": "Sorry man. Just keep a cool head and go for mini wins. My account went from 160k-210k in April then pummeled to 90k in June. I took a break. I'm back to 150k. Been adding cash along the way. It sucks but you can come back. Yes I've missed a bunch of home rooms but I've also won mini wins where if I held they would be losers. \n\nTry not to win it back in one move. You will go further into the hole. Mini wins here and there. Cut losers immediately. ", "score": 3, "replies": [{"body": "Unfortunately I'm all in already. My $160 Facebook calls bought after the initial earnings drop are close to worthless. Similarly my $180 Spot calls bought after earnings. I need AMZN at $2058 on the 18th of January to break even. Sub 1800 = $80k realised loss.\n\n&#x200B;\n\nMy pos:\n\n2\\* AMZN JAN19 1800C\n\n1\\* AMZN FEB19 1850C\n\n1\\* AMZN JAN18 2000C\n\n3\\* FB JAN19 160C\n\n4\\* FB JAN20 150C\n\n4\\* SPOT JAN19 180C\n\n1\\* SPOT JAN20 160C\n\n2\\* TWLO JAN19 60C\n\n1\\* TWLO JAN19 70C", "score": 1, "replies": []}]}]}]}, {"body": "Not massive tendies, but yesterday I sold off my MU positions at 80% loss(bought theee months ago ) , some of my Visa for 50% loss and sold calls against the rest of it. \nBought QQQ puts with the money and I’m already looking like I will be back to break even on my portfolio (which was doWn 60%)... \nalso bought FB puts for after earnings, way OTM cause this company has a shit product and it’s starting to show", "score": 6, "replies": []}, {"body": "I'm up almost $3,500 from yesterday.", "score": 8, "replies": []}, {"body": "Bought square puts at market open yesterday break even of 80", "score": 5, "replies": []}, {"body": "Was done almost to 500 from 3k, BABA puts are gonna get me back to 2k this week, then I’ll roll that into whatever looks fun next week, probably long term snap puts since that shit has no effective revenue stream and is dead.", "score": 5, "replies": []}, {"body": "futures down vix up lookin like a blood red day", "score": 3, "replies": []}, {"body": "http://imgur.com/vQmB1x5", "score": 1, "replies": [{"body": "Positionsssssssss", "score": 3, "replies": [{"body": "http://imgur.com/7Gpo6UW\nhttp://imgur.com/zYJ90SG", "score": 3, "replies": []}]}]}]}
{"title": "Lets talk earnings on NFLX", "selftext": "Netflix is 10/16. It crumbled to 320s. Do we see earnings as a catalyst?\n\nI remember being short Netflix at these levels and getting burned. The company has only gotten stronger and won a few Emmy's. \n\n\n\nI guess the same goes for all the other big tech stocks with earnings coming up...AMZN, FB, GOOG, AAPL", "id": "9n8noj", "created_utc": 1539252991.0, "score": 8, "upvote_ratio": 0.99, "num_comments": 17, "comments": [{"body": "Define \"Stronger\" \n\nDoesn't Netflix burn through an insane amount of money?", "score": 15, "replies": [{"body": "Apparently money doesn't count these days...", "score": 7, "replies": [{"body": "Oh snap!", "score": 1, "replies": [{"body": "snap to the ground as well", "score": 3, "replies": [{"body": "+.22 and +.04 AH. It almost happened then people bought it up. I would assume there’s a sell tomorrow as to not risk the weekend", "score": 1, "replies": [{"body": "Well, my puts expire and January, so snap has enough time to die. I might pick up some more tomorrow. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I have been using their service less and less due to the amount of shit being produced in a hope of  the next 'Stranger Things'.\n\nThese guys must be literally burning money producing all this stuff.\nI'm staying away from NFLX.", "score": 7, "replies": [{"body": "You think it matters if you use it less? You’re or someone you know is still paying for the sub. Let’s talk again when that sub gets cancelled. ", "score": 4, "replies": [{"body": "Exactly. If anything, using it less while still paying for a sub is better for them lol.\n\n\nI am perma subscribed cuz I have TMobile and that's not going anywhere", "score": 2, "replies": []}, {"body": "If you don't think declining use is something to be aware of as a part of the health of the company you are severely mistaken.", "score": 2, "replies": []}]}, {"body": "You'd actually be surprised how cheap you can produce a TV show as a network. The majority of their productions are ultra-low budget with a few high-budget productions to draw in the crowds.", "score": 1, "replies": []}]}, {"body": "NFLX is one of the least rational stocks. Could go either way. NFLX earnings used to have new subscriber growth numbers as a catalyst, but that's changing now that they have gotten this big and are changing how they do business. The move from buying to making content is harder to price. I don't think the market gives a shit about the Emmy's any media company wins or doesn't win. \n\nI'm not trading earnings until there's evidence earnings numbers matter more than beta right now. ", "score": 2, "replies": [{"body": "Yes, a good rule of thumb is not to play with irrational stocks", "score": 1, "replies": []}]}, {"body": "a bear will rip it's face off", "score": 2, "replies": []}, {"body": "Pipper Jafray says subs look like in line for US and a surprise for international, still up 70% this year.  Today really has to turn around ", "score": 1, "replies": []}, {"body": "I was going to YOLO buying calls on earnings last week when the price was $375, breakeven would've been almost $400. LOL", "score": 1, "replies": []}, {"body": "Cancelled and moved to Hulu for only 5.99 a month I can watch all the shows that Netflix used to have when it was good. \n\nWill probably subscribe again when the next stranger things comes out lol", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "9n9ijn", "created_utc": 1539260803.0, "score": 30, "upvote_ratio": 1.0, "num_comments": 19, "comments": [{"body": "recession is over\nnew 10 year bull run incomming", "score": 38, "replies": [{"body": "10 years is like the great depression? I guess everyone can come be poor with me. I'm like the Bane of poor. I was born in it, molded by it. ", "score": 1, "replies": []}]}, {"body": "Selling my calls first bounce and loading up on puts. ", "score": 15, "replies": [{"body": "I'm selling my puts at open.  You didn't hold those puts after we spoke yesterday?  I missed out on approximately 45k-50k because I sold my main put position that I bought last week too fucking early.  I feel like a complete and utter pussy. Still holding my SQ puts though.  That CFO departure is going to hurt that company. She was the brains behind it.", "score": 6, "replies": [{"body": "how far you think SQ will drop?", "score": 1, "replies": [{"body": "50s or 60s.  It is so absurdly over valued.  ", "score": 1, "replies": [{"body": "cool, got 10/26 puts trying to decide how long to wait", "score": 2, "replies": [{"body": "Oh damn....I would sell those. 50s or 60s probably won't happen for a while.  That is a really close exp date.  ", "score": 1, "replies": [{"body": "Does he have 10/26 $55's?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Instructions unclear. All in wacky tabacky stocks!", "score": 9, "replies": []}, {"body": "Only people who bought puts are still alive here", "score": 5, "replies": [{"body": "Sup bb. ", "score": 2, "replies": []}]}, {"body": "Shit we were like 6% above the 200 day?", "score": 1, "replies": [{"body": "No.  \n\nIt is also below the 200day right now.  Not good", "score": 2, "replies": [{"body": "Just get that bear suit...", "score": 1, "replies": [{"body": "Fly or die today.  Bank earnings will make or break this shit", "score": 1, "replies": [{"body": "Imo damage has been done for bull case, I’ve been selling rally... let’s see", "score": 1, "replies": []}]}]}]}]}]}
{"title": "S&P 500 futures go positive after CPI data shows weaker inflation than expected", "selftext": "", "id": "9n9kd6", "created_utc": 1539261253.0, "score": 20, "upvote_ratio": 0.9, "num_comments": 12, "comments": [{"body": "Il make sure to buy a put on open so the market reverses. Doing my part for the greater good", "score": 30, "replies": [{"body": "~~Bless~~ Thank you", "score": 9, "replies": []}]}, {"body": "Just like I expected. Where’s all this huge inflation the fed thinks is out there????\n\nAnd where are all the people who said a lower CPI number would be bad for markets. This sub has a lot of geniuses.", "score": 18, "replies": [{"body": "this will cause feds to raise rates more, please tell me how this is bullish for stocks.", "score": -10, "replies": [{"body": "Lol nobody tell him", "score": 13, "replies": [{"body": "lol ok, keep buying the dip. ", "score": -5, "replies": [{"body": "It was sarcasm to begin with... ", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm on my knees, will suck a few for this miracle.", "score": 9, "replies": []}, {"body": "This is a fake pump by the feds", "score": 11, "replies": [{"body": "If the Chinese can do it, then so can we.", "score": 2, "replies": []}]}, {"body": "Powell is probably gonna get fired today. Waiting for Donald Trump to say \"we'll see what happens\"", "score": 6, "replies": []}]}
{"title": "PayPal will let customers deposit and withdraw cash at Walmart stores", "selftext": "", "id": "9n9q23", "created_utc": 1539262626.0, "score": 56, "upvote_ratio": 0.98, "num_comments": 15, "comments": [{"body": "whew. lots of fraud will be committed", "score": 47, "replies": [{"body": "Visa/MC are idiots for tightening up their MID rules anyway, it's only caused 3rd parties to grow.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "As a Pakistani , I love how much this meme has grown ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Interesting to see how this progresses, they technically do pretty much everything a bank does. Take deposits and give out loans. ", "score": 10, "replies": []}, {"body": "Paypal support is HORRIBLE though. If you have thousands of dollars in paypal and they decide they dont like you they cant just close your account and steal your money.", "score": 5, "replies": []}, {"body": "Bluebird/Walmart already tried to cover this ground not that long ago.  Not sure how well they are doing but they offered a free checking account, complete with all the stuff you'd expect like physical check writing and BillPay.  Even the physical checkbooks were free.  They were momentarily popular with churners because you could ACH money into the account via P2P direct deposit.  Maybe PayPal's integration into so many other things can give them an edge.", "score": 1, "replies": []}]}, {"body": "Stock up 3% PM, maybe square money flowing here ", "score": 8, "replies": [{"body": "SQ correction is overdue, but well I tried to short it till I gave up.\n\nPYPL is just cheap compared to SQ.", "score": 4, "replies": []}]}, {"body": "This is the only put I hold, figures my luck when the rest of the market is red.  I am still up more than 3 times my original investment though.", "score": 2, "replies": [{"body": "You short a company that's been trading flat for a year when everything else is up a billion %? Interesting", "score": 1, "replies": [{"body": "My determination was that it was trading worse than Visa, Mastercard, and Square and therefor most likely to go down.  So I had Mastercard calls and Paypal puts, I sold my mastercard calls before I knew it was a serious correction.  I can't say I predicted this or was good at it, but I have made money in this downturn.", "score": 1, "replies": []}]}, {"body": "Why did you buy a put", "score": 1, "replies": [{"body": "To hedge my bets when I had MA calls.  I sold all my calls early.  I bought the put with a strike price of $87 when it was OTM.  So i am actually making money in this correction but not much.", "score": 1, "replies": []}]}]}, {"body": "I went all in on pypl calls last Friday expiring 10/19.. :( no choice but to continue to hold", "score": 1, "replies": []}, {"body": "Robinhood to let autists deposit cash at walmart", "score": 1, "replies": []}]}
{"title": "CHGG calls still holding?", "selftext": "[deleted]", "id": "9n9uen", "created_utc": 1539263550.0, "score": 8, "upvote_ratio": 0.84, "num_comments": 14, "comments": [{"body": "Sold mine but keeping my January 30s", "score": 8, "replies": []}, {"body": "Take the L that strike is too far OTM\n\nThere is a massive market dip on actual companies right now \n\nNo one is waking up and saying oh boy I wanna buy 10k shares of fucking chegg right now when nvda is under $250 , adobe as well, msft near 105, etc etc.\n\n", "score": 9, "replies": []}, {"body": "Apr $35c holding \n\n\nEdit: FUCK never mind, sold options.", "score": 5, "replies": [{"body": "Also April $35c also holding... rather not talk about it", "score": 5, "replies": []}, {"body": "April $30s here", "score": 1, "replies": []}]}, {"body": "Holding to the end baby", "score": 2, "replies": []}, {"body": "Holding Jan 25s", "score": 2, "replies": []}, {"body": "Holding on for dear life", "score": 2, "replies": []}, {"body": "Holding!", "score": 1, "replies": []}, {"body": "Yes ", "score": 1, "replies": []}, {"body": "Holding Jan 30 calls, glad I didn't go hog wild", "score": 1, "replies": []}, {"body": "Dumped Dec $30’s the other day.", "score": 1, "replies": []}, {"body": "Jan $30s as well.  I'm going to hold until earnings at least.", "score": 1, "replies": []}]}
{"title": "SQ or AMD?", "selftext": "[deleted]", "id": "9na8la", "created_utc": 1539266608.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 17, "comments": [{"body": "[deleted]", "score": 22, "replies": [{"body": "How much more can it go down?\n\nFeb. dip was $15 on the QQQ, we're already at that.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "167 before drop, 152 after\n\nDont cherrypick the absolute peaks, use averages.", "score": 3, "replies": [{"body": "So you think every time QQQ will just dip $15? That logic just not right. Also, there was no tariff in effect and interest rate bond yield was not that high at that time.", "score": 4, "replies": [{"body": "No I didnt say it will just dip $15, I left a rhetorical question of \"How much more can it go down than the last big move?\"\n\nNo need to get so offended. Put your money where your mouth is and short the entire market if you think it's going down another $50 or whatever, dont forget to post positions in a new post.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": []}]}]}]}]}, {"body": "AMD", "score": 7, "replies": []}, {"body": "Correct answer is Visa, Apple or Amazon.", "score": 12, "replies": [{"body": "The correct answer is TSLA so long as Elong does not fart on Twitter.", "score": 3, "replies": []}]}, {"body": "both", "score": 3, "replies": []}, {"body": "The best play might be buying a straddle on square. I think it’s going to shoot back up, but it could crash too I guess. I’m a believer so I’d just average down, but it’s not staying around 70. By EOY it’ll be sub 50 or above 90, in my opinion.", "score": 3, "replies": [{"body": "In short: stocks go up, stock go down, and sometimes stocks go sideways ", "score": 1, "replies": []}]}, {"body": "SHORT BOTH ", "score": 3, "replies": []}, {"body": "MU. Anytime now...", "score": 1, "replies": []}, {"body": "AMD is heading back to the random number generator between $10-15 that it deserves to be, puts all day", "score": 0, "replies": [{"body": "How does it deserve to be there? They have shares in both CPU and GPU markets and are stealing part of the market from INTC and NVDA. If anything I’d say long. ", "score": 1, "replies": []}]}]}
{"title": "Amazon was once a $1 trillion company, as of this post it is $823 bln company. For reference Microsoft is almost the same now checking in at $816 bln. Apple has lost $60 bln from their $1.1 trillion.", "selftext": "[deleted]", "id": "9narz4", "created_utc": 1539270448.0, "score": 97, "upvote_ratio": 0.95, "num_comments": 20, "comments": [{"body": "Somewhere Bezos is shooting up roids and pumping iron with the most furious road rage of all time.  Long. ", "score": 73, "replies": [{"body": "If only elon would do this", "score": 9, "replies": [{"body": "Nah. He’s just smoking blunts, banging whores and tweeting.  ", "score": 10, "replies": [{"body": "TIL i identify as an elon musk", "score": 13, "replies": [{"body": "Could be much worse mi amigo", "score": 2, "replies": []}]}]}]}, {"body": "I'm sure he's sad that instead of 100 billion he has 91 billion ", "score": 2, "replies": [{"body": "Alphas don’t get sad.  They get fucking furious. ", "score": 3, "replies": []}]}]}, {"body": "So stop selling and hold?", "score": 42, "replies": [{"body": "This guys trying to trick me into holding so he can sell before I do! Sell everything!", "score": 43, "replies": []}]}, {"body": "tencent currently has the record for most loss in market cap i think", "score": 22, "replies": [{"body": "i bought the peak perfectly on that one. I still don't know why I bought them. Something about a cup of bleach. ", "score": 5, "replies": []}, {"body": "Are they down to ten cents?", "score": 1, "replies": []}]}, {"body": "My dick looks bigger now!", "score": 12, "replies": []}, {"body": "Why is tech selling the hardest? ", "score": 9, "replies": [{"body": "Because it's had the biggest run-up", "score": 65, "replies": [{"body": "Get out of here with this logic", "score": 11, "replies": [{"body": "It's for your own safety", "score": 1, "replies": []}]}]}, {"body": "Because they are the one trading at highest P/E I guess..", "score": 12, "replies": []}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "I was saying that AMZN was overvalued when it hit a trillion\n\n&#x200B;\n\nNobody listens", "score": -1, "replies": []}]}, {"body": "Wow if it stays like this for a week, Amazon will be bankrupt", "score": 3, "replies": []}]}
{"title": "Going long NVIDIA and short AMD might not have been my best decision of the past day and a half", "selftext": "Should I bail on the amd short?", "id": "9nb637", "created_utc": 1539273168.0, "score": 16, "upvote_ratio": 0.86, "num_comments": 18, "comments": [{"body": "Go all in NVDA, the \\#1 GPU company out there. This dip is a godsend. ", "score": 11, "replies": [{"body": "Bailed on amd short, keeping nvda", "score": 4, "replies": [{"body": "Short amd but on a long, very long timeframe, if the past is any indication it takes a while for it to melt. And short NVDA on a long timeframe as well.", "score": 1, "replies": [{"body": "Short nvda? What’s going to replace GPU’s?", "score": 1, "replies": []}]}]}, {"body": "I wouldn't be so sure about that. They are definitely the dominant GPU company, but their most recent release (RTX series) was a *hard* flop. Way too expensive, and the massive price hike was justified by a premium feature that was rushed to market, underperformed, and isn't even usable yet baring a few games. The only people that are buying it are people with a lot of money to blow who absolutely *have* to have the most recent card. And their 'cheap' version of the card (still more expensive than any other consumer card available baring the 1080ti) has been delayed multiple times, and still isn't available. \n\nRumors are that AMD has multiple new GPUs up their sleeve (Polaris refresh coming sometime in Q4, and a new 7nm Navi architecture further out), and if they were going to strike the time would be now. In their target market (gamers), the attitude towards Nvidia is very 'meh' right now. ", "score": 2, "replies": [{"body": "I would sell my 1080Ti TONIGHT for an AMD competitor. Nvidia’s software suite is garbage, and their driver stability is overrated... but I got no other way to Witcher 3 in 4K at 60fps.", "score": 1, "replies": [{"body": "I would have to imagine they are scrambling to get their next GPU out soon, if they aren't they aren't thinking straight. Hopefully it's a step up in performance from their usual GPU trend. But if their CPU strategy lately is at all indicative of their GPU strategy, I think we're looking at some hot competition from AMD in the GPU market ", "score": 1, "replies": []}]}, {"body": "Yet they're the only one who can do real-time raytracing, and in AI they have virtually no competition. NVIDIA is a sure bet, AMD not so much.", "score": 1, "replies": [{"body": "As I said, it was rushed to market. There's a reason AMD doesn't have a ray tracing card. As I said it doesn't perform well, and there are maybe 3 mainstream games that people actually know about (Battlefield, Metro and Tomb Raider), which said they *will* implement ray tracing. Eventually. But you can't even use it yet. I'm not saying that ray tracing sucks, but it was released way too soon. They should have spent time optimizing it and getting it to run better, while letting game developers prepare for the release more, so they could release an optimized product, that could be used when you bought it.\n\nAt the lofty price it's currently at, the majority of gamers will not be buying an rtx any time soon. Not to mention you can't even buy them right now, they are all out of stock due to supply complications. The only 2080 ti in stock on Newegg costs 50% more than retail due to scarcity, and the 2070 keeps getting delayed because of manufacturing issues. ", "score": 1, "replies": []}]}]}]}, {"body": "I would not short AMD right now. They are wiping the floor with Intel and rumored new GPU architecture coming Q1 2019. Seeing as NVIDIA dropped the ball it gives AMD a shot to gain GPU market share. If AMD starts gaining GPU market share on top of the CPU market share they're already gaining it's going up big time.", "score": 3, "replies": [{"body": "I thought GPU was Q4 '18 and 7nm CPU was Q1. regardless, go long", "score": 2, "replies": []}]}, {"body": "Not enough into, what's your position?", "score": 2, "replies": [{"body": "Shorted 30 at low 25’s. Than another 100 at 25.81. \n\nJust bailed to cover at 26.02", "score": 2, "replies": []}, {"body": "So now that I bailed it’s probably going the way of the Hindenburg", "score": 2, "replies": [{"body": "Are you close to a margin call? Why cover so quickly? ", "score": 2, "replies": []}]}]}, {"body": "Go all in nvdia calls tomorrow when we get to 233-235. Close your amd short tomorrow at that time as well. Don't worry about price on amd ", "score": 2, "replies": []}, {"body": "If the short is next week no if its tomorrow gtfo", "score": 1, "replies": []}, {"body": "The extra hundred shares was on a day trade margin that I shouldn’t have because my accounts only like 2500", "score": 1, "replies": []}]}
{"title": "Dow pares losses as tech shares rebound", "selftext": "", "id": "9nba13", "created_utc": 1539273921.0, "score": 216, "upvote_ratio": 0.97, "num_comments": 13, "comments": [{"body": "Oh my god, I'm shaking. the memes today are so fucking good", "score": 68, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "Can't spend your time trading when your acount reaches 0. Might as well meme.", "score": 5, "replies": []}]}]}, {"body": "Motherfuck of course MU is on a rip.", "score": 19, "replies": [{"body": "Cant kill what is already dead.  Market crash is like mother fuckin pet cemetary for Micron. ", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I've found that trying to play both sides  of MU (calls and puts) is a fucking nightmare, doing calls alone is bad enough.\n\nYou going to hold and see if tomorrow is a bloodbath or cut your losses?", "score": 5, "replies": []}]}]}, {"body": "Fuck me I'm missing out on this bearish action today, because I have 3 trades already. Fuck the SEC also.", "score": 7, "replies": [{"body": "have you tried not being a broke ass with less than 25K? ", "score": 6, "replies": [{"body": "I'm looking for a solution.... 10/12 SPY $281 C for $0.20/contract look spicy", "score": 3, "replies": [{"body": "Not the single most retarded thing I've read all day on wsb, unfortunately.", "score": 3, "replies": []}]}, {"body": "or just a cash account. hardly anybody here is trading spreads anyway... you don't need a margin account to yolo on FD's. ", "score": 2, "replies": []}]}, {"body": "I see futures in your future. ", "score": 2, "replies": []}]}, {"body": "Man literally too angry to buy.", "score": 1, "replies": []}]}
{"title": "\"Dow 40,000 is coming, but only after ‘a large panic event’ passes, analyst warns\" . Well that was over quickly...", "selftext": "", "id": "9nbxzx", "created_utc": 1539278521.0, "score": 10, "upvote_ratio": 0.78, "num_comments": 12, "comments": [{"body": "I'm always baffled just how many people actually place importance in the Dow and how many legitimate financial news organizations actually report on it.\n\nIt's 30 companies.  It's basically meaningless.  One company has an uncommonly good or bad day and it's the only reason the Dow moves in that direction.\n\nIt's like determining the unemployment rate based on your 5 smartest friends", "score": 16, "replies": [{"body": "Agreed. The Dow is a shit index. ", "score": 5, "replies": []}, {"body": "Most are retired. So they do not count :(", "score": 1, "replies": []}, {"body": "Because it’s a massive and expensive index, so when it gets sold that means biggly is pulling out. When biggly pulls out it removes cash that is intertwined with everything else in the market interconnected by a huge web of complexity. This results in major stock pricing turning downward.", "score": 1, "replies": [{"body": "So is the S&P500. And the S&P500 is a significantly better index", "score": 1, "replies": []}]}]}, {"body": "lol.  Should be flaired with shitpost ", "score": 6, "replies": []}, {"body": "The loco fed starts buying shares in 2020 and that's how we get to dow 40k.  Sounds like a Netflix movie.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Not even. We already have a far left president in office when it comes to fiscal and economic policy, despite the President repping the GOP. \n\nHe’s socially conservative and his “right” leanings stop there. ", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Isolationist and protectionist policies are both left leaning. Right leaning would be free trade. \n\nThere were basically no tax cuts for upper brackets, in fact they were raised because there were less available deductions. Tax code changes lowered the effective rate most for domestic companies. Rates for multinationals were less effective. Isolationist and protectionist economics in practice. ", "score": 1, "replies": []}]}]}]}]}, {"body": "He doesn't give a time frame!  Big fricken deal!  It'd be unremarkable for the dow to reach 40000 it if took 20 years.", "score": 1, "replies": []}, {"body": "Look I'm gonna be honest, I dont know shit about fuck. I only started messing around in RH a few months ago, but havent traded anything besides options, and recently some credit spreads...wtf is the 40,000 in this article referring to??", "score": 1, "replies": [{"body": "Tendies", "score": 1, "replies": []}]}]}
{"title": "Me watching my AMD call$ waiting for $30 again", "selftext": "[deleted]", "id": "9nc34u", "created_utc": 1539279467.0, "score": 60, "upvote_ratio": 0.89, "num_comments": 11, "comments": [{"body": "God, what huge tits.", "score": 22, "replies": []}, {"body": "Sitting on 10/26 $33 calls... praying for insane earnings...", "score": 5, "replies": []}, {"body": "I bought puts, so it will moon tomorrow. You’re welcome.", "score": 4, "replies": []}, {"body": "FUCK YOU. $24 by EoD\n\n^^^^^^^PLEASE ^^^^^^^my ^^^^^^^puts ^^^^^^^are ^^^^^^^dying", "score": 12, "replies": [{"body": "with you homie praying for a drill", "score": 1, "replies": [{"body": "dude :( I need this SO bad... 7k is a lot for a fuckin guy fresh out of Big Kid skool", "score": 1, "replies": [{"body": "If you’re fucking around buying stupid otm puts with money you need you deserve to lose it all ", "score": 0, "replies": [{"body": "Hey, Fucko-deluxe.", "score": 0, "replies": []}]}]}]}]}, {"body": "You might be right. Semiconductors actually outperformed my expectations today ", "score": 3, "replies": []}, {"body": "When I sell my puts at a loss, you'll be right.", "score": 1, "replies": []}, {"body": "Who is this dude? ", "score": -19, "replies": []}]}
{"title": "+$8 today discount shopping on AMZN", "selftext": "", "id": "9nf5gr", "created_utc": 1539301009.0, "score": 16, "upvote_ratio": 0.9, "num_comments": 14, "comments": [{"body": "8 grand on a single option. Goals ", "score": 23, "replies": [{"body": "seemed like a deal I couldn’t pass up ", "score": 5, "replies": [{"body": "I’ve been coveting an Amazon option. Tendies roll in on that one! What is only $8 today will be $800 tomorrow. My Amazon shares are way up AH.", "score": 5, "replies": []}, {"body": "Are you planning on like a 2-3month flip, or holding until weeks before end-date hoping for max profits.\n\nI want to do something like this with the remaining of my cash (~4k).", "score": 1, "replies": [{"body": "Earlier flip, unless of course my other holds are raining cash. Then who knows. ", "score": 1, "replies": [{"body": "Think it will have a low dip like it had today? I need to liquidate", "score": 1, "replies": []}]}]}]}]}, {"body": "I'd take a +$8.00 day right now. Fuck me...", "score": 11, "replies": []}, {"body": "AMZN is definitely gonna reach that $2K mark by by Apr 2019. Good job OP.", "score": 7, "replies": []}, {"body": "Oddly my other options like DE didn’t take much of a hit today. Down for sure but nothing I can’t stomach given how much capital is deployed. But I typically buy really long options. I haven’t ventured into the weeklies game you guys like to play. ", "score": 1, "replies": []}, {"body": "That Moment when it will be soo hard to find a seller !!!!", "score": 1, "replies": [{"body": "Don’t wait until the last minute ", "score": 1, "replies": []}]}, {"body": "That's crazy that the market is pricing in about 200b-300b worth in gains in 6 months. That's like another Boeing, Home Depot, or Pfizer popping up from scratch in 6 months.", "score": 1, "replies": []}, {"body": "LET'S GO!!!!!!!!!!!!!!!!   ", "score": 1, "replies": []}, {"body": "Holy fuck, that call is rock-hard", "score": 1, "replies": []}]}
