{"title": "Should I jump on the ballooning TSLA stocks?", "selftext": "I'm looking for longevity instead of short term gain (a couple of years), should I hurry and hop onto TSLA? ", "id": "5oysph", "created_utc": 1484855297.0, "score": 42, "upvote_ratio": 0.78, "num_comments": 75, "comments": [{"body": "It depends on your valuation of TSLA. If you think TSLA is just an automotive company then no, don't jump on the stock. If you think TSLA is a growth stock like Amazon that is going continue expanding to new markets, then jump on it. When you're investing in TSLA, you're not investing in cars, you're investing in Elon Musk. ", "score": 40, "replies": [{"body": "Thats the thing...I feel that TSLA is going to achieve the same market value as Amazon.... but then what worth is my opinion? \n\nHence why i want to hear from people here (such as yourself). \n\n\nFurthermore I feel that renewable sources are the future if not the present. Which is why I was astounded with the solar powered shingles and the model C. \nI feel that TSLA has so much cooking up and that 200-300 is a good deal, especially when i can see them hitting 800+", "score": 8, "replies": [{"body": "Model C? Do you mean Model 3?", "score": 10, "replies": []}, {"body": "The way to remember the models are they spell S3X", "score": 7, "replies": [{"body": "and soon it will be S3XY", "score": 3, "replies": []}, {"body": "They spell RoadsterSX3, though...", "score": 2, "replies": []}]}, {"body": "Lots of feelings here. I try not to make any financial decisions on feelings, but instead on hard numbers. Facts.", "score": 1, "replies": []}, {"body": "If you're still confusing the name of their upcoming car, I'd suggest you stay clear of TSLA, at least until you do tens to hundreds of hours of more research.\n\nDon't invest in what you don't truly understand. Just grab some index funds like $SPX or $VTSMX.\n\nYou say you seem them hitting 800. When? Why? How did you choose that number? Presumably you see them being worth 2-3x their current value. Do you think they will get there before the rest of the market doubles in value (about every 10 years)?", "score": -9, "replies": [{"body": "He doesn't see them hitting 800.  He sees them hitting a market cap of over $350B if I read it right...", "score": 3, "replies": []}, {"body": "Would you invest in spx/ vtsmx over brk-b?", "score": 1, "replies": []}]}]}]}, {"body": "I 'jumped' a couple years ago and it still hasn't hit my original buy in price of $275 since then, although I averaged it over time to be nicely positive now.  ", "score": 11, "replies": [{"body": "but don't you think that w/ over 300k preorders of the new model C and the success of Space X that it'll jump even higher than 275?", "score": 6, "replies": [{"body": "Model 3, you mean? You are the third person  in this week who said model c. Curious about where this is coming from. Did I miss something?", "score": 3, "replies": [{"body": "The interesting thing was that it was originally supposed to be Model E, not Model 3. Ford wouldn't give up their trademark for the former. It was never Model C though. They all rhyme, so maybe I there is the confusion. ", "score": 3, "replies": []}]}, {"body": "Space X has nothing to do with Tesla - unless you consider the SolarCity bonds they bought a while back.  Tricksy one Mr Musk, he is.", "score": 5, "replies": []}, {"body": "What makes you think that that isn't factored into the price?", "score": 4, "replies": [{"body": "True.. \n\nI had assumed the stock might've gone higher due to the acquisition of SC", "score": 1, "replies": [{"body": "Buy when they have Model 3 problems, which they will have, if you still believe in them at that time.", "score": 4, "replies": []}]}]}, {"body": "I think it could hit 300 this time but also believe it will probably slide back to 190-200 as well if they start missing production quotas.  Very good trading stock though and I have faith in the company as a whole but buy and hold hasn't been a winning strategy for me on this thus I have been buying/selling in a range (but I always own some).", "score": 0, "replies": []}]}]}, {"body": "I am long on TSLA, and I love it (see my post history).\n\nWait till tomorrow, Mr. T might say something to depress TSLA stock price therefore buy it *on sale*, or it might not say anything and TSLA might just remain where it is.\n\nDisclaimer: I am long on TSLA and I intend to buy more.", "score": 13, "replies": [{"body": "Love the car...not really a fan of the stock.\n\nThat said, it employs a lot of people and will be hiring more to produce the Model 3. Musk has the ear of Trump who like the jobs being created here so that's in it's favor in my view. I agree that now is the time to wait for a pullback...I hate chasing stocks as sometimes it makes me feel like a dummy when it drops significantly lower after I buy.", "score": 3, "replies": [{"body": "Do you have a Tesla car? Which one?\n\nWhy aren't you a fan of the stock?", "score": 1, "replies": [{"body": "I've test driven the car, as the factory is about 30 miles from me. Considered buying one but ultimately I love the sound and characteristics of a internal combustion engine. Quality is above reproach and it's so quiet it's ery. \n\nI've traded the stock at times as a momentum play but it's a cult stock for now and I don't invest in cult stocks.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Agree. I all depends on when serious car makers will step out on the market. I really doubt that Tesla will be able to compete quality-wise and feature-wise with Porsche or Mercedes, fo example. ", "score": 2, "replies": []}, {"body": "Or maybe because the company makes the longest range electric cars which also happen to be a much higher quality than other electric cars. Also electric cars are the future.", "score": 1, "replies": [{"body": "[you and elon](http://media.animevice.com/uploads/3/31361/566066-brock_heart_eyes_1_.jpg). You're caught up in the fanaticism Guess you missed the part about having an unprofitable company and constantly over promising and under delivering. Any other company or CEO and people would lambasting him. \n\nDidn't say electric cars weren't the future but it's not like he's the only game in town. They'll just be done by a company that can actually produce them on time and affordable. ", "score": -1, "replies": [{"body": "He chooses a book for reading", "score": 3, "replies": []}, {"body": "I actually know very little about Elon Musk, but you can continue to drive the argument that everyone who disagrees with you is a fanboy. It doesn't seem to be working.", "score": 1, "replies": []}]}, {"body": "Heard of the Bolt?  \n\nTesla has no technological edge on any car maker insofar as producing electric cars go, trust me on that.", "score": -4, "replies": []}]}]}]}]}, {"body": "not a bad idea. i can see trump saying some + for oil and - for alternative energy", "score": 4, "replies": [{"body": "Yup, that's my issue.  Hurts in the short term, in the long term TSLA is solid.", "score": 3, "replies": [{"body": "Not from my reading of their cash burn they're not...", "score": 1, "replies": [{"body": "TSLA is a start up, a big one, but a start up indeed.  Cash burn is part of what a startup is about, therefore reliance in the capital market for cash infusion, with the inevitable dilution.\n\nIt's a cat & mouse game in a sense.", "score": 1, "replies": [{"body": "I agree that capital spending is a big part of *this* startup in particular, but in the long run, I don't see this business as being profitable.", "score": 0, "replies": []}]}]}]}]}, {"body": "Yeah, i'm looking to spend my tax return on TSLA.  \nThinking about getting a second job in the evenings to supplement my bad habit of buying stock ;P", "score": 7, "replies": []}]}, {"body": "I've been following tsla for a good amount of time now. It's going to boom when everything is sorted out. For the time being, there is a $100 fluctuation in price. One of the most volatile stocks on the market. If you buy it now, do not sell it if it goes red on you. This is going to be a winner inevitably ", "score": 4, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "but what if there isn't a pullback? Or the pullback happens when it hits 400? \n", "score": 1, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "[deleted]", "score": 2, "replies": []}, {"body": "true, but can't you see TSLA going off? Like reaching 400+", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "**Here's a sneak peek of /r/wallstreetbets using the [top posts](https://np.reddit.com/r/wallstreetbets/top/?sort=top&t=all) of the year!**\n\n\\#1: [If this post gets over 3000 (3k) upvotes, we will bring back the rainbow dicks](https://np.reddit.com/r/wallstreetbets/comments/5e0ybw/if_this_post_gets_over_3000_3k_upvotes_we_will/)  \n\\#2: [We're in good hands guys.](http://imgur.com/RQEyqKk.png) | [88 comments](https://np.reddit.com/r/wallstreetbets/comments/5ls3kb/were_in_good_hands_guys/)  \n\\#3: [wallstreetbets_irl](http://imgur.com/a/i4ajl) | [196 comments](https://np.reddit.com/r/wallstreetbets/comments/5gv5p1/wallstreetbets_irl/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/5lveo6/blacklist/)", "score": 2, "replies": []}, {"body": "how much did you buy them @? 275?", "score": 1, "replies": []}]}]}]}, {"body": "I would second this. \n\n- Sincerely a former TSLA owner when the stock was $39.", "score": 4, "replies": []}, {"body": "Buy low, sell high man. Stocks 101.", "score": 2, "replies": []}]}]}, {"body": "Look at their 5 year chart and then ask yourself that question again.", "score": 7, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Cool story, and you're right in a sense.\n\nThis company, and therefor this stock, behave differently. If you think it's a growth stock, then good.  I see it as a tech stock that behaves as a bio-tech stock would, highly dependent on the news.  You do your thing, and I'll do mine.  My plan is to hopefully sell in between 245 and 250, and once the model 3 announcement is delayed I plan to buy back in at the new lows, wherever those are.  More than 150 and less than 200.  Then they'll grow again. ", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "but i can just reach it!!!", "score": 1, "replies": [{"body": "But you may get burned up by the engines, bro. Wait until it hits a slump, then buy.", "score": 1, "replies": []}]}]}, {"body": "Been in tesla since 210. I'm heavy and long on TSLA. I've  been between 30-45% for a month now. \n\nI am torn between this run hitting 260-280 and selling and hoping it does the usual fall back to 200, and it being the final time to get in before Tesla is a monster company that is generating what the future looks like. What side are you on? There's your answer ", "score": 2, "replies": []}, {"body": "I think with the acquisition of Solar City and the big long range plans Tesla has to integrate solar, home battery, and cars, that they will be very successful in the long term. \n\nIn the short term, I think the stock will be somewhat volatile as they struggle to incorporate Solar City into the company, roll out the solar roof, and release the new model 3. In the near-term they might have bitten off more than they can chew. But if they pull it all of, it will be one hell of a success. ", "score": 4, "replies": []}, {"body": "If you're are buying for a long position, buy some then buy more.  If the price drops after you buy, buy more and lower your cost basis.", "score": 2, "replies": [{"body": "ah, i see. \nThank you! ", "score": 1, "replies": []}]}, {"body": "NO", "score": 2, "replies": []}, {"body": "YES. Look at Amazon... Tesla is booming to be the next... ", "score": 1, "replies": []}, {"body": "When you look at TSLA, it is all over the place.  But I've lost (then made back) over 40k on this stock.\n \nThe trick is to ease into it over time - don't make all your purchases at once and give yourself a big exposure.  This is pretty true of most volatile stocks.  If you have $10k to invest ... buy $2500 on your first order.  If it goes down you still have some money to average out that purchase.  If it goes out ... you can be happy to be in the green.  I started the \"ease-out\" at 225 since I was in at around 188 - but I still have shares and am still enjoying the rise.\n ", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Wait the next drop, I am hoping to reach 280 to sell it. Earnings should be fine thanks to the autopilot feature that has delayed production in late 2016 and now will give extra pump to the slow production that was forecasted.", "score": 1, "replies": []}, {"body": " Zoomed in view on daily shows price levels outside of Bolinger bands - correction underway IMO", "score": 1, "replies": []}, {"body": "No. If you want to own Tesla, wait for it to come back down. Patience wins. Don't be a sucker.", "score": 1, "replies": []}, {"body": "Just sold mine. Hoping to rebuy (& talked bf into it too) as soon as it dips back to 210s. Here's hoping I'm not an idiot :D", "score": 1, "replies": []}, {"body": "I bought at 190!!", "score": 1, "replies": []}, {"body": "I wouldn't just based on their earnings for the last 2 years, if you really wanted to buy them I'd wait until they dropped to 190ish which will more than likely happen. TSLA is a darling stock in my opinion that is over rated and seems to go up and down due to Elon Musk. Then again if anyone knew how a company would turn out in a few years, we'd all be millionaires.", "score": 1, "replies": []}, {"body": "I feel like you can find a much better spot to get into TSLA. ", "score": 1, "replies": []}, {"body": "Been in tesla since 210. I'm heavy and long on Tesla, heck I even own a Tesla, but I buy and sell it again, etc. etc.", "score": 1, "replies": []}, {"body": "I'm long on Tesla, heck I even own a Tesla, but I buy and sell the stock every other week.  For as long as I have been following Tesla stock, it goes up and down as much as 5% in value every two weeks.  It's really consistent.\n\nIf you buy TSLA when it goes down substantially, hold it for one to two weeks, and sell it when it bounces back, you can just consistently make money.\n\nI've been doing this for months, harvesting 2% to 5% return every couple of weeks reliably with virtually no downside.  You can make money this way whether TSLA is trending up, or trending down.\n\nI find that it trades a lot like bitcoin; just pure raw speculation on hype and news-cycles and little to do with any 'fundamentals'.\n\nFrom largely just trading Tesla stock I have realized a 25% return on my portfolio just since November 1, 2016.\n\nSo, yeah, buy some TSLA stock. And sell some TSLA stock.  And buy it again.  And sell it again, etc. etc.\n\nIt's a day-trader's best friend.\n", "score": 1, "replies": [{"body": "Do not follow this advice. Look at the TSLA chart the past 1 month and you'd seen a steady rise with some blips along the way. When would you have bought, or sold? Timing this way is highly risky and if the pattern were so obvious you would see drastic swings every 2 weeks, and the arbitrage closing fairly quickly. The market does not follow a clock. Buyer beware.", "score": 3, "replies": [{"body": "Maybe you are right. But this strategy works when the price is dropping too. I made money the whole time TSLA was dropping for months to by swing-trading.", "score": 0, "replies": []}]}]}, {"body": "No, you are years too late.  If you really believe in it, save your money and at least wait for it to dip.  It's near it's all time high now and most people would still consider it overvalued.  It's \"bright future\" is already priced into the value of the stock.", "score": 1, "replies": [{"body": "You all talked me out of it.   If a dip occurred, (or when), what price is reasonable?", "score": 1, "replies": [{"body": "200-225", "score": 1, "replies": []}]}]}, {"body": "Balloons go up....\n\n...and also go down.\n\nThis recent run won't be sustained at the current rate.", "score": 1, "replies": []}, {"body": "Tesla looks very promising in the next ~5 years. As they transition to an energy company, they shares will continue to rise. Of course with new tech like this, there is always unforeseen circumstances that can severely hurt the company and it's earnings.\n\n!stock TSLA", "score": 0, "replies": [{"body": "Up to date stock info for **$TSLA** (Tesla Motors, Inc.):\n\n-----------------------------------------------------------------------------------------\n\n**Price:** $243.13\n\n**Open:** $247.25\n\n**Change:** 4.77 (+2.00%)\n\n**Volume:** 7,023,845.00\n\n**Mkt Cap:** 36.44B\n\n**Average (50 day):** 210.09\n\n**Exchange:** NMS\n\n-----------------------------------------------------------------------------------------\n\nI am a robot. However, if you have any questions or suggestions PM me, and my creator will respond.", "score": 1, "replies": []}]}, {"body": "Emotional investing is a bad idea. ", "score": 0, "replies": []}, {"body": "It blows my mind how many people think \"investing\" in Tesla is a good idea.\n\nIt's not about \"saving the planet\", either.  If everyone was into that, they'd buy a Bolt/Volt and not worry about how \"cool\" the car is.  Legacy car makers have awesome \"self driving\" capabilities as well.  Witness lane-assist, adaptive cruise control, self parking, etc.\n\nTSLA is a perfect example of when you'd want to \"[not] believe the hype\".", "score": -4, "replies": [{"body": "to be honest...i'm not interested in Tesla because of their mission statement to save the earth. I'm interested in Tesla because of their cars and the future. Not to mention that their higher end Tesla's are essentially exclusive to those that can afford it. \n\nIt serves a similar base to Facebook and how they grew out of exclusivity (since you had to be invited or in college)...and look how they broke out. \n\nThere's a lot more...but i'm at work. ", "score": 1, "replies": [{"body": "Telsa builds cars.  Tough business.\n\nEdit:  I didn't downvote you, BTW.  :)", "score": 0, "replies": []}]}]}]}
