{"title": "Low fee, correction-proof, ETFs?", "selftext": "I'm moving my portfolio away from the high-fee, underperforming funds I got stuck with. I've liquidated all of the underperformers so far, leaving me with 40-50% cash. Looking for long term holds, and maybe even some steady securities with decent dividends. Pretty much anything that isn't going to pop with the current bubble\n\nOy! I meant things that haven't been too hyper inflated under the current tech bubble, not some goddam immortal golden goose.", "id": "8al7f3", "created_utc": 1523136145.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 22, "comments": [{"body": "That is asking a lot -- you have to take the good with the bad unless you have impeccable timing, and perhaps, a real insider view of a certain sector. Maybe you could look into VTI, VIG, and/or VDC.", "score": 4, "replies": [{"body": "What's your opinion on vanguard, I see their funds propped up everywhere but I'm worried about it being a product placement type situation as opposed to real competitive performance. Like why do they keep ranking so high?", "score": 1, "replies": [{"body": "Yeah, it could seem like there are shills on here. However, Vanguard is well regarded for its low fees, which is primarily why it ranks so high. Those low fees also mean higher returns for investors. The index fund itself was pioneered by Vanguard's founder, [Jack Bogle.](https://www.youtube.com/results?search_query=jack+bogle)\n\nWhen Warren Buffet bet that an index fund would outperform hedge funds over 10 years, he chose a [Vanguard S&P 500 fund.](https://investorplace.com/2018/01/warren-buffett-vanguard-advice/) Granted, any legitimate and well run S&P 500 fund should have won that bet, it is a great endorsement with no strings attached. ", "score": 2, "replies": []}, {"body": "Vanguard is a brokerage company not a type of stock or fund. They offer their own types of mutual funds and ETFs though. It’s important you know and understand the difference.\n\nVanguard is a reputable and good brokerage to keep your holdings with. There are other good ones out there as well. Vanguard is often ranked and recommended often because of their low fees and expenses.\n\nMost of the funds and ETFs offered by the big brokerages aren’t too different from one another in terms of what they offer and hold within them. The difference is usually with fees, expenses, and customer service.", "score": 1, "replies": [{"body": "Thanks. I know the difference already, I'm just skeptical of any sort of mass promotion of any such company as my portfolio was suspiciously weighted towards funds from a certain broker and Vanguard seems to be dominating any info about etfs, seemingly without significant benefit with regard to fees/performance. ", "score": 1, "replies": []}]}]}]}, {"body": "XLU (utilities) might fit the bill. Or maybe SPLV (low volatility stocks), though they have been hit hard.\n\nSome hedged choices include PUTW (put write) and DIAX (covered calls). The hedged etfs will get hit during a correction, but downside will tend to be a little less than VTI (total market) or SPY, VOO (S&P 500).", "score": 2, "replies": []}, {"body": "If i had this kind of information, i wouldn't be giving it to you for free.  \n\nTBH you're unlikely to find a \"recession proof\" stock. However, you could put it into various funds like HDV, SCHD, T, F, SO, etc that pay high dividends and that way you'll still get some gains in the form of dividends and covered call selling in down turns. ", "score": 2, "replies": []}, {"body": "\"Correction-proof\"?  Sure--US treasuries at 1%.\n\nYou can't get reward without risk.", "score": 2, "replies": []}, {"body": "So you want something that only goes up? I’m pretty sure there’s no such thing.", "score": 2, "replies": []}, {"body": "> correction-proof\n\nNo such thing", "score": 2, "replies": [{"body": "Cash", "score": 0, "replies": [{"body": "Inflation", "score": 3, "replies": []}, {"body": "Time value of money (TVM) meaning a dollar today is worth less tomorrow. Also known as inflation. ", "score": 1, "replies": []}]}]}, {"body": "If this bear continues, defensive, dividend-bearing stocks that produce staples like food, toothpaste, everything people will still need to buy when they can’t afford shiny new things. Keep some cash and cost-average into the market every month or so to pick up deals since everything is still overvalued, imo", "score": 1, "replies": [{"body": "The only thing that sucks about most consumer staples stocks and ETFs right now is that many of them are also overvalued as well. It’s true that they should face less volatility though but I would still expect some with them during a bear market, potentially more than we’ve traditionally seen in them.", "score": 1, "replies": [{"body": "Google low p/e high dividend stocks. Here in Canada, our market’s about as overvalued as yours, but I’ve found tissue paper, food, utilities at 16 p/e and under with dividends over 5%. They definitely don’t have much downside, and I’m sure you’ve got some fair-value stocks down there, too\n\nAlso, Google what stocks perform well in bears/recessions", "score": 1, "replies": [{"body": "I mean KHC is a shit show, it seems like amazon is dominating the current necessities trend but they're so overvalued plus no dividends ", "score": 1, "replies": []}]}]}]}, {"body": "I’m betting on DGRO and (probably should not be) MTUM.", "score": 1, "replies": []}, {"body": "Ally back 1.5% saving account \nFee free etf that withstands any recession ", "score": 1, "replies": []}, {"body": "Institutional money appears to be flowing into commodities right now on the expectation of inflation. Commodities and commodities linked equities could be a nice, uncorrelated, basket to increase your allocation to, and inflationary pressure is obviously increasing.\n\nActively managed commodities funds tend to outperform the ETFs because they have better roll strategies and cash management. The one I use with a 5 star Morningstar rating is SKNRX.", "score": -1, "replies": [{"body": "Why sknrx? It's been consistently and sharply down over the last ten years. ", "score": 0, "replies": [{"body": "Commodities as a whole have been in a major down-cycle. It’s one of the few asset classes that isn’t at all-time highs with elevated valuations. As you know, inflation has been quite low, but that appears to be changing.", "score": -1, "replies": []}]}]}]}
{"title": "US Economic Results: 4/9/18 - 4/13/18", "selftext": "Dear WSB:\n\nNext week's predictions/forecasts are below. I'm going to start by saying I fucking *hate* these numbers. They don't make sense, but changing my methodology will make affect prior forecasts' comparability, so I'm just going with it for now. Even the forecasters seem to have trouble pinning these down (the JOLTs report gets revised every month, for example), and they get the benefits of more data and foreknowledge, whereas I'm just plugging numbers into Excel and dicking around with averages.\n\n|| YoY | Actual | Forecast | Variance\n---|---|----|----|----\n**PPI (MoM) (Mar)**|\t4/10/2018|\t\t |0.1 \t|\n8:30 AM EDT|\t4/13/2017|\t -0.1|\t -   \t|0.00%\n||4/13/2016|\t -0.1|\t 0.2| \t-150.00%\n||4/14/2015|\t 0.2| \t 0.2| \t0.00%\n||4/11/2014|\t 0.5| \t 0.1| \t400.00%\n|\t\t\t\t\n||**Last 6 months**\t\t\n||3/14/2018\t |0.2 \t |0.1 \t|100.00%\n||2/15/2018\t |0.4 \t |0.4 \t|0.00%\n||1/11/2018\t |-0.1\t |0.2 \t|-150.00%\n||12/12/2017\t |0.4 \t |0.4 \t|0.00%\n||11/14/2017\t |0.4 \t |0.1 \t|300.00%\n||10/12/2017\t |0.4 \t |0.4 \t|0.00%\n|\t\t\t\t\n||**4/10/18 predicted**|**0.3**|**0.1**|**155.00%**\n|\n|**Core CPI (MoM) (Mar)**|\t4/11/2018||\t\t 0.2 \t\n|8:30 AM EDT\t|4/14/2017\t |-0.1|\t 0.2 \t|-150.00%\n||\t4/14/2016\t |-0.1|\t 0.2| \t-150.00%\n||\t4/17/2015\t |0.2 \t |0.2 \t|0.00%\n||\t4/15/2014\t |0.2 \t |0.1 \t|100.00%\n|\t\t\t\t\n||\t**Last 6 months**\t\t\t\n||\t3/13/2018\t |0.2 \t |0.2 \t|0.00%\n||\t2/14/2018\t |0.3 \t |0.2 \t|50.00%\n||\t1/12/2018\t |0.2 \t |0.2 \t|0.00%\n||\t12/13/2017|\t 0.1 \t |0.2 \t|-50.00%\n||\t11/15/2017|\t 0.2 \t |0.2 \t|0.00%\n||\t10/13/2017|\t 0.1 \t |0.2 \t|-50.00%\n|\t\t\t\t\n||**4/11/18 predicted**|**0.2**| **0.2**|**-19.79%** (predicted value is formula-driven; diff. stems from rounding)\n|\n|**JOLTs Job Openings (Feb)**|\t4/13/2018\t\t ||5.890 \t\n|10:00 AM EDT\t|4/11/2017\t |5.682 \t |5.655 \t|0.48%\n||\t4/5/2016\t |5.608 \t |5.500 \t|1.96%\n||\t4/7/2015\t |5.144 \t |5.010 \t|2.67%\n||\t4/8/2014\t |4.130 \t |3.990 \t|3.51%\n|\t\t\t\t\n||**Last 6 months**\t\t\t\n||\t3/16/2018\t |5.667 \t |5.890 \t|-3.79%\n||\t2/6/2018\t |5.978 \t |5.950 \t|0.47%\n||\t1/9/2018\t |5.925 \t |6.038 \t|-1.87%\n||\t12/11/2017|\t 6.030 \t |6.030 \t|0.00%\n||\t11/7/2017\t |6.091 \t |6.091 \t|0.00%\n||\t10/11/2017|\t 6.125 \t |6.125 \t|0.00%\n|\t\t\t\t\n||**4/13/18 predicted**|**6.156**|**5.890**|**4.52%**\n\n\n**EXPLANATIONS:**\n\n* Methodology: Avg.  of last 6 months actual results * [1 + (YoY simple growth rate / 12)] -- simplistic, sure, but probably still better than the non-farm forecasters.\n\n* Source: [worldeconomiccalendar.com](http://worldeconomiccalendar.com/)\n\n* I'm only planning to do forecasts for the reports that have a \"three bull\" rating. I also **WILL NOT** forecast crude oil inventories because it's a fucking pain in the ass. If you can't live without a forecast for crude oil, just look at what happened over the last few weeks, count how many times it beat v. missed, and expect the trend to follow whichever there's more of (although you should also consider things like weather, prices at the pumps, and so on).\n\n* \"Red,\" \"Boring,\" \"Green,\" are just for fun. I try to base them on real information, but don't get it twisted: THEY'RE GUESSES. If anything, I'm hoping people will take them as a springboard for discussion, since we really do need more real-talk.\n\n    Red = bad\n\n    Boring = markets are dancing around each other like those bitches in West Side Story\n\n    Green = /u/MrTrader1's mom's dick\n\n**WHAT TO EXPECT NEXT WEEK?**\n\n4/9/18: Boring\n\n4/10/18: Green\n\n4/11/18: Green\n\n4/12/18: Red\n\n4/13/18: Boring\n\nGuesses will be revised if/when news requires it. I don't factor Trump into my initial set, but as the week wears on, I do account for his dumbass shenanigans in my commentary and make revisions if needed.\n\n**HOW'D I DO LAST WEEK?**\n\n|| Actual | Predicted | Variance\n---|---|----|----|----\n|ISM Manufacturing PMI\t |59.3 \t |59.9 \t|-0.96%\n|ADP Nonfarm Employment Change\t |241.0 \t |219.9 \t|9.61%\n|ISM Non-Manufacturing PMI\t |58.8 \t |59.0 \t|-0.27%\n|Nonfarm Payrolls\t |103.0 \t |178.6 \t|-42.32%\n|Unemployment Rate\t |4.1 \t |4.0 \t|2.40%\n|Average Hourly Earnings (MoM)\t |0.3 \t |0.2 \t|28.57%\n\n**Daily Guesses:** 5/5 correct", "id": "8ai65q", "created_utc": 1523109226.0, "score": 50, "upvote_ratio": 0.91, "num_comments": 21, "comments": [{"body": "Betting Thursday will be red? Yeah, that's like betting I'm going to lose money this week and put a gun in my mouth: a sure thing\n\nEdit: pin this someone please! Not my comment, the post", "score": 34, "replies": []}, {"body": "[deleted]", "score": 19, "replies": [{"body": "If sideways were a color, what would it be? Gray?", "score": 3, "replies": [{"body": "Light red ", "score": 14, "replies": [{"body": "I like this, because options", "score": 11, "replies": []}]}, {"body": "Black typically UNCH", "score": 2, "replies": []}]}, {"body": "I wouldn't be surprised if there's more red next week, but I try not to incorporate the latest political developments into my initial guesses. This is why my recaps have a section for revisions, since it's a hell of a lot easier to predict what will happen on Tuesday when I know what happened on Monday.", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "He actually sent out kind of a pussy tweet earlier:\n\n> \"The United States hasn’t had a Trade Surplus with China in 40 years. They must end unfair trade, take down barriers **and charge only Reciprocal Tariffs**. The U.S. is losing $500 Billion a year, and has been losing Billions of Dollars for decades. Cannot continue!\"\n\nHe seems a little freaked out? Maybe I'm an idiot though.", "score": 2, "replies": []}]}]}]}, {"body": "Remember when someone went through the trouble of explaining XIV investing for us and LITERALLY THAT DAY XIV imploded?\n\n\n\nWhy hasn't the market imploded yet, guys?", "score": 11, "replies": []}, {"body": "TL;DR   RED", "score": 9, "replies": []}, {"body": "I’m personally a little worried if the CPI does beat like that the market will use the fed and inflation as its crutch again to go down. Monday will definitely be boring and I think Wednesday will be red either way. It’s like they just see the words FOMC or FED and everyone runs for the exits. ", "score": 8, "replies": [{"body": "Good call", "score": 1, "replies": []}]}, {"body": "M- roll the dice on fds\nT-TH- cash\nF- check if balance is negative. \nThanks OP! ", "score": 3, "replies": []}, {"body": "Last week I thought Monday was going to be green since Friday ended on Red. I was wrong and now I think Monday will be green since Friday ended in red. One Monday I’ll be right. Anyways I’ll be buying calls for Friday as they get cheaper.", "score": 3, "replies": [{"body": "Please pray for me I bought SPY calls Friday at close. ", "score": 2, "replies": [{"body": "No point in praying - God forgives sins, not debts", "score": 5, "replies": [{"body": "Shit ", "score": 2, "replies": []}]}, {"body": "Adding you to my prayers.", "score": 3, "replies": []}]}]}, {"body": "Wtf. 7 out of 7 now. ", "score": 2, "replies": []}, {"body": "Thanks for doing this.", "score": 1, "replies": []}, {"body": "Thanks for putting this together.  It's super useful\n\n...\n\n...\n\n...\n\nFaggot", "score": 1, "replies": [{"body": "That's \"dumbass faggot\" to you, buddy.", "score": 6, "replies": []}]}]}
{"title": "[Serious] Ultimate Guide to Bagholding Equities and ETFs", "selftext": "Suppose you bought right at the top and your position has moved against you. Now what do you do? Here is a list of things you can do.\n\n\n1. Nothing. Yup that is the first thing you could do. You could just wait and hope that the stock goes back up.\n\n2. Panic Sell. All you do is hit the sell button and realize your loses. Great if you need a tax break.\n\n3. Tax loss harvest. Similar to number 2, works great for ETFs, kinda hard to do for equities. So suppose you bought the S&P 500 right at the top and it drops. All you do sell the ETF for a loss and buy something similar. For example, you could sub out SPY for QQQ (another example is swapping MU for AMAT) and once 30 days has passed, you can go back to opening SPY and successfully harvest losses. Note that the ETF that you swap it out for must not be \"substantially identical,\" aka you can't sub SPY for VOO (since both of them track the S&P 500).\n\n4. Double down/average down. As the name implies, as the price goes down, you buy more. You should only do this if you are still bullish.\n\n5. Selling covered calls + Double down. (If you are bearish in the short term but bullish in the long term)\n\nNote this requires a Level 1 Options. If you can't get approved for a level 1 options account, then you are a true faggot. Here is how to this strategy. Buy more shares so that your total amount of shares is a multiple of 100. For example if you have 48 shares of NVDA, then you go out and buy 52 more shares. Next you go out and sell some OTM covered calls. Selling calls with a week or two works best for this in order to maximize Theta decay.\n\n6. Selling naked calls. Note you have to have naked calls from your broker and you also need a margin account. Basically is the same thing as above except instead of buying 52 more shares of NVDA, you just selling a call. Don't get too greedy with this. If the share shoots up, you will get cucked.\n\n7. Buy a put. Pretty self explanatory.\n\n8. Collars. Can be combined with 6 in order to cap losses. For every 100 shares you own, you sell an OTM call and buy an OTM put. Works great if you want to protect yourself from an unexpected to drop in price but also don't want to pay for an OTM put. Recommended expiration date (1-2 years).\n\n9. Stock repair strategy. (Requires options and a margin account). Suppose you don't want to commit any more money to a trade and all you want to do at this point is just break even. Here is what you can do, buy a ATM call and sell two OTM calls. The price of the ATM or close to ATM call should be equal to the price of the two OTM calls or as close to equal. This way you don't have to commit any more capital to the trade. Recommended expiration date is 1-2 months out.\n\nHere is a example.\n\nSuppose you bought Facebook right before the Cambridge Analytica thing. Let's say you bought 1000 shares @ 172.5. Now it is March 23, and well you are down around $13k. What you can do this buy 10 $162.5 calls (May 4th) for $1.20 and sell 20 172.5 calls @ $0.6 (Try to get your debit/credit under 5 cents, just put an offer and eventually it will get filled). The goal of this strategy is to lower your cost basis in exchange for profit potential.\n Now there are three cases.\n1. Facebook tanks even more. In this case you collect that 0.05 Premium per share (since we have a credit). Please note that you shouldn't try to maximize credit for this strategy.\n\n2. Facebook recovers a little bit to $160, you net even on expiration date since your call that you bought will expire worthless and the two calls you sold will expire worthless. Watch your trades however since sometimes if it recovers a little bit, you can close you your trade for a profit. \n\n3. Facebook expires between $162.50 and $172.50, this is the best result as your $162.50 will expire profitable and the two $172.50 calls will expire worthless.\n\n4. Facebook gaps up past $172.50, you will still end up profitable at the end since you own the underlying, however in this situation you would have made more money not using this strategy. \n\n\nPlease do a quick Google search before attempting any of the strategies that involve options if you don't know what you are doing.\n\n\nFAQ\n\n\nQ: Can I do the stock repair strategy for options? \n\nA: No, you can't buy an option for an option unless if you have an ISDA. If you don't know what an ISDA is, fuck off and go watch The Big Short. Even if you do have an ISDA, calls-on-calls are very illiquid assets.\n\nIf there was anything unclear or you have questions, please ask below.\n\nQuestions:\n\n\nFrom /u/adonisbosq\nWhen buying a put, should I buy ATM put or slightly OTM for around two months? or around how long?\n\nWhere you choose to ATM or an OTM put is honestly up to you. As for the strike price, I would select an expiration on the longer end of the spectrum and then selling it back later because Theta decay follows an exponential curve with it decaying fastest on the week leading up to expiration. \n\nThe downside to just buying puts are that puts are expensive. An alternative is run a collar, which cap your losses and your gains in exchange. Often times you can run up a collar very cheaply, or for free, or even for a net credit.\n\nTo construct a collar, you buy a protective put and you sell a covered call. The beauty of collars is that the put and covered call don't even have to expire on the same week.\n\nHere is an example of a case in which running a collar makes a lot of sense. Since many of you trade Micron, I'll use Micron as an example. So suppose you own Micron and it made a very nice run up before earnings and you are afraid that Micron may disappoint Wall Street's expectations.\nFor this example, the date is March 16, 2018 and Micron is trading @ $60.\n\nOne thing you could do is buy the May 18th Put @ 57.5 for $3.80 and sell the May 18th Call @ 65 for $3.95.\nLet's consider 3 cases.\nCase 1: Micron trades sideways throughout earnings (57.5 to 62.5). You will end up slightly ahead $0.15 a share.\nCase 2: Micron tanks below 57.5. Well aren't you glad you bought that put? You can now either sell the option contracts and the shares of Micron, collect your tendies and post on WSB some shitty memes, wait around till expiration arrives or exercise them early. Exercising them early is almost never recommended as you lose out on all the extrinsic value (unless if you doing some dividend play or something). \nAs of 4/6/18, you could have bought back the call for $0.20 and sold that put for around $9.65 and would have been up bigly.\nCase 3: Micron goes straight to the moon (Let's say Micron is now at $70). At expiration, you would have missed out on all those gains from the moon. Your put would expire worthless and you would be forced to sell your shares of Micron @ 62.50, however considering that in the end you still made $2.50 a share from that $60, this isn't that bad of a result and while you missed out on some big gains, you at least made money and can deploy that on some trades. \n\nNow if you were just to buy the 57.5 for $3.80, here are your results.\nCase 1: Micron trades sideways, you are now out the $3.80 premium, unless you sell it early, in which you can recoup some of the premium.\nCase 2: Micron tanks, you can either wait around until expiration or you can sell the put and share early and you will be very glad that you did so. Note that Micron has to go below 53.70 for you to start to break even.\nCase 3: Micron goes to the moon, you can collect all the gains from the moon (and you will be better off than if you had the collar) but you will be out the premium on the put.\n\nQuestion from /u/PesoCEO22\n\n\ndo you come here often? I couldve used this when i Bought MUSQ @ $59\n\nI lurk around here every now and then. Hopefully now you will know what to do when you do buy high.\n\nQuestion from /u/fe2sio4\n\n\nWhat’s the capital requirement for ISDA again because I have 30m?\n\nOoh you are just a bit short. All you need is $1.47 Billion more.", "id": "8akw5e", "created_utc": 1523133420.0, "score": 135, "upvote_ratio": 0.99, "num_comments": 20, "comments": [{"body": "How do I cope with being a massive faggot?", "score": 42, "replies": [{"body": "make a bad prediction about spy being green  on a day and ask mods to ban", "score": 11, "replies": [{"body": "How do I go long on mods?", "score": 4, "replies": [{"body": "Tell them u will eat a shoe\n", "score": 10, "replies": []}]}]}]}, {"body": "[seriously] decent advice in here. Thanks OP", "score": 21, "replies": [{"body": "[seriously] you're one dumb faggot. ", "score": 9, "replies": [{"body": "#hashtag", "score": 2, "replies": []}]}]}, {"body": "When buying a put, should I buy ATM put or slightly OTM for around two months? or around how long?", "score": 4, "replies": [{"body": "Depends a lot on how you are feeling. \n\nAre you very certain that it’s going down far? Does the underlying have any catalyst coming up that will push it down? Willing to look at a paper loss awhile and wait as the stock price falls? Buy OTM\n\nNot so sure it will drop that much? Willing to pay more premium to have a better chance (percentage) of making money? Buy ATM \n\nEdit: these are assuming you’re looking to not exercise the contract (sell it back into the market before expiration) ", "score": 4, "replies": [{"body": "Thanks. What is your opinion on the expiration? Around 1 month? 2 month? Weekly at ATM?", "score": 1, "replies": [{"body": "I really don’t buy options often but find that buying further out helps protect from theta burn. But I mean you’re asking questions that are kinda rooted in your opinion on how the stock will perform. \n\nIf you buying FD puts better have a strong opinion that stock is going down. ", "score": 1, "replies": [{"body": "This is some really good advice. I don't mess with those complex maneuvers because I don't want to get in too deep, but buying deeper ITM/longer expiry helps to moderate leverage.", "score": 2, "replies": []}]}]}]}]}, {"body": "[Serious] do you come here often? I couldve used this when i Bought MUSQ @ $59", "score": 4, "replies": [{"body": "Are you still bullish on MUSQ and are you willing to give up profit potential in exchange for a higher probably to break even?", "score": 1, "replies": []}]}, {"body": "What do you think of my play here?\n\nhttps://www.reddit.com/r/wallstreetbets/comments/89s8y8/the_waiting_is_so_tough_playing_mu_bounce/", "score": 1, "replies": [{"body": "Overall not a bad trade given that IV is elevated. If I were you I would have closed out by now. As a general rule of thumb, I would aim to take ~25% of the maximum profit on Iron Flies. Getting 100% of it is rare and the risk/reward isn't really worth it. Keep in might that whenever Theta is on your side, Gamma is against you.", "score": 2, "replies": [{"body": "Thanks. I did close it all in two legs, finishing with a profit although less than I could have. Then I put a new long position on during Friday's dip.", "score": 1, "replies": []}]}]}, {"body": "So much text. Can you put it in a bright picture?", "score": 1, "replies": []}, {"body": "Great post, thank you for sharing this.", "score": 1, "replies": []}, {"body": "Thank you", "score": 1, "replies": []}]}
