{"title": "Significant Insider Trading Activity (Last 7 Days)", "selftext": "\nThis is a list of the top 20 companies that experienced the largest change in insider shares in the last seven (7) days.\nThe SEC defines an insider as any officer, director or 10% shareholder. It is not illegal for these people to buy or sell their own shares. In fact, since most of them get paid in stock options, it is expected. However, it is illegal for them to trade on inside information that has not been made public. So for example if there are drug trial results that are bad and not public, insiders cannot dump shares. That said, many people have observed that insiders - in general - seem to have a good track record at timing their purchases.\n\n## Largest Insider Buying (Last 7 Days)\nCompany|Count|Direct Changed|Indirect Changed|Total Changed\n--------|-----:|-----:|-----:|--------:  \n[TERP / TerraForm Power Inc.](https://fintel.io/n/us/terp)|1|0|60,975,609|60,975,609 \n[CLNE / Clean Energy Fuels Corp.](https://fintel.io/n/us/clne)|1|0|50,856,296|50,856,296 \n[FCRIX / FS Credit Income Fund](https://fintel.io/n/us/fcrix)|3|1,326,438|3,296,181|4,622,618 \n[GFN / General Finance Corp.](https://fintel.io/n/us/gfn)|13|594,838|1,197,454|1,792,292 \n[DISC / Discovery Communications, Inc.](https://fintel.io/n/us/disc)|1|0|1,407,000|1,407,000 \n[MGTX / MeiraGTx Holdings plc](https://fintel.io/n/us/mgtx)|1|0|1,383,333|1,383,333 \n[AMNL / Applied Minerals, Inc.](https://fintel.io/n/us/amnl)|2|1,125,000|0|1,125,000 \n[MAGE / Magellan Gold Corporation](https://fintel.io/n/us/mage)|1|1,000,000|0|1,000,000 \n[SRNA / Surna Inc.](https://fintel.io/n/us/srna)|1|781,250|0|781,250 \n[VICL / Vical Inc.](https://fintel.io/n/us/vicl)|1|670,897|0|670,897 \n[PKTX / ProtoKinetix, Inc.](https://fintel.io/n/us/pktx)|2|0|652,200|652,200 \n[MRTX / Mirati Therapeutics, Inc.](https://fintel.io/n/us/mrtx)|2|193,050|400,000|593,050 \n[IFF / International Flavors &amp; Fragrances, Inc](https://fintel.io/n/us/iff)|6|582,810|0|582,810 \n[IMMU / Immunomedics, Inc.](https://fintel.io/n/us/immu)|1|0|575,000|575,000 \n[IDI / IDI, Inc.](https://fintel.io/n/us/idi)|1|500,000|0|500,000 \n[MIC / Macquarie Infrastructure Company LLC](https://fintel.io/n/us/mic)|3|160,800|291,369|452,169 \n[OESX / Orion Energy Systems, Inc.](https://fintel.io/n/us/oesx)|7|406,750|0|406,750 \n[FLDM / Fluidigm Corp.](https://fintel.io/n/us/fldm)|2|0|324,680|324,680 \n[NCMI / National CineMedia, Inc.](https://fintel.io/n/us/ncmi)|1|0|297,600|297,600 \n[PANW / Palo Alto Networks, Inc.](https://fintel.io/n/us/panw)|2|294,247|0|294,247 \n[PRPL / Purple Innovation, Inc.](https://fintel.io/n/us/prpl)|1|0|288,308|288,308\n\n## Largest Insider Selling (Last 7 Days)\nCompany|Count|Direct Changed|Indirect Changed|Total Changed\n--------|-----:|-----:|-----:|--------:  \n[LULU / lululemon athletica inc.](https://fintel.io/n/us/lulu)|4|0|-30,017,935|-30,017,935 \n[FBC / Flagstar Bancorp, Inc.](https://fintel.io/n/us/fbc)|3|-8,000,000|-16,000,000|-24,000,000  \n[SABR / Sabre Corporation](https://fintel.io/n/us/sabr)|2|0|-17,512,660|-17,512,660 \n[WMT / Walmart, Inc.](https://fintel.io/n/us/wmt)|9|0|-11,741,154|-11,741,154 \n[OPTN / OptiNose, Inc.](https://fintel.io/n/us/optn)|2|0|-5,750,000|-5,750,000 \n[SYY / SYSCO Corp.](https://fintel.io/n/us/syy)|2|0|-4,557,878|-4,557,878 \n[RLH / Red Lion Hotels Corp.](https://fintel.io/n/us/rlh)|2|-3,863,401|0|-3,863,401 \n[CVRG / Converge Global, Inc.](https://fintel.io/n/us/cvrg)|6|-3,535,000|0|-3,535,000 \n[MEDP / Medpace Holdings, Inc.](https://fintel.io/n/us/medp)|1|0|-3,000,000|-3,000,000 \n[IFMK / iFresh Inc.](https://fintel.io/n/us/ifmk)|2|-897,361|-897,361|-1,794,722 \n[ALRM / Alarm.com Holdings, Inc.](https://fintel.io/n/us/alrm)|4|0|-1,746,845|-1,746,845 \n[TNTR / Tintri, Inc.](https://fintel.io/n/us/tntr)|1|0|-1,550,000|-1,550,000 \n[SENS / Senseonics Holdings, Inc.](https://fintel.io/n/us/sens)|2|0|-1,500,000|-1,500,000 \n[NYT / New York Times Co.](https://fintel.io/n/us/nyt)|3|-1,105,000|0|-1,105,000 \n[PHGO / PhotoAmigo, Inc.](https://fintel.io/n/us/phgo)|1|-1,024,167|0|-1,024,167 \n[WMS / Advanced Drainage Systems Inc.](https://fintel.io/n/us/wms)|1|0|-900,000|-900,000 \n[SSY / SunLink Health Systems, Inc.](https://fintel.io/n/us/ssy)|1|0|-699,513|-699,513 \n[GALT / Galectin Therapeutics Inc](https://fintel.io/n/us/galt)|10|-53,914|-636,280|-690,194 \n[TWTR / Twitter, Inc.](https://fintel.io/n/us/twtr)|1|-49,286|-632,956|-682,242 \n[HPE / Hewlett Packard Enterprise Company](https://fintel.io/n/us/hpe)|3|-649,112|0|-649,112\n\n*Count* column is number of transactions. *Direct Changed* columns are shares bought/sold\nthat were held *directly* by the reporting person. *Indirect changed* are shares bought/sold\nthat were *indirectly* held by the reporting person, such as those held by spouses or other family members.\n\nSource: [Fintel.io/insiders](https://fintel.io/insiders)", "id": "8rs99v", "created_utc": 1529254063.0, "score": 113, "upvote_ratio": 0.94, "num_comments": 12, "comments": [{"body": "lulu profit taking for sure, that stock has been a rocket lately", "score": 12, "replies": [{"body": "I’m so salty about lulu.  Had it on my watchlist, because I noticed it bounced back and forth between ~$50-$80.  I was waiting for it to dip down, then it shot up to $100, not it’s almost at $130.  Smh 🤦‍♂️ ", "score": 3, "replies": [{"body": "Pretty much me too. It did nothing for so long ", "score": 1, "replies": []}]}]}, {"body": "Wasn’t TERP mainly the new incoming CEO? I think that’s a pretty decent vote of confidence ", "score": 9, "replies": [{"body": "If you click through it looks like it was Brookfield Asset Management making a big purchase. I don't know Brookfield's historical performance but in general that would be a positive sign.", "score": 4, "replies": []}]}, {"body": "This is good information.  Thanks for putting the time and effort in the data.", "score": 5, "replies": []}, {"body": "It’s important to keep in mind that these moves are frequently meaningless — just part of 10b5-1 plans without any fancy scheming. Perfect example is Zuck’s well-documented selling of his fb stock over several months last year and early this year. (The stock is higher now, so his selling doesn’t seem very well-timed).", "score": 4, "replies": [{"body": "I can actually provide this report with the 10b5 trades excluded. I don't know why I haven't done that already.", "score": 8, "replies": [{"body": "Please and thank you. ", "score": 2, "replies": [{"body": "I'll do this for next week's report.", "score": 4, "replies": [{"body": "🙏 ", "score": 2, "replies": []}]}]}, {"body": "I wonder if there's value in having a column for 10b5 trades too? Even though they're supposed to prevent it, sometimes those seem incredibly well timed too. Either way, keep up the great work!", "score": 1, "replies": []}]}]}]}
{"title": "r/StockMarket Live Discord chat room (Chart bot commands and more!)", "selftext": "[removed]", "id": "8rtxcg", "created_utc": 1529268571.0, "score": 40, "upvote_ratio": 0.9, "num_comments": 13, "comments": [{"body": "All hail Cy :D  Great post.  Chat room has been growing leaps and bounds.  Gonna hit that 1000 online soon.", "score": 3, "replies": []}, {"body": "When clicking the link it said “link expired or unavailable”", "score": 1, "replies": [{"body": "hmm ... link seems to pull up just fine for me.\n\nare you still getting that message?", "score": 1, "replies": []}]}, {"body": "No it seems to be working fine now ", "score": 1, "replies": []}, {"body": "is this working?", "score": 1, "replies": [{"body": "should be. what seems to be the issue?", "score": 1, "replies": []}]}, {"body": "When do you guys think the bull run will end", "score": 1, "replies": []}, {"body": "Invite link expired - if anyone can send me a current one that would be appreciated.", "score": 1, "replies": []}, {"body": "Hai guys ....on which day we buy the stock....", "score": 1, "replies": []}]}
{"title": "Cheap, diversified tech stock with cloud exposure", "selftext": "Is Cisco a good bet here? I know they are still early on in their transition to services and software but they seem to have got things back on track. I don't know much about the industry, but they still seem to be a respected name and they have the right people in charge. I own Google and Apple and want just a small amount of a value name in tech that doesn't have a ridiculous PE like some of these newer names in the cloud business. Does any one work in tech and see the further frowth potential for cisco?\n\nEdit: forgot to mention I own MU and will probably sell about half of my position on wednesday and was looking to replace them with a good buy and hold. ", "id": "8rrskg", "created_utc": 1529249702.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 18, "comments": [{"body": "MSFT", "score": 7, "replies": [{"body": "Everytime I see msft I get a lil chubbs. Looking at their growth and protected income from their products. Woohee. ", "score": 2, "replies": []}]}, {"body": "I would definitely put money into Microsoft over Cisco. It is a huge company in the cloud space but also diversified into a bunch of other areas with potential for further growth, it has good leadership, and a very nice dividend. \n\nNevertheless, there's probably nothing wrong with putting more money into Apple.", "score": 4, "replies": [{"body": "That's an option I guess. I think I'd rather put money in apple though. I owned Microsoft for a little while and they are a solid company, but I think they wont grow at the same rate as google or apple. I want to get a stock that has potential to really run. Cisco used a lot of their cash to really put them in a position to be the next tech stock to break out. I am not really looking for steady growth with this trade. Just want to add a little risk reward as I already have tons of money in blue chips with high PEs. ", "score": -2, "replies": [{"body": "> I want to get a stock that has potential to really run.\n\nIf that is the case, you might want to just keep your money in $MU. ", "score": 2, "replies": [{"body": "Well I changed my mind. I am going to hold about half of my position in MU and instead of Cisco, I'm going to buy $T. Needed a telecom stock and pretty good entry point here. MU and google will be my cloud plays for now I guess ", "score": 2, "replies": [{"body": ">Needed a telecom stock\n\nI'm not sure that anyone needs a telecom stock. Telecoms in general have done poorly as of late. If you take a look at Vanguard's telecom ETF [$VOX](https://finance.yahoo.com/chart/VOX#eyJTWSI6W1siVk9YIixudWxsLDAsMF0sWyJeR1NQQyIsIiM3MmQzZmYiLDIsMF1dLCJUUyI6WzEsIndlZWsiLG51bGwsWyJ5ZWFyIiw1LG51bGxdXSwiVVMiOlswLDEsMV0sIkNTIjpbImxpbmUiLCJsaW5lYXIiLDYuMjA2ODk2NTUxNzI0MTM4LG51bGwsbnVsbCwiIzAwODFmMiJdLCJTVCI6eyJ2b2wgdW5kciI6eyJ0eXBlIjoidm9sIHVuZHIiLCJpbnB1dHMiOnsiaWQiOiJ2b2wgdW5kciIsImRpc3BsYXkiOiJ2b2wgdW5kciJ9LCJvdXRwdXRzIjp7IlVwIFZvbHVtZSI6IiMwMGIwNjEiLCJEb3duIFZvbHVtZSI6IiNGRjMzM0EifSwicGFuZWwiOiJjaGFydCIsInBhcmFtZXRlcnMiOnsiaGVpZ2h0UGVyY2VudGFnZSI6MC4yNSwid2lkdGhGYWN0b3IiOjAuNDUsImNoYXJ0TmFtZSI6ImNoYXJ0In19fSwidiI6IjAuMS4wIiwibWluIjoxfQ==) compared to the S&P 500 over the past five years, the difference in returns is huge. $T is no exception. So, at the very least, $VOO seems like a much better buy, especially since this bull market has not yet died. However, there are tons of stocks that I would deem better buys even if you are not interested in Microsoft (or Cisco). \n\nInstead of a telecom stock, I'd argue everyone needs a financial services stock -- right now, Mastercard or Visa. ", "score": 1, "replies": [{"body": "I have some V already. I definitely want in on T at this level because I'm not trading it. Gonna hold that one the rest of my life because of the dividend and the fact that it's probably the best in its class and cheap. I don't think ETF's will be a part of my position this year because it is a stock pickers market and I think expecting the entire market to go up the way it did last year is too much. The pullbacks in certain sectors have created opportunities and I think I already have pretty big positions in stocks that are most responsible for broad ETF gains. Hell even if T stays the same price I will still get 6% yield and a blue chip added to my portfolio. Long term I feel better about that than just buying an ETF that I will sell later this year for maybe a slightly better yield. Not worth the 20 or 30 bucks. I'd rather get into T at this multiple. ", "score": 1, "replies": [{"body": ">Hell even if T stays the same price I will still get 6% yield and a blue chip added to my portfolio.\n\nI've heard this [before.](https://www.reddit.com/r/stocks/comments/73dwp7/my_dad_has_18_million_dollars_worth_of_ge_what/dnprbqf/)", "score": 1, "replies": [{"body": "Unless people stop using the internet and mobile devices I don't see this being a GE situation. ", "score": 1, "replies": []}]}]}]}]}, {"body": "I am getting out of MU at the end of the year. Too much downside. Cisco seems to have the growth potential without the volatility and it also pays a nice dividend. ", "score": 0, "replies": []}]}]}]}, {"body": "Go with MSFT or Amazon.\n\nCheap doesn't mean shit. You invest in the best. Period. ", "score": 2, "replies": [{"body": "Watch out with Amazon they are doing some horrible business practices. Like selling false brands for cheap prices and just read up on their labor practices.  Companies that pay more than average for employees could always lower their wages Amazon can't and won't.", "score": 1, "replies": [{"body": ">Watch out with Amazon they are doing some horrible business practices.\n\nTell that to Comcast, Facebook, United Airlines, Wells Fargo, EA, Fox, Apple, Wal-Mart...the list is really endless and nothing really matters or changes unless it's a circus company that uses animals.", "score": 3, "replies": [{"body": "it will cost them costumers if they sell fake products as real and if the CEO is on it, it will cost amazon on the short term. none of those companies have as worse labor practices as amazon. Edit: Amazon also has a high premium at the moment.", "score": 1, "replies": []}]}]}, {"body": "Cisco's new software looks pretty legit and I like their acquisitions. Microsoft's thing is data centers and I don't think they will be able to compete with google or amazon in the long term. They have grown that segment of their business very well and that's why they have run up, but they have a lot of other bets that I am not interested in long term. Like I posted earlier, I'd rather just put more into apple or google than to start a MSFT position.   ", "score": 0, "replies": []}]}, {"body": "Cisco", "score": 1, "replies": []}, {"body": "SKYY", "score": 1, "replies": []}]}
{"title": "Apple at $200", "selftext": "Do you think Apple will hold or even hit this level $200 per share Yes or No? Also please explain your reasoning why you believe so and any facts you have to support that reason.", "id": "8rtnnm", "created_utc": 1529266265.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 10, "comments": [{"body": "This sounds like a question on an exam.", "score": 41, "replies": [{"body": "This. My rate starts at $250/hour for this bullshit. ", "score": 20, "replies": []}, {"body": "Lmfao I had the same thought ", "score": 7, "replies": []}]}, {"body": "What do YOU think op?what's YOUR answer?can you explain YOUR reasoning?", "score": 17, "replies": []}, {"body": "What time frame? Eventually it will get to 200. Their balance sheet is too strong and the cash keeps flowing. The stock is still pretty cheap compared to other large cap tech stocks and as long they continue to grow their services revenue and have a successful launch of the 3 iphones later this year you will see 200 by the end of the year. On a long enough time frame though, their massive share buyback program alone will keep the stock growing at a healthy rate. ", "score": 3, "replies": []}, {"body": "Yes... I believe it well... and probably on the next up swing. Most people I know will continue to buy Apple products and pay the extra cost simply because it says or is Apple. They are innovating and continually improving products faster then anyone (most of the time... not every time). When I see things like my ( very senior) grandparents going and buying a new iPad, I can’t help but see it go up ... and way way up. \n\nJust my 2 cents... take it or leave it. ", "score": 2, "replies": [{"body": "I agree it will eventually hit 200 but Apple isn’t innovating much lately. especially compared to its competitors ", "score": 3, "replies": []}]}, {"body": "By this time next year, yes it will. When it first breaks 200 it will sway back in forth, but eventually be above $200 for good", "score": 1, "replies": []}, {"body": "Could go up, could go down ", "score": 1, "replies": []}]}
{"title": "NVDA joining S&P 100, does that mean the stock is going to jump?", "selftext": "I have July calls so this would be great news.", "id": "8rog6p", "created_utc": 1529206043.0, "score": 11, "upvote_ratio": 0.92, "num_comments": 12, "comments": [{"body": "S&P100 isn't nearly as heavily tracked as SPX, so the impact will be minimal.  ", "score": 15, "replies": []}, {"body": "Literally you all retards for asking questions like this in this sub. Nobody here knows jack shit. When AMD was admitted to S&P index a year ago, everybody was telling about institutions that had to buy in now. Did it do something major to the share price? Not really. Do your own fucking research faggots. ", "score": 22, "replies": [{"body": "Is that a Wall Street quote?", "score": 1, "replies": []}, {"body": "Well that was uncalled for. ", "score": -20, "replies": [{"body": "It's just how we talk here stop being a lil bitch", "score": 22, "replies": []}]}]}, {"body": "yes, since ETFs that track S&P will have to buy NVDA stocks but it won't go up much because they are already in S&P 500", "score": 18, "replies": [{"body": "Cool, how much do you think itll go up?", "score": -6, "replies": [{"body": "not much since nvidia is already in s&p 500", "score": 26, "replies": []}, {"body": "Bout tree fiddy", "score": 6, "replies": []}]}]}, {"body": "I have NVDA calls and need this bitch to go up.", "score": 3, "replies": []}, {"body": "no", "score": 1, "replies": []}, {"body": "No one gives a shit about the S & P 100.", "score": 1, "replies": []}]}
{"title": "Seriously are meme stocks just picked for the acronym???", "selftext": "Manslut bitch fag\n\nMu appl nvdia sogo (lulu or lockheed n ulta, this is kinda forced i guess) tencent baba iqiyi tesla crm huya fb amzn goog", "id": "8rpgqx", "created_utc": 1529219100.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 10, "comments": [{"body": "This post is even less sensible than most posts here, and that's really saying something", "score": 54, "replies": [{"body": "Well he did spell out MANSLUT BITCH FAG so there's that", "score": 11, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "Huya!", "score": 0, "replies": []}]}]}]}, {"body": "Nah👋 we just like winners. Loser", "score": 8, "replies": []}, {"body": "because I am a profitable company", "score": 5, "replies": []}, {"body": "Op your autism is showing", "score": 2, "replies": []}, {"body": "You forgot HUYA, fag. ", "score": 2, "replies": [{"body": "Oops", "score": 1, "replies": []}]}, {"body": "no you fag", "score": 1, "replies": []}]}
{"title": "Tell me why this is dumb idea", "selftext": "Nvidia enters the snp 100 before bell Wednesday. \n\nWhy isn't buying an ATM weekly at close Tuesday and selling at 9:31 Wednesday a good idea?\n\nThe reasoning being that the s&p 100 ETF will buy them Wednesday morning,  causing a small bump\n", "id": "8rqyp1", "created_utc": 1529241493.0, "score": 12, "upvote_ratio": 0.8, "num_comments": 13, "comments": [{"body": "Because your title was already dumb", "score": 27, "replies": []}, {"body": "Premiums are fat on this one", "score": 10, "replies": [{"body": "Ya, the theta is pretty absurd too, like 0.25 on 2.25 contract ", "score": 4, "replies": []}]}, {"body": "Cause it's yours", "score": 6, "replies": []}, {"body": "OP please explain your reasoning. ", "score": 5, "replies": [{"body": "Added", "score": 6, "replies": [{"body": "Thanks my guy. ", "score": 5, "replies": []}]}]}, {"body": "The bump might not be that large because NVDA is already in S&P 500 so most ETF already have NVDA.\n\nI don't think it can drop though so might as well try.", "score": 2, "replies": []}, {"body": "P ", "score": 1, "replies": []}, {"body": "It probably won’t go up just from that, but there was a dip on Friday so it will probably go up anyway. ", "score": 1, "replies": []}]}
{"title": "Just a reminder the optimal portfolio is 50% AMZN 50% JD", "selftext": "[removed]", "id": "8rt45m", "created_utc": 1529261479.0, "score": 17, "upvote_ratio": 0.9, "num_comments": 19, "comments": [{"body": "uh.. 100% Amazon.. ", "score": 11, "replies": [{"body": "uh.. 100% DPZ", "score": 2, "replies": [{"body": "Someone gets it", "score": 1, "replies": [{"body": "Greeen every day gurrl", "score": 2, "replies": [{"body": "Happy Monday!", "score": 1, "replies": [{"body": "Too fucking legit!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Don't tease me. I'm 50% amzn, 30% JD, 20% BAC", "score": 5, "replies": [{"body": "That's an ideal blend honestly ", "score": 1, "replies": [{"body": "Don't jinx me bro. ", "score": 2, "replies": [{"body": "I'll down-vote myself... just to be safe ", "score": 1, "replies": []}]}]}]}, {"body": "Use leverage so you can go 100%+ into MU", "score": 1, "replies": [{"body": "MU is a dead company though. My dad use to be a director for their ssd and nand divisions. They are being outpaced by Samsung tech wise and the Chinese groups are chipping at the heels", "score": 1, "replies": [{"body": "You sound like a real cockbuyer. ", "score": 1, "replies": []}]}]}, {"body": "UH IM 80% JD 15% IQ 5% AMD", "score": 1, "replies": []}, {"body": "50% AMZN, 50% JD, 50% AMD. ", "score": 1, "replies": [{"body": "150%? Is 50% on margin?", "score": 0, "replies": []}]}, {"body": "yea but who can afford Amazon options dammit 1 contract is $2000 and don't tell me to buy far OTM contracts delta is nothing on those ", "score": 0, "replies": [{"body": "Dat dem gamma creeps hoist it up right quick tho.", "score": 1, "replies": []}, {"body": "Or 19,000 for a LEAP hahahaha ", "score": 1, "replies": []}]}]}
{"title": "Tesla just received a 500 billion contract from China", "selftext": "[deleted]", "id": "8rtghj", "created_utc": 1529264456.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 11, "comments": [{"body": "Fag trolling = permaban\n\nJust u know OP", "score": 5, "replies": []}, {"body": "Source? ", "score": 4, "replies": [{"body": "500 billion ", "score": -1, "replies": []}]}, {"body": "Source you lying turd", "score": 5, "replies": [{"body": "500 BILLION", "score": -1, "replies": []}]}, {"body": "stupid fag", "score": 3, "replies": []}, {"body": "B A N N E D", "score": 3, "replies": []}, {"body": "Mods, please ban OP.", "score": 3, "replies": []}, {"body": "Fat pussy", "score": 2, "replies": []}, {"body": "Fuck yeah. Yall know any good sites for me to browse yachts? ", "score": 1, "replies": []}, {"body": "ban", "score": 1, "replies": []}]}
{"title": "so, what happens to TSLA on Monday?", "selftext": "does it fall, go up, or go in circles?", "id": "8rv09u", "created_utc": 1529278606.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 17, "comments": [{"body": "to the mooooon ", "score": 18, "replies": []}, {"body": "Musk to the moon 🌝🚀", "score": 11, "replies": []}, {"body": "It goes up and down a lot", "score": 10, "replies": []}, {"body": "Nothing but calls, let's get some tendies.", "score": 7, "replies": []}, {"body": "Musk going crazy is good for TSLA ", "score": 6, "replies": []}, {"body": "Fall... bigly. I’m shorting. Cars been on fire, ceo buying 25mil and openly colludes/manipulates price out 3 weeks. We shorties ain’t born yesterday.", "score": -5, "replies": [{"body": "Damn bruh.  You still havn't wised up to the fake news surrounding Tesla?\n\nLiterally every time a negative news story comes out, no one believes it and the stock jumps.\n\nBuy calls.  Thank me later", "score": 15, "replies": [{"body": "Sheeeeet heeeeel no dawwwg. I’m sticking to my guns, buying 300 calls out August 17th and prolly some few weeks out too. AllThis BS is gunna backfire for musk this time.\n\nWatch n Learn", "score": -5, "replies": [{"body": "Then why you buying calls, fag?", "score": 7, "replies": [{"body": "lol - obviously I meant puts. Fag!", "score": -4, "replies": []}]}]}]}, {"body": "Get rekt ", "score": 13, "replies": [{"body": "Wat??", "score": -6, "replies": []}]}, {"body": "It's the most shorted stock but has a hard time staying down. That doesn't sound good to you does it?", "score": 6, "replies": []}]}, {"body": "$MU to moon, Musk to MARS", "score": 0, "replies": []}, {"body": "What's everyone talking about?\n\nI'm not in the Cult of Musk, so I don't follow his every bowel movement.\n\nWhat did he do this time?  ...shit out a small mexican child laborer?", "score": -1, "replies": [{"body": "shit out a solid diamond brick", "score": 2, "replies": []}]}, {"body": "Oversold.  Going down.", "score": -2, "replies": []}]}
