{"title": "Does shorting affect the price of stocks?", "selftext": "Let's say that a stock is overvalued and investors are polarized on it (Tesla). Some people invest other short. Suddenly price of stocks drops. People who were shorting now have to buy them back at a lower price. \nWould that raise the price? What percentage of stocks would have to be shorted for this effect to equalize the drop in price?\n\nThank you for help:)", "id": "8v0wu3", "created_utc": 1530353375.0, "score": 14, "upvote_ratio": 0.74, "num_comments": 12, "comments": [{"body": "Yes, shorting has the same effect as an ordinary selling of a stock you own. Closing a short position has the same effect as buying a stock (because that is essentially what you do when you close a short position). As far as effect on prices go there is no difference between shorting and selling. Same for closing short positions and buying. Hope this answers your questions", "score": 15, "replies": []}, {"body": "Absolutely, look up \"short squeeze\"   \nWhen a heavily shorted stock rises in price dramatically, people that are short are frantically trying to buy back shares from their broker to close the position. ", "score": 6, "replies": []}, {"body": "Yes. Shorts have to buy to close their position. The effect on the price when they enter the short position is the same as a sale and when they close the short position it’s the same as a buy. The interesting thing about shorts are they will buy and take their profit when the stock is falling which can provide some level of price support. ", "score": 2, "replies": []}, {"body": "I think people are stupid for betting against Tesla. They’re almost more cult than company and Americans are very full on with their beliefs. Tesla is becoming an entity of its own as everyone lends it their power", "score": 1, "replies": []}, {"body": "The action alone doesn’t affect price because every transaction is two sided. \n\nThe price action occurs when there’s more of one side than the other. ", "score": 1, "replies": [{"body": "How can there be more of one side than the other if every transaction has two sides?", "score": 1, "replies": [{"body": "More people *want* to sell than there are buyers. So as buyers are exhausted at one price, price falls to where new buyers are interested. ", "score": 2, "replies": [{"body": "gotcha", "score": 1, "replies": []}]}]}]}, {"body": "A lot of Tesla’s recent rise can be traced to shorts either getting scared out or forced to cover (buy back) due to margin calls. It’s called a “short squeeze,” and it’s scary if you’re on the short side.", "score": 1, "replies": []}, {"body": "Supply and demand are a beautiful thing in free markets.  I’m assuming you are looking at Short Interest in a stock and are thinking a block of stock that size is sure to move the price.   Well, traders “unwind” their positions in small chunks so as not to upset prices.\n\nIf you had 10,000 shares and needed to sell in 100 blocks it would cost you a ton in fees.  Broker Dealers pay extremely low fees so they can economically unwind a position without disrupting prices.\n\nAs others have said, there is a Short Squeeze caused by day traders who are trading on margin.", "score": 1, "replies": []}]}
{"title": "While you suckers betting on Chinese stocks. I'm going to the MOON with $MSFT!", "selftext": "https://www.cnbc.com/2018/06/25/microsofts-azure-to-drive-profits-as-legacy-users-adopt-cloud.html\n\nI'm going to fuck two hookers at once when $MSFT hit $125!", "id": "8v051j", "created_utc": 1530341915.0, "score": 21, "upvote_ratio": 0.88, "num_comments": 15, "comments": [{"body": "Microsoft has a lot going for it and Azure is a biggie.  Last earnings call I was surprised to hear all the companies that utilize azure from banks to retailers like Lowe’s. Microsoft makes bank off cloud through software as a service (saas) and infrastructure as a service (iaas).  The degenerates over at Morgan Stanley have the highest pt on the street of 130$ in a year. I’m balls deep in Microsoft if it’s not $112 by 6/21/19 I will seriously consider rope.", "score": 12, "replies": [{"body": "Used to work at Microsoft, Azure department is dysfunctional af. But they know how to make money off enterprise services better than anyone. ", "score": 6, "replies": [{"body": ">Used to work at Microsoft, Azure department is dysfunctional af.\n\nYeah, that's all of Microsoft lol\n\n", "score": 4, "replies": []}]}, {"body": "If it could be $112 by Jan of 2019, that would be great", "score": 4, "replies": [{"body": "Or $105 by October ", "score": 1, "replies": []}]}]}, {"body": "MSFT is the definition of a blue chip stock, it’s great and it’ll go up eventually. Just not fast enough or high enough to get the Sorts of profits/options that gets us diamonds.", "score": 12, "replies": [{"body": "yeah, I have some spreads that I opened 45 days ago — looks like I’ll probably make a couple bucks. but nothing like I make with other companies", "score": 4, "replies": []}]}, {"body": "Yes!.. azure is becoming choice of cloud platform for enterprises. Talked to few techies in companies and they give👍", "score": 5, "replies": [{"body": "With Windows server it's super easy to do a hybrid cloud setup out of the box.", "score": 3, "replies": [{"body": "idk what that means but it sounds really good for my calls", "score": 3, "replies": []}]}]}, {"body": "I work in management consulting and can confirm we have multiple large scale Azure engagements going on right now. There is huge enterprise demand for it. I am long MSFT and have Jan calls as well", "score": 3, "replies": []}, {"body": "You better be right, my calls for 9/21 are down 30%. These earnings next month better knock it out of the park. ", "score": 2, "replies": []}, {"body": "I like this stock and it's on my list. Picked up Facebook today. Another good one. Down on Baba so far. ", "score": 2, "replies": []}, {"body": "Fuck yeah, I got 100 contracts of jan 19 $120 calls", "score": 2, "replies": []}, {"body": "Dope I bought calls on Monday.", "score": 1, "replies": []}]}
{"title": "AMD DD inside (Bearish)", "selftext": "Look at that Weekly reversal candle.  Finally. Target is $13.45.  just sayin https://imgur.com/E0HfdKl.jpg", "id": "8v2j8e", "created_utc": 1530372208.0, "score": 13, "upvote_ratio": 0.79, "num_comments": 18, "comments": [{"body": "So the AMD calls I bought when AMD was at $17.20 are fucked\n\nBut if I buy puts, it will hover around $16...\n\nFuck", "score": 12, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "Oh I will, if it drops to $13.5, I'll triple my position, then buy some lube to hedge", "score": 6, "replies": []}]}]}, {"body": "I said this in another thread: if it drops to $13.50 I will buy another $30k. I don't think it'll happen, but I wouldn't mind adding some for cheap. ", "score": 9, "replies": [{"body": "It will happen, it's inevitable. Wouldn't be surprised to see 10 again and everyone whining about how undervalued it is.\n\nAgain.", "score": 4, "replies": [{"body": "If it drops to $10 I will liquidate all of my other holdings and put it into this stock. ", "score": 7, "replies": [{"body": "Remindme!", "score": 1, "replies": []}]}, {"body": "And I'll be there,  writing puts, getting assigned, and writing calls. ", "score": 4, "replies": []}]}]}, {"body": "Hope you are right so I can buy some 2020 calls cheap. You're probably wrong tho.", "score": 7, "replies": []}, {"body": "roughly 3 weeks to earnings. Coming week it might go down a bit, but it'll run up for earnings after that.", "score": 2, "replies": []}, {"body": "look at that skew though, just sayin https://imgur.com/ia1cfvp", "score": 4, "replies": [{"body": "What the fuck am I looking at", "score": 3, "replies": [{"body": "LINES ON A CHART BUY OR SELL EVERYTHING", "score": 7, "replies": []}]}]}, {"body": "Sold my $15 calls ITM on Friday. Damn I’ve made some cash off them. It should run and the pop with all the processor news and intel hitting the skids ", "score": 1, "replies": []}, {"body": "Buy at 11 sell at 13", "score": 1, "replies": [{"body": "You’re an idiot... an idiot that convinced me to sell at $12.75 when I bought at$9.99", "score": 1, "replies": [{"body": "When did I do this? I never post on this sub. The old Mantra has always been buy at 11 sell at 13", "score": 1, "replies": [{"body": "Group think... asshole", "score": 1, "replies": []}]}]}]}]}
