{"title": "Home Depot (HD) - Bullish Options Action Trade for June 11th, 2018 | OptionsPlay", "selftext": "On Friday's Options Action, the crew analyzed the performance of the homebuilder's sector. After selling off substantially since Jan, this sector has started to turn bullish again just this week. Looking for a bounce higher, HD is the large\\-cap name in this sector that would attract institutional investors. Coupled with cheap fundamental valuations and bounce off a bullish trendline, HD has upside to run. Expecting HD to trade higher, Michael Khouw suggests buying a July 200 Call for a $3.25 Debit. As of Friday's close, this option is trading at $3.60.\n\nWe've structured this trade in OptionsPlay so you can analyze and view this trade along with the supporting technical chart at your convenience. You can also view the Options Action's video by clicking on the following link: [HD Options Action](https://www.cnbc.com/video/2018/06/08/chart-points-to-big-breakout-for-major-dow-stock.html)\n\n[**View this OptionsPlay on HD**](https://app.optionsplay.com/#share/5b1db7d82a8d870d444bc978)\n\nhttps://preview.redd.it/2w14ldcvm9311.png?width=1028&format=png&auto=webp&s=d983fddecdfa8c56f08100186dcd9063c93c4573", "id": "8q57o3", "created_utc": 1528676603.0, "score": 10, "upvote_ratio": 0.78, "num_comments": 12, "comments": [{"body": "Has anyone followed these plays ? Curious why they would give out free plays ?", "score": 2, "replies": [{"body": "We provide ideas for free to everyone. We believe that once you evaluate a trade using OptionsPlay, you'll find it much easier and faster than any other platform you've ever used, that we provide all our ideas for free. Additionally, like the comment below, not everyone agrees with our analysis, you can utilize our platform to find a Bearish trade on HD in seconds. We think that's worth something to anyone that trades options, to research a stock and find an attractive OptionsPlay within seconds. ", "score": 1, "replies": [{"body": "Do you have student pricing or anything like that? $50 / month is a bit rich for my blood.", "score": 1, "replies": [{"body": "Thanks for your interest in OptionsPlay. Sign up for a free trial first with an @edu account and send me an email at info@optionsplay.com and we can set you up with an educational discount. ", "score": 2, "replies": []}]}]}, {"body": "I think I’m gonna use like 20k from my paperMoney account just for shits and giggles.  From what I’ve seen, I don’t expect a lot.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Great. You can sign up at [www.optionsplay.com/landing](https://www.optionsplay.com/landing)\n\nThat will get you on our mailing list so you'll receive ideas like HD in your inbox every morning at 6AM EST including our recommendations to close the trades as well.", "score": 2, "replies": []}]}, {"body": "Just started learning about options, signed up for a papermoney account last night, figured I liked this trade enough to make it my first. Wish I had bought 10 instead of just 1, as it's up by 30-35% after a couple hours.", "score": 2, "replies": [{"body": "I know it's always exciting to make money on your first trade, but my best advice for beginner traders above all else is start small. Start with 1\\-2 contracts on your first few trades, it's not about making money at this point, it's about learning. Don't move onto 10 contracts until you've had 10\\+ live trades under your belt. ", "score": 1, "replies": [{"body": "Yeah, I just figured at $360 per option and $200k in my new papermoney account I prob could have taken more than 1 option. Regardless, your point is well taken. I'm hopeful to learn quickly as I'd love to get a sub to your software.", "score": 1, "replies": []}]}]}, {"body": "Why not a expiration date closer to earnings?", "score": 1, "replies": [{"body": "This was a pure technical play that wanted to take advantage of the fact that options before earnings are currently extremely cheap. Trading at 16&#37; implied vol which is historically as low as HD gets. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "The best part of our platform is that if you completely disagree with our analysis on the stock, you can click on \"I'm Bearish\" and we will presented you with the Put and Put Spread to trade on HD: \n\nHD Put Trade: [https://app.optionsplay.com/#share/5b1e92042a8d870d444beb20](https://app.optionsplay.com/#share/5b1e92042a8d870d444beb20)\n\nHD Put Spread: [https://app.optionsplay.com/#share/5b1e91e7855c1b0dd4e95eab](https://app.optionsplay.com/#share/5b1e91e7855c1b0dd4e95eab)", "score": 1, "replies": []}]}]}
{"title": "$ROKU", "selftext": "As someone who has never seen the platform or used the interface, i'm not sure where this company is headed. A few investment firms have recently changed their outlook for the stock.\n\nhttps://www.benzinga.com/analyst-ratings/analyst-color/18/06/11858235/roku-customer-research-reinforces-keybancs-bullish-stan\n\n\nThe balance sheet looks like a mess and I have yet to meet any family that uses it. With the hot topic of the year being \"cord cutting\", do all online streaming services have a shot of surviving (IQ, NFLX, HULU, youtubeTV, etc.)?\n\nhttps://finviz.com/quote.ashx?t=roku", "id": "8qcznh", "created_utc": 1528750708.0, "score": 6, "upvote_ratio": 0.81, "num_comments": 13, "comments": [{"body": "bought a built-in Roku tv couple weeks ago, liked it, bought roku stock a week ago. Now, I have more than made up for the price of the TV. 😁\n\nThere's Roku, fire tv, apple tv in this space. Roku is already integrating with TV manufacturers for out-of-the-box Roku and single TV remote. I believe they'll become the Android of the TV world. Even if Amazon and Apple integrated themselves with TV manufacturers, I wouldn't buy them as they might be biased towards their own video streaming service and try to block other players on their platform in the future.", "score": 7, "replies": [{"body": "This was my reasoning for going with Roku over the others, and I too made a mental note of when it would pay for itself (which was my first month of cancelling cable).\n\nAs someone who doesn't like to spend money, I could honestly get by without the Roku, but it wouldn't make any sense. Who wants to mess around with five different apps, a manufacturer's specific OS for their smart TV, compatible codecs when streaming from your computer, etc. when a one-time payment of around $40 can make all of that seamless?", "score": 3, "replies": []}]}, {"body": "Long term I don’t like it. They will never compete with Apple at the top of the market where the margins are the highest, so their upper bound of price is about $90. Meanwhile, in the $35-$90 space they have to contend with Amazon and Google. I think the stock has support due to buyout speculation but in terms of organic growth/profitability I don’t see how they get there in such a competitive space.\n\nAlso, the streaming device market has almost no stickiness- a user can seamlessly switch from one device to the next without missing a beat.\n\nI read Citron’s note and would love to hear their explanation of how Roku has any sort of moat or competitive advantage.", "score": 7, "replies": [{"body": "The streaming devices are just going to continue to be built into TVs anyway, and Roku has no subscription service. ", "score": 3, "replies": []}]}, {"body": "It has a chance to go to 47 by July. I just got out of the June 15 $40 and will get into the $40/$42 July 20s", "score": 1, "replies": [{"body": "Looks like they're heading for a dip soon. ", "score": 2, "replies": [{"body": "Doubtful... but anything can happen.", "score": 1, "replies": []}, {"body": "Good call, or were you expecting a larger dip?", "score": 1, "replies": []}]}]}, {"body": "Roku isn't an online streaming service. They mostly offer software and smart TV's and only recently offer some streaming. ", "score": 1, "replies": []}, {"body": "Their other competitors, Apple and Amazon both have hardware assets (Apple TV and Fire TV) and content streaming services (Apple TV and Amazon Prime Video). This allows significant advantage in featuring their own content. \nThe only two pure hardware and pure streaming players are by themselves (Roku and Netflix respectively) - does anyone see Netflix buying Roku as an obvious outcome?", "score": 1, "replies": []}, {"body": "I got a Roku stick around Christmas time. The thing is a fantastic device. The X\\-factor for me (over an Apple TV or Firestick or Chrome stick) is that Roku has no ecosystem. In other words, they aren't pushing you into \"Roku only\" stuff. Hell, Roku plays great with Plex. Meanwhile, Apple doesn't like Google or Amazon (and the same works in reverse for the other devices vs competing services). Roku is going wide while the other companies are hoping to capture you into their entire universe of apps/services/products. Roku being integrated into modern TVs makes sense. Long term I hope they last. I can see someone like Netflix buying it. Maybe a telecom eventually eats it and uses it as their \"player\" (like Disney or AT&T using Roku as their device).", "score": 1, "replies": []}, {"body": "Sit on an earnings call.", "score": 1, "replies": []}, {"body": "i dont even know what roku is", "score": -1, "replies": []}]}
{"title": "Great play next week. &MSFT", "selftext": "[deleted]", "id": "8q5zm5", "created_utc": 1528684178.0, "score": 3, "upvote_ratio": 0.81, "num_comments": 17, "comments": [{"body": "I think the drunkest post typically holds the most truth. ", "score": 6, "replies": [{"body": "this is either a work of autistic fiction or a \"fuck, what did I post last night?\" situation, either way you can catch me going all in on FD calls", "score": 1, "replies": []}]}, {"body": "How drunk are you right now and wtf are you even saying ", "score": 5, "replies": []}, {"body": "MSFT MAFT MSF —-  Dude", "score": 3, "replies": []}, {"body": "Can you do a weekly podcast?  I would subscribe to that shit in a heartbeat", "score": 2, "replies": []}, {"body": "It’s funny because I know what he is saying", "score": 1, "replies": [{"body": "I’m not even sure what company he is talking about", "score": 1, "replies": [{"body": "He had a lot of M and U letters in his post. Pretty sure he means all in MU.", "score": 1, "replies": [{"body": "Nah. U shmuck. We already cashed out from ur bushit MU. I’m fucked up right now. Buti promise to show to show my positions wen I’m home. \n\nAnd if I have more money that I. I will fly u to my house to have ur girl sloppy this little white dick. I’ll take everything off except my my socks and the cheapest Rolex I own ", "score": 1, "replies": [{"body": "Hey, my apologies I don’t have a gf at this moment however I’m interested in your shitty ass portfolio. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Is this what drunk texting WSB looks like? \n\nAlso do you think I can maybe get a job at Wall St. with no language skills too? ", "score": 1, "replies": [{"body": "Blow and alc bro. Chill the fuck out ", "score": 1, "replies": [{"body": "Probably addy burn too, those Goldman Sachs guys pop hard ", "score": 1, "replies": []}]}]}, {"body": "Do you even English bro?", "score": 1, "replies": [{"body": "Blow and booze dude. Fuck u ", "score": 1, "replies": [{"body": "Dinner first and then we can discuss the fuckings", "score": 1, "replies": []}]}]}]}
{"title": "THE AMD TRAIN CANNOT BE STOPPED.", "selftext": "Faggets", "id": "8q9t78", "created_utc": 1528726168.0, "score": 33, "upvote_ratio": 0.79, "num_comments": 18, "comments": [{"body": "daaahhhh I think ill buy some puts!!!!!1", "score": 26, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Ever since they were at $2.80 lots of people saying they are overvalued.", "score": 14, "replies": []}, {"body": "Lots of people who have no idea what just happened at Computex say they are overvalued.  Those of us that paid attention know AMD is in for serious $$$ these next few quarters.", "score": 7, "replies": []}]}, {"body": "They just had a 0.30 dip, go full bear. You heard it here first", "score": 8, "replies": []}]}, {"body": "Thank god it’s autistic ", "score": 4, "replies": []}, {"body": "AMD to 20 dollars by the end of summer.", "score": 3, "replies": [{"body": "I mean. If threadripper is indeed the next thing, they stocks will not tank for atleast 6 months", "score": 1, "replies": []}]}, {"body": "Its still a solid long game, its gonna be a nice rise ", "score": 3, "replies": []}, {"body": "Dude, remove dis! AMD ded when wsb bullish.", "score": 6, "replies": [{"body": "wsb won't be bullish on AMD until it hits $20. Then you should be worried. For now there are plenty of put threads so you can go long ", "score": 9, "replies": [{"body": "My merry man, you have to understand.. I am ba’ deep.\n\nBut the sub was showing bullish signs last Thursday with a fine SuBae meme trending at the top of page.\n\nYou know what happened that day.\n\nDown wit da bullish posts!", "score": 1, "replies": []}]}]}, {"body": "8/17 $12 Puts", "score": 2, "replies": [{"body": "Puts right when hype is going to be building for their threadripper 2 platform release, as well as PS5 shipments starting and EPYC chips are going to be shitting on Intel.  Nice play.  I wouldn't count on AMD tanking in the next 6 months.", "score": 10, "replies": [{"body": "Right? Why are people trying to short a company that has superior tech vs intrl at a lower price and positioned to take market share from them", "score": 2, "replies": []}]}, {"body": "U R Gonna get REKT", "score": 2, "replies": []}]}, {"body": "I mean it stopped briefly last week - I'm sure it'll happen again. ", "score": 1, "replies": []}, {"body": "All aboard! Buy some puts.", "score": 1, "replies": []}, {"body": "I bought in long with a shitload of leverage", "score": 1, "replies": []}]}
{"title": "What are the chance of TSLA breaking out right now?", "selftext": "I so badly want to play resistance and get some 330 or 225 FDs. What are the chance it breaks out and I get rammed?\n\nEdit: Hmm so it spiked above 330 nvm lol", "id": "8q9xx6", "created_utc": 1528727261.0, "score": 9, "upvote_ratio": 0.91, "num_comments": 10, "comments": [{"body": "Yeah it’s like 332.50 now lol", "score": 6, "replies": []}, {"body": "Willing to bet it will be close to $400 a share by Sept", "score": 5, "replies": [{"body": "You can with the magic of options! I'm thinking more end of the year tho.", "score": 3, "replies": []}, {"body": "You're in the right place for that.", "score": 1, "replies": []}, {"body": "At this rate it will be there by mid July.  ", "score": 1, "replies": []}, {"body": "> Willing to bet\n\nDo it then, 09/21/18 400C, $13.50", "score": 1, "replies": [{"body": "already tied up in my $280 calls for sept that i got when it was $277... Long term safe bet. I'm already in the money. I did buy some $400 for July, that i sold yesterday after the bump (making $10k) wish i held for an extra day :/", "score": 1, "replies": [{"body": "Where's your info about the firings from? That'd be like 25% reduction in tesla side employees", "score": 1, "replies": []}]}]}]}, {"body": "Good chance it won't unless there is short covering on Good news. ", "score": 1, "replies": []}]}
{"title": "$BAC to the Muuuunnnn", "selftext": "", "id": "8qa3go", "created_utc": 1528728485.0, "score": 33, "upvote_ratio": 0.79, "num_comments": 19, "comments": [{"body": "America!!! ", "score": 11, "replies": []}, {"body": "Been a fun morning here. Bought 80 calls before close on Friday. Since leaving MU and switching to BAC, my days have been more enjoyable", "score": 9, "replies": [{"body": "Should have done this. My MU calls are bleeding, down 1k on those little shits.", "score": 4, "replies": []}, {"body": "I bought em Thursday EOD, waiting to see how much run up we can get the next day or two. ", "score": 1, "replies": []}]}, {"body": "Anyone planning to sell those BAC calls prior to fed meeting or are you planning to keep them?", "score": 6, "replies": [{"body": "Hold, rate hike helps short term price. Banks make more when lending. ", "score": 7, "replies": [{"body": "I know that but how likely will they announce a rate hike?", "score": 1, "replies": [{"body": "http://www.cmegroup.com/trading/interest-rates/countdown-to-fomc.html\n", "score": 2, "replies": []}]}]}, {"body": "Rate hike prices in.  Bac and banks will fall after Fomc and grab them then ", "score": 3, "replies": []}]}, {"body": "Nice gainz friend. I sold 1 set of 30.5 calls expiring 6/15 at a slight gain, really hoping my 30.5 6/22s will pick up a little more too.", "score": 2, "replies": []}, {"body": "You went a bit more deep on this one than I did.", "score": 2, "replies": []}, {"body": "I’ve got those calls too! bought a little late but I’m hoping that BAC will reach $31 soon so i can sell ", "score": 1, "replies": []}, {"body": "Planing on jumping the BAC train after the Fed rate hike.", "score": 1, "replies": []}, {"body": "Charge your phone fuckboi. ", "score": 1, "replies": [{"body": "I like to live life dangerously. Also on my way to work so no juice. ", "score": 3, "replies": [{"body": "👌", "score": 1, "replies": []}]}]}, {"body": "Sold my calls. Wait for slight pullback, then buy $30 calls again.", "score": 1, "replies": [{"body": "RSI is in the 50 range. The pullback is now. Time to buy in at 30.20 ", "score": 1, "replies": []}, {"body": "Get in now before the rate hike. It’s for sure coming. ", "score": 1, "replies": []}]}]}
{"title": "Kinder Morgan $KMI Bull Case", "selftext": "I started looking at more stocks for the main reason to diversify after I realized all my portfolio was semiconductors/tech related. Like daddy buffet says 'Diversification is the protection against ignorance\". And we all know we got that aplenty here.\n\nKinder Morgan is one of the largest energy infrastructure companies in North America. They own shitload of pipelines and terminals transporting natural gas, gasoline, crude oil, CO2 and more. Recently, the Canadian government stepped in and bought the transcanadian pipeline from KMI for $3.45B US dollars. The First Nation people have been haggling about this pipeline construction on their land which led to delays and increased costs. But the deal with canadian government should resolve this quicker. The way this deal is structured is that KMI ~~will still own~~ could buyback the pipeline when its up and running and the govt will only keep part of the profits (part of the profit goes to the First Nations). Official statement\\-  “It’s not the intention of government of Canada to be a long term owner of project.\"\n\nBull case\\-\n\n1. 4.75&#37; dividends (will rise more next year)\n2. Huge insider buying last quarter\n3. Stock price at 2 year low; lot of room for run up\n4. Transcanada pipeline sale eliminates regulatory and political risks\n5. Owner and CEO work for $1/year salary\n\nPrice target\\- $20 by end of year (current price\\- $16.9; I bought shares at $15.8 and Jan $20 leaps)\n\nMy last 10 posts\\- \n\nAVGO\\- calls sold for 50&#37; loss \n\nCRM\\- calls sold for 60&#37; profit\n\nNTNX\\- calls up 40&#37;\\- holding\n\nBBY\\- calls sold at 45&#37; loss\n\nMSFT\\- leaps up 30&#37;, holding\n\nEVOP\\- shares sold at modest 10&#37; profit\n\nTGT\\- calls sold at 10&#37; loss, would have turned profit by now :(\n\nINTU\\- calls sold at 50&#37; loss\n\nFLNT\\- shares sold at 40&#37; profit\n\nMU\\- called $60 by mid June. So. much. profit.", "id": "8qa87y", "created_utc": 1528729500.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 16, "comments": [{"body": "My KMI LEAPS has been shitting -95% since last year and it still needs about half year to expire worthless.\n\nAdvice: Do not buy OTM LEAPS on this stock.", "score": 2, "replies": [{"body": "Yeah the transcanadian pipeline fucked this stock last year. I think its past it now and should be back at 2 year level again.", "score": 3, "replies": [{"body": "It’s not called the “Transcanadian pipeline”, so stop calling it that. It’s called Trans Mountain. You should really do more research before you make a post urging people to buy. ", "score": 1, "replies": [{"body": "sure. The Transmountain part of the transcanadian looking pipeline. Semantics.", "score": 1, "replies": [{"body": "What..? First of all it’s only from Alberta to BC, not nearly “Transcanadian”. Second, calling it such, especially in the way you do in your post, easily confuses it with the Canadian pipeline company TransCanada and their own pipelines.\n\nI can tell you’re American. ", "score": -1, "replies": [{"body": "The title literally says KMI. If you are here to just nitpick, go ahead. I'll just be here watching my 30% gains on Aug calls.", "score": 2, "replies": [{"body": "Just pointing out how autistic you are. I’ll be back to rip you more when you’re out 95% on KM. \n\nRemindMe! 2 months", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Of course, the risk is that oil prices plummet which would drop the share price as well, though not as much as other oil stocks.", "score": 3, "replies": [{"body": "Oil prices won’t be going down with big daddy Trump ", "score": 11, "replies": [{"body": "that's what I'm counting on", "score": 3, "replies": []}]}]}, {"body": "Okay, breaking this down because obviously you have literally no idea what's going on with TMX. 1) the Canadian government bought the existing pipeline and all other Kinder Morgan Canada related assets. Kinder Morgan no longer has ownership in Trans-Mountain. 2) The pipeline is being challenged by the province of British Columbia in regards to their ability to regulate tanker traffic. First Nations along the pipeline route have been consulted with and have signed profit sharing and employment agreements. 3) The Canadian government has stated they intend to sell the pipeline to any private. operater, not specifically Kinder Morgan. This means that if, say, Suncor, Nexen, or Encana, or any other company wanted to outbid Kinder Morgan for the pipeline they could and probably would.\n\nTl;Dr: your DD is bullshit. Long $MU.\n\n", "score": 2, "replies": [{"body": "Thanks. I edited the post. KMI *could* buy the pipeline back again. But short to medium term, getting TMX pipeline off the books will help. ", "score": 2, "replies": []}, {"body": "This is what needed to be called out. \n\nJust to add, though: None of Suncor, Nexen, or Encana are pipeline companies. If anyone were able to purchase this off of the gov books it would be TransCanada, Enbridge, or Pembina. ", "score": 2, "replies": []}, {"body": "It'll be the Ontario Teacher's Pension Plan that will buy the pipeline.", "score": 1, "replies": []}]}, {"body": "you'll definitely make money with the leaps and a 15.9 entry, and I agree with the general bull case.  But i want to say as a LONGTIME KMI bagholder, this stock has been dead for probably a year. Even after the pipeline news it got a little bump, then went red again, then green, then red, then sideways, etc. It reacts to almost nothing, oil prices go up, doesn't matter. sideways. \n\n\nTo anyone reading, not shitting on OP's DD. I think he's right. It can go only go up, and will never fall below 16 unless there is some major market event, but don't expect tech type group with this snail. ", "score": 1, "replies": []}]}
{"title": "$AMD looks to be stalling out at same resistance level- double / triple top depending on time span length.", "selftext": "I’m not fucking with it though. Y’all can have your calls and puts on this shitty stock, I’ll stand off in the distance with my sideways $GLW calls that will ultimately lose me $1,000s", "id": "8qb7kg", "created_utc": 1528737893.0, "score": 16, "upvote_ratio": 0.9, "num_comments": 16, "comments": [{"body": "At what strike can Lisa exercise her stock options and dump?", "score": 6, "replies": [{"body": "Now! https://www.sec.gov/Archives/edgar/data/2488/000000248818000102/xslF345X03/wf-form4_152874786828131.xml", "score": 3, "replies": []}]}, {"body": "Y'all got any more of dem amd-analysis shit posts?", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Speaking from experience, those are the kinds of gains that people eventually blow their accounts up trying to chase.\n\nI don't want to sound like a dick, but if that kind of money means a lot to you, you need to play very carefully.\n\nI'm bullish on AMD, but weeklies on AMD is a good way to blow up going either direction.", "score": 4, "replies": []}]}]}, {"body": "Ur missing out fam. Load up on dem putz ", "score": 10, "replies": [{"body": "He's not missing out, I'm already $450 down on $1900 in 8/17 puts.", "score": 11, "replies": [{"body": "You’ll be fine. You have plenty of time to be right and AMD keeps hitting resistance at these levels. It’s nearly doubled price in a month. ", "score": 3, "replies": [{"body": "Haha make that $550 down.", "score": 3, "replies": []}]}]}]}, {"body": "I mean it did have one of the most epic/sustained vertical run ups I have ever seen in a company with legitimate volume, but good things can't last forever folks.", "score": 2, "replies": []}, {"body": "Agreed. This shit will go sideways till ER \\+/\\- 3&#37;", "score": 3, "replies": [{"body": "only question is, can usual beat hold stock price or amd is going to plummet down 25%", "score": 4, "replies": [{"body": "idk man. I don't trust AMD stock price tbh. Too many times in the past, they have touted a new tech and didn't deliver. I'm staying away.", "score": 5, "replies": [{"body": "Amd is the crazy hot girl that looks good when you're shit faced at the bar, but the next morning you'll wake up to her staring at you while sleeping\n\nEdit : I got 25 Puts for 8/17 $15, I'm willing to wake up to that", "score": 3, "replies": []}, {"body": "Agreed", "score": 2, "replies": []}]}]}, {"body": "Sideways is the only way I can't see this going ", "score": 1, "replies": []}]}, {"body": "Shitty stock? AMD? Fuuuuuuuuuck you. ", "score": 1, "replies": []}]}
{"title": "Can someone explain ROKU to me", "selftext": "Why does this company exist, why hasn't it gotten gangbanged by Amazon, google and apple yet? Like if you told me your business model is to complete against nearly every company in the FAANG, i would run as far away as possible.", "id": "8qbrjw", "created_utc": 1528742048.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 14, "comments": [{"body": "https://i.redd.it/hfq1up0df1qz.jpg\n\nAll the explanation one needs.\n\nYou cannot compete with a man like that. \n\nYou may not like it, but that is an Apex predator.", "score": 19, "replies": [{"body": "Too bad the apex predator already has a name and she is called alexa and that soon people will be too lazy to use a roku remote when you can  just say, alexa, open netflix.\n\nAll I see is a doughboy who is about to get his shit pushed in by Bezos", "score": 3, "replies": [{"body": "Hands down Alexa will never take over this role. Ain’t no way I want to call out loud what I want to watch all the time. You must be crazy!", "score": 1, "replies": []}]}]}, {"body": "If you want the cheapest and easiest to use streaming device, Roku destroys the competition. It's that simple.\n\nIf you go with an Amazon device, you'll be screwed out of YouTube, if you go with a Chromecast, you won't have Amazon Prime. And you have to be a colossal faggot to even consider the Apple one.", "score": 11, "replies": [{"body": "This.  Why would I lock myself into a closed streaming ecosystem when there's an agnostic device available?  Roku doesn't care what service I'm using to stream.  The others don't have a head-phone jack built into the remote either, and that thing is awesome when I'm trying to binge The Expanse while my wife is sitting next me reading the entire PBS \"Great American Read\" book list.", "score": 5, "replies": [{"body": "The nvidia shield tv beats out the roku in every way... 3.5mm jack on the remote, 4K hdr, 7.1, nvidia gamestreaming.", "score": 1, "replies": [{"body": "I don't know man, if I had to pick a streaming device that will still be around and supported in the next 10-15 years the Shield would be at the bottom of the list.", "score": 4, "replies": []}]}]}]}, {"body": "It comes preinstalled on many TV's. I think the free trial inflates their numbers too. I don't get it either tbh. ", "score": 5, "replies": []}, {"body": "Because all of the other companies are also afraid of FAANG so you want to work with the independent (TV manufacturer, content providers, etc).  Makes them all stronger to have Roku out there.", "score": 4, "replies": []}, {"body": "Roku has the most streaming app channels (read; content)  and a super cool search where you put in what you want and it tells you what apps you can watch it on. Roku came with my TV I like it.", "score": 4, "replies": []}, {"body": "Alphabet and Amazon don't care about Roku", "score": 1, "replies": [{"body": "Chromecast and Firestick", "score": 2, "replies": [{"body": "Exactly. Their shit is better and more integrated.\n\nSame reason why Pepsi and Coke don't care about RC Cola", "score": 0, "replies": []}]}]}, {"body": "Don't explain to him.. not even one knowledge.", "score": 1, "replies": []}]}
{"title": "Load the $AMD FUD!", "selftext": "Time to short this bitch back and ride Lisa Sue down to $13. Just waiting for the FUD later this week. GL faggots \n\nEdit: https://www.streetinsider.com/dr/news.php?id=14043656\n\nWhen moon?", "id": "8qc33k", "created_utc": 1528744250.0, "score": 11, "upvote_ratio": 0.72, "num_comments": 15, "comments": [{"body": "If you tell people to load up on puts every day eventually you might get it right.", "score": 25, "replies": [{"body": "Hey man if you just double down an infinite number of times then you’re guaranteed to make money.", "score": 11, "replies": []}]}, {"body": "If AMD hits $14 I'm paying off a credit card\n\nIf AMD hits $13 I'm taking my bf out on a nice date\n\nIf AMD hits $12 I'm going on vacation \n\nIf AMD hits $11 I'm quitting my job\n\nIf AMD hits $10 I'll weld the doors on my car shut\n\nIf AMD drops lower I don't know what I'll do with the fuck load of money I make. I'll throw a WSB party at a TGI Fridays or something.", "score": 40, "replies": [{"body": "This is the kind of RIP I look for when I come to WSB", "score": 15, "replies": []}, {"body": "Why would you ruin your car?", "score": 8, "replies": [{"body": "If AMD hits $10 I'll buy another one", "score": 16, "replies": [{"body": "Fill it with cement and make a skateboard ramp out of it!!", "score": 7, "replies": [{"body": "Oh fuck you're a genius. It's creative thinking like that that'll get you a yacht one day!", "score": 4, "replies": []}]}]}]}, {"body": "..and when it hits 16?", "score": 2, "replies": [{"body": "I drive into a guard rail at 100+ mph in a high speed car chase after stealing a Nintendo switch from Bestbuy", "score": 4, "replies": [{"body": "Damn.. I’m kinda hoping you get it below 14 now", "score": 2, "replies": [{"body": "Me too 😭", "score": 1, "replies": [{"body": "Welp, game not over yet.\n\nI’m looking to buy pullbacks so I’ll take what I’m given, but I can’t see it much below the 10 day ema if/when it gets there, somewhere around 15.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "i’m pretty sure i saw this exact same post few weeks ago, i wonder if that OP is still alive", "score": 16, "replies": []}, {"body": "I sure hope so I lost my money pretty quick", "score": 2, "replies": []}]}
{"title": "Short Tesla", "selftext": "[deleted]", "id": "8qcd22", "created_utc": 1528746198.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 16, "comments": [{"body": "LOL no. Shorting $TSLA is like jumping off of a roof and wondering why your legs are broken.", "score": 17, "replies": [{"body": "Ok buddy!", "score": -6, "replies": [{"body": "I’m not your buddy, guy!", "score": 4, "replies": []}]}]}, {"body": "No", "score": 10, "replies": [{"body": "Bro u will be sorry", "score": 1, "replies": []}]}, {"body": "Do you already forget how much people shorting TSLA lost?", "score": 3, "replies": []}, {"body": "i'm an idiot and bought 10 FD puts at 329, then sold and bought 10 FD calls at 333. Classic buy high sell low. But I believe 330\\-332 is a big inflection point for shorts and for resistance. Hopefully I'm not a huge idiot", "score": 2, "replies": [{"body": "Don’t worry I think ur smart 😔", "score": -2, "replies": [{"body": "I'm hoping the 4 straight trading days of gap\\-ing up at open has one more in the barrel!", "score": 2, "replies": []}]}]}, {"body": "Of all the stocks one can short, Tesla is the WORST choice. Unless Musk gets run over by a bus. ", "score": 2, "replies": [{"body": "By a Tesla autonomous Truck?\n\nShort $TSLA Long $ROPE", "score": 2, "replies": []}]}, {"body": "DD?", "score": 1, "replies": []}, {"body": "i picked up some fd's 310 puts", "score": 1, "replies": [{"body": "same, im using the proceeds to outright buy a model x. whoopsie", "score": 2, "replies": []}]}]}
{"title": "Serious FOMO. YOLO on AMD end of day.", "selftext": "[deleted]", "id": "8qd7vz", "created_utc": 1528752415.0, "score": 18, "upvote_ratio": 0.85, "num_comments": 14, "comments": [{"body": "Looks like CEO sold 300k just as you bought your calls, that's impressive.", "score": 23, "replies": [{"body": "I usually have great timing.", "score": 27, "replies": [{"body": "I just want to kiss the forehead that houses your autistic brain. Love you.", "score": 4, "replies": []}]}, {"body": "I love how everyone is on this AMD train without a conductor. toot tooooooot", "score": 1, "replies": []}]}, {"body": "\\[X\\] Low volume\n\n\\[X\\] $16 rejected\n\n\\[X\\] RSI Decline\n\n\\[X\\] MACD Decline\n\nYeah bro, you fucked up\n\n[https://i.imgur.com/0mxJmRM.jpg](https://i.imgur.com/0mxJmRM.jpg)", "score": 19, "replies": [{"body": "Nasdaq was low volume but AMD traded above average at 78.9 Vs average of 57.8...", "score": 6, "replies": [{"body": "I’d venture to say the majority of that volume was the morning sell off.", "score": 1, "replies": []}]}, {"body": "I bought puts today at the first peak. \n\nBut you are looking at it the wrong way.\n\nRSI is overbought a decline does not mean anything.\nMACD has no crossover, a decline does not mean anything.\n\nAmd has above average volume today (135%) of usual volume so that is actually pretty strong volume\n\nI don’t think it will cross 16, but we’ll see.", "score": 7, "replies": [{"body": "Didnt you see all the lines I drew? They all point down.", "score": 27, "replies": []}]}, {"body": "yeah maybe, use TA when nothing of interest is happening. AMDs product lineup is causing it to rise. ", "score": 2, "replies": []}]}, {"body": "Buy high sell low", "score": 6, "replies": []}, {"body": "you’ll do fine.  i heard AMD is going to 60", "score": -1, "replies": []}]}
