{"title": "Here is a Market Recap for today Wed, Nov 11, 2020. Please enjoy!", "selftext": "**PsychoMarket Recap - Wednesday, November 11, 2020**\n\nStocks rose today as tech shares recovered some of their recent declines. Market participants continue to closely monitor developments around a coronavirus vaccine and other treatments. The Nasdaq (QQQ outperformed the market, finishing 2.24% up. The S&P 500 (SPY) finished 0.76% up, and the Dow Jones (DIA) underperformed, finishing 0.1% down.\n\nThis week, so-called reopening stocks, like cruise-lines, airlines, hotels, and brick-and-mortar stores rallied on the backs of Pfizer’s vaccine announcement. Hopes that drug-makers are closing in on developing and getting approval for a coronavirus vaccine stoked consumer confidence in getting out and traveling. \n\nThe jump in reopening stocks came at the expense of tech stocks that have so far greatly outperformed the broader market throughout the pandemic. This week, the Nasdaq posted back-to-back declines of more than 1% before today while the Dow Jones gained around 4%. Same story in the S&P 500, where financials, industrial, and energy sectors have outperformed tech this week, after greatly lagging year-to-date. Michael Arone, chief investment strategist at State Street Global Advisors said, “Investors have gotten a lot more comfortable with the election outcome, with progress on COVID-19 solutions, and what again was a very solid earnings season. So I think they’re looking ahead to 2021 and anticipating, perhaps, much better-than-expected economic growth and earnings growth. And so they’re pivoting towards more cyclical, value companies and a bit away from the technology.”\n\nThis week, a number of notable analysts upgraded their near-term expectations for the market. Goldman Sachs (GS) raised their year-end price target for the S&P 500 from 3600 to 3700 and to climb to 4300 by the end of 2021. JP Morgan (JPM) also raised their estimates, placing a price target of 3600 by year-end and 4,000 by early next year, with the potential to then rise further to 4,500 by the end of 2021. JP Morgan analysts said, “After a prolonged period of elevated risks (global trade war, COVID-19 pandemic, US election uncertainty, etc.), the outlook is significantly clearing up.”\n\n**Highlights**\n\n* TikTok's Chinese parent company ByteDance has asked a U.S. appeals court for additional time to work out a potential divestiture of the popular video-sharing app, citing a lack of communication from the Trump administration with a Thursday deadline looming.\n* Facebook (FB) and Alphabet (GOOG, GOOGL) plan to continue banning political ads on their platforms for the next several weeks to prevent confusion about election results, according to people familiar with the matter and an email reviewed by The Wall Street Journal.\n* U.S.-listed Chinese electric-vehicle producers -- NIO and Xpeng (XPEV) as well as Li Auto (LI) -- are all about to report third-quarter numbers. Stakes are high because the stocks have been on a monster run. The numbers are sure to be good, but after such a run in the market, will they impress Wall Street?\n* Alibaba (BABA) set a new sales record for the annual Singles Day shopping event, a feat that was overshadowed by a stock plunge caused by proposed new Chinese antitrust regulation.\n   * Gross Merchandise Value, a figure that shows the total value of orders across Alibaba’s shopping platforms, was $56.42 billion, a new record for the company\n   * The State Administration for Market Regulation released draft rules on Tuesday that, for the first time, defines what constitutes anti-competitive behavior. It covers areas including pricing, payment methods, use of data to target shoppers.\n* China’s auto sales grew 12.5% in October but are still down YoY because of the coronavirus pandemic.\n* Advanced Auto Parts (AAP) with target raise by Morgan Stanley[ $MS](https://twitter.com/search?q=%24MS&src=cashtag_click) from $148 to $190\n* Affimed (AFMD) target raised by SVB Leerik from $8 to $9 at OUTPERFORM.Stock currently $4.40.\n* Anthem (ANTM) target raised by Piper Sandler from $330 to $369 at OUTPERFORM.\n* Argenx (ARGX) with target increase by Morgan Stanley from $281 to $295 OVERWEIGHT. \n* Blackrock (BLK) target raise by Deutsche Bank (DB) from $685 to $794 at BUY\n* Brooks Automation (BRKS) target increase by Needham & Co. from $72 to $77. Stock currently around $59.5\n* Datadog (DDOG) with target increase by Needham & Co. from $106 to $109 at BUY. Stock currently around $92.50.\n* 89bio (ETNB) with target raise by SVB Leerik from $51 to $56 OUTPERFORM. Notable bc stock is $24.30\n* Intercontinental Exchange (ICE) target raise by Deutsche Bank (DB) at $125 BUY\n* LYFT with too many target increases to list here. Average rating is BUY with average price target of $45\n* Moderna (MRNA) target increase by Morgan Stanley (MS) from $90 to $100 OVERWEIGHT.\n* ServiceNOW (NOW) target increase by Barclays at $650 with OVERWEIGHT rating\n* 1Life Health (ONEM) with several bullish target increases. \n   * Morgan Stanley (MS) at $41 OUTPERFORM\n   * Piper Sandler at $44 OUTPERFORM \n* Oak Street Health (OSH) with two target increases. Stock currently around $49.50.\n   * SVB Leerik from $55 to $78 OUTPERFORM \n   * Robert W. Baird from $55 to $60 OUTPERFORM\n* Signature Bank (SBNY) target increase by Credit Suisse from $107 to $120. Stock currently at $101.5, almost 20% implied upside\n* UnitedHealth Group (UNH) target increase by Piper Sandler from $385 to $409 OUTPERFORM \n* Aurora Cannabis (ACB) has priced 20M units at $7.50/unit, for total gross proceeds of $150M. Stock was down more than 20% in the morning before rallying in the last few hours of the market session. Crazy price action!\n* The US videogame industry hit a new record in consumer spending in 3Q, reaching $11.2 billion, a 24% rise YoY, according to NPD Group. Also projecting a record-breaking 4Q. \n* GrowGeneration (GRWG) going off like a rocket after-hours. This is one stock we love and have repeatedly recommended,\n\n\"If you set your goals ridiculously high and it's a failure, you will fail above everyone else's success.\" -James Cameron", "id": "jsh7dn", "created_utc": 1605131178.0, "score": 256, "upvote_ratio": 0.96, "num_comments": 39, "comments": [{"body": "Thank you, lots of information!\nShame to see that the stock I was watching wasnt included this week. The stock I have been placing my chips on was \"Palantir\" (PLTR). During Elections they skyrocketed as Trumps chances on victory dwindled.", "score": 30, "replies": [{"body": "Ah, sorry to hear that, with so much happening everyday difficult to include everything.", "score": 10, "replies": []}, {"body": "You got earnings tomorrow it will be glorious or a nightmare my shares and options can’t wait to find out...", "score": 3, "replies": [{"body": "Yup. Im hoping it will be a glorious day. Bought 500 shares a few days ago. But, we will see. I really hope that along with the report the values will rocket. In that case, I'll make a decent profit.", "score": 1, "replies": []}]}]}, {"body": "I’ve been following the hype and news surrounding the Chinese EV stocks. How do you think Xpeng and NIO is going to move with earnings this week and next?", "score": 10, "replies": [{"body": "I have no idea but I’m scared lol. I can feel the bubble", "score": 14, "replies": [{"body": "Sharp spike upwards or massive tanking. Lord help us all", "score": 2, "replies": []}, {"body": "What makes you think that there will be a bubble other than a feeling?", "score": 1, "replies": [{"body": "Just the massive rise in the price. Could they be undervalued ? Sure.\n\nXPEV just blew up from good numbers. I suspect Nio will do the same next week", "score": 1, "replies": [{"body": "No.", "score": 1, "replies": [{"body": "Thank you for that fantastic response", "score": 1, "replies": []}]}]}]}]}, {"body": "I’d expect significant movement due to the hype. I haven’t been consistent with predicting price action on earnings reports. \n\nI have NIO, XPENG, and LI. In each case I’ll be observing the report release with a tight stop loss. If they drop, I’ll buy them back in the dip, and if they spike, I’ll sell off a few at the top w/ intent of buying back when price normalizes. \n\nI believe all three are going up overall. The report could provide an opportunity to gain a few more shares regardless of the report results.", "score": 4, "replies": [{"body": "What a day!!! Took profit on all 3, will buy more when they cool down, mayhaps Monday? Predictions anyone?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Build walls?", "score": 3, "replies": []}]}, {"body": "The hype is done. It will crash hard", "score": -5, "replies": [{"body": "It won't crash but there will be some kind of pullback. Whatever goes up too fast will come down at the same rate. All the hype surrounding EV has been priced in and unless NIO and XPEV can impress Wall Street with stellar results, I expect these two stocks to underperform. \n\nFeel free to inverse me but I am still partially bullish on Chinese EV. Cautiously optimistic is a better word for this", "score": 6, "replies": [{"body": "Welp.. I only have 300 dollars worth... So if it crashes, im gonna start using real money I guess 😅", "score": 1, "replies": []}]}]}]}, {"body": "Happy hump day and thank you for the write up, GRWG is now on my radar after seeing you post many times.  Doing some DD now", "score": 11, "replies": [{"body": "Happy humpday as well friene, always happy to see your comment :). Glad to hear you are checking GRWG, that's a monster stock IMO. Im holding long", "score": 5, "replies": [{"body": "Excellent to hear and thank you for that vote of confidence, they seem much more stable than ACB which feels like a game of chicken", "score": 2, "replies": [{"body": "Yeah, GRWG is a company that sells hydroponic growing equipment online and in their 11 stores\nin the US. They don't sell marijuana, rather the equipment used to grow it. Not to mention the business they get from farmer and gardners. Just my opinion of course", "score": 5, "replies": [{"body": "Is it still a decent price at $23? I haven’t done enough research to see their earnings. I totally agree with your thoughts though", "score": 1, "replies": []}]}]}]}, {"body": "Jimmy Chillman loves it too", "score": 2, "replies": []}]}, {"body": "I really appreciate this level of detailed information you put out every day. Even though I mainly HODL index funds, I still find this to be very valuable.", "score": 4, "replies": []}, {"body": "Fubo", "score": 2, "replies": []}, {"body": "Thanks for the write up!", "score": 2, "replies": []}, {"body": "I'm excited and terrified for EVs in the upcoming week. Btw, reports are low balling it for EVs, and calculated small losses for Q3.", "score": 2, "replies": []}, {"body": "Thanks!", "score": 1, "replies": []}, {"body": "How do you know that the stock market underperformed and did not overperform? Can you also point to me the data that you used to conclude that a potential vaccine \"stoked consumer confidence in getting out and travelling\"?", "score": 0, "replies": [{"body": "By outpefform I mean the Nasdaq performed the best out of the 3 main indices ETF (SPY, QQQ, DIA). You can see how the vaccine data stocked confidence in traveling stocks by the fact the cruiselines, airlines, hotels, and other reopening stocks jumped by double digits at the beginning of the week. Thanks for the question", "score": 1, "replies": [{"body": "No.", "score": 0, "replies": []}]}, {"body": "Sure.. look at how travel and tourism companies spiked the day of the news. RCL CCL EXPE BKNG HLT MAR to name a few. Also stay at home stocks like ZM and PTON plummeted", "score": 1, "replies": [{"body": "No.", "score": 0, "replies": []}]}]}, {"body": "Looks like AAP is dominating. Might pick some up.", "score": 1, "replies": [{"body": "AAP or AAPL", "score": 1, "replies": [{"body": "OP mentioned only AAP (Advanced Auto Parts) today\n\nBut AAPL is up 3.04% today.  It was trading about $65 one year ago and today it's $119.49.  The stock hit its all-time high this year.  So it has been doing very well.\n\nAAP is about even with its price one year ago.  But the new target is about 20% over its current price.", "score": 2, "replies": []}]}]}, {"body": "You the man! Thanks. If you don't mind what source do you suggest to look at consolidated information on stock upgrades (on mainstream stocks like those you listed)", "score": 1, "replies": []}, {"body": "Hey, what are your guys thoughts on AML? I'm thinking of going in hard in light of the vaccine news. I'm really new to trading so go easy!", "score": 1, "replies": []}, {"body": "JD.com Q3 release on monday. 100% on buy. ur welcome! 🤑🤗", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "js5wet", "created_utc": 1605090945.0, "score": 94, "upvote_ratio": 0.96, "num_comments": 28, "comments": [{"body": "[deleted]", "score": 46, "replies": []}, {"body": "Well done. Appreciate you!", "score": 7, "replies": []}, {"body": "Bag holding BA all year, so this news excites me!", "score": 6, "replies": [{"body": "Same, but I wouldn't call it bag holding at all. Even bankrupt, Boeing assets and business is worth tens of billions of dollars. US government would never allow Boeing to go under as we've seen. Same principle as the automotive industry back in 07'/ 08'.", "score": 1, "replies": [{"body": "But GM shareholders lost everything and GM came out as new GM", "score": 2, "replies": [{"body": "Shhhh, stocks only go up.", "score": 1, "replies": []}]}]}]}, {"body": "Any opinions on Boeing vs Airbus shares?", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It's has better upside, all of the bad things like the grounding of the 737, the pandemic canceled plain orders and manufacturing issues are already priced in as it's way off its all time high, the only way the company can go is up i believe from where it was a couple of days ago", "score": 1, "replies": [{"body": "Not scared possible EU tariffs uncertainty are gonna cause a price drop?", "score": 3, "replies": [{"body": "Not to mention delays on the military tech side + a new administration that may be less keen to order up on military hardware. China gradually entering the game of building passenger aircraft domestically.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "You only lose if you sell BABA!", "score": 3, "replies": [{"body": "LOL, the CCP could shut them down for the slightest disrespect from Jack Ma.....wouldnt bet the house on anything under the rule of that insane government.", "score": 2, "replies": [{"body": "They wouldn’t touch a nearly trillion dollar cash cow, but I know what you mean.  Always diversify.  Most of SE Asia uses baba and they are in fintech and cloud computing so they should be good.  They are what Amazon wants to be in 10 years.", "score": 7, "replies": [{"body": "Right, guess when i say shut them down, i mean replace Jack Ma, staff  **Et al**. with a more CCP \"friendly\" version of the company within a couple months....but full disclosure i picked up some shares myself, but just for a quick swing trade.", "score": 1, "replies": [{"body": "So true haha!  They will just deal with him and put another head in place.  It does add that extra layer of nerves being attached to the CCP.  I always just to grab some when I can.  Any other companies you like lately?  I always like to learn more", "score": 1, "replies": [{"body": "I've been buying and holding RKT and LMND whenever they dip....RKT is buying up half their shares right after IPO to force the price up and LMND IPO selling restriction ends tomorrow i believe so hoping to see a nice drop on it soon.", "score": 1, "replies": [{"body": "Hell yeah!  I have heard good things about both of them and will def check it out.  I have been banking heavy on CCL and crusies returning next year buying the cheap stock.", "score": 1, "replies": [{"body": "Ya not sure about CCL, they keep doing offerings to keep from going under.  Think they might declare bankruptcy soon if they dont reopen in the next few months....i did pretty well on RCL and NCLH, both rebounded nicely since march but i'm almost all out now after the vaccine bounce.  Might just take the loss on CCL for a write off.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will have to check out PLTR.", "score": 1, "replies": [{"body": "They went up today maybe more tomorrow depending on earnings", "score": 2, "replies": [{"body": "I'm too late for that party, no? :/", "score": 1, "replies": []}]}]}]}]}, {"body": "I can’t find anything about this online - what is the $2.5B deal for Uber that you’re referencing ?", "score": 2, "replies": [{"body": "[uber deal](https://www.marketwatch.com/story/ubers-purchase-of-postmates-approved-by-u-s-with-some-conditions-11605031451)", "score": 2, "replies": [{"body": "Awesome thanks ! What are your thoughts on doing stock options on Uber into next year to hit this deal and hopefully end of COVID?", "score": 2, "replies": [{"body": "I don't usually do stock options, i mostly invest in stocks only. I don't really know what to tell you, as they weren't profitable even before the pandemic. I like the company and what it's doing but i don't know if this will happen by next year though as it will take a while for everything to comeback", "score": 1, "replies": []}]}]}]}, {"body": "Boeing will reach the old level from around 400$!!!. It will explode. We are waiting that the covid vaccination will rocket!!", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes, its take time but it ll go up. I hope this year 30-40% up!", "score": 2, "replies": []}]}]}, {"body": "Held Boeing after the march drop until this week. I've decided I want stocks that grow every year and I don't see Boeing doing that. Yes I think Boeing will return to its previous peak but in 2-5 years. No thanks. Also Alibaba is done because of anti-competition laws for tech in China.", "score": 1, "replies": []}, {"body": "Boeing is a strong company!", "score": 1, "replies": []}]}
{"title": "Day 1 Massive fail", "selftext": "Hello, yesterday I decided i wamted to start with stock trading....Im basically going in blind. Im starting with demo stock trading. Last night I \"bought\" a bunch of stock from relevant companies. I bought Microsoft and Sony because of the new consoles, Walmart because of Black Friday, Amazon because of the pandemic, and Best Buy because of the new consoles. Today I woke up to see red across my portfolio board. This isnt as sinple as I thought, what did I do wrong?\n\nDay 2 Update: I sold off some of the red properties, Tesla, and other stiff that was bringing me down. I ended up keeping some, and buying some extra. Lo and behold all I see is green now", "id": "jsibk8", "created_utc": 1605134605.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 36, "comments": [{"body": "Stop! Trading! If you’ve making this kind of emotional decision your future is bleak. Up and downs are part of the market. You bought blue chip companies. They would have been fine. You  bought for a future date event but you never made there.", "score": 26, "replies": [{"body": "I’m so tired of seeing this as a blanket suggestion. How about offering people some guidance instead? Everyone can learn. It’s not that difficult and no one can truly predict the market. They’re 16 and trying it out for the first time. to the person who made this post, i have faith in you! watch the news cycles and think ahead like you’re doing, you just have to hold out.", "score": -7, "replies": [{"body": "Thank you! I now understand that its more of the companies value and how it moves up and down, rather than the revenue they are making during a big event", "score": 0, "replies": [{"body": "Yep! NOCE is something good to learn and look into for each company you invest in. I’m not totally sure about other investment platforms but Venmo shows you recent related articles to each stock which helps get an idea where they’re at when you do start actual investing. I thought that was helpful at first.", "score": 2, "replies": []}]}]}, {"body": "Well its a demo. I went in completely blind. I learned alot since yesterday", "score": -3, "replies": []}]}, {"body": "Invest in a book", "score": 22, "replies": [{"body": "Trading on a demo account is a cheaper and more effective way of learning imo", "score": 2, "replies": []}, {"body": "Will do", "score": 1, "replies": []}]}, {"body": "First question - how old are you? As you get older you will gain much more knowledge of the market and of what makes companies move. For example, you are falsely under the assumption that Microsoft and Sony will have any positive stock movement due to their new consoles. This is a common mistake of new investors who want to think a hot product will drive business. \n\nFirst off, these new consoles and their expected revenue are “baked in” to the existing stock prices. Secondly, they represent a very small portion of the respective companies revenue stream.  Apple, on the other hand, lives and dies by the iPhone. Yes other parts of their business model generate massive amounts of income but the standard for gauging apple is iPhone success. \n\nFor Microsoft for example, read up on their cloud computing / storage to get a better idea of what is behind their company value and future. \n\nThe same goes for Walmart and Black Friday. Everyone knows Black Friday will be “good” for Walmart. But it’s not going to make the company move in any significant way. Rather the stock has benefited from greater online sales due to the pandemic, as has Target. \n\nWhen choosing companies to invest in, try and understand the whole company and where revenue comes from. \n\nLastly, there are going to be red days. And red weeks. And red months. But you have to understand the big picture to see WHY this is happening. Did a stock run up 100% in the last 6 months? A red month may follow when everyone harvests profits and comes to their senses.", "score": 6, "replies": [{"body": "Thank you for the advice. I am 16, cant do real stocks until I turn 18", "score": 3, "replies": [{"body": "You can do a custodial account with a parent. They will have to make the trades for you and they would have to close it out but once you’re 18 it can be transferred to your control. You could ask for $ instead of presents the next few years if you’re in inclined and family is in a position to do so. \n\nAnother bit of advice to take in - you will never understand the market. Ever. When you think you have something figured out, you’ll be proven wrong. Some times in your benefit, sometimes not. But don’t ever think you actually understand everything the market does and will do", "score": 3, "replies": []}, {"body": "You should definitely get a custodial account. I'm 15 and I started learning over the extended summer.", "score": 2, "replies": [{"body": "Ill look into it", "score": 1, "replies": []}]}]}]}, {"body": "Daytrading is not for beginners. If you buy a stock like msft just let it grow at least 6 months before selling as you become more proficient in market movements. You can shorten your time to buy and sell.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "How do I know when to sell? Is there a sweet spot?", "score": 0, "replies": []}]}, {"body": "If you look back at this post 1 year from now you will realise how much of an idiot you sound.\n\nGood stocks go down on a regular basis... what did you expect to happen?? Did you just think that stocks just continuously go upwards in some kind of linear fashion?", "score": 6, "replies": [{"body": "Yeah not sure what I was thinking tbh", "score": 4, "replies": []}]}, {"body": "You are definitely ready for the market.", "score": 5, "replies": [{"body": "Hahahahaha", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I didnt sell all my red I just sold the stuff that I didnt think was gonna turn into anything good. I kept some of my red stocks and today they are up", "score": 0, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Point taken", "score": 4, "replies": []}]}]}]}, {"body": "Part of Investing is buying into a company and holding for the long term. There's up days and down days and you can't really let it get to you if you've done a deep analysis and are certain a company can go up more than its current position - Don't let Red days get to you", "score": 3, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "Thank you", "score": 2, "replies": []}]}, {"body": "Don’t buy in a company all at once. If you have $10,000 to buy a single stock, split it up into like 5 trades over an amount of time.", "score": 2, "replies": []}, {"body": "Think or swim has paper money accounts. I know it's not as exciting or flashy as making those big real gains, but you'll make more in the long run by trying different strategies.", "score": 2, "replies": []}, {"body": "Do some googling on stock fundamentals.  Learn how to understand the different metrics and then choose stocks that you feel are trading at a good value.  Learn some technical analysis to help you decide if it’s a good time to buy (google RSI, TTM Squeeze, BollingerBands, Keltner Channels).  Keep paper trading until you feel like you get it.", "score": 2, "replies": []}, {"body": "I am a newbie too. I am 18. Started in March when I was 17. Honestly, still don’t know wtf I am doing. I am trying to gain as much knowledge as I can. Read the news, look at patterns, read reddit, do free online stock courses. What I learn from this past few months(take this very lightly)\n1- stocks will go up. There would be ups and downs but it will go up\n\n2- buy low and sell high. Sell when you feel comfortable. For example, I bought peloton when it was around 80$ and sold at around 106$. I sold it because I need $ to buy other stocks. It wasn’t a stock I really believe in. So figured out when you want to sell it. \n\n3- If you can, invest in stocks for long term. For example, I invested in Disney, RTX, JBLU during the big dip. I am not planning on touching this stocks anytime soon. I believe in them. They are in someway my safe stocks.\n\n4. Invest money you can loose. Don’t get emotionally attach to it. I only invest money if I loose all well shit I may cry but it won’t really affect my life whatsoever.\n\n5- Diversify!!\n\n6- You are young so take some risk. If doesn’t work it’s just a learning process\nLast but not least, I don’t know shit so don’t take this seriously. Do  your own research. I recommend you start with paper trading it will teach you a lot", "score": 2, "replies": [{"body": "Thank you will do!", "score": 1, "replies": []}]}, {"body": "Just buy ETFs and hold long term", "score": 2, "replies": []}, {"body": "Trade every other day only.", "score": 2, "replies": []}, {"body": "Hope you bought a bunch today on green day, so you can sell tomorrow on red day!", "score": 2, "replies": []}, {"body": "just hold it  atleast 1 year", "score": 1, "replies": []}, {"body": "Invest in a brain", "score": 1, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}
{"title": "Opinion: Nokia is going to skyrocket in the long-run, possibly shorter than people realize.", "selftext": "I know not to buy in off news hype or share price but they are working with NASA to create a 4G network for the moon. I can’t imagine this is a sector where other companies will have much, if any, experience. It is really unique and I feel something that will bring a lot of profit and name recognition, which could propel future products and services sales as well. I might be overthinking but there is so much room for growth. It could easily move into NIO / Tesla esque growth given the right plays from their corporate, marketing, etc. \n\nThey’re creating private 5G networks, as well. At ~$3.50 a share, I think it’s a steal given the potential.\n\nEDIT (Post-WSB run): I think Karma came for all your doubting asses with my realized gains. 🤣.", "id": "jsjnz3", "created_utc": 1605138949.0, "score": 4, "upvote_ratio": 0.59, "num_comments": 30, "comments": [{"body": "NOK stock price in 2070 will be $5", "score": 22, "replies": []}, {"body": "Your grandchildren are going to be old by the time that stock ever does anything.", "score": 24, "replies": [{"body": "I have no grandchildren and yet, I have a car now, hmmm, maybe don’t be a doubting dick on the internet to random people. Because karma worked out for me 🙏🏼", "score": 1, "replies": [{"body": "Glad it worked out for you.  Congratulations.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "The moon men will finally be able to chat to each other", "score": 1, "replies": []}]}, {"body": "Will there be a lot of customers on the moon to boost sales?", "score": 9, "replies": [{"body": "lol'd", "score": 3, "replies": []}, {"body": "Well, there’s about to be a mass expansion in “space traffic” or whatever you’d like to call it with SpaceX working to expand and with films being produced in space, possible future travel, i believe it’s something to consider that there will be more of a “market” for a service similar.", "score": -1, "replies": []}, {"body": "Just a fat govt contact", "score": 1, "replies": []}]}, {"body": "Get some blackberry while your at it", "score": 5, "replies": [{"body": "whos laughing now lol", "score": 3, "replies": []}, {"body": "u/Oidoy — after the gains that were enough for me to buy a 2012 Ford Focus with NOK and the other bet against stocks, me, ALLLL the way to the bank on these MFer’s 🤣", "score": 1, "replies": [{"body": "hahaha fair fucking play. to be fair though i think that NOK will continue trading sideways, it got caught up in WSB hype, and i dont know about it in the future.\n\nBut you won haha :D shouldve listened i guess, i researched BB, NOK and Ericsson and didnt end up with any :(", "score": 1, "replies": [{"body": "Nah I agree. Anything that gets wrapped up in WSB you kinda have to throw logic out the window. Honestly I got lucky. And my message was meant to be in light fun ahah. Just nice to come over a ton of doubters even if it’s luck😂", "score": 1, "replies": []}]}]}, {"body": "Ouch", "score": 1, "replies": []}]}, {"body": "\"working with NASA\" sounds like a lot of R&D expense with minimal ROI.", "score": 3, "replies": [{"body": "https://www.google.com/amp/s/www.fool.com/amp/investing/2020/10/24/nokia-to-provide-cell-service-on-the-moon-and-othe/ There’s no way to say for sure but it’s an innovative concept to say the least.", "score": 0, "replies": [{"body": "Nokia revenue is a lil north of $24b annually and a $2b+ ebitda. A $14million dollar project isn't enough revenue to move the needle on the stock. \n\nIf you said they signed a $1-2b revenue deal then it would make more sense. \n\nNot knocking the stock entirely as I'm bullish in nokia for their 5g infrastructure and see growth potential. Just not from this moon deal.", "score": 6, "replies": [{"body": "I mean it’s a nice booster, brand recognition with the added experience, makes them more of a “go to” in the sector.", "score": -1, "replies": [{"body": "Nokia doesn't need brand recognition. They're probably already one of the most well known telecom companies in the world. \n\nTheir business model just isn't flashy any more since they don't compete for the fanciest new phone. But thier transition to infrastructure has been a better move for long term. \n\nPlus the moon play is way out in the future. Even if they design a few satellites, it would become more than an experiment until more people utilize the system. It's neat, they're forward looking but near term ROI from it is minimal.", "score": 2, "replies": [{"body": "I mean for the younger generations and companies who might not be as familiar with their past. They’re mostly a forgotten company at this point; I think this deal along with their 5G networks could create a big boost for them. When is the last time Nokia influenced the industry in the way they’re potentially set to? \n\nThe network won’t be as simple as creating it, there will be maintenance upgrades etc, where will they turn other than the original makers of their infrastructure? I think it’s a smart play but, in fairness, I’m newer to this", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Dude the nasa thing is a PR stunt by the looks of it. The 5g network they could build due to huawei ban is much more interesting", "score": 3, "replies": [{"body": "Like I said elsewhere in the comments that’s more good for brand recognition (as someone pointed out, not that they need it- but for younger generations who don’t remember Nokia phones and service) than it will be anything else. Nokia would (should, with the right direction) profit off of that with ease. I could be reaching or overthinking the potential but it could lead to a lot more expansion in the coming decade.", "score": 0, "replies": [{"body": "Are you talking about teenagers? Once they get a say about which telecommunications company gets to do out network it’s going to be about 8G", "score": 2, "replies": []}]}]}, {"body": "They’d have to produce a working prototype first.", "score": 2, "replies": []}, {"body": "\\*Insert Randy Jackson \"That's a hard no for me Dawg\" Meme\\*", "score": 2, "replies": [{"body": "I think this aged well. 🤣", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "I think this especially ignorant one aged even better. 🤣", "score": 1, "replies": []}]}]}
{"title": "Rocket Mortgage (RKT)", "selftext": "I thought this was a very good earnings report.  I think what this does is shield the stock from a big downside move over the next several months.\n\nBasically what we are looking at is a (diluted) EPS of 1.21/share.  Given a stock price of 21.50, that puts the P/E at 17.75.  The question now becomes...how does that P/E of 17.75 compare to similar mortgage companies?  I don't know.  A P/E of 17.75 doesn't really scream growth though (see TSLA, SNOW, ZM, SQ, for example).  Yet this company is making MONEY.\n\nRight now I own 400 shares with a CB of about 20.90.  If all of my11/13 options expire worthless...my CB now goes to 20.10.\n\nMy plan, going forward, is to write weekly calls to make 0.3-0.5 / contract.  That would yield 1.3 - 2.3% / week.  I would be EXTREMELY happy with that.  The company would REALLY have to dog and go to 15-17 for me to rethink that plan.  But I think the company itself will trade between 19-23 for the next few months, and it won't make any bigger moves unless there is a market-wide catalyst (nuclear bomb goes off in Canada, aliens land in Maryland, COVID just disappears one day and never to be found again, things like that.\n\n&#x200B;\n\nBoys and girls, I think we found a great wheeling and income-generating stock.", "id": "js2bc6", "created_utc": 1605072823.0, "score": 38, "upvote_ratio": 0.92, "num_comments": 37, "comments": [{"body": "Killing me smalls!!!\n\nThe EPS of $1.21 was just for the quarter. Annual EPS is more than double. It has a single digit P/E ratio. I’m in 15k shares and looking to buy on any dip.", "score": 13, "replies": [{"body": "Oh shit...that's right.  It's annual EPS / stock price.\n\nWhy is the P/E for this company so low?", "score": 5, "replies": [{"body": "Because everyone sees the refinance boom being short lived. The company went public at precisely the right time to post enormous revs and net. The expectation is that those banner earnings can only go down from here. \nI like this company in the near term and very long term. The intermediate will suck. The lockout will end in Feb.", "score": 8, "replies": [{"body": "What happens after the lockout? Moon or drill? Your thoughts?", "score": 1, "replies": [{"body": "My read is that we see RKT gain at least 10% in November, with the same in Dec and Jan. RKT will probably lose that momentum with the lockout expired, but it’ll probably do fine if the broader market doesn’t fall.", "score": 2, "replies": []}]}]}]}]}, {"body": "RKT CEO is going to be on Mad Money today.  Will be interested to see what he has to say.\n\nEdit:  Well it was a plug but a good one.  The highlights for me are\n\n\\-  CEO said that 70% of homeowners can still refinance and save $100/month;\n\n\\- A large percentage of homeowners (> 50%) are refinancing WITHOUT respect to interest rates, they are doing home improvements etc, \n\n\\- basically they have so much money that they are doing a buyback for almost like 40% of their entire float.  \n\n\\- then all this other nonsense about their platform, yada yada (I don't care about that.)\n\n&#x200B;\n\nI think this may not be a great growth stock, but it certainly should not be a bad place to park your money for the next few years.  Remember if it goes from 20 to 25, that is a 25% increase.  Goes to 30, that is a 50% increase.  Will AAPL, GOOG, AMZN, TSLA, MSFT, AMD, BABA, COP, CVX, frankly even the S&P 500, DOW, or NASDAQ go up 25-50% in the next 2 years?\n\nIt may not end up being a good stock to wheel if the volatility goes to below 50%.  But as long as it's stays higher than 50%, then it might be worth selling bi-monthy 1 SD covered calls for some extra income.\n\nWe shall see!", "score": 5, "replies": [{"body": "For what it's worth:\n\nThe 11/20 20 Delta (which is approximately \\~1 SD) call option is the 23.50 call and it's going for 0.26 and have an IV of 70%.  Not great but not bad.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "So how does one equate stock buyback to increasing a stock price?  I never really understood to quantify that.  They are going to spend 1B over 2 years?\n\nThey have 115M float.  1B over 2 years with an average price of 21 equals 47M shares.  So the float is going to go down from 115 -> 68.  That is totally significant.", "score": 5, "replies": [{"body": "Float Shrink to be specific.  So less shares also improves EPS and cash flow rate... not to mention less supply will actually allow these runs it tries to make from crapping out due to huge supply.", "score": 3, "replies": []}, {"body": "You nailed it my friend 🤙", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "I got into RKT when it was at 29. I stashed some of my gains from tendies into RKT. It has been on a downfall ever since. I agree that the stock has a strong support at 18ish level but I’m going to be out. There are faster horses in the market. After selling covered calls for three months, I’ve gotten the cost basis down from 29 to 22. Yesterday I sold a CC at 23 strike for $1.02. It’ll drop to pennies tomorrow due to IV crush. One or two more weeks of CC and I’ll exit this stock at my cost basis.", "score": 8, "replies": [{"body": "That’s kind of nice. RKT offers enough volatility that even after some months you were able to exit without a huge loss.", "score": 2, "replies": [{"body": "That I agree. I was able to bring down my cost basis from 29 to 22 in four months. I will accept assignment and will sell puts on RKT for sometime now.", "score": 2, "replies": []}]}, {"body": "How far out do you sell your CCs?", "score": 2, "replies": [{"body": "Depends on whether I want to accept assignment or not. For example, my cost basis on RKT is down to the low 22s and I want to exit my 100 long shares. So I’ll sell a 22 Call. On the other hand, I had some AAPL stocks in my long term portfolio and I want to hang on to them long term, I’d sell at 2 standard deviation or 5 delta and give up on some premium.", "score": 3, "replies": [{"body": "5 delta means 0.5?", "score": 1, "replies": [{"body": "0.05", "score": 2, "replies": [{"body": "Thanks for explaining!", "score": 1, "replies": []}]}]}]}]}, {"body": "wow, nice work, I have been too chicken to sell covered calls lower than my cost basis but you inspired me", "score": 1, "replies": [{"body": "I try not getting closer than one standard deviation and 45 days out to give me maximum room. Obviously you don’t want to get your stocks called away for lower price than your cost basis.", "score": 2, "replies": []}]}]}, {"body": "The same can be said about Albertsons\n\nI guess it's not meme-y enough", "score": 3, "replies": [{"body": "Interesting Cramer said on Mad Money several weeks ago that ACI (Albertsons) is crazy cheap and doesn't understand why it's trading so low.", "score": 2, "replies": [{"body": "Tons of debt and lower ROIC than kroger", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "My understanding is it that it is not going to happen all at once immediately, but an option to do so over time whenever they want. Another redditor suggested it may be useful for them to help mitigate short selling at particularly bad times and keep the stock price up. The sounded like a nice explanation to me but really idk 🤷‍♂️", "score": 3, "replies": []}]}, {"body": "Don't compare RKT with tech - it's a financial so that means you need to be looking at earnings multiples based off book values.  Totally different capital structure.  You have to value it as a bank or insurance company.  B/c that's what it is doing -  originating and holding loans to maturity.  These are intangibles so what I said is a better measure of valuation.", "score": 2, "replies": [{"body": "Rocket does not hold loans to maturity.", "score": 9, "replies": [{"body": "PNC, PFSI, and COOP are similar.", "score": 3, "replies": []}]}, {"body": "I hear what you are saying but it sells most of it's loans to others like Freedic Mac or Fanny Mae. \n\nAnyway though...I'm really having a hard time finding another public company that does what Rocket does.  For comparison.", "score": -1, "replies": []}]}, {"body": "I guess we shall see what kind of IV crush this stock sustains over the next several days.  Maybe it will go down to 50% or less which won't be that good for wheeling.", "score": 1, "replies": [{"body": "that's my assumption, but time will tell", "score": 0, "replies": []}]}, {"body": "IVR is near 0. No thank you.", "score": 0, "replies": []}, {"body": "You should checkout wildwesttrades they are going to be discussing these topics", "score": -10, "replies": [{"body": "Stop soliciting", "score": 5, "replies": []}]}, {"body": "So your saying to dump my straddle @20 that expires tomorrow?", "score": 1, "replies": []}, {"body": "I'll consider wheeling it depending on what happens with those premiums.", "score": 1, "replies": []}]}
{"title": "Retards get ur BA 200c ready! We going to the moon 🌗🚀🚀🚀", "selftext": "", "id": "jrwxuk", "created_utc": 1605052995.0, "score": 19, "upvote_ratio": 0.86, "num_comments": 35, "comments": [{"body": "Poor Yeminis", "score": 22, "replies": [{"body": "They won't be poor if they buy Boeing tho", "score": 8, "replies": []}, {"body": "Why?? Is there a conflict between Saudi and Yemen?", "score": 0, "replies": [{"body": "Yes, it's been one of the worst humanitarian crises of this century, where have you been?", "score": 18, "replies": [{"body": "Just got out 10 years coma JK. I just don’t like to watch cnn or war and stuff like that.", "score": -1, "replies": [{"body": "The ostrich strategy. Nice.", "score": 14, "replies": []}]}]}, {"body": "The saudis are just gonna use the jets for casual flyovers", "score": 3, "replies": []}]}]}, {"body": "Sold my 162.5 calls yesterday morning for $600 profit. Could have been $30k. Woopsm", "score": 10, "replies": [{"body": "Profit is profit boy, if u got ball, fucking jump in tomorrow", "score": 5, "replies": []}, {"body": "Yut you’re right. Also sold my aurora and palantir otm calls a day before take off last week.", "score": 2, "replies": []}]}, {"body": "This company is such shit but the govt keeps them rockin. Rip 180p", "score": 8, "replies": [{"body": "It’s fucking billions dollar company, it not gonna go bankrupt like Hert man", "score": 5, "replies": [{"body": "But bruh.. their fucking passenger planes fell out of the sky... they've had countless lawsuits and laid off massive amounts of people. They are breastfed by the US government without them they would be 15 different smaller companies.", "score": 2, "replies": []}]}, {"body": "I'm a Canuck; I'd like to introduce you to a little company called Bombardier...", "score": 1, "replies": [{"body": "Frig off ricky", "score": 4, "replies": []}]}]}, {"body": "I loaded up on shares at 150 you love to see it", "score": 5, "replies": [{"body": "Holding 500 shares at 150, and 11/20 210c X 7, fucking to moon", "score": 5, "replies": []}]}, {"body": "I am thinking you will have better odds with Virgin Galactic and there test flight this month!\n\nSPACE 🚀 🚀 🚀", "score": 4, "replies": [{"body": "Got 5 contracts on it", "score": 5, "replies": []}, {"body": "They are net positive every month, meaning it’s just hype no results", "score": 1, "replies": [{"body": "Wouldn’t a test flight this month that leads to FAA certification to fly passengers to space be considered progress?", "score": 1, "replies": [{"body": "Sure however logistics aside it doesn’t help raise the price until the FAA certificate is granted", "score": 1, "replies": []}]}]}]}, {"body": "737 Max is recertification is also suppose to come in the next couple days. Praying for my calls 🙏", "score": 4, "replies": [{"body": "🙏🏼 for u boy", "score": 1, "replies": []}]}, {"body": "hate to say it but this isn't really news. Saudis have had F-15s/Boeing support for years this is just a fresh extension of an already existing revenue stream. \n\nI still think it will pump over 200 though, but based off of 737MAX recertification and the good vaccine news, not F-15SAs", "score": 3, "replies": []}, {"body": "Shieet sold my calls too early lmfao", "score": 2, "replies": []}, {"body": "I don’t care BA drop to 90, no way I’m selling BA until it goes back to 300", "score": 2, "replies": []}, {"body": "Can’t believe I sold my calls this morning", "score": 2, "replies": []}, {"body": "Boeing is in a deep downtrend, it might spike here and there but I don't see it coming out of that hole anytime soon.", "score": 3, "replies": [{"body": "Yea it definitely not going back to 300 at least 2 or 3 more years but I can see it go to 220 before it drop back to 180", "score": 4, "replies": []}]}, {"body": "Boeing is a long position. Anyone trying to swing trade Boeing has massive balls considering the swing in bond rates that happened on Friday/Monday.", "score": 2, "replies": [{"body": "Decent fucking company, will hold my shares until it back to 300", "score": 2, "replies": []}]}, {"body": "Nice", "score": 1, "replies": [{"body": "Wallstreet been talking shit about 737 max all this morning, tomorrow gonna be a good day for BA", "score": 6, "replies": []}]}, {"body": "I’ve had those $200 calls since $145. To tha mooooooon", "score": 1, "replies": []}]}
{"title": "Time to load up on FedEx", "selftext": "[deleted]", "id": "jrx60a", "created_utc": 1605053752.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 38, "comments": [{"body": "Ups stock dropped after earnings even after beat expectations.......", "score": 14, "replies": [{"body": "Well, to be fair, the entire market dropped right after UPS earnings because of the election.  Followed by vaccine news.\n\nAlso, didn't they give bad q4 guidance?", "score": 0, "replies": [{"body": "And ups still hasn’t recovered.........", "score": 2, "replies": [{"body": "It hasn't really had a chance - we got hit immediately after the election drop with the vaccine news/drop.  Think about the amount of s*** that happened in the last 3 weeks.  And it really isn't down that much at this point.\n\nAlso UPS had bad q4 guidance, if I recall correctly, which contributes a lot to how a stock fairs after earnings.", "score": -1, "replies": [{"body": "In other words, FDX will fuck you", "score": 1, "replies": []}]}]}]}]}, {"body": "$NKLA won the contract to transport all vaccines", "score": 11, "replies": [{"body": "Only on downslopes", "score": 11, "replies": [{"body": "I heard the vaccines are coming from the mountains, on Facebook news by a friend", "score": 4, "replies": [{"body": "Thank you for providing me with reliable information from a trusted source.", "score": 1, "replies": []}]}]}, {"body": "I heard NKLA has to transport half to TSLA factories and the other half to NIO factories, where they will wrap them in PRPL mattresses for transport by FDX to hospitals.", "score": 6, "replies": [{"body": "That's exactly what I heard.", "score": 5, "replies": []}]}]}, {"body": "Is this autism or should I blindly follow.... Or both?", "score": 3, "replies": [{"body": "When in doubt, yolo", "score": 3, "replies": []}, {"body": "Or inverse WSB", "score": 1, "replies": []}]}, {"body": "Jesus fucking christ shoot me.", "score": 3, "replies": [{"body": "I love your name.", "score": 3, "replies": []}]}, {"body": "FedEx is out of network capacity. They’re facing a 10m package a day deficit during peak. Possible catastrophic network failure of both FedEx and UPS this peak. \n\nThey’ll both probably hit ATH if they fail because nothing makes sense", "score": 3, "replies": [{"body": "Can't they just hire more people?", "score": 1, "replies": [{"body": "You’d think. It’s not just people, They don’t have enough trailers to service the volume. I’m in the logistics industry, my warehouses are living  this every day. The carriers are the bottleneck right now. Puts on 2020 peak.", "score": 2, "replies": [{"body": "Interesting, thanks for the insight", "score": 1, "replies": []}]}]}]}, {"body": "FedEx can never seem to deliver a package on time in my area. Horrible. I actively avoid them whenever possible. Must be bullish, right?", "score": 2, "replies": []}, {"body": "Congrats on your diamond hands. I had purchased some fedex calls but sold earlier. Thinking about grabbing another based solely on the fact that the fedex ground near my house recently upped their starting pay from 17/hr to 24/hr for upcoming peak season. Good ass wages for factory work", "score": 2, "replies": [{"body": "Thanks man.  It was a good day.  I still think there's a lot of upside - I see it at 290 by earnings.", "score": 1, "replies": [{"body": "I absolutely agree. Still a good bit of time for a run up. And a run up would only make sense to me for Christmas season coming up and lockdowns.", "score": 1, "replies": [{"body": "Bought 5 more at 282.5 today. Hope you got in.", "score": 1, "replies": [{"body": "Yessir! Grabbed 3 280 for a 90% gain so I’ll take it. How much is your total position up?", "score": 1, "replies": [{"body": "Nice.  I'm up 50%, 16k right now.  Holding until I'm up 90%+.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They didn’t kill it before COVID. They were in the toilet. COVID has saved them. That said- I’ve way deeper into transports than I would like given the cliff they’ve fallen off and really need a turn around. \n\n[dumb 1](https://imgur.com/a/E8FtNRc)\n[dumb 2](https://imgur.com/a/f95UBUr)", "score": 1, "replies": [{"body": "Nice on the FedEx 250c.  That was a good grab.  Wish I'd gotten that.  Your other calls are kind of far OTM but I think you'll be fine given the long expiration dates.", "score": 2, "replies": [{"body": "Ya- had picked up 10 of those $250s for like 6k and cleared like 15k profit on last earnings so I held these last 2. Rolled that profit and spread it around a bit and now you can see the problem. Thanks for the vote of confidence. LOL- they weren’t that far OTM 2 weeks ago. I got them all about 5 weeks ago.  Its like you said- I’ve got time and diamond hands. To zero I ride.", "score": 2, "replies": []}]}]}, {"body": "Their volume is up significantly, but their operating costs are as well. Just look at UPS earnings call.", "score": 1, "replies": [{"body": "In my view, these are both good problems to have.", "score": 1, "replies": []}]}, {"body": "Puts.", "score": 1, "replies": []}, {"body": "You’re playings earnings >1 month out?", "score": 1, "replies": [{"body": "It's a combination of now being a good entry point because of the dip and upcoming earnings.  But in general, I do play earnings pretty far out - I get in around 3 weeks before.", "score": 1, "replies": []}]}, {"body": "Quick earnings story for 2020. Any stock: crushes earnings. Drops anyways.", "score": 1, "replies": [{"body": "Yeahhhh best to avoid holding options through earnings due to IV crush anyway.  Will probably sell my December 24th calls right before earnings. But I may hold my January calls until after, haven't decided.", "score": 1, "replies": [{"body": "Yea I’ve made the mistake of holding through earnings before. I did hold Corsair through today tho. Strong believer in Corsair. Apple has had me nervous basically since it split. Maybe it’s time to enter tho", "score": 1, "replies": []}]}]}]}
{"title": "Robinhood retards are well trained in ignoring & so are wsb autistic 😆 what even is value? Idk pfizer fucked bears, covid traders fucking eachother 👏🤣", "selftext": "", "id": "jryz8l", "created_utc": 1605060061.0, "score": 463, "upvote_ratio": 0.98, "num_comments": 39, "comments": [{"body": "Yea I yolod on a weed stock and now I'm hoping it goes back up sometime this week or imma rope neck", "score": 68, "replies": [{"body": "To clarify i made money on said weed stock. And lost all the profit after.", "score": 20, "replies": [{"body": "Classic autistic move, acb gave profit then bam u yolo'd again", "score": 12, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Yea imma just hold out however long that takes. Could be years. Lucky I bought shares and not options.", "score": 1, "replies": []}]}, {"body": "Acb ? Or...", "score": 3, "replies": [{"body": "Sundial. Even worse.", "score": 1, "replies": []}]}]}, {"body": "She packin", "score": 35, "replies": []}, {"body": "Hey, better than being a 🌈🐻", "score": 19, "replies": [{"body": "Always", "score": 3, "replies": []}]}, {"body": "Poor girl, I bet she had no idea what she was doing", "score": 16, "replies": [{"body": "You gotta give respect to the cop though", "score": 19, "replies": []}]}, {"body": "You know he got a wife at home that will whoop his ass", "score": 16, "replies": []}, {"body": "Who tf is this", "score": 5, "replies": [{"body": "Miesha Tate", "score": 13, "replies": [{"body": "*quickly googles Miesha Tate*", "score": 19, "replies": [{"body": "Any good science?", "score": 2, "replies": [{"body": "For 25 bucks you could probably convince her to kick you in the nuts.", "score": 17, "replies": [{"body": "Pass. I'd rather buy tech calls", "score": 19, "replies": []}, {"body": "Would that be enough to put me on disability so I never have to work again?", "score": 2, "replies": []}]}]}]}]}, {"body": "It was a let down", "score": 9, "replies": [{"body": "LMAO", "score": 3, "replies": []}]}, {"body": "😅 gotta go validate that ass", "score": 1, "replies": []}]}, {"body": "Her bulge is a prosthetic", "score": 7, "replies": [{"body": "No that's just her clit being bigger than your dick due to all the steroid usage.", "score": 1, "replies": [{"body": "Wait, if I do steroids will my dick get that big?", "score": 1, "replies": [{"body": "Nah your balls will just shrivel as your natural testosteron production will go on a halt. Life is unfair brothers.", "score": 1, "replies": []}]}]}]}, {"body": "They did a study on eye movement when each sex first sees the other. Predictable results.", "score": 3, "replies": [{"body": "Link? That sounds interesting", "score": 1, "replies": [{"body": "I tried to find it myself! Couldn’t. Some similar stuff but not the exact one I saw some time ago. Basically men mostly look at face, tits, arse / hips and calculate the breast/ waist/ hip ratios. Then look at hair, mouth, eyes.   \n\n\nWomen look at face, chest shoulders then crotch.", "score": 2, "replies": []}]}]}, {"body": "Sauce", "score": 2, "replies": []}, {"body": "Is that Joe Rogan coping a feel?", "score": 2, "replies": [{"body": "Jre the man", "score": 1, "replies": []}]}, {"body": "Fuck the police", "score": -11, "replies": []}, {"body": "Ain’t that a dude?", "score": -9, "replies": []}, {"body": "You know you like it. Come to the darkside aka analysis.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Alright, I got this \n###[Download via redditsave.com](https://redditsave.com/info?url=/r/wallstreetbets/comments/jryz8l/robinhood_retards_are_well_trained_in_ignoring_so/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveThisVIdeo/comments/iggmt9/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savethisvideo) &#32;|&#32; [**Donate**](https://ko-fi.com/getvideo)", "score": 1, "replies": []}]}]}
{"title": "The captain is back after a few perfectly executed next day spy calls/puts, and 6k into BA calls! Never give up my fellow retards. When all is lost stay autistic but never go full retard. Stay strong my bulls 😎", "selftext": "", "id": "js1ero", "created_utc": 1605069125.0, "score": 308, "upvote_ratio": 0.97, "num_comments": 35, "comments": [{"body": "And your buying power is still negative. I’ll see you at the unemployment line", "score": 114, "replies": [{"body": "[removed]", "score": 42, "replies": [{"body": "Yup. It’s like getting back together with an ex girlfriend who’s hurt you before, who’s hurt you really bad. Now I’m just sitting here holding 40k in OTM weeklies shitting my pants", "score": 49, "replies": [{"body": "This is why I’ll see you at the unemployment line", "score": 51, "replies": [{"body": "Or on the cover of Forbes. Who knows 🤷🏻‍♂️", "score": 44, "replies": [{"body": "All jokes though. Good luck with your lotto tickets my friend", "score": 14, "replies": []}, {"body": "https://imgur.com/o8dw1jo", "score": 5, "replies": []}, {"body": "In the unemployment line reading a copy of forbes", "score": 1, "replies": []}]}]}]}]}, {"body": "He won't even be able to long $ROPE after it's said and done with that negative buying power", "score": 1, "replies": []}]}, {"body": "HOW", "score": 13, "replies": [{"body": "He kept inversing himself and it kept working.", "score": 42, "replies": [{"body": "Story checks out", "score": 7, "replies": []}]}]}, {"body": "Needed to see this 🙏", "score": 10, "replies": []}, {"body": "Cappin fuckin tendies back in the cut!!!! Stay autistic my G", "score": 10, "replies": []}, {"body": "I drink bean smoothies, soon u will too", "score": 8, "replies": []}, {"body": "Come on now", "score": 8, "replies": []}, {"body": "Be honest though, this was more due to dumb luck than skill.", "score": 8, "replies": []}, {"body": "can you yolo some into my tuition plz", "score": 6, "replies": [{"body": "My student loans too pls", "score": 3, "replies": []}]}, {"body": "What changed capt? Just luck or..", "score": 6, "replies": [{"body": "Patience", "score": 4, "replies": [{"body": "🤔it usually led to theta slow bleed for me", "score": 14, "replies": []}]}]}, {"body": "10k%. Wow.", "score": 3, "replies": []}, {"body": "fuck you", "score": 2, "replies": []}, {"body": "How do I get that mint green color back?", "score": 2, "replies": []}, {"body": "Congrats, and fuck you!", "score": 3, "replies": []}, {"body": "Hi. What app is this?", "score": 1, "replies": [{"body": "Lol.  It's RobinHood.", "score": 1, "replies": [{"body": "Thanks. I'm not a US citizen so have not used Robinhood.", "score": 0, "replies": []}]}]}, {"body": "Positions and all time? 😂", "score": -1, "replies": [{"body": "Check previous posts. I’m still down 14k all time. It’s been a roller coaster from up 65,000$ to down 50,000$ to almost even 😂", "score": 13, "replies": [{"body": "I still haven’t broke the 10k barrier bro so you got me 😂 best of luck! I got pton puts...they printin big this week er nah?", "score": 3, "replies": []}, {"body": "Only 9 more perfect trades to go!", "score": 1, "replies": []}]}]}, {"body": "BA GANG lessgoooo! you think its another fluke when it hits 230, or will it go back to 300s?", "score": 1, "replies": []}, {"body": "What a recovery nice work!", "score": 1, "replies": []}]}
{"title": "NIO & TSLA", "selftext": "[deleted]", "id": "js1wrd", "created_utc": 1605071136.0, "score": 33, "upvote_ratio": 0.79, "num_comments": 32, "comments": [{"body": "Your hands are made of warm butter", "score": 103, "replies": [{"body": "Mmm", "score": 9, "replies": []}]}, {"body": "Youre supposed to hold the stock for more than a fucking day retard", "score": 67, "replies": [{"body": "But then you get taxed every day!", "score": 11, "replies": [{"body": "You mean... you dont get taxed everyday? Right?", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 34, "replies": [{"body": "What you did there. I see it.", "score": 13, "replies": [{"body": "I bet you do", "score": 3, "replies": []}]}, {"body": "I wonder if there's a sub for that.", "score": 9, "replies": []}]}, {"body": "Sthu  bought tesla at 42$ pre split then sold it at 50$ exactly 1 day before it jumped 50% so me and my logic said that a company can't have changed 50% in 1 day so I didn't buy again. It was like 208$ then 250$ I sold. Next day 320$ then 400 then 600 them 800 then 1000 then 1200 then 1800 then 2100$. Oh ya I also saw nio at 1.67$ didn't buy tho so I will neck rope bye.", "score": 15, "replies": [{"body": "This gives me ptsd", "score": 8, "replies": []}]}, {"body": "weak hands will never win in this game", "score": 13, "replies": []}, {"body": "Stocks aren’t for everybody", "score": 10, "replies": []}, {"body": "Nio and Tesla hand and hand bro!!!", "score": 8, "replies": []}, {"body": "youv'e got some bitch hands", "score": 6, "replies": []}, {"body": "Bro...you need to stop playing the market. Or just buy and hold like a boomer. You’re not cut out for this. At all 😂", "score": 12, "replies": []}, {"body": "I see you like to flip. May as well do options..", "score": 3, "replies": []}, {"body": "I’m buying puts on this clown", "score": 3, "replies": []}, {"body": "what the fuck are these shares things you keep talking about?", "score": 2, "replies": []}, {"body": "Idk man sounds like you're doing it right.", "score": 2, "replies": []}, {"body": "Yeah I bought at almost the top, too.  Thankfully I recently converted to pussyism so its all shares, and I plan to hold longtime.", "score": 2, "replies": []}, {"body": "Shorted @42.86 and grabbed puts closed about 80% of position at 41.07, holding over. I believe with market uncertainty, overbought and earnings coming up this will need a solid correction. I can see $36 level and potentially lower before continuation. That will be determined on earnings results", "score": -1, "replies": [{"body": "Robinhoods are going to be all over NIO tmmrw.", "score": 1, "replies": []}]}, {"body": "Tesla will keep going down the coming days, bottoming out on friday or monday.", "score": -1, "replies": [{"body": "So will your mother", "score": 2, "replies": []}, {"body": "Go away 🌈 🐻", "score": 1, "replies": [{"body": "Im not a gay bear, just sold at $450 and will buy in again on friday/monday! Just compare todays nasdaq with how nasdaq acted in the two previous elections. Creepily similar.", "score": 3, "replies": []}]}]}, {"body": "Sorry, i meant to say. Why the fuck are you buying shares? I bought 6 puts yesterday and made 200 dollars today. Buy FDs and become a millionaire over night", "score": 1, "replies": []}, {"body": "Damn how did you manage to catch that tippy top so perfectly?", "score": 1, "replies": []}, {"body": "It might go up near Thursday or Friday with earnings coming up", "score": 1, "replies": []}, {"body": "If you’re selling at less than 10% profit then you need to reassess your risk strategy", "score": 1, "replies": [{"body": "What about dumping at -20% ?", "score": 1, "replies": []}]}, {"body": "Woow you are such a gay bear, you will never make money donkey. Try to hold it for more than a year lel.", "score": 1, "replies": []}]}
{"title": "WARNING BEARISH ENGULFING NIO", "selftext": "*DISCLAIMER*\nI AM NOT HOLDING ANY NIO SHARES OR CONTRACTS\n\nI have been watching NIO since it’s been plastered all over Wall Street bets. Just a heads up to anyone who cares, there is a bearish engulfing candle forming on NIO. A modest price target is around $26. RSI in every time span is over 70. Thinking of picking up lotto puts but haven’t pulled the trigger yet. Now I’m not telling anyone what to do, I’m speaking for myself but I think now is a good time to pick up some cheap puts, this is the same chart that tsla had when it hit $900-1000. Same bullish doji turned to bearish engulfing. Similar to most meme stocks you guys create.", "id": "jsc6p9", "created_utc": 1605114991.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 33, "comments": [{"body": "Appreciate the warning but the only thing a 🐻 will be engulfing are deez nuts when my wsb bros and I vacation in the Maldives with our calls", "score": 43, "replies": [{"body": "LETS GO BABY", "score": 6, "replies": []}, {"body": "For your sake. I hope you’re right, I’m just reading the chart in front of me and it’s turning into a strong sell.", "score": 2, "replies": [{"body": "On what time line? Cuz on the daily, for it to be a bearish engulfing it would need to top yesterday and then go back below yesterday as well. Yesterday was more bearish but held support. Actually nicely the bottom like from 37 to 38 with a strong resistance around 45. Higher bottoms. Higher highs. Amazing earnings around the corner. Avg 12 month target of $155 a share. If anything this looks like Tesla from 220-330 before if went to 550 and THEN up to 960 before selling off. I’d say we have a looong time before nio gets a huge sell off. People aren’t selling their shares man 😂", "score": 3, "replies": [{"body": "if ya think MMs will pay those call gains to wsb retards ya retarded", "score": 2, "replies": [{"body": "Don’t need MM money. Just take 95% of this subs money. That’s enough for me 😂", "score": 2, "replies": []}]}, {"body": "People arnt, but market makers will. And then “people” will hold the bag until MM find it an attractive buy again", "score": 1, "replies": [{"body": "It’s an attractive buy up to 155 by next November just make sure you buy out far enough and leave some cash to avg down. Free money all year.", "score": 1, "replies": []}]}]}]}]}, {"body": "^(o k)", "score": 5, "replies": []}, {"body": "Why it just go green then", "score": 3, "replies": [{"body": "Why it just go red then", "score": 1, "replies": [{"body": "You were saying?", "score": 1, "replies": [{"body": "It’s up 60 cents. Lol you must be rich by now?? Just wait bud I’ll get back to you I’m not worried", "score": 0, "replies": []}]}]}]}, {"body": "What positions are you looking at?", "score": 2, "replies": [{"body": "None, I’m not trading a meme stock, I’m just saying that’s a bearish engulfing candle if I have ever seen one", "score": -7, "replies": []}]}, {"body": "I was thinking of selling my calls right before earnings. U think I got time ?", "score": 2, "replies": [{"body": "You and everyone else are thinking that, which is part of the reason why it will dip hard", "score": 1, "replies": [{"body": "Selling before earnings is the thing to do.", "score": 3, "replies": []}, {"body": "Ah I feel that", "score": 2, "replies": []}]}]}, {"body": "Isn't bearish engulfing is not much concrete as it sounds compared to bullish one? I would not pull any bearish trigger giving its retard strength.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "The only thing that’s going to be crushed is your IV", "score": 1, "replies": []}]}, {"body": "Imagine believing this buffoon. It's already in the 42s", "score": 2, "replies": [{"body": "It’s up 60 cents lol imagine thinking that the head and shoulders pattern doesn’t mean anything", "score": -1, "replies": [{"body": "You're fighting against the herd mentality here man....people here hate TA with a passion too. Head and shoulders patterns to these people are the same as voodoo witch doctors trying to cure rain droughts with blood sacrifices.\n\nLet them learn the hard way.", "score": 1, "replies": []}, {"body": "Yes, head and shoulders does not mean anythig.Technical analysis is bullshit.", "score": 1, "replies": []}]}]}, {"body": "Shut up baby dick", "score": 2, "replies": []}, {"body": "What positions would you take?", "score": 1, "replies": [{"body": "None, I’m not trading a meme stock, I’m just saying that’s a bearish engulfing candle if I have ever seen one.", "score": -3, "replies": []}]}, {"body": "What timeframe are you looking at?", "score": 1, "replies": [{"body": "Most likely before earnings to trap everyone who bought at the top in hopes earnings will turn it around", "score": 2, "replies": [{"body": "No.. Are you looking at the daily? 4 hr chart? 1 hr chart?", "score": 3, "replies": [{"body": "Daily-weekly", "score": 2, "replies": []}]}]}]}, {"body": "I just checked it and the meme line was red. Oh fuck, oh no.", "score": 1, "replies": []}]}
{"title": "A perfect Cup & Handle formation on VIX, a bullish sign for VIX", "selftext": "", "id": "jshl4e", "created_utc": 1605132313.0, "score": 6, "upvote_ratio": 0.58, "num_comments": 30, "comments": [{"body": "Why even ... this post should be Shitpost.\n\nPositions or ban.", "score": 28, "replies": [{"body": "VIX 11/20 $25c", "score": -5, "replies": [{"body": "Upvote for positions, but you could have just lit your money on fire instead (F)ag 🐻", "score": 12, "replies": [{"body": "how did your day go?", "score": 1, "replies": []}]}]}]}, {"body": "Classic Hammer and Sickle formation, only a few days now before JPow nationalizes PFE", "score": 10, "replies": []}, {"body": "Haha charting on robinhood that is a funny joke man!", "score": 18, "replies": [{"body": "i used my professional photo editing software to draw the lines, calls on snap", "score": 14, "replies": [{"body": "I hated you at the beginning of the thread but u won me over", "score": 4, "replies": []}]}]}, {"body": "LOL how you got silver on 'TA' for the VIX proves the retardedness of this sub. I love it.", "score": 4, "replies": []}, {"body": "You do realize VIX is a synthetic index and does not move on its own right. It is based on PUTs and Calls being bought and sold looking into the future.", "score": 2, "replies": []}, {"body": "Mother of god", "score": 0, "replies": [{"body": "You’ll see. You’ll all see.😠", "score": 6, "replies": [{"body": "I’m so happy you were right lmao", "score": 1, "replies": [{"body": "did u get some good tendies? i dont have a lot of money to put in but i made like $50 off my vxx puts and some off pltr puts\n\nnow with the trump/china news im making money off of nio puts", "score": 1, "replies": [{"body": "I’m holding NIO leaps. Mostly just thought your comment was fucking hilarious so I’m happy it printed off you", "score": 1, "replies": [{"body": "yea my nio puts are 11/13 so we will see if the lotto pays off", "score": 1, "replies": [{"body": "Be careful holding overnight with the LI auto earnings coming out pre market tomorrow!", "score": 1, "replies": [{"body": "youre the only person here who makes any sense", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": " 🤡", "score": 0, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/jar_are_red don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "\"Do you want to know how I got these gains?\"", "score": 1, "replies": []}, {"body": "People still believe in this shit?", "score": 1, "replies": [{"body": "With every cell in my body", "score": 1, "replies": [{"body": "with every retarded cell in your body", "score": 0, "replies": [{"body": "my cells may be retarded but at least they have more cromosones than yours", "score": 1, "replies": [{"body": "can't even spell chromosomes.", "score": 0, "replies": [{"body": "that was part of the joke", "score": 1, "replies": [{"body": "Nah u are just retarded", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Whaa you were right man", "score": 1, "replies": [{"body": "[me](https://www.youtube.com/watch?v=S9RVS8cjNN0&ab_channel=haikuginger)", "score": 2, "replies": []}]}]}
