{"title": "what would make NIO and XPEV crash?", "selftext": "[removed]", "id": "jogke0", "created_utc": 1604572268.0, "score": 26, "upvote_ratio": 0.9, "num_comments": 37, "comments": [{"body": "Watching NIO jump to 27-28 made me happy. Watching it jump to 38 just a week later makes me hella nervous...\n\nI want to buy more but i always get burned buying on Green Day’s and especially Fridays in general there are dips for my stocks so i shall wait until next week", "score": 24, "replies": []}, {"body": "Me buying in.", "score": 17, "replies": []}, {"body": "Chinese stocks are volatile. You will get another chance to buy dont worry.", "score": 14, "replies": []}, {"body": "I'm also surprised by the extent of the rally, I expected 20 by year end.\n\nBut no, I'm not selling yet, the market will continue to boom and I believe they have the edge over Xpeng.", "score": 13, "replies": []}, {"body": "NIO has reached a point where even it crash so bad, I will be still in green so I'll hold as long as I could. \n\nI will buy more if the stock drop below 35 and i can see that happening after earning...", "score": 10, "replies": [{"body": "I see a lot of ppl saying it will drop during earnings. Can you explain to me why is that? Just wondering cuz I’m new to stockslol and I’ll get sell my position before it goes down on earnings day", "score": 3, "replies": [{"body": "\"Buy the rumour & sell the news \" even if its good news. That's been the trend during this last earnings reports for the big tech giants and others. This seems to be a predictable  trend so naturally people view this as an opportunity to purchase  back in at a lower price after earnings.", "score": 1, "replies": []}]}]}, {"body": "This isn't the first time they've had spectacular runs. The spike starts to peter out after a few days, and then the people who trade options start creating volatility and there will be some wild swings and people will get out because it's unsettling and confusing. After a while the volatility will drive people out and the price will settle down at a much lower level and following some new fabulous news there will be another spike up in prices. \n\nIt's very likely that there will be another chance to buy in lower than these prices today. It's advisable to not sell when the wild swings set it, unless you feel lucky and want to day trade the swings.\n\nEdit: Also, whenever Chinese stocks start getting too fabulous, the US gov does something like blacklist the fabulous stock(s) or put them on a supplier ban. So these Chinese EV stocks could end up on an entity list, if the US gov can figure out a way that they could possibly be treated as a national security threat.", "score": 4, "replies": []}, {"body": "jp morgan priced nio at 40$ and it's one of the most hyped stocks rn, so it still has a lot of potential. \n\nwe'll see after q3 earnings if it's stable.", "score": 4, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "market is kinda based on speculation and future prospects nowadays. Tesla's proven that it doesn't matter if there's a catalyst or not. As long as people think that nio will be valued higher in the future it will continue to go up.\n\ndo some research and decide if they're going to be around in the next 5-10 years.\n\nbut yeah there will be a huge pullback if earnings don't beat expectations.", "score": 1, "replies": []}]}]}, {"body": "I don't think people understand the risk of these companies. This could end really badly for a lot of people. Hopefully not but it most definitely can, these companies are in their infancy. Nio sold 26k cars so far this year. They are valued at 57 billion. How many cars do they scale to next year, if they fall anywhere short it tanks because 57 billion is a massive price tag. If they don't show a path to profitability they tank. Right now there is euphoria in the market.", "score": 3, "replies": [{"body": "you're short seeing things, people are investing in EV, in the big picture, not only in NIO as one of the GOV backed up company with improving results. Market will correct as usually, but I don't believe in a crash towards < 20. I may be wrong...", "score": 2, "replies": []}]}, {"body": "1)  I see M&A in China future EV market.  There are dozens of EV makers in China.    Crash of EV market, no.  They have a growing middle class with one of the highest saving rates on the planet.  Economies dont crash when the personal bank accounts are full of money.\n\n2)  I have had both NIO and XPEV for about 3 months now.  XPEV hasn't been doing anything for 3 months but go sideways, until 3 days ago.  NIO been pretty bullish for 3 months consistently.\n\nI find analyst ratings to be inconsistent with stock performance in general.  I look more at sales figures and general chatter on wechat for emotional telemetry of China stocks.", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "The video clearly shows there are enough battery swap stations and recharging stations between Chongqin and Chendu.  Not to mention you can hired some APP person to upgrade the sound system inside, I assume 3rd party not affliated with NIO.  So if you're a tuner that's a good thing.  Tesla doesnt allow you to custom tune their cars without authorization.\n\nWhen you do a battery swap.  The battery swap is free.  The charging at the station cost money.\n\nOn their first swap they got a 100 degree battery.  On their 2nd swap they got a smaller 70 degree battery.  Then when they arrived at Chendu they opted to fully charge the battery and went off to see a DJ.  Then on their return trip to Chongqin they stop off and did a charge at a charging station.\n\nAs long as the infrastructure to recharging and battery swapping is there,  not much anxiety.  He even said the car will call you to remind you to recharge with approximately how many km you have left.", "score": 3, "replies": []}]}]}, {"body": "Thoughts on a late thursday/friday sell off/drop?", "score": 2, "replies": [{"body": "I think we saw a slight sell of yesterday with nio, not sure about xpeng as I haven't done any research on this stock", "score": 1, "replies": []}]}, {"body": "Well, I am also long on Nio and am worried as well about a possible crash. I think Nio offers a unique advantage since currently it only sells its cars in China. With that said I think possible risks of a crash are:\n\n1) China gets more Rona cases and American investors freak out (Nio ADR).\n\n2) Trump sues over alleged fake ballots, drags the media in and prolongs the process. (I'm not being political, just stating what could happen with Trumps current plans to sue).\n\n3) Housing crisis in America continues to get worse and the economy doesn't recover in time causing a general market crash.\n\n&#x200B;\n\nAs for Xpeng, I also haven't done enough research so I cant speak on a crash, but given that they are increasing production and I think they are (correct me if I am wrong) starting to build their own factory, then their trend might level out after the election and probably face the same threats as Nio right now since they are also in China.", "score": 2, "replies": []}, {"body": "Sold my xpev; something weird is going on there...", "score": 2, "replies": [{"body": "why do you say that", "score": 1, "replies": [{"body": "It jumped 20% yesterday and another 25% today...that’s not normal stock behaviour", "score": 2, "replies": [{"body": "Wouldn't it be advisable to set a Trailing Stop Order to try to lock in some of the profits in the event of a dip? I am aware that sometimes it can backfire and it can open at a lower price than what you set it to but can't you account for that by making the range of the trigger larger?", "score": 2, "replies": []}, {"body": "Ya the way NIO jumping up in similar pattern. Its making me little nervous as well", "score": 1, "replies": [{"body": "are you playing long or short term? if long term, don't be afraid...", "score": 1, "replies": []}]}]}]}]}, {"body": "I just set a trailing stop and I am hoping for the best", "score": 2, "replies": []}, {"body": "I'm holding NIO (well, also sold a covered call that's now ITM, so it's probably going to get exercised away next week, though I'll look to buy back in on a pullback) - that said, with a Chinese company there's always the possibility of financial reporting fraud. They may even be selling a decent number of cars, but there's another company that may have really been selling a decent amount of coffee...", "score": 2, "replies": []}, {"body": "I'm not worried about a crash happening. If it crashes down to $20, I'll still be up a bunch, and it would make it a buying opportunity. I'm not selling a single share for at least a whole year from when I bought my shares in July.", "score": 2, "replies": []}, {"body": "They are completely manipulated by the CCP.\n\nIts would take nothing for them to tank,  again its up to the CCP.  \nHowever they make the most money, the stock will go", "score": -6, "replies": [{"body": "[removed]", "score": 9, "replies": [{"body": "This guy is a salty MEGA idiot. Don't waste your time.", "score": 3, "replies": []}]}]}, {"body": "Time.", "score": 1, "replies": []}, {"body": "When bad news like recalls shows up coupled that it did not get into European market.  I am selling it at $50.", "score": 1, "replies": []}, {"body": "bought in! sold my granma", "score": 1, "replies": []}]}
{"title": "Please help review stock picks for elderly relative whose \"full service broker\" is generally unavailable & doesn't return calls under 24-48 hours & charges $4K/year to manage the mostly cash account", "selftext": "So one of my elderly relatives has a “full service broker” who has apparently been charging him $4K a year to “manage” his account consisting of mostly cash & cash instruments. She is generally hard to reach but returns calls within a day or two (if she's not on vacation). Yes I am pulling his assets out of there as soon as I can push the paperwork through. I got a power of attorney & have gotten authorized user status for the account. But it’s going to take a couple of weeks and I feel we should buy in to some stocks that might be a lot more expensive in 2 weeks, because as people who have been sitting out in cash begin to buy back into the stock market, some stocks will become way more expensive.\n\nI’ve picked some stocks that I think shouldn't wait two weeks and want to instruct his broker on what trades to make (if/when we ever connect).\n\nCan someone please review/comment/suggest?\n\nThese stocks are picked with the following priorities:\n\n* dividend-yielding U.S. stocks  \n* aren't at high-priced pop stocks valuations  \n* low downside risk of major declines  \n* some short term downside risk is OK  \n* out of favor stocks like value stocks is OK  \n* these are ones that are better to buy now before they shoot up too high because they're bouncing up (health care), or because they're low & have room to run for recovery (industrial, energy)\n\n__________________________\n\nSYM | Name | Yield | Ratings | Upside(s)\n:--|:--|:--|:--|:--|\nABBV | Abbvie | 5.50% | great | dividend aristocrat, Biden bump in progress |  \nBMY | Bristol Meyers Squibb | 2.75% | great | dividend aristocrat, Biden bump in progress |  \nUNH | United Health | 1.41% | great | dividend aristocrat, Biden bump in progress |  \n~~CAT~~ | ~~Caterpillar~~ | 2.65% | ok | future US industrial recovery growth, Asian industrials play |    \nLHX | L3 Harris | 1.85% | great | dividend contender, future aerospace recovery growth |  \nBLK | Blackrock | 2.23% | great | retail investor trend, China financials play |  \nEOG | EOG Resources | 4.16% | good | future US industrial rebound growth |  \n~~CVX~~ | ~~Chevron~~ | 7.19% | not great | future US industrial rebound growth, Asian market |  \nETG | Global Dividends ETF | 8.13% | great | good returns, good quality | \nDFE | Small cap Dividends ETF | 3.01% | good | future US small caps rebound growth | \nXLE | Energy ETF | 7.41% | ok | future US industrial rebound growth |  \nXLV | Health Care ETF | 1.5% | ok | Obamacare rebound growth |  \n~~XBI~~ | ~~Biotech ETF~~ | 0% | ok | Obamacare rebound growth |  \nSPY | Something something equity index | 0% | ok | because people will be piling in |  \nUBS | UBS Group AG | 2.86% | very good | financial recovery room to grow |  \nAMT | | | | (suggested below) |\nNEE | | | | (suggested below) |\nTDOC | | | | (suggested below) |  \nQQQ  | | | | (suggested below) |  \n\n\nA few weeks out we might add some more stocks so this isn't everything\n_______________________\n\nThese assets can be transferred to another account. Or do you think it's better to wait for a couple of weeks and risk piling on after everyone else has run up prices? There might be some additional fees/commissions associated with having the full service broker execute these trades.\n\nTIA to any who respond/critique/recomment\n\nAdjusted list based on some input. Thank you!", "id": "joh514", "created_utc": 1604575362.0, "score": 17, "upvote_ratio": 0.8, "num_comments": 30, "comments": [{"body": "I honestly don't know why you are stock picking and trying play the marked with strategies that may or may not work out. Capital preservation and sequence of return risk is at upmost importance when you are older. \nYou are trying to squeeze returns out but in my opinion that time is over. \n\nJust get a dividend focused world index etf and keep at least 2 years worth of income in bonds or savings account so that you can use that money should the marked go down hard to avoid the sequence of return risk when withdrawing", "score": 15, "replies": [{"body": "He doesn't want any Chinese stocks. I'm hoping to sneak at least some by in that global dividend ETF. \n\nHe doesn't need the income and says the money is mine to play with and in fact has been trying to give me the money, which I won't take because he needs a safety net in case he gets cancer or something. He lost money to a hacker and now feels vulnerable/targeted due to the money and was trying to unload it. He owns his house outright and has a reliable federal government pension that more than meets his needs. \n\n> keep at least 2 years worth of income in bonds or savings account so that you can use that money should the marked go down hard to avoid the sequence of return risk when withdrawing\n\nThank you, I was only planning on investing about 20% this week and then sitting on the rest and waiting for more resolution of the economy after the period of volatility is over. Unfortunately, he's been losing money to inflation and the $4K annual fees he's been paying to the account manager.\n\n> I honestly don't know why you are stock picking and trying play the marked with strategies that may or may not work out.\n\nBecause I know what's going to move and what is moving in the markets? I do growth stocks tho, none of these safe ones.", "score": 1, "replies": [{"body": "Ah, that's totally different then. In this case you can take higher risks. Is there other family that he doesn't want the money to go to? If yes then I suggest you try to convince him to write a last will or make you officially the beneficiary.\nI've delt with stealing relatives in the past. Get that all sorted out ASAP. Trust me, you wouldn't believe how family and relatives suddenly turn into thief's. Sad to say but you can't trust your own family.", "score": 3, "replies": [{"body": "We have all that paperwork done. I have convinced him to let us create a living trust for the account to go into, so that it stays with him in case he needs it, and so hackers and scammers can stop targeting him because then I will administer the trust. That's better than him giving the money away. There are some other relatives he likes but he's not close to them. I've asked him to make lists and maybe designate some gifts. But he hasn't done that yet. \n\nNow I'm just trying to get him into some super safe dividends, if I can, with a portion of the money, because that's what he's always wanted and was asking the financial advisor managing his account for.\n\nThank you very much for your comments and advice.\n\nEdit: Shit, some of the stocks I picked are set to spike today. Unusual options activity on ABBV & BMY", "score": 1, "replies": [{"body": "To be frank, from what I see in your discussions, you don’t seem to know enough about investing to manage a $400k fund. I would just either DCA into sp500/some dividend fund or play with 10 or 20k to learn the ropes.", "score": 3, "replies": [{"body": "I'm not only outperforming indexes with my fund but I'm outperforming most reddit traders as far as I can tell. I seem to lack credibility because I get downvoted a lot for not being on the same bandwagons that other people are. But if you go back and check my posts and compare them with what the market actually does, I'm right but getting downvoted, much more than 50% of the time.\n\nI was getting downvoted for the past 2 weeks for telling people that stocks were lifting every time Biden pulled ahead and that they were dropping every time Trump pulled ahead. So I was fully invested except for a small amount of unsettled cash, on election day, and have done very well. I was even posting proof, in advance, that stocks were spiking every time Biden pulled ahead and was being scornfully ignored or downvoted. \n\nI was also telling people to sell BABA yesterday, and getting downvoted, and now it's down in premarket with the earnings report, while the rest of the Asian market except for a few downgraded stocks are all set to spike up. I significantly trimmed BABA yesterday and moved the money into JD.\n\nI am consistently right on this subreddit, and that pisses off some people for some reason. I have noticed that there are a lot of people who just follow the person who seems to have the most status and not think for themselves and notice even obvious facts, when it comes to trading. \n\nFor example, have you noticed that while most of the people on Reddit investing subs have been bashing Chinese stocks for months and downvoting anyone who mentioned them, were mirroring how financial leaders and reporters were telling us it was risky junk? And at the same time, US investment banks Goldman Sachs, JP Morgan Chase and others have been quietly moving major operations and money over there? Now people are scrambling to get into Chinese EV stocks.\n\nThe fact that you would even mention that you think I don't know how to manage a $400K fund based on what you see in my discussions, tells me that you're one of those who can't tell fact from belief. \n\nIf I wanted to hear how to DCA into index funds, especially into SP500 which is blown up with bubble tech stocks right now so that it's underperforming any of a handful of sector ETFs in any given week, I'd be reading /r/investing. \n\nIndex funds are more risky than individual stock picking right now because of all the inflated bubble stocks with big downside risks and other systemic risks of the coronavirus recession. Individual stock picking allows one to avoid the risks of the hidden bankruptcies of zombie companies on US exchanges and bubble stocks, right now. The last thing I'd do is to tell some old guy to stick more than a tiny percentage of his money into a US or European index fund while the countries can't get on top of coronavirus due to not being able to manage wearing masks.\n\nAlso, I already manage much more than $400K in my own funds, partly because I've grown them so much, which is why the relative wants to give me the money to invest. I really, really think YOU don't know what you're talking about, if you only think that which fits what everyone else says is the better stock information, even after events should have shown you that was the wrong stuff. You don't know the difference between \"what everyone else is saying about these here stocks\" and actually good information backed by proof. But you wouldn't have to understand anything because you DCA into index fund and somehow think that's relevant to investing in stocks. You shouldn't even be talking to people who pick stocks because by definition, you don't know the subject.", "score": -8, "replies": [{"body": "I don’t look into your history before posting, and I am simply basing my assumptions on your comments in this post. \n\nI am confused then. If you are doing so well with a larger portfolio (well over 400k) than most people here and you claim that the rest of this subreddit are sheep, why are you posting for advice?", "score": 8, "replies": [{"body": "I smell total bullshit from this guy. I’m with you.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Idk how much cash you are talking about but anyway call E*TRADE and see about just transferring there they are very helpful and it’s really user friendly compared to the other brokerages. They have model portfolios you can just copy theirs to get the stocks that you are looking for. You can have a broker assigned to the account if they had any questions they can call the same person. I know an elderly couple who did what I’m saying and their broker has never charged them a fee for the advice or help although he’s not picking or buying stocks for them really since they do that themselves and they have a fairly large amount in the account but like I said it’s very simple. I use other brokerage houses also but imo they are the best for what you are looking for. I would get out of the oil stocks and ETF’s and go into something else also.", "score": 4, "replies": [{"body": "> Idk how much cash you are talking about but anyway\n\nAbout $400K\n\n> anyway call E*TRADE\n\nWe're working with Fidelity, but it's going to take a week or two \n\n> They have model portfolios you can just copy theirs to get the stocks that you are looking for. You can have a broker assigned to the account if they had any questions they can call the same person.\n\nI know, I just wanted to get into some select blue chip long positions now before they blow up too much with a relief rally as people start putting cash they've been sitting on back into the market. \n\n> I would get out of the oil stocks and ETF’s and go into something else also.\n\nOil stocks are so low they'll at least double with the upcoming industrial rebound. There were some pretty significant moves whenever a stimulus package looked likely. I don't want to not have them in an elderly person's portfolio this year, since they pay great dividend's. But if energy isn't going to move in the next month, I probably don't have to try to add them in right now and can hold back on industrials, too.\n\nThank you for your comments and suggestions!", "score": 1, "replies": [{"body": "Man. Don’t lose your relatives money. It’s good they don’t need it to live off of and can stand the fluctuations. Is it a taxable account or a retirement account? Something to be aware of. \nI second the comments on oil etf and oil stocks— they will not double, or come close to it. They’re down because of headwinds (Covid, no planes flying, oversupply due to drilling efficiently and demand is falling, move to EV, etc). It’s a losing battle, CVX is the best in the space and probably won’t have to cut their dividend anytime soon. That being said, it’s a losing proposition and I wouldn’t be have more than 5% in oil. \nI just wouldn’t dump 400 in the market all at once, maybe $100k/mo and slowly average in over a few months. Having some bond exposure to reduce volatility. Keeping some cash to buy on any large sell offs. What about small/mid cap exposure?  \nIt’s a dangerous idea to manage families money, if you just started following markets in the last year I would definitely take your time.", "score": 6, "replies": [{"body": "Thank you so much for your advice and comments.\n\n> What about small/mid cap exposure?\n\nI have that one small cap dividend ETF in there.  This is not a complete portfolio. I just wanted to get into a few must-have stocks right now so as to not be looking at the same stocks two weeks from now after they have gained another 15% due to the stampede of people rushing back into the stock market this week. This is just to initiate some positions and doesn't represent a fully invested, balanced account\n\nThis is not a retirement account, everything will have capital gains issues, so I'm looking to set up long positions. \n\nThank you for the advice on oil. I will cut out XOM, which looks unrealistic and limit CVX as you suggest. \n\n> I just wouldn’t dump 400 in the market all at once, maybe $100k/mo and slowly average in over a few months.\n\nThat's a great idea. I was thinking about investing 80K, or 20% of the account this week. Maybe 5kin each of 10-20 stocks/etfs with more to consider in 2 weeks.\n\n> It’s a dangerous idea to manage families money, if you just started following markets in the last year I would definitely take your time.\n\nIn addition to what I'm trying to do there are financial advisers. I just want to set a direction and start things rolling due to the neglect of their assets and the account manager not listening to him. I will have a talk with the unavailable financial adviser today. They can give advice and research.\n\n> They’re down because of headwinds (Covid, no planes flying, oversupply due to drilling efficiently and demand is falling, move to EV, etc)\n\nI personally have about 50-60K in EV but this elderly person doesn't want anything volatile and I don't want to be caught with even short-term losses on my hands, which would make me look bad even though I know that they're trending up.", "score": 2, "replies": [{"body": "With regards to EV, i was using that as a reason oil will stay lower longer term, definitely wouldn’t be putting any EV stocks in their account.  Your response was great and it seems like you’re thinking through this thoughtfully.  I would just check the “everyone is going to pile into the market mentality”, I’m Uber bullish with the current political environment and how it looks to play out, but it doesn’t mean we wont be choppy these next few months.  \n\nLook into dividend growers as well (SBUX comes to mind), you can get good capital appreciation and dividend growth through time.  Other one’s to consider knowing age and portfolio objective, that may also give you some diversification outsides of what you currently have: AMT (5G tower reit, solid dividend and strong tailwinds) NEE (Florida utility company that also gets a lot of their energy from renewable sources, solar/wind) TDOC (Growth play but essentially the google of telemedicine at this point, just finalized merger with LVGO and will be a forever hold in my account). And Visa/MasterCard, Microsoft and Facebook for obvious reasons.  Hope this helps, good luck.", "score": 2, "replies": [{"body": "Thank you for taking the time to share your thoughtful advice. I will take it to heart.\n\nAnd thank you for the advice about dividend growers and stock tips to look into", "score": 2, "replies": []}]}]}]}, {"body": "Oil is dead. Do not invest in oil, especially with an old persons money. That would be downright immoral. Oil was dead BEFORE covid, covid just beat the dead horse and ensured it cant be resuscitated.\n\nEven thinking about individually picking stocks is a grey moral area with someone else's money. Just do a vanguard fund until you get a new broker.", "score": 1, "replies": []}]}]}, {"body": "Your dividend calculation is based on *current* price... What about when it was purchased? \n\nExample: XOM, Current div.10%, but that's base d on $30/ share.  If she paid 90, she's getting 3.3%.  if she paid 20, she's getting 15%. One's a hold, the other is a dump, considering the industry headwinds. \n\nI know, it's *lots more* homework.  Perhaps dividend yield isn't a good benchmark alone.", "score": 4, "replies": [{"body": "OK. Thank you. I will do more study/research the way you suggest. The oil stocks are dirt cheap right now, which makes their dividends seem more appealing, but I didn't know how to properly assess them. Thanks!\n\nWe would be buying these stocks today", "score": 1, "replies": [{"body": "I don't mean to say this is *the* way to assess... it's another point of view which may change your evaluation.  \n\nAs case in point, I jumped on GE in 2008, with a 10% dividend. While I gained 200% in cap gains, I also collected about 40% on the dividend.  XOM says they'll hold it high, but I (holding some) doubt that it'll be for long.", "score": 5, "replies": [{"body": "OK. I was also wondering about that as XOM's debt is mounting, I think. I didn't know how to assess dividends. Thank you very much.", "score": 1, "replies": []}]}]}]}, {"body": "I'd look into banks, albeit with caution. I like UBS for their dividend ($0.365/share) I am long 38 shares for a DRIP farm.", "score": 2, "replies": [{"body": "Thank you! Checking it out. \n\nEdit: Added UBS to shortlist", "score": 1, "replies": []}]}, {"body": "Some utilities have good dividends", "score": 2, "replies": [{"body": "Thank you. Those prices look as if they will stay stable for the next week, and I hope to initiate some positions later, sometime after we have the assets transferred out. I will make sure that I look at utilities for him.", "score": 1, "replies": [{"body": "Railroads too maybe", "score": 2, "replies": []}]}]}, {"body": "Go qqq and vti", "score": 2, "replies": []}, {"body": "Every week I review these mostly through personal referrals. Finance background. Not a rookie here.\n\nThese you can do without:\n\n\\-CVX Chevron 7.19%,  \n\n\\- XBIBiotech  ETF 0%    Obamacare rebound growth\n\n\\-CAT is cyclical. Buyer beware. \n\nYou do not have technology growth. Want best SPY you select top 100 (apple, FB etc). That will be QQQ.\n\nIf your relative is tech(gadget) savvy, any of ARKF, ARKK, ARKI etfs are where the future growth is.  Just do not mention cloud as he may think you are sending him there now(just joking). \n\n$4K fee with 0.75 to 1% management fee does not involve as much money as I typ see from west coast. Assuming it is mid 6 figures, you need not have to have a large portfolio listed above.\n\nI will also validate expense ratio. All these you can buy them anytime. Put a limit order below trading price and adjust price and volume according to the market. \n\nGood luck.", "score": 2, "replies": [{"body": "Thank you so much for your advice and for reviewing the stocks. I appreciate it so much!", "score": 1, "replies": [{"body": "To get customized answer you can join my https://www.reddit.com/r/Stock_investments/. Often posts get removed. This one I am the mod.\nGood luck", "score": 1, "replies": [{"body": "Thank you, I will join.", "score": 1, "replies": []}]}]}]}]}
{"title": "Should i sell TSLA for BABA rn?", "selftext": "[removed]", "id": "joimnc", "created_utc": 1604582417.0, "score": 0, "upvote_ratio": 0.17, "num_comments": 37, "comments": [{"body": "This is the most flavor of the month post from start to end I've ever seen in my life.", "score": 8, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Baba only got hyped because of ANT. Yeah they are a strong company with LONG term potential, but until ANT gets the green light it's just going to spin its wheels.", "score": 1, "replies": [{"body": "Well, and the drop after the ANT IPO news seemed rather excessive. So BABA is at a more appealing price right now than TSLA, with reason to be optimistic about their equivalent of Prime Day coming up 11/11 \n\nI would rather buy BABA than TSLA right now if I could only choose one", "score": 3, "replies": [{"body": "Same, but OP looking for a quickie, they won't find it from Jack Ma.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "I'm not in a tesla position but am looking to move into some BABA, also I'm long term. Not that I don't think Tesla has room to run, I just don't see it happening until after covid, or when the GigaFactory in Texas starts producing at 100%, should be around the same time.\n\nBut you should trust and develop your own judgment on these things. Write it down (even if you don't invest) and look back at it to see if you're gut was wrong or right.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I left my tesla position because its settled at 420, it's been having one hell of a time pulling off that level so it all depends on how long your investment strategy is.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Not to burst you're happy bubble. 50$ on 650 is less than 10% (not bad by any means) but that same 650 in five stocks i can pull out of thin air over the last month could have netted you 200% or more. Not saying your strategy isn't profitable (it obviously is) but the way you're talking about it you could use the time to expand your horizons outside of the few large cap companies that are up 60%+ on the year.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": ">the reason i don’t expand my horizons is because i don’t know what half of that means,\n\nAnd that's a great reason to stick to what you know. My only worries is it seems you're following the trend, which is fine, it works, just know that you're always going to be late to the party and still drinking when the big cats leave.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Imagine thinking that baba was only hyped because of ant lol couldn’t be me.", "score": 1, "replies": [{"body": "Short term, yes ANT was the sole reason BABA was running this week, long term BABA is fine without ANT, but owning 30% of ANT BABA has a ton of running room once it goes public.", "score": 1, "replies": []}]}]}]}]}, {"body": "If you are asking a bunch of random people online whether you should hold on to your TSLA share, you're probably not knowledgeable enough about the company to hold it through a dip, so yes, you might as well sell it.\n\nI think it's a terrible idea btw, and that Tesla will at least 10x from here before 2030. But who knows?", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Yep, provided there's no extreme market crash around that time I expect Tesla to be worth anywhere between 4 and 8 trillion by 2030, depending on how full self driving will turn out and provided there won't be any government intervention in big tech. But I also expect Amazon to be above 4 trillion by then under the same conditions.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Yeah, I can't really help you with that. Short term swings are always risky and not my style, but they do work for some people. I just have no knowledge about how to do that successfully. All I can say is that personally I have about 2/3rds of my portfolio in Tesla and I'm not selling before they're at least in the top 3 of largest market cap companies in the world. Personally think they'll be nr. 1 by the end of the decade.", "score": 2, "replies": []}]}]}, {"body": "Baba would be the better long term investment, Tesla is losing steam as everybody jumps ship to NIO.", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "NIO is also producing EV, it's China's version of Tesla, but it has way more growth potential because it's at only around $30 per share currently.", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "It was up over 6% yesterday, and today so far in pre market its up 2.4%.\n\nHope it keeps flying for you, and good luck.", "score": 2, "replies": []}]}]}]}]}, {"body": "You should read up on the efficient market hypothesis.\n\nIn short, whatever the answer may be, it’s already priced into the equity. \n\nShort to your question is that no one knows.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Keep the TSLA stock.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}, {"body": "Yo", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Yo", "score": 1, "replies": [{"body": "Yo", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "yo", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "Elon Musk is going to Tesla Gigafactory Berlin to boost hiring effort, will personally interview candidates - Electrek", "selftext": "", "id": "jonmop", "created_utc": 1604599478.0, "score": 131, "upvote_ratio": 0.99, "num_comments": 31, "comments": [{"body": "Does he speak German?", "score": 26, "replies": [{"body": "Lots of Germans speak English", "score": 40, "replies": [{"body": "In Dozens of Business trips to Germany I only encountered one person (A Waitress) who apparently did not speak any English.\n\nA group of ~6 of us went to this restaurant all nattering away in English, one of our group who knew a bit of German, when greeted said in German (words to the effect of table for 6 please).  We where shown a table, he got the German menu, we all got English menus.  After a while after he had borrowed one of our menus we struggled to order.   This carried on throughout the evening with her not understanding any English.\n\nThen as we were about to leave she said words to the effect of \"Good evening, did you enjoy your meal?\" And happily nattered in English as we left\"...", "score": 4, "replies": [{"body": "Come to Munich, lots of trolls.", "score": 1, "replies": [{"body": "There‘s a joke about that... 😂", "score": 1, "replies": []}, {"body": "It was in Munich...", "score": 1, "replies": [{"body": "Step out of the tourist area just a bit. Try finding a mechanic who speaks English.", "score": 1, "replies": [{"body": "I was not there as a tourist, but as an Engineer (one of countless, fruitless meetings with a large Engineering company beginning with S, trying them to look just a little further than their own pathetic development).  The place I had the worst problem with lack of English was Milan (Worse than Japan, Istanbul or Bangkok...)", "score": 1, "replies": []}]}]}]}]}, {"body": "Well enough to thoroughly answer complicated questions from Elon?", "score": 10, "replies": [{"body": "I'd say any German engineer interested in working for tesla is capable to answer whatever question is thrown at them", "score": 25, "replies": [{"body": "Bitsche du faschistish? Mr Elon Tusk?", "score": 3, "replies": [{"body": "Bist du", "score": 1, "replies": []}, {"body": "Si senoe", "score": 1, "replies": []}]}]}, {"body": "*...Tesla accidentally builds atomic bomb...*", "score": 12, "replies": [{"body": "If we take a first principles approach to manufacturing atomic bombs, we could probably cut the price down by 95%. Every American should have an atomic bomb in their garage. We need to make atomic bombs more affordable!", "score": 5, "replies": [{"body": "The real money is in atomic bomb insurance", "score": 2, "replies": []}]}, {"body": "Would settle for a Mr. Fusion", "score": 2, "replies": []}]}, {"body": "Well he’s not gonna interview the cleaning lady/man.", "score": 3, "replies": [{"body": "Vertical integration is the way", "score": 3, "replies": []}, {"body": "Working in a high-tech industry, I'd want the cleaners to understand enough about the domain that they don't cause unintended problems. We've all heard the legends about servers being unplugged to run a vacuum cleaner.\n\nI'd want to hire them directly so that I can do appropriate checks to ensure they're not planted by competitors.\n\nAnd I'd want them to be paid enough that they aren't tempted by money to leak info, or get disgruntled and create problems.\n\nYeah, I reckon Tesla should have their own cleaning people.", "score": 2, "replies": [{"body": "Ok.", "score": 2, "replies": []}]}]}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "Under 40 engineers most likely yes.", "score": 1, "replies": []}, {"body": "As far as I know in most European universities students have to study field specific English.", "score": 1, "replies": []}]}]}]}, {"body": "Elon definitely needs to learn: Hello Together", "score": 8, "replies": [{"body": "Mr Musk, I understand only train station, is this what you want me to engineer?", "score": 4, "replies": [{"body": "They do need a train station at the factory.", "score": 2, "replies": [{"body": "Oh, then I guess this interview went better than I thought!", "score": 2, "replies": []}]}]}, {"body": "Dast ist vunderball", "score": 1, "replies": []}]}, {"body": "I'm going to apply and lie my ass off just so I can meet him.", "score": 6, "replies": []}, {"body": "I have no engineering background, but I’d still like to apply.", "score": 0, "replies": []}]}
{"title": "Tesla's $25k Car Will Make Billions (& end the ICE age)", "selftext": "", "id": "joqoij", "created_utc": 1604609016.0, "score": 46, "upvote_ratio": 0.84, "num_comments": 30, "comments": [{"body": "I'm skeptical that a compact car could need anywhere near 2-3x less batteries.\n\nI think most of the energy cost of driving with regenerative braking is air friction loss, and cars that are 20% less volume don't have 3x less air resistance.\n\nMinus the regenerative braking, highway miles in ICE cars are a fair comparison. You move from a Toyota Camry down to a Toyota Yaris, you actually lose 1mpg. Camry is 41 highway Yaris is 40 highway. Mpg x Gallons in the tank gives you range.\n\nLonger cars can actually have less air resistance depending on the shape. Compact cars tend to get shorter relative to their height, because you can't shrink cars vertically (because humans have to sit in them) as much as you can shrink them forward/backward. This means there are some configurations of heavier cars that can have less resistance loss than lighter cars.", "score": 17, "replies": []}, {"body": "Per the title. One thing I don't mention in the video that I see discussed a bit is the FSD software cost. I expect at this stage most people will subscribe to FSD monthly rather than buy outright due to increasing cost w/solving of autonomy. But time will tell. So this would be $25k (hardware) + subscription for FSD package.", "score": 15, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "that's him.", "score": 2, "replies": []}, {"body": "If your new, welcome. If you’re not, welcome back.", "score": 2, "replies": []}]}]}, {"body": "This is my least favorite YouTuber who discusses Tesla coverage / news... just wanted to throw that out there.", "score": 17, "replies": [{"body": "I used to watch his videos, but I honestly can’t stand how full of himself he is. Will watch ANYONE else before this guy. Rob Maurer with Tesla Daily is my go to guy now.", "score": 19, "replies": [{"body": "Tesla Daily is the best!", "score": 12, "replies": [{"body": "Rob gang checking it!", "score": 2, "replies": []}]}, {"body": "Same", "score": 5, "replies": []}]}, {"body": "think he gets off on hearing that tbh.", "score": 13, "replies": []}, {"body": "I like him.  Except he plays an ad about once every 27 seconds.  Makes it hard to not want to smash my phone to pieces.  But maybe he really needs the ad revenue.", "score": 8, "replies": [{"body": "I like that he doesn't have himself making a goofy face in his thumbnails, and doesn't ask me to like/subscribe and ring the bell. I'm pretty sure he's just making these videos for fun, and aesthetically they have a neat and clean presentation.\n\nI also have youtube red, so I don't get the ads. Pretty sure I wouldn't be bothering with youtube without it.", "score": 8, "replies": [{"body": "Well I’m sure he has fun making them but he isn’t making them just for fun.  Otherwise he wouldn’t care about ads every 27 seconds, Allegedly, blah blah blah.", "score": 2, "replies": [{"body": "I don't what do you think? Is 27 ads too many?  Is it too few? Let me know in the comments below. What do you think?", "score": 5, "replies": [{"body": "Eventually there will be no video and only adds.  Hey, what does charity donut sales mean.   You have free donuts?", "score": 0, "replies": [{"body": "In the military there are often fundraisers involving the sale of donuts. Those who ran these sales were the most coveted and received the highest evaluations.", "score": 2, "replies": [{"body": "Those were the best charity fundraisers. They were largely replaced by the \"guilt you into giving\" brigade, unfortunately.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "He did a video awhile back talking about it. He found basically zero drop off when he added more ads. This is also pretty consistent with a lot of long form YTers.", "score": 3, "replies": []}]}, {"body": "He’s gotten a bit arrogant and abrasive and has loy his objectivity for sure. I still like watching his videos, but for some he adds very little to the video’s he reacts to so I just go watch those", "score": 3, "replies": []}, {"body": "Liked him, then when he started all the mockery I really disliked it. Really couldn't stand it. Even if he was saying mocking the ideas and not the persons, it did not fell like that. Seems to be a bit better now.", "score": 1, "replies": []}]}, {"body": "The guy embodies everything that is wrong with the Tesla retail investor community.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I couldn’t disagree more strongly.  Having a car at your door within minutes and having that car to yourself and by doing this you’re saving money over owning your own car - Yeah things will change VERY quickly.\n\nWe’re about to witness the automobile industry transform into the transportation industry.", "score": 5, "replies": []}, {"body": "And yet Uber and Lyft are big business.\n\nWhen the cost of Transport as a Service becomes 1/2 or more of what it is today, we will see meaningful movement to people giving up their cars. It is significantly cheaper and more convenient (no parking, no garage needed, no annual service, no maintenance or registration, etc). Those who want to do bigger drives will rent for a few days the same car.\n\nThe costs being driven down will be caused by no driver which is the biggest cost, efficient energy use and cheap energy consumed combined with cheap car costs at scale.\n\nThe biggest hurdle I see is families with young children who need car seats and don’t want to install over and over again or carry these at their destination. Perhaps some cars will come with installed car seats and you can request ie wheelchair capable vehicles etc. There are always niche challenges", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "Steven’s  not wrong, right? 25k times 40k vehicles is one bil alone. Not sure what you’re criticizing here. . .", "score": 13, "replies": [{"body": "Is this sarcasm or do I take the bait?", "score": 0, "replies": []}, {"body": "$250 per bottle x 4,000,000 = 1B.\n\nhttps://www.youtube.com/watch?v=WMhm8SoukpE&ab_channel=SolvingTheMoneyProblem\n\ni prefer to think of this as the roadster 1 of teslaquilas - a limited edition high priced proof of concept.\nover time we may see the model 3 and model 2 of teslaquilas, cheaper and higher volume. or not.\n\nhttps://electrek.co/2020/11/05/tesla-launches-tequila-price/", "score": 0, "replies": []}]}, {"body": "Cautious skepticism is healthy. \n\nAnd yea SMR deff plays the soothsayer. \n\nWe do also have Rob & Tesla Daily for a more down to earth report though, thankfully there’s a tesla ‘tuber for pretty much everyone these days.", "score": 3, "replies": []}, {"body": "U r dumb", "score": 1, "replies": []}]}, {"body": "My guess is this will be called the Model A. That would complete the series... s3xycars (model s, model 3, model x, model y, cybertruck, new model a, roadster, semi).", "score": 1, "replies": []}]}
{"title": "What happened to the post election crash?", "selftext": "[removed]", "id": "joepv4", "created_utc": 1604561773.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 34, "comments": [{"body": "Promised by who? A community of fellow autists who are willing throw a years salary at half-baked narratives posted by internet strangers?", "score": 15, "replies": [{"body": "Sounds like a reliable source, no?", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "🤔 \nYou too smart. That means I buy now?", "score": -1, "replies": []}]}, {"body": "The election is not even over lol", "score": 4, "replies": [{"body": "🤞", "score": 1, "replies": []}]}, {"body": "It’s gridlock retards . bAN", "score": 3, "replies": [{"body": "Salty momma", "score": 1, "replies": []}]}, {"body": "Nio calls is the gravy train commie stocks don’t go down (except for LK and a couple others)", "score": 3, "replies": [{"body": "Oh it will go down as soon as buy it. I just know it in my heart.", "score": 2, "replies": [{"body": "Lmk when you fomo in and buy so I can buy some fd puts", "score": 3, "replies": [{"body": "Ok. As long as we share profits", "score": 1, "replies": [{"body": "Lmao I gotu if I place a big enough bet or don’t blow up my acc between now and then", "score": 2, "replies": [{"body": "Weeeeelll I bought in 🤣", "score": 1, "replies": [{"body": "I’m still holding calls", "score": 1, "replies": [{"body": "See that drop at 12.03pm from $39.76? That was me buying calls. Lololol 🤷🏼‍♀️🤣🤦‍♀️🙈", "score": 1, "replies": [{"body": "I’m holding with diamond hands", "score": 1, "replies": [{"body": "🤞👍😁", "score": 1, "replies": [{"body": "Lmfao we making tendies", "score": 2, "replies": [{"body": "Yeeeeeey me $10 up 😁😁😁😁", "score": 1, "replies": [{"body": "Lmao I’m holding FDs", "score": 1, "replies": []}, {"body": "I don’t know weather to hold overnight or sell", "score": 1, "replies": [{"body": "I know I’m holding. But then I’m usually wrong 🤣🤷🏼‍♀️", "score": 1, "replies": [{"body": "I’m young you are probably too might as well take the risk", "score": 1, "replies": [{"body": "What the worst that can happen? We loose our unemployment money 🤣🤣🤣", "score": 1, "replies": []}]}]}]}, {"body": "I’m gonna try to ride Nio to 100 billion market cap at least", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Things went as expected, plus you have some shorts covering on top of momo chase. It's one day. The spread between IWM and QQQ was manic and the weirdest thing to me.", "score": 2, "replies": [{"body": "I want to know things that you know becuase I don’t understand what those are", "score": 1, "replies": []}]}, {"body": "It will correct some, but not until Nov 15th or further down the road..", "score": 2, "replies": [{"body": "I guess nov 9 spy puts bye bye 😢", "score": 1, "replies": [{"body": "Yep, no reason to hold puts right now. It's probably the big boys getting in before the Christmas sales and news of all the new stuff and blah blah..", "score": 2, "replies": [{"body": "👍", "score": 1, "replies": [{"body": "I mean, I would say to buy puts when you hear bad news.. and well, as crazy as this sounds, what is the bad news right now? We don't have a president yet determined, but once we do, we will start on stimulus blah blah, and recover blah blah, and then Vaccine blah blah..\n\nSee it now??", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Hopefully before our puts expire 🤣😜", "score": 1, "replies": []}]}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}]}
{"title": "~14K SQUARE FD Earnings Play, 1DTE, 11/06 200C - [Fargo's Delight]", "selftext": "Not much to say here...\n\nhttps://preview.redd.it/2d5fzmypvfx51.png?width=721&format=png&auto=webp&s=36b8355acdf084d5bc2c85af4e22d87de7913822\n\nAs you can tell, I opened my position this morning.  \nFeel free to either inverse me now, or consider this incorrectly labeled as a loss flair.\n\n&#x200B;\n\n\\[EDIT #1, 12:00PM\\]\n\nI'm up >100%, but I am going to diamond hand this sucker.\n\nhttps://preview.redd.it/15e13g7pngx51.png?width=1040&format=png&auto=webp&s=822ec4259a8be927a2e23bcf03fb9053c7d5acc5\n\nYOLO\n\n\\[FINAL EDIT\\]  \nI am sorry to waste everybody's time.  \nI closed out for 109% gain as I have enough now to wheel AMZN again.\n\nThis is highly unlike me, I do not deserve any upvotes on this post.", "id": "jok1t1", "created_utc": 1604587873.0, "score": 8, "upvote_ratio": 0.72, "num_comments": 31, "comments": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Don't forget about PayPal going down after earnings too!", "score": 1, "replies": []}]}, {"body": "15% OTM 1dte... hope this works out for you lol", "score": 4, "replies": [{"body": "Thanks, I understand how risky and unlikely this will pan out.  \nI am betting on CashApp's coin revenue growth and of course the uptick in e-transactions due to the situation.\n\nI'm not too concerned about the earnings beat, but fairly confident that the guidance will be strong.", "score": 2, "replies": []}]}, {"body": "Absolute idiot, I bought 5.", "score": 3, "replies": [{"body": "Indeed", "score": 1, "replies": []}, {"body": "Damn, I closed out for 100% profit.  \nI am chicken, best of luck", "score": 1, "replies": [{"body": "This was for fun, my Tesla calls booming. I’ll hold these till tomorrow.", "score": 2, "replies": [{"body": "Okay cool, I just wanted to let you know in case you were following me with a sizeable amount.\n\nDo you have any calls on XPEV/NIO btw?", "score": 2, "replies": [{"body": "Once I sell my Ali Calls tomorrow. XPEV long calls more than likely.", "score": 2, "replies": []}, {"body": "Should have held those calls man. I held mind lol.", "score": 2, "replies": [{"body": "Share price of $191 would've netted me the same 15K gain had I held. \n\nIf it goes above that then yea, this is my reward for playing scared.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Full strength, I bought 3", "score": 3, "replies": [{"body": "Cool, this is the way.", "score": 1, "replies": []}, {"body": "Damn, I closed out for 100% profit.  \nI am chicken, best of luck", "score": 1, "replies": []}]}, {"body": "😱 good luck brother", "score": 2, "replies": [{"body": "Thanks man", "score": 2, "replies": []}]}, {"body": "I'm in! \n\nBut what makes you so confident in this position", "score": 2, "replies": [{"body": "I'm not... I'm just a pied piper leading degenerates to their inevitable doom\n\nJokes aside, I'm bullish in their CashApp revenue growth.  \nCoin price/volume, YOY/QOQ growth rate, pandemic situation being conducive to more e-transactions, etc...\n\nThat's why I am very bullish on their forward guidance.", "score": 2, "replies": []}, {"body": "Damn, I closed out for 100% profit.  \nI am chicken, best of luck.", "score": 1, "replies": []}]}, {"body": "You must have a reason for going this much retard right? Care to share the insider info?", "score": 2, "replies": [{"body": "The only reason being... I was born this way.  \nThe extent of my retardation cannot be acquired, it is a birth right.", "score": 3, "replies": []}]}, {"body": "Well it was a good thing to sell imo even though those call went up. Wasn’t worth the risk", "score": 2, "replies": [{"body": "The theta decay, IV crush and how far OTM I was made me think for sure it was the correct decision.\n\nIt worked out this time (as I came out ahead by selling yesterday), but results be darned.  \nBetter to focus the objective on sound decisions, the money is nothing but a result.", "score": 2, "replies": []}]}, {"body": "Bruh", "score": 2, "replies": [{"body": "All good, I came out way ahead.  \nI sold for 1.25 yesterday.\n\nCurrent price on Schwab is .77", "score": 1, "replies": [{"body": "Oh right FD’s , makes sense. I had a leap im up 100% on. Wish i had a weekly id be sitting pretty in the VIP section", "score": 2, "replies": []}]}]}, {"body": "Haha.. I bought one 11/13 205c for a laugh.. hope we win brotha 🤪", "score": 2, "replies": [{"body": "Thanks, we may be laughing all the way to the bank   \nI'll be waiting for the 'this didn't age well' comments tomorrow.", "score": 2, "replies": [{"body": "I have 2023 200$ calls, I’m either fucked or Ferrari shopping no in between", "score": 2, "replies": [{"body": "Excellent, I am aligned with your mentality.", "score": 2, "replies": []}]}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/mogki_millions the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "FNKO about to kill earnings, maybe", "selftext": "If you’ve followed me in my last couple plays of shorting tesla on earnings day and putting the rest of ur money into GME shares and calls ur probably broke af. Here’s my next play\n\nTHESIS Funko is still priced like it’s an apocalypse\n\n1) Funko had their last earnings in July which had the march thru june earnings which wS when the US was mostly locked down. We’ve been pretty open since and we’re likely never looking back\n2) google trends for funko and funko pop look higher in the last quaryer than they did in the march thru june timeframe\n3) idk why but hobby shit is in right now. If people are paying 100k for a pokimane card or whatever i’m guessing this kind of collectible hobby shit is hitting across the board\n\nEarnings are gonna beat, guidance gonna be optimistic af\n\nPositions 69 feb 10c, 69 feb 12.5c\n\nhttps://imgur.com/gallery/YRxbJWM", "id": "jon5g8", "created_utc": 1604597994.0, "score": 7, "upvote_ratio": 0.66, "num_comments": 37, "comments": [{"body": "What makes you think GME is done? I'd hold on to those shares if I was you. 😏", "score": 12, "replies": [{"body": "Im still deep in GME dont get me wrong, im also down like 25% on my shares and 50% on my calls so im much poorer than i was", "score": 4, "replies": [{"body": "Yeah me too bro, hopefully next week will make everything better.", "score": 3, "replies": []}, {"body": "Down 85% on my call :(\n 11/27 20c", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Lmfao i have no idea tm gonna hurt thi", "score": 4, "replies": [{"body": "Im balls deep in Funko, AND THE EARNINGS WAS PERFECT!", "score": 2, "replies": []}]}]}, {"body": "you're the first result for a \"wsb fnko\" search... man, if i had a time machine i'd go back and tell you *that earnings report doesn't include the critical role bump that's surely coming. just hang on*", "score": 5, "replies": []}, {"body": "I recently went to the funko pop store in Hollywood and the lines were autisticly long for that trash.\n\nMy party bought about 100$+ worth of goods. \n\nNot sure if people actually buy shit there or just take pictures", "score": 3, "replies": [{"body": "I forgot to mention the first time i drove by that store in hollywood and saw the line i told myself whatever the fuck it was i was gonna buy stock if publicly traded. That line is always stupid long ever since they reopened shit in LA", "score": 3, "replies": [{"body": "I went on a weekend so not sure if the line was longer than normal but there were probably 100 people lined up before it opened.\n\nMy 10C Nov 20 call just sold for .15 I bought it for .07 and just listed it for giggles.\n\nMaybe the insiders know something too I guess I still have Feb 10C", "score": 1, "replies": []}]}]}, {"body": "I’m buying puts but raising my rentoid’s rent as a hedge", "score": 3, "replies": []}, {"body": "Hey man, thinking about buying shares.\nI look at the numbers and I’m pretty certain the company is very undervalued.\nI’m trying to figure out what I’m missing. \nEarnings did not deserve -13%... if anything the business is pretty much like it was pre-pandemic but with higher gross margins (more direct to consumer / Funko e-commerce) and lower sg&a...\nAgain, what am I missing?", "score": 2, "replies": [{"body": "homie i'm like pretty fucking deep in FNKO i feel the same way you don't have to convince me\n\nthe onlythign that makes me nervous is their ownership structure with FAH. They own like 49% of that holding company, their IPO was actually to buy a piece in FAH. I saw the line item in their financials which is what made me curious about what it meant coz i didn't understand, and tbh i still don't understand how that ownership structure works because I think FAH holds some of FNKO too? that's the only thing keeping me from going eyeballs deep in this TBH. but yeah i'm knee deep and with you this company is looking like a classic value play", "score": 1, "replies": [{"body": "I looked very very briefly.. but that simply seems like they are the owners of B shares that become A shares over time.. You'll notice that the B shares are diminishing over time as they become A shares.  \n\nI'd assume at one point there won't be any \"non-controlling interest\" reported. \n\nI might be completely wrong so let's definitely try to figure this out... cause yes, this seems like a massive opportunity. Basically the float is super low and no one seems to be looking at the opportunity. Nobody seems to be giving a shit about the company.", "score": 2, "replies": []}]}, {"body": "Did you end up getting in? If so... nice", "score": 1, "replies": [{"body": "Yes sir :) still in!", "score": 2, "replies": []}]}]}, {"body": "Bought at $6 sold at $12 \nSTONKS 🚀🚀🚀🚀🚀\nonly sold for more gme ammo 🤚💎\nI'll be back soon funko I'm sorry I love you 😘", "score": 2, "replies": []}, {"body": "puts it is.", "score": 1, "replies": [{"body": "My loss, is ur gain", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Idk but it was 15 mil actual and 35 mil shares so .42, estimated on etrade was .10 \n\nThey have a weird fucking ownership structure so idk what portion of income gets counted as EPS, they own like almost half of FAH which owns them or some shit", "score": 2, "replies": []}]}, {"body": "I don’t think Wall Street understands this stock. They don’t see the brand loyalists behind it and think that is just another Beanie baby fad. Only problem is that beanie babies only last 4 years. Funko has been around for over 2 decades and public for 3 years. If it was a fad it would have already died.", "score": 1, "replies": [{"body": "TBH im out of my FNKO for now but eyeing it, GME taking off rn. Will rotate back to FNKO on momentum or if GME rly pops lmao most of my money’s in GME", "score": 1, "replies": [{"body": "How u doing? How'd you make it with gme, and what's your thoughts on funko now", "score": 1, "replies": [{"body": "Look at what happened to funko after last earnings, they got short raided AF. I'm not in funko now but if they have a major sell after next earnings and their ER looks like a continuation of the positive growth I'm expecting, I will be a big buyer.\n\nFwiw GME had a big sell after their ER too. These short sellers always play the same game, massive short raid after ER and a bunch of FUD. This may not happen again with funko but I'm being patient, because IF it does, then it is easy money just to mash calls and wait a month for shorts to cover.\n\nGME was dope af. Honestly cashed out lifechanging money. Still in it, buying more on these dips coz I paper handed on the way up. Every time I felt like I had to puke looking at my account I sold a little. I've done my DD though so I have my long term price targets for GME that I am respecting by buying this dip the further it goes (Imo GME sustains 420 price in 5 years, Ryan Cohen a visionary and e-sports in it's infancy. His first move after getting the board seats a few weeks ago was to convert some locations to build a pc centers like Microcenter. Tell me he's not going after e-sports. He's currently manning the 🚀 at the center of that industry. Maybe haha who knows. GME is either 0 or 420 in 5 years IMO)", "score": 1, "replies": [{"body": "Why'd you get out of funko?", "score": 1, "replies": [{"body": "I paperhanded after ER. Doubted myself and got shaken out. Regretted it after seeing how it skyrocketed shortly after. When GME got short raided after its ER i remembered all this and 💎👌. NO RAGRETS 🤑🤑🤑", "score": 1, "replies": []}]}]}]}]}]}]}
