{"title": "Watchlist: 11/18 The Perfect Dip", "selftext": "  \n\n### Market Notes:\n\nThe S&P 500 dipped yesterday but held support at previous record highs. This is a very bullish sign.\n\nFutures are up this morning and I expect the buying to continue until at least the end of the year.\n\nMajor retailers WMT and TGT have both seen explosive sales growth amid the pandemic. I'll be paying special attention to online retailers as we enter the holiday shopping season.\n\n### Watchlist:\n\n**KZIA** is a low float, support at $11\n\n**FNKO** is a low float, support at $2\n\n**CTHR** is a lowish float, support at $1.10\n\n**CIIC** is a lowish float, on watch\n\n**MESA** is a lowish float, key level is $5\n\n**BLNK** is a lowish float, resistance at $14.50\n\n**SUP** is a lowish float, on watch\n\n**CCRN** has support at $8.50\n\n**ARPO** has resistance at $2\n\n**AXTI** has resistance at $10\n\n**FOSL** has support at $9.50\n\n**EGY** has resistance at $1.60\n\n**RYAM** has support at $5\n\n**VFF** has support at $7\n\n**MGI** has support at $8\n\n**ORBC** has resistance at $6.10\n\n**ARAY** has resistance at $4.10\n\n**PRTY** has support at $3.50, resistance at $4\n\n**RBBN** has resistance at $5.50\n\n**XXII** has support at $1", "id": "jweiex", "created_utc": 1605700705.0, "score": 125, "upvote_ratio": 0.93, "num_comments": 33, "comments": [{"body": "Covid. No vaccine for 6 months. Buy!!!!!", "score": 30, "replies": [{"body": "Where you been all year? Stonks go up.", "score": 25, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "For what 100 people? Meanwhile 180k positive cases PER DAY in the US alone.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "He means that the biggest issue when it comes to the vaccine isn't the actual creation but the production and distribution. I remember having read that after a vaccine is available it'll take about three years to be distributed worldwide. People seem to think that once it's created we're home free.", "score": 3, "replies": [{"body": "The Pfizer vaccine has to be stored at extremely low temps that most places that normally distribute vaccines simply don’t have. Until that infrastructure is out there, that vaccine will be extremely limited", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "3%? Noiceeeeee actually 1.5% bc it takes two doses.", "score": 1, "replies": []}]}]}, {"body": "It won't, everyone knows that.", "score": 1, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Yeah but their vaccine is so unreasonable to transport and even keep useable. Like -70 degrees until just before use? Just for that limitation I'm saying that we aren't gonna really get a general roll out until Moderna comes out with their Vaccine which only has to be kept at -20. \nEdit", "score": 2, "replies": []}]}]}]}]}, {"body": "Thanks that's a good list.\n\nI also suggest\n\nIDEX which has Morgan Stanley buying 1,386,614 shares \n\n[https://www.marketbeat.com/stocks/NASDAQ/IDEX/institutional-ownership/](https://www.marketbeat.com/stocks/NASDAQ/IDEX/institutional-ownership/)", "score": 11, "replies": [{"body": "Why are these companies buying in?", "score": 5, "replies": [{"body": "The reason is positive cash flow \n\n&#x200B;\n\n If you check the news .. they bought a US revenue property technology company named Timios. \n\n&#x200B;\n\nThe funds see growth and most likely buying based on this growth.\n\n  \n\nIdeanomics Acquires Cash Flow Positive Timios\n\n   \n \n\n[https://investors.ideanomics.com/2020-11-12-Ideanomics-Announces-Definitive-Agreement-to-Acquire-Timios-Holdings-Corp](https://investors.ideanomics.com/2020-11-12-Ideanomics-Announces-Definitive-Agreement-to-Acquire-Timios-Holdings-Corp)", "score": 3, "replies": [{"body": "They sound promising and probably a good long term play. I’ll buy in and see what happens!", "score": 1, "replies": [{"body": "Yes I think 2021 will be a a year of real gains\n\nfyi,\n\n   \"MEG remains IDEX’s core business with sales expected to surpass $30 million in in CY20 and ramp to \\~$100 million in CY21 (assuming 85% of sales are recorded on a principal basis).\"\n\n[https://www.intro-act.com/uploads/profile\\_documents/25ADJVC17A6DIDEX\\_Note\\_111320.pdf](https://www.intro-act.com/uploads/profile_documents/25ADJVC17A6DIDEX_Note_111320.pdf)", "score": 2, "replies": []}]}]}]}, {"body": "Not a fan of the long term chart. But you do you!", "score": 2, "replies": []}, {"body": "IDEX is a pump and dump", "score": 2, "replies": [{"body": "If IDEX is a pump and dump I would suggest to contact Morgan Stanley who bought 1,386,614 shares and warn them.\n\nAlso Bank of America they bought 500,000 shares.\n\nAlert all the funds who holding IDEX shares.\n\nhttps://www.marketbeat.com/stocks/NASDAQ/IDEX/institutional-ownership/", "score": 1, "replies": []}, {"body": "Short seller ?", "score": 2, "replies": [{"body": "Dude. I fucked up. Is there still room for entry?", "score": 1, "replies": [{"body": "I would think so, some are saying IDEX has $5 on it ... I think there is more upside as it's EV and and the EV sector is strong\n\nWall Street likes IDEX\n\nMorgan Stanley Bought 1,386,614 Shares\n\nhttps://www.marketbeat.com/stocks/NASDAQ/IDEX/institutional-ownership/", "score": 2, "replies": []}]}]}]}]}, {"body": "Interesting.  I'm seeing the S&P top worst stocks for market sentiment include: \n\nCINF\n\nCB\n\nRTN\n\nREGN\n\nHOG\n\nTDG\n\nNAVI\n\nCOTY\n\nSHW\n\nMarket clearly not feeling positive about those stocks today.", "score": 7, "replies": [{"body": "I thought HOG was removed from s&p?", "score": 4, "replies": [{"body": "You're right, now moved to the S&P Mid-Cap 400 ... I'll need to speak to the sentiment app company to understand why it's coming up on my top 10 worst S&P500s.  Thanks.", "score": 2, "replies": []}]}, {"body": "What are you hearing about CINF? Don't shit on my baby like that!", "score": 3, "replies": [{"body": "negativity score of 4.8 across 6,500 global news and social media channels.  This is an aggregated score based on some negative news.  Hope that answers your question?", "score": 1, "replies": []}]}]}, {"body": "Remind me in 2 weeks.", "score": 5, "replies": [{"body": "Lol I'll have 10 more opinions by that point", "score": 3, "replies": []}, {"body": "*Reddit has a 13 hour delay to fetch comments, or you can manually create a reminder on Reminddit.*\n\n**iiJokerzace** , kminder in **13 days** on [**2020-12-02 15:26:00Z**](https://www.reminddit.com/time?dt=2020-12-02 15:26:00Z&reminder_id=f0dedb26e32b44d1b4c23c62c3c7192c&subreddit=StockMarket)\n\n> [**r/StockMarket: Watchlist_1118_the_perfect_dip**](/r/StockMarket/comments/jweiex/watchlist_1118_the_perfect_dip/gcq4wr1/?context=3)\n\n> kminder in 2 weeks.\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-12-02T15%3A26%3A00%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2FStockMarket%2Fcomments%2Fjweiex%2Fwatchlist_1118_the_perfect_dip%2Fgcq4wr1%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Set timezone, Add email notification, and more options here**)](https://www.reminddit.com/time?dt=2020-12-02 15:26:00Z&reminder_id=f0dedb26e32b44d1b4c23c62c3c7192c&subreddit=StockMarket)\n\n**Protip!** We are lean and mean and stay in motion to serve people. If there is any change you want, contact us by email.\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Donate](https://paypal.me/reminddit)", "score": 1, "replies": []}]}, {"body": "I always like your posts. Thanks. \n\nBtw, are these only watchlists or are you planning on buying. \n\nLow floats are fun.", "score": 3, "replies": [{"body": "It's my daily watchlist. Today I traded XXII, EOSE, & PRTY\n\n glad you enjoy! :)", "score": 2, "replies": [{"body": "You got some that are ones you've been watching for a while?", "score": 2, "replies": [{"body": "No I make a new list everyday", "score": 2, "replies": []}]}]}]}, {"body": "When I looked at the premarket data around 9:10 AM, I reached the same conclusion.  That's why I bought a few chunks of TQQQ this morning at around 146.3.  Both SPY and DJ got above the September peak levels.  Looks like QQQ will get above the Sep. high also in a few days.  I posted a 6-minute video to show my analysis.  Have been posting morning video in the last couple of weeks:  [https://youtu.be/3JyLqTrIm3E](https://youtu.be/3JyLqTrIm3E)", "score": 0, "replies": []}, {"body": "TQQQ and never have to research or watch the market again.", "score": 1, "replies": []}]}
{"title": "If even Covid couldn’t cause a sustained bear market... then what will?", "selftext": "Well we’ve reached all time highs again and again since the infamous market crash of March 2020. Never in a million years would I have imagined a V shaped stock market recovery in the midst of the global pandemic.\n\nAnybody who held through the downturn could look at their portfolio today and likely see huge positive gains. Which leads me to my question...\n\nIf not even a global pandemic can cause a sustained bear stock market, what possibly could?", "id": "jwbbbr", "created_utc": 1605683713.0, "score": 8, "upvote_ratio": 0.73, "num_comments": 38, "comments": [{"body": "Betting against the House is ill advised", "score": 18, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "People saving money is typically deflationary and can slow the economy down.", "score": 3, "replies": [{"body": "Stocks aren’t the economy.", "score": 1, "replies": [{"body": "Like it or not, trillions of dollars flow through the stock market every day. They are a part of the economy.", "score": 0, "replies": [{"body": "They definitely are a part of the economy but no company trades 1:1 with the economy.", "score": 1, "replies": [{"body": "No shit", "score": 2, "replies": [{"body": "Ok", "score": 0, "replies": []}]}]}]}]}, {"body": "exactly, thats why they lower the rates", "score": 1, "replies": []}]}]}, {"body": "I guarantee you that you’ll end up with more money if you stop worrying about a crash every day", "score": 2, "replies": []}, {"body": "Fed raising rates. That's it.", "score": 2, "replies": [{"body": "Genuine question. Why would the Feds ever raise rates again if they knew it would yank certain asset classes?", "score": 1, "replies": [{"body": "Because they have to", "score": 2, "replies": [{"body": "Why would they have to?", "score": 1, "replies": []}]}, {"body": "cause they have to, and it will happen in 2023", "score": 1, "replies": [{"body": "Why would they have to?", "score": 1, "replies": [{"body": "to keep inflation controlled at 2% + other things", "score": 1, "replies": [{"body": "Certain countries, like Japan, have had practically 0% interest rates since 1990’s.\n\nWhy haven’t they needed to raise interest rates because of inflation?", "score": 1, "replies": [{"body": "(im japanese) cause japan needs to stimulate the economy, and the usa doesnt need to to that, over stimulating it is bad", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "usa china war", "score": 2, "replies": []}, {"body": "world war 3 will crash the market", "score": 3, "replies": [{"body": "War is good for the economy", "score": -2, "replies": [{"body": "No it's not. Economy requires trade. World war means less trade.", "score": 2, "replies": [{"body": "Look into the Great Depression. You might be surprised to know that World War 2 was one of the main factors that caused huge economic growth.", "score": 2, "replies": [{"body": "Are you talking about american economy ? Because in case you dont know the american soil was untouched by war. We in Europe our countries were destroyed.", "score": 2, "replies": []}]}]}]}]}, {"body": "Secular bulls should be taken advantage of", "score": 1, "replies": []}, {"body": "Lol you are funny", "score": 1, "replies": []}, {"body": ">Anybody who held through the downturn could look at their portfolio today and likely see huge positive gains.\n\nYou'd cry if you saw my 401k.. and I'd drink your tears.\n\nThat's exactly what it looks like!!\n\nHuge\n\nPositive\n\nGains!!!\n\nYou know what?\n\nI'm still 100% in the fund that tracks SPX!!  New all time highs are frequently followed by new all time highs!", "score": 1, "replies": []}, {"body": "Administrations tend to take drastic action to keep the markets afloat in election years. I would expect there to be a review next year of the cost of all the stimulus in terms of debt and inflation, and a general relaxation of policy. I wouldn't expect a market crash in 21, but rather a stagnation as the underlying economy catches up to where it can justify current stock prices without government help.\n\nThat being said, people still do have money and the desire to spend it. I'm investing hard in live entertainment stocks, cruise lines, Six Flags, Disney, etc. We're going to see an explosion of consumption there when people are vaccinated.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "This comment is unprecedented.", "score": 1, "replies": []}]}, {"body": "Yeah really", "score": 0, "replies": []}, {"body": "Civil war", "score": 0, "replies": []}, {"body": "A recession", "score": 0, "replies": [{"body": "We’re already in a declared economic recession", "score": 1, "replies": [{"body": "We’re still only getting started", "score": 1, "replies": []}, {"body": "its an artificial one", "score": 1, "replies": []}]}]}, {"body": "Something that actually affects large companies that make up the stock market instead of mainly the economy and small companies.", "score": 1, "replies": [{"body": "Uh... someone wanna tell him about oil companies, airlines, banks, Boeing...", "score": 1, "replies": [{"body": "Sure, there's been a few sectors that were hit hard. But for every big company that was hit hard there was also another big company that benefited. Not to mention the fact that oil companies were going out of business already anyways, and these other sectors were heavily helped by stimulus.", "score": 0, "replies": []}]}]}]}
{"title": "All growth stocks dumb move?", "selftext": "Been investing for some years now and lately changed most of my holdings to growth stocks. Up 35% on NET, 40% on SE, 50% on PLTR, 20% on NIU, 80% on SQ. Down -5% on AMD, -15% fastly\n\nI realize it's a lot higher risk but even during the March lows my growth stocks lost as much as my ETFs in relative terms. So why would I go with ETFs if they loose just as much as growth stocks?\n\nEven if I have a few loosers i would still beat my ETFs. \n\nI plan on holding a few of these for some years and just look for next opportunitys.\n\nAny input? Because I have a hard time putting money in ETFs when growth stocks been killing it since 2015", "id": "jwdtpm", "created_utc": 1605697407.0, "score": 28, "upvote_ratio": 0.88, "num_comments": 38, "comments": [{"body": "It's not a dumb move. The world is transitioning to a state where every company is a tech/software/AI company. This means growth stocks will have much more to win and large value stocks will have a bigger chance to be disrupted. Growth is the future.\n\nThat said, you need to be very aware that many of these growth stocks are much more speculative. They will be huge in a few years or go bankrupt. So it makes sense, but only as long as you are prepared to take a lot of risk.", "score": 15, "replies": [{"body": ">take a lot of risk\n\nWhich is greatly mitigated by proper dd and knowing when to take profits.", "score": 3, "replies": [{"body": "Greatly but never fully. It's always gonna be more risky than value investing.", "score": 1, "replies": [{"body": "Stop losses and reading the news. And fair enough, but if you're going to be like that than GIC or HISA can be risky too, banks and countries can collapse overnight (sorta /s)", "score": 1, "replies": []}]}]}, {"body": "Unless you are wrong", "score": 1, "replies": []}]}, {"body": "Don't sell SE until the growth slows down, and that isn't happening soon. They just missed earnings, which for a speculative growth stock is usually terrible for the price. It barely dipped 5% and is already up again premarket, hold and add more on the dips.\n\nDisclaimer: 103 shares averaged in at $97, I'm long on SE.", "score": 20, "replies": [{"body": "They actually didn't even miss on earnings, it's been a widely reported error. \n\nThis is the first quarter that they reported GAAP revenua as opposed to non-GAAP. The 1.4 billion was non-GAAP, and their 1.2 billion revenue was GAAP.\n\nThis comment from a SA article (which posted the wrong numbers) explains it nicely. I can't post the article b/c it will be auto removed.\n\n\"Just some explanation here. Sea BEATS on revenue! This is a misleading title. Q3 2020 was the first time that Sea reported GAAP revenue. Before that, it reported adjusted revenue but the SEC didn't like that, so SEA changed it. See: https://news.bloomberglaw.com/securities-law/sea-to-drop-adjusted-revenue-measures-after-sec-inquiries. The adjusted revenue was used for consensus here, which is an (understandable) mistake. If you would compare apples to apples, the consensus of $1.42B was for adjusted revenue, and Sea beats there with more than $200M (adj rev of $1.666).\" The GAAP revenue consensus, as per Zacks, was $1.2B and Refinitiv gave $1.09 as consensus. Anyway, with GAAP revenue of $1.212B, Sea BEATS the consensus, no matter how you look at it or on which basis (GAAP or adjusted).\"", "score": 6, "replies": [{"body": "> They actually didn't even miss on earnings, it's been a widely reported error.\n\nBruh STFU I'm trying to buy more", "score": 3, "replies": []}]}, {"body": "I’ve been waiting for SE to drop after the earnings call to start a position, but it didn’t drop to where I was hoping it would. Would you say $168 is still a good entry point?", "score": 3, "replies": []}]}, {"body": "IMO it depends on if you're trying to preserve or generate wealth, or a mix, which depends on your age, risk tolerance, current financial state/income. With the macroeconomic environment where interest rates will be low, growth will be the way to go, but you could also move some proportion of your portfolio into blue chip growth stocks, which make up the top holdings of any growth fund, so stuff like aapl, msft, fb, amzn, HD etc. Like a 70/30 mix of high risk high PE growth and blue chip growth. You get dividends from some, and you have assurance that they'll likely be stable, or at least more stable than the BABAs and LKNCYs of the world. Growth also has many sectors, not just tech and consumer discretionary, but health, biotech, pharma.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Terrible advice imo, unless it’s a fun account you need to diversify. Especially with the imminent shift away from growth into value as the pandemic ends", "score": 5, "replies": [{"body": "Not terrible advice depending on your investment timeline and risk tolerance. \n\nI’m a 22yo long term investor with all my portfolio consisting of tech. \n\nYou’re overstating the short term “imminent shift” into value stocks while understating the long term imminent shift into tech as AI and machine learning continue to lead us into the 4th industrial revolution.", "score": 9, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I think that is a great point that usually goes under the radar when discerning what tech companies to invest in", "score": 2, "replies": []}]}, {"body": "Those shifts have happened twice so far for short term investors. Shifting to value for 20-40% gains pales in comparison to the potential gain in growth.  Long term capital gains shifting next spring worry’s me.  That’s when we will know which growth stocks are valued correctly.", "score": 3, "replies": []}]}]}]}, {"body": "Said it on an earlier post about NET will say it again. Most of these stonks are way over extended. Nothing has materially changed in their growth rates/margins yet they're trading at 2-5x higher mutiples than 1 year ago. The longevity of these numbers aren't sustainable and were at the very least going to see a sideline on many of these names for years. On your list SE(NTM EV/S hitting 13-15x), AMD and maybe SQ are still at sustainable levels, the rest are trading on momentum not numbers. This year was an anomaly of multiple expansion in anything with SaaS in the company description, don't get used to it for the LT and act accordingly.", "score": 6, "replies": [{"body": "Growth sales is not slowing down isn't that what people keep pricing in though? Thanks though, will check more into it", "score": 1, "replies": []}]}, {"body": "The future is in EV . China and Europe have policies in this direction", "score": 3, "replies": [{"body": "WEll wahts EV then, is it such a long word that it needs to be abbreviated?", "score": -1, "replies": [{"body": "EV stands for electric vehicles. As opposed to internal combustion engine vehicles (\"ICE vehicles\"). Think TSLA, NIO etc. :)", "score": 2, "replies": []}]}]}, {"body": "Im in the same position as you, my time horizon is 5 years minimum \n\nYea there will be bumps along the way, but look back in 5 years and you will be fine", "score": 2, "replies": []}, {"body": "Loose or lose?", "score": 2, "replies": []}, {"body": "I think if you want “growth” you need to look outside of tech. Tech already had a huge run the last 9 months and even more so the last decade or so. Other sectors have much more upside right now imo.", "score": 2, "replies": [{"body": "Like?", "score": 1, "replies": [{"body": "Healthcare is the one I’m bullish on right now. Fair value, didn’t get hit too hard by covid so it shows the sector is resilient, most good companies have PEs in the teens, high dividends, wide moats. I think healthcare will definitely be a leading sector in the next few years. My positions are MRK, UNH and VRTX.", "score": 1, "replies": []}]}]}, {"body": "As long you keep an eye on them every day all day", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "2000-2010 is too long ago. Big changes in technology have happened/matured", "score": 3, "replies": []}]}, {"body": "Growth stocks have underpformed value stocks by about 2% annuallised since 1930. Growth has had a good 10 years, but these things tend to lean revert.\n\nRead into Eugene fama and Ken French 5 factor model and watch some Ben Felix on YouTube", "score": 2, "replies": [{"body": "I disagree, using historical data does not take into account the convergence in emerging technologies such as AI, machine learning, material sciences, etc. if you want to see outsized returns within the next decade, invest in tech.", "score": 10, "replies": [{"body": "You can also invest in commodities tied to tech...nothing wrong with diversifying based on your overall thesis. I'm in tech, value, and will be buying up MP Materials soon", "score": 2, "replies": [{"body": "I’m not disagreeing with that, just my personal approach is more focused on maximizing gains with companies I believe in in other to create long term wealth. As I get older I plan to slowly diversify more to preserve wealth", "score": 1, "replies": []}]}]}]}, {"body": "Dumb move", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Where the shit did you get 140k at 20years old!? I made 10k turn into 40k and felt damn good at 24. Good on you", "score": 4, "replies": []}]}, {"body": "Blame Biden, time to go value stocks", "score": -8, "replies": []}, {"body": "i have a practice trading 212 account with fake money and only put money into the first 6 hyped growth stocks that i read up on here\n\ni'm up 7% in 6 days, the stocks being amd, nio, palantir, plug power, square, virgin galactic. all green", "score": 1, "replies": []}, {"body": "Maybe dumb but the risk to earn more is also much higher. Value stocks will increase most of the time only some 2 digit percentage. Growth stocks can reach 3 or 4 digit percentages.", "score": 1, "replies": []}, {"body": "Dumbbell method. High risk high growth stocks a\nBalanced out by low risk  stocks/ bond's that way you can better take advantage of the dips when they come", "score": 1, "replies": []}, {"body": "Niu good choice", "score": 1, "replies": []}, {"body": "you buy growth stocks to make money, you buy ETFs to keep money.\n\nbut what you said its the reason i stopped being too diversified, why hold 16 stocks when they all dip during a crisis, now i only own 10", "score": 1, "replies": []}]}
{"title": "Is TSLA Berkshire Hathaway's new mystery investment?", "selftext": "", "id": "jwak2y", "created_utc": 1605679863.0, "score": 54, "upvote_ratio": 1.0, "num_comments": 33, "comments": [{"body": "Buffett and Charlie Munger are not that smart (to add TSLA in the past or now). \n\nThey added Apple after Apple had a 200 fold run.\n\nThey probably will add TSLA shares after Tesla's market cap reaches $4T. Maybe around 2028.", "score": 28, "replies": [{"body": "They were over a decade late on Apple. They'll buy Tesla in 2035 when it has a 2% dividend yield.", "score": 24, "replies": [{"body": "I like how everyone's hating on them for taking safe/sure bets. I'm sure all of you and your dad invested in Apple since the 80's.", "score": 4, "replies": [{"body": "Maybe you don't know the history between Elon/Tesla and Buffett/Munger?", "score": 2, "replies": [{"body": "None of that changes the fact that Tesla's P/E ratio is 989 right now. I agree with you that they probably haven't added Tesla to their investment portfolio and that they may add it in 2028, but for different reasons. It will just be when their P/E ratio goes under 100 (whether that's because it has insane profits or whether the market cap fell drastically.) Buffet just doesn't work with companies that don't make a good profit. After all, that's the most important part about investing a company unless you're intentionally investing in a bubble based on speculation.", "score": 2, "replies": [{"body": "If Tesla's market cap stays constant, it's P/E will reach 1 down the road. Let's agree we have different views.", "score": 2, "replies": [{"body": "You seriously believe that Tesla will be earning $500\\~ per share, if share prices stay at $500 (so market cap stays constant.) \n\nOr to say it differently, you believe that Tesla will at some point in time be earning 473 BILLION in PROFIT per year? Assuming that Tesla ends up with a per-vehicle profit that's the same as Porsche, a luxury foreign car brand with exclusively expensive cars, which is around $15,000... you are saying that Tesla would sell 31,533,333 units per year or 1/3rd of global car sales. This is the absolute best-case scenario pretty much. More realistically, you are saying that if we take the global average of vehicle profits, which is about $1,000 then Tesla would have to sell nearly half a billion vehicles a year. Elon Musk himself has said that the lifecycle of a vehicle is about 20 years, so do the math, 8 billion people, assuming they even all drove vehicles, you'd need every other person to have an extra Tesla in their driveway to have that many sales. You'd need their toddlers to drive. Or are you banking on the world population going up? Theoretically, yes, in a few hundred years maybe they'll have 1 P/E ratio so you're completely right. Or are you banking on them being a battery producer? The largest producer in the world has nowhere close to Tesla's market cap. Or you think they'll do solar panels? Same. And remember, you didn't even say it would stay constant, you basically said the market cap would 8x in 8 years. So sure, it 8x's and the P/E ratio is 8 instead of 1. This would be a more realistic P/E ratio, but again, you're out of humans.", "score": 2, "replies": [{"body": "I didn't say those things you mentioned. Have you been shorting TSLA?", "score": 2, "replies": [{"body": "By saying it'll reach P/E ratio of 1 you said those things, but feel free to correct me. I'm not shorting it yet, I'm waiting for the dumb money to keep buying it up into astronomical heights and then I'll short it. I will probably start shorting it when it hits $1000 unless I notice it falling sooner in which case I'll ride it sooner.", "score": 2, "replies": [{"body": "You do understand TSLA is quite undervalued?", "score": 1, "replies": [{"body": "Congratulations on not presenting anything of value.", "score": 2, "replies": [{"body": "Good luck!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Berkshire also bought big stakes in Snowflake privately and at the IPO, more than doubling his $735 million to $1.5 billion as soon as the first trades were made.", "score": 5, "replies": [{"body": "Most likely it's Todd or Ted decided to buy Snowflake shares, they each have a large amount under management. At this stage I don't think they need Buffett's approval to invest a small amount like $700m.\n\nThere is ZERO chance that Buffett or Munger bought Snowflake. We will find out in the next shareholder meeting. It amazes me how little the market understands how these things work.", "score": 2, "replies": []}]}, {"body": "Yeah... i think his decision making strategy has worked pretty well for him and he'll probably stick with it, despite your excellent commentary.\n\nIf you were as smart as you think you are maybe you'd see it as a positive indication that they might be adding Tesla stock now. Perhaps a good strategy is to let risks prove themselves first whilst still having a large growth curve ahead of them. Do you think when they bought Apple, that was a bad decision?\n\n&#x200B;\n\nRegardless, i'd be very surprised if Berkshire bought TSLA as they are all about the type of business fundamentals that are non-existant at Tesla currently.", "score": 4, "replies": [{"body": "Adding to your point, the very subject matter of this topic indicates that it is a massive pain in the dick to move a war chest with 11 digits and 3 commas.  Never mind keeping it mum, just moving tens of billions isn't going to happen without making a few phone calls and burning up some serious printer ink.", "score": 2, "replies": []}]}, {"body": "If I have to guess which company Buffett added, I think most likely BA, second possibility is GE.", "score": 4, "replies": [{"body": "Both of those might be too small. The $11B we're talking about would be almost 15% of GE, and \\~10% of BA. Unless BRK also got an exception from the SEC on that, which I'm skeptical of, it'd have to have filed 13D/G filings with the SEC, but it has not.", "score": 6, "replies": [{"body": "I'm pretty familiar with how Buffett and Munger pick companies. The chance is less than 2% that they invested in TSLA. They don't understand Tesla.\n\nTed and Todd might like TSLA (also a small possibility), but as long as Buffett is in charge, they are unlikely to buy. \n\nTesla doesn't need their investment. S&P inclusion is noise. What's really important is that Elon Musk and the team are on track to achieve their Master Plan Part Deux.", "score": 8, "replies": [{"body": "They did invest in BYD, so there is a small chance imo", "score": 8, "replies": []}]}]}, {"body": "BOEING TO THE MOON", "score": -1, "replies": [{"body": "As a long term investment, I like Tesla way better than Boeing.", "score": 5, "replies": [{"body": "BA just feels like a deadman walking", "score": 2, "replies": []}]}]}]}]}, {"body": "Get back to work! Your MBA isn't just going to fall into your lap! /s\n\nThanks for the blog post.", "score": 4, "replies": [{"body": "Starting in January ;)", "score": 9, "replies": []}]}, {"body": "Good find", "score": 5, "replies": []}, {"body": "IMHO, totally plausible. \n\nA little bit rambly thoughts below... I've been following Berkshire for a decade...\n\nFor 1, as the blog posts says, there aren't that many options for companies large enough to not trigger an earlier disclosure.\n\nFor 2, BRK and Tesla are like two octopuses' meeting each other and getting to know each other. They have many points of contact that it becomes obvious to Berkshire that Tesla is in it for the long haul. BRK owns an electric utility that was one of the quickest to switch to wind power; BRK has control over Flying J truck stops which will inevitably need mega-chargers; BRK has a railroad that has seen coal volumes collapse - it's obvious that electricity is going green; BRK through GEICO might be seeing actual data on how autopilot is doing on the roads, or Tesla's as a whole in crash worthiness.\n\nFor 3, S&P500 was inevitable to anyone half-intelligent, if anyone can figure out the demand-supply math of how that will turn out for shares in the short term, it's Buffett. \n\nFor 4, I think it would be hilarious if Buffett watched the Battery Day presentation and saw a gold mine (or lithium mine, I suppose). If Buffett likes anything, it's firms with solid long term plans, and he's not scared of firms that just need capital to build more factories - in fact, he'd love to dump seemingly endless amounts of money into the battery industry if he saw endless demand. Per above, between BYD and the electric utility, he knows if the cost of batteries drops past some magic point, the entire transportation sector and electrical sector changes. The only problem becomes scale and long term investment - totally in Berkshire's wheelhouse.", "score": 5, "replies": []}, {"body": "Buffett has made major mistakes in last 15 years.  S&P500 has outperformed BRK over the last 1,3,5,10,15 years.\n\nHe has whiffed on the most important stories of last 2 decades (FB, GOOG, AMZN, TSLA) and 3 of these were 0 to 3x market cap of BRK. \n\nWith the exception of his Apple investments all of his investments have been duds (Precision Castparts, Lubrizol, IBM, OXY bonds, Delta Airlines, KHC,WFC, BAC, Cash, Gold..)", "score": 2, "replies": [{"body": "Sounds like he should have switched to philanthropy quite a few years ago. It is good to retire on top. Sadly, I see so many people quoting the philosophy of Warren but it just hasn't been the right era for it so most of those people likely have done poorly. To win the last 15 years you basically just needed to believe in internet and california and winner-takes-all. The losers mostly had a 'the big boys have been around decades and will crush upstarts' mentality.", "score": 3, "replies": []}]}, {"body": "There is close to zero chance Buffett is buying Tesla. I believe it is Paypal.", "score": 2, "replies": []}, {"body": "Buffet focuses on fundamentals of which TSLA is sorely lacking.", "score": 0, "replies": [{"body": "Buffet [bought big stakes in Snowflake](https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-snowflake-ipo-stake-800-million-gain-2020-9-1029629868) before its IPO, and Snowflake isn't close to profitable yet.", "score": 9, "replies": []}]}, {"body": "No way. Buffet probably has too much pride. If he invests though, thats a huge L for him and hes elons son. (W for making money though... L for dying soon and not being able to spend it :(", "score": -4, "replies": []}]}
{"title": "Warren Buffett’s Berkshire Hathaway could be scooping up shares of a certain company in secret. The conglomerate released its quarterly 13F regulatory filing Monday evening, and there was a line included in the footnote — “Confidential information has been omitted from the public Form 13F report.”", "selftext": "", "id": "jwaxss", "created_utc": 1605681766.0, "score": 76, "upvote_ratio": 0.97, "num_comments": 35, "comments": [{"body": "This is Peel’s Twitter thread on this topic \n\nhttps://twitter.com/frankpeelen/status/1328943515326418944?s=21", "score": 40, "replies": []}, {"body": "This reminds me of that time last year when Elon Musk changed his twitter name to \"Elon Tusk\". That same week news came out that Buffet was ready to make an \"Elephant sized\" investment. This sub put 2 and 2 together and I lost money on short term calls. \n\nTurns out that \"Elon Tusk\" was his character in Rick and Morty and Buffet was just doing some other Elephant sized shit.", "score": 28, "replies": [{"body": "\\>  This sub put 2 and 2 together and I lost money on short term calls. \n\nlmfao", "score": 12, "replies": []}, {"body": "😂", "score": 2, "replies": []}]}, {"body": "There was some discussion that it could be spacex or tsla. \n\nFwiw, a guy on Twitter deleted his post that he has this info from reliable source.", "score": 27, "replies": [{"body": "There's no reason to keep a SpaceX investment secret though, it's not publicly traded, so no price to run up.\n\nMy guess:\n\n- it's either a Musk company (Tesla)\n- or a former Musk company (PayPal)\n\n😁", "score": 14, "replies": [{"body": "why musk related?", "score": 5, "replies": [{"body": "Because investment companies like making money and Musks companies do that...", "score": 8, "replies": []}]}, {"body": "PAYPAL ???\n\n&#x200B;\n\nHe wouldn't do that this late in the game would he ?", "score": 2, "replies": []}]}]}, {"body": "Buffett said, years ago, at an investor meeting, that he made a lot of his money early on by going “all in” on certain companies (instead of diversification). Maybe he’s finally at that point w TSLA. 👍", "score": 6, "replies": []}, {"body": "Given Buffett’s style of value investing, I doubt he’d invest in TSLA and probably sees it as ridiculously overvalued.  He’s also already in BYD.", "score": 21, "replies": [{"body": "His younger deputies, Todd Combs and Ted Weschler, have been behind the move into big tech like Apple, Amazon & Snowflake. I could see buying TSLA as a continuation of this change in strategy.", "score": 22, "replies": [{"body": "I still doubt that would happen, but will hope that I’m wrong.\n\n🤞", "score": 7, "replies": []}]}, {"body": "Bc he owns byd made him realize how tough tesla as a competitor is due to their advancements in tech and manufacturing, maybe.", "score": 5, "replies": []}, {"body": "He finally got into appl. Considering tsla is the appl of the auto world, premium brand + margins, I wouldn't be surprised if he bought tsla.", "score": 3, "replies": []}, {"body": "You have to change eventually. Investing today is nothing like it was 20 years ago.", "score": 1, "replies": []}]}, {"body": "This is super interesting. I like the breadcrumb data trail. \n\nI wonder if the retail investors are being underestimated. Peel might be discounting them too much. TSLA is usually in the top 3 stocks traded on Fidelity and Robinhood. And retail investors make up [more of the market](https://www.economist.com/finance-and-economics/2020/09/12/beware-the-power-of-retail-investors) than ever before. \n\nThat said, Berkshire is definitely buying a lot of *something*, that is clear. TSLA is definitely on the short list of possibilities.", "score": 9, "replies": []}, {"body": "How do 50m shares “go missing”? What does that even mean?", "score": 4, "replies": [{"body": "I think he means 50m shares of the float", "score": 2, "replies": []}, {"body": "Institutional investors published their holdings with the SEC. So if there were 500m shares held by institutional investors this time last year, now there are only 450m shares held by institutions.\n\nSince retail generally doesn't move that much money, it's hard to believe it's fully attributable to retail, it's more likely another large investor that hasn't yet revealed their holdings, e.g. Buffet's confidential filing.", "score": 2, "replies": []}]}, {"body": "With enough dedication, you can find any data in noise. Not saying Peels idea is wrong, I dont know honestly. But the circumstantial evidence can point to so many directions, its far fetched to attribute it to TSLA.", "score": 5, "replies": []}, {"body": "It’s HYLN. Maybe.", "score": 3, "replies": [{"body": "That’d be awesome! \n\nI have 250 shares of TSLA and for fun, 50 of HYLN", "score": 1, "replies": [{"body": "Nice portfolio.", "score": 2, "replies": [{"body": "Thank you\n\nDid you buy into either?", "score": 1, "replies": [{"body": "Only TSLA. I have no extra funds right now.", "score": 2, "replies": [{"body": "Cool, all the best my friend", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Seems unlikely? Tesla seems like a company that, at it's current valuation and level of money making falls pretty far outside of what Berkshire would normally be buying", "score": 2, "replies": []}, {"body": "Not tesla related", "score": 6, "replies": [{"body": "It could be. Peel in his blog mentioned that. And there are some rambling on Twitter too.", "score": 7, "replies": []}]}, {"body": "Mr. Buffet about to shock the world with his Nikola investment. Investing in gravity which only goes down. An amazing big brain by Mr. Buffet. He has balls of stone.", "score": 3, "replies": []}, {"body": "If he were smart, he would buy SPCE, HYLN and Tesla ;)", "score": 0, "replies": []}, {"body": "Stop guessing guys.. is NIO. Ask WSB.", "score": 1, "replies": []}, {"body": "Considering Buffet sucks big time on technology plays and has missed out on Amin, Goog, Apple, etc, I don’t see him investing in Tesla. He doesn’t understand technology so he stays away. He was asked this question about investing in Tsla 2 years ago", "score": 1, "replies": []}, {"body": "Where was that thread saying what ten companies it could only be from?", "score": 1, "replies": []}]}
{"title": "Need advice on running the wheel on MSFT", "selftext": "I bought 140 shares of MSFT before i discovered wheeling and it qualifies as long term investment.\n\nIt has now doubled in value.  Roughly 30k is tied in MSFT.\n\nfor majority of this year, its hovering between 200-230 range and i don't expect it to double again. \n\nMy concern is 30k capital is not working hard enough. I want to put this capital to work to make 1-2% a week. \n\nI see two possible moves.\n\n1) I start wheeling on msft  and let it get called away. take one time tax obligation . after i get it called away, decide to wheel on what is appropriate at that time.\n\n2) continue holding msft. dont wheel. forget about 1-2% gains on this capital. \n\nWhat would you do if you were in my situation?", "id": "jwo3na", "created_utc": 1605732516.0, "score": 4, "upvote_ratio": 1.0, "num_comments": 36, "comments": [{"body": "Just sell 20 delta monthly calls and roll if it starts aggressively moving up. It's like a free $200-$300 a month.", "score": 4, "replies": [{"body": "At what point do you roll it if it starts moving up quickly?", "score": 1, "replies": [{"body": "Well if I were actually doing this and wanted to keep the stock, like a Dec 18 225 call would get me $173. So let's say the stock end of next week shoots up to 220. Then I would probably roll it to the Jan 235 call and grab another 30-40 bucks. If it shoots past that. I mean I'd probably just take the profit at that point, but if you really, really wanted to hold it you could just keep rolling it up and out month by month, though at some point you won't be getting much premium and you'll end up staring at an option that doesn't expire for six months and is too expensive.  to get out of.", "score": 1, "replies": [{"body": "Thanks for the explanation. I tried this with NIO for the first time. I didn't want to let go of my shares and it screwed me.\n\nI've been selling CCs for about a month now. Still down a couple hundred bucks from buying back a couple calls at a loss.\n\nI learned some lessons\n\nNIO 200 shares @$20", "score": 1, "replies": [{"body": "I actually have a couple of NIO leaps, cost $5k or thereabouts. And have been selling calls for about $100/wk. Tomorrow I plan on rolling then from a $50  strike to higher as I see plenty of room for growth.", "score": 1, "replies": [{"body": "Good deal, brother", "score": 1, "replies": []}]}]}]}]}]}, {"body": "1% per week is not sustainable long term. \n\nYou could sell 40 shares to take profits to reinvest since those won’t be useful for a CC.\n\nMSFT dividend yield is about 1%. You could sell far OTM covered calls on your shares and aim for an extra 1-2% profit per year, easily, without having the shares called away too soon. MSFT is an extremely strong and well diversified company. It remains to be seen but it has potential to keep going up, even if at a slower rate in the future. Re-evaluate the company’s position each quarter and decide if it’s still working for you.", "score": 5, "replies": [{"body": "yeah this is what i was looking for. \n\ni understand 1% per week strictly is not feasible. i was mostly hoping for some average gain while holding instead of no gains from options. \n\ni might sell 40 and invest it elsewhere. thanks.", "score": 2, "replies": []}]}, {"body": "I would reset expectations making 1-2% / week...reliably?  Not gonna happen.  If it was low risk every investment bank like GS, Morgan Stanley, etc would be doing this exclusively.  \n\nI think you’ll be lucky to make 1-2%/month wheeling MSFT.", "score": 4, "replies": []}, {"body": "Sell all the shares.  Pay the taxes.  Take all the $ and buy 2 year leaps.  You can most likely get more than 1,000 shares and do the Poor Man’s Covered Call.  You’ll be able to take advantage of the growth, but you’ll be able to increase your income selling calls and puts x 10.", "score": 3, "replies": [{"body": "How do you sell puts using PMCC?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I see so you buy a LEAP put and then sell short dated puts against it?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "And can you also do it if you own a stock?", "score": 1, "replies": []}]}]}]}]}, {"body": "i followed you until buy 2 year leaps. how do i get more than 1000 shares ? you mean do pmcc after 2 years? i don’t understand", "score": 1, "replies": [{"body": "Sorry I did not explain this very well.  There are more advanced people on here than me.  Say you did a one year ITM Leap on MSFT.  You could get the 1/2022 MSFT 200 Call for 32$ x 100 = $3,200 —- 900 shares would run you $28,800.  The reason you buy it 10% in the money is so when you sell puts or Cc, you won’t have the shares called back.", "score": 1, "replies": [{"body": "can i sell puts on shares i don’t own? that is news to me.\n\nwhen i buy leap, i’m getting into a buy contract in future. i don’t own 900 shares yet. how can i sell covered calls on something i don’t own?", "score": 1, "replies": [{"body": "Yes Sir... check out this as a reference.  Poor Man’s Covered Call.  Again buy 10% ITM for a buffer.\n\nhttps://youtu.be/m8A4f4Zl5MY", "score": 1, "replies": [{"body": "thanks. will check it out", "score": 1, "replies": [{"body": "Read this thread", "score": 1, "replies": []}, {"body": "https://www.reddit.com/r/thetagang/comments/hcy0o1/why_synthetic_covered_calls_outperform_the_wheel/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 1, "replies": [{"body": "thank you!!!", "score": 1, "replies": []}]}]}]}]}, {"body": "Wouldn't that give you a breakeven of 232 on msft ? Wouldn't you aim for something closer atm , i have 1 leap 1/2022 125 call and it has given me really nice atm position where i can sell calls closer atm for more premium.", "score": 1, "replies": []}]}]}]}, {"body": "Wheel the shares in bearish times. Hold in bullish times.", "score": 0, "replies": []}, {"body": "If you want to make 1% a week on average over the long term the wheel is not going to do that unless you are taking blow up amounts of risk. \n\nMy mentor probably makes a bit over that amount over the course of the year without a lot of risk but the guy is a flat out genius and doing some very complex stuff. If you want send me a message and I can put you in touch with them. I am learning from them currently.", "score": -5, "replies": [{"body": "not interested sorry. if you can send this link to your genius mentor and he provides a genius strategy and validates his geniousity  i would be willing to learn from him.", "score": 7, "replies": [{"body": "Hey doesn't matter to me and I am sure he doesn't have time for Reddit.", "score": -5, "replies": []}]}, {"body": "So your genius mentor makes a little bit over 1% a year without a lot of risk?\nWhat if i told you the market averages 7% a year minimum by just buying and holding....", "score": 2, "replies": [{"body": "No I mean a bit over 1% a week annualized. Sorry I wasn't clear on that.", "score": 1, "replies": [{"body": "Thats decent returns", "score": 1, "replies": [{"body": "Yeah but he as access to all the institutional data and knows how to use it. Plus it is not scalable. He has a million now but he wouldn't be able to make the same returns with say 20 million. \n\nMy goal is to learn as much as I can from him and make around half that a year.", "score": 2, "replies": []}]}]}]}, {"body": "I would be interested in hearing from this guy.", "score": 0, "replies": []}, {"body": "Lol so much cringe", "score": 0, "replies": []}]}, {"body": "So I was in a similar dilemma. I had about 120 shares of FDX that I had accumulated throughout the years. I was nervous about paying taxes on it by selling the shares (in case my CC gets assigned) but figured, what the hell. \n\nSo eventually my shares get called away, and I start the wheel strategy.  \n\nSo far for me, I have been able to get 1 to 2% a week ROI. So it's totally doable. \n\nI don't want to give advice here because I am also new and still learning but just wanted to share my experience.  Good luck.", "score": 1, "replies": []}, {"body": "Personally I would sell 40 shares and start wheeling other things to make 1-2% a month on other.  Keep 100 shares and run the wheel on MSFT, starting by selling a covered call.", "score": 1, "replies": []}, {"body": "You aren't going to make 1 to 2% a week wheeling msft.", "score": 1, "replies": []}, {"body": "You can sell OTM calls so it won't be called away.", "score": 1, "replies": []}]}
{"title": "Obscure stocks to make tendies on", "selftext": "As more hedge funds/market makers see the tickers show up on here they inverse the hell out of and take positions against us. So lets put together a list of tickers that no one is talking about. I'll start. \n\nNIO, DKNG, PSTH, SNAP, GME, CRSR, SNOW, PLTR, TSLA, FSLY, PTON.", "id": "jw59lf", "created_utc": 1605659249.0, "score": 27, "upvote_ratio": 0.9, "num_comments": 30, "comments": [{"body": "Shhhh NIO is our little secret", "score": 19, "replies": [{"body": "Worst kept secret", "score": 10, "replies": []}]}, {"body": "MDXG - Healthcare company that just got relisted on Nasdaq and is down big from the price prior to delisting.   They are known as their former self of an Advanced Wound Care company and havent gained the image nor Market Cap of their emerging Therapeutic Biologics side despite having a huge Knee Osteoarthritis pipeline product that just completed Phase 2B Enrollment that isnt covered/accounted for worth billions in Market Cap (I estimate $2B based on UBX which had their price target dropped by 1.8B when their Knee OA product didn’t work out).  They also have Phase 3 Achilles and Plantar Fasciitis injectable studies scheduled to conclude in March and April 2021. New management, new board of directors, picked up lots of big names, and lots of cash.\n\nThey havent gotten any Analyst coverage yet, but they have an analyst forum on Thursday and a Shareholders call Friday so things are likely about to pop off as everything falls into line.\n\nUnfortunately its too early for Options so you need to buy shares.\n\nEdit - Made a post on it here - https://www.reddit.com/r/wallstreetbets/comments/jw5qwe/mdxg_is_the_just_relisted_on_nasdaq_healthcare/", "score": 7, "replies": [{"body": "Is it yolo worthy on shares?", "score": 5, "replies": [{"body": "Dunno what YOLO worthy means here, but Ive got $100K in it\nhttps://i.imgur.com/rShgsiO.png", "score": 7, "replies": [{"body": "Im sold", "score": 1, "replies": []}]}]}, {"body": "The price is a $6.66 right now\n\nLove it", "score": 3, "replies": [{"body": "Placed 100 shares just for the 666 buy in RH.\n\nAll Hail Moloch Tendies?", "score": 2, "replies": []}]}, {"body": "Well done. Good call.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit Inc. has banned Seeking Alpha articles because their payout model strongly encourages spam. \n\nTo get around this, please repost your comment/thread with the link removed. \n\nYou may wish to copy and paste the full article if it adds necessary context to your post. If so, please include the link with a space in the domain (e.g. \"seek ingalpha.com/...\")\n\nWe apologize for any inconvenience this may have caused.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "NOK", "score": 3, "replies": []}, {"body": "American Eagle $AEO it’s gonna rip face with29% short. Multiple days to cover. About to explode through resistance", "score": 3, "replies": [{"body": "Your puny 29% short float has nothing on GME.\n\nGME has Ryan Cohen and Micheal Burry acting as large activist investors.  Plus the new console cycle and holiday season are going to leave GameStop swimming in cash come Q4 and Q1", "score": 5, "replies": [{"body": "True, but no ones talking about this one yet. I’ll check back with you in a week", "score": 3, "replies": []}]}, {"body": "Update American eagle ripped face :)", "score": 1, "replies": []}]}, {"body": "CMPS magic mushrooms 🍄", "score": 2, "replies": []}, {"body": "Why did you give away TSLA stfu", "score": 2, "replies": []}, {"body": "Moneygram", "score": 2, "replies": []}, {"body": "Literally every meme stock. How are these obscure?", "score": -3, "replies": [{"body": "No one is talking about these at all man. Legit never heard one person from this sub talk about these.", "score": 8, "replies": []}, {"body": "Thatsthejoke", "score": 2, "replies": []}]}, {"body": "MP but prolly won’t be tradeable", "score": 0, "replies": []}, {"body": "Apha", "score": 1, "replies": []}, {"body": "RIOT", "score": 1, "replies": []}, {"body": "Pstg", "score": 1, "replies": []}, {"body": "FCEL", "score": 1, "replies": []}, {"body": "I feel like OP is messing with us but if I was smart enough to figure that out I wouldn't be on this sub.", "score": 1, "replies": []}, {"body": "MAC, short interest is insane and they have 10 AAA+ properties that have 95% occupancy. This one is a long play for when we recover from the pandemic 1 year plus, but its already started to pop. Got in at shares for 7$.", "score": 1, "replies": [{"body": "Why do you think malls will make a comeback even if we recover from the pandemic?", "score": 1, "replies": [{"body": "Macerich isn't in the business of malls. They are in the business of all in 1 lifestyle spaces.", "score": 1, "replies": []}]}]}]}
{"title": "LASIK Eye Surgery or YOLO Tesla calls?", "selftext": "Literally the title says the whole story.\n\n&#x200B;\n\nEye sugery pros: Make me happy with 20/20 vision.\n\nEye surgery cons: Unable to work for a bit, potentially doesnt fix vision, uses up most of my money, expensive with no capital return.\n\n&#x200B;\n\nYolo Tesla pros: Become more wealthy, get the laser eye surgery later on, family re-accept me.\n\nYolo tesla cons: Become poor and sad with bad vision, bad credit score but still have a job.\n\n&#x200B;\n\nPotential positions: TSLA 500C Jan21", "id": "jwd1a4", "created_utc": 1605693090.0, "score": 11, "upvote_ratio": 0.77, "num_comments": 34, "comments": [{"body": "Not gonna lie lasik changed my life, I'd have to pick that first", "score": 28, "replies": [{"body": "Same", "score": 9, "replies": []}, {"body": "Ive read alot about it, 99% is people saying its life-changing which is the obvious reason its being considered so highly, could I ask if theres a specific change in your life thats made it so good?", "score": 3, "replies": [{"body": "Idk bro being able to see sounds pretty fun", "score": 27, "replies": []}, {"body": "Not having to worry about wearing glasses/contacts daily and having 20/15 vision is pretty nice\n\nEdit: I got prk", "score": 6, "replies": [{"body": "Got PRK a few months ago as well. Life changing but man those first few days after were hell", "score": 2, "replies": []}]}, {"body": "If you are extremely near sighted like I was, being able to see everything while I showered was the moment I knew I made the right choice.", "score": 2, "replies": []}, {"body": "As others have said, never second guessing your own eyes, never thinking about contacts or glasses and so on. The world is now clear and I honestly think I have better than 20 vision in my left eye atleast\n\nRegardless just imagine the time you'd save never squinting or needing vision assistance, it all adds up", "score": 1, "replies": []}]}]}, {"body": "Just go half TSLA and half Lasik. Finish the other eye with TSLA gains.", "score": 8, "replies": [{"body": "decided!", "score": 0, "replies": []}]}, {"body": "ur more likely to make money on pltr stock", "score": 3, "replies": []}, {"body": "Lasik changed my eyes for good. Do it", "score": 3, "replies": []}, {"body": "Tsla changed my eyes. Wearing glasses btw", "score": 2, "replies": []}, {"body": "But if you get Lasik then you'd be seeing your losses in HD.", "score": 2, "replies": []}, {"body": "Yolo Tesla call", "score": 0, "replies": [{"body": "First comment, this is the way.", "score": 0, "replies": []}]}, {"body": "The fuck kinda question is this, role the dice playa. This WSB not the Obama care health portal. Get money, worst case scenario u wear your glasses a lil while longer. If u truely believe in the risk/reward of the call then by all means chase the money, duh", "score": 0, "replies": []}, {"body": "That’s the  money printer call.....this is the way", "score": 0, "replies": []}, {"body": "How do you feel about KHC? Long wedgies are good for the soul and allow you to time the market. Low theta= you love me when you make more with less and can afford eye surgery no matter what.", "score": 1, "replies": [{"body": "Honestly ive never considered them and have no real knowledge of them, ill look into it.", "score": 1, "replies": []}]}, {"body": "I’d go with lasik bro it really is life changing", "score": 1, "replies": []}, {"body": "Get lasik", "score": 1, "replies": []}, {"body": "Did my lasik on a Friday afternoon by Saturday my eyes felt normal again. Although vision didn't become fully clear for a week or more. You shouldn't really miss any work at all if you schedule it right", "score": 1, "replies": [{"body": "Damn, fair enough", "score": 1, "replies": []}]}, {"body": "LASIK M8", "score": 1, "replies": []}, {"body": "The fuck you come from where being able to see ain’t return on investment?", "score": 1, "replies": [{"body": "WSB, you?", "score": 1, "replies": []}]}, {"body": "As a person that sees in blurry pixels when I don't wear glasses, get your fucking LASIK", "score": 1, "replies": []}, {"body": "If you’re poor, clearer vision won’t make much of a difference. A rich blind person though...", "score": 1, "replies": []}, {"body": "Lasik was the best decision I ever made.", "score": 1, "replies": [{"body": "> people saying its life-changing which is the obvious reason its being considered so highly, could I ask if theres a specific change in your life thats made it so good?\n\n2nd best. 1st best was taking up skydiving after getting lasik.", "score": 1, "replies": []}]}, {"body": "Hey dude how old are you? Are you near sighted or far sighted? Has your eye doctor explained to you that if you get lasik you will need to wear glasses later on in life when you need cataract surgery? \n\nI thought I wanted it when I was a little younger. But then I realized I would need to wear glasses once I get cataract surgery to see up close. I've never had to do that in my life and I don't think I'd want to start when I'm 70.", "score": 1, "replies": []}, {"body": "I got PRK instead of Lasik. Lasik has very quick recovery and it is life changing. Do yourself a long term favor", "score": 1, "replies": []}, {"body": "I definitely never washed my contacts the \"correct\" way. It helped my spring/summertime allergies when I got it...\n\nEdit: Lasik", "score": 1, "replies": []}]}
{"title": "Affirm, Co-founded by Paypal Co-founder, files for IPO", "selftext": "You know the little button on basically every retailers online shop that reads \"Pay in payments with affirm\" yip thats them. THIS IS HUGE. I literally see those blue words on EVERY online shop. The amount of boomers who use it as credit is HUGE. You dont need a credit card or credit history to use their service. You dont even get a physical card with them. Its basically online invoices. Also you choose whether you want to pay your purchase in  3months, 6,  or 12. Their app is where you see your purchases and where the bills go to.  This is the next IPO that will boom. Thots?\n\n[Link](https://www.marketscreener.com/quote/stock/PAYPAL-HOLDINGS-INC-23377703/news/Fintech-startup-Affirm-s-IPO-filing-shows-revenue-surge-amid-lending-boom-31815790/)", "id": "jwqvxq", "created_utc": 1605741375.0, "score": 69, "upvote_ratio": 0.96, "num_comments": 33, "comments": [{"body": "You had me at PayPal co-founder.", "score": 59, "replies": [{"body": "Tesla, Affirm, Palantir. I'd TAP dat.", "score": 31, "replies": []}]}, {"body": "I'm in. Affirm is legit.", "score": 18, "replies": []}, {"body": "Paypal mafia strikes again", "score": 17, "replies": []}, {"body": "What’s the ticker going to be? It must be easy to read for me to invest\nLike AFRM", "score": 13, "replies": [{"body": "Its RTRD", "score": 22, "replies": []}]}, {"body": "30% of their revenue comes from PTON 👀", "score": 20, "replies": [{"body": "Where did you see this? URLs please :)", "score": 2, "replies": [{"body": "their S-1", "score": 6, "replies": [{"body": "Thanks, I'll check it out!", "score": 1, "replies": []}]}]}]}, {"body": "When does it become public?", "score": 6, "replies": [{"body": "They just filed no word of when they go public", "score": 11, "replies": []}]}, {"body": "How do you guys find this news so fast? I wanna be able to find companies that are IPOing quickly but I always seem to find them too late. I wish I could see the date they go public so I can get them first thing", "score": 6, "replies": [{"body": "This particular news you don’t need fast. The date of the IPO is what you want and you’ll have plenty of heads up around here. \n\nWith the SNOW IPO, RH had it up by middle of the first day.", "score": 9, "replies": []}, {"body": "Just keep reading WSB", "score": 2, "replies": []}, {"body": "You must have a job?", "score": 1, "replies": []}, {"body": "Market Watch", "score": 2, "replies": []}]}, {"body": "I used this before to buy something expensive so my wife wouldn't find out.  Puts on marriage", "score": 3, "replies": []}, {"body": "30% of their revenue is from Peloton which is... a lot:\n\n> Our top merchant partner, Peloton, represented approximately 28% of our total revenue for the fiscal year ended June 30, 2020 and 30% of our total revenue for the three months ended September 30, 2020. Our top ten merchants in the aggregate represented approximately 35% of our total revenue for the fiscal year ended June 30, 2020 and approximately 37% of our total revenue for the three months ended September 30, 2020.”\n> \n> “For example, the significance of Peloton in our portfolio has increased as a result of consumer spending trends on home fitness equipment, and there can be no assurance that such trends will continue or that the levels of total revenue and merchant network revenue that we generate from Peloton will continue. The loss of Peloton as a merchant partner, or the loss of any other significant merchant relationships, would materially and adversely affect our business, results of operations, financial condition, and future prospects. In addition, an anticipated material modification in the merchant agreement with a significant merchant partner could affect the results of our operations, financial condition, and future prospects.”\n\nThat being said, Peloton is all prime borrowers taking 0% APR deals: good for $PTON who gets to realize revenue immediately, and good for Affirm that gets to stack quality vintage on to their books.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "Definitely in. Used this to get a cali king Bear matress.  Best investment of the last 3 years. My sleep is amazing.", "score": 3, "replies": []}, {"body": "Sounds good. I'm all in when it hits", "score": 4, "replies": []}, {"body": "Never heard of her", "score": 2, "replies": [{"body": "see [DD](https://imgur.com/a/tqTvXbe)", "score": 5, "replies": [{"body": "they just partnered with Adyen (huge payment processor) today too", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "If you really think about it our bodies are like autistic Rube Goldberg machines that execute Robinhood transactions", "score": 3, "replies": [{"body": "I put the Mountain Dew and Cheetos in my mouth which gives me the energy to  buy otm calls and cry in wife’s boyfriends basement.  I see it.", "score": 3, "replies": [{"body": "Well the beginning event of the machine is seeing another autist’s gain porn on WSB, which leads to dreaming of being rich, which leads to daydreaming and not having dinner, which leads to eating a whole bag of  Doritos as a substitute, which we then wash down with a few glugs of Mountain Dew, which gives us the energy to buy OTM FDs and ultimately sob in the arms of our wives boyfriends.", "score": 2, "replies": []}]}]}]}, {"body": "Used this to get both the Peloton Bike and Tread. It’s going to do very fucking well. I’m in!!!", "score": 3, "replies": []}, {"body": "I will dump my ADYEY shares and buy this", "score": 1, "replies": []}, {"body": "This guy always plays second fiddle? Cofounder? Why not founder?", "score": 1, "replies": []}, {"body": "Peloton uses them as their credit provider for their equipment.", "score": 1, "replies": []}, {"body": "Not Thiel though? I gotta stick with PLTR on this one.", "score": 1, "replies": []}, {"body": "I'm sold on all PayPal mafia.", "score": 1, "replies": []}]}
