{"title": "If you take that inflation-adjusted graph and draw a line connecting the bottoms, then a horizontal line to find the upcoming bottom .. yep, boys, we're going back to 1995 levels which is about 1000. BUT, adjusted for *current* inflation, I get [does math] 6942.06 repeating, of course. BULLISH!", "selftext": "", "id": "vkrwil", "created_utc": 1656201764.0, "score": 69, "upvote_ratio": 0.81, "num_comments": 40, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 years ago\n**Total Comments**|38|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vkrwil)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vkrwil)", "score": 1, "replies": []}, {"body": "First time I heard inflation adjusted inflation", "score": 27, "replies": [{"body": "\"We heard you like inflation, so we got you some inflation to go with your inflation!\"", "score": 14, "replies": [{"body": "![img](emote|t5_2th52|4887)", "score": 5, "replies": []}]}]}, {"body": "I can't tell if these posts are parody or retardation", "score": 38, "replies": [{"body": "I guess I thought the parody was obvious, but thank you, I guess?\n\nOriginal post/graph: https://www.reddit.com/r/wallstreetbets/comments/vkmlb8/i\\_want\\_to\\_be\\_bullish\\_i\\_really\\_do\\_but\\_things\\_like/", "score": 17, "replies": [{"body": "Lotsa retards hang out here. You can never be too sure..", "score": 9, "replies": [{"body": "\\[nods\\] Fair.", "score": 5, "replies": [{"body": "also - not denying retardation.", "score": 8, "replies": []}]}]}]}]}, {"body": "Huh?", "score": 4, "replies": []}, {"body": "A 10.000bc to 2022 chart would be more accurate", "score": 7, "replies": []}, {"body": "I would take TA from this sub and trade on it over any small gesture of info from Jim Cramer", "score": 4, "replies": []}, {"body": "Da fuq is this a graph of? Inflation adjusted inflation? Label your vertices man", "score": 4, "replies": []}, {"body": "I see red", "score": 2, "replies": [{"body": "Yeah, I see a trend ready to go down.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "facts", "score": 3, "replies": []}]}, {"body": "“Alright time’s up, let’s do this”\n\n*goes all in on SPY puts*", "score": 2, "replies": [{"body": "At least I have chicken!", "score": 1, "replies": []}]}, {"body": "Repeating, of course", "score": 2, "replies": []}, {"body": "Needs more lines", "score": 2, "replies": []}, {"body": "I can’t not read [does math] as [does meth].", "score": 2, "replies": []}, {"body": "LOUD NOISES!", "score": 2, "replies": [{"body": "hahahahahahahaha", "score": 1, "replies": []}]}, {"body": "What a nice picture you made!", "score": 2, "replies": [{"body": "mom is proud", "score": 1, "replies": []}]}, {"body": "Inflation adjusted graph of what index? Or of what?", "score": 1, "replies": []}, {"body": "I'll never understand how people think they're going to divine something from these.  Might as well go get a psychic reading.", "score": 1, "replies": []}, {"body": "Data from the 1800s is not relevant anymore. Next time you make a chart you can probably just use the last 100 years.", "score": 1, "replies": []}, {"body": "I know this is satire, but why would you adjust for inflation twice? The initial chart already includes inflation...", "score": 1, "replies": [{"body": "I'm adjusting for inflation ... but from the future. \\[taps 5 head\\]", "score": 2, "replies": []}]}, {"body": "Wen moon", "score": 1, "replies": []}, {"body": "I say we just scrap it all and start over…bartering for food…", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Everyone comparing Venezuela hyperinflation for stuff. The Venz stock market went up 1000%’s, SPY will be $10k when USA goes hyperinflation for awhile", "score": 1, "replies": []}, {"body": "I hate to be the jerk, but those lines aren’t parallel.  Which means no 6942.069420", "score": 1, "replies": []}, {"body": "The boundary lines are conveniently way too tight.  What regression technique was used, what was the sample count, and what confidence interval was used?", "score": 1, "replies": []}, {"body": "This is a great idea however a little bit off. Since the stock market is mainly full of emotion there tends to be an over cell closer to the bottom so that line should be raised up a little bit. The reality of the S&P is that it should be closer to 2500 to 2700 range. I would say that’s about the bottom of this market for right now factoring in inflation. Given the interest rates are going to be spiking up with the next few years we are most likely going to see the market make a lateral movement rather than an immediate bounce off the bottom like we have in the past. The stock market is in a similar position to where it was in the late 60s. Also reference the 80s.", "score": 1, "replies": []}, {"body": "1 dollar 1995 is the worth approx 1.93 dollar today.\n\nSP going to drop to 2-2.5k range… great! 👍", "score": 1, "replies": []}, {"body": "Diverging lens focal point upright virtual image", "score": 1, "replies": []}]}
{"title": "JWN - Nordstrom is amazing", "selftext": "Why don’t people have this stock? In my opinion, it was the second best play besides oil, because most of their stores were closed for many months during COVID. Demand returned in a V shape, but the share price has not. They will probably have the highest amount of revenue in the history of the company. Why doesn’t anyone care? Nordstrom and Nordstrom Rack are as common AMC, but no one cares! It’s not Macy’s! Macys is more like target, Walmart, and kohls. Someone please tell me why this thing is a dog!", "id": "vkwwuf", "created_utc": 1656219290.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 36, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 year ago\n**Total Comments**|13|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vkwwuf)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vkwwuf)", "score": 1, "replies": []}, {"body": "What kind of DD is this?\n\nOne paragraph of emotion-driven speculation \n\nYou say it is undervalued but present no financial analysis and no math\n\nNo industry context or growth outlook\n\nGo home", "score": 17, "replies": [{"body": "Ok forward PE at historical lows. Revenue up, margin up, free cash flow up. Watch 👀", "score": 1, "replies": []}]}, {"body": "If inflation keeps rising, less people are likely to buy designer goods and clothing which will cause consumer spending to drop, since food and other commodities are more important. So, they won’t do that good on there earnings considering it’s not as of an essential as companies like Costco or Amazon. Also, it’s not like Nordstrom doesn’t have an online retailer. Nordstrom is oversaturated in the retail industry by other competitors in all fields. Nordstrom is competing against Macys, Saka, Kohls, BloomingDale, and GAP. And, for there off price division, they are competing against TJ Max and Amazon’s subsidiaries and other companies. I think it’s undervalued but is still very bearish", "score": 10, "replies": [{"body": "We’ll they’ve been beating because of weddings, travel, and professional trade shows. The ones you mentioned, don’t specialize in that, so I expect JWN to continue to accelerate. Thoughts?", "score": -1, "replies": [{"body": "[https://press.nordstrom.com/static-files/3fdb7dc7-24e7-4e36-ae17-6b946fc1457a](https://press.nordstrom.com/static-files/3fdb7dc7-24e7-4e36-ae17-6b946fc1457a)\n\nLooking at there quarterly earnings, they make <3% off that. It’s not the companies main net sales / profit. I think it might be a good longterm play if everything goes to normal, but fashion retailer companies do one of the worst when it comes a time of uncertainty![img](emote|t5_2th52|4259)", "score": 5, "replies": [{"body": "Very good insight. I will counter, that a lot of their competitors went out of business during the pandemic. Literally billions went away from independent shops, companies like brooks brothers, tailored brands, and stein mart. All gone. Even Zara closed almost all of their stores in the US. Folks don’t really talk about that either. I’ll be honest that I’m invested heavily, but I think I see something that many don’t see. I want to make money, but I hope others can make it too.", "score": -2, "replies": [{"body": "If those retailers like Zara are closing that amount of stores, it also might mean they don’t see the stores as that profitable even post covid19. Just look around Nordstrom and look at how much foot traffic you see, when I go there IRL, personally I don’t see a very long line compared to other retailers even though the store is in a major city and location.", "score": 2, "replies": [{"body": "If those retailers like Zara are closing that amount of stores, it also might mean they don’t see the stores and retail as that profitable even post covid19. Just look around Nordstrom and look at how much foot traffic you see, when I go there IRL, personally I don’t see a very long line even though the store is in a major city and location compared to other retailers.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Bagzzzzzzzz", "score": 7, "replies": [{"body": "Shopping bagzzz?", "score": 1, "replies": []}]}, {"body": "Before you make this play I would advise you to go to your local mall or shopping area that has a Nordstrom's and have a walk around. Get an idea of how many people go in and actually buy anything. I would bet that their foot traffic numbers have died off in recent years. There is an online part to their retail sector, but in my experience, most people who can afford expensive things and high end retail goods want to see how it fits and feels before they dish out hundreds of dollars on a shirt etc.", "score": 3, "replies": [{"body": "I think the competition aspect I mentioned will win out. Billions worth of competitors went away, but I don’t think mainstream knows it.", "score": 1, "replies": []}]}, {"body": "I like JWN also. Of course when I buy it drops so I am not sure if you want me to jump back in and when I sold some CC it jumps.", "score": 3, "replies": []}, {"body": "Lux retailers will survive", "score": 2, "replies": [{"body": "Would you buy the stock though?! It was $42 before COVID crash and in the $50s-$60s in 2018. Seems like most stocks, besides some mega caps, are going back to pre-pandemic price.", "score": -2, "replies": [{"body": "Hard to tell, they're still invested into real estate properties that are dying otherwise.", "score": 1, "replies": [{"body": "Ok, that makes sense. Maybe not now, but I do expect urban areas to rebound.", "score": 0, "replies": []}]}]}]}, {"body": "So who tf shops retail anymore if it ain't food or fireworks", "score": 2, "replies": [{"body": "Lots of folks. Last quarter of revenue was above 2019 comps. YTD JWN is crushing Amazon, Target, and Walmart.", "score": 1, "replies": []}, {"body": "To your point, it’s keeping pace with Kroger - YTD", "score": 1, "replies": []}]}, {"body": "I worked at Nordstrom and I can tell u less and less people shopping in physical location recently", "score": 2, "replies": [{"body": "Quality has declined greatly", "score": 1, "replies": []}]}, {"body": "Had puts on to $20 then sold, right after it rallied something retarded lol", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "Nordstrom is pretty high in the discretionary category isn’t it? That’s one area where you can just see that people don’t have the capacity to be doing much discretionary right now. Headed into a recession and I just don’t see it. Wish you luck!", "score": 2, "replies": []}, {"body": "It’s been an amazing company for decades, great service and products and strong revenue. Maybe they could have AI clothes?", "score": 2, "replies": [{"body": "Buying calls all day today.  Happy regarded day", "score": 1, "replies": []}]}, {"body": "Their quality has gone downhill.   It’s not any better than Macy’s now.", "score": 1, "replies": []}, {"body": "Forgot about the girls again. Son of a bitch. Yeah ok, that's my bad. So si?", "score": 1, "replies": []}, {"body": "u/SouthbayLivin did you get the bump you needed to be in the green?", "score": 1, "replies": []}, {"body": "He was early", "score": 1, "replies": []}]}
{"title": "I want to be bullish, I really do. But things like this make it hard. Inflation-adjusted S&P w/ straight with my favourite pickup line in it. Notice that it doesn't work 99% of the time", "selftext": "", "id": "vl1ocl", "created_utc": 1656238918.0, "score": 24, "upvote_ratio": 0.63, "num_comments": 32, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 month ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vl1ocl)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vl1ocl)", "score": 1, "replies": []}, {"body": "Looks like that black line has preeeeetty good support potential. ![img](emote|t5_2th52|4887)", "score": 16, "replies": []}, {"body": "The people always putting up charts are the ones with the least amount of money here", "score": 11, "replies": []}, {"body": "Ah yes let's just randomly draw a line here.\n\nAlso is it my time to repost this tomorrow ?", "score": 7, "replies": [{"body": "With a random inflation adjustement that will make the overall trend U-shaped, yes you can.", "score": 1, "replies": []}]}, {"body": "So we got robots or some dickhead holding puts tryna repost the same fuckin bs graph over and over again.\n\nFuck off", "score": 3, "replies": []}, {"body": "Have you tried dragging the line higher?\n\nCould show an undervalued market!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Hopefully not 1879", "score": 3, "replies": []}]}, {"body": "So you're telling us there's a chance the bulls will get laid? All in SPY Dec 500c", "score": 2, "replies": []}, {"body": "1880? Really?", "score": 2, "replies": []}, {"body": "WOW. Another chart with a line on it.", "score": 3, "replies": []}, {"body": "Listening to 20yr olds talk about “holding for 30 years” makes me laugh. I’m curious if DCA narrative will remain if we enter a multi year long bear maket. 1930-1960 was a long hold. With the impatience development tech causes, I’m doubtful these degenerates can hold longer than 6 months.", "score": 3, "replies": [{"body": "Every investing forum for the last ten years saying “If you don’t sell you don’t lose” lmao", "score": 1, "replies": [{"body": "Hey it’s only the longest bull run in history, but sure let’s use that as credibility. You should study what happened to japan’s stock market. Then you should yolo your account and invest it all tomorrow and DCA because someone else says it was a good idea.", "score": 1, "replies": []}]}]}, {"body": "Don’t be fooled. Any one who is bullish right now is just coping", "score": 4, "replies": [{"body": "Or was born more than 10 years ago.", "score": 2, "replies": []}]}, {"body": "Wow, that Y axis is awefull", "score": 1, "replies": []}, {"body": "Just try the pick up line for twenty more years and you will be fine. Women love persistence.", "score": 1, "replies": []}, {"body": "[UPDATED GRAPH](https://ibb.co/cQBwQ6v)  \n\n\nJust draw more lines and chill", "score": -1, "replies": [{"body": "Doing lines and chill*", "score": 4, "replies": [{"body": "Now that's a pickup line that will work", "score": 2, "replies": []}]}]}, {"body": "I don’t understand what you did here… did you warp the y axis until the line got straight?  Go finish eating your oatmeal", "score": 0, "replies": [{"body": "There's a meme flair for a reason", "score": 0, "replies": []}]}, {"body": "Just keep zooming out until it does.", "score": 1, "replies": []}, {"body": "With a time frame like that your thesis could be right and it wouldnt matter be you bull or bear", "score": 1, "replies": []}, {"body": "One out of 100 aint bad...", "score": 1, "replies": []}, {"body": "That's right", "score": 1, "replies": []}, {"body": "Except 1930 I don't see this chart giving a buy signal. And the Concept of s&p can't go that far back in time. And is it inflation adjusted? This graph tells you nothing. So buy the dip. Take the risk. You are going to die in 40 years anyway.", "score": 1, "replies": []}, {"body": "I don’t get why this is bad. If this is the inflation adjusted price and it’s always moving up, then it’s always beating inflation…\n\nIt falling below the diagonal just means it’s beating inflation at a rate that’s less than its mean average…\n\nLooks like a healthy linear growth.", "score": 1, "replies": []}, {"body": "God I hate all these dumb af graphs with a random line that keep getting posted. There is no correlation here", "score": 1, "replies": []}, {"body": "That is a very interesting chart. So, the inflation adjusted s&p is now at the same level that it was at in 2000 and 1929.", "score": 1, "replies": []}]}
{"title": "I’ve solved it. And I did it while you morons are out here drawing straight lines on pictures of crooked lines. The last DD you’ll ever need.", "selftext": "I won’t waste time presenting you regards with too many facts that you’re small minds can’t handle, so here’s the brief background. While y’all were busy figuring out how to zoom in and out of graphs online I was busy mastering the blade and honing my knowledge of astrophysics. Then in the middle of perfecting the final kata of the Hiten Mitsurugi-ryū style to slay my master my minds eye opened and I saw it all. (That’s the end of the background).\n\nSo we all know inflation is hitting hard by now, but so few truly see the big picture. The why. What if I told you to go back to 2008? You’d immediately think Obama and the recession, but you’d only be half right. You’re thinking of the wrong Obama. It all starts and ends with Michelle. \n\n“That’s truly retarded” you say, but I’m way past retarded. I’m wearing a bright yellow helmet to bed at this point. You see it starts with her and her one goal. She never hid it. In fact she always left it right there in the open because she counted on y’all being too stupid to see it. War on the fattys.\n\nShe saw in 2006 the recession was coming and knew it was her time to strike. She’d been planning it for decades. She’d positioned herself perfectly and was ready to strike with her good friend Jerome Powell. You morons never wondered why a democrat would nominate a republican to the federal reserve? You blind silly stupid fools. \n\n“How could they possibly be connected?” you ask. Well now we’re getting somewhere. It’s obvious, they both graduated from Princeton. That’s it. There doesn’t need to be more. Occam’s razor.\n\nSo back to 2008 and the war on the fattys. The housing market had collapsed and we were at the bottom with the first black president. No one would have any more room in there primitive minds to think about fighting for the true tendies. The fried and edible kind. She started slow, removing soda from schools and slowing progressed to the most draconian measures possible to destroy your precious BMIs. She believed by attacking our children we’d all be living in her hellscape of pelatons and unsalted asparagus by the end of the presidency. \n\nBut then something she didn’t count on. The rising stock market gave people more money to buy more tendies. And without homes they had nowhere to cook so they fled in droves to holy places of McDonald’s and Chick Fil A, the last bastions of true American freedom.\n\nShe was distraught with such a stupid miscalculation. How could she not have seen this? Then she realized an evil truth. She had unwittingly defeated herself by coming out of the recession. The key to destroying the fried life blood of American goodness was the recession itself.\n\nThat’s when she had to go back to her secret confidant Powell and they decided no more half measures. They needed someone in the place of power. She used her husband’s marionette presidency to get Jerome to the Fed. Then it truly began.\n\nThey sent the stock market to the moon and created this internet fad of calling money “tendies” because of what it could buy. They were removing the gold standard right in front of your regarded little eyes as you slowly forgot why you even wanted money in the first place. Of course it would be too obvious if they wholly replaced the true tendies with the fake green vegetable colored ones, so the created the Trump diversion. She had learned from the 08 recession and subsequent rise that sometimes you had to do the exact opposite of what logic would dictate to get the results you want.\n\nThey would give us what we need to the most extreme extent. Money flowing like water and tendies of every form rose out of nowhere. A holy land where there was a Canes’s, Layne’s, Golden Chick, Popeye’s, KFC, Wendy’s, and every other form of fried chicken on every street corner in America. We were fatter and happier than ever before, but we went too far.\n\nShe used a rare walrus virus to kill all the old people and intelligent citizens who knew not to get vaccinated or where masks. With the smart ones out of the way she and Powell were free to print trillions and inflate the market as high as they wanted.She then used Elon’s space lasers to hack the voting booths and get Biden in and that was that.\n\nNow the plan cannot be stopped. We’re all too fat and there is no one smart or strong enough left to roll us to streets to fight back. It started with gas. When no one can afford to drive we’ll be forced to walk and ride bikes and all other forms of torturous exercise. Of course it doesn’t matter for most of us because the trump years have all but guaranteed enough artery cloggage to ensure widow maker heart attacks. But our children will grow up thinking this tyranny is how it’s always been.\n\nThen it was the corn and wheat. With cost rising and food replenishing they have started making smaller portions. You’ve all seen the “double stuffed” Oreo and “thick cut” bacon posts. She’s in control of the manufacturers so of course the packaging won’t change as she feeds you less and less. \n\nSlowly she took our true tendies as we were distracted worrying about the fake tendies. Soon our kids will only know Kale chips and Sevia poisoned Flint water. We are a victim to our own arrogance.\n\nI could on, but it’s pointless. Michelle has won. Thanks Obama.\n\nTLDR: Michell Obama is behind the recession to continue her unholy war on the fattys. \n\nPositions: \nSPY 350P 9/16\nPTON 300C 9/16", "id": "vla6mi", "created_utc": 1656265584.0, "score": 37, "upvote_ratio": 0.74, "num_comments": 35, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|26|**Previous DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vla6mi)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vla6mi)", "score": 1, "replies": []}, {"body": "This is truly regarded.", "score": 29, "replies": []}, {"body": "You had me at Occam's razor.", "score": 14, "replies": []}, {"body": "This was more better than I thought", "score": 10, "replies": []}, {"body": "Please take all unbabying talk to another subreddit. No one wants r/wallstreetbets to become a political hellhole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}, {"body": "How could we not see this all along?", "score": 11, "replies": [{"body": "Because we were into the orange 🍊 for too long! Lol", "score": 1, "replies": []}]}, {"body": "Thank you for the TLDR", "score": 10, "replies": []}, {"body": "To many words have drawingmaybe a meme?", "score": 3, "replies": [{"body": "Exhausting shitposts are the way", "score": 2, "replies": []}]}, {"body": "Amazing. Bravo sir. Brilliant.", "score": 4, "replies": []}, {"body": "Shitpost without a single trace of humor whatsoever. Great job", "score": 10, "replies": []}, {"body": "There is something to be said here", "score": 3, "replies": []}, {"body": "It’s stevia you pachygyric ape", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|12787)", "score": 3, "replies": []}, {"body": "seems legit", "score": 5, "replies": []}, {"body": "Damn fat ppl ( Oh shit , I'm fat)", "score": 4, "replies": []}, {"body": "Pfft… I have been calmly screaming this 1987! Did you never find it “odd” that Mr. Greenjeans was a much more beloved than Captain Kangaroo? It’s like green lego blocks paving the dance floor for the Lindy!", "score": 2, "replies": []}, {"body": "Peanut butter will save you. Hi-pro Carbo. We can win.", "score": 2, "replies": []}, {"body": "Obesity has clearly won this war.", "score": 2, "replies": []}, {"body": "*hits blunt", "score": 2, "replies": []}, {"body": "Wait so it's not a man??", "score": 2, "replies": []}, {"body": "any mental health doctor in the room?", "score": 2, "replies": [{"body": "Where we're going we don't need mental health..", "score": 2, "replies": []}]}, {"body": "Wen moon?", "score": 2, "replies": []}, {"body": "What ya smokin?", "score": 2, "replies": []}, {"body": "Who read the entire post?", "score": 0, "replies": []}, {"body": "Every single trending post here is shit. Luckily, I know what to do.", "score": 0, "replies": []}, {"body": "I read this whole goddamn thing but I still don’t know what I’m supposed to buy calls or puts on.", "score": 1, "replies": [{"body": "Then you get it.", "score": 1, "replies": [{"body": "Yep.  I do.  \n\nI’m supposed to fill out an application for a part time job at Wendy’s.", "score": 1, "replies": []}]}]}, {"body": "I see your positions but I see Pelaton (sp?). So, buy PTON? What kind of cryptic investment bs advice is this?", "score": 1, "replies": [{"body": "Michelle wants us skinny. The bike will take us there.", "score": 1, "replies": []}]}]}
{"title": "DTE on swing trade after market drop", "selftext": "Hey guys.  I know most people in this sub like to swing 0 DTE or less than 1 week DTE on meme stocks but I want to get everyone’s insight on the following:\n\nAfter SPY drops, the VIX is higher so if I buy long dated calls “when it settles”, odds are that I’d get crushed by IV.  Aside from hedging against volatility, have you all found that there’s an optimal DTE that allows big moves while not getting IV crushed or getting destroyed by Theta?\n\nScenarios:\n\n1) If you go less than a week DTE, you get destroyed by thetagang\n2) if you go long dated (6 months) Vega is higher so IV crush\n\n\nThe gist of my question is ultimately: what DTE gives the best balance of theta and vega for a solid swing trade after SPY drops and settles?\n\nCurious to get your perspectives.  Thanks.", "id": "vlcvmm", "created_utc": 1656273131.0, "score": 7, "upvote_ratio": 0.73, "num_comments": 37, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|10 seconds ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vlcvmm)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vlcvmm)", "score": 1, "replies": []}, {"body": "Buy 0DTE and you'll be fucked, sell 0DTE and you'll be fucked too", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4260)", "score": 8, "replies": []}]}, {"body": "You can also do a VIX put or UVXY put to profit from IV dropping.", "score": 4, "replies": [{"body": "True.  I guess I’m mainly trying to maximize the swing play itself aside from other ways to hedge", "score": 2, "replies": [{"body": "There’s also selling cash-secured or naked puts haha. Probably not degenerate enough though.", "score": 3, "replies": [{"body": "Haha, I already do some thetagang activities (thanks for the money guys lol) but I also want to combine that with playing the price action for maximum tendies", "score": 3, "replies": []}]}]}]}, {"body": "DTE comes with other numbers than 0? Who knew?", "score": 4, "replies": [{"body": "Lol imagine my shock when I found out", "score": 2, "replies": []}, {"body": "Does DTE not mean Days Til Entry?", "score": 0, "replies": []}, {"body": "Ye there’s 1 too", "score": 1, "replies": []}]}, {"body": "Just short the vix and be a lot safer. Shorting gives you 2x leverage so if you short $2000 only costs $1000. When the vix drops back down 20-30% your profit on the $1000 you put up is actually 40-60%", "score": 2, "replies": [{"body": "Seeking clarification to your post: which stock ticker to short VIX - UVXY? Or are you suggesting to short via puts on VIX/VIX-CBO?", "score": 3, "replies": [{"body": "This", "score": 4, "replies": []}, {"body": "Short the vix, as in shares no options", "score": 1, "replies": []}]}]}, {"body": "i personaly go for 3 months out, works out pretty well for me, opened a call position friday on biontech with a target of 160$", "score": 2, "replies": [{"body": "Thanks for that.  Do you do the same with SPY?  Also, what kind of delta are you looking at?  I know 3 months out is relatively safe from a theta perspective but how much volatility crush are you seeing in a swing trade?", "score": 2, "replies": [{"body": "yeah would also do this on spy, i look for a delta of around 0,60-0,70 so yeah pretty high delta imo. my trade on biontech has a delta of 0,34 but i'm pretty shure it hits the price target, because of that double bottom on the chart", "score": 2, "replies": [{"body": "That’s gotta be expensive.  I like being out of the money cheapies (0.10 delta) but I buy multiple so instead of one 0.60 delta, I’d rather buy six 0.10 deltas.  Not sure if the Greeks favor me in that scenario or not..l", "score": 1, "replies": [{"body": "yeah also a good methode if you ask me, you can make more profit, but if you set your stoploss like 5-10% at buy in you will fastly be knocked out on your play if the trade doesn't start in your favours at the first day/days", "score": 2, "replies": [{"body": "Stop loss?  What is that? Lol jk. For these swing trades, I’m betting small amounts so I don’t protect them", "score": 2, "replies": [{"body": "then i would also go for a 0.10 delta for example to maximize the gains", "score": 2, "replies": [{"body": "For sure.  I’m just trying to get that perfect DTE so I can load up as cheaply as possible without getting destroyed by theta", "score": 1, "replies": [{"body": "i know it has nothing to do with your question, but biontech is up 6.4% by open in germany LETS GOOO", "score": 2, "replies": [{"body": "Nice.  Congrats!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Buy options during breakouts not when market is consolidating", "score": 2, "replies": [{"body": "Thanks for your response.  With that, are you going short dated or longer dated?", "score": 2, "replies": [{"body": "I trade micro ES futures. The greeks don’t matter to me since futures only depend on price. When I do SPY options I do 0/1 dte with lotto tickets expecting breakout.", "score": 3, "replies": [{"body": "Ahh got it.  I guess I’m trying to be more conservative because if it doesn’t move, I’m going to lose my premium.  Thanks!", "score": 2, "replies": [{"body": "That’s why you look to buy at breakout", "score": 2, "replies": []}]}, {"body": "Do you trade E-Mini ES futures on Schwab or interactive broker?", "score": 2, "replies": [{"body": "TD Ameritrade", "score": 3, "replies": [{"body": "Oof them fees", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Got to be a same day In and Out option play ![img](emote|t5_2th52|8881)", "score": 0, "replies": [{"body": "Lol nobody here buys anything beyond a day huh", "score": 3, "replies": []}]}, {"body": "Just run 0dtes on spx ull b better off", "score": 1, "replies": []}, {"body": "You can always try 0DTE debit spreads to mitigate vega.", "score": 1, "replies": []}]}
{"title": "Buying tech is literally the best thing you can do atm PART 2", "selftext": "So listen up you impressionable tiktok video reposting grandma's pension stealing scrawny ass no pushups 100 year spy bearish chart to gdp interest rate powell red hot babe fomc meeting 2439 trades this year for 0.01 profit meme posting zoomer degens \n\nBack in part 1 I said that tech (faang) is cheap and going to breach its ATH when everyone calms down from the mess (rate hikes, war, oil, covid, inflation)\n\nWell since then everything  became \"more cheap\" and \"more mess\" has surfaced, here's a brief update \n\nOld mess\n\nrate hikes priced in (still believe SPY year end in the green)\n\nwar priced in (Everything is stalled out and I believe that we will have war end by the end of the year, also a catalyst for SPY) (puts on Lockheed martin)\n\noil priced in (gonna fall by the year's end as production has already ramped up and 180$ oil calls not printed)\n\nCovid gon (sigma male variant not yet priced in so that might still cause some problems(but prob not))\n\nInflation (the rise of it has slowed down considerably and in my case it will fall cuz everyone's talking about it)\n\nSo now the \"new mess\" \n\nRecession talk - you know that it's already priced in and there has never been an instance when everyone knew and talked about it before it actually happened, so yeah it might be hard to believe but the economy is still strong (LEI)  and we are in for a massive bull run by year's end \n\nRemember the quote? \"When everyone's scared shitless, buy OTM calls on SPY\" - Warren Buffet\n\nHouses? bro you dont even own one and never will why do you care just go live behind a dumpster and execute trades from your 2012 lenovo laptop with macdonalds wifi\n\nsummarized, strong economy (Leading economic index), Everyone scared shitless, obvious correction (look at 2018,1998,2012) Strong yield curve (10 year vs 3 month)- these are the variables you need\n\nTL:DR Buy FAANG stocks or leap arkk calls if youre a chad\n\nDisclaimer : fuck you this is not financial advice in reality im buying leap otm spy puts expiring in 2029 cuz we in for the great depression of zoomer age\n\nCurrently holding 3 AAPL, 4 AMD, 1 COIN, 4 FB, 1 MSFT, 2 NVDA at -22% ytd, my gf also left me and im back on the grind writing DD's", "id": "vle0zp", "created_utc": 1656276390.0, "score": 14, "upvote_ratio": 0.59, "num_comments": 38, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|4 months ago\n**Total Comments**|13|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/t55lcz/buying_tech_is_literally_the_best_thing_you_can/) \n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vle0zp)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vle0zp)\n    \nHey /u/Buddaxkebab, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Facebook:  they will see a massive decline from their core source of revenue- small business advertisements.  Think about how much the little mom and pop shop will be hurting when the fed funds rate is 7% because historically inflation has never gone down until FFR is above it.\n\nThe rest: Netflix, maybe, but competition is only getting stronger.  Apple - too complex, too many different sources of revenue to analyze but with potential issues with China (say they decide to give Taiwan a go), it’s a risk still at these levels.\n\nAmazon - way overvalued at these levels because it’s still trading like 50% higher than the S&P multiple.\n\nGoogle - same as FB, but I like them the best.\n\nIf we’re talking about undervalued gems in the large cap space I’d go with QCOM or NVDA. The former is trading at single digit forward multiple and irc growing at 20-25% a year still, and has a dividend.  The latter - beast growth, potential monopoly in a few years.\n\nEdit: “economy is still strong” is backwards looking.  You can’t say priced in for whatever data points you like and then give that as a bullish reason.  Unemployment looks to reverse course - if we see even 6% by December then good luck to your thesis.", "score": 20, "replies": [{"body": "Completely wrong on AMZN and Google. Source; you’re a dumba..", "score": 10, "replies": [{"body": "Amazon was flat long before the split.  Fuel supply, unionization Will hurt its earnings further. Now that other retailers have caught in to next day delivery, they have lost some of that dominance. Getting involved in politics doesn't help-  50% of the market will go elsewhere if services the same .   Once was on my wish list, now on my Phew, glad only exposure is some ETFS", "score": 3, "replies": [{"body": "The guy calls me a dumbass for not being bullish on Amazon, a stock (like you said) that was flat for 18 months prior to the start of the bear market when it’s peers went up 40%, and offers no reason as to why he’s bullish.  Classic emotional WSB regard", "score": 4, "replies": []}, {"body": "AWS is a beast that will continue outperforming. In terms of its on line retail business, they will bounce back. Amazon is the premier online retail stop, AMZN will finish the year in the 130+….not bad considering I bought in the low 100’s 🍻 bozo", "score": 2, "replies": []}]}, {"body": ">still trading like 50% higher than the S&P multiple.\n\nNever trust anyone who only throws multiple as a solid argument. lol", "score": 2, "replies": []}]}, {"body": "Qcom is my baby", "score": 2, "replies": [{"body": "I worry about the double ordering", "score": 1, "replies": []}]}, {"body": "Google literally is the gateway to the web and the word for \"search\" people don't know google is a search engine or that alternatives exist they literally think there is only \"googling\" you can't break that mentality for generations", "score": 2, "replies": [{"body": "Xerox was also a verb once. Replacing copy.  Could you XEROX this for me.", "score": 7, "replies": [{"body": "only in the states", "score": 0, "replies": []}]}, {"body": "And 8.6% inflation with fed funds rate at 5-7% (next year) helps Google how, from this point", "score": 2, "replies": []}]}, {"body": "Bank won't loan to mom and papa", "score": 1, "replies": []}, {"body": "“Google- same as FB” How can you even say that 😂😂😂", "score": 1, "replies": [{"body": "It was a very short sentence, but yeah, they face similar headwinds: small business spending is their biggest source of revenue - you think that’s gonna look rosy for the rest of the year?\n\nBut also don’t omit what I said - I like them best. Their cloud business can offset a lot of that revenue, their AI/ML tech is on a different level than FB, and they don’t have a dying platform as their main source of revenue the way META does (FB)", "score": 1, "replies": []}]}]}, {"body": "Got it…\n\nTHE BEST THING YOU CAN DO 2…\n\nELECTRIC BOOGALOO \n=", "score": 7, "replies": []}, {"body": "SOFI tech or bank or ???", "score": 2, "replies": [{"body": "neither its a \"Meme\" stock", "score": 2, "replies": [{"body": "With assloads of cash", "score": 1, "replies": []}]}, {"body": "Ally Bank looks very promising at like a PE of 4", "score": 1, "replies": []}]}, {"body": "AAPL will hit 200 this year", "score": 3, "replies": [{"body": "I didn't know they had a reverse split scheduled.", "score": 18, "replies": []}]}, {"body": "Lol you hold coin, i do aswell i wish i invested it in wish rather..", "score": 1, "replies": []}, {"body": "if google goes below 1.5k and Microsoft below 180 then I'd invest in those 2 buy ur fucking insane if you think that they're good rn. Also meta could be a good play cus they're monopolizing the metaverse but only if you buy stock and plan on holding for the next 10 years(it's a gamble but would pay out good imo).", "score": 1, "replies": [{"body": "Unless metaverse fails. Look at the way NFT’s are going, for example, what once looked to be the hottest new thing.", "score": 1, "replies": [{"body": "yeah it's a 50/50", "score": 1, "replies": []}]}]}, {"body": "NVDA… that’s the next Trillion $ co. No cap on their growth", "score": 0, "replies": []}, {"body": "I was all about the intro, kept me intrigued. Then you placed covid as a factor of worry. Stopped reading. Covids gone. Stop bringing it up. It's got as much affect on the market as that girl who pooped the bed", "score": -5, "replies": []}, {"body": "DCA Apple, sell FB on any rallies- it’s dead", "score": 1, "replies": [{"body": "It’s a long term play, I wouldn’t consider it dead by any means. It will be trading in the 200-220 range end of year", "score": 3, "replies": [{"body": "Time will tell", "score": 1, "replies": []}]}]}, {"body": "So tech is valued by multiples. Risk free rate going up for foreseeable future (re: jpow \"fuck your calls\"), and you say tech is cheap?\n\nThe stick by which they are measured against is literally getting lomger..........", "score": 1, "replies": []}, {"body": "Also elections", "score": 1, "replies": []}, {"body": "Recession not priced in. I think GOOG is a buy at any price.", "score": 1, "replies": []}, {"body": "Bro posted this again lol", "score": 1, "replies": []}]}
