{"title": "'Don’t see a hurricane, but the risk of recession has gone up\", says Fed’s Loretta Mester", "selftext": "Read full article: [https://www.cnbc.com/video/2022/06/03/the-fed-is-in-the-process-of-recalibrating-to-get-to-2-percent-goal-says-cleveland-fed-president-loretta-mester.html](https://www.cnbc.com/video/2022/06/03/the-fed-is-in-the-process-of-recalibrating-to-get-to-2-percent-goal-says-cleveland-fed-president-loretta-mester.html)\n\nFederal Reserve’s Loretta J. Mester says the risk of a recession has gone up. The S&P 500 (SPY) is down 14% so far this year. \n\nIn case of a recession, how much further do you think SPY might sell-off?", "id": "v6a3oq", "created_utc": 1654539983.0, "score": 57, "upvote_ratio": 0.85, "num_comments": 38, "comments": [{"body": "Feds won't see a hurricane unless it rips their roof off. Even then it'd be transitory ...", "score": 72, "replies": [{"body": "It is fine. This is just a transitory hurricane.", "score": 16, "replies": [{"body": "I mean.. they are technically transitory kek", "score": 4, "replies": []}]}, {"body": "I mean a hurricane is technically transitory lol", "score": 5, "replies": []}, {"body": "Just need to financially nuke it.", "score": 4, "replies": []}]}, {"body": "SPY easily -15%.   QQQ perhaps more.", "score": 20, "replies": [{"body": "yeah im -20% more on spy.  -25% or more on QQQ", "score": 1, "replies": []}, {"body": "For the year? Isn’t SPY down like 3%?", "score": -2, "replies": [{"body": "2022- year to date SPY loss has been -13.43%, QQQ (top100 SPY) YTD loss is -22.9%. -20% is an optimum rtn estimate for the entire year on SPY.", "score": 2, "replies": []}]}]}, {"body": "Everything is just speculation at this point, and we're seeing some really strong support right now, but I see several scenarios where SPY ends the year at 300 before recovering. Stay safe everyone!", "score": 20, "replies": [{"body": "Can you list these scenarios? I’m intrigued if they back up my own research.", "score": 7, "replies": []}, {"body": "I disagree, I think if it drops hard it’ll be by the end of Q3. I still see upwards movement by end of year. QT should reveal the imminent drop sooner than later.", "score": 3, "replies": []}, {"body": "It doesn't matter if we see a strong support for SPY, if we were to enter a recession, which is dependent on economic factors, SPY will tank.", "score": 7, "replies": [{"body": "Have recessions historically always resulted in the S&P “tanking”?", "score": 7, "replies": []}, {"body": "We have a very strong market.\n390K people found job the previous month only, as per official data. \n\nYou don't enter recession with those numbers.\nIf companies keep hiring it means the expect their sales to grow, otherwise would not bother to hire and spent money and time to train their new employees. \n\nRecession is on the way but it will take few months or even quarters.\n\nOnce companies stop hiring new people this will be major sign that recession just knocked our door.", "score": 2, "replies": [{"body": "Aren’t we seeing that? Apple keeps the number of new iPhones flat this year and we have several hiring slowdowns in tech companies.\nRetail chains notice the shift from non-essential to essential goods.\nSo the signs are pointing to difficult times,  combined with the fact that we will see several rate hikes the likelihood of a recession is definitely high.", "score": 4, "replies": [{"body": "Everyone agrees that likelihood of recession is  high.\nThe problem is that no one knows when will happen.\nIs it at Q4 this year? Or Q2 next year.\nThis is very important since will decide how many bear rallies will have the following months.\n\nYou see the pattern already. One report is coming with not disasterous numbers and everyone turns bulling saying the worst is behind us, inflation is peaking, soft landing etc.\n\nAnd markets rally like its 2nd half of March 2020.\n\nAnother report is coming with disasterous numbers and suddenly \"its the end of the world and capitalism, we are all going to die etc\".\n\nAnd markets plunge 7 weeks in a row.\nThe fastest this recession happens the sooner will find the bottom and start climbing back. \nBut if jobs market remain strong (which means that companies keep hiring) may delay the inevitable for many months.", "score": 2, "replies": [{"body": "Now I understand your point, and fully agree with you. You are right, it could very well be that we will have many bear rallies month after month until the job market starts to weaken significantly.\n\nThe market is incredibly reactionary the last few months and highly sensitive to any report that is released, which makes me even more concerned about the future.", "score": 3, "replies": []}]}]}]}]}, {"body": "Do you mean 3000? S&P at 300 would take us back to late 80’s valuations.", "score": -1, "replies": [{"body": "I pretty clearly said SPY, the ETF that tracks the S&P 500.", "score": 20, "replies": []}]}]}, {"body": "I wouldn't concern yourself with figures. The market will drop, and then it will climb in value. It's not possible to time the market. As the old saying goes, *time in the market beats timing the market*.\n\nWhile I am of the belief that a recession is inevitable, I don't believe it'll be The Great Recession all over again. The systemic problems that contributed to that terrible time period aren't present today. While inflation is out of control, other economic factors remain strong. This recession, if and when it occurs, is far more likely to be your garden variety recession.", "score": 10, "replies": [{"body": "Yep.  2008 really scarred people.  Now everyone thinks “recession” means a systemic failure where millions of jobs are lost in a matter of months.", "score": 15, "replies": []}, {"body": "With all due respect, you don’t know that for sure.", "score": 16, "replies": [{"body": "You're absolutely right, but the warning signs aren't there like they were prior to 2008. There are no indicators that would lead me to believe at this time we're headed for a catastrophic recession.", "score": 13, "replies": [{"body": "They’re probably all new fun ones that won’t be obvious until hindsight.", "score": 8, "replies": []}]}]}]}, {"body": "why is a risk when just about every american feels it right now.\n\njust admit it.", "score": 2, "replies": []}, {"body": "I’m sorry but all this recession talk is BS lol you really think the fed will warn you of a recession if it’s really coming now?! Lmaooooo.  We still need 2 negative quarters of gdp to prove a recession then the market will top and then recession imo. Let’s not forget mid terms this November.. they will pump the market", "score": -7, "replies": [{"body": "They will kill the market to reduce the inflation. To win the election they need lower inflation number not higher stock market. Mid, low class won't vote for democrat if inflation is still around 8% by sep, oct.", "score": 10, "replies": [{"body": "> They will kill the market to reduce the inflation. To win the election they need lower inflation number not higher stock market. \n\nUh… you do realize the Fed isn’t elected right?  And they’re independent. So who’s “they”? Why would the Fed give a fuck about the midterms?", "score": -4, "replies": [{"body": "Biden already tries to blame inflation on Fed. That is why he met Jpow.  Government will put more pressure on fed if inflation does not come down before the election. They (government&Fed) will crash the market if they need to. All up to them. \n\nIf you think Fed is independent, you are naive.", "score": 8, "replies": [{"body": "Oh I’m naive? Pretty sure I’ve spend more time working in finance than you have. Explain how Biden can pressure the Fed?", "score": -4, "replies": []}]}]}]}, {"body": "You know we just had back to back quarters of negative GDP right", "score": 5, "replies": []}]}, {"body": "why would anyone from the fed spook the markets by saying the next recession — the one they’re creating — is going to be a disaster? they’ll do anything the keep markets high, as evidenced by two years of unlimited QE and subsequent record-high inflation that we’ve yet to see peak?", "score": -1, "replies": []}, {"body": "To the OP - 20% more down (on Spy) from 415.  So... 332.  Thats my low.\n\nthe most recent -14% on SPY I call a correction to where SPY \"should\" be if we didnt have the excessive cash injection this last 2 years.  \n\nNow we can start dropping properly and enter a recession.", "score": 1, "replies": []}, {"body": "As if I'm going to listen to the generation that failed math talk about the economy lol.", "score": 1, "replies": []}, {"body": "Just get used to 5% inflation.\n\nBiden already called Powell into the principal's office and there is no way that rate increases won't be at least slowed as credit markets tighten.  TA's that show an S&P below the early 2020 peak will apply pressure on politicians to deal with the issues in a severe way.  We will see chop until November unless this is botched and the risk of botching is high.  As such, the attempted balance to get to 2-2.5% core CPI will require compromise with slowing monetary velocity.  \n\nBasis rate will end up lower than they want, inflation will end up higher than they want because at some point the 401s say uncle.\n\nThe only real wildcard is unemployment imo.  Unemployment will likely have to compromise upward as well.  Because even modest rate hikes will flush zombies, particularly in the Russell 2K.  It's already happening in biotech.  VC is drying up.  And biotech is pretty damned speculative.  So where does unemployment end up?\n\nWe are at 3.6% and a still lower-than-prepandemic participation rate.  The Fed will try to appear concerned when unemployment ticks up in the July and August job reports.\n\nSo if you take the current basis rate and look at two more .5% rate hikes we are probably looking at a basis rate of 1.75-2%.  Kashkari and Brainard will insist that is above neutral.  \n\nThe attempt will be to keep the S&P above 4k prior to November.  So inflation will be elevated and we will probably see another whipsaw downward then back up in October or September.  After that who the hell knows.  \n\nTrump was dovish but there's vast discrepancies between the rest of what I expect the Republicans to think.  And that's another wild card because Congress has more influence than even the Fed.", "score": 1, "replies": []}]}
{"title": "DOW JONES. Last month candlestick ended with a doji which means investors are mixed for the next move and it also closed above the psychological trend line. what's the next move for the Dow?", "selftext": "", "id": "v62t9y", "created_utc": 1654519867.0, "score": 30, "upvote_ratio": 0.77, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 day ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v62t9y)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v62t9y)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 34, "replies": [{"body": "Someone got ahold of the tenet algorithm.", "score": 5, "replies": []}]}, {"body": "It will definitely go up or down", "score": 20, "replies": [{"body": "Always sideways for me...", "score": 3, "replies": [{"body": "Ah yes, the perfect way of destroying option premium. Market makers always win :/", "score": 2, "replies": []}]}]}, {"body": "Theta will win", "score": 3, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "You mean the skewed CPI numbers. Certainly they won't skew them even more since it wouldn't be beneficial for the fed if it got worse.", "score": 7, "replies": []}]}, {"body": "Pump until Thursday and dump on Friday", "score": 2, "replies": []}, {"body": "The Dow is firmly headed to the 8000 to 12000 point level.", "score": 2, "replies": []}, {"body": "A bullish candlestick pattern AND a Ichimoku bullish cross over? Consider myself all-in, one line crossed the other one.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/b1varg/potential_spy_bets_the_above_references_an/eioeh3n/)*", "score": 2, "replies": []}, {"body": "Ahh yes. Those are lines indeed", "score": 1, "replies": []}, {"body": "Pump", "score": 1, "replies": []}, {"body": "DOWn", "score": 1, "replies": []}, {"body": "I think my bf saw that video the one with the candlestick in the dojo somewhere on a porn website", "score": 1, "replies": []}, {"body": "Down", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "Too much negative sentiment... Probably six months before we see major corrections", "score": 1, "replies": []}, {"body": "Who is dow jones? WE MUST SAVE HIM", "score": 1, "replies": []}, {"body": "I think it might go up so obviously it will go down. Or is the other way around? Hmm..", "score": 1, "replies": []}, {"body": "Let me pull my crystal ball out of my ass and I’ll tell you.  One moment please.", "score": 1, "replies": []}, {"body": "It looks like Pluto is in Uranus and Mickey is pissed.\n\nPlease post some more astrology charts for me to interpret.", "score": 1, "replies": []}, {"body": "Ok", "score": 1, "replies": []}, {"body": "The homeland has truly fallen.", "score": 1, "replies": []}, {"body": "[how much does he pay you? ](https://i.imgur.com/TfuiXO4.png)", "score": 1, "replies": []}, {"body": "straight down.", "score": 1, "replies": []}, {"body": "What kinda goofy tv chart is that? It's going down dudes. Big time buying opportunities to come.", "score": 1, "replies": []}, {"body": "Inverse to gas", "score": 1, "replies": []}, {"body": "Chart analysis without flow analysis is useless", "score": 1, "replies": [{"body": "Flow on a monthly Dow chart tho? I mean I guess…but safe to say there’s volume", "score": 1, "replies": []}]}, {"body": "Lower. Imagine it were a bit monthly chart. Basically an evening star doji pattern with confirmation candles.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "v6etq5", "created_utc": 1654552699.0, "score": 69, "upvote_ratio": 0.95, "num_comments": 32, "comments": [{"body": "No thanks. Sounds like Goldman wants to pump and dump. All the firms are saying this, so must be time to sell oil.", "score": 38, "replies": [{"body": "I think commodities are about the only ones that cant be manipulated. Supply and demand makes prices not confidence and trust.", "score": -12, "replies": [{"body": "Silver has entered the chat....", "score": 35, "replies": [{"body": "Reminder that dozens of articles about reddit buying silver popped up out of no where before it was even mentioned on wsb back when GameStop was mooning.", "score": 1, "replies": []}]}, {"body": "Oil supply is manipulated by a cartel called OPEC. Oil markets are full of speculation by traders, like the ones at Enron 20 years ago. \n\nEverything can be manipulated to some extent.", "score": 17, "replies": []}, {"body": "\\*looks at nickel futures catastrophe\\*", "score": 5, "replies": []}, {"body": "Ummm.... Enron", "score": 2, "replies": []}]}]}, {"body": "I have Jan 2023 puts on uso. It’s been stressful.😬", "score": 14, "replies": [{"body": "Cramer just told his followers \n\n“The only thing I would be buying right now is the dip in oil”\n\nHang in there you should be fine. 🤣", "score": 27, "replies": [{"body": "Crap that must mean we are getting covid 2.0 and going to see oil go negative again", "score": 2, "replies": []}]}, {"body": "Ouch. What's your strike? I personally think shorting commodities is risky, but best of luck to you.", "score": 5, "replies": [{"body": "80 and 85, I've been legging in little by little as it goes up.![gif](emote|free_emotes_pack|cry)", "score": 3, "replies": [{"body": "Did you get the memo about Biden winning the election?\n\nAre the highways by your house empty?\n\nIs population decreasing?\n\nIs the dollar experiencing deflation?\n\nIs domestic production at an all time high? \n\nIs the pandemic back?\n\nHow could oil possibly go below $90 this year?", "score": 4, "replies": [{"body": "Demand destruction or Putin pulls out by December and removal of sanctions\n\nAlso, in thinking about precovid times, oil was much lower. What was the difference then? Far less WFH and slightly less electric cars and less flights but maybe more fracking and normal Russian oil and a China at full power pre Evergrande. \n\nIs this price spike transitory?", "score": 1, "replies": [{"body": "The oil industry wasn't under attack.  Investment dollars are down. I don't see any decline in demand, but I could be wrong. The price of everything is up, and I don't know of any reason for the price of oil to go down.  The fact we are tapping our EMERGENCY reserves is both stupid and an indicator that there is a problem.  Once oil inventories get below 400 MM barrels, then we can have some fun!", "score": 1, "replies": []}]}]}]}]}, {"body": "WW3 might not help your puts", "score": 4, "replies": []}]}, {"body": "Coordinated pumping operations", "score": 5, "replies": []}, {"body": "People will cut holes in their truck and run around like Fred Flintstone before they pay $10 a gallon every week. No way prices stay this high. Even Jimmy Carter 2.0 will do something about it at that point. \n\nIf I was in the oil game, I'd be buying puts way out.", "score": 10, "replies": [{"body": "r u fucking dumb\n\ngasoline expenditure is pretty much the last thing people cut\n\nper capita our energy expenditure % is still way below long term average\n\nwe've got a lot more room uppies before real demand destruction", "score": 11, "replies": []}]}, {"body": "Papa Buffett is going to be holding the bag.", "score": 3, "replies": [{"body": "Yes! Oil is about to get rugged, unless we have WW3", "score": 2, "replies": []}]}, {"body": "Oil will get rugged worse than Robinhood or Coinbase", "score": 4, "replies": [{"body": "what are puts are you buying? looking for 19 JAN 24 if possible", "score": 3, "replies": []}]}, {"body": "How am I too stupid to know how to buy calls or puts on “oil”? Are we talking about targeting specific companies like shell and Exxon or are there commodities markets with generic label of oil and they source it from where ever and sell it that way?", "score": 2, "replies": [{"body": "USO is an oil ETF", "score": 5, "replies": [{"body": "Thanks that makes way more sense! I couldn't tell at a glance but does it try to stay in lock step with barrel of oil prices or the stocks of the underlying companies doing the pumping/shipping/processing/etc", "score": 2, "replies": []}]}]}, {"body": "I hope so I’m ready to short oil and pray gas prices come down 😬", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|3 weeks ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v6etq5)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v6etq5)", "score": 1, "replies": []}]}
