{"title": "NVDA: When will the correction finally end? ", "selftext": "This article was published on Sunday, September 8, 2024 at [Sam Weiss](https://sam-weiss.com) in a post entitled, \"[Double-Correction: Where's the Bottom & How to Navigate the Turmoil](https://sam-weiss.com/double-correction-wheres-the-bottom-how-to-navigate-the-turmoil/).\"\n\nTwo weeks ago, I published an article entitled “[Charting the Course: Outlining the Near & Intermediate-Term Risks and Headwinds that like ahead](https://sam-weiss.com/charting-the-course-outlining-the-near-and-intermediate-term-risks-and-potential-headwinds-that-lie-ahead/).” Many of the risks and headwinds I outlined in that article ended up coming to fruition. Specifically, the risk that the NASDAQ-100 might sustain a double-correction. In the article, I wrote:\n\n>Somewhat related to the double-top set-up above is the risk that the market might sustain a double-correction. What is a double-correction? It’s exactly what it sounds like. The market sustains an outsized correction of 16% like it has. It then rallies back to or close to the highs, and then sustains another correction of similar size or smaller. \n\n>These things typically happen when the markets enters a period of uncertainty like we saw between July and November 2023 of last year. For five months the market trended down having three sharp sell-offs followed by two sharp rallies of 8-9% each. The selling was more shallow than this recent correction, but the period of uncertainty lasted for a good long while.\n\nWhen we published the article, our general expectation was that the NASDAQ-100 (QQQ) would sustain a small near-term pull-back of 2-4% over a period of 5-7 trading sessions and then resume the rally it began on August 5. We had SEVERAL good reasons for expecting as such and they were: \n\n(1) the NASDAQ-100 had rallied $62 (14%) straight up from its August 5th lows without a 2% pull-back. This marked the single biggest leg up the QQQ had ever sustained in at least 5-years without a 2% pullback. In a normal rally, the QQQ usually goes up no more than 35-50 points (7-11%) before it sustaining a 2-4% pull-back. \n\n(2) What’s more, such a large sized-leg up in the market almost always precedes another a second or third leg. It’s rare to see a single-legged rally when the QQQ has such incredibly strong momentum behind it. For the QQQ to rebound $62 without another hard leg up is a big exception to broad momentum rules. \n\n(3) The market is always higher at the 35-day mark post-correction than it is at the 20-25 day trading mark. There aren’t many instances where that isn’t the case. In rare exception do we see the market lower at the 35-day market than it is at the 25-day point post correction. \n\n(4) Most rallies last 40-70 trading days on average and this one was only at 14-days making it the 2nd shortest rally in 15-years; \n\n(5) there were several potential positive catalysts on the horizon including Nvidia’s earnings, inflation (this week) and the fed cutting interest rates; and \n\n(6) Most importantly, double-corrections are exceedingly rare. They do happen once every 5- years or so, but in most cases, when the market bottoms, it bottoms until the next correction. \n\nThat being said, we anticipated that the market carried a higher-than-normal risk of experiencing a double-correction in this particular case, and our investment strategy is and was designed to mitigate those risks. A sound investment strategy must account for both known and unknown risks, and it is precisely these uncertainties that we hedge against to ensure success. It is also why the 2-year rule is a cornerstone of our core investment principles. The two most critical principles to successful investing are (1) investing on a 2-year minimum time horizon and (2) buying on corrections to gain better entries and to reduce risk. The importance of those rules are clearly illustrates in [Chapter 1](https://sam-weiss.com/investing-basics/time/) of our Core Investment Principles. \n\nAt the close of trade on Friday, the NASDAQ-100 is now down 10.89% from its all-time highs and down 7.7% from its recent highs of $485.50 set 11-trading day ago. That puts the NASDAQ-100, and many of the stocks making up the index, at a buying opportunity (based on our strategy). Nvidia (NVDA) is down a whopping 27% from its all-time highs. \n\nBased on our investment strategy, we bought Nvidia (NVDA) common stock and December 2026 DITM leaps last week at $104 and again at $101.40. For us, Nvidia (NVDA) being down nearly 30% from its all-time highs makes it a clear-cut buying opportunity. The company issuing a $50 billion buy back should tell you everything you need to know about the company’s own confidence in its future. We like Nvidia (NVDA) at $100 and our strategy will capitalize on the stock rallying 50%+ from its current levels. By the time we get Nvidia’s first earnings report of 2025, we expect the stock to be trading near the $150 level again. \n\nWith that in mind, we’re also invested in such a way as to hedge out market related risks and uncertainties. If the market were to slide into a full-blown bear market today, we’d weather that storm well and come out the other side with profits. And that’s how investors should always be invested. Ready to take on exogenous events. \n\nIn the sections below, we’ll outline our expectations and where we believe the market is likely headed in the near, intermediate and long-term. \n\n# NASDAQ-100: Full Double-Correction Underway\n\nWith the NASDAQ-100 down 7.7% from its $485.54 highs set on August 22, 2024, there’s no question that a double-correction is now underway. In fact, that already puts this correction at the same level as the April 2024 correction (8%) and puts it ahead of at least 8 other corrections going back to 2010. What’s more, last week’s sell-off amounted to one of the largest weekly pull-backs of the entire bull market that began in December 2022. \n\nSo obviously the question we’re going to want to answer is: how much further does this correction have to go and where are we likely to bottom? \n\nWe’ll begin to answer this question by taking a look at the near-term outlook. The near-term will give us a small window into where the markets are likely headed this week going into Apple’s iPhone announcement and the CPI report (Wednesday). \n\nNASDAQ-100 (QQQ), S&P 500 (SPY) & Nvidia (NVDA) are all Oversold & Ready to Bounce   \nBoth the QQQ and NVDA have reached extremely oversold conditions on the hourly chart and are now likely to bounce early this week. As we’ve mentioned a few times before, while overbought conditions (RSI>70) has very little in the way of predictive value, oversold conditions is a different story. Anytime we get oversold markets (QQQ/SPY/DIA), there’s high probability for a near-term bounce at a minimum. \n\nA back-test of ANY period in the market’s history bears this out quite clearly. There’s no question that deeply oversold conditions on the hourly chart preceded a big bounce in the market in the overwhelming majority of cases in the historical record. That’s one indicator that is independently very reliable. The NASDAQ-100 finally reached oversold conditions on Friday and is likely due to bounce on Monday or Tuesday of this week. With CPI due out on Wednesday before the open, I expect we’ll see the market up big on either Monday or Tuesday of this week. \n\nFor the near-term, I expect we’ll see a rebound that takes the NASDAQ-100 up to somewhere around the high $450’s. After that, we go into more intermediate-term territory and we’ll discuss that below. \n\nNow it’s important to point out that with the QQQ is just barely into the mid-20’s on the RSI and can go a little lower as we saw during the August 5 correction. We don’t often see the NASDAQ-100 get as oversold as it did near the end of July, but it does happen from time to time and it’s important to keep perspective here. \n\nThe QQQ is in the middle of a double correction and it shouldn’t be unexpected or surprising to see the NASDAQ-100 reach deeply oversold conditions before bouncing. So if we get a hard push down early this week ahead of the bounce, it shouldn’t be in any way surprising and your investment strategy should take that into consideration. We’re due for a bounce, but we could easily see another hard push down before we get one. \n\nIn fact, take a look at this chart below. What you’ll find is that the NASDAQ-100 has only reached such oversold conditions 7 times in the past 12-months. And in 6 of those cases, the QQQ either fully bottomed or bottomed ahead of a strong rebound. The one time it didn’t was when it reached oversold conditions near its highs. That is the one time this past year we didn’t see the QQQ rebound hard off of oversold conditions. See here: \n\nNvidia (NVDA) Is Due For A Monster Rebound \n\nAs we mentioned last week, Nvidia (NVDA) has already seen multiple instances of oversold conditions last week, it’s off 23% from its $130 highs a few weeks back and at a ripe buying opportunity. Whether that bounce continues on or whether Nvidia sees another leg down will largely depend on the market’s intermediate-term direction. But for the near-term, it’s due for a bounce. \n\nI do think it’s very important for Nvidia (NVDA) investors to understand that the recent bearish activity in the stock has NOTHING to do with Nvidia (NVDA) at all. I’ve seen a lot of investors get hyper focused on the Bloomberg article, what Bloomberg did wrong, the subpoena, the DOJ investigation and other FUD-related matters. I’ll just come out and say it right now, that’s all a distraction. It’s bullshit. None of that nonsense has any connection to why Nvidia is pushing lower right now. Nvidia is lower right now due to broad market pressures and that’s it. \n\nDon’t believe me? Wait until the stock market starts to rally after this correction is over and we’ll see how much the DOJ investigation will drag on Nvidia as it rallies to $150. It won’t even be a speed bump. \n\nIf the NASDAQ-100 were rallying right now, Nvidia, Broadcom and every other stock that got smacked on earnings would also be rallying right now. Nvidia, like every other stock that trades on the NASDAQ or NYSE, does not trade in a vacuum. All stocks are subject to the broad market pressures, trends and volatility. If the stock market were to enter a bear market right now, Nvidia would trade substantially lower and there’s nothing Nvidia (NVDA) can do about it. Nvidia’s earnings could be flawless. Its news could be flawless. And yet the stock would take a huge thumping. That is because when there’s a fight to safety, a flight to quality or cash raising, there is a coinciding broad-based reduction of risk (“risk off”) that takes place in the market and it impacts all stocks. Everything in the stock market becomes devalued in a risk off environment. During broad-market rallies, the exact opposite happens. Everything gains added “risk-on” premium in bull markets. What we’re seeing right now in Nvidia (NVDA) is a risk-off, run-of-the-mill market correction and it’s impacting virtually all stocks in the market. \n\nBut soon enough, the correction will end, the market will bottom and we’ll be off to the races again. And here’s exactly what we need to look for as an indication that this is about to happen. \n\n# When Will The Correction End?\n\nIn virtually every correction, there are a few things we want to see happen before we can be confident in forecasting that a bottom is in. Now it’s important to understand that the market can bottom at any time. None of these things have to happen for a bottom and we can see the market bottom literally at any moment. It’s just that when these indicators do occur, there’s a very high probability a bottom is in. \n\n(1) August 5 Rebound Already Set the Lows  \nThe first one already triggered when the S&P 500, NASDAQ-100 and Dow all rallied either right up to or near their all-time highs after bottoming on August 5. We discussed this a bit in [Charting the Course](https://sam-weiss.com/charting-the-course-outlining-the-near-and-intermediate-term-risks-and-potential-headwinds-that-lie-ahead/). Whenever the market sustains a correction and then rebounds for more than 50% of the size of the sell-off, it is highly likely that the lows are in. Now while the market might make incremental or slightly new lows in this sell-off, it is unlikely that we’re going to see substantial new lows below the August 5 lows. Chances are we see a bottom that is ABOVE the August 5 lows. \n\nThe only thing that could derail this thesis would be if the economy made a huge shift to the negative. We ‘d need to see a serious recession, serious job losses or a serious resurgence in inflation for us to see a double-top scenario play-out in the markets. Basically, a full-blown bear market would have to develop for the S&P 500 to experience a double-top breakdown or substantial new lows below the previous lows. And the economic data we’ve seen so far doesn’t indicate we’re anywhere near that. \n\nThe post-correction rebound very often telegraphs the likely path ahead. As the NASDAQ-100 and S&P 500 both rebounded beyond the 50% retracement line, the lows are already in. This correction will likely bottom either just above or just below the previous August 5th lows. See original article for images.\n\n(2) The 200-Day Moving Average  \nIn a normal correction, the 200-day moving average is very often a likely bottoming point for the indices. And in this particular correction, we’re unlikely to see the market trade much below the 200-day moving averages. The NASDAQ-100 might, but the SPY is not likely to see lows below that point. This is a minor indicator, but an inflection point worth mentioning, as the NASDAQ-100 isn’t far from its 200-day.  See original article for images.\n\n(3) 30-RSI on the Daily Chart  \nProbably the biggest indication you’ll ever get for a bottom in the market is oversold conditions on the daily. Just to illustrate how rare of an indicator this is, over the past 5-years, the SPY has reached oversold conditions only a handful of times and each time it happened it preceded a massive rally of 10%+. In fact, the SPY reached oversold only twice during the entire bear market in 2022. Once on the first huge leg down ahead of the 10% bounce and again when the bear market bottomed in October 2022. If we see oversold conditions on the daily chart, that’s a huge indicator for a low in the markets.  See original article for images.\n\nIn the most brutal high volatility corrections, you might see the SPY or QQQ reach a 20-RSI on the daily chart. But when that happens, it ends up being one of the greatest buying opportunities of the era. I expect no different here. If we see the SPY or QQQ push down to a 20-RSI, it’s likely one of the better buying opportunities of the bull market. \n\nThe NASDAQ-100 is at a 37-RSI, so just a bit more oversold than the SPY, but not quite oversold on the daily yet. Now as I mentioned above. The markets need not reach oversold conditions to bottom. It’s just that if the indices do reach oversold conditions, then they’ve likely bottomed. Oversold is a sufficient but not a necessary condition to bottom. \n\n(4) Overbought $VIX  \nAnother big indicator for a bottom is an overbought $VIX which often corresponds with oversold indices. Those things typically happen at the same. There aren’t many instances of the $VIX going overbought without a coinciding market bottom. The $VIX isn’t quite there yet. But it has pushed up to the 24-level which is at the high end of the range for the past 18-months.  See original article for images.\n\n(5) Oversold $NYMO (NYSE McClellan Oscillator)   \nOne of the more rare, old, and well established indicators is the New York Stock Exchange McClellan Oscillator which has a very high backtest for forecasting lows. The problem is that it rarely triggers. You typically need pretty bearish setniment to see the $NYMO push oversold. But when it happens, it’s reliable. \n\nWe’ve only seen the $NYMO reach -100 oversold five times since the start of the 2022 bear market and it went 5-for-5 since then. Go back 15-years and it’s at 90%+ reliable. The last time we saw it get down to -100 was in April. It pushed down to oversold -80 in August at the lows. So that’s something we’re going to want to watch along with the $VIX and RSI as we head into the Fed. \n\nAgain, these are just indicators that have a high reliability in forecasting a bottom in corrections. They’re all sufficient conditions. Not necessary conditions. The market could have already bottomed on Friday and that would make total sense under the totality of the circumstances.  See original article for images.\n\n# What About Nvidia (NVDA)?\n\nHere’s how all of this impacts Nvidia (NVDA) and where the stock is likely headed from here. To begin with, Nvidia (NVDA), like every other stock in the NASDAQ-100, is going nowhere until the market bottoms. Once the QQQ bottoms and we begin a new rally, then NVDA will spread its wings and fly again. \n\nThat being said, with the NASDAQ-100 in uncertain territory (at least until it reaches oversold conditions on the daily), investors need to be prepared to see Nvidia (NVDA) test its August 5 lows. Even though Nvidia (NVDA) is oversold on the hourly and due to see a huge rebound near-term, it can easily peak at $110-$115 and then see another hard leg down with the markets. In fact, Nvidia (NVDA) is at the same exact daily RSI as the NASDAQ-100 on the daily chart, and like the NASDAQ-100, there’s a ways to go before it reaches a 30-RSI on the daily. \n\nStill, it’s important to remember that NVDA is one of the most fundamentally sound companies on the NASDAQ-100 and that this is all temporary market related volatility. At $100 a share, NVDA isn’t far from its eventual lows. Whether the market bottoms this week with inflation or after the fed on the ensuing week shouldn’t haven any bearing on anyone’s investment strategy. Not if you take a long-term approach to investing as every good investor ought to do. Anything short of that is straight up gambling. \n\nNvidia is likely bottoming between $90 and $100 a share again. It may temporarily see sub-$90 under extreme conditions, but even so, the stock market really isn’t all that far from a bottom, and once we get rallying again, Nvidia moves back up toward its $135-$140 range\n\nThis brings me to my next point. Here’s why it’s critically important to always maintain a long-term time horizon when investing. Nvidia’s stock price has largely now caught up with its earnings growth. This is not to say that the stock can’t move substantially higher. Of course it can and it will. But what that does mean is that we’re unlikely to see the same types of stock gains that NVDA saw this past year and we’re probably going to see periods of consolidation more often now. \n\nIn fact, like many companies of NVDA’s size and scope, there’s a tendency for the stock to go through consolidation phases to allow the P/E ratio to shrink a bit. Nvida (NVDA) already went through one such phase when it traded between $40-50 for nearly 6-months in 2023. I believe Nvidia (NVDA) has entered a second such phase and will probably trade between $90 and $150 for a while now. Take a look at this NVDA weekly chart below. Notice the consolidation period between June 2023 and January 2024. Compare that period to today. Though the scope is greater today, the periods are very similar and occur during similar periods, seasonally.  See original article for images.\n\n# Apple, Inflation & The Fed\n\nIn spite of the technical picture laid out above, there is a very strong possibility that the markets may have already bottomed on Friday or will soon be bottoming within the next 7-8 trading days. First, we have Apple introducing its new Ai-powered iPhone. As anyone who uses ChatGBT for research and development can tell you, an OpenAI powered iPhone can be a game changer. Depending on how that event goes, it could spur a rally in the market that takes us to the CPI report. When you consider the fact that we’re already due for a near-term rally as per the hourly chart, the likelihood for an Apple-lead NASDAQ-100 rally is looking decently strong. \n\nOn top of that, if we get a good CPI report, that could really shift sentiment to the bullish side again especially if the market begins to believe in an accelerated Fed timetable. But even setting that aside, the Fed lowering interest rates and the coinciding Q&A with Fed Chief Jerome Powell can easily trigger a market bottom as well. \n\nIn fact, the fed’s decision on interest rates has historically marked a turning point in the markets. It is often a trend changer. The fed day has marketed tops and bottoms in a large number of occasions. The fact that we’ve seen a double-correction going into a full fed pivot tells me we could easily see a bottom that day. \n\nEven setting aside Apple, inflation data and the fed, the time-table for this correction is already nearing its mid-to-end point. The typical correction lasts roughly 20-days and goes for about 10-12% on average. We’re already at day 11 of this double-correction and down 7.8% on the QQQ. By the time we reach fed day, the correction will reach day 19. The table below shows every single rally and correction going back to 2010 in sequence.  See original article for images.\n\nWhat’s more, if you look at the current sell-off as one big correction with two major legs, this corrective period has now lasted 43 days. Looking at it that way, this correction would already be in the top 7 in terms of duration. Last year’s July – November correction lasted 71-days during which the NASDAQ-100 had three separate legs down of 8-9% with two significant rebounds of roughly 7-8% each. We have something similar going on here but on a much larger scale. \n\nMore importantly, if you look at the “correction duration” column in the table above, what you’ll find is that most corrections fall within a period of 10-20 days. Of the 34 past corrections going back to 2010, 23 had durations of 23 days or less. We’re already at day 11 and Fed day marks day 19. This tells me that we’re likely seeing a bottom in the market at some point before the end of September. \n\nWhat’s more, even in those longer-duration corrections highlighted in yellow on the table, the market generally saw big rebounds of 8% or greater. So even if the correction were to continue into the month of October, we’d likely see substantial rebounds like the one we saw after the August 5th bottom anyhow. \n\n# Concluding Remarks\n\nWhen looking at the totality of the circumstances, we’re probably not far from a bottom in term of both price and time. While technical indicators haven’t reached the extreme levels we might want to see to comfortably forecast a bottom in the market, there are a host of other catalysts which might indicate where we’re headed. For one, we are oversold near-term and due to bounce probably on the back of an Apple-lead rebound. How the market trades after that isn’t very clear. But what is clear is that the fed is the likely catalyst for a trend change. \n\nRemember, as we noted above, the size of the recovery rally has largely dictated the likely lows ahead of time. Even if we sell-off on the Fed, we’re not likely to see the market go lower for much longer after that. Even if we bottom in October, price-wise we’d still likely be within a short trading range of the prior August 5 lows. \n\nAs our investment strategy is concerned, we’re long the NASDAQ-100 and Nvidia with both common stock and DITM Leaps. It doesn’t really matter to us whether Nvidia bottoms at $90 or $100. The end result is the same. Though we’d be happy to buy more at $90. Having a long-term time-horizon is everything. That can’t be overstate enough.", "id": "1fcjji2", "created_utc": 1725865857.0, "score": 259, "upvote_ratio": 0.9, "num_comments": 185, "comments": [{"body": "Wake me up when correction ends.", "score": 110, "replies": [{"body": "I think we're all hoping for a Green Day or two.", "score": 65, "replies": [{"body": "[Green Day - Wake Me Up When September Ends...](https://www.youtube.com/watch?v=NU9JoFKlaZ0&t=103s)", "score": 6, "replies": [{"body": "Way to hammer that one in", "score": 8, "replies": []}, {"body": "yes, we get it.", "score": 9, "replies": []}, {"body": "Yup... a great song. Wake me up....when September eeennndds(read that in a... screechy, incredibly off-tune tone).", "score": 2, "replies": []}]}]}, {"body": "I had this nightmare dream that NVDA had made an amazing quarter with $30 billion dollars in 3 months, and then the stock dropped 25% after that...It was so weird...I need to cool off on the medical hemp...", "score": 14, "replies": [{"body": "LOL...yeah, but at least no we shed the absurd expectations. \n\nA 4% beat in the future will send the stock back up. 200B Fiscal '26 revenue! \n\nThat's my prediction...FWIW.", "score": 2, "replies": []}]}, {"body": "Next September", "score": 3, "replies": []}, {"body": "It has ended.", "score": 3, "replies": []}, {"body": "Here comes the rain again", "score": 1, "replies": []}]}, {"body": "Long live and hail dieselcock", "score": 64, "replies": []}, {"body": "[deleted]", "score": 46, "replies": []}, {"body": "I would take one post about technical analysis and investment planning from Deisilcock over all the other hot garbage I see on this sub when the markets get tough or people start panicking. Thanks for the article, man!", "score": 25, "replies": []}, {"body": "Lisan al-Gaib! Lisan al-Gaib!", "score": 20, "replies": []}, {"body": "# Summary in terms of actions\n\n\n### Buy Nvidia Stock\nNvidia is down nearly 30% from its all-time highs, presenting a buying opportunity. The company’s $50 billion buyback demonstrates confidence, making it attractive at current levels (around $100 per share).\n\n### Leverage Long-Term Options\nConsider purchasing December 2026 deep in-the-money (DITM) leaps to capitalize on a potential stock rally over the next few years.\n\n### Prepare for a Short-Term Bounce\nNvidia and the NASDAQ-100 are in oversold conditions, suggesting a near-term bounce. Expect a potential rebound early this week, driven by market conditions and upcoming events (Apple launch, CPI report).\n\n### Hedge Market Risks\nWhile Nvidia is expected to rally long-term, maintain hedging strategies to protect against market downturns or further corrections.\n\n### Hold for Long-Term Gains\nExpect Nvidia to potentially trade around $150 by the time of its first earnings report in 2025.", "score": 17, "replies": [{"body": "I like this.  Easy and simple steps to follow.  Thanks bro", "score": 2, "replies": []}, {"body": "Thanks for this.  I should have probably included a tl:dr.  I tend to forget that the days of people reading the paper for hours on end is over. No one has the time or patience anymore.  \n\nThe post can be condensed and you’ve done a good job at it.  Thanks again!", "score": 1, "replies": [{"body": "What do you think about the selloff at open into rally to close? Is this already the reversal ( bottom in) or still part of the near term rebound", "score": 1, "replies": [{"body": "It’s highly indicative of a bottoming being in.  There were a lot of different things that happened today, the totality of which, points to a bottom being in.  \n\nWe can still see another hard leg down.  It happens after a bottom, but the lows will probably hold now.  \n\nEspecially for Nvidia. The stock surpassed the 50% retracement today which is always a big indicator that the low is in.", "score": 2, "replies": [{"body": "If the market sells off the rate cut decisio, do you think it will set the long term direction as a potential bear market? No experience how long a rate cut decision sets the tone/sentiment.", "score": 1, "replies": []}]}]}]}]}, {"body": "Excellent read, thank you.", "score": 22, "replies": [{"body": "No one read this long ass shir", "score": -25, "replies": [{"body": "You are correct, blind gamblers and sunshine traders should not take the time to read this. Just sell & go away..", "score": 4, "replies": []}]}]}, {"body": "Very well written, thank you! For NVDA, with RSI being 37, it's not quite oversold yet, and this week we have the CPI report. I anticipate volatility and probably NVDA could touch 95-100 again to reach the RSI 30, before taking off. Thanks again for bringing useful information to the community. Subed!", "score": 19, "replies": [{"body": "Is Enron oversold? What does your indicator say?", "score": -14, "replies": [{"body": "Ohhh Siegfried...what shall we do with a guy like you!", "score": 3, "replies": [{"body": "Buy my puts 😈", "score": 0, "replies": []}]}]}]}, {"body": "I like this because it is saying what I hope to be true\n\nBut the reality is I have no idea if it is reliable or not", "score": 21, "replies": [{"body": "Crystals are always abound", "score": 4, "replies": []}, {"body": "Psst: no one knows, or can know, and when they say they do, they’re lying and/or deluded. Lots of well-crafted research and verbiage does not change the reality that no one knows what will happen or when.", "score": 2, "replies": [{"body": "If that were the case, and think about this logically from a business point of view, why is it that the overwhelming majority of all private U.S. capital is invested in the stock market?  If it’s all random and unpredictable, then why would TRILLIONS of dollars be invested in the stock market?  More than in all U.S. real property.  \n\nThis idea that “no one knows” what will happen or when is nonsense.  It doesn’t comport with reality. \n\nIt doesn’t represent the true nature of things.  What you can say is the broad market is far less predictable the more near-term you try to forecast due to the large number of variables that can impact its short-term direction.  That is true.  \n\nHowever, the long-term direction is determined by fundamentals and that is something that can be forecasted with a very high degree of accuracy.  \n\nLet me give you an analogy.  \n\nIf I gave you a set of 6 coin flips, can you forecast with any degree of accuracy that at least 3 will be heads with any consistency?  \n\nProbably not.  You can simply have bad data set and with such a small sample size, there can be less probable outcomes for each 6-coin clip set.  You’ll have a lot of less probable outcomes.  \n\nBut if I give you 1,000 coin flips, can you predict with a higher degree of accuracy that at least 3 will be heads?  \n\nYes you can and the likelihood of 3 being heads in nearly every data set you forecast would be extremely high.  \n\nNow imagine someone says to you about the coin flips: \n\n“no one knows, or can know, and when they say they do, they’re lying and/or delusion. Lots of well crafted research and verbiage does not change the reality that no one knows what will happen or when.”  \n\nIf someone told you this on the notion that no one can predict 3 heads in a data set of 1,000 coin flips, what do you say to them?  \n\nThe further out you go into the future, the higher the likelihood the stock market will be substantially than it is today and with a very degree of certainty.  \n\nTell Warren Buffet that all he has been doing for the last 70+ years is just gambling.  That he has just been lucky this entire time.  That no one knows, or can know, and that he’s either lying or deluded to believe he knows.  \n\nOr maybe just maybe your gap in knowledge doesn’t mean that same gap applies to everyone else.  \n\nDon’t be so quick to assume that just because you don’t know something, that it must automatically mean no one else knows.  \n\nWhat you’ve done here is taken your lack of knowledge on a subject matter and you’ve applied it to the entire world.", "score": 22, "replies": [{"body": " It I think there is one element of the stock market that is the wild card is sentiment.  Coin flips yes you do it more and it becomes more a regression to the mean because it is just flips, there are no feelings involved.   But with the market there is a lot of psychology present.  NVDA while fundamentally sound is really in an extremely bearish sentiment at the moment from various causes.  When it is like that mounting even a relief rally is hard.", "score": 2, "replies": [{"body": "Sentiment is a short-term problem in the stock market.  Here’s the point I’m trying to drive home.  Will the NASDAQ-100 be north of $550 sometime in the next 6-months.  Probably.  Can something detail that in the near-term?  Sure.  How about 1-year from now?  It’s far more likely than not that the NASDAQ-100 sees $550 at some point in time in the near 1-year.  \n\nBut still, a full blown recession and bear market can derail that thesis and it’s possible we don’t see $550 at any point in time in the next year.  Though that’s highly unlikely.  \n\nWell about 5-years?  At that time frame, it becomes extremely likely the NASDAQ-100 sees $550 at some point in time within the next 5-years.  Like calling 3 heads on 1000 coin flips.  \n\nEven a second financial crisis that leads to a 60% crash in the NASDAQ-100 wouldn’t derail that forecast.  Even if we saw the NASDAQ-100 crash from its highs at $503 down to a low of $230, we would still see $550+ within the next 5-years.  \n\nIf you applied the current market to the 2008 financial crisis era, the NASDAQ-100 would have not only eclipsed $550, it wound have traded all the way up to $800 within 5 years after the START of the crisis.  \n\nThe QQQ traded at a high of $46 going into January 2008, dropped to $21 at the lows, and traded up to a high of $63 by 2013 — 4-years later.  That’s 50% above its prior highs.  \n\nThe point here is this.  The further out you go into the future, the more likely it is for the market to trade substantially higher than it is today.  Especially if the market’s current valuation falls within historical norms.  Bubbles are the exception here and we’re not in a bubble.  \n\nThe reason for the market’s long-term predictability is pretty simple.  The U.S. economy grows at a constant rate due to the constant expansion of the world population and standard living.  Growth is a constant and has been for the last century.  Can that be permanently derailed by something far worse than the financial crisis.  Very unlikely and if it did we’d have a lot more to worry about than stocks.  We’d be worried about whether we had a big enough stick and rocks with which to defend ourselves.", "score": 6, "replies": [{"body": "You are 100% correct my friend. Been in the business for 25++ years and I agree with your approach towards investment selection...technical for shorter term timing of purchases and sales and fundamental for long term decision making. This recent pullback is a gift.", "score": 2, "replies": []}, {"body": "i know what you mean, but i disagree on what we mean by sentiment here.  this isn't big tech sometimes considered overvalued by PE or something.  this is basically how people feel about the AI field as a whole, which is largely an unknown.  that's why the earnings this season from the big guys were so dumped on, so far very uncertain about the ROI on AI and people just don't know what to expect.  if the ROI so far has been great, then even if NVDA's guidance was a bit off, people still would have cheered it on.  as it is , sentiment is simply going to stay like this unless some kind of sharp catalyst comes or the during the next ER the big tech is able to show a definitive and increasing ROI to all the capex.  and not to mention all the big tech themselves are making a lot of their own chips already.", "score": -1, "replies": [{"body": "I think OP already explained that. Sentiment is a short-term catalyst, but in long-term it is still coming down to the fundmentals. If NVDA's revenue and profit keep growing, the stock price will go up (in long-term). \n\nOf course if there are some sudden pivots that the big boys stop spending, and/or there is a fierce competition, then the stock price will go down. But it's because of the fundemantals -- the revenue and profit shrink -- instead of sentiments. However, neither of the above is very likely in the forseeable future (in a few years). \n\nConclusion: Baring from some catastrophic events (Taiwan issue, all-out war etc.) in next few years, NVDA will be going up.", "score": 0, "replies": [{"body": "sentiment is not necessarily short term on a field that has no track record.  that's what i am saying.  it's not like sentiment against consumer staples for a few months for whatever reason.  no one knows right now how AI's value really is.  the fact that the mega hyperscalers mostly got beaten down for their ER this reason is precisely for that reason.  there are a lot of ifs in AI and sentiment is still very well forming and can become something more or less permanent.  kind of like the dotcoms.", "score": 1, "replies": []}]}]}]}]}, {"body": "You have imputed a lot of points that are not relevant to the fundamental thesis (and which have nothing to do with my comments): stock prices are random. \n\nActive traders don’t beat the market anywhere near enough often to justify their fees. Research analysts who focus on fundamentals are not market outperformers. Technical analysis is close to being pseudo-science. Why? Because in the short term, stock prices are random. In the long term, equity values rise in the aggregate because companies create value. NVDA has done this spectacularly well; it may continue to do so. But you cannot know this with certainty.\n\nYou speak of averages — coin flips with large sample sizes — but NVDA is one coin.\n\nI have been investing for more than four decades. The stock market may be the greatest wealth transfer/accumulation method ever invented. I buy stocks and I own NVDA (average price/share: about $16). The issue at hand is that your analysis may be right but the precision of your analysis and the force with which you deliver it belie the reality of the random walk down Wall Street.\n\nIf you were really a good prognosticator, you would not publish this; you would just invest your own money according to your analysis for outsized profits because you’d be vastly ahead of market sentiment. \n\nAnd if you are so confident, why on earth would stoop to rebut me?\n\nThis entire subreddit is great evidence that NVDA might have peaked—or not. (I’m still long.)  You don’t know; I don’t know; the market does not know. But the market will figure it out, and it won’t need your musings to do so.", "score": -5, "replies": [{"body": "I can only respond to a post you made.  These are YOUR words: \n\n“Psst: no one knows, or can know, and when they say they do, they’re lying and/or deluded. Lots of well-crafted research and verbiage does not change the reality that no one knows what will happen or when.”\n\nAnd then you said you’ve been investing for four decades which is to say you’ve been gambling for four decades.  Unless you believe the phrase “no one” which applies to Warren Buffet doesn’t apply to you.  \n\nThe entire point about the coin flips is to illustrates that certain situations carry higher probability outcomes and as you increase market time horizon, the probability of correctly forecasting higher prices skyrockets.  \n\nThe overwhelming evidence bears that out.  And if that weren’t the case, trillions of dollars wouldn’t be siting in stocks right now.  Nvidia wouldn’t be buying $50 billion of its own stock.  It would have invested the capital elsewhere.  \n\nI don’t disagree that short-term forecasts carry a lower probability of being right.  But not always.  There are plenty of short-term situations that I can forecast with an extremely high degree of accuracy.  \n\nIn more than 90% of all historical cases where the NASDAQ-100 reaches a 20-RSI on the hourly chart, it has rebounded at least 3.3% on average.  That means for anyone who forecasted a 3.3% rebound each time the NASDAQ-100 reached a 20-RSI; they were right 90% of the time.  \n\nAnyone who forecasts a bottom in the market when the NASDAQ-100 reaches a sub-30-RSI on the daily, have been right within a few percentage points in 90% of the history cases.   There are only an insignificant handful of examples where that wasn’t the case.  Add an overbought $VIX and an oversold $NYMO and you’re nearing 100%.  The only exception being the financial crisis.  That’s one exception out of something like 80 corrections going back 25 years.   \n\nCan they know with certainty?  No. But does that carry any real practical significance if they’re right 95% of the time?  If out of 20 corrections, the accurately forecast a bottom within a day or so and with a few percentage points, why does that matter at all? \n\nThe point here is this.  Making statements like “no one can know anything ever,” is to blindly ignore the data in front of you.  That’s a lazy way to analyze data and it doesn’t help anyone. \n\nI posted a table that shows every correction and rally going back 15-years.  You’re telling me that you can’t go through that historical data and pinpoint even one trend that carries a very high degree of forecasting accuracy?  If not, then why are you invested at all?  \n\nThe same rules apply to financial analysis.  It’s all based on historical trends.  Investing on fundamentals assumes the market will treat the stock in a way that is consistent with historical trends.  All investment analysis assumes trends remain in tact.  \n\nFor example, if an analyst expects Nvidia to report $3.70 in EPS on $200 billion in revenues in 2026, their price target is going to be based on an understanding of historical trends with regards to P/E ratios.  Whatever trialing and forward P/E said analyst gives the stock in their analysis is based on historical trends.  \n\nThe point is there is no analysis that doesn’t rely on historical trends in the market and to ignore them is essentially the same as throwing up your hands and saying that you’re just gambling.", "score": 2, "replies": []}]}]}]}]}, {"body": "Finally we hear from you Lord Diesel\n\nWhere can i follow you", "score": 4, "replies": []}, {"body": "Dieselcock is spot on once again!", "score": 3, "replies": []}, {"body": "End of October", "score": 3, "replies": []}, {"body": "> I do think it’s very important for Nvidia (NVDA) investors to understand that the recent bearish activity in the stock has NOTHING to do with Nvidia (NVDA) at all. I’ve seen a lot of investors get hyper focused on the Bloomberg article, what Bloomberg did wrong, the subpoena, the DOJ investigation and other FUD-related matters. I’ll just come out and say it right now, that’s all a distraction. It’s bullshit. None of that nonsense has any connection to why Nvidia is pushing lower right now. Nvidia is lower right now due to broad market pressures and that’s it. \n\nThis right here", "score": 3, "replies": []}, {"body": "If I’m being irresponsibly speculative, I think we see a transient uptick to 105 this trading session, followed by extended losses into the mid-high 90’s through the end of the week, then a bounce and reconsolidation back to the mid 100’s through the end of the month. Then trend up into October, prob 115’s. This is all far too specific to be correct however.", "score": 6, "replies": [{"body": "Well your $105 prediction is holding pretty nicely at this point. I'd be happy if we could skip the next part of your prediction though and just go to $115 lol.", "score": 5, "replies": []}, {"body": "Hopefully this stock won’t see 90’s this week. It’s already dead and big guys have already sold 50-80% of their NVDA shares to buy SMCI which shows the state of this stock", "score": -2, "replies": [{"body": "Did u just say the biggest company in the world is dead?", "score": 4, "replies": [{"body": "Guess you haven’t heard of metaphors?", "score": -4, "replies": [{"body": "Clearly you haven’t anyway", "score": 2, "replies": [{"body": "Got out of bed with the wrong foot? Yikes", "score": 0, "replies": [{"body": "Moron not worth my time", "score": 3, "replies": []}]}]}, {"body": "That is not a metaphor.", "score": 1, "replies": []}]}]}, {"body": "The hedge funds  are not buying smci they are selling it off clearly its going down", "score": 3, "replies": [{"body": "Some sell, some buy, most sell.", "score": 3, "replies": [{"body": "I highly doubt they are buying it. Citadel bought puts on Smci 30/6/24 and on Nvidia", "score": 0, "replies": [{"body": "https://stockcircle.com/portfolio/ken-griffin/nvda/transactions\n\nCitadel shed a high volume of Nvidia shares.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Finally the cock I’ve been lusting over has spoken", "score": 5, "replies": []}, {"body": "Okay diesel cock, I'll buy 1000 more shares 😮‍💨", "score": 4, "replies": []}, {"body": "ABSOLUTELY GREAT READ AND TERRIFIC CONCLUSIONS.", "score": 2, "replies": []}, {"body": "Very well written", "score": 2, "replies": []}, {"body": "why didn't you guys take profits at 140? it was only the biggest market cap gain in stock market history...", "score": 2, "replies": [{"body": "Lots of people took profits at 30, 40, 60, 80, 100.", "score": 2, "replies": []}]}, {"body": "Too long didn’t read", "score": 2, "replies": [{"body": "Go back to Tiktok. That's more your speed. Lol", "score": 2, "replies": [{"body": "Yes it is TikTok is my wifey", "score": 1, "replies": []}]}]}, {"body": "All hail dieselcock", "score": 2, "replies": []}, {"body": "Imagine a recession. This sub will loose its collective mined seeing the stock trade sub $50.", "score": 2, "replies": [{"body": "Yeah that’s why having a 2-year time horizons is so critically important.  Look at the way Meta traded in the last bear market.  It fell 80% on 2022 and then fully rebounded recovering all of its losses within a single year.  Less than a year.  400% in less than a year.  \n\nSetting aside the dot-com collapse, there hasn’t been an instance in the last 40 years where stocks didn’t fully recovery their losses within 18-24 months.  \n\nIn the financial crisis the NASDAQ-100 went from $43 down to $20 up to $67 in a period of 2-years.  That’s 60% down from January 1, 2008 to March 2009 to up 50% overall by the time it reach January 2010.  \n\nSo while you’re right.  Nvidia could easily collapse in a major recession like 2003 or 2008 or even in a bear market like 2022, it would recover back to its all time highs almost as quickly.  \n\nHaving an even keel during that time is critical important to succeed. \n\nThe entire point of having a 2-year time horizon is to hedge against that potential for a collapse.  It gives you time to wait out a recovery.", "score": 2, "replies": [{"body": "Hey, appreciate your post and analysis. Rarely do I read through the whole thing esp when it comes to stocks.\n\nAre there any stocks besides NVDA that you cover?", "score": 2, "replies": [{"body": "I’ve been covering Apple for a very long time.  Since the iPod 1 was introduced.  But lately Apple has been kinda stagnant.", "score": 1, "replies": []}]}, {"body": "Uh, look at Cisco stock. Even msft stock didn’t reach its ath again until 10 years after the dot com bubble peak.", "score": 2, "replies": [{"body": "Notice how I said, “setting aside the dot-com era.”  But since you bring it up, let’s discuss.  \n\nIn the dot-com era, p/e multiples weren’t inline with actual earnings potential.   By comparison, Nvidia is about to report $3.00 in EPS on $200 billion in revenues.  \n\nCisco took forever to recover precisely because it didn’t earn enough to bring down its 200 P/E ratio multiple to realistic numbers.  If Cisco had earned enough to bring down that P/E ratio to 20-30 after the dot/com era, it would have swiftly recovered.  \n\nBut Cisco never lived up to its speculative potential during the dot-com era and its P/E compressed through price discovery rather than actual earnings.  \n\nYou can’t compare a normal bear market situation to an actual legitimate speculative bubble. \n\nThat’s why meta can drop 77% from $370 down to $70 in 2022 and then rally back to $500 one year later.  \n\nIf you’re a regular multiple stock in a regular market environment (not a bubble), that stock will recovery within a year or two at most.  \n\nNvidia is forecasted to earn $3.00 next year.  Even at a 30 P/E ratio — below all of its market peers — it trades at $90 a share.  \n\nA massive difference between the dot-com bubbles and Nvidia.", "score": 4, "replies": [{"body": "I was wondering whether you still think there is the possibility of an Apple-lead rebound, or whether the possibility for that looks like it has now passed?\n\nExcellent justification of all your analysis in your replies to comments btw. Quite refreshing to see someone backing up their claims with logic rather than immediately disappearing", "score": 2, "replies": [{"body": "Thank!  I appreciate the kind words!  So Apple didn’t end up performing but we got the rally anyway.  The CPI report did it.  We were due to bounce given the near-term oversold conditions. \n\nNow that we have, I think there’s an outside probability that the entire market has bottomed already.  \n\nObviously, the fed is going to dictate.  No matter how good this rally is if the market doesn’t continuing moving   higher after the fed, it’s bad news.   If it does continue, then the next pullback will the be the last ahead of year-end rally to all time highs.  \n\nHence why what’s happens next Wednesday really dictates the markets direction.", "score": 2, "replies": []}]}, {"body": "Ok what about Microsoft", "score": 1, "replies": [{"body": "Same exact thing.  Microsoft was the simultaneous victim of ultra high P/E ratios overcorrecting to an extreme low p/e environment.  \n\nAlso, Microsoft’s growth stalled big time for a good long while and picked up again in the post-2010-era.  \n\nI remember correctly its earnings grew at only around 10% per year during that whole era.   But Microsoft P/E ratio peaked at the ~90 in the dot-com era.  \n\nDo you know what Microsoft average growth was from 2014 to 2024?  Close to 25% per year!  \n\nIts growth rate during this past decade was more than double the growth rate during the 2000 to 2010 era.  \n\nMicrosoft was viewed as a stable bell weather in the 2000 to 2010 era once things bottomed after the crash.  During that whole Greenspan era. Microsoft was a value stock. \n\nBut I’m going off of memory and some back of the napkin math looking at MSFT’s income at the start of the decade and at the end of the decade. \n\nThe reality is this.  If the company you’re invested in is delivering solid top and bottom line growth, and if the P/E ratio is within reason, the stock will fully recover after a crisis.  \n\nIf Nvidia revenue and earnings were to stall and the company falls short of reporting $3.00 in EPS, then sure it’d collapse and not recover for a long while.  \n\nBut if the company is delivering, it’ll always recover quickly.", "score": 1, "replies": [{"body": "Do you think nvidias revenue will keep growing though? Is this current growth sustainable? Or will it flatline?", "score": 1, "replies": [{"body": "It doesn’t need to growth at the levels we’ve seen for the stock to go higher.  It just needs to be moderate growth.  Nvidia’s forward p/e is in the high 20’s to low 30’s.  That right there suggests the market isn’t looking for anything insane", "score": 1, "replies": []}, {"body": "As long as Nvidia continue to deliver a small beat on the consensus estimates, it’ll continue to make new all-time.  \n\nThe vast majority of market participants mostly rely on what analysts are forecasting.  If a company consistently delivers results above the consensus of Wall Street analysts, it will continue to move higher.  \n\nAgain, this assumes the company trades at a reasonable p/e multiple.", "score": 1, "replies": []}]}]}]}, {"body": "Thanks for all the great info!  I enjoy reading through your posts and comments.  Quick question for you - If I have 100K right now, where do you think it's best placed? Not financial advice, just where do you see most potential? DITM 2026 leaps for NVDA? Or how about for SPY or IWM? I have some calls expiring and plan to take profits soon, just wondering from your perspective where you feel the best return potentials are.", "score": 1, "replies": []}]}]}]}]}, {"body": "Targeting a $90-$95 entry point to increase my NVDA position!", "score": 4, "replies": [{"body": "you really think it will drop that much?", "score": 1, "replies": []}]}, {"body": "HE IS BACK  OUR MESSI AHHHHHHHH DIESELCOCK FUARKKKKKKKKKKKK IN ME AWWWWWWWWWWW  AHHHHHHHHH", "score": 4, "replies": []}, {"body": "TLDR: I will charge you a monthly premium to give you every possible scenario for the market every day.", "score": 3, "replies": []}, {"body": "I'll happily buy your shares at $60-$65 in May 2025.", "score": 2, "replies": []}, {"body": " Yeah I’ll wait until i see Nvidia don’t sell out every time weak hands break even", "score": 1, "replies": []}, {"body": "I guess we shall see what’s going to happen 🤷", "score": 1, "replies": []}, {"body": "save us mr dieselcock", "score": 1, "replies": []}, {"body": "Probably 9:43 Central Time tomorrow", "score": 1, "replies": []}, {"body": "Diesel and TearRepresentative56 are the Reddit version of the Wall Street Journal", "score": 1, "replies": []}, {"body": "DITM 2026 leaps? The theta is crazy already", "score": 1, "replies": [{"body": "Yeah so the idea is to be in options long-dated enough to handle the beginning of a bear market.", "score": 2, "replies": []}]}, {"body": "Thank you for taking the time to put together such a Great write up.  I'm going to have to disagree though, it does matter a lot to me whether NVDA bottoms at $90 or $100.", "score": 1, "replies": [{"body": "So the reason it doesn’t make a huge difference for us is because we’re long-term oriented and look at it from the perspective of long-term returns.  From that perspective, we’re good buying at $100 and watching it dip to $90.  \n\nThe reason we don’t wait for $90 is the opportunity risk for missing the entry.  Down 30% from its all-time highs is a damn good opportunity.", "score": 1, "replies": []}]}, {"body": "Literally today lmao. Impatience in here is willllld", "score": 1, "replies": []}, {"body": "I did not read shit!", "score": 1, "replies": [{"body": "Then go back to Tiktok. That's more your speed. Lol", "score": 2, "replies": []}]}, {"body": "Okay, someone explain this to me like I’m 6 and use these words: banana. Mario. Dr Phil.", "score": 1, "replies": [{"body": "Dr. Phil, banana, Mario.  Mario.  Dr. Phil.  Mario.  Banana!  \n\n…\n..\nBanana, Banana.  Banana! Banana! Banana!  OH SHIT!!  Banana!!!!", "score": 3, "replies": [{"body": "Ohhh okay 🙂‍↔️", "score": 1, "replies": []}]}]}, {"body": "It will end when you sell.", "score": 1, "replies": []}, {"body": "Probably ends next Tuesday at 3 pm. Hopefully", "score": 1, "replies": []}, {"body": "I'm not reading that.. What's the TLDR? Give me the date, please. :)", "score": 1, "replies": [{"body": "TLDR, go back to Tiktok. That's mlre your speed. Lol", "score": 1, "replies": []}]}, {"body": "Wake me up when SeptemBEAR Ends", "score": 1, "replies": []}, {"body": "Never. Being a retail investor we always get in late some of us not all of us and never sell and then lose or miss out. \n\nWe don't have the resources the charts or anything like that sure you can argue there's some awesome people here but why would you be on a Reddit group you've enjoying your millions and Bahamas and not wasting your time :-)", "score": 1, "replies": []}, {"body": "holy fuck that's a long post", "score": 1, "replies": [{"body": "People are too used to the 5 sec things with Tiktok, haha", "score": 1, "replies": []}]}, {"body": "What a great read! I still want NVDA to bottom at around $90 to buy more. Will however DCA well into next week.", "score": 1, "replies": []}, {"body": "I’m gonna guess when the price matches the valuation.", "score": 1, "replies": []}, {"body": "My god brother, my girls only fan’s modeling contract wasn’t this long. Agree with you on all points actually and well written. I bought more NVDU today. Good luck guys tomorrow, Asia is looking green.", "score": 1, "replies": []}, {"body": "As I was scrolling I was also seeing wondering when will the post finally end. 😂", "score": 1, "replies": []}, {"body": "we going higher baby", "score": 1, "replies": []}, {"body": "This stock is doing absolutely nothing now. It’s huge run up with potentially slowing of global economy is setting in for a potential new bottom.", "score": 1, "replies": []}, {"body": "Corrections can last anywhere from a few weeks to many months. There is a good chance that we'll see more downward pressure than upward for the next month or two at least. \n\nPeople here are too focused on daily fluctuations - that is *not* how you invest. All stocks go up and down at different points, all stocks have corrections many times. It is a natural part of market behavior. If you can't handle that, invest in an ETF and don't look at it again until retirement.", "score": 1, "replies": []}, {"body": "2026", "score": 1, "replies": []}, {"body": "One cent dividend incoming,  so exciting. Why are they bothering with that", "score": 1, "replies": [{"body": "It opens up certain funds that are only allowed to invest in dividend yielding stocks.  So it helps with demand for the stock.", "score": 2, "replies": []}]}, {"body": "Thank you for the analysis. I was wondering what you thought about September patterns and if they would influence market corrections/ the best time to buy in? Is there any merit in waiting for the last couple of weeks in September or early October before making a move?", "score": 1, "replies": [{"body": "Anytime you wait to buy, you take on opportunity risk.  Nvidia is down 30% from its highs.  Can it drop 50%?  Sure.  \n\nBut personally id rather buy at down 30%, watch it drop 20% further, bottom and then rally 100% from its lows than wait to buy, watch it bottom ahead of my expected price target and then watch it run to $150 without me.  \n\nThe question is how much opportunity risk are you willing to take on that forecast.  The analysis above suggests we could easily see the markets grind lower until the fed next Wednesday.  \n\nThat puts us near the end of September.  But I still bought at $104 and at $101 because I’d rather just be in and not watch the stock rally without me.  \n\nBut I’m very long-term oriented.  I’ve taken my positions on the thesis that I’m in this for 2-years+.  So I can only really speak to that time frame.  On that time frame, very happy with Nvidia at $100.", "score": 6, "replies": [{"body": "At the 2 yr+ time frame, what is the price you think NVDA would be at? More or less around 150 or higher?", "score": 1, "replies": [{"body": "I’d expect $150 minimum and likely higher than that.  If Nvidia sees reasonably moderate growth through 2026, then we’ll see it in the high $100’s.", "score": 1, "replies": []}]}]}]}, {"body": "Tomorrow . I urge everyone to buy", "score": 1, "replies": []}, {"body": "The market is in doubt that another 1000% growth in earnings is on the horizon due to\n\n\n* doubt the customers are willing to keep spending as much \n\n* doubt that if customers keep ordering more and more without limits, NVDA can ramp up fast enough \n\n\nBoth of these are going to have to show solid indicators for the direction to fully reverse. QQQ can plummet but the shovel maker can still double in price if people keep ordering 10x as more shovels as they did last FY. The question is will they. \n\nSorry everyone but if orders stay stuck at “only” 2x that won’t justify $140", "score": 1, "replies": [{"body": "1000% growth isn’t necessary.  The stock never traded in-line with its growth.  So as the stock climbed, its P/E ratio never really expanded to unreasonable levels.  \n\nFor the stock to continue higher, it merely requires that it remain on its current growth trajectory outlined by the consensus of market analysts.  That’s $125 billion this year and $178 billion next year on revenues.  $1.20 this year and $2.90 next year on EPS.  \n\nGrowth like that will take the stock to analyst price targets of $150+ a share.", "score": 2, "replies": []}]}, {"body": "The real market correction hasent even started. Zoom out.", "score": 1, "replies": []}, {"body": "When you are financially and psychologically exhausted", "score": 0, "replies": []}, {"body": "Nvidia fair price is probably still 20% cheaper than it is today", "score": 0, "replies": [{"body": "I’d like to see you outline your valuation model for that.   Because virtually every major brokerage house and every professional analyst disagrees with you.  \n\nIf you think you know better than the professionals who do this for a living, then let’s see it.  Show me why you think Nvidia “fair price,” or fair value as an analyst might call, is 20% below current levels.  \n\nIt’s one thing for a price to drop 20% or to forecast a potential drop of 20% below current levels, and another to suggest that $80 a share is fair value.  \n\nLet’s not keep everyone in suspense.  I’ll tell you right now, fair value isn’t at $80 a share.  But I’m always interested in hearing why anyone would think this when ALL the evidence points to the contrary.", "score": 6, "replies": [{"body": "He and a lot of the other people on here are just here to write bearish crap with 0 evidence to support the claims, only to rattle other people with very low effort trolling. In reality, they're just super salty they missed the last 5 years of nvda skyrocket and are just rubbing their hands at every single shred of bad news about it.", "score": 3, "replies": []}, {"body": "I literally am a “professional that work who do this for a living”\n\nIf you still believe in target prices by sell side research, you are a fool.", "score": 0, "replies": [{"body": "So I presume you are a buy side analyst?  That’s what \nI take from your post here.  And as a buy side analyst, your conclusion is what?  Nvidia is worth $80 a share?  \n\nNvidia’s management just invested $50 billion buying back into its own stock.  It’s highly doubtful that management would take such a course of action if it didn’t expect to report upwards of $3.00 per share in 2026 conservatively speaking.  \n\nThe consensus on the sell side is at $2.78 and Nvidia has been well above the consensus for a while now.  Meaning, the sell-side has been consistently right for the past two years.  \n\nSo let’s assume it repots $3.00 in EPS next year.  That puts Nvidia at a 26 P/E ratio at $80.  Somehow I highly doubt any buy side analyst at any reputable fund is going to forecast a 26 trailing P/E ratio for Nvidia next year. Its forward p/e would be somewhere in the teens.  \n\nUnless you think Nvidia, growing faster than all of its big tech counterparts is going to somehow trade at a lower forward p/e and trailing P/E ratio, fair value is far north of $80 per share.\n\n—-\n\nEdit:  here I’m speaking to fair value.  A whole lot more goes into determine actual value than just fair value.  Positive interest rate environment, job growth, bullish market  sentiment, the stage of the business cycle etc all impacts price.  \n\nBy the way, no analyst uses the terms “fair price.”  That to me is a huge hint that you’re not a buy side analyst.  They’d use the terms “fair value.”", "score": 3, "replies": [{"body": "Besides the stock market how did you make your money earlier in your life ? In other words , what career field were you in before learning about stocks or has it always been finance ? Thank you if you respond", "score": 1, "replies": [{"body": "It’s always been the market.  I started in college and even though I have advanced degrees, I never worked in any other field.", "score": 1, "replies": [{"body": "Very good diesel , that’s what I figured. While you are here can you please answer this question I have? \n\nOn the day of the last report I bought 50k dollars worth of NVDL and I’ve held ever since. My average price per share was $66.5. \n\nWhat would the price of NVDA have to be in the near future for me to be able to break even ? At the time of purchase NVDA was $125 per share. Thank you in advance", "score": 1, "replies": [{"body": "Not sure what your break-even will be because leveraged ETFs are notorious for being unreliable.  I’m actually writing an article on this very thing.  \n\nI stopped investing in leveraged ETFs over a decade ago because they don’t track as they’re supposed to.  \n\nI’m doing some analysis on NVDL at the moment and hope to have something published over the weekend.  \n\nBut if it did track, then you should break even at the same price that Nvidia was at last time you bought NVDL.  If that is $125, then that should be your break-even.  \n\nBut as I said, leveraged ETFs don’t always track and become uncorrelated all the time.  \n\nFor example, Nvidia’s all time high was $140.75.  It’s high in late August before earnings was $131.25 correct?  That’s only down 6.75% from its all-time highs.  \n\nBut when Nvidia was at $131.25, NVDL was 22.47% from its highs.  That’s more than TRIPLE percentage difference.  \n\nIf you bought NVDL is when Nvidia was at $140.75 and the stock drops to $131.25, you should only be down 13.5%.  Not 22.47%.  \n\nThat right there is exactly why I don’t invest in levered ETFs at all.", "score": 5, "replies": [{"body": "This is because of volatility decay, esp. on daily leveraged etfs.\n\nIf a 1x leveraged ETF (a normal ETF) bought at 100 goes down 20% on day 1 then goes up 20% on day 2, it'll be at 96.\n\nThe 3x leveraged ETF counterpart bought at 100 would go down 60% on day 1 then go up 60% on day 2, and end at 64, which is way lower than what you would expect based on the 1x leveraged ETF.\n\nLeveraged ETFs can be good short term plays for stocks like Nvidia. It can be a good idea when you are almost sure the stock will go up. But the more volatility, the worse the results will be. And they can even be a good long-time hold (see TQQQ performance since 2010), especially with a strategy in place to avoid downturns, like selling when QQQ price is below 200SMA.", "score": 2, "replies": []}, {"body": "Thank you for your time and effort and knowledge. I hope to read an updated post from you on this surging NVDA rally ? Is this what was expected ? Some things to look for ,  just some general thoughts on what’s currently going on would be awesome to read and learn from. Thank you diesel for your time and experience", "score": 1, "replies": []}]}, {"body": "Not sure what your break-even will be because leveraged ETFs are notorious for being unreliable.  I’m actually writing an article on this very thing.  \n\nI stopped investing in leveraged ETFs over a decade ago because they don’t track as they’re supposed to.  \n\nI’m doing some analysis on NVDL at the moment and hope to have something published over the weekend.  \n\nBut if it did track, then you should break even at the same price that Nvidia was at last time you bought NVDL.  If that is $125, then that should be your break-even.  \n\nBut as I said, leveraged ETFs don’t always track and become uncorrelated all the time.  \n\nFor example, Nvidia’s all time high was $140.75.  It’s high in late August before earnings was $131.25 correct?  That’s only down 6.75% from its all-time highs.  \n\nBut when Nvidia was at $131.25, NVDL was 22.47% from its highs.  That’s more than TRIPLE percentage difference.  \n\nIf you bought NVDL is when Nvidia was at $140.75 and the stock drops to $131.25, you should only be down 13.5%.  Not 22.47%.  \n\nThat right there is exactly why I don’t invest in levered ETFs at all.", "score": 1, "replies": []}, {"body": "Not sure what your break-even will be because leveraged ETFs are notorious for being unreliable.  I’m actually writing an article on this very thing.  \n\nI stopped investing in leveraged ETFs over a decade ago because they don’t track as they’re supposed to.  \n\nI’m doing some analysis on NVDL at the moment and hope to have something published over the weekend.  \n\nBut if it did track, then you should break even at the same price that Nvidia was at last time you bought NVDL.  If that is $125, then that should be your break-even.  \n\nBut as I said, leveraged ETFs don’t always track and become uncorrelated all the time.  \n\nFor example, Nvidia’s all time high was $140.75.  It’s high in late August before earnings was $131.25 correct?  That’s only down 6.75% from its all-time highs.  \n\nBut when Nvidia was at $131.25, NVDL was 22.47% from its highs.  That’s more than TRIPLE percentage difference.  \n\nIf you bought NVDL is when Nvidia was at $140.75 and the stock drops to $131.25, you should only be down 13.5%.  Not 22.47%.  \n\nThat right there is exactly why I don’t invest in levered ETFs at all.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Thanks for your detailed DD", "score": 0, "replies": []}, {"body": "I'm sorry for your loss or congratulations.\nI'm not going to read all of that.", "score": -1, "replies": [{"body": "Then go back to Tiktok. That's more your speed. Lmao", "score": 1, "replies": []}]}, {"body": "I would have preferred that you led with the macro stuff, given so many people here have tunnel vision. Rotations and corrections usually have little to do with a single underlying asset and as investors people here should learn more about what causes the market to cycle the way it does. \n\nBut thank you for your service.", "score": -1, "replies": []}, {"body": "TL;DR - Mid-October 2024", "score": 0, "replies": []}, {"body": "Jesus christ when does this post end", "score": 0, "replies": [{"body": "By the time you finish reading it, the correction will already be over. It’s set up that way on purpose.", "score": 5, "replies": []}]}, {"body": "Today the S&P 500 broke resistance but it's 11:00 a.m. and it looks to be a fake out. Meaning it's going to drop hard again for a few days if not weeks. Also the inverted yield curve is at 530 days which is the same as the other recessions so I'm going to peace out and chill out for a while", "score": 0, "replies": []}, {"body": "I am not sure what all the hype is around these posts. He basically updates his outlooks adjusting for  all possible  scenarios so he can't be wrong. People go crazy over this but it is just a word salad telling you it could go up, down, or sideways. Don't forget that he once made a huge point this year that NVDA would be stuck at 120 because of it hitting 3 trillion. Now a few months later that has all changed as he now is telling you 150. Guess what...Sept is a bad month for the market historically. Of course there will be a sell-off. Guess what again....Nov is one of the most bullish months and throw in a election year it is even more bullish.  What is even more crazy is he wants to charge for this. Just go with the Stock Whisperer if you are day or swing trading it is much cheaper and she has live views of her chart on her morning live casts....daily!", "score": -4, "replies": [{"body": "Link? Thanks😌", "score": 1, "replies": []}]}, {"body": "Did AI write this?  It's written at a 3rd grade level without anything meaningful in it. \n\nCould you publish your real name and qualifications? Do you only post at 3:30am est?  \"Nvidia will likely trade between $90 and $150\" -no shit.   All this post does is repackage information already said", "score": -18, "replies": [{"body": "The top of the post literally says his name, and why are you so butt hurt? You’re asking if this post was written by AI like a jealous kid wanting the other kid’s lollipop", "score": 4, "replies": [{"body": "Are you sam wiess?  Have you seen his site with no bio what so ever?  That doesn't sound like a fake name? If I was going to take the write an opinion piece I'm starting all my qualifications with detailed verifiable evidence supporting my position so people know where I'm coming from.    \n\nNone of these posts would be acceptable as academic reports, even through they are written to fool people who don't know any better.", "score": -5, "replies": [{"body": "You’re taking it way too serious. He cannot predict a downtrend neither can he predict an uptrend, so calm down and move on.", "score": 3, "replies": [{"body": "You are oddly deflecting and defending him.   I was not asking him to predict anything. His post is no better than any of the other top level, spam  posts that say nothing. The finance bros on CNBC give more detailed info. \n\nIf \"Sam wiess\" was a legit person, with actual training, actual research and quality analysis he isn't showing it.  It's just as spammy as all the other posts on here. \n\nYou should really up your quality standards for posts like that.  It's 10th grade level, not MBA level.\n\n*Note I did enjoy the part about the historical timing of the drip in relation to the fed announcement.  That was different and I appreciated that.  His whole post could have just been that paragraph.", "score": 2, "replies": [{"body": "Definitely not defending him, and not taking his post too serious.", "score": 2, "replies": []}, {"body": "Have you read his replies? Seems like he knows his stuff , he is very technical when it comes to establishing his value assessments albeit I don’t know enough to say one way or the other", "score": 1, "replies": [{"body": "It's all top level.  It's written to imply he knows his stuff without actually going into detail", "score": 1, "replies": [{"body": "Sorry I meant his replies to other users replies ? Not his main post but his rebuttals , that’s where I can take him a little more seriously. Also, his stance on how the market normally repairs itself is refreshing to read and puts things into perspective for me", "score": 1, "replies": [{"body": "I have, it does but it's top level.  It's reference and evidenceless.  If I was giving ba opinion, I say where I'm coming from, my experience and in a case like this detailed supportive information.  Especially if he's trying to build a client base. His name could be fake, his site lists no bio, no affiliation, it's a generic site.  You need to consider the source.", "score": 1, "replies": [{"body": "The thing is he seems very vaguely, and most of the time his posts will encompass all possibilities.  You also don't know what his motives are.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What a loser. Lol", "score": -1, "replies": []}]}, {"body": "if I had to sign that disclaimer to walk into a casino, i would never go\n\n  \nTLDR", "score": -5, "replies": []}, {"body": "Bro the correction just started lmao", "score": -8, "replies": []}]}
{"title": "Is it a buy for nvidia", "selftext": "So nvidia is now ranging at $102.83. I just wanna if it is a good price range to build a buying position or i should wait for more correction. What are your opinions?", "id": "1fcojoa", "created_utc": 1725885916.0, "score": 130, "upvote_ratio": 0.78, "num_comments": 176, "comments": [{"body": "No one is EVER going to know, however Cramer says it's really cheap, so expect it to plunge. LOL.", "score": 259, "replies": [{"body": "Iirc someone did a meta data analysis of all of Cramers decisions and found that he beats the market on short term advice and is below average on long term takes.", "score": 43, "replies": [{"body": "yeah Cause he pumps it on TV.", "score": 43, "replies": [{"body": "Self fulfilling prophecy short term yeah", "score": 8, "replies": []}, {"body": "Do people still watch TV nowadays?", "score": 8, "replies": [{"body": "good point", "score": 2, "replies": []}, {"body": "Fast Money with Melissa Lee", "score": 1, "replies": []}, {"body": "Who is this creamer guy?", "score": 1, "replies": []}]}, {"body": "Exactly haha", "score": 1, "replies": []}]}]}, {"body": "I know someone who turned 5K into over 100K following when Cramer talked about NVIDIA at $5 and doing his own research after. Don’t watch him, but don’t understand the hate for the guy. \n\nIf you base all your investment decisions solely on a dude with a show you deserve to lose your money. Nothing to stop you from hearing about a stock on there and doing your own research after the fact.\n\nSeems like the hate is mainly from people who take shows and Reddit posts for more than face value and have lost money doing so.", "score": 35, "replies": [{"body": "It's not hate, just look at the gains from the reverse cramer fund you can't deny. The guys got a back for predicting the inverse. It's outstanding.", "score": 11, "replies": [{"body": "Lmao is that a real tiker. Rcf?", "score": 5, "replies": [{"body": "Look up SJIM and LJIM", "score": 6, "replies": []}]}, {"body": "If you actually did research on this you'd know that etf has been liquidated and clearly wasn't profitable enough to continue.", "score": 7, "replies": []}, {"body": "Cramer's picks have actually been doing well over the past year and the inverse Cramer ETF has been getting hammered (down 20% the past year): [https://finance.yahoo.com/quote/SJIM/?guccounter=1&guce\\_referrer=aHR0cHM6Ly93d3cuZ29v\\[…\\]jLTsyJi9gdG3iAjOc4whMCjWhTWAq61d4EDU0WomNoXCokBsDcp\\_fn2F0YZp](https://finance.yahoo.com/quote/SJIM/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAApnlSZjYQF76Q_49p-KBOFq2XvamS5PWKHnVWS5en0mt6dbArPbcSPHI3c5eJcntEZABPWP6YslaojHcGm8Pr7iOtJtEK0w_1OIBjsyErqvNb1fjLTsyJi9gdG3iAjOc4whMCjWhTWAq61d4EDU0WomNoXCokBsDcp_fn2F0YZp)", "score": 2, "replies": []}]}, {"body": "He did this one video talking smack about retail traders, and how he F’s them over. Have you seen it?", "score": 1, "replies": []}]}, {"body": "What’s funny is that Cramer said to watch out on earnings, and everyone thought haha inverse Cramer funny.\n\nHe ended up being right lol and so many lost their calls", "score": 4, "replies": []}, {"body": "\"Really cheap\" \n\nDefinition has really changed.\n\nNot saying it isnt a good company but cheap it is not", "score": 3, "replies": []}, {"body": "funny thing is, Cramer is actually NEGATIVE on the name in the short term. Dude is a clown but my god, people overdo the hate on here - no\nmatter how inaccurate - for a handful of likes", "score": 2, "replies": []}, {"body": "Cramer's picks have actually been doing well and the inverse Cramer ETF has been getting hammered (down 21% the past year): [https://finance.yahoo.com/quote/SJIM/?guccounter=1&guce\\_referrer=aHR0cHM6Ly93d3cuZ29v\\[…\\]jLTsyJi9gdG3iAjOc4whMCjWhTWAq61d4EDU0WomNoXCokBsDcp\\_fn2F0YZp](https://finance.yahoo.com/quote/SJIM/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAApnlSZjYQF76Q_49p-KBOFq2XvamS5PWKHnVWS5en0mt6dbArPbcSPHI3c5eJcntEZABPWP6YslaojHcGm8Pr7iOtJtEK0w_1OIBjsyErqvNb1fjLTsyJi9gdG3iAjOc4whMCjWhTWAq61d4EDU0WomNoXCokBsDcp_fn2F0YZp)", "score": 1, "replies": []}, {"body": "Whats the hate for cramer? My dad literally became a millionare after retirement for following his advise, of course no one will ever be a stock guru, but he's just a stock news host that gives his opinion...", "score": -16, "replies": [{"body": "Your dad is boomer shit was fkin cake back then", "score": 34, "replies": [{"body": "Dude the market used to lose 90% of its value in two days back then.\n\nAlso my dad got into the stock market when he retired 7 years ago... He grabbed all his retirement money and bought stocks.", "score": 0, "replies": [{"body": "So he started with millions? Lol. My current saving nearing a millions too and I bet had I been around saving during boomer time I would have a lot more", "score": 1, "replies": []}]}]}, {"body": "I've heard that there's an ETF that does exact opposite of what he says lol", "score": 13, "replies": [{"body": "There is and it’s not doing well", "score": 9, "replies": []}, {"body": "Sjim it's being shut down.", "score": 2, "replies": []}, {"body": "Yeah and its not very smart to invest in it.", "score": 2, "replies": []}]}, {"body": "It’s the kids hating on him", "score": 3, "replies": []}, {"body": "It's a meme at this point. Cramer is an entertainer first and foremost. If you think he's an idiot, you're the idiot.", "score": 3, "replies": []}, {"body": "same. my dad made a decent fortune in no small part due to cramer", "score": -5, "replies": []}]}]}, {"body": "Nobody knows! If you believe in NVIDIA and their future, sure you can buy now. Always do your research on the company and only invest in what you believe! And don't sell!", "score": 38, "replies": [{"body": "Invest in what you believe > time the market", "score": 10, "replies": [{"body": "Invest in companies with consistent earnings > investing in what you believe. \n\n“Believing” in a company means nothing without a valuation attached to it. You may think that Solar and Wind were the future in 2021 and that investment had turned to dust based on “belief” that still may be true.", "score": 6, "replies": [{"body": "Investing in what you believe, gives a big \"why\" in order to hold your stocks during though times. If you invest in consistent earnings alone and see the prices drop, you would probably sell quickly and that is not \"investing for the long run\".", "score": 2, "replies": []}, {"body": "But ofcourse, you also need to do your research on the company itself!", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "Same here, bought more last week at $102 US….long term hold for me.", "score": 3, "replies": [{"body": "It is going to $90", "score": 3, "replies": []}, {"body": "Who is their next round of customers when the trillion dollar data centers are complete?  Are those data centers going to get revamped that quick?  Is the next wave of their chips so much better that $30k chips can be tossed in a year?", "score": 1, "replies": []}]}]}]}, {"body": "Thanks for that most generic and often repeated cookie cutter advice.", "score": 2, "replies": [{"body": "No problem! It works for me, almost never want to sell and long term profits feel very good!", "score": 1, "replies": []}]}, {"body": "> Nobody knows! If you believe in NVIDIA and their future, sure you can buy now\n\nJust because you believe a company will do fine in the future, it doesn't mean that it's way overpriced.\n\nAlso, betting on the future of hardware tech companies is very risky and every time we've had monopolies (Intel, Cisco, Seagate all looked like it at some point) we've been proven that over decades McDonald's was a much better bet if you bought at high prices.", "score": 1, "replies": [{"body": "Sure, if you think the current price is too overpriced, then you shouldn't buy. But most of the time, you don't know for sure. Real estate same thing, 'overpriced' 2 years ago, but the price is till going up as we speak...", "score": 1, "replies": []}]}, {"body": "Cisco is still a company to this day. They still have a space, But they have never regained their 2000s highs. This company is massively over valued on a short term dream from a few major companies, if and when AI doesnt materialize like they expected, NVDAs sales will plummet. They will still be a solid company with a good MOAT in the industry. But that doesnt guarantee they ever again reach that 3 T market cap or really anywhere close. This is absolutely not the time to buy NVDA, dont get caught by FOMO because you missed the boat, this run is likely over or close to it. Dont try to catch a falling knife, more often than not you get cut.", "score": 1, "replies": [{"body": "Time will tell bro! Let's revisit this comment after a couple of years :)", "score": 1, "replies": [{"body": "Just simple history dude. Everytime this happens there's a crash that follows and a few companies rise from the ashes. NVDA is unlikely to keep this lead on their competitors indefinitely. They may recover like MSFT did after the 00s. But they may also be like Cisco. Either way, it will be a long time to never until they regain these highs consistently.", "score": 1, "replies": []}]}]}]}, {"body": "I was at a soothsayer on friday, she asked me to think of something, then read from my coffee grounds and then told me that my dolphin (something good, what I'm looking fir) is out of reach for now. It might take a week or years but my dolphin will come.\n\nSo long Nvidia it is", "score": 31, "replies": [{"body": "Yoo what’s her number???", "score": 4, "replies": [{"body": "any", "score": 3, "replies": [{"body": "911", "score": 5, "replies": []}]}]}]}, {"body": "Long term buy.", "score": 43, "replies": [{"body": "Long term waste", "score": -37, "replies": [{"body": "Puts?", "score": -1, "replies": []}]}]}, {"body": "I thought about this recently.  I work at a startup that is focused on using AI/LLMs in e-commerce.  I come across a lot of startups using AI and LLMs.\n\nI think that end-user facing AI is kind of in a downward trajectory of the hype cycle.  But *AI for backend processes and automation in enterprise workflows* is just scratching the surface.  What AI is particularly good at is understanding and making sense of unstructured data (which isn't all that different from language).  Whether you're talking APIs or documents, AI can eliminate A LOT of low level human resources when applied in the right context.\n\nThe question is this: will demand for AI increase or decrease over the next decade?  \n\nDo you think someone is building better hardware and/or software to power that demand than Nvidia?  Do you see a competitor taking their share of a growing pie?\n\nIf your answer to those questions is \"Yes\" and \"No one\", then you should invest in Nvidia.  Whether you can time it right or not is the question.  Is it overpriced?  If you buy in now, will it still be overpriced in 10 years?  So whether you buy or not I think depends on your horizon. As always, DCA is probably the right answer.", "score": 43, "replies": [{"body": "What a fkin longass response just to say “it depends”", "score": 28, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Ppl in the industry are concise and straight forward with their opinions. If you think this is good insight I have a floating bridge to sell you.\n\nYou can’t tell between good input and just word salad can’t you?", "score": -7, "replies": [{"body": "You didnt sell at the top, did you?", "score": 1, "replies": []}]}]}, {"body": "Sounds like he’s about to promote some sort of stock picking product.", "score": 0, "replies": []}, {"body": "Yes dog shit response omfg", "score": -10, "replies": [{"body": "Go cry bout it", "score": 1, "replies": []}]}]}, {"body": "As well as being on a downward trajectory for the hype cycle, the models themselves are trending towards being lighter and faster as well. I'm predicting that between regular hardware getting faster and models getting streamlined, 99%+ of text and audio AI use cases will be able to run comfortably on regular high street consumer hardware within a few years. \n\nA lot of it'll still be Nvidia hardware so they're not going bust any time soon, but the days of them selling $40,000 graphics cards faster than they can make them won't last forever.", "score": 2, "replies": [{"body": "The equation isn't quite that simple.  For starters, training is still very expensive and time consuming and will never be done on consumer hardware.  Companies training and fine-tuning models will continue to be using the high-end hardware because it will be faster.  If you want to lead in this space, you need to be able to both iterate and train quickly as well as provide faster and faster inference.\n\nAssuming inference can be done well on consumer hardware, the fact would still remain that it would be faster on high-end hardware so SaaS services will continue to compete on speed and thus will continue to drive high-end hardware, even if inference can be done locally with high competence for some subset of use cases.\n\nWorking in this space, I can say that the shift from GPT-4 to GPT-4o and GPT-4o Mini *in terms of throughput* has been groundbreaking because it opens up a new set of use cases which were not previously possible due to the latency of GPT-4.\n\nI think we are also just at the beginning of AI generated media.  It's just getting to the point where AI generated video is getting scary good.  The applications of this, given another 10 years, are going to have wide ranging effects across a variety of industries from video games to television/streaming to movies to who knows.  Real-time video generation is going to require ever more powerful hardware.  [This is what diffusion was doing 10 years ago](https://www.reddit.com/r/StableDiffusion/comments/y9zxj1/you_think_thats_insane_heres_what_an_aigenerated/).  [This is what diffusion is doing today](https://www.reddit.com/r/StableDiffusion/comments/1fclz6u/pussy_paradise_flux_runway_details_on_first/).  Industries are going to feel a tectonic shift and all of it will need hardware.\n\nI think in general, the pie grows tremendously over the next decade in a way that even if on-device inference becomes realistic, accurate, and efficient, the overall demand for high-speed and high-throughput inference on the backend will drive increasingly more capable high-end hardware.  There is a point of diminishing returns, for sure, but we're not close yet, IMO.\n\nAnd in this space, there doesn't appear to be any competition with AMD a distant second.  \n\nOne risk I can see is that China has been effectively cut off and is now has some pressure to build some of these capabilities internally.  Given 10 years, could they eventually surpass TSMC and Nvidia?  China could also invade Taiwan.  China is the biggest question mark when it comes to Nvidia's dominance, IMO.  Edit: and US anti-trust 🤣", "score": 2, "replies": []}]}, {"body": "I am gonna chatgpt this wall of text to summarise", "score": 1, "replies": []}]}, {"body": "If Nancy pelosi is in — I’m in", "score": 20, "replies": [{"body": "The real answer.", "score": 3, "replies": []}]}, {"body": "Im buying NVDL in anticipation of growth. It pays 2x , leverage against NVDA\n\nMy avg with NVDA is $107 with 100 shares. Very long hold\n\nI only have 20 shares of NVDL. Very short hold.", "score": 14, "replies": [{"body": "Be careful with leveraged or inverse ETFs. They generally tend to be composed of financial instruments with the objective to provide leveraged returns on the underlying instrument over a single day. When held over a long term, especially during volatile markets, the returns tend to diverge significantly from the underlying instrument.", "score": 7, "replies": [{"body": "Thanx, and Agreed, I have my hopeful exit strategy. Likely won’t hold it through the weekend.", "score": 2, "replies": []}, {"body": "Update, still holding 20 shares NVDL at 44.73\n\nFirst time in a leveraged stock. Way too much fun to sell “atm”. \n\nDoubt it’s gonna hit my target in my timeframe. \n\nNVDL is 52.82 atm. \n\nKeep riding or get out?", "score": 1, "replies": []}]}, {"body": "You’re almost where I am exactly share wise and basis with NVDA Long term hold. \n\nMay buy more if it goes below $100.", "score": -1, "replies": []}]}, {"body": "I'll wait for it to touch $95 and see how it holds. If it moves sideways for a few days I'll buy it.....if it dips, I'll jump in around $90, if it bounces up....I'll wait for it to hit $95 again and buy it. \n\nThis is provided there's no external news impacting it.", "score": 4, "replies": [{"body": "I agree... I think it will be back down in the low to mid 90s within the next month.  It has dropped every September over the last few years.", "score": 1, "replies": []}]}, {"body": "If you have $100 and have doubts maybe buying average\n\nie\n\n$25 now\n$25 next month\nand so on \n\nidk, is a dumbass strategy but if you long term investor i think it may be a conservative strategy", "score": 6, "replies": [{"body": "I do 35 bucks a week. \n\nHave 4 stocks and one ETF I put into. \n\nIts adds up slowly. \n\nI told myself I wouldn't put more than I'm willing to lose and it's turned out pretty good so far", "score": 6, "replies": [{"body": "I’ve been doing $100/paycheck and putting random gifts/side jobs for the last year. $10k, not bad. 13% growth. Gotta start somewhere. AAPL/COST/SCHD/VOO.", "score": 2, "replies": [{"body": "try not to invest too much if you are at a young age. Investments are long term and i. the short term you’re gonna need quick funds. Not everyone’s life runs smooth and bills + funds come quick. \n\nI currently invest at $50 a week which is 5% my weekly income. i’ve been told this is a solid amount for a young age. The worst advice is invest all the money you can.Thats not how it works", "score": -5, "replies": [{"body": "Bad advice. Get as many assets as you can any price. There is no other way to wealth.\n \nIf you can't get liquid borrow it and pay it down. But get assets assets assets any price any time and hang on.", "score": 5, "replies": [{"body": "re reading this, this is some of the dumbest advice i’ve read on reddit. Would love to see your portfolio", "score": 0, "replies": [{"body": "It's all gold/silver but I'm a funded intraday trader.", "score": 1, "replies": []}]}, {"body": "oh boy", "score": -1, "replies": []}]}]}]}]}]}, {"body": "I bought at exactly 102, calls up 135% so far", "score": 2, "replies": [{"body": "I got in more at 105 and boy i'm happy I got in when I did lol.", "score": 1, "replies": []}]}, {"body": "No as the price was over ballooned, fake valuation and now it’s crash the way how supposed to be", "score": 3, "replies": []}, {"body": "I’ve gotten downvoted so many times on different forums for this, but it’s not a matter of if we are in an AI bubble, we ARE in a AI bubble. \n\nI use ARM as an example. They sell their CPU architecture for dirt cheap. They worked with NVIDIA before and still work for them. It’s currently a 125 BILLION dollar company with less than 1 Billion in Revenue (edit: meant yearly earnings here, but quarterly revenue does sit around 1 Billion). \n\nHere’s the thing, ARM exists because its CPU license architecture is cheap. ARM could provide its architecture to most of the market and that wouldn’t cause their earnings to match their current market cap. If they plan newer revenue streams they probably wouldn’t kick in soon enough. \n\nThats just one company, there are so many that won’t be leaders in AI who have talked the talk to inflate their stock prices. The street is going to want to see results and it’s not going to materialize for many. If one part of the sector massively fails, confidence even for the successful parts of the sector wanes. Everyone drops in that scenario, some much more than others. \n\nThe dot com bubble involved a lot more startups, but the premise is the same. New tech led to Skyrocketing valuations which may not be substantiated soon or rather soon enough. One characteristic of investor behavior during that time is that they totally overlooked ridiculous PE ratios, assuming the companies would pick up the slack. How many companies do you see today with PE ratios over 100 or nearing 100? ARM is currently over 300. The S&P 500 also went up 20% that year too. Is this all starting to sound familiar? \n\nWhen the bubble burst companies like Amazon and Cisco even lost a majority of their value. Famously, Cisco lost 80%. \n\nAll to say be careful, history has a funny way of repeating itself. Sure you can go with the mantra that this time it’ll be different. But I’m not too excited at this point to put all my eggs in this basket. \n\nI also work with GenAI and data science. Trust me, there’s a ton of legal red tape that has to be worked through at each of these companies before they even START working to implement the tech. It’s going to take time", "score": 5, "replies": [{"body": "Your revenue numbers are wrong. They earn approx. $1B per quarter (not year).\n\nLink: https://investors.arm.com/static-files/4f2fc46b-34a5-4bc5-94af-f13fbc348f0e", "score": 4, "replies": [{"body": "Ah my bad, was confused at first but read back what I wrote. I meant yearly earnings there. Good catch\n\nUsing your link, looks like operating income was about 391M for their fourth quarter. Also worth noting the link has non-GAAP income, I figured the +/- $100M at this point really doesn’t change the story around this being overvalued. But the GAAP earnings are 223M. Didn’t dive into here, but in this case whichever you choose, it doesn’t change the story.", "score": 2, "replies": []}]}, {"body": "You talk about things like putting \"all eggs in one basket\" and \"skyrocketing stock prices\" while the post was about buying NVDA and your only example is ARM.\n\nNobody talked about putting all eggs in one basket when you buy NVDA just to have \"AI\" in your portfolio.\n\nAnd while we're at it \"skyrocketing valuations\" for AI companies when we are looking at the market maker NVDA which currently sits at a forward PE of 36 isn't really the right description for it. Compare that to Cisco's 472 in 1999 and I think you see where I'm coming from. I mean even Costco has a higher P/E than that and we aren't talking about the retail bubble.\n\nIt may be a bubble, but we aren't even close to the heights we reached back then.", "score": 1, "replies": [{"body": "I never insinuated NVIDIA would pop like Cisco. But when these ridiculous valuations pop NVIDIA will drop too even if it has a more solid outlook. It’s the way the market works.\n\nYou’re taking the basket bit a little too literally, my point is if you didn’t put money in stocks heavily tied to AI earlier I’d wait. \n\nDont need to go through the list of AI adjacent stocks like ARM, AMD, Palantir, or Broadcom trading currently at 100x PEs or higher. There’s plenty. I cherry picked ARM to explain why it isn’t going to materialize. But I’d be interested to hear how you’d justify these companies cutting these PEs in half to justify their valuations. How do you know demand is going to continue? How do you know Microsoft and META are going to keep buying chips? And if theyre the biggest buyers for Nvidia chips along with other tech giants, how do you know they’ll pivot to AMD offerings? \n\nHave you checked how aggressive their forward PEs are? That means astronomical expectations they need to make true on. It’s not just 2 or 3 quarters of exceptional growth.", "score": 2, "replies": [{"body": "Microsoft and META are buying chips because they kind of said so.\n\n>To meet the growing demand signal for our AI and cloud products, we will scale our infrastructure investments with FY 2025 capital expenditures expected to be higher than FY 2024. - Microsoft CFO Amy Hood\n\n>We anticipate our full year 2024 capital expenditures will be in the range of $37 billion to $40 billion updated from our prior range of $35 billion to $40 billion. While we continue to refine our plans for next year, we currently expect significant CapEx growth in 2025 as we invest to support our AI research and our product development efforts. - Meta CFO Susan Li\n\nAMD doesn't have a P/E of >100. You have to look at its non-GAAP earnings since the GAAP earnings are screwed due to the Xilinx acquisition. AMD's foward P/E is in the 30s btw where the Xilinx acquisition is fully amortizised.\n\nTaking Palantir as an example is screwed as well since its P/E has been astronomical ever since its EPS has turned positive, for me it was always a meme stock tbh.\n\nBroadcom's forward P/E is 23.82. With a revenue growth of almost 50% each quarter I can honestly see that.\n\nI see where you're coming from but taking companies with real growth and real earnings to support that and comparing them with companies which had their values inflated because they simply had something to do with the internet and had no earnings to support that seems overblown.\n\nTo your point with the \"all eggs in one basket\": It seems I've simply misunderstood you, sorry about that.,", "score": 3, "replies": [{"body": "I work in IT ans my company is building their workflows using Generative AI; because lot of ppl sit in a discuss their IQ median is always less than 50. I feel even if it doesn’t grow to be new Apple, it will add a new value added in the existing suite of features.", "score": 1, "replies": []}]}]}]}]}, {"body": "Zoom out bud, stonk overprized", "score": 2, "replies": []}, {"body": "I already bought. It's a no-brainer for me.", "score": 2, "replies": []}, {"body": "Can I ask what app that you’re using to display this graph? I noticed icons below…. I’ve never seen anything that looked like that.\nThanks", "score": 2, "replies": [{"body": "Ind Money", "score": 2, "replies": []}]}, {"body": "It looks decent, but if you think there might be more dips, waiting could be wise. It depends on your strategy and risk tolerance.", "score": 1, "replies": []}, {"body": "See if it holds the rounder number 100", "score": 1, "replies": []}, {"body": "Always has been.", "score": 1, "replies": []}, {"body": "It will go 60's within next 2 quarters.", "score": 1, "replies": [{"body": "Based on?", "score": 1, "replies": [{"body": "They are out of gas. And that is not financial advice.", "score": 1, "replies": []}]}]}, {"body": "Tbh Nvidia is a solid company but it has been riding the AI hype train like crazy. Zoom a bit out and try to reason wether or not their increased valuation can be backed with the growing of their metrics. Personally I think it is a solid company to ownd but impossible to say if it will drop even more or not.", "score": 1, "replies": []}, {"body": "Didn't Pelosi just sell?", "score": 1, "replies": []}, {"body": "No shit its a buy", "score": 1, "replies": []}, {"body": "Will probably hit 95-100 before going back up", "score": 1, "replies": []}, {"body": "Doesn’t matter really, you hold long enough to say you made a good buy decision when you look back", "score": 1, "replies": []}, {"body": "DCA if youre worried about timing", "score": 1, "replies": []}, {"body": "Thanks for the laugh", "score": 1, "replies": []}, {"body": "Buy it around 80-90$", "score": 1, "replies": []}, {"body": "Maybe a bit, gotta see what happens with their plans", "score": 1, "replies": []}, {"body": "Flip a coin", "score": 1, "replies": []}, {"body": "NVIDIA Corp just double down on voice AI stock SOUN.. anyone know what food chain is up next for contract", "score": 1, "replies": []}, {"body": "Yes, unless you have a position already and need to build a position elsewhere.\n\nThere are better opportunities, but this one isn't a bad one right now", "score": 1, "replies": []}, {"body": "I would sit out for at least a month or so but that’s me", "score": 1, "replies": []}, {"body": "Nope", "score": 1, "replies": []}, {"body": "It’s a great long term buy…\nMost definitely will make money 💰💰💰\nIf you can keep it for 2 years!!!", "score": 1, "replies": []}, {"body": "Def buy, will pump to 125-140 within 2 weeks the. Dump off huge", "score": 1, "replies": []}, {"body": "It's too unclear. I day trade I have no clue what's next. At all. Nobody does, now more than ever", "score": 1, "replies": []}, {"body": "It’s cheap right now for sure.. I since it as low as $99a share this year myself I’m holding…", "score": 1, "replies": []}, {"body": "I am short on any of  these AI-adjacent stocks. Eventually people will accept that current AI (LLMs/Neural Networks) will never be good enough to replace skilled labor required to make it profitable long term.", "score": 1, "replies": [{"body": "I thought about what service ai could provide a biz that would be cheaper than human labor. Ai is going to cost a fortune for a company, and a human only costs 65k a year for pencil pushing.", "score": 1, "replies": []}]}, {"body": "Hell yea", "score": 1, "replies": []}, {"body": "1. Opinions don't move the needle when it comes to stock\n2. It's NEVER a bottom unless you see it near zero.\n3. Always a good time to buy if you have the balls and stomach for it.\n\nYou should've asked this Friday when ALL of us bought it. Bought 10K shares Fri @ $102, sold today ah @ $107 preset to be sold GTC-EXT. One day hold.\n\nRepeat.", "score": 1, "replies": []}, {"body": "Yes and no.....not yet but near", "score": 1, "replies": []}, {"body": "Wait after the crash , that would be the perfect time to buy .\n\nThe crash after the FED cut the rates", "score": 1, "replies": []}, {"body": "I'm hoarding!", "score": 1, "replies": []}, {"body": "You should wait, not long ago was under 100.00", "score": 1, "replies": []}, {"body": "I won’t buy yet, with the sentiment that it will go to $90 and lower, the looming crash, and the time it will take for AI to become useful, it’s better to save some stress and stay away til it’s more stable. Greed is your enemy as a trader.", "score": 1, "replies": []}, {"body": "Wait for under $100. Prolly gonna drop since Cramer talked about it.", "score": 1, "replies": []}, {"body": "Imo, it's never not been a buy", "score": 1, "replies": []}, {"body": "When invested after watching a insta reel", "score": 1, "replies": []}, {"body": "I think NVDA is really cheap, I have got 230 shares", "score": 1, "replies": []}, {"body": "Many people say this is an overvalued stock, but I believe it will rise in the future", "score": 1, "replies": []}, {"body": "Wait for $97.   Fill the gap", "score": 1, "replies": []}, {"body": "Nvidia is a sell. It's the next blackberry. First mover but will not benefit in the future. The next thing is intel. Or any other secondary market related to AI learn your lesson from blackberry and apple.", "score": 1, "replies": []}, {"body": "Cramer Curse is on Nvda", "score": 1, "replies": []}, {"body": "If I understand the product and like it I might buy it after watching in for several months.", "score": 1, "replies": []}, {"body": "Nividia is just getting started my friend, just give your money to Jensen and wait, you'll see. Buy the stock at any price, this company has a brilliant CEO", "score": 1, "replies": []}, {"body": "Question was : Is it buy for  nvidia ?", "score": 1, "replies": []}, {"body": "Just bough back in, idc what you say if $100 holds support it’s bull run all day, too many things going for NVDA too many people gettin caught up in TA", "score": 1, "replies": []}, {"body": "🤔", "score": 1, "replies": []}, {"body": "hardware boom is over, now for the software boom coming up.", "score": 1, "replies": []}, {"body": "Cisco is still a company to this day. They still have a space, But they have never regained their 2000s highs. This company is massively over valued on a short term dream from a few major companies, if and when AI doesnt materialize like they expected, NVDAs sales will plummet. They will still be a solid company with a good MOAT in the industry. But that doesnt guarantee they ever again reach that 3 T market cap or really anywhere close. This is absolutely not the time to buy NVDA, dont get caught by FOMO because you missed the boat, this run is likely over or close to it. Dont try to catch a falling knife, more often than not you get cut.", "score": 1, "replies": []}, {"body": "I like anything under my 110 average and under $125.00", "score": 1, "replies": []}, {"body": "good", "score": 1, "replies": []}, {"body": "Bro just fucking buy", "score": 1, "replies": []}, {"body": "No  The AI hype is over. I'd buy SP500 , Walmart, or stocks that yield consistently more than 15% per year.", "score": 1, "replies": []}, {"body": "Nvidia is long term hold in my opinion, I bought more at $102 and while it’s $120 range at the close today no guarantee it will just appreciate on a daily basis….", "score": 1, "replies": []}, {"body": "Let it crash some more", "score": 1, "replies": []}, {"body": "I’m buying some. Waiting for next dip. September isn’t over. We might see $95.", "score": 1, "replies": []}, {"body": "I WILL WAIT TIL $90. AREA. More down days ahead.", "score": 1, "replies": []}, {"body": "Still early in September, it will go lower.", "score": -3, "replies": [{"body": "Why does September matter?", "score": 2, "replies": [{"body": "Historically the worst month for equities.", "score": 8, "replies": [{"body": "Sources?", "score": 1, "replies": []}]}]}]}, {"body": "Why are ppl so mad about a stock lol", "score": 0, "replies": []}, {"body": "Went down over 1 month maybe wait until q4 earnings", "score": 0, "replies": []}, {"body": "I’ve brought it since it is cheaper than AMD, yet a much better company. Think 6-12 months. \n\nNot FA.", "score": 0, "replies": []}, {"body": "We shouldn't legitimize the stock market any longer, most stocks are owned by the rich and they control the markets. The most you can do is get lucky gambling, the worst you can do is give them more money to keep buying up all property on earth.", "score": 0, "replies": [{"body": "They provide the foundation for our retail trade, nothing more. They’re not a charity so be careful how you operate around them.", "score": 0, "replies": [{"body": "Maybe we shouldn't legitimize an organized racket ran by white collar criminals  that holds the majority of American's retirement hostage", "score": 1, "replies": []}]}]}, {"body": "If you have to ask, no.", "score": -2, "replies": []}, {"body": "Isn't Nvidia under investigation by the US government", "score": -5, "replies": [{"body": "Rumors they’ve been subpoenaed which shows either the start or the ramp up of an investigation. They’re denying receiving one but competitors are still saying they’re using unethical business practices to shut out competition.", "score": 1, "replies": []}]}, {"body": "Wait for $65", "score": -2, "replies": []}, {"body": "No buy it on 2025.", "score": -2, "replies": []}, {"body": "$80-$85 buy", "score": -8, "replies": [{"body": "gl", "score": 2, "replies": []}]}]}
{"title": "Here’s everything Apple just announced: iPhone 16, iPhone 16 Pro, Apple Watch Series 10, AirPods 4 and more", "selftext": "# iPhone 16 and iPhone 16 Plus\n\nApple introduced the iPhone 16 and iPhone 16 Plus, starting at $799 and $899, respectively. These phones feature aerospace-grade aluminum with two size options: 6.1 inches for the iPhone 16 and 6.7 inches for the Plus model. The A18 chip powers both models, offering 30% faster gaming performance and a 48-megapixel main camera that enhances low-light shots. Customizable action buttons allow for quicker access to functions like the camera or flashlight. Both models will be available for preorder starting September 15, with official sales on September 20.\n\n# iPhone 16 Pro and iPhone 16 Pro Max\n\nThe iPhone 16 Pro and Pro Max offer larger displays (6.3 and 6.9 inches) and a lighter, scratch-resistant titanium frame. Priced at $999 and $1,199, these premium models come equipped with the A18 Pro chip, which enables faster data processing for cameras and AI features. The new 48-megapixel fusion camera includes a 5x telephoto lens for better zoom and 4K video recording at 120 frames per second. These models also feature improved battery life, making the Pro Max the longest-lasting iPhone yet. Preorders start on September 15, with sales beginning on September 20.\n\n# Apple Watch Series 10\n\nThe Apple Watch Series 10, starting at $399, is thinner and boasts the largest display yet, offering up to 40% more brightness at an angle. Health updates include sleep apnea detection, which tracks breathing disruptions during sleep, pending FDA approval. With faster charging times—reaching 80% in just 30 minutes—the Series 10 also offers 18-hour battery life. New finishes like jet black aluminum and lightweight titanium options add more customization. Preorders are available today, and the watch officially launches on September 20.\n\n# Apple Watch Ultra 2\n\nPriced at $799, the Apple Watch Ultra 2 is designed for fitness enthusiasts and adventurers. It includes the most accurate GPS system available in a sports watch, along with advanced fitness tracking for activities like scuba diving, rowing, and hiking. It also introduces new software features such as offline maps and detailed route tracking. Preorders begin today, with availability on September 20.\n\n# AirPods 4\n\nThe AirPods 4, starting at $129, feature enhanced comfort thanks to 3D modeling and laser topography, making them the most ergonomic AirPods to date. Powered by the H2 chip, they offer improved audio quality and personalized spatial audio. The case, now compatible with USB-C and wireless charging, is Apple’s smallest yet. A version with active noise cancellation is also available for $179. Preorders are open today, with sales beginning on September 20.\n\n# AirPods Pro 2\n\nApple’s AirPods Pro 2 introduced health-focused features, including hearing protection and a five-minute, clinically validated hearing test. Once completed, the AirPods Pro 2 can function as personalized hearing aids. These features will soon receive FDA approval, and the hearing profile automatically syncs across all Apple devices. Preorders are available now, with the official launch on September 20.\n\n# AirPods Max\n\nThe AirPods Max received an update with three new colors—orange, purple, and starlight—and now include USB-C charging. These over-ear headphones retain their $549 price tag and are available for preorder today, with the launch set for September 20.\n\n  \nSource: [https://www.cnbc.com/2024/09/09/apple-event-2024-live-updates-iphone-16-apple-watch-10.html](https://www.cnbc.com/2024/09/09/apple-event-2024-live-updates-iphone-16-apple-watch-10.html)", "id": "1fcwxyz", "created_utc": 1725907404.0, "score": 114, "upvote_ratio": 0.83, "num_comments": 103, "comments": [{"body": "Am I the only one who thinks their product differentiation stinks? Even as someone firmly in the Apple world as a consumer I’m constantly needing to look up what model has which features. And frankly many of the features are just hype.\n\n“Aerospace grade aluminum” yeah okay whatever.", "score": 26, "replies": [{"body": "Shopping for an iPad is confusing AF. Very hard to understand the different models and which one I should actually get.", "score": 3, "replies": []}, {"body": "Marketing BS,\n\nIt's like Rolex and their 'special' 904L stainless steel which is just a low cost industrial grade product.", "score": 2, "replies": []}, {"body": "“Aerospace grade aluminum….” What the heck is that in the first place? iPhone? Yawn 🥱… I think I would hold on to my 11 Pro Max a bit longer", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 252, "replies": [{"body": "10 inch ultra pro max iPhone", "score": 36, "replies": [{"body": "[deleted]", "score": 40, "replies": [{"body": "iPad mini?", "score": 4, "replies": []}]}]}, {"body": "Simply the best iPhone we have ever created.", "score": 20, "replies": [{"body": "[deleted]", "score": 40, "replies": [{"body": "OMG", "score": 4, "replies": []}]}, {"body": "[removed]", "score": -5, "replies": [{"body": "yep, i heard next year they're gonna go back to the much more classic 6.1 inch screen", "score": 5, "replies": []}]}]}, {"body": "What new innovations does your car have compared to the previous year’s model?", "score": 6, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "I turn on an old phone and it still displays my content.", "score": 2, "replies": []}, {"body": "New vehicles will start braking when you let go of the accelerator, not only when you step on the brake.", "score": 1, "replies": []}, {"body": "So ya nothing. The only real “Change” was around 2019 most cars had all the safety shit which is just a bunch of sensors, basically. Nothing new.", "score": -5, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Their watch now does a sleep apnea test that I had to use thousands of equipment for, their air pods now do a hearing test that would use equipment costing thousands of dollars … I’d say they said some important stuff today but I get it, you just like to say stuff everyone else says rather than think for yourself … ", "score": -5, "replies": [{"body": "Near useless as they’re not medical-rated; doctors will still do their own tests before delivering a diagnosis thus granting you an access to medication", "score": 6, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}, {"body": "what do you expect really from a smartphone?", "score": 4, "replies": [{"body": "I heard that in Korea some fold and flip now but it's just hearsay", "score": 12, "replies": [{"body": "I want one that can curl into a straw so I can sip beverages from it.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "“I don’t see a future with them anymore” lol my guy, you are a special kind of stupid aren’t cha", "score": 1, "replies": []}]}]}, {"body": "The AI part is new though.", "score": 2, "replies": [{"body": "except its chapt gpt which has been out for years.", "score": -1, "replies": []}]}]}, {"body": "Am I the only one who wants a 6.1 pro? That is more than big enough. If there are innovations in size, instead of making the screen bigger, make the case smaller. Geez", "score": 50, "replies": [{"body": "The thing is the battery tech doesn’t advance as fast as processors do so the 6.1” 15 pro had terrible battery life. Only way out is making the battery bigger which requires making the phone bigger", "score": 15, "replies": [{"body": "Except for the processor uses less power for more performance..", "score": 6, "replies": [{"body": "Huh, didn’t know that. Wouldn’t exactly classify the A17 Pro as power efficient though:/", "score": 4, "replies": []}]}, {"body": "Samsung can put 3900 in it, Apple should be able to increase it from 3300 to that too", "score": 2, "replies": []}]}]}, {"body": "I know this is petty but why can’t they do some fun colors for the pro…", "score": 35, "replies": [{"body": "I think people care less about colors because you just put a case on it anyway", "score": 23, "replies": [{"body": "I don’t know what color my pro is unless I check ", "score": 7, "replies": []}, {"body": "Yep. Colors are useless since one usually slaps on a black case anyway", "score": 1, "replies": []}]}, {"body": "That’s what covers are for I suppose", "score": 1, "replies": []}]}, {"body": "They did not upgrade Air pods Pro 2/Air Pods Max/Apple Watch Ultra 2. Even the iphone upgrades look meh to me. Nothing that screams a super cycle or anything. I think I am expecting another underwhelming sales cycle for Apple. Only upgrade worthwhile is 6.3\" pro phone as that has the same telephoto(tetraprism or whatever crap Apple is calling) lens as Max one. Plus the same price point.", "score": 27, "replies": [{"body": "Agree. It’s not a generational jump where 13, 14 or 15 have a compelling enough reason to move across. Early sales will be to those who would have upgraded regardless of what Apple said today. ", "score": 3, "replies": [{"body": "If you aren’t on a 15, I feel like it’s reasonably compelling. AI + much better processor, battery and camera vs a 14 (or older). The camera button and new audio features are nice imo. \n\nI would consider it on a 13 or older personally", "score": 4, "replies": [{"body": "As someone with a 13, I was debating it but to go to a 16, I think it's only 3 hours more. I think I'll just pay for a battery replacement and wait one more year. There's nothing sluggish about the 13 for my workflow yet. Apple Intelligence should be a bit more matured by then too :P", "score": 3, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Why are you due to an update? I also have the 13 Pro und plan on using it for much longer.", "score": 5, "replies": []}]}]}]}]}, {"body": "Where is the new iPad mini - I am heart broken :-(", "score": 41, "replies": [{"body": "They have a separate event for that.", "score": 13, "replies": []}, {"body": "Maybe October’s event", "score": 11, "replies": []}, {"body": "I still feel that way about the iPod mini", "score": 1, "replies": []}]}, {"body": "Apple intelligence looks rush out.\n\nEverything is in beta and only available in fall.\n\nAnd in selected market and language.", "score": 21, "replies": []}, {"body": "You guys are all missing the main player here. Cowboy fuckin frogs. What kind of dog is that? Every kid will be demanding cowboy frogs for Christmas.", "score": 15, "replies": []}, {"body": "Tim Cook is the Trent Dilfer of CEOs", "score": 9, "replies": [{"body": "What is Tim Apple’s superbowl?", "score": 2, "replies": []}]}, {"body": "And I’ll gladly keep my 1 year Apple Watch and iPhone 13 Pro Max.  \n\nWe’ve reached a point where upgrading is because your battery died, not because it offers usability improvements worthy of the Dollars Required", "score": 8, "replies": []}, {"body": "€950-1200 🤯", "score": 11, "replies": []}, {"body": "This is as bad as it gets from Apple... wtf... isn't this supposed to be a \"super cycle\"... Most items just getting new colors... oh ok.", "score": 24, "replies": [{"body": "The super cycle only being driven by the AI software updates and maybe by folks looking to move to a USB C charging ecosystem", "score": 10, "replies": [{"body": "Nobody actually wants ai on their phone though so i think thats going to fall flat", "score": 11, "replies": [{"body": "Nobody, lol, I certainly do.", "score": 5, "replies": [{"body": "To do what, exactly? I don’t care to take a side here. I’m just curious what you’d like it to do that can’t already be achieved with a couple of taps. ", "score": 6, "replies": [{"body": "I want it to behave like in Her, without the romance though.", "score": 2, "replies": []}, {"body": "But it will sound like Siri now", "score": 1, "replies": []}]}, {"body": "why", "score": 1, "replies": []}]}, {"body": "Yea remains to be seen", "score": 1, "replies": []}]}]}]}, {"body": "The presentation was similar to last year.  Nothing was really exciting that was announced.", "score": 5, "replies": []}, {"body": "Meh. Still a buy and hold.\n\nApple intelligence next year (or 2 years) after all the data collection is going to be interesting. That’s why they focused on the camera so much this event: even though it’s private and encrypted I imagine there is a lot of info to be gained from the increase in photos taken with the new button.", "score": 15, "replies": [{"body": "Oddly the OP didn’t mention the AI segment of the call today but it was the most interesting part to me.", "score": 9, "replies": []}]}, {"body": "wow I give a shit about none of that", "score": 17, "replies": []}, {"body": "Airpod max got new color and usbc… \n\nCan’t innovate my ass!!!!", "score": 9, "replies": []}, {"body": "Geez, is the battery life on Apple watches really that bad? I have a 3 year old Galaxy Watch 4 and I can easily get 2 days on a charge with it", "score": 5, "replies": []}, {"body": "So the only difference between airpods 4 and airpods pro 2 is the hearing accessibility?", "score": 3, "replies": [{"body": "No there were gestures added to work with your phone and Siri too. Shake head to tell Siri no, nod head to tell it yes. You can answer calls with gestures too.", "score": 4, "replies": [{"body": "Battery life and so much more. Basically - the 4 with noise cancellation is not going to sell well - most people will be pushed into the pro. I think it’s just there to make the pro look more reasonable in price.", "score": 2, "replies": [{"body": "The differences is 50% more battery life (6 hours with noise canceling instead of 4), hearing test / aid / protection, and the wireless charging case has MagSafe and also works like an air tag and comes with a “lanyard loop”.\n\nAnd the biggest difference imo is “2x more active noise cancellation”.", "score": 1, "replies": []}]}, {"body": "Siri interactions are also on the cheaper models according to the apple buy page.", "score": 1, "replies": []}]}]}, {"body": "Looks like same shit", "score": 3, "replies": []}, {"body": "These shows have become so boring.  There is really nothing new.   Just updates for existing things.", "score": 2, "replies": []}, {"body": "Bring back the mini!", "score": 2, "replies": [{"body": "Agree 100%. I'm keeping my 13 Mini until a new Mini comes along, or a SE with FaceID at least.", "score": 2, "replies": []}]}, {"body": "No new Apple TV ??? 😢", "score": 1, "replies": [{"body": "October event - maybe", "score": 2, "replies": []}]}, {"body": "What a joke of an announcement.  With the car out, they are a behemoth with cash that can't innovate anymore.", "score": 1, "replies": []}, {"body": "AI =   Intelligence, you all got wrong regards 😁", "score": 1, "replies": []}, {"body": "i am kinda disappointed, I wish they made drastic change to the airpod pro max 2. I mean it is just getting a usb-c upgrade. But other than that, that is basically it.", "score": 1, "replies": []}, {"body": "No difference from the last 5", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Pro / pro max is 9/15\n\nStandard is open today", "score": 2, "replies": []}]}, {"body": "So where the AI at and what does it actually do?!", "score": 1, "replies": []}, {"body": "When tech innovation become boring innovation it s a real problem. Apple invented their own version of Google lens… incredible! ", "score": 1, "replies": []}, {"body": "Mind = BLonw", "score": 1, "replies": []}, {"body": "As a woman, I really like the new camera function.", "score": 1, "replies": []}, {"body": "The iPhone 16 feels like it's refining rather than reinventing. The upgrades seem more about enhancing the overall experience rather than introducing game-changing features. Apple is focusing on performance improvements, better cameras, and connectivity, which are nice, but nothing feels revolutionary. Still, the tweaks like thermal management and faster Wi-Fi are practical and should make a difference in daily use.", "score": 1, "replies": []}, {"body": "I hate apple", "score": 1, "replies": []}, {"body": "Amazing at what nonsense people blow their money and later \"feel poor\".", "score": 1, "replies": []}, {"body": "I'll take a flip phone, my 20 year old iPod, my Bose headphones, and my excellent 15 year old small camera instead of all these unnecessary high-tech gadgets that will break or need updating within 5 years.", "score": 1, "replies": []}, {"body": "Calls on APPL", "score": -3, "replies": [{"body": "This years iPhone is too similar to last years. When are they going to revamp and have a completely look to previous generations? Before, every 5 years they could have new designs but now iPhone 10 through now 16 have been identical. Unless you want to add the Dynamic Island as “new”.", "score": 7, "replies": [{"body": "This is pretty normal. It’s like when we jumped from CRT screens to LCD, was larger than going to the next jump. We’re entering a pretty mature stage for the handheld market.", "score": 9, "replies": [{"body": "We’ve been using the same design for a wheel for thousands of years, smh", "score": 6, "replies": [{"body": "With EVs actually there’s been quite a bit of innovation on this recently and more to come", "score": 2, "replies": [{"body": "No idea why this got a downvote, it's true. The weight of the batteries are causing premature tire wear and forcing innovation in an industry that's been kinda stagnant otherwise. Not sure if that's what was being referenced, specifically, but it's one example nonetheless.", "score": 1, "replies": [{"body": "Yes, increase wear and also decreased sound and greater efficiency.", "score": 3, "replies": []}]}]}]}]}, {"body": "The big redesign is the 2025 model apparently.", "score": 1, "replies": [{"body": "then in 2025 they'll delay all thos features and promise them in 2026. classic apple", "score": 1, "replies": []}]}]}]}, {"body": "Until they make a foldable iPhone,  apple, is dead to me, capisce.", "score": -7, "replies": [{"body": "The foldable Samsungs are trash though, press slightly too hard with your nail and you have a permanent indent in your screen. It takes hardly any pressure to do it. Absolutely worthless quality", "score": 1, "replies": [{"body": "I was a hardcore iphone user for years, kept waiting for a foldable phone, but it never came. I finally broke down and bought the fold 5, it's a great phone/tablet, I use an extra screen protector on the inside, tempered glass outside with a case, and I love it.", "score": 1, "replies": []}]}]}, {"body": "Remember when Bloomberg said a new iPad was coming", "score": 0, "replies": []}]}
{"title": "$TSLA Daily Thread - September 09, 2024", "selftext": "&#x200B;\n\nhttps://preview.redd.it/z867adehor2c1.png?width=1024&format=png&auto=webp&s=c4a9b2968072e2cb7851849551cefa930fbcb05c", "id": "1fcefks", "created_utc": 1725847214.0, "score": 16, "upvote_ratio": 0.87, "num_comments": 165, "comments": [{"body": "https://x.com/driveteslaca/status/1833160971579240685?s=61\n\nPanasonic 4680 production ready to ramp up. Hopefully this uses a proven dry electrode/cathode process as well so we see reliable gains in energy density and overall weight of the cells.", "score": 11, "replies": [{"body": "Was just about to post this:\n\nhttps://preview.redd.it/gzieqa4rysnd1.jpeg?width=1440&format=pjpg&auto=webp&s=a9c88996d8596d5a0f6dd2ce6a393ebaebadbbde", "score": 9, "replies": []}, {"body": "Also good news on the Panasonic plant opening in Kansas next year. Stars finally aligning for semi truck by end of next year.", "score": 5, "replies": []}, {"body": "Not dbe imho", "score": 3, "replies": []}, {"body": "Does anyone know the financial split between Tesla and Panasonic for them to make 4680s? Does Tesla not have a patent on it? If so, how much cash we talking? Are the only for Tesla cars?", "score": 1, "replies": [{"body": "As far as I know, Tesla is the only company with a battery pack meant for 4680s but that can quickly change. Tesla likely has some sort of deal to get first dibs. I believe Tesla patents are only related to the dry based electrode process but could be wrong. \n\nThe new Panasonic plant in Kansas will produce mainly 2170s, also primarily for Tesla.", "score": 5, "replies": []}]}]}, {"body": "Best Q ever in China incoming?\n\n[https://x.com/piloly/status/1833068829594853680](https://x.com/piloly/status/1833068829594853680)", "score": 8, "replies": [{"body": "![gif](giphy|WX5rDVbgWytCy8yyLf|downsized)", "score": 5, "replies": []}]}, {"body": "Guys! It's been 2h since my post and no reply. \n\nI am disappointed.", "score": 7, "replies": [{"body": "I’ve said before, the moment this became an fsd reliant stock and no longer really about sales numbers and trim prices, battery tech, etc., this sub died\n\nIt will only come back to life when there’s something discuss after fsd day", "score": 9, "replies": []}]}, {"body": "Redemption can happen to anyone right?\n\n\nLet's Go!!!", "score": 7, "replies": [{"body": "Glib is gonna be furious.", "score": 3, "replies": []}, {"body": "I think you meant herpes ", "score": 4, "replies": [{"body": "It itches, but at least it ended the day green!", "score": 2, "replies": [{"body": "Task failed successfully ;)", "score": 2, "replies": []}]}]}]}, {"body": "Surprisingly good video from CNBC [https://youtu.be/elTRh5fi01k?si=5SSi3wxqL1HO7ZHv](https://youtu.be/elTRh5fi01k?si=5SSi3wxqL1HO7ZHv)\n\nGood to see Alex Potter again. I miss Rob's interviews :(", "score": 5, "replies": [{"body": "What's funny is that they're reporting on this now when we've been pointing out the problems of the OEMs for years.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "As ugly as it is, I bet it does a decent job preventing heat from entering the car", "score": 1, "replies": []}, {"body": "Is that tin foil or duct tape? \n\nEither way, that's quite a choice.", "score": 1, "replies": []}, {"body": "It's getting its hair dyed", "score": 0, "replies": []}]}, {"body": "RIP James Earl Jones", "score": 4, "replies": [{"body": "nooooooooooooo.jpg", "score": 5, "replies": []}, {"body": "![gif](giphy|7xCds0RBfyWQ0)", "score": 4, "replies": []}, {"body": "So many great characters.... in so many great movies...  had no idea he was already 93..", "score": 2, "replies": []}]}, {"body": "Fucking TIC is going to overtake our comment volume at this rate", "score": 11, "replies": [{"body": "Be caring be full of love 🥰 dont spread hate", "score": 3, "replies": []}, {"body": "Let them babble. This sub is full of high caliber folks. Discussion quality over volume any fucking day of the week!!\n\n🤜🏻💥🤛🏻 ", "score": 4, "replies": []}, {"body": "As IsJokeComrade mentioned earlier, once it became clear the Tesla thesis is all about FSD, a bunch of regulars up and left. I get it, FSD is the ballgame but selling cars didn't have to be put so much on the back burner as it was. Time will tell if this strategy pays off for Tesla and for us - the investors who didn't bail.", "score": 9, "replies": [{"body": ">once it became clear the Tesla thesis is all about FSD, a bunch of regulars up and left.\n\nSame thing happened at TMC.  \n\nThe vast majority of old timer shareholders at TMC (IPO through 2012 buyers) invested in Tesla because of its mission to accelerate the transition of the global economy to sustainable energy systems. \n\nMany of those folks have either quit TMC or reduced their participation on the forums there.  Several have divested some or all of their TSLA stock, citing the company's lack of focus on core mission products and associated declining financial performance.  \n\nNearly all were onboard with Tesla's experimentation with AI and robotics, but not at the cost of trashing Master Plan Part 3 and continual delays with the Semi program.  \n\nMr. Musk's moves towards climate change denialism (saying it's not an immediate problem, and claiming that the biggest threat is CO2 effects on the brain), have only widened the rift between these investors and Tesla today.", "score": 7, "replies": []}, {"body": "Really? I thought everybody was aligned based on the latest vote 😂", "score": 1, "replies": []}]}, {"body": "The TIC daily thread is dead.  7 comments today compared to 111 here.  \n\nTIC had 4 comments over the weekend (Sept. 7 and Sept. 8) compared to 188 here.", "score": 6, "replies": []}, {"body": "Well, when the spam bot left (upvotemeok), he took 2/3rds of the volume with him. By then, anyone with a remote idea about the stock was pushed out by the Elon bad man crew. I warned you all of this, but nobody gave a shit. Now it's a ghost town, and people moved on.", "score": 5, "replies": [{"body": "While that is true, I don't think everyone left. A lot of long term bulls like myself are always up for discussion, but there's just not a lot to talk about until Q3 ER and 10/10. Calm before the storm so to speak.", "score": 7, "replies": [{"body": "I disagree that there is not a lot to talk about. Tesla Energy, Tesla AI roadmap, and Optimus provide endless topics for debate.\n\nLong term bulls have just gone quiet because the stock has been 'flat' for 4 years.\n\nIt's also much more difficult to have casual debates about AI training clusters instead of about whether Tesla will ship a few extra units in a given quarter.", "score": 2, "replies": [{"body": "But what is there to debate about? We know what we know, we don't know what we don't know. It feels like there's very little territory where reasonable people can look at the situation and come up with different, reasonable takes.", "score": 4, "replies": [{"body": "Where should the next megapack factory be built? \n\nIs Tesla working on a van, or even a van variant of robotaxi? Maybe they have paused that project.\n\nIs Tesla required to hold a certain amount of cash reserves when FSD unsupervised is released? (when Tesla assumes liability)\n\nWho are the first customers of Optimus? Could Pepsi and Frito-Lay be the first testers alongside semi? What might be the manufacturing constraints to scaling?", "score": 2, "replies": [{"body": "1. Poland  \n2. Small Robotaxi first, big can just be Model Y  \n3. No  \n4. Tesla themselves for a long time  \n5. Actual good question, i doubt it will be batteries. Probably the actuators.", "score": 2, "replies": [{"body": "Curious why Poland?", "score": 1, "replies": [{"body": "It's the upcoming power in europe, no stupid labor laws like south europe, no german bureaucrats, good education.", "score": 1, "replies": [{"body": "🐍", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yea it seems to be healing in here but for a while this was just a bunch of whiners/ short term sighted thinkers. Stocks are pretty irrational and can go sideways for a long time. Been here since the 2020 dip not going anywhere for a long time.", "score": 2, "replies": []}]}]}, {"body": "surprise high 5-figure pltr gain today  \n\nperhaps I will spring for guac this evening 🥑 🧐", "score": 10, "replies": [{"body": "![gif](giphy|OIOr6Fb0PosIU|downsized)", "score": 6, "replies": []}]}, {"body": "Let the run up to 300 begin", "score": 7, "replies": [{"body": "https://preview.redd.it/nx7tq834tpnd1.jpeg?width=302&format=pjpg&auto=webp&s=0e23f3ccb7269723797d62265809ef6ab43f2025", "score": 2, "replies": []}, {"body": "see you at 170", "score": -2, "replies": []}]}, {"body": "My biggest take away from the Apple event is the possibility that I can purchase the AirPod with my FSA fund.  Big if FDA approved.\n\n/addendum, the iPod pro 2 only.", "score": 7, "replies": [{"body": "Tax free air pods! Tesla needs to get on this game 😂", "score": 1, "replies": []}]}, {"body": "You either PLTR or you PLT-aren’t ;) ", "score": 6, "replies": [{"body": "![gif](giphy|jUkBz88jdPHDa)", "score": 7, "replies": [{"body": "me on line @ chipotle 😇", "score": 3, "replies": []}]}]}, {"body": "The cyber truck is in the auto museum for a reason. ", "score": 3, "replies": []}, {"body": "Maintain strike price, keep the option \\~1 month out, and collect 2.65 credit for just one week extension? Yes please! That's a DEAL! \n\nhttps://preview.redd.it/z7rst7jpisnd1.png?width=1204&format=png&auto=webp&s=3c8a27557e8e31a8d4190db02b0052d630d931cb\n\nLet's see if it fills.", "score": 4, "replies": [{"body": "Filled.\n\nI don't care if they get called at 225. It's higher than my purchase price and I've collected now a premium of 10+ on them. Making money, slow and steady.", "score": 2, "replies": []}, {"body": "You got that extra premium because the 10/4 exp includes the extra volatility from expected deliveries and ramped IV. Next month or so should be great premium with all the events and elevated vix", "score": 2, "replies": []}]}, {"body": "Just sold a few PLTR Jan 2025 $49 strike for .97", "score": 4, "replies": [{"body": "interesting\n\n![gif](giphy|tF8vMUeGUkHNTgCC4E)", "score": 1, "replies": [{"body": "Y", "score": 2, "replies": [{"body": "might take a peak, I usually do weeklies but I might like a couple of those", "score": 1, "replies": [{"body": "Ya worth it.", "score": 2, "replies": [{"body": "grabbed 3 @ $1", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Will we get the Apple Intelligence on 15 pro?", "score": 3, "replies": [{"body": "Yep. A17Pro processor has it in beta right now.", "score": 4, "replies": [{"body": "Thx.", "score": 1, "replies": []}]}, {"body": "definitely waiting until next year for upgrading from 14 pro max. the apple intelligence stuff seems like it will be half-baked for at least another year", "score": 3, "replies": []}]}, {"body": "just stopping by to say hi and flex\n\nhttps://preview.redd.it/bl585gs3yund1.jpeg?width=1170&format=pjpg&auto=webp&s=4e3c1bac82e652e453b27389b919b2132ddffab3", "score": 4, "replies": [{"body": "can you adopt me pls?", "score": 2, "replies": []}]}, {"body": "https://x.com/sawyermerritt/status/1833155649623953735?s=46\n\nIdc what anybody said, Elon is the goat. He definitely knows his shit", "score": 7, "replies": [{"body": "Shocking everyone except Tesla fans who knew mobile eye was doomed. They had some dependencies on Intel too in case their methodology wasn’t bad anyways.", "score": 8, "replies": []}, {"body": "I believe the silent majority feel this way.", "score": 2, "replies": []}, {"body": "As part of our regular review of the long-term technology roadmap, we now believe that the availability of next-generation FMCW lidar is less essential to our roadmap for eyes-off systems. This decision was based on a variety of factors, including substantial progress on our EyeQ6-based computer vision perception, increased clarity on the performance of our internally developed imaging radar, and continued better-than-expected cost reductions in third-party time-of-flight lidar units.\n\n—-\n\nSo they’re just ending their internal r&d of their fmcw LiDAR system. Sounds like they’re still using the cheaper third party time of flight LiDAR units?\n\nAnyone have an eli5 version?", "score": 3, "replies": [{"body": "I'm sure /selfdrivingcars will explain this in a reasonable manner", "score": 3, "replies": []}]}]}, {"body": "🚀", "score": 7, "replies": [{"body": "🚀🚀", "score": 3, "replies": []}]}, {"body": "Bought 3 more 🪑", "score": 5, "replies": [{"body": "That's why it popped to $219.", "score": 5, "replies": []}, {"body": "🐋 ", "score": 5, "replies": []}]}, {"body": "Wow that was disappointing event.\n\nI’ll probably still get a new phone (pro) since I love taking photos of my family on trips.\n\nBut underwhelming.", "score": 6, "replies": [{"body": "Camera control buttons is actually nice, even on the non pro", "score": 3, "replies": []}, {"body": "Really disappointed on the watch ultra. Wanted to pass my old one on to my wife but not wanting to pay 899 for the same watch as the ultra 2", "score": 5, "replies": []}, {"body": "the smartphone has just hit a wall where its hard for any game changing innovations at this point. All I want is lighter and more battery life and thats all incremental.", "score": 3, "replies": []}, {"body": "The camera controls button seems handy for quick adjustments. Look forward to it on Pixel phones in 3 years.", "score": 4, "replies": []}]}, {"body": "https://youtu.be/KmJWD9jQvhc\n\nWhat a banger!! Happy Monday, gents. ", "score": 2, "replies": []}, {"body": "( ͡° ͜ʖ ͡°) PLTR \n\nCongrats to fellow chair hodlers. ", "score": 3, "replies": [{"body": "Minnow saying high to the whale", "score": 2, "replies": []}]}, {"body": "fun fact: you probably eat an average of one credit card worth of microplastics every week!", "score": 4, "replies": [{"body": "but do we crap it out or does it stay with us, friends forever?", "score": 3, "replies": [{"body": "It surrounds us and penetrates us - it binds the galaxy together", "score": 4, "replies": [{"body": "![gif](giphy|8hMD9YakVza3452SpN)", "score": 3, "replies": []}]}]}, {"body": "Gross. How can we bring this figure down?", "score": 3, "replies": []}]}, {"body": "Secummmmmmmmnd", "score": 3, "replies": [{"body": "🤓🤓", "score": 1, "replies": []}]}, {"body": "Anyone selling PLTR CC?", "score": 2, "replies": [{"body": "Sold Nov $49 for 0.40", "score": 3, "replies": []}]}, {"body": "Leon sucks, Elon needs to come back ", "score": 4, "replies": [{"body": "All my boys hate Leon", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Longing for a simpler time? ", "score": 2, "replies": []}]}, {"body": "How financially illiterate do you have to be to even propose the idea of taxing unrealized gains?  \n\nCan somebody here try and fumblefuck a word salad for why it's anything but a pander play to low iq, poor voters who are financially illiterate?", "score": 4, "replies": [{"body": "Tax the loans that are taken out against the unrealized gains", "score": 8, "replies": [{"body": "We have a winner. However, isn't this built in in that you couldn't loan more than you'd have after tax anyway? And then to pay it back you have to sell and pay the tax?", "score": 3, "replies": []}, {"body": "I was called \"retarded\" for suggesting that a few days ago. Some people really do believe they are just temporarily embarrassed billionaires who would be unjustly punished under new rules on margin loans.", "score": 7, "replies": [{"body": "Lots of pearl clutching going on", "score": 2, "replies": []}]}, {"body": "We haven't seen those details yet, and it's something I'd definitely be willing to explore.  Why put out there in the first place until you have the details fleshed out?\n\nAlso, how does this effect homeowners tapping their home equity?", "score": 1, "replies": [{"body": "They put it out there to get memes made and get folks riled up. It’s politics. Gotta move the discussion to an issue that is winnable. And dems think this is one  People tapping home equity would pay tax id imagine. If over 100mil in assets.\n\nEdited ", "score": 2, "replies": [{"body": "Agreed.  Trying to decipher signal from noise, but it's difficult when details are limited.", "score": 1, "replies": []}]}]}]}, {"body": "What's so difficult to understand? Value of all assets at a certain date on year 2 minus value of all assets at the same date on year 1. If you've made gains then those gains will be taxed (preferably at the same or a higher rate than labour)", "score": 2, "replies": [{"body": "The concept is easy. It's just stupid, because it tends to cause far more harm than benefit:\n\nhttps://taxfoundation.org/research/all/eu/wealth-tax-impact/\n\nhttps://budgetmodel.wharton.upenn.edu/issues/2021/3/15/budgetary-effects-of-senator-warren-wealth-tax", "score": 1, "replies": []}, {"body": "Taxing unrealized gains risks destabilizing long-term market holders and could lead to a massive selloff, threatening overall market stability. It’s so misguided that I’m confident it will never pass, but it’s being used as a political talking point to rally votes.", "score": 1, "replies": [{"body": "Taxing unrealized gains will probably lead to lower stock prices and that is absolutely fine. ", "score": 1, "replies": [{"body": "It’s definitely not ‘fine.’ Taxing unrealized gains would hurt stock prices and everyone relying on investments for retirement. It would ripple through the economy, affecting more than just the wealthy. I’d be curious why you think it’s fine. If it’s because you believe you could buy in at a lower point, I think the market could snowball and lose value for a long time, possibly even decades.", "score": 0, "replies": [{"body": "Asset prices have grown much quicker than wages for the past decades. If something doesn't change then the ordinary working class won't ever be able to afford a home. The asset owning class will become increasingly rich while the poor become increasingly poor. It's either an all-out civil war in every developed country or a reduction in stock prices. I'd much prefer the latter. \n\nAnd i'm not saying that because I want to buy in at a lower price, I just want society to keep functioning. I don't care that much about my own position in it.", "score": 1, "replies": [{"body": "I get your concern about inequality and rising asset prices. But taxing unrealized gains could actually erode the savings of regular workers who rely on investments for retirement. If stock prices drop because investors are forced to sell assets to cover taxes, it could leave society worse off in the long run. Instead, maybe we should focus on wealth redistribution through things like inheritance taxes or closing tax loopholes that mainly benefit the ultra rich. There are other ways to fix inequality without risking big market consequences.", "score": 1, "replies": [{"body": "I'm also very much in favor of inheritance tax and closing tax loopholes obviously. I just think that a wealth tax is necessary too.", "score": 1, "replies": [{"body": "I don’t think it’s likely to happen, but if it did, you’d see a wave of people turning to offshore planning, setting up trusts, or using other advanced tax strategies. Taxing unrealized gains feels a bit dystopian. On one hand, the government would be taxing paper wealth that hasn’t even been converted into actual cash. But on the flip side, what happens if the value of those taxed assets drops? Will the government reimburse those taxes paid on ‘phantom’ gains that have since disappeared?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If there's one thing we know it's that wealthy have endless loopholes and will deploy their cash where it will give them the most returns.  All it really ends up in is more loopholes for the ultra wealthy or less efficient capital deployment.  It's a big issue for any of us to take on faith and requires a certain naivety imo", "score": 0, "replies": [{"body": "So you're saying \"don't try to tax unrealized gains because the rich will find loopholes\"? That's just silly. We should tax unrealized gains because wealth inequality is growing and it's growing at an increasing rate. Wealth tax is the only tool we have to combat the snowball effect of compounding interest. Rich people will try to cheat the system, but that doesn't mean that we shouldn't try.", "score": 2, "replies": [{"body": "I am absolutely saying don't tax unrealized gains.  That doesn't mean I'm against other mechanisms of taxing the wealthiest members of society.  I'd rather see a reformation and simplification of the entire tax code.  There are endless ways to hide wealth and show actual net worth, which is one of the inherent flaws with putting it at a set number.  Another big issue is that assets are volatile and so this disincentivizes riskier investments, which tends to be where innovation and disruption comes from, and all together those are specific ways through which society as a whole advances.", "score": 5, "replies": [{"body": "Have you read the proposal? There are lots of exceptions for enterprise investments.", "score": 1, "replies": [{"body": "I have not read that", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Would be hard. Especially if someone holds stocks like… TSLA. I had tons of unrealized that was then lost (hopefully temporarily)… so would I be able to write it off next year?", "score": 2, "replies": [{"body": "Proposals to tax unrealized gains would only apply to people with gains over $100 million. Don't worry, everyone here in this sub is good.", "score": 3, "replies": [{"body": "Current state. Opens the door for lowering that cap", "score": -1, "replies": [{"body": "Yeah, and by banning assault rifles that opens the door to banning hunting rifles one day... Only, No! It doesn't at all!", "score": 4, "replies": [{"body": "Ok bye", "score": -1, "replies": [{"body": "See ya", "score": 6, "replies": []}]}]}]}, {"body": "And you don't think that will have an effect on the overall economy when every 100MM+ net worth investor starts deploying their capital differently?", "score": -1, "replies": [{"body": "Yes. It will have a massively positive effect for sure, as it will slow the shrinking of the middle class and one day maybe middle class people can buy homes and support a family the way they used to bask in the Clinton and Reagan days.", "score": 4, "replies": [{"body": "How exactly will it slow the shrinking of the middle class?", "score": 1, "replies": [{"body": "That my friend is simple economics 101. Google is your friend.", "score": 5, "replies": [{"body": "I'm asking you to explain it.  Refer to the original post.  Don't deflect", "score": 2, "replies": [{"body": "I'm not wasting time with someone with no grasp of basic logic or simple economics. Bye!", "score": 4, "replies": []}, {"body": "This is the \"just asking questions\" fallacy. You know you have equal access to information and yet you bank on the excessively inconvenient demand to get someone else to do the work for you. It's bad faith and exactly why sites like letmegooglethatforyou.com exist.", "score": 3, "replies": [{"body": "What is the point of a discussion board if not to discuss things?  If it's economics 101 and it's simple then it should be easy to explain.   I don't want google's explanation, I want his or your explanation.  If you're advocating a policy you should be able to sell that policy", "score": 1, "replies": [{"body": "It was already explained to you - including by me. The problem with the \"just asking questions\" trope is that it's a waste of bandwidth and time to have to spoon-feed someone who is totally capable of finding the answers themselves. It's a bad-faith technique designed to conflate and confuse the issue, rather than having an honest discussion. \n\nThe original point with economics 101 was supply vs. demand. That's it. If you don't want to figure out how the supply and demand curve works for cash and assets in a hoarding economy, then I don't know what else to tell you.", "score": 1, "replies": [{"body": "Very condescending and unnecessary, and it was not already explained when this post was made.  I have yet to see someone explain it in a way that isn't word salad and makes any simple, logical sense. Wealthy people will hide their money from this policy.", "score": 1, "replies": [{"body": "https://old.reddit.com/r/TSLALounge/comments/1fcefks/tsla_daily_thread_september_09_2024/lmadmuh/", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "People hoarding money at the top is bad for the economy in general. It reduces cash flows in and out of the pockets of the middle class as there's less capital freely available in the economy - further concentrating wealth at the very top. The pile of unavailable cash increases over time as there's no incentive for the investor to sell any of their capital. Furthermore, the people who hoard this capital don't contribute through their tax dollars to the system they directly benefit from. They use the infrastructure and enjoy the perks of a free and open society without contributing back, rather a lending company receives a minimal margin loan interest rate that also never goes back into society.", "score": 2, "replies": [{"body": ">The pile of unavailable cash increases over time as there's no incentive for the investor to sell any of their capital. Furthermore, the people who hoard this capital don't contribute through their tax dollars to the system they directly benefit from.\n\nDoes it actually increase over time in relation to total money supply? I'm not so sure about that. Estate taxes seem to solve this problem at death, so long as the government outlives its constituents.", "score": 1, "replies": [{"body": "If the economy is growing, then the overall pile of cash can continue to grow. If the economy cools, the wealth gap grows even more in those periods. But the point is that it stagnates cash flows in and out of the pockets of lower and middle class Americans. All while the hoarded cash continues to accumulate wealth for a select few at the very top of the socio-economic pyramid. They don't contribute to society in any meaningful way as they don't pay taxes like the rest of us do. It's unethical and it's a loophole that's been exploited for generations. We're just at an inflection point where the wealth gap is so extreme that we're starting to question how the system is set up.\n\nEstate taxes don't solve this as it still causes masses of cash to sit accruing interest/gains for decades without any meaningful contribution to society. Also, these taxes are easily dodged by reallocation of assets and transferring ownership prior to death.", "score": 2, "replies": [{"body": "Except for a true minority, we're generally talking founders of billion dollar companies here. I don't think it's fair to say that they don't contribute to society.\n\nUnfortunately all taxes are easily dodged. I don't see how estate taxes would be easier to dodge than a tax on large loans.\n\nIf the government really cared about money, they would be much more successful in reducing spending instead of squeezing billionaires. The billionaires will just leave.", "score": 1, "replies": [{"body": ">Except for a true minority, we're generally talking founders of billion dollar companies here. I don't think it's fair to say that they don't contribute to society.\n\nI just fundamentally disagree. Some Americans in the middle class are paying upwards of 30-40% income tax because they are taxed on their productivity (work) earnings. Multi-millionaires/billionaires borrow against their assets at prime rates (4-5%, even less at times) to avoid selling and paying capital gains tax. The interest goes into another large corporation (brokerage) and never contributes to society in a meaningful way. \n\nI'm all for opportunity to become wealthy through hard work and luck. But I don't support an unjust system that rewards wealth with more wealth and expects little to no contribution to society.\n\n> The billionaires will just leave\n\nLet them, see how far they go before they come crawling back to the system that enabled them to become billionaires to begin with. I'm tired of coddling the rich and protecting them due to the fear of them leaving. I'd rather not be lorded over by some rich asshole and have an opportunity to raise the lower and middle class up.", "score": 1, "replies": []}]}]}]}, {"body": "There are several points where I would disagree, but there are others where I'd agree.  I think the concept of giving back is lost on most public companies at this point of peak capitalism for example, and I think that's bad.  I also don't think that money is sitting there doing nothing.  It's being deployed to earn more money, and the mechanisms through which that happen are often times beneficial for society as a whole.  Startups, infrastructure investments, private capital lending, etc.  The notion that none of that makes it to the lower rungs of society is false.  \n\nThat being said, on a moral level I do think chasing endless profits (mostly happens through shareholder mechanisms and increasing returns on capital desired by shareholders) is bad for society as a whole and is rampant right now.", "score": 1, "replies": [{"body": ">The notion that none of that makes it to the lower rungs of society is false.\n\n\nTrickle down has been proven to be a bullshit excuse by the wealthy few who designed the system in the first place. It just doesn't contribute back to society in any meaningful way. That's why we're in this situation to begin with...massive wealth has been concentrated at the top in an ever growing pile that doesn't get redistributed for any recognizable societal economic gain. No tax is paid, no contribution is made back to the system they benefitted from.", "score": 1, "replies": [{"body": "I'm not arguing for trickle down economics, I'm arguing against taxing unrealized capital gains.  In my other posts I've detailed how this disincentivizes riskier and more volatile investments, which is in many cases where the effects on lower rungs of society comes from.  It is well established that good faith from the richest amongst us can't be relied upon.  \n\nThere are a lot of other ways to capture and steer where wealth goes, I think taxing unrealized capital gains is one of the dumbest, most dangerous ways to go about that.", "score": 1, "replies": [{"body": "I never said I support unrealized gains tax. I support a massive tax on loans against accrued capital that sits idle.", "score": 1, "replies": [{"body": "Forgive the multiple conversations ongoing, but I do agree that would be an avenue worth looking into.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "More money will flow through to the government, and they will effectively redistribute it to those who are more worthy. What could go wrong?", "score": 2, "replies": []}]}]}, {"body": "Maybe they’ll spend it or invest it in tangible businesses instead of hoarding ", "score": 4, "replies": []}, {"body": "We can only hope! Having masses of capital sit accruing gains while the investor's pay zero tax but borrow against is not acceptable. They participate in the system and reap the benefits of it, so why not make them contribute as well?", "score": 3, "replies": []}]}]}]}, {"body": ">fumblefuck\n\nThat's a new word, I'm adding it to my list, ty lol", "score": 1, "replies": []}]}, {"body": "PLTR about to be flat for 4+ years", "score": 2, "replies": [{"body": "Until I buy in, then back down, then flat.", "score": 4, "replies": []}, {"body": "Nothing wrong with that. It could be flat for a decade. Nothing wrong with that. ", "score": 2, "replies": []}, {"body": "![gif](giphy|Qumf2QovTD4QxHPjy5)", "score": 1, "replies": []}]}, {"body": "I can feel it", "score": 2, "replies": [{"body": "In my fingers", "score": 1, "replies": []}, {"body": "![gif](giphy|14wvv11LhZRb6o|downsized)", "score": 1, "replies": []}]}, {"body": "First once again", "score": 3, "replies": [{"body": "unbelievable. are you a wizard??🧙‍♀️ ", "score": 1, "replies": []}]}, {"body": "![gif](giphy|CqJW7tiToflSUPokAR|downsized)", "score": 1, "replies": []}, {"body": "Tsla has topped. I’m calling it 😂😂\n\nhttps://www.reddit.com/r/wallstreetbets/s/zKkGEQdJOE", "score": 1, "replies": [{"body": "Got it. Buying 10x leveraged shares now", "score": 1, "replies": [{"body": "this guy knows what’s up ", "score": 0, "replies": [{"body": "I actually did buy a few hundred euro's worth of 10x levshares. Probably going to sell them in half an hour", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hey it's me, your kid", "score": 0, "replies": []}]}]}
{"title": "Going bullish now that the herd understands the rate cut recession is looming", "selftext": "[removed]", "id": "1fch5kw", "created_utc": 1725856111.0, "score": 117, "upvote_ratio": 0.78, "num_comments": 117, "comments": [{"body": "position?", "score": 1, "replies": [{"body": "Doggy is the best ![img](emote|t5_2th52|4258)", "score": 25, "replies": [{"body": "Receiving or giving is the question we should be asking ![img](emote|t5_2th52|27189)", "score": 3, "replies": []}, {"body": "I prefer helicopter", "score": 5, "replies": []}]}, {"body": "69?", "score": 3, "replies": []}, {"body": "Cash or very short term bullish scalps during next 2 week time frame is my suggestion. ", "score": -13, "replies": []}, {"body": "If your looking for specific tickers. Scalp QQQ & SPY calls expiring 1 month out during next 2 weeks. ", "score": -18, "replies": [{"body": "Not looking for advices, just need you to back up your talks with your positions", "score": 29, "replies": [{"body": "Ok well I'll be scalping QQQ & SPY calls during next 2 weeks. As always, will be sharing screenshot of my profits each time. With bear market about to be triggered I will be very careful playing longs. ", "score": -14, "replies": [{"body": "That doesnt sound very bullish of you lmao", "score": 20, "replies": [{"body": "OP´s position: 2 shares of Nvidia 200USD all in Scalping one dollar at a time", "score": 4, "replies": []}]}]}]}, {"body": "Scalp deez nutz", "score": 8, "replies": []}]}]}, {"body": "Good DD \n\nIm in", "score": 86, "replies": [{"body": "I was in for the Dole banana DD a few years back, so I’m sure as hell in for this (I’m regarded)", "score": 8, "replies": []}, {"body": "Good dick delivering ? I don’t believe you, show me ![img](emote|t5_2th52|12787)", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|29637)", "score": 4, "replies": [{"body": "Thought this was the daily thread sorry bud ![img](emote|t5_2th52|4640)", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|8883)", "score": 3, "replies": []}]}]}, {"body": "We asked for the D and homie went BOGO", "score": 5, "replies": []}]}]}, {"body": "Mercury is in retrograde, I'm feeling bearish so it's time to inverse myself and yeet my daughter's formula money into leveraged calls (my wife left me weeks ago)", "score": 36, "replies": [{"body": "Short the copper market. Olympic medals looked like ass this year. Adjust leverage per personal tolerance and profit. Not exactly a unicorn but enough to put bread on the TV tray and a pack of Marlboros for your sons 13th birthday", "score": 9, "replies": []}]}, {"body": "As in a reverse market crash?", "score": 31, "replies": [{"body": "Best kind of crash.", "score": 12, "replies": [{"body": "Crashing upwards, boys.", "score": 4, "replies": [{"body": "Falling up the stairs", "score": 2, "replies": []}]}]}, {"body": "short $USA $USA", "score": 1, "replies": []}]}, {"body": "Went into tqqq on friday at close. Regards think just because jpow says every speech he doesnt care about politics or stocks that he actually doesn’t care. This admin will do whatever it needs to do to save retirement accounts.\n\nTime to pump.", "score": 41, "replies": [{"body": "Rate cuts + turbo BRRRR, save the cheerleader, save the world, or something like that...", "score": 7, "replies": [{"body": "Hiro!", "score": 3, "replies": []}]}, {"body": "You do realize rate cuts will cause an accelerated rotation into small caps and out of mega cap tech right?", "score": 3, "replies": [{"body": "Sshhh observe the regard in their natural habitat", "score": 14, "replies": []}, {"body": "Why?", "score": 2, "replies": [{"body": "The conventional belief is that small caps need to borrow money, therefore low rate = bullish.\n\nAnd that might be true... except mega caps have much better returns since forever no matter the environment.\n\ntl;dr who knows", "score": 5, "replies": []}]}]}, {"body": "You and me 🫱🏼‍🫲🏻", "score": 2, "replies": []}, {"body": "Better DD than op", "score": 1, "replies": []}]}, {"body": "If my account goes this green after hours on a Sunday it means we tanking at open. That’s all I know.", "score": 15, "replies": [{"body": "This happened more than once to forget. When I saw my account today morning going 1% up after a 10% dip last week, that is when I knew, I have to find my local listings on Wendy’s", "score": 6, "replies": []}]}, {"body": "position or ban", "score": 16, "replies": [{"body": "Let me rephrase. I will be scalping calls in SPY or QQQ for next 2 weeks in expectations of ATH being touched. ", "score": -8, "replies": [{"body": "Whew, good luck sir. \nI think we won't see 565 again until Thanksgiving.\nIf we get below 530 I may pile into that position.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "So… no position. ban", "score": 4, "replies": [{"body": "Your right I suppose, let me be clear for the regards. Scalp QQQ and SPY calls during next 2 weeks. ", "score": -9, "replies": [{"body": "🤡![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}]}]}, {"body": "I'd say go all in and never go back.", "score": 11, "replies": [{"body": "go all in on VXX", "score": 1, "replies": []}, {"body": "You won’t go back but you may go down … or up", "score": 0, "replies": []}]}, {"body": "!RemindMe 6 months", "score": 5, "replies": [{"body": "I will be messaging you in 6 months on [**2025-03-09 04:40:12 UTC**](http://www.wolframalpha.com/input/?i=2025-03-09%2004:40:12%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1fch5kw/going_bullish_now_that_the_herd_understands_the/lm8cv1p/?context=3)\n\n[**5 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1fch5kw%2Fgoing_bullish_now_that_the_herd_understands_the%2Flm8cv1p%2F%5D%0A%0ARemindMe%21%202025-03-09%2004%3A40%3A12%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201fch5kw)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 5, "replies": []}]}, {"body": "I've looked at index performance tanking with rate cuts historically. But I didn't bother to look at which caused the other. How many times did a world event destabilize the markets and rate cuts were the response. The world will never know if they wait for me to look it up, but I will say that world events don't really matter to U.S. markets anymore. Not more than a week or 2 anyway. WW3 is priced in.", "score": 4, "replies": [{"body": "Most rate cuts are in response to a poor economy but these upcoming rate cuts were planned and are a response to lowering inflation to normal levels, right?", "score": 2, "replies": [{"body": "Yeah I guess that's the story, even though unemployment numbers have been underestimated and I seem to remember the definition of a recession being changed so we could go on winning big with no recession. So I wonder how the market has responded historically when rate cuts came without a recession.", "score": 1, "replies": []}]}]}, {"body": "Ok Leon", "score": 3, "replies": []}, {"body": "It's a sell the news. Market tanks super hard on rate cut day.", "score": 3, "replies": [{"body": "So everyone has taken bearish positions expecting it to fall drastically.", "score": 2, "replies": [{"body": "It is the way", "score": 2, "replies": [{"body": "It could shoot up drastically if everyone books profits.lol", "score": 2, "replies": []}]}]}]}, {"body": "Great! Just tell me your positions and I’ll do the opposite.", "score": 5, "replies": [{"body": "Ok. Sell to open calls expiring 1 month out. QQQ or SPY. Good luck 👍 ", "score": 2, "replies": [{"body": "Hmmm nah I’ll just do meme stocks thanks", "score": 3, "replies": [{"body": "I’m all in $Ligma", "score": 1, "replies": [{"body": "Ligma nuttzzzzzz", "score": 2, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Ligma nutzzzzzz", "score": 1, "replies": [{"body": "Ligma?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "NVD gonna print hard tomorrow.", "score": 8, "replies": []}, {"body": "So what I will never understand is the indecisive nature of people saying a rate cut is bad... people have more money to spend on stuff and stocks... however, the counter is it's a sign of a recession and things are bad.  So... we are always left with a coin flip of how the market is going to react and in most cases it goes bearish before a face ripping bull to follow. \n\nThe way I see it... Shits bad... we know shits bad... the rate cut will make it better. Every person is effected by a rate cut and we have more money to spend making grandma disappointed from heaven.", "score": 7, "replies": [{"body": "Wheres this “more money  to spend” coming?", "score": 7, "replies": [{"body": "Not from my pockets, I hope that helps...", "score": 3, "replies": []}, {"body": "“Wire STORMWATER fee directly to off-shore account citizen!”\n\nGonna be new military hardware in Eastern Europe and the mid east.\n\nTanks for nothing!\n\n\n\nP.S.  yah.  THEY will find a way to spend zee money!", "score": 1, "replies": []}]}, {"body": "I mean in the past, hasn't the market loved rate cuts?", "score": 2, "replies": [{"body": "All year people kept spewing \"X month is always Y\", \"B historically happens after A\", etc. and I've listened to them and I've gotten burned lol. Now it's \"September is always red\" (which is mostly true) and bet it's going to be face ripper green. It feels like markets at just fucking with everyone. \n\nSo who knows", "score": 3, "replies": []}, {"body": "Lol. Well nasdaq 70% drop when 2001 rate cuts began and 55% drop when 2007 rate cuts began was loved by bears, that's for sure. ", "score": 2, "replies": [{"body": "That’s cherry picking … https://www.schwab.com/learn/story/what-past-fed-rate-cycles-can-tell-us", "score": 3, "replies": []}, {"body": "Cherry picking the two cuts that were done in response to disasters. This is just normal qe which markets obviously prefer over qt", "score": 1, "replies": []}]}]}]}, {"body": "Can someone help me understand how the interest rate cut will affect stocks? I’m new and trying to wrap my head around what’s coming. I’m trying to buy low and turn around some profits quickly, while also investing in some long terms.", "score": 2, "replies": []}, {"body": "So try best to take max profits and cash out for the next big recession? or dare i say... depression?", "score": 2, "replies": [{"body": "Nickels.\n\nIt’s a recession when you wire your STORMWATER fee to your fugazi municipal service corporation.\n\nIt’s a DEPRESSION for Enron Musk when he has to wire HIS STORMWATER fee (per dissolution protocols set in forth by the Clean Water Act of 1972 aka Tricky Dick’s Liquidation Act) to YOUR uhhhSTATE (NYSE: ESTATE).", "score": 0, "replies": [{"body": "i think i need to take an adderall to understand that", "score": 8, "replies": [{"body": "Nickels (5 cent pieces aka Fiat Metals) have a melt value of 106%.  \n\nYep.  This might take all week!!!", "score": 1, "replies": []}]}]}]}, {"body": "Don't know, I have to consult grandma.", "score": 2, "replies": []}, {"body": "Source? \"Trust me bro\"  \nPositions? \"![img](emote|t5_2th52|52627)\"", "score": 2, "replies": []}, {"body": "https://preview.redd.it/lqcc6o9bnqnd1.jpeg?width=1079&format=pjpg&auto=webp&s=a239db3e77c0e896e23db2138e49b05def67c46c\n\nUSA 🦅🇺🇸![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 166 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Are there any qqq leveraged etfs which are less leveraged?", "score": 1, "replies": []}, {"body": "Good ol’ Jpapa to the rescue", "score": 1, "replies": []}, {"body": "shrewd", "score": 1, "replies": []}, {"body": "They have to print in order to pay debt. Easy as that. More money. More inflation. More loans. More bubble. Crash after elections. Easy.", "score": 1, "replies": []}, {"body": "But market is always priced in.", "score": 1, "replies": []}, {"body": "lol no it’s not. This is probably going to be the worst market week in a generation.  I see nothing but asset price cuts on Zillow. Other market signs are also terrible. Debts up, people struggling, most companies not hiring at all, etc.  yet the market is valued at something insane like twice the GDP and over 2.5x money supply.", "score": 1, "replies": [{"body": "Any chance we have a recession and the S&P500 rips higher? Seems like no matter what the companies at the top are gonna hoover up investment money and continue to rake in profits.", "score": 1, "replies": []}, {"body": "!remindme 5 days", "score": 1, "replies": []}, {"body": "so you bought some big ball puts?", "score": 1, "replies": []}, {"body": "worst market week in a generation? none of us have a clue whats next hey..", "score": 1, "replies": []}]}, {"body": "Be bearish, inverse yourself and be bullish. Now you're bullish and should inverse yourself.  \nIron condors it is?", "score": 1, "replies": [{"body": "Bought puts on my calls! LFG", "score": 1, "replies": []}]}, {"body": "I think I'm going to sell all of my Intel stock and buy some hot Grandma.", "score": 1, "replies": []}, {"body": "I don't understand.\n\nI thought we would be in bear territory once rate cuts came in. Why are we bullish? Especially in September of all months\nOctober should be np different than September", "score": 1, "replies": [{"body": "Easy. J Pow needs to do a quick short squeeze. ", "score": 1, "replies": [{"body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "How deep do you think the drop is going to be after?", "score": 1, "replies": [{"body": "I would like to see a multi month bear market of a minimum of 30% but long term really is tough to predict. I can only do a few days max accurately tbh.", "score": 1, "replies": []}]}]}]}, {"body": "Good for me, all in all", "score": 1, "replies": []}, {"body": "A recession is unavoidable at this point, they wouldn't be cutting rates otherwise", "score": -8, "replies": [{"body": "Counter: A rate cut avoid a recession.", "score": 10, "replies": [{"body": "Sure, if they time it well. but they always cut rates too late", "score": 1, "replies": [{"body": "Counter : this time they got pow pow ![img](emote|t5_2th52|4640)", "score": 1, "replies": []}]}]}, {"body": "Did you think they’d just hike rates and leave them there forever? lol\n\nRate hikes to curb inflation are followed by rate cuts as inflation drops and unemployment increases. Sort of how it works.", "score": 8, "replies": []}, {"body": "I wonder what the deficit as % of gdp tops (or is it bottoms?) out when that happens?\n\nin 2008 it was near -10%, covid -15%.  do we sniff - 20% this time around?  not bad considering we don't even have a pesky world war going on", "score": 2, "replies": []}, {"body": "Macroeconomic genius", "score": 1, "replies": []}]}]}
{"title": "Intel: We Have The World’s Fastest Integrated GPU, And Here’s Proof", "selftext": "", "id": "1fci8ax", "created_utc": 1725860177.0, "score": 1704, "upvote_ratio": 0.94, "num_comments": 504, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 2 days ago\n**Total Comments** | 26 | **Previous Best DD** | \n**Account Age** | 6 days | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "But can it mine Dogecoin? I need more Dogecoin!!!", "score": 3, "replies": []}]}, {"body": "C'mon INTC, make gramma proud.", "score": 2018, "replies": [{"body": "Grandma is smiling from heaven ![img](emote|t5_2th52|4271)", "score": 386, "replies": [{"body": "800k in the hole", "score": 132, "replies": [{"body": "800k hole but fastest iGPU", "score": 93, "replies": [{"body": "Just reading the word 'integrated' gives me a shudder down my spine.", "score": 49, "replies": [{"body": "People here domt know what integrated graphics are.\n\nThey think when you buy a prepuilt, the gtx 4070 that comes in it is \"integrated\" bc they didn't have to put it in themselves.\n\n\nI have comments replying to previous posts exactly like this.", "score": 41, "replies": [{"body": "Rtx. Gtx hasn't been a thing since 10 series gpus.", "score": 0, "replies": [{"body": "You are right,  I've been in the game for a minute.", "score": 2, "replies": []}]}]}, {"body": "Why buy many part, when one part do trick.", "score": 7, "replies": []}]}]}, {"body": "What a strange place to keep 800k dollars.", "score": 11, "replies": []}, {"body": "He did increase the amount of money", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/cutsrq942snd1.jpeg?width=269&format=pjpg&auto=webp&s=7af3ace2a074f324eee59e68d124046ec7d7dbf5", "score": 89, "replies": []}, {"body": "https://preview.redd.it/qv0q4enn3tnd1.jpeg?width=1792&format=pjpg&auto=webp&s=2ee3efe6b036336d28a3b56ea70df78096ccc25c\n\nshe smilin’ now", "score": 29, "replies": []}]}, {"body": "https://preview.redd.it/hb2sdrtr3tnd1.jpeg?width=1792&format=pjpg&auto=webp&s=62f7315e1d6307caf3837c0527c5ccac6ae0446c\n\n*make me proud, damnit*", "score": 51, "replies": [{"body": "AI really can’t do fingers 😂", "score": 6, "replies": []}]}, {"body": "MEE-MAWS REVENGE!", "score": 10, "replies": []}, {"body": "Please keep in mind, nobody other than Intel even cares about integrated GPUs, AMD makes them out of necessity.\n\nIt's like Intel invented their own sport nobody cares about and then called themselves world champions.", "score": 122, "replies": [{"body": "Wtf? Laptops and handhelsa are huge market", "score": 92, "replies": [{"body": "They are huge market, but not growing compared to AI chips and data centers, which this iGPU does nothing to address. Even if this release was so good that Apple said fuck it, we putting intel back in, sure the stock would fly, but the same fundamental issue of lacking a strong AI product.", "score": 11, "replies": [{"body": "Apple will never put Intel back in. The best thing Intel could get is Apple using their fabs for future chips.", "score": 13, "replies": []}, {"body": "For the server farm market, sure. But the consumer market (and lite enterprise market) have zero use for owning AI hardware. They still require their own normal computers, which will by and large have iGPU's.\n\nHell even massive AI server farms will use normal computers as access points.", "score": 5, "replies": []}, {"body": "Doing iGPU doesnt prevent you from developing AI solutions by other teams, lol.", "score": 1, "replies": [{"body": "Never said it did, but this release doesn’t really\nhelp intel solve its existential issues. The fact that they are announcing this and not a true AI chip shows they are struggling. Stock has not moved, no media attention for this, it’s a sad attempt by intel to show some dominance , but ultimately in an area with absolutely no interest. \n\nThey needed an AI product yesterday, and this drop shows no progress or plan towards that.", "score": 2, "replies": [{"body": "Lunar Lake includes an NPU that is up to Microsoft's spec and it outperforms both Qualcomm and AMD for these types of devices.\n\n  \nAI is also a huge bubble and I would recommend that Intel be careful when chasing that revenue.", "score": 2, "replies": []}]}]}]}, {"body": "I stopped building my own desktops and just use laptops now.  Less power use, less fan noise, portable.  Costs about the same as comparable desktops these days.  Most come with two NVMe slots so it's easy to add more storage.  They also come with HDMI and USB-C ports.  I got a USB-C port expander that includes HDMI which allows me to connect two external monitors.", "score": -2, "replies": []}, {"body": "They are, but in the case of Laptops Apple has their own solution and they sure as hell won't be buying Intel CPUs while for other Laptops almost everyone prefers a very beefy CPU that doesn't waste any die space on an iGPU and instead just has a standalone one, unless Intel plays this VERY smart they're going to end up like all the other Intel iGPUs: as bait in midrange Laptops that at the end of the day are still shitty.", "score": -10, "replies": [{"body": ">almost everyone prefers a very beefy CPU\n\nThis is total nonsense lmao. Over 70% of the market is iGPU and most laptop users prefer more battery life, less fan noise, and less heat than more compute.", "score": 36, "replies": [{"body": "Yeah and how many of those care about the actual performance of the iGPU as long as it doesn't violently shit itself when watching Youtube/Netflix?", "score": -6, "replies": [{"body": "Jezz christ\n\nOf course capability to play games at reasonable settings while being lightweight laptop is beneficial as hell\n\nIf it ran gta6 at 40 Id buy it instantly", "score": 15, "replies": [{"body": "Intels claiming these will do 100fps 1080p medium in Apex, so it'll probably do more than 40fps in GTA", "score": 6, "replies": [{"body": "Even better", "score": 2, "replies": []}]}, {"body": "It would be in theory, but who believes these claims!?\n\nI worked laptop sales. People who buy a work laptop don't give a rat about games and when they do, they usually get a secondary device for that. Alone for the separation of work / private life.\n\nAlso from a sales standpoint: Nobody believes the whole \"integrated CPU for Gaming\" claim. Reminder that Intel has been pulling this sales pitch for Intel Iris for years. 30 FPS fluid for GTA 5 at full-HD...\n\nRiiigghhhhhhht.", "score": 0, "replies": [{"body": ">Nobody believes the whole \"integrated CPU for Gaming\" claim.\n\n  \nI do, considering it *already exists*. The Steam Deck and Ally for example. \n\niGPUs are **already** getting [80fps in 1080P high](https://www.notebookcheck.net/AMD-Zen-5-Strix-Point-iGPU-analysis-Radeon-890M-versus-Intel-Arc-Graphics-Apple-M3-and-Qualcomm-Adreno-X1-85.868475.0.html) (AMD 890M)  in GTA-V.", "score": 3, "replies": [{"body": "> already\n\nit's been 13 years", "score": 1, "replies": [{"body": "13 years? iGPU gaming hasn't really been actually competent until recently with AMD's recent releases. If anything, Intel is *late* to the game. \n\nThis isn't speculation. Like, just look at my link. iGPU's are getting 80FPS 1080p high settings on iGPU. Steamdeck is iGPU gaming, and it's on several generation old hardware at this point.\n\niGPU gaming isn't replacing dGPU gaming. It's bringing gaming to formfactors that haven't been viable before.", "score": 1, "replies": []}]}, {"body": "Is that really comparable, though?\n\nYou talk about a handheld console with specific steam deck optimized releases and the console being sold under that flag of budget / handheld Gaming.\n\nThe Sales Pitch for this Intel stuff is way different, they promise reliable performance for full games in their classic release state. Not the same thing and I believe it to be highly deceptive and unethical.\n\nI already hear that one unlucky kid crying, who's tech unknowledgable parent swallowed the slogan and got their kid some work laptop for Gaming.\n\nI loathe these unethical sales people who never adjust expectations realistically something fierce.", "score": 0, "replies": [{"body": "The 890M in the benchmark I linked you is an iGPU laptop from AMD's recent release. It's the iGPU that Intel is specifically benchmarking their claims against. It's not a Steamdeck.\n\nAnd the Steamdeck specific optimizations are to make sure the game runs properly in Proton. Not that it gets additional performance: Steamdeck's \"custom\" hardware is that it's a 4 core version of an APU that was only sold with 6 or more cores to other OEMs.\n\nAnd LNL laptop aren't going to be as good as gaming laptops. They're going to give you good enough gaming at 30W and less in a thin and light laptop. Actual gaming laptops will still outperform them by a wide margin, but at the expense of weight, heat, noise, and battery life.", "score": 1, "replies": []}]}]}]}]}, {"body": "Industry doing transcoding work", "score": 2, "replies": []}, {"body": "People throw shade, but you're right.\n\nOnly techies and financially invested Intel bagholders like us care.\n\nNormies shrug their shoulders.", "score": 1, "replies": []}, {"body": "People who use their laptops for any hardware accelerated task care about it. Encoding/decoding for example. There's a reason why Apple also put a strong iGPU in their chips despite having little to no game support.", "score": 1, "replies": [{"body": "> Encoding/decoding for example\n\nYeah but they're gonna want a fat CPU with as many cores as possible and not waste anything on an iGPU when CPU + Standalone GPU is way more potent.\n\n\n>There's a reason why Apple also put a strong iGPU in their chips despite having little to no game support.\n\n\nThat reason is to save costs and further fleece Apple cultists and to save on space which is the only acceptable reason but one not many manufacturers will be able to get away with, not everyone is Apple.\n\nThe standalone GPU in my 5 year old Laptop I bought for 900 bucks almost beats the M3 btw.", "score": -1, "replies": [{"body": "Save costs and fleece customers by putting a bigger iGPU? What?? That adds cost lmao. \n\nAnd your laptop is not even remotely competitive with this in perf/watt. The entire laptop, screen included, draws less power than just your dGPU. Can you laptop do over 10 hours of web browsing? 10 hours Teams video calls? Does it weigh only 1KG? Is it completely silent and cool to the touch?\n\nNope.", "score": 3, "replies": [{"body": "> Save costs and fleece customers by putting a bigger iGPU? What?? That adds cost lmao.\n\nAre you tech illiterate?? What do you think is more expensive, an iGPU or a standalone one?\n\n>And your laptop is not even remotely competitive with this in perf/watt. The entire laptop, screen included, draws less power than just your dGPU. Can you laptop do over 10 hours of web browsing? 10 hours Teams video calls? Does it weigh only 1KG? Is it completely silent and cool to the touch?\n\nAnd who do you think gives this much of a shit about this other than apple customers?", "score": -1, "replies": [{"body": "Obviously an iGPU is cheaper. But you know what's cheaper than using die space on a high computer iGPU? A low end iGPU like you suggest. Besides, there are some advantages to iGPU like memory size (see LLMs on Mac Studio)\n\n>who do you think gives this much of a shit\n\nYou're really out of touch with the market lmao. This **is** the market demand. Vastly more people use Teams for video calls than there are people that use Steam. Thin and lights outsell gaming laptops. iGPUs are the vast majority of the market.", "score": 2, "replies": [{"body": "Obviously there's a market for thin devices that get the job done.\n\nHow many people are there interested in thin devices that ALSO provide (relative) significant performance that AREN'T already Apple customers? I would argue that number is very small.\n\nAdditionally, eating into Apples customer base is extremely difficult and only made harder by the fact that it's not even Intel that decides how these CPUs will be used but their customers, ASUS and consorts aren't exactly known for the best decisions either, let's not even mention the insanity that is Dell.", "score": 2, "replies": [{"body": "Millions of people. I know *we're* interested in them at the Fortune 500 I work for. Our entire IT infrastructure is based around the assumption that the laptop is Windows. That's true for most companies. \n\nIf this wasn't such a big market, people wouldn't be making such a commotion about the Snapdragon Elite.", "score": 1, "replies": []}]}]}]}]}, {"body": "A while back when I was shopping around there really was want much of a savings on getting an igpu vs a 3080 thus I went gpu \n\nIt’s nice when I want to fire up ck3 or civ between tasks ", "score": 1, "replies": []}]}]}, {"body": "A lot. When I was in the industry people used to ask me why they can't play whatever AAA title on their laptop, and it was always because of integrated graphics.\n\nNow if you had a laptop that was competitively priced, and could handle anything, and didn't drain battery, it would change the world.\n\nWhy would anyone pay for less if they could get more at the same price?", "score": 1, "replies": [{"body": ">Now if you had a laptop that was competitively priced\n\nThis will be the make or break for this iGPU, it does seem decent in a vacuum (assuming they aren't stretching the definition of 1080p at medium settings) but if this isn't significantly cheaper than just throwing in a dedicated GPU it won't find any success because dedicated GPUs will just pull ahead.", "score": 3, "replies": [{"body": "Yes the key point is how much it will cost. If it's the same price, it really will be \"take my money\" time for them.", "score": 2, "replies": []}]}]}]}]}, {"body": "If Intel really manages to pull this off, it really *will* be a game changer. Cheap gaming laptops that don't drain battery.", "score": 5, "replies": [{"body": "They will have to improve their iGPUs way more than even this example to actually compete, besides, this is Intel we're talking about, I wouldn't be surprised if they end up pricing these so high they kill their own hype.", "score": 2, "replies": []}]}, {"body": "No one looks at apple for value.", "score": 2, "replies": []}, {"body": "There is a whole world outside US and Apple", "score": 0, "replies": []}]}]}, {"body": "Didn't amd recently release cpu's which only real selling point was their faster igpus?", "score": 23, "replies": [{"body": "That was 2015 or something and the point was more for very budget systems.", "score": -8, "replies": [{"body": "AMD is  a huge part of the steamdeck and many other handheld devices right now and has been.", "score": 12, "replies": [{"body": "Yeah but that's another part of the market Intel can't reach, especially since their iGPU is obviously tied to having an Intel CPU.", "score": -4, "replies": []}]}, {"body": "Way more recent than 2015 lol. February of this year to be more precise.", "score": 5, "replies": []}]}]}, {"body": "people care a lot. most lightweight laptops rely on igpu, even MacBook Pro, and igpu tech and power efficiency will be where the handheld gaming wars are fought. \n\nIntel seem to have done good on igpu, let's see how they go on power.", "score": 20, "replies": []}, {"body": "SOCs (system on a chip) are a necessity for a low-power mobile device, and iGPUs are crucial for them. Apples M line of chips really showed the world what an SOC could do in a laptop power envelope, though the RISC (reduced instruction set computing) implementation is also a big part of it as far as power savings", "score": 7, "replies": []}, {"body": "regarded take pls delete the internet from ur phone", "score": 5, "replies": [{"body": "And the other responses to peoples rebuttals show this person doesn't have a clue about anything....regarded is correct.", "score": 3, "replies": []}, {"body": "Intel baggie detected.", "score": -1, "replies": [{"body": "regarded af. I have an 5600g from AMD. Integrated GPUs are great. U are just dumb af", "score": 0, "replies": []}]}]}, {"body": "meanwhile, pretty much every student and office worker is given a laptop with an integrated gpu", "score": 3, "replies": [{"body": "Those will not be the high end CPU intel is advertising here.", "score": 3, "replies": []}]}, {"body": "So 🏈?", "score": 2, "replies": [{"body": "Pretty much but at least in Football Americans care, when it comes to iGPUs even Intel customers don't give a shit lmao.", "score": 2, "replies": []}]}, {"body": "Champagne meme dot jpeg", "score": 1, "replies": []}, {"body": "*AVX-512 has entered the chat*", "score": 1, "replies": []}, {"body": "AMD created the GPU.  I should know since I worked for AMD in the early 2010s.", "score": 1, "replies": []}, {"body": "Uhhh laptops? Hello", "score": 1, "replies": []}, {"body": "This take is just flat-out wrong. The vast, *vast* majority of all computers sold have iGPU's.\n\nThe biggest consumer computer market is laptops, the vast majority of which do *not* use discrete graphics. And even if we look into the business/enterprise side of things, the vast majority of business computers also primarily use iGPU's, even desktops. And right now there is a brand-spanking-new segment in consumer computers that so far have been exclusively iGPU - handheld Window/Linux gaming devices, such as the Steam Deck.\n\nDiscrete GPU's are comparatively an incredibly small niche of the overall consumer PC market. Gaming laptops, gaming desktops, and GPU-equipped workstations are *not* the average PC.", "score": 0, "replies": []}, {"body": "Uh no. Not everyone wants a chunky gpu inside their laptops that also leads to heat issues.\n\n\nIts a huge market segment.", "score": 0, "replies": [{"body": "Yeah but how many people are there that don't want a dedicated GPU but want a weaker iGPU but with higher cost compared to a shitty iGPU?", "score": 0, "replies": [{"body": "As I just explained, its not just about performance. Your regular Joe isn't conducting Geekbench benchmarks or trying to run the latest AAA games with mods. Your everyday user is a web browsing, youtube using NPC who appreciates the low temp, minimal noise laptop. That's where the majority of laptop segments lie. \n\nThe enthusiasts who want a powerful GPU are in the Desktop GPU market, buying RTX cards and building their own PC. They are not a big group but we are out there. This Intel news is good news for the average, everyday laptop user market.", "score": 1, "replies": [{"body": "Yeah but why would those NPCs want a good iGPU? They don't give a shit and only see the model with the shitty iGPU costing 100$ less and buy that one.", "score": 1, "replies": [{"body": "They dont look for one or even know it exists, but they will feel the \"difference\" in everyday usage such as video / photo editing, CAD, AI, VR, computing programs", "score": 1, "replies": []}]}]}]}]}, {"body": "Sounds like America 😅", "score": -1, "replies": []}, {"body": "Baseball..?", "score": -2, "replies": []}]}, {"body": "I wonder if INTC employees know and joke about this 🤔", "score": 4, "replies": []}, {"body": "and gamma too :)", "score": 4, "replies": [{"body": "https://preview.redd.it/vtna1hrk1und1.jpeg?width=270&format=pjpg&auto=webp&s=d3d4a13ad5615f4c608774c4e98810796f02dcf9", "score": 31, "replies": []}]}, {"body": "my intel says gramma was suckn that side dick", "score": 2, "replies": []}, {"body": "https://preview.redd.it/wsyye03fpwnd1.jpeg?width=1024&format=pjpg&auto=webp&s=0ddad778aaac50dd786f973d2ea517939c191c86", "score": 2, "replies": [{"body": "https://preview.redd.it/q6qi9vcwpwnd1.jpeg?width=1024&format=pjpg&auto=webp&s=c25ce6cbfa0b514363e0479235615947d781e80f\n\nAlternate version of intel guy+grandma", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/oayl98z2wynd1.jpeg?width=1024&format=pjpg&auto=webp&s=3f06cbaaf23f666e2ccd83343e70f121ae7057ec", "score": 2, "replies": []}, {"body": "https://preview.redd.it/sdg4w3i0ovnd1.jpeg?width=1024&format=pjpg&auto=webp&s=93e90dc8ab8b016467792d1f25b83949320d73d5\n\nmeemaw likes the news", "score": 3, "replies": []}]}, {"body": "If GPU stands for Giant Put Upswings I believe it.", "score": 760, "replies": [{"body": "How giant is your put position?", "score": 83, "replies": [{"body": "Bigger than your balls", "score": 95, "replies": [{"body": "So it ain't that big", "score": 103, "replies": []}, {"body": "Cool", "score": 18, "replies": [{"body": "![img](emote|t5_2th52|31224)", "score": 1, "replies": []}]}]}, {"body": "It's just around treefiddy.", "score": 2, "replies": []}]}, {"body": "Granny Pushing Upwards", "score": 6, "replies": []}, {"body": "I exited in 2 percent profit yesterday, portfolio management at its best", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/uueuwk646qnd1.png?width=3120&format=pjpg&auto=webp&s=02017762b62fff067caf73eec85dd189cc036d70", "score": 325, "replies": [{"body": "Damn that intel igpu absolutely smurfed in roblox", "score": 243, "replies": [{"body": "Roblox uses vulkan so maybe its optimized for that", "score": 22, "replies": [{"body": "Where do you see that Roblox uses Vulkan on Windows? There may be a setting to change your renderer, but it’s not default.", "score": 10, "replies": []}]}]}, {"body": "Bullish on Roblox now", "score": 56, "replies": [{"body": "Up 20% in the last month", "score": 3, "replies": [{"body": "I keep forgetting that this Playmobil game is a stock now. The emotion of rediscovering that never gets old.", "score": 1, "replies": [{"body": "our brain has miraculous ways to protect itself", "score": 2, "replies": [{"body": "Yes, it's really admirable.", "score": 2, "replies": []}]}]}]}]}, {"body": "never trust first party numbers. They always cheat on tests. They disclose it on the bottom part, but they ALLWAYS cheat. Not just intel. Nvidia and AMD too.", "score": 76, "replies": [{"body": "its the industry standard. equivalent to old gas mileage testing from the 90s era.", "score": 17, "replies": []}]}, {"body": "Looks like an uptrend 🚀🚀🚀", "score": 28, "replies": []}, {"body": "No Doom 3 benchmarks.\nPuts", "score": 11, "replies": [{"body": "No Unreal Tournament 2004 either... :-(", "score": 5, "replies": []}]}, {"body": "How can your phone be at 11% battery at 8am? Don't you charge it at night?", "score": 29, "replies": [{"body": "I like to live... Dangerously.", "score": 6, "replies": []}]}, {"body": "So AMD performs better for the good games, but you should get an Intel if you want to play Roblox or Apex Legends.", "score": 22, "replies": [{"body": "Minecraft?", "score": 1, "replies": []}, {"body": "Completely irrelevant statistic, no sane person wanting to play current gen titles is going to use a system with NO gpu at all - because this is what this is, like a gaming desktop with nothing socketed in the PCle. In reality this is completely irrelevant apart from faster and more stable rendering in light work applications on business laptops I suppose. 100% marketing", "score": -6, "replies": [{"body": "Did you forget about the existence of poor people or what? There are a lot of lower-income families where they’ll buy a laptop without a gpu because that’s all they can afford.", "score": 8, "replies": []}, {"body": "I think you are missing the point that this is beating laptop GPUs from just a generation or two, and doing it on a laptop that uses between 17-30 watts that has like 20 hour battery life. This is literally the best laptop product ever made if all of this holds up.", "score": 3, "replies": []}, {"body": "I think it's even more relevant, games like Minecraft don't need a beast system and having better performance for a cheap system means more sales to the masses", "score": 2, "replies": []}]}]}, {"body": "Any idea what quality settings these norm to?", "score": 20, "replies": [{"body": "It says medium on the side.", "score": 18, "replies": [{"body": "Oh derp", "score": 2, "replies": []}]}]}, {"body": "Charge your phone!", "score": 3, "replies": []}, {"body": "Hilariously includes several games where their GPU performed worse than the competition", "score": 4, "replies": [{"body": "They do that to get you to believe the numbers. If it’s a clean sweep it feels less trustworthy. Not that you should trust first party numbers, and I say that as an INTC shareholder. They all lie about performance, it’s normal to wait for 3rd party numbers for any computer chip", "score": 9, "replies": [{"body": "Except the games they are losing in are the games people are playing. Way more people playing Rocket League, War Thunder, and GTA 5 than are playing Roblox.", "score": -3, "replies": [{"body": "More people play Diablo 4 than rocket League I think.", "score": 3, "replies": []}]}]}]}, {"body": "1080p 30fps\n😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "score": -45, "replies": [{"body": "for an igpu thats good tho", "score": 57, "replies": [{"body": "It's great for an igpu. The issue is it's not great for gaming, and for literally any dollars more, you can (and everyone does, and will continue to) buy a dedicated gtx 2070 or higher and have better results.", "score": -2, "replies": [{"body": "Wow, does an RTX 2070 fit in a thin and light notebook?\n\nOh, it doesn't? Okay.", "score": 16, "replies": [{"body": "Nobody is gaming on a thin and light.  Literally nobody.", "score": -7, "replies": [{"body": "I mean, it's been a while, but I believe many students will likely be interested. They need to carry their laptops everywhere to work/study. But sometimes you just want to chill and play some games. \n\nOf course, if your goal is to play games, you will buy something accordingly. But there is a big user base that just want thin and light and just casually play some games.", "score": 6, "replies": []}, {"body": "Plenty of people who have abandonded the AAA hype train game just fine on low end hardware.\n\nDesktops are like 20% of the PC market.", "score": 6, "replies": [{"body": "7 people, but you do you", "score": -10, "replies": [{"body": "you do realise that most people play games like dota2 , lol , cs2 , overwatch etc..that is the use of that igpu not for the AAA games..", "score": 2, "replies": []}]}]}, {"body": "Sometimes I'm traveling and want to play a game of Counter-Strike. I have a desktop for gaming, and I'm not going to buy a brick of a laptop for playing games twice a year.\n\nAlso, iGPUs can be used for higher quality upscaling/downscaling of video playback. which can be very demanding for 4K content.", "score": 1, "replies": []}]}]}]}]}, {"body": "Still impressive that can run something like cyberpunk on a travel laptop without graphics card", "score": 22, "replies": []}, {"body": "Its for integrated GPUs...so yeah, its like having a gpu without buying one. Of course they are shit.", "score": 16, "replies": []}, {"body": "It's literally a tiny chiplet in the CPU, or however they did it this time. You know this is comparable to a 1650. That big thing now a few centimeters.\n\nAlso 30fps is the baseline... All of those are way above that.", "score": 11, "replies": [{"body": "30fps in pc gaming is literally government wellfare fps these days.\n\nPeople March outside the white for abortion, anti slavery and fps higher than 30 in pc gaming.\n\n\n3rd world countries get more than 30 fps gaming on pc these days.\n\n\nHitlers big shtick was he didn't want jews to game on dedicated graphics getting more than 30 fps.", "score": 3, "replies": [{"body": "Last sentence killed me.\n\nDon't let the Yiddish folk read your comment, they will declare total 30 FPS Lockdown on all your Gaming Accounts in retaliation.", "score": -1, "replies": []}]}]}, {"body": "me when I don't know how to read a bar chart", "score": 6, "replies": []}]}]}, {"body": "GPU:\n\nGrandma Passed Unfortunately", "score": 404, "replies": [{"body": "I just found out she has stage 4 cancer bruh at least give me some time to go visit her first", "score": 15, "replies": [{"body": "Puts on granny", "score": 24, "replies": [{"body": "There is only one thing I'm gonna put on this guys granny.", "score": 1, "replies": []}, {"body": "Cancer treatment is making strides. Buy the dip!", "score": 1, "replies": []}, {"body": "At least you don't have to spend the money on LEAPS", "score": 0, "replies": []}]}]}]}, {"body": "And still they'll fuck it up somehow.", "score": 236, "replies": [{"body": "I think this overly negative sentiment is sign of bottom", "score": 121, "replies": [{"body": "Good luck fellow bagholder!", "score": 58, "replies": [{"body": "Thanks, I will need it. Either that or spare grandma.", "score": 11, "replies": []}]}, {"body": "lol", "score": 6, "replies": []}, {"body": "INTC is a bottom alright", "score": 1, "replies": [{"body": "Disclaimer: \n\nNO FINANCIAL ADVICE - The Information on this comment is provided for education and informational purposes only, without any express or implied warranty of any kind, including warranties of accuracy, completeness, or fitness for any particular purpose. The Information contained in or provided from or through this website is not intended to be and does not constitute financial advice, investment advice, trading advice or any other advice. The Information on this website and provided from or through this website/comment is general in nature and is not specific to you the User or anyone else. You should not make any decision, financial, investment, trading or otherwise, based on any of the information presented on this website without undertaking independent due to diligence and consultation with a professional broker or financial advisory.", "score": 0, "replies": []}]}, {"body": "I could spread my ass-cheeks and fart on your face and you’d think it’s a sign to hold.\n\nBag holders are something else", "score": 1, "replies": []}]}, {"body": "So CyberPunk 2077 ran at 39 FPS according them.  Neat.  [Here's an M1 Max](https://www.youtube.com/watch?v=e5WP-upr2bU) running it at mid 30s to low 40s.  [Here's the M3 Max](https://www.youtube.com/watch?v=lYF2rwfDHcs) chilling in the 50fps range.  Do those not count as integrated?\n\nGame ain't even made for their architecture and they're clowning intel.", "score": 13, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "> Actually, you're the one who's wrong. CyberPunk 2077 ran at 39 FPS on an M1 Max, which is not exactly a 'normal' computer.\n\nedit: Forgot to reply to this part.  The 39FPS for CyberPunk 2077 is right off Intel's chart, right after Ghosts of Tsushima on the far left. The CPU in the chart is the Core 9 Ultra 288V which is [landing in laptops like the MSI Prestige 13 and 16 AI+ Evo](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/) which are pulling [direct comparisons to MacBook Airs with the m3 chipset](https://www.laptopmag.com/laptops/windows-laptops/the-msi-prestige-16-ai-evo-is-cheaper-and-better-than-the-macbook-air-15-m3-fight-me) despite much higher TDP.\n\n> And here's the M3 Max running it in the 50s. That's not a normal computer either. Your comment sounds like it's from someone who doesn't understand what integrated means.\n\nIt means integrated into the CPU as opposed to a separate package (i.e., discrete.) But don't take my word for it.  Ask [intel themselves.](https://www.intel.com/content/www/us/en/support/articles/000057824/graphics.html)\n\n\"Discrete graphics has its own dedicated memory that is not shared with the CPU.\"", "score": 1, "replies": [{"body": "M and M Max are different things, the difference being significant (as I understand it M MAx is 4xM):\n\nhttps://www.apple.com/newsroom/images/2023/10/Apple-unveils-M3-M3-Pro-and-M3-Max/article/Apple-M3-chip-series-architecture-231030_big.jpg.large.jpg\n\nhttps://www.apple.com/newsroom/2023/10/apple-unveils-m3-m3-pro-and-m3-max-the-most-advanced-chips-for-a-personal-computer/", "score": 1, "replies": [{"body": "> M and M Max are different things, the difference being significant (as I understand it M MAx is 4xM):\n\nThe difference is significant, but none of those differences account for \"the fastest integrated GPU\" being slower than other laptops with integrated GPUs in a similar size and weight category. \n\nThe chart tries to qualify this with \"Fastest Gaming in Thin and Light,\" but [the chart of available laptops throws that in the trash](https://www.ultrabookreview.com/69679-intel-lunar-lake-laptops/) with a bunch of 14\" and 16\" premium laptops being the 288V workhorses.\n\nA brand new 16\" laptop with \"the world's fastest integrated GPU\" should be able to keep up with a 16\" laptop with a chip released in late 2020, right?", "score": 1, "replies": []}]}]}]}]}, {"body": "Integrated GPU doesn't have a great market. If you really wanna game or run AI, you use a dedicated GPU.", "score": 8, "replies": [{"body": "It does matter for people that want a work computer while also being able to play a couple of casual games on the side. I think it is a relatively large market. At least I am looking for something like that.", "score": 15, "replies": [{"body": "Sure, but as a product it doesn't have a great margin.", "score": 14, "replies": [{"body": "They absolutely have a market, especially in places like Nigeria where very few people can afford gaming pc's, but many still want to game ", "score": -4, "replies": [{"body": "Yeah especially in places like fucking Nigeria where the average monthly salary is 770 USD, you INTC bagholders are so out of touch with reality it's actually hilariously sad. \n\n3rd world countries where the average salary after deducting bills, food and necessities can't even buy 1/3 of a first hand office PC. Recycling companies have been making a killing selling everything from used generations old office PCs to used bicycles for decades to countries like Nigeria while paying little to no taxes because it's considered recycled junk and they can claim carbon tax and green tax benefits. You think majority of the citizens there who can barely afford necessities are buying first hand PCs or some shit?\n\nConsumer retail market is piss in a bucket for tech companies compared to industrial market and business market. Even Intel's main revenue comes from the latter 2. One look at quarterly fiscal reports from major OEMs such as DELL, HP, Lenovo, etc who order tray chips from Intel to build office PCs would have told you your comment is fucking stupid, but yes keep finding another new bagholder cope to explain why this is bullish instead of a nothing burger.", "score": 3, "replies": [{"body": "I am Nigerian.... I live in Nigeria presently and I don't hold any INTC stocks...\n\n\nIt really depends on how low they are willing to drag those profit margins, and how low they can get the price in a few years. Currently, gaming machines are like 20% more expensive than regular PC's with integrated graphics. \n\n\nHaving a regular PC with somewhat premium graphics would be a game changer, though that too depends on how well their chips will actually perform", "score": 1, "replies": [{"body": "No fucking way you're Nigerian unless you're THE Nigerian Prince sending out emails for decades, otherwise you'd know the consumer market for locals is dominated by used PC parts and used laptops that are years old even though Nigeria is the richest country on the continent despite monthly salary being below 800 USD. Africa PC, the biggest PC parts website in Africa, is literally a \"refurbished\" PC and \"refurbished\" laptop seller based in South Africa and the closest thing the continent has to an ecommerce site for PC parts. They import from Dubai and UAE, who themselves buy the generations old PC parts(minimum 6 gens away but depends on country) marked as recycled junk from Taiwan, Japan, Korea and China. The fact that you call iGPUs \"premium graphics\" really highlight you know absolutely jackshit about the market, you are literally hyping something that you can only buy locally after probably 6-10 yrs time when it gets legally considered recycled junk. \n\n>It really depends on how low they are willing to drag those profit margins\n\nWHAT fucking profit margins are you even talking about??? There's no proper supply chains going through Africa by land exactly because foreign companies did the cost analysis and realize it's no longer worth it to try after almost a century worth of attempts being disrupted by wars, civil wars, terrorisms, warlords, you name it. China is the only country still trying and you should know how it's going. That's on top of the absolute non-existent market base because wages are so low in majority of the countries on the continent that the average working class can't afford a first hand computer without saving for months to even years. You talking about profit margins is equivalent to a hobo saying \"the homeless is absolutely a market if they just pull the profit margins of the drugs to $0 then give it to us for free\"", "score": 1, "replies": [{"body": "i concede. you've refuted everything i said and made me think for a little longer. Anybody that isn't highish-middle class is not going to be buying a 1000 dollar brand new PC for themselves or their family member. My view was too middle class-centric. \n\nDont think im ready to trade stocks yet.... I'll stick to my demo account till i enter university", "score": 1, "replies": [{"body": "Oh you're pre-university age? Alright then I'll tone it down, my bad.\n\nIntel HAS and HAD bull flags about them, but you have to understand that consumer market segment ain't one of them.\n\n1. It has very thin profit margin\n\n2. It is retail centric, meaning it will 100% take a hit when economy is not doing well\n\n3. The average consumer do not buy a new PC nor laptop every year. The average statistics puts laptop changes at every 3-5 years and desktop PCs at 4-7 years.\n\nEvery new launch, both red, blue and green would come out saying \"WE HAVE THE FASTEST ____.\" Then it either gets disproven by testers once product releases, gets exposed for exaggerating, do actually perform ALMOST as advertised, or very quickly loses their \"fastest\" crown to a competitor launch. It's not even mutually exclusive, see the current 9000 series debacle as people went from accusing AMD of lying, to updates making chips almost working as advertised, to now people complaining about false advertisements as AMD hides behind the good ol' \"performance may very due to fabrication process\" shield.\n\nProblem with Intel is it pretty much ALWAYS ends up being exaggerated or straight up lies. Intel was literally lying about knowingly selling oxidized chips and refusing to acknowledge it, until partners started coming out to expose them. Then they gave a non-apology and eventually admitted to it, resulting in a class action lawsuit. Believing in whatever they say without 3rd party test results is the same as believing Pinocchio while his nose is extending. This is true for all publicly traded companies, because it pays to lie about good results. But for INTC in particular, do not believe in anything they say until people actually get their hands on the CPUs to test them out. They are doing everything it takes to keep the ship sinking, they will lie as hard and as much as possible to do so.", "score": 1, "replies": [{"body": "Thank you for the incredibly insightful breakdown. I'm 16, looking to enter university next January. \n\n\nI'm still in the process of learning the strategies of trading securities, how to conduct research, how to interpret news etc. \n\n\nDo you think there is hope for intel? Would it be worth it buying the crater for cheap and hoping the current CEO can turn things around? \n\n\n once again, thank you for this ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Fair enough, but the profit margin on these isn't much.", "score": 2, "replies": []}]}]}, {"body": "Very few people do this.\n\nYour post and other similiar posts here tell me that people aren't active in the current job market.\n\nIn the year 2024, work laptops look like this:\n\nCompany: \"If you want to work with us, you get your own work laptop granted for the period of time you work here.\nThe network and all equipment is set up by us and locked down, so you don't get any weird ideas / spam / scam / distracted. Enjoy\"\n\nAdditionally, techies separate work and private life anyway for their own security reasons. Now you tell me where that mysterious Gamer / Worker hybrid market is. Because I don't see it.", "score": 10, "replies": [{"body": "Yeah but not every company has 1000 person IT dept that is monitoring every kb of inflow and outflow. Nor does every company care about pre-install some sort of monitoring software. I’m sure they would all love to but the cost is prohibitive and frankly unnecessary when your hybrid workforce is already banging during work hours. \n\nMy company bought me a laptop when I joined. I requested and received a new laptop 4 years later and sold the original (kept the money). Opened both boxes myself and set it up. Next year I intend to do the same.", "score": -1, "replies": [{"body": "You're definitely more of an exceptional case.\n\nNot just big players, but also many midsize companies are restrictive with their tech for their own good.\n\nAnd that is what matters. Scale. At scale most employees will get outfitted and pre-arranged gear with little to no administrator rights. None of those people will even get the idea to lookup some hardware specs. It's not something on their mind.", "score": 5, "replies": []}]}]}, {"body": "That pales into nothing compared to NVDAs enterprise use cases.", "score": 2, "replies": [{"body": "This is not the same market. Discrete GPUs are used in machines dedicated to computing. But every single computer requires a CPU. Those PCs that do not do computing (the vast majority) run on iGPUs. How much you care about the performance of the iGPU is a different story, but every thin and light laptop that is not a Mac runs on this type of chip. And you can bet that companies (and regular users) buy millions and millions of them.", "score": 0, "replies": [{"body": "I know it's not the same market, that's my point. Enterprise spending on GPUs absolutely dwarfs the millions and millions of integrated GPUs that are sold, and businesses will pay massive premiums to buy them to try to stay one step ahead of their competitors.", "score": 3, "replies": [{"body": "If it is not the same market, why did you bring it up?", "score": -1, "replies": [{"body": "Because this is WSB, and integrated GPU sales will have little-to-no impact on Intel's stock price. This announcement is like throwing a dead bird in the air and hoping it will fly. There are plenty of other places to chat about hardware.", "score": 2, "replies": [{"body": "WTF do you think intel sells? Wait, wtf do you think iGPUs are? I am not sure you even remotely know what you are talking about if you think iGPUs sales dont affect intel stock price. Their core business is CPUs. iGPUs are the GPUs that come prepackaged with the CPUs (because I begin to suspect that you dont know what an iGPU is). Having better iGPUs would make intel CPUs stand out with respect to other manufacturers' CPUs on this regard. There are no \"iGPU sales\". It is all CPU sales. Having better iGPUs for the same CPU means more sales in non-production machines, which are a pretty big part of intel market.", "score": 0, "replies": [{"body": "Then buy calls.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Yeah, GPU's in laptops tend to offer a poor tradeoff. Loud, lots of heat, thermal throttling, and heavy. Though, I am impressed at the Lenovo Legion Pro I bought refurbished. It is heavy, but doesn't throttle, stays cool, and surprisingly quiet.", "score": 1, "replies": []}]}, {"body": "Is this supposed to be relevant to the handheld segment or is that a different class of chips?", "score": 1, "replies": [{"body": "Cheaper laptops.", "score": 1, "replies": [{"body": "Makes no sense then. At likely the same price point, you can probably get a last gen mid tier dGPU laptop for the same price, like around a 3070 I would assume. I've already seen 4070 laptops well enough under $1000.", "score": 1, "replies": [{"body": "Yeah but those are not in the same product class. Lunar Lake is for long battery, premium ultra light and thin laptops.\nA 4060 Laptop at the same price will drain your battery 3x as fast and be twice the weight and thickness.", "score": 1, "replies": []}]}]}]}]}, {"body": "Fastest iGPU but crashing drivers that wipe your computer data", "score": 3, "replies": []}]}, {"body": "Can it run crysis?", "score": 80, "replies": [{"body": "It runs stock crysis, corporate crysis... so yeah it can", "score": 34, "replies": []}, {"body": "It’s to play Blooborne in 60fps", "score": 14, "replies": []}, {"body": "Unfortunately not.", "score": 2, "replies": []}, {"body": "At negative 24 fps", "score": 2, "replies": []}, {"body": "Yes - a modern day potato can run Crysis - even Intel's last gen integrated graphics will do it no problem.", "score": 2, "replies": []}, {"body": "Unironically it probably won't.", "score": -2, "replies": []}]}, {"body": "Bet these would have sold real well 5-6 years ago", "score": 40, "replies": []}, {"body": "Integarded", "score": 78, "replies": []}, {"body": "LOL! When real GPUs are becoming the size of a truck (allow me the exaggeration…) and all you have is a mega announcement about “the fastest integrated”… you’re beyond dead.", "score": 221, "replies": [{"body": "That must be really banking on the handheld PC market.", "score": 70, "replies": [{"body": "Not if the chip pulls more power than a budged desktop pc.\n\nEdit: \n\nOk I just checked the specs and the chip pulls 37 W peak. Not better than the competition but not as bad as expected.", "score": 36, "replies": [{"body": "Isn't this for the entire SoC + memory though?", "score": 10, "replies": [{"body": "Probably SOC, but 37W is still horrendous amount for a handheld.\n\nFor comparison, steam deck is 4-15W\n\nIn the handheld market it's not a victory if you're letting power go the the moon. At that point use an external gpu bay with a 4090 and dance you're winning.", "score": 7, "replies": [{"body": "I dont think comparing this to the steam deck is quite fair. First of all these tests are at 1080p which you won't be running at on the steam deck usually. Also the steam deck is specifically made for gaming, so the power distribution between the components will be different.\nThough these SoC are planned to be used for gaming handhelds next year. Let's see how they compare.", "score": 8, "replies": []}, {"body": "That's only the highest end ultra 9 chip.\nThe ultra 7 will not drain 37W for an extended time period.", "score": 1, "replies": []}, {"body": "The GPU and RAM are also on the same chip. The Steam Deck uses more that 15W total fyi.", "score": 1, "replies": [{"body": "Soc literally doesn't contain ram", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Just because it can draw 37 watts it doesn't mean that's what it is at constantly. From the demos I've seen it usually hovers around 20-22 watts during gaming.", "score": 1, "replies": []}]}, {"body": "Yes, you will be checking you email at a blazing 30 fps", "score": -7, "replies": [{"body": "What does this have to do with my comment?", "score": 7, "replies": [{"body": "I was just mentioning that igpus are mainly for normal system operation.  Meaning anyone trying to game will do so on a dedicated gpu, and the igpu will be relegated to handling tasks like browsing the web.", "score": -4, "replies": [{"body": "Yes. But games are still a good benchmark to showcase them. And the important part is performance per watt.", "score": 7, "replies": [{"body": "For sure, but it leads people to believe that it has anything to do with gaming, and it doesn't. The beat benchmarks on this igpu is garbage compared to dedicated graphics from 2010.", "score": 1, "replies": [{"body": "There are a bunch of casual gamers who like to play some league, Cs or fortnite here and there and for that these laptops are more than enough.", "score": 2, "replies": [{"body": "Ok. You guys tell yourself whatever you want. Go deep on igpu news.", "score": 1, "replies": [{"body": "It's less about the igpu news and more about the fact that Intel still has great designs. The whole SoC is quite impressive according to the released numbers and it would directly refute the whole \"x86 is dead, arm is the future\" narrative.", "score": 2, "replies": []}]}]}, {"body": "Dedicated dGPUs aren't getting 60fps with total system power under 30 watts", "score": 2, "replies": []}]}]}, {"body": "Steam deck is iGPU BTW. \n\nAnd also stronger GPU helps in any hardware accelerated task, like encoding/decoding", "score": 1, "replies": []}]}]}]}]}, {"body": "According to Intel, yes this chip is better than the competition. This is faster and more efficient than AMD's similar chip.", "score": 8, "replies": []}, {"body": "Knowing intel that's on idle with monitor off.", "score": -1, "replies": []}]}, {"body": "MSI Claw will be shipped with Lunar Lake and proper battery. I have seen comments in handhelds area, people are looking forward to it.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "No, integrated gpu's are very important for mobile, laptops, etc. Multiple chips means more power.", "score": 51, "replies": [{"body": "![img](emote|t5_2th52|18630)", "score": 14, "replies": []}, {"body": "Yeah but the industry is moving towards ARM SOC's with integrated graphics.  GPU performance is already fine on for instance an M-series chip, and the overall power efficiency is going to be leaps and bounds ahead of an x86 laptop chip.\n\nThe market for a powerful iGPU is just vanishingly small.  If you just want to play fortnite or genshin impact, any iGPU is going to be good enough.  If you want to play AAA games you will need a console or dedicated GPU anyway.", "score": -8, "replies": [{"body": "the market will probably get bigger as we get more handheld consoles (like the steamdeck and the rog ally) which actually benefit from a good iGPU", "score": 16, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I assume laptop gaming has been on a massive uptrend in recent years. Cheaper, smaller, portable, yet still powerful\n\nI used to hate laptops, but my Nitro 5 has been playing AAA games at ultra settings for years now", "score": 4, "replies": [{"body": "For most people, it's not the performance that ruins laptop gaming. It's the comfort. Even just having a proper monitor improves  impression so much. \n\nLaptops were able to run AAA games smoothly for a decade or so already, yet laptop gaming is in single digits % according to steam.", "score": 2, "replies": []}]}]}, {"body": "Steam decks and other handhelds do, and will continue to use dedicated graphics that are designed to fit the form factor.\n\nYou are aware nvda makes smaller versions of their dedicated chips right?", "score": -7, "replies": [{"body": "Sure, except for the fact that Steamdeck and other handhelds like Rog Ally does not use dedicated graphics. \n\nhttps://boilingsteam.com/an-in-depth-look-at-the-steam-deck-apu/\n\nhttps://videocardz.com/newz/asus-rog-ally-console-prototypes-have-been-pictured-featuring-a-closer-look-at-amd-ryzen-z1-extreme-chip", "score": 9, "replies": []}]}]}, {"body": "Well if integrated graphics were comparable to 4050's then the market would be pretty big.\n\nEven as an engineer being able to dock my laptop with multiple 4k screens is nice. 4k 120Hz", "score": 2, "replies": []}, {"body": "If they were really really good people would pay 1k+ for them, because it would be a high end video card and processor in one.", "score": 1, "replies": []}, {"body": ">the overall power efficiency is going to be leaps and bounds ahead of an x86 laptop chip\n\nNow this is exactly where you're wrong.", "score": 1, "replies": [{"body": "Show me an x86 laptop with better power/performance than a high-end arm based laptop", "score": 2, "replies": [{"body": "The new lunar lake powered laptops aim to show just that.", "score": 4, "replies": [{"body": "Do they show it?  They can \"aim to\" show whatever they want but results are what's important", "score": 0, "replies": [{"body": "The results they provided already show that they beat arm in performance per watt. The only reason I'm apprehensive is because I'm waiting for 3rd party tests. But if what they claim is true then they beat arm.", "score": 1, "replies": [{"body": "Yeah internal benchmarks can be super misleading.  The new snapdragons were supposed to be \"M-series killers\" and that didn't really pan out.", "score": 0, "replies": [{"body": "Well it's wasn't just benchmark slides. Intel had the laptops of the 3 different brands: amd, Qualcomm and Intel out on a show floor with all of the metrics being transparently tracked in realtime for various games. And Intel beat them all in both performance and power efficiency. Obviously I'm still holding out for 3rd party testing but so far it's looking really promising to me.", "score": 2, "replies": [{"body": "That's nice, and hopefully it's representative of real world performance, but even a demo like that can be misleading.  E.g. you don't know what configurations in the bios might be configured in a way to show the Intel chip in it's best light, without doing the same for other vendors.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I willingly allow you the exaggeration", "score": 4, "replies": []}, {"body": "It’s like saying “I have the fastest moped”. It’s still slow.", "score": 4, "replies": [{"body": "I mean... There are 700+cc mopeds on the market that can clear 100mph top speeds...", "score": 3, "replies": []}]}, {"body": "it's tough. also laptops with no dedicated gpu are slow af", "score": 1, "replies": []}, {"body": "You know that the by far largest part of a GPU is the cooling system? The actual GPU chip is usually not much larger than a CPU chip.", "score": 0, "replies": [{"body": "And is that cooling decorative? Or does it have a reason to exist that may be different in an integrated chip?", "score": 9, "replies": [{"body": "Would make a pretty bad keychain if they get rid of it", "score": 3, "replies": []}]}]}, {"body": "Ever heard of a game console? Xbox? PlayStation? Steam deck?", "score": 1, "replies": [{"body": "Nope. Neither the Xbox X nor PS5 use an integrated GPU. They have a dedicated GPU. Precisely because….\n\nEdit: So do gaming laptops, btw.", "score": 1, "replies": [{"body": "You should go look at the size of the GPUs in these consoles.", "score": -2, "replies": [{"body": "And yet… not an integrated one. I wonder why?", "score": 1, "replies": [{"body": "Irrelevant. You talked about size in your first post, not whether they are integrated or dedicated. The prior console generation used APUs too, console designers do whatever they want.", "score": 0, "replies": [{"body": "In a post about integrated GPUs… Do you reslly need to be explained that all comments relate to the original post?\n\nLol! Come on dude. You are supposed to be joking about being regarded.", "score": 2, "replies": [{"body": "You can have a CPU with an integrated GPU that is bigger than a dedicated GPU. \n\nDid you ever think that through, regard? Of course not, you're another pretend expert on this subreddit.", "score": 0, "replies": [{"body": "If you don’t know anything about the industry… try to at least read the article before showing us you are completely regarded. \n\nThink about why Intel would publish a chart titled “Fastest gaming in Thin and Light”.\n\nSpoiler alert -> It’s not going to be because anyone with half a brain would design an integrated CPU-GPU bigger than a dedicated GPU. \n\nWhen an assumption SOOOOOOOO basic escapes you… you should really reconsider to ever talk to a stranger again. Ever. You are only embarrasing yourself.", "score": 1, "replies": [{"body": "You tried and failed to make a point about CPU-GPU integration as a whole, surpassing the Intel context, so I don't care what Intel are doing. I work alongside the hardware industry in infosec, which is why I know this. End of story, go fool some other sucker here with your layman ideas.", "score": 1, "replies": [{"body": "“I work alongside the hardware industry” -> I have no clue what I’m talking about but let me throw words around hoping they won’t see my bluff. \n\nYou have no clue. And that is the reason you are trying so hard to deflect with the least original set of phalacies.\n\nNo worries champ. Your manhood is intact. Just stop talking nonsense about things you know nothing about. \n\n😘😘😘😘", "score": -1, "replies": [{"body": "> phalacies\n\nYou can't even spell \"fallacies\" correctly, but relax, you'll convince the other idiots here because the facts don't matter.", "score": 2, "replies": [{"body": "I am typing in English because that’s the only language you know. You are only responding in English because that’s the only language you know. \n\nI’m sorry you got humiliated so badly that your only recourse is pointing a spelling mistakes from a non-native speaker. \n\nBy the way… I’m going to take it as a compliment since it took you 8 comments to find the first mistake. And you didn’t realize I wasn’t a native. \n\n😘😘😘😘", "score": 0, "replies": [{"body": "English isn't even my first language. You can keep pulling random assumptions out of your ass, but it won't make you look less embarrassing. I am being charitable when I ignore your mistakes, but \"phalacies\" was a bit too amusing. You're clearly finished and I was right all along, so I won't bother you anymore.", "score": 2, "replies": [{"body": "Dude… you are the one who decided to stop talking about the topic and start with spelling. \n\nI guess it was too difficult to come back from “An iNtEgRaTeD CpU aNd gPu CoUlD bE BiGgEr ThAn a DeDiCaTeD GpU”\n\nEven someone as regarded as you realized how stupid that was. Happy to help you learn something today. \n\n😘😘😘😘", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Very true. \n\nI can get a laptop with a halfway decent NVIDIA GPU.\n\nIs it integrated, no, it's on a separate chip. \n\nBut can I tell that, looking at the laptop from the outside?\n\nNo. \n\nDoes intel even come close to that performance?\n\nNo.\n\nDoes intel compare itself to those laptop GPU's?\n\nLol, of course not.", "score": -5, "replies": [{"body": "power draw and heat/associated noise is generally much higher with a dedicated gpu. you underestimate the usefulness of a good igpu, especially in thin long-lasting ultrabooks.", "score": 11, "replies": [{"body": "Yeah, it takes like 10x as much power for a CPU to communicate with a dGPU vs an iGPU.\n\nThe most powerful iGPU is an important segment considering laptops and tablets are the vast majority of computer sales.", "score": 4, "replies": []}]}, {"body": "And those half decent gpu's come with no additional cost added to the laptop price?", "score": 1, "replies": [{"body": "You think the integrated GPU will be free?", "score": -6, "replies": [{"body": "Yes that’s literally the point of integration. So it will be “free” to manufacturers and they don’t have to source a graphics chip elsewhere.", "score": 3, "replies": []}]}]}]}, {"body": "Yeah who even looks at the stats for integrated gpu when buying? Nobody i would guess.", "score": 0, "replies": [{"body": "Only thing anybody needs to do is google “integrated GPU”\n\nHalf the results is people asking why their games are running on their integrated GPU and not their NVDA / AMD card. 🤣", "score": 1, "replies": []}]}, {"body": "Most GPU coolers are just plain oversized to make the customer feel like they bought something valuable. There is no reason for <300W designs to have those huge coolers", "score": -3, "replies": [{"body": "Maybe not those huge coolers. But certainly much larger coolers than what you’ll be able to run in an integrated GPU.", "score": 2, "replies": [{"body": "Sure. Those are two different scenarios though. One could increase the power efficiency of dGPUs by reducing the power draw (as done by miners in the ethereum craze). iGPUs often are built with the same architecture as the dGPUs are. Those aren't really two different things. The ryzen 7000 and 9000 CPUs iGPUs are based on RDNA2 - the architecture of the rx6000 dGPUs. \n\nSo in short: both are basically the same architecture (with iGPUs being an older gen) with different focus. dGPUs focus on performance without being limited by power draw or temps, iGPUs focus on power efficiency because they are limited by temps and thus by power draw.", "score": 1, "replies": []}]}]}]}, {"body": "(Article from 5 days ago)", "score": 55, "replies": [{"body": "Oh no! You mean its already obsolete? Curse you moores law!", "score": 66, "replies": []}, {"body": "priced in", "score": 3, "replies": []}]}, {"body": "Yeah, taking intel’s marketing slides at face value.", "score": 21, "replies": [{"body": "Article quote: \"We can *never* take internal testing at face value. Though it’s a long list of games — many of them popular or graphically demanding — the titles were certainly cherry picked to support whatever narrative Intel wanted to promote. Data can be amazingly malleable in that regard.\"", "score": 3, "replies": []}, {"body": "Taking Intel's [\\*Live Demo ](https://www.youtube.com/watch?v=q7ddSr77EQM)at face value", "score": 0, "replies": []}, {"body": "It's probably true, but also completely irrelevant. It's a tiny market.", "score": -4, "replies": [{"body": "Laptops are tiny market?", "score": 1, "replies": [{"body": "Work/gaming-hybrid laptops?\n\nGiant effing Yes to the Y.\n\nWork laptops are handed out by corporate temporarily like candy - They're an easy write-off and part of most IT-Consulting Solution packages.\n\nFor freetime people get real gaming devices to avoid any eventual diashows.\n\nWhere is that market you speak of?", "score": 2, "replies": []}]}]}]}, {"body": "This is the company known the fudging the numbers.. I think I’ll wait for independent testing before I believe any of this.", "score": 15, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They did compare it to the M3 on one multi-core performance / watt slide and apparently it was equal. \nInterestingly that same slide showed it losing to Meteor Lake  and strix point at higher wattages. \nBut if you really think about it, it makes sense.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don't think they showed it in the live presentation but they had a lot more slides. I don't know if there is a proper PDF download anywhere but I saw other articles including that specific slide.\n\nIf found [this article ](https://www.igorslab.de/en/lunar-lake-with-core-ultra-2nd-generation-presented-new-ki-to-go-and-a-little-more-of-everything-else/) which includes 113 official slides (close to the end of the article). The slide I mentioned is 22.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I mean what else are they supposed to do? Compare it to other unreleased chips? They compared to the latest available chips from their competitors and it's not like the HX 370 or X Elite aren't recent.  \nApple released the M4 but it's currently only available for the iPad so they can't really compare it to that one either even if they wanted to.\n\nAs for using TSMC, that was a decision that was made long ago and they had already booked capacity, Lunar Lake was never supposed to be using an Intel node. Their next generation Panther Lake chips are the ones that will hopefully use their own 18A process, at least that is what they have been specifically claiming up until this point.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "But will it melt?", "score": 16, "replies": [{"body": "Or will it blend?", "score": 9, "replies": [{"body": "Will it drill?", "score": 7, "replies": []}]}]}, {"body": "Intc is new gme... Diamond hands & to the moon lol 🚀🚀🚀💎💎💎", "score": 5, "replies": [{"body": "I can retire with my calls if Intel squeezes to $500", "score": 1, "replies": [{"body": "What call you got, I’m all in", "score": 1, "replies": [{"body": "I got a few October $20 strike , and some $22-25 strike next April, some 30 strike next September, and December.", "score": 1, "replies": [{"body": "Highly undervalued as a tech giant", "score": 2, "replies": [{"body": "Definitely one of the most hated semiconductor and AI stock right now .", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Bring that out in the open and let the user community validate if it is true everything INTC insider said ( or is just a buy time presentation for the upcoming board meeting). In the meantime the stock is sinking, that’s the fact.", "score": 11, "replies": [{"body": "September 24.", "score": 1, "replies": []}]}, {"body": "Grandma, get your wallet!", "score": 4, "replies": []}, {"body": "Intel 2: Meemaw Strikes Back", "score": 3, "replies": []}, {"body": "It's Grandma's soul that is reborn as lunar lake ... really glad ![gif](emote|free_emotes_pack|feels_bad_man)", "score": 4, "replies": []}, {"body": ">integrated\n\nlollll", "score": 31, "replies": [{"body": "Actually a pretty important segment. Handhelds similar to the Steam Deck will benefit as well", "score": 33, "replies": [{"body": "speed is less important than power draw for handhelds and portable devices, imo. battery life is and will be the bottleneck for the foreseeable future.", "score": 11, "replies": [{"body": "Have you see the efficiency for lunar lake?", "score": 7, "replies": [{"body": "nah. is it good?", "score": 1, "replies": [{"body": "Yes. It’s equal to the newest Qualcomm ARM chips which kinda disproves that ARM is always more efficient", "score": 14, "replies": [{"body": "1) We have no independent benchmarks for it.\n\n2) Competition will eventually too release new products.", "score": 4, "replies": []}]}, {"body": "Intel will sell a lot of these if they have enough capacity. It's a great platform if you are on the market to buy new hardware, ultrabook, laptop or handheld.", "score": 0, "replies": []}]}]}, {"body": "Arm has been shitting on Intel in terms of power consumption for pretty much forever.", "score": -1, "replies": []}]}, {"body": "Not that important for training AI", "score": 1, "replies": []}, {"body": "Is this comparing directly to a steam deck?  It is integrated, but that's a custom SOC which is more comparable to a low-end dedicated GPU iiuc", "score": 1, "replies": [{"body": "Steam Deck GPU is equivalent to RX 550. Intel is saying Lunar Lake GPU is 16% faster than the RX 890M which is a GPU planned to be going into some handhelds.", "score": 4, "replies": []}]}, {"body": "Not really. The power means little compared to efficiency and NVidia beats the shit out of them with DLSS and Tensor cores. \n\nAlso, nobody cares about best iGPU when the recent releases have been cooking themselves.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "So you didn't even have the time for a quick 30s google search to see what kind of product Lunar Lake is supposed to be?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well, no one is stopped you then. Enjoy your -30% battery life.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Desktop chips. High voltage. Laptop chips. Low voltage.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "INTL tryin' to appeal to that woke crowd...\"*See?!  We be all integrated 'n shit...*\"", "score": -3, "replies": []}]}, {"body": "VR and AR headsets use integrated GPUs.", "score": 3, "replies": []}, {"body": "Built by TSMC lol", "score": 3, "replies": []}, {"body": "This sounds like a put in the making.", "score": 10, "replies": []}, {"body": "Me too. All my dates say that I'm the fastest.", "score": 3, "replies": []}, {"body": "See u soon Gam Gam ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 4, "replies": []}, {"body": "lol integrated is a pretty big word here", "score": 8, "replies": [{"body": "Doing some heavy lifting, for sure", "score": 2, "replies": []}]}, {"body": "İsn't this technically incorrect? M3 max gpu is also considered as integrated gpu.", "score": 7, "replies": [{"body": "apple and gaming shouldn't be mentioned in the same sentence, unless you're saying\n\n\"apple is not for gaming\"", "score": 11, "replies": []}, {"body": "We don't care about Apple in gaming", "score": 3, "replies": [{"body": "Yeah but video editors would still be concerned about igpu performance.", "score": 5, "replies": []}]}]}, {"body": "So what are the profit or revenue or margin or percentage in relation to Intel's total income of this iGPU business?", "score": 2, "replies": []}, {"body": "Meanwhile Hyundai:  “We have the fastest Korean sports car”", "score": 2, "replies": []}, {"body": "how much is the power draw? i want my battery to last atleast a day", "score": 2, "replies": [{"body": "17/30W TDP", "score": 1, "replies": []}]}, {"body": "Intel740 gonna revolutionize graphics. That's why we named it *Starfighter*", "score": 2, "replies": []}, {"body": "And as usual, great for consumers, awful for investors. The stock doesn't care", "score": 2, "replies": []}, {"body": "Any VLSI engineer knows that raising supply voltage increases speed linearly, while increasing power consumption by the square.\n\nYou can make a chip run faster by dumping disproportionately more power on it. It's the tried and true Intel formula.", "score": 2, "replies": [{"body": "There is a mini PC with an Ultra 9 185H released a couple months back (ASUS NUC 14 Pro+) that slightly beats the 7940HS in both CPU and iGPU benchmarks...in exchange for 200% more power draw.", "score": 2, "replies": []}, {"body": "Hardly the case here considering that Lunar Lake are 17/30W chips.", "score": 1, "replies": []}]}, {"body": "bullish", "score": 2, "replies": []}, {"body": "At what TDP tho", "score": 2, "replies": [{"body": "17/30", "score": 1, "replies": []}]}, {"body": "Imagine how much money you would have made if you invested in INTC in 1998, you would have made.... oh....![img](emote|t5_2th52|4260)", "score": 4, "replies": []}, {"body": "Im not gonna buy INTC until someone impartial shows me the actual benchmark proof that they are ahead. Because their financials are a mess and will continue to be a mess until atleast 2030.\n\nGelsinger net worth is like 100M$ with a 17M$ pay. Yet he only bought 1M$ worth of INTC stock within last year? Yeah, he is not commited to this sinking ship at all.", "score": 5, "replies": [{"body": ">Gelsinger net worth is like 100M$ with a 17M$ pay. Yet he only bought 1M$ worth of INTC stock within last year? Yeah, he is not commited to this sinking ship at all.\n\nHe is supposed to buy intel stock with... intel stock?", "score": 11, "replies": [{"body": "Put up intel stock as collateral for a loan to buy more intel stock. Intel stock to buy more intel stock for your intel stock dawg", "score": 3, "replies": []}]}, {"body": ">I'd not buy intel stock, because I'd not buy an intel product.\n\nThere, fixed it for you", "score": 3, "replies": []}, {"body": "The claims are probably accurate, but that's not really super important from a stock perspective.", "score": 2, "replies": [{"body": "From as stock perspective I have a hard time seeing how INTC is worth 10% of TSMC. INTC doesn't have a single operational fab to produce any high-end chips while TSM has 4 operational fabs that produce high-end chips + 2 underway.", "score": -3, "replies": [{"body": "Does have a single high end fab? Does Oregon and Ireland not count? Does Xeon 6 on Intel 3 or MTL on Intel 4 not count? Does 18A entering HVM in a few months not count?\n\nThey're worth 10% of TSMC because of confidence. It's why they're selling below their capital value. If they execute on their fabs, stabilize their finances, and hit their fab breakeven goal of 2027, their stock will shoot up. \n\nThey're priced like they are because enough of the market genuinely believes they won't.", "score": 4, "replies": [{"body": "And where is this mystical Intel 3 or 18A? We haven't seen anything in production. Where are the benchmarks? Oh, missing for some reason. I wonder how they are not progressing in density or clock speeds even though they are \"reducing\" their technologies. It doesn't make sense. \n\nI think it is just a marketing ploy with no real technological advances. But we'll see ;)", "score": -2, "replies": [{"body": "Intel 3 already launched. Didn't you read Phoronix's review of the 6780E? And GNR is currently in production and shipping soon. \n\nAnd I said 18A is entering HVM in a few months and PTL launches next year. \n\nClock speed is going to be stagnant for a while. Absolutely no one in the industry is expecting any products (or nodes) to touch Intel 7's clockspeed for a long time.", "score": 4, "replies": [{"body": "What I'm trying to get at is that there is no money in pc clients which is the only market they have left. Sure, you can be another $HPQ, $DELL or whatever else. But you want to be a TSM or NVDA. Datacenters and GPUs are where the money is hiding. Not in 144 core processors...", "score": 1, "replies": [{"body": ">datacenters\n\nWho do you think buys 144 core Xeons?", "score": 5, "replies": [{"body": "Yeah, wow, great for INTC when when MSFT buys 1x Intel processor and 10x H100s...", "score": 1, "replies": [{"body": "Azure is primarily CPU driven", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "You sound like a genuine regard. But its up to you to buy the tops and sell the bottoms. Well done.", "score": 1, "replies": [{"body": "Ive never bought a top xD", "score": 1, "replies": []}]}]}, {"body": "Integrated is the key word. No one really cares about that.", "score": 5, "replies": []}, {"body": "So fast it burns up", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "steam deck is not using arm", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "The whole point is that ARM redesign would NOT improve battery life and performance. \nPerformance especially; who would buy an ARM gaming handheld? Makes absolutely zero sense.", "score": 1, "replies": []}]}]}, {"body": "These are not going to be found in budget laptops. And powerful iGPUs benefit more than just games.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "High end thin-and-lights. Think like Galaxy Book Pro and Dell XPS 13.\n\nAccording to Intel's claims, these will be the most efficient windows laptop processors on the market (and for at least the next year). \n\nThere are millions of people who just want a laptop to run completely silent, stay room temp, have all day battery, and be snappy.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Galaxy Book Pro and XPS 13 with these chips are already in reviewers hands, and release later this month.", "score": 4, "replies": []}]}]}]}]}, {"body": "For what exactly you want a dedicated GPU. Do you know you can watch 4k porn and play tetris just fine with an integrated GPU?", "score": 2, "replies": []}, {"body": "That's not true for me. I don't want to lug around a heavy laptop with a dedicated GPU when I'm traveling - so I can use it for work and also a bit of gaming in my downtime. \n\nI want thin and light and and compact and if Intel has the best integrated graphics/performance and competitive battery life relative to the competition, I will be inclined to buy Intel. And it so happens that that is what I'll be shopping for soon to update my laptop, although I'll wait for independent reviews before making a purchase decision. Qualcomm doesn't factor into it at the moment for me since it is incompatible with so many games.\n\nThis product announcement is specifically for thin and light performance laptops. It's not for a beast of a laptop that is a top end gaming machine. There aren't any thin and light laptops with dedicated high performance graphics. This product was specifically designed for thin and light premium machines, not some budget machines.", "score": 1, "replies": []}, {"body": "Yeah this needs to be benchmarked against a 4060 which is the current standard for when you want more than last gen integrated but don’t want a brick laptop.\n\nCause improving a bit on dog shit is still dog shit.  It needs to jump up to a performance tier that is as good as discrete low end.", "score": 1, "replies": []}]}, {"body": "Yeah, I am not playing games on the Alienware laptop with dedicated graphics, I will definitely not be going to play games on integrated graphics. It is a useless stunt. Other than simple display tasks. Laptops are useless for any gaming.", "score": 3, "replies": []}, {"body": "Half of these games are damn near 10 years old... why aren't they testing it on new games?", "score": 2, "replies": [{"body": "They are testing it on popular games..", "score": 1, "replies": [{"body": "they are testing it on what it can run", "score": 2, "replies": [{"body": " intel arc GPU have proven benchmarks to run gta 5, and fortnite effectively", "score": -1, "replies": [{"body": "Again, how old are those games? GTA 5 originally came out in 2013. Fortnite 2015?\n\nGhost of Tsushima is the newest thing they got on the list which AMD's current integrated gpus are handling the game much better.", "score": 0, "replies": [{"body": "??? Their slide shows Intel outperforming the HX 370 in Ghost of Tsushima. Also, how are Hogwarts Legacy, Cyberpunk, AC Valhalla, atomic heart, Spider-Man remastered, FH5, Diablo 4, F1 2024 etc. OLD games?\nThose are all fairly recent and most of those are used by tech reviews to compare the newest dedicated GPUs as well.", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">integrated\n\n![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "I have a lot of INTC stock, and this won’t move the needle. Institutional investors seem to have lost faith that Gelsinger will eventually be able to correct INTC’s trajectory, and this news won’t change that.", "score": 1, "replies": []}, {"body": "Nvidia in shambles when Intel\nSurpasses even AAPL GPUs", "score": 1, "replies": []}, {"body": "Make Intel a Meme Stock for three weeks ... Nana wants me to win a Porsche", "score": 2, "replies": []}, {"body": "By the rumor. Sell the news.", "score": 1, "replies": []}, {"body": "Intel you won't stop my puts, don't even try.", "score": 1, "replies": [{"body": "Haha.hopefully intel bag holders win.", "score": 2, "replies": []}]}, {"body": "1st party graph. take this with grain of salt", "score": 1, "replies": []}, {"body": "Like saying you have the fastest 2 cylinder car on the road", "score": 1, "replies": []}, {"body": "Do they have the world's fastest zamboni too?", "score": 1, "replies": []}, {"body": "Everytime I see these posts I am sad that I am not able to trade Lenovo stocks. Fir that you need to join the Hong Kong stockmarket and I don't wanna do that.", "score": 1, "replies": []}, {"body": "theyre up on it half a % 9:12", "score": 1, "replies": []}, {"body": "Will they have the software support to train and run machine learning models on their hardware though? \n\nThe entire industry uses very specific code libraries that won't necessarily support their GPUs so they still have a major barrier to entry to get a piece of the pie that mattes for GPUs", "score": 1, "replies": []}, {"body": "Sure Grandma", "score": 1, "replies": []}, {"body": "Grandma is most pleased", "score": 1, "replies": []}, {"body": "My Intel cpu keeps having parts of it burn out reducing speed all the time. Can’t even play the games I used to.", "score": 1, "replies": []}, {"body": "“Fastest” lol", "score": 1, "replies": []}, {"body": "Intel also has some of the worst driver issues I’ve experienced with their latest Integrated Arc GPU/CPUs , so there’s that .", "score": 1, "replies": []}, {"body": "Lol, who cares? ", "score": 1, "replies": []}, {"body": "I feel like showing up to the modern tech marketplace with the fastest integrated GPU is like showing up to the Kentucky Derby with the fastest rocking horse", "score": 1, "replies": []}, {"body": "It's like Intel is winning in the paralympics", "score": 1, "replies": []}, {"body": "This CPU will render Intel's doom in 8k 120 FPS.", "score": 1, "replies": []}, {"body": "Yes! Solitaire 120 fps", "score": 1, "replies": []}, {"body": "grandma similing in 8k", "score": 1, "replies": []}, {"body": "Next they’ll tell us they have the cleanest toilets in the business but nobody will give a fuck. Tell us what you do that makes money. ", "score": 1, "replies": []}, {"body": "This has gotta be worth 25 a share at least", "score": 1, "replies": []}, {"body": "Intel is as dusty as your grandma; INTC could fook up a wet dream 😆 😆 😆", "score": 1, "replies": []}, {"body": "Is it gonna brick itself like 13900s?", "score": 2, "replies": [{"body": "AMD CPUs burned left right and center before", "score": 0, "replies": [{"body": "That doesnt answer my question lol, thats just deflecting.", "score": 1, "replies": [{"body": "A new generation of Intel core ultra processors has come out and there is great costumer service and replacement warranty for old ones", "score": 1, "replies": [{"body": "https://m.youtube.com/watch?v=b6vQlvefGxk&pp=ygUSZ2FtZXJzIG5leHVzIGludGVs\n\nhttps://m.youtube.com/watch?v=OVdmK1UGzGs&pp=ygUSZ2FtZXJzIG5leHVzIGludGVs\n\nhttps://m.youtube.com/watch?v=ZRJaF2ky9CE&pp=ygUSZ2FtZXJzIG5leHVzIGludGVs\n\nYou're fucking delusional.", "score": 0, "replies": [{"body": "And you don't know how to read. Those are Raptor Lake exclusive issues. No reason to assume these products are affected. Meteor Lake also wasn't affected at all.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "👵🏼", "score": 1, "replies": []}, {"body": "Shut up Meg.", "score": 1, "replies": []}, {"body": "It’s like the emails from Nigerian princes. The scam has to be obvious to only attract the biggest regards", "score": 1, "replies": []}, {"body": "The thing with any Intel products or claims that any buyers should ask is:\n\n\n- did they lie or cheat?  Like that time they hid a giant industrial cooler to demo their chip?\n- considering the layoffs, turmoils, and lost of talents, did they cut corners?  Will their chips die within the first six months?  Will their be security issues that once you applied a firmware update cause you to lose 40% of the advertised performance? \n- considering their financial position and internal political wills, will this product be supported going forward? Or will this be abandoned after half a year? ", "score": 1, "replies": [{"body": "This is exactly what everyone should consider when they look at Intel products now", "score": 2, "replies": []}]}, {"body": "We don't believe you Intel", "score": 1, "replies": []}, {"body": "Was this built with their cutting edge 14nm++++++++++++++++++++++++++++++++++ process?", "score": 1, "replies": []}, {"body": "Who TF uses integrated graphics lmao", "score": 1, "replies": [{"body": "90% of laptop owners.", "score": 1, "replies": []}]}, {"body": "Lmfao 😂 😂 😂 😂 😂 😂 😂 😂 ahhh it's funny at this point", "score": 1, "replies": []}, {"body": "Integrated graphics aren’t really a huge market right now…", "score": 1, "replies": []}, {"body": "Shit literally nobody will care about. Can someone call Gelsinger’s kids and let them know their senile parent skipped the care home again?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Intel didn't hide it.\n\n[Comparison to AMD](https://wccftech.com/intel-core-ultra-200v-lunar-lake-launch-cpu-gpu-ai-leadership-over-qualcomm-amd-much-better-battery-life/)\n\nAMD can't keep up. Lunar Lake is going to be another massive rock star. Of course they already have 80% of client marketshare in the first place...", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I think your math is off a little hombre. In Q3, 2022 to present Q3, 2024 Intel's client revenue is up $400m. During the same period, AMD's client revenue is down $600M. \n\nClient didn't drop by $28B a year. It's actually coming back.", "score": 1, "replies": []}]}, {"body": "AMD went the AI route for these. \n\nIntel is yet again, behind lol", "score": -4, "replies": [{"body": "No. Intel's NPU  performance is ahead of AMD also.", "score": 2, "replies": []}]}]}]}, {"body": "nice, but do people care much about the integrated graphics when shopping for a cpu ?", "score": -1, "replies": [{"body": "Yes, on laptops where you dont need a dgpu. Because battery life", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Wait for lunar lake to release if they’re claims are as good as they say it can be big leap.", "score": 3, "replies": []}, {"body": "Outdated knowledge", "score": 0, "replies": []}]}, {"body": "In this case you look for ARM CPU from Broadcom if you run Windows or M CPU if you run Apple. For best battery life you don’t want to have x86.", "score": -4, "replies": []}]}, {"body": "There are cases when GPU fails ,during that time integrated GPU kicks in ,for example if you are working on a design on your pc and If the GPU fails you can run the integrated GPU and get the work done.. remember GPU can't be replaced in a laptop.", "score": -7, "replies": [{"body": "I mean its not like gpus are often failing, its really rare", "score": 4, "replies": [{"body": "GPUs do fail,when it's overworked.I have changed my laptop once cuz of this.but if you have integrated GPU it's a backup", "score": 0, "replies": [{"body": "Is this a real problem, or just a shitty laptop you once had?", "score": 1, "replies": []}, {"body": "I know. But still, it's a rare occurence.", "score": 1, "replies": [{"body": "Let‘s throw out seatbelts because crashes are rare…", "score": 0, "replies": []}]}]}]}, {"body": "ffs, man.  lolz @ being the one who posted this article, since you clearly have no idea what these are.  this is about laptops with no dgpu.  not desktop cpus with weakass igpus that exist for troubleshooting.\n\nyou're cluelessly rambling about gpu failures...", "score": 1, "replies": []}]}]}, {"body": "I don't see how this is bragworthy. It has the same energy as boasting about having the fastest car with 3 wheels. Most people won't use or care about them.", "score": 0, "replies": []}, {"body": "lol. I love how these articles are written by people who don’t understand anything. I mean I think intel is still a solid cpu manufacturer and potentially a foundry for the future. But … “gaming story looks remarkable” and “integrated GPU” don’t belong together hahahahahahha\n\nMight as well have said “unprecedented race car…. Honda odyssey”. I mean like…. Great if your the fastest mini van and the best minivan for drifting….. but do people street race in minivans?", "score": -2, "replies": [{"body": "> “gaming story looks remarkable” and “integrated GPU” don’t belong together hahahahahahha\n\nNot for the die-hard PC gaming enthusiast, sure. But they belong together in the biggest gaming market, which is phones and other handheld devices.", "score": 1, "replies": []}]}, {"body": "Is intel good friends with AMD or why can they compare their cpu with a \"AMD Ryzen HX 700\"? Considering that AMD does not have a \"AMD Ryzen HX 700\" in their lineup and must be some kind of prototype.", "score": 0, "replies": [{"body": "Where do you see HX 700?", "score": 1, "replies": [{"body": "From the article\n\nAll of the games were tested at 1080p with medium quality settings. The processors tested:\n\nIntel Core Ultra 9 288V (with Intel Arc 140V graphics)\n\n**AMD Ryzen HX 700 (with Radeon 890M graphics)**\n\nQualcomm Snapdragon X1E-84-100 (with Adreno X1-85 graphics)\n\n\n\nhttps://preview.redd.it/eqxc1isw3znd1.png?width=926&format=png&auto=webp&s=b4d6d8920376b461138454ba25bb9290ff77794f", "score": 1, "replies": [{"body": "Well, that's on Forbes then.", "score": 1, "replies": [{"body": "I don't know who screwed up but this article is a glorified ad from intel. I highly doubt forbes added much and thus its more likely intel fault. I would check their sources if they had any", "score": 1, "replies": [{"body": "Forbes did because Intel has the HX 370 on their slides and nearly every major tech site reported the same because those are essentially the only numbers available now.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Last I saw was drama on the speed tests intel uses. Basically overclocking to beat tests (have to reread the tech article but the needs weren't happy for sure) That said I have an i9 13900k whatever and it kicks ass with a 4090. Hoping grandma finds a reason to be proud again ![img](emote|t5_2th52|4260)", "score": 0, "replies": []}, {"body": "I would not invest in this. Intels iGPU + CPU combo consumes too mutch power. Compared to AMD rughly 2x generaly speaking, thats why Intel laptops suck when it comes to battery. And dont even get me started with drivers. Half of the games dont even work on Intel lol.   \nAlso keep in mind, how many gaming laptops will actualy use iGPU? Considering the best iGPU is reserverd for i7 and i9 cpus that come in 1000 USD + laptops, most of wich have dedicated gpu anywhay\n\nSpend grandma money on ARM or AMD", "score": 0, "replies": [{"body": ">too much power\n\nHow much power do you think LNL consumes?", "score": 1, "replies": []}, {"body": "I believe you are from the past, how the fuck Intel CPUs could be any worse if (current gen) they are using newer node than it's competitors?", "score": 0, "replies": [{"body": "Intel makes such claimes all the time and still keeps losing to AMD (at least in practice)", "score": 1, "replies": [{"body": "This time seems to be different but I'm not here to defend Intel. Maybe I will be buying new laptop and Lunar Lake looks interesting for my needs.", "score": 2, "replies": [{"body": "Intel core ultra 9, Lenovo  laptops are cool", "score": 1, "replies": []}]}]}]}]}, {"body": "Y'all got anymore of that copium.... Sheesh.", "score": 0, "replies": []}, {"body": "NVDA for GPU AMD for CPU", "score": -2, "replies": []}, {"body": "It's not about fast. It's about stability.", "score": -2, "replies": [{"body": "People on the go with small thin laptop", "score": 0, "replies": []}]}, {"body": "“We have the worlds fastest electric scooter.”", "score": -1, "replies": []}, {"body": "Get lost Intel another American lost cause followed by Boeing", "score": -1, "replies": []}, {"body": "*Shows Minesweeper in 60 fps*", "score": -1, "replies": []}, {"body": "PRICED IN", "score": 0, "replies": []}, {"body": "Too bad no one uses those anymore...", "score": 0, "replies": []}, {"body": "Intel stock go brrrrrrrr", "score": 0, "replies": []}, {"body": "INTC is dead in the water. Of course they’re going to make outlandish claims. Seriously what does Kramer have to say  about it? do the opposite", "score": 0, "replies": []}, {"body": "Intel next year: \"the patch fixing this critical vulnerability reduces performance by 40% because we got caught cutting corners again.\"", "score": 0, "replies": [{"body": "next generation CPUs have been launched and they are so cool..you still In old nokia 13 th gen?", "score": 1, "replies": []}, {"body": "You have every right to criticize Intel for the 13/14th gen debacle but none of their patches significantly lowered performance.", "score": 1, "replies": [{"body": "That's not true. \n\n>Initial mitigation efforts were not entirely without incident. At first, Spectre patches were reported to significantly slow down performance, especially on older computers. On the newer eighth generation Core platforms, benchmark performance drops of 2–14 percent were measured.[83] On 18 January 2018, unwanted reboots were reported even for newer Intel chips.[99]\n\nhttps://en.wikipedia.org/wiki/Spectre_(security_vulnerability)#:~:text=At%20first%2C%20Spectre%20patches%20were,even%20for%20newer%20Intel%20chips.", "score": 1, "replies": [{"body": "2-14% and that was years ago and also affected AMD. Your claim was 40%, I know that this was a hyperbole but still.", "score": 1, "replies": [{"body": "AMD wasn't hit nearly as bad, probably because they weren't cutting as many corners. I was making a joke about Intel's future based on Intel's past. I'm not sure why you're so defensive about their screw-ups. Also, don't gloss over the first sentence here: \n\n>At first, Spectre patches were reported to significantly slow down performance, especially on older computers. \n\nBelow is the best case scenario on newer hardware.\n\n>On the newer eighth generation Core platforms, benchmark performance drops of 2–14 percent were measured.", "score": 1, "replies": [{"body": "As for the performance claim, out of the 5 sources only one seems to actually benchmark stuff and that was Tom's Hardware and they tested Sandy bridge and reported about 10-14% performance loss. I wouldn't consider Sandy bridge a newer platform at that point in time.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "👋🥲😭bye bye intel", "score": 0, "replies": []}, {"body": "Priced in.\n\nPS: nobody cares, INTC is still sinking.", "score": -8, "replies": []}, {"body": "Just for some info, on steam <4% of all users use Intel iGPUs. https://store.steampowered.com/hwsurvey/videocard/", "score": -1, "replies": [{"body": "It's closer to 7.7% unless you are saying that dedicated Intel Arc GPUs have a >3% market share.", "score": 1, "replies": []}]}, {"body": "Who gives a rats ass about integrated GPU?? It’s so irrelevant in this world of low ping and high speed internet.", "score": -10, "replies": [{"body": "What does this have to do with Internet?", "score": 1, "replies": [{"body": "Well thanks for asking.\n\nYou only need a dedicated gfx card for mobile solutions so you can quickly process data. With the internet bandwidth we have today, you can easily send your work to a proper workstation and have it done faster without carrying around a power hungry laptop with an integrated GPU. Most stuff a regular person uses a computer for is processed server side anyways. Carrying around processing power is becoming obsolete and unnecessary. You can get way better gaming results on a Chromebook with fiber internet than any laptop with an integrated gfx card. Similarly, to train a fairly sizable ML model would take many times longer than sending it to a Google cloud server.\n\nInb4 people start listing very niche use cases for on device integrated GPU.", "score": 2, "replies": [{"body": "Fair point. I think the igpu is mostly just a nice to have for those smaller workloads. Maybe some light editing on the go etc. But it's a good indication for the handheld gaming devices launching next year using these chips.", "score": 1, "replies": []}]}]}]}, {"body": "Who wants to play games at 1080p in medium quality settings in 2024? 👎", "score": -6, "replies": []}]}
