{"title": "DIS trying to collect streaming services like infinity stones", "selftext": "[https://press.disneyplus.com/disney-entertainment-and-warner-bros-discovery-announce-disney-plus-hulu-max-bundle](https://press.disneyplus.com/disney-entertainment-and-warner-bros-discovery-announce-disney-plus-hulu-max-bundle)\n\nI think that will bode well for the time being. ", "id": "1cnxsga", "created_utc": 1715262677.0, "score": 62, "upvote_ratio": 0.87, "num_comments": 39, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 114 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Man, Netflix really is a force if it’s getting Disney to partner with Warner Bros. I remember back in 2019 thinking Disney+ would be the end all be all of streaming services", "score": 49, "replies": [{"body": "Disney definitely has the classics library. If only there new shows were good.", "score": 40, "replies": [{"body": "Pixar and the golden age of Disney can only go so far, they pretty much killed the Marvel and Star Wars momentum they had. End of the day I’m sure they’ll be alright but they have been dropping the ball last couple of years", "score": 22, "replies": []}, {"body": "How do people like Shogun? Saw the trailer and it looked interesting", "score": 5, "replies": [{"body": "A little slow progression wise, phenomenal acting", "score": 4, "replies": []}]}, {"body": "How dare you! You're not going to spend money on she hulk ?! How dare you sir!", "score": 4, "replies": []}]}, {"body": "If you have kids you are almost forced to have Disney+ lol, I guess they are trying to bring in the people without kids by adding Max.", "score": 10, "replies": [{"body": "lol true, I don’t have children so I just don’t see the value with Disney plus but you make a great point", "score": 5, "replies": []}, {"body": "Yea. It has bluey on it. I owe that dog my life.", "score": 2, "replies": []}, {"body": "Agreed. I have kids and ended up cutting the subscription because of the year over year cost increase.", "score": 2, "replies": []}, {"body": "It’s too gay for kids.", "score": 0, "replies": []}]}]}, {"body": "\"You will have cable again and you will love it.\" \n\nNope, nope nope nope.\n\nI pay for youtube. I love youtube and supporting independent content creators. Same for Nebula/Floatplane/CuriosityStream/Magellan (Not subbed to all atm) but I'm not paying huge prices for mega packs anymore.", "score": 19, "replies": [{"body": "Why would you pay for YouTube, I haven’t watched an ad on YouTube in years. Get an adblocker", "score": 4, "replies": [{"body": "To support the content creators on it.  They get paid for the view and you don't see ads.", "score": 3, "replies": [{"body": "Don’t know why I said that, google stock is half my portfolio. Buy another subscription please and tell your friends", "score": 10, "replies": [{"body": "Real.", "score": 2, "replies": []}]}]}, {"body": "YouTube music and background play.", "score": 2, "replies": []}, {"body": "Mobile", "score": 1, "replies": []}]}, {"body": "I also pay for YouTube. Unlimited streaming of music so I don’t pay for an additional music streaming service. You get videos and music for one price, and they have now added a lot of free (older) movies on there to watch too. Can’t use ad blocker on a TV. Can turn on history channel and let it run for hours", "score": 1, "replies": []}]}, {"body": "I was going to get the Disney Hulu bundle but it doesn't really say what Hulu is. I mean, does it carry Live tv channels or is just a collection of movies and tv shows.", "score": 5, "replies": [{"body": "I bought the bundle yesterday and it’s pretty good,now I can watch snowfall", "score": 4, "replies": [{"body": "But do you get live channels like ABC/NBC?", "score": 2, "replies": [{"body": "I honestly couldn’t tell you since I don’t watch live tv channels", "score": 2, "replies": []}]}]}, {"body": "They might still bundle with ESPN. Fox is also looking to add more live channels.", "score": 2, "replies": []}, {"body": "you can get an ota antenna for $20 to get those live channels forever", "score": 1, "replies": []}, {"body": "Lot of good stuff on Hulu", "score": 1, "replies": []}]}, {"body": "Well everything in YouTube pretty much free", "score": 5, "replies": [{"body": "They just expose you to two 30 sec ads.", "score": 1, "replies": []}]}, {"body": "All I can say is hoard those Blu-rays and DVDs now before Disney+ goes to $150/mo", "score": 4, "replies": []}, {"body": "The dream of MRR was dead on arrival the very minute content owners & streaming services got greedy. \n\nMRR’s viability depends on picking a service, and consistently subscribing month-to-month. \n\nWhen streaming services:\n\n— Exclude content to specific services only, to appease content & License owners. \n\n— Raise Prices because content & license owners demand more    \n\n— Force the choice between paying for ads or paying more for no ads because services got greedy. \n\nHere we are. \n\nNow I subscribe long enough to watch what I want, cancel, and then subscribe to a different service only so long as it has content I want to watch. Rinse and repeat until Cable comes back in its new form of “online streaming”. \n\n“Moriatur ut vixit”.", "score": 2, "replies": []}, {"body": "Netflix won the streaming wars. These media companies do not know what they’re doing wrong.", "score": 6, "replies": [{"body": "There’s nothing good on Netflix", "score": 3, "replies": [{"body": "Netflix owned 4 of the top 5 shows in March. The fifth show was Bluey. \n\n3 Body Problem, The Gentlemen, Dead Boy Detectives, Avatar, and just today Bodkin all released within the last couple of months. \n\nhttps://www.forbes.com/sites/maryroeloffs/2024/04/16/love-is-blind-most-popular-streaming-show-netflix-the-gentlemen-avatar-brooklyn-99-bluey/?sh=1fa2352d1bb9", "score": 6, "replies": []}, {"body": "People say this when they have to much good stuff lol. If you ignore all the good shows/movies on Netflix, then sure there's nothing good", "score": 1, "replies": []}]}]}, {"body": "It’s probably a prelude to their sports streaming joint venture.", "score": 1, "replies": []}, {"body": "Calls it is ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Disney should buy Lego ☺️", "score": 0, "replies": []}]}
