{"title": "I did a comparison of the current S&P levels to past pre crash all time highs and compiled the data in a google doc.", "selftext": "", "id": "1qqkjr", "created_utc": 1384571042.0, "score": 17, "upvote_ratio": 0.91, "num_comments": 14, "comments": [{"body": "[here's](http://i.imgur.com/wOOpWSW.png) the chart I got all the data points from if you want a visual comparison to go with the tables.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm not one to try and find the next black swan event but that seems to be the most obvious answer. When will it happen? Who knows? ", "score": 3, "replies": []}]}]}, {"body": "what's your interpretation of this data?", "score": 2, "replies": [{"body": "really I was just messing around with numbers and charts but I think it shows that this bull market is rising really really fast compared to others. \n\nThe first table shows we are around the levels above the moving averages that were the all time highs before the credit crisis. Does this mean we're in for another crash like 2008? Maybe, maybe not. But what it does show is that in the nearterm, we are very overextended and the market seems to be getting a little irrational.\n\nI think we're in for a short term top right now at least. If this leads to a bigger crash we'll have to wait to find out. ", "score": 6, "replies": [{"body": "in the first table, the current highs seem comparable to 2008 levels.  \n  \nhowever if I'm reading this right then if we were to compare the current high to 2000 levels, we see that's there's still currently room for 45% gain till we reach the ceiling of the 2000 100 month levels, and room for a 100% gain till we currently reach the 2000 200 month levels? \n  \ndot.com busted on valuation of companies that weren't making money, 2008 busted on credit/mortgages...where is the short term top smoke coming from that you see fire?", "score": 4, "replies": [{"body": "> however if I'm reading this right then if we were to compare the current high to 2000 levels, we see that's there's still currently room for 45% gain till we reach the ceiling of the 2000 100 month levels, and room for a 100% gain till we currently reach the 2000 200 month levels?\n\nYes which is the important part. Right now we're 30% above the 50 month level which is comparable to 2000 and above 2008 which backs up my reasoning that we're in a short term top. We could pull back and still have plenty of room to run seeing as how we're nowhere near those long term MA levels of 2000. We'll have to see how it plays out.\n\n>dot.com busted on valuation of companies that weren't making money\n\nFB, TWTR, P, LNKD, YELP, GRPN, ZNGA\n\nI haven't looked close at their financials but when I hear people say that these companies instantly come to mind all who have had their IPOs fairely recently.\n", "score": 2, "replies": [{"body": "FB is in the black.", "score": 2, "replies": [{"body": "But the growth valuations for the company are crazy. They're baking in so much growth I'm having trouble seeing how they can keep growing as fast as they have been. Growth has to slow sometime. FB is very overvalued. ", "score": 1, "replies": [{"body": "I think growth/valuation for (tech) companies in terms of traditional P/E should have an additional constant, c, in front of the earnings, i.e.\n\nP/cE, where c = multiple due to it being a tech company\n\n:P", "score": 1, "replies": []}]}]}, {"body": "I'd add AMZN to that list, even though they are making money.  P/E of [1307.03](https://www.google.com/finance?q=amzn&ei=6d2HUvDLIIHl0gG83wE) according to Google Finance, and they have a market cap around ~170B.  Although much of what they're doing is promising, that's still a pretty high valuation for a company not making much in the way of profits.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I think it might be because of how fast the market dived during the last recession period. That makes the most sense. I always think of it like the saying \"the larger they are the harder they fall.\" The faster a market goes up, the faster the fall will be.", "score": 1, "replies": [{"body": "So do you think QE will be a catalyst for a coming crash?  I have actually seen a lot of parallels between the current market and those of 1987 before Black Monday.  Though the Fed was much less transparent back then, they still mentioned in many of their minutes how they were relaxing monetary policy to help a sluggish recovery (sound familiar?).", "score": 1, "replies": [{"body": "Like I said in another comment that seems to be the most obvious answer to what the next crash might be but who knows if something else will cause a market crash before that. In overextended markets, it doesn't take much to get the ball rolling. Everyone could be looking one way (waiting for the QE crash) and be blindsided by something else first. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "All crashes look like this. I don't think that a crash is coming though. Have you compared this with other times in the market where a bull market ended in a minor correction or just sort of plateaued? My guess is that the data would be pretty similar to that of the crashes. ", "score": 2, "replies": []}]}
{"title": "New to the game", "selftext": "Dear r/stocks\n\nRecently my business economics proffessor introduced my class to a handy website, where you can play around the american stock market, with 100k virtual dollars, to let us a get a touch of how the stock market works. \nThing is, I made a few beginner mistakes, and my net worth is now down from $100k to  $95,999.17.\nThe first place in our class competition has a net worth of roughly $117,652.39 (He had played a bit around with stocks before). \nRight now I hold two stocks; 50k in respectively Microsoft and Sony, due to the next gen consoles coming out around this time. \n\nAny suggestions as how to fight my way back in the game, as I am currently in a 29th spot out of 32? Should mention that the competition ends around this 20th of december, so long term holdings are not a possibility at all.\nGeneral tips about the stock market would also be great, hence it's a great lesson to my business education. \n\nThank you in advance :)\n\nEdit: Yes we are using www.marketwatch.com for the game", "id": "1qqwci", "created_utc": 1384582903.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 17, "comments": [{"body": "First because your in a competition with no actual loss, you must play aggressive, and extremely risky to win. You are not trying to \"net a profit\" your are trying to net the highest amount of profit in a short period of time. I would start with selling what i own and accepting a loss on microsoft and sony, microsoft is generally a solid company but no huge gains will be made, and same goes with sony, regardless of the ps4 or other gaming things that are released, they take that into projection, and if it has not already made huge moves it will be a long term growth or quick fall. Go look into the concept of Day trading, learn it, accept it, because this will be your best friend...Day trading is short term high risk high reward.....After this go subscribe to market watch, and find a market projection website that you enjoy, after this, I would go research and learn the basic concepts and understanding of stock market trading, and day trading so you understand what your doing...Then on monday ill be posting companies that I am day trading along with cross ref. market watch and wall street journal and you can follow with me on monday, 17k gain out of 100k is nothing to laugh at but most likely he is 100% into 1 stock and did not liquidate his assets on friday because hes new, playing a game, relatively inexperienced ", "score": 6, "replies": [{"body": "Sounds great, please keep me updated! \nThe game itself is located on www.marketwatch.com, so from here I try to read on some new about stocks etc. but hence I am new, I didn't really know what to look for. The day trading concept is not unfamiliar to me, I just haven't figured out how to play it correctly yet. Thanks for the tips, looking forward to hearing more from you :)", "score": 1, "replies": []}]}, {"body": "what percentage of microsoft revenue is from xbox? How many profitable quaters has sony had in the last 5 years?", "score": 2, "replies": []}, {"body": "use leveraged and inverse 3x ETFs , you have nothing to loose", "score": 1, "replies": []}, {"body": "If you're looking for the biggest gain don't invest in companies that have already made it you need to be searching for those companies that are coming up. You need to be looking a medium cap to small cap companies and that's it. ", "score": 1, "replies": []}, {"body": "May I ask what the website is?", "score": 1, "replies": [{"body": "Not sure if it's the exact one that OP uses, but http://www.marketwatch.com/game/ is one of a few.", "score": 1, "replies": []}]}, {"body": "FNMA, GTXI if you want explosion next week. And if you can buy under a dollar, MHTX + SGLB.", "score": 1, "replies": [{"body": "FNMA already had a pretty good week, what news is being released next week to continue the trend?", "score": 1, "replies": [{"body": "Since Ackman bought in, the hype could increase next week and more will be bought. \n\nWe also don't know when they'll get out of conservatorship. Could be next week, next month, or so on. ", "score": 1, "replies": [{"body": "I was just reading about Ackman and thought, \"Oh thats why\".", "score": 1, "replies": []}]}]}]}, {"body": "If you want to take a risk at winning I would say dump all your money into NUGT. Its a 3x Gold Bull ETF and I think with news thats going to come out on Gold tapering it wouldn't be unreasonable to expect 30% from it.\n\nEdit: I would recommend trying to buy in around $42, and sell around $56-58. I think it'll get there before December 20th.", "score": 1, "replies": [{"body": "It was around 41.5 this morning, I bought it and it already went down 4% .. darn. Should I keep it and hope for a profit in the next days/month, or sell it to minimize the loss?", "score": 1, "replies": [{"body": "Damn I'm sorry man, I was going to edit it to change the enter price to $40 but since I never got a response I figured you were just going with someone else's advice. In my opinion, no you should hold on. Because its a 3x direction stock a 4.5% change means gold has only changed about 1.5% which isn't anything major. I think if you hold long on this stock you'll more than make up for any immediate losses, especially since Yellen is saying she doesn't want to do any tapering which was a major reason for gold's losses in recent months. ", "score": 1, "replies": [{"body": "No worries, and thanks for the advices! :)\nI'll keep it and hope for the best!", "score": 1, "replies": []}]}]}]}, {"body": "invest all 100k in sglb and see how it rides", "score": 1, "replies": [{"body": "I was going to suggest the same thing! Look into the growing 3D printing industry.", "score": 1, "replies": []}]}]}
