{"title": "Goldman Sachs Junior Bankers working 98 hrs a week - WTF are they doing?", "selftext": "[removed]", "id": "zc0n21", "created_utc": 1670128920.0, "score": 15, "upvote_ratio": 0.94, "num_comments": 24, "comments": [{"body": "American Psycho \n=", "score": 19, "replies": [{"body": "Don't mind the plastic on the floor, I'm redecorating", "score": 6, "replies": [{"body": "Is that a Huey Lewis tune?", "score": 3, "replies": [{"body": "Huey Lewis and the News burst out of San Francisco onto the national music scene at the beginning of the decade, with their self-titled rock pop album released by Chrysalis, though they really didn’t come into their own, commercially or artistically, until their 1983 smash, Sports.\n\n___\n\n^(*Bot. Ask me what was on the Patty Winters Show this morning.* |) [^(Opt out)](https://www.reddit.com/message/compose/?to=botrickbateman&subject=Opt%20out)", "score": 3, "replies": [{"body": "What was on the Patty Winters Show this morning?", "score": 1, "replies": [{"body": "*The Patty Winters Show* this morning was about a new sport called Dwarf Tossing.\n\n___\n\n^(*Bot. Ask me if I’ve made any reservations.* |) [^(Opt out)](https://www.reddit.com/message/compose/?to=botrickbateman&subject=Opt%20out)", "score": 2, "replies": [{"body": "Have you made any reservations?", "score": 1, "replies": [{"body": "We have canceled the reservation at Kaktus and maybe someone has remade it. Confused, I actually cancel a nonexistent table at Zeus Bar. Jeanette has left her apartment and cannot be reached at home and I have no idea which restaurant she’s going to, nor do I remember which one I told Evelyn to meet us at.\n\n___\n\n^(*Bot. Ask me if I’ve made any reservations.* |) [^(Opt out)](https://www.reddit.com/message/compose/?to=botrickbateman&subject=Opt%20out)", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Is not about what you make for 2 years as an analyst, is what you make after. \n\nFrom personal experience, i used to spend all of my time going through countless data found in data rooms, recreating models, finding comps, valuation of assets, making presentations, and taking lots of shit from those above me.", "score": 14, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "But when they're a fund manager they buy a postage stamp property in Jackson Hole for 5 million for their three months of vacation a year", "score": 3, "replies": [{"body": "Again, very small hyper successful population. Same thing with CEOS, top engineers, doctors, or lawyers. It is simply the case that *most* people will not ever get to the top", "score": 1, "replies": []}]}]}]}, {"body": "They make those projections that no one uses", "score": 12, "replies": [{"body": "WSB makes tons of projections that no one uses, why don't we get $22/hr.", "score": 1, "replies": [{"body": "Because you're too busy waiting for the next rider to order an Uber.", "score": 5, "replies": []}]}]}, {"body": "They spend a ton of time in excel and powerpoint making presentations for the higher ups.  Then be available to make changes when asked.  Add in sitting on calls and meetings and time adds up quick.\n\nhttps://www.youtube.com/watch?v=2Vm-bmlt55A", "score": 3, "replies": []}, {"body": "Goldman employees get a lot of their compensation from bonus.\n\nThey also get cushy jobs or very high paying ones after they leave.\n\nGet back to work. Your break was over 5 minutes ago Kyle.", "score": 3, "replies": []}, {"body": "Being a real man. Get off the video games and work son it’s daylight in Asia", "score": 2, "replies": []}, {"body": "Overtime pay![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Looking at porn", "score": 1, "replies": []}, {"body": "They do a lot of bs stuff that no one look at. The big money actually come from regulatory stuff. Like those shit IPO", "score": 1, "replies": []}, {"body": "Not going job less", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "zcelnl", "created_utc": 1670172442.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 30, "comments": [{"body": "Higher manufacturing costs mean lower earnings mean lower share price.\n\nIn a normal world\n\nBut we live in Loony Toons so watch the fuck out", "score": 30, "replies": [{"body": "Right?   Does anything work out to the simpler rationale these days", "score": 4, "replies": []}]}, {"body": "Bad news always bullish because chaos magic. My base case for Q1\n- Tim Cook sex tape\n- Apple invade Taiwan 100,000 dead in 5 hours\n- kill iPhone  \n- brings back Newton\n- reverse stock split\n\nPrice target $40,000", "score": 13, "replies": []}, {"body": "Would you consider finding a non-denominational hole in the fence of your supply chain and rather quickly establishing a fix bullish or bearish or both for different temporal horizons ?\n\n[edited to replace a coopted outdated idiom which almost got me invited to Florida]", "score": 3, "replies": [{"body": "Hi Kanye", "score": 6, "replies": [{"body": "Woah.  Why?", "score": 3, "replies": [{"body": "probably the unintentional racist pun", "score": 3, "replies": [{"body": "Can you explain I didnt get it", "score": 1, "replies": []}]}]}, {"body": "Hahah. Oh shit.  Uh yeah— totally editing that allusion.   Sorry", "score": 2, "replies": []}, {"body": "Man, totally sorry about that to you and all who read it.  But I didn’t mean it that way, so in all childish jest to save face: no! You’re a towellllllll", "score": 1, "replies": []}]}, {"body": "Quickly lol I doubt it’ll be quick", "score": 1, "replies": [{"body": "Como se dice - fuck off (because your absolutely right, damnit) , but I like you?   I can throw these sausages hanging from a tree trunk at this glsss screened device quickly. But I can’t edit worth s shite", "score": 1, "replies": []}]}]}, {"body": "building up completely new supply chains, hubs and fabs? new country, new culture, new language, no experienced workers.\n\nbearish. this will take years and slice profits. aapl has made a lot of money off foxconn. now they pay the price. staying in china is not an option in this new environment.", "score": 4, "replies": [{"body": "They lost over 10 million units this quarter when they already lowered production… lmao and people say “oh ya just move it to a whole over country, problem solved” like that won’t take a long time.", "score": 3, "replies": []}]}, {"body": "Apple will never leave China,  they may downsize production there and move some operations to a more stable location but they will never leave completely.  They have too much invested in that location.", "score": 2, "replies": []}, {"body": "You rigged thus game. Can't like if guy wanted.", "score": 2, "replies": []}, {"body": "There's NO WAY Apple leaves China haha", "score": 2, "replies": []}, {"body": "Like for suck my dick, comment for drink a gallon of cum", "score": -3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 year ago\n**Total Comments**|520|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=zcelnl)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=zcelnl)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": ">That's interesting to hear. I'm not surprised that Apple is looking to shift some of its production outside of China though, given the recent trade tensions between the US and China. It makes sense for them to diversify their manufacturing base so as not to be too reliant on any one country. India and Vietnam seem like logical choices given their relatively low labor costs compared to other countries in Asia.", "score": 1, "replies": []}, {"body": "Not at all refuting you, but just curious— anyone have an idea how long they have been structuring a move (obviously on a more comfortable time frame if they had been)?", "score": 1, "replies": []}, {"body": "Whatever you think it is, or any logic at all, it’s the opposite. Have a good day.", "score": 1, "replies": []}, {"body": "Short term bearish. Long term (2+ years from now) bullish.", "score": 1, "replies": []}, {"body": "Bearish or bullish, it’s probably bad for whatever country Apple is moving to.", "score": 1, "replies": []}, {"body": "Short-medium term its pretty bearish. One reason why Foxconn has been so big in China is because of the similarity of culture. Foxconn management very much embodies the Chinese management styles that honestly very likely would trigger riots in India. its still unknown if Foxconn can culturally shift to the new environment while maintaining their competitive edge and not raise costs", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Pray for my Dec9th Calls 🙌", "score": 1, "replies": []}]}
{"title": "Anti-Xi protests, tech manufacturers scaling back, real estate bubble, looming financial crisis… YANG seems like it should pop.", "selftext": "", "id": "zcex0i", "created_utc": 1670173161.0, "score": 23, "upvote_ratio": 0.93, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|1 year ago\n**Total Comments**|384|**Previous Best DD**|\n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=zcex0i)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=zcex0i)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "I do not know what you are talking about.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 16, "replies": []}, {"body": "You would think so!  But no, zero Covid drop is bullish af.  Wall Street loves a comeback.", "score": 8, "replies": [{"body": "Not priced in the current YINN rally?", "score": 2, "replies": [{"body": "Pulling Covid test stations an talking vaccine indicates it’s not just lip service.  I don’t think the market has priced in tangible evidence.", "score": 1, "replies": []}]}]}, {"body": "You’re about a year late", "score": 6, "replies": []}, {"body": "Yang is tough because China releases fake figures and pump their own markets. If China was honest about their numbers, yeah, but you’re playing against someone with cheat codes enabled", "score": 11, "replies": [{"body": "Also you have the problem of inverse ETF decay. Better to just buy puts on the YINN or target specific companies.", "score": 1, "replies": []}]}, {"body": "Coming to you live, from the Wendy’s dumpster off of 12th and Main St!", "score": 3, "replies": []}, {"body": "I have come to the conclusion that I should buy both yang and yinn because they're unpredictable. Leave some money to average down on whichever one is in the red. Sell the green one. With this method, my winnings are 100 percent. Can get stuck for a while though as you ride the trend.", "score": 2, "replies": []}, {"body": "I got in to high. Careful on dca.", "score": 2, "replies": []}, {"body": "Leveraged bear ETFs tend towards 0 due to decay, this chart is extremely misleading", "score": 2, "replies": []}, {"body": "I made a post last month about my Yang Gang earnings and how I cleared roughly $23k after a $5k investment from a loan I took out.... well, I'm back and bought about $7k worth of options last week for middle of next year at $22 and $25 strike prices. I've got a good feeling these will print and Yang will be back above $30 in no time.", "score": 4, "replies": []}, {"body": "Sorry, I wouldn't even buy a China bear fund. Still too much political risk. Don't want to be standing when the music stops.\n\nImagine you're short, you're right, but no way to exit positions.\n\nThe stocks won't go to zero. They just potentially won't be tradable. How do you interpret contracts on contracts which aren't really ADRs? Then, assuming they are doing hedging, it's contracts on contracts on contracts which aren't really ADRs.\n\nIt's contracts all the way down.\n\nWhat a mess.", "score": 0, "replies": []}, {"body": "You forgot to mention the ending of covid zero. Definition of how that's enacted by the CCP is to be determined but it started with those anti Xi protests", "score": 1, "replies": [{"body": "Yeabut.... too late. The wheels are already turning on China disinvestment. \n\nZero Covid drop means nothing. The decisions have been made to move western manufacturing out of China. It won't be eliminated completely, but we must never be in this situation again.\n\nApple pushed the button.\n\nI'd imagine this is actually what CCP wants. They don't need us nearly as much as they have in the past. They can basically stand alone so long as they have cooperation with most of Africa and India.", "score": 2, "replies": [{"body": "In other words China has found their cheap China like labor?", "score": 1, "replies": []}, {"body": "What's the issue with manufacturing moving out of China? The US doesn't manufacture as much as it did in the 60s. Since then, our GDP and average salary have gone up tremendously. This should be a bullish indicator for owning China companies in the long term as they consume their own manufacturered goods. They have enough wealth to get that ball rolling. \n\n\nHoward Marks looks at china as if it is an \"adolescent\", the best days of equity returns for China lay in the future", "score": 1, "replies": [{"body": "And what if China starts practicing actual Communism?\n\nHow do you own a piece of that?\n\nYou move to China and become a citizen.\n\nWe are in agreement. Other than whether it’s ultimately investible from the outside. (Or even inside)", "score": 1, "replies": [{"body": "I think the response by the people of China these last couple months reminds us that this is not a possibility. The movement is visibly small, but as more people gain courage we will see how far this distrust of the government is. What, would China kill their population aged between 15 and 45 to squelch the resistance? That seems unlikely to eliminate a generation. It also seems unlikely they would turn off cell phone service and internet, or face similar uprising.", "score": 1, "replies": [{"body": "Why would they turn off cell phone service? It’s how they track people.\n\nThe early Covid response was actually brilliant, with cell phones playing a role that would not have worked anywhere else. The tracking allowed the government to easily detect “backroads” routes being used to circumvent the lockdown.\n\nI’ve no idea if current zero-Covid response is justified. It might be based on lack of effective immunization. But I put p > 0.5 it’s almost purely political.\n\nCan the movement succeed and achieve a revolution or coup? Possibly. \n\nBut you’re betting on a rational stock market and the people allowing corrupt officials and corporate insiders to continue to profit.\n\nDo the Chinese people want capitalism? No idea. Is their a growing discontent and hatred of the government. I’m sure there is.\n\nInvesting right here is super sketch. I think a LONG way down and many years to sort out. Especially if you’re right.", "score": 1, "replies": [{"body": "Be greedy when others are fearful? Sounds like you're at peak fear. The future is uncertain but the profits are real", "score": 1, "replies": [{"body": "Be my guest, comrade!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "All priced in! Tell me something idk", "score": 1, "replies": [{"body": "But why is that?  Several highly unplanned for levers across the globe even— or is this why ideal of communal self-sufficiency wins the war of attrition?", "score": 1, "replies": []}]}, {"body": "Alibaba has only gone up. FUCK I missed it.", "score": 1, "replies": []}, {"body": "The trick is that CCP can control the markets, so sometimes this goes parabolic in the opposite direction. Average into a comfortable cost basis and sell when you are up 5-10% - the trick is to not get greedy if you see green", "score": 1, "replies": []}, {"body": "I know I kinda hate this.   I have the same thought as you every day since it lost huge amount of value and especially since news actuslly broke of the covid cases— couple that with the little bit of military confrontation every couple of days — but I guess Bc It’s forward-facing sentiment (as that’s the answer I’m provided each time I ask someone besides myself why oh why?\n\nwe gotta yinn when we really deep down yearn to yang now?\n\nIs there any other reason than string of single local incidents and government “announcements” outshine finance media and public statements of positions by those most vociferous (as compared to the myriad of opposing  catalysts that will at least return it to hanging some  Yang if the singularities cease countering?).   \n\nAny other reasons anyones got besides FFS? Or is it all really that simple and I’m just looking for something that matters not?", "score": 1, "replies": []}]}
