{"title": "Explaining an easy system to make excess returns in the market using options", "selftext": "Before anyone gets too excited, this was patched starting in April of this year. I'm guessing someone was doing a variant of this system at such a large level that the CBOE had to finally fix it but I haven't traded the VIX in a very long time so I can't say for certain. The trick existed from 2009 until then though and I want to show an easy options strategy that any entry level trader could do and outperform the market with lower risk. I was talking to a Redditor about this in real life last week and although I've mentioned it several times on this sub, I've never really fleshed this out.\n\nSince VIX is the product that I'm asked about the most, I figured I would start with a super easy example with this product. Note this is not really what I ever did in the product although I did use and extrapolate off of some of the tricks I will talk about when I traded as a customer. I taught this to a junior in 2010 who was not a good trader and even he could make money with it. With this strategy maxed out, you could probably make $40,000-$100,000 a month on a ~$100,000 account size.\n\nYou have one major advantage as a retail trader. You get priority in front of all professionals for equity options. While this doesn't seem like a huge deal, if you can quote enough strikes, you can be patient and only take the best/easy money trades. You also can get cheaper commissions as a result (and sell your flow if you really want, although that's a more difficult process and if you aren't stupid, your flow will get labeled 'toxic' and they'll stop paying you for it). The issues holding you back are that you are only allowed 390 orders a day (although this is averaged out over a quarter and reassessed at the end, I didn't ever need to do this but that makes it incredibly easy to game, I knew people throwing in millions of orders a day and floating new LLCs at the end of the quarter but that's way shadier than anything I wanted to deal with) and you can't make two-sided markets on the same exchange (million ways around this one, two accounts is probably safest but you can also smart/multi route or just quote different exchanges).\nThe hardest thing about trading options is building a pricing model. It’s especially hard to build a good one for an exotic product like the VIX. Thankfully, given the tick size, everyone shows their hand and the modeling is more or less done for you. Consider the following level 2:\n\nhttp://imgur.com/urxOWnZ\n\nWe can see in this scenario that someone really wants to buy these calls. The fair value is around .45 – there are 20,000 people willing to buy it at .40 and the same amount willing to sell at .50. They are likely to not get done this tight in a product like the VIX and this person will end up paying .50 (so .05 of theo edge) for 500 contracts. If you can take down this whole order (which you can thanks to customer priority), that’s $2500 of edge on one trade. Most trades aren’t this cut and dry in the VIX but they do happen every day. It’s not unheard of to capture 10-20 grand a day when VIX has volume but pretty easy to guarantee yourself at least a couple grand a day with this system as well. Getting 10 cents or more of edge isn’t unheard of and with your priority, you can get dibs on all of this. You’ll lose a little depending on how you hedge (and that’s up to you, I used VIX to hedge against the rest of my book but you can use ETFs, futures, back months, other options, indices, or just don’t hedge, etc). Due to the book size, there’s no real danger in following the wisdom of the crowds and your priority will allow you to ‘cut’ in front of all us professionals (and I’m not bitter about, I swear!). It’s so simple that you can do this by hand but also pretty easy to code something that just follows size on the bid/ask.\n\nYou can also add pit coverage if you’re really ambitious. Most of the pit brokers take paper flow and send out orders on a ‘blast’. They literally still use AOL Instant Messenger, but you can see live orders and take these down as well. You pay a bit extra due to broker fees but this really helps give you a better idea where flow is going and paper usually has to give up a ton of theo to execute the kind of size they have.\n\nYou can use this in any product but it's definitely easiest in VIX because of the wide tick size doing three things: broadcasting everyone's theos, allowing you to keep order quantity down, and making paper pay up way too much for the positions they want to put on.\n\nHope this gives you an idea of some of the most basic tricks you have access to as a retail trader. As always, willing to take questions but keep in mind I have not traded anything in the equity market in 2 years. I’ll probably continue to flesh this out or add some other trade ideas but I’ve been fairly busy with my book the last few days. People keep asking for examples though so I wanted to get an easy one out there for people to read.\n", "id": "6nunx7", "created_utc": 1500313267.0, "score": 50, "upvote_ratio": 0.95, "num_comments": 39, "comments": [{"body": "Easy he says. ", "score": 9, "replies": []}, {"body": "How was this patched?\n\nAccording to [this document from the CBOE](http://www.cboe.com/LearnCenter/pdf/techatcboe.pdf):\n\n>Any order,\nregardless of the point of\norigin, that goes into\neBOOK is given first-in,\nfirst-out priority.  That\nmeans, if you place an\norder for ten contracts at a\nparticular price, and then a\nbank places an order for\n10,000 contracts at the\nsame price, as soon as it is\nmarketable, your order will\nbe filled first because it was\nreceived first.\n\nIs that the patch, or does that not include MMs?", "score": 5, "replies": [{"body": "I think he means that it used to be that our orders used to take priority, it now is patched so that we are all equal. At least that's how it looks to me.", "score": 2, "replies": [{"body": "Yes, but only in VIX. They might have patched it in another product a long time ago because a certain someone was abusing it... ", "score": 4, "replies": [{"body": "Is there any way to effectively test which products this is patched for?", "score": 2, "replies": [{"body": "Yes, if they aren't single-listed, I don't think customer priority can be taken away. I know a lot of guys used to just do this in products like the Qs, Google, Apple, Tesla, the big banks, etc but I can't speak to how viable it is since all the big stuff went to pennies. I know there are 1-2 underlyings you could more or less do this with right now, but again it's not as good without the size and single-listing that VIX has.", "score": 6, "replies": []}]}, {"body": "Wonder who that was....", "score": 1, "replies": []}]}]}]}, {"body": "Just to play this back for my own benefit. Large traders in underlyings with relatively wide strikes tend to place large limit orders onto the market rather than place small orders and re-up when the price moves around. They do this because the wide strikes limits the signaling power of the prices, so its safer just to offer the price you want and wait. Occasionally this may leads to a large imbalance on either side of a spread at a certain strike. \n\nOne strategy is to trade the other side of large imbalances like that because EMH says that the current bid/ask is the most accurate price. A large imbalance will \"pull\" prices away from the midpoint, so if you can fill more towards one side of the spread you will have an \"edge\" on the true price, which while small, can add up if done a lot.\n\nThe catch is that, as a retail broker, your attempt to capture that edge may be intercepted by high-frequency traders at banks who buy order flow before it executes, so they will capture 90% of the edge you could have gotten and your trade probably won't fill.\n\nThe way you deal with that is to focus on \"first in first out\" products where your order will be given priority even if an hft steps in. The VIX used to be a product like that, but too many people were using this strategy and it imbalanced things, so not they don't. But other underlyings still have it in place, finding those is left as an excercise to the reader.\n\nIs that about right?\n\n", "score": 6, "replies": []}, {"body": "I read the whole thing but can someone give this noob a TL;DR or ELI5 version? At the beginning you said it was patched, so does this strategy no longer work?", "score": 9, "replies": [{"body": "2nd this, are you scalping bid ask spreads? ", "score": 6, "replies": [{"body": "That's the gist of it, yes. This product makes it easy to get all best fills as a MM while trading as a customer... or it did until April at least.", "score": 3, "replies": []}]}]}, {"body": "So assuming one can throw enough capital into this, it's fairly easy to execute? Also, just to be clear, you're stating it can't be done on VIX now but can be on other single exchange traded products?", "score": 2, "replies": [{"body": "There aren't many other single listed options now that allow customer priority. You can do it with smart routing or other tricks in equity options but it's more difficult.", "score": 4, "replies": [{"body": "Looking forward to your trade ideas. I still don't grasp exactly how you execute the strategy besides trying to fill a large order. \n\nI code so I'd be curious how to ring these opportunities and turn to automation to tell you where they exist. ", "score": 3, "replies": []}, {"body": "Also, keep in mind retail traders don't have the penny or nickel per contract commissions so even if you make $0.05 on the trade, you're losing another$0.2-0.025 on the commissions I suspect. Not that I'd be complaining, given the volume it could be quite lucrative. \n\nAgain, would love to see a live opportunity and/or another example from you when you have time. \n\nThank you. ", "score": 2, "replies": [{"body": "You're making .05*100 multiplier so your math is off. Commissions should be .20 at most but I had .10-.15 a contract when I was trading. \n\nSingle-listed exchange products often have special commissions too but sometimes you can get your BD to pay them. When I was trading this stuff, I was generating millions in exchange fees so they weren't exactly willing to cover that.", "score": 3, "replies": [{"body": "How did you negotiate the low fee? It kind of like chicken / egg where you tell the broker you need low commissions due to high volume trading and they tell you that you need to trade high volume to get the low commissions :)\n\n", "score": 3, "replies": [{"body": "You trade tons of volume. I had lots of days where I traded 250,000 contracts or more.", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "With that account size, you should be able to make 10k a day. You'd be wasting your time shooting for 10k a month.\n\nNothing though? Other than experience, I don't see what would hold you back. I'd still recommend going to a firm for a year or two to really learn the ropes but it's pretty easy to extrapolate after that.", "score": 4, "replies": []}]}, {"body": "Can this not still be done without customer priority by just undercutting the rest of the sellers? You said that 10¢ edges are not unheard of, so why not come in lower than everyone else and still take a 7¢ or 8¢ edge?  Maybe I am missing something.  Seems to me that coming in lower would have the same effect as 'cutting the line,' especially if CBOE is dealing with orders on a first-come first-served basis.", "score": 1, "replies": [{"body": "Pretty sure VIX options trade in increments of 0.05$, which is part if why this strategy works so well on it.", "score": 3, "replies": [{"body": "Oh interesting. It all makes sense now.", "score": 2, "replies": []}]}]}]}]}, {"body": "I cannot remember if you indeed said this (or when you said it if you really did), but I believe you mentioned you paid maybe $0.25 commissions per contract. If that's the case, doesn't that 0.05 edge per contract you gave in your example come out to be -0.20 still? You'd still be in the red in terms of theoretical edge, no?\n\nAfter you take the 500 contracts in, you mentioned that you'd get a little less edge based on how you hedge (or don't), that, I assume comes from putting on more trades, if you're paying even just 0.05 per contract, the 500 contracts + the hedge makes it a losing proposition doesn't it?\n\nFurther you mention that you used VIX to hedge against the rest of your book - can you go into this a little bit more? Was it just VIX vs SPX/SPY//ES?\nAside from a simple look at beta/correlation how'd you determine the hedge between the two products' derivatives?\n\nAs a 'basic' trick available to retail traders, is it kind of playing MM since you have/had priority?", "score": 2, "replies": [{"body": "VIX has a 100 multiplier. .05 cents of edge is 5 bucks. \n\nYes, I can't really go in depth with that strategy because it requires a ton of knowledge and is something I might go back to over time (if it still exists). That was my main moneymaker.\n\nThat's what this is, yes. Most of the rest of the tricks I know for retail revolve around priority and the rebate game.", "score": 2, "replies": []}]}, {"body": "How exactly do you profit from the spread of $0.05? The offer is 0.45 and ask is 0.5. You can sell 500 at 0.45, and buy them back at 0.5, which is a loss of 0.05. \n\nHope you don't mind me going off topic a bit. I wanted to ask you about your trading style since your answer to the ROI question recently. You didn't really spill the beans in your AMAA 4 years ago, only said high volume and \"vol. scalping\" and buying low vol and selling high vol. I'm most interested in the trading methods the traders and you in your old prop firm mainly used before you turned to MM. And, how did your trading differ after you left?\n\nI also started a thread about my trading journal, [here](https://www.reddit.com/r/options/comments/6o0bs3/my_3year_trading_journey_any_comments_or/), if you'd like to give me some pointers. ", "score": 2, "replies": [{"body": ">How exactly do you profit from the spread of $0.05? The offer is 0.45 and ask is 0.5. You can sell 500 at 0.45, and buy them back at 0.5, which is a loss of 0.05. \n\nI'm saying the guy was showing his hand. Usually when you see this stuff, he ends up paying up. Since you have priority, you can make the sale at .50 easily. That's the trade everyone wants.\n\n>Hope you don't mind me going off topic a bit. I wanted to ask you about your trading style since your answer to the ROI question recently. You didn't really spill the beans in your AMAA 4 years ago, only said high volume and \"vol. scalping\" and buying low vol and selling high vol. I'm most interested in the trading methods the traders and you in your old prop firm mainly used before you turned to MM. And, how did your trading differ after you left?\n\nThis is incredibly complicated stuff that isn't going to translate well over Reddit. Vol scalping at our level requires you to have a pricing model and correlation matrix. There's some decently high level math involved in this and not something I can really get across here but basically you sell the things that cross your theos and buy the ones that go below.\n\n>I also started a thread about my trading journal\n\nI'll take a look.", "score": 2, "replies": [{"body": "Thanks. After you sold 500 at 0.5, then? I'm not sure how that translates to making lots of money a day yet. The MM will sell to you at 0.45 eventually? ", "score": 2, "replies": [{"body": "You hedge it off with another option or with an underlying. You capture theoretical edge this way. You never buy or sell any VIX options unless they're for edge. You would buy this back for .40 in an ideal scenario if the flow works out that way.", "score": 4, "replies": []}]}]}]}, {"body": "How does the retail trader see these orders?", "score": 2, "replies": [{"body": "You can see the electronic book from most front ends I think. ", "score": 2, "replies": [{"body": "By \"most front ends\" you mean most web-based broker platforms or something else?  I've used a couple different brokers and never ran across data like this. Would love to see it.", "score": 2, "replies": [{"body": "I've never used a web-based broker system and I can't see how that would ever be a good idea. You want a dedicated front end. Sterling is the cheapest/easiest to learn before you move onto more serious ones.", "score": 3, "replies": []}]}]}]}, {"body": "This is great stuff, Fletch71011.  Thank You!", "score": 2, "replies": []}, {"body": "Thanks", "score": 1, "replies": []}, {"body": "Woah! You have a book coming?", "score": 1, "replies": [{"body": "A book is a large trading portfolio. I am not a great writer any more in case this post doesn't make it obvious enough.   ", "score": 4, "replies": [{"body": "A book is a large trading portfolio, a writer is someone who sells options to open them, there are a number of author-like language used in this business, I can see where he is coming from. :-) ", "score": 3, "replies": []}, {"body": "Ah that kind of book. I saw the huge wall of text and wanted to belieeeeve that there was more :D\n\nLike, this was a teaser chapter or something ", "score": 2, "replies": []}]}]}]}
{"title": "Is it a good time to get into AAPL?", "selftext": "Planning on starting a position worth 2.5-3k, is it a good time to get in now or should I wait for it to dip? Seems to have run up a lot recently.", "id": "6ntlb6", "created_utc": 1500303650.0, "score": 9, "upvote_ratio": 0.67, "num_comments": 32, "comments": [{"body": "Buy some now. Buy more later as it goes up or dips. I think they're worth the investment.", "score": 19, "replies": []}, {"body": "If you think a stock is good, you buy it. Buying dips is a good strategy, waiting on dips is a fool's game.", "score": 4, "replies": []}, {"body": "Depends: are you a (long time) investor or a short time trader/speculator?", "score": 3, "replies": [{"body": "Not OP but i'm looking to go long (3+ years)", "score": 3, "replies": []}, {"body": "I have been doing relatively well at short term investing (by that I mean hold for a month or two and sell) but I do want to have a couple safe bets that will go up over time.", "score": -1, "replies": [{"body": "Well, if you're looking at 3-5-10 years and within a diversified portfolio, $AAPL is always good IMO.  I have it in my long term portfolio.", "score": 2, "replies": []}]}]}, {"body": "Aapl I believe to be a strong long term hold stock. I would buy and not worry about the fluctuation. It's done well for me over the past few years. Despite the dips, it generally trends up. Adding dividends, you're guaranteed some steady income from them. What really stands out is the balance sheet! They have tons of cash that they may employ to make big moves if needed without putting a dent on their fundamentals. They are unlikely to go bankrupt with such a solid following and reliable product offering. I'd buy and hold long. And buy more whenever you can. \n\nAlternatively you can buy SPY, which holds APPL and FB etc and just keep forever or until you need to cash out for retirement. An S&P500 etf will always be a good move in a diversified portfolio. ", "score": 2, "replies": []}, {"body": "I have about 70 shares, and add 1 or 2 each month regardless of price. I don't think there's ever a bad time if you're planning to hold for the long term. It could be wise to let earning pass, or it could prove to be a bad move. Only one way to find out.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "4 for me. so if' I'm spending 300, I can take it. \nI plan to hold for some time, and I get dumb if I try to save up money for one large purchase. so it's the only way I can force myself to stay structured.", "score": 1, "replies": []}]}]}, {"body": "But it they do take a big dip on earnings, best believe I'm buying more.", "score": 1, "replies": []}, {"body": "I'm planning to add some shares and think it's a good time now. I expect the stock will essentially increase by September. ", "score": 1, "replies": []}, {"body": "It's always a good time to buy that stock but start very small at these prices. The market will pull back\n Just because it's a good company doesn't mean it's going to keep going up like it has been. Wait for some weakness and start buying small as price starts working its way back up you can always add. Whatever you do don't buy it all in one shot at One price. ", "score": 1, "replies": []}, {"body": "potential buy area at .50 fib lvl or trendline support, for a HL b4 another HH", "score": 1, "replies": []}, {"body": "Yes...Apple will be profitable for the foreseeable future. They are a consumer staple, I'm not going to argue they will always be innovative, bc they don't have to be.", "score": 1, "replies": []}, {"body": "I wouldn't. Look at the past 10 years and tell me what you see. Cycles. Also the iPhone8 will be a total fail in terms of specs versus competitors and the iPhone market has been dropping over the years. Apple needs something big to keep their momentum and right now they just don't have it. If or when Apple gets their overseas money back into the U.S. for R&D then it may make sense to invest in Apple.", "score": -6, "replies": [{"body": "People literally said the same thing about the iPhone 7 which was even less of an improvement over the 6 and look we're at now...the iPhone 8 will be heaps better than the 7", "score": 3, "replies": [{"body": "And Apple has been seeing a shrink in their phone market for years. What are you saying? ", "score": 0, "replies": [{"body": "And their stock price still went up 50% in the past year....", "score": 2, "replies": [{"body": "Yeah except we're in a bull market. Literally every major tech company went +50%.", "score": 0, "replies": []}]}]}]}, {"body": "You are forgetting the Apple fanbase...there are people that upgrade every single new phone and there are even more people who are waiting until this version to upgrade (majority tend to skip a generation and get the next).  This iphone will be the biggest yet and they have created such a hype around it that there will be some new apple users too.\n\nOnly issue is the delay that is being rumored, but again, the fanbase isnt going to care that much because they will do anything for the newest apple product.", "score": 6, "replies": [{"body": "Some might even... sell stock to afford the new iphone!", "score": 2, "replies": []}]}, {"body": "Oh stfu you don't know shit, it's the most profitable company in the world ", "score": 6, "replies": [{"body": "I hold AAPL, but it's important to keep in mind that \"most profitable\" doesn't always mean \"best investment\".      \n    \nAlso, the guy made good points; you didn't have to go full dicktwat on him so hard. ", "score": -1, "replies": []}, {"body": "sour grape much.", "score": -6, "replies": []}]}, {"body": "I wasn't aware that they have announced the specs for the next iPhone. TIL. \n\nEdit: Do you have a link to their website or press release to where I can see them?", "score": 4, "replies": [{"body": "macrumors which has had legit leaks and analysis. The iPhone 8 will be the biggest flop of all time. Nothing innovative and yes the specs will be weaker compared to other makers.", "score": 1, "replies": []}, {"body": "Specs are rumors, but Apple rumors have been pretty spot on for 5-10 years. It's also rumored to cost $1-1.3k, depending on model.       \n     \nOne of many sources (since ITT anyone being realistic about AAPL is getting shit on): http://www.businessinsider.com/iphone-8-cost-2017-7", "score": 1, "replies": []}]}, {"body": "10 years ago Apple was just getting started with the iPhone, and was sitting on the iPods\n\nDo your research", "score": 2, "replies": [{"body": "what does that have to do with the cycles over the past 10 years? nothing.", "score": 1, "replies": []}]}, {"body": "I agree. \n\nNew phone, so what. \n\nIPhone, ipad, ipad, iwatch... all were pretty innovative. \n\nBut what next? Another phone? So bloody what. They've piles of cash, but I see no new innovation.", "score": 1, "replies": [{"body": "The fanboys downvoting me just don't understand that Apple has been riding a wave that's about to end.", "score": 1, "replies": [{"body": "I realised that about 10 seconds after posting... that it doesn't matter what I say or think... cultists will be cultists.", "score": 1, "replies": []}]}]}]}]}
