{"title": "Dow futures slide more than 200 points as Wall Street adds to Friday's losses", "selftext": "[deleted]", "id": "7vaw8b", "created_utc": 1517790331.0, "score": 148, "upvote_ratio": 0.95, "num_comments": 71, "comments": [{"body": "I wanna buy the dip. Checking out apple and google.", "score": 27, "replies": [{"body": "Visa is tempting. ", "score": 20, "replies": [{"body": "I want V as well. ", "score": 14, "replies": [{"body": "I want the d as well 😉", "score": 17, "replies": []}, {"body": "Who doesn't?", "score": 1, "replies": []}]}, {"body": "I’m thinking about picking up some more later this week. Let the market bleed a little. I made the mistake of buying more V early last week instead of waiting", "score": 5, "replies": []}, {"body": "I'd wait until Tuesday/Wednesday. Seems to be dropping still.", "score": 1, "replies": []}]}, {"body": " It's really hard to not buy more AAPL call options. ", "score": 8, "replies": [{"body": "honestly, don't do it. DOn't catch a falling knife. I sold all my apple calls and bought the stock instead. ", "score": 0, "replies": []}]}, {"body": "Think you can time it? When will you be doing this?", "score": 2, "replies": []}, {"body": "what are the best hedges against the fall?", "score": 1, "replies": []}, {"body": "Ahhh french onion dip.", "score": 1, "replies": []}, {"body": "aapl is a waste of money and time.\ntry JNJ , V , WMT", "score": 0, "replies": []}]}, {"body": "Uptrend is still well intact. See what happens at the 50dma.", "score": 8, "replies": []}, {"body": "> Will be interesting to see if the down trend continues tomorrow.\n\nIt's getting worse as of now\n\nhttps://i.imgur.com/eYGX4H1.png", "score": 18, "replies": [{"body": "Where can I see after hours activity like your pics show? Etrade doesn't show.", "score": 10, "replies": [{"body": "https://finviz.com/futures_charts.ashx?t=ALL&p=m5", "score": 9, "replies": [{"body": "Time to start trading Lean Hogs ", "score": 17, "replies": [{"body": "Cotton is the real commodity right now ", "score": 1, "replies": []}]}]}, {"body": "Investing.com", "score": 1, "replies": []}]}, {"body": "How does S&P 500 and NASDAQ Trade during the weekends when the stock market is closed?", "score": 1, "replies": [{"body": "Futures", "score": 6, "replies": [{"body": "What does Futures mean?", "score": 1, "replies": [{"body": "Like everything in the world, someone decided they wanted to gamble on the stock market. Futures allows them to do that. Futures is a bet on what will happen to the market. This betting happens 24x7, and isn’t beholden to market open and close times. When more people start betting that the market will open lower on Monday, this is often a good sign that the market will open lower.", "score": 11, "replies": []}, {"body": "It’s the opposite of pasts.  ", "score": 12, "replies": [{"body": ">pasts.\n\nI'd trade those", "score": 15, "replies": []}]}, {"body": "https://www.investopedia.com/terms/f/futures.asp", "score": 1, "replies": []}]}]}, {"body": "Futures trade pretty much 24 hours during weekdays", "score": 2, "replies": []}]}, {"body": "How long is the downtrend expected to continue? Days,weeks or months?\nI bought my stock just before the downtrend :/\nI wanted to buy even some more", "score": 1, "replies": [{"body": "If people knew that, there wouldn’t be entire communities dedicated to speculating about it. Obviously nobody knows how long it will continue. \n\nThis could end tomorrow or it could be the start of a decade-long bear market. We’ll never know until it’s over. ", "score": 6, "replies": []}, {"body": "Do you remember what happened in 1987?\n\nSauce: https://en.wikipedia.org/wiki/Black_Monday_(1987)", "score": 2, "replies": []}]}]}, {"body": "10% pullback? Here we go!", "score": 7, "replies": []}, {"body": "Trump rally over?  Trump correction about to start?", "score": 17, "replies": [{"body": "Pretty sure it'll be called the Obama correction.", "score": 17, "replies": [{"body": "Oh, so when the market kept going up after the election it was the Trump rally, now it is the Obama correction?   Yeah, ok, gotcha.", "score": -12, "replies": [{"body": "That's the joke", "score": 23, "replies": [{"body": "Wooooosh\n\n", "score": 5, "replies": []}, {"body": "Yeah I missed something there.    \n\nPoe’s law and all that", "score": -1, "replies": []}]}]}]}, {"body": "Well to be fair the last time we got tax cuts like this were the the year before the great depression and the year before the great recession so i wonder if there is some correlation", "score": 6, "replies": [{"body": "Who knew that adding 1 trillion to the national debt would be bad for the economy?", "score": 10, "replies": [{"body": "That’s additional money entering the market, so why would it be bad for the economy?", "score": 6, "replies": [{"body": "Only 30% of the people in this country invest their money in the market.", "score": 9, "replies": []}, {"body": "That money was already in the economy one way or another.  Before the tax cut it was going to the gov. to cover spending.   Now gov has to borrow more and grow the debt.", "score": 3, "replies": []}, {"body": "Look up overindebtedness ", "score": 1, "replies": [{"body": "The US is no where near in too much debt.", "score": 3, "replies": [{"body": "It's only once had such a high debt to gdp ratio: during WW2. But all is well...", "score": 1, "replies": [{"body": "It's simple. See the US as a firm. For ever $1 dollar they get in through credit, they produce $2 on the bottom line. Should the firm acquire more loans? Fuck yeah. As long as the bottom line generates more than the loans + interests you should acquire more.", "score": 0, "replies": []}]}]}]}]}, {"body": "Well, that's over 10 years.", "score": 1, "replies": []}, {"body": "Politicians don't listen to economists", "score": 1, "replies": []}]}]}, {"body": "The Fed has to undo the fakeness that kept the market alive under Obama ", "score": 1, "replies": [{"body": "The gains in my investments are not fake.    ", "score": 1, "replies": []}]}, {"body": "And when it is finished just in time for the Trump impeachment, maybe the traitorous enabling republicans can be removed from the congress and senate.", "score": -27, "replies": [{"body": "?", "score": 5, "replies": []}, {"body": "Hard to be a traitor when memos showing hillary camp paying for fake russian dossiers to slander him come out as well as all the other proof she stole the election from Bernie and sold US uranium fpr russian hush money. Yeah trumps impeachment is never coming you liberals are legit delusional", "score": -5, "replies": [{"body": "Add in a \"buttery males\" in your comment and you have a trifecta of \"he/she was a just a coffee boy\" line of reasoning. ", "score": 2, "replies": []}, {"body": "“you liberals are legit delusional”\n\nheh. Hehe. Hahaha. HAHAHAHAHAH. \n\noh...  can’t make this stuff up. \n\nThanks for the morning laugh, Trumpster. ", "score": 0, "replies": []}]}]}]}, {"body": "This pullback was needed. I'd actually be more uncomfortable if we continued up at the pace we did for most of January. The market needs a consolidating period before it heads higher ", "score": 3, "replies": []}, {"body": "This happened before: https://www.reddit.com/search?q=DOW+1500&include_over_18=on", "score": 3, "replies": []}, {"body": "Hey, how do you invest in a future?  Or can you?", "score": 3, "replies": [{"body": "Buy a DeLorean", "score": 17, "replies": [{"body": "Ive always wanted to do that!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Oh okay, ive been trying to buy some through fidelity but couldnt find them", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Oh okay, ill probably go the etf route then!", "score": 1, "replies": []}]}]}]}, {"body": "Literally one google tab away.", "score": -11, "replies": [{"body": "Ive been trying to buy them on fidelity but cant find them", "score": 2, "replies": []}]}]}, {"body": "The slide from Friday was pretty sharp, and was followed by more down days on high volume. From its peak at 266, down to 255, I think it is trying to reach support at 247. \nThe fundamental reason I see that made a lot of sellers trying to exit their position was interest rates. It bothers me that the volume on Friday was very high compared to previous days. \nI would look for a 247 level followed by 2 green candles with increasing volume in order to put a buy order.\nUptrend is still solid. All weighted avgs are still in place. ", "score": 1, "replies": [{"body": "I'm looking for some head and shoulders.", "score": 0, "replies": []}]}, {"body": "Everyone should hedge their positions with Puts. Im never in positions without protection.", "score": 1, "replies": []}, {"body": "Is anyone surprised? ", "score": 1, "replies": []}, {"body": "Bought some GOOG and V.", "score": 1, "replies": []}, {"body": "Liquidating. Buying canned food and kitty litter", "score": 1, "replies": []}]}
