{"title": "Apple Inc could be the first company to reach a market capitalization of $1 trillion.", "selftext": "", "id": "2mrwjr", "created_utc": 1416409292.0, "score": 37, "upvote_ratio": 0.82, "num_comments": 30, "comments": [{"body": "Making their value larger than the GDP of all but 19 countries (Australia's GDP is ~$1T)\n\nGranted, that's not exactly a fair comparison (vs Net Income), but still...", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Eh. Petro China already did that. ", "score": 3, "replies": [{"body": "People need petro, people don't need luxury tech items. ", "score": 2, "replies": []}, {"body": "Isn't that state owned? If that's the case then Saudi Aramco is also in the trillions.", "score": 2, "replies": [{"body": "still traded:\n\nhttp://www.marketwatch.com/story/petrochina-soars-to-1-trillion-market-cap-in-debut", "score": 2, "replies": [{"body": "I know. I'm pretty sure they're on the NYSE as well.", "score": 2, "replies": []}]}]}]}, {"body": "All of this excitement makes me want to short it. Not now...but soon.", "score": 3, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "If I were to short it now, yes. \n\nDo you think Apple will be the creme de la creme forever? It's undervalued right now. I know it. Everyone knows it. A quick look at finviz let's the whole world know it. \n\nI'm waiting until some sexy young thing comes along and in that industry it will happen. ", "score": 2, "replies": []}, {"body": "Could some one ELI5 what is meant by short it?", "score": 1, "replies": []}]}]}, {"body": "Baba may get there in a few years.", "score": 2, "replies": [{"body": "I hope so", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don't understand what you are trying to imply/say.", "score": 1, "replies": []}]}]}, {"body": "I absolutely thought AAPL was done growing.  I didn't understand their cunning scheme with the watch.  Now that I've figured it out...fuck it, buy AAPL.  They are poised to tap into MSFT levels of license revenue.  ", "score": 1, "replies": []}, {"body": "The last time a publicly traded company (I believe it was Exon... ) got close... that said, oil has fallen a lot recently, so it hasn't come down that much due to anything fundamental to the longer term prospects of the business... well depending on who you believe I suppose... I personally think there is some demand related \"slack\" right now, but the supply is the main issue, but demand is likely going to rise as long as oil remains mobile.  That is the issue with NG, it isn't (as) mobile in some places.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "what? assuming you held stock, you've had all that capital tied up while the rest of the market was having a crazy bull run", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Buying SPY will give you pretty similar results, even better if you trading it. Pretty sure a monkey could have just pointed at a random stock in the last 4-5 years and made about the same return as Apple in the same timeframe.\n\nHere, is graph [SPY VS APPLE](http://finance.yahoo.com/echarts?s=AAPL+Interactive#{%22range%22%3A%222y%22%2C%22scale%22%3A%22linear%22%2C%22comparisons%22%3A{%22SPY%22%3A{%22color%22%3A%22%23cc0000%22%2C%22weight%22%3A1}}}) over the last 1.5-2 years.\n\nCurve for SPY is much smoother---less volatility for same return. Oh my bad, SPY actually outperformed Apple...lol", "score": 1, "replies": [{"body": "Now factor in dividends and look at the chart with that in mind.  Looks like Apple worked out pretty well after all.", "score": 3, "replies": [{"body": "But at the cost of higher volatility.  SPY curve much smoother.  ", "score": 2, "replies": [{"body": "Fuck SPY.   \n\nHad I bought at 178 it would be different.  But I didn't so fuck SPY.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I know it's off-topic.  But Gilead made me some fucking MONAY, so go Gilead!\n\n", "score": 2, "replies": []}, {"body": ">I bought more as Apple fell. I assume you know of another safe investment that returned me 120% in a **year and a half?**\n\nI was responding to this challenge.  He challenged me to find a safer investment in the last 1.5 years than Apple. All I did was pull up a chart of SPY; took me like 5 seconds. Apple didn't even beat the general market. LOL. Please read before you make stupid comments. \nIdiot.\n\n>iterally the only mega-cap stock (that trades publicly on American exchanges) that has returned more than AAPL is Gilead, which doesn't pay a dividend either.\n\nLOL...Just pick a random stock. Why large caps? You have a fetish for large caps? Okay, Here:\n\n[really volatile large cap stocks that offer better curves than APPLE]( http://finance.yahoo.com/echarts?s=NFLX+Interactive#{%22range%22%3A%225y%22%2C%22scale%22%3A%22linear%22%2C%22comparisons%22%3A{%22AAPL%22%3A{%22color%22%3A%22%23cc0000%22%2C%22weight%22%3A1}%2C%22PCLN%22%3A{%22color%22%3A%22%23ff00ff%22%2C%22weight%22%3A1}}}) Actually, PLCN has outperformed Apple. Has smoother curve too...lmao. Did you know that? No....lol\n\n\n[PLCN VS APPLE OVER 10 years](http://finance.yahoo.com/echarts?s=NFLX+Interactive#{%22range%22%3A%2210y%22%2C%22scale%22%3A%22linear%22%2C%22comparisons%22%3A{%22AAPL%22%3A{%22color%22%3A%22%23cc0000%22%2C%22weight%22%3A1}%2C%22PCLN%22%3A{%22color%22%3A%22%23009999%22%2C%22weight%22%3A1}}})\n\nLOL..much safer and higher returns\n\n> Look at 1, 5, 10, 15, 20, 25, or 30 years.\n\nApple wasn't large cap at 15, 25, or 30 years ago; so your point is moot. Investing in Apple back then would be like investing in any high risk companies that you hate now. If I recall, Apple was almost at bankruptcy. I would go as far as to say that Apple, 10 years ago, was a high risk investment.\n\n>25, or 30 years.\n\nLet's compare apples to apples and oranges to oranges. A much safer and way better stock would be MSFT. Both companies were founded around same time and in similar industry.\n\n[Apple vs Microsoft over 25-30 years](http://finance.yahoo.com/echarts?s=AAPL+Interactive#)\n\nNo competition.\n\n>It's like the iPhone broke up your parents marriage, or something.\n\nI don't hate Apple. I think it was a wonderful company under Jobs, and I was an active trader in the stock up until he died. I do hate Apple fanboys though. They're annoying like all the other fanboys. They're all very emotional and tend to get their panties bunched up when Apple goes under any criticism.\n\nAnd please, stop stalking me....LMAO. It's getting creepy.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You're still not reading. This is what happens when you jump into other people's conversations. I was replying to another poster who asked for a safer investment than Apple over the last year and half. I cited SPY, which it is. That's why the graph is over 1.5 years...get it now?\n\n\n>Do you know the difference between large and mega cap? 10B+ and 100B+... Mid-cap is 2-10B if you were confused about that too. Small cap is 2B and under.\n\nIn the PCLN case, we're talking about 10 years ago and measuring the returns since then. Apple wasn't large cap 10 years ago...lol. Do you need me to explain this to you like a child? Pretty simple, imo.\n\nMaybe I should compare 2014 Google to 2002 Apple? LMAO\n\nIF you want to do megacap, then i'll show you graph of MSFT vs Apple over 30 years. I don't think you want to see that one. LOL.\n\n>I'm not stocking you, I see retarded comments in /r/stocks[1] sometimes and I'm about to respond, and then sometimes I realize it's you.\n\n\n\"stocking\"? what does that mean? Yes, you are stalking me. Please stop. You only comment on my comments in the entire thread. Lol. This is what I hate about fanboys but also love very much.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">Whoops that's funny, I used the wrong word.\n\nNo, it means you're stupid or English isn't your native tongue. That's what it literally means. Not hard to understand kid. It's not even a typo...it's like a totally different word. lol.\n\n>What an absolutely terrible investment, lol.\n\nNever said Apple  was a terrible investment. Much safer investments out there with better curves last 1.5 years (which was discussed originally until you came in)\n\n>It was over 10B pretty much all throughout 2004 and onwards. Keep making more shit up, this is always fun.\n\nDoesn't change the fact that PLCN had a better curve and less volatility while providing higher returns in the same period. Same with many other stocks as well over the same period.\n\n>So we've got one mega-cap stock that has yielded more than AAPL in the past 30 years\n\nAre you stupid? This is only obvious in hindsight. I only cited MSFT as a joke. How would you know if an investment is going to be large cap later on?  Why would you care? The goal is returns vs drawdowns.\n\nThis is simple stuff, kid. You care how big Apple's market cap is because you're a fanboy. That's all, and you get all butt hurt when someone bashes Apple. That's what I love about fanboys; they get their feelings hurt over a company. Did you cry when you found out Tim Cook was gay? LOL. You probably were in tears.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">You mean like large and mega? Or like how there are numbers less than 10, and bigger than 10?****\n\nWhooaa there kid, slow down. Let's get English out of the way first...then we can talk about other things like finance. I mean like stocking (a noun) vs stalking (a verb). You know...basic English.LOL. \n\nGrab Rosetta Stone English on Amazon...I hear it's on sale.\n\n>Is Tim Cook half black or something? Is that why you hate AAPL?\n\nNahhh...I just feel like they've lost a lot of the shine without Steve Jobs. Apple isn't what it used to be. It's a boring MSFT now...actually no...MSFT is more exciting these days. Shame...", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They're losing smartphone marketshare to android. No significant new product launches. Financials? It's all on old technology and innovation left behind by Jobs. Same with Microsoft...they're in great financial situation...but a lot of it is money from Windows and Office (wasn't this invented decades ago? lol).... What does that say? ", "score": 1, "replies": [{"body": "Finally, a legitimate argument!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": ">But you still had that capital tied up for 2 years just waiting for it to recover. \n\nIt's called \"investing.\"\n\n(Capital tied up in aapl for 17 years now)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You're saying it's *less* likely to have a higher market cap because they're buying back shares?", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": []}, {"body": "Yeah, but this theoretically should have no impact on market cap.  It effects the balance sheet, yes. But share price should rise by $X to so that market cap remains the same after a buyback.", "score": 1, "replies": []}]}]}]}, {"body": "there are people like you who are logical traders and then there are people who fall in love with Apple that trade", "score": 0, "replies": []}]}]}]}]}]}]}
