{"title": "SOFi calls", "selftext": "[deleted]", "id": "1c7j268", "created_utc": 1713485683.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 22, "comments": [{"body": "You're probably right. Out of the money upside calls not a likely to pay off in this market environment.", "score": 7, "replies": [{"body": "The real question is to sell now or wait till before earnings", "score": 2, "replies": []}]}, {"body": "Position - 22 contracts avg cost -.64 \nCurrent cost -.47 \nDate bought 4/12\nExperation 5/3 \nStrike 7.5\nTotal return (-32 percent)", "score": 3, "replies": [{"body": "Hard to say for sure but if it was me I would dump them. I was bullish on SOFI until this latest CPI print ruled out a rate cut in June or July, and now the entire banking sector is down. I think the stock could go either way at earnings, but I would guess down is more likely than up, based on the decreasing chances of rate cuts in 2024.", "score": 0, "replies": []}]}, {"body": "I’m actually in on the stock. Just not the chain.  If you believe in the company , you may want to bail on the options, take the loss, throw the remainder into shares and call it day", "score": 3, "replies": [{"body": "That’s too boring might just sell em all tomorrow and throw it in SPY puts or smnth bearish", "score": -3, "replies": []}]}, {"body": "RIP your calls tomorrow", "score": 3, "replies": [{"body": "Wym it’s the same as when it closed?", "score": 0, "replies": []}]}, {"body": "Hold them until earnings. Sofi will beat eps this quarter. I have $7 calls expiry on May 10th. Will sell them after earnings report on Monday afternoon...good luck.", "score": 3, "replies": [{"body": "Companies are being crushed even after reporting good earnings. My advice, forget options stick to shares", "score": 3, "replies": []}, {"body": "I have $7 calls with July expiration, waiting on earnings as well.", "score": 1, "replies": []}]}, {"body": "SOFI heading below $6 if PCE comes in hot Friday next week.", "score": 0, "replies": [{"body": "Ik this sounds stupid but what’s PCE", "score": 0, "replies": [{"body": "Ever heard of Google?", "score": 1, "replies": [{"body": "Nope what’s that", "score": 1, "replies": []}]}, {"body": "If you don't know what PCE is, why the hell would you get into a financial stock that is interest rate dependent? 🤦‍♂️", "score": 0, "replies": [{"body": "I just buy whatever Reddit tells me", "score": -1, "replies": [{"body": "You belong in r/WallStreetBets", "score": 1, "replies": [{"body": "I got banned :(", "score": 3, "replies": [{"body": "Yeah but you can still view.", "score": 0, "replies": [{"body": "I know, where do you think I got the idea to buy SOFI calls", "score": 1, "replies": [{"body": "Funny guy. Im rooting for you 👍", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "META puts and TSLA calls?", "selftext": "So here's what we know. \n\nResults are fantastic = stock goes down. See TSM and NFLX. We can expect META to have great earnings results, which will disappoint the market, resulting in a 5-8% drop over two days. So puts.\n\nTesla on the other hand is a complete piece of shit at this point. Their cyber truck is a joke. Manufacturing has gone haywire. Orders and deliveries are lower than expected. Stock is trending down. Results and guidance will be very poor. The market will appreciate their gloomy outlook and the stock will pop 8-10% within two days following earnings.\n\nNow I know what you're thinking. This sounds regarded, but is it? Remember when people were like \"buy TSM because they make duh AI chips that everyone wants\" and then TSM was like \"yah we're making shit tons of money making more chips\" and the stock when down anyways?\n\nTSM was priced in. \n\nMETA is priced in. So down?\n\nTSLA is priced in, so up?", "id": "1c7k08v", "created_utc": 1713488439.0, "score": 28, "upvote_ratio": 0.76, "num_comments": 61, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 320 | **Previous Best DD** | \n**Account Age** | 11 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Inversing this", "score": 23, "replies": [{"body": "Inversing in your inverse play", "score": 12, "replies": []}, {"body": "I'm wrong 100% of the time, but unfortunately no positions on either, so proceed with caution. If I had positions, you could be safe to inverse.", "score": 8, "replies": [{"body": "In that case how about this, I buy 10 contracts each, you buy 1 of each and take the opposite side of my trades so my win is locked in, and I'll pay you a 5% commision on returns on top of your loss. Infinite money glitch?", "score": 7, "replies": [{"body": "Solid plan, I'll dm you.", "score": 3, "replies": []}]}]}]}, {"body": "TSLA is literally ded in this rate environment ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4275)", "score": 11, "replies": [{"body": "Exactly. Your logic is solid. So now you inverse to select the correct direction for your options.\n\nLiterally ded = calls", "score": 13, "replies": [{"body": "Good luck, regards!", "score": 1, "replies": []}]}, {"body": "You're welcome", "score": 4, "replies": []}]}, {"body": "This aged like TSLA calls and META puts", "score": 10, "replies": [{"body": "Thanks.", "score": 4, "replies": [{"body": "what is your move for microsoft and snap? Please enlighten me with your galaxy strategy.", "score": 1, "replies": [{"body": "Msft calls, but historical move is 4.6%, so might not be worth the risk? I'm really sorry, but I don't follow SNAP. Too close to penny stock territory.", "score": 3, "replies": []}]}]}]}, {"body": "How the plebs insist on continuing to try to beat the market is beyond me.", "score": 14, "replies": [{"body": "You're welcome.", "score": 2, "replies": []}]}, {"body": "YOLO TSLA CALL!", "score": 5, "replies": [{"body": "You're welcome", "score": 3, "replies": []}]}, {"body": "You absolute mad man", "score": 6, "replies": [{"body": "I feel vindicated. Thanks.", "score": 3, "replies": []}]}, {"body": "Nope. Based off tonight, I'd say you should buy puts on most everything for next week or two", "score": 4, "replies": []}, {"body": "I think I might buy mETA now and spy calls thanks regards to you my friend.\n\nhttps://preview.redd.it/95k31ap9ecvc1.jpeg?width=1284&format=pjpg&auto=webp&s=2ec463aae337751b6850e0d36b335ca8ab2ab989", "score": 3, "replies": [{"body": "Unfortunately, inversing me only works when I have money in. Your spy calls are guaranteed to print, but I have no meta positions.", "score": 6, "replies": [{"body": "I don’t have spy calls either haha I was thinking it but not after this Israel/Iran thing", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Haha", "score": 2, "replies": []}, {"body": "Elon knows how to play the long game. The Zuck will never be as cool, or as rich.", "score": -4, "replies": []}]}, {"body": "You are absolutely right. All the bad stuff for Tesla is already out there and prices in. Anything positive and it will pop. Most likely eps will be better than expected and that's it or Musk will announce $25k compact car or something lol, you never know.", "score": 6, "replies": []}, {"body": "If the results are fantastic but not reproducible, or even worse -- where on the expensive of future growth, the stock will go down to Memphis. If the results are fantastic, growth is guaranteed with Morgan Freeman voice, but the market expect people selling stocks and stocking up with canned beans, the stock will fall. Also, if big daddy knows that he can scare you to sell and get the stock with a discount, the stock will fall.", "score": 2, "replies": []}, {"body": "Reverse it ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4275)", "score": 2, "replies": []}, {"body": "OK so META puts?", "score": 2, "replies": [{"body": "Yah I think puts on whatever the most logical bullish play is. I think that might be META.", "score": 2, "replies": [{"body": "now what about NVDA", "score": 1, "replies": [{"body": "We'll have to wait until it gets closer.", "score": 2, "replies": [{"body": "but what about sentiment trade tomorrow off of META?", "score": 1, "replies": [{"body": "Oh gotcha, buy the dip tomorrow. Meta will recover *some* of it's losses and pull nvda up with it. But don't listed to me, I'm regarded, and usually wrong.", "score": 1, "replies": [{"body": "well as long as you don't have a position in either it should work right? i'm long NVDA and wondering if it's time to sell or hold for now.", "score": 1, "replies": [{"body": "Long how? Calls? Stock? \n\nLong term, I'm bearish on nvda. Short term, bullish.", "score": 2, "replies": [{"body": "Stock and a few calls friday exp. And what makes you bearish long-term? (and how long term)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Called it", "score": 1, "replies": []}, {"body": "You're welcome", "score": 1, "replies": [{"body": "I didn’t buy but good shit. Now show your positions.", "score": 1, "replies": []}]}]}, {"body": "touché", "score": 2, "replies": []}, {"body": "Bruh, impressive! Give me some thoughts on Google and Microsoft earnings.", "score": 2, "replies": [{"body": "Google puts, msft calls, but msft historical move is 4.6%, so might not move enough for the risk. I'm always wrong, so don't listen to me, not financial advice.", "score": 3, "replies": [{"body": "PUT YOUR HANDS UP Firesnowing!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Thanks for sharing. I don’t trade/gamble on earnings. Excited to see if you can go 4 for 4 on your earnings predictions.", "score": 1, "replies": []}]}]}, {"body": "Fkn Legend", "score": 2, "replies": []}, {"body": "Didn’t but FB at 18. Won’t buy now. Zucks a cuck", "score": 2, "replies": []}, {"body": "Why not put both?", "score": 1, "replies": [{"body": "Anything positive about Teala might cause a dead cat bounce. I might not play either but I've got puts on SPY and SOXX because the whole damn thing looks like it's gonna crater at some point with 12 months.", "score": 1, "replies": []}]}, {"body": "Damn! You must be a genius.", "score": 1, "replies": [{"body": "Possibly.", "score": 2, "replies": []}]}, {"body": "No. Just no.", "score": 1, "replies": [{"body": "Yes just yes", "score": 4, "replies": []}]}, {"body": "and how about NVDA like a month ago, the performance after ER sometimes also follows the market", "score": 1, "replies": []}, {"body": "This kid 100% Legend. No regard here", "score": 1, "replies": []}, {"body": "My man. Right on the money.", "score": 1, "replies": []}, {"body": "Nflx $535 puts 4/26 exp. Sell tmrw at the open or hold till next week", "score": 0, "replies": [{"body": "Sell enough to pay for the cost you put in, then ride on free shares.  That's my plan.  I have 555 puts expire 5/21, will sell to get free shares. Hard to know if the price will go down during the day or be the lowest at the open.", "score": 1, "replies": [{"body": "Dang my puts got IV crush…", "score": 1, "replies": [{"body": "My NFLX puts got destroyed too.", "score": 1, "replies": []}]}]}]}]}
{"title": "Nasdaq falls 2% in sixth straight losing day as Nvidia and Netflix slide — CNBC", "selftext": "", "id": "1c85ilh", "created_utc": 1713554729.0, "score": 190, "upvote_ratio": 0.96, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 weeks ago\n**Total Comments** | 18 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "What a brutal week for bulls.", "score": 76, "replies": [{"body": "NASDAQ falls for the second week and I’m going to start thinking it’s a recession.", "score": 11, "replies": [{"body": "That's when the bounce come", "score": 5, "replies": [{"body": "We're all waiting for the dead cat kangaroo bounce", "score": 1, "replies": []}]}]}, {"body": "Yeah I’ve wiped out 6% of my 9% gains year to day. Only 3% up year to date. Spy is 4% up year to date, so it beats me.", "score": 3, "replies": []}, {"body": "I had a very satisfying argument with one the other day ending in this crash here: https://www.reddit.com/r/wallstreetbets/s/Yk8XbNZsrl", "score": 1, "replies": []}]}, {"body": "i guess it's the end of the world. down 12% or so from historical highs, with higher than expected CPI, no rate cuts when expected and geopolitical conflict. it's totally a bubble!!! \n\n![img](emote|t5_2th52|4271)", "score": 57, "replies": []}, {"body": "Stock up on puts now bois this is gonna be a wild earnings season", "score": 19, "replies": []}, {"body": "Bear season confirmed.", "score": 22, "replies": [{"body": "Go back to hibernation my guy", "score": 0, "replies": []}]}, {"body": "I literally don’t care what the markets do cause I ain’t a bitch", "score": 19, "replies": [{"body": "you mean because you dont own calls", "score": 3, "replies": []}]}, {"body": "Guys keep selling, I want the discount.", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|29637)", "score": 1, "replies": []}, {"body": "Healthy pull back or long term depression?", "score": 1, "replies": []}, {"body": "Citadels of the world cashing out on the  puts they bought in the expectation of a major Iran Israel showdown, clearing out even the faintest possibility of anyone profiting from the calls they sold, and at the same time selling high. They will now by low in the next few weeks. Companies also paused the buy back plan for these 2 - 3 weeks so that when they buy back their shares they can buy back at a lower price. It’s very well choreographed ", "score": 1, "replies": []}, {"body": "Analysts are bullish on Nvidia with a price target of $949.36. Do you agree?", "score": 1, "replies": []}, {"body": "TSLA only done 2%!  That should have gone down like 10%!", "score": 0, "replies": [{"body": "Zoom out from January, it’s down 40%", "score": 6, "replies": []}]}, {"body": "6 months straight up on Fed will stop raising interest rates soon. Fed will start cutting interest rates soon and then the market comes down and people ask why?\n\nWhy didn't anyone ask why when it was going up on nothing but Fed hopium and very modest inflation relief?", "score": 0, "replies": []}]}
{"title": "Netflix has added 9 million subscribers since controversial password crackdown", "selftext": "", "id": "1c8amu4", "created_utc": 1713567598.0, "score": 32, "upvote_ratio": 0.72, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "That initial wave of 'forced' signups as people were weaned off accounts was followed by massive subscription cancellations, this is what Netflix is trying to hide going forward. Go to the App Stores and read recent comments.", "score": 38, "replies": [{"body": "Yeah this 100%. The password crackdown was already basically priced in last quarter, and now they've kinda peaked out how many *\"NEW!\"* accounts they're going to get and want to hide it.\n\nIt was a one-time shot of adrenaline that you can only pull the loaded gun once. You can only crackdown on account sharing once to juice the subscriber numbers. Pretty much everyone who wants a Netflix account would have/had one already now.\n\nSo it's only going to be either stagnant or marginal decline in numbers as they continue to hike prices 2-3x a year. The big challenge for Netflix moving forward is how many times they can keep hiking subscription costs while slowly bleeding (or keeping) the remaining consumers.", "score": 17, "replies": []}, {"body": "The people happy with Netflix aren’t writing reviews. The people are happy with Netflix despite what Reddit wants to think", "score": -4, "replies": [{"body": "Don't get me wrong, it's not a great value at all, but it's still the best library available but more importantly and completely inexplicably....people love to watch shit.", "score": 1, "replies": []}]}]}, {"body": "I was pretty shocked how far the stock went down despite reporting record earnings. They beat the predictions and it completely tanked. The claim that they were going to stop reporting subscriber metrics was just crazy. That’s why it tanked. These days the investors care about data and metrics. And if you take that away, they take you away. Call options lost 4500 dollars per contract in minutes. I don’t buy them around earnings time for that reason but damn if you had insider knowledge and knew the numbers were that high, you might have lost a a LOT of money", "score": 16, "replies": [{"body": "It just goes to show how people's tastes changed after the pandemic. I switched out to Max just for principle, and I was tired of their content. HBO had some series I wanted to watch. Maybe I will swap back in a year or so.", "score": 5, "replies": []}, {"body": "That shows that even if you have insider knowledge it can be hard to predict how markets will digest it.", "score": 3, "replies": []}, {"body": "Beating earnings doesn't seem like much of a predictor lately at least. I'm thinking this is going to be a recurring theme this earnings season. At least for tech and tech-adjacent stuff.", "score": 1, "replies": [{"body": "The important thing is the guidance was slight miss/lower. A lot of tech is humongously overbought based on infinite mega-growth and beating/meeting earnings isn't enough, it needs higher future guidance to keep on justifying the big buying spree.", "score": 1, "replies": []}, {"body": "AXP did pretty good today and they smoked earnings. It’s all about guidance and Netflix’s was tepid", "score": 1, "replies": []}]}, {"body": "I definitely bought the dip", "score": 1, "replies": []}]}, {"body": "Imagine how many it could add if its actual content was entertaining.", "score": 7, "replies": [{"body": "Thank you. Their stuff is trash. Mid tier at best.", "score": 3, "replies": []}, {"body": "Its funny cause thats how I describe mediocre movies/content now. If someone is like did you see that movie? “Yeah it was a standard netflix movie 6/10” even if Netflix didn’t make it", "score": 1, "replies": []}]}, {"body": "They didnt gain any “new” subscribers. They forced new accounts to be made when they restricted accounts to single locations.\n\nFind the linus tech tips video on how to spoof your ip and still use just one account. Or just stop using them.", "score": 4, "replies": []}, {"body": "Netflix is King Ballz", "score": 2, "replies": []}, {"body": "They lost users initially and are “gaining” from that low point. Not a net overall gain I suspect.", "score": 2, "replies": []}, {"body": "NFLX bans all passwords =  massive beat ![img](emote|t5_2th52|27189)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "Damn.. are you guys still watching netflix? I just quited when i saw dudes kissing eachother in the show that suppose to be a comedy show.", "score": -4, "replies": []}]}
{"title": "I think I am done", "selftext": "New to options this year and doubled when NVDA hit 960 on end of march ( I somehow managed to escape the rug pull early march) but didn’t take the profits like a regard and then down about 60k this week and have 25k left.  I don’t think I can make it back. ", "id": "1c8bj1p", "created_utc": 1713570039.0, "score": 38, "upvote_ratio": 0.82, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 23 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Good riddance, one less mouth for me to feed.", "score": 55, "replies": [{"body": "Lol", "score": 6, "replies": []}, {"body": "Lmao", "score": 3, "replies": []}, {"body": "😂", "score": 3, "replies": []}]}, {"body": "See you Monday bright and early!!!!", "score": 23, "replies": []}, {"body": "Yeah that’s rough, options do this to everybody at some point. Should never risk more than 10% of your account on options but I don’t even listen to my own advice which is why I blew up my account 3 times.\n\nOne thing is for sure, if you continue trying to make all that money back that you lost , your gonna go to 0 so think hard about if your gonna need 25k in your life soon , if you already have a big savings account, wish you the best in getting it back!", "score": 16, "replies": [{"body": "Thanks for your kind advice. Means a lot to me.", "score": 5, "replies": []}]}, {"body": "See you Monday ![img](emote|t5_2th52|4271)", "score": 11, "replies": []}, {"body": "your chart looks like sonic the hedgehog", "score": 6, "replies": []}, {"body": "Oh hush….many have done more with less lol.\n\nYou need to stop being a leader or trendsetter and start being a follower.\n\n3 great examples this week: ARM, NVDA, SMCI. All 3 had at least 1 bloody day (arm had 2-3!).\n\nWhen the sell off happens, stop taking a look at what the option was the day before. Yeah a 50,000% gain is SEXY AF, but you know what else is? Hopping in when it’s got this vortex of doom in the middle or first third, riding it down, setting a stop loss and seeing what happens.\n\nOn the flip side, look at MARA today or AXP. They jumped, kept moving up, don’t immediately think it’s gonna reverse and let it ride a little bit.\n\nPlenty of ways to make 20-100% in literally an hour.\n\nI missed out on this 3 times today. Wasn’t touching  ARM but planned entry around 9:45\n\n1) tried HOOD 17c 4/19, it was $0.09 and volume wasn’t large enough for me so I waffled and….like 30 minutes later it was $0.25+. Easy double+\n\n2) pissed I didn’t get those HOODy calls, I moved to QQQ. This was a lucky play because I grabbed $442c 4/19 and sold almost at the peak. 7 minutes later 23% gain.\n\n3) saw SMCI and had a bid or two on puts between 830-850 but spread was big. Fuck I wish they filled so that’s a miss\n\n4) SPY reversals are almost guaranteed between 12:40 and 1:15 start. I missed the 12:40 and was miffed it fell that much in the AM but targeted $498c 4/19. Told myself I got lucky on #2 don’t press it and boom within 45 minutes this was up like 150%.\n\nAm I bummed I missed out on 1 3 and 4? Yeah you bet my account would’ve been bussing today!\n\nBut I got #2, yeah I made money on QQQ calls today of all days. So I count it as a W. \n\nMoral of the story is this market is fucked up. And since you’re playing options time in the market is just as important as timing the market. I don’t think it’s wise to hold contracts for very long due to volatility, could help you but also could totally F you sideways. \n\nTo give yourself some confidence, look to play options in the coming week with one of 2 approaches: contacts expiring no sooner than 5/3 or contract entry exit occurring within the same day. The benefit of the “longer” options is you can fuck up and not lose it all. Target close to ATM and get your 20% gains, get some momentum, get some confidence, but also know when you aren’t feeling confident and TAKE A BREAK. I hit my PDT limit and just bought some boring stuff, actual stocks, just so I wouldn’t end up holding contracts over the weekend cuz Lordy only knows what’ll happen the next few days.\n\nBest of luck bruv", "score": 7, "replies": [{"body": "Thanks for your kind advice. Means a lot to me. I believe one mistake I have during this ride is try to being a leading or try to double down when tread is against me and hope it will reverse soon. And of course No stop loss and no profit taking rule.", "score": 3, "replies": []}, {"body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}, {"body": "Started from the bottom now I’m still here", "score": 3, "replies": []}, {"body": " Come over to the light side - reasonable investing", "score": 3, "replies": []}, {"body": "Pretty sure that's fidelity. Expect them to send you a letter about risk taking lol", "score": 3, "replies": []}, {"body": "META earnings is Wednesday after market close. It is your chance for redemption. Buy equal calls and puts. It’ll move big one way or the other.", "score": 3, "replies": []}, {"body": "See you Tuesday! Get some rest on Monday. ", "score": 2, "replies": []}, {"body": "Market so unpredictable.  War + AI + election/inflation.  Only looking for cheap stockies", "score": 2, "replies": []}, {"body": "We should tax unrealized gains 😅", "score": 1, "replies": []}, {"body": "You’ll leave at $0", "score": 1, "replies": [{"body": "Hope not too soon![img](emote|t5_2th52|4260)", "score": 1, "replies": []}]}, {"body": "Lol @ early march being a rug pull.", "score": 1, "replies": []}, {"body": "Come on just one more 0DTE", "score": 1, "replies": []}, {"body": "See you Monday bruh ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "When I read these posts, I wonder. Are these the numbnuts who have been injecting cash into the market to keep it rocking?  Surely there are not enough of them.", "score": 1, "replies": []}, {"body": "Wrong, you still got 40k of margin buying power", "score": 1, "replies": [{"body": "Yes I do but I can lose them easily in one day ![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4260)", "score": 1, "replies": []}]}]}
