{"title": "Tesla Robotaxi is HERE... huge opportunity ahead?", "selftext": "[removed]", "id": "1bxclxj", "created_utc": 1712412931.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 21, "comments": [{"body": "You picked a tough time to initiate coverage of Tesla. :(", "score": 12, "replies": []}, {"body": "It isn't here.", "score": 22, "replies": []}, {"body": "A beta ride sharing app integrated into the Tesla app available to all Tesla owners & a concept unveiling of the new platform is my expectation.\n\nTesla owners can supervise FSD while earning riseshare $ as they transition to a full robot taxi setup in the years to come.", "score": 6, "replies": [{"body": "So people can chose to be cab drivers 😂! Big news!", "score": 4, "replies": [{"body": "Yes it is. It shows a huge step. \n\nIt’s not immediately game changing that day but it means a lot. \n\nThat’s like downplaying steer by wire or higher voltage architectures by simply saying “they removed 5 pounds from the car, big news”.", "score": 1, "replies": [{"body": "People are already cab drivers. This is only cool No humans are needed. And that scenario is 20-30 years away.", "score": 2, "replies": []}]}]}, {"body": "I think a rental option would be better.  Then turn the rental fleet into a taxi fleet over time.  I find that I rent cars much more frequently than I take a rideshare and there’s near zero government approval needed to offer car rentals.\n\nSeems like being able to offer both benefits many more.", "score": 1, "replies": []}]}, {"body": "Someone dressing in Robotaxi costume maybe", "score": 0, "replies": [{"body": "That would be hilarious.", "score": 3, "replies": []}]}, {"body": "Nothing is here. Why are people raging? All we have is a tweet from a known grifter 🤡", "score": 1, "replies": [{"body": "if you put people in a line from 'people who are more a grifter' to 'people who are less a grifter'\n\nI think the dude that started the first new major auto company in the US in 100 yrs that caused the #1 selling car on Earth to be an EV, and also made the space rocket company that sends more than half of all payload to space is probably in the 98-99th percentile 'not a grifter'\n\nI'm not sure you could mis allocate your thoughts and energy more if you tried.", "score": 3, "replies": []}]}, {"body": "It’s not here at all. It’s not going live 8/8 lol\n\nIt’s literally just another marketing gimmick reveal for the stock pump that’s show casing something coming later in life who knows when.\n\nRobotaxis are not ready at all. You are a naive blind investor if you think Tesla is confidently ready to solely take responsibility of any damages/accidents that occur from a robotaxi that has no human driver behind the wheel. Lvl 5 is not happening anytime soon. That’s what’s needed for an actual robo taxi launch", "score": -11, "replies": [{"body": "Where did he say it’s going live? Some people are just too full of hate", "score": 9, "replies": []}, {"body": "He's unveiling the concept/prototype, not launching a fully ready robotaxi on 8/8", "score": 10, "replies": [{"body": "Ah so like the roadster, pump up the stock by unveiling a prototype and doing nothing with it for years? Amazing.", "score": -7, "replies": [{"body": "or like model Y which became the best selling vehicle in the world.", "score": 8, "replies": [{"body": "The model Y was an obvious easy bet because the whole industry had already proven SUVs sell very well, this is not the same as a robotaxi prototype, not even comparable.", "score": -4, "replies": [{"body": "Oh, so more like the Model S or 3. That makes sense.", "score": 7, "replies": []}]}]}]}, {"body": "Let’s hope he doesn’t throw a baseball at the taxis window then.", "score": -8, "replies": [{"body": "Metal ball", "score": 2, "replies": []}]}]}, {"body": "Reminds me of the article I read from an AI “expert” one month before the release of ChatGPT saying that AI progress had stalled and we can’t expect any useful applications of AI for another 2 decades.", "score": 2, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1bwye1b", "created_utc": 1712364614.0, "score": 32, "upvote_ratio": 0.78, "num_comments": 27, "comments": [{"body": "Insiders like to *vest their restricted stock units*", "score": 77, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 8, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 3, "replies": []}]}]}]}, {"body": "Options baby. Money is money", "score": 3, "replies": []}]}, {"body": "Pretty sure uncle scam ain't gonna let em fail", "score": 36, "replies": []}, {"body": "How do I see this trading trends page in our regarded app?", "score": 10, "replies": [{"body": "This might be trading level 2 data. I don’t have it but, Robinhood gold maybe?", "score": 6, "replies": []}, {"body": "Also curious.", "score": 6, "replies": []}, {"body": "+1", "score": 1, "replies": []}, {"body": "Scroll down in that stonk ticker page, it’s right behind the news section, it normally displays data from the app itself by default, but you can cycle through insider and hedge fund activity as well, hit the expand arrow and you get lost of the actual insider/fund that made the trade. I don’t have level 2 nor gold, it was just there one day\n\nEdit: ETFs doesn’t have the trends section tho", "score": 1, "replies": []}]}, {"body": "I think this is good enough DD for me to get into long call spreads for earnings... ![img](emote|t5_2th52|29637)", "score": 8, "replies": []}, {"body": "Too big to fail, probably a good buy. Air travel is probably going to get more interesting though.", "score": 7, "replies": []}, {"body": "Insiders liked Enron", "score": 11, "replies": []}, {"body": "The insiders on the planes sure don't like Boeing.", "score": 3, "replies": []}, {"body": "I held a call and was down 50% there’s really no support right now and when you think the worst is behind it kept coming. I’ll wait till it hits 180 or 170s again then going long.", "score": 3, "replies": []}, {"body": "BA under 200 is ez money", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 62 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 2, "replies": []}, {"body": "Insiders also Put long hits out on whistleblowers & Call short their life expectancy rates", "score": 2, "replies": []}, {"body": "Accumulation of grant or award", "score": 1, "replies": []}, {"body": "If you believe they will outperform  the market for any given time, then go for it. Puts for me though. Change my mind", "score": 1, "replies": []}, {"body": "its one year’s dip?", "score": 1, "replies": []}, {"body": "Boeing is a company I would not consider investing into", "score": 1, "replies": []}, {"body": "No, no one likes boeing", "score": -2, "replies": [{"body": "Funeral homes sure do.", "score": 10, "replies": []}]}, {"body": "https://preview.redd.it/zxuw03gietsc1.jpeg?width=1290&format=pjpg&auto=webp&s=e6e275b1313bb8e7737d947cba18cedc3f01ac37", "score": 0, "replies": []}]}
{"title": "RH and BLK and coming earnings and why I shorted RH ?! What about BLK?", "selftext": "Let's see if I can summarize this here. I have been short on RH for some time now. Before making my conclusions, I examined the following data. First off, I want to say that my research led me to believe that the product's quality is not that great. I live in NYC, and RH has an outlet here in Industry City, which is in Sunset Park, Brooklyn. Their prices are overextended, which I attribute to RH's thorough research. They know that the average household income of families residing in the surrounding areas exceeds $250k per year. I am pretty sure their outlets are in similar locations for the exact same reason: it's a simple profit/loss ratio, and RH knows that the higher profit margin will offset the higher average carrying expenses. So, why would I short the stock and bet against RH? My first reason was the low home sales. Interest rates have risen quite a bit; a 30-year fixed rate is above 7%, and most homebuyers would try to maximize their savings by purchasing furniture from one of RH's competitors. RH supposedly manufactures their furniture pieces in China. Full disclosure, I have no idea where exactly it is made, but a simple Google search will tell you that. Follow this link for more information: \\[link to furniture manufacturing details\\].\n\nHave consumers been complaining about the product or the quality of the product? You can read the reviews for yourself here: \\[link to consumer reviews\\].\n\nNow, my reasoning was that since home sales have been down, and the quality of the furniture is not pleasing to the average consumer, and in general, people are not furnishing their new houses, RH would likely miss their analysts' earnings call and underperform. Well, this is exactly what happened. The adjusted net revenue of $738 million missed the consensus mark of $777 million by 5% and fell by 4.4% on a year-over-year basis. The revenue decline was attributed to \"several weather\" events in January and shipping delays related to the ongoing conflict in the Red Sea. RH missed Q4 earnings and revenue estimates. RH reported quarterly earnings of $0.71 per share, missing the estimated earnings of $1.71 per share.\n\nLogically, one would expect that the price per share of the stock would drop accordingly to account for the revenue loss. However, we witnessed the opposite; the price per share went up by almost 18% after the earnings announcement.\n\nLet's not forget that the short interest before the earnings call was more than 51%.\n\nAccording to the data and common sense consensus, everyone should have expected that since RH did not meet expectations, the price per share would come down to adjust the value based on performance. This did not happen. On the contrary, the price went up, and shorts got squeezed.\n\nCould this be manipulation? No way, this is a fair commodity, a self-regulated market, and manipulations are not possible.\n\nNow, let's talk about the biggest institutional investors behind RH. It turns out that the largest shareholders include Vanguard Group and BlackRock Inc.\n\nI am trying to find any correlation between the price movement of RH's stock and BLK's, but my indicators are not refined enough to discover the precise connection, and I would leave this to the readers.\n\nAnyway, why am I talking about RH and a potential connection with market movement and the price of BLK's stock? Well, BLK is set to announce earnings this coming Friday, April 12th.\n\nSo, some scenarios could possibly aid the retail investor's decision. How overstretched are the big funds, and could they go down because their investment assets have come down in price? Let's not forget LULU... What are your bets? Are you playing calls or puts on BLK?\n\nA $10 TRILLION ASSET UNDER MANAGEMENT COMPANY. Can Goliath lose against David?\n\n", "id": "1bwzo8y", "created_utc": 1712368346.0, "score": 12, "upvote_ratio": 0.7, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 26 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "You know the WSB rule.\n\nDo your research, gather and analyze all the data. Convince yourself that the move you're about to make is absolutely the right one. \n\nThen as soon as you're about to do it, instead do the complete opposite.", "score": 24, "replies": [{"body": "Or just don’t analyze at all. I bought citi puts because they’ve been giving loans to degens on here to gamble with", "score": 7, "replies": []}]}, {"body": "This doesn't look like good DD to me.\n\n^I ^am ^an ^LLM-powered ^bot. ^Please ^contact ^the ^moderators ^with ^concerns.", "score": 13, "replies": [{"body": "Based", "score": 1, "replies": []}, {"body": "Love the flair", "score": 1, "replies": []}]}, {"body": "Bullish on BLK. Expecting positive surprise from all this Bitcoin business. Assume there was lot unexpected and hidden earnings.", "score": 6, "replies": []}, {"body": "> I am trying to find any correlation between the price movement of RH's stock and BLK's, but my indicators are not refined enough to discover the precise connection, and I would leave this to the readers.\n\nWelp, here it is. The single stupidest thing I’ve seen in the sub all year. You deserve an award. And the award should be shaped like a helmet.", "score": 9, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Buddy, I did not get my helmet 🪖 but check BLK would you? If you were to make the right connections when I posted this , and if you shorted BLK, you might have made a chunk of change .", "score": 1, "replies": []}]}]}, {"body": "I'd short someone like BAM maybe BX if you really bearish on assets managers.  BLK is definitely not under any strain.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Blackrock is a buy", "score": 1, "replies": []}]}, {"body": "The 51% short interest is the causation", "score": 1, "replies": []}, {"body": "What are you RH posiitons", "score": 1, "replies": []}, {"body": "RH missed on the quarter but upped their guidance as they expect a better full year so the stock moved up based on the long term view. I have RH furniture and I talk to the sales reps all the time.  Their turn around times are still long on many products which at least shows healthy supply chain management and the reps don’t seem very bothered by sales pace in my area.  I’m not sure how much more room it will have to run, but it’s interesting how well they do with like 0 marketing.\n\nBLK has been reorganizing, cutting costs, and the market has been doing well so their overall AUM numbers will be pumped so long as there was no major redemptions.\n\nBLK and Vanguard have many index based and sector based funds, so high ownership in something like RH makes sense and they tend to be buy and hold. So a price increase or decrease is coming front retail and active investors - not them.\n\nRH i’d straddle on since I don’t know how much better guidance can get on the top end. Wayfair just got pumped but that’s cheap furniture.\n\nBLK I’d buy calls but deeper ITM as I would expect a pop but I don’t think it’ll be that great.\n\nIf you want a financial company, the best play would be JPM right now.", "score": 1, "replies": []}, {"body": "“Short on RH” positions or ban nerd", "score": 1, "replies": []}, {"body": "This is totally nonsensical.  Somehow BLK is going down because of RH? wtf?", "score": 1, "replies": []}, {"body": "Anyone else click this post bc you thought he was shorting robinhood? No? Just me? Oh.", "score": 1, "replies": []}, {"body": "RH going to moon", "score": 1, "replies": []}, {"body": "My parents just retired and bought a second home and my mom filled the whole thing with RH. Just one data point but there aren’t a whole lot of options between IKEA and super high end. I used to own Steelcase and MillerKnoll, made money on both. Furniture is cyclical tho", "score": 0, "replies": []}, {"body": "I have calls on $BLK. Fml", "score": 0, "replies": []}]}
{"title": "NVIDIA Chief Cloud Arch Speaks at UPENN", "selftext": "THIS IS YOUR SIGN TO BUY \nBojan Vukojevic, Nvidias Cloud Arch speaks at TedxPenn.", "id": "1bxj26k", "created_utc": 1712429480.0, "score": 125, "upvote_ratio": 0.85, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 20 | **Previous Best DD** | \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Nvidia has thousands of cloud architects", "score": 47, "replies": [{"body": "Unless they are very tiny I only see one...", "score": 17, "replies": [{"body": "Yes they are micro cloud architects", "score": 7, "replies": []}, {"body": "That man is made of Nano-Techs, thousands of them to make one Mega-Tech", "score": 5, "replies": []}]}, {"body": "So puts on Dell and HPE? Servers and shit is their whole think. That's why I holding calls", "score": 0, "replies": []}]}, {"body": "Everybody who can understand these speeches already knows it’s a good stock, we have to get normal people to understand why every military on the planet wants NVDA", "score": 23, "replies": [{"body": "Everyone apart from China", "score": 5, "replies": [{"body": "https://preview.redd.it/3xui0qobj0tc1.jpeg?width=1125&format=pjpg&auto=webp&s=2a3dddffe06f4138993b093a90604e9a29d2cf51\n\n![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)", "score": 6, "replies": [{"body": "Hehe, guess I am not bullish enough", "score": 2, "replies": [{"body": "If your military doesn't want Nvidia Chips, fire you head of Defense!", "score": 2, "replies": []}]}]}]}]}, {"body": "Crypto Mining is basically a Decentralized Super Computer..... Imagine if the US or China designed a crypto blockchain that allowed them to select targets or files to break encryptions. The rewards are paid out when the encryption is broken. OR what if it was for running massive simulations of gigantic proportions. I think this is possible today for a government to orchestrate", "score": 10, "replies": [{"body": "That’s kind of already been done. First you get it implicitly with ECC as every bitcoin is secured by it. So an adversary has incentive to try and break ECC and sha256 on the largest addresses. That hasn’t been successful. There are other bounties like sha1 and sha256 out there if you solve a collision in sha1 you get the bitcoins that are secured by that script. I think there is one for sha 256 that hasn’t been broken yet. I think the sha1 puzzle was solved a while ago.", "score": 1, "replies": []}]}, {"body": "Wait until they hear about cloudflares inference offerings", "score": 3, "replies": []}, {"body": "How about you post the Ted talk?", "score": 3, "replies": []}, {"body": "NVDA POST EARNING CALLS GONNA PRINT 🚀🚀🚀", "score": 2, "replies": []}, {"body": "Serverless computing = cloud.\n\nGenerative AI = generated images, videos, etc from a prompt. Learns patterns and characteristics of things.", "score": 3, "replies": [{"body": "Cloud is not synonymous with serverless computing", "score": 2, "replies": [{"body": "How so?", "score": 1, "replies": [{"body": "Serverless means that the servers are allocated by the cloud provider when a request is received. This means the customer is charged only when your application is actually processing requests. Not every application in the cloud is serverless. In fact, most aren't. Most applications are designed to have servers running constantly waiting for requests. Both of these types of applications are \"cloud\".", "score": 1, "replies": []}]}]}]}, {"body": "Ai", "score": 0, "replies": []}, {"body": "Looks like he gets 0 pussy", "score": -1, "replies": [{"body": "id bet my life he has had more sexual interactions with women then you and more money.", "score": 8, "replies": []}]}]}
