{"title": "The guy that said we weren't in a housing bubble in 2008 says we are in a bond bubble now.", "selftext": "", "id": "6qwfkr", "created_utc": 1501596351.0, "score": 192, "upvote_ratio": 0.95, "num_comments": 89, "comments": [{"body": "Greenspan obviously inverses whatever he says publicly.", "score": 83, "replies": []}, {"body": "Greenspan better fucking hope the USA isn't in a treasury debt bubble.\n\nThat said, [there is a scenario](https://mises.org/library/zimbabwe-best-performing-stock-market-2007) by which all the US stock markets (hell, all the stock markets in developed countries) are massively undervalued (and before anyone bitches and moans about the source, just know that it pains me to link to that source).\n\ngoogle \"Treasury Crazy Drawer\"", "score": 37, "replies": [{"body": "at work, can you give a TLDR/ELI5 please?", "score": 14, "replies": [{"body": "At the on-set of the sub-prime/global financial crisis, the Treasury bond auctions started to fail.  The FedResInk stepped in to do two things:\n\n1 - sequester shill mortgage debt by throwing in under a TARP (the primary and only function of a central bank is to keep debt that it has created intact... that \"dual mandate\" bullshit is just propaganda economists like to tell themselves before they go to sleep each night)\n\nand...\n\n2 - reassure the world that the USA was good for their sovereign debt through the \"open market action\" of buying up all unpurchased treasury debt, allowing the USA's bond auctions to proceed as usual.\n\nAt some point during the eight years after the initial treasury bond auctions failures, the FedResInk stopped having to increase its balance sheet liability by purchasing treasury debt and was able to keep the bond auctions stabilized by rolling existing debt over, which also provided them with the opportunity to dispose of high interest debt and \"twist\" the interest rate down indefinitely to keep the \"bond vigilantes\" at bay while simultaneously providing a mechanism by which Keynesian stimulus of the economy could be exercised.  All during this time, the USA kept raising its debt ceiling and minted more and more debt while revenues fell... because... you know... it could.\n\nNow, as we enter into the end of this particular debt super cycle, there's some question about what happens next.  Two things are certain:\n\n1 - the stock market is over valued via QE inflation and ZIRP.  Here, it's important to understand that the mechanism by which the FedResInk modulates the economy is via interest rates.  Overheated stock market?  Raise interest rates.\n\nHowever....\n\n2 - bonds currently held represent a huge liability (and here, it's important to understand that low(er) interest rate bonds trade at a loss when interest rates go up... effectively a negative interest rate because we're at the \"lower bound\", also known as \"out of ammunition\" or \"pushing a string\")\n\nSo, what we get is a bifurcation where one of two things becomes inevitable:\n\n1 - interest rates are held low forever and the the equity markets are allowed to do what equity markets do (AKA The Japanization Of The American Economy).  Actually what happens is the central bank starts participating directly in the equity markets... nobody is really sure if this has happened yet at the FedResInk, but it has been the de facto outcome due to ZIRP (the FedResInk is inexecrable tied to the equity markets, vis-a-vis \"taper tantrums\" when it tries to adjust policy)\n\nOr...\n\n2 - The debt super cycle is allowed to continue to its logical conclusion, which would involve both the bond market and the stock marking imploding... USA sovereign bond auction failures... an inability to pay anything other than interest on debt already owed... and eventually loss of sovereign bond principal (and, just like Japan, the primary holder of those bonds are Americans via social security which is stuffed to the gills with government debt IOUs).  This culminates with either interest rates required for US debt in the double digits (as happened with Volcker in the 1980s) or the US losing its petrodollar status, at which point the US economy will sink to third or fourth behind China, the EU, and a few other counties... but more than likely one followed by the other in fairly short order.\n\nSeptember is the date the FedResInk has given for the cessation of Treasury debt rollover.  October, the debt ceiling goat rope gets underway in earnest (here its important to know that the sitting POTUS usually get all up in the FedResInk's face to make an increase happen... Treasury is already rifling though their \"crazy drawer\" (their words, not mine... mostly just prioritized payments and a government shutdown) in preperation for this part of the Kabuki.  Some time in 2018, the residential mortgage GSE under writers will need a second bailout.  Treasury's net worth sweeps of these GSEs will cease and ACA will likely implode, taking insurance industry monthly premium float with it.  Real estate will grind to a halt because nobody will underwrite mortgages, a function that is absolutely required to provide liquidity / a callable mortgage.  All of this could precipitate outcome #2 despite all the efforts of the various institutions that exist to make outcome #1 reality. ", "score": 48, "replies": [{"body": "So if 1 buy if 2 cry?", "score": 12, "replies": [{"body": "Technically, if the USA experiences a sustained sovereign default, you'll want to have your \"money\" in the stock market (that's the Zimbabwe lesson).\n\nIf you look at what happens to stock markets once the central bank starts participating in them wholesale, it's pretty lackluster.", "score": 15, "replies": [{"body": "So the part here I am not quite getting is the \"however 2\" it makes sense that low interest rate bonds trade at a loss when compared to high interest rate version of the same bond...fair enough. But the government bought up all of those low yield bonds under TARP, I think this is what you said. So if the US gov is both the bond printer and bond holder how are the bonds the fed bought liabilities? Wouldn't they just zero themselves out on the balance sheet? ", "score": 5, "replies": [{"body": "In terms of accounting, the bonds are assets for the Fed reserve.\n\nHowever, since bond values fall when interest rates rise, the fed will be holding an asset akin to MU when they allow rates to rise and that will result in trillions of dollars in losses for them.  Thus, the bonds are liabilities as an investment (like holding MU) even though they are assets (like holding MU).", "score": 11, "replies": [{"body": "I hate that you're right about MU. I'm averaging down again today", "score": 3, "replies": []}, {"body": "Ya, but the fed is both the debtor and the financier on those bonds so to my untrained mind that seems like a wash. ", "score": 1, "replies": [{"body": "No, the Treasury writes the bonds and the Fed buys them.", "score": 2, "replies": [{"body": "So the treasury owes the fed?", "score": 1, "replies": [{"body": "[Yes](https://en.wikipedia.org/wiki/United_States_Treasury_security#Domestic).  But the Fed doesn't profit from the interest, they hand it back to the Treasury after expenses.", "score": 1, "replies": [{"body": "**United States Treasury security: Domestic**\n\nFor the quantitative easing policy, the Federal Reserve holdings of U.S. Treasuries increased from $750 billion in 2007 to over $1. 7 trillion as of end-March 2013. On September 13, 2012, in an 11-to-1 vote, the Federal Reserve announced they were also buying $45 billion in long-term Treasuries each month on top of the $40 billion a month in mortgage-backed securities. The program is called QE3 because it is the Fed's third try at quantitative easing.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/wallstreetbets/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.24", "score": 1, "replies": []}, {"body": "So to my untrained mind this seems simple enough if the treasury and the fed can agree that all those bonds the fed holds are square.", "score": 1, "replies": [{"body": "Well, not until maturity.  Before then, the Fed can sell them back on the open market if they want to.", "score": 1, "replies": [{"body": "Okay, so what would be the problem if the fed just sat on them and when the matured called the treasury and said \"You're good\"", "score": 1, "replies": [{"body": "There wouldn't really be a problem, but as the Fed currently wants to raise rates they'd rather sell them to increase yields.  They've even [stated](https://www.cnbc.com/2017/04/05/fed-set-to-unwind-balance-sheet-this-year.html) their intention to do this \"relatively soon.\"", "score": 1, "replies": []}, {"body": "That's basically what's happening via rollover cessation.\n\nIt's just that they've got about two trillion dollars worth of rollover to burn through.\n\nThe bigger question that you're missing is:  what happens to the other buyers of treasuries when they discover the Fed is handing bonds back at a loss?\n\nThe Fed's credibility with respect to being able to control short term interest rates is heavily dependent on both treasury auctions not failing and interests outside of the Fed. not being able to dictate what interest the Treasury has to offer in order to get its debt sold.", "score": 1, "replies": [{"body": "I just don't even understand how that's a question since we are really talking about a government paying itself. If I borrowed 100$ from you and wrote an IOU and then gave you 100$ for the IOU I would never really consider giving myself 100$ for the IOU because that just sounds absurd.", "score": 1, "replies": [{"body": "> since we are really talking about a government paying itself.\n\n...because the rate at which the government pays itself impacts external parties that also buy treasuries, which determines the Fed's ability to set short term interest rates. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "If 1 buy now, if 2 save save save to buy everything in sight. ", "score": 1, "replies": []}]}, {"body": "Great read, thank you.  \n\nRegarding the petro dollar, aren't the Saudis locked into us tbills too? They would need to hedge that money elsewhere before abandoning that standard, right?\n\nAren't russia and China both pushing for their own state backed crypto currencies to dethrone the USD? Is the US doing the same: would/Could it help stabilize our place in the world economy? I fear if the petro dollar is abandoned we are screwed...", "score": 3, "replies": [{"body": "China was recently successful in getting the yuan added to the IMF basket currency-like ADRs. Many see this as a precursor to them outright challenging the US dollar as sole reserve currency status but who does that benefit truly? Until China becomes economically self-sufficient on their burgeoning middle class, they still need ex-China consumerism and much of that is the US consumer. Its a delicate dance that one day will fade but the demise of the petrodollar has been 'called' before many times", "score": 4, "replies": []}]}, {"body": "Honestly I think you're overstating it.  Even if the treasury stops rolling over their purchases, all that will do is cause bond prices to rise.  Yes the fed could be sitting on a 3 trillion dollar loss on their current portfolio of securities but they paid for those securities with money that was printed out of thin air anyway.  Yes the stock market will tank next year but the economy can survive that.  Eventually the debt supercycle will come to an end but I think we have another inning before that happens.", "score": 1, "replies": []}, {"body": "Great summary", "score": 1, "replies": []}, {"body": "Isn't this very similar to the Austrian point of view", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "http://www.investopedia.com/articles/economics/08/monetary-policy-recession.asp\n\nRead the part about Other Money Operations.\n", "score": 1, "replies": []}]}]}, {"body": "TLDR: Buy.", "score": 11, "replies": [{"body": "Dow 40K by 2024 \n\nsave this comment. ", "score": 11, "replies": [{"body": "RemindMe! 1 Aug 2024", "score": 5, "replies": []}, {"body": "RemindMe! 1 Aug 2024", "score": 2, "replies": []}, {"body": "RemindMe! 1 Aug 2024", "score": 2, "replies": [{"body": "I also set a reminder like you and couldn't remember what the reminder was about. That dumbass was right Dow 40K by 2024 7 years ago and his account is banned now. LOL.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Kill yourself, this my town, fucktardbot /u/RemindMeBot. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 20, "replies": [{"body": "Hey that wasn't nice", "score": 2, "replies": []}]}]}]}, {"body": "RemindMe! 1 Aug 2024 \"Do I own a Tesla now?\"\n\n", "score": 1, "replies": [{"body": "Well do you?", "score": 1, "replies": [{"body": "Yes actually. LOL. I was really confused by the reminder.", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 1 Aug 2024", "score": 1, "replies": [{"body": "I also set a reminder like you and couldn't remember what the reminder was about. That dumbass was right Dow 40K by 2024 7 years ago and his account is banned now. LOL.", "score": 1, "replies": [{"body": "Wauw", "score": 1, "replies": []}]}]}, {"body": "Damn", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 Aug 2024", "score": 1, "replies": []}]}, {"body": "Research is meant for gays. Just keep doubling down on options. ", "score": 2, "replies": [{"body": "You're right, thanks. ", "score": 1, "replies": []}]}]}, {"body": "Dang that is an awesome article.  It basically proves one of the tenets of Austrian monetary theory in the most undeniable and stark way.", "score": 2, "replies": []}, {"body": "This post should be titled \"guy that says we weren't in housing bubble in 2008 ~~days~~ says we aren't in stock bubble today\".\n\nSide note, why does Bernanke catch hands? The economy was far too gone when he took over.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "I'd say he is the one who came up with QE in the first place and is the main reason it had to happen. If he hadn't bailed out LTCM in the 90's I think big banks would have gotten the message that they are the ones that face responsibility for their shady deals and mismanagement. ", "score": 7, "replies": []}]}, {"body": "Wasn't our housing bubble more of a 'rampant hidden malfeasance bubble'? ", "score": 13, "replies": [{"body": "Yes it was!", "score": 5, "replies": []}]}, {"body": "Did this guy miss all of 2016 Oct? I don't think Bonds could be in any more of a bubble after last year. Do I need to link a chart? Yields on intermediates are like 2.52-2.7 when interest bearing accounts are at 1 to 1.2 percent how is there a fucking bubble?", "score": 8, "replies": []}, {"body": "yeah fuck off greenspan", "score": 5, "replies": []}, {"body": "It wasn't really a housing bubble, it was a mortgage securities (or debt instrument) bubble.\n\nBut that's splitting hairs anyway, and I do think treasuries are inflated because we're transitioning to a weak-dollar economy. I think Greenspan is right to worry about inflation during the process. I don't think he's the only one worried either.  ", "score": 6, "replies": [{"body": "Inflation is good for debt-cucks", "score": 3, "replies": []}, {"body": "How does one hedge against this long term? Invest heavily in EU/Chinese stock as those will go up in comparison to things valued in USD?", "score": 1, "replies": [{"body": "Foreign currency and domestic commodities usually. You can also use inverse instruments like ETFs. There are plenty of ways to ride out inflation but in general you reduce liquidity and invest in real goods or other currencies/markets that aren't inflating. ", "score": 4, "replies": []}, {"body": "buy yacht - safe from starving hordes", "score": 3, "replies": [{"body": "But what is the appreciation rate of yachts vs inflation if we have stagflation? Seems like you'd want to buy the yacht dip once no one can finance one.", "score": 1, "replies": []}]}, {"body": "Gold and silver mostly. Yes you can invest in foreign markets and see some great growth in the mean time. But if things crash hard like in '08 the US will bring all that down with it, just slightly less so than stateside. Metals you get an alternate store of value for your dollars in the mean time, and when recession hits it skyrockets. I keep about 1/3 of my free non-trading cash in gold and silver. ", "score": 1, "replies": []}]}]}, {"body": "Lol wut? Who are these silly goyim that trust this beak-nosed Jew? I wouldn't even trust him with my dreidel.", "score": 15, "replies": [{"body": "Jesus, MacDermott, what does that have to do with anything?", "score": 3, "replies": [{"body": "History isn't relevant to you?", "score": 1, "replies": [{"body": "It was an American Psycho reference", "score": 1, "replies": []}]}]}]}, {"body": "How does this guy still have a job? 😂😂😂", "score": 3, "replies": [{"body": "He doesn't ", "score": 3, "replies": []}]}, {"body": "You can't really take anything from this. If what he says is nonsense, inversing isn't going to be reliable.", "score": 2, "replies": []}, {"body": "I've bought puts on bond ETFs and got crushed. I had the same sentiment that they are overpriced, but the market pushed the prices higher still.", "score": 3, "replies": [{"body": "No clue why anyone would buy calls/puts on bonds.", "score": 8, "replies": [{"body": "I formerly worked at a bond pricing financial services company. I actively worked on bond indices and am not your average investor ", "score": 13, "replies": [{"body": "His comment history checks out too. We can safely assume that this man is not your average bear.", "score": 9, "replies": []}, {"body": "I was not aware I am just talking about your average investor.", "score": 2, "replies": []}]}, {"body": "<-- Noob investor alert", "score": 2, "replies": [{"body": "Present", "score": 2, "replies": []}]}]}, {"body": "This is because the market can remain irrational longer than you or anyone can remain solvent.", "score": 3, "replies": []}, {"body": "When did you do that though?", "score": 1, "replies": [{"body": "Buy puts or work for bond pricing service?\n\nBought puts last month\nWorked there last year", "score": 1, "replies": []}]}]}, {"body": "I was wrong once so now I'm wrong every time.", "score": 2, "replies": [{"body": "Yes, but when you are wrong and the whole global economy almost collapses. It's a little different.", "score": 8, "replies": []}, {"body": "You are on WSB. That means you are wrong by default.", "score": 6, "replies": []}]}, {"body": "Someone's scared of record highs everyday. ", "score": 1, "replies": []}, {"body": "What the fuck is a bond? Does it have leveraged options?", "score": 1, "replies": [{"body": "He is a spy.", "score": 2, "replies": []}]}, {"body": "I wonder how many fetuses that guy consumes a day to still be alive.  ", "score": 1, "replies": []}]}
