{"title": "What leaps are you all looking to buy in the next correction?", "selftext": "Hey everyone I’m wondering what are some good leaps to purchase the next time there is a big market sell off. I feel like the obvious ones would be AAPL, SPY, QQQ, MSFT. But I’m also wondering what about leveraged ETFs such as TQQQ, or SPXL. What are some cons to purchasing TQQQ leaps at .85 delta and 1+ years out. My plan would be to run the PMCC and sell far OTM weekly calls for a little bit of cash while the leap gains in value. Any advice is welcomed. Thanks!", "id": "p7n8vh", "created_utc": 1629405851.0, "score": 74, "upvote_ratio": 0.96, "num_comments": 81, "comments": [{"body": "LEAPS can give you leverage.\n\nLevered ETFs can give you leverage. \n\nPick one.", "score": 47, "replies": [{"body": "Leaps on levered ETF’s using a HELOC. LOC funded the downpayment on the home.", "score": 74, "replies": [{"body": "Yo dawg, I heard you like leverage…", "score": 7, "replies": []}, {"body": "Hey. I’m kinda dumb. What is a HELOC?", "score": 9, "replies": [{"body": "Home equity line of credit. \n\nLoan from a bank that is borrowed based on your equity in your home", "score": 15, "replies": []}]}, {"body": "What’s wrong with my strategy? I was trading last Monday and did well", "score": 4, "replies": []}, {"body": "This guy levers", "score": 2, "replies": []}, {"body": "only way to play", "score": 0, "replies": []}, {"body": "this is the best comment i've ever read", "score": 0, "replies": []}, {"body": "All-in with the bank all-in as well!", "score": 1, "replies": []}]}, {"body": "Leaps on Leveraged ETFs is the correct answer.  Oppps, this is not WSB", "score": 4, "replies": []}, {"body": "Leaps perform much better than levered ETFs I believe because leaps don't reset daily.  Run a backrest on spy vs sso to see what I mean.", "score": 3, "replies": []}, {"body": "This is an interesting comment. I think I need to be smarter?", "score": 2, "replies": []}, {"body": "Pls elaborate for a dumb-dumb? LEAP in itself is a levered position or it somehow allows for additional leverage to be used in the overall portfolio?", "score": 2, "replies": [{"body": "To explain with some current numbers, if you were to buy an AAPL leap with a 145 strike for 2,450 dollars that expires that expires on sept 15 2023 (these are numbers currently in aftermarket) you would have exposure to the upside of 100 shares at the same price you could buy (just under) 17 shares. \n\nYou gain access to considerably more upside should it continue to move upwards, at 170 you breakeven and and then for every dollar the stock moves up after that gain a little over 5x what you would have with shares. \n\nOf course the risk is that it trades sideways, or only slightly up and it doesn’t raise enough to pay the premium you paid for the option initially.", "score": 16, "replies": []}, {"body": "LEAPS are levered in themselves. Compare the debit paid to the equivalent in shares.", "score": 3, "replies": []}]}]}, {"body": "SPY", "score": 16, "replies": []}, {"body": "I bought a whole bunch of TQQQ and SOXL last crash, maybe 50 percent of my portfolio, and later ran a PMCC on it. I have more money now, but didn’t sleep as well for a while.\nI guess the real risk is that there’s a material chance that the underlying actually goes to zero, which can make buying more in a dip rather taxing mentally.", "score": 13, "replies": [{"body": "What is your return on this?", "score": 4, "replies": [{"body": "I’m up 172.42 percent on the tqqq I have left. I’ve mostly rolled back into qqq at this point.\nMy total dollar exposure to tqqq is now about 41k, but as you know it’s incredibly volatile.", "score": 14, "replies": [{"body": "Wow that is amazing man! Congrats", "score": 1, "replies": []}]}]}]}, {"body": "NVDA", "score": 14, "replies": []}, {"body": "SOFI, AMD, MSFT, AAPL, PLTR, MARA, ASML, PFE, PATH & GLD (will hit bottom when they will start to taper)", "score": 19, "replies": [{"body": "MARA has been an ATM machine for me every Friday those calls I sold go to zero and I sell the next week OTMs.", "score": 6, "replies": [{"body": "Thatms the miracle called IV crush", "score": 0, "replies": []}]}]}, {"body": "Not a LEAP but I am DCA-ing into UPRO the 3X S&P fund (selling SPY and VTI to do it) and if we drop 10% I'll double the amount I'm putting in each month. If we drop much more than that I'll back up the truck. Still kicking myself for not having the guts to do this last year.", "score": 8, "replies": [{"body": "Yikes, long-term holding a 3X leveraged product is not what I'd call investing but you do you.", "score": 7, "replies": [{"body": "If your goal is long-term and don't care about your account value plunging in bear markets, why wouldn't a DCA in 3x ETF's be a solid strategy? I'd have to find the numbers, but I can't imagine that TQQQ hasn't beat QQQ handily over the past 10 years.\n\nEdit: Just checked the numbers, and over the past 10 years QQQ is up 23% vs 59% for TQQQ.", "score": 3, "replies": [{"body": "https://www.google.com/url?sa=t&source=web&rct=j&url=https://www.investopedia.com/articles/financial-advisors/082515/why-leveraged-etfs-are-not-longterm-bet.asp&ved=2ahUKEwiVurX5yL_yAhVxS_EDHQefDxYQFnoECCwQAQ&usg=AOvVaw1eXh-7ocs9D1WTR7KMjCFc", "score": 1, "replies": []}, {"body": "I do DCA myself but only into 1x ETFS because of the simple fact of how much the 3x ones decay in a volatile environment. Also past performance is not a guarantee of future returns. Do the same with IWM vs it's 3X ETF", "score": 1, "replies": [{"body": "URTY is 18% vs IWM's 12% over the past 10 years. I'm really trying to understand why it's a bad idea. I believe you guys when you say it, but I can't understand why.", "score": 1, "replies": [{"body": "https://marketrealist.com/p/leveraged-etf-decay-explained/", "score": 1, "replies": []}]}]}]}, {"body": "I did this in 2020 and made a ton of money", "score": 1, "replies": []}]}]}, {"body": ">Hey everyone I’m wondering what are some good leaps to purchase the next time there is a big market sell off. I feel like the obvious ones would be AAPL, SPY, QQQ, MSFT.\n\nYes. Good.\n\n>But I’m also wondering what about leveraged ETFs such as TQQQ, or SPXL. What are some cons to purchasing TQQQ leaps at .85 delta and 1+ years out.\n\nThis, I would not do. Leveraged ETFs attempt to replicate 3x the *daily* return, and should only be used for short term speculation. Long term, they dont quite perform the same (look up beta slippage)", "score": 24, "replies": [{"body": "For some reason there are plenty of examples where people did very well with holding them long term. There was an article about a guy who used TQQQ (If I remember correctly) to turn 100k into 1 million.", "score": 8, "replies": [{"body": "You’d basically need Bill Hwang’s balls to deploy a significant amount of your capital into tqqq and let it sit there long enough to 10x.\n\n\nAnd then, if it did, it’s just as hard to take that money off the table, even if you know you’ll eventually lose big in a downturn.\n\n\nPhilosophically, I think a PMCC or bull call spread on TQQQ is superior to buying the underlying. You can gain tremendous leverage while reducing capital at risk to a smaller part of your portfolio.", "score": 8, "replies": [{"body": "Bill Hwang is my spirit animal.", "score": 9, "replies": [{"body": "Love it. send it brah, hopefully you’ll take something off the table before it goes to shit!", "score": 1, "replies": []}]}]}, {"body": "They certainly can, but it's not as simple as 3x the annual return", "score": 6, "replies": []}, {"body": "The QQQ part stands for \"quick quality quiting\". In and out the same day, unless you absolutely hate money.", "score": 1, "replies": []}]}, {"body": "Thank you for the response. I just looked up beta slippage and it turns out that BS can also help levered ETFs make much more gains than a non levered ETF would have made during a time of an up-trending market. If I purchased an SPXL leap after a major decline, what does something like a SPY leap have that would be more enticing? Less risk? I assume so, but its odd to me that if one is convinced that SPY will recover in the following 1+ years why wouldn't they just buy a levered ETF instead?", "score": 2, "replies": [{"body": "1. Leveraged ETFs will have much more extrinsic value (which is bad for buying options), *especially* after a major decline, when volatility is through the roof. Buying SPY LEAPS will be bad enough\n\n2. More risk. 3x up, 3x down\n\n3. You need consistent growth without much volatility (realized, not implied). Volatilite back & forth stock movements add tremendously to beta slippage. If you cant time the bottom correctly, you could get torn apart\n\nLEAPS are already pretty levered. You can get 5x - 7x plus sometimes, while still paying very little extrinsic", "score": 16, "replies": []}, {"body": "I wheel tqqq. Over the long run it greatly outperforms everything else. Just watch out for the extreme volatility.", "score": 7, "replies": []}, {"body": "There is always going to be a reason it’s not a good idea but just try to keep everything small and you will do alright", "score": 1, "replies": []}]}]}, {"body": "You mean tomorrow?", "score": 14, "replies": []}, {"body": "The top of my watchlist and where I’ll leverage up if there’s a correction is (1) high growth companies that are currently killing it: AMD, NVDA, SE, MRNA, DPZ (yes, dominos pizza)\n\nAnd (2) companies that are rock solid and already at nice value: TSM, AMZN, AAPL, MU, COST", "score": 6, "replies": [{"body": "I’d be a little concerned with TSM as China keeps pressing Taiwan", "score": 2, "replies": []}, {"body": "Why DPZ? Tell me about it in a paragraph or two? Please", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Forgot about this one. Picking it up tomorrow. Looks like there's a gap at the 9.5-10 range that needs to be filled so will be a good LEAPs for me :)", "score": 1, "replies": []}]}, {"body": "AMD", "score": 4, "replies": []}, {"body": "TSLA because papa Elon and the cult will do anything to go to the moon 🚀🚀🚀🌕", "score": 4, "replies": []}, {"body": "There's no gain buying options on 3x leveraged ETFs as they will just be 3x more expensive than on an unleveraged ETF, any difference will mostly be arbitraged out. Ironically you'd probably get better return from the unleveraged one not having to deal with slippage and lower liquidity", "score": 6, "replies": [{"body": "Position sizing is way easier, due to lower prices of the underlying, and that’s a pretty big plus in real life.", "score": 2, "replies": []}]}, {"body": "Google", "score": 2, "replies": []}, {"body": "From what I understand, LEAPS on leveraged ETFs isn't a great idea. Volatility drag will eat you up over time.", "score": 2, "replies": []}, {"body": "MARA FUBO TLRY SOFI LCID for the high IV\n\nIf they correct - NVDA AMAT INTC AAPL", "score": 2, "replies": []}, {"body": "$F", "score": 2, "replies": []}, {"body": "SOFI and MARA", "score": 2, "replies": []}, {"body": "Bought Sofi and wish leaps. They seem beat down enough to be profitable in 9-18 months. Baba is getting tempting but it was temping the last drop and they dropped more. They are a powerhouse as a company but having a dictator coming at you isn’t good.", "score": 4, "replies": []}, {"body": "thetagang is buying calls now? What strange world have I awoken to.", "score": 1, "replies": [{"body": "Buying calls to then sell calls against😉", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "If Biden wakes up", "score": -16, "replies": [{"body": "If y'all put more money into education instead of your military, you'd understand what elaborate means.", "score": 12, "replies": [{"body": "Smh. Tailban got tons of US toys to play with and will send the more advanced ones to Russia for them to reverse engineer.", "score": -8, "replies": [{"body": "And that would do what to defense contractors? Biden isn't restarting the Afghan war.", "score": 5, "replies": [{"body": "You sure about that, fat?", "score": 1, "replies": []}, {"body": "Right now he isn’t. It could be a decent speculation play, can’t imagine the taliban won’t cross some lines where he may have to intervene", "score": -6, "replies": [{"body": "They won't.\n\nThey waited for the better part of 20 years to regain power. Now they have much more firepower than before. They have US trained ex-Afghani military that they can force into joining their ranks. They will work on training, gaining more control, and gaining numbers before doing anything that would come close to Biden needing to consider going back.\n\nIt'll be another Republican president to start the middle east war back up.", "score": 5, "replies": [{"body": "Yep", "score": 1, "replies": []}]}]}]}, {"body": "you're insane if you think theres stuff left behind that russia didnt already have examples of.", "score": 2, "replies": []}]}]}, {"body": "Remember when Trump was for leaving Afghanistan before he was against it all the sudden?", "score": 2, "replies": []}]}]}]}, {"body": "I would probably buy shorter term calls more heavily. Too much cash awash in this system so rebounds won’t last long. \n\n\n\nBut it just depends what drops. You’d want to look at everything. Tech is the obvious approach.", "score": 1, "replies": []}, {"body": "Thoughts on Sony leaps?", "score": 1, "replies": []}, {"body": "Right about now would be time to buy precious metals LEAPS take FSM for example.. has good upside potential", "score": 1, "replies": []}, {"body": "Yeah i was thinking of leaps on the things like soxl, spxl, tqqq as well. That and amd, nvda", "score": 1, "replies": []}, {"body": "\nPSFE", "score": 1, "replies": []}, {"body": "Puts on VXX", "score": 1, "replies": []}, {"body": "ATVI\n\nHas fallen significantly and good time to lock in leap call premium now", "score": 1, "replies": []}, {"body": "I like cruise stocks long term.\n\nBought CCL leaps, looking at rcl as well.", "score": 1, "replies": []}, {"body": "I bought INTC leaps and I'm selling CC to generate revenue while I wait.", "score": 1, "replies": []}]}
