{"title": "How do you short utilities? I was using 100% solar and powerwall all day and night in Texas... This has to be a game changer. Long tesla, FYI to Elon - don’t say stupid things on Twitter. Long TESLA!", "selftext": "", "id": "bg7wff", "created_utc": 1555969739.0, "score": 186, "upvote_ratio": 0.92, "num_comments": 99, "comments": [{"body": "I’m gonna sell my wife’s fake tits to buy more shares, gonna go tits out, up and back in again much bigger.", "score": 130, "replies": [{"body": "Sounds like you have it all figured out.", "score": 30, "replies": []}, {"body": "Cant go tits up with no tits. Great strategy!\n\n^Also ^youre ^technically ^married ^to ^a ^man ^now", "score": 28, "replies": [{"body": "Weird I always thought it was the vag or lack there of that decided the gender", "score": 2, "replies": [{"body": "It's modern days now. Gender isnt decided by mere body parts. I myself have a penis that identifies as a vag", "score": 12, "replies": [{"body": "Ahhh I apologize hard to adjust to the times. Is it a pagina or a vagenis", "score": 7, "replies": [{"body": "It is actually a penvag tyvm. It also identifies as a pen during work hours and writes beautiful yellow letters a few times a day.", "score": 4, "replies": []}]}]}]}, {"body": "Yeah I m gonna get an AIDS test later this week", "score": 2, "replies": []}]}, {"body": "This is much bigger than that.", "score": 16, "replies": []}, {"body": "Where should i give you my money?", "score": 2, "replies": []}, {"body": "I should have done that before I bought them!", "score": 2, "replies": []}, {"body": "I’ll give you 25 shmeckles for em", "score": 2, "replies": []}]}, {"body": "Peel that thing, man.", "score": 40, "replies": [{"body": "Wife did.  Done.  3 day old pic.", "score": 24, "replies": [{"body": "We need an updated pic", "score": 25, "replies": [{"body": "His phone died, now he's waiting for the big battery to recharge", "score": 26, "replies": []}]}, {"body": "Did she post it on r/oddlysatisfying?", "score": 2, "replies": [{"body": "[here](https://www.reddit.com/r/wallstreetbets/comments/bg7wff/how_do_you_short_utilities_i_was_using_100_solar/?utm_source=share&utm_medium=ios_app)", "score": -43, "replies": []}]}]}, {"body": "what? his potato head??", "score": 1, "replies": []}, {"body": "This is how you know /r/WSBs is full of obsessive compulsive autists.", "score": 1, "replies": []}]}, {"body": "It's even better in CA. PGE is forced to buy back solar energy supplied to the grid at market rates", "score": 36, "replies": [{"body": "I believe in Texas you get credits and you can use them when you need them.", "score": 22, "replies": [{"body": "What if they made credits that you could use for *anything* and at *any time* you wanted? We could represent them physically, possibly as small certificates. We could spruce them up with pictures of famous Presidents or something too!", "score": 58, "replies": [{"body": "And some weird guy that flew kites on one of the bigger ones.", "score": 14, "replies": [{"body": "I think he was more well known for his aggressive negotiations in French bedrooms.", "score": 5, "replies": [{"body": "...and he invented American ebonics 200 years before it resurfaced again.", "score": 2, "replies": []}]}, {"body": "yeah like that kid who gets BF'ed in Kite Runner! Hassan!", "score": 2, "replies": []}]}, {"body": "You are on to something!", "score": 3, "replies": []}, {"body": "yeah, but why flood the market with these little generalized debt remittance slips when you can sterilize their effect by creating a separate unit of account?", "score": 2, "replies": []}]}]}, {"body": "Kentucky put a stop to that.", "score": 1, "replies": []}]}, {"body": "What's the price of the setup?", "score": 16, "replies": [{"body": "About $8K minimum.\n\n\nhttps://www.energysage.com/solar/solar-energy-storage/tesla-powerwall-home-battery/\n\n\n\nAvg monthly bill in FL is $125 so it would take about 5 years to pay for itself.\n\n\nSo this isn't practical yet as an alternative to utilities but it can replace a whole house generator for those that live in Florida during hurricane season.", "score": 20, "replies": [{"body": "It will not save you 125 a month.  Your solar install will.\n\nBattery just improves your time of use position which is negligible compared to the price of the batteries", "score": 7, "replies": [{"body": "It's easier to use then a generator though. And it doesn't use gas that goes bad.", "score": 3, "replies": []}]}, {"body": "Yeah it's definitely more a CA-friendly product right now. PG&E's prices are wild. I haven't lived there for a while but I think it was something like 27¢/kWh at peak demand.", "score": 2, "replies": [{"body": "Try SDG&E a little further south - I was paying over $0.50/kwh last summer after the first few hundred kwh.", "score": 1, "replies": []}]}, {"body": "And how long do these batteries last? The problem with these Tesla products is that it just isn't worth it when electricity is cheap and so is gas.", "score": 3, "replies": []}, {"body": "...assuming it survives the hurricane.", "score": 1, "replies": [{"body": "Things are pretty hurricane rated around here. A bolt or two will be fine if you install this outdoors.", "score": 1, "replies": [{"body": "“It’s not that the winds blowing, it’s what the winds blowing “", "score": 1, "replies": [{"body": "That's what she said", "score": 1, "replies": []}]}]}]}, {"body": "Is that 8k including solar panels?", "score": 1, "replies": []}]}, {"body": "Electrician here a lot... I’ve only done to Tesla wall packs and both guys were loaded.. solars only really worth it if you can pay the whole think off quickly I did a 40k system amp n a guys house and he was just like “do you want the check or do I mail it”", "score": 3, "replies": []}]}, {"body": "Countdown to OP's house burning down?", "score": 27, "replies": [{"body": "The engineers told me they have no data that this battery burn down.  If this happens to me, think positive- I’ll be the first.   Lol", "score": 15, "replies": [{"body": "One of them is eventually going to blow up and burn someone's house down... might as well be youra", "score": 5, "replies": [{"body": "Think positive.", "score": 5, "replies": [{"body": "yeah, the positive terminal is usually the source of the fire.", "score": 15, "replies": []}]}]}, {"body": "Is that covered by insurance?", "score": 2, "replies": []}, {"body": "Hate to be that guy but I’ve seen a battery pack(not Tesla) burn a guys basement up... we was a doomsday champion preper as well so the area was encased in concert saved his house but chemical fires are nasty", "score": -1, "replies": [{"body": "I bet it happens and will happen especially when the market penetration increases.  What opportunities do you guys see?  Fire fighting equipment is one.  Who are the players in this field?", "score": 1, "replies": []}]}]}, {"body": "I asked the same question to the engineers.", "score": 9, "replies": []}, {"body": "Long $DHI", "score": 2, "replies": []}]}, {"body": "What makes tesla’s home energy storage better than anyone else’s?", "score": 12, "replies": [{"body": "Marketing is really good.   Who are the other players?", "score": 24, "replies": [{"body": "I believe Honeywell and Siemens have been making inverters for decades... Most commercial buildings need to be able to run on emergency power for hours in the event of catastrophic failure/meltdown. But what do I know? I just did commercial electrical through college.", "score": 10, "replies": [{"body": "What about residential total energy solution?", "score": 2, "replies": [{"body": "Tesla created the demand for them. Homes with solar panels would have them if they wanted them. They're only like $10-$15k for commercial ones.", "score": 6, "replies": []}]}, {"body": "I believe the biggest difference would be the gateway? It's a whole house UPS I guess, instead of a smaller set of devices on backup.", "score": 1, "replies": [{"body": "Commercial ones come smaller than the powerwall. Depending on building code and how long the lights have to stay on during a meltdown. If you only need 30 minutes of power in the building they will make inverters that are smaller than dorm sized refrigerators that will keep critical power on for a 40k sq foot building.", "score": 1, "replies": []}]}]}]}]}, {"body": "Take a pic of the solar panel set up. Yard or house.", "score": 6, "replies": [{"body": "The roof is to high.", "score": -3, "replies": []}]}, {"body": "what inverter did you use? also, how many and what kind of panels? thanks!", "score": 3, "replies": [{"body": "Delta solar inverters and the solar panels are Panasonic sc 325.", "score": 2, "replies": []}]}, {"body": "How many kw for your array?", "score": 2, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/bg9v99/long_tesla/?utm_source=share&utm_medium=ios_app", "score": 2, "replies": []}, {"body": "I’ll send you the spec sheet they gave me.", "score": 1, "replies": []}]}, {"body": "All you WSBers buying into Musk's shtick I'm only this morning realizing why so many of you lose so much money on robinhood.", "score": 2, "replies": []}, {"body": "Tesla Powerwall has one downfall. It doesn’t work if you don’t have internet. So you can’t live in the middle of no where and use this.\n\nWhat I don’t know is if it still works if say your ISP goes down. Which does happen time to time.", "score": 5, "replies": [{"body": "WTF", "score": 14, "replies": []}, {"body": "I don’t think that’s right.  You probably won’t have visibility on the Tesla app...", "score": 10, "replies": [{"body": "This makes it seem like you need it... but its iffy. I'd be curious to ask if they will install in a remote location with 0 internet. Probably not since you can't monitor the powerwall without the app, which requires internet; i feel like that's its Achilles heel?  \n\n\nI'd feel like this would be a great product without the internet requirement.\n\n[https://www.tesla.com/en\\_NZ/support/powerwall/faqs#without-internet](https://www.tesla.com/en_NZ/support/powerwall/faqs#without-internet)", "score": -3, "replies": [{"body": "Well when they say you need internet did they really mean you need internet or do you just need a router that you can connect to it with or does the data from the unit actually go to Tesla servers and back to your phone?", "score": 4, "replies": [{"body": "It communicates with tesla servers, then back to your phone.", "score": 1, "replies": []}]}]}]}, {"body": "Why does a power pack need internet? Looks like Tesla is limiting their customers base for no reason here", "score": 1, "replies": [{"body": "Cause Elon needs that data.", "score": 7, "replies": []}]}]}, {"body": "Gonna go out on a limb here and say this will always be a loser.  Even if solar/wind/hamster wheel/turd power was cost effective, the power company monopolies would just move the goal posts.  Thanks for playing me amigos.", "score": 4, "replies": []}, {"body": "[removed]", "score": 5, "replies": [{"body": "It is worth every dime.  Climate change is a game changer for utility companies.  Just check out what happen with pg&e...  they got destroyed.", "score": 4, "replies": []}]}, {"body": "Is it cheaper to run than regular power?", "score": 1, "replies": [{"body": "depends on ur amortization period. over 1 year? no way. depending on where u live, over 5-15 years? almost always.", "score": 6, "replies": []}]}, {"body": "Houston?", "score": 1, "replies": [{"body": "DFW", "score": 2, "replies": []}]}, {"body": "So in 20 more years of straight sunshine it will have paid for itself?  Long global warming!", "score": 1, "replies": []}, {"body": "Lol short utilities. So are you 100% disconnected from the grid? If not, they’re still making money maintaining distribution lines.", "score": 1, "replies": []}, {"body": "Elon's profile pic on twitter is some Anime character. That profile is a dumpster fire at this point and I love it lol.", "score": 1, "replies": []}, {"body": "this didn't age well", "score": 1, "replies": []}, {"body": "If you build it, they will come.", "score": 1, "replies": []}, {"body": "This guy, trying to get referrals through Reddit. I see you.\n\nEdit: Why is there still a conduit body left open? Is that offset going into the inverter really that crooked or is it just the angle? They couldn't even put the stickers on straight lol", "score": 1, "replies": [{"body": "I’m buying a model x soon.  Maybe in 3 months once I sell my NIO stocks...", "score": 1, "replies": [{"body": "Congratulations man, I'm sure you'll be happy. Just check it over before you drive off. Make sure the trunk isn't crooked", "score": 1, "replies": []}]}]}, {"body": "wake me up when you have to run your AC during the summer...", "score": 0, "replies": []}, {"body": "Solar will always be supplemental due to how inconsistent sunlight can be.", "score": -2, "replies": [{"body": "I mean not so much in places like west Texas", "score": 1, "replies": []}]}]}
