{"title": "Are there any other dualpolies like Intel/AMD?", "selftext": "[removed]", "id": "5iezlk", "created_utc": 1481769462.0, "score": 51, "upvote_ratio": 0.91, "num_comments": 84, "comments": [{"body": "The word you were looking for is \"duopolies\".\n\nA couple I can think of, some may be a little questionable --\n\n* Boeing/Airbus\n* Coca-Cola/Pepsi\n* FedEx/UPS\n* Visa/MasterCard\n* Comcast/AT&T\n* Philip Morris/Reynolds\n* Home Depot/Lowes\n* Nike/Adidas\n* AutoZone/Advance Auto Parts", "score": 35, "replies": [{"body": "Just wanted to add:\n\nUNP and BNSF (Berkshire Now)\n\nCSX and Norfolk \n\nCNI and CP \n\nSince the cost curve for shipping with trucks have gone up because of it being labor intensive, railroads are emerging as duopolies now.", "score": 4, "replies": [{"body": "Also commenting here for visibility.\n\nAT&T vs Verizon have a virtual duopoly on the mobile services sector.  Sprint's got nothing.\n\nWaste Management vs RSG on trash collection in the united states.\n\nAnd in Sales to the consumer discretionary sector, AMZN and Walmart are the two big bad boys.  That's no Duopoly there by any means, but they certainly sell the lions share of the market. \n\n\n\n", "score": 1, "replies": []}]}, {"body": "I agree with your first two, but not besides that.\n\n>  Boeing/Airbus\n\nAgree.\n\n> Coca-Cola/Pepsi\n\nAgree.\n\n> FedEx/UPS\n\nDHL, plus competition from the USPS.\n\n> Visa/MasterCard\n\nDefinitely not. AmEx+Discover.\n\n> Comcast/AT&T\n\nDepends on regional markets, so this one is tricky.\n\n> Home Depot/Lowes\n\nThis is interesting. It's true that these are only retailers of the size/scope specializing in home improvement. However, when you consider all of the other places you could buy the types of things they sell (ACE Hardware, WalMart, etc.), I think this falls apart.    \n \n> Nike/Adidas\n\nUnderArmour would like a word with you. (Also, Reebok.)\n\n> AutoZone/Advance Auto Parts\n\nNapa?\n\nOnly other one I could think of is Monsanto/DowDupont (assuming post-merger world). ", "score": 3, "replies": [{"body": "Even with Coca-Cola/Pepsi, they've got DPS hanging around.", "score": 1, "replies": []}, {"body": "The Monsanto/Dow-Dupont one is a bit like Comcast/AT&T. There are some decently large regional companies that squeeze in the bunch, as well as a collection of mid sized ag firms that have a decent hold in the market. ", "score": 1, "replies": [{"body": "I suppose I was thinking of the market specifically for GMOs. My rough understanding is that those three companies basically have that locked down, but I could be wrong and would be interested to hear about regional players if you have some links. (Not trying to be snippy, am genuinely interested in the industry.)", "score": 1, "replies": []}]}]}, {"body": "Apple and Microsoft ", "score": 6, "replies": [{"body": "The only category they truly overlap on in a duopolic sense is the operating system, and that's not an important battleground anymore. They have traditionally had totally different business models surrounding it, and MSFT in recent years has moved focus to hardware and cloud services, both of which have many competitors", "score": 6, "replies": [{"body": "To be fair Microsoft still tries to complete with Apple...the just don't do it very well.\n\nWindows phone, surface, zune (now defunct) ECT.\n\nBut your right apple doesn't try to complete with Microsoft on most areas.", "score": -1, "replies": [{"body": "You're right, but that doesn't make it a duopoly. Those categories all have many competitors in the space. Apple is much closer to a monopoly with premium devices, although it might be fair to predict that Surface will start to eat into that over the next few years.", "score": 4, "replies": []}, {"body": "> To be fair Microsoft still tries to complete with Apple...the just don't do it very well.\n\nIt's not really that simple. Windows is obviously their most prominent product by far and the majority of their other products are based on it, but even if we were to see a Blackberry style complete and total decline of Windows over the next 10 years (which isn't as unlikely as you might think), Microsoft's product portfolio is so large and diversified that they'd almost certainly remain as a successful company. Just between Office and Windows Server support contracts there's 10 years of life in that company even if they discontinued desktop Windows tomorrow.\n\nOn the other side, Apple is a hardware company, not a software company. Their flagship products are the physical devices themselves not the software running on them and their margins on that hardware are grossly beyond what anyone else in the industry is making.", "score": 1, "replies": [{"body": "I agree my point was more that Apple builds IPADS, IPHONES, Laptops, IPODS , and a few other products.\n\nMicrosoft does try to compete with them in all areas apple covers.\n\nThe opposite is NOT true, Apple does not try to compete with microsoft in all areas (servers, business software, cloud)\n\nSaying microsoft doesn't compete well was mostly aimed at their windows phone, surface , zune player ect.\n\nI was not saying Microsoft is in decline their servers, office, windows os will keep them around for the next 50 years.", "score": 1, "replies": []}]}]}]}, {"body": "They are not even close. Where Apple's strong, MS is terrible. Where MS is strong, Apple is terrible or not even present.", "score": 1, "replies": [{"body": "I guess I was talking more about the computer os. macOS and windows ", "score": 1, "replies": [{"body": "alright, but Windows far out sells MacOS about 8 to 1. It's hardly a duopoly.", "score": 1, "replies": []}]}]}]}, {"body": "How about Nike vs Under Armour. \n\nThat is the closest thing I can think of that resembles the Intel/Nvidia vs AMD relationship. A smaller up and comer that has huge upside potential against a Goliath foe if they keep making all the right moves. Their great sponsorships have really brought them into the big leagues.", "score": 2, "replies": [{"body": "Adidas is so far ahead of Under Armour though that it's really Nike vs. Adidas.", "score": 4, "replies": []}]}, {"body": "You seem to be focused on the US market, but only Intel/AMD and Airbus/Boing have their markets split almost world wide", "score": 1, "replies": []}, {"body": "> FedEx/UPS\n\nYeah, except global market leader is called DHL. You do know that life exists outside US?\n\n> Visa/MasterCard\n\nSame since they pretty much lost Chinese market to UnionPay.\n\n> Comcast/AT&T\n\n*sigh*", "score": 1, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "OP asked about worldwide duopoly like Intel/AMD.\n\nYou can hardly buy a server or PC not based on Intel or AMD anywhere in the world. UPS and FedEx just dominated domestic transport in one large economy, but it's not really comparable to AMD/Intel market share. ", "score": 2, "replies": []}]}, {"body": "> Yeah, except global market leader is called DHL. You do know that life exists outside US?\n> \n\nNope", "score": 0, "replies": []}]}, {"body": "GOOGL / AMZN - what do you think?", "score": -1, "replies": [{"body": "How does that even remotely make sense?", "score": 0, "replies": [{"body": "Search function\n\nEcommerce\n\nPhones\n\nVoice recognition\n\nDrones\n\nHardware / software (cloud, etc)\n\nI dunno, seems like a lot of overlapping industries. These tech giants are so diversified. Sit down or get out please", "score": 2, "replies": [{"body": "I'm laughing at all the downvotes, what you're really trying to say is cloud services.\n\nWithin the Cloud AMZN and GOOGL are the two giants, however there are a lot of other players in that Arena that are still pretty damn big, but as far as the best tech contributing to cloud services and eventually AI and Autonomous vehicles, GOOGL and AMZN are light years ahead of the competition.\n\nMSFT.  CSCO.  IBM.  AAPL.\n\nI'm Long on IBM and CSCO because dividends.", "score": 2, "replies": [{"body": "I agree, nowadays tech giants don't have a sole \"focus\". Yes google is still a search engine and amazon is an ecommerce platform. But they're much bigger than that.\n\nTo me they're data companies (but in a lot of different areas)", "score": 1, "replies": [{"body": "Agreed.  If you simply look for cloud service companies alone, these guys are really flexible in what they provide to their corporate customers.\n\nCloud computing companies are just getting started, I think.  This sector is gonna be yuge.", "score": 1, "replies": [{"body": "but too bad the other ppl lack understanding and foresight :(", "score": 0, "replies": []}]}]}]}, {"body": "As far as the core business though, they're very different. ", "score": 1, "replies": [{"body": "Amazon is eating at googles searches bro ", "score": 0, "replies": [{"body": "I'm gonna amazon some sources on that", "score": 6, "replies": [{"body": "Meanwhile, I'll google prime my Christmas presents. I hate heading to the store.", "score": 3, "replies": []}, {"body": "Sure you can try to make fun of it\n\nhttp://www.businessinsider.com/55-people-start-product-searches-amazon-google-search-share-2016-9\n\nbefore you know it amazon will offer searches too", "score": 2, "replies": [{"body": "Amazon tried getting into search engine back in the early 00's and quickly left after seeing how outclassed they were", "score": 2, "replies": [{"body": "So it means they won't try again? Now that their tech is a lot better than before?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Really should be GOOGL / FB", "score": 1, "replies": []}]}]}]}]}, {"body": "Western Digital and Seagate for HDDs", "score": 8, "replies": [{"body": "Ah... that's a pretty good one.  The other players all have pretty small shares left these days (HGST, Toshiba).\n", "score": 1, "replies": [{"body": "Western Digital even owns HGST.", "score": 1, "replies": [{"body": "Ah, right, I had forgotten that.", "score": 1, "replies": []}, {"body": "They just completed a three way merger - SanDisk, HGST and WD", "score": 1, "replies": []}]}]}]}, {"body": "AMD and Nvidia?  Sony and Microsoft in the console video game space I guess, until/if Nintendo makes a come back   ", "score": 4, "replies": [{"body": "Except if you're investing in either Sony or Microsoft because of their console gaming business, you're doing it wrong.", "score": 8, "replies": []}, {"body": "Nvidia and AMD make the GPU for all three consoles.", "score": 1, "replies": [{"body": "PS4 and XBOne both have AMD GPUs", "score": 1, "replies": [{"body": "And AMD cpus", "score": 1, "replies": []}]}]}, {"body": "Activision/Blizzard is the big for gaming", "score": 1, "replies": [{"body": "On the software side, yes. Not on the hardware side. ", "score": 2, "replies": [{"body": "ohh true", "score": 1, "replies": []}]}]}]}, {"body": "I wouldn't call AMD the counterfoil for Intel.", "score": 7, "replies": []}, {"body": "Reddit is so tech heavy that nobody thinks about different sectors.\n\nCanon vs Nikon. Cameras\nMarvel vs DC  Comic industry.\nVerizon vs AT&T Mobile services.\nWaste Management vs RSG - Trash.\nAnd I know both of these companies don't exactly fit the mold for this, but if you only look at the consumer discretionary side of their business, Walmart and Amazon.\n\n\n", "score": 3, "replies": []}, {"body": "Intel has it sewn up. They get hurt by changes in demand from the market but their capability is beyond compare. AMD pretty much exists so that Intel isn't a monopoly.", "score": 2, "replies": []}, {"body": "Nvidia and AMD", "score": 2, "replies": []}, {"body": "GE/Siemens for Gas turbines", "score": 2, "replies": []}, {"body": "AAPL and MSFT? ", "score": 3, "replies": [{"body": "Both companies are in *way* too many business lines.  So.  No.  Not even close.\n", "score": 4, "replies": [{"body": "I don't think the diversity of the companies has anything to do with it. A duopoly would be any product where the majority of the marketshare is locked down by two companies. AAPL and MSFT have a duopoly on desktop operating systems.", "score": 7, "replies": [{"body": "Right, but their stock price is influenced a lot more by their performance in other markets, which aren't duopolies", "score": 4, "replies": [{"body": "You right, you right", "score": 2, "replies": []}]}]}]}, {"body": "I would say AAPL and GOOGL since the majority of AAPL's revenue comes from their smartphone. ", "score": 1, "replies": []}, {"body": "At this point, I've just started thinking of Apple as a phone company because that is the bulk of their revenue while Microsoft does a million different things. ", "score": 1, "replies": []}, {"body": "If we're just talking about OS shares, \n\nMSFT's got 80% of the laptop/desktop, the rest is divided between MacOS and Linux. \n\nApple's got about 60% of mobile OS, the rest is Android\n\nThat doesn't look like a duopoly, unless you're saying, mobile OS are direct competitors of desktop OS? I don't think so. \n", "score": 0, "replies": []}]}, {"body": "Staying in the semiconductor industry, on the foundry side you have TSMC vs Samsung Electronics. These are the only two companies in position to manufacture the cutting edge chips Qualcomm, Apple, and NVIDIA are asking for these days.\n\nChips are only about a third of Samsung Electronics, but then again PC CPUs are only a fraction of Intel's business, so it's as good as the original example.", "score": 2, "replies": [{"body": "Serious question: what about Intel? Don't they offer manufacturing services (without designing it themselves) like TSMC and Samsung?", "score": 2, "replies": [{"body": "if you wanna get technical with it, there's also Global Foundries and some Chinese/taiwanese Fabs, but really only TSMC and Samsung have both the tech and the scale to field big fabless players like Qualcomm or AMD. Intel makes some stuff on the side but their in house business takes up too much of their production.", "score": 2, "replies": []}, {"body": "Actually no. Intel's business model is an IDM (Integrated Device Manufacturer) which means they only manufacture their own chips. Samsung and TSMC are Foundries, meaning they are manufacturers for hire and will make anyone's chip.", "score": 1, "replies": []}]}]}, {"body": "Dolby and DTS", "score": 1, "replies": []}, {"body": "$INTC traders should've joined $AMD yesterday. They wouldn't have been in the red today. ", "score": 1, "replies": []}, {"body": "Energizer/Duracell", "score": 1, "replies": []}, {"body": "Sorry, your [submission](https://www.reddit.com/r/stocks/comments/5iezlk/are_there_any_other_dualpolies_like_intelamd/) in /r/stocks has been automatically removed due to Rule 3:  Low effort and/or no text.\n\nIf you just want to post 1 liners or just want to know everyone's thoughts, then post a comment to our daily discsusion thread which are generally stickied or [click here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+daily+discussion&restrict_sr=on&sort=new&t=all)\n\nIf you're wondering **why a stock moved** a certain way, check out [Reuters](https://www.reuters.com/), [Motley Fool](https://www.fool.com/), [Streetinsider](https://www.streetinsider.com/), and **especially** [Finviz](https://finviz.com/quote.ashx?t=spy) **which aggregates the most news for almost every stock**.\n\nIf instead you're wondering what a term means, go to Investopedia.com and search for said term there.\n\nEither way come back here to repost with your findings, thanks!\n\nA list of the [rules can be found here](https://www.reddit.com/r/stocks/about/rules/), and if you're new to r/stocks please see the [wiki](https://www.reddit.com/r/stocks/wiki/index) and/or [read this post.](https://www.reddit.com/r/stocks/comments/4x1419/if_youre_new_here_read_this_post_first/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Peet's and Starbucks are close.\n\nOh, and Constellation and Diageo, sorta.  If you discount beer entirely.\n\nAnd I missed the obvious: Airbus and Boeing.\n\n", "score": 1, "replies": [{"body": "DNKN? You obviously don't live in the Northeast", "score": 1, "replies": [{"body": "No, I don't.  Good point.", "score": 1, "replies": []}]}]}, {"body": "There are lots -- McD & BK, Coke & Pepsi, General Mills & Kellog, Duracell & Energizer, NYSE & NASDAQ", "score": 1, "replies": []}, {"body": "XOM & CVX", "score": 1, "replies": []}, {"body": "Dualpolies? LOL, amd is not even close...yet. nvda much?", "score": -3, "replies": [{"body": "I think OP is talking about the CPU for PC market, which NVDA is not a contender in.", "score": 6, "replies": [{"body": "Yes. This is what I'm talking about.", "score": 3, "replies": []}]}]}, {"body": "Making a mint on AMD right now :)", "score": 0, "replies": [{"body": "Me too bro me too ", "score": 1, "replies": []}]}, {"body": "Coke/Pepsi is probably the easiest one I can think of. \nto a lesser extent, Google and Apple\n\nHome Depot/Lowes                              \nWalmart / Target                                \npossibly ADP/Paychex                  ", "score": 0, "replies": [{"body": "With the desktop/server CPU industry we have been dying for a product that would really shake things up. Only AMD/Intel can produce a desktop/server CPU. AMD hasn't released a new platform for a very long time. So Zen was being hyped. \n", "score": 1, "replies": [{"body": "I'm well aware how much the tech industry needs AMD to deliver on Zen (Ryzen). Intel has been able to take a breather and rest on its laurels for the past few years, since nothing was even close to push them to deliver better products. (see skylake and kaby lake, neither of which are reasons for me to upgrade from Haswell).\n\nIf Ryzen is what it seems to be, and is priced well, I think we'll actually see some CPU competition again. This will force Intel to push a hard as they can to make a superior product after Kaby lake. ", "score": 1, "replies": []}]}]}]}
