{"title": "$BTC hits $900 per coin", "selftext": "[removed]", "id": "5jw5u4", "created_utc": 1482482993.0, "score": 61, "upvote_ratio": 0.79, "num_comments": 79, "comments": [{"body": "Do you really think it's because of China and Venezuela? I mean, I think that contributes to it, but I don't think that's the single contributor.\n\nI suppose I'm also wondering why bond markets (with the exception of junk bonds) aren't blowing up. I know, rates are increasing, and certain equities are doing well such as financials, manufacturing, commodities, and industrials. I guess I'm just kind of surprised that with so much uncertainty in this sector rotation and also after other economic events that investors aren't seeking out bonds for safety rather than obscure alternatives.", "score": 24, "replies": [{"body": "Just my 2 cents.\nIndia recently had a demonetization of it's old currency.\nI think many people are loosing faith with cash as government is enforcing more of digital (their own network or can be monitored) currency. \nPeople are buying more gold and forex (that is in news) , but I think many smart investor are trying to save a % of money to bitcoin so that no goverment can touch it \n", "score": 4, "replies": []}, {"body": "i think there are a lot of countries where national currencies are struggling, either depreciating via bad policies, or simply losing traction against a strong USD.\n\nIm in canada, and over the last three years i moved a lot of my $CAD into USD stocks (and some bitcoin), which helped to shelter me from the fact that $CAD has fallen from parity to about $0.70\n\nright now, bitcoin is pretty much an all-time-high in $CAD as a result.\n", "score": 2, "replies": [{"body": "But man, if you get into canadian stocks when or if the US market and the USD crashes, the difference in dollar value will get you at least 3 yachts!", "score": 1, "replies": [{"body": "ive been loading up canadian stocks heavily this year, including converting some USD funds back to CAD, brcause i cant see our dollar falling too much further with the resurgence of oil/LNG pricing", "score": 2, "replies": []}]}]}, {"body": "Bond prices are in bubble territory already. I would not want to put my money there.", "score": 1, "replies": []}, {"body": "The recent price fluctuations are due to the information I listed. But the cause for the 100%+ gain was due to more citizens adopting the decentralized money. This is a form of money that is traded on the free markets/it does not correlate with bonds or equities.\n\n1. It's fungible and does not need a third party to mediate transactions (visa/MasterCard/PayPal)\n\n2. It has a \"store of value\" there is a finite amount of Bitcoin in the world. That makes it like gold/silver but instead of having to convert it into USD, you can spend the Bitcoin as is.  ", "score": 1, "replies": []}]}, {"body": "Sometimes I kick myself for not buying about 1,000bitcoins when I first learned about them in 2012 and they were only about$3 per coin.\n\nThen I remember that I probably would have bought them through MtGox and lost all my money anyway.", "score": 24, "replies": [{"body": "Not if you transferred them to your own wallet. ", "score": 2, "replies": []}, {"body": "Same. I had my finger on the button to purchase $75 worth.", "score": 1, "replies": []}, {"body": "I learned about them too late. Think it was around their high oh 1200 a coin. ", "score": 1, "replies": [{"body": "I bought my first two coins literally at the all time high. Bought some during the way down and added a shit ton once it stabilized in the $200's. I now have a cost basis in the $300's and am up over 166%. Almost *no one* bought at the all time high and didn't at least DCA a little, so I can't imagine many holders that are bagholders now. Anyone who DCA'd at all is in profit now, so in reality there's never been a bad time to buy. Pick some up before we breach the all time high!", "score": 3, "replies": [{"body": "Ayyyy wsb indahouse", "score": 3, "replies": []}]}, {"body": "Shoulda kept your eye on them. They stabilized at the $230 area for basically all of 2015. \n\nThat being said, it's never too late to get into Bitcoin. I truly believe that if you buy and hold even just two of them you'll be incredibly rich in 10-20 years. ", "score": 3, "replies": []}, {"body": "They fell to sub $400 after that though. There were opportunities.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Of course there is a chance.     \nBut i consider it far more likely bitcoin s going to rise in the long term. There are just so many use cases for bitcoin, and it has barely even started to get noticed.", "score": 1, "replies": []}]}, {"body": "wtf, venezuelan daily BTC volume is barely 100 BTC. It has absolutely no impact on bitcoin.", "score": 9, "replies": []}, {"body": "> I truly believe this is the future of money, and I think we will see decentralized money become more popular. (Bitcoin is up over 100% on the year)\n\nlol if you think gov'ts would ever allow that", "score": 4, "replies": [{"body": "It's not up to the government bud", "score": 5, "replies": [{"body": "You think they wouldn't do anything about vanishing tax revenues though? The alternative is financial records that can be audited and that's kind of the entire point of a cryptocurrency in the first place (that it is crypto).\n\nWhat do you think would happen if they pass a law mandating that merchants in the USA (for example) can not take BTC or lose their business license?", "score": 3, "replies": [{"body": "Then the American people will revolt. ", "score": 1, "replies": [{"body": "All the bitcoin neckbeards will get up from eating their ramen noodles and watching hentai and do what exactly?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "They don't need to shut down every single person using the software. They just need to not let you pay taxes in it and then the primary motivator behind using a particular currency doesn't exist. It'll always just be a commodity traded for dollars/euros/whatever.\n\nAlternatively if a government got a hair up their butt they could just pass a law making it illegal for merchants to accept BTC.\n\nAlso dude I'm pretty sure no reasonable person on a home PC can get 'some bits' of a BTC anymore. Let's not pretend like mining conglomerates with tons of hardware at their disposal aren't dominating the block chain.", "score": 2, "replies": []}]}, {"body": "I see, just like how the government was able to stop piracy.    \nDid we mention bitcoin is P2P?", "score": 0, "replies": [{"body": "That's not really relevant. If I have to pay my taxes in dollars then I always need to exchange BTC for dollars and then I can be tracked and audited and my motivation to use cryptocurrency is gone beyond just novelty stuff.\n\nAlso, the gov't doesn't care about stopping piracy. That's 99% coming from private industry motivations. If you suddenly dick with tax revenues lol if you think they won't do something about it though.", "score": 2, "replies": [{"body": "Bitcoin isn't about dodging taxes ", "score": 1, "replies": []}]}]}]}, {"body": "Been a Bitcoin enthusiast since they were about $100 each. Glad I stocked up. \n\nPeople told me I was falling for a scam, but couldn't even explain what Bitcoin is. Then they said I would get arrested for holding drug money. Now they ask me if they can buy them for under $500 each. \n\nThe writing was on the wall. Crypto is a big market. If you think the price rise ends here you're probably sadly mistaken. In a world where banks, executives, and politicians abuse the financial system to get rich at the expense of others, a trustless cash system is exactly what will disrupt the process.\n\nInvest at your own risk, but if Bitcoin takes 1/2 of the gold market cap, we're looking at $6.5 million per coin. Put that at 1/20 that of gold and Bitcoin will be $650,000. Still not good enough? At 1/200 the gold market cap, Bitcoin is priced at $65,000. And that's with all 21 million coins mined. We currently have mined about 16 million, and at least 1 million of them are gone forever.   \n\nEdit: my math is all wrong. I can't do fractions. I tried fixing it but I could still be wrong.", "score": 8, "replies": [{"body": "You're just arbitrarily picking values. Ya and if btc took 1/10 of global markets it'd be even bigger! It could also become 1/10 of nothing which would value it at a big fat zero. Now I'm not saying BTC will go to zero but arbitrarily picking fractions doesn't make a compelling argument. ", "score": 2, "replies": [{"body": "It is not unreasonable to think Bitcoin will be compared to gold. Me picking the fractions is just showing that even if Bitcoin takes a very tiny market cap size of something like gold, the price of Bitcoin will be much higher than now. My opinion is that we may have missed the boat on a 10000% return, but the price has not yet peaked.", "score": 2, "replies": [{"body": "Bitcoin could potentially replace golds role as a safe haven asset and on top of that it's also the best currency to be used for e-commerce.       \nAdd to that the remittance market and several other use cases for bitcoin and you can only conclude bitcoin is going to be huge.     \nI honestly think even a 10000% payout is still possible.\n", "score": 1, "replies": []}]}]}, {"body": "Can you ELI5 how bitcoins are immune to inflation? Couldn't one simply mine more coins?", "score": 3, "replies": [{"body": "The system is coded to only have 21 million coins. Every 4 years or so(240,000 mining sessions I think), the reward is cut in half. By the year 2140 we will have mined the last coin, which is number 21,000,000.", "score": 8, "replies": [{"body": "Actually, if you half every T timeunits, youll never mine the last coin.", "score": 2, "replies": []}]}, {"body": "the cap is 21 million.....     ", "score": 4, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.4071  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/04064)", "score": 2, "replies": []}]}, {"body": ">if Bitcoin takes 1/2 of the gold market cap, we're looking at $6.5 million per coin. Put that at 1/10 that of gold and Bitcoin will be $650,000. Still not good enough? At 1/100 the gold market cap, Bitcoin is priced at $65,000. And that's with all 21 million coins mined.\n\nThis is under the assumption that altcoins will gain no traction as an alternative to what appears to be a very expensive currency. What do you think the impact of Litecoin and Dogecoin (or any cheaper alternative) will have on BTC?", "score": 1, "replies": [{"body": "Dodgecoin is a fad and it died. Litecoin holds its spot purely due to second mover advantage. It has nothing special and might die off. Monero is the one to look at as it has big privacy improvements. Ethereum is good too due to its use case.  ", "score": 2, "replies": [{"body": "Can someone ELI5 how one could invest their money into bit coins? ", "score": 1, "replies": [{"body": "It's actually really fucking complicated, I can't talk about it until I get my Ph.D in Computer Science\n\n", "score": 3, "replies": []}, {"body": "As in buying? If you are American go to Coinbase.com. If not go to bitstamp.com.  \n\nRegister, do your identity verification and off you go. ", "score": 1, "replies": []}, {"body": "Governments hate Bitcoin but cant stop it so they make it f*** hard to get by requiring companies that sell it to anal probe you before you can buy it.\n\nAnal probe=1)  Take a picture of yourself with your passport/license. 2) Make a copy of your passport/license and send it to us. 3)  give me your bank account number etc 4) full name/address/phone number\n\nThe truth is, i can send $1,000,000 to you instantly at this moment with no one in between us or $.75 so you can buy a soda\n\nAll of the static/friction/pain in the ass/cut my wrist type of anal information probing is government intervention.\n\nThis is why silk road/black markets use Bitcoin cause it cuts through 100% of the bullshit (Bitcoin is digital **cash**.  Like the $5 bill you have in your pocket. You can give it to anyone you want without permission.).\n\n>Can someone ELI5 how one could invest their money into bit coins?\n\nELI5 - its hard.\n\nbut worth it.  there will only be 21 million of them. 7 billion people in the world.  The math is simple. If its zero you lost $900, if its not, $900,000?  And it only looks like gambling, when you research what it is; its a fucking genius invention.  Its a technology/discovery which solved a real world problem (double spending)\n\nI use Coinbase to buy. Reputable exchanges will anal probe you. Some people use local bitcoins.  ", "score": 1, "replies": []}]}]}, {"body": "I think they'll exist as alternatives, but they'll grab about 5% across the board for crypto markets. It'll be kind of like how the silver and bronze market work in terms of value.\n\nAlso, crypto will be its own market, and it will surely inflate like all new things.", "score": 1, "replies": []}, {"body": "Litecoin and dogecoin are not the ones that people are looking at right now, if you go to poloniex or kraken you will see the coins with more volume like ethereum, Monero, and others more that are game changers", "score": 1, "replies": []}]}]}, {"body": "It's very interesting. I'm also looking forward to see the impact of Brexit on gold/bitcoins.", "score": 4, "replies": []}, {"body": "I think with every additional year of existence and utility, people are more willing (and able) to view bitcoin as a sor of viable \"egold\" or worldwide reserve currency", "score": 4, "replies": []}, {"body": "Same happened on 11/18/2013 and i think it happened back then because it seems likely that this could have been a reaction to the news that the U.S. Department of Justice said bitcoins can be \"legal means of exchange.\" This particular article suggests the hearing occurred earlier than 2:00pm PST, and the peak appears to have occured shortIy after 4:00pm PST.\n\nI do not claim to be an expert on bitcoin, but I thought I'd offer this convenient explanation until someone more knowledgeable comes along.", "score": 2, "replies": [{"body": "Bitcoins previous high $1000+ was rigged.  \n\nWhat we are seeing now is organic growth due to the fact there are thousands of different ways people are attaining Bitcoin.\n\nThe $1000+ price of Bitcoin in 2013 was brought about by (conjecture from me, but I am fairly certain) initial burst was caused by China buying in - then the MagicThe GatheringOnlineXchange (Mt GOX) exchange rigged the price to keep bursting upwards via fake buying.  This was the only place to buy Bitcoin in the world (monopoly) so they were able to rig the entire thing.\n\nTodays market is healthy.  Bitcoin is attained via 1000s of ways.  Individuals selling on local Bitcoins, many different exchanges around the world, thousands of miners, businesses attaining Bitcoin by selling services/products.\n\nThis system cannot be rigged due to its sheer size. (never say never, but.. the conspiracy would have to be 911 truther level)", "score": 1, "replies": []}]}, {"body": "damn I really should've bought 3 BTC back when they were 350$ each. :/", "score": 2, "replies": [{"body": "don't regret not buying next year.", "score": 1, "replies": []}, {"body": "350$ ?? I was about to buy like 1000$ worth of bitcoin when they were $30 then it started going up like crazy (around the end of 2012) and I was like fk this shit gonna crash which it did ( but looks more like a dip compared to the current price) \n\n:/", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "They are like trees!  The best time to buy/plant is a few years ago..... the next best is time is now!", "score": 3, "replies": []}]}]}]}]}, {"body": "Why are things like NUGT not flying if gold is up? I know it doesn't 100% follow gold, but rather gold miners, but it should be a close enough correlation.. also, I know about the rate hike news and its effects, but that has already hammered it.", "score": 2, "replies": []}, {"body": "Stupid question so apologies ahead of time, but how do you go about buying bitcoins and why do they exist? And why do people believe this is the future of currency? ", "score": 2, "replies": [{"body": "An easy way for someone to purchase Bitcoin would be through Coinbase.\n\nBitcoin's are mined from a network by solving complex equations. The reason Mining exists is to help continue the transaction flows (peer to peer). Once mining reaches its maximum potential you will start to see very small fees with each transaction; that will be the incentive to continue/verify transactions (.03% projected).\n\nPeople believe this type of money is the future because:\n1. It is decentralized (no Government involvement) and there are no third party intermediaries (such as master card/visa/paypal/banks)\n2. There is a finite amount of Bitcoin. This creates a \"Store of value\" like gold or silver. Inflation would not be a problem, considering we cannot print more of them.\n3. They are Fungible and safe. Unlike Gold/Silver you can actually purchase something with them without having to transfer them to USD or any other FIAT currency. Bitcoins are safe due to the fact that transaction flows go from Buyer's Public key--->Seller's Public Key---->Seller's Private key.\n\nLink to Video:\nhttps://www.youtube.com/watch?v=Lx9zgZCMqXE\n\n\n", "score": 5, "replies": [{"body": "Awesome - thanks for this!", "score": 2, "replies": [{"body": "no problem!", "score": 1, "replies": []}]}]}, {"body": "/r/bitcoin", "score": 2, "replies": []}, {"body": "I agree with asking r/Bitcoin all of your questions. They'll give you plenty of smart answers. \n\nCreate an account on Coinbase and you can buy/hold/sell Bitcoin very easily. They have a mobile app with a price ticker widget that's very nice to use. ", "score": 1, "replies": []}]}, {"body": "Yep. I 100% agree it is the future. \n\nhttps://thebigbreakout.wordpress.com/2016/12/22/is-bitcoin-the-next-internet-its-market-cap-just-passed-14-billion-dollars/", "score": 2, "replies": []}, {"body": "Fook. I bought and sold Round 600 and was waiting to invest what I have next summer..", "score": 1, "replies": []}, {"body": "Waiting for a huge selloff. ", "score": 0, "replies": []}, {"body": "As of now, there is no way you can evaluate how much money does the bitcoin really costs. ", "score": 0, "replies": []}, {"body": "Do people not get that there is an infinite amount of cryptocurrency?\n", "score": -1, "replies": [{"body": "But there is a finite amount of Bitcoin buddy. All the other cryptocurrencies will eventually go to zero.(except maybe ethereum)", "score": 4, "replies": [{"body": "some cryptos have their use, such a storj, but they aren't competing with bitcoin directly.", "score": 2, "replies": []}, {"body": "You seem pretty convinced.  Is that what your crystal ball is showing you?\n", "score": -1, "replies": [{"body": "How about you do some research. People like Bill Gates and Richard Branson are predicting $20,000 USD a coin by 2018.\n\nThe decentralized system makes more sense then FIAT currency system. Eventually average people like you will be able to grasp this concept and will ultimately adopt the cryptocurrency.\n\nI am not saying FIAT currency will go away, I am just saying this will be more widely used in the long run.", "score": 3, "replies": [{"body": "Could I get some sources on the Bill Gates/Branson comments, not hating, Bitcoin enthusiast who would love to know its true :P", "score": 1, "replies": [{"body": "https://www.youtube.com/watch?v=fuH8tdQpWrU\n\nThis Video shows Branson/Gates consensus on the Cryptocurrency. They do not give an exact estimate, But I have read optimistic text from Wozniak/Gates/Branson all proclaiming that this is just the beginning.", "score": 2, "replies": [{"body": "What made you say 20k by 2018?", "score": 3, "replies": [{"body": "That was based on fair value estimates by an expert poll, which included tech CEO's. ", "score": 1, "replies": [{"body": "But you said Bill Gates/Branson said 20k by 2018 not your opinion/some polls.", "score": 2, "replies": [{"body": "Based on a poll they participated in. They didn't say it on national television\n", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If you wanna have a conversation do so, if you wanna be an asshole, fuck off.", "score": 1, "replies": [{"body": "This is /r/stocks.  Not fucking /r/bitcoin.  Why don't you kindly fuck off.\n", "score": 0, "replies": [{"body": "I was not aware the distinction between the two was one allowed cunts, at least you added kindly, now just remove the fuck off and you can have a treat.", "score": 1, "replies": [{"body": "The cunts are all over on /r/bitcoin.\n", "score": 1, "replies": [{"body": "But...I am confused? You're still here.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "What's your myspace address?", "score": 1, "replies": []}]}]}
