{"title": "Should I Buy AMD or Nvidia Stock? Only ONE Choice!", "selftext": "", "id": "w3rmy1", "created_utc": 1658336748.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 24, "comments": [{"body": "Guys if you wanna learn how to invest read a book, some of the remarks in this video are just cringe.", "score": 7, "replies": [{"body": "Really cringe, the part showing the chart and how to swing trade is like “just buy here and sell here” haha. If this guy could accurately predict those he wouldn’t be selling courses he’d be trading full time or probably retired.", "score": 2, "replies": [{"body": "haha haters going to hate", "score": 0, "replies": []}, {"body": "watch my channel ill show you near 2 years of doing it im not like the others trust me or not i dont care", "score": 0, "replies": [{"body": "Alright alright I’ll give it a go!", "score": 1, "replies": [{"body": "Cool man, and to comment on your point if I could do it I wouldn't be on youtube... Well the greatest of all time like Ronaldo football, elvis singing, or even Warren Buffet all keep going until they can't, none of them did it for the money, I actually enjoy youtube and the people I have helped, I don't say just swing trade I try to teach people to know best when to top up for their long holds and perhaps when to take profit, I'm not saying I have a magic ball I'm just teaching probabilities and patterns than smart money use every day", "score": 2, "replies": []}]}]}]}]}, {"body": "Nvidia", "score": 3, "replies": []}, {"body": "NVDA is the clear winner… you don’t even need Nancy Pelosi’s insider trading knowledge to know that.", "score": 4, "replies": [{"body": "😂 😂 😂", "score": 2, "replies": [{"body": "Sucks to suck", "score": 1, "replies": []}]}]}, {"body": "AMD", "score": 3, "replies": []}, {"body": "Both, they practically moving the same way lol", "score": 3, "replies": [{"body": "yeah thats pretty much it or AMD slight edge", "score": 1, "replies": []}, {"body": "Yeah because they're both well-established companies in the exact same sector.", "score": 1, "replies": []}]}, {"body": "LoL! I actully own both, i think amd is a better company overall, runs better... but nvidia has more potential...", "score": 3, "replies": [{"body": "yeah thats pretty much it or AMD slight edge", "score": 1, "replies": []}]}, {"body": "Nvda", "score": 3, "replies": []}, {"body": "Nvidia, they are going strong into datacenter sector and that will drive revenue up.", "score": 3, "replies": []}, {"body": "You are asking in the \"NVDA stock\" sub...", "score": 1, "replies": []}, {"body": "NANCY PELOSI husband bought $5m of Nvidia. Can we Gamestop short? Lol", "score": 1, "replies": []}, {"body": "I’m playing both sides so I always come out on top", "score": 1, "replies": [{"body": "yeah thats pretty much it or AMD slight edge", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "w3wove", "created_utc": 1658349137.0, "score": 95, "upvote_ratio": 0.94, "num_comments": 28, "comments": [{"body": "**Source**: [10kreader.com](https://www.10kreader.com/)\\] (created by me), data from [Tesla’s Shareholder Deck July 20th, 2022](https://ir.tesla.com/#tab-quarterly-disclosure)\n\n**Tool**: D3.js", "score": 13, "replies": [{"body": "Love these. Cheers 🤘", "score": 4, "replies": [{"body": "Thank you!!", "score": 1, "replies": []}]}]}, {"body": "This looks very interesting but do you happen to have a tutorial on how to read the graphic?", "score": 15, "replies": [{"body": "Thanks for pointing out that it can be quite confusing to read. What confuses you the most? The chart is read left to right (so you have revenue streams flow into revenue and then the cost of goods and gross profit flow out of revenue. Then you have more costs flowing out until you get to net income. In my book, Sankey chart is great for visualizing revenue streams as well as easily see where the money is going (so great for income statements, cash flow statements, personal finances, etc).", "score": 1, "replies": [{"body": "It's great, I love the idea! I think the second section is where most of my confusion came from. I think instead of having total revenue above GP it would make more sense for that to be labelled costs of revenue, instead of aggregating all of the revenue section into an area smaller than the first instance of that information.\n\nAlso I is there a reason for the other expenses to begin to flow below the EBT/NI line?", "score": 1, "replies": []}]}]}, {"body": "I keep running into your work! Its been great using the site more and exploring all of the data/features.", "score": 6, "replies": [{"body": "Thank you so much man! It means a lot to me! Let me know if you have any thoughts or feedback for me!", "score": 1, "replies": []}]}, {"body": "Scary thing to see a car company think it can be an investment bank at the same time.", "score": 12, "replies": [{"body": "And a sperm bank!", "score": 40, "replies": [{"body": "Haha, you win sir", "score": 2, "replies": []}]}, {"body": "Plenty of companies buy shares of other companies or other investments called MARKETABLE SECURITIES.", "score": 6, "replies": []}, {"body": "Why is that?", "score": 2, "replies": [{"body": "Stick to core business + If their business is SOOO profitable and has such a massive opportunity. Why not invest it all into the business itself?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "The cash flow from sale of digital assets is under cash flow from investing activities and is not included in cash flow from operations\n\n*learn accounting", "score": 15, "replies": [{"body": "Exactly, lol. The amount of misinformation on Reddit by people who don't really know much about the subject they are speaking about is mind-boggling.", "score": 8, "replies": []}]}, {"body": "They buy $1.5 billion of bitcoin and sell it for $936 million. A loss of $564 million. Their cash flow was $1.18 billion. So if they didn't sell their bitcoin the cash flow would of been $660 million.\n\nStill positive. Math is hard, Ouchie.", "score": -16, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Ouchiiieeeee", "score": 17, "replies": []}, {"body": "BTC isn't part of operating income, lol. Learn accounting.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sure you did... that's why you deleted your comment. And just to make you sound even more idiotic, operating cash flow is part of free cash flow so either way, the math adds up to be the same.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is a nice visualization, but I think your numbers are off (eg. automotive revenue was 14.6B in Q2). This might be Q2 2021?", "score": 2, "replies": [{"body": "You are right! Thank you so much for pointing it out! Now I will forever quadruple check I am using the right quarter!", "score": 1, "replies": []}]}, {"body": "Does Taxes include VAT? If so, it is ridiculously low.", "score": 0, "replies": []}, {"body": "Where are the subsidies factored in at?", "score": -3, "replies": [{"body": "Well you can see they only paid ~1% tax on their revenue so I’d imagine that’s been factored in", "score": 4, "replies": []}]}, {"body": "WTF is this shitty graph?", "score": -5, "replies": [{"body": "First time you’ve seen a sankey diagram I assume?", "score": 1, "replies": []}]}, {"body": "“Services and others” aka selling all your bitcoin", "score": 1, "replies": []}]}
{"title": "Buying weekly puts on SPY before Fed rate hikes, CPI/inflation reports", "selftext": " Looking at past three rate hikes; March had spy gain pre and post hike (.25% hike). May and June (.5%+) had deep drops pre and post rate hikes. CPI announcements also have significant drops \\~3 days before announcements every time this year. Of course there’s a litany more factors, but I’m looking at correlation of rate hikes dropping indexes about one week before announcements. CPI is about 3 days before announcements. Considering puts for 7-10 days expiration pre-announcements.", "id": "w3ejcr", "created_utc": 1658296137.0, "score": 17, "upvote_ratio": 0.84, "num_comments": 20, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Don't do it. There's a lot of other macro factors and sentiments that influence market movement.", "score": 16, "replies": [{"body": "and options decay hardcore every hour you hold them, correct?", "score": 1, "replies": []}]}, {"body": "If it was that simple and logic (good news long, bad news short) everyone would be billionaire", "score": 15, "replies": []}, {"body": "So SPY dropping tomorrow?", "score": 3, "replies": []}, {"body": "Weeklies are gambling don’t play with them beyond what your willing to risk.", "score": 3, "replies": [{"body": "It’s only gambling if I lose.", "score": 2, "replies": []}]}, {"body": "Market always does opposite of what people expect haven’t you learned lol", "score": 8, "replies": [{"body": "But then it also reverse reciprocates the opposites reversal. Soooo......", "score": 2, "replies": []}]}, {"body": "sure go for it and see how it plays out", "score": 2, "replies": []}, {"body": "RemindMe! three weeks", "score": 1, "replies": [{"body": "I will be messaging you in 21 days on [**2022-08-10 06:58:24 UTC**](http://www.wolframalpha.com/input/?i=2022-08-10%2006:58:24%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/w3ejcr/buying_weekly_puts_on_spy_before_fed_rate_hikes/igvyc6k/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fw3ejcr%2Fbuying_weekly_puts_on_spy_before_fed_rate_hikes%2Figvyc6k%2F%5D%0A%0ARemindMe%21%202022-08-10%2006%3A58%3A24%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20w3ejcr)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "If you MUST take action here, monitor the VIX on Wednesday next week in the afternoon. If briefly spikes and then flushes, it's pretty close to a 100% guarantee the market is going to get killed the next day no matter what.\n\nI really wish that wasn't the case, but it's gotten so simple that it's easily point out-able. If this happens, I'm likely playing it myself.", "score": 0, "replies": [{"body": "Hi Daphne, checking in Monday prior to a fun week. Today VIXY high 15.9, low 15.5, closed -1.26% down from prior.", "score": 1, "replies": []}]}, {"body": "too much bearish sentiment among RETAIL lately. I'd rather sit on the sidelines. when you short you wanna see reckless greed", "score": 0, "replies": []}, {"body": "sell puts instead when it drops don't you want to buy spy at 10% discount?", "score": 1, "replies": []}, {"body": "Why not buy 2 months ahead and average down every week? Is that worse?", "score": 1, "replies": [{"body": "You’re suggesting to long a put that expires in two months? How do you average that down?", "score": 1, "replies": [{"body": "Well, the premium drops every day/week, so you buy every time it drops. When the bad news is announced you profit from the latest buy the most and the earliest the least. That’s if it goes your way. Edit: that’s just an idea though. Am a noob when it comes to options.", "score": 1, "replies": []}]}]}]}
{"title": "WARNING: The US dollar is a scam, DO NOT INVEST!!!", "selftext": "**The Bretton Woods (aka gold standard) rug pull**\n\nBack then, the US guaranteed that the value of US dollar is pegged against the price of gold. They suddenly dropped the gold standard with no warnings and ran away with 20,000 tones of gold. This is a classical rug pull, and many countries are very mad at the US for this.\n\n**The petrodollar scam**\n\nThe US scammed many poor countries out of trillions of dollars worth of oil. They launched the OPEC scam where poor countries are required to sell all their crude oil for USD and USD only. They forced many countries into adopting the petrodollar system. They even fought wars in Afghanistan and assassinated Obasma Bin Laden just to force poor countries with lots of crude oil into selling their crude oil for USD. Now they are fighting Russia since Russia refused to sell crude oil for USD. The FED can print as much USD as it want, literally giving them unlimited free crude oil.\n\n**The biggest stock market manipulation scam ever**\n\nThe FED planned every stock market rallies and crashes in advance. Their stupid monetary policies manipulate the economy in the FED's favor. If they want the stock market to crash, they raise their stupid interest rates and make everyone sell stocks and buy debt securities, and if they want the stock market to rally, they decrease their stupid interest rates and make everyone move to stocks since their savings paid VERY LITTLE INTEREST.\n\n**The inflation scam**\n\nWhenever the US government is short on money the FED prints money. This created severe inflation that severely hurt their citizens. Back then you only need a few hundred dollars to buy a car, now you need a lot more.\n\n**What can we do?**\n\nMove all your wealth to FED-resistant assets like precious metals and cryptocurrencies ASAP!\n\n[https://www.youtube.com/watch?v=ZD42JsHjjMc](https://www.youtube.com/watch?v=ZD42JsHjjMc)", "id": "w39ysk", "created_utc": 1658282070.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 week ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w39ysk)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w39ysk)", "score": 1, "replies": [{"body": "There was a time I would agree with you but no longer Silver and Gold are manipulated into oblivion and the CFTC does NOTHING", "score": 2, "replies": []}]}, {"body": "Calls at 1000x leverage on aluminum...somebody's gonna need a *HUGE* helmet...with chinstrap...and propeller", "score": 9, "replies": [{"body": "That took me a moment I am ashamed to admit.", "score": 3, "replies": [{"body": "May be a good sign, actually... ![img](emote|t5_2th52|4270)", "score": 2, "replies": [{"body": "So that aside any way to actually get 1000x leverage?", "score": 2, "replies": [{"body": "Not that I'm aware of, realistically.", "score": 2, "replies": [{"body": "If I could I would because I’m getting better at making moves and since I usually have a net gain having that net gain multiplied by 1000 would change my fucking life lol.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Wrong place for this. This is a gambling parlor, not a political debate", "score": 15, "replies": []}, {"body": "This is what happens to your mind when you snort youtube.\n\n&#x200B;\n\nStop it, get some help.", "score": 9, "replies": []}, {"body": "I thought this was sarcasm until the end.", "score": 7, "replies": []}, {"body": "I remember when you clowns told me gold was going to $5k after we hit hyperinflation during the housing market quantitative easing. Get lost pal, you guys have been wrong about fiat and the Fed for a century", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "They make fun of the FED 24/7 but make fun of you when you point out an alternative. Completely bananas. This sub is addicted to being delusional", "score": 2, "replies": [{"body": "In 2020, r/lgbtmemes is my favorite subreddit\n\nIn 2021, r/amitheasshole is my favorite subreddit\n\nThis can be my next favorite subreddit. I am here to expose the USD as the world's biggest scam coin ever for running away with 20,000 tons of gold in August 1971.", "score": -4, "replies": []}]}, {"body": "The US does not need OPEC to sell oil for dollars. The petrodollar conspiracy is a meme used to distract people who don't understand economics, history, or current events.\n\n[The US made it illegal for OPEC member Iran to sell oil for dollars.](https://www.buzzfeednews.com/article/hayesbrown/us-iran-new-nuclear-sanctions)\n\n[The US made it illegal for OPEC member Venezuela to sell oil for dollars.](https://www.wsj.com/articles/venezuela-stops-accepting-dollars-for-oil-payments-following-u-s-sanctions-1505343161)\n\n[Most recently, the US made it illegal for Russia to sell oil for dollars.](https://www.cnn.com/2022/02/28/politics/sanctions-russia-putin-rainy-day-fund/index.html)\n\n[None of this caused the dollar to lose any value. Instead, the dollar soared to a 20 year high.](https://www.cnbc.com/2022/04/28/forex-markets-dollar-japanese-yen-bank-of-japan.html)", "score": 2, "replies": []}, {"body": "Nothing is safer and more resistance to manipulation and fraud than precious metals and crypto!!", "score": 4, "replies": [{"body": "Right? OP belongs here even if the post doesn't", "score": 7, "replies": [{"body": "Thank you!", "score": 0, "replies": [{"body": "This isn’t the compliment you think it is", "score": 9, "replies": [{"body": "This was a very wholesome exchange. Maybe theyll never know.", "score": 4, "replies": []}]}]}]}, {"body": "You were on the right track until u said crypto. It’s even more manipulated than the nasdaq", "score": 5, "replies": [{"body": "The metals market is manipulated as well, JPM even got charged, within the last couple years I think, almost a billion for basically controlling the silver market from their trading desks for a bunch of years. Even had texts of the traders talking about it, warning each other when they were gonna do something like crash the price and stop loss hunt, laughing and bragging, etc. And I think the banks like sell more of some of the metals than actually exists.", "score": 5, "replies": [{"body": "True", "score": 2, "replies": []}, {"body": "Between 2008 and 2016, JPMorgan engaged in a pattern of manipulation in the precious metals futures and U.S. Treasury futures market, the CFTC said. [https://www.reuters.com/article/jp-morgan-spoofing-penalty-idINKBN26K325](https://www.reuters.com/article/jp-morgan-spoofing-penalty-idINKBN26K325)\n\nIf they are still manipulating the precious metals market, then the regulators have been unable to catch them.\n\nAlso, if the value is so easily manipulated, then why should anybody invest in metals?", "score": 2, "replies": []}]}]}]}]}
{"title": "The plan to cap the price of Russian crude oil is 'ridiculous' and would push prices up further, energy expert says", "selftext": "Attempts by Western governments to impose a price cap on Russian oil are \"ridiculous,\" Gal Luft, the co-director of the Institute for the Analysis of Global Security said, speculating that such a measure could end up pushing prices as high as $140.\n\nEarlier this month, the US and allies floated capping the price paid for Russian oil to as little as $40 a barrel, and US Treasury Secretary Janet Yellen said last week that a cap is \"the most potent way to control\" high oil prices, and thus inflation. However, a number of energy market experts have expressed doubts since the plan was proposed.\n\n\"It's kind of a ridiculous idea in my view,\" Luft said in an interview on CNBC, noting that oil is a fungible commodity and that barrels of oil are basically interchangeable regardless of who is buying.\n\n\"That's not how oil prices work. This is a sophisticated market. You cannot force prices down. All it's going to do is cause the Russians to restrict their production,\" Luft added, speculating that Putin may retaliate against the price cap by taking more barrels off the market. \"Those Europeans and Americans talking about $40 a barrel, what they're going to get is $140 a barrel,\" he said.\n\nAlthough oil prices briefly dropped below $100 this month on recession fears, experts note the declines are likely temporary, especially as a European embargo on Russian energy supplies won't fully kick in until the end of the year.\n\nPresident Biden also left Saudi Arabia this week with no announcement of an oil production hike, leading IEA Chief Fatih Birol to call European nations to develop an emergency plan and prepare for a crisis event this winter.\n\nVia: [https://markets.businessinsider.com/news/commodities/russia-oil-price-cap-barrel-crude-western-sanctions-energy-supplies-2022-7](https://markets.businessinsider.com/news/commodities/russia-oil-price-cap-barrel-crude-western-sanctions-energy-supplies-2022-7)", "id": "w3a9uk", "created_utc": 1658282932.0, "score": 14, "upvote_ratio": 0.74, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|83|**First Seen In WSB**|1 year ago\n**Total Comments**|490|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3a9uk)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3a9uk)", "score": 1, "replies": []}, {"body": "It's not a price cap. It's called Price Controls but they don't want you know that because Nixon did the same thing with gas which sent gas soaring. They don't want to be associated with Nixon policies even though they are doing the exact same thing he did. Gas is about to sky rocket.", "score": 8, "replies": []}, {"body": "Tell it brother!\nI’m long on RIG WTI HAL LPI . People got to drive! Think of all the gas our Maseratis burn!🏎", "score": 4, "replies": []}, {"body": "Fuck russia Venezuela has alot of oil and could give a shit less about the market as the western world has them by the short hairs they could easily replace the damn Russians on oil and here in the u.s. we have a surplus of nat gas.", "score": 9, "replies": [{"body": "sometimes i wonder why the u.s. never parachuted in at night and took over venezuela.", "score": 4, "replies": [{"body": "Oh yeah, invade a Caribbean communist country always went well before!", "score": 3, "replies": [{"body": "lolz", "score": 2, "replies": []}]}, {"body": "Because Venezuela already has a democracy, so the USA can't help them to get one like in Iraq", "score": 2, "replies": [{"body": "Might wanna look that up again.", "score": 6, "replies": []}]}, {"body": "operation gideon", "score": 1, "replies": [{"body": "cagey ask dependent arrest weather quiet scandalous automatic liquid badge -- mass edited with redact.dev", "score": 1, "replies": []}]}]}, {"body": "Wow! I didn't knew Venezuela has so much oil: [Venezuela has the world's largest proven oil reserves at an estimated 304 billion barrels (18% of global reserves) as of 2020](https://en.wikipedia.org/wiki/History_of_the_Venezuelan_oil_industry)\n\nYou are right that Biden should start making friends in Venezuela and stop making a fool of himself with the Saudis", "score": 3, "replies": []}, {"body": "Venezuela is russias ally, they won't cooperate", "score": 1, "replies": []}, {"body": "They probably have to pay in bitcoin:)", "score": 1, "replies": []}]}, {"body": "Awww you think they care about oil prices... You're cute.  They just looking to fuck Vlad.", "score": 4, "replies": []}, {"body": "Gal Luft is some doughboy Jared from Subway looking motherfucker that tweets homophobic shit about our military cause they support pride month. He’s an idiot fear monger selling you snake oil.", "score": 2, "replies": []}, {"body": "They need to make make bank to make up for the cheap gas under Trump.", "score": 1, "replies": []}, {"body": "That's literally not how oil works buddy Stop believing the propaganda.", "score": -1, "replies": [{"body": "Ok teacher, tell us how it works and why this \"energy expert\" is wrong", "score": 1, "replies": [{"body": "Multiple EU nations have Long Term Contract with Russia for Oil & Gas supply. If G7 imposes a price cap. Then it is most likely in breach of LTC contract. Probably will open up new T&Cs negotiation which is likely to be more favorable towards Russia than EU. \n\n\nBesides we get oil from India atm that comes from Russia.\n\nThe idea that a price cap will work fails on the fundamental fact that there is only finite amount of cheap Russian crude oil available and a refinery demand that is far far bigger.\n\nInstigating a market cap, tells whole market that it is ok to buy Cheap Russian crude. So all refiners that self-sanctioned will come back to market to buy it. Russian production will increase, but because it is cheap, demand will severely outstrip supply. So how to allocate?\n\n\nYou cannot. Buyers will cheat to get cheap crude which is still well below the alternative marginal barrel price. It will end up being those that pay most that get barrels. That price will be well above what Russia gets now and with the added volume. Russia makes more money.\n\nDo you think someone in the oil market will stick to a $60 cap, run the risk of not getting the oil and having to pay $110? Do you not think they will offer $80 or $90? Just think Marc Rich, trading houses caught for brides, the Chinese buying Iranian, etc.", "score": -1, "replies": []}]}]}, {"body": "The analist got scared that his longs will start bleeding, because none from what he says is actually making sense. Cap it, cap it now!", "score": 1, "replies": []}, {"body": "Just ask Joey and da Ho “price controls work”? Right???  Giggle giggle giggle.\n😂", "score": 1, "replies": []}]}
{"title": "Netflix Sees Return to Growth After Million-Customer Loss", "selftext": "After losing more than a million customers in the first half of 2022, Netflix Inc has a message for investors: It could have been worse.\n\nThe leader in paid streaming TV lost 970,000 subscribers in the second quarter, according to a statement Tuesday. That was less than half what Wall Street feared, thanks in large part to a new season of “Stranger Things,” the service’s most popular English-language series.\n\n\nhttps://www.bloomberg.com/news/articles/2022-07-19/netflix-sees-return-to-growth-after-losing-1-million-customers", "id": "w3b0ai", "created_utc": 1658285044.0, "score": 8, "upvote_ratio": 0.69, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|21|**First Seen In WSB**|10 months ago\n**Total Comments**|115|**Previous DD**|\n**Account Age**|11 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3b0ai)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3b0ai)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "They premieried ST near the end of the second quarter and then provided the last two episodes minutes after the quarter ended.  There would have been a brief growth in subscriptions and fall for no change within the quarter if they scheduled the release all at once.\n\nNow that’s how you pump!", "score": 1, "replies": []}]}, {"body": "One may be inclined to ask. How does a company lose 975k subscribers and go \" We forecast to gain even more in the next quarter\".  Not one person in corporate was like, \" okay..  where's the common denominator here?\" . Just curious.", "score": 11, "replies": [{"body": "But because they were supposed too lose 2-million and only lost 1/2 they think that is great news ??? Puts on NFLX..,", "score": 11, "replies": [{"body": "Calls bro.. they see puts coming now.", "score": 3, "replies": []}, {"body": "Two point curve.", "score": 3, "replies": [{"body": "What you mean", "score": 1, "replies": []}]}]}, {"body": "When they roll out the Ad tier they will have a \"net gain\" in overall subscribers.", "score": 3, "replies": [{"body": "They will become HULU.", "score": 1, "replies": []}]}, {"body": "Facts", "score": 1, "replies": []}, {"body": "they're timing the market, cant go tits up", "score": 1, "replies": [{"body": "Better not tell you now", "score": 1, "replies": []}]}]}, {"body": "Am I the only person who thinks that show is nothing but 80s nostalgia garbage?", "score": 11, "replies": [{"body": "Every modern 80s thing never mentions everyone being broke AF and 12% mortgages with an upcoming 5 year ARM adjustment looming over everyone’s heads.", "score": 8, "replies": [{"body": "Yeah that's how nostalgia works.  You only remember the fun parts, not the psycho hyper moral groups that called everything satanic, the shitty cars, aids killing people left and right and the disgusting food.", "score": -1, "replies": [{"body": "I’m just enjoying watching the economy do an 80s nostalgia thing, complete with 70s clueless Fed. Hahaha.", "score": 3, "replies": []}, {"body": "Interesting. The most recent season of Stranger Things was about people using Satanic Panic to chase down an innocent man who lived in a trailer park, while those helping him drive around in their terrible eighties cars.", "score": 0, "replies": []}]}]}, {"body": "Hater![img](emote|t5_2th52|4267)", "score": 3, "replies": [{"body": "I guess.\n\nI sat through 3 episodes, against my will, and it was the fucking stupidest shit I've seen in ages.", "score": 1, "replies": [{"body": "You saw 3 episodes... and there are 4 seasons. Then you state that the whole thing is garbage. gtfo", "score": 2, "replies": [{"body": "So I should sit through 37 more episodes... For what to still think it's garbage... And give Netflix data saying someone else watched it so they keep making it\n\nNo thanks", "score": 2, "replies": []}]}, {"body": "BAN", "score": 1, "replies": []}]}]}, {"body": "I cant stand the retarded kids. Maybe if it was an older cast. I have no idea why it’s popular when it’s grating on the brain every time they talk", "score": 2, "replies": []}, {"body": "Am I the only one that just watches all the actual decent Netflix content on dopebox.to and ignores the subscription all together?", "score": 1, "replies": []}]}, {"body": "Return to growth and not as much of a loss... are not the same things.", "score": 2, "replies": []}, {"body": "Netflix is rubbish, where is the Reddit IPO, i want to buy porn stocks", "score": 0, "replies": []}, {"body": "Exela to the moon!! 🚀 Calling all 🦍 to join the fight", "score": 1, "replies": []}]}
{"title": "NVAX going Brrrrr", "selftext": "Hear me out degens. After holding out for long, FDA couldn't contain Novavax and CDC just unanimously gave their blessings today. Now with the much lower float and higher short interest then both Pfizer and Moderna how big is the short squeeze going to be? \n\n\nMe thinks GME 2.0\nWhat's you guys' take on this? Retarded answers only [not really]", "id": "w3cfh3", "created_utc": 1658289260.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|43|**First Seen In WSB**|7 months ago\n**Total Comments**|269|**Previous DD**|\n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3cfh3)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3cfh3)", "score": 1, "replies": []}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}, {"body": "I'm already 200 shares in", "score": 5, "replies": []}, {"body": "im a NVAX clown too homie, i def. believe in the product and w/ people having to get jabs forever i do think there will be some adoption in the future w/ boomers and greenie weenies who dont want mRNA in their bodies, however, im skeptical of the income stream from all this.  if the overseas stats show anything its that govt's are buying the doses but people aren't concerned about taking them, uptake is slow and will prob. remain slow.  they will get bursts of revenue from govt's buying but thats prob. it.    im a buyer at or below 50.", "score": 6, "replies": [{"body": "I think most people focus too much on the COVID aspect. Although that's where the money is rn, think about the other pipelines they got coming in. The advantage Novavax has over the others especially mRNA vaccines:\n\nMade using traditional ways (people don't want to a guinea pig for mRNA vaccines until enough supporting data shows it's the future of medicine).\n\nThe cost and easy of storage means Novavax will have a competitive advantage.\n\nHigh efficacy and longer protection period then mRNA vaccines is always a plus.\n\nUnlike the others, Novavax has not been taking shortcuts or in bed with FDA so that restores peoples confidence about their product. \n\nLol you wait for 50 and one day you wake up that beast will be $500😂", "score": 4, "replies": [{"body": "ya i think 500 is out the question, it should def be in line w/ the other biotechs in the industry like moderna and pfizer, it is lagging behind in that case but i do think it will catch up.  75-100 probably fair value in a few months.", "score": 3, "replies": []}, {"body": "I will sell you my shares for $45 and I'll throw in some options too.", "score": 1, "replies": []}]}]}, {"body": "Yeah so they are so late to the game IDK how much money they making off this now. \n\nAs some background at my last CDMO I designed their quillaja adjuvant purification line. My current CDMO does some cationic lipids for the MRNA vaccines.\n\nI can tell you right now production demand is ramping down hard.\n\nNo one really wants covid vacines anymore. \n\nGood luck though.", "score": 7, "replies": [{"body": "Hahaha late? You're not one of those people that thinks the pandemic is over are you? \nmRNA vaccines bought us some time but their ability NOT to protect anybody for more than about 2 month only is a big joke. \n\nWait until Novavax comes out with their Nano Flu (covid/flu combo vaccine?", "score": -3, "replies": [{"body": "You know, not often you get a direct feedback from someone who literally makes the pharmasuetical products.\n\nI don't really care if the pandemic is over or not, what I can see is order flow from customers and how massive plants are gearing for production.\n\nIt is ramping down. Do what you want with that.", "score": 7, "replies": [{"body": "Please forgive the idiots.  He probably bought at the peak", "score": 0, "replies": []}]}, {"body": "As someone who is totally pro vaccine, how the hell are you ignoring the obvious.  Most of the demand is gone.  People who wanted vaccines have gotten them.  Hence why the guy who just told you about his experience working on making them is seeing declining demand.  \n\nAdd to that their efficacy numbers weren't spectacular and the relatively few doses that have been given to the public in other countries are seeing some significant risk of side effects. \n\nThis is going to crash hard when earnings aren't what people think they are going to be.", "score": 1, "replies": [{"body": "Come back to me with your claim about demand during the flu season. As for effectiveness, Novavax has a much better protection then the mRNA vaccines. Even CDC was excited to have \"another TRADITIONAL VACCINE\". \n\nPfizer tried to hide their trial data for 75 years and FDA was part of that sham too so guess what? When there is another booster this flu season, a lot of people gonna dodge the mRNAs and switch over to Novavax.", "score": 1, "replies": []}]}, {"body": "I've been waiting a long a$$ time for their flu/covid combo......\n\nThink I'm done waiting with this turd they call an earnings report.", "score": 1, "replies": []}, {"body": "Well man I tried to tell you.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "like what?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The adjuvant is made from tree bark. Shit was a bitch to purify.", "score": 0, "replies": []}]}]}]}]}, {"body": "Up 4 dollars in 15 minutes this morning", "score": 3, "replies": [{"body": "You haven't seen nothing yet😎🤑🤑", "score": 3, "replies": []}]}, {"body": "See you in 6 months, I'll have the lotion and catch rag ready.", "score": 3, "replies": []}, {"body": "I have 613 shares buy in is 103$ if you compare to Moderna there is a huge upside potential. The main reason I bought it, the vaccine last longer then the mRNA. Also there is a brought immune response to other variants. So in my opinion they have the best vaccine on the market. Covid is here to stay. Just wait for winter when the cases are rising again.", "score": 2, "replies": []}, {"body": "there's definitely something fucky going on with NVAX. Seemed like the FDA were giving preferential treatment to the competitors. But it climbed to 71 in anticipation of the FDA announcement only to drop hard immediately after. \n\nI think the same thing will happen with the CDC announcement.", "score": 1, "replies": [{"body": "Nah I worked on their product, and ironically long before that I used to day trade NVAX when they were on their way to a penny stock for kicks n shit.\n\nHorrible, absolutely horrible management. They bungled what otherwise could have been a really competative product. \n\nIf you look into their history they have been losing investors money for thirty some years. Nano flue (and I guess now their covid vax) are the **FIRST** products to market in that time. \n\nOnly thing their C-Suites know how to do is transfer money from your pocket into theirs.", "score": 6, "replies": [{"body": "I agree management isn't the best but the company has a solid potential. It's a great buyout prospect and BP might just do that. The CEO is getting up there in age and he'll have to retire soon. Change is definitely coming. \n\nLook at their cash on hand low float. They're guiding a revenue of $4-5 BILLION in 2022. The growth will be insane from here on out. Let see what happens.", "score": 3, "replies": [{"body": "\"Management isn't the best\" seems to be a gross understatement. How do you give guidance of $4-5 billion when guidance wasn't even necessary, just optional, and then cut it in half less than 3 months later?", "score": 1, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4271)More like rrrrrrrrb. ![img](emote|t5_2th52|4271)", "score": 0, "replies": []}]}
{"title": "Tesla!", "selftext": "[deleted]", "id": "w3pato", "created_utc": 1658331129.0, "score": 8, "upvote_ratio": 0.7, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|3 weeks ago\n**Total Comments**|159|**Previous DD**|\n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3pato)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3pato)", "score": 1, "replies": []}, {"body": "Check out TSLQ (it’s a Tesla bear ETF) and buy some puts there too.", "score": 2, "replies": [{"body": "Ok", "score": 2, "replies": []}, {"body": "Havent had much luck getting put orders filled", "score": 2, "replies": []}]}, {"body": "How the fuck is this a yolo lmfao", "score": -4, "replies": [{"body": "I guess 99.94% portfolio diversity?", "score": 11, "replies": [{"body": "Yep", "score": 5, "replies": []}]}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Industry leading electric vehicle company", "score": 1, "replies": []}]}, {"body": "Best of luck to you. This a call or a put. Also I just invested on tslq which is a Tesla etf and way cheaper. I got 2 puts on it cause it's bearish so I want Tesla to go up", "score": 1, "replies": [{"body": "This is shares. I quit options play", "score": 4, "replies": [{"body": "Lame but reasonable", "score": 2, "replies": [{"body": "I know lost 10k this month so stepping away from gambling", "score": 5, "replies": [{"body": "To be fair, you're still gambling, you're just playing a different game.", "score": 3, "replies": [{"body": "I follow two rules buying stocks.\n\nA) i do not buy stock where companies could go bankrupt over night.\nB) i buy it with money only that I don’t have to use in 6 months to 2 year. That way. I don’t have to sell it in loss. \n\nNew rules lol", "score": 3, "replies": []}]}, {"body": "Investing*", "score": 0, "replies": []}]}]}]}]}, {"body": "You should have bought a far dated call and and sold csp's with the rest.. poised for a drop 2nd half 9f this year.. I'd have bought a put..", "score": 1, "replies": [{"body": "No too risky even if it goes down i can wait. I lost 10k with options just this month. Staying away from it. If shares goes down i can wait", "score": 1, "replies": [{"body": "Buy contracts for January instead of Friday", "score": 1, "replies": [{"body": "Nah I don’t do options. Taking a break for 4 months.!", "score": 2, "replies": []}]}]}]}, {"body": "good call", "score": 1, "replies": [{"body": "Thanks what you suggested hold till tomorrow?", "score": 1, "replies": []}]}]}
{"title": "RKT the Spanish Inquisition of meme stocks", "selftext": "Looking back at the GME and AMC runs of that last year. We can draw a few conclusions on why they worked. They blindsided the Hedgies because who in their right mind would invest in game stop? Digital downloads should be making game stop be irrelevant. Yet a hand full of smart people could see this was overblown and GME has growth and life ahead of it. AMC was all so declared dead by Wallstreet because of covid. \n\nI present you with RKT. Rocket mortgage. Right now Rocket been beaten to its knees with the rest of the market. Housing is been declared dead. Rightfully so most would add with rates going up mortgages slowing. Sound familiar, no one on Wallstreet wants to touch this company or retail for that matter. It’s how you can bleed a stock down over 50% from its highs. It’s when people are dead set on a companies doom that we have the most opportunity. Ask you self this, arnt we all cheering for the housing market to crash so we can buy a home ourselves. That demand for a home is why housing never truly dies. It will correct like any market but in the end of the day people want to own homes, go to the movies and go down to the game store to bullshit and buy the new copy of call of duty. \n\nThe other thing that GME and AMC had going for it was high short Interest and a small float. Rough estimates on RKT shot interest sitting at 31%. I say rough because as we know shorts have ways to manipulate this data. Shares are also hard to short at the current moment and expensive. \n\nLike GME before it’s squeeze the sellers in RKT have been largely exhausted. I can confidently say this by just looking at todays trading action. CNBC top page articles was about the slowing housing market. “Mortgage demand drops to a 22-year low as higher interest rates and inflation crush homebuyers” and “June home sales fall 5.4% from May, as prices set yet another record.”\nDespite these headlines RKT was up 1.6% as of me writing this. \n\nHow is this possible? Because of 3 things.\n\n1. We have reached a bottom in sellers. The people who bought this at 20 have either sold are now longs. \n\n2. The market is forward looking and like me a lot of people are starting to think we saw the peak of inflation. Gas is coming down a number of commodity’s have come down a lot very recently. Feds going to raise another .75 or a full point. The effect of which should bring down inflation further. If inflation chills out we can see the fed Slow down. Rates for home loans will follow suite. If and in my opinion when recession. Is declared on the as we creep close to an election. The fed will be hard pressed to remain hawks as the economy worsens. They would likely cut rates to bring back jobs. If the worst is behinds us when we have chill adjustment period with rates staying even for a while. Still much better for the housing market. RKT lender is the largest and has the most capital of all the mortgage players to take advantage when they rates turn\n\n3. COE and CFO have been buying the dip. They have been in the The mortgage business for over 30 years. They know how to play these cycles. 08 being a prime example while other mortgage lenders went belly up RKT took advantage of the carnage in the following years and 3 to 4xed the company to over take wellsfargo as the largest lender in the country. \n\nRKT to me is a rocket just waiting for buyers to trigger the launch sequence.", "id": "w3vdlg", "created_utc": 1658345877.0, "score": 4, "upvote_ratio": 0.61, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|103|**First Seen In WSB**|1 year ago\n**Total Comments**|209|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/oc2ez0/why_rkt_will_and_should_moon/) [x](https://www.reddit.com/r/wallstreetbets/comments/q485mp/rkt_is_a_coiled_spring/) [x](https://www.reddit.com/r/wallstreetbets/comments/sag8tn/my_rkt_and_uwm_theory/) [x](https://www.reddit.com/r/wallstreetbets/comments/qiz3z2/rkt_and_salesforce_why_its_a_big_deal/) [x](https://www.reddit.com/r/wallstreetbets/comments/rkpyu0/why_rkt_is_the_next_amazon_of_finance/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3vdlg)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3vdlg)", "score": 1, "replies": []}, {"body": "How big are your bags?", "score": 13, "replies": [{"body": "You can see them from space.", "score": 9, "replies": []}, {"body": "About 500 Dimond shares and two options", "score": 2, "replies": []}]}, {"body": "nope.  in the current market this is the complete wrong type of stock you want to be in.  mortgages and loans are fucked/ RKT is fucked.  houses are fucked.  nobody is using rkt.", "score": 5, "replies": []}, {"body": "I smell a RKT bag holder.", "score": 3, "replies": []}, {"body": "I think you're too early. Not wrong. But too early.", "score": 4, "replies": [{"body": "I think we see a market rally until CPI is out. It just depends on if we saw the peak or not. Next CPI is like ground hogs day of bull or bear market. If am early I mostly hold shares I can wait it’s only a matter of time before this plays out. And shit it it goes lower am just going to buy more they have a billion in cash and refied their debits out several years. Their a profitable company and can stay that way by cutting if need be. It comes down to who’s going to weather the storm best in this market and RKT is the best equipped boat.", "score": 2, "replies": []}]}, {"body": "RKT back on shill. Must buy more GME", "score": 3, "replies": [{"body": "Call me a shill all you want but I have always been bullish on the company because it’s a good company.  In my opinion the markets never seen its value and some point it will. The fact that I have the WSB badges to prove I give zero fucks what anyone thinks is enough for me.\n\nIf I was a paper handed I would have sold a long time ago. Na am here and when I get my lambo I’ll be around to pick your wife up.", "score": 3, "replies": []}]}, {"body": "Yea lots of insider buying and greedy shorts.", "score": 2, "replies": []}, {"body": "Now look at the whole RKT/mortgage sector from an opposite angle. This is an approach I often used in my studies when I was asked to present a solution to a problem.  If I offered you $1,000 and I asked you to write an article that would convince all of your readers why investing in mortgage stocks and RKT is a bad idea, be objective, really, how would you  do that? What would you say? If you can't, that means you do not know your craft well. You have insufficient knowledge.   \n\n\nYeah, I would like to see RKT' share price soar as well. I am long in RKT since March 2021. I am also well aware that the short interest has tripled since then. Also, its short borrowing rate has more than doubled.  Many of us who stayed with RKT while the share price tanked probably less likely to let their shares go at the current market price.  RKT's share price has been on the rise since Mid-June. Meanwhile, the daily short ratio volume has been 60% or above of the daily volume for a long time. This suggests that the share price has been suppressed. RKT has been the target of big shorty.  \n\n\nNot sure if I posted it here, possibly, it was on Yahoo finance! that things wouldn't improve for RKT until after Q2 due to a few reasons we all are familiar with (i.e. inflation/interest rates continue to  rise).  The silver lining is that when things peak, they tend to travels in one direction, downward. Now, there is the fear of recession is looming in the market. This is also not a good news for the sector. If the FED could avoid it, then it is for the better for RKT longs.   \n\n\nFor me, I just need the heavy lifters to grow some balls and come to play with us.  A one-third of RKT floating shares have been shorted.  I'd like to see great revenues being generated in Q2 if not with also profit margin-I doubt it. If the company can show that its market share has grown with its revenues maybe also better than zero profits, then the share price may not move below $7 again. This is a company that generates billions and really good percentage of profit every quarter. This is not a losing stock not even during the market downturn.  This is a much better stock than GME and AMC.  But, investors are fixated on the thought that the volume of home mortgage has shrunk, profits disappeared. However, mortgage stocks gets investors' attention when the interest rates peak and it is about to reverse. So whatever market decides its value by then, share price has to start moving upward.   \nThe question I'd like ask is what those who have short position in RKT are waiting for if the share price is not to move downward any longer while considering the aforementioned reasons. In the last two trading days, RKT short volume ratio was over 70% and 60%, respectively. The stock price didn't move downward. Friday was an option day, so I took twenty-one cents drop as normal. One may argue that the short ratio has been on the rise lately because they know the share price will tank after the Q2 report is released. Yeah, well, that did not work well as intended, did it?.  The daily volume is low and we are not letting are shares go at the current price level.  The longer shorts hold onto their position, the more it is going to get costly for them.  I read a couple of well written articles, back in March 2021 at the time RKT hit $43 and another last summer, by individuals with credentials. They predicted what was going to have with mortgage sector and RKT particularly.  They were spot on. However, neither of them predicted RKT was going to be trading at the current level. The lowest of the estimation was $11-$13 range.  We went beyond it.  So that is my hope that, we may not see $7 again. However, I have said multiple times at Yahoo! finance website that, I would write only puts under $8 and I would not buy calls if it was trading above $7.  That is still what I intend to do.  \nWish you us, the longs, all the best!", "score": 2, "replies": [{"body": "Agreeded i Am not 100 on what causes the dam to break. I feel like we are close to a squeeze.", "score": 1, "replies": [{"body": "The short volume was down slightly, 1.09% or 370K shares, in the first half of the month of July. I was expecting it to go up another 4%-5% since the short ratio has been at or above 60% during the same period except one day when it dived to 40% though the daily volume was not significantly different than any other trading days. However, the short volume was up 3.63% while the days to cover the short volume is down to 9.47 days from 10.3 days as of July 15th compared with the earlier month.\n\nRKT's share price was 7.36 at the closing of June 30th. It reached $8.99 at the closing of July 15th. That is 22.15% lift in ten trading days. Remember that the daily short volume has been at or above 60% of the daily volume. That may have discouraged many retail investors. 370,000 shares is 1.09% of the short volume and .035% of the floating shares. Imagine what happens when long terms buyers are interested in this stock and maybe short ratio shrinks by 10%. \n\n&#x200B;\n\nI don't expect flattering numbers in Q2, who would, right?, but if we see something encouraging in terms of revenues, loan volume, anything, and probably, this may the last major lift in rates by the FED, then two issues will play important role as to whether RKT' share price picks up: 1)I read that although housing inventory is tight, the drop in sale volume will force home prices to come down which may encourage buyers for purchasing\\*. 2) When mortgage loan rate is peaked, it will move in one direction, downward. In other words, both of the options may allow big and retail investors to realign their portfolios. If the share price may not drop significantly from this point on, the question we need ask is why would shorts not be attempted to start closing their position? If something can be catalyst for a buying spree, I think that we could witness a period of panic buy.\n\n&#x200B;\n\n\\*Getting a discount at the beginning can be better than receiving lower mortgage rates due to Time value of Money and that home loans are paid off in 10 years on average. Particularly, if you are shopping at a location where the home prices are predicted to rise in the future, it may not be a bad idea.", "score": 1, "replies": []}]}]}, {"body": "I have puts on rocket. One of the most overvalued stocks out there. They will lose money for several quarters. Retail margins AND volume are still shrinking.", "score": 1, "replies": [{"body": "Up 44% for the month how’s that going for you?", "score": 1, "replies": [{"body": "Down 36% YTD, how's that going for you? I'm doing great!  \n\n\nhttps://www.reddit.com/r/wallstreetbets/comments/sx84h3/rocket\\_is\\_gonna\\_crash/", "score": 0, "replies": [{"body": "How’s those puts?", "score": 1, "replies": []}]}]}]}, {"body": "How are those calls?", "score": 1, "replies": [{"body": "No bad 10 and climbing.", "score": 1, "replies": []}]}]}
{"title": "Why you should buy CLOV calls", "selftext": "1- you know how things only seem to happen when you’re looking in the other direction? \n\n2-nobody has mentioned CLOV in like… months \n\n3- their YOY revenue was above 300% which seems bullish? Who knows. Could be bearish. I actually don’t even care. \n\n4- contracts super cheap because nobody is buying it. You know what that means right? Bottom is in. \n\n5- wait, cost of revenue is up 300% also? What does that even mean \n\n6- hold on guys. -8% profit margin?  \n\n7- so ok someone please explain to me how revenue can go up 350% but net income down 55%?\n\n8-is money real? \n\n9- ok so I figured it out. Net income was down over 6000% a year ago. Now it’s only down 55%. The net profit margin was -82% and now it’s only -8%. Basically I have no idea how this business is operating or paying employees and sounds like a scam. Which of course means I’m in. \n\n10- I just want to fuck with the algos. TSLA to $2000 EOY. Or $0. Who knows? I’ll be poor either way. Unless it happens to take off on a Friday. 0dte’s are all I can afford anymore.", "id": "w3vizv", "created_utc": 1658346254.0, "score": 10, "upvote_ratio": 0.68, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|1 year ago\n**Total Comments**|398|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3vizv)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3vizv)", "score": 1, "replies": []}, {"body": "I’m in and HODLing.  It’s worth more to wait than it is to cash out what left.  To the moon.  And California HMO’s.  ![gif](emote|free_emotes_pack|flip_out)", "score": 8, "replies": [{"body": "I’m -70% with clov", "score": 7, "replies": [{"body": "Let’s hope time rewards us.", "score": 5, "replies": []}, {"body": "Same here, I’m buying more and HODLing", "score": 2, "replies": []}]}]}, {"body": "I'm in!! options on this are cheap", "score": 7, "replies": []}, {"body": "I lost like 30k in this stock but tbh the bottom seems to be in. Bad news? no biggie itll go back to sub 2.10.\nOn the other hand alot upside for long calls here, especially the way theyre growing", "score": 5, "replies": []}, {"body": "As someone who has been in clov for over a year now, I could never recommend anyone gets involved with it. Do I think it will easily double it's current price, yes but I'm just a retarded ape who bought clov so what do I know.", "score": 5, "replies": []}, {"body": "Yes, all of you buy CLOV. Tell your friends, tell your parents, it’s the greatest bargain of all time. I implore you, buy this and nothing but this.", "score": 6, "replies": []}, {"body": "what does CLOV even do?", "score": 5, "replies": [{"body": "they are a medicare insurance company for old people, except they use that side of their business to build an AI platform called clover assistant, which is an app for doctors to pull up patient data in a more modern way and even recieve AI suggestions based on the wealth of insurance / health data, bla bla bla it is AI / Tech / Medicare Insurance for old people funded by the federal government the more patients they get, which also make their app better with each patient data set.  also they can license the app to other providers to use to grow their ecosystem\n\n&#x200B;\n\nonly problem is they are in like 10 states still so they have a lot of growth to do still", "score": 8, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}]}, {"body": "It's the monthly definitely not pump and dump stock, that for some reason hasn't been pumped for a few months", "score": 3, "replies": []}, {"body": "creates bagholders", "score": 11, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 1, "replies": []}, {"body": "Haha", "score": 1, "replies": []}]}, {"body": "Something something medical insurance, nobody really knows", "score": 2, "replies": []}]}, {"body": "It’s been up 19% since Jun 21, what is your position", "score": 2, "replies": []}, {"body": "Cool CLOV fact: It's cost of goods sold is higher than its revenues, meaning it loses money before even paying for Marketing, R&D, Admin, Rent, etc, etc, etc\n\nOne of the biggest dumpster fires I've ever seen in the public markets.", "score": 3, "replies": [{"body": "Right. That's why it lost only 8% of revenue", "score": 1, "replies": []}]}, {"body": "So is it a scam or not? I’m down 6k and going to buy 1.5k shares more and quit and hope for a rebound one day LOL", "score": 1, "replies": [{"body": "It would need a miracle to make money. Roll your money into something exciting. Like idk. Weed stocks or pharma.", "score": -1, "replies": []}, {"body": "Did you buy the $6k at $2.4 20 days ago and sell at $3.4?", "score": 1, "replies": []}]}, {"body": "If CLOV bag holders like you and I were a character in a movie, that character would be the girl at the bottom the well in Silence of the Lambs.  Now put the lotion on your skin.", "score": 0, "replies": [{"body": "Bruh I made a shit ton of money off the CLOV hype and then never touched it again haha it’s a shit company. \n\nI’m just fucking with the algos here. Mentioning dead meme stocks.", "score": 1, "replies": [{"body": "You did great making this pop 40% from June lows. Thanks", "score": 2, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "w3wk1u", "created_utc": 1658348807.0, "score": 64, "upvote_ratio": 0.87, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|10 months ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3wk1u)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3wk1u)", "score": 2, "replies": []}, {"body": "They should skip the morning coffee and try lentils instead of meat. That should help", "score": 31, "replies": [{"body": "And stop milking almonds, for fuck's sake...", "score": 4, "replies": [{"body": "I tried once but I couldn't find the titty", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "Yeah but \"Blackrock investors are down the exact amount of money the shit they are invested in is down because that's how investing works.\" just doesn't bring the clicks.", "score": 4, "replies": []}]}, {"body": "Of course they lost money.  All of the ETF's, mutual funds and other products are down for the year and the story is probably the same for all other asset managers.  They are still getting paid but the fees will be lower.  Probably a good time to buy the stock.  They have a nice growing dividend.", "score": 12, "replies": [{"body": "Yeah, they way they phrased this ignores the fact that they out performed the SP500", "score": 13, "replies": []}]}, {"body": "Didn’t realize blackrock employs all of this sub", "score": 17, "replies": []}, {"body": "Wrong. They lost client's money. The apes here lose their kids' college funds. Big difference.", "score": 17, "replies": [{"body": "Lol the apes here are leveraging their part time dog walker money on GME", "score": 13, "replies": [{"body": "I tried to be diplomatic and not talk about all the piggy banks slaughtered and cash borrowed from moms.", "score": 1, "replies": []}]}, {"body": "Jokes on you. No kids and still poor.", "score": 12, "replies": []}]}, {"body": "That means they're beating the S&P 500, moran.", "score": 10, "replies": []}, {"body": "I mean, 1.7 trillion for them is like a 10% loss. It's not as bad as it's made out to be. It still sucks though.", "score": 8, "replies": [{"body": "So, a decimation, then?", "score": 2, "replies": []}, {"body": "I'm pretty sure it has less to do with the nominal amount and more with which clients got screwed over. 10% is quite a lot by regulation standards. I sire hope whoever was responsible for thar keeps things in mind. Also losing that kind of money can hurt future growth, blackrock still competes with others in the risk management space such as FMR and I think it's more to do with reputation honestly.\n\nKind of like the Johnny vs ber Heard case, Johnny doesn't give a damn about the money. It's easy to make it. What is concerning is the reputational hit.", "score": 0, "replies": [{"body": "No it doesn’t. -10% is still market out performance", "score": 6, "replies": [{"body": "Cool story bro, now let me read you a story about their breakdown of extra charges", "score": 0, "replies": []}]}]}]}, {"body": "Bloomberg clickbait. Unrealized loss in line with market.", "score": 4, "replies": []}, {"body": "Okay who cares? I can lose my own money myself", "score": 2, "replies": []}, {"body": "paywall to read", "score": 2, "replies": []}, {"body": "Now we know that there were tables to be vfx turned.", "score": 2, "replies": []}, {"body": "Good , hope they lose a few trillion more", "score": 2, "replies": []}, {"body": "I heard they are hiring Cathie Wood to straighten things out.", "score": 2, "replies": []}, {"body": "Yes, yes, yes. Love it. Hope they lose it all. F@#k black rock.", "score": 2, "replies": []}, {"body": "Clickbait", "score": 0, "replies": []}, {"body": "BlackRock has just lost 1.7 TRILLION dollars of their CLIENTS money... breaking all the wrong kinds of records. They belong here.", "score": 1, "replies": []}]}
{"title": "Hate me all you want, retards, but I’m actually betting on China.", "selftext": "TL;DR Shut the fuck up and just read.\nOkay so China has been trying to get their Yuan to drop for a while now. They’re in competition with the Ruble, Lira, even the fucking Euro right now. Massive retard sausage fest seeing who can piss more on their balls while sitting on the toilet. Name me one large country who isn’t indebted to China. Can’t. Shut up. Alright so because of this crazy economy, China has actually racked up some debt as well. Their debt is more than 250% of GDP, higher than the fucking United States of Fuckwads. $13Trillion debt in U.S. dollars (although we’re around $30) isn’t anything to joke about… EXCEPT IT IS FUCKERS. China can literally do anything they want and they’re doing it right. So here’s the game plan. China has a shit ton of debt in Yuan. Crush their currency by magically printing tons and tons of money. More money = more inflation. But who gives a shit about inflation when you can take your citizens money. Now they have all this money that they can pay their debt off. Okay so Ruble is gone, Lira is going, whoever else that doesn’t use oyster shells and sand dollars is going to Yuan. Bam! Pay off shit ton of debt, have other countries use the money that was printed so it doesn’t all stay in your country. He fucking Trumped Trump. We need this Whiney Pooh to pull a JFK for us as well. P.S. this is not a commy post and I do not support China but I believe in going long in the Yuan for those reasons.", "id": "w3wui8", "created_utc": 1658349531.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 year ago\n**Total Comments**|27|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3wui8)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3wui8)", "score": 1, "replies": []}, {"body": "No one hates you. We just think you’re fuckin retarded.", "score": 15, "replies": [{"body": "So I belong 😍", "score": 1, "replies": [{"body": "Not retarded in the good way.", "score": 10, "replies": [{"body": "There's a good way?", "score": 1, "replies": []}]}, {"body": "go look up the definition of tl;dr PLEASE!!! you scammer", "score": 1, "replies": []}]}]}, {"body": "Yeah, bet on a country that is parking tanks in front of their banks.  This is full retard mode.  Godspeed and good luck, retard.  Just make sure your butthole is warm, you might need it after you lose everything.", "score": 8, "replies": [{"body": "warm and with a bottle of lube nearby ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "I hear ya. I'd move to China if I were you..\n\nIt's pleasant for most of the billion prisoners...", "score": 4, "replies": []}, {"body": "Commenting so I can come back", "score": 3, "replies": [{"body": "Did you come back yet?", "score": 1, "replies": [{"body": "I did. It went as expected. But I was intrigued the outcome", "score": 2, "replies": []}]}]}, {"body": "BA.5", "score": 2, "replies": []}, {"body": "Don’t trust China, China is asshole.", "score": 2, "replies": []}, {"body": "Blackrock just lost 3 trillion dollars in China as while as 35 other big investors lost another 8 trillion , you think you are buying the dip there , just remember this , you can never trust the communists about anything", "score": 2, "replies": []}, {"body": "You are long the Yuan, because you think it will suffer massive inflation?\n\nYeah, you're retarded.", "score": 2, "replies": []}, {"body": "That's some deep shit. Have you ever considered applying for a job as an investment analyst?", "score": 2, "replies": []}, {"body": "Always trust someone's opinion when they say you better \"except it!\"", "score": 0, "replies": []}, {"body": "You are a communist , you should just move there , they love American retards", "score": 1, "replies": []}, {"body": "wow! you're so smart!..how the fuck you're end up here![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "Nio ![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "Nice try, comrade Pooh.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "w3z866", "created_utc": 1658355400.0, "score": 4, "upvote_ratio": 0.6, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|157|**First Seen In WSB**|1 year ago\n**Total Comments**|228|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/pu74qq/sdc_retarded_dd/) [x](https://i.redd.it/2ud319ltqno71.jpg) [x](https://i.redd.it/smsmne3rpwo71.jpg) [x](https://i.redd.it/tzyp5does1o71.jpg) [x](https://www.reddit.com/gallery/vwh2sr) [x](https://www.reddit.com/r/wallstreetbets/comments/pu713v/sdc_my_retarded_dd/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3z866)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3z866)", "score": 1, "replies": []}, {"body": "You must be new to trading...\n\nTheta destroyed your calls just as much as your hate for 🌈🐻 puts. So stop taking ur break behind Wendy's on your phone. Open that mouth and get back to work.", "score": 8, "replies": [{"body": "I always sell puts 😜 rather than buying calls", "score": -6, "replies": [{"body": "Position or ban", "score": 6, "replies": [{"body": "Cockballzz has challenged someone to post their positions! \n\nCockballzz, if someone has made a claim that they bought / sold something and fails to prove it within 24 hours, message the mods to have them banned.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Ban", "score": -4, "replies": []}]}, {"body": "🐻🌈🖕🏻", "score": -2, "replies": []}]}]}]}, {"body": "TSLA destroyed all options it's been pretty flat so far (not even 1% up)", "score": 7, "replies": [{"body": "Thetagang!!!!", "score": 6, "replies": []}, {"body": "😂😂 \nHappy ?", "score": 0, "replies": [{"body": "I played the earnings because I have balls. You are just small time yappin on this play 🖕🖕🖕", "score": 1, "replies": [{"body": "🥳🥳", "score": 0, "replies": []}]}]}]}, {"body": "Looks like people playing daily calls aren't going to fare much better.  Pretty much spike and bleh", "score": 2, "replies": []}, {"body": "Why would you buy puts on NflX after a massive dumpie over the last few quarters smh 🤦‍♂️ that’s basic trading 101 things not do my guy", "score": 2, "replies": []}, {"body": "Guarantee by end of week Netflix loses all the gains from earnings", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 2, "replies": []}]}, {"body": "Wait do you really think Tesla and Netflix beat earnings? LoL you really must not know what you’re talking about. If it was a normal market, they both missed earnings and their stocks would of tanked. Netflix lost subscribers for both earnings, which is a terrible news. But right now the market is so shit that the expectations is really low. Any good news will pump the stock.", "score": 1, "replies": []}, {"body": "Clearly it's time for puts with this guys attitude!", "score": 1, "replies": []}]}
{"title": "What is the right stock to go full puts right now? Tesla?", "selftext": "", "id": "w3zbq7", "created_utc": 1658355645.0, "score": 12, "upvote_ratio": 0.69, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|4 days ago\n**Total Comments**|3|**Previous DD**|\n**Account Age**|4 days|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=w3zbq7)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=w3zbq7)", "score": 1, "replies": []}, {"body": "The right stock is to cash your account and never do this again. Literally the vast majority of us here lost fortunes. Take the money and run…", "score": 20, "replies": []}, {"body": "Wrong stock to do puts on my guy", "score": 19, "replies": []}, {"body": "never buy TSLA puts before 1000", "score": 9, "replies": []}, {"body": "Decent credit score though. With a704 you tell me what to do", "score": 4, "replies": [{"body": "Photo is recent but my score is over 760 now", "score": 1, "replies": [{"body": "What’s up play with TSLA then. I’m definitely betting with a 760", "score": 1, "replies": []}]}]}, {"body": "Time and time again this sub has learned the hard way not to fuck with Musk, Microsoft, or the Mouse.", "score": 2, "replies": []}, {"body": "Coin base.", "score": 2, "replies": []}, {"body": "Elon Musk: “this quarter we had a lot of supply chain issues out of our control, but next quarter will be a record quarter", "score": 3, "replies": []}, {"body": "Make sure to hedge with some calls in case you’re dumb enough to go through with Tesla puts. Strangles actually work pretty well on TSLA", "score": 1, "replies": []}, {"body": "Definitely TSLA. They missed and gave shit guidance.", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "This aged well. Especially with the \"gave shit guidance\" part. Where was the shitty part?", "score": 1, "replies": []}]}, {"body": "Your credit score will have the same numbers but in a different order if you bet against Tesla", "score": 1, "replies": [{"body": "740…?", "score": 1, "replies": []}]}, {"body": "CRM?", "score": 0, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I wish my credit score was even half as good as yours 😿", "score": 1, "replies": []}, {"body": "AAPL", "score": 1, "replies": []}, {"body": "how about just doing a trade that’s 5% of your account value…..lol", "score": 1, "replies": []}]}
