{"title": "Airbus Wins $37 Billion China Jet Deals in Blow to Boeing", "selftext": "", "id": "vozuwz", "created_utc": 1656679066.0, "score": 113, "upvote_ratio": 0.97, "num_comments": 21, "comments": [{"body": "Now just waiting for China to cancel some Boeing orders and the recession will be in full swing.   I got beat up pretty badly in some previous posts when I stated that COMAC was getting orders and market share.  This article shows Boeing's decline in China.   The US government will be bailing them out as they have too many US suppliers integral to our economy.", "score": 22, "replies": [{"body": "I mean... the Comparable Boeing airplane isnt certified in China last I checked so it really wasnt a competition.", "score": 8, "replies": [{"body": "My point  is that COMAC is making in-roads and it is only a matter of time.  I  actually fear  China cancelling Boeing orders as it will impact their entire US supply chain - forcing us further into recession and required a US government bail out.", "score": 2, "replies": []}]}, {"body": "You talk about C919?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Small on GDP but about 2M jobs.  It will not be pretty.", "score": 1, "replies": []}]}]}, {"body": "Boeing is one of the most corrupt corporations on the planet and deserves to get owned by Airbus.", "score": 26, "replies": [{"body": "They can’t even get the 737 Max sorted. I’ll NEVER fly on that jet.", "score": 5, "replies": []}]}, {"body": "Politics certainly is a factor, but the biggest factor is the total disaster launch of the 737 Max. That plane is so far ahead of any competition, that it’s was supposed to be a give Boeing total dominance in commercial airline sales for decades, but as we all know, it turned into a total disaster. Now, Boeing is not completely out. Assuming the problem with 737 max can be 100% corrected, certified, and the public image restored, then Boeing will likely bounce back, because 737 max is just way ahead of competitors in terms of providing airline business with a big operating profit margin,", "score": 5, "replies": [{"body": "100% true.  Only after the 2nd 737Max crash, I make sure whichever flight i'm on is not a Boeing plane when possible.  I'd give it about 10 years before I get on a 737Max.", "score": 3, "replies": []}]}, {"body": "Airbus wins the ability to have their new airplanes reverse engineered?", "score": 19, "replies": []}, {"body": "Boeing = GE", "score": 4, "replies": []}, {"body": "Thing is, Airbus teems to be able to make airplanes…", "score": 5, "replies": []}, {"body": "Lol when your planes keep falling out of the sky and you 'charge' for the software update. What do you expect", "score": 2, "replies": []}, {"body": "\"Trade wars are EASY to win\"--Big dumb broke orange terrorist.", "score": 2, "replies": []}, {"body": "so short Airbus when china invades Taiwan", "score": 0, "replies": []}, {"body": "As expected.", "score": 1, "replies": []}, {"body": "Nxp will close a deal witz GM", "score": 1, "replies": []}, {"body": "Guess so much for China to get less dependent on the West.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Plane is not Biden's fault. Don't blame him for stuff he has no part of. You want good points not false claims.", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vowex5", "created_utc": 1656666513.0, "score": 150, "upvote_ratio": 0.93, "num_comments": 28, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Everything is crazy expensive in southern France", "score": 13, "replies": []}, {"body": "It's even worse in reality. My grocery store prices are up 30% to last year, I know it exactly because I'm using supermarket apps with digital receipts. So I can compare prices from today to last summer.\n\n&#x200B;\n\nOfficial inflation is more than 10% in Spain and 20% in Estonia.", "score": 12, "replies": []}, {"body": "[deleted]", "score": 22, "replies": [{"body": "Yeah, what would these numbers look like without the Ukraine conflict?", "score": 1, "replies": [{"body": "In Oct 2021 it was already around 4% (double the ECB self imposed target)", "score": 6, "replies": []}, {"body": "Still high, but likely not as high. Inflation in my country is now the highest it's been since the 70s.", "score": 6, "replies": []}, {"body": "Not nearly as bad. Most of it is directly and indirectly caused by skyrocketing energy prices. Supply chain issues are starting to relax already. We'd be at 2-3% inflation instead of almost 9%.", "score": 3, "replies": []}, {"body": "Not much different IMO. 90% of the price increases you see today have nothing to do with Ukraine", "score": 1, "replies": []}]}]}, {"body": "EUROZUELA", "score": 27, "replies": []}, {"body": "Does the ECB still have negative interest rates?   They r destroying their Euro.", "score": 9, "replies": [{"body": "No, at least on bonds.\n\nDeposit facilities yes, but that’s the least to worry about.\n\nOMO nope.", "score": 1, "replies": []}]}, {"body": "I wonder how long Europeans will put up with inflation until they let Putin have ukraine", "score": 1, "replies": [{"body": "Then what? Let him march to Poland or Finland? This doesn't get better with Putin winning this war, it gets even worse.", "score": 10, "replies": [{"body": "then nato will fight. ukraine alone has not enough man power to fight as it seems.", "score": 2, "replies": []}, {"body": "The argument is sooo hackneyed as if Russia could pose any threat to any other country now or in the next 5 years. The NATO quick reaction force alone now has 140k troops in Eastern Europe, more than Putin had in February when he attacked Ukraine. In terms of missiles and fighter jets, NATO is probably even 10 times stronger.", "score": 2, "replies": [{"body": "If Russia goes after Taiwan and Iran stirs up some drama at the same time that will benefit Russia tremendously. Very very possible too", "score": -1, "replies": [{"body": "Russia going after Taiwan? Yeah, sure, very possible.", "score": 2, "replies": [{"body": "I meant China", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Fuckin Biden", "score": 1, "replies": []}, {"body": "Counties like Spain/Italy/Greece will default in a few months if the war continues. Or better, people of these countries will default, governments are very happy at the moment sadly for them", "score": -11, "replies": [{"body": "They will not default because rates won't increase in Europe, or not enough.\n\nThey are going to let inflation run and erase debts, as well as savings. This is the plan.", "score": 4, "replies": [{"body": "In fact i wrote the second statement. If people lose 10/20% of their savings in a year, i consider these people defaulted. I don't care if my state (Italy) is happy to have is debt reduced. \n\nAnd here in Italy it's not like in the usa or North europe, wages are the same of 10 years ago, that's why i consider ourselves in trouble as normal people", "score": 0, "replies": [{"body": "It's not a default, a default for people is bankruptcy, it's when you enter negative wealth. -50% wealth is not a default.", "score": 2, "replies": []}]}]}, {"body": "Countries*", "score": 1, "replies": []}]}, {"body": "So europe being economically crippled and having its poor population suffer since they cant keep up with inflation to protect the borders of a country thats wasnt even in the EU???? Makes sense why US is involved to sell energy and weapons to EU but why would Europe do this to itself?", "score": -7, "replies": [{"body": "It allows them to fight a proxy war without direct engagement, and will set Russia back economically for decades. This isn't without some struggle, but it is a win, and I don't see why they *wouldn't* take this opportunity.", "score": 1, "replies": [{"body": "Yes Tard, you set back Afghanistan and Iran and now they have a radicalised population, Russia has 6000 Nukes so im sure NATO “setting them back” and radicalising young Russians is a good idea", "score": -1, "replies": []}]}]}]}
{"title": "CATL’s new 620-mile range EV battery", "selftext": "[full article](https://www.autonews.com/china/li-auto-hozon-sign-catls-new-620-mile-range-ev-battery)\n\n \n\nChinese **electric vehicle** startups Li Auto Inc. and Hozon New Energy Automobile Co. emerged as the first customers of a new long-range battery that Contemporary Amperex Technology Co. unveiled Thursday and plans to start mass producing in 2023.\n\nThe “Qilin” battery has a range of more than 1,000 kilometers (620 miles) on one charge, energy density of up to 255 watt-hour per kilogram, and is safer and more durable than existing cells, according to CATL, as the world’s biggest maker of EV batteries is known. It is also 13 percent more powerful than one planned by Tesla Inc., a major customer of **CATL**.\n\nThe battery -- named after a Chinese mythical creature -- has the longest range offered by any mainstream manufacturer yet. It comes as CATL faces greater pressure to innovate and maintain its dominance, with rivals at home and abroad -- from BYD Co. and China Aviation Lithium Battery Co. to LG Energy Solution Ltd. and Panasonic Holdings Corp. -- developing their own products.\n\nLi Auto’s founder and chairman, Li Xiang, used China’s microblogging platform Weibo to draw attention to a potential battery supply deal, sharing details of CATL’s Qilin and commenting: “See you next year.”\n\nCATL responded: “Qilin has Li Auto.”\n\nBeijing-based Li Auto, which trades in New York and Hong Kong, is due to launch its first pure EV model in 2023, following two models that use gasoline to power electric motors, including its latest -- the L9 luxury SUV -- that was unveiled this week, with deliveries to start in August.\n\nHozon also used Weibo to publicly link itself to the new battery.\n\nCATL will also supply batteries to South Korea’s **Kia** Corp., though the type of cell is unknown. A CATL spokesman confirmed all three supplier deals Friday, without providing details.\n\nA Kia spokesman declined to comment on CATL, saying only that the company is cooperating with various suppliers to “diversify and stabilize battery supply.”", "id": "vp1s2b", "created_utc": 1656684693.0, "score": 8, "upvote_ratio": 0.73, "num_comments": 24, "comments": [{"body": "I'd invest in CATL - not Li Auto.", "score": 2, "replies": []}, {"body": "What's so dumb about these is that they leave out KEY information. A BATTERY isn't the most important thing when it comes to range. Is this a little sleek 2 or 4 door sedan? A big 8 seater SUV?\n\nThey give us the energy density but not the overall total energy capacity. 90kwh? 150kwh? Compared to Tesla, why would you care that it's got a 13% more power when range is a function of energy? What's it's DC fast charge curve look like? What materials are used to make this pack? How much will it cost? How soon can it enter production?", "score": 3, "replies": [{"body": "Li auto only has one model a three row suv.", "score": 4, "replies": [{"body": "Their L9? 620 mile range? Is it going to have a +250kwh battery pack? I'll believe it when I see it. Also this is going to be measured not in the EPA standard but the NEDC which jokingly stands for 'Not Even Damn Close'.", "score": 6, "replies": []}]}, {"body": "They beat Tesla in every metric, so does not matter. Tough to be Tesla shareholder these days. First Mercedes beat them as an first automaker to have  autonomous, now eveybody is clowning on them with superior battery tech and factory efficency.", "score": -4, "replies": [{"body": "Making fake shit up is what people like you do best.\n\nMercedes isn't beating Tesla in self-driving nor is it at level 5. The reason Mercedes was approved for a higher level in a certain jurisdiction is because Tesla wants to jump from level 2 straight to level 5 whereas other self-driving companies are focused on gradual improvements that will take longer to reach level 5, ultimately. It's got to do with a difference in strategy rather than them actually winning. Most of those self-driving companies don't believe they will get to level 5 in the near future which is why they would rather make small improvements.\n\nSuperior battery tech? You have no evidence of that. There is very little info on this battery in terms of the design. Okay, the battery performance might be better on paper but the production process might be more expensive. The issue thus far seems to be that these aren't cylindrical cells which are easier and cheaper to produce. We also have no info on which vehicles it will be supporting so it's impossible to actually determine what the actual performance is. Tesla vehicles with 4680 cells are already out.\n\n\"Factory efficiency.\"\n\nThey are by far the most efficient auto factory in the world, lol. They produce their own car seats and windshield glass as well. In fact, they are the most vertically-integrated auto company in the world. How can you claim other car manufacturers are more efficient? Any evidence? Probably not. Just spewing nonsense.\n\nEvery auto company is trying to be Tesla. That's the truth. Keep spreading propaganda.", "score": 6, "replies": [{"body": "Wow you are insecure. Everyone knew germans will catch up to Tesla but it is surprise they beat them already in autnomous, battery and production efficiency. None of your opinions could change the facts. We are at peak Tesla marketshare. Period.\n\nTesla shorts won after all.", "score": 2, "replies": [{"body": "You’re right that every auto company is trying to be Tesla, you just forgot to mention that so far they’re all failing spectacularly at that goal.", "score": 1, "replies": [{"body": "Both chinese and germans already surpass teala in innovation, sorry fan boi that you can't handle facts.", "score": 0, "replies": []}, {"body": "Then why Teslas market share is falling in both more estabilished markets (China and Europe) since 2020? I am not a Tesla short, but lets be real. Toyota already has better batteries on the way. Volkswagen has better priced models. GM and Mercedes has better self-driving. Nio has battery swap. And all of these mentioned make way better quality cars.", "score": 1, "replies": []}]}]}]}, {"body": "I think NIO vehicles whether they be SUV or Sedans beat Tesla in many aspects such as vehicle retention value/resale value due to BaaS, price, performance, range, battery life, battery performance.  Mercedes isn't the first to reach L3 either. It's just recognized and framed in a way because informants frame it in a way in order to do so by picking and choose which regulator they choose to highlight. Nio is also working on L4 in house. Chinese EVs will most likely create and implement autonomous driving technologies the fastest because the government and infrastructure accomodates this research. This is much different in the U.S. and other Western countries.", "score": 2, "replies": []}, {"body": "HAHAHAHAHAHAHAHAHAHAHAHAHAHA\n\nYou believe the things you're writing?\n\nHAHAHAHAHAHAHAHAHAHAHAHAHAHAHA\n\nThe fact that you blow off every question demonstrates a huge lack of understanding. The size of the battery doesn't matter? How much it costs and how many they can make doesn't matter? When it'll be commercially available doesn't matter? Wow. \n\nNobody has better factory efficiency. If you mean because Austin and Berlin are money furnaces at the moment - anyone in manufacturing will tell you the same thing when a process is brand new and hasn't ramped to anywhere near peak capacity right after opening.", "score": -1, "replies": [{"body": "And yet they point to higher costs at other automakers as they ramp up EV production as proof those others cannot compete with Tesla.", "score": 1, "replies": []}]}]}]}, {"body": ">named after a Chinese mythical creature\n\nlol", "score": 1, "replies": []}, {"body": "As technology advances, we will see better EV's, better battery packs etc etc...Won't be surprised if, in a few years from now, we have EVs that charge on the go", "score": 0, "replies": []}, {"body": "it is china.  it is scam.", "score": 0, "replies": [{"body": "China is significantly ahead compared to the US in EV technology. They already had BYD mass producing EV-s when Tesla was fighting with bankruptcy, and they have dozens of estabilished EV companies out there.", "score": 1, "replies": []}]}, {"body": "but.. what about TeSlA ? eLoN, sAvE Us!!!  \n\n\nhahahaha. yeah. all other car manufacturers and sub-contractors in the whole wide world sat on their lazy asses and did absolutely freakin zero.   \n\n\nall this at the time while one single company revolutionizes the whole car industry. \n\nsure thing.", "score": 0, "replies": [{"body": "CATL makes batteries - not cars. CATL also supplies batteries to Tesla... You're not even making any sense. \n\nThe issue with the car industry is they largely didn't do anything. That is why you are only just hearing about them going fully EV by 2035. Tesla went fully EV since the inception of the company. If these other car companies were ahead of the curve, please explain to me why they can't go fully EV right now? You're not even using any data or logic in your post. Why weren't they building factories years ago if they knew EV's were going to be the dominant player? \n\nThey all fell asleep because EV's weren't profitable and they were making huge amounts of profit due to cheap gasoline at that time which meant more people began buying their higher margin SUV's and semi trucks. Tesla proved it could be and now they're all trying to play catch-up. That's the truth.", "score": 0, "replies": []}]}, {"body": "Is it lithium or graphene or something we've never seen before?", "score": 1, "replies": [{"body": "I doubt it's graphene due to the costs and development of manufacturing graphene batteries at the moment. Could be wrong", "score": 1, "replies": []}]}]}
{"title": "Shareholder Vote Guide 2022 | Tesla Investor Relations", "selftext": "", "id": "vosxf8", "created_utc": 1656653076.0, "score": 65, "upvote_ratio": 0.97, "num_comments": 37, "comments": [{"body": "I went with the board recommendations.  Not because I don’t think some of the things are bad, but because it seems everyone has such a hate-on towards Musk that they’re trying to dig up any dirt they can, and if that kind of stuff is going on, we’ll hear about it.", "score": 10, "replies": []}, {"body": "I hold shares through two different brokerages. I already voted through one of them, can I vote through the other as well or will that be discounted/void my vote altogether?", "score": 6, "replies": [{"body": "Yes you should vote at the other brokerage too (if they also offer that service). If you have 4 shares at one broker and another 6 at the other broker, you need to vote at both to cast all the 10 votes you are entitled to. It's completely independent and you can even vote differently at the other broker, in which case you could end up with 4 \"for\" votes and 6 \"against\" votes.", "score": 7, "replies": []}, {"body": "Yes both. You have only voted with some of your shares so far. Not through all your shares. \n\nRemember each share is a vote. Not one vote perperson. If you have twice as many shares as I do than your vote is stronger than mine.", "score": 2, "replies": []}]}, {"body": "Can someone explain to me how the shareholder questions are chosen?", "score": 2, "replies": [{"body": "Some are questions from the Tesla board, these are typically the ones that the board recommends to vote \"for\", else they would not have asked.\nOther are requested by shareholders. I think that bar is very low, you need to own at least one share, but there are few other requirements, so these questions are sometimes more of a statement than having any chance of receiving a positive vote. The board usually recommends against questions proposed by shareholders, because if they agreed they would have made the proposal themselves. As far as i know the board can't choose from shareholders questions, they have to put all of them up for vote, if they meet all requirements.", "score": 1, "replies": []}]}, {"body": "I know the board doesn’t want it but I think transparency on some of these issues is important for the Tesla brand as Elon has become more antagonistic towards ESG focused customers and investors.", "score": 2, "replies": []}, {"body": "I have a hard time seeing Tesla's board's opinion on some of these proposals. Reporting on child labor? against. Reporting on water use? against. Reports on anti-harrasement and discrimination? against. WTF.", "score": 3, "replies": [{"body": "They are for minimizing child labor, water usage, discrimination, etc., and always have been. They are against becoming a reporting company instead of a car company.", "score": 13, "replies": [{"body": "That doesn't make any sense. Reporting issues in your company doesn't make you a reporting company.", "score": 2, "replies": [{"body": "These are broad, often unanswerable questions, often requiring a team of full-time employees to research and report. Adding 6 of these teams every quarter does affect the production of EV's. Note that Tesla is already reporting these things, the proposals are for making the reports more detailed. I think that time spend on finding more details is better spend on actually doing something about it.", "score": 2, "replies": [{"body": "Hogwash. \"Tesla is currently being sued for failing to address documented child labor in its supply chain\"\n\nhttps://www.sec.gov/Archives/edgar/data/1318605/000121465920007479/d826200px14a6g.htm", "score": 1, "replies": [{"body": "I don't see \"documented child labor\" in the Tesla supply line in that link. Sure you could \"document\" a theoretical possibility, and I'm sure Tesla is aware of those, but how do we know Tesla did not address this? And then it suddenly switches to corruption. The proposals lists many whole countries but is not very clear about what Tesla should actually do, which is a disappointing shortcoming of this proposal.\n\nIf there is a clear action Tesla could do to reduce child labor in their supply line, or even an effective way to reduce that theoretical possibility, I would be all for it, but I don't see that in this proposal.", "score": 1, "replies": [{"body": "A clear action is a combination of 1) attestation, 2) activity metrics and 3) outcome metrics.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well I'm guessing they aren't enjoying children, so why should they do a report about it", "score": 1, "replies": []}]}, {"body": "Just vote as the board ask and not what wokes want.", "score": 6, "replies": [{"body": "There's really no need for another woke/anti-woke debate here in this sub. That's what the rest of reddit is constantly plagued with, no reason to let it ruin this sub as well. \n\nWe all like Tesla, just use your votes and we'll see what happens.", "score": 9, "replies": [{"body": "This sub very frequently just believes Musk is never wrong though.", "score": -1, "replies": [{"body": "Elon is quite often wrong, but these shareholder proposals would mostly mean voting against my money.  I don’t see a reason to do that.\n\nIf I didn’t like the way they ran their business, I’d sell rather than tie their hands.", "score": 14, "replies": [{"body": "Because Tesla ownership and Tesla vision, is about more than money?", "score": 1, "replies": [{"body": "Many of the shareholder proposals are coming from entities attempting to harm Tesla and push their own agenda.", "score": 1, "replies": []}]}]}, {"body": "Elon is wrong from time to time, but overall he is intelligent and usually right.\n\nJust check out his Master plan I and II.", "score": 6, "replies": []}]}]}, {"body": "No, vote however goddamn you want to vote. I am gonna vote against the board on a few items most likely.", "score": 25, "replies": [{"body": "I voted against (extra) restrictions on which accounting firm Tesla could choose. That's just politics.", "score": 5, "replies": []}]}, {"body": "Among retail investors, large investors tend to vote with the board recommendations. Wealth is linked to intelligence.", "score": 4, "replies": []}, {"body": "Yeah, like who cares about making sure child labor doesn't occur in Tesla? Shouldn't be reported /s.... Also discrimination against people doesn't exist. Tesla absolutely shouldn't care about that /s...Water management....it's not like Tesla, like every other company, should be open about its water use when it's trying to campaign as a climate change/green EV company right.", "score": -2, "replies": [{"body": "They don't need another useless reporting to care about it.\n\nIf you need to have to report to behave correctly, you're not a decent human being.", "score": 1, "replies": [{"body": "A lot of people aren't \"decent\" human beings. Some of them work in tech. Reporting isn't \"useless.\" You can pretend there are no problems by not looking.", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "And what's happened to those companies?", "score": 2, "replies": []}, {"body": "Disney is definitely unrecognizable after being woke.", "score": 1, "replies": [{"body": "Woke is a disease, once a company got it, it's difficult to cure. The good thing is the disease eventually will kill the companies or severally weaken them. New stronger companies will emerge.", "score": 2, "replies": []}]}]}]}, {"body": "When do we vote to shut Elon up?", "score": 0, "replies": [{"body": "Unpopular opionion but objectively true it seems. The Musk cultists annoy me.", "score": 3, "replies": [{"body": "I was once one of them, some of them will come around in time. \n\nMy main concern is “big picture” electrification. EV is Tesla in the US, Tesla is still 70% of the EV market. The words EV, Tesla and Elon are all interchangeable to many people, the ones that still need convincing about electrification. I have had more than one person tell me, IRL, “I don’t want an EV, that Elon guy is an asshole”. \n\nWhen Elon says stupid shit it just feeds the O&G propaganda machine. He makes it too easy for them. He needs to shut up and let some other bright people at Tesla into the spotlight. We need new faces for the company but not tech bros.", "score": 2, "replies": []}]}, {"body": "I don't remember exactly which quarter, but I think there has been a question in that spirit. It didn't get a majority in voting. You need to find a LOT of voters for such a proposal since Elon has about 20% of all votes and is likely voting against it...", "score": 2, "replies": []}]}]}
{"title": "Rolling Puts vs Wheel", "selftext": "Hi gang, I have been rolling a naked 150 PUT 1 contract in AAPL for a couple of months. So far, I have earned 12.07 points ($1207). My question is, should I keep rolling or get assigned and start covered calls at 150 strike?\n\nI personally think rolling it out is efficient from a buying power usage point of view. What do you guys think? Is there any study material available for this topic?", "id": "vorzex", "created_utc": 1656649818.0, "score": 8, "upvote_ratio": 0.78, "num_comments": 21, "comments": [{"body": "I constantly roll. There are people who will say accept assignment. But I've been rolling collecting premium. If/when I get assigned, I'll effectively be getting some lots for free.\n\nUnless you want the shares, keep rolling imo.", "score": 9, "replies": [{"body": "I agree, roll unless you want to own the stock.  Never accept assignment involuntarily, i say.\n\nOP if you like apple stock, take assignment and start selling CC's below cost basis.  You'll get more premium than rolling down puts for credits.  If the CCs get breached, roll them up and out at expiration.", "score": 1, "replies": [{"body": "Sometimes it’s better to roll up and out while delta is still rather low, did this with PLTR when it was about to hit my strike of 9$ and rolled up and out to 10 at 8,70", "score": 1, "replies": [{"body": "My friend has pltr and rolls early like that.  I prefer waiting until 0 DTE when extrinsic value is close to 0", "score": 1, "replies": [{"body": "I only do it when I have the strong feeling it will roll deep ITM and I was right both times I did it.", "score": 1, "replies": []}]}]}]}, {"body": "Can you suggest a video on how to roll puts ? I know basic terms like down and out ? Is that what it is? I’d line to know nuances of it so if I wanted to roll out eventually what should be the expiry date on the original puts? Thanks", "score": 1, "replies": [{"body": "I just push the roll option on my broker, and just look for a lower price, or further out with premium.\n\nOr ideally both. I generally don't have to go out more than a few weeks.\n\nIn any case my goal is (just barely better than) break even if I'm rolling down. \n\nOR if I'm rolling out like a month but same strike, I try to collect a % premium that gets a decent return. In this example, I'm looking for that roll out to get me at least 1% of capital\n\n(Logic: 1% × 12 month = 12% return) there's the chance of early assignment, and it has happened. But thems the breaks.\n\nI have no deep learning. I'm just a WSB artist who stumbled into these fine people.", "score": 2, "replies": [{"body": "Thanks you made it clear all I have to do is push roll and just see which gets me more premium and reduces my chance of assignment! Simple ! Thx", "score": 1, "replies": [{"body": "Just a note, the closer to assignment day the greater the likelihood of early assignment. I try to roll at about 17 days out, looking for decent premium or lower strikes. At 10 days out I'll take whatever I can get that breaks even. No idea on any maths behind this. I'm just trying not to get early assigned (again)", "score": 2, "replies": [{"body": "Thanks, so if there’s no chance of assignment would you still roll out at 17dte? I mean we would be missing out on the free theta decay of those 17 days left to expiry", "score": 1, "replies": [{"body": "If there's no chance, it depends on how much premium I've \"gained\". For example, if I sold a 30 DTE put and the underlying went way up, buying it back costs like 10% of premium. I've made 90% of the premium in 2 weeks. Waiting out the next 17 days is going to get me the last 10%? Seems like a not great idea because of the potential to turn a win into a loss.\n\nIf the stock is basically flat since I sold the put, it comes down to how much premium is enough. \n\nPersonally, if I get a 50% gain in under a week, I almost always take it. If I have to wait longer I want more.\n\nI go into a trade with a mindset of \"X is enough premium that I would exit out at.\"\n\nCollecting the last few days of premium is almost never worth it...unless you don't have a better idea of what to do with the capital.\n\nThis is just my approach. Reading all the advice I've gotten on here helps more. I've only been part of ThetaGang for a few years. Nothing I've said is financial advice", "score": 2, "replies": [{"body": "You explain it so well, you should legit make YouTube videos explaining the stuff so easily as you do.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Rolling is more efficient, because short puts have much lower margin requirements than long stock. \n\nThe two advantages I can think of to taking assignment is that a) you can collect dividends to further reduce cost basis, and b) can sell calls below cost basis to collect more credit.", "score": 3, "replies": [{"body": "If his put is ITM the dividend is included in the premium.", "score": 1, "replies": []}, {"body": "This\n\nSell CC's below cost basis.  Don't get assigned on them.", "score": 1, "replies": []}]}, {"body": "Your breakeven price is $137.93 so if left to be assigned the shares any call at the 137ish including the premium strike or above would result in an overall profit.\n\nAs the stock is around $137 another roll or two might allow you to close the put for a small profit if the stock price doesn't drop in the meantime.  \n\nRolling the put is more efficient and has more flexibility than taking the shares.", "score": 3, "replies": []}, {"body": "I keep rolling but keep the delta on the roll under 70. This is synthetically the same delta and profit zone of a covered call. I then add a short call/call spread to further chip away at the cost basis. After the roll/adjustment I want my total delta to be less than 50 per contract... ideally more like \\~25.\n\nLooking at AAPL that 150 put is close enough to that 70 delta. I would then add the 150 short call/call spread to further reduce that delta and collect additional credit. Mindful that there is now an upside risk.\n\nI do not take assignment, and immediately close entire positions if early assignment.", "score": 2, "replies": []}, {"body": "Rolling the put is probably cheaper in terms of comms/fees you may be assessed on assignment.\n\nOther than that, you're looking at two different delta exposures.  Say you are using 30 delta for both puts and calls.  While you're selling puts you have exposure to 30 shares equivalent delta in AAPL.  If you take assignment you'll have exposure to 70 shares equivalent delta.  Depending how much time you spend assigned vs in cash, you'll be leaning more on or off exposure to moves in AAPL.  If you're using at the money for both then there's really no difference in the short put vs the covered call - 50 deltas either way,.", "score": 0, "replies": []}, {"body": "You have multiple options, could sell a call to neutralize 1/3 to 1/2 or delta, could roll out or roll out and down to 145 for a synthetic credit, if not too far in the money. Jul 150p is 92 delta, aug 150p is 75 delta while 145p is 65. Out and down by 5 points from July to Aug can be done for 1.50. The risk with out and down is if there's a rally you added more risk.\nOn the flip side, if it goes lower, you'll have to buy back the intrinsic at some point.\n\nI'd sell a call above 150, at least. 155c+roll to 145p is small 0.04 debit. 150C+150p roll is 0.93 credit, but you're capping your shares upside in case you get assigned. \n\nIt all depends on your risk tolerance and view on where the market will go and if you have the bp and will to hold the shares.\n\nBe aware of the extrinsic of the call vs dividends, if you sell calls before being assigned from the put.", "score": 1, "replies": []}, {"body": "Short put is synthetically identical to a covered call. Pick whatever gives you more comfort to maintain your strategy mechanically instead of emotionally.", "score": 1, "replies": []}, {"body": "Yeah, sometimes I've done it unnecessarily so now i usually wait it out.  It can go either way.  I've been ITM on TSLA by like 300 before, eventually it retraced though\n\nAt least we know how to roll and not just get assigned", "score": 1, "replies": []}]}
{"title": "Isn't INTC a perfect wheel stock ?", "selftext": "[deleted]", "id": "vp0nok", "created_utc": 1656681472.0, "score": 4, "upvote_ratio": 0.61, "num_comments": 22, "comments": [{"body": "I agree with you INTC is a good one. Weekly premiums aren't bad. Around the .2 delta.", "score": 6, "replies": []}, {"body": "I really like INTC at this price point... but there is less than ideal premium. Expected move in the Aug 19 cycle is $3.52, or essentially $5.00 because IVx seems deceptively low (earnings July 28th).\n\nThe rank is high enough, and the company will probably be around at least 10 years... it's just more exciting for my money to be involved in SMH, and forgo the whippyness of being caught in a bad earnings trade.", "score": 3, "replies": [{"body": "You got my attention with \"Expected move in the Aug 19 cycle is $3.52...\"\n\nHow do I determine an expected move for a cycle?", "score": 1, "replies": [{"body": "Perhaps you are referring to the following :\n\nhttps://www.tastytrade.com/definitions/calculating-expected-move#:~:text=Expected%20move%20is%20the%20amount,implied%20volatility%20for%20binary%20events.", "score": 1, "replies": [{"body": "Yes, that is a very general rule. INTC has larger than expected moves for earnings. I expect 10%-15%, so could be \\~$30-$40.\n\nIf you use tastyworks platform, it's listed on the underlyings trade tab on the right side of the expiration.", "score": 3, "replies": []}]}]}]}, {"body": "Yes good stock wheel because of its relatively (to the industry) less volatile. One of the reason is I don't mind owning it too since it pays a decent dividend and it's profitable at a decent margin , despite it's size.\n\nThen again, volatile stocks can be fun to wheel, if you can stomach the risk.", "score": 3, "replies": []}, {"body": "What do YOU think?  Trading a stock you would not mind holding if needed, perhaps for months, is this one YOU would be good holding?  If so, then it is perfect for you!", "score": 5, "replies": [{"body": "Wheeling a stock it's not all about \"not mind holding\" it needs some other requirements. You can hold a stock and still think it's not a good stock to wheel.\nI did learn a lot from your posts and on the sub in the last 2 years, but it's not all about wanting to hold the stock if needed.", "score": 8, "replies": [{"body": "I completely agree!  What makes a stock good for you to hold?  This will change for each of us so we all need to determine what those other requirements are individually.\n\nThis has been discussed many times here and I posted more details I use in this post.  [https://www.reddit.com/r/Optionswheel/comments/lqttn4/sell\\_puts\\_on\\_good\\_companies\\_not\\_meme\\_stocks/](https://www.reddit.com/r/Optionswheel/comments/lqttn4/sell_puts_on_good_companies_not_meme_stocks/)", "score": 2, "replies": [{"body": "Yes i did already read that awhile ago, but my question is: among two (or more) stocks that for you are good to hold, what makes a stock a better candidate to wheel on you opinion ?", "score": 2, "replies": [{"body": "If I am willing to buy and hold a stock then it is good enough for me to wheel it.  \n\nAre there stocks that would be good to buy and hold that doesn't bring in a lot of premium?  Yes.  Are there some with low volumes that are just not good to trade?  Sure.  But these are part of my criteria and are quickly filtered out to never make the list.  \n\nAll else being equal I'll typically look at the stock I like the best, has done well for me in the past when looking at the YTD numbers and has the higher premium.", "score": 4, "replies": [{"body": "Thanks, this makes more sense.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I was looking at INTC last night - - I own some - - and noticed that it has no clear support level indicated by price distribution going back years. Correct me if I am wrong and conclude what you want from this.", "score": 2, "replies": []}, {"body": "Ride it down from 44 to 35 yikes", "score": 1, "replies": []}, {"body": "It keeps going down, my covered calls earn almost nothing because cost basis too high. I keep rolling but I think will be ok with assignment at 27.5. I realize that I have said that from 45 down to 35.", "score": 0, "replies": []}, {"body": "It went from over $52 a share to $36 in one month… is that considered a good wheel stock?", "score": 0, "replies": []}, {"body": "Just pick stocks you want to own case closed period. 🤙🍷", "score": 0, "replies": []}, {"body": "I normally don't wheel, more of PMCC guy myself as I'm bullish but If I were to wheel I'd say Intel is a good pick. It'll have lower IV though then some of the other ones like AMD, but price wise Intel is more stable", "score": 1, "replies": []}, {"body": "Do you start with the CC, or the CSP?", "score": 1, "replies": [{"body": "I'm looking to start with a CSP, not sure about INTC tho, I'm looking around to find something I like to wheel on.", "score": 2, "replies": [{"body": "In general, I start the wheel with a CC, if it pays a good dividend. If not, CSP.", "score": 2, "replies": []}]}]}]}
{"title": "How many cars did Tesla deliver in Q2?", "selftext": "\n\n[View Poll](https://www.reddit.com/poll/vpaa1q)", "id": "vpaa1q", "created_utc": 1656707521.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 20, "comments": [{"body": "269,420", "score": 6, "replies": [{"body": "This would be cool", "score": 3, "replies": []}]}, {"body": "255,420", "score": 3, "replies": []}, {"body": "271k but happy with anything above 250k", "score": 3, "replies": []}, {"body": "265k!", "score": 2, "replies": []}, {"body": "284,269", "score": 2, "replies": []}, {"body": "253k", "score": 2, "replies": []}, {"body": "More than 285K because I wanna believe", "score": 2, "replies": []}, {"body": "When and where is the big announcement?", "score": 0, "replies": [{"body": "1,209,600 seconds", "score": 2, "replies": []}, {"body": "Probably today, officially on ir.tesla.com but all over twitter and here", "score": 2, "replies": []}]}, {"body": "275k", "score": 1, "replies": []}, {"body": "264K.", "score": 1, "replies": []}, {"body": "267k", "score": 1, "replies": []}, {"body": "260,420", "score": 1, "replies": [{"body": "Did I win?", "score": 1, "replies": []}]}, {"body": "Flawed poll- I don’t see the option for Yes", "score": 1, "replies": []}, {"body": "Lol 2 days left on the poll", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "https://ir.tesla.com/press-release/tesla-vehicle-production-deliveries-and-date-financial-results-webcast-second-quarter\n\nAUSTIN, Texas, July 2, 2022 – In the second quarter, we produced over 258,000 vehicles and delivered over 254,000 vehicles, despite ongoing supply chain challenges and factory shutdowns beyond our control. June 2022 was the highest vehicle production month in Tesla’s history.", "score": 1, "replies": []}]}
{"title": "Former Apple exec tasked with enforcing insider trading rules admits to insider trading", "selftext": "Apple’s former senior director of corporate law and corporate secrecy has officially admitted to partaking in an insider trading scheme. Gene Levoff was first indicted for insider trading in 2019, and while he was initially fighting the charges, he has now admitted to his role in these insider trading transactions.\n\nLevoff started at Apple in 2008 and served as a senior director of corporate law from 2013 until 2018. The trades in question were made between 2011 and 2016, the indictment says.\n\nAs reported by Law360, Levoff has admitted to misappropriating nonpublic information about Apple’s financial information; he would then use this information to make trades with Apple stock. In total, the scheme allowed Levoff to generate $227,000 in profit and avoid $377,000 in losses.\n\nWhen Levoff would know that Apple had strong revenue and net profit for a given financial quarter, he would purchase large quantities of AAPL stock and sell it once the rest of the market reacted to the news.\n\nAs we’ve said before, this case is incredibly ironic: one of Levoff’s responsibilities at Apple included enforcing the company’s insider trading policy. In fact, he even informed Apple employees about a trading blackout period for AAPL stock, while also buying and selling the stock himself.\n\nThe details of the punishment Levoff will face are still unclear, but each count in the indictment carries a maximum penalty of 20 years in prison.\n\nhttps://9to5mac.com/2022/06/30/former-apple-exec-admits-to-insider-trading/", "id": "vordm2", "created_utc": 1656647852.0, "score": 106, "upvote_ratio": 0.97, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|97|**First Seen In WSB**|1 year ago\n**Total Comments**|30|**Previous DD**|\n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vordm2)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vordm2)", "score": 1, "replies": []}, {"body": "Really not surprised. It’s how the rich get richer...inside info", "score": 15, "replies": []}, {"body": "And another one...", "score": 10, "replies": []}, {"body": "Burn at the stake motherfucker.", "score": 17, "replies": [{"body": "Need heads on pikes to come back", "score": 1, "replies": []}]}, {"body": "Don't worry. I hear that he did an internal review of himself and found no evidence of malfeasance.", "score": 5, "replies": []}, {"body": "All that for $277,000?  He makes that in a year!  What an idiot!", "score": 4, "replies": [{"body": "If you're going to do something stupid and illegal like insider trading, at least be good at it.", "score": 2, "replies": []}]}, {"body": "Sure he will have a harsh sentence.  Pffftt white collar crime for the W", "score": 3, "replies": []}, {"body": "Things like this is how you know capitalism jumped the shark.", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|97|**First Seen In WSB**|1 year ago\n**Total Comments**|30|**Previous DD**|\n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vordm2)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vordm2)", "score": 0, "replies": []}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Minimum of -3 days...we will be owning him for his time.", "score": 1, "replies": []}, {"body": "So obvious and dumb... jebus.", "score": 1, "replies": []}, {"body": "Insider trading enforcer giving a demo on insider trading and got caught :) how many more are uncaught?", "score": 1, "replies": []}, {"body": "No quarter.", "score": 1, "replies": []}, {"body": "Lol. Why didn't he buy options and at least make a lot of money. Making a few hundred K like this is so fucking stupid.", "score": 1, "replies": []}, {"body": "He doesn't remember trading the stock during the blackout period", "score": 1, "replies": []}, {"body": "Not only is he a POS, he's a dumb POS.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|8880)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vozyeu", "created_utc": 1656679367.0, "score": 1, "upvote_ratio": 0.51, "num_comments": 26, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|41|**First Seen In WSB**|3 years ago\n**Total Comments**|477|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/bdui5f/dropshopping_is_dead/) [x](https://www.reddit.com/r/wallstreetbets/comments/q7k5dg/dd_content_delivery_network_fsly_long_and_ss/) [x](https://www.reddit.com/r/wallstreetbets/comments/qrxz6e/crct_dd_on_the_shortest_trading_day_in_the_world/) [x](https://www.reddit.com/r/wallstreetbets/comments/qry8k8/can_you_scratch_my_crct_dd_to_get_hard_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/o3ntvt/baba_dd_the_ai_dd_the_next_megacap_to_the_moon/) [x](https://www.reddit.com/r/wallstreetbets/comments/qrxvsm/theoretical_halfday_moass_on_crct_on_the_shortest/) [x](https://www.reddit.com/r/wallstreetbets/comments/l352c8/citron_public_announcement/) [x](https://www.reddit.com/r/wallstreetbets/comments/obv3oy/dd_merger_arbitrage_doyu/) [x](https://www.reddit.com/r/wallstreetbets/comments/obv6i6/dd_merger_arbitrage_doyu/) [x](https://www.reddit.com/r/wallstreetbets/comments/vozyeu/short_tesla_because_of_ious/) \n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vozyeu)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vozyeu)", "score": 1, "replies": []}, {"body": "Doesn't July 22 seem a little soon for it to be cut almost in half again?", "score": 17, "replies": [{"body": "When there is a race to the exit, do you want to be the Walmart employee in the way?", "score": 8, "replies": [{"body": "July 25 is their earnings call. Good luck", "score": 1, "replies": []}]}]}, {"body": "Bro, are you serious or just daydreaming that stock will be cut in half in a few weeks?", "score": 10, "replies": [{"body": "Agree.  Maybe shit flys from fan mid to late Q3 but not due to OP rationale, rather due to many macro issues converging around then coupled with a mid term election cherry on top.", "score": 2, "replies": []}]}, {"body": "The only thing owing is my time back. This is the dumbest reason to short/buy puts on a company. At least some are making the argument that its overpriced based on the companies multiples.\n\nThis post just sounds like you watched The Big Short one too many times and applied the concepts from that movie to Tesla. Fuck outta here you Burry wannabe", "score": 20, "replies": [{"body": "Fuck Burry too! Never sell DCA works both ways. Nothing special about him", "score": -6, "replies": []}]}, {"body": "Ok..So we should buy calls... GOT IT", "score": 9, "replies": []}, {"body": "This is what im here for\n\nThe most regarded of plays", "score": 6, "replies": []}, {"body": "7/22 tsla 665$.another tattoo Ima have to PUT on my arm  if it prints 🚀🙌🏿", "score": 3, "replies": []}, {"body": "While I respect this, can you argue that this could be speculation?", "score": 2, "replies": [{"body": "Ask yourself, when’s the last time you gave respect to someone you think is BS. Nada. You know it, I know it, everybody knows it. The signs are: Elon has a bad rep, Tesla is just a car, valuation cutting has been a trend, IOUs and unsold stocks are just bags. The biggest sign of all? Tesla stock does not protect wealth. If anything it’s a ticking time bomb.", "score": 0, "replies": []}]}, {"body": "Thanks for the gambling advice", "score": 2, "replies": []}, {"body": "\"position to open\" OP, why haven't you opened your position yet? Why write your DD first and post it, before you open a position?", "score": 2, "replies": [{"body": "He didn't want the ban", "score": 2, "replies": [{"body": "Exactly. He's a bullshitter", "score": 3, "replies": []}]}]}, {"body": "The same way hedgies are in dept to GME holders", "score": 4, "replies": []}, {"body": "This guy fucks....", "score": 0, "replies": []}, {"body": "I'm worried Tesla over estimated earnings. Tesla has been crushing earnings, how ugly does it get if they miss?", "score": 1, "replies": [{"body": "TSLA has the best gross margin, sales growth and even revenue in the auto sector.   If Tesla misses, it will only be for a quarter and it will be for reasons beyond their control - Shanghai being shut down for COVID and very slow ramp at Berlin and Texas.\n\nThese are not long term problems.  The demand for Tesla vehicles will outstrip supply for years going forward.\n\nTSLA is one of the strongest stocks on the market these days.", "score": 0, "replies": [{"body": "I agree but in the short term puts seem like good plays", "score": 1, "replies": []}]}]}, {"body": "My biggest problem with this analysis is there aren't any dates or values attached.  You could replace the whole thing with Ponzi Scheme: impending rush for the exits incoming.", "score": 1, "replies": []}, {"body": "Dumbest post I’ve read on here in a while. Congrats.", "score": 1, "replies": []}, {"body": "Oh look. An Ape doesn't understand SBC or diluted earnings. Or option exercise.", "score": 1, "replies": []}, {"body": "Never bet against a cult", "score": 1, "replies": []}]}
{"title": "JPMorgan says energy stocks are the best bet in the market right now", "selftext": "Energy stocks are the best bet in the market right now, says JPMorgan. JPMorgan is once again pounding the table on energy stocks. The sector has been JPMorgan's highest-conviction overweight since late 2020, and following the recent and sharp pullback, the firm said now's the time to buy.\n\nRead the full article: [https://www.cnbc.com/2022/07/01/energy-stocks-are-the-best-bet-in-the-market-right-now-says-jpmorgan.html](https://www.cnbc.com/2022/07/01/energy-stocks-are-the-best-bet-in-the-market-right-now-says-jpmorgan.html)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**JPMorgan (JPM) says energy stocks are the best bet in the market right now. The energy sector ETF XLE has fallen 19% in the past month but is up 25% this year.**\n\n**Do you think energy stocks are still a good buy?**", "id": "vp2ohn", "created_utc": 1656687135.0, "score": 7, "upvote_ratio": 0.74, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|19|**First Seen In WSB**|2 months ago\n**Total Comments**|72|**Previous DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vp2ohn)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vp2ohn)", "score": 1, "replies": []}, {"body": "So puts it is", "score": 9, "replies": []}, {"body": "I think those that are investing large into alternatives whilst keeping their oil going are worth tracking, especially in the EU - I will be investing in TTE (Paris) and Eni (Milan). Both are already good divi payers if incomes your thing.\n\nThat being said, I wouldnt trust JPM as far as I could kick them.", "score": 6, "replies": []}, {"body": "They must need a bid to sell into. Good luck with that 😂", "score": 9, "replies": []}, {"body": "I don’t think I’m going to play into their hand.  While I agree energy is going to be a big issue going forward, JPM isn’t exactly a paragon of honesty and them promoting a sector makes me sus just like Cramer being bullish makes me sus.", "score": 6, "replies": [{"body": "Being speculative is good but you shouldn’t let that speculation turn you dogmatic, just look at the current economic climate of the world with the war. Even though those big guys are shady af everyone can see that the energy sector will be at least stable if not bullish until the war is done with", "score": 1, "replies": []}]}, {"body": "Aren’t oil earnings coming in end of July and beginning of August? Idk seems like there could be some room to run. Don’t you think a recession has already be equated into the prices.", "score": 5, "replies": []}, {"body": "Ok…energy stocks about to peak…pump and dump", "score": 3, "replies": []}, {"body": "Is this really a case of buy high sell higher  ?\nI think I'll wait for the top, and short on the way down. We can't be far off.", "score": 2, "replies": []}, {"body": "Yep... if you bought em in the spring of 2020 ![img](emote|t5_2th52|4271)  \nHashtag missedthefuckingtrain", "score": 2, "replies": []}, {"body": "Top for oil stocks confirmed. Expect a downswing and/or windfall tax stupidity.", "score": 2, "replies": []}, {"body": "JP Morgan can suck my 🍆", "score": 2, "replies": []}, {"body": "They need someone else to hold their empty bags. Turds", "score": 1, "replies": []}, {"body": "Priced in and on the downtrend gas was only $4.77 today. Puts.", "score": 1, "replies": []}, {"body": "So short /CL it is", "score": 1, "replies": []}, {"body": "So JPM buys it up , then they try to shove it retails way like every other crappy product they offer. You can keep your  eventual bags there. I’ll stick to the stuff getting beat down and sell you my bags instead later.", "score": 1, "replies": []}]}
{"title": "Eurozone Inflation Breakdown - they b fuk", "selftext": "", "id": "vp7gn7", "created_utc": 1656699909.0, "score": 46, "upvote_ratio": 0.89, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|36|**First Seen In WSB**|1 year ago\n**Total Comments**|944|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vp7gn7)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vp7gn7)", "score": 1, "replies": [{"body": "Our salaries hasn't been updated for shit. We are gonna take this hit and BCE is with a finger in the ass and governments pretending it's all fine with tons of debt.", "score": 1, "replies": []}]}, {"body": "send help, and oil", "score": 14, "replies": [{"body": "Winter is coming too", "score": 4, "replies": []}]}, {"body": "I think you can say the same for pretty much everyone. We all b fuk for a while", "score": 6, "replies": [{"body": "Not me I have bitcoin in voyager", "score": 11, "replies": []}]}, {"body": "High energy costs have a cascading effect throughout the economy  \n\n\nReally doesn't look good for them", "score": 5, "replies": []}, {"body": "I like how alcohol and tobacco are with food 😆", "score": 3, "replies": []}, {"body": "Puts on us. \n- a fellow European", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|4260)", "score": 3, "replies": []}]}, {"body": "Imagine countries like the Netherlands are still refusing to use there own natural gas due the “climate and housing damage”. They rather have a third of eu froze to death or pay less then for the bills. Green energy ![img](emote|t5_2th52|4271)", "score": 10, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "its not even winter yet. wait until they experience the Russian BRRRRRRRRR.", "score": 2, "replies": [{"body": "Russian brrrrr is not significant in any way. They overprinted money in covid, just like you guys in the US, but they dont want to do rate hikes, cause that will destroy everone apart from Germany and France. So yeah, they are kinda fucked. Good thing our PLN will certianly not get fucked alongside, nono", "score": 1, "replies": [{"body": "> our PLN will certianly not get fucked alongside, nono\n\nNo need to fuck that which is already fucked, but it will happen nonetheless", "score": 1, "replies": [{"body": "Dude, PLN has seen some things.  848% inflation in 94' f.e. She can take a lots of cocks. Entire Germany of cocks you can say", "score": 1, "replies": [{"body": "I envy your optimism", "score": 1, "replies": [{"body": "Thats no optimism. Thats numbnes.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Hmm... It's weird, the national TV doesn't talk about this... The last news were like, there's no problem, when they were talking about our national economy 🤡.\n\nSuggestion: I'm in Europe you dummy dum.", "score": 2, "replies": [{"body": "When the news is always: Don't worry the government has your back.\nYou know who they working for.", "score": 1, "replies": [{"body": "Ik", "score": 1, "replies": []}]}]}, {"body": "To the moon", "score": 1, "replies": []}, {"body": "We are fucked, I actually made an OK amount of money over the last 2 years by not holding my shitty currency.", "score": 1, "replies": []}]}
