{"title": "Should I be concerned about my basis in Amazon at $150. Split adjusted", "selftext": "Foolishly back in January I purchased a big block of Amazon stock at $3000 for sure which is $150 split adjusted today.   Typically I would think I would be OK but the storm clouds are pretty strong for the following reasons below.\n\n1. Labor unions trying to organize Amazon employees.  \n2. Cost of fuel for domestic deliveries. Also for getting items from port to warehouses.\n3.  Cost of shipping containers from China to USA.\n4.  Consumers backing off on any type of spending due to inflation issues they face.  \n5.  Federal reserve plans at least three more rate hikes of .75 each  is each rate hike is put into effect it will drive the market down further.  \n\nI am sure there are more storm clouds but it concerns me that the economy won’t recover for several years because everything that is happening around us today is unprecedented.  \n\nAny thoughts on where you think Amazon might be 12 months from now. I have the ability to buy more shares at the lower price so I could work on DCA but I’m not sure where at the low point yet.", "id": "vg9pyb", "created_utc": 1655688457.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 64, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Short term yes. Long term no.", "score": 35, "replies": [{"body": "Right answer. Their ability to pivot quickly and capture entirely new markets (books-> everything -> everything delivered same day -> AWS -> Streaming) much like Google is amazing. The margins on the core business is troublesome, and I believe the streaming market will collapse and consolidate to just a few key players eventually - but they have the resources to launch and capture entire markets on a whim. \n\nThat and online shopping is the future and they are king.", "score": 7, "replies": [{"body": "Not to mention that the last few years they have been in turbo-charged growth mode.  Even without the headwinds they'd be going into harvest mode soon (decreasing the massive spend and realize investments).  \n\nThis is the reason that analysts have been so aggressive in price targets despite the high pe.  It's high because they throw their mountains of revenue back into the massive business expansion.", "score": 6, "replies": [{"body": "If you look at where the lions share comes from, it is AWS. Selling computing is very lucrative at scale.", "score": 2, "replies": []}]}, {"body": "Do you see a chance of conscious consumerism and people’s hesitancy around Bezos being a negative factor in amazons sales in the coming years?", "score": 1, "replies": []}]}]}, {"body": "DCA... all of those things will be adjusted intonpricing no matter where you buy the item. The reason I'm holding it is for the huge AWS growth. I mean I get AMZN Prime and BooknSub for cheaper then the cost of NETFLIX !!! They can always avg up their Prime membership ship $5-$10 and most people will keep it but I'd really like to see them go after Paramount or another Studio with a Large Content library...", "score": 3, "replies": []}, {"body": "AWS prints more money than the fed, so if it were me, I wouldn't base an AMZN investment on their retail side\n\n.", "score": 7, "replies": []}, {"body": "I believe AMZN will dip below $100 but not below $90. I'd wait a few weeks, maybe until close to the next fed meeting and start DCAing.", "score": 6, "replies": []}, {"body": "Amazon is the backbone of America, look up how many companies are on their aws service it’s insanity, even the CIA is smh", "score": 3, "replies": []}, {"body": "Amazon makes money from AWS mostly\n\nRetail never makes substantial profits", "score": 6, "replies": [{"body": "This is /s right? please tell me this is /s ...", "score": 3, "replies": [{"body": "I’m sorry to say this is /T … TRUE", "score": 2, "replies": [{"body": "yikes, if he is for real, i hope he is not investing in individual stocks with that lack off analyzing skills.", "score": 1, "replies": []}]}]}]}, {"body": "Sell covered calls", "score": 2, "replies": [{"body": "The 30DTE 150 strike is yielding a whopping 8 dollars a contract.  So I guess that's something.", "score": 1, "replies": [{"body": "So? Why does he have to sell $150 strike when the current share price is $106? He can sell $110 - $120 for nice profits and probably won’t be assigned. \n\nAnd if he is assigned and has to sell his shares, so what? He can just buy it back in the open market for roughly the same price and it would be considered a wash sale. \n\nHe can continue to collect premiums this way especially since he probably won’t get assigned often. \n\nHe can even sell CSP’s to collect even more premium before entering the position again  \n\nJust because your cost basis is $150 doesn’t mean you can only sell $150 and higher", "score": 1, "replies": [{"body": "*He can sell $110 - $120 for nice profits and probably won’t be assigned.*\n\nIf they sell a CC at 110, the odds of being assigned are 43%. If they sell CCs at that delta for a year,  they'll be assigned or rolling for safety \\~5 times.\n\n*He can just buy it back in the open market for roughly the same price*\n\nThe difference between the new price and his old strike will be a loss and can be very significant in a volatile market.\n\n*He can even sell CSP’s to collect even more premium before entering the position again*\n\nMany people have lost money attempting to \"wheel\" stocks. It works well in a sideways environment, but this is currently not that.\n\n*Just because your cost basis is $150 doesn’t mean you can only sell $150 and higher*\n\nAgree.  Given Amazon's fundamentals and the current economic environment, they could actually sell in the money covered calls and make a positive P/L.\n\nProbably.", "score": 2, "replies": []}, {"body": "Then you rooollllll", "score": 1, "replies": []}, {"body": "Yea we all know it wouldn’t rally above the strike price if calls.  It just go a few cents above your strike so until you can buy it back.", "score": 1, "replies": []}]}]}]}, {"body": "Depends on how big your position is I think, and how much cash you have.  If it's a small position and you have plenty of cash I'd say don't worry about it.  I did the same thing with AMD but it's like 4% of my portfolio so I don't care enough to sell it.", "score": 2, "replies": [{"body": "It probably is equal to 10% of my portfolio.", "score": 1, "replies": []}]}, {"body": "I would be buying more. In fact I am buying more. I didn't start buying Amazon til the last couple weeks because the price seemed too high but if you're holding for the long term, $150 will be nothing. In 4 or 5 years it will probably be a $500 stock (split adjusted)", "score": 2, "replies": []}, {"body": "People love Amazon. Chill out ain’t nothing changed", "score": 3, "replies": []}, {"body": "They will still be in business.", "score": 1, "replies": [{"body": "Lot of faith in a company on the way out. They peaked, only down from here. (Maybe some jumps but overall down)", "score": -7, "replies": [{"body": "I just said they’d still be in business.\n\nAmazon is at least two companies, though. They can and probably should pull an IBM and split up.\n\nWhile Amazon is not my favorite cloud platform (IBM is -  but you can’t convince the lemmings of that) I don’t see any lessening-up there. They are the de facto cloud platform for business and as a developer I can tell you nobody wants to hear about any other cloud platform.\n\nRetail sales have never been Amazon’s money maker. At least it started making SOME profit.", "score": 1, "replies": [{"body": "I agree there cloud services are the one profitable sector they have, but I also see crypto supplanting that in the near future (just my take)", "score": -2, "replies": [{"body": "I see zeros for {unspeakable word here} in the near future…", "score": 0, "replies": [{"body": "O ya for sure but the one that has utility and gaming will have continued demand and be a life boat.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I do not see any upside potential until the inflation and general market decline becomes stabilized.  I think I had Amzn very early on got frustrated with lack of earnings and liqudated them like 20 years ago. Often I entered later when I see a definitive evidence.  $150 cost basis sucks. I will sell high costs sometime to bring the cost basis to an acceptable level.", "score": 0, "replies": []}, {"body": "Amazon is a massive company, and solid investment. Its just a good business platform. While you'll suffer some short-term loss, it'll recover. The union stuff is much needed overall in the US and its just targeting Amazon. Government isn't backing fair wages, and neither are private companies, so the unions are the only option. As for shipping issues, those have been easing some, but will remain. Its my opinion that this recession is the real fallout from world closures back in 2020. It always takes time for markets to respond. We may see another 1-3 years before ATH again. So, just batten the hatches and ride the storm. Im saving every dime to throw in when I feel we've touched near bottom.", "score": 11, "replies": [{"body": "Union feather bedding work practices destroyed Union credibility and cost effectiveness. Has that changed any?", "score": 2, "replies": [{"body": "Why would a union be concerned with cost effectiveness or 'feather bedding', when cost effectiveness creates unlivable wages?", "score": 1, "replies": [{"body": "No company equals 0 wages when right to work companies beat union companies on productivity.", "score": 2, "replies": [{"body": "So, your argument is that a company absolutely cannot survive offering market rate wages? Or that unions bankrupt companies?", "score": 2, "replies": [{"body": "I’m just pointing out the history I lived.  The pendulum always swings to far.", "score": 1, "replies": [{"body": "I'm just trying to figure out your point. Many trucking companies still operate with unions, offering fair wages, hours, and just performance. Have for years. Many years.", "score": 4, "replies": [{"body": "I’m principally referring to the construction trades working in industries.", "score": 1, "replies": []}]}]}, {"body": "Hostess", "score": 1, "replies": []}]}]}]}]}]}, {"body": "How about sue Bezos and try to get ur money back ? /s", "score": -6, "replies": []}, {"body": "Sell calls and buy puts if you think it will keep drilling", "score": 1, "replies": []}, {"body": "Cost of shipping is at 2 year low now.", "score": 1, "replies": [{"body": "I happen to be in the international shipping business in the cost has stabilized but they have not really started to drop. The same thing I would go for domestic trucking on the US side the cost of that dropped yet because of the price of fuel.", "score": 1, "replies": [{"body": "They dropped 20% this year, your speditor is ripping you off :)\n\nFor europe the drop is about 30%.", "score": 1, "replies": [{"body": "Perhaps in the last 30 days shipping cost of come down there still high. Especially domestic USA truckload transportation.  Containers from China are still extremely expensive. Perhaps not for Amazon. But for others", "score": 1, "replies": [{"body": "I am talking solely about containers. They dropped 25% YoY. Trend is still downwards and will stay that way till the late October.", "score": 1, "replies": []}]}]}]}]}, {"body": "Great demonstration of why you don't purchase big blocks of stock to open a position.  Build your positions in positive territory.  Don't be in such a rush.", "score": 1, "replies": [{"body": "Yep.  I guess I was bottom fishing and got burned. But I do hope long-term it comes back. I do also own some in a different account at a basis of about $1000. That was several years ago.   Hopefully in 12 months or less I will be even again. But there’s always the risk it will never come back.", "score": 1, "replies": [{"body": "So that's equal to $50 post-split?  Why did you buy in a different account instead of add just a little to the original position?\n\nI started my position in NKE w/ ten shares.  Two splits and a few adds later and I have 200.  NKE is down about 45% from it's recent high, but I'm still way way up on it.  I'll probably add some, but not too much, maybe 20 at a time.  \n\nIMO there's a huge psychological advantage to being solidly up on a modest number of shares, then adding a little at a time, so you're never close to the red zone.", "score": 1, "replies": [{"body": "Different accounts at different brokers. That’s not uncommon.  My long-term horizon is at least 5+ years.", "score": 1, "replies": [{"body": "Why do you choose some specific time horizon?  Lots of people on Reddit express a time horizon for investing but I don't get why.  There is no fundamental reason to do that.  I've held BAC for around 12yr now and NKE for ten, but I'd have sold them both in a heartbeat if I thought the outlook was bad.  Actually I did sell about 2/3 of BAC stake @ $25-$40, which for a while looked pretty stupid, but now    if I bought everything back I'd probably be a few percent ahead.", "score": 2, "replies": [{"body": "Yep I also hold BAC also and have held it since 2008. Adding to it in 2016. Definitely a good one to hang onto.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Lol down 50 a share.  Durrrrrrr.\n\nHold forever maybe you break even in a few years.", "score": 1, "replies": [{"body": "That does not concern me as long as there’s forward progress probably the stock will go into my estate if I last for another 15 years", "score": 1, "replies": [{"body": "Well, then what does your business model analysis tell you for a 15 year outlook and is there enough potential gains to meet your gains expectations?\n\nFair to say the next year or 2 are gonna suck.  Unfortunately you bought near the peak.  Will take a long time, if ever to return to that high, as it was inorganic growth that got it there.", "score": 2, "replies": [{"body": "Yep I don’t disagree with you I bought quite a few other positions between November and May 1 in other stocks. All of them for 20 to 25% below purchase price.  Hopefully they return but if not there is not much I can do about it.\nLike Abbott, FedEx, UPS, Google, Boeing\nI’m a long-term investor so hopefully these companies will bounce back in the 24 month timeframe", "score": 1, "replies": [{"body": "Start reading their books and checking where they were before covid and how their old outlooks were pre covid.  That's a good starting pt.\n\nOh, and I think we see another 10 to 15 percent downside over the next 2 quarters as a minimum before we hit bottom and flat.\n\nIf housing let's go with the recession a further crash is possible.", "score": 1, "replies": []}]}]}]}]}, {"body": "1. Labor unions will actually keep Amazon warehouses fully staffed and in the not so near future will benefit the company. Amazon was quite literally killing themselves with the way they were running their warehouses.\n\n2. Everything else you said is actually detrimental, luckily AWS is doing quite well. Hard to say where things will go but if you can DCA over the next year I'm guessing you'll be quite happy in the next few years.", "score": 1, "replies": []}, {"body": "I brought Amazon for AWS. When that goes down, a good part of the internet goes with it, so many sites and services are reliant on it. Cloud computing is here to stay and AWS (and Azure) are market leaders.", "score": 1, "replies": []}, {"body": "Lord bezos got you good.", "score": 1, "replies": []}]}
{"title": "Why can’t the FED just get over with this recession and raise it by 150-200 BPS?", "selftext": "Ok so hear me out. You may think this is a stupid idea, but I think it’s stupid as well, but it might just work. I’m not joking either. Why can’t the FED purposefully cause a recession now and immediately put on 150 basis points in a single day, rather than wait later? Even though unemployment will rise immediately, stock markets gonna halt and -10% in a day and cause an imminent downturn, but we still will handle inflation just like that. So far, 80% of CEOs and CFOs think a recession will happen in 2022-3. I think there will be a recession as well, but a mild one (maybe DOW'S low could be 23-24,000, but that's just making numbers up). I know why the Fed waits to hike as well. It’s to try to make a “soft landing”. In reality, they don’t give a shit. If you want to make a counterclaim, that can help me and other people know interesting facts about the market that I haven’t heard of, so please DO give your opinion on this statement. Criticism can help here.", "id": "vgs62q", "created_utc": 1655749454.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 65, "comments": [{"body": "Probably because one of the Fed's goals is to limit unemployment. Powell has said this repeatedly, and this was one of the justifications for not raising rates to quell inflation during the pandemic.", "score": 32, "replies": [{"body": "Another thing I would like to add to that is that unemployment rate is projected to straddle at 3.7%. JPow wants to slow job hirings. Unemployment rate during a recesh can top 5% or even 7-10%, so your argument is valid. Thanks", "score": 5, "replies": []}, {"body": "As admirable that goal is, Biden wants to remove tariffs, so unemployment about to go through the roof.  So FED can't stop that anymore. None that twisting rates is going to help, may as well raise by 200 and get over it.", "score": 0, "replies": []}]}, {"body": "Why don’t we cook food quicker by just setting the oven to 2000 degrees instead of 180!", "score": 50, "replies": [{"body": "In the case of pizza, depending on the open, this is actually what you want to do.\n\nGets those nice crispy air pockets and a crispy bottom crust. Fast and hot so your pizza is ready to go.\n\nGood argument!", "score": 7, "replies": [{"body": "I try to pre-warm my oven, maxxed out heat for awhile and BOOM! Greatest pizza in the world! Juicy, crunchy….\n\nIf I only had 800 degrees celsius oven, my life would be complete.\n\nNow what where we talking about?", "score": 1, "replies": []}]}]}, {"body": "Do you want the whole 9\" thrust at once to start or can Powell spit on it first?", "score": 58, "replies": [{"body": "I mean they been thrusting into us for the last two years. He is.alreafy balls deep, what difference does it make?", "score": 10, "replies": [{"body": "I think he has reserve wang.", "score": 5, "replies": [{"body": "We haven't seen its final form?!", "score": 6, "replies": [{"body": "They aren't going to stop the Vandersexxx until inflation is under control.", "score": 2, "replies": []}]}]}]}, {"body": "Lmfao I love the internet", "score": 8, "replies": []}, {"body": "Just the tip", "score": 3, "replies": []}, {"body": "Is that what they call the fed put?", "score": 2, "replies": [{"body": "Fed put is always via backdoor", "score": 1, "replies": []}]}, {"body": "b.p. me daddy", "score": 2, "replies": []}]}, {"body": "because not all businesses are agile and able to pivot quickly.", "score": 16, "replies": [{"body": "The ones that can't will fail in a recession. Some businesses are bound to go bankrupt, and new ones will arrive. Good take though", "score": -11, "replies": [{"body": "It’s much worse for the economy if businesses fail than if they just have to scale back their operations. Why carelessly cause businesses to fail when you could navigate this process intelligently?", "score": 9, "replies": [{"body": "The last word is why he don't curr", "score": 6, "replies": []}]}, {"body": "they have CONTRACTUAL OBLIGATIONS.", "score": 4, "replies": []}]}]}, {"body": "Because the government will have to monetize more debt to pay the higher interest payment. \n\nThis will force the Fed to print even more money, causing even more inflation.\n\nThe Fed can't fight inflation, all they can do is force the economy into recession and pray that \nthe recession causes inflation to moderate.", "score": 12, "replies": [{"body": "Good thinking, I actually never thought of that. GDP Estimates are projected to turn negative soon because when Dow was at 34k, they projected +1.4% GDP, but since the market got wiped by 8-10 trillion dollars since, I think we could see negative soon. I guess the recession odds are high even without high hikes", "score": 0, "replies": []}]}, {"body": "Will trigger into a panic recession. \n\nMortgage interest rate was 3.5% a few weeks ago. It is already up close to 6% for 30 year fixed mortgage. Lenders and real estate are already layoffing employees. Should Feds raise to 2% vs .75% it will be 8% mortgage making all homes sitting there unsold. Same with cars. The loan for new cars is 4.1% it will be 50% more causing Detroit to close its production layoff all workers.  Same with small business owners who need to borrow.  Many suffered hardship recently.  You want to make evolutionary not revolutionary changes to upset the system to collapse.", "score": 8, "replies": [{"body": "Car companies make more from financing your car than the actual car; they will offer terms you can’t refuse and you will like it", "score": 3, "replies": []}]}, {"body": "A) Interest rates can’t entirely control inflation. \n\nB) We could already be in a recession, we won’t know until GDP numbers come out. \n\nC) If we are currently in a recession, you would be talking about exacerbating massive stagflation.", "score": 14, "replies": []}, {"body": "It would be too much of a shock to the system and have insider issues.", "score": 12, "replies": []}, {"body": "Because that would absolutely lead to a credit freeze.", "score": 5, "replies": []}, {"body": "Why are you cheering on a recession. You realize that means people losing their jobs and suicides. As well as entire market going down for possibly years.", "score": 15, "replies": [{"body": "Recession is immanent. Suicide is preventable. Call people and say hey.", "score": -5, "replies": []}, {"body": "Failing to treat the wound in time might just kill the whole organism.\n\nA recession will occur anyway, and it’s gonna be worse for every month or year we hesitate.\n\nThe roman empire and all its influence died during its recession, my question is to many: are we expecting the americas to follow suit?", "score": 0, "replies": []}]}, {"body": "OP I think that you have to look at it more in-depth as a whole. By doing this drastic interest hike, it will cause the market to colapse causing a shock that will make million of people loss their retirements and many jobs will be lost as well as the health of the us stock will be damaged for many years.Instead of the FED fucking us over with a drastic move they are doing it slowly.", "score": 6, "replies": []}, {"body": "Raising rates by 200% isn't going to stop inflation. As the great economist Milton Friedman said, inflation is a money supply problem. Raising the rates isn't going to reduce money supply.\n\nDuring Covid, inflation is mute despite the money supply increase because economy is shut. Everyone stayed home. Now that everyone is coming back out, all that close to $10 Trillion printed just by US is coming into effect. Raising rates doesn't immediately reduce that excess money supply.", "score": 3, "replies": []}, {"body": "Because, contrary to popular belief, many people have jobs, houses, families, pets etc. that they would rather not lose. Because as miserable as 9% inflation is, 20% unemployment is way worse.", "score": 3, "replies": []}, {"body": "https://en.m.wikipedia.org/wiki/Boiling_frog", "score": 2, "replies": []}, {"body": "because they don't need to?", "score": 2, "replies": []}, {"body": "They took an oath to keep unemployment as low as possible.", "score": 2, "replies": []}, {"body": "There is no such thing as a soft landing. They know they are lying and they do not care.", "score": 2, "replies": []}, {"body": "You wont stop inflation with rates. Oil demand is unstoppable because people still need to drive and the market is global, and broken by underinvestment and sanctions. same with food products stuck in Ukraine. theres nothing they can do about that.", "score": 2, "replies": []}, {"body": "It would trigger a secondary financial crisis as well as liquidity dries up due to uncertainty and defaults. Businesses need predictability to forecast finances and the instability introduced with such a drastic hike would pretty much cause everyone to halt any expansion or investments and hold onto cash which causes a domino effect as suppliers and vendors start to go out of business overnight and then no recovery is possible even if rates go down because fundamental sectors of the economy would have been ravaged.", "score": 2, "replies": []}, {"body": "Basically there are two current points to consider: the unemployment rate is very low and the housing market is super hot and bullish. These two factors are really the only thing keeping us from a recession right now. If the Fed went all in it could destabilize both points and actually cause a recession. They want a soft landing with a strong labor market and, most likely, a short and mild recession with greatly tempered inflation. Raising rates suddenly by huge amounts defeats the goal", "score": 2, "replies": [{"body": "Agree. \n\nThey need to be very careful with the housing market, especially new builds. If rates hit 8% too quickly it's going to price tons of people out of new builds, which means less new home construction. That's really bad long term because we need way more housing then we currently have.", "score": 1, "replies": []}]}, {"body": "Interesting point. The law makers won’t lose any of their salary which is something to keep in mind. \n\nI think you are right in saying the soft approach is what they are going for so that there isn’t a massive sell off all in one day. Although we know what policies work and which don’t, I don’t see the harm in at least hearing out an idea such as this.", "score": 3, "replies": []}, {"body": "FED usually steps in during a recession and helps right the ship. But they already overspent to prevent us from going into a recession in 2020, and if we go into one now, FED wouldn’t be able to do much and we’ll probably be in a long recession that lasts for years.", "score": 3, "replies": []}, {"body": "This post is going to get a lot of backlash, but again, I want to hear your people's opinions on it. Every single opinion and criticism helps me come to conclusions, and can help others overall.", "score": 2, "replies": []}, {"body": "Why can't the Fed just cut us all checks for a few million. Mostly we could stop our bitching after that. Mostly.", "score": 1, "replies": []}, {"body": "They're using Quant tightening plus raising the federal reserve rate...it can work but the Fed is 10 to 12 months behind the curve this time along with the horrible impact of all the Russian sanctions. Although I advocated for a quick one time 200bps like you are it looks a bit erratic and the Fed doesn't want to be alarmist. \n\nFrankly I think you're right...better to slam this runaway inflation right now, quickly.", "score": -1, "replies": []}, {"body": "Anyone ever stop and think just for a second that the Government doesn’t have our best interest in mind? It’s like Chancellor Palatine said “All those who gain power are afraid to lose it” they’ll keep us poor and dependent on them.", "score": 1, "replies": []}, {"body": "At this point I don't think it would matter", "score": 1, "replies": []}, {"body": ">but we still will handle inflation just like that  \n\nWhat makes you think that?  The Fed raising its interest rate may have the downstream effect of reducing the price of things that people buy on credit.  But it's not going to help reduce the price of things that are really driving inflation right now - fuel, food, and rent.", "score": 1, "replies": []}, {"body": "Just tap it in…tap it in…give it the old tap tap tap-a-roo", "score": 1, "replies": []}, {"body": "200 bps is 2%. Price of fuel has gone up by 100%. Do you really think such a rate increase will kill demand and fix the supply chain issues?", "score": 1, "replies": [{"body": "Gas has dropped a small amount. This probably does not have a lot to do with the rate increase but rather a change in consumer behavior and demand. People are not driving as much and it is lowering demand by a little bit. Not needing to fill up their car as often, even if it means only one day later, can lower demand by a few percent nationwide.", "score": 2, "replies": [{"body": "Inflation will suppress demand. You simply won't be able to afford to do as much.", "score": 1, "replies": []}]}]}, {"body": "Fed doesn’t matter as much as the Russian energy tariffs. That is what you should be focused on. The Russo-Ukraine situation needs to get resolved ASAP. Markets will rally when that happens.\n\nAll the Fed rates headline talk is a secondary/tertiary variable that is getting misconstrued as the primary one. I suppose it’s an easier one for the layman to partially understand, but it is not the main driver of the current mess. Supply chain issues + Energy are.", "score": 1, "replies": []}, {"body": "The banks would be boned. Cost of funds would go way up and fixed rate loans would stay the same for income", "score": 1, "replies": []}, {"body": "You can't fast forward through market downswings. Not even the fed can control that", "score": 1, "replies": []}, {"body": "Last time we had inflation near this rate was the 70s and that took interest rates of 20% to calm it. A 200 bps hike isn't stopping this. And if they were to just do one quick hike to like 20% or whatever is needed, the government's debt would ruin them and any trust that still remains in the dollar.", "score": 1, "replies": []}]}
{"title": "What's the ultimate taboo you've done in regards to \"traditional\" investing advice?", "selftext": "[deleted]", "id": "vgu887", "created_utc": 1655754958.0, "score": 12, "upvote_ratio": 0.85, "num_comments": 57, "comments": [{"body": "Years ago a buddy told me about a stock tip his father got. Dear old dad would get some pretty killer tips! So when I heard about this, I had to jump in.\n\nIt was a Canadian mining penny stock (I'm in the US). Maybe a buck fifty. I saw red flags everywhere, but \"it's a tip from his dad, just close my eyes and go with it\".\n\nA week later it's down 50%. I tightened my sphincter and held on.\n\n2 more weeks go by and this thing is up to $4. I go to my friend and ask what's up with the stock, when does dad think we should sell?\n\nHis response: \"Oh shit, you didn't buy any of that, did you? He didn't get that from his usual source. He got that tip from some drunk at a bar!\"\n\nI sold that mf so fast....", "score": 18, "replies": [{"body": "You should have tried to seek out that drunk, tho.", "score": 6, "replies": []}, {"body": "I'm a Canadian, my father has been a lifelong Jr mining speculator/industry guy. \n\nI heard it put best over on r/canadianinvestor when someone said \"Canadian Jr mining stocks are the original shitcoins\"\n\nIt's not entirely fair as they deal in real commodities but it's just like walking into a wild west saloon for a game of poker...", "score": 4, "replies": []}]}, {"body": "I was up $68k on crypto and did not sell because of short term capital gains.  I’m down $4k:(", "score": 13, "replies": [{"body": "I'm doubling down on my krypto stocks.  Sold other stuff", "score": 1, "replies": [{"body": "Weird to double down on something that's so non-essential. I hope you didn't put more than you can handle to lose.", "score": 1, "replies": [{"body": "It's not a retirement account. \nJust for fun but not fun losing $$$.\nPart of my krypto 22K  is to recoup huge losses of 80K and today added 30K to see if I can turn it into 120K to help buy a rental property", "score": 3, "replies": []}]}]}]}, {"body": "All my eggs in one basket", "score": 10, "replies": [{"body": "Concentrate builds wealth, diversification preserves it..", "score": 8, "replies": []}, {"body": "TSLA millionaire?", "score": 4, "replies": []}]}, {"body": "Kept a lot of my net worth in the company stock. I got laid off, the stock doing better than most of the other tech companies. Good on them for getting rid of the dead meat and think of us, shareholders, first.", "score": 9, "replies": []}, {"body": "I am currently 75% Bitcoin 24% Ethereum and 1% Stocks.  Fuck me right now lol", "score": 24, "replies": [{"body": "Dude that's brutal. Hopefully you didn't buy near the top.", "score": 6, "replies": [{"body": "I've dollar cost averaged for the last 3 years.  I've bought the bottom and the top a few times.  I am down a lot but I have faith in my investments long term.  I plan on diversifying more but these crypto drops have me salivating so who knows.  I will either die a very rich man or broke as shit.", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Thanks Zucchini", "score": 7, "replies": []}]}, {"body": "Do you hold B + E in wallet ?\nI'm at 50% krypto but in stocks like HUT + BITF + HIVE + CL SK + WON DF + ARB KF + SI", "score": 1, "replies": [{"body": "I have some on a ledger and I am Canadian so I can invest all future crypto positions in my tax free savings account", "score": 1, "replies": [{"body": "Good! I'm buying more probably tomorrow", "score": 1, "replies": []}]}]}, {"body": "Christ, call the whambulance.", "score": 1, "replies": []}]}, {"body": "I spent all of my investment money and savings servicing my secured debt and missed the entire market run-up.  I am with relatively few financial investments and no debt to anyone.  I was willing to trade profit for certainty.", "score": 15, "replies": [{"body": "If you were into growth tech stocks like most of Reddit then you did yourself a solid.", "score": 5, "replies": []}, {"body": "Piece of mind is worth more than profits. IMO", "score": 3, "replies": []}]}, {"body": "Not my taboo, but my bfs. \n\nEvery time he gets paid he puts the entire paycheck into buying stocks and etfs. Typically 50% qyld and 50% in a dividend champion. He then borrows on margin the money he needs for bills. The qyld cash flow pays off the margin and the other stock drops for dividend growth. \n\nYes I know. He is dumb, but that dick tho.", "score": 7, "replies": []}, {"body": "I only own individual stocks, no broad market ETFs.", "score": 6, "replies": [{"body": "Same. Go big or go home. (and with 'go home' I don't mean 'go broke'. I don't have all my money in stocks)", "score": 1, "replies": []}]}, {"body": "Split 10’s at the Blackjack table, shit was intense", "score": 4, "replies": []}, {"body": "Took a very big loan und bought crypto in the COVID Crash", "score": 4, "replies": []}, {"body": "Holding cash until there's clear signs that we've passed the bottom. In other words, \"timing the market.\"\n\nApparently, hedging against the risk that the market is going to falter under uncertain conditions and keeping cash on hand until we're sure there's going to be some semblance of sanity and return to fundamentals, is a bad thing. Stocks only go up, even when they're cratering through the floor, for a lot of people.", "score": 3, "replies": []}, {"body": "put my entire life savings in Lehman Brothers", "score": 3, "replies": []}, {"body": "Dividend stripping. In the dutch tax system it is wat more profitable than in the US. So everybody online screams no but countries differ", "score": 2, "replies": []}, {"body": "The Lannisters send their regards", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "We get House of the Dragon in August. We shall see if they can rekindle the magic.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm so over that story. Wheel of Time the books anyway are the pinnacle of fantasy in my opinion. Amazon ruined that so far.", "score": 1, "replies": []}]}]}]}]}, {"body": "Paid off my house in under 10 years instead of investing.   Missed the 2020 mega run.   Then poured 40 percent of my non 401k investment into TTD and it popped big in November so I took a few hundred in profit.", "score": 2, "replies": []}, {"body": "Retired young-ish.  Almost 40% in a cash position.  Less than 10% bonds.   Tradition would say I should be 60 equities and 40% bonds.", "score": 3, "replies": [{"body": "Maybe taboo. But a good position nevertheless. Where do you plan to put the cash?", "score": 1, "replies": [{"body": "I’m probably going to do s&p 40%) and qqq (20%).   20% for specific stocks and 20% bonds. I have a good amount of Google, Microsoft and Nvidia.   Probably add a little bit to each position.  I’ll revisit Amazon.  Long term I’m bullish on tech, but will only play a little bit with zero profit growth stocks.  I hopefully have 30 years as a time horizon.   I’m approaching my allocations in a ten year segments versus one thirty year bucket.", "score": 2, "replies": []}]}]}, {"body": "* Held 10% of my investments in BTC (sold for house down payment when BTC was at $57k, made about 20% return in 6 months)\n* Currently investing 80% into a dividend-focused ETF (SCHD) at a young age (30s)\n* Investing 10% into individual stocks with no real research (although they are mostly stable, dividend-paying companies)\n* Holding 2x and 3x leveraged ETFs and still investing 10% into 2x leveraged ETF\n* I sell covered call options on UPRO\n* Paid off my home mortgage\n* I use Robinhood as my main brokerage\n* Stopped investing in bonds before bonds became uncool (\"Your age in bonds\" was a common piece of advice, so I should have been 20-30% bonds throughout my investing career)\n* Bought a GPU to mine ETH\n* Stopped my 401k and Roth IRA contributions in favor of after-tax investing", "score": 4, "replies": [{"body": "Dividend ETFs have exposure to the known risk factors that explain the difference in returns of diversified portfolios. So going with SCHD gives you higher expected returns than just a market based ETF.\n\nI would recommend the video on dividends by Ben Felix.", "score": 3, "replies": [{"body": "He literally said dividends are useless in his last video…", "score": 3, "replies": [{"body": "Yes. That isn't going to change the fact that most dividend ETFs have exposure to market, value, profitability and investment.\n\nEdit: did a quick regression on SCHD. Market 0.89; SMB -0.04; Value 0.15; Profitability 0.31; Investment 0.31\n\nSo SCHD is expected to outperform.", "score": 1, "replies": []}]}, {"body": "I really like Ben Felix’s videos.", "score": 2, "replies": [{"body": "I do too, but I wished for once he'd get into some of the nuances of the studies he quotes.  I can't help feeling like the footnotes of those studies probably contain lots of hidden unknowns and \"we're not sure about\", and I can't be bothered to read them myself.", "score": 2, "replies": []}]}]}, {"body": "Can you expand on your decision to continue to invest on leveraged ETFs? Aren't those getting hammered?", "score": 1, "replies": [{"body": "In my research, regular (e.g. weekly) investments in a leveraged ETF outperform the market over the long term. They get hammered in downturns but they also have larger gains in bull markets. I can handle the volatility because it’s only 10% of my portfolio.", "score": 1, "replies": []}]}]}, {"body": "BUY THE DIP![gif](emote|free_emotes_pack|facepalm)", "score": 1, "replies": []}, {"body": "Long term holding 3x leveraged etfs", "score": 1, "replies": []}, {"body": "I bought stock in a company going into bankruptcy. Luckily, a whale steered the lawyers away from liquidating the stock, and my returns were fantastic.\n\nIt was a rare event though, several other hopeful attempts at the same thing have seen my investment plummet to zero.", "score": 1, "replies": []}, {"body": "65% of my investments are tech/crypto.. not bad tech and crypto but still is what it is. Way I see it, I’m 19, don’t have that much money to begin with.. I’d rather take extreme risk for the opportunity of large reward than gain 7% on my $2500. When I get older and find myself making “grown up” money, I’ll be a lot more risk adverse.. as for now tho I’m more than comfortable with a high risk reward ratio", "score": 1, "replies": []}, {"body": "Around November I wrote a huge post on this sub about how valuations matter and the fed tightening would drop stocks, i was instantly downvoted into oblivion for daring to suggest one should consider share price ![gif](emote|free_emotes_pack|facepalm)", "score": 1, "replies": []}]}
{"title": "How trading in a bear market feels like", "selftext": "", "id": "vgz467", "created_utc": 1655768142.0, "score": 5037, "upvote_ratio": 0.99, "num_comments": 62, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|1 year ago\n**Total Comments**|38|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vgz467)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vgz467)", "score": 1, "replies": []}, {"body": "That occasionally goes up a bit, maybe more like chutes and ladders just with 70% chutes and 30% ladders.", "score": 101, "replies": [{"body": "\"You guys have ladders?\"", "score": 43, "replies": [{"body": "Yes but only so many people get to use them so it may feel like there aren't any.", "score": 5, "replies": [{"body": "At least someone could close the trap door on the gallows, sheesh ![img](emote|t5_2th52|4260)", "score": 7, "replies": []}]}, {"body": "Sorry, only chutes... no ladders in this game.", "score": 2, "replies": []}, {"body": "Chaos is a ladder", "score": 2, "replies": []}]}, {"body": "If there are chutes and ladders, then one must end in a ball pit.", "score": 3, "replies": [{"body": "I'm not shooting for a lambo but a slide in my house that goes from the top all they way to the basement where there is a room dedicated to a ball pit.", "score": 2, "replies": []}]}, {"body": "Guess snakes and ladders is an Oz thing? Or did someone decide it wasn't PC enough to use snakes?", "score": 3, "replies": [{"body": "Probably just a regional thing, but anakes and ladders sounds fun.", "score": 1, "replies": []}]}, {"body": "Throw your money back into the market everytime you see some ladder action. Y'know, buy the spike.", "score": 1, "replies": []}, {"body": "Exactly - never felt like a circle!   \n\nSliding down a Alice in Wonderland rabbit hole… - like the black hole sucking up all my money… aaahhhhh….", "score": 1, "replies": []}, {"body": "Our ladders only have one leg.", "score": 1, "replies": []}]}, {"body": "Spiral out. Keep going.", "score": 28, "replies": [{"body": "Over thinking, over analyzing separates the body from the mind.", "score": 1, "replies": []}]}, {"body": "Need some real analysis to show we are losing money", "score": 14, "replies": [{"body": "You guys still have money to lose?", "score": 8, "replies": []}]}, {"body": "\"What it feels like\" - correct\n\n\"How it feels\" - also correct\n\n\"How it feels like\" - congrats, you sound like a moron.", "score": 22, "replies": [{"body": "Hey ESL, but of course I am a moron, I am in this subreddit right?", "score": 4, "replies": [{"body": "Zing! (It's not that far off grammatically, but the guy you reply to is correct)", "score": 1, "replies": []}, {"body": "fair", "score": 1, "replies": []}]}, {"body": "How does it feel to treat me like you do?", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4260)", "score": 7, "replies": []}, {"body": "So now we're posting facebook boomer and cringy instagram motivational images", "score": 13, "replies": [{"body": "..... and upvoting the fuck out of them. So lame.", "score": 4, "replies": []}]}, {"body": "Sqqq calls all day till December", "score": 5, "replies": [{"body": "Do you think it will go higher than $66? I bought it close to $66 (All time high).", "score": 1, "replies": [{"body": "Might be the best thing to own as people panic, but I'm not sure if people think the dip is over.", "score": 2, "replies": []}]}, {"body": "I like to own some SQQQ next week when they announce GDP.", "score": 1, "replies": [{"body": "I sold most of my calls Friday. Obviously losing money on them today but This wave is going to keep happening. Find a nice little trend that you trust and make some money! \nOr be a fucking retard like me lol", "score": 2, "replies": []}]}]}, {"body": "I watched Top Gun today and this picture is precisely how I’d redesign an aircraft carrier", "score": 2, "replies": [{"body": "how about rockets?\n\n&#x200B;\n\nhttps://youtu.be/8ap\\_I--mv5s", "score": 2, "replies": []}]}, {"body": "Used to be so easy.......just find out who'll be buying back gobs and gobs of their own stock,,,,,now you have to try and find actual real value.....and still have to deal with probabilities and variance... that the value you spotted will turn into actual rewards....it's just too damn much.....work.......", "score": 2, "replies": []}, {"body": "It's either \"How trading in a bear market feels\" or \"What trading in a bear market feels like\". We speak English here, not Walmart.", "score": 2, "replies": []}, {"body": "More accurate picture\n\nhttps://mechstuff.com/wp-content/uploads/2015/09/0001.png", "score": 2, "replies": []}, {"body": "Hah", "score": 0, "replies": []}, {"body": "LMAYO", "score": 0, "replies": []}, {"body": "The spiral needs flames at the bottom... or crocodiles", "score": 0, "replies": []}, {"body": "Me when I make a tower for my D&D players to explore in Roll20:", "score": 0, "replies": []}, {"body": "Life is like a box of chocolates after all", "score": 1, "replies": []}, {"body": "And here I am trying my hardest to get a load off to feel less weight", "score": 1, "replies": []}, {"body": "I hate investing monthly right now, but I’m still going full ape.", "score": 1, "replies": []}, {"body": "I did a study years ago and found that bear markets are chaotic both ways- for shorts and longs.  \nSo even bears have trouble winning sometimes in a down market.", "score": 1, "replies": []}, {"body": "This is way to deep for this sub, follow every tip this dude gives you.", "score": 1, "replies": []}, {"body": "I hit the ground get me a shovel", "score": 1, "replies": []}, {"body": "This is how planets rotate around the sun actually. We really don't understand lot of things", "score": 1, "replies": []}, {"body": "Just sleep like hibernation on animals, wake up me at start of bull run", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "4288 UNITS! BOOM!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "GME 🦍s over here siting like ![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "R is a covering space for S^1", "score": 1, "replies": []}, {"body": "Eventually you get to the bottom and start walking underneath the stairs and spiral back up", "score": 1, "replies": []}, {"body": "Same for bull market’s. Sooo many puts played atm. Can’t go tits up", "score": 1, "replies": []}, {"body": "Here on Wall Street, tomorrow is today. And today is yesterday. You heard me.", "score": 1, "replies": []}, {"body": "Thx, that really helped", "score": 1, "replies": []}, {"body": "Oh yeah well what if I go the other way", "score": 1, "replies": []}, {"body": "Great album, 10/10 recommend", "score": 1, "replies": []}, {"body": "Sadly.", "score": 1, "replies": []}, {"body": "Ooh damn really felt this one.", "score": 1, "replies": []}, {"body": "Ahh an YT screenshot", "score": 1, "replies": []}, {"body": "When I saw that thumbnail I thought it was one of those threaded wood inserts.\n\nWatching too many videos on furniture making.", "score": 1, "replies": []}, {"body": "You hit too hard 😂😂😂", "score": 1, "replies": []}]}
