{"title": "CloudFlare for less risky exposure to Web3?", "selftext": "Buying ETH would be opening yourself up to a ton of DeFi ponzis (see: celsius, terraluna,...), But CloudFlare offers a ETH gateway as well as an IPFS gateway, both Web3 staples.\n\nAlso: CloudFlare is used by >80% of websites and it has a larger market cap than the S&P500 internet infrastructure company, Akamai.\n\nCloudFlare seems to have built a moat in the internet infrastructure space by offering superior products (ex: cloud hosting, cache, security, easy and free for personal use, etc) as well as covering most websites.\n\nCloudFlare also has a sticky customer base because changing your CMS often involves changing multiple APIs that depend on an always available (see: CloudFlare's superior cache) site.\n\nCloudFlare has seen a huge uptick the past 5 days of ~30% and it might be a huge player in the next bull market, whenever that happens. Either it's acquired, enters the S&P, or both.\n\nThoughts?", "id": "vl7qie", "created_utc": 1656258839.0, "score": 28, "upvote_ratio": 0.71, "num_comments": 63, "comments": [{"body": "Cloudflare is good company, but web3 is bullshit.", "score": 20, "replies": [{"body": "There's decent products in the space. GLM, FIL...", "score": -9, "replies": []}]}, {"body": ">Thoughts?\n\nValuation is important. And Cloudflare is ridiculously expensive.", "score": 23, "replies": [{"body": "What makes you say that?", "score": 1, "replies": [{"body": "How does its revenue compare to Akamai?", "score": 1, "replies": [{"body": "About a fourth of Akamai.", "score": 1, "replies": [{"body": "Hence, expensive?", "score": 4, "replies": [{"body": "Good point.", "score": 5, "replies": []}, {"body": "Does it matter that Akamai and Cloudflare offer different services", "score": 1, "replies": [{"body": "How different are they? One seems mostly enterprise and the other seems mostly retail", "score": 1, "replies": [{"body": "Akamai more on the CDN side, Cloudflare more on the DNS side.", "score": 1, "replies": [{"body": "For the layman, is that big of a difference? They both are security for the internet.", "score": 1, "replies": [{"body": "I'm not sure! Hence why I asked if investors cared for the difference.\n\nAkamai is typically for getting your content to the user after the user has found your site.\n\nCloudflare is typically for ensuring users can get to your site in the first place.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Is it still expensive?", "score": 1, "replies": []}]}, {"body": "Cloudflare is less risky in the sense that it's actually got a moat and will probably continue to do well as a company for a long time, but the stock near-term is extremely risky because of the valuation.\n\nCloudflare is a great company, but the valuation it's still too expensive in this environment. It's not that I don't think it can grow into the valuation eventually, but the upside given its current valuation isn't worth the risk of it dropping 50% in a couple of weeks (which it easily could given the valuation).\n\nWhat makes this market is difficult is that a lot of the trash growth tech names actually look reasonably valued here (HOOD, FSLY, etc), but I generally don't think it's a good idea to buy trash because you find there's often no floor even if the valuation is reasonable, and that's especially true right now.\n\nThen you have quality growth tech companies like NET, SNOW, CRWD, NVDA which look cheap relative to last year, but they're still trading at surprisingly elevated valuations given where trash growth is trading.\n\nIf you really want to bet on \"web3\" I suspect now is the time to buy the trash, honestly. The trash has been hit both by rates, but also by sentiment -- literally no one wants to own it. Quality tech may still have a leg down because people are turning to quality for perceived safety, not because of their fundamentals.\n\nThere are very few places to hide in tech right now and in this market it's just not good enough to point to some macro trend and make a bet at any price. You have to be patient and wait for the stocks you like to come to you, even if that means missing opportunities.\n\nSo if I were you given NET's valuation I'd work out a price you believe is reasonable and wait. For me a fair valuation for NET is around $10-12b. And arguably that would still be a very fair valuation because I'm giving it a huge quality premium.\n\nOh, and I wouldn't buy NET for web3 exposure personally. That would be a very noisy bet.", "score": 5, "replies": [{"body": "What's the most objective way to figure out CloudFlare's fair evaluation?", "score": 1, "replies": [{"body": "Well that's the question have spend generations asking... There is no agreement and there never will be. It's even harder to find agreement when a company isn't profitable or isn't prioritising profitability like Cloudflare.\n\nGenerally I try to consider as many variables as possible and just accept I might be a bit wrong. The objective is just to be somewhere in the ballpark so that you're not grossly overpaying for a company you'd like to own.\n\nObviously the most important thing to consider is the valuation based on future earnings. In the case of NET you kind of have to guess how profitable they could be because currently they're losing money. A 20-25% operating margin would be fairly reasonable imo. With current annual revs of $700m that would equate to around $180m in net income -- or about a 90x hypothetical earnings multiple on their current valuation. That's high, but NET has an annual growth rate of around 50% so we should expect a decent multiple on those hypothetical earnings, it's just for me I would rather that be closer to 50. At 50 you would get a valuation of $9b.\n\nHowever, stocks like NET probably need a bit of a premium for several reasons. Firstly, they have a decent moat. They have very sticky revenues with an excellent net retention rate. They have a lot of room to grow so that 50% rev rate in theory should have many years to run if they continue to execute. And finally I'd also give them a premium for their track record of building innovative stuff that engineers love -- this innovation premium imo why investors missed opportunities in companies like TSLA, AMZN, AMD, etc. The returns of a company that's constantly able to out innovate their competition is very hard to predict, but it's these are generally the companies that are consistently able to surprise investors to the upside.\n\nBeyond a stock's fundamentals I also like to think a bit about sentiment, macro and broader market conditions when investing.\n\nSentiment for NET right now is surprisingly good imo - or at least it hasn't got the extreme negative sentiment that a lot of growth tech stocks currently have. I personally don't like that because it means sentiment is less likely to surprise to the upside and if sentiment turns negative it could drop big. For example if NET disappoints on earnings I can almost guarantee it will drop 25% from its current valuation. This isn't true for stocks like HOOD and COIN because sentiment for these companies is now so bad that everyone is already expecting crappy earnings which sets them up for relief rallies or minor drops at worst.\n\nOn the positive side I think the macro is becoming more supportive of NET here and it's why I've recently raised my target price for it. To briefly summarise I think yields have probably peaked and I suspect in an economic slow down will look for companies that are able to continue to grow and I think NET is one of the most likely companies investors will turn to. You'll need to make up your own mind about how the state of the economy could impact an investment in NET, but what I will say is that where you believe yields will go next is going to be very important for a stock like NET at this point in time. If you think the 10y yield is going to 4% then you don't want to be buying NET however much you like the company.\n\nFinally, I think it's worth considering what's likely to happen in the broader market from here because stocks largely trade with the market near-term. I'm quite neutral on the market right now, although I think we probably need to go a bit lower before this bear market is done. 3,500 is my target for the S&P500, although I suspect we might see a test of the pre-pandemic highs. If that selling pressure materialises that will probably push a high-beta stock like NET down quite a bit from here. If you asked me how I felt about NET last month I would have been much more negative because I felt more confident the market was going lower. Now even though I don't think NET is a great buy at its current valuation, do I think it could do okay if a market bottom is in.\n\nSorry, this is way too long a reply lol.", "score": 3, "replies": [{"body": "Ya same", "score": -2, "replies": []}]}]}]}, {"body": "What does NET have to do with Celcius + Terra /Luna?", "score": 7, "replies": []}, {"body": "I don't think you really understand the technologies you're talking about.", "score": 9, "replies": [{"body": "Enlighten me then.", "score": -5, "replies": []}]}, {"body": "> CloudFlare seems to have built a moat in the internet infrastructure space \n\nWhat?  There is tons of competition.   In what way has CloudFlare built a moat?\n\nAlso CloudFlare is pretty expensive and it is hard to see what fundemental advantage they have over competition.  In someways they are at a disadvantage.    Take Google.  Over the years they have been buildling up their direct connections to the ISPs.\n\nI would expect CloudFlare to see more and more competition from the big guys.", "score": 3, "replies": [{"body": "Thinking there's a moat because of name recognition at least.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Lol. 2022. Imagining the Terra Luna collapse didn't affect the price of ETH.", "score": -10, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "People sold ETH because evidence increased in favor of crypto being a hotbed for scams, frauds and ponzis.  Which it is, of course.", "score": 2, "replies": []}, {"body": "Christ dude. You really don't see how crypto moves together to a large extent? That's like saying there's no connection between stocks in two different sectors going down simultaneously while in a bear market.\n\n&#x200B;\n\nCrypto bros are another breed.", "score": 0, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Yup, still missing the point as I figured you would.\n\nLet me spell it out: anything that affects people's perception of crypto will hurt/help all coins. The luna debacle hurt the integrity of crypto in the minds of investors. You're delusional if you don't understand this.\n\n&#x200B;\n\nOtherwise please explain why the exact date of the luna issue also saw significant drops in many coins? Good luck.\n\nEdit: ETH went from \\~3000 to \\~2000 in that one single week that Luna was collapsing. Imagine thinking Luna had nothing to do with it.", "score": -3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "You're right, a massive failure in crypto didn't affect other coins. How could I be so silly.\n\n&#x200B;\n\nRemember when Netflix lost subscribers and tanked and took down other streaming services? Same idea at work. Either understand this or get rekt thinking correlated things aren't correlated.\n\nAnd yes, the market is completely illogical and many people make investing decisions based off other companies failures. Surface level research is the norm, not the exception.", "score": -1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Regardless of his approach, how did the collapse of Luna and their stablecoin crashing not affect the prices of other coins? The fact you can exchange coins for other inherently tie them together, not even speaking to the insane amount of crypto margin/leverage these people create with coins. Like does anyone believe tether is fully backed? No of course not, which means there is probably billions of eth of coins that tether has bought and driven up the price on. Imagine if tether was worth half of it was now, how would that not fuck the market as whole.", "score": 2, "replies": [{"body": "My comparison of streaming services might have been the wrong approach. I'm aware that coins have different utilities. But so do companies like nflx and amzn that both happen to have streaming services. Many people who invest in crypto see it as a single sector, and thus the prices become correlated, especially when something like LUNA happens. The other dude seems to not understand this.", "score": 1, "replies": [{"body": "Because it is a SINGLE SECTOR, explain to me how no intrinsic value coins can provide value like companies with legitimate revenue and books. The reason crypto is so tied together because the only thing holding it together is the collective belief on one of two things, one: you truly believe crypto is the future OR two: you believe in the bigger fool theory and are risking an investment. Crypto inherently pays no dividends and is not tied to a revenue stream. Other dude seems to understand the EXTREMELY close correlation between EVERY coin. Your argument that Luna crashing had no effect on the value of ETH is just factually incorrect in every way, WAY more so than two companies that are a part of the same market in a couple of their offerings(Amazon v Netflix v Disney streaming).", "score": 2, "replies": [{"body": "I am the other dude :) I agree with ya. And yes, crypto is all the same sector, I agree there as well. But i'm aware not everyone sees it that way.", "score": 1, "replies": []}]}]}]}, {"body": "I did not say a single time that eth and luna serve the same purpose, did I? Or did you just assume that? Its the latter.\n\nSaying that their prices are correlated =/= saying they are the same thing. Just like netflix and disney or netflix and amazon are not the same. \n\n&#x200B;\n\n\"Am I saying a bunch of people who didn't understand what they were invested in didn't just sell all their crypto? No. I'm sure some did.\"\n\n\\-That was my exact point. That proves they are correlated, even if they don't serve the same purpose. Thank you for finally coming to the correct conclusion.", "score": 1, "replies": []}, {"body": "Implosions of popular coins and exchanges definitely have an impact on the overall crypto market. I think you’re thinking everyone is valuing coins only on their fundamentals and potential utility, when in reality, at least right now, it’s majority dumb money that is looking for a quick buck.\n\nWhen one disaster happens in the crypto space, people are selling any and all coins out of fear, needing money, etc. What the coin can potentially provide doesn’t really matter at the moment. Which is obviously one of the major problems.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Lol. All cryptos are highly correlated. And if you look at the price action of eth the day of the Luna collapse, it wasn't pretty", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "??? Dude are you arguing that Terra Luna didn't effect eth? That's so dumb", "score": -2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Lol. I'm not saying the Luna fiasco will happen to ETH. I'm saying ETH is too much DeFi exposure for most of us.", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Like can you really argue the crash of Luna and the money pulled out of the defi ecosystem didn’t affect the value of ETH on the open market?", "score": 2, "replies": []}]}, {"body": "Dude you are right lol, idk where this guy is coming from. Its sounding like he’s saying “your ETH doesn’t actually lose value cause they aren’t tied together” as if the majority of people are holding coins cause they believe in their eventual utility. It’s a bit insane to say the crash of Luna didn’t have over reaching effects on the ACTUAL value of the coin(that not being what people “think” it’s worth, but what people are willing to pay for it”.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What is web3?", "score": 4, "replies": [{"body": "Bullshit buzzword. There is nothing decentralized about it. Would you run your own node to get on the internet?\n\nEverything web3 is on infura nodes.", "score": 13, "replies": []}, {"body": "What is google?", "score": -3, "replies": [{"body": "[answer](https://googlethatforyou.com?q=what%20is%20google)", "score": 1, "replies": []}]}]}, {"body": "Cloudflare is amazing, but they're soooo overpriced.\n\nLike, are you willing to hold it for a decade?", "score": 1, "replies": [{"body": "Honestly, yeah.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Here we go again lol\n\nLet’s all be the boomers at Kodak ignoring digital photography until near bankruptcy.\n\nOr just adopt and research for sake of possibilities and capturing market share along the way.", "score": 4, "replies": []}, {"body": "Why", "score": 1, "replies": [{"body": "Because they say so… because according to 99% of the haters it’s either:\n- blockchain tech can’t handle the workload (based on the idea that it would somehow immediately try to absorb every single item of data in existence and overload the blockchain)\n- blockchain tech is just stupid", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "There’s your problem, you’re stuck in the “blockchain is for crypto only” mindset. I own zero crypto because it’s an unsustainable scam by itself, but I look forward to the many legitimate, sustainable use-cases Web 3.0 brings.", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": -8, "replies": [{"body": "I googled.  They dropped 8chan as a customer... after 3 shooting sprees.  Mass murder is now 'politics'? or was there something else.\n\nCloudflare is essentially a 'pass through' service and they've been ignoring their responsibilities under DMCA law for a decade (i've butted heads with them a couple of times helping other people trying to get them to stop serving their revenge porn).  Someday a lawyer or government is going to give them a spanking.", "score": 10, "replies": [{"body": "There were others.", "score": 0, "replies": []}]}, {"body": "And I got voted down last time for posting about that. It is scary when a company bows so easily to social media Karens.", "score": 1, "replies": [{"body": "Yes but that has nothing to do whether it is a good investment or not", "score": 1, "replies": [{"body": "Poor and/or weak management certainly does. I’ve worked for a lot of different places on the side and during summers for over forty years, and one of the biggest killers I’ve seen is if the head of the company lets customers push them around. Letting non customers push you around is even worse.", "score": 0, "replies": []}, {"body": "Would you sign a contract with a company that has screwed customers before because of pressure from social media? Seems like an unnecessary risk.", "score": 1, "replies": []}]}]}]}, {"body": "Frankly, I think that's bullsh\\*t.\n\nI can't comment on the very first paragraph, though.", "score": 0, "replies": []}, {"body": "RemindMe! 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2023-06-26 23:40:11 UTC**](http://www.wolframalpha.com/input/?i=2023-06-26%2023:40:11%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/vl7qie/cloudflare_for_less_risky_exposure_to_web3/idv7a1k/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fvl7qie%2Fcloudflare_for_less_risky_exposure_to_web3%2Fidv7a1k%2F%5D%0A%0ARemindMe%21%202023-06-26%2023%3A40%3A11%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20vl7qie)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "I have explored cloud and multiple etf funds reached the conclusion they have room for more free fall. Overvaluation.", "score": 1, "replies": []}]}
