{"title": "Best strategy to recompense unrealized $20,000 share loss in EV stocks in 2020?", "selftext": "[deleted]", "id": "178pya5", "created_utc": 1697406262.0, "score": 17, "upvote_ratio": 0.66, "num_comments": 30, "comments": [{"body": "Have you considered using the time machine in the basement ?", "score": 54, "replies": [{"body": "I was going to say selling your body but this is better.", "score": 4, "replies": []}]}, {"body": "Ask if you had no position, would you buy these stocks today?  If the answer is No, just sell and move on.  Unfortunately, is no \"recover quickly and efficiently\" method (unless you can move the market).  It does not pay to get stuck on a bad trade for years.", "score": 22, "replies": []}, {"body": "I’d keep selling CCs.\nAssuming you have gains in other stocks you sold, sell off up to $3000 in December and take advantage of the tax loss.", "score": 8, "replies": [{"body": "> Assuming you have gains\n\n That’s a pretty bold assumption", "score": 2, "replies": []}]}, {"body": "You can sell them and do tax loss harvesting! Of course on the other side you need some profit based on short term or long term to offset these losses. Buy back again on 31st! \n\nI am in same boat for NIO.", "score": 3, "replies": []}, {"body": "Select the position in your portfolio's position list and click Undo or Ctrl + Z.", "score": 4, "replies": []}, {"body": "If you in a position that is going nowhere but down the longer you stay there the more you are going to lose. \n\nIf you were in a stock that could increase somewhat you would possibly be able to lower your cost with a stock repair strategy.", "score": 3, "replies": []}, {"body": "Don’t buy companies that lose 300k per vehicle because of the Tesla bubble", "score": 7, "replies": []}, {"body": "As several have mentioned, if the stock continues to go down, most option strategies are going to lose more money than just selling the stock. So you need to ask yourself, would you invest in LCID and PSNY at these prices assuming you didn’t already own them? If not, then you are better off selling.\n\nFor what it’s worth, it’s going to be a LONG time until LCID is $26 again given the general uncertainty with the auto market right now. I i were you, I would sell and invest in stocks with a better outlook or an index fund", "score": 2, "replies": [{"body": "If you have losses on a stock, you don’t need to try and make gains back with the same stock. Imo, you’re hoping that they will come back and fearful that if you sell, they will turn around and rip higher.  If you would still buy them here with fresh cap, then stay in.  Otherwise, I would cut the losses and move onto something else that is moving in the direction that you want… either long or short.  Good luck.", "score": 2, "replies": []}]}, {"body": "just do the opposite of what you did", "score": 2, "replies": []}, {"body": "If you own the shares sell strangles.\n20-25d C&P against the positions. The will have considerably more theta then your covered calls and you  will be able to reposition them easily to take in small credits.\nWorst case is you have to buy more for dirt cheap or sell shares for less than you want. But, because you own the shares you are in a great position to run strangles because they are not undefined loss positions. Something that a lot of new traders really struggle to overcome.", "score": 3, "replies": [{"body": "I’ll probably do this. Quick question: is it foolish to make expiration longer than 30 days? Trying to get more premium. Also, I plan to sell entire quantity of CC’s however only 3 (300) CSP’s. Is that okay? Or is it standard that the quantity matches (like the expiration does). Here’s what I plan for LCID:\n\nLeg 1: STO 7 CC’s. 1’24 expiration $27 strike\n\nLeg 2: STO 5 CSP’s. 1’24 expiration $4 strike \n\nPremium: $200", "score": 1, "replies": [{"body": "I'm not sitting in front of my computer at the moment so I'm going to wing it lol *sips beer*\n\nIf I had a hundred shares, I would sell a call at 20ish Delta and sell a put at 20ih Delta. I have enough cash on hand that it's a cash secured put, and I have 100 shares in case they get called away I don't have to worry about that position being naked.\n\nI don't see any reason why you couldn't sell things longer than 30 days I probably wouldn't go much past 45 ish, You're probably going to find that you close these positions for a small profit every 15-20 days and then reposition. I run this exact strategy on Microsoft and Apple all the time. It's rare I hold anywhere near close to expiration, It's my personal preference to take more small profits often. These kinds of positions time is your friend but don't try and overdo it, it becomes a diminishing return If you try to go too long.", "score": 2, "replies": [{"body": "Thank you. Enjoy that beer lol", "score": 1, "replies": []}]}]}]}, {"body": "sell and move on", "score": 4, "replies": []}, {"body": "Polestar has a decent chance to regain over time but Lucid ouch", "score": 1, "replies": []}, {"body": "Sell puts at the money looking for to get assigned. This will ultimately add more shares at the reduced current price minus the premium received and will decrease your average cost.", "score": -5, "replies": [{"body": "How will this help in reducing exposure to current stock! Sell call instead!", "score": 8, "replies": []}]}, {"body": "I’m down like $300-350k from the top of where I was at with my Tesla shares so it could be worse. 🤷🏻‍♂️", "score": -4, "replies": []}, {"body": "When are people going to clue in that this EV revolution is not going to happen?\n\nYou can keep selling calls but it’s very reasonable that these stocks will keep going down and may never recover", "score": 1, "replies": []}, {"body": "LCID is still trending down.    \nSame for PSNY.   \nCan you make more than the trend's continuing losses?  \n\nI would examine why you still own these.", "score": 1, "replies": []}, {"body": "There's not much you can do. Closing the shares and selling ATM can hinder gain as it is limited profit. I would probably wheel half, similar to what you said on LCID. These low stocks can easily double in a week; they also tend to happen in the least expected time too.", "score": 1, "replies": []}, {"body": "Better quite , if you don’t want to loss more .", "score": 1, "replies": []}, {"body": "Chpt blink lucid nio Nikola deadly stock \nKeep losing money more you hold", "score": 1, "replies": []}, {"body": "Hopium (ALHPI) hydrogene cars will be better investment they tuch the bottom they will go very high soon.", "score": 1, "replies": []}, {"body": "You have two quick solutions: Sell your shares and move on, or leave your account untouched for 5 years and hope for a recovery.\n\nThe latter option limits  your ability to explore other investment opportunities, whereas the former option serves as a reminder to learn how to use stop-loss orders.\n\nIt's important to remember that every company is promising until it doesn't.", "score": 1, "replies": []}, {"body": "Hmmm do you know what options are??? Bahahahaha jk DONT DO IT!!!!", "score": 1, "replies": []}]}
{"title": "Hey there! How can I find out the consumption of products of a company by country, please? Mondelez Inc x Nestle SA.", "selftext": "[removed]", "id": "178l1dg", "created_utc": 1697392868.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 19, "comments": [{"body": "Have a Bud Light.\n\nOh yeah, stay off twitter.", "score": 5, "replies": [{"body": "Yeah, I’ve already seen a few people mentioning Bud Light on X in relation to the Bis boycott", "score": -2, "replies": [{"body": "I kinda looked at the charts and looked at the news. Any perceived boycott is a result of them dragging their feet about leaving Russia. But according to the right wing influencers it's the left wing influencers fault. Just so you're straight about bud light, It's wasn't the trans influencers that lead to the downfall of bud light, it was the right wing amplifying a trans was drinking bud light.  99.99999999999999999% of the people would have never known if it wasn't for the Extreme Right Wing Outrage.  Amazing how most of the bud light drinkers boycotted their favorite beer.", "score": 1, "replies": []}]}]}, {"body": "What in the absolute rambling is this shit? Keep this stupid political shit out of here please, no one cares about it", "score": 3, "replies": [{"body": "Well, I understand you have no interest in it since it might not affect those companies stocks. I guess if it was Brazilian and on B3 it would be a whole different story and I wouldn’t even be on this sub. \n\nBut, I’m here exactly to ask that, if this can somehow affect those companies stocks even tho it is exclusively happening in Brazil. And it would be easier to predict that if I could find out their sales worldwide.", "score": 1, "replies": [{"body": "Of all the reasons to be mad at Mondelez, the fact you think because they had a 10 second throw away to some dude in brazil just to pander to an emerging consumer market is the deal breaker.\n\nHow about mondelez destroyed private agriculture, created a modern serfdom in industrial farming, absolutely lost forever the heirloom delicious veggies and fruits of north america in order to sell us styrofoamesc crops that look good and taste like nothing. These are reasons to hate mondelez, not some bullshit social politics crap you think matters but really is a shit on a gnats ass.", "score": 1, "replies": [{"body": "Well, I just shared what’s happening in Brazil regarding those two companies and wanted some regarding their stocks and sales. \n\nI don’t know if you are aware but our elections were neck and tie and the right wing is seeing this as a way to “protest” somehow. I know, it might sound absolutely stupid way of protesting but, when you are in fear of making bigger gatherings to speak up etc. this is the way they found to make a statement and say that they are there and going nowhere. As as well as payback to all the damage he made to any celebrity who was supporting right wing. He used his influence to “haunt” some of them and force a public political position. \n\nAnd don’t get me wrong, I see this as futile too but it got a whole new layer when left politicians made a video eating the candy. I mean, I think any serious politicians wouldn’t do such a thing and this just shows how Brazilian politics turned into a shit show.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Nestle sold all their candy brands to Ferraro.", "score": 1, "replies": [{"body": "“In the US, Kit Kat is sold by Hershey. In the rest of the world, Nestlé’s in charge.” \n\nSource: https://edition.cnn.com/2023/09/02/business/kit-kat-international-flavors-curious-consumer/index.html", "score": 0, "replies": []}]}]}, {"body": "Bloomberg subscription, single terminal, \\~30k/year", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "So, you believe that the sales of Bis can impact MDLZ shares?\n\nYour content is biased. Has it occurred to you that they might just be throwing away products they already had? But if they are buying to throw it away then I agree that it is very dumb.\n\nYou might call them lunatics, but they see as payback since the influencer was doing exactly that back then. \n\nAlso, free Kit Kat publicity going around there: https://x.com/Jakelyneloiola_/status/1713329532684386806?s=20", "score": 1, "replies": [{"body": "Certainly it’s me who’s biased, that’s why I’m writing a novel about some chocolate which a lowly regarded “influencer” for kids is posting about. No…. wait", "score": 1, "replies": [{"body": "Why did you use quotation marks for influencer? The guy has 45M subscribers on YouTube and was elected by Times one of the 100 most influents of the world in 2020. \n\nI think it is the third time you are coming for my posts regarding this matter. So, you sure are at least irritated by it. Otherwise, why would you try so hard to insult me and depreciate the post again and again?\n\nI’m really start to think you are part of the Bis marketing team try hard to don’t inflate this issue more than it already has lmao", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Better start looking for a new job then.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Was that the best you could find to validate the amazing sells Bis gonna have? lol \n\nI mean, we have lunatics on both sides and I’m pretty sure Bis might have a short boost on sales. Let’s see on the long term. How many boxes are you gonna buy?\n\nAnd it doesn’t matter your political view, choosing the said influencer to sponsor was not the smartest thing to do.\n\nWith that being said, I just saw that KitKat is on x’s Brazilian trending topics and it didn’t cost a dime. And the polarization is now being commented on bigger news outlet:\n\nhttps://www.cnnbrasil.com.br/nacional/campanha-de-felipe-neto-para-bis-se-torna-disputa-politica-nas-redes-sociais/", "score": 0, "replies": []}]}]}]}]}]}]}]}]}
