{"title": "[deleted by user]", "selftext": "[removed]", "id": "17djtlk", "created_utc": 1697944281.0, "score": 76, "upvote_ratio": 0.78, "num_comments": 30, "comments": [{"body": "You should share the asset to debt ratio..", "score": 11, "replies": []}, {"body": "Sacrificing margins to keep its market share. Tesla should be re-rated as a car company from it's current Tech company valuations.", "score": 48, "replies": [{"body": "Margins always had to come down.  The issue was when.", "score": 10, "replies": [{"body": "I had so many arguments here with Tesla bulls claiming the sky high margins were here to stay and justified the valuation...", "score": 2, "replies": []}]}, {"body": "It shouldn’t, they spend massive amounts of capex on models and training I see no reason they wouldn’t have a similar multiple to open A.I. when they IPO. FSD can be packaged and sold to every Oem so they don’t have to spend billions developing their own FSD. Also they have shown the ability to repackage their intelligence into other working prototypes like the Tesla bot. If Tesla FSD works and can be licensed to other OEMs thats a multi trillion dollar TAM.", "score": 2, "replies": []}, {"body": "It’s actually a vertically integrated renewable energy infrastructure play.", "score": -7, "replies": [{"body": "Is this renewable energy infrastructure play in the room with us right now?", "score": 10, "replies": []}]}]}, {"body": "You do know Tesla has essentially no debt right?", "score": 19, "replies": [{"body": "They’re also just a car company", "score": 2, "replies": []}]}, {"body": "This makes me bearish on the stock… so I should maybe buy some calls I guess.", "score": 2, "replies": [{"body": "Everyone downvoted my NIO comment so its probably time to buy more.", "score": 1, "replies": []}]}, {"body": "If Tesla cybertruck becomes a bulletproof vehicle then the criminals will buy it and commit more crimes", "score": 2, "replies": [{"body": "It will not be bulletproof", "score": 1, "replies": []}]}, {"body": "ASP would be quite crucial for the CyberTruck to be a hit. Tesla’s sedan models are way ahead of the curve especially in price terms.", "score": 1, "replies": [{"body": "Do you think NIO has good car models? I watched a video the other day on youtube of a guy driving his.", "score": -11, "replies": [{"body": "BYD seems like the winner in China. They are already starting to expand outside. Scale in very important in Autos.", "score": 1, "replies": [{"body": "Ok, thank you.", "score": 0, "replies": []}]}]}]}, {"body": "I seen the same balance sheet played out at meta. Look at how meta renounced", "score": 1, "replies": []}, {"body": "fair price is $50/share imo. so, gonna buy if it goes under $40", "score": -11, "replies": [{"body": "TSLA? $50? Really?", "score": 16, "replies": [{"body": "It’s simple if you value it as car company $40 is probably fair price the price currently is an A.I/Software company.", "score": 3, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Correct by valuing I meant softwares future revenue isn’t being fully counted. Due to investors to believing in FSD and the ability to re package their software into different packages. Because car revenue if you go out far enough is less than 10% of Revenue and less the 1% of Income.", "score": 1, "replies": []}]}]}, {"body": "Never\n\nAll the 401ks and vanguards will make sure it stays high", "score": 1, "replies": []}]}, {"body": "You will end up buying at the top, probably around $500... Elon has a basement under each factory where he slaughters bears for fun...it is not his first rodeo...and I say that as I hate him with a burning passion!", "score": -6, "replies": [{"body": "Yes I will when it reverse split after it dips under $50!", "score": -6, "replies": []}]}, {"body": "How about NIO or GELYF?", "score": -5, "replies": []}]}, {"body": "What webpage is this from?", "score": 0, "replies": [{"body": "https://ir.tesla.com/#quarterly-disclosure", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I bought NIO.", "score": -4, "replies": []}]}]}
