{"title": "Are the Bears Right About Tesla Stock? | The Motley Fool", "selftext": "", "id": "17ib9gy", "created_utc": 1698490404.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 35, "comments": [{"body": "No, not when legacy automakers are losing 70-80% EBIT margin,  startups are collapsing  and there is massive consolidation in China. During hard time, the ones in the lead pull even further ahead. Tesla doesn't exist in a bubble. Tesla is \" suffering\", meanwhile others player are just straight up imploding.\n\nEdit with the only exception being BYD and in minor terms, Rivian.", "score": 50, "replies": [{"body": "Rob Maurer did a section on Tesla Daily yesterday or Thursday talking about the legacy automakers losing EBIT margins and slowing down EV plans when they haven’t gotten to a decent run rate that lowers their costs so they will continue to be bleeding money. Tesla has a strong run rate so the pain is limited because they cost of each car is so much lower. \n\nWhatever internal factors that are keeping legacy automakers from selling more cars (eg dealership resistance and ignorance, or trying to take an ICE design and change it to EV instead of starting from scratch) should be addressed head on instead of only blaming the economy/interest rates and customer demand. Legacy automakers have a loud platform to dispel EV myths and make sure the general public is clear that EVs can be used in just about all driving situations an ICE vehicle is used in. Though, it will be helpful for non-Teslas to have a solid charging infrastructure.", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "We’ve already done that", "score": 2, "replies": []}]}]}, {"body": "The top 5 Chinese automakers would disagree with the Bear notion that EV’s are a quirky fad, and they have the product and sales to back it up.  BYD, Li, Xpeng, Nio show strong performance and the stated consolidation is happening and winners are starting to appear.  And it’s not just Chinese startups…it’s their legacy manufacturers like BYD overtaking others too.  And all the “experts” touting fear and nonsense about unsafe or outdated vehicles simply do not know a thing about where the transformation is in the automotive industry today.  Keep bashing Tesla.  It’s only the US auto industry’s last best hope and they could end up a first tier supplier to OEM’s from other countries while US automakers fade into oblivion like their DeSoto and Nash Rambler predecessors.\n\nAs an example of how far China is in the EV race, Li Automotive is releasing its first BEV, a minivan they named the Li Mega, in December 2023 with 4 more BEVs coming by 2025.  And supposedly one can get a full charge in about 10 minutes.  They already have several popular hybrids they started with only b/c of lack of charging infrastructure, but in the Chinese way there is already about 90% charger coverage along their highway system from the past few years.  https://youtu.be/1sHJxlMtYSQ", "score": 1, "replies": [{"body": "Technically BYD launched their EV before Tesla - I mean it’s like of legacy auto but it kind of isn’t", "score": 1, "replies": []}]}, {"body": "Vw is actually improving on revenue and EV sales", "score": 1, "replies": []}]}, {"body": "Bear bull discussions are short term. I do feel that margins will be lower than expected for automotive personally. I think long term energy and software (say an app store) and ai will help. But I'm personally very skeptical of fsd and tesla bot who knows?", "score": 14, "replies": [{"body": "Even if margins are only 5-6% on an ASP of 25-30k, that's just dandy if you manage to sell 15-20 million cars a year.", "score": 2, "replies": [{"body": "That's a big if.", "score": 4, "replies": [{"body": "It always is until you do it. Everything about tesla was \"impossible\" until it wasn't", "score": 1, "replies": [{"body": "Right but there's real reasons to doubt these things. Margins coming lower means that the ability to cheaply produce cars is more limited than demand is. Very high volume will be predicated on very cheap price which is predicated on lithium supply, dbe, and other processes. I invested in the company because I like you believe it will do big things. But I don't write blank checks and assume perfection forever.", "score": 3, "replies": []}]}]}]}, {"body": "What makes me skeptical of FSD is their vision park assist.", "score": 3, "replies": [{"body": "It definitely needs work due to it being neglected for other work, but the overall package is getting good, so once everything is stitched together, it should be great.", "score": 4, "replies": [{"body": "If their vision sensing in a parking situation is that inaccurate… how will it be 50mph in a dense situation.", "score": 0, "replies": [{"body": "You should try it before guessing - have you been stuck in a cave for the past year+?. Does fine in traffic. Watch any youtube fsd beta video and watch it do what no other car you can buy can.", "score": 2, "replies": [{"body": "I agree it can do what no other car you can buy can… but that doesn’t actually mean all that much.\n\nThe comparison isn’t what any other car you can buy can. The comparison is what it needs to be. And it is extremely far from where it needs to be outside of highways. It’s miles before disengagement is far from where it needs to be. The vast majority of 30 minute drives need an intervention. It may be extremely impressive, but it isn’t close. You need many nines of reliability here, and seeing vision park assist be so far off is really disappointing to me. Because I always assumed the issues where fully on the control side, not the vision side. But if they can’t get vision park assist, it means the vision system has issues. Why does the vision system have issues ? It means we can’t yet lay to rest the “you only need vision” argument.  Not until it is proven can we lay that to rest, and vision park assist is showing us we aren’t there. Hopefully the issues don’t stem from the sensor suite. If it does.. it means hw3 isn’t adequate. Even if adding more cameras are needed, and not more sensor diversity, it’s still a big problem. So hopefully it’s a software issue.", "score": 1, "replies": [{"body": "No one is \"there\" yet, but the point is that Tesla is *demonstrably* further ahead. How close to the finish line is another question, but it means very much and is precisely the comparison. Intervention counts are still annoyingly present, and vision-based parking definitely needs work, we agree there. Vision and controls aren't the issue, forward-planning is. Time will tell", "score": 1, "replies": [{"body": "What do you mean “the point” the comment was “I’m skeptical of FSD” and I responded “what makes me skeptical of FSD is their vision parking assist” and than you challenged me on it.\n\nWe have multiple approaches to FSD. The scalable Tesla approach which also relies on vision which isn’t reliable enough to be used as true self driving.. And the premapped approach that also relies on sensor diversity , which is functional (Waymo) as self driving.\n\nObviously there is a lot going on here. Waymo’s approach , and cruise for that matter do the premapped approach, but you can see how there’s some limit. The pre mapping stage is becoming easier and easier and involves a car driving around and using its sensor data to do the mapping. At the same time they are improving it’s responsive ai to handle situations outside of what the map can do. They can keep improving that ai, and keep automating the mapping to the point when, theoretically eventually the mapping happens in real-time. Like there’s a bit of a convergence situation. FSD12 does change things? But FSD12 already had a mapping component except instead of ore generated and validated manually it just collected the data as cars drove around. Fsd11 approach and Waymo approach looks to me like they would start to converge eventually. But again, FSD12 decided they needed a change. Crucially though waymos approach works now in the regions they work in, and they can expand.\n\nThe bigger thing in my view, from a convergence stance, is the sensor suite. Tesla is pure vision. Others is a diversity.\n\nNow going back to the actual point, which isn’t about how far ahead they are which I think we can argue about when you talk about Waymo, we really need to talk about is true FSD with its current hardware possible.\n\nVision parking is a simple subset of FSD. It’s just where the car is, and where objects are. No control element. It’s it’s perception of the world around it. This is extremely fundamental. And it is inaccurate. You make no argument as to why , you just deny the concern and say their issue is forward planning. \nThey’ve been saying things like LiDAR and diversity of sensors isn’t needed for many many years, and they aren’t able to accurately map objects in 3D space yet. That’s what vision parking assist shows.\n\nThe big question is “why”. Why isn’t it accurate. Where’s the breakdown. Mapping objects on stereo vision is basically a university level project, it’s not a leading edge engineering problem. Dojng it quickly at 80mph and reacting ect ect is leading edge. So why the inaccuracy?\n\nI really hope it’s not a sensor issue. I’ve been team vision for a very long time. And I still think vision is fine, however I’m concerned 9 cameras isn’t enough. \n\nMusk says vision is fine because humans drive just with vision, that’s the core of the argument. But our eyes move around in 3D space with respect to the car. 9 fixed cameras. Which aren’t capable of doing a “Birds Eye view” … I don’t know. \n\nBut it’s very suspicious to me that they can’t figure out the problem. Again, being such a core complement of the system, to not be able to know where objects are with respect to the car, it doesn’t give confidence. \n\nAgain, Waymo is functioning well in this regard it seems. They don’t show any comparable to vision parking assist, but they are better functions self driving cars, in the areas and roads they are allowed to operate.", "score": 0, "replies": [{"body": "People should be skeptical until Tesla (and others) prove their system. We agree there. My point is while they need lots more polishing, no one else even has anything on Tesla's level *to polish* in terms of overall package abilities *that can be purchased*. Until you can provide one, the rest of the over-worded book you wrote is pointless.\n\nThere will be detriments and lack of ability across all vendors, and parts that overlap, but Tesla's box has the most features (we can include broken ones like summon which has been slowly watered down as FSD takes over, as it works, but not as often or as reliably as it should - but who else has a car driving across parking lots at *any* level I can buy?)\n\nWaymo is fantastic, but until Tesla can drive without a driver, and Waymo can go out without pre-mapping and with *true drives-everywhere* capability as opposed to parts of a few cities, each companies limits are known. Tesla spanks Waymo in terms of availability, scale and area. Waymo spanks Tesla in terms of reliability and lack of safety drivers in most places.", "score": 3, "replies": [{"body": "Like why are you trying to frame things.\n\nSure, Tesla FSD is the most advanced self driving system you can buy. \n\nHow does that have any impact on the conversation here?\n\nThere are systems that are more capable that you can’t buy , and teslas system doesn’t function as a truss self driving car. \n\nI can’t buy a rocket ship, but I can build a bottle rocket. My bottle rocket is the most advanced rocket consumers can buy. Clearly I will be the first person to sell to consumers full functional rockets that can bring people to the moon and people should invest in me. Obviously a stupid comparison but the point is, the framing is “that you can buy” doesn’t really play a role in the viability of the technology. \n\nThe issue is about the technology and if teslas current approach with its CURRENT hardware will ever get there. Something I was always confident about until it’s vision parking assist came out as it showed they don’t have accurate mapping of the real world into 3D space, which is a crucial and fundamental building block of the system.", "score": 2, "replies": [{"body": "I'm not trying to frame anything, and the point of purchasability is key because tech only a few people can use is pointless (but not useless). Your initial comment was that you were skeptical due to their vision park assist, and then *incorrectly* extrapolated that out to how could it possibly work at 50mph on a freeway - alluding to the sense that you somehow haven't seen it do so. These are unrelated things because, empirically speaking, it works fine there, and vision park is still under development as Tesla states. If you want to get into a technical discussion about Waymo and other's (which *do* avoid freeways), thats a different topic. If you want to discuss Tesla's technological approach we can do that as well. \n\nWe can also say that if Waymo and cruise still can't (won't) drive to any areas not first pre-scanned by humans and loaded into the fleet, their current technology isn't ready yet either (and would be just as inaccurate as your extrapolation of the vision park sub-feature). All the pieces are there on both of these competitors, and I see the path for both to remedy their gaps. \n\nWe can close this one agreeing that:\n No car people can buy can match Teslas package (which still needs work). \n\nTesla is not driverless yet, and is not in Waymo's league on that front. \n\nWaymo doesn't have anywhere near Teslas fleet  scale or driving area (ODD). \n\nEach feature should be evaluated on its own in these packages, as one sub-feature's issues don't seem to affect others. It can be hard to tell if the sensor suites or if the use of their data is fault for the issues without access to their systems.", "score": 2, "replies": [{"body": "You are trying to frame it, you keep trying to say what the point is, and restricting things to what you can purchase. It’s irrelevent to the point on it FSD is viable in its current hardware and architecture.\n\nFSD doesn’t work reliably. You’ve already conceded thar, current trackers say at best it’s 48 miles before critical disengagement, that’s so far away from where it needs to be. The question is why? Where in their system are the problems that make it so I reliable.\n\nWell we now know from vision parking assist that it is very unreliable at mapping things to the 3D space. That’s a bit indicator. And another question is why is it bad at mapping things to 3D space.\n\nWe don’t actually have an answer to these things. I’m not sure the engineer at Tesla has the answer to these things.\n\nWaymo functions in the realms it says it functions. Period.\n\nYou can try and reframe that if you want; but they have something functioning fully with constraints on location. Tesla doesn’t have that. Time will tell if Waymo can keep iterating on its mapping tech as well as the live ai engines it uses for unmapped situations.  But while it iterates from that direction it is functioning. This reminds me of theranos , touting their one drop blood testing machines. It’s like great, if it ever worked it would be cheaper and scale out and consumers could buy it. Meanwhile the industry machines can keep iterating at its working machines to be smaller , cheaper, require less blood, and we will see where they end up. Of course we know theranos failed spectacularly. It’s like maybe one day industry machines could iterate until it only needed one drop, and the machine would be cheap. But maybe they will hit a limit. Tesla is in a similar situation with its approach. Claiming from first principles it has everything it needs , and maybe they are right - maybe they will keep hitting limits. In the mean time we now have more complicated and resource intensive solutions that do work and arent now available for consumer purchasing, but they will keep iterating in a functional system while Tesla tries to bring up its minimal approach.\n\nBut again, that vision parking assist shows some glaring problems with the tech. LiDAR is extremely good at dojng what Tesla is trying to do with its vision parking. It’s the reason everyone uses LiDAR, and Tesla painfully has revealed their vision equivalent is actually far from equivalent. \n\nWho knows how far those inaccuracies  steep into their entire control system. How much ai is being applied to predict correct behaviour off of inaccurate sensor data, and how much does that reflect into FSD deep reliability issues. \n\nI don’t know but it’s turned me from a full Tesla FSD evangelist to someone who’s cautious. I in no way think FSD is destined to fail with its current hardware, and I do think they will get FSD eventually , but maybe it will require hardware and camera suite changes.", "score": 2, "replies": [{"body": "Since you don't understand the technology, you don't know what questions to ask, and you conflate things that make no sense. You don't know enough to hold this level of conversation, and keep looking in the wrong direction. You framing the entire system around vision park assist (which Tesla already said is not ready or part of FSD) is you fumbling around trying to understand something clearly out of your league. Thats fine. When its ready and all components go under one stack (FSD and legacy tech), then come back and we shall see how well it works (or doesn't). \n\nAs you learn more and get input, I hope you also learn how to debate with 75% less filler so you don't scream lack of knowledge while overcompensating with more words to feign knowledge. Stick around and learn.", "score": 1, "replies": [{"body": "ROFL.\n\nThe sounds of someone who has nothing to contribute but refuses to “give up” ground, bad faith discussion at its finest.\n\nYou’ve been completely unable to contribute anything  technically to this conversation. It’s really humour you having this response.\n\nTime will play things out, and as I’ve been consistent in saying, hopefully Tesla works things out with their current architecture; I really do hope that as an investor. But time is ticking. \n\nBy the way, here’s where they confirm vision is based on their occupancy network: https://www.tesla.com/en_ca/support/transitioning-tesla-vision\n\nSo tesla vision park assist is a direct window into the occupancy network output which is than fed into labelling, path finding, control ect. It’s sort of the first step. And as I’ve said, and you’ve agreed, it’s not accurate. So everything in their system past that point has to deal with inaccuracy. \n\nOn the contrary to your comments, if you are serious about learning about their architectures, the CVPR keynotes from the various companies are very insightful. You should really watch teslas over the last 3 years as well as waymos.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’d like to see some evidence behind this claim.  Which company has the best adas so I can dive into the details.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Dude there is soooo little information on their ads, and there is no real reviews or intervention trackers. I’m not sure how you can really justify calling it more advanced.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "They haven't updated their autopark in like almost 4 years now. While the latest FSD dropped a few weeks ago.\n\n&#x200B;\n\nI use FSD all the time its great in 50mph traffic, its great at 85mph.  \n\n\nThere are some small uncomfortable things it does, but I'm not afraid of it colliding.", "score": 1, "replies": [{"body": "So you don’t ever disengage ever? That’s far from the norm if so, maybe you’re route is FSD safe.\n\nIt’s seriously impressive don’t get me wrong. But the comparison is to where it needs to be.\n\nBy the way, I’m not talking about auto park. I’m talking about Tesla showing you how far objects are from your car while you are parking. That’s what, 9 months old?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "![gif](giphy|xT5LMMGzehOZ6BUA1y)", "score": 8, "replies": []}, {"body": "*looks at OP's comment history\n*Ignores post", "score": 9, "replies": []}, {"body": "https://en.m.wikipedia.org/wiki/Betteridge%27s_law_of_headlines#:~:text=A%20headline%20with%20a%20question,%2C%20preferably%2C%20a%20national%20panic.", "score": 2, "replies": []}, {"body": "It goes up. It goes down. So both right and wrong.", "score": 1, "replies": []}, {"body": "TSLA is over valued today imo.  20-30X is a more reasonable P/E imo. \n\nTheir net margins  are very similar to other car manufacturers today but they are growing faster so they definitely do deserve a better p/e.", "score": -5, "replies": []}]}
