{"title": "Long TSLA into 2019. Real DD Inside.", "selftext": "&#x200B;\n\nhttps://preview.redd.it/ya7xtscl8j421.png?width=630&format=png&auto=webp&s=5783b6d7ccebc08b2d7d5fbbe64d8a050abfc2f6\n\n&#x200B;\n\n• EPS and NPM is really all over the place - no surprise there.\n\n• Revenue growth is good and consistent though and so are gross profit margins, which are important here.\n\n• 18 Q4 estimates show the analysts have no idea what's going to happen, which is usual for this one\n\n&#x200B;\n\nChart looks good:\n\n&#x200B;\n\nhttps://preview.redd.it/xce9z8n45j421.png?width=1000&format=png&auto=webp&s=8fe8591f8974f3d467e798f78fc78d7b6267ce61\n\nhttps://preview.redd.it/s4qktaa76j421.png?width=997&format=png&auto=webp&s=92af55ae326e6053c025589618a8df5d836d7783\n\n• Breaking out of consolidation channel and bucking the general market pullback.\n\n• Good MRS, weekly volume is bullish for the last month (contrasted with SPY)\n\n• Technical's point to TSLA being a sector and market leader\n\n&#x200B;\n\nDaily chart suggests good entry point for next week is around $360 (whole number):\n\nhttps://preview.redd.it/nw8pgr695j421.png?width=1000&format=png&auto=webp&s=bf943b1ea1abb968550a69394e82d50117d42383", "id": "a6kagg", "created_utc": 1544918513.0, "score": 21, "upvote_ratio": 0.76, "num_comments": 30, "comments": [{"body": "Just to add: I am a reservation holder for a model 3 in Europe. Called support recently and they said there are lots of preorders, but all reservation holders will be invited to configure by end of the month. And everybody who configures by eom can expect delivery by end of Q1 19. So this is another sign that production and delivery are going well and they are about to fully tap into a 500M people market.", "score": 18, "replies": []}, {"body": "I’m long TSLA but I worry about what a recession will do to demand.\n\nEveryone I know who got a Tesla has also made modifications to their home to make the charging more easily accessible.", "score": 19, "replies": [{"body": "Whole world is slowly shifting to electric. Tesla is more or less the first to market. \n\nThey're rapidly building charging infrastructure for long travel across the US. Long term, tesla is in a good spot. ", "score": 9, "replies": []}]}, {"body": "Your revenue estimate is high unless they sell out all of these lots across the country they have been stockpiling in the next 16 days.", "score": 6, "replies": [{"body": "Oh I don't think so at all. That's the median analyst estimate.\n\nYou're right though, I probably should include inventories and production in my diligence.\n\nInventories quarter over quarter have been pretty flat. Unsurprising since Tesla is operating on a backlog. What's more important is production.\n\nTSLA did 6.8b revenue last quarter after a reported 3 million in inventories for Q2 (basically nothing) and 53,300 vehicles produced. Next quarter revenues will be on the same 3 million inventories and 80,000 vehicles.\n\nSo if anything that revenue estimate above is very low. It should be relatively safe to project at least a 30% growth in revenues this quarter.", "score": 7, "replies": [{"body": "They had a higher ASP last quarter and they are down 30% in EU already this quarter. It's your money, but I wouldn't DD on this.", "score": 1, "replies": [{"body": "You found eu market data for more than ,Norway Netherlands and Germany ?", "score": 2, "replies": []}]}]}]}, {"body": "If you want real info on this company check out QTR research podcast on YouTube. No affiliation ", "score": 8, "replies": [{"body": "Lmao", "score": 13, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Delicious S&P 500 inclusion is on it's way.", "score": 2, "replies": []}, {"body": "TSLA has a lot of debt coming due and need their stock price over a certain number\n\nthe strength lately could be someone knows something good or also reminds me of the weird strength in SHOP before the offering last week\n\nalso pretty sure bonds for TSLA are at lows and the bond market is supposed to be smarter", "score": 3, "replies": [{"body": "Their debt is very manageable. Something like 10B on a 60B market cap? No problem.\n\nA bigger, somewhat related, worry might be free cash flow, but like all of their other metrics that was positive last quarter too. 1.4B operating cash on only 550m or so of capex, for a net FCF of almost 1b per quarter. If that keeps on pace they wont have any more cash problems either. ", "score": 5, "replies": [{"body": "Yes they obviously can sell stock to service the debt. He's not saying they're going bankrupt, he's saying this would cause their price to go down. ", "score": 2, "replies": [{"body": "Cash flow positive growth companies typically don't dilute owner equity to gain financing. Why would they? An unsecured note offering convertible to shares is much better for everyone. Similar to what ETSY did earlier this year. ", "score": 6, "replies": [{"body": "Oh great more debt to add to the corporate debt bubble! ", "score": 4, "replies": [{"body": "Debt is how you grow.", "score": 2, "replies": []}]}, {"body": "Except Etsy had cashflow", "score": 1, "replies": [{"body": "So does Tesla since last quarter. Don't have the exact numbers but it's something like 1.4b operating cash on 550m cap ex. That's almost 1b FCF per quarter. ", "score": 2, "replies": [{"body": "That doesn’t really mean anything and it’s clear you don’t understand what you’re reading. Look at accounts payable, Tesla gamed the timing of its financial statements statements to make them look better. They don’t really have the cashflow. \n\nAnd really, it’s not sustainable cashflow. You’re like as this past quarter, but where does it go from here? Will it be sustainable after the initial reservations, I think not. That’s why I don’t recommend an investment in the firm. Not to mention the valuation makes no sense even with your estimates. ", "score": 1, "replies": [{"body": "How about you explain it to me instead of just insisting I don't understand? Why is their latest quarter cash flow figures \"fake\"? Explicitly. ", "score": 2, "replies": [{"body": ">”fake”\n\nNice quotes even though I didn’t say that\n\nI’m honestly tired of explaining how accounting works to Tesla longs. \n\nLiterally pay suppliers a few days after earnings. Statements at earnings then look much better. It’s as simple as that. \n\nEdit: Higher accounts payable translates to more operating cashflow. Along with some deferred revenue from asking for more cash upfront from customers leads to better cash flow. Plus other long-term liabilities are included in operating cashflows when it really shouldn’t. ", "score": 1, "replies": [{"body": ">I’m honestly tired of explaining how accounting works to Tesla longs.\n\nLol, typical. Let me do the work for you since you're \"too tired\" (this took me maybe 90 seconds).\n\nQ/Q payables this year were: 2.6, 3, 3.6 billion. \n\nQ/Q receivables: 0.6, 0.56, 1.15\n\nQ/Q revenue: 3.4, 4, 6.8\n\nYou're talking utter nonsense. Any increase in payables is matched by receivables and is far outpaced by revenue growth. \n\nDon't be another butthurt Tesla bear looking for any reason you can to save your ego. \n\nYou could be right. If anything there might be a stretched valuation here. But it doesn't have anything to do with weakening numbers. Their numbers are certainly strengthening fast.", "score": 1, "replies": []}]}, {"body": "I'd like to hear this too.", "score": 2, "replies": [{"body": "You still live up to your flair", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Tsla next earnings should skyrocket ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Holy shit he's using bar charts instead of candles, DD approved all in $TSLA", "score": 1, "replies": [{"body": "I find candles way too noisy and distracting. ", "score": 2, "replies": []}]}]}
