{"title": "Nasdaq Composite on a tear down… NVDA falling fast too.. ", "selftext": "Is Nasdaq falling today due to profit taking?? \n", "id": "1f1pv47", "created_utc": 1724683226.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 30, "comments": [{"body": "Omg we are down 3 dollars let’s panic and sell all of our shares 🙄🙄🙄🙄🤣", "score": 35, "replies": [{"body": "I never understood this. Why are there a bunch of pots every time a stock drops a tiny little bit. Are people trying to over analyze every single thing that happens? \n\nIsn’t investing supposed to be with money you can afford to lose do situations like this when the stock is going down you aren’t freaking out?", "score": 3, "replies": []}]}, {"body": "First hour the markets are open is amateur hour. It's coming back. Cheel. Nasdaq is fine.", "score": 21, "replies": [{"body": "True. I never pay attention for the first couple of hours", "score": 1, "replies": []}, {"body": "Had good volumes… hence the thinking if something else happened… NVDA techs are currently showing their products in conference right now…", "score": 1, "replies": [{"body": "Usually any movement from any conferences, or anything that is not an earnings or guidance report (besides something catastrophic coming from the news) are negligible.", "score": 1, "replies": []}]}]}, {"body": "They wanna discount before the ER. Retail not invited. Although it’s relative in the grand scheme of things. We have the right to feel frustrated like OP is", "score": 10, "replies": [{"body": "It is frustrating indeed…", "score": 0, "replies": []}]}, {"body": "Taking profits is likely. A lot of stocks were green and by a decent % on Friday. If anything, it is a discount.", "score": 3, "replies": []}, {"body": "This is a normal Monday for NVDA.", "score": 3, "replies": []}, {"body": "People actually check the markets every day?", "score": 3, "replies": []}, {"body": "OMG SELL SELL SELL BEFORE IT'S TOO LATE!!!!!!1", "score": 12, "replies": [{"body": "Bro definitely bought puts💀", "score": 13, "replies": [{"body": "I just think these posts are dumb as hell", "score": 15, "replies": []}]}, {"body": "Going to $50!!", "score": 5, "replies": []}, {"body": "Omg just dropped 20%", "score": 2, "replies": [{"body": "Bring in the sales!", "score": 4, "replies": []}]}]}, {"body": "Excellent, the paper hands are selling their positions 😈more for me!!!", "score": 2, "replies": []}, {"body": "First time?", "score": 2, "replies": []}, {"body": "It's a tiny fall, you weenie.", "score": 4, "replies": []}, {"body": "Buying op.", "score": 1, "replies": []}, {"body": "Get your blue chips and dip", "score": 1, "replies": []}, {"body": "Manipulation....", "score": 1, "replies": []}, {"body": "Another ressesion", "score": 0, "replies": []}]}
{"title": "If you had to invest in PLTR or NVDA today who would it be?", "selftext": "[deleted]", "id": "1f1cgnf", "created_utc": 1724636019.0, "score": 16, "upvote_ratio": 0.7, "num_comments": 34, "comments": [{"body": "This can’t be a serious question. NVDA would be the answer even if asking this question in the PLTR subreddit.", "score": 33, "replies": [{"body": "Shots fired", "score": 10, "replies": []}, {"body": "How is pltr even in this conversation? Like asking would you rather have a camry or lambo", "score": 5, "replies": [{"body": "Camry will last a hell lot longer js", "score": 3, "replies": [{"body": "More predictable and reliable too", "score": 3, "replies": []}]}, {"body": "I'll take the FireFly", "score": 1, "replies": []}]}]}, {"body": "Hmmm, the company selling shovels during the gold rush, or the company using obscure analytics tools to make Airbus’s manufacturing 3% more efficient or whatever?\n\n\nSeriously?", "score": 11, "replies": [{"body": "There is a lot of business willing to pay a lot of money for streamlining their processes", "score": 2, "replies": [{"body": "As cheaply as possible", "score": 2, "replies": []}]}]}, {"body": "Are you…? Are you, serious? Hey guys! Is this guy serious?????", "score": 13, "replies": []}, {"body": "Both. \n\nPLTR is currently at \\~$70b and rapidly growing. \n\nI started my position in NVDA in 2018 when it was a \\~$150b company. I called it a company that had $1T written all over it.  \n\nIf NVDA is the pick and shovel play in AI, then I consider PLTR the map. The path for companies (along side NVDA) to utilise AI software and grow revenues and profitability. \n\nI expect huge growth from both, but in the law of the market a lower cap has more runway.", "score": 9, "replies": [{"body": "Do you see PLTR as a trillion dollar company?", "score": 1, "replies": [{"body": "NVDA price has an upper limit, it can’t grow forever, no matter how bullish you are. It doesn’t need to be a trillion dollar company when PLTR has much more upside growth potential in price.", "score": 4, "replies": []}]}]}, {"body": "Both long", "score": 2, "replies": []}, {"body": "Nvidia most and some in pltr", "score": 2, "replies": []}, {"body": "You should stick with s&p", "score": 2, "replies": []}, {"body": "Safer long-term investment? Nvidia. \n\nWho’s more likely to double their market cap first? Palantir.", "score": 2, "replies": []}, {"body": "Why not both?", "score": 1, "replies": []}, {"body": "NVDa", "score": 1, "replies": []}, {"body": "Both 4 me", "score": 1, "replies": []}, {"body": "NVDA.", "score": 1, "replies": []}, {"body": "NVDA, with eyes closed.", "score": 1, "replies": []}, {"body": "Split 10:1 NVDA: PLTR", "score": 1, "replies": []}, {"body": "Nvda", "score": 1, "replies": []}, {"body": "The comments here tell me that there are a lot of young investors in this sub", "score": 1, "replies": []}, {"body": "NVDA, that’s an easy one", "score": 1, "replies": []}, {"body": "I have both", "score": 1, "replies": []}, {"body": "Can't compare these totally different companies. Palantir is rather new, they have some good partnerships but their software could be replicated way easier than a company could replicate what Nvidia can do. \n\nJust read and compare yourself, don't ask for this type of advice online. You need to have full understanding to do the right actions. Your shortcuts won't work", "score": 1, "replies": []}, {"body": "🤦", "score": 0, "replies": []}, {"body": "NVDA, TSM and SMCI. PLTR is kind of a meme stock, with a P/E and growth rate that simply doesn’t even come close to justifying the stock price.", "score": -1, "replies": [{"body": "PLTR ain’t no meme style stock and we use it in highly secretive government operations. Trust me, it has Reliable programs", "score": 6, "replies": []}, {"body": "why smci, I am just curious.. are you not concerned about the profit margin?", "score": 2, "replies": [{"body": "Yes, still concerned but looking at their forward guidance and their innovation in cooling and energy management for AI data centers, I see great opportunity in  the future. Their recently presentation at the Hot Chips conference tells me that they are poised for another breakout.", "score": 3, "replies": []}]}]}]}
{"title": "Big Boo Boo Move", "selftext": "Hi guys I’ve been trading options for a minute now and with the overall market sentiment I decided to put my risk tolerance to the test and ended up swapping a January AAPL 250 call for a Oct 4th 170 call on AMD. My reasoning is that there is a large demand level at 157 that’s fairly illiquid to the next most recent consolidation level - also has had lots of seller attention so upside should b less priced in (feel free to lol at me). I’m down big but as a seasoned retail monkey I’ve learned that selling when it looks bad often is good in short term until price action rebalances and I played myself. \n\nTLDR: traded solid AAPL contract for spooky AMD close to AMD’s \n high of the day", "id": "1f1pdaz", "created_utc": 1724681983.0, "score": 34, "upvote_ratio": 0.66, "num_comments": 37, "comments": [{"body": "AMD is cursed. Doesn't matter how much you analyse it, or how many days or weeks it bounces off of very particular supports and resistances, the moment you go in it blows past them. Half the time it's inversing NVDA and the other half it's mirroring it and you can never know which is which. All year people are getting into AMD out of FOMO because they think they missed the chance with NVDA and ultimately even now NVDA has been the play all year and AMD isn't. I made some decent trades on it but got burned hard a couple of times so I'm not touching it again. 157 was a strong level earlier in the summer but it regularly blows past it now. \n\nI'll laugh at you for taking a picture of your screen with your phone. Screenshots are a thing you know.", "score": 44, "replies": [{"body": "Hate AMD. Moves like molasses and ignores good setups.", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Yeah. Just impossible to see it until it's gone.", "score": 2, "replies": []}]}]}, {"body": "Man, this echoes my experience with AMD. It’s an unpredictable wild animal. Manages to inverse any move I try to make with it. Gave up and went to NVDA.", "score": 2, "replies": []}, {"body": "AMD is the only company that plays the GPU, CPU, and Enterprise game at once. The Force doesn't work on 3 Axis. They always eat up the Value for money play and that takes time. When AMD out runs Intel CPU's and gets with in 15% of NVDA at 20% product cost, then play that game. Otherwise hold on for the ride.", "score": 2, "replies": []}, {"body": "Dang sadly i have to agree with you I think the only thing I can rely on is the rising tides of its peers and the rest of the market for now - I too have lost quite a few times but out of spite and not wanting to accept paying the premium to whoever sold me this I’m gonna make the dumb decision and hold this mf while I figure out how to re-enter AAPL", "score": 3, "replies": []}, {"body": "This is exactly how I feel with TSLA", "score": 1, "replies": [{"body": "TSLA has been a shit stock for years. As the only publicly traded compay of Musk's, it's affected by much more than just the state of the company itself. It's also never a good idea to regularly trade cult stocks.", "score": 6, "replies": []}, {"body": "TSLA is easy. The trading range is massive so buy over time. Buy between 130 to 170. Dollar cost in stock or 30 Delta Calls out 90 days. Sell at 230-260. Wipe the gold off your turds and repeat.", "score": 0, "replies": [{"body": "lmao wipe the gold off my turds is something that will forever stick with me thank you for that bro", "score": 2, "replies": [{"body": "Cheers", "score": 1, "replies": []}]}]}]}, {"body": "Honestly this is an accurate assessment lol. I stick with shares only on AMD.", "score": 1, "replies": []}]}, {"body": "i feel like i have seen this screen on my computer before.", "score": 25, "replies": [{"body": "Many have seen this. Just a different ticker", "score": 8, "replies": [{"body": "Different subreddit, too.", "score": 3, "replies": [{"body": "Grandma is spreading like a zombie.", "score": 3, "replies": []}]}]}]}, {"body": "AMD is the kind of stock that is better to have shares than options cuz the way it moves never makes sense lol", "score": 10, "replies": [{"body": "💯", "score": 2, "replies": []}]}, {"body": "You lost $170 on a position that closes in October and you think that's a big boo boo?\n\nStick to penny stocks mate, options will crush your soul if you think this is anything.", "score": 15, "replies": [{"body": "I’ve definitely had bigger ones and I’m still playing with chump change relative to others, the level of boo boo was a little exaggerated yes.  However capturing a 5% drop after going long on this already shady stock compared to the strength and recovery of AAPL is where my metric lies - not to mention I threw half my portfolio in here instead of leaving it in a much better place so I’m just going thru the motions of accepting my consequences", "score": 2, "replies": []}]}, {"body": "Flip your screen upside down  and will change that frown upside down 📈", "score": 3, "replies": [{"body": "Corporate mundo?", "score": 1, "replies": []}]}, {"body": "Technical analysis at best is self fulling prophecies and reading tea leaves at worst. Don't bet the ranch on peer TA alone.", "score": 3, "replies": []}, {"body": "My 9/20 160 CCs appreciate this down draft.", "score": 2, "replies": []}, {"body": "Ceo recently bought shares I’m bullish", "score": 2, "replies": []}, {"body": "💎🤗 by force 😂", "score": 2, "replies": []}, {"body": "bro bought them calls at the peak", "score": 1, "replies": []}, {"body": "Hi, exit the position when you get back any one uptick.  It’s always best to understand the particular price action of the underlying before trading any derivatives on it.  AMD could go to 170 and back to where it is now before your expiration, such is the nature of that ticker.  Apple is well-behaved; complete opposites.  What AMD did today was very AMD-like.  There’s also the fact that any weird verbiage around Blackwell updates on Wed. will send AMD to the 130s temporarily.", "score": 1, "replies": []}, {"body": "So it’s not just me that thinks AMD is cursed? I swear everytime I think I have something solid going on with AMD, be damned if the gremlins don’t come out and just chew me ass up in ways I never even considered possible. Now I’ve said this about 19 other times, but I’m done with AMD. Hate the stock gods decided to smack you around but I’m glad to see it’s not just me when it comes to AMD.", "score": 1, "replies": [{"body": "Y’all I forgot to mention and clarify that I’m a Christian so as much as it’s been wavering I’d like to take this as a reminder to myself and y’all to trust in Jesus and not worldly things like volatile doom stocks", "score": 1, "replies": []}]}, {"body": "There’s a reason why they are called Accelerated Money Destroyer (AMD)", "score": 1, "replies": []}, {"body": "I see a 2yr down slope on macd & RSI, LR is already crossed above intercept and LR slope is negative... I would not be buying calls 60 DTE with these indicators showing a downtrend on the weekly. But, I certainly feel your pain.", "score": 1, "replies": []}, {"body": "Only down $100? Yawn", "score": 1, "replies": []}, {"body": "Get the fuck off Robin Hood.", "score": 1, "replies": []}, {"body": "Never heard of put options?", "score": 1, "replies": []}, {"body": "You bought fairly short-dated AMD calls before NVDA earnings. NVDA is *the* most hyped up stock in this century. And AMD is a proxy in this case. So of course the premiums are going to be jacked up on AMD ahead of NVDA ER, and you're subject to IV crush after the NVDA report drops, no matter what happens in the price of any particular underlying asset. Wall Street sets these things. Doesn't help that the AI bubble has already burst (SMCI), either. ", "score": 1, "replies": []}]}
{"title": "Predicting VIX", "selftext": "[deleted]", "id": "1f1zcmm", "created_utc": 1724706548.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 32, "comments": [{"body": "On Webull earlier, I think I could pull up an options menu on the vix. VXX is also tradable on platforms including Robinhood.", "score": 1, "replies": [{"body": "Right, I’m just curious whether anybody more experienced with options than me could draw a rough sketch of a clever strategy revolving around the 70% directional win-rate knowing that VIX will hit X value before Y value. X and Y being equidistant", "score": 1, "replies": [{"body": "If you like to have a clever strategy that gives free money, I doubt you will find here such.\n\nHowever, from a mathematical modelling point of view, you could build, based on empirical stylized facts on volatility, a stochastic model that is supposed to describe the VIX (e.g. stochastic volatility models, local volatility models,  rough models). Based on the choice of model your question becomes either exactly computable or at least via Monte Carlo.\n\nThus, if your model is flexible enough to capture the statistical properties of the VIX, you could trade strategies based on your own choices of risk/reward.", "score": 1, "replies": [{"body": "That's sounds like a very intelligent and nuanced approach. And therefore about as profitable as randomly guessing", "score": 2, "replies": [{"body": "I agree. you asked about computing a probability, the answer depends either on the model, or you compute empirical probabilities.", "score": 1, "replies": []}]}, {"body": "By flexible enough you mean you can overfit the shit out of it 🙃", "score": 2, "replies": [{"body": "Sure why not throw some deep NN on it 😁\nIt's not like some companies try this with other indices...", "score": 1, "replies": []}]}, {"body": "Does the prediction of the direction of VIX offer no edge in options trading? My thought was that I could use the prediction to do volatility-based options plays on SPY.", "score": 1, "replies": [{"body": "That's the point. In efficient markets you will not be able to predict or find patterns. The best you can hope for are statistical properties in which you can trade.", "score": 1, "replies": [{"body": "I think you misunderstood my earlier comment. I have written an algorithm that currently has accomplished directionally accuracy up to 70% on the VIX/VIX futures as well as NQ in live market trading\n\nI’m just wondering what’s possible with options, leveraging what I have so far. I’m unfamiliar with them", "score": 1, "replies": [{"body": "Ok. My bad it was late.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You’d clearly need a VIX barrier option to exploit that optimally but probably not liquidity traded", "score": 1, "replies": [{"body": "Well, I have similar results on NQ if you were thinking of anything specific?", "score": 1, "replies": [{"body": "Sounds like a v strange prediction bro, can give the actual levels", "score": 1, "replies": [{"body": "It’s a profitable futures trading strategy that I currently have running live across multiple assets. I’m just curious whether predictive power in the VIX could be used cleverly to structure trades where you’re profiting off of volatility in SPY.", "score": 1, "replies": [{"body": "If u have predictive power with the VIX, wouldn you just buy VIX futures? And in general, r y talking about the asset eg hitting a barrier above current level of the asset before it hits a barrier below the current level?", "score": 1, "replies": [{"body": "It will hit TP before SL more often than not. I was only referring to it in this manner, because I wasn’t sure if that would be important in a volatility-based options strategy revolving around VIX predictions", "score": 1, "replies": [{"body": "Whereare  the TP and SL levels? Over what time period we talking", "score": 1, "replies": [{"body": "TP/SL levels are set dynamically, but equal in distance away from eachother. The time period of the prediction ranges from days to weeks.", "score": 1, "replies": [{"body": "VIX isn’t gonna adjust its behaviour based on where u set your TP and SL levels", "score": 1, "replies": [{"body": "Right, that’s why they’re set dynamically. It currently is working with futures. I’m just wondering if I can leverage 70% directional accuracy in the VIX with SPY in some sort of volatility options play. I’m not familiar with options myself, which is why I posted", "score": 1, "replies": [{"body": "You’re basically saying the VIX usually goes up before it goes down", "score": 1, "replies": [{"body": "Well, not exactly. And if knowing that alone could print people money, we’d all be billionaires. The good stuff is in knowing that it will hit X profit level before it hits Y stop-loss level that is predefined to be 1:1 equidistant from your entry with 70% accuracy. I just want to know if I can leverage this with options in some sort of volatility play knowing that the VIX will most likely go down/up.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Ive found the pricing is hard to work with. Insane call skew, etc etc. I only bother with short SVXY after a big vol spike, its... ok.\n\n\nAfter vix jumps, everyone knows its gonna come back down, after all. The real cash is in selling upside vix insurance, which 1) needs to be done naked to make any money (call skew) and 2) is insanely risky to sell naked. \n\n\nIve not found it worth it. Maybe vix futures?", "score": 1, "replies": [{"body": "I could trade VIX futures, but I already have this algo-trading NQ. I was thinking I could use it to predict volatility in SPY and create a clever options strategy that way. Thoughts?", "score": 1, "replies": []}]}, {"body": "Seems like the trading instrument is going to be a 1:1 R/R vertical spread in VIX\n\nMy guess is that you won’t actually be able to achieve 70% win rate on these though, because predicting direction in VIX is pretty easy. Predicting direction on forward VIX is hard.", "score": 1, "replies": [{"body": "I have similar results on VIX futures if that’s what you’re referring to. I was more so thinking about creating a clever options trading strategy on SPY knowing that VIX will increase/decrease with 70% accuracy in the short-term (i.e. over 3-4 days)", "score": 1, "replies": [{"body": "Cool. Best of luck.", "score": 2, "replies": []}, {"body": "It is really hard as even during the day IV crush happens, you need to time it properly. \n\nYou see how market behaved between 11 AM PST and 12 PST today\n\n[https://imgur.com/WHdu0s3](https://imgur.com/WHdu0s3)", "score": 1, "replies": [{"body": "Makes me think I could just program an algo to watch for IV crush & to buy a strangle whenever it happens. \n\nThis is clearly too simple to actually work in live markets, I’d just like to know why it wouldn’t work", "score": 1, "replies": [{"body": "Unless you have such edge, it is hard to time it. Good luck!", "score": -1, "replies": []}]}]}]}]}, {"body": "Buy a vix fly", "score": 1, "replies": []}]}
{"title": "Apple Call $235 Opinions?", "selftext": "Apple Call $235 Exp 10/18 Your opinion\n\nHello I am still very new to option trading but have been watching a lot of videos and decided to put forward a small amount of money to option trade. \n\nI know a lot of people are going to mention paper trading but I learn best with real world situation with real risk. \n\nAnyway I I bought 2 call options at an average price of $4.38 exp 10/18. Right before market closed I am currently up $95 but after market Apple dropped, I am assuming due to the new CFO coming on January. \n\nWhat do you think about the investment, what would you have done differently. I also learn best when I am able to get more informed opinions so that is why I am here asking. Look forward to your responses.\n\n", "id": "1f21f3y", "created_utc": 1724711926.0, "score": 61, "upvote_ratio": 0.82, "num_comments": 37, "comments": [{"body": "It in fact does not go up when the new iPhone drops", "score": 56, "replies": [{"body": "Good to know, I’ll keep that in mind. Thank you.", "score": 4, "replies": [{"body": "Yeah, it always goes down 1-2 dollars on the day of apple event, no matter what the news are.", "score": 6, "replies": []}]}]}, {"body": "Apple ALWAYS dips during/after a key note and ALWAYS climbs after a split. It is by far my favorite stock to wheel. I used to buy calls, now I just sell puts.", "score": 18, "replies": [{"body": "Why sell puts if it does drop during keynotes", "score": 3, "replies": [{"body": "They’re cash secured and I’m long. I pick a bottom and if I’m wrong I get a sweet discount", "score": 13, "replies": []}]}]}, {"body": "Wait it out! Potential catalyst coming I. September with new product lines! You have until October anyways. Remember if it’s worth screenshotting then you should probably sell!", "score": 14, "replies": [{"body": "Lol🤣 that was a good one op needs to sell for that $95 profit and call it quits", "score": 7, "replies": []}, {"body": "Yeah, I had a lot of people that told me if I expect a stock to go up a certain month/day buy a call a month after so time decay doesn’t kill you. I appreciate you comment, thank you.", "score": 7, "replies": [{"body": "I’m pretty sure the guy you’re replying to is messing with you. Let me be realistic with you. \n\nWhat makes you think AAPL is going to add ~175B to its market cap in the within next 50 days? Have you thought about an exit plan if your trade goes up/down?", "score": 1, "replies": []}]}]}, {"body": "Everyone has covered all the essential points such as unemployment, ath pricing, apple stock behaviour on run up to important events, etc\n\nI would like to add two more points.\nThe thetha on your contract is currently at 0.078. This means your contracts effectively will lose about 8 bucks in value every day, including the weekend, due to thetha burn. So you need relatively significant upward moves to offset this thetha burn.\n\nSometimes, we tend to get distracted by the p/l. In your case, the p/l shows that you're up 95 bucks on your investment, which is true. However, it's not necessarily the entire story. \n\nLet's assume that the screenshot was taken two days later and that the p/l shows that your up 95 on your investment. However, if you were to consider thetha burn for 2 days(2x8), your actual contracts at entry were now worth about usd 16x2 contracts = 32, less due to the thetha being burned, which means that the  options price had actually moved 95+32 =127 from the new market value.\n\nThe reason I mentioned the above is that we have a tendency to anchor our price to whatever we paid for. However, if we dont compensate for thetha burn in our pricing, then if appl were to drop back to its original price it was when you bought the contracts, we would jaut end upnbeing surprised by the new market value of our contracts. That's why it's good to keep track of the thetha value.\n\nThe 2nd issue you might want to watch out for is nvdas ER on the 28th.. for all intents and purpose the market is currently trading purely on the optimism and pessimism of nvda. So if nvda tanks, it could likely take the market with it. Would suggest caution holding through nvda er.", "score": 8, "replies": []}, {"body": "Money printer go brrrrrr.", "score": 5, "replies": [{"body": "but the money shredder go GUH", "score": 2, "replies": []}]}, {"body": "Good time to sell those.", "score": 3, "replies": []}, {"body": "Your money man, your opinion. You listen to someone else and they are wrong and you miss out on a 400% return you'll be pissed. Make your own trades and you get all the credit or blame.", "score": 3, "replies": []}, {"body": "I don’t think you made an investment!!!  I think you made a derivatives bet that Apple will go up 6% OR MORE before 10/18 any big move with you or against you will have major impacts… good luck 🍀 and enjoy the ride you should be looking for an exit plan which it seems you forgot with your option trading… you should have targets or expectations if it doesn’t go fast 💨 it will melt away but you have time on your side so maybe 🤔 Apple will have something new for a change!!!", "score": 6, "replies": [{"body": "I appreciate your insight. Is there a website or video you would recommend that could help me with an exit plan. I don’t expect it to tell me when to sell or anything just the basics of what I should look for.", "score": 2, "replies": [{"body": "You can’t just watch a video a get it but good luck.. 🍀 Looks for a good up movement 2-3%+ in a day should be a nice pop and then dump it… unless you really believe in Apple and want to see where it is in 40 days I would say your gonna melt away about $10 per day per contract from theta decay so the longer you hold the less it will be worth with out a decent move… picture you are holding a firecracker and it can blow up or down!!!", "score": 3, "replies": [{"body": "I see, thank you.", "score": 2, "replies": []}]}]}]}, {"body": "It's a leveraged bet on AAPL. What more is there to say about it, really?\n\nDon't let theta kill your vibe, roll it before it rolls you. Fingers crossed apple goes up in the mean time.", "score": 2, "replies": []}, {"body": "I think you'll probably lose it all to theta but you might get lucky and only lose half of it", "score": 2, "replies": []}, {"body": "Idk about this one.", "score": 2, "replies": []}, {"body": "I trade options all the time are you use the right date of October 18 but I would’ve done the 230 call they cost $7.20 but your Delta is 48 and your data is nine cents a day even though the ones you bought are cheaper they have a less chance of success just my opinion", "score": 2, "replies": [{"body": "Theta not data", "score": 2, "replies": []}]}, {"body": "I’d recommend selling after September 9", "score": 3, "replies": [{"body": "before Sep,9. Apple always sells on news of new product lauches. They might try to pump till 9/9 depending on how rest of the market is behaving. At this point the risk to the downside is far higher than upside IMO.", "score": 10, "replies": []}, {"body": "That’s the plan! Thank you!!", "score": 1, "replies": []}]}, {"body": "If the unemployment report comes in bad on September 6 the market will most likely tank and it will confirm a recession, and I would say there is a 95% chance that unemployment has climbed again. Buying calls when the FED is about to cut rates when Apple is only a few bucks away from all time highs is more likely to be a loser than a winner imo. The time to buy calls was during the dip, now is a better time to buy puts that expire on 10/18.", "score": 3, "replies": [{"body": "Ah, thank you for letting me know. I will be sure to stay updated on the unemployment rate news and will do some further research on the risks.", "score": 2, "replies": [{"body": "Yea if it comes in bad the market will drop quickly and your calls will be worthless pretty fast. I don’t think this september is a good time to be long stocks. You only spent like 800 bucks though, so maybe a good learning experience if you want to ride those calls.", "score": 2, "replies": []}]}]}, {"body": "good luck buddy...", "score": 1, "replies": []}, {"body": "Apple a PUT", "score": 1, "replies": []}, {"body": "Got the same sep 20", "score": 1, "replies": []}, {"body": "You’re doing directional bet with your trade, which is reflected in your delta of 0.4. Your breakeven price is $239.40, meaning that stock has to rise 6% to $239.40 before you start making money.\n\nInstead of buying $235 call have you considered selling $230 puts (currently priced at $7.70, also expiring in October)? Your breakeven price would be $222.30 ($230 - $7.70) meaning that the stock can drop all the way up to $222.30 before you start loosing money. If the stock will rises above $230 it will expire worthless and you will keep the whole option premium of $7.70 with you.\n\nThis might be a better strategy since you will generate income as long as the price of AAPL is higher than $222.30, instead of generating income only if the price of AAPL increase to $239.40 when buying calls. Also, for your long $235 calls position to be as profitable as being short puts, AAPL would have to rise to roughly to $247.1 ($239.40 break even price plus $7.70 premiums generated from selling puts) before it will be more profitable then selling $230 puts.\n\nAt the end, the strategy you choose will depend upon the level of your conviction regarding the price of AAPL by 18 Oct 2024: if you believe the price will really increase to let’s say $250, then long call is better strategy for you. However, if you think that AAPL will somewhat move upwards and want to have downwards protection (up to $222.30) if it moves otherwise then selling puts might be better strategy for you. In both cases you’re making a bet that AAPL price will increase significantly, which is a speculative bet.\n\nHowever, caution here: selling puts can be very risky and can lead to uncapped losses if underlying will decrease in price, leading to potential margin call from your broker and forced closure of your positional. In that sense, buying calls is less risky since the maximum you can loose is premium paid for options ($970 = $4.85 x 2 x 100). That is why if you’re not comfortable with underlying (AAPL stock) being assigned to you at strike price of a put ($230) you are better not to use this strategy.", "score": 1, "replies": []}, {"body": "Buy the rumor sell the news", "score": 1, "replies": []}, {"body": "Apple is considered to an expensive stock right now as it's risen quite alot since the June WWDC announcements and the market is rotating away from tech in the current market climate. The iPhone 16 and A.I. features will need to outperform to boost the stock further but in reality it'll likely just begin shipping around the beginning of October and the A.I. features won't be ready for prime time till after it ships.", "score": 1, "replies": []}, {"body": "Real vendor , just message me for my link", "score": -1, "replies": []}]}
{"title": "Meta's Metaverse Bet: Visionary or Risky?", "selftext": "[removed]", "id": "1f1r9de", "created_utc": 1724686721.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 4 days ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 week | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Let me guess, this entire thing was written by chatgpt", "score": 27, "replies": []}, {"body": "There’s a market, they just need to get better at advertising and make the headsets less intrusive. Wearables need to be minimalistic", "score": 9, "replies": [{"body": "Correct. It’s just needs better salesmanship", "score": 0, "replies": []}, {"body": "This 100% - that weird second life stuff scared shareholders straight. I bet Zuckerberg considered ragequitting when Apple announced AVP, because they present the same thing but in a way people can relate to. \nDevices will get small enough to be worn on a daily basis. Metaverse is the new internet, a layer on top of the real world seen through glasses. There are _trillions_ in gatekeeping that infinite, hyper-personalized ad space. blue ocean days of the early internet all over again.", "score": 0, "replies": []}]}, {"body": "This is a joke, right?\n\nThe metaverse is the dumbest thing I've heard of in a long, long time, and I was a VR early adopter and have continued to keep my HMDs up to date. The metaverse is not going anywhere, it's a black hole that Zuck dumps money into. Nobody actually wants it, because it's not *Ready Player One, i*t's a shitty zoom meeting with uncomfortable headgear.", "score": 11, "replies": [{"body": "When I see takes like this, I'm always reminded by those opinions people used to have like the infamous NYT articld \"man won't fly for a million years\" when some visionaries thought we could fly.\n\nI mean how unimaginative can you be. Zuck made a mistake ever releasing any early footage or releasing any early version of the horizon worlds, because it fed these types of ideas he is developing just some 3d zoom platform or a bad wii-style videogame. Zuck said he won't expect any meaningful monetization from metaverse until 2030s. Do you know what can happen in 10 years, especially with AI?", "score": 0, "replies": [{"body": "Future AI can help with generating the assets required for a Metaverse (environments, props, avatars, etc) but there are some extraordinarily hard physics problems to solve. For example, the behavior of light, properties of human vision, etc, limit the degree to which headsets can be miniaturized. I’ll never say never, but even ten years isn’t much time for solving that kind of problem. Compare 2014 iPhones to 2024 iPhones— yeah they’re a bit smaller and the screen resolution is better, but they haven’t undergone a fundamental, radical transformation like HMDs would need for mainstream acceptance. \n\nMetaverse isn’t likely to be a thing, at least not in the commonly imagined form, for quite some time (if ever). ", "score": 1, "replies": [{"body": "We'll see. I'd imagine theres some pretty good vision Zuck has when he's pouring billions to the metaverse while he says he doesn't expect any revenue until 2030s.", "score": 0, "replies": []}]}, {"body": "To clarify, I'm not saying what Meta has done is bad. I'm saying *the entire idea of the metaverse is dumb and only works if you don't think too hard about it*.\n\nThere's no way to say this nicely, but the only people I've ever seen think this was a good idea had no idea how any of this works and just kinda thought technology was magic. So if they picked a point far enough in the future they could write whatever they want on it and say that was going to be possible then. Sorry, it just doesn't work like that.\n\nWe *do* know with a great deal of certainty how hardware is going to advance over these timescales. It's called Moore's Law, and it's held true since the dawn of the transistor. Nice straight line on the semi-log plot, you can practically set your watch to it.\n\nAs far as \"AI\" goes...yeah, I'll try to be nice here. You look silly when you say things like \"well because AI exists we'll have <thing> in the future.\" I am a software engineer, who works with state of the art \"AI\" every day. It's not what you think it is. It's best if you think of it as spicy autocomplete. It's a handy tool when used correctly, not magic technology accelerant that's going to make your fantasies come true. Unless your fantasy is something like \"has an AI home assistant\", because those are definitely going to be a thing if you want one.\n\nThis isn't the NYT telling the Wright brothers flight is impossible. This is the Wright brothers telling some rando that we're not getting jumbo jets next tuesday.", "score": -1, "replies": [{"body": "We'll see. I don't believe in Moore's law as a law or AI being just a handy sidekick to coders.", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": []}, {"body": "Wtf is this ChatGPT written BS.", "score": 2, "replies": []}, {"body": "META is an advertising business. The VR bullshit is not even 5% of their revenue.", "score": 2, "replies": []}, {"body": "As a META shareholder, I want this to end soon. Either fails and Capex stops, or even better the sht prints money", "score": 1, "replies": []}, {"body": "the day zuck will say... welp enough is enough, i dont need no vr legs, we're shutting it down. \n\nWill be a glorious one for the stock.", "score": 1, "replies": []}, {"body": "Meta´s core business is strong and growing. It is actively seeking ways to find new revenue avenues, which is a hit and miss business. Their path however looks promising, since it is the logical result of how technology develops currently. It´s investing heavily, but it is investing cash on hand. Sure, some investors would prefer a higher dividend here and there, but long term this investment is going to put meta ahead of any possible competitors. The metaverse currently is not suffering from lack of customer interest in my opinion. It´s lacking the technology and the supply of value while having a high entry cost. All of these are growing opportunities.", "score": 1, "replies": []}, {"body": "Meta will moon regardless,  so who cares whether the metaverse works or not?", "score": 1, "replies": []}, {"body": "2022 called", "score": 1, "replies": []}, {"body": "Probably visionary. He’s got Kauai now, so. How depressing.", "score": 1, "replies": []}, {"body": "Just because meta was the \"first\" doesn't mean they'll dominate the space and reap the profits.\n\n\nMySpace being displaced by Facebook being a very topical example.", "score": 1, "replies": []}, {"body": "Meta has been subsidizing VR adoption by losing money on most Quest headsets.\n\nThis has been a boon for VR gaming (I love my Quest 3). The problem is that Meta's vision depends on adoption for VR in social spaces and the workplace, but gaming is the only application that has caught on.\n\nPeople are willing to wear an ungainly headset for immersive gaming, but not to attend meetings or socialize (except a the weirdos in VRChat). No company is going to mandate VR meetings as long as 20% of people suffer nausea from extended VR usage.\n\nMost of those who are betting on Meta are doing so *despite* Zuck's VR fever dreams, not because of them.", "score": 1, "replies": [{"body": "Anybody that's spent any decent amount of time in a good VR headset knows that the Metaverse will be a real thing, and it will dominate entertainment as we know it. \n\nHowever, that future could literally be more than 20 years away from now. \n\nThat's the BIG disconnect.\n\n20 years is a LONG friggin time breh.", "score": 1, "replies": [{"body": "I think you may be projecting your own anti-social tendencies on everyone else. VR will continue to gain ground in gaming and video, but it will probably not grow to dominate our social lives.\n\nVR is purely visual, and it will never match actual reality where you can actually hang out with friends, play golf, drink beers, go hiking, throw axes, or whatever. There are great video games, and people spend more time gaming than ever, but they still like to hang out irl.\n\nYou should really watch Dan Olson's video on Decentraland and the Metaverse. Even if VR does somehow dominate entertainment, Meta's plans don't make sense unless work, shopping, and social media *all* move to the metaverse. VR is very compelling for gaming, it adds far less to work meetings, aside from specialized training scenarios or specific applications like remote real-estate walk-throughs.", "score": -1, "replies": [{"body": "Huh?\n\nI'm just saying that the Metaverse will dominate entertainment. I didn't say that humans will no longer interact with each other in real, physical life.\n\ntalk about projecting breh. Read what I wrote again and explain to me where I said that people won't meet up in real life anymore to play Tennis or Golf?", "score": 1, "replies": []}]}]}, {"body": "not only nausea\n\n  \nyou literally feel detatched from the fabric of life after you wear them for hours... it's uncomfortable and trippy \n\n  \nI don't see a future where VR or AR is widely used, because on top of how insanely inconvenient and uncomfortable they are, we seem to like more the idea of \"mechanical\" tools than the idea of using \"our bodies\" alone... from sports, to computers (people love mechanical keyboards), to cars, to watches... I think our brain just enjoys that feedback we get over simply using motions", "score": 0, "replies": []}]}, {"body": "Visionary", "score": 0, "replies": []}, {"body": "There is a philosophic failure in the metaverse, which is to that physical reality must always be more valuable. If you continue to value this digital realm as more than the physical realm, a certain inevitability comes up in that servers cannot exist in the metaverse. So therefore computers & components will always be, even speculatively, more valued. This is partially why their underlying business failed when they pushed into that domain, and why they are beginning to eliminate their products in that realm, in favor of pumping up with purchasing Nvidia chips.\n\nPart of Nvidia's dramatic rise can also be attributed to this failure on Meta's part, because you can value the metaverse, but everybody knows that in order for it to come to fruition, you need the computing. Also, without the computing, the metaverse fails. It's a contradiction.", "score": -5, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}]}
{"title": "Serve Robotics - Options", "selftext": "SERV - Serve Robotics recently received investment from NVIDIA. NVDA did not provide much insight as to their investment strategy here. Do you think when Nvidia reports earnings they might provide the strategy behind their investment? I am bullish on this stock as Nvidia has a lot of growth room in the edge compute space and Serve is a great company to test out their new hardware. \n\nhttps://finance.yahoo.com/news/serve-robotics-stock-soars-171-013154793.html", "id": "1f1xhxp", "created_utc": 1724701839.0, "score": 18, "upvote_ratio": 0.75, "num_comments": 39, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 29 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "SERV is nearing the price where NVDA invested a 10% stake: 8$ \n\nSERV has appeared on the REG SHO for over a month which is a complicated and bullshit list, but what it really means is this is an EXTREMELY shorted stock, and people are failing to deliver on their shorts from the NVDA news.\n\nRobotics is the logical next step from AI. And with stock prices, you are literally following the money, trying to get in one step ahead. What I see, is a stock where sellers and shorters are still in control but are trying to get out\n\nWhere do you think all this money made off of NVDA/AI  is going to be spent (after the yachts, dancers, and blow)\n\nNVDA has alreayd told us: robotics and (AI specific) SaaS\n\nCalls were on sale today. if NVDA pumps, I could see it back to 14$. I added more calls to my spread today and like 500 shares", "score": 11, "replies": [{"body": "I read about the REG SHO.  One of the issues is that this can point to a stock that is being manipulated.  In short, it means that parties are failing to deliver shares and can point to naked short selling.  Is your thesis that the stock is being purposely depressed and then a big bounce back?   The naked short selling would explain the massive drop over the last month.", "score": 6, "replies": [{"body": "my thesis is this was overly shorted before the NVDA investment news which caused a small squeeze from 2 to 8$ blowing up some short sellers accounts. Then on TOP of that retail piled in and drove the price to $20. \n\nA month later what we're left is, is SERV with a whopping 25% short interest float, which is abnormally high - meaning for every 4 shares, ONE is a borrowed short share.\n\nOntop of that, the regsho appearance means that people are failing to deliver on their shorts. When this happens, brokers are required to force these positions to close, but shorts can roll these over, extend their time, or only cover a rolling bare minimum, and borrow more to hold their positions. Also short sellers use the shares they hold to sell all at once in high volume spikes to dump the price down, so they can get out of their shorts at a better price.\n\nI think... regsho is confusing, and yes, it does point to the stock being manipulated.", "score": 3, "replies": []}]}, {"body": "I bought the $10.50 call for 60 cents. I am new into this so this will be one my first. What did you buy?\n\nhttps://preview.redd.it/3awjogm0y2ld1.png?width=708&format=png&auto=webp&s=9a8d9639077586b3f160a34e0539836a8be5c1ca", "score": 3, "replies": [{"body": "\n\n$11.5 6 Sep for .25c\n\ni also have\n\n$12 / 13  20 Sep", "score": 2, "replies": []}, {"body": "It's 60 cent times 100", "score": 2, "replies": [{"body": "Sorry thats what I meant. 😅", "score": 1, "replies": []}]}]}, {"body": "What calls are you holding?", "score": 1, "replies": []}]}, {"body": "They are  and have been on my watch list.. except I’m new and don’t know what I’m watching for.. so my advice is buy", "score": 5, "replies": [{"body": "So if Nvidia went in at $8 a share, I assume these guys are expecting a serious return. With all the priorities Nvidia has, it would be a waste of time otherwise.  \n\nI wouldn’t focus on the delivery robots for restaurants only. Think anywhere where you need a reliable robot to get things from A to B reliably.", "score": 4, "replies": []}]}, {"body": "Why has it dumped over 50% in the last month?   Are you assuming the bleeding is over?", "score": 3, "replies": [{"body": "Good question. I feel like the NVDA position caused a pump in price but now its hovering around the $8 price that NVDA went in for so I think a company that powerful knows something to give them a return that is higher than the current $9.6 its valued at today. We just don’t know what that is.", "score": 0, "replies": [{"body": "Maybe we will learn something Wednesday", "score": 1, "replies": []}]}]}, {"body": "Have you looked at the actual company? Because..", "score": 4, "replies": [{"body": "Yeah, I mean seems legit. Checked their LinkedIn and they have a solid team. Seems like their current product line is just one way they can apply the IP they have now.", "score": 1, "replies": [{"body": "Additionally if you compare them to RR another robotics player which technically shows better financials at 1/4 the valuation, you will find that at least Serve has in house engineering. If you look at Richtech you will notice that they have no real robotics engineers listed on LinkedIn.", "score": 1, "replies": [{"body": "Ok. Just looking at the product, though?", "score": 1, "replies": [{"body": "Yeah saw the delivery bot in person before. Frankly its alright, I like that you don't have to tip for a delivery and most delivery drivers will leave it infront of the building anyway so not too different than when a delivery driver delivers it.", "score": 2, "replies": [{"body": "Yes. But. Coverage and…?", "score": -1, "replies": [{"body": "wdym?", "score": 3, "replies": [{"body": "How many bots, how that can be … dissuaded. Just. It’s not there yet, to my mind. But I certainly trust Jensen, so imagine there is something there. Simply amazing betting on other horses, myself.", "score": -1, "replies": [{"body": "one of the first companies deploying robots to replace workers, in multiple cities, partnered with uber, 10% stake from NVDA. Genuinely curious whats not to like? your comments come off as quite hesistant", "score": 1, "replies": [{"body": "I am quite hesitant. There are lots of robots doing lots of useful things. And while I’d like to trust Uber’s judgment (as they’ve fingers in a favored pie,) I think they and Nvidia have flung far.", "score": 1, "replies": [{"body": "\"flung far\" is certainly a legitimate financial term and a credible economic indicator", "score": 2, "replies": [{"body": "Ok. I mean. If you want to talk financial statements…eek.", "score": 1, "replies": [{"body": "do you have any actual financial statistics you can point to or just emotional expressions? I feel like im wasting my breath here", "score": 3, "replies": [{"body": "Emotional? Ha!\n\nCheck the financials. I mean.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "What are your thoughts here? Anyone looking at this business too?", "score": 1, "replies": [{"body": "Haven’t really thought about that, seems like a good plan especially since we know nvidia should be having some big plans coming during this earnings call", "score": 3, "replies": []}, {"body": "I’m not convinced of their revenues and they had to get a $15m private placement at $6/share after their last earnings call. \n\nAt the same time, Nvidia must see something in them the numbers I’m spewing don’t reflect so there are probably some pleasant surprises for shareholders and (future) customers that aren’t public. \n\nI think this may be the case for all of the small companies Nvidia invested in this year and people need to have a longer term view when parking their money in them.", "score": 2, "replies": [{"body": "Where can you see what small companies NVDA invested in? Any ideas on how to hear of it promptly. Going to try a portfolio of them all. Throw a few thousand on it and see what happens.", "score": 2, "replies": [{"body": "https://d18rn0p25nwr6d.cloudfront.net/CIK-0001045810/ae9faa71-00e7-4e6d-9cb0-66157923337d.pdf\n\nSOUN SERV ARM RXRX NNOX\n\nThere was another autonomous delivery company I can’t remember the name of that they quietly bailed from bc the company attempted to send chips to China. \n\nI like the concept of RXRX but you can see how there needs to be a long term perspective when investing in something like that.\n\nEdit: sign up to their mailing list for SEC filings to get the most recent reports. This is the quickest way to find out what they’re doing AFAIK though this sub is pretty efficient to pump them in the daily thread.", "score": 3, "replies": [{"body": "Thanks a lot 🍻", "score": 1, "replies": [{"body": "Np - I updated my comment on getting current investment info.", "score": 2, "replies": [{"body": "You’re a 💎! I see it was literally their latest filing. Let’s see going to bet on some of these 4-6 months out and see how I do.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Won't mention it directly but a certain sympathy play penny stock for SERV has had some weird price action, dumped to 30c last week for no discernible reason (I suspect manipulated by someone with foresight) now is pushing hard towards $2 and if anything seems like a more sound play than SERV.", "score": 0, "replies": [{"body": "msg me the name if you would", "score": 1, "replies": []}, {"body": "Name please", "score": 1, "replies": []}]}]}
