{"title": "Stock Market Thread for the trading week beginning September 10th, 2018", "selftext": "Hello traders of the r/stocks sub!\n\nHere is everything you need to know to get you ready for the trading week of September 10th - 14th, 2018.\n\n# **WEEK AHEAD: Tech in trade crosshairs after its worst week since March** - *[(Source)](https://www.cnbc.com/2018/09/07/tech-in-cross-hairs-after-its-worst-week-since-march.html)*\n\n* Trade issues and inflation data are the big events for markets in the week ahead, as investors await President Trump's next move on tariffs on China.\n* Technology stocks had their worst week since March amid a variety of issues, and some key companies, like Apple and Intel, are warning the government that proposed tariffs will hurt their businesses and consumers.\n* CPI inflation data Thursday and PPI Wednesday could be a big focus after a surprise jump in wages in August.\n\n*****\n\n> Technology stocks had their worst week since March, and they could remain in the crosshairs, particularly if the Trump administration unveils new tariffs on China.\n*****\n> Strategists say inflation and trade are two major themes markets will have to navigate in the week ahead, after August's surprise jump in wage growth and as investors await the next move from Washington on the trade front.\n*****\n> At any time, President Donald Trump could announce tariffs on $200 billion in Chinese goods, and he threatened Friday that he has plans for tariffs on another $267 billion ready to go. A late Friday afternoon news report that Apple warned the government that many of its products would be affected by tariffs hit that stock and sent ripples across the tech sector.\n*****\n> The market Friday was already weak as investors considered the prospect of higher inflation. Average hourly wages, up nearly 2.9 percent, put markets on notice that more normal income growth — and therefore inflation — could be at hand.\n*****\n> Consistently higher inflation could help reinforce the Fed's rate-hiking plans, and markets will be particularly alert to both producer and consumer inflation reports in the week ahead. \"I think it kind of reminds the markets that we could very quickly get back to February in a hurry, in the sense we've had this calm period here where inflation was dormant,\" said James Paulsen, chief investment strategist at Leuthold Group.\n*****\n> The Apple report came at the end of a bad week for technology, with the S&P sector down nearly 3 percent. First, there was the specter of more regulation for social media stocks and Google, as Facebook and Twitter executives testified before Congress Wednesday. On Thursday, chip stocks were hit by signs of a slowdown in orders, which some analysts blamed in part on trade. The chip selloff also raised concerns for the sector as a whole, since chip weakness is sometimes seen as an early warning for computer makers and others.\n*****\n> \"To me, it's the piling on of information coming out of the technology sector,\" said Paulsen. \"It's something that everyone owns. It's been leading the stock market for the last three years and it's going to make you [wonder] through the weekend [whether] that's ending…People did think Apple was immune from this.\"\n*****\n> Apple, in a letter to the government, said the tariffs could result in higher prices for consumers and slower U.S. growth. It said products from the Apple Watch to MacMini would be affected by the proposed tariffs on $200 billion in Chinese goods. But there could also be positives for Apple in the week ahead, since it is unveiling new iPhone models and other products Wednesday.\n*****\n> Other tech companies also warned the U.S. Trade Representative that the tariffs would have negative consequences, in reports after Friday's close. Agilent said the duties would financially impede its U.S. operations and end customers in the U.S. Intel said they would hurt advancements in telecommunications infrastructure, including next generation technologies, like 5G. Dell said tariffs, including on computer parts and switches, could do \"serious damage\" to the company and its employees.\n*****\n> *[(Click Here to read the full article!)](https://www.cnbc.com/2018/09/07/tech-in-cross-hairs-after-its-worst-week-since-march.html)*\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P HEAT MAP FOR THE PAST WEEK!](https://i.imgur.com/eRRnSQr.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/x1bGqqj.png)**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR INDICES AS OF FRIDAY!](https://i.imgur.com/DB0p6To.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/CR8TdHB.jpg))**\n\n# **Sector Performance WTD, MTD, YTD:**\n###### **([CLICK HERE FOR FRIDAY'S PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_t.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE WEEK-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_w.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE MONTH-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_m.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 3-MONTH PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_q.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE YEAR-TO-DATE PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_ytd.png&rev=636115211971930604))**\n###### **([CLICK HERE FOR THE 52-WEEK PERFORMANCE!](http://elite.finviz.com/grp_image.ashx?bar_sector_y.png&rev=636115211971930604))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ABI1GIo.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/W0SlY9u.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/7qMAHam.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RleoHRb.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8wmvz0o.png))**\n\n# **Here are the upcoming IPO's for this month:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/dmdrdrK.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR CHART #1!](https://i.imgur.com/4wYtxVL.png))**\n###### **([CLICK HERE FOR CHART #2!](https://i.imgur.com/ximrIM6.png))**\n\n*****\n\n# Typical September Trading: Another Historically Challenging Month\n\n> Although August is the worst month of the year for the market since 1987 (recent 31-year period), September is the worst month going back to 1950 for DJIA and S&P 500. It is also the worst month for NASDAQ since 1971 and the worst for Russell 1000 and 2000 since 1979. Looking at the full month of September one day at a time, just before mid-month has offered the bulls the best opportunity with the chart exhibiting strength from around the close of the sixth trading day to the close of the thirteenth trading day. The tenth and twelfth trading days briefly interrupt the trend. After this stretch, the final third of the month is generally weak with all five indexes quickly surrendering earlier month gains.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://78.media.tumblr.com/9abbfdffac1e53a1ecb60331acd61708/tumblr_inline_pejtweLiBe1spdppr_500.jpg))**\n\n*****\n\n# Why the S&P 500 Monthly Win Streak Could Have Bulls Smiling\n\n> After gaining 19.4% last year, the S&P 500 is once again surging in 2018—up nearly 8.0%, with the Nasdaq 14.8% and Russell 2000 11.7% up even more as of 09/06/18. Could there be even more gains in store over the coming year? We think so.\n\n> With a 14-year high in manufacturing, consumer spending at its best pace in four years, contained inflation, and 20% earnings expected in 2018 and another 10% next year, the economy continues to be in very solid shape. Not to mention the S&P 500 recently broke out to new all-time highs for the first time in nearly seven months, which historically has been followed by stronger than average returns in the coming year.\n\n> One more thing: A little-followed event just took place that has a solid track record for indicating potentially continued equity strength.\n\n> “The S&P 500 just closed higher for the fifth consecutive month in August. Well, would you believe that the past 25 times that has happened, it was higher a year later 24 of those times?” explained Senior Market Strategist Ryan Detrick.\n\n> As our LPL Chart of the Day shows, a five-month win streak may be a great signal for continued strength. Take note that this time last year, the S&P 500 was up five months in a row and many were concerned it had gone “too far too fast.” Twelve months later, it had added another 17.4%.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/35CvqrB.png))**\n\n*****\n\nHere are the most notable companies reporting earnings in this upcoming trading week ahead-\n\n*****\n\n> * **$ADBE** \n> * **$KR** \n> * **$PLAY** \n> * **$PVTL** \n> * **$SONO** \n> * **$FRAN** \n> * **$TLRD** \n> * **$SKIS** \n> * **$CASY** \n> * **$LMNR** \n> * **$BRC** \n> * **$MTRX** \n> * **$SAIC** \n> * **$EYPT** \n> * **$LAKE** \n> * **$CDMO** \n> * **$COOL** \n> * **$FARM** \n> * **$AGTC** \n> * **$IRET** \n> * **$OXM** \n> * **$PTN** \n> * **$ACET**\n> * **$RLGT** \n> * **$CSBR** \n> * **$PCYG** \n> * **$STRM** \n> * **$ERYP** \n> * **$LOVE** \n> * **$MAMS**\n\n###### **([CLICK HERE FOR THIS WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/8wmvz0o.png))**\n###### **([CLICK HERE FOR THIS WEEK'S HIGHEST VOLATILE EARNINGS RELEASES!](https://i.imgur.com/wSbNoFp.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 9.10.18 Before Market Open:***\nNONE.\n\n> # ***Monday 9.10.18 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/39OtmC7.png))\n\n*****\n\n> # ***Tuesday 9.11.18 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/lpsdfgg.png))\n\n> # ***Tuesday 9.11.18 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/hJsbhA5.png))\n\n*****\n\n> # ***Wednesday 9.12.18 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/fHYxmtO.png))\n\n> # ***Wednesday 9.12.18 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/M1pIixQ.png))\n\n*****\n\n> # ***Thursday 9.13.18 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/HSQSOND.png))\n\n> # ***Thursday 9.13.18 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/PKMeIQ9.png))\n\n*****\n\n> # ***Friday 9.14.18 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/6VQ3IlT.png))\n\n*****\n\n> # ***Friday 9.14.18 After Market Close:***\nNONE.\n\n*****\n\n# Adobe Systems, Inc. $260.87 \n> **Adobe Systems, Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, September 13, 2018. The consensus earnings estimate is $1.69 per share on revenue of $2.25 billion and the Earnings Whisper ® number is $1.74 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of approximately $1.68 per share. Consensus estimates are for year-over-year earnings growth of 55.05% with revenue increasing by 22.21%. Short interest has decreased by 32.8% since the company's last earnings release while the stock has drifted higher by 3.8% from its open following the earnings release to be 17.7% above its 200 day moving average of $221.65. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, August 29, 2018 there was some notable buying of 1,958 contracts of the $265.00 call expiring on Friday, October 19, 2018. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Kroger Co. $32.37 \n> **Kroger Co. (KR)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, September 13, 2018. The consensus earnings estimate is $0.38 per share on revenue of $27.80 billion and the Earnings Whisper ® number is $0.40 per share. Investor sentiment going into the company's earnings release has 73% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 2.56% with revenue increasing by 0.74%. Short interest has decreased by 25.0% since the company's last earnings release while the stock has drifted higher by 14.4% from its open following the earnings release to be 20.1% above its 200 day moving average of $26.95. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, August 22, 2018 there was some notable buying of 17,596 contracts of the $32.00 put expiring on Friday, September 21, 2018. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 9.8% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Dave & Buster's Entertainment, Inc. $57.65 \n> **Dave & Buster's Entertainment, Inc. (PLAY)** is confirmed to report earnings at approximately 4:05 PM ET on Friday, September 14, 2018. The consensus earnings estimate is $0.66 per share on revenue of $311.45 million and the Earnings Whisper ® number is $0.71 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 7.04% with revenue increasing by 10.93%. Short interest has decreased by 25.2% since the company's last earnings release while the stock has drifted higher by 3.9% from its open following the earnings release to be 20.8% above its 200 day moving average of $47.72. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, August 24, 2018 there was some notable buying of 2,017 contracts of the $60.00 call expiring on Friday, October 19, 2018. Option traders are pricing in a 7.3% move on earnings and the stock has averaged a 6.0% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLAY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Pivotal Corporation $26.61 \n> **Pivotal Corporation (PVTL)** is confirmed to report earnings at approximately 4:10 PM ET on Wednesday, September 12, 2018. The consensus estimate is for a loss of $0.09 per share on revenue of $158.33 million and the Earnings Whisper ® number is ($0.07) per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for a loss of $0.10 to $0.09 per share on revenue of $157.00 million to $159.00 million. The stock has drifted higher by 8.8% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. The stock has averaged a 33.0% move on earnings in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PVTL&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Sonos, Inc. $18.75 \n> **Sonos, Inc. (SONO)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, September 10, 2018. The consensus estimate is for a loss of $0.22 per share on revenue of $208.16 million and the Earnings Whisper ® number is ($0.18) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SONO&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Francesca's Holdings Corporation $6.07 \n> **Francesca's Holdings Corporation (FRAN)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, September 11, 2018. The consensus earnings estimate is $0.04 per share on revenue of $121.25 million. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat The company's guidance was for earnings of $0.02 to $0.05 per share on revenue of $119.00 million to $122.00 million. Consensus estimates are for earnings to decline year-over-year by 80.00% with revenue increasing by 1.29%. Short interest has increased by 26.5% since the company's last earnings release while the stock has drifted higher by 12.8% from its open following the earnings release to be 3.7% below its 200 day moving average of $6.30. Overall earnings estimates have been unchanged since the company's last earnings release. On Thursday, September 6, 2018 there was some notable buying of 2,826 contracts of the $6.00 put expiring on Friday, January 18, 2019. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 6.4% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FRAN&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Tailored Brands, Inc. $22.61 \n> **Tailored Brands, Inc. (TLRD)** is confirmed to report earnings at approximately 4:15 PM ET on Wednesday, September 12, 2018. The consensus earnings estimate is $1.07 per share on revenue of $828.36 million and the Earnings Whisper ® number is $1.07 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 6.14% with revenue decreasing by 2.63%. Short interest has increased by 114.2% since the company's last earnings release while the stock has drifted lower by 19.7% from its open following the earnings release to be 8.3% below its 200 day moving average of $24.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, August 29, 2018 there was some notable buying of 3,121 contracts of the $21.00 put expiring on Friday, September 21, 2018. Option traders are pricing in a 9.1% move on earnings and the stock has averaged a 13.8% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TLRD&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Peak Resorts Inc $5.15 \n> **Peak Resorts Inc (SKIS)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, September 11, 2018. The consensus estimate is for a loss of $0.83 per share on revenue of $7.58 million and the Earnings Whisper ® number is ($0.85) per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 29.69% with revenue increasing by 0.80%. Short interest has increased by 597.4% since the company's last earnings release while the stock has drifted lower by 4.6% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SKIS&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Casey’s General Stores, Inc. $114.99 \n> **Casey’s General Stores, Inc. (CASY)** is confirmed to report earnings after the market closes on Monday, September 10, 2018. The consensus earnings estimate is $1.68 per share on revenue of $2.55 billion and the Earnings Whisper ® number is $1.72 per share. Investor sentiment going into the company's earnings release has 50% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 15.07% with revenue increasing by 21.79%. Short interest has decreased by 14.9% since the company's last earnings release while the stock has drifted higher by 21.9% from its open following the earnings release to be 5.1% above its 200 day moving average of $109.40. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 4.0% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CASY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# Limoneira Company $32.36 \n> **Limoneira Company (LMNR)** is confirmed to report earnings at approximately 4:00 PM ET on Monday, September 10, 2018. The consensus earnings estimate is $0.55 per share on revenue of $37.68 million and the Earnings Whisper ® number is $0.56 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.77% with revenue decreasing by 6.72%. Short interest has decreased by 14.8% since the company's last earnings release while the stock has drifted higher by 25.7% from its open following the earnings release to be 34.4% above its 200 day moving average of $24.07. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 12.1% move on earnings and the stock has averaged a 5.0% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMNR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for this week? Good trading to everyone in here on this new trading week ahead!\n\n*****\n\nHave a fantastic weekend r/stocks! :)", "id": "9ecptn", "created_utc": 1536497307.0, "score": 19, "upvote_ratio": 0.76, "num_comments": 17, "comments": [{"body": "I'm thinking of buying more BABA and investing in Tencent.", "score": 4, "replies": []}, {"body": "lol aren’t people here too risk averse to do any actual trading? ", "score": 4, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Well if you thought it was a good buy at the price you bought it, you'll logically like it even more if it drops in price. That means its a greater value. \n\nIf it goes up in price congrats.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "That's the market for you. If you can't stomach seeing your money drop 50% then perhaps investing isn't for you. \n\nThe best advice I can offer you is to \"forget\" about it. You're going to drive yourself crazy by checking the price multiple times a day. ", "score": 1, "replies": []}, {"body": "Don't stress seeing your account drop in value. It's a long term game. As long as you're investing in strong companies, you can almost always expect it to rise back and make you some money over time. Make sure you train your mind so that you don't panic sell when it drops.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Chances $GOOGL continues to fall? It traded sideways friday.", "score": 2, "replies": [{"body": "It could easily go down more depending on how the rest of the market acts. Still, I thought it was cheap before during and after the sell off. If you're looking to start a position you can buy some here and just buy more if it goes lower. Google has shown no signs of slowing down and if earnings and fundamentals start to matter more people will continue to invest in a company that can do 30 billion in revenue  in a quarter while still pouring money in to side bets that dont generate any revenue at all. ", "score": 1, "replies": []}]}, {"body": "I'm completely out of ideas. I have a huge cash position and nothing seems worth buying. Recently bought a position in EWZ near the 52 week lows but not really excited to buy more emerging market stuff right now.", "score": 2, "replies": []}, {"body": "Trade Wars: The Volatility Strikes Back\n\n https://www.theregister.co.uk/2018/09/07/trump_china_tariffs/", "score": 2, "replies": []}, {"body": "Recession week", "score": 2, "replies": [{"body": "but we just had recession week!", "score": 4, "replies": []}]}, {"body": "Got in on $NBEV before close. Thinking this might go north for a little bit next week. The hype has settled down on it and support seems to be found at $1.65.\n\nBeen holding $NEWA, earnings coming next week after that massive correction 2 weeks ago, but this seems to be a trend with this stock, and the fundamentals are there, so not sure why it happens, but I think there's money on the table in this stock.\n\nWatching $JG again next week. Could swing up again. It's Chinese AND an IPO, so not for the faint of heart. Could finish in the $10's, Monday will tell the tale now that earnings are announced, and they crushed it.", "score": 1, "replies": [{"body": "Reg $NEWA:\n\nWhat the actual heck happened to them on the 21st August?\n\nSeems super super sketchy that the management team came out and said they aren't aware of why it tanked so much.", "score": 1, "replies": [{"body": "You know, I honestly don't know. It's a bit of a gamble play and it seems to always trend back up after these corrections, usually within 2-4 weeks, so there is some money to be made here, the only thing is... getting out before it corrects again. Could be MM playing around with this stock, because it's profitable and the numbers look good.", "score": 1, "replies": [{"body": "Yeah. After reading a little more into it it's not for me.   \nThe risk of uncertainty outweighs my need for the quick buck on it but will keep on watchlist anyhow to see if it goes somewhere from here.", "score": 1, "replies": []}]}]}]}, {"body": "I'm considering taking a position in WWE. The international market has so much room to grow. ", "score": 1, "replies": []}, {"body": ">While tech was beaten down, the S&P 500 fell just 0.2 percent for the week to 2,871, and the Dow, also off 0.2 percent, was at 25,916. The Nasdaq lost 2.6 percent for the week, to 7,902.\n\nThat's some bullshit numbers right there. SPX lost more than 1% last week. Rest of the numbers is also wrong. Check your sources and apply common sense - it's very unlikely for an index to lose 0.2% in a week where all days were red.", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - September 09, 2018", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q2 Earnings Official Thread](https://reddit.com/r/teslamotors/comments/93rhl3/tesla_tsla_second_quarter_2018_results_and/).\n", "id": "9ebphb", "created_utc": 1536484016.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 28, "comments": [{"body": "I'm expecting a nice bump on Monday after the amazing numbers for August are now common knowledge and the announcement about what amounts to a new COO and other staff changes.", "score": 9, "replies": [{"body": "I’m expecting it to drop again. I don’t think there will be any sustained or otherwise large price movements up until October and Q3 production/sales are announced, at the earliest. ", "score": 2, "replies": []}, {"body": "Truth is nobody knows how this stock is going to trade short term but we definitely know that this is a discounted price right now ", "score": 4, "replies": [{"body": "Yeah, predicting the precise day that something goes up is hard.\n\nSaying that the stock price is much more likely to go up at 260 than 370 given no material news change is easy.", "score": 2, "replies": []}]}, {"body": "I expect the slide will stop now as we get into the final weeks of the quarter and we see more clarity on the production. Ostensibly it should be a good time to buy, but it is hard to know if the stock will recover to the mid-$300’s. ", "score": 1, "replies": []}, {"body": ">amazing numbers for August\n\nI expect that the market will believe it when it sees the 10-Q. Musk's alternative facts have already cost the stock 100 dollars a share.", "score": -4, "replies": [{"body": "oh you are still here. How pathetic, you aren't an investor. A paid shill at best.", "score": 3, "replies": [{"body": "I'm a shill because I don't think that the market will have forgotten that Musk lied about funding being secured?", "score": -4, "replies": [{"body": "your username alone reveals you aren't exactly a sane, competent investor. Try to be more subtle shill...", "score": 5, "replies": [{"body": "You're long in a company which hasn't posted a yearly profit or been cash flow positive for more than a quarter in its entire public existence. Please, tell me more about being a sane, competent investor.", "score": 1, "replies": [{"body": "LOL. I'm tens of thousands up on them even now. And I think you need to look up what capital investment is. Also try googling 'long term'.\n\nThe funny thing is I bet you either paid a pittance by a short holder, or you are short some really pathetic amount, like 10 shares :D\n", "score": 6, "replies": [{"body": "> I'm tens of thousands up on them even now.\n\nPeople made a killing on HMNY until they didn't.\n\n>And I think you need to look up what capital investment is. Also try googling 'long term'.\n\nAnd I think you need to look up what insolvency is. Also try googling 'operating cash flow', so that you can figure out whether or not CapEx is included in measuring whether or not a company is making an operating profit.", "score": 0, "replies": [{"body": "Dude, sorry to burst your little fantasy but I'm a company director.", "score": 1, "replies": [{"body": "LMK what company so I can short the absolute shit out of it, thanks in advance.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "The only reason to think that Morton only came on board for the take-private is that it's the only option which doesn't paint Tesla management as incompetent. Change my view.", "score": 4, "replies": [{"body": "I think execs leaving after a month is a lot better than them leaving after a year or more. Things don't work out, not a big deal.", "score": 4, "replies": [{"body": "Accountants looking at the books and immediately going “Fuck this, I’m outta here” doesn’t paint an inspiring picture however. ", "score": 10, "replies": [{"body": "He left because he got a CFO position.", "score": 1, "replies": [{"body": "Did that CFO position come with $10 million dollars in vested stock options?", "score": 0, "replies": [{"body": "The details of his compensation package weren't part of the press release.", "score": 1, "replies": []}]}]}, {"body": "He explicitly said there was nothing wrong with the books though. If he wanted to jump ship to protect hir reputation he would have kept quiet about that.", "score": 1, "replies": [{"body": "It’s less the truth of why (and that could very well be a white lie) as the impression it leaves via optics. ", "score": 2, "replies": []}, {"body": "He says he had no problem with the reporting ( as in they aren't lying about what they reporting). However, he still might have a huge problem with how bad the financials are and maybe some of the legal tricks used to make the reporting look a little better than it is.", "score": 1, "replies": []}]}]}]}, {"body": "Sometimes you learn that a job you have taken is much harder than your expectations. I am guessing the depth of the accounting/finance team isn’t what he expected, and that Musk might not take well to his financial advice. \n\nNeither of those are terrible for the company. ", "score": 1, "replies": []}, {"body": "What is the consensus on whether the take-private idea was legit in the first place as opposed to a joke or manipulation?", "score": 1, "replies": [{"body": "For the purposes of the thought experiment I am willing to believe that Musk simply had no idea what he was doing rather than being malicious.", "score": 6, "replies": [{"body": "Whether incompetence or malice, either way not good. Company should not be struggling with credibility at this point. If buyers especially at lower price points start thinking Tesla won’t be around to support their cars post-purchase, they’ll be cancelling orders.", "score": 1, "replies": []}]}]}]}, {"body": "I would have to disagree here. If the stock was at 370, I could easily see it going up to 400 but since it’s been trending down for a month already, I can easily see it dropping to $200 and I would buy it the whole way down because these prices are a steal. \nHowever, we do have to realize that there are a lot of risks for a car company that many Tesla fans choose to ignore. ", "score": 2, "replies": []}]}
{"title": "How screwed are my $AMZN calls next week", "selftext": "i just want to eat PLEASE", "id": "9e9jgf", "created_utc": 1536458400.0, "score": 35, "upvote_ratio": 0.9, "num_comments": 22, "comments": [{"body": "Do they have reasonable strikes and weeks before expiration, or are they 9/14 $2,050s?", "score": 47, "replies": [{"body": "that's literally what i have", "score": 126, "replies": [{"body": "All your money is gone. Sorry dude", "score": 75, "replies": []}, {"body": "Udeadnigga\n\nWell maybe not. If you are that worried take the loss and sell at open Monday or any time it pop ups remotely near strike price.", "score": 6, "replies": []}, {"body": "It'll be back by Friday just hold or rollover into a lower strike. ", "score": 7, "replies": []}, {"body": "Eyyy I got one them too", "score": 2, "replies": []}]}, {"body": "I’d say since everyone here thinks they are looking pretty good if everyone here says you are screwed. I think the reaction from the tariffs was all on Friday (except maybe for aapl). Barring China declaring war I think Monday will be green. ", "score": 4, "replies": [{"body": "People have had a week to have their panic attack about the tariffs and then two days of not trading to cool off. On monday all people will see is a chance to pick up strong american company stocks for cheap. At least if Trump doesn't say something moronic again.", "score": 6, "replies": []}]}]}, {"body": "yolo it.  \n\nYou never know, Bezgod may buy RiteAid on Tuesday or some crazy shit.  ", "score": 12, "replies": [{"body": "Or Fred's 😂", "score": 4, "replies": []}]}, {"body": "No", "score": 4, "replies": []}, {"body": "pretty screwed", "score": 4, "replies": []}, {"body": "I have the same call lol. But considering everyone here thinks we’re screwed that means just the opposite will happen", "score": 3, "replies": []}, {"body": "Well they’re not Apple calls ", "score": 4, "replies": [{"body": "Ouch", "score": 2, "replies": []}]}, {"body": "eat some dick, win win", "score": 1, "replies": []}, {"body": "How screwed are my 1930 9/14 puts?", "score": 1, "replies": []}, {"body": "How bout my 2700 leaps feb 2019?", "score": 1, "replies": [{"body": "They aren't LEAPs if less than 365 days till expiration. ", "score": 3, "replies": []}, {"body": "What would happen if hypothetically there was a spilt before your contract expired?", "score": 1, "replies": []}]}]}
{"title": "Analysis: Elon Musk is hurting Tesla with his bizarre behavior", "selftext": "", "id": "9ef8ru", "created_utc": 1536517856.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 22, "comments": [{"body": "this is about a week too late", "score": 11, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Someone from WSB that agrees Elon Musk is bad for Tesla", "score": -1, "replies": [{"body": "Without Elon, Tesla is just another mainstream electric car company... oh wait, none others exist.", "score": -1, "replies": []}]}]}, {"body": "This is good for $TSLA", "score": 5, "replies": []}, {"body": "Analysts and wall Street can go fuck themselves. Ol'musky is one of the smartest humans on Earth currently. I'm tired of those old dirtbag analysts opinions. Who cares about them anyways? He will do whatever the fuck he wants; it's his company, it's his effort, it's his life.", "score": 29, "replies": [{"body": "Check your sources. Musky confirmed he's an alien.", "score": 8, "replies": [{"body": "Aliens can be on earth. Still makes him smartest", "score": 5, "replies": []}, {"body": "Yeah you are right. He actually confirmed it.", "score": 2, "replies": []}]}, {"body": "It's a public company dumbass.", "score": 2, "replies": []}, {"body": "It’s not his company. He has investors that he should be accountable to. ", "score": 4, "replies": []}, {"body": "Fuck off Elon.", "score": 1, "replies": []}]}, {"body": "A lot of Tesla's value comes FROM Elon being the CEO. He may be borderline sperg sometimes when it comes to human interaction, but he's a damn good engineer and a smart leader. I can guarantee you that news of him stepping down would crater this stock unlike anything seen before. ", "score": 11, "replies": [{"body": "He's not a smart leader at all. That's his issue. He has no idea how to properly run a company.\n\nHe's a great marketer and hype man. Like Lil Jon used to be or maybe DJ Khaled, all hype, little substance.", "score": 4, "replies": []}, {"body": "Elon can run small companies really well but his problem is that he is a crazy micro-manager, it just doesn't work at all for a company with 40,000 employees. I think he has this idea that \"hard work is virtuous\" and that the \"CEO should get their hands dirty\" so he is on the production floor when he should be delegating, and it really doesn't work for Tesla.", "score": 2, "replies": []}, {"body": "Trump_The_Lion is a good judge of character /s", "score": -1, "replies": [{"body": "I am a very stable genius. ", "score": 3, "replies": []}]}]}, {"body": "5D chess confirmed ", "score": 2, "replies": []}, {"body": "This is to escape SEC accusation, Elon tries to show he didn’t manipulate to make the stock go higher before. Just showing that he is mentally ill, so he can avoid the accusation ", "score": 3, "replies": []}, {"body": "Mental breakdown or purely manipulating the media and luring then into his trap?\n\nHonestly, I can’t tell and don’t care, this is entertaining!", "score": 1, "replies": []}, {"body": "Damn son, those money.cnn articles be all full of that strong DD. \n\nFuck them all, Musk is a fucking Chad, we need more people like him.", "score": 1, "replies": []}, {"body": "Mental breakdown in action", "score": 1, "replies": []}]}
{"title": "Let's discuss $AMZN", "selftext": "Hey broke ass billionaires, what are some logical reasons on why amzn will go up or go down through this week?", "id": "9egvse", "created_utc": 1536530057.0, "score": 20, "upvote_ratio": 0.88, "num_comments": 30, "comments": [{"body": "Will obviously go down because you are betting it will go up.", "score": 48, "replies": []}, {"body": "Up in the next two weeks. Apple is the one being Trumped.", "score": 14, "replies": []}, {"body": "Favorable press coverage from colleges getting echo dots. Seems cheap since it pulled back from 1T. Purchasing vans for the new last mile program looks good. And value investors are still losing their shit over it for no good reason so that’s always a good sign. ", "score": 18, "replies": [{"body": ">$1T looks cheap\n\n>value investors are still losing their shit for no good reason\n\nThis is the stuff we’re going to look back on.", "score": 11, "replies": [{"body": "You sound ominous. You think $AMZN will crash?", "score": 4, "replies": [{"body": "I definitely think it’s overvalued", "score": 7, "replies": []}]}]}, {"body": "I could refute by saying college students have already done their college shopping before starting college. College has already started for me, and now im trying to spend as little as possible because I already have everything I need. You do have a solid point though.", "score": 2, "replies": [{"body": "It’s not about the kids shopping now. Bezos is grooming them to have echo dots for the rest of their lives.", "score": 15, "replies": [{"body": "I really hope he's tapping in to our discussions to condition us to buy stuff from amazon more than ever with those thingies. It's crazy how much I greed so much for money that I want to give up my own self worth of privacy. (I'm holding calls lol)", "score": 4, "replies": [{"body": "Its not just shopping. The kids are highly dependent on the echo dots for many reasons: homework, campus directions, metoo emergency bullshit, little Spencer’s food allergies, etc. Echo Dot is life alert for kids.\n\nAnd when they live on their own they will want an echo that can control their iroomba, etc.", "score": -1, "replies": [{"body": "I dont see how that could create cash flow for amazon for actively using echo. Amazon would get just as much money from someone that buys it as never uses it much vs someone that buys it and then uses it a ton, unless you have to pay for those services.\n\nEdit: ITS THE COMPANIES THAT PAY AMAZON FOR COMPATIBILITY WITH ECHO?!?!!?", "score": 4, "replies": [{"body": "The future of all retail is a one-to-one relationship between a brand and every customer. Alexa/Echo line of devices are a perfect way to gather data and build customer profiles.", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "Up. Up. Up. ", "score": 4, "replies": []}, {"body": "RH billionaires wanting to buy last weeks dip will finally have their deposits clear this week. \n\nFANG ETFs reallocating away from F (possibly also N and G) and into A A (AMZN and AAPL).\n\nChinese stock investors (BABA and JD) shift into trustworthy and China-isolated AMZN.\n\nInevitable AMZN rally approaching.", "score": 5, "replies": []}, {"body": "I heard amazon is doing a hiring spree this week to have enough employees for holidays. Is this good for amzn?", "score": 7, "replies": [{"body": "that's seasonal for amzn, p r i c e d  i n ", "score": 17, "replies": []}]}, {"body": "[The End of Amazon](https://www.businessoffashion.com/articles/opinion/the-end-of-amazon)  This guy has some valid points (IMO). Like how Amazon is selling its own brands which are in direct competition with brands who use Amazon to sell their products. But we are talking about Amazon after all. A big ass company with a big market share in online shopping which kinda seems to big to fail. But maybe companies like Alibaba will expand their reach to e.g. Europe and start taking away a part of Amazons market share. Just thinking out loud tbh.", "score": 3, "replies": [{"body": "Grocery stores sell private label all day every day. Same thing. Just gives consumers more options. \"Premium\" Dole canned pineapple for $1.29 a can, or \"Discount\" Safeway Select canned pineapple for $0.99 a can, when they both were canned at the same plant. Amazon Basics is not going to be the downfall of Amazon. ", "score": 18, "replies": []}, {"body": "Wrong wrong wrong wrong.., wrong wrong wrong wrong, You’re Wrong!!! You’re Wrong!!! You’re Wrong!!! -Dr. Cox\n\nThis article is pure bullshit! “Parallax Blind spots”!?! LMAO! Bezos preaches **treating every day as though it’s day one**\n\n“Poor experience”, what a joke!!! Have you gone out shopping recently, how much fun are those long ass lines? Enjoy *physically* searching stores for something? Traffic? Parking? Limited hours of operation? \n\nHow about being **the** leader of the cloud! How about MSFT’s **Azure being down for most of last week** which they blamed on overheating, yet still in breach of SLA *for almost entire work week*.?\n\nHow about **practical marketing opportunity**.?\n\nHow about superb AI and ML platforms?\n\nHow about upcoming $10B government JEDI contract, which only potential contender MSFT just *pissed away their piddly chances due to their display of shittyness last week.*?\n\nWhat about overhauling Healthcare working with BRK and JPM?\n\nWhat about their ability to destroy and incumbent in virtually any industry by leveraging their considerable tech and logistics resources?\n\nWhat about their leader who is richest man in world yet still focuses on customer experience and NOT bottom line - the same man that **ran AMZN with ZERO PROFIT for over a decade**?\n\nWhat about Alibaba being a joke of an AMZN Chinese copycat, oh btw Jack Ma is retiring tomorrow, reassuring?\n\nWhat about smart speakers now available in almost any language, including very difficult Japanese language?\n\nScared of regulation? Anti-trust laws exist *solely* to *protect consumers*, but AMZN is *undisputedly beneficial* to consumers.\n\nTL;DR. Article is pure crap, writer probably a perma-bear shitstain Doug Kass wannabe, Wrong on so many levels is either an idiot or bullshitter.  **AMZN has the longest legs of any existing company PERIOD.**\n\nWho disagrees any why!?!? \n\nI’ll start, the only legitimate vulnerability to AMZN is ‘key man risk’, however papa Bezos has best security the richest man in world can buy. ", "score": 10, "replies": []}, {"body": "What I got from this: Amazon will die because it will be an obsolete service at some point and Jeff Bezos is a con artist.", "score": 7, "replies": []}, {"body": "As soon as I saw Walmart being mentioned I stopped reading. Another dumb yank that thinks only US market matters.", "score": 1, "replies": []}, {"body": "The items amazon sells have 0 competition. Amazon dominates these markets because they have free marketing, appear at the top of the list, and amazon can provide videos with there products. (All other sellers cannot provide video)", "score": 0, "replies": [{"body": "That's just not true. If your item is brand registered you can get enhanced brand content on your listing which includes a video. If they take replace an ad spot with their own listing then that means they are missing out on ad revenue. 3rd party sellers regularly compete in the same categories as Amazon but yes sometimes not competing with the exact same item since Amazon will lower their price until you barely have any profit margin left.\n\n  \n\n\nI am super bullish on amzn but there are a lot of misinformation out there about Amazon items vs 3rd party.", "score": 1, "replies": []}]}]}, {"body": "I want to say that we will see it go back up this week but with the tariff shit who knows. I think last week was just a tech selloff and has presented an attractive buying opportunity for Amazon that will hopefully drive it back up past the 1 trillion mark.", "score": 1, "replies": [{"body": "I feel like amazon hasnt settled enough in china to be affected by tariffs. I could be wrong.", "score": 1, "replies": [{"body": "From what I understand the tariff threat is not so much to do with the business of Amazon but the overall economy. If Trump is willing to fight a trade war it will be bad for American businesses in general which in turn means less spending, worse economic conditions, etc.", "score": 3, "replies": []}, {"body": "Amazon is directly affected by the tariffs. Over 50% of products are sourced from China. I know this because I run a semi-successful amazon business and these tariffs are getting ready to capsize it. ", "score": 4, "replies": [{"body": "Most products are sourced from China **EVERYWHERE**, so everybody will be hurt equally WMT, COST, etc. However AMZN can still offer better prices, below MSRP due to lower overhead. So tariffs will hurt everyone, yet AMZN will still have better prices, so could very well **increase your amazon business traffic**.  \n\nThink about it, your fellow competitors in the dildo industry with products in Spencer’s will bleed more than you from tariffs.", "score": 3, "replies": []}]}]}]}, {"body": "no", "score": 1, "replies": []}]}
