{"title": "Is now the time to buy puts again?", "selftext": "Hello fellow yolo'ers. I have brought you some long awaited DD. I believe it is time, once again, to short everything in site. Here is the DD:\n\n1) The short-term bottom of February 12th was a lower low, the most recent yearly high was a lower high (SPX). This is true for the Dow Transport and Dow Industrial as well, which in dow theory, is bad.\n\n2) The 15 DMA has flattened and failed to cross above the 40 DMA. This TA has a pretty strong track record if you didn't know. \n\n3) The MACD has had a short period of divergence but is beginning a downward turn around on a long term base and has already signaled a sell signal on a short term base.\n\n4) Momentum from the RMI indicator is dying out and beginning a downward trend.\n\n5) Volume is still in a negative trend on the two Dow Indexes mentioned earlier.\n\n6) The Keltner Channels have entered inside the Bollinger Bands. This TA is what one might consider \"Vodoo\" but whenever that happens, a shit ton of momentum usually occurs, and in this case, it will be downward pressure momentum. \n\nThe Yachts are in front of us boys.\n", "id": "4e3xqf", "created_utc": 1460250620.0, "score": 4, "upvote_ratio": 0.64, "num_comments": 27, "comments": [{"body": "$SPY put spreads. Load the truck up. Perhaps be slow to throw on the other short put so you can get a better spread. Or not. I keep rolling my 206's and 205's", "score": 5, "replies": []}, {"body": "I would put more emphasis on Euro and Yen.Also look into closely how DB is going to perform in next week.Market is more worried about money policies and european debts right now than Oil. ", "score": 2, "replies": [{"body": "I didn't talk about oil specifically. I just mean the general market but I'll definitely look into Euro and Yen more instead of commodities.", "score": 1, "replies": []}]}, {"body": "the guys on cnbc made the same case on friday, im looking at SPY 195 puts, just having trouble deciding on a timeframe", "score": 1, "replies": [{"body": "The people on CNBC said something useful for once? Damn lol. I'd say a one month time frame. If you don't want to fuck with theta go for 6 weeks instead. ", "score": 1, "replies": [{"body": "http://www.riskreversal.com/2016/04/07/big-printin-i-spy-lower-highs-and-a-lower-low/\n\nhe then presented basically the same chart on optionsaction on friday afternoon", "score": 2, "replies": []}]}, {"body": "Wait until end of April at least. Janet yellen still got w speech to make ", "score": 1, "replies": [{"body": "yeah but theres also the emergency meeting to discuss discount rates on monday, wondering if thatll have any effect", "score": 1, "replies": [{"body": "Exactly, wait until end of April. What are you butting about", "score": 1, "replies": [{"body": "was just pointing out theres the scheduled fed meeting, and an emergency one", "score": 1, "replies": [{"body": "you got a link for that 'emergency' one?", "score": 1, "replies": [{"body": "https://www.federalreserve.gov/aboutthefed/boardmeetings/20160411advexp.htm\n\nmaybe emergency is the wrong word, but its being conducted using \"expedited procedures\" 4 days after it was announced", "score": 2, "replies": [{"body": "thx", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Translation, sell a yacht load of short term puts on VXX \n\nWorst case, smooth sailing for a while and you get put at 17-18. Wait a while for markets to tank, which they will eventually, and collect your yacht. In the mean time gain enough for a dinghy in premium. ", "score": 1, "replies": []}, {"body": "Dow Transports are a leading indicator AND ITS DOWN. My sold puts expire friday and I'm looking to be out tuesday since they are at 14 delta with a nice profit. Then selling call spreads. Look for weak sectors and the weakest stocks with good liquidity and high IV and sell call spreads to be safe UNTIL the big move down comes then go long your puts. This market may get propped up a bit during earnings season bc the lowered expectations mean more beats but by June the big tank is coming. Also PE of the market in general is way to high.", "score": 1, "replies": [{"body": "Why June? Sell in May stuff or why?", "score": 1, "replies": []}]}, {"body": "What is a put you speak of ??", "score": 1, "replies": [{"body": "Google \"options trading\".  It is way too much to explain.", "score": 1, "replies": []}]}, {"body": "I'm still pretty bullish near term, but I do think we could see a small pullback if last week's lows are broken through on the S&P. Retest 2030, if that's broken then 2005 - 2010 would be major support. But could easily continue higher, I do think we retest 2100 soon, possibly all time highs before any major pullback.", "score": 1, "replies": []}, {"body": "I'll bullish till we see some earnings and have some real opec news. I know the collapse could come any day, for now it seems the Bears can't show up a week straight.\n\nTrying to wait a few more weeks for puts.", "score": 1, "replies": []}, {"body": "dunno about all that technical shit but earnings will be shit and valuations will be questioned again. im buying puts this week, depending on what kind of news comes out for companies with high p/e.", "score": 1, "replies": []}, {"body": "Ermmmmmmm. ", "score": 0, "replies": []}, {"body": "You might be right, you might be wrong.  Personally I don't put much faith into technicals.\n\nHowever, at the moment there's nothing *fundamentally* wrong with the economy that would imply a quick correction, and I'm not sure what the catalyst would be were that to change.\n\nOne thing I would say: if you want to be bearish here I'm not sure why you'd go with puts as opposed to just shorting SPY (or the index of your choice) or selling futures.  For the same reason that I don't think there's going to be a quick downdraft I don't see a massive rally coming up either, so why pay the premium to limit your losses?", "score": -1, "replies": [{"body": "The reason people go with options instead of just flat out taking a long or short position is because of leverage.  The profit you gain from being right on an option is much greater, but your losses are also much greater.  Options trading is for the true YOLO'er.\n\nYou can actually make 100% profit or more from options within a week's time, whereas that would take years in most cases to make 100% profit from flat out buying a stock (not counting penny-stocks).", "score": 1, "replies": [{"body": "So sell futures.", "score": 1, "replies": []}, {"body": "You can make way more that 100% trading options in a day-- much less a week.\n\nOptions are the shit.", "score": 1, "replies": []}]}]}]}
