{"title": "Short Box Spread Conceptual Work Through", "selftext": " Please correct the following if it isn't factually correct in the comments section and I'll edit the post.\n\nSo I familiarized myself with 1ronyman story. Although it serves to be a lesson on leverage, I believe the box spread strategy which on a false assumption (similar to the one I made naively when creating my last post on BYND) of being risk free or impossible to go tits up served to sunset 1ronyman's chronicle and has delegitimized the strategy in the process. What should be avoided and censured is thinking that this is a form of riskless arbitrage. However, I find it fruitless to discourage, as to be reductive, the use of short box spreads simply on the basis of their misuse by an over levered retail trader who unflinchingly bet his entire account value and then some without due understanding of this particular strategy's risks and nuances.\n\n**Box Spread Strategy without Early Assignment**\n\n(# are to make a comment in the formula)\n\n1. When you initiate a short box spread strategy you are effectively creating an inverted spread such that at the very most you will be able to close out the spread for the distance for which it was inverted and a de minimus premium for market makers to close out what would be itm (this assumes the underlying at 4:00 pm is between the strikes of the short legs of either spread).\n\nP/L=Credit incurred over inverted width (\"can't go tits up\" risk arb differential) - market making discount to close entire position before expiration\n\n2) The other scenario at expiration would be that both short legs were assigned in which case you would pay (in the case of BYND) a hard to borrow fee as your broker borrows shares to deliver to the long call holder you were short the following monday while you would cover the same day but still pay a t+1 borrowing fee either immediately or if your able to use the shares you've been put by your ITM put position, the latter which may involve price differentials and time gaps between the two assignments either to the detriment of the strategy or not.\n\nP/L=Credit incurred over inverted width - borrowing fee - commissions related to underlying #potentially assuming cover from open market purchase and not from put assignment#\n\n3) Finally, assuming no early expiration, if one of the spreads is untested while the other one is deeply ITM (the fact that one of the spreads in untested implies that your long leg of the tested spread is ATM or ITM as well), you will be assigned at expiration and depending on whether you would want to speculate on the pre-market movement of the underlying you would choose to exercise your ITM long leg in your tested spread (the pre-market movement should be greater than the cost of selling the stock from your exercised long call such that you are hedged for any increase between the time your broker borrowed and deliver to the long call holder that you were short and the time you cover)\n\nP/L=Credit incurred over inverted width - borrowing fee (if call side is tested) -commissions related to underlying\n\n**Box Spread Strategy with Early Assignment**\n\nThe following scenarios may be as catastrophic as that experienced by 1ronyman or may be more docile than they appear. First of all, I'm assuming that the spread will be made on a series whose tenure doesn't include any expected dividends given the obvious impetus for early assignment in the first place.\n\n1. One scenario that [/u/ken385](https://www.reddit.com/u/ken385) pointed out would be if the call spread were assigned early (I added this) but it was in between the inverted spread and you paid hard to borrow fees in the case of BYND. The risk you would be left with is the untested spread in which the stock may move in the opposite direction. Therefore, to avoid this situation (every opposite move would decrease your credits initially incurred) you would pay to close out the untested put spread and pay for premium.\n\nP/L=Credit incurred over inverted width - borrowing fee (if call side is tested) - extrinsic value paid to close out put spread #You may speculate that the direction will continue in a favorable direction and therefore will not pay to close out the other side (less likely given the early assignment was made in between the inverted spread).\n\n2) A similar scenario would be if the put spread were assigned early, which appears more likely as deep itm puts will have less time value premium to begin with than their call counterparts. A similar conclusion is made less the borrowing fees\n\nP/L=Credit incurred over inverted width - extrinsic value paid to close out call spread (likely option given price reversion from a lengthy downside move)\n\n3) A third scenario would be similar to scenario (without early assignment) number 3 which assumes one of the spreads is untested and neither of its legs are ITM. Therefore, one may have more of a buffer to avoid having to pay extrinsic value to close out the untested leg. They may then have exposure to profit if the direction continues to head in the way that made the tested leg deeply ITM.\n\nP/L=Credit incurred over inverted width -borrowing fees (if call side is tested) + any gains from remaining long leg of tested spread up until the short leg of the heretofore untested spread becomes ATM at which point losses will amass or you sell your long call/put for its remaining extrinsic value\n\n4) The final scenario may be the worst. This assumes that your broker will automatically exercise your long leg position if it too is ITM during the early assignment of either of your spreads. You will lose any extrinsic value you held in the long call/put. However, this will only impact future exposure and potential for gains then reduce from your actual P/L\n\nP/L=Credit incurred over inverted width - borrowing fees (if call side is tested) - #extrinsic value if you were to sell the ATM long call or any future exposure to constancy in the movement of the price of the underlying\n\n**Worst-Case Scenario:**\n\nYour broker automatically exercises your long leg positions based on an early assignment, you pay hard to borrow fees, and pay the remaining extrinsic value to close out your exposure to the unassigned side all while you are in a high vomma (acceleration of change in option value due to change in IV) environment. Whatever credit you incurred that \"couldn't go tits up\" is wiped out by the premium you had to pay to close the spread. Extra trouble if this assignment is early.\n\n**Best-Case Scenario:**\n\nYour short put leg is deeply ITM such that your long put leg is ATM which renders your short call leg worthless at expiration. You don't need to purchase shares in the open market to put from your long put position as a hedge towards further downward price movement pre-market on monday. You get put the shares on monday and they subsequently rise. You therefore made credit above the intrinsic value of the inverted spread at expiration, avoided borrowing costs and stock commissions, and experience an unrealized gain above the intrinsic value credit you made by opening the box spread in the first place.\n\n**Verdict**\n\nThrough my acquaintance with 1ronyman's story and further investigation into box spreads, it appears that they may be created on a low IV stock with less dte. Therefore, this opportunity seems to be snuffed by market makers.\n\nI would be curious if anyone could decide how much credit incurred above the intrinsic value of the inverted spread set up in the short box spread as percentage of the intrinsic value of the inverted spread should be given a look or two as a necessary feature to enter a short box spread trade.", "id": "brxynv", "created_utc": 1558580033.0, "score": 21, "upvote_ratio": 0.84, "num_comments": 17, "comments": [{"body": "Literally can't go tits up", "score": 30, "replies": []}, {"body": "It's only a de-legitimized strategy to those who have no idea what they're doing. You have an interesting analysis here, but what you're missing is that box spreads should only be done with European options. This negates the risk of early assignment.", "score": 7, "replies": [{"body": "Finally someone who actually understands my intentions behind the post. It’s as if people cannot help themselves from regurgitating 1ronyman truisms.", "score": -1, "replies": [{"body": "The main thing to learn from ironyman was that box spreads must be done with European options and you seem to have missed that entire concept then chide people for only posting memes lol", "score": 4, "replies": [{"body": "Fair point to the unnecessary snootiness. Although I find the memes trite when they are placed on a post that is merely attempting to consider the hypothetical of having actually performed them on American style options. Although I don't explicitly state it, it is clear that the overwhelming majority of the theorized scenarios will either have hardly any incentive to begin them or go against the face of practicality, therefore I doubt I have missed the point of suffering from initiating them on american style options.", "score": -2, "replies": []}]}]}]}, {"body": "Box spreads on American options is just non-sense. Like u/ThePopeAh said, it has to be done with cash-settled, European options.\n\nNow, why would you do it, in any case?\n\nThe whole purpose is to either **(1) borrow or lend cash at near risk-free rates**; or **(2) bet on interest rate changes**. Here's why.\n\nA box spread (on an cash-settled, European option), at expiration, is worth exactly the distance between the strikes. To more easily visualize this, think of the box spread as 2 separate vertical spreads, and think about the value of those vertical spreads at expiration when the underlying closes below the lower strike, above the higher strike, or between the strikes.\n\nSince at expiration the value of the box spread is known, and there's absolutely no way it could be any different (*and this, my friends, is why it has to be done with cash-settle, European options*), **the box spread trades at a risk-free rate discount to the distance between the strikes before expiration**.\n\n**(1) Lending/borrowing cash**\n\nThe extremely important part of this discussion is that ***you'll hold the trade until expiration***.\n\n**(1a) Lending cash**\n\nIf you have a positive cash balance in your account, and your broker doesn't pay you interest (*looking at you, TD Ameritrade, Tastyworks, Robinhood, ... the vast majority of them*), you could easily have that cash working for you generating the risk-free rate with a box spread.\n\nHow? **Buy a box spread**.\n\nYou'll buy it for less than it will be worth at expiration, by the exact amount discounted by the risk-free rate. This will *remove cash* from your account today, to have it credited back with more cash at expiration.\n\nNow, very important: **don't trade it at the ask**, or you'll almost certainly lose money. Place a buy order with a carefully considered limit price, otherwise you might end up receiving much less interest – you might even lock-in a loss by trading at the ask.\n\n**(1b) Borrowing cash**\n\nSay you need cash for trading. For example, you are trading equities on margin and you realize that your broker charges you outrageous interest rate on borrowed cash (*looking at you again, TD Ameritrade, Tastyworks, etc*). Or, alternatively, you need cash to finance a different options position opened for a debit – as you know, option positions must be fully paid for, cannot use borrowed cash from the broker.\n\nHow do you get that loan? **Sell a box spread**.\n\nYou'll sell it for less than it will be worth at expiration, by the exact amount discounted by the risk-free rate. This will *add cash* to your account today, which you'll pay back at expiration together with interest – the risk-free rate.\n\n**Don't trade it at the bid**. Place a carefully considered limit sell order, otherwise you might end up paying much more interest.\n\n**(2) Playing interest rates**\n\n***If you don't hold the trade until expiration***, then Rho will be an important factor.\n\nIf interest rates increase, the value of a box spread drops – think about it: with higher interest rates, whoever is borrowing money buy selling a box spread will have to pay more interest; this means the seller will sell for less money with higher interest rates.\n\nIf interest rates decrease, the value of a box spread increases.\n\nSo, if you want to play interest rates, one way is through Rho of a box spread.", "score": 6, "replies": [{"body": "Thank you for this incredibly insightful comment. I guess it would've been hard for me tor realize the interest rate play given my brokerage is tastyworks and td ameritrade. It's interesting to hypothesize how NIRP may invert the dynamics of Rho of the box spread.", "score": 1, "replies": []}, {"body": "I was reading that the taxes are 60% long term capital gains and 40% short-term capital gains. If I were to do a short box spread with an expiration a few years out would I be responsible for paying taxes on the full amount of premium received the first year for that tax year?", "score": 1, "replies": [{"body": "No, that's not how it works. The premium you received is irrelevant (or paid, depending on the trade). What matters is the mtm value at year end. Of whatever gains or losses (mtm) you had, 60% of those will contribute towards LT calculations, and 40% of those will contribute towards ST calculations.", "score": 2, "replies": []}]}]}, {"body": "Sounds risk free", "score": 19, "replies": []}, {"body": "Ever heard of r/1ronmany ?\nI dont understand box spreads but ill never use them", "score": -12, "replies": [{"body": "Literally his second sentence, refers to that user.", "score": 14, "replies": [{"body": "Oh shit you right. Didnt read it", "score": -3, "replies": [{"body": "No shit you didn’t read it. It’s literally in the first paragraph.", "score": 6, "replies": [{"body": "You arent adding anything to the convo", "score": -5, "replies": [{"body": "Neither are you but I actually read it", "score": 6, "replies": [{"body": "Somebuddy git thuh paddle! We gotsta paddlin' ta do!", "score": -2, "replies": []}]}]}]}]}]}]}]}
{"title": "USA seems to be going through the 5 stages of grief losing its status to the world.", "selftext": "The five stages of grief is, denial, anger, bargaining, depression and acceptance.\n\n1. Denial-  Back in the early 2000 the US said china will never catch up to us.  We're too advanced and they are too backwards to ever be a threat.\n\n2. Anger- China is cheating and stealing! Something must be done about this.  They are raping our country!\n\n3. Bargaining- trade war\n\n4. Depression- recession (pray it's not a depression!)\n\n5. Acceptance- yeah, they maybe bigger than us but we live way better.  It's about the quality of life", "id": "bs3iq9", "created_utc": 1558621169.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 12, "comments": [{"body": "Lol- dumbass", "score": 13, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": ">Haha are you being fed Chinese propaganda?\n>\n>You are seriously out of touch if you think the US will lose the status of #1 in the world ANYTIME in the lifetime of anyone currently alive. \n>\n\nThis is hilarious hopefully we all make it to 2029.\n\n>>Both the IMF and [the World Bank now rate China as the world’s largest economy](http://data.worldbank.org/data-catalog/GDP-PPP-based-table) based on Purchasing Power Parity (PPP), a measure that adjusts countries’ GDPs for differences in prices. In simple terms, this means that because your money stretches further in China than it would in the US, China’s GDP is adjusted upwards.\n\n>>And it won’t be too long before China’s economy surpasses the US’s by other measures, too. The Centre for Economics and Business Research (Cebr) [predicts it will happen in 2029](https://www.cebr.com/reports/welt-2016/).\n\nhttps://www.weforum.org/agenda/2016/12/the-world-s-top-economy-the-us-vs-china-in-five-charts/\n\n>It's not even about something like bullshit national pride, it's just common sense. China is acting tough and both countries are being petty with the language being used, but in the end whatever happens China will lose the most.\n\nIs it common sense?", "score": 1, "replies": []}, {"body": "I could be wrong because we are in the 3rd stage.  So it depends on what is bargained for right?  But stage 4 is approaching fast and furious.", "score": -8, "replies": [{"body": "I actually like this breakdown a lot, it definitely gets ya thinking. May not be what I want to hear but there is definitely sound logic to it. Let's hope we never hit stage 4....or have we already lol.", "score": -1, "replies": []}]}]}, {"body": "Not to go /r/murica on this thread, but as long the USA exists, the USA is the top dog of the world. It will take more than a crazy president and some trade war to knock the USA of the top off the pedestal.", "score": 3, "replies": [{"body": "your still in stage one?", "score": -5, "replies": [{"body": "On the contrary, as long as the tech industry is firmly planted in the Silicon Valley as well as the financial industry is planted in NYC, then it will be very, very difficult to move the USA off the mountain.", "score": 7, "replies": [{"body": "I'm not saying China will topple our country.  We will still be on top of our mountain.  Just a bigger mountain will be our neighbor.   But who cares?  We have more food and resources than anyone else.  They will be bigger than us but we will always live better than them.  And that's what's important for Americans.  Remember we can live like americans... they can't.", "score": 0, "replies": []}]}]}]}, {"body": "I think it’s pretty clear the Chinese economy will eventually pass the US, and later down the line India will pass the US. Is there really a reason any of us should be bugged by that? It’s not like we’re unable to invest in other countries’ economies. Nationalism is a weird concept to me.", "score": 0, "replies": []}, {"body": "US military will destroy China.. Trump realizes this and understands that he is in the position if power.", "score": 1, "replies": [{"body": "Except China will start a nuclear holocaust and no one gets to live.  That's why nations with nukes don't fight each other.", "score": 0, "replies": []}]}, {"body": "I think the last trade war was with Japan in the 80's. But there are differences here.  \nChina has nukes and 4 times the population of the US.   Japan did not.  Japan got nuked but that's not the same thing.  \nCurrently both US and China has roughly the same size economy.  But US is growing at 3% annually and China is growing at 6% annually.  That means  within 20 years China will be twice as big as us.  Plus their future is brighter than the US because the core tech of 5G is owned by Huawei.   Its estimated that 5G will add over 1 million jobs and contribute over $500 billion to the source country.  So for the next 20 years China has pole position to dictate the direction of the world.  America has woken up to this reality and is going ape shit over it.\nI don't like it one bit.  But I need to see the world as it is.", "score": -1, "replies": []}]}
{"title": "Tesla Short Squeeze Comming!", "selftext": "Tesla is up 3% premarket. Shorts are the main reason this stock took a beating, and to you are starting to see them cover. I'm in long from yesterday (and from 230 as well). How far will it go? Will investors jump back in as well?", "id": "bs2ufx", "created_utc": 1558617514.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 14, "comments": [{"body": "Just watch today... Plenty of short will cover. Upside can be at 6-7%", "score": 2, "replies": []}, {"body": "Ahh, here comes the downpour of Tesla fanboy posts as they try to salvage the aura of their savior Elon.", "score": 5, "replies": [{"body": "Im a WSB degenerate and came here bc the only thing I was seeing was tesla posts. Came here and got the same shit. Lol smh.", "score": 1, "replies": []}, {"body": "Don't hijack other peoples topics so you can share your asinine opinion.", "score": -2, "replies": []}, {"body": "hey moron, the employee note today proves the exact ass backwards reality is going on at tsla\n\n&#x200B;\n\nshorters are 100% wrong in all their FUD", "score": -7, "replies": [{"body": "I would place a higher importance on the balance sheet than the employee note but hey you do you.", "score": 6, "replies": [{"body": "Yeah I too didn't see anything in the note about their billions in debt suddenly not being a problem. The trend remains intact, and it ain't up IMO until it can clear 210/220 with gusto.", "score": 0, "replies": [{"body": "Denial phase commencing\n\n\nHow dare tsla go up\n\n\nCan see it now", "score": 0, "replies": [{"body": "Let it go up. Like I've said in other posts, I'm anticipating a bounce and am playing the stock in a range with an iron condor.", "score": 1, "replies": []}]}]}, {"body": "Denial phase", "score": 0, "replies": []}]}]}]}, {"body": "Days to cover is < 3 on Tesla.  Not likely any actual squeeze is in the offing.", "score": 1, "replies": []}, {"body": "Its not a squeeze its bc of leaked email.. keep up the cheer leading tho", "score": 0, "replies": []}, {"body": "did you see the news? the short thesis is exactly ASS BACKWARDS\\~!\\~! they are right on track and ahead of sales projections per an internal employee note from MUSK\n\n&#x200B;\n\n&#x200B;\n\n235 retrace will be vicious to shorters here", "score": -2, "replies": []}, {"body": "So losing less money now ... yes losing less will make this a winner because.... if you burn money more slowly it means your business is worth more?", "score": 0, "replies": []}]}
{"title": "TSLA. I compiled information, with sources, so you don't have to.", "selftext": "", "id": "brwhlh", "created_utc": 1558571357.0, "score": 50, "upvote_ratio": 0.93, "num_comments": 13, "comments": [{"body": "Surprisingly cogent post for wsb.", "score": 16, "replies": [{"body": "Something something monkeys, Shakespeare, and some typewriters.", "score": 6, "replies": [{"body": "Hey now, I know you don't like monkeys but there's no reason to be mean to them dragging them down to wsb levels.\n\n&nbsp;\n\n^(I've nothing against wsb, they're funny sometimes.)", "score": 3, "replies": []}]}]}, {"body": "Kinda misses the point by looking YoY instead of QoQ. It is not surprising that we would see such a large increase in revenue and deliveries YoY when we know that Tesla supply constrained in Q1 2018. They were still working toward the 5k Model 3s / week threshold for profitability. They reached that point in Q3 and were very successful. So now it is expected they will continue to make those numbers in order to be profitable.\n\nThey should be looking at QoQ since the bigger, or really only, question on Tesla is what caused their Q1 demand to fall off. Delivery fell 30% and auto sales revenue fell 40%. I get that they had 10.5K cars in transit but that's not enough to make up the difference. And it was what was expected from the 2018 Q4 guidance.", "score": 2, "replies": [{"body": "Well, this is why everything is incumbent on Q2 numbers which will show where the trend is going for the rest year. Hopefully production and delivery numbers are close to guidance or slightly under. 72 days to go until earnings, I’m hoping Elon being tongue tied just fuels his desire to prove the critics wrong once again.", "score": 3, "replies": []}, {"body": "The entire auto industry was down in Q1, yet Tesla was a top seller in the luxury sedan segment even with their lower numbers. They stopped selling the Standard S/X for a few months. There was demand pull forward because of the tax credit into Q4 18, they were cell production constrained because Pana couldn't pump'em out fast enough, it was their first quarter in their history shipping such a high volume of cars overseas, and yes they had boatloads of cars in transit at end of quarter.", "score": 2, "replies": []}, {"body": "I am tired of the \"demand fall of\" discussion.\n\nIt is well established that they pushed a lot of sales in q4 2018 because of the tax credit halving.\n\nStill nobody really knows what is up with demand. It will show over time. Q1 is absolutely not a clear indicator for demand. \n\nRevenue has taken a hit because of transit and because of X and S sales. \n\nBad Q1 X and S sales also has multiple reasons. First of again Tax credit. Everyone who wanted an S or X in the US got it Q4. Shipping to EU and CH was also a huge cluster fuck in Q1, so X and S also took a hit there. Then there is also the anticipation of an refresh that held / holds back some SX sales.\n\nI personally also think it is clear that the M3 eats some of the S sales. However this will probably smooth out in the future with customers of the 3 upgrading to S or X when they were happy with the 3 but want something bigger.\n\nCompletely overlooked by annalist, demand in their energy products. Crazy.\n\nThe reality is, TESLA is still battery constrained and cant put out products fast enough. The demand issue is made up IMO.\n\nBut i also see that they have to work hard on their margins.", "score": 5, "replies": [{"body": "We already knew that they were going to have cars in transit. The Q4 guidance said they would have 10.5k cars in transit and in the Q1 report they had exactly 10.5K cars in transit. That’s spot on. But deliveries were down by 27K so that only explains a little more than a third of the decline. What happened to the other 17K? \n\nIf the story is that these are falling sales due to the tax credit halving, I mean, that is a demand problem. At the new out of pocket cost for a Tesla without the credits, less people are interested in buying one. Definitely could have pulled forward some of the demand that would have showed up in January and February into December but then I would have expected Q4 to have a larger bump over Q3 than it did.", "score": 2, "replies": [{"body": "> 10.5k cars in transit and in the Q1 report they had exactly 10.5K cars in transit. That’s spot on. But deliveries were down by 27K so that only explains a little more than a third of the decline. What happened to the other 17K?\n\nQ4 had:  \n 2018 Q4: Produced 86,555 Delivered 90,700 \n\nSo more delivered than produced.\n\nQ1 They Produced: 77,100 Delivered 63,000 \n\nSo already a delta from there.\n\nThey also had to outfit the line for the EU an CH models, this probably led to some down time.\n\nAnd as i said, i also think the M3 eats some S sales, but predicting numbers makes no sense at this point. Also a \"refresh\" of S and X is hyped in the Telsa media for a long time. Now with the new drive train i think sales will start to increase again.\n\n> If the story is that these are falling sales due to the tax credit halving, I mean, that is a demand problem. \n\nI Agree, but it is short term demand not long term. Most people don't spend 50k+ in a heartbeat, so everyone who was planing to get a Tesla in the next couple months got it in December and not January.", "score": 1, "replies": []}]}, {"body": ">The reality is, TESLA is still battery constrained and cant put out products fast enough. The demand issue is made up IMO.\n\nYou're aware that Tesla's true inventory (cars produced without an order made) increased in Q1, right? They didn't delineate the specific makeup of the increase with respect to 3/X/Y volume, unfortunately.", "score": 2, "replies": [{"body": "Yes, but i don't think it is more because they started batch producing and not producing for specific orders to smooth out production. Q1 is also the slowest quarter in the whole car industry. I would not make a huge deal out of it *yet.* But if the trend continues in Q2 i share your worries.", "score": 1, "replies": []}]}]}, {"body": "From the OP:  \n  \n> I believe YoY is a better indicator of a companies growth due to seasonality. In their Q4 report they predicted Q1 would take a hit. Q4 also broke just about every record. I believe QoQ here would be a terrible indicator of company health.  \n  \nhttps://www.reddit.com/r/wallstreetbets/comments/brrrw0/tsla_i_compiled_information_with_sources_so_you/eog706c", "score": 5, "replies": []}]}]}
{"title": "Tesla Bears Need To Take A Step Back, Too $TSLA", "selftext": "", "id": "bs4rmk", "created_utc": 1558627516.0, "score": 0, "upvote_ratio": 0.41, "num_comments": 11, "comments": [{"body": "SeekingAlpha is cancer and I refuse to read it on principal.", "score": 18, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Sounds about right, I guess they just want to rank on Google with their sub-par blog posts.", "score": 3, "replies": []}]}]}, {"body": "[removed]", "score": 22, "replies": []}, {"body": "My takeaway from this is it's a more good-faith bear analysis that is still seriously flawed in many ways. It unfairly downplays the work longs do to gain confidence in the stock and the future of the company (see ARK for example). Longs read the SEC filings too, contrary to what this bear says. We don't just go on faith in the long term and the CEO and we also do more than stick our noses in financial documents looking for language to cherry pick that might support our thesis. His arguments strike me as still not seeing Tesla for the disruptor it is and trying to evaluate Tesla like they're GM or a printer paper company when they're really in a class of their own in an unprecedented way. He may be more good-faith in his arguments, but he still points at things like a bumper falling off or some panel gaps as some sort of ah-ha and not the anecdotal noise these things really are. Then he goes on to basically call Elon dumb or ignorant of things like capital markets and not even a real engineer. Lol, ok. This guy is a bear that eschews the crazy elements of his ilk while still parroting the same bear arguments that have been made for years as if they're new and insightful. They're not.", "score": 6, "replies": [{"body": "I do think the premise is good. Especially for people like myself. Posting it for the other skeptics.", "score": 1, "replies": []}]}, {"body": "Whats up with Tesla shorts and the whole \"Elon isnt even an engineer\" thing? its frankly pretty annoying.  You dont have to have the degree if you have the experience and do the job.", "score": 2, "replies": []}, {"body": "Here is any easy to read version. I found this article to be dry on facts,  it it hit the nail on the head about sentiment.\n\nhttps://outline.com/rjvBHv", "score": 3, "replies": [{"body": "You realise seeking alpha is a blog site right? It allows anyone to post with zero editorial checking on facts or quality", "score": 2, "replies": [{"body": "You read the article right and know it’s an opinion piece right? It’s not analysis.", "score": 2, "replies": [{"body": " \"What can be asserted without evidence can be dismissed without evidence\".\n\nChristopher Hitchens", "score": 1, "replies": []}]}]}]}]}
{"title": "I've put my entire life savings into TSLA when Elon said it would be bought at $420", "selftext": "[removed]", "id": "bs6vxb", "created_utc": 1558638250.0, "score": 0, "upvote_ratio": 0.15, "num_comments": 4, "comments": [{"body": "Either sell, hold or buy more. It’s up to you.", "score": 4, "replies": []}, {"body": "Totally not seeing any trends here. Ramen seem to be used a lot by the trolls.", "score": 3, "replies": [{"body": "Maybe they’re all poor? Or maybe they prefer the taste of ramen to lobster. Who knows.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "100% confirmed. Get this shit out of here.\n\nI was THIS close to gifting him $10k to cover his unfortunate losses but now I think not.", "score": 5, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "[deleted]", "score": 6, "replies": []}]}]}]}
{"title": "What's happening tomorrow besides fucking TSLA?", "selftext": "[removed]", "id": "bry9ax", "created_utc": 1558581847.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 11, "comments": [{"body": "I'm a first time investor just watching the market before I invest my $5000. I dont know what to buy man, so nervous", "score": 1, "replies": [{"body": "Slow and steady wins the race homie. If you put $6k into the market every year from now until you’re 65, you will have over $1 million. That means things like SPY and BRKb though. Play money can go to WSB ideas. The bulk of your money should ride on real long term investments and don’t get spooked by shaky markets", "score": 2, "replies": [{"body": "Good advice, but only if you have steady income, more than $5000, and the disposable income to ride the big waves.", "score": 1, "replies": []}]}, {"body": "Don't do options or day trades buy spy with 50 percent then another 25 if it drops more because of trade shit. \n\nWhen you study options for a while then think about playing with like 500. Don't make the mistake I did still down 67% all time. That was 2 years ago when I started", "score": 2, "replies": [{"body": "Dang, but spy is very slow growth!", "score": 1, "replies": []}]}, {"body": "If you’re gonna do options, let’s say 1k just ride the waves bro. Don’t try to time anything. I’ve made more money doing that than anticipating something and day trading it out", "score": 1, "replies": [{"body": "Finally a practical response 😊", "score": 1, "replies": []}]}, {"body": "As much as possible, stay in your lane while you are learning the market.  Invest in things you like and try to figure out if you think they are going to be successful,  and go from there. Listen to people's suggestions but do your own digging. Lastly, start small try getting on base before you aim for a home run. \n\nThese are tips I learned from people in this sub and others.  So not everyone is retarded", "score": 1, "replies": [{"body": "Appreciate it!", "score": 1, "replies": []}]}]}, {"body": "TSLA", "score": 1, "replies": []}]}
{"title": "Urban Trade Breakdowns: AW Jones - The OG Master of The Universe", "selftext": "[deleted]", "id": "brymok", "created_utc": 1558584273.0, "score": 108, "upvote_ratio": 0.98, "num_comments": 10, "comments": [{"body": "What's this a meaningful post? Wait let me but down my shit posting cap and read. Thank you sir", "score": 11, "replies": [{"body": "So close,  happy cake day.", "score": 4, "replies": []}]}, {"body": "TIL where the Black Keys are from.", "score": 5, "replies": []}, {"body": "The writing on this post is fantastic, maybe the best yet. Always fascinating to think about how certain seemingly obvious things like long-short funds had to be invented.", "score": 6, "replies": [{"body": "Thanks, man.", "score": 1, "replies": []}]}, {"body": "Love this shit homie.", "score": 3, "replies": []}, {"body": "You should do a story based on the character from Rogue Trader (true story)", "score": 3, "replies": []}, {"body": "Yeah I read “more money than god” too", "score": 2, "replies": [{"body": "Yeah his chapter on Jones is by far the best info I could find on him.  I highly recommend that book.", "score": 3, "replies": []}]}, {"body": "Great post OP! Thanks for sharing!", "score": 2, "replies": []}]}
{"title": "This is why Tesla popped today. They have a chance to break delivery records this quarter!", "selftext": "[removed]", "id": "bs3vyr", "created_utc": 1558623062.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 14, "comments": [{"body": "I got fucked by an email", "score": 2, "replies": []}, {"body": "\"Popped\"", "score": 2, "replies": []}, {"body": "It wouldn’t shock me if this was an attempt to stay above water. They’re in some desperate times", "score": 3, "replies": [{"body": "It’s been desperate times since they IPO’d", "score": 2, "replies": []}]}, {"body": "Lies", "score": 1, "replies": []}, {"body": "Just Get ready to sell the $170 puts if it drops to $180", "score": 1, "replies": [{"body": "I wish I could.  I'm too broke, futures god lol", "score": 1, "replies": [{"body": "Ah.. you only need $2000 balance to trade futures just so you know..\n\n  \n\n\nIt's ok my brethren.. the future will wait for you.", "score": 2, "replies": [{"body": "Thank you bro. Actually because of you I'll be opening a Ninjatrader account to join you in the future! $400 account minimum! And $500 margin requirement for futures trading 😉", "score": 1, "replies": [{"body": "WELCOME TO THE FUTURE!!%$\n\n  \n\n\nYour options signs have been forgiven!\n\n  \n\n\nGo fourth and sin no more with gay decaying options and prices that just change with dumb Implied Volatility!\n\n  \n\n\nNo more with the Future shall you be sick of options theta disease!\n\n  \n\n\nRise! And walk in the Future!\n\n  \n\n\nStart by trading the micro futures which as you can see don't hurt or gain anything! Haha. The perfect tool to learn the futures!\n\n  \n\n\nhttps://i.imgur.com/LBRGgXd.jpg", "score": 2, "replies": []}]}]}]}]}, {"body": "Please post in the megathread.", "score": 1, "replies": [{"body": "Ok sorry", "score": 1, "replies": []}]}, {"body": "Wouldn't be the first time Elon just straight up lies. Morgan Stanley only expects ~70k deliveries for q2", "score": 1, "replies": [{"body": "I wouldn't follow anything those manipulative assholes say. They were some of the underwriters for Lyft, an unprofitable company. But they have no $10 price target on it of course.", "score": 1, "replies": []}]}]}
{"title": "Should I hold onto AAPL or eat the L?", "selftext": "", "id": "bs4rgi", "created_utc": 1558627494.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 14, "comments": [{"body": "Blue > Green bubbles", "score": 14, "replies": [{"body": "Orange man > ∞\nEat the D", "score": 2, "replies": []}]}, {"body": "What’s China gonna do to Apple? Ban them and fire their  2+ million Chinese employees? Not likely", "score": 8, "replies": [{"body": "Also the first retaliation ban will result in every western company kicking their Indian or SE Asian manufacturing plans into high gear. \n\nI’d imagine most companies already want to diversify their reliance on China but it’s too expensive to pull the trigger.\n\nThis could be the catalyst to do it.", "score": 3, "replies": []}]}, {"body": "I would eat then wait and possibly buy back in.\nIf trump puts more Chinese companies on the sanction list, China will probably retaliate in some form and if they decided to do target an American company Apple is the biggest target", "score": 3, "replies": [{"body": "Won’t matter since phones will sell at a premium via black market. Anyways. Phones don’t make that much Apple money. Services do now", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm a dumb noob. What is PPT?", "score": 1, "replies": [{"body": "Pussy Pawners Trade", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Wow I actually leaned something today. Thanks.", "score": 1, "replies": [{"body": "It’s a complete conspiracy and not validated at all.", "score": 1, "replies": []}]}, {"body": "I don't think they're answering his calls right now.", "score": 1, "replies": []}]}]}]}, {"body": "Buy the dip", "score": 2, "replies": []}, {"body": "Hold", "score": 1, "replies": []}, {"body": "Hold", "score": 1, "replies": []}]}
{"title": "To buy $5000 $TSLA ?", "selftext": "[removed]", "id": "bs9ryz", "created_utc": 1558653874.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": " Be a man and buy $5,000,000.", "score": 6, "replies": []}, {"body": "Actually hella smart. It’s going to go to 4K a pop according to the attractive thot on tv", "score": 4, "replies": []}, {"body": "Don't, I sold puts about a week or so ago so naturally it's going to drill to the Earth's core until they expire", "score": 2, "replies": []}, {"body": "Bro ... wait a week to see how thing sideways ... plus I’d wait until G20 to see if there are any signs for China deal. \n\nOr if you really want in... slowly buy into entry\nPoints but not all at once", "score": 1, "replies": [{"body": "Yeah I was thinking about this too. But I know if it shoots up and I didn't buy some 30 shares I'd be upset.", "score": 1, "replies": [{"body": "You’d be upset but you’d still have 5K for another strategy.\n\nMay I suggest TLRA?", "score": 2, "replies": []}]}]}, {"body": "I got the fuck out.  Many analysts new targets have it at $100 and below.", "score": 1, "replies": [{"body": "To be fair, many analysts have a track record on par with the average WSBer.", "score": 2, "replies": []}, {"body": "Jesus fucking christ. But this trade deal with China is effecting it the most, no ?", "score": 1, "replies": []}]}, {"body": "Bro, sell. \n\n Why tf would you buy Tesla?? \n\nThis is autism, but not wsb autism.", "score": 1, "replies": []}, {"body": "I would venture to say it is the call Elon had with the Bank in early May stating that financing was a “buffer” and that they would use it in case of economic downturn.  2 weeks later, the “email” reverses the story saying the capital raise only lasts them 10 months.", "score": 1, "replies": []}, {"body": "I shouldn't have listened to you asshats. :(", "score": 1, "replies": []}]}
