{"title": "SESN is going straight to the moon", "selftext": "[removed]", "id": "p46st8", "created_utc": 1628942683.0, "score": 69, "upvote_ratio": 0.78, "num_comments": 34, "comments": [{"body": "Join the r/smallstreetbets official Discord here - https://discord.gg/E27dUNUwfx\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Is the bag big or small?", "score": 48, "replies": [{"body": "[removed]", "score": 27, "replies": [{"body": "Corrupt FDA statement oh my God", "score": 13, "replies": []}, {"body": "Your saying go all in!?!? Done", "score": 7, "replies": []}]}]}, {"body": ">Stocktwits viewers green\n\nnobody believe anything they see on stocktwits\n\n> with random halts \n\nThe stock was halted just before the FDA dropped their letter.  It was deliberate and non-random.\n\nThey appear to be a two drug company with one of their drugs now a non-player.\n\n> because it is being produced in some low-grade country\n\nUhhh.  What?!\n\n> how much meme mulla WSB can bring\n\nfuck that noise\n\n> Buy this shit Monday\n\nThere are plenty of  worthless call options sitting around at the $5 strike for Aug and Sept, but it starts to thin out after that.  Do you think it's going to recover in a month?  You can buy $5 strike calls for $100 a contract.  Do you think it's going to recover by next week?  Those same $5 strikes are going for $10 a contract.  Call IV is off the charts for Sept; put IV picks up in Oct, but only for the $1, $2 and $3 strikes.  Make of that what you will (probably MMs selling contracts for that juicy IV premium), but keep an eye on the OI changes over the next couple of days to see where sentiment is headed.", "score": 32, "replies": []}, {"body": "I thought this was SENS and was wondering what happened", "score": 9, "replies": []}, {"body": "It's not just a CMC issue but you already know this, just keep holding that bag for a year or two.", "score": 5, "replies": []}, {"body": "Please stop pumping, a lot of people already lost on the pump to the 52 week high. The drop to 70 cents is the market speaking loud and clear what the real price is after the CRL. It is a cure for cancer, moon or bust. This one unfortunately will be a bust as we've seen.", "score": 2, "replies": []}, {"body": "Why do you say, 'The only reason it wasn’t approved here was because of a manufacturing issue because it is being produced in some low-grade country.' The firm is headquartered in Massachusetts", "score": 2, "replies": []}, {"body": "Great call OP", "score": 2, "replies": []}, {"body": "Fuck it, been a while since I've yolod on anything based purely on seeing a post here. I've bought shares of this before and last I saw it didn't have options.. I don't know why but I'm down, wen monday", "score": 1, "replies": [{"body": "This one ain't it, it's a lot more than just a manufacturing issue.", "score": 10, "replies": [{"body": "I've lost money on every play I've ever made based on a reddit post lol.", "score": 6, "replies": [{"body": "Then stop?", "score": 3, "replies": [{"body": "Uhh why? The last one was palantir last year, I think I can afford to buy a stupid sens call or two.\n\nE: lmao this is sesen bio. Still buying senseonics calls Monday.", "score": 1, "replies": [{"body": "So did you....?", "score": 1, "replies": [{"body": "I forgot. I'll buy a sens and a sesn leap or 5 tomorrow if I remember 🤷", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Price target?", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "At least I’m doing research and studying. Did you see BIIB? It also dumped a lot last year after getting rejected by fda but recently reached new time high.", "score": 2, "replies": []}]}, {"body": "🌚", "score": 0, "replies": []}, {"body": "First time?", "score": 1, "replies": []}]}, {"body": "Stocks only go up, I’m in.", "score": -5, "replies": []}, {"body": "Let's go to the moon", "score": -7, "replies": []}, {"body": "Wen moon and ware lambo?", "score": -6, "replies": []}, {"body": "I don't think I've made profit on a single biotech stock I've ever purchased.", "score": 1, "replies": []}, {"body": "Lol , new clinical trials means 3-4 years delay . Nor turkey neither eu has agreed. Lol", "score": 1, "replies": []}, {"body": "Bagholder detected", "score": 1, "replies": []}, {"body": "Wait a minute.. some people over here and over at STockTwits think SESN and Senseonics are the same thing.. They’re not. Making a bad investment is one thing lol.", "score": 1, "replies": []}, {"body": "Withdrew from Europe application. Screwed", "score": 1, "replies": []}, {"body": "I bought in at $0.7767.  Waiting a month out was a great idea to see how far it'll bottom out.  There's not much left to go down.  It's all up from here, right?", "score": 1, "replies": []}]}
{"title": "SKLZ: Can It Drop Below $10.00/share Without a Market Crash?", "selftext": "SKLZ is a polarizing stock. Wall Street seems bullish on it. SeekingAlpha writers are polarized. Retail investors seem lukewarm or negative on it. \n\nAfter the disastrous earnings call earlier this month, where it was revealed that hundreds of thousands of former users had abandoned the platform, the share price has drifted downward with seemingly no end in sight. r/SKLZ seems unenthusiastic compared to other stocks' subreddits. \n\nDo you believe that SKLZ will drift below $10.00/share, or is $11.00/share about as low as it will go?\n\nI'm personally bullish, but I'm also concerned that the downward momentum in August could cause more panic-selling and a downward spiral going as low as $8.00/share.\n\nWhat do you think?\n\nArtem", "id": "p41wsq", "created_utc": 1628917731.0, "score": 13, "upvote_ratio": 0.75, "num_comments": 40, "comments": [{"body": "It's a former SPAC, surprised it pumped so much. Maybe since Cathie bought a bunch. SPACS/Post SPAC have been awful lately.", "score": 8, "replies": [{"body": "Agreed.  But I think they deserve it.  The valuations even now are crazy.", "score": 1, "replies": [{"body": "The knife is following, do you want to catch it?", "score": 1, "replies": []}, {"body": "There are plenty of fair value deSPACs. However all deSPACs are getting lumped together", "score": 1, "replies": [{"body": "Agreed.  The point is many of them are getting a haircut which will make their valuations more reasonable going forward.  I didn't mean to paint with such as wide brush.\n\nCurious, which ones do you think are undervalued or fair valued at current prices? Thanks in advance.", "score": 1, "replies": [{"body": "PSFE, BARK, UWMC, and CHPT (OG IPO price).", "score": 2, "replies": [{"body": "PSFE at 4.5x income is breaking my brain.\n\nExcited for Monday, win or lose. Just to get a clearer picture.", "score": 2, "replies": [{"body": "Same here. I’m averaged at $11.89 and I thought that was a steal", "score": 2, "replies": [{"body": "Good average for last week, hopefully next.\n\nI'm in at 12.91 after averaging down from 13.80. What a ride.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "It will", "score": 4, "replies": [{"body": "Why do you think that?", "score": 2, "replies": []}]}, {"body": "I sold out of this stock and took my losses and put it into a stock I had higher conviction", "score": 3, "replies": [{"body": "I managed to make a few thousand dollars here and there over the past few months by writing puts on it. I decided to give it another go, this time striking at $10.00/share, with expiration dates in November and February, about equally divided. I stand to make about $6k each time, but only if SKLZ stays above $10.00/share. \n\nAt this point, the signs that I’m seeing in the market are so, so risk-averse, that it really is impossible to tell which way this is going to go. November is going to be positively dangerous, so I won’t dare hold through earnings. I’m going to see how things go, and if they go in the right direction by the end of next week, I’ll keep waiting patiently and probably buy to close at the +50.00% point for November. I think February will be easier and that I’ll probably be able to run to expiration then.\n\nI’m not in love with the company and it’s not something that I’d personally use, but with my MBA hat on, I like what few numbers we have so far, and believe that the catalysts will eventually push it past an inflection point and send it higher. What I’m concerned about is about a short-term death spiral caused by panic.", "score": 1, "replies": [{"body": "The safest thing to do would actually wait for some good news and see the stock reverse. It’s shown weakness for a long time.\nIt’s not worth the risk at the moment", "score": 1, "replies": [{"body": "I think that that's the safest course of action. The only challenge is that that type of news would likely cause it to jump in seconds, and you'd completely miss the move.\n\nThis really is a gamble.", "score": 1, "replies": [{"body": "That is the kind of mindset that gets us in trouble.\n\nMissing a 10-15% jump when the stock will continue to rise is better than trying to time a jump and it keeps falling.", "score": 3, "replies": []}]}]}]}]}, {"body": "You think it's bad when Cathie is buying. Wait until she starts selling.", "score": 3, "replies": [{"body": "You're very right about that!", "score": 1, "replies": []}]}, {"body": "Yes", "score": 2, "replies": []}, {"body": "I present to you Desktop Metal. Currently trading around the $9 mark. Hit the $10 a while ago.", "score": 1, "replies": []}, {"body": "The shifty spacs are at $10 or lower and fading, the quality SPACs are about where they belong - around the deal’ agreed upon valuation before retail devoured them a few quarters ago. I still can’t explain NKLA.", "score": 1, "replies": []}, {"body": "So you only take your analysis from peoples opinions? Learn to read fundamentals and when you do you will realize it’s a terrible stock", "score": -1, "replies": [{"body": "Why is it so terrible? Have you ever played card games for money? \nIm playing blitz, and it's ok. \nHowever I don't like thier marketing, they give a lot of money to users, and it looks like they add that money to revenue and loss. \nThe company can rise for sure, but how fast...", "score": 2, "replies": [{"body": "Thing is you have 0 edge against their so called opposing players, which for all we know could be bots draining you of your money", "score": 0, "replies": [{"body": "We still don't know. did you try? Or you are just bear? \nIn blitz there are many users, why do they need bots? \nI can imagine that some users will try to use bots, but in that game it's not so easy.", "score": 1, "replies": [{"body": "No I’m talking of your opponent being literally artificial", "score": 1, "replies": []}]}]}]}, {"body": "I have an MBA. I understand the fundamentals and business context very well. The fundamentals are fine. The real questions are strategic and tactical. The most important, for me, is one of timing. \n\nNo one can predict the future, but I value the opinions of others who inform themselves and think critically about a company. Why wouldn’t I listen to others’ opinions? I want to make sure that I haven’t missed something important.", "score": 3, "replies": [{"body": "Have you ever used the app? It’s terrible", "score": -4, "replies": [{"body": "If you think that SKLZ is an app, there’s really nothing further to talk about.", "score": 5, "replies": [{"body": "Mobile gaming application?", "score": -2, "replies": []}, {"body": "Not a very bright one are you?", "score": -3, "replies": []}]}]}]}]}, {"body": "Charts are butt ugly. Hard to see how this one has any friends. This company needs something transformative to break through.", "score": 1, "replies": [{"body": "It’s very hard to predict what will happen, but the company is generating growing revenue, and there are some catalysts, such as a partnership with the NFL, and international expansion to India (at the worst imaginable time). I think that it’s interesting at this point because of the apparently strong support at $10.00/share. \n\nThe biggest near-term threats seem to be a downward spiral caused by panic-selling and capitulation, because SKLZ is an early innings, unprofitable company spending huge (and increasing) amounts of capital just to try to retain paying gamers. \n\nThe company is deeply misunderstood, because the gamers aren’t actually the customers, as I see it. Game developers are. SKLZ developed a software API and infrastructure to enable small developers who otherwise couldn’t afford to build their own infrastructure to host their game on a multi-player infrastructure and monetize it through paid competitions (i.e. gambling, although they try to pretend that it’s something else). The only problem is that SKLZ rips off the game developers. \n\nOn the positive side, the CEO is the co-founder with a track record of success. He was somehow able to pull the NFL in, so, who knows? \n\nI’m bullish about SKLZ relative to its current price one year from now. What I’m not as confident about is the near-term price, particularly in early November. If there’s another earnings report that shows that a large number of former gamers have abandoned the platform, and user acquisition costs remain high or climb, that would destroy the share price. Time will tell. \n\nIf Aunt Cathie starts selling, the party’s over. Interestingly, it has higher institutional ownership than I had thought it would, for such a polarizing company. It appears that both they and Cathie are bullish, but that doesn’t mean that there might not be a very serious collapse in the share price, especially in this inflationary, fear-driven market that is unforgiving and punishing of unprofitable companies.", "score": 2, "replies": []}]}, {"body": "Sklz shouldn't even be over a billion market cap yet it sits at 4 billion. There's plenty of downside remaining", "score": 2, "replies": [{"body": "It's possible. At this point, everything will depend on market conditions, which are driven by fear of inflation and complete risk aversion for unprofitable companies. If the price breaks down below $11.00/share, I think you'll see a lot of panic-selling and an uncertain bottom, possibly $8.00/share.", "score": 1, "replies": []}]}]}
{"title": "Tesla FSD Beta vs Mercedes-Benz DrivePilot comparison shows big difference in tech | TESLARATI", "selftext": "", "id": "p4fxqc", "created_utc": 1628974485.0, "score": 33, "upvote_ratio": 0.87, "num_comments": 40, "comments": [{"body": "*mild shock*", "score": 18, "replies": []}, {"body": "lmao, I love when Elon compares those simulations to grading your own homework. Mercedes is way behind", "score": 9, "replies": []}, {"body": "Ok, so where’s the content? Basically meaningless article, as so often with teslarati.", "score": 7, "replies": []}, {"body": "Great now compare driverless auto pilot on public streets with someone like waymo", "score": -23, "replies": [{"body": "Now do that in a city Waymo hasn't mapped.", "score": 44, "replies": [{"body": "Now do driverless Tesla anywhere. Like say auto summon on an incline.", "score": -28, "replies": [{"body": "Let's think about what that means. The incline limitation is due to a corporate liability decision. The software is able to work on an incline, but presumably with a somewhat higher chance of failure, so corporate decision was not to allow. It's like the dozens of scenarios in which the EQS conditional level 3 system doesn't just go from L3 to L2 when a problem is detected, but shuts down entirely and makes the driver take over or won't start in the first place. \n\nFor Waymo and EQS, there are also corporate liability components (severe weather reducing system reliability to the extent it won't drive autonomously, though if they had a higher risk tolerance they could let the car continue). But in addition there is a fundamental inability to drive on the 99% of roads that have not been adequately geomapped yet. Corporate could give the green light tomorrow and the cars still couldn't drive because they don't have the inputs they need.\n\nFor Tesla, as I understand it, the remaining problems generally relate to level of certainty, not lacking the right type of input, except in edge cases (of which there are still a lot, but they allow driving on 99% of roads).\n\nThe Tesla FSD system now is good enough to do exactly what Mercedes is doing with conditional L3 if they want to take on the risk and get the right approvals. In fact, now that Mercedes has kind of paved the way, I don't know why Tesla is holding back from making the same move of getting approval for conditional L3 in the most favorable circumstances. Then companies like Tesla, Mercedes, Cadillac, etc., can compete on the expansion of L3 capabilities to more and more conditions. \n\nIt would give us a far more substantive way to compare who is farther along. It would also give a concrete path to L3 rather than the all/none assumption. In fact, I think it is the only path to achieving L3 in a reasonable amount of time. Makes a ton of sense to me anyway.", "score": 28, "replies": [{"body": "Let’s think what it means: waymo is legally offering autonomous taxis and teslas can’t (geofenced or otherwise) with no clear road map to the stated goal. \n\nAnd auto summon has many executes why owners don’t use it after one or two experiments often with damage involved. Got it.", "score": -32, "replies": [{"body": "Waymo is not legally offering autonomous taxis. They have a non-commercial product operating in part of one city. They have people watching the vehicle and intervening regularly.\n\nIf Waymo was close to solving level 4/5 economically why would Google sell Waymo shares to raise capital? Makes no sense. Real autonomy is a literal golden goose, Waymo is not even close to a real product.\n\nWaymo also is spending maybe 5-6x more per car to outfit it with sensors/compute. Even if they solve level 4/5 and if Tesla can solve it too, Waymo won't be successful.", "score": 24, "replies": [{"body": ">Waymo also is spending maybe 5-6x more per car to outfit it with sensors/compute.\n\nThe cost gap is much bigger: Waymo taxis are ~$50k cars with ~$150k sensors.\n\nTesla gets FSD hardware almost \"for free\", by having merged it with ADAS and safety features.", "score": 8, "replies": []}, {"body": "Telsa has no non-commercial products operating anywhere offering driverless cars. They also do not have commercial products operating anywhere offering driverless cars. \n\nIf Tesla was close to solving Level2 they wouldn't be rolling out betas and just plain deliver like other automakers the also wouldn't have scraped most of their software stack in the last year to remove radar. They aren't even close to level2 to talk 4 or 5. \n\nWaymo's current success is leaps and bounds above Tesla in delivering driverless cars to the public as a service. Tesla hasn't even shown it once that they are capable of doing it. Not in a demo not on AI day not to shareholders not to anyone.", "score": -12, "replies": [{"body": "Waymos approach is not scalable. \n\n\nGive Tesla a few more years to perfect vision and maybe you will understand", "score": 16, "replies": [{"body": "I am sure they can get there when measured in decades but they promised it on cars that are now five years old. I know what the power play is here and it’s deliveri mg a feature complete FSD in less than 24 months that has zero to do with coast to coast driving without a human behind the wheel. Then they will move on to FSD+ or whatever the brand it and leave existing owners with crushed dreams.", "score": -5, "replies": [{"body": "Sound like your shorts got burned.", "score": 13, "replies": []}, {"body": "Computer vision and machine learning improve at an exponential rate. \n\n\nFsd 9.1 today would be unbelievable 5 years ago. What do you think another 5 years will do?", "score": 10, "replies": []}]}]}, {"body": "What do you mean 'close to solving level 2', Tesla's system is level 2 and will be until they think it's good enough to roll out a robotaxi network, at which point it will be level 4 or 5. \n\nFirstly, Tesla didn't scrap 'most of their software stack', they rolled out their next version. New versions always have rewrites and improvements, that's the whole benefit of software development. 'Other automakers' don't even deliver anything, their systems are based on Mobileye or Nvidia. What they deliver is worse even than Tesla's 2-year-old public Autopilot build. \n\nWaymo has no success. They have defined a narrow problem set, use much more expensive hardware and still can't solve it economically. Waymo's valuation in the private markets has been on the decline for years. Answer my question why Google is selling Waymo (and the CEO/ other leadership leaving) if they are doing well? Waymo also have no go-to-market strategy. If Tesla solves vision-based autonomy with their current sensor suite, they will be able to roll it out to millions of vehicles overnight. The upside is much higher for Tesla than Waymo. Not to mention the higher return on investment because a Tesla is about 20% the cost of a Waymo vehicle. \n\nThe point is not where the companies are now, it is where will they be in 10 years. This is an investing subreddit, not a 'my team won this year' subreddit. Waymo is stuck in a dead-end, Tesla's system is clearly improving over time. Tesla could replicate what Waymo is doing now, the reason why they don't is that it doesn't help them solve the end problem, which is generalised autonomy. Releasing an intermediate product will only delay the release of generalised autonomy. If you've followed Elon at all it's clear he has the long game in mind.", "score": 11, "replies": [{"body": "Dude, why bother…", "score": 11, "replies": [{"body": "Good question 😂", "score": 10, "replies": []}]}, {"body": "Why do you invest in Tesla? What are the one or two products or services that make you think the valuation is fair and that the future is bright for this company?", "score": -1, "replies": [{"body": "Just watching this discussion you don't move the goalposts, you bring in timber, nails, and paint, then get out a saw and hammer and put up your own...", "score": 13, "replies": [{"body": "Goalpost is street legal cars that can drive without human behind wheel and pickup passengers and deliver them safely. Aka waymo. Not tesla.  \n\nNo goalpost other than that.", "score": 0, "replies": [{"body": "You're thinking to narrowly. Waymo does have a product that can do what you say, but it's not a real product. It's still a science experiment. Once they roll it out to 100k cars + across multiple states in the USA, and have maybe 20 cars per monitoring person they will have a real product. They also can't use $200k of sensors and compute, it just won't be competitive. \n\nIt all matters. The cost of the vehicle. The cost of fuel. The cost of sensors. The energy requirements of the compute. How many they can make per year. How fast they can roll out. How well it deals with changes to the environment. It's not just as simple as what you think, hence why Google is selling shares and management got fired. Waymo's approach has led them to a local maximum that they cannot escape.", "score": 6, "replies": [{"body": "u/failinglikefallingn doesn’t get why Waymo hasn’t expanded past its geo mapped area in AZ. How does he not understand this is a controlled experiment. I lived in AZ and watched those cars drive in the fenced in areas. Never on the high ways, or cities... They didn’t expand the area they covered.", "score": 2, "replies": []}]}, {"body": "Tell me how you can go buy a waymo vehicle to put into service as a driverless vehicle. Meanwhile Tesla sold 200,000 EVs last quarter. \n\nGo look at the [Tesla Masterplan](https://www.tesla.com/en_CA/blog/secret-tesla-motors-master-plan-just-between-you-and-me). What were the goals? The goalposts were literally to make EVs... not autonomous vehicles.\n\nOnly with [Tesla Masterplan part 2](https://www.tesla.com/en_CA/blog/master-plan-part-deux) was autonomous brought on as **one** of many goals. If it were done already, along with the other goals, then we'd be onto masterplan part 3.\n\nYou can't just say \"LOL Tesla's failed\" because you make up your own concept of what the goalposts were, Tesla's already told you where the goalposts are, and they're still there. \n\nI still can't get a waymo where I live, but I can get in an Tesla (uber or privately owned) easily.", "score": 2, "replies": []}]}]}, {"body": "The two potentially most valuable projects of Tesla are their internal cell production (and related projects) and level 5 robotaxis. Although neither are needed to justify Tesla's current valuation. Tesla has a forward P/E of 100, which is actually low for a company growing as fast as Tesla. The market doesn't think that Tesla can continue to grow this fast, nor that they will be this profitable.", "score": 3, "replies": [{"body": "Do you believe the current model teslas are capable of level5 robots is as promised by musk?", "score": 1, "replies": [{"body": "Well, humans can drive with two eyes so Musk is actually correct in theory. Where he may be wrong is just how much compute and how high-def the camera's need to be.\n\nI think that the current FSD computer will not be enough for Level 5 but that is not an issue. Their camera layout and sensors are likely enough, but they could upgrade cameras with a simple replacement unit if they need to. \n\nI think Tesla will have a similar product to Waymo (i.e. no-driver but remote-monitoring), but available across millions of vehicles in specific states in the USA (that approve the product) probably in 1-3 years. As I said before, they could probably release a city-based remote-monitoring vehicle already, but it doesn't help them solve level 5. Tesla is a real business and needs to be cash flow positive, Waymo is a parasite living off Google's back.", "score": 5, "replies": []}]}]}, {"body": "Haha definitely burned your shorts.", "score": 5, "replies": []}]}]}]}]}, {"body": "Is this true? Please confirm where it’s stated that Tesla couldn’t offer Robotaxi in a pre-mapped area? I’ve always thought this is more due to choice than anything, because Tesla’s strategy isn’t to just do Robotaxi in a pre-mapped area", "score": 4, "replies": [{"body": "You see FSD v9 videos and think wow the driver isn’t even needed! ?", "score": 0, "replies": [{"body": "FSD Beta 9 is very different than Tesla spending their efforts pre-mapping an area and launching a robotaxi service though?\n\nThat’s my point.", "score": 9, "replies": [{"body": "Driverless taxis at the end of the day is a service not a specific tech. Tesla has promised one million by now and they delivered driver controlled model 3s in a completely controlled environment of their own making.", "score": -1, "replies": [{"body": "How is a driverless service work without the specific tech?", "score": 3, "replies": [{"body": "I am saying doesn’t matter if waymo is better or not they provide the service today and Tesla does not.", "score": 0, "replies": []}]}]}]}, {"body": "Tesla is doing something completely different than waymo, waymo is capped where they are (not fully autonomous) whereas Tesla is the closest to full autonomy. Think of waymo like the popular kid that peaks in highschool, while Tesla has the possibility to be the first fully autonomous profitable vehicle service. Something waymo can never do.", "score": 7, "replies": []}, {"body": "I’m sure Tesla could spend time focusing on a very specific area like Waymo and perfect the whole town to the point that they could provide level 5 in that environment the same way Waymo has, but what’s the point? That effort only takes away from their long term goal with FSD.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "Of course.", "score": 1, "replies": []}, {"body": "Shocker!", "score": 1, "replies": []}, {"body": "I feel i had enough of internet today.", "score": 1, "replies": []}]}
{"title": "Why was I only assigned on one INTC 53.5 put this friday? I had sold two contracts.", "selftext": "", "id": "p459t6", "created_utc": 1628935065.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 32, "comments": [{"body": "Pinned (ATM options) are not always assigned. Buyers can expire them worthless.\n\nA typical case:\n\n1. You want to hedge your INTC position. You buy 53.5P.\n2. On an expiration day, INTC is trading  53.51\n3. So, you decide to close the position at 53.51 & let the option expire without execution.\n4. Day closes are 53.50, but you do not care.\n5. At the end of the expiration day, the option clearinghouse collects information about exercised and non-exercised options (rules may apply). It will be, for example, 60 out of 100 options exercised.\n6. The clearinghouse randomly asks to assign 60 random options sellers.\n7. So, sellers are 60% lucky/unlucky :)\n\nFor ATM options it happens very often.\n\nFor slightly ITM options (1-2 cents) - less often, but happens.\n\nFor 5+ cents ITM, it happens, but very rare (luck)\n\nYes! You may be assigned on OTM options (close to ATM - higher chances).\n\n**RISK**: And you, as a seller, are taking a risk of the price going up/down over the weekend. This is one of the reasons, why you may consider closing the close-to-ATM positions before expiration. And it is why close-to-ATM options are still worth 1-5 cents to close just before the end of the last trading day.", "score": 3, "replies": [{"body": "Your explanation is a little complicated.  The reality is that all options will be auto exercised by the OCC if they are ITM (0.01 or more).  The buyer can change that election by contacting the OCC by 530et which allows for some variation to the auto assignment and the creation of pin risk.  But the reality is that you will normally be assigned if the option is ITM and will not be if OTM.", "score": 6, "replies": []}, {"body": "It shouldn’t matter what happens over the weekend what maters is what the price was at the time the market close. The time of expiration", "score": 2, "replies": [{"body": "Just check it: [https://www.investopedia.com/terms/p/pinrisk.asp](https://www.investopedia.com/terms/p/pinrisk.asp)\n\nRisk management for options is a bit more complicated.", "score": 0, "replies": [{"body": "On the Friday of execution the options being exercised must be reported by 12pm", "score": 1, "replies": [{"body": "Much later (it depends on the broker, but the real deadline is close to 4:30pm, if not reported => rules apply).\n\nAnd \"reported to broker\" != \"seller will know it\". There is a 1-day time delay & a random generator in between. :)\n\nAs a result => you will not be able to fully hedge (remove the risk) this position on Friday.", "score": 0, "replies": [{"body": "We’re not talking about a short leg and long leg. We’re talking about two contracts that expired yesterday and one got assigned while the other did not. What happens over the weekend has no bearing on contracts that expired yesterday. Also again they must be reported by midnight. However YOU might not be informed yet they have been reported as the filing paperwork had to be filled/submitted before midnight", "score": 2, "replies": [{"body": "Thank you. :)\n\nJust a little misunderstanding (sorry if my poor English made you think that I am arguing with you :( ).\n\nI am just talking about the hedged position (OP tried to sell 200 shares to hedge the risk). But this \"pinned\" situation left him exposed to the risk of a partial assignment (1 assigned, 1 not assigned) => he is exposed with -100 shares over the weekend.\n\nIt is why I would highly recommend closing \"pinned\" positions if possible.", "score": 0, "replies": []}]}]}, {"body": "I think you mean 12am.  And it’s 12am Saturday morning.", "score": 1, "replies": [{"body": "Yes I meant the 12 am", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not enough cash/margin on your account?", "score": 3, "replies": [{"body": "No plenty of cash available", "score": 2, "replies": [{"body": "Maybe the owner decided to no excercise.", "score": 4, "replies": [{"body": "Ok but then he/she lost 12$", "score": 1, "replies": [{"body": "taxes and fees can be more than $12...", "score": 7, "replies": []}, {"body": "12$ is nothing in comparison imo. Perhaps he didn't have the 100shares of Intel to sell you.", "score": 5, "replies": []}]}]}]}, {"body": "Cash/margin does not affect assignment.", "score": 2, "replies": []}]}, {"body": "A couple weeks ago, I had sold a CSP on WISH @$9. Price dipped below that and I was never assigned. But I've also bought options and seen how even if my strike price is met or slightly exceeded, it isn't profitable to sell the option. Theta decay is probably why you weren't assigned that contract.", "score": 0, "replies": []}, {"body": "As INTC closed at 53.49, assignment was not automatic. Holders would have had to request exercise.", "score": 0, "replies": [{"body": "These were puts, so it would be automatic.  Holders would have to request not to exercise.", "score": 1, "replies": [{"body": "Oops - didn't notice that", "score": 1, "replies": []}]}]}, {"body": "You will probably be assigned at some point today.  Broker A reported X number of contracts to be exercised last night to the clearinghouse, broker B reports at 10 AM on Saturday, broker C might do it early or late.\n\nBasically not all brokers report to the clearinghouse at the same time, I think they have until noon Saturday or something, I believe they can even extend until Tuesday in some cases.  I'm betting at some point this weekend you will be assigned on the other contract.", "score": -3, "replies": [{"body": "Results of exercises/assignments are reported to all firms before midnight Friday by the OCC.", "score": 3, "replies": [{"body": "And they have T+2 to settle.", "score": 0, "replies": [{"body": "Settlement of the stock has nothing to do with this.  Yes, stock settlement is T + 2.  So if you were assigned on Friday, your stock would settle just as if you bought or sold stock on Friday.  This doesn't affect when you can exercise or be assigned on options.  \n\nYou have until until 530 pm et to notify your exercise intent, these results are aggregated by the OCC and your firm is notified of the results before midnight on Friday.  Stock settlement times have nothing to do with this process.", "score": 3, "replies": []}]}, {"body": "Just to prevent confusion, it’s actually 12am Saturday morning (midnight).", "score": 1, "replies": []}]}, {"body": "It says that the option is expired. It probably wouldn’t say anything if it just hasn’t been exercised yet", "score": 1, "replies": [{"body": "That's not true, they have T+2 days to settle a contract.", "score": 1, "replies": [{"body": "I think the point is that the decision to assign or not is not affected by t+2.  That is just the time allowed to settle whatever the assignment decision is.", "score": 1, "replies": []}]}]}]}, {"body": "Assignment is random...somebody that was holding one 53.5 put exercised.", "score": 1, "replies": [{"body": "The decision of which buyer and seller go together is random.  Whether the option is auto assigned is not.  ITM is auto assigned and OTM is not with the buyer able to override.", "score": 2, "replies": []}]}, {"body": "“To ensure fairness in the distribution of equity and index option assignments, OCC utilizes a random procedure to assign exercise notices to clearing member accounts maintained with OCC. The assigned firm must then use an exchange-approved method (usually a random process or the first-in, first-out method) to allocate notices to its accounts that are short the options.”\n\nhttps://www.optionseducation.org/referencelibrary/faq/options-assignment", "score": 1, "replies": []}]}
{"title": "Ray Dalio Principles of Navigating Big Debt Crises Book Summary Part 1", "selftext": "# **Ray Dalio**\n\n# **Principles of Navigating Big Debt Crises**\n\n-\tPolicy makers have 4 levers to pull when dealing with debt\n  - Austerity\n  - Debt defaults/Restructurings\n  - Central Bank printing money &quot;QE&quot;\n  - Transfers of money and credit\n-\tThe first 2 are deflationary and the latter 2 are inflationary. Which levers the policy makers pull determine who benefits and who suffers. This process is painful for everyone\n-\t**Template of a debt crisis**\n-\tTypically occur because debt and debt service costs rise faster than the incomes needed to service that debt\n  - Usually, a central bank can alleviate typical debt crises by lowering interest rates, but severe crises occur when that is no longer possible. IE - 0% interest rates\n  - Classically, a lot of short-term debt cycles leads to a long-term debt cycle.\n-\tLong term debt cycles are just bigger versions of short-term debt cycles\n-\tDuring the upswing, credit is freely available and people are willing to take on more risk\n-\tCredit is cut during a crisis. Asset prices fall, debtors have trouble servicing debt, investors get scared and cautious which leads to liquidity problems\n-\tDeflationary Depressions – typically occur in countries where most of the debt is financed by the local currency\n-\tInflationary Depressions – typically occur in countries where most of the debt is financed by foreign currency\n-\tPositive effects of debt cycles come first; negative come later\n-\tTypically, the worst debt bubbles are not accompanied by high and rising inflation, but by asset price inflation financed by debt growth\n  - This is because policymakers make the mistake of accommodating debt growth because they are focused on inflation and/or growth, not on debt growth itself, the asset inflations they are producing, and whether or not debts will be able to be serviced\n-\tIt is the tightening of monetary policy that usually pops a bubble\n-\tNo specific event or shock caused the stock market bubble to burst in 1929\n-\tDuring a severe economic downturn, protectionist/populist policies begin to rise and outrage over the governments role in &quot;bailing out&quot; financial institutions\n-\tOnce policymakers shift their attention to increasing financial regulation and oversight, that typically signals the of the big debt cycle\n-\tIt is typically the case that the first tightening or policy does not hurt stocks and the economy\n-\tBy 1937, all currencies had all devalued a lot against Gold, but not so much against each other\n-\tGold bullion is the only asset that has no counterparty risk\n\n# **Classic Deflationary Debt Cycle**\n\n-\tEarly – Debt is not growing faster than incomes. Debt is financing activities that produce growth. Known as &quot;Goldilocks&quot; period\n-\tBubble – Debt is rising faster than incomes and this produces strong asset returns and growth. This process is generally self-reinforcing because it allows people to borrow more. This can go on for decades. These are short term cycles but lots of them adding up can lead to a long-term debt cycle\n  - Usually start from Bull markets. Lower interest rates drive asset prices higher, which leads to economic growth and the ability to take on more debt\n  - Lending standards are reduced as people and business lever up\n  - Lenders and speculators make lots of fast/easy money which reinforces the bubble\n  - As a bubble nears the top of the cycle, the economy is the most vulnerable, but people are feeling the wealthiest and the most bullish\n  - The Boom encourages new speculators into the market further driving up prices\n  - Humans by nature tend to move in crowds and weight recent experiences more heavily. This causes people to extrapolate too much from the recent past in both up and down markets\n  - Central banks usually target inflation or inflation/growth and don&#39;t target the management of bubbles, the debt growth they enable can go on to finance the creation of bubbles. And the bursting of bubbles can cause severe economic pain\n  - Don&#39;t only look at one metric to serve as an indicator of a debt crisis\n  - Monetary policy, in many cases, helps inflate the bubble rather than constrain it\n    - How to Spot a Bubble\n      - Prices are high relative to traditional measures\n      - Broad bullish sentiment\n      - Purchases are financed by high leverage\n      - New buyers enter the market\n      - Buyers make very forward purchases to speculate or protect themselves from future price gains\n      - Stimulative monetary policy reinflates the bubble and tight monetary policy contributes to its popping\n-\tThe Top – prices have been driven by a lot of leveraged buying and the market gets fully long, leveraged, and overpriced, it becomes rip for reversal\n  - Most often occurs when the central bank starts to tighten and interest rates rise for whatever reason\n  - This causes a debt service squeeze and hurts asset prices. Which reduces the amount of money lenders are willing to lend out as they become cautious\n  - Investors move from risk assets to less risky assets slowing down growth\n  - A negative &quot;wealth effect&quot; occurs when one&#39;s wealth declines, which leads to less lending and spending. This is due to both negative psychology and financial condition\n  - Yield curve is usually flat or inverted\n    - People are incentivized to move into cash just before the crash which itself slows down lending\n  - Unemployment is low\n  - The more leverage that exists and the higher the prices, the less tightening it takes to prick the bubble and the bigger the bust that follows\n    - Immediate post bubble period\n    - People mistakenly judge the decline to be a buying opportunity and find &quot;cheap&quot; stocks failing to see that earning are likely to decline much more. They extrapolate too much from the recent past\n    - Wealth falls first and incomes fall later, creditworthiness worsens, which constricts lending activity, this hurt spending and lowers investments and makes borrowing more difficult\n    - As asset prices fall, the lenders tighten lending standards which hurts spending and investment\n    - This causes people to sell investments to raise cash which causes more driving down of prices and is a self-reinforcing cycle\n-\tThe &quot;Depression&quot;\n  - In a normal recession, cutting interest rates can stimulate the economy. But in a depression, rates can&#39;t be cut because they are already at 0%\n  - The central banks have to go to alternative ways to stimulate the economy. IE – &quot;QE&quot; or printing money or stimulus\n  - Declines of 50% of people&#39;s assets are common\n  - As the depression begins, defaults and restructurings hit the various people. Especially leveraged ones (Banks)\n  - Runs on banks are common\n  - At this stage of the cycle, debt defaults and austerity dominate which are deflationary\n  - People financial condition worsens, which makes lenders more reluctant to loan money. Which slows down the economy\n  - Usually, institutions and policymakers have learned from the past, but not every depression is the same as before and this catches them off guard. It doesn&#39;t tend to play out like the last one that they are defending against\n  - If the central bank prints money to alleviate the credit shortage, it can cause inflation if not careful\n  - A big part of this deleveraging process is that people discover that much of what they thought they of as wealth was simply other people promises to give them money. And now those promises are not being kept and that wealth isn&#39;t real\n  - Fear cascades through the system, and these fears feed on themselves and lead to a scramble for cash that results in a shortage (investors sell assets)\n  - The depression phase is dominated by deflationary forces of debt reduction\n  - The investor class experiences a tremendous loss of &quot;real&quot; wealth, and as a result, they become extremely defensive, they seek safety in liquid investments like bonds, gold or cash\n  - The 4 options policymakers have for dealing with the depression\n    - They are typically slow to react initially because they don&#39;t want to bail out the people who got themselves into problems\n    - Austerity – Usually the most obvious thing to do. But it doesn&#39;t bring the debt and income into balance. Government revenues fall and demands for government services rise which cause deficits to rise and subsequent rise in taxes. All this is bad\n    - &quot;QE&quot; or Printing Money – The moves come in progressively larger doses as more modest initial attempts to rectify the imbalances fail. However, those early efforts typically produce bear market rallies\n    - Debt defaults/Restructurings – You have to clean out the bad debt so the flow of money can continue to return to prosperity.\n    - Redistribute the Wealth – Wealth gaps increase during bubbles and they become glaring during the hard times. Political populism tends to take hold after this time period. Taxes on the rich become common talking points. Central bank purchases of assets disproportionally help the rich\n    - Stocks usually fall 50%\n    - Currency devaluation will usually be 50% against gold\n    - Deficits widen to 6% of GDP\n    - Economic activity falls about 10%\n    - Unemployment is 10-15%\n    - Aggressive stimulation usually occurs about 2-3 years into a depression\n-\tThe &quot;Beautiful Deleveraging&quot;\n  - Happens when the policymakers move the 4 levers in a balanced way\n  - Printing money during this phase doesn&#39;t necessarily cause inflation. It won&#39;t if its offsets falling credit and the deflationary forces. If income is growing faster than debt, you will be ok. However, if debt is growing faster than income, you can have a problem.\n  - But central bankers can abuse the stimulative policy&#39;s and cause a &quot;ugly inflationary deleveraging&quot; IE – Weimer Germany in the 1920&#39;s\n  - Printing money and debt monetization/government guarantees are inevitable in depressions in which interest rate cuts won&#39;t work (IE – Already at 0%)\n  - All the deleveraging eventually led to big waves of money creation, fiscal deficits, and currency devaluations (against gold, commodities, and stocks)\n  - In the end, policy makers always print money because it is the easiest\n    - Austerity causes more pain than benefit\n    - Big restructuring wipes out too much wealth too fast\n    - Redistributing of sufficient size doesn&#39;t happen without a revolution\n-\tPushing on a string phase\n  - Late in the cycle, the policy makers have to be careful because their stimulative policies effects have diminished.\n  - Economy usually enters a low growth and low return of assets\n  - The danger of this phase is that too much money printing and subsequent devaluation can cause a &quot;ugly inflationary deleveraging&quot; to occur\n    - Monetary Policy 1\n      - Usually try to lower interest rates first. If that doesn&#39;t work, they go to 2\n    - Monetary Policy 2\n      - &quot;QE&quot; or printing money and buying financial assets. But over time, QE&#39;s ability to stimulate the market is reduced as asset prices are high and risk premiums are low. IE – investors don&#39;t want to buy expensive assets that are projected to have low returns. Investors move into cash for protection which makes further QE less and less effective\n      - Sometimes at this phase, policy makers monetize debt in even larger quantities in an attempt to compensate for QE reduced effectiveness. This may provide a short-term boost but there is a real risk that prolonged monetization will lead people to question the currency&#39;s suitability as a store of value. This can cause investors to rush to safe havens like Gold\n      - At some point, low interest rates and low premiums on risk assets from monetary policy 2 don&#39;t work anymore and policy makers look to Monetary Policy 3 to stimulate the economy\n    - Monetary Policy 3 – Where the US is at in 2020\n      - Puts money directly into the hands of spenders instead of investors/savers and incentivizes them to spend it\n      - Government provides direct or indirect stimulus payments in many different forms\n-\tNormalization\n  - System gets back to normal. But this usually takes 5-10 years and economic activity is slow during this time frame. And it takes investors a very long time to get comfortable taking the risk of holding equities again\n\n# **Inflationary Depression**\n\n-\tReserve currency countries that don&#39;t have significant foreign currency debt can have inflationary depressions, they usually emerge more slowly and later in the process, after sustained and repeated overuse of stimulus to reverse a deflationary deleveraging.\n-\tIf a reserve-currency country permits much higher inflation in order to keep growth stronger by printing lots of money, it can further undermine demand for the currency, erode its reserve currency status (IE make investors view it less as a store of wealth) and turn its deleveraging into an inflationary one", "id": "p3yu4r", "created_utc": 1628904965.0, "score": 32, "upvote_ratio": 0.86, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|6 months ago\n**Total Comments**|56|**Previous DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "nice blog, too bad i can't fucking read", "score": 17, "replies": [{"body": "No idea what it says but saved cause long", "score": 5, "replies": []}]}, {"body": "Wait is this a summary or an entire chapter?", "score": 10, "replies": []}, {"body": "A helpful guide in the training of the mentally retarded... Sir please give us meme tickers", "score": 4, "replies": [{"body": "The biggest YOLO play I can think of that I believe has a decent chance of success would be buying options on SILJ.  That is a silver exploration ETF so it is a leveraged play on the price of silver(probably moves 2-3x the price of silver).  I don’t do it so take what I say with a grain of salt.  Ray Dalio has a “all weather” portfolio you could check out for a base AA.  But I am not sure WSB would like it.", "score": 1, "replies": []}]}, {"body": "Ray Dalio is a cocksucker who buys low sells high than makes it seem more complex to stroke his ego.", "score": 9, "replies": [{"body": "abundant thought shocking society flag gullible grab skirt judicious tie", "score": 2, "replies": []}, {"body": "I'm surprised Dalio took Secretary Xi's and the CCP's cocks out of his mouth long enough to sit down and write that.", "score": 2, "replies": []}]}, {"body": "“Beautiful Deleveraging” - Dalio is an idiot.\n\nHe must be rich by being a good salesmen, attracting investors and charging high fees. Because he cant have gotten rich on being good at macro based on that nonsense", "score": 3, "replies": [{"body": "Explain why a gradual/responsible reduction of levels of debt in the system is idiotic, or rather, what makes Dalit idiotic for theorizing about it.", "score": 3, "replies": []}, {"body": "Look up Bridgewater moron", "score": 1, "replies": [{"body": "Yeah big underperformance", "score": 1, "replies": []}]}]}, {"body": "Where are the rockets? Ape not happy", "score": 3, "replies": [{"body": "🚀 🚀 🚀", "score": 1, "replies": []}]}, {"body": "Is this the summary.or the actual book I know Dalio love his bullet points and all.", "score": 2, "replies": []}, {"body": "This reads like my class notes in college.", "score": 1, "replies": [{"body": "You took notes?", "score": 2, "replies": [{"body": "ROFL", "score": 1, "replies": []}]}]}, {"body": "Can anyone give me a ELIR summary of this summary?", "score": 1, "replies": [{"body": "Crisis = bad\n\nAssets price = falls\n\nRecovery = long", "score": 4, "replies": [{"body": "No wonder Dalio lost so much money during the pandemic\n\nInverse that advice", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "The last big debt crisis was triggered by the GFC black swan\n\nThe current debt crisis was triggered by the pandemic\n\nDebt crises are inseparable from the black swans that cause them", "score": 1, "replies": []}]}]}]}]}, {"body": "I actually enjoyed reading dalios books(principles and big debt crisis) but the guy is a classic ccp shill.", "score": 1, "replies": []}, {"body": "Tldr- buy AMC at the open?", "score": 1, "replies": []}, {"body": "Too smart for most here, but I love you for this.", "score": 1, "replies": []}]}
{"title": "need advice on taking a loan for tsla investment", "selftext": "[removed]", "id": "p4e9ms", "created_utc": 1628968750.0, "score": 0, "upvote_ratio": 0.2, "num_comments": 32, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|6 months ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|6 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Don't take out a loan to buy stocks. Ever.\n\nHow on earth would you get approved for a loan if you don't have a salary anyway?", "score": 9, "replies": [{"body": "What's the difference in your mind between having debt while investing?  Let's say I have $5k but need a car, I find a car for that much, I can finance it @ 2.75% and invest the 5k, or I can pay cash, which do you do?  What if you have credit card debt also?  Isn't the extension of your statement that nobody should invest until they are debt free? As any investment is being financed by the already existing debt?", "score": 3, "replies": [{"body": "If you get a loan to buy a car, you still have the tangable asset that is a car. If you default on the loan, you can just sell the car to recoup most of the money.\n\nGetting a loan to invest in stocks is a bad move imo becuase the value if what you're buying (i.e. the shares themselves) can massivly devalue without warning. Then you're fucked becuase you still have to repay the loan.\n\nEven if you invested it into something safe, if the market crashed tomorrow you'd be fucked even though you took a safe bet.\n\nNot saying you should be debt free to invest, but don't take on additional or new debt to then trade with, it's such a dangerous game.", "score": 1, "replies": [{"body": "Yeah in my case I will most likely still be able to pay the loan unless I lose 100% of my diversified portfolio which will most likely not happen and even If I don't have enough to pay the 30-40k I can always find an IT job because I can code and make the remaining money back in less than 5 years.. to me I'ts worth the risk.", "score": 1, "replies": []}]}]}]}, {"body": "OR borrow the money and in 7-10 years be broke and in debt. It’s a bold strategy, Cotton. Let’s see if it pays off. \n\nYou’re truly retarded if you do this.", "score": 6, "replies": [{"body": "It's theoretically possible but I don't believe this will happen.", "score": 1, "replies": []}]}, {"body": "Dumb", "score": 3, "replies": []}, {"body": "Only a Czech person can be this dumb, sincerely", "score": 3, "replies": [{"body": "It's not dumb It's risky. Tell me what is dumb about it? :d If you about to tell me tsla is overvalued because they are just a car maker then I don't need your answer.", "score": 0, "replies": []}]}, {"body": "I can give you a loan. I just need a security deposit to my offshore account to ensure that you serious. ![gif](emote|free_emotes_pack|money_face)", "score": 2, "replies": []}, {"body": "You don’t work yet you have 500k in assets?", "score": 2, "replies": [{"body": "I inherited some cash then traded it and invested", "score": 1, "replies": []}]}, {"body": "Put all of the 500k in gme then in 2 months you will just enough to buy a tesla.", "score": 2, "replies": []}, {"body": "Recommend you talk to your local mafia.", "score": 2, "replies": [{"body": "Haha not that funny actually", "score": 1, "replies": []}]}, {"body": "Uh good luck getting a loan with no salary.", "score": 1, "replies": []}, {"body": "You do you. No financial advice.", "score": 1, "replies": []}, {"body": "Here’s the advice. DONT. \n\nYes “retarded” is thrown around this sub generously, but don’t actually do something dumb enough to make the name an accurate description of yourself.", "score": 1, "replies": [{"body": "I said I knew the risks  \".\"", "score": 1, "replies": [{"body": "Still didn’t know it well enough if you had to ask for advice on the subject", "score": 1, "replies": []}]}]}, {"body": "I’m not trying to beat a dead horse here, but based on my own personal DD- if you’re gonna take out a loan to yolo- ornamental gourd futures are gonna be you’re safest bet for a ten bagger. Pumpkin seed oil is an up and coming culinary trend on R/tiktokculinary and demand typically peaks around January. The only way you’re gonna get that kind of return from TSLA is if the Logan Paul / Elon Musk cage fight happens.", "score": 1, "replies": []}, {"body": "Don’t do it, don’t become a ape", "score": 1, "replies": []}, {"body": "Don’t understand the problem. If you own 500K in assets, banks will be happy to offer you a loan for much more than 30-50K if you grant them access to a part of your assets as security. If you already own stocks you can receive a security - based loan. The same in form of a mortgage if your property is real estate.", "score": 1, "replies": [{"body": "I thought about it for a second but I wasn't sure If they would accept assets that could easily lose all their value as collateral. I'll look into it", "score": 1, "replies": [{"body": "If you offer stocks as collateral, it will work until their value goes down significantly. But if you offer 100 K stocks as collateral for a 50 K loan, they would have to lose 50% until you come in trouble.", "score": 1, "replies": []}]}]}, {"body": "No education, no regular income, wanna borrow some cash...sounds like a solid plan dude 👍", "score": 1, "replies": []}, {"body": "Tell you what. You transfer your TSLA shares into my name. I will hold them as collateral, I will loan you the cash you need and you pay me 35% of any and all gains that TSLA may accrue as is it being held in my account. After which you must pay me 10k annually until the loan is paid back.", "score": 1, "replies": []}, {"body": "Lombard credit should work for you. I can take up to 40% credit on the stocks in my portfolio.\n\nThis should be available at your broker.\n\nPlease dont tell me you have no broker and own only printed paper stocks.", "score": 1, "replies": []}, {"body": "Okay so you don’t want me to tell you how restarted this is or anything about the risks, fine. \n\nHere’s what i can tell you besides all that:", "score": 1, "replies": []}]}
