{"title": "AMD - no signs of stopping", "selftext": "[deleted]", "id": "ov2f3p", "created_utc": 1627713963.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 30, "comments": [{"body": "On the one hand I like the confirmation bias, because I've been gathering AMD stock in my portfolio for over a year now.\n\nOn the other hand this feels like a low effort post with no real purpose aside from (maybe) promoting a stock?", "score": 37, "replies": [{"body": "I just know a lot of people getting into stocks aren’t exploring a lot outside of the big famous stocks, or stocks than can maybe make them loads quick\n\njust wanted to let some people know about a good stock they be of missed! - don’t think a reddit post is gonna make a huge dent in the value lol", "score": -9, "replies": [{"body": "No it made a dent in my brain cell count", "score": 5, "replies": [{"body": "I think I’m a bit lost I assumed this was just a subreddit for stock advice and chat - have I made some horrible faux pas?", "score": 0, "replies": [{"body": "It’s just such a low quality post with no real substance, clearly you’re new to investing but usually you don’t advise people to “join the AMD” train when it goes vertical to ATH", "score": 2, "replies": []}]}]}]}]}, {"body": "Nothing screams \"run away\" from AMD like this post lol", "score": 29, "replies": []}, {"body": "Love seeing all these posts and comments about AMD after it moons. Hot take on a stock after it breaks out of its channel and starts mooning. where were you when it hit $75/share 3 times this year?", "score": 13, "replies": []}, {"body": "I regret not going all in like.my.gut said i should when it was a buck and change a share.\n\nI agree, its looking like AMD has the right research and development cadence to continue to be a leader in the chip space.", "score": 11, "replies": [{"body": "Right! I was told to go all in about two years ago and just didn’t follow through - put a little over a grand in a few months ago though so I been getting nice returns now\n\nJust feel like I never see it mentioned popularly despite it’s crazy good performance!", "score": -1, "replies": [{"body": "To be frank though, if someone tells you to go all-in on any single stock, you probably shouldn’t listen to that person.", "score": 3, "replies": [{"body": "Yeah I never do! But if I had I’d be in 6 figures now lmao", "score": 2, "replies": []}]}]}]}, {"body": "If its good enough to happy-post about on reddit, its good enough to sell\n\nPosts like these usually mark the (temporary) top", "score": 13, "replies": []}, {"body": "Any DD that’s main focus is “already had mad gains” is totally trustworthy lol", "score": 3, "replies": []}, {"body": "amd is a beast of a company", "score": 2, "replies": []}, {"body": "This post makes me glad I started selling covered calls yesterday", "score": 2, "replies": []}, {"body": "I’m in AMD at around $77 (Canadian). It’s a great long term cash cow.", "score": 2, "replies": [{"body": "I bought in bout the same time!", "score": 2, "replies": []}]}, {"body": "It’s all priced in and more", "score": 1, "replies": [{"body": "People said Ryzen 7nm was priced in at $13.", "score": 2, "replies": [{"body": "people who say AMD is “priced in” need to look at charts of AMD vs INTC’s market share. AMD’s market share is going straight up and INTC’s is headed straight down. This trend is showing not signs of slowing, why do people think INTC will figure it’s issues out overnight? It’s going to get way worse for INTC before it gets better. I can’t believe people are STILL doubting AMD here.", "score": 5, "replies": [{"body": "Oh, I don’t doubt AMD at all. It’s just not currently at a buy price for me. Price matters.", "score": 2, "replies": []}, {"body": "Is there a lot of AMD doubt in this group? I’ve been surprised by how downvoted I’ve got a lot in this thread I just meant to share a stock tip I thought people might like aye \n\nNever used this subreddit before so feeling quite confused", "score": 1, "replies": []}]}]}, {"body": "I’ve thought that plenty of times the last couple years but it seems like it just keeps growing - so I hope you wrong!", "score": 1, "replies": [{"body": "There were multiple dips where you could have made dough. Probably another one in the near future. I’d wait for it", "score": 1, "replies": []}]}]}, {"body": "Ah yes, the price has gone up, making it a sure thing, rather than a riskier investment with lower potential returns.\n\nNot saying that someone buying it today cant make money, but your view is rather naive", "score": 0, "replies": []}, {"body": "Their*", "score": 0, "replies": [{"body": "is that a joke?", "score": 2, "replies": [{"body": ";)", "score": 1, "replies": []}]}]}, {"body": "The case for all semis, I think.", "score": 1, "replies": []}, {"body": "AMD really turned their game around for sure. A couple years ago I wouldn't even had looked at them.", "score": 1, "replies": []}]}
{"title": "When to wheel SPY vs another stock", "selftext": "[deleted]", "id": "ovc42h", "created_utc": 1627755441.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 15, "comments": [{"body": "Stocks carry bigger risk and better premiums.", "score": 12, "replies": [{"body": "Right. Just to put it in my words, stock can lose 50% or gain 50% overnight. Much more difficult for SPY.", "score": 2, "replies": [{"body": "You're both correct. SPY doesn't have drastic swings nor high premiums.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "See all of these setups require a context. Also nothing is free in life. If you find a less volatile instrument, you will find it had less premiums and as a result your risk is still at similar levels. You sell Tesla puts you make a few hundred bucks a week, you sell SPY you make much lesser but when you multiply by amount risked and the odds of such a risk, you will find the difference reduces significantly. Does not go away, just reduces.\n\nSo the advantage, the edge, comes from what all you can do after you place the trade. Entry is definitely part of risk management but a lot comes after the trade has been opened. Do you have rules? Is there an exit criteria. Are adjustments well defined or well experienced. And so on.", "score": 3, "replies": []}, {"body": "Not exactly, the issue is that SPY currently has low IV.\n\nTake a look at the greeks for SPY. Vega is often several times that of theta. So even a small change in IV can have a large impact on the price, specifically because it doesn't generally move that much. Relative values matter quite a bit.\n\nAfter trading SPY for a while, it seems like tends to be better for delta plays in my option, long term or short term. See r/OptionsMillionaire for some examples (that subreddit focuses on trading SPY), but basically the idea is that you are looking to profit from price movement.\n\nThe theta gains on spy is often quite low as well, so not really worth it.\n\nRight now I'm running LEAP bull spreads on SPY via ATM/OTM options (roughly requiring a 10% increase in SPY price between now and then) dated 1 year plus (I aim to build up a solid SPY position over time by adding more spreads over time, using this as a form of DCA). Then offsetting the negatively theta that with theta positive bullish spreads on TSLA (for which for at least I have a much larger position in). For both I do keep a small amount of stock (targeting around 20-40% of the delta in stock).", "score": 2, "replies": []}]}]}]}]}, {"body": "Selling options is fantastic in bull markets, but if you’re on undefined risk it can go South fast.  \n\nIt’s just all about your risk tolerance. Can you watch a 100% loss in a day and shrug? If so, pick some stocks ya like and do it! If not, SPY doesn’t do that too often, and some safer stocks don’t either. \n\nJust a side note, proper hedging is expensive. There’s a reason most don’t do it properly. For the most part you’re not going to come out ahead unless you’re looking at a risk-adjusted return, which you should be. Unless you’re looking to hedge against a specific thing, and hedging for a black swan is near impossible.  Also a hedge SHOULD burn cash for the majority of the time. So are you okay with just letting it burn? At least in my limited knowledge/experience.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If your hedge makes money, that’d be incredible. But then it’s also likely not a hedge.  In your example of the wheel, the saying it works until it doesn’t is the go to. If you sell a put, and then the stock drops with the market, you’re still losing. \n\nIf you’re doing that, what happens if the stock crashes? Market crashes, you’re now forced to either recognize the loss on a put you sold, or buy 100 shares of an 80$ company for 100$.  The other option is you currently have 100 shares, bought at 100$, that’s worth 80$, and sure your call that you sold printed. But you’re still down unless you sold a 1 delta, or multiple calls. \n\nYour cash won’t burn if you’re selling options, but then you’re exposed to the exact thing you’re trying to hedge against, a market drop 1-2 standard deviation event. \n\nAs a general rule of thumb, if you’re selling options, you’re exposed to a 1-2 standard deviation event. If you’re buying them, you’re exposed to the gain of that same event. If you limit it, and do a defined risk trade it can help a lot. \n\nI hope that helps some. I don’t think there’s anything wrong with the wheel, I just think the risks are understated, it works well in a bull market.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think we might have different ideas of what a hedge is. To me a hedge is something that consistently loses money, and once that 1-2 standard deviation event hits, it’s a 1000% type gain. \n\nWhat you’re saying about having that risk regardless, you’re right. That’s what most people try and hedge against. \n\nSpreads are good cause they’re not very capital intensive.  I’ll trade 10 contracts over 1 contract for the same type of thing, but that’s just me. \n\nTrading VIX options is something that I’ve done my best to become familiar with, but in all honesty they just boggle my mind. The option is like 3x removed/away from the underlying, which in itself is a derivative. If you have any insight on how those actually operate I’d love to hear it. \n\nYeah I prefer it that way, it just makes it easier for me. I also like to stress test what my portfolio would look like on TOS, see how correlated everything is ect. But if you’re comfortable being exposed to that risk, that’s totally fine, but in my head/my definition of a hedge, that wouldn’t be one. \n\nOn your last point, I think that’s a great idea. I think when you’re starting in options learning one strategy that’s a kind of base is key. But I’ll say that learning other strategies/when to use them has been a massive advantage. At least having one directional up bet, one volatility up or down, and one for a directional down. You can build pretty much anything on that. I use the TOS risk profile for it all. \n\nAgreed! You’ve really helped me put into words my thoughts, and offered fantastic alternatives/different way of thinking on things. Thanks for that!", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That makes much more sense now. My apologies for that misunderstanding. In that case you may like unbalanced iron condors, they’ll limit downside risk some and you can jack up the profit side, or butterflies same type of thing. Just some ideas that you didn’t ask for lol. \n\nYeah from my understanding it’s the vix futures as the underlying, of the…? I’m not sure. So you have the futures derivates, and then the option which is a derivative. And I’m not sure what the base product is. Selling options is great in my experience. It helps to think about who is buying the option, and what they’re buying it for. I’ll sell to people looking to hedge all day, for the risk of the one off. \n\nTotally get that. It was very overwhelming at first to me. I don’t use the web app I only use the desktop version. I love it now. I’ve got it set up all how I like it, and it shows me more than I could ever want. \n\nI think it appeals because you have fewer moving parts. At least that’s what appealed to me. That and that with the puts, the worst you end up with is a company stock you like. As long as you’re comfortable with the company it’s a great strategy. \n\nOf course! This has been my second day commenting on here, has been a joy! I love talking about this stuff, and so few people enjoy it/have opinions ect on it. So it’s a great time to me.", "score": 1, "replies": [{"body": "Believe the VIX itself is an aggregate index of the Implied Volatility of SPX options (used to be ATM, but now a bigger aggregate I think).\n\nThen it’s packaged as futures contracts.\n\nThen the VIX options are on those futures contracts.\n\nSo VIX options are options on a futures contract on an aggregate of the IV of options on an index.  ;) a derivative of a derivative of a derivative of an index.  ;)\n\nBut the real rub to keep in mind is that the out-months of options are tied to the given futures contract, not spot VIX.  So you can only do so much buying long-dated VIX calls, as if there is a spike - everyone knows VIX is mean-reverting, so long-dated contracts may not see as big a big pump.\n\nI had previously done the OptionAlpha 4MTE VIX call cascade at ~10delta as more of a black swan hedge, but I’ve recently been playing with ATM or very near the money VIX call spreads as my hedge, at least on my SPX-based plays, to insure better against a moderate sell off - eg a 5% or 10% drop over a few days.  The spread also giving me a good “max profit trigger” to close it on, vs an open-ended call.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Glad it’s helpful- but for full disclosure, “I am not a professional” - just a hobbyist trader that has dabbled in an out of options over the years.\n\nWhat I mean by the “trigger” is this: knowing when to close the hedge.\n\nE.g. If you were just long 40 VIX calls, and it spiked to 50 - do you take profit there on that bloody day (and thereby removing any further hedge)?  Or wait for more?  “Etc”.  The exit plan can be tougher to decide and act on.  Please believe, even if you are makin’ money hand-over-fist in paper-value from your hedge - a day where VIX goes from 20 to 50 will be an emotional one.  ;)  So I want to have a clear exit trigger.\n\nSo the strategy I am trying to hedge to begin with (a newer one for me) is selling 4-5DTE 10delta $40-wide SPX spreads.  I put on a Weds 8/4 on Friday - with SPX at 4395, that was a 4300/4260 spread, and will be closing/rolling tomorrow (2DTE).  So the short strike about 2.1% OTM and the long (max loss) at 3%.  If tested - if market gets within 1% of my short - roll down & out.\n\nHowever, while a 3%+ overnight gap-down is reasonably rare, it’s not unheard of at all.  I’d then be largely stuck with max loss.\n\nSo I am working toward buying near-ATM VIX debit Call spreads - 18/37.5 - at ~9-10 weeks out, and rolling the expiring front-month at ~7-14DTE out to the ~9-10 weeks expiry to offset the monthly hedge carry cost, but such as to always have 2 nearer-term expiries on.  Figuring if SPX drops 3% or more before I can do a defensive roll - those should start to offset my nearing-max-loss on the SPX spread.\n\nThis article suggests a 15:1 SPX_drop:VIX_spike ratio - so (4395-4260) 135 SPX drop should theoretically send VIX up 9 points (135/15):\n\nhttp://tastytradenetwork.squarespace.com/tt/blog/the-relationship-between-the-spx-and-vix\n\nSo that’s one exit trigger - achieving max loss on what I’m hedging - “close-out, close the hedge, start again after things settle down”.\n\nBut what if the drop is slow enough that I can do my defensive roll and “stay in the game”?  My hedge is then increasing in value, but I want to keep it on - how far do I let it run?\n\nFor me - once it hits my short VIX spread strike at 37.5 - “close out time”.  The odds of its value increasing significantly from there are then dependent on it being very close to expiry and further time decay - but too much longer and it likely reverts.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I don’t have them handy, but the TastyTrade gang strongly believes this.  They even question mean reversion of the stock price, but have strong convictions about IV and VIX mean-reversion over time.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nope - they hang it all out there for free - great resource: https://www.tastytrade.com\n\nhttps://www.tastytrade.com/definitions/mean-reversion-contrarian", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I use PMCCs and wheel SPY, QQQ, and IWM with about 75k each split between 600+ day calls and stocks. I did individual tickers for a while which was good in the sense that they were much less correlated and I could manage it differently every day, but it stressed me to manage it and allocate to company A vs company B etc etc. If you look up the SPY and QQQ components you'll quickly find holding the top 10 of them is essentially the equivalent of owning the etf itself, but still I use them because they are liquid and always have multiple weeklies. I keep my gambling pot that I used to grow the account for otm SPX credit spreads and plow those winnings back into the three underlyings pretty reliably. Hard part is when you have calls against your leaps get far under water but still want to hold. I've had to close a few and roll many others more than 5 times when markets decided to go up up up all year. At the money wheel 100% underperformed buy and hold this year, no question. But I use it to take profit and generate a synthetic dividend essentially so the strategy did what I wanted it to. Wheel and other selling strategies are essentially yield plays after all. Just stay the course on what you pick for long enough for it to go through a few cycles (ups and downs).", "score": 3, "replies": []}]}
