{"title": "Is there any real edge in actively trading unless you work for a large institution?", "selftext": "So I wanted to post this because I was having a conversation with a friend of my dad's the other day. He is an older gentleman and he talks all the time about how he trades the market, reads the paper, etc., and trades based on what he sees. \n\nI asked him \"what is your edge that allows you to generate above-average returns?\" and his reply was \"well I'll take a look to see what is going on with the stock and based on what I see I will trade-off of it. So for example, if Tesla was in the news and has been hot lately, I will look at the chart and maybe put a position on based on the sentiment of where I think the stock is going.\"\n\nI made the argument to him that, that is not an edge and all you are doing is no different than gambling and justifying your trades based on a false assumption that you know something the market doesn't. Everything you are looking at is already priced in, and in the long run, there is no edge to this type of trading. \n\nAm a wrong for thinking this? The reason I ask is because back when I graduated high school, I got sucked into the world of active trading and thinking you could generate above-average returns. However, after years of research and real experience, I find that indexing with a long-term horizon is the best option for both tax purposes and sanity of mind. I don't really think anybody can successfully time the market. \n\nI would appreciate it if somebody with more experience than I do can comment on this and point me in the right direction, or if I am thinking about this the right way. However, it would seem to me that the only real statistical edge you can find in a competitive market would be by working at a large institution to have the resources to discover such opportunities. \n\nThanks!", "id": "orcwth", "created_utc": 1627224560.0, "score": 8, "upvote_ratio": 0.66, "num_comments": 34, "comments": [{"body": "Is he consistently beating the market over time?  I’ve known a few people that seem to beat it but maybe they’re just lucky.", "score": 8, "replies": [{"body": "I know several guys that have beaten the market every single year without fail over long periods of time, think 15+ years. They are not at an institution. They are not lucky.", "score": 5, "replies": []}, {"body": "I didn't ask, but even if I did ask I doubt he would have the real answer to that with actual figures.", "score": 1, "replies": []}]}, {"body": "If it wasn't Tesla, I think he would have got burned", "score": 5, "replies": [{"body": "Im using tesla as an example, but he talks about all this to my dad and I try and explain to my dad that just because somebody makes a good trade or makes some money, doesn't necessarily mean that he has an edge.", "score": 2, "replies": [{"body": "Yeah it may have worked during 2020 but that doesn't make it a sound strategy. You're definitely right he has no edge", "score": 3, "replies": []}]}]}, {"body": "I think you need to be clear on the distinction between active management of a long term portfolio in which the goal is long term growth, versus day trading in which the goal is present income (so I don’t have to work a 9-5 in my case). In the case of present income, the standard industry assumed safe withdrawal rate is 4% a year from SP500 index funds. If I have $50k this means I can safely withdraw $2k. Now if I use that $50k to day trade, I get day trader leverage (4 to 1), so everyday I have $200k in buying power, this means even if I average through the year a 1% return to my buying power I have matched the industry standard for income withdrawal off of a 50k portfolio. This isn’t quite true as one would have to adjust a little bit for the tax benefits of long term gains versus income but understand it’s not impossible to figure out how a day trader can generate more present income than the industry standard withdrawal rate. Not to mention some day traders will do this with less risk than the SP500 because they return to cash every night (a lot of day traders I talk to day trade in order to wake up with a large amount of cash every morning and still earn a nice return on it). \n\nNow actively managing a portfolio for long term growth is another beast entirely. People do beat the market, if they do it consistently they likely are employing some type of leverage (like options etc), but it is extremely difficult to do in the long run especially if you are so active you negate the benefit of long term capital gains tax. That doesn’t mean people can’t have an edge over the market though, especially if they do really good fundamental analysis. Even just by smartly shifting the portfolio weight between sectors one can beat the SP500. That being said, most people who consistently beat the index are using leverage.", "score": 6, "replies": []}, {"body": "I don’t think you understand or know how much of technical analysis, market & political event awareness and risk management techniques required to trade short term. This is absolutely in no way similar to gambling where people put a small amount to earn higher with negative expectancy. Look I can buy a stock and put a trail stop loss right close to buying price in case I am wrong and I can safely exit a position breakeven in case my analysis is wrong. I can also buy a stock around strong support area and immediately sell a in the money covered call with the intention to exit in a week for profit. There are many many strategies out there. Can you do any of that just by going to a casino and gamble? Please educate yourself a bit before terming something as gambling. By your definition we can also say when you go out drive everyday you are gambling by taking a chance not getting hit by a car.\n\nI agree with one points. Over long term, a good stock or etf pick will generate likely more return unless you are highly skilled trader. Trading is not for everyone simply because people can come in to it without the proper understanding and they can end up with a gambling mindset of buying something without proper risk management or understanding and lose money. I think one needs to spend considerable amount of time to learn trading otherwise they are better off investing long.", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "LOL ..... except some guys on reddit made millions 'predicting' the market. You're over thinking it.", "score": 9, "replies": []}, {"body": "I feel like there are a lot of ways to beat the average return of the market but it’s always a unique combination of factors. This guy seems to have found something that works for him. I’m sorry for the vague answer but try to find something that works for you, be patient, do your homework and all those cliches. For me, It’s much easier to do all these things if I’m not investing more than I care about. For others it might be different. The best advice I can give is try stuff out with relatively small amounts of money (that you’re willing to lose 100% of) and give it time. I personally do something totally opposite of what your dude described but it’s what works for me. I don’t day trade, it’s not for me, but some do well. Everything depends on the individual IMO. If there were a sure fire method then we’d all be rich. On the other hand, you might be able to find a method that works more often than not and learn it. Understanding comes with knowledge and experience.", "score": 2, "replies": []}, {"body": "Yes. Just don’t be stupid. Take profits when you’re up. \n\n\nThe big drawback of active trading in the past was commissions. When it was $20-50/trade it would really eat into your profit.\n\n\nThe same people running the etf you’re invested in aren’t geniuses in most cases.", "score": 3, "replies": []}, {"body": "Just buy spy calls 3 weeks out on any pullbacks. \n\nWorks till it doesn't, blah blah blah.....\n\nIt's been working for years, just don't dump your entire port into one. \n\nLook at this damn 3 month chart. it's beautiful. [spy](https://i.imgur.com/2nMU6Hm.jpg)", "score": 2, "replies": []}, {"body": "If I was him and had to listen to you say that I would want to strangle you...😄. You have a decent point, and are close to the truth, but taking risks based on logical information is different than gambling. I am one of the type of people though that believes high stakes poker is not gambling and that it rely's on mathmatical skills and the ability to read people. So I believe if you have been in the market for long enough you can start to spot patterns, and make intellegent decisions based off your experience that is different from gambling. Yes some of these guys who run ETF'S have big advantages but as retail investors, and individual people with different thought processes we have advantages over them also. There is alot of emotions involved in actively trading stocks also, and tk correctly do it you have to be a machine when the time comes. My over all point is if you do enough good extensive research and combine that with the knowledge you have accumulated through life you may just see something only 5% of the other people on your level do, and thats not gambling.", "score": 1, "replies": []}, {"body": "You are wrong. But not off overall. There’s no such thing as “priced in” as nothing gets priced to the market. The market moves solely by trades made and sentiment drives that so nothing can ever possibly be “priced in”.\n\nI trade based on a combination of sentiment, volume, and news. \n\nTrading is 100% gambling no matter how you go about it, some methods just have an educated guess and some have mitigated loss in mind.", "score": -2, "replies": [{"body": "> . The market moves solely by trades made and sentiment drives that so nothing can ever possibly be “priced in”.\n\nWhat exactly do you think drives \"sentiment\"?", "score": 1, "replies": [{"body": "Many, many factors. Currently a lot of “hf/mm are bad” thought processes, sometimes it’s news, sometimes it’s appeared volume, sometimes it a YTer pmping, there is no set thing that affects it.", "score": -1, "replies": [{"body": "You're probably spending too much time on Reddit.  People here are such a small % of investors as a whole, and even a small % of retail.  \"We\" are not really driving the price in most cases (aside from maybe meme stocks, which are a different beast).", "score": 3, "replies": [{"body": "Oh no no I didn’t mean solely Reddit, I meant the sentiment here is shared widely with others not associated with Reddit (at least based on my observations) and the market moves accordingly to an extent.", "score": 1, "replies": []}]}]}]}]}, {"body": "Your broker has plenty of knowledge on this fact.  In fact many places do.  It all depends on the trader and the strategy  implemented.  Active trading is no more of a gamble than long term investing, aside from the possible \"risk\" from higher trade frequency.\n\n&#x200B;\n\nThere are tons of strategies that are employed.  Many are profitable. The ultimate factor in the equation will always be the trader.", "score": -3, "replies": [{"body": ">Active trading is no more of a gamble than long term investing, aside from the possible “risk” from higher trade frequency.\n\nThis is demonstrably false. It is much harder to predict short term fluctuations in the market than it is to find a stock or index fund that will increase over time.", "score": 3, "replies": [{"body": "Yet its demonstrably true.  Even visible throughout the charts.  Every trade in the market has nearly an equal chance of reversing.  Ya know, just like past performance doesn't predict future results.  It's all speculation, just because your way of thinking confirms your bias, doesn't mean its true for everyone.", "score": -2, "replies": [{"body": ">Every trade in the market has nearly an equal chance of reversing.\n\nPerhaps in the short term all trades have a nearly equal chance of reversing. But this is most certainly not true in the long term. For an extreme example that demonstrates this: one person buys AMC in the morning and plans on selling it in an hour because they think it will go up. Another person buys VOO in the morning and plans on selling it in 20 years because they think it will go up. Which trade has more of a chance of making money? Of course it’s the long term trade in this case. AMC’s movement throughout the day is as good as random. VOO’s movement over two decades is very likely to be upward. And when I say “very likely” I mean that there has not been a single instance in the history of the stock market where the S&P 500 has gone down over a 20 year period, so it would be incredibly surprising for the second person to lose money. Is it possible? Of course. But is it just as likely as the first person losing money? No way.", "score": 2, "replies": [{"body": "And if an investor actively managed their trade, lets say from the start of this year, till now with AMC/VOO, which would have produced more?  Without looking I can tell you it's AMC.  But that's apples to oranges, which is the biggest problem with this mindset...\n\nLets stick with VOO,  Actively managing say a 100 share investment in VOO.  Selling on common sell triggers (This appears to be Vanguards version of SPY, so you can find plenty of strategies) would net you more than holding it (net taxes and ER/commissions.\n\nUsing Fri 7/23 on the 1 minute chart, I see 2 fantastic long opportunities, and 2 solid shorting plays. that would definitely profit more than the \\~3$/share it gained over the course of the day.  That's not even attempting to capture the peaks.\n\nJust takes a little knowledge, and the correct mindset.  However, for effortless investing, VOO all the way.  It's a solid ETF.", "score": -2, "replies": [{"body": "It’s seems to me that now we’re talking about something different than what we started on. I was just saying before that it’s more likely for a single long term play in an ETF like VOO to make money than a single short term trade in a volatile stock like AMC. Now it seems like we’re talking about the amount of returns from actively managing these two.\n\nOf course I agree that actively trading (if you are able to find good entry points) will make more than just holding. But before you said that virtually any trade has an almost equal chance of going up or down. If that’s really the case then how do you figure that you can make trades that go up more often than you can make trades that go down?\n\nTo clarify, I do not believe that every trade has an equal chance of going up or down. I do believe that a disciplined trader with a proper plan can find good trades enough to be profitable, but I don’t see how this belief is consistent with the belief that all trades have an equal chance of going up or going down. If the latter is true then everyone should just about break even.", "score": 2, "replies": [{"body": "But it does.  Even though the expected result would be VOO goes up, there is a chance, and equal chance that it simply goes down tomorrow.  And the next day, and the next day.  Each day is basically a 50/50 on if the market will move in your trades direction.  Actively managing your trade, will capture more than just holding.\n\nWhich was your original quote of mine... To which:\n\n>This is demonstrably false. It is much harder to predict short term fluctuations in the market than it is to find a stock or index fund that will increase over time.\n\nYep, just harder. And at any one of these fed meetings coming up, they could decide to raise rates (unlikely.)  which could cause the market to go down.\n\n&#x200B;\n\n>Of course I agree that actively trading (if you are able to find good entry points) will make more than just holding. But before you said that virtually any trade has an almost equal chance of going up or down. If that’s really the case then how do you figure that you can make trades that go up more often than you can make trades that go down?\n\nSame way plenty of others do.  There are numerous ways to trade.  Doesn't mean every trade will be correct, but with correct planning, you can make sure you don't \"blow up your account\" being wrong, and with something like VOO, you can literally hold until you are right.  Just like if you bought VOO on Friday, right before close, and it opens tomorrow at \\~1.5$ under what you (would have hypothetically) paid, but we all know it won't stay that way for long.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "There is an edge, there are working strategies that actually beat the market. You need to have a deep knowledge in technical analysis, know extremely well what currency or stock you're trading, as in knowing how it's trends work, what kind of up and down patterns were in the past, and be extremely technical about your \"take profits\" and \"stop losses\".\nI will give a currency, I knew very well previously as an example. which is Ethereum. Every so often there was a spike up and down of 100$ per coin and it was almost certain that a correction was due. It happened when Ethereum stagnated between 1700-2000 and every rise of 100$ was corrected hours later. \nI know a friend of mine who made a good money off of it but it took him a long time since those spikes occur every few days. \nI will tell you this, unless it is a full time job, or you have millions to trade, it is definitely not worth it.\nIt will outperform a regular investment account, or even a risky long time option one, but it requires a full 24 hours attention span that you don't have. And thats without considering the emotion part which constantly losses money.\nAnd well it still sounds like gambling, but since its done over and over, with a winning strategy over time, its bound to result in a win. It's almost statistically impossible to lose money with a stable winning strategy.\nBuilding that strategy requires a lot of research which takes a lot of time and effort.\nAnyways what I'm tryna say is unless it is a full time job with a lot of money at stake, you'll make more money working at Wendy's.", "score": 0, "replies": []}, {"body": "I tend to agree... retail has no informational edge really.   You may get lucky a few times and crush it though (like tsla or amzn)\n\nEasier to have an edge in small caps with less coverage,  or beaten down sectors which institutions hate", "score": 1, "replies": []}, {"body": "I believe in doing your homework about the stock. You might get lucky sometimes. Trend is your friend!", "score": 1, "replies": []}, {"body": "You're wrong. \nIt's tough, but it is possible to add value to your portfolio. \nIt's more than just buying and selling.", "score": 1, "replies": []}, {"body": "Theres not enough detail into what is his technical knowledge is like, day traders usually aim for a high of 1% return per day, which would be substantially larger return then a etf/index return YOY.\n\nIs he day trading, or is he swing trading? How long does he hold his portfolio for?\n\nInvesting and day trading can have a very large difference in returns, you're not wrong in that it's extremely hard to beat the market average which is why Buffet recommends owning a basket like you found with indexing, however it sounds like your friends dad is a day / swing trader, in which the YOY returns would be different if he's consistently profitable. \n\nI'm a day trader.", "score": 1, "replies": []}, {"body": "Everyone has a different strategy but for someone active and very good it's absolutely beneficial to trade than hold long term..\n\nBut who admits they are just average?\n\nOnly a very small few of traders are successful...very small", "score": 1, "replies": []}, {"body": "It’s definitely possible with options but it’s also possible to lose it all with options", "score": 1, "replies": []}]}
{"title": "My main positions are getting too expensive to dollar cost average", "selftext": "So I started investing 2.5  years ago. \nI have 25% in AAPL, NVDA, \n\n10% each in CRSP, Starbucks, Visa and Nintendo.\n\nI speculate with 5% and keep 5% as cash. \n\nTDA,as far as I know, doesn't do partial shares outside of DRIP and all of my stocks are getting kind of expensive to add to my position.", "id": "ordltd", "created_utc": 1627226937.0, "score": 26, "upvote_ratio": 0.8, "num_comments": 30, "comments": [{"body": "The AAPL and NVDA splits helped out a ton with that did they not? All of those are <$300 so just wait until you have the money to add to one. Or you can move your money to an account that does fractional shares", "score": 30, "replies": [{"body": "Yes the splits definitely helped. I guess I remember when CRSP and starbucks were less than 70 dollars so maybe that's making me hesitant at these prices. Thank you for your encouragement I will just have to buy one share at a time if I want to add more.", "score": 3, "replies": [{"body": "Bro move on. We’re in a bull market for at least the next year. Goodluck waiting .. time in the market > timing the market", "score": -1, "replies": []}]}]}, {"body": "Have you considered a new position? I would think about an index fund or ETFs. You could choose an ETF that gives you exposure to your high conviction plays or something different for diversification.", "score": 17, "replies": [{"body": "This⬆️.  I like this idea a lot for a reasonable investment strategy. \n\nOP is well position with a handful of individual stocks that he likes. The small portfolio lacks some diversity. Adding extra funds to a broader index/ETF is a great approach.", "score": 10, "replies": [{"body": "I have been looking at SPY and VTI for some time now, but they keep going out of my range. Are there any funds or ETFs around 100 or should I just save and buy en mass once a year?", "score": 3, "replies": [{"body": "SPLG is basically mini spy", "score": 6, "replies": []}, {"body": "Schwab etfs are generally lower price. SCHB is 106 and SCHG is 153.", "score": 4, "replies": []}]}]}, {"body": "Ya I was gonna say grab SPY, I grabbed a Russel 3x ETF too on Friday, if you're feeling risky.", "score": 2, "replies": []}, {"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Start just adding cash to the account until you have enough to distribute.\n\nOption 2: move to a brokerage offering fractional shares. Many of the big ones are doing it now.", "score": 12, "replies": [{"body": "Thanks. From what others have said I will probably have to be more patient and go with option 1. I read about TDA and Charles Schwab. Will I be able to get fractional shares after TDA gets bought out/ merged?", "score": 1, "replies": [{"body": "I switched from TDA to Fidelity for this exact reason and I haven't looked back since.  Being able to throw $50 at GOOG on a red day feels awesome.", "score": 3, "replies": [{"body": "Do you miss thinkorswim? That was the main reason I switched to TDA from Roblinhood other than no customer service.", "score": 2, "replies": [{"body": "I still use Thinkorswim to track my stocks, watchlists, perform technical analysis, etc.  Honestly, imo its the best software out there for retail traders so I wasn't able to get away from it.  I never made buy/sell orders from ToS anyways, always did it from the TDA website.  \n\nThe other major difference between Fidelity and TDA is that in premarket and afterhours, TDA will keep updating your stocks with the PM and AH prices where Fidelity only updates during market open hours.  Most of my positions are long term so it wasn't that big of a deal for me.\n\nEDIT:  I kept like $500 in my TDA account specifically so I wouldn't lose access to ThinkorSwim", "score": 2, "replies": [{"body": "Thank you that's good to know. I do research and trade in thinkorswim. I think I only used TDA's website once.", "score": 2, "replies": [{"body": "Awesome.  If you end up switching to Fidelity, let me know how you like it.  \n\nBTW, buying/selling thru the TDA site is pretty nice.  There's a \"snap ticket\" that pops up from the bottom of the screen with a \"quote\" button that you can hit with your ticker symbol and as long as you have the Price Column \"unlocked\" (see picture), it will update automatically as the price changes.  Its great for on the fly buys and sells.\n\nhttps://imgur.com/a/iz7B4Ln", "score": 2, "replies": [{"body": "I will try it next time I want to trade thanks.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "If I had to guess, yes. My understanding is that TDa will stay a separate platform for awhile but eventually get combined. That was how I interpreted the communication from the schwab side at least. \n\nUnless you need think or swim, I like the schwab interface better anyways. Used both for awhile but eventually consolidated to schwab", "score": 2, "replies": []}, {"body": "Schwab has index mutual funds with no minimum for buys. You can put every dollar you want in right away instead of waiting to buy a whole share.", "score": 2, "replies": []}, {"body": "M1 finance is good because you can say you want a certain % of each stock and then it will buy fractional shares proportional to your preference", "score": 1, "replies": []}]}]}, {"body": "I remember buying MSFT at 100 in 2018, it just doesn't feel good paying 3x the price 3 years later.", "score": 9, "replies": [{"body": "Think about how the boomers who bought at 20 and held are feeling!", "score": 5, "replies": []}]}, {"body": "I'm assuming when you DCA you maintain that rough weighting? How much money do you add each time, and how often do you add? If it's getting too expensive and you don't get fractional shares, then I guess your only option is to pick 1-3 to add every period, and rotate accordingly?", "score": 3, "replies": [{"body": "Thank you for your advice. I have slowed down with adding money recently. So I now add 20 dollars a week instead of 500 dollars once a quarter. Every time I save, I get major fomo once the price reaches new ATH. I will just have to pick one based on my opportunity cost.", "score": 2, "replies": [{"body": "If I was investing $20 a week, I'd definitely find a brokerage that allows fractional shares.", "score": 6, "replies": []}]}]}, {"body": "Love your allocation!", "score": 2, "replies": []}, {"body": "Buy ETFs heavily weighted in those stocks if you want more exposure without paying full freight.", "score": 2, "replies": []}, {"body": "Terrible \"problem\" to have. Find new positions then.", "score": -1, "replies": []}, {"body": "Why can’t you dca with fractional?", "score": 1, "replies": []}]}
{"title": "Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 3) - $TSLA, $AAPL, $AMZN, $MSFT, $GOOG, $FB, $AMD, and More", "selftext": "**Historical Post Earnings Moves MEGA Compilation and Analysis (Q2 Week 3) - $TSLA, $AAPL, $AMZN, $MSFT, $GOOG, $FB, $AMD, and More**\n\n&nbsp;\n\nWhat's poppin' bull gang, I hope you made some awesome money last week! The spreadsheet was spot on for nearly every company, and all of my plays came to fruition! **$MT and $X ended up bagging us anywhere from 300% to 500%, $JETS gave us 1100%, and $SNAP netted us 250% on our strangles and nearly 600% on binary options!** I’m looking to keep this momentum going throughout this week as well, and with all of FAAMG (I kicked $NFLX out for $MSFT after their disgraceful earnings) set to report, this week could prove to be more lucrative than the last! We’ve got a large variety of trades we can make this week ranging from educated gambles, to good old fashioned theta plays. We’ve even have a couple of opportunities to sprinkle in some collateral plays if we wish! Let’s get into it! \n\n&nbsp;\n\n---\n\n#The Spreadsheet\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1-xx9rsQ4_0LhDRqfBbW4wkSy5zRdVOBHQn737EC5Cok/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1-xx9rsQ4_0LhDRqfBbW4wkSy5zRdVOBHQn737EC5Cok/edit?usp=sharing)\n\n&nbsp;\n\nIf the sheet has helped you out in any way, please drop an upvote or a comment, so I know whether or not I should keep on making them! Most websites also require you to pay for this data, which I think is asinine.\n\n&nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&nbsp;\n\n- **Pinterest is inefficiently priced.** Since going public, $PINS has had an average post earnings move of **14%**. The options this week are pricing in a move of *roughly 6%* on both sides of the chain, which is likely going to shrink significantly going into earnings as theta eats away at the contracts. Even though I’m extremely bullish on $PINS, this trade could honestly move either way, so I’m personally opting to play a straddle like I did with $SNAP last week. Given that we get a historically average move, we’ll be making some money on this trade. Keep in mind, this trade *is* riskier than the one we played on $SNAP, since the average historical move is smaller. Don’t over leverage yourself, and don’t be afraid to turn the straddle into a reverse iron butterfly to reduce your cost basis on the trade.\n\n&nbsp;\n\n- **Over the past 24 earnings seasons, Shopify has gone up nearly 75% of the time!** The odds on this trade are phenomenal, and we have quite a few options for how we want to play it.  If you want to gamble directionally, call debit spreads would be your best bet from a risk to reward standpoint. Alternatively, we can also join theta-gang for this play by selling ATM put credit spreads allowing us to net some extremely nice premiums. If you want an even safer spread, $MSFT also has a similar win-rate (~65%) while having a historically smaller move, allowing you to defend your capital in the event that the trade goes against you. Since both $SHOP and $MSFT report on different days, we can look to make this play twice to ensure we’re not overleveraged on any given day.\n\n&nbsp;\n\n- **Counterintuitively, $XLE is NOT a good [collateral play](https://www.hungrybotalerts.com/blog/collateral-plays) this week!** $XLE actually has a *higher* IV than both $XOM and $CVS, so if you wanted to play oil earnings, you’d actually be better off rolling the dice on the individual companies. I’m not sure why this is the case here. Either the MMs are catching onto my bullshit (unlikely), or there’s some nuances to trading oil that I’m not aware of.  I’m sure there’s an arbitrage play you could make regarding the individual price and IV differences proportional to the ETF holdings, but I don’t have time to crunch the numbers nor do I think I’d have enough capital to abuse it. Regardless, I just wanted to bring this to everyone’s attention since this is one of the rare cases where the collateral play puts us at a disadvantage.\n\n&nbsp;\n\nAll that being said, I haven’t had much time to review any extra trades given that I’ve been extremely busy this weekend. If you want extra trade theses or updates, alongside any live trade entries and exits, feel free to check out the community links on the spreadsheet.\n\n&nbsp;\n\n---\n\n#Summary and Conclusion\n\nWe’ve got another fun week of earnings ahead of us! I personally tend to avoid playing FAANG stocks in general, so my analysis was concentrated elsewhere. If you see any appealing plays, feel free to let me know! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1-xx9rsQ4_0LhDRqfBbW4wkSy5zRdVOBHQn737EC5Cok/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people find the sheet useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment! If you want access to more trading tools, or have any specific questions or observations you’d like to share with the community, feel free to check out the community links within the spreadsheet or on my profile. **Happy Trading! :)**", "id": "orl6lg", "created_utc": 1627250896.0, "score": 85, "upvote_ratio": 0.9, "num_comments": 33, "comments": [{"body": "Great spreadsheet and analysis. I wonder how often do you post this type of stuff. Comes in really handy during earnings season.\n\nI have my own spreadsheet for earnings in which I map 3-4 type of plays in each tab. Namely, CCs, Strangles, ICs and Put/Call Spreads. For each ticker I want to play during the week, I map out returns of each strategy against capital I am risking. Then I select my plays based on best return on risk across all 4 strategies. I use the historical moves to decide how narrow or wide I want to play my strangle and IC legs.\n\nFor $TSLA I am looking at an IC play, since I'm not sure which direction it might go post earnings. Strangles on $AMD and $PYPL look good for IV capture.\n\nHow do you decide which strategy to deploy from this analysis?\n\nBtw, quick question. I am looking to automate calculations in my sheet and perhaps write a Python script to spit out a sheet for me. What is the best place to source options pricing data for free?\n\nKeep up the good work!", "score": 3, "replies": [{"body": "I recently started posting sheets like this as of last quarter, aiming to have one out every week during earnings season!\n\nI just look at the numbers and see which trades have the best risk-reward ratio. I treat every trade as a predefined gamble - if I feel like I have enough edge proportional to the risk, I'll take it. Let's take the $SHOP example - if I made that trade every earnings, I'd come out on top 75% of the time. Even if I experience maximum loss on my losers, I'd still come out ahead in the long run, so it's in my favour to take it.\n\nIf you're running python, the yfinance library should be able to get all the options prices you need!", "score": 3, "replies": [{"body": "I just yolo'd a $SHOP put credit spread.  🤞\n\n1300/1660", "score": 1, "replies": []}]}, {"body": "`Strangles on $AMD and $PYPL look good for IV capture`\n\nWhat do you mean by this sentence? Do you mean selling a strangle and then buying back after IV drops?", "score": 1, "replies": []}, {"body": "TSLA IV is currently 40%, which is a lower than any point during the last 12 months. I am not sure how much of a crush it will be. I know the stock is in a lull right now, but it could wake up and become a crackpot in 3 seconds flat depends on if Musk decides that Tesla car would be able to fly or if Xi Jingping decides to nationalize the Shanghai Tesla factory ( either choice has a higher than 0 possibility). Feel like a better choice would be a to own a strangle instead of selling one.", "score": 1, "replies": []}]}, {"body": "Awesome! Love these weekly posts!! Thank you for taking the time to analyze for us!", "score": 3, "replies": [{"body": "No problem brother, glad you like em!", "score": 4, "replies": []}]}, {"body": "Thanks for the immense amount of work on this each week!\n\nNewb here, and still trying to wrap my head around earnings strategies.\n\nWhat would be an example of a $PINS straddle/iron butterfly to play this? I've read about straddles as a play to gain from IV crush, but I'm confused on how you'd play this given you're suggesting a ~14% move, because that suggests to me a long straddle, which would be hurt by IV crush (as opposed to a short straddle), no?", "score": 3, "replies": [{"body": "You've more or less got it man! \n\n&nbsp;\n\nThe long straddle would get hurt by IV crush, but the average historical move would actually end up being greater than the crush that both sides experience, meaning that you would still come out ahead in the end (given that we move the average 14%).", "score": 3, "replies": [{"body": "Oh, I see!\n\nSo, am I correct to assume you'd consider a long straddle (debit) here with 30 JUL DTE, selling it right before earnings, and buying it back right after? My thinking is you'd want the short DTE to minimize Vega impact, but Theta will crush you if you hold on too long.", "score": 1, "replies": [{"body": "I'm actually planning on opening the straddle right before earnings, when it's the cheapest.\n\nIf it follows $SNAP's pricing structure, the price of the contracts should account for roughly a 4% move on each side of the chain (since theta will eat away at the contracts, making them much cheaper than the 6% move they were projecting at the time of writing).\n\nThat means that as long as $PINS moves more than 8% (4% move * 2) in either direction, we'll be profiting!  Lets say we get a move of 14% move to the upside on earnings. We would lose at maximum 8% of the move to IV crush, but the remaining 6% move will be pure profits for us.", "score": 2, "replies": [{"body": "I think I get it. Still trying to get comfortable with all the moving variables, and this is a bit of a counter-intuitive play... let's see if I understand it (estimated figures)...\n\nRight before earnings: +C/+P @ 77 for 30 JUL DTE. Costs around $9.5.\n\nEarnings: stock goes up ~14% to around $87.5. \n\nRight after earnings: IV drops ~30%. Sell for around 11.7, making ~1.2.\n\nDo you worry that it'll be hard to get that STC filled that close to EXP?", "score": 1, "replies": [{"body": "Yessir, you more or less got the right idea man!\n\nThough the cost would likely come out to around 8$ netting us around 50% profits at the end of the day.", "score": 2, "replies": [{"body": "Awesome! Thanks for the explanation. Much appreciated!", "score": 1, "replies": [{"body": "No problem man, always happy to help!", "score": 1, "replies": [{"body": "So you sell right after the move happened I guess?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Next week is going to be hard to predict. I’m going to hold up selling my normal weekly otm cc’s and OTM puts next week. It could go crazy a lot of ways. Premiums are tempting on a lot of those stocks but you could catch some shares or have to sell some if you don’t sell far enough out with the volatility next week could bring", "score": 2, "replies": [{"body": "I agree, it's going to be fun to trade. I tend to avoid $FAANG for that reason, it's hard to predict, and it's overcrowded so gaining an edge is often difficult.", "score": 1, "replies": []}]}, {"body": "My mind is telling me to sell calls on Apple and Microsoft but I don't have the balls to do so. Would not want these shares get assigned away.", "score": 1, "replies": [{"body": "You and me both man.", "score": 1, "replies": [{"body": "When I call my brokerage specialist they never seem to be able to answer these types of questions. But I’m glad y’all had this in mind. I am by no means anywhere close to even having 100k yet. \n\nHowever, I know that selling options grants the seller profit in the form of the premium. For fun I went on AAPL and picked the option to SELL (sell to close- I’m on mobile app). I then upped from selling one contract premium of $91, to selling 20k contracts for a premium of over $1m. \n\nI do not own any shares in AAPL. \n\nWill TDA allow me to complete this transaction and sell that many contracts naked?\n\nWhat’s stopping myself, or anybody from just becoming millionaires over night selling high numbers of options contracts like that? \n\nIF TDA allows this, WHY wouldn’t you yourself just try it? These contracts are OTM. Expire in a week’s time. Seems like a get rich overnight idea. \n\nCould you explain what I’m missing here- I feel like I’m missing something.", "score": 1, "replies": []}]}]}, {"body": "I'm holding 700 shares of AMD right now. Hopefully there'll be a run-up to earnings so I can GTFO and join cash gang for a while. Might sell some puts if my list shows any hurting next week though.", "score": 1, "replies": []}, {"body": "Good info. Already have a TSLA play, might look into some othere here.", "score": 1, "replies": [{"body": "What play do you plan on doing for TSLA?", "score": 2, "replies": [{"body": "Oh I'm already mid play. I just have more CSPs than normal. Deciding if I want to do CC's Monday tho", "score": 1, "replies": [{"body": "Oh, gotcha! I thought you had plans to open a new one haha.", "score": 2, "replies": []}, {"body": "strike?", "score": 2, "replies": [{"body": "I did a few 14 DTE, $620 and $640. If only I had waited a day or so for that dip I could've made a lot more money...but such is life.", "score": 1, "replies": []}]}]}]}]}, {"body": "Good stuff OP. Thanks for all the work you put into this", "score": 1, "replies": [{"body": "Thanks for checking in man! Enjoy.", "score": 1, "replies": []}]}, {"body": "this guy works hard. Anyone uses his paid bot ?", "score": 1, "replies": [{"body": "I havent used it personally, but my friend has it and won't stop talking about it so I'd say its probably pretty solid.", "score": 1, "replies": []}]}, {"body": "Could you please approve access to me. I requested around noon today.", "score": 1, "replies": []}]}
{"title": "Top Social Stocks of the Week!", "selftext": "This post is in continuation of a series of posts I made in the previous weeks. The response I received was amazing and a lot of you were asking for continued weekly updates. You can find last week's post [here](https://www.reddit.com/r/wallstreetbets/comments/omr5g2/top_social_stocks_of_the_week/). \n\n \n\nHey Guys,\n\nHope you had a great week in the market. As we can see below SPY finished strongly with it rising 2.5% over the last week. As of Friday, 88% of the S&P 500 companies that had reported second-quarter results exceeded analysts’ earnings estimates \\[FactSet\\].\n\n[ ](https://preview.redd.it/4znzaw4pldd71.png?width=1132&format=png&auto=webp&s=41fcea7420fdd703438ab0ea78edd9f3bd16ae64)\n\nEven though there are some inflationary concerns, Fed is widely expected to keep its benchmark interest rate unchanged—and at a near-zero level—when it concludes a two-day meeting on Wednesday. Given the majority of the market ended in the green, let’s see how the most popular stocks performed.\n\n### Most Discussed Stocks of the Week\n\n[ ](https://preview.redd.it/c5k0ghasldd71.png?width=1039&format=png&auto=webp&s=f2610ef3759eb94e168fc56c2678bcd44a810a71)\n\nAll the popular stocks except WISH and CLOV ended in green last week! Moderna is the newcomer to the top 10 list with a 22% jump in stock price. The controversy regarding the vaccine decision is accurately reflected in the sentiment with the stock having only 0.5% after having a very strong rally. SPY continues to be the most discussed stock with AMC, WISH, GME & CLOV all having almost similar discussion volumes.\n\n### Top Growing Stocks of the Week\n\n[ ](https://preview.redd.it/kkvafthtldd71.png?width=1211&format=png&auto=webp&s=720ce3bbfe426cdf0c383a7b62f016dd5d828e0f)\n\nAs this is now the earnings season, most of the stocks exploded in chatter primarily due to their earnings releases.\n\n**Snap Inc(SNAP):** SNAP shares soared 23% on Friday following their exceptional quarterly report. The company posted 293 MM global daily active users which is 23% more when compared to last year. Adding to this, the company also reassured the investors that they would not be impacted by the iOS 14.5 privacy changes as it had anticipated.\n\n**TAL Education Group(TAL):** TAL stock was down 70% on Friday following the news that the Chinese Govt might tell for-profit educational institutions to become non-profit organizations. As per CNBC reports, educational training institutions are banned from raising money through stock listings and foreign capital will not be allowed to invest. The news also caused other educational companies such as Youdao(DAO), Gaotu Techedu (GOTU), etc. to drop significantly.\n\n**Beachbody Company(BODY):** BODY has completed its three-way merger with Myx Fitness and Forest Road Acquisition Corp last month. This made it one of the largest subscription health and wellness companies for the mass market. The rising stock price and some very well-researched DD’s ([here](https://www.reddit.com/r/wallstreetbets/comments/okfasr/beach_body_stock_is_it_gonna_boom/) and [here](https://www.reddit.com/r/wallstreetbets/comments/oow4uo/bodybeachbody_a_deep_value_digital_and_connected/)) have contributed to the increasing chatter.\n\n**Intel Corporation(INTC):** Intel reported its quarterly earnings on Thursday. Even though the company beat revenue and EPS expectations, the stock price fell 2% following the cautionary guidance the company issued for the next quarter. Intel also said that PC unit sales were up 33% over last year. Investors were bullish on the stock predominantly because of the increasing focus the US govt has on fixing the semiconductor supply chain.\n\n**Moderna Inc(MRNA):** The company was trending and the stock price was rallying after European health officials recommended authorizing the drugmaker's coronavirus vaccine for kids 12 and older. This in addition to growing calls for a booster dose for newer covid variant’s have pushed to stock price up. But the decision to vaccinate kids 12 and older was not well received by everyone as can be reflected in the sentiment. (There is a slight difference in sentiment between both the charts as the latter was pulled 6 hours later)\n\n**Until next week!**\n\n*As always, please note that I am not a financial advisor.*", "id": "ordgm8", "created_utc": 1627226431.0, "score": 80, "upvote_ratio": 0.88, "num_comments": 38, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|56|**First Seen In WSB**|6 months ago\n**Total Comments**|201|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/n940ns/i_analyzed_9000_trades_made_by_us_senators_in_the/) [x](https://www.reddit.com/r/wallstreetbets/comments/oq1mv3/an_unbiased_take_on_the_robinhood_ipo_the_good/) [x](https://www.reddit.com/r/wallstreetbets/comments/mnho9j/i_built_a_program_that_tracks_mentions_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/og6wr4/does_index_inclusion_positively_affect_stock/) [x](https://www.reddit.com/r/wallstreetbets/comments/kl4fhj/one_more_stock_indicator_to_consider_before_your/) [x](https://www.reddit.com/r/wallstreetbets/comments/mtehdq/i_analyzed_all_700_buy_and_sell_recommendations/) [x](https://www.reddit.com/r/wallstreetbets/comments/oawsxf/i_analyzed_last_15_years_of_news_articles_to_see/) [x](https://www.reddit.com/r/wallstreetbets/comments/ok4l9c/i_analyzed_the_performance_of_companies_in_the/) [x](https://www.reddit.com/r/wallstreetbets/comments/o70k70/i_analyzed_the_last_3_decades_of_stock_market/) [x](https://www.reddit.com/gallery/kl4ixe) [x](https://www.reddit.com/r/wallstreetbets/comments/njxv95/a_dd_on_inflation_how_it_affects_stock_prices_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/nsvma5/i_analyzed_all_the_controversial_trades_made_by/) [x](https://www.reddit.com/r/wallstreetbets/comments/ny6wpp/i_analyzed_3600_ipos_over_the_past_two_decades_to/) [x](https://www.reddit.com/r/wallstreetbets/comments/lbtp0q/dont_paper_hand_gme_due_to_boomer_bots_real/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 22, "replies": [{"body": "Yes plz", "score": 5, "replies": []}]}, {"body": "body is very undervalued. loading up before earnings report", "score": 13, "replies": []}, {"body": "Earnings report for Context Logic on Augy 12th. LG", "score": 34, "replies": [{"body": "holding 4800 @ 12.24, not fukin' leaving.", "score": 19, "replies": [{"body": "$13.80. I’m gonna be on wish like a skin tag on a dudes nose.", "score": 15, "replies": []}]}, {"body": "Look at their 14A … CEO has different tiers to bring the stock up by year 2 anniversary. Big things coming soon", "score": 9, "replies": []}, {"body": "Hell ya averaged down to around 11.80 not selling!", "score": 6, "replies": []}]}, {"body": "Clovernation just hold", "score": 10, "replies": []}, {"body": "clov just holddd", "score": 11, "replies": []}, {"body": "🍀🍀🍀🍀🍀🚀🚀🚀🚀🚀🚀", "score": 8, "replies": []}, {"body": "Let’s go Clov!!!", "score": 13, "replies": []}, {"body": "🍀🍀🍀 $CLOV 💎🙌🚀", "score": 15, "replies": [{"body": "Gunna be a great 2 weeks! About to load up some more Monday morning", "score": 4, "replies": []}]}, {"body": "Clov is going to the moon soon. It's the next tesla of insurance industry.", "score": 21, "replies": [{"body": "🚀🚀🚀🍀", "score": 12, "replies": []}, {"body": "Hell yeah!", "score": 7, "replies": []}]}, {"body": "$WISH to the Moon 🚀", "score": 4, "replies": []}, {"body": "Predictions on whether or not big tech will drop on earnings? Specifically Apple?", "score": 4, "replies": [{"body": "IMO I see apple getting up-to 150 pre earnings and then selling off to mid to high 130’s", "score": 1, "replies": [{"body": "Same", "score": 3, "replies": [{"body": "These aged really well 😂😂", "score": 1, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Snap!", "score": 0, "replies": []}, {"body": "AMC letsgo!💎🚀🚀💎", "score": -7, "replies": []}, {"body": "You mentioned clov but not sofi? I'm mad", "score": -9, "replies": []}]}
