{"title": "Tesla Gigafactory: Environmental groups see drinking water at risk", "selftext": "", "id": "s1dpns", "created_utc": 1641910105.0, "score": 56, "upvote_ratio": 0.83, "num_comments": 94, "comments": [{"body": "Didn’t we already go through two long rounds where the public was invited to voice environmental concerns?\n\nSo now that those review periods are over, people can just sue to continue blocking the factory from opening? Wtf.\n\n> Tesla had reduced the planned water consumption through saving measures and emphasized that the value per vehicle was below the industry average.\n\nSo clearly these same parties must also be suing Audi and BMW to close down their plants, if they are using more water per vehicle than Tesla. Right? ^Right?", "score": 98, "replies": [{"body": ">So now that those review periods are over, people can just sue to continue blocking the factory from opening? Wtf.\n\nYou can't stop people from filing lawsuits, even if stupid. And I don't think it's blocking it right now.", "score": 31, "replies": [{"body": "I don’t care about frivolous lawsuits if they don’t block the factory from opening. I hope you’re right!", "score": 16, "replies": []}]}]}, {"body": "Due to a legal dispute, several associations see drinking water in the region around the Tesla factory in Grünheide near Berlin at risk.\n\nEnvironmental associations had sued the State Office for the Environment.\n\nThe Frankfurt (Oder) administrative court is expecting a decision in February\n\n🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬\n\nHere we go again for February 🖕", "score": 63, "replies": [{"body": "After a year they decided that the drinking water at risk, German legacy is certainly running out of tricks", "score": 55, "replies": [{"body": "The environmental groups are mostly funded by Russian oligarchs. Legacy German auto has their heads too far up their butts to pull off this stunt.", "score": 28, "replies": [{"body": "That's a hypothesis I would like to know more about. Do you have any links?", "score": 7, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Which is one of the main reasons why coal and oil companies are pushing hard to get all nuclear power plants closed. Guess who has to build 20 oil or \"clean coal\" power plants to replace them, after all.", "score": 6, "replies": []}, {"body": "CNBC should get their investigative journalists on the case", "score": 2, "replies": []}]}, {"body": "A lot of [stuff](https://thehill.com/opinion/energy-environment/357344-democrats-dig-for-russian-connection-and-uncover-environmentalists) came out when Dems were investigating potential Russian interference with Trump. If you're looking for evidence of legacy auto having their heads up their butts, there's way too much content to fit into a Reddit comment.", "score": 4, "replies": []}]}, {"body": "Unrelated, but I know us intelligence found that the NRA was a Russian asset bc of how much money the NRA has received from Russia", "score": -2, "replies": [{"body": "Lol that is absolutely stupid AF. A democratic senator calling the NRA a Russian asset in a propaganda pissing contest between the far right and far left is the polar opposite of actual US government intel.\n\nRussia cannot even run their own country, and there are fools who believe Russia is controlling ours (the US). Yikes.", "score": 3, "replies": [{"body": "Vlad?", "score": 2, "replies": []}]}]}, {"body": "Link or documents to read about this?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/teslainvestorsclub/comments/s1dpns/tesla_gigafactory_environmental_groups_see/hs8g4y8?utm_medium=android_app&utm_source=share&context=3", "score": 2, "replies": []}, {"body": "See my response to another comment asking the same.", "score": 1, "replies": []}]}]}]}, {"body": "As far as I understand permissions are not required to wait for a decision, unless there is an injunction.", "score": 7, "replies": []}, {"body": "Those same groups are perfectly fine with local coal mines continuing to operate and use a lot more water than a factory that assembles cars.\n\nI wonder who is paying these groups... Hmmm", "score": 4, "replies": [{"body": "This complaint isn't about the amount of usage though.", "score": 1, "replies": []}]}]}, {"body": "Elon’s reaction to the water question from that reporter was appropriate.  The idea that there is a lack of water in the area is laughable.", "score": 41, "replies": [{"body": "If he'd pulled out a chart showing their usage vs coal it would've been game over.", "score": 18, "replies": [{"body": "They probably still should.", "score": 8, "replies": [{"body": "My guess is if Tesla starts to piss more people off things will get delayed further.\n\nIf the IGM union wants to help employees they should become vocal about how this delay is hurting workers.", "score": 7, "replies": []}]}, {"body": "Are their coal plants located in drought zones connected to a towns drinking water? I'm not on the side of the \"environmentalists\" trying to hault progress, just trying to make sure we are making apples to apples comparisons.", "score": 1, "replies": [{"body": "The coal mine uses 171 times the Tesla requirements.", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Fake laughter was a bad look.", "score": -14, "replies": [{"body": "Didn’t seem remotely fake.  Seemed like a genuine response, which, again, was appropriate.", "score": 14, "replies": []}]}]}, {"body": "Should not have built in Germany.", "score": 24, "replies": [{"body": "Talent when up and running outweighs the risks.\n\nTesla tried building a factory in Nevada and they don’t bother finishing out the factory because… they have hired everyone who is available for hire.", "score": 7, "replies": [{"body": "Its not a question of Germany or over expansion in nevada, theres plenty of other places in the world.", "score": 1, "replies": [{"body": "Sure, I am a Czech citizen, and there are plenty of quality automotive factories in cz.\n\nTesla is going for the best of the best. One top engineer honestly can make more difference than 100 good engineers.\n\nBerlin is fun. They can attract some of the top automotive talent in the world, the cool kids, tired of living in boring Munich or Stuttgart. They can go live it up in Berlin, while doing kick ass engineering in the meantime.\n\nAsking the top German auto engineers to move to Cz or Poland may be a deal breaker for many.", "score": 1, "replies": []}]}]}, {"body": "They want/need Germany on their side as the strongest economic power in the EU and as the seat of traditional luxury auto. It was genius to go into Germany and Tesla/Grunheide will pull this off", "score": 4, "replies": [{"body": "Germany can just buy MIC tesla if they want. Tesla doesnt need \"germany\" on their side for anything. \n\nTesla/Grunheide hasnt pulled it off. Austin will be starting much sooner.", "score": 2, "replies": [{"body": "You don’t think avoiding EU import taxes, cutting down on shipping/logistics costs, and cozying up to a continent is smart?", "score": 1, "replies": []}]}]}, {"body": "Portugal was such an easy decision it's mind blowing how they fucked this up.\n\nGreat workers, low cost of labour, rich in lithium, a government willing to open their asses to get foreign capital and investment.\n\nPretty sure they know they fucked up on this one", "score": 7, "replies": [{"body": "I’m Portuguese and I can make a list, a very big list of how badly this would’ve gone \n\nYou don’t want to open a business in Portugal trust me. \n\nNo workforce, huge corruption, insane taxation, did I mention huge corruption? Yeah it’s endemic. What about the insane tax code? The poorly functioning legal system? No no no nope. Portuguese people LEAVE Portugal to build companies. Farfetch which is a high end fashion tech startup now a unicorn, incorporated in London. A company started here. Our supermarkets are incorporated in the Netherlands. \n\nNo. Not Portugal. Trust me. The business environment here is insane. Wouldn’t have worked.", "score": 3, "replies": []}, {"body": "> Great workers, low cost of labour, rich in lithium, a government willing to open their asses to get foreign capital and investment.\n\nWithout the lithium part that's also true for Brandenburg. The people who are doing the lawsuit already told the press that they were pressured by the Brandenburg Environmental Minister to stop suing. Brandenburg officials definetly want this factory and really used all they have to sped up the process. But in the end all that speeding up caused errors in the approval process. Errors which lead to environmental groups suing.", "score": 1, "replies": []}]}, {"body": "Exactly. But Germany is such a good doggy for the US, they need some kick back from time to time.", "score": -6, "replies": [{"body": "What does Germany provide for the US?", "score": 1, "replies": [{"body": "They are our friends.", "score": 4, "replies": []}, {"body": "The submission of the EU, Germany government have been US lackeys since the end of WWII and when USA turned nazis and sent them back a few years later. (a very big shortcut to history lessons)\n\nIf you want to learn more you can start with the 1st EU president, ex high rank diplomat under 3rd Reich and involved in the Europa project between Germany, France and Italy at the time that had the underlying of the current EU. \n\nEU that can also be referred to as the United States of Europe, considering how influence it is by the US with NATO.", "score": -1, "replies": []}]}]}, {"body": "So we are gonna hire a bunch of traditional engineers and hope they can adapt to Tesla's way. I seriously hope Berlin is not a mistake.", "score": 1, "replies": []}]}, {"body": "Oh course they do.  \nBut WV factories are fine! They enhance the drinking water!", "score": 5, "replies": [{"body": "The water is only fine when it’s measured.", "score": 3, "replies": []}]}, {"body": "Any comparisons to other auto factories? And something with sources other than tweets", "score": 6, "replies": []}, {"body": "![gif](giphy|3kzJvEciJa94SMW3hN)", "score": 6, "replies": []}, {"body": "[removed]", "score": 35, "replies": [{"body": "But tbose coal plants don’t cut into legacy German auto like Tesla will for VW Mercedes’ and BMW.  The Germans should be embracing this ….", "score": 12, "replies": []}, {"body": ">Friggin water Natzis.\n\nPlease tell me this was not Elon's response...", "score": 1, "replies": [{"body": "Not yet... he is smart enough to save the mean tweeting for later, after it is running.\n\nSee: tweet-bitching at California, when he can't even sell cars in his new home state due to the laws of Texas", "score": 9, "replies": [{"body": "Hopefully he never mention Nazis. They are no joke in German society for obvious reason.", "score": 1, "replies": []}]}, {"body": "Nope, that's all me!", "score": 1, "replies": []}]}]}, {"body": "This has no bearing on Tesla schedule right? They have access to other sources of water", "score": 4, "replies": [{"body": "Correct. This has somewhat little to do with the opening but more with one of the water suppliers.", "score": 5, "replies": []}, {"body": "Let’s start a crowd sourced initiative to ship pallets of bottled water to the factory!", "score": 10, "replies": []}]}, {"body": "As they say here in Britain: “oh fuck RIGHT OFF!”", "score": 4, "replies": []}, {"body": "\"Environmentalists\".........", "score": 4, "replies": []}, {"body": "Bah, if we hadn't have had brexit we'd have had Tesla in the UK Elon said, which would've been great, as the UK is keen to get such a big automaker in.\n\nGermany not exactly ideal lol, given the competitor bias...", "score": 3, "replies": []}, {"body": "How about they ignore these actors clearly being paid or coerced to continually and intentionally slow down tesla’s factory from opening, and use the tears of failing legacy automakers for a water source.", "score": 8, "replies": []}, {"body": "I bet it’s VW and the other German companies behind this, so stupid", "score": 5, "replies": [{"body": "Russian oligarchs that flood Europe with oil.", "score": 12, "replies": []}]}, {"body": "Wonder which oil company is funding these yahoos?\nThe same ones funding protests against New England wind farms I'd bet. \nIdiots.\nThey need to weigh the greater good of eliminating fossil fuel pollution and runoff, against localized environmental risk. If any. \nThese are the same kind of objections and objectors that block wind, solar and hydroelectric projects nationwide, instead of focusing on better ways to implement them for thier full environmental benefits.", "score": 4, "replies": []}, {"body": "How much water is the Gigafactory estimated to take up? I haven't really been following... does [Energy and Water Development Corp.](https://energy-water.com/energy-and-water-development-corp-moves-forward-with-its-expansion-in-europe-by-joining-a-pioneering-project-that-stands-for-sustainable-development/) have anything to do with helping alleviate the water concerns? According to that press release, supposedly they will supply up to 6 million gallons per day (roughly 10M cubic meters per year) of water to the area the Gigafactory will be in.", "score": 2, "replies": []}, {"body": "Berlin is just a pain in the….", "score": 2, "replies": []}, {"body": "Berlin? Ofc\n\nWhat about the lizards?", "score": 2, "replies": []}, {"body": "Freaky water loving wierdos (-_- )ﾉ", "score": 2, "replies": []}, {"body": "Germany…", "score": 2, "replies": []}, {"body": "If Germany missed the ev Tesla train they have tears to drink forever. Screw Germany so called environmental group tactics.", "score": 2, "replies": []}, {"body": "I'm sure this entire controversy has been bought and paid for by the encumbant German auto industry.", "score": 1, "replies": [{"body": "Tesla is part of the German auto industry now", "score": 2, "replies": [{"body": "That will be true when they start selling German-made cars.", "score": 3, "replies": [{"body": "Lol, burn", "score": 2, "replies": []}]}]}]}, {"body": "Can someone please find the email address of those naive souls in germany that are preventing Tesla from saving the environment ending forever ICEs? So that we can send them our dearest greetings?", "score": -3, "replies": [{"body": "This seems like the sort of comment you might want to review and then delete", "score": 6, "replies": [{"body": "or just modify?", "score": 2, "replies": [{"body": "Much ~~better~~ safer!", "score": 2, "replies": []}]}]}]}, {"body": "Wish Biden would grow some balls and help defend US business interests by retaliating against  German car plants in the US - he would for GM.", "score": -15, "replies": [{"body": "Yes, because trade wars are just so easy to win, said the man who didn't understand  how tariffs work.", "score": 9, "replies": []}, {"body": "You are so clever and triggering with your use of \"Brandon\" to mean \"Biden\". I am triggered, omg.  \n\n\nI mean, yeah, as a Canadian, I can agree with \"fuck Joe Biden\". But dude, just say it instead of wanking yourself into a froth.", "score": 8, "replies": []}, {"body": "Who is Brandon and why should he help us?", "score": 2, "replies": []}, {"body": "Tell us you don't know the president's name or how trade wars turn out, without telling us you don't know the president's name or how trade wars turn out", "score": 2, "replies": []}, {"body": "What, are you 8? Just say “fucking Joe Biden” if that’s what you mean.", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_n9evv|3866)", "score": 1, "replies": []}, {"body": "This is getting old.", "score": 1, "replies": []}, {"body": "Do we need to teach these Krauts another lesson?", "score": 1, "replies": []}, {"body": "No, they don't.\n\nThey are pretending that they are, while ignoring the fact Germany is home to several of the world's biggest car manufacturers who also have enormous factories...\n\nMy wife's German, BMW, VW, Audi etc are a BIG deal there, the fact Tesla will infringe on their leadership soon doesn't run everyone the right way (least of all their lobbyists...).", "score": 1, "replies": []}, {"body": "They were better building the factory in Czech Republic , Slovakia, Austria or Hungary", "score": 1, "replies": []}]}
