{"title": "Just sold my NVDA and put it in PG for 2022. Dumb move?", "selftext": "Well I had a 4.1% weighting in NVDA and have now reduced it to about 3% for 2022.  I put the proceeds (they were all long shares) in PG for the new year.\n\nAnalysts are saying that PEs will contract this year as the FED raises rates and that things like NVDA will take a big hit.\n\nDon't get me wrong, I'm still long NVDA and my cost basis is $127 and it's still 3% of my portfolio, but I feel the share price WILL go lower and if it hits 200 to 230 or so I'll probably add some more shares.\n\nAlso, analysts are predicting things like consumer staples will fare well this year and so I thought a nice balance would be to add some PG for a little stability.\n\nI've also got things like UNH HD SHW ODFL TMO and NEE, but feel we may correct 10 to 20% towards February or March.\n\nI'm about 40% MSFT AAPL GOOGL NVDA and ASML and a little CRWD and PYPL recently purchased after their beat downs.\n\nI'm 20% cash also waiting for the sell off!\n\nGood luck all and Happy 2022!", "id": "rtszdc", "created_utc": 1641072393.0, "score": 19, "upvote_ratio": 0.67, "num_comments": 91, "comments": [{"body": "How high can the FEDs actually raise rates without compromising the government’s ability to service its debt? If the FED raises rates too high the government  would have to print money and thus devalue the currency or go to austerity measures right?", "score": 31, "replies": [{"body": "It will be small incremental rises over 12 or even 24 months. You are right in your reasoning though; a sudden big hike could dumper the economy", "score": 12, "replies": [{"body": "I am pretty sure I read three small increases over 12 months. Could have changed though.", "score": 6, "replies": [{"body": "Correct. So realistically if the Fed has the discipline and goes through with it, the rate will be something like 1%-2% in ~a year. For vast majority of businesses negligible difference.", "score": 3, "replies": [{"body": "I think of it as more of a kick to try and force behavior in the right direction.", "score": 2, "replies": []}]}]}]}, {"body": "No one will go the austerity route and get kicked out of office. They’ve got to print a lot for social security. I’m going with printing and inflatjon is the stealth tax forever.", "score": 7, "replies": [{"body": "Yea, but at some point mathematical reality will hit them in the forehead.  Ask Venezuela", "score": 1, "replies": [{"body": "I agree somewhat. Fact is everyone has printed though. There is no hedge against the end. Land will get taxed and you won’t be able to pay the tax they demand or confiscated. You can own some gold but they can take that too.\n\nIt trips me out they want UBi and haven’t even begun to fix the UBi they have…ss and Medicare. That craps broke and they want another program!", "score": 3, "replies": []}]}]}, {"body": "This guy/girl gets it.", "score": 1, "replies": []}, {"body": "Probably a solid 1-1.5%.", "score": 1, "replies": []}]}, {"body": "What will happen next is you will see NVDA go up and PG stay flat and you will try to repeatedly tell yourself that you made the right decision.", "score": 58, "replies": [{"body": "So bad move? Oh well.  I'm still adding if NVDA gets hit.  Id add a few shares at 250, but prefer 200.  Don't know if it'll go that low though.", "score": 1, "replies": [{"body": "Dude. You’re fine. Don’t let people throw self doubt into your plan. There are a lot of good companies to buy. PG is going to be here in 100 years absolutely. It’s a long term thing for you and you don’t need it to go parabolic because you’re planning ahead and thinking it through. You’ve enjoyed NVDA and now want to play it safe.\nGranted if you just want a dividend, i bonds are paying 7 percent. If you’re buying for potential 16% growth, that’s different.", "score": 10, "replies": [{"body": "Thanks. Are ibonds guaranteed 7% forever?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I looked at this but 10k max a year is a paltry amount.", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "PG has averaged 16% a year since 1985.", "score": 10, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": ">Yeah just like a Honda\n\nso it will definitely last longer without letting you down.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "NVDA is my highest conviction stock on datacenters alone.", "score": 8, "replies": [{"body": "Nah brah, metaverse furry porn is the growth center, trust me", "score": 8, "replies": [{"body": "Porn will certainly be interesting. As it has been in the past they will be one of the first adopters of the metaverse.", "score": 1, "replies": []}]}]}, {"body": "I don’t think it’s a bad move and I like some of your other positions like UNH AAPL HD MSFT GOOG CRWD PYPL", "score": 9, "replies": [{"body": "I like beer ...... Founders all day IPA!  😆", "score": 4, "replies": []}]}, {"body": "I still don’t think Fed will raise rates especially if inflation is stabled. We have until June according to Powell before we see anything. The main thing about selling now is that I think all these companies will release blow out earnings based on all the reports I’ve seen so far that could send these stocks higher.", "score": 12, "replies": [{"body": "For some reason I feel February we correct 10%.  I'm staying with my 20% cash for now.", "score": -3, "replies": [{"body": ">I feel February we correct 10%\n\nLmfao", "score": 6, "replies": [{"body": "At least ..... Maybe 100% ..... Who knows ....", "score": -3, "replies": []}]}]}]}, {"body": "Kindly - stop making trades based on what analysts have to say about a certain security. It’s rarely ever going to work for you. Start assessing your situation with the certain stock, and then make a decision based on your situation.", "score": 21, "replies": [{"body": "48 ...... Need mo money!  😆", "score": -4, "replies": [{"body": "Your going to lose money by listening to them .", "score": 1, "replies": [{"body": "Jim Cramer is never wrong.", "score": -10, "replies": [{"body": "Are you being sarcastic?\nSeriously asking. \nIf you didn’t know, he’s wrong a lot.", "score": 1, "replies": [{"body": "😆", "score": 1, "replies": []}]}]}]}]}]}, {"body": "NVDA will be a trillion dollar company", "score": 6, "replies": []}, {"body": "If NVDA hit $200 a lot of investors will click buy buy buy button.", "score": 3, "replies": [{"body": "I would!", "score": 1, "replies": []}]}, {"body": "This guy is trolling so hard. He's been shitposting about nvidia for a while now.", "score": 2, "replies": [{"body": "What?", "score": 1, "replies": []}, {"body": "Aren't you the one that convinced me to sell NVDA?", "score": 1, "replies": []}]}, {"body": "mistake no 1: listening to analysts\n\nmistake no 2: selling a market leader such as NVDA while it still proofs that it has momentum\n\nmistake no 3: listening to analysts", "score": 2, "replies": [{"body": "Well if it goes down after fed taper I'm buying more.", "score": 1, "replies": [{"body": "When talking about market leaders such as NVDA (or LCID, AMD, AEHR etc) It’s pretty risky to wait for a dip. But in the end it depends on your strategy.", "score": 1, "replies": [{"body": "I bet nvda gets hit in March or even February.  Then if it gets to 240 or less or even 250 I'll probably pick up some more shares.\n\nI'm 20% cash right now.  I have a 130% NVDA return.", "score": 1, "replies": []}]}]}]}, {"body": "Yes, analysts are always correct with no agenda. “TSLA will never hit $500/share…pre-split.”", "score": 7, "replies": [{"body": "Just because it happened once, doesn’t mean it will happen again. At a certain point in time, reality will enter the scene and every speculative investor out there will be left holding massive bags (has already happened this year to a ton of speculative stocks)", "score": 3, "replies": [{"body": "But those companies will not be profitable for the foreseeable future. Tesla is not the same speculative stock as the ones that tanked this year.", "score": 2, "replies": []}]}, {"body": "Oh, another of these Tesla-Loverboys", "score": -8, "replies": [{"body": "stay with your boomer stocks we don’t mind", "score": 0, "replies": [{"body": "RemindMe! 1 year", "score": -1, "replies": [{"body": "I will be messaging you in 1 year on [**2023-01-02 07:41:55 UTC**](http://www.wolframalpha.com/input/?i=2023-01-02%2007:41:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/rtszdc/just_sold_my_nvda_and_put_it_in_pg_for_2022_dumb/hqwtlqp/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Frtszdc%2Fjust_sold_my_nvda_and_put_it_in_pg_for_2022_dumb%2Fhqwtlqp%2F%5D%0A%0ARemindMe%21%202023-01-02%2007%3A41%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20rtszdc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "check the price 😂", "score": 1, "replies": [{"body": "Oh, you are a trader? Let‘s see in 1, 3 or 5 years, depending on how long the irrationality will last", "score": 1, "replies": [{"body": "sure", "score": 1, "replies": [{"body": "Looks great", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I don’t think that’s bad. Been holding NVDA since 2010 though and haven’t felt compelled to sell anything. It’s different when you’ve held for a long time versus bought last month. Why PG? People usually buy that for dividends. I don’t know what to buy. I bought a lot of ko, adm in April 2020 so weighted on consumers. Switching over a lot of qyld to xyld. I guess I could flush out international a bit more, but it’s tough. You’re going to be pretty bored in PG after the ride tech has had in last ten years.", "score": 4, "replies": [{"body": "I'm looking long term with PG.  Just think it adds a little more balance if tech gets crushed.  I realize uts more of a short term crushing though.  I still thing fang is the place to be long term.\n\nI dont have enough of a portfolio for dividends to even matter. \n\nI do like my UNH HD SHW ODFL and TMO though.  Those have 20% yearly returns about long term.  I don't just want tech.", "score": 1, "replies": [{"body": "Go for it. Part of the reason I’m not keen as I look at their product list and sometimes use only one of their products. One. Not a good sign. \n\nForgot to add I also bought SJM with KO and ADM. It never does much and didn’t recover like other things, but didn’t go down much either. I don’t use their products much either so guess I’m not totally true to my thinking. I also bought KMB, but didn’t hold it long. I hate their product line up more than PG.\n\nAdm has been my best recovery play in food. Bought that in low 30’s. Was betting on food inflation. KO was purchased in the 40’s. It’s fine, but hasn’t played out like adm.\n\nDon’t let people fill you with self doubt. Your plan is fine. They all think they can do better but don’t know the future either. Some of these people have just been shitty.", "score": 1, "replies": []}]}, {"body": "Why qyld n xyld? For dividends? Would their price not fluctuate?", "score": 1, "replies": [{"body": "No. I’m moving from qyld to xyld because I think some rotation from tech is inevitable.\nStill have some exposure to tech in xyld anyway as five tech companies make up 23 percent of the s and p. I just feel when things get volatile, people run from growth into stable names like the ones in the s and p and I don’t want to be in the volatile part of the nasdaq. \n\nWhy am in either? Too lazy to sell cc for the income myself. Ran out of ideas. Had money I needed to put somewhere.", "score": 2, "replies": [{"body": "thanks, i have been thinking about it too.", "score": 1, "replies": [{"body": "On bad days I see qyld go down 3% and xyld not even moving down 1. You’re not going to be totally out of tech in xyld either. Some people think all of those etfs are crap. I only have them in part of my Roth so I don’t have to deal with the fall out of going to zero cost basis. I’m not in on margin like some over in the gang. But I am heavily weighted in tech with NVDA. Like heavily. My portfolio is different and I have different considerations. I’m not advising anyone to do what I do.", "score": 2, "replies": []}]}]}]}]}, {"body": "If you’re bullish on consumer staples then why not XLP?", "score": 2, "replies": [{"body": "Cause PG always outperforms XLP.  You're trading diversity and \"safety\" for return when PG is both safe and has better returns on average than the XLP index.", "score": 3, "replies": []}]}, {"body": "This is a smart move. Many people in these comments saying that the fed will not raise rates are being delusional. Your kind of late for the swap into value but I would say this makes sense", "score": 1, "replies": []}, {"body": "PG has a pretty high P/E too for what it is. It will contract too just like everything else.", "score": 1, "replies": [{"body": "Yeah I think you're right.  Pretty much all stocks go down in a correction ..... Oh well I didn't sell much.  I'll pick up some more NVDA if we have a correction.", "score": 1, "replies": []}]}, {"body": "Omicron may be not that big of a deal (statistically speaking) but it may do enough to delay or reduce the amount of rate hikes.", "score": 0, "replies": []}, {"body": "PG will give you a bit more stability in a market crash vs nvidia. There’s no shame in being a big defensive.\n\nHonestly this decision won’t have huge impacts on your long term net wealth IMO. What matters is this- how much you contribute, how long you keep it in the stock market, how much you can save from take home income", "score": 1, "replies": [{"body": "Thanks. I'm not looking to be a millionaire. Just wanna pay off my small house and have a few hundred thousand in portfolio. Wouldn't mind $500k!\n\nPlan on working till 70 and ss.  Although I don't know if I'll make 70.", "score": 1, "replies": []}]}, {"body": "Such a small % of your portfolio is in NVDIA if it has a bad year you aren't going to notice it. If PG has good year you won't notice it either.  I would just split the difference and move on if you are unsure.", "score": 1, "replies": [{"body": "Is 4% that small portfolio-wise?", "score": 1, "replies": []}]}]}
