{"title": "Jeremy Grantham: \"Let the Wild Rumpus Begin\"", "selftext": "Value investor Jeremy Grantham (83 years old) has written a 4000 word article explaining his opinion that we're in the start of an epic drawdown, the fourth major bubble of his career. \n\nTL;DR: \n\n- we're seeing the same thing that that happened in the 1929 and 2000 crashes: (1) massive build-up unjustified by any fundamentals, like QQQ's 105% gain from the Covid low; (2) \"crazy investor behavior\" like dogecoin, NFTs and EV mania; (3) the most speculative/trendy stocks start failing, like meme stocks or ARK; (4) the selling moves to more reasonably valued blue-chips that are propping up a weak market. \n\n- he anticipates the S&P 500 to decline by about 45%, to 2,500; \n\n- he thinks bonds and commodities are also overpriced; \n\n- he recommends avoiding US stocks in favor of foreign value stocks (particularly Japan or emerging markets); \"some cash for flexibility, some resources for inflation protection, as well as a little gold and silver.\" But not crypto. \n\nfull article here, 10 pages: \n\nhttps://www.gmo.com/globalassets/articles/viewpoints/2022/gmo_let-the-wild-rumpus-begin_1-22.pdf", "id": "s8whnc", "created_utc": 1642722832.0, "score": 48, "upvote_ratio": 0.79, "num_comments": 92, "comments": [{"body": "\"I told you it would be the great depression, right?\" -  Grantham at every 5% decline in the market", "score": 29, "replies": [{"body": "Dude has been theoretically correct for 15 years yet losing money consistently", "score": 3, "replies": []}, {"body": "Yea can we get a follow up on his thoughts when we hit new ATH in March?", "score": 2, "replies": []}]}, {"body": "A 45% decline in S&P? Lol. Let’s see it. I wouldn’t hold my breath", "score": 48, "replies": [{"body": "How many times do these people get an article to not get called out when it doesn’t happen?\n\nPowell would reverse course after a 20% decline lmao", "score": 12, "replies": []}]}, {"body": "If spy goes to 2500 I'm going to be rich come the next bull market.\n\nThat's 2017 numbers lol. Since then there's been a ridiculous amount of revenue growth and free cash flow growth. There are some real good companies and spy 2500 would make them dirt cheap", "score": 35, "replies": [{"body": "I agree. S&P 2500 would mean a market P/E of ~11 based on this year's earnings alone (the last time it was that low was 1989).  This would be in an environment with a fed funds rate of *maybe* 2-2.5% by the end of the year if Powell goes crazy on hikes.  Makes zero sense.  If his prediction came to fruition I would literally liquidate **every** single thing I own - including my underwear - and dump the $$ into the market ASAP.", "score": 19, "replies": [{"body": "I call dibs on your underwear", "score": 12, "replies": [{"body": "This guy gets it", "score": 3, "replies": [{"body": "I better... I called dibs!", "score": 4, "replies": [{"body": "😂😂 \nToo funny I didn’t mean for it to come off in that context!  But yeah your damn right! \n\nGive this guy your undies pal!", "score": 3, "replies": []}]}]}]}, {"body": "Fucking liquid underwear, that’s wild", "score": 3, "replies": []}]}, {"body": "That's March 2020 numbers", "score": 2, "replies": []}, {"body": "If it goes to 2500 I will be liquidated and putting a few hundred k in it 😂", "score": 1, "replies": []}]}, {"body": "Okay, I remember these types of articles.  Anyways, let’s at least see if things stabilize after the Fed officially says how many rate hikes there will be.  Uncertainty seems to make these things happen, then poof!  No more uncertainty, and back up we go.", "score": 25, "replies": [{"body": "*December 2018 has entered the chat*", "score": 13, "replies": []}, {"body": "The problem is that it doesn't matter what the FED says, what matters is what people think the FED will do.\n\nThe FED said A, then people were worried about B, the FED confirmed A, then people were still worried about B.", "score": 5, "replies": [{"body": "Then I just shrug and continue DCA'ing because I can't read.", "score": 1, "replies": []}]}]}, {"body": "Lets look at the Big 4 companies and see how they compare with 2016 EBITDA which was what Mr Grantham project us to fall back. It was 2500 on September 10, 2017\n\n**For reference Campbell's soup current EV/EBITDA is 12.32**\n\nApple Market Cap 828 billion at a 26 billion 2016 EBITDA. 31 EV/EBITDA\n\nIf Apple goes back to 828 billion Market Cap with 120 billion 2021 EBITDA 6.9 EV/EBITDA\n\nMicrosoft 575 billion market cap at a 37 billion 2016 EBITDA 15.5 EV/EBITDA\n\nIf Microsoft goes back to a 575 billion market cap at a 2021 80.816 2021 EBITDA 7 EV/EBITDA\n\nGoogle 645 billion market cap at a 29 billion EBITDA 22.24 EV/EBITDA EBITDA\n\nIf Google goes back to a 645 billion market cap at a 54.7 billion 2021 EBITDA  11.79 EV/EBITDA\n\nAmazon 480 billion at a 12.3 billion EBITDA 39 EV/EBITDA\n\nIf Amazon goes back to a 480 billion market cap  at a 39.572 2021 EBITDA  12.13 EV/EBITDA\n\nIf this scenario happens then I mean im taking out every loan I can and selling every material possession I own to buy that market", "score": 24, "replies": [{"body": "You took a few things wrongly though.  Yes the SP would be back to 2016 levels…but then you assumed the four best performers would also be at their 2016 levels.  \n\nThat’s not how you do it. Of course they will look better since they have gained so much to be in their position now.  The SP would still be bargain levels sub 15 P/E but just taking the best stocks and assuming they use their juiced up 2021 earnings where any 45% market drop would undoubtedly be tied to a recession … is just a poor comparison.", "score": 10, "replies": [{"body": "His thesis is literally we are in a bubble. Its not recession.", "score": 4, "replies": [{"body": "Yes, but a 45% drop in the market likely would cause a recession. \n\nThe market and economy aren’t always linked, but when that much “wealth” disappears from everyone’s accounts in short order, the economy slows down. You put off buying that car, taking that trip, getting that reno, buying that stereo etc.", "score": 6, "replies": [{"body": "But the companies I listed won't really be affected to the point of losing 2 or 3 years of growth in a stock market drop. They weren't affected in 2008 which was much worse than a stock sell off. I doubt they would be even affected if the \"bubble pops\". Microsoft's stock didn't grow from 1999-2014. It's revenue grew from 19.75 billion to 86 billion.  The stock was just dirt cheap, it wasn't the company was doing anything wrong. These companies are recession proof because they are so engrained in our lives.\n\nI get stuff like Lululemon or disney going down but not these companies....\n\nFor example:\n\nGoogle grew revenue in 2007, 2008, 2009.\n\nAmazon grew revenue in 2007, 2008, 2009\n\nApple grew revenue in 2007,2008,2009 (Actually doubled thanks to the iphone)\n\nMicrosoft lost 2 billion revenue from 2008 to 2009 but it grew again in 2010.", "score": 0, "replies": []}]}]}]}]}, {"body": "I love analysis that has no numbers or data to back it up but straight up speculates that things will go down/up a certain amount. Eventually you'll be right if you keep crying wolf.", "score": 20, "replies": []}, {"body": "Google grantham stock market crash 2014 “grantham expects stock market to crash around election time” \n\nGoogle stock market crash any year since 2013, some people are addicted to being a bear. Maybe they’re right but I’m just going to keep dollar cost averaging into index funds. \n\nAlso all the Macro people have said “US in a bubble emerging markets value is the place to be” for almost a decade. Maybe they are right and we will mean revert. \n\nBut it doesn’t matter if you buy into VTI and VXUS every 2 weeks and plan on doing that for the next 35 years", "score": 29, "replies": [{"body": "Even his Wikipedia page describes Grantham as a 'permabear'. What he is saying is nothing out of the ordinary for him. Experts have correctly guessed 56 out of 3 recessions.", "score": 4, "replies": [{"body": "This is what I'm looking for. If he's a permabear, that 50% decline loses weight significantly. \n\nI think we can all agree that there will be a pull back. I'm thinking neighborhood of 20% to 35%.\n\nI didn't read the article, but the unparalleled growth of major tech companies is not something to sniff at.", "score": 1, "replies": []}]}]}, {"body": "Id guess it’s more likely we go like Japan and just flatten out, market averaging like 2-4 percent a year.", "score": 5, "replies": [{"body": "Need to keep in mind that many of the leading companies in the U.S. operate globally, so their growth is not constrained to U.S. growth.", "score": 2, "replies": []}, {"body": "Right. We don't actually produce much value in the US. Much of the growth has been artificial since the 70's thanks to the Fed.", "score": 3, "replies": [{"body": "You think 2020’s US doesn’t produce much more real value than 1970’a US?", "score": 5, "replies": [{"body": "Yes that's a ridiculous statement.", "score": 2, "replies": []}, {"body": "Relative to our level of consumption thanks to phony money, yes.", "score": -1, "replies": []}]}]}, {"body": "Asian stocks outside of China have been getting crushed too", "score": 1, "replies": []}]}, {"body": "What a joke. Another “I told you so” bear that plays the consistently wrong until he’s right game. \n\nAnd he’s going to look like an even bigger fool when this thing resolves on Monday.", "score": 3, "replies": []}, {"body": "No bullshit, I would not be surprised if he was right this time.  Bear calls are easy to laugh at until the bears are right.  Reading the article, he makes a convincing case, just like he did last year.", "score": 5, "replies": []}, {"body": "I do think we'll have a correction for a little bit but 45% is probably too much. These predictions are too lofty and don't have much credibility", "score": 2, "replies": []}, {"body": "The entire basis for his claim is that there is reversion to the mean, but his regression assumes growth is linear when its actually exponential. Look at any long-term market index and you'll see exponential, not linear growth. It's like he forgot what compounding interest is.", "score": 2, "replies": []}, {"body": "Looking at the past to predict the future", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "So Teslas market cap is like 40% of the car market while making 0,1% of the cars, lucid is totally overvalued also..\n\n\nAnd crypto? You see pump and dumps on a Daily basis, a mean look how many meme coins there is with not benefits yet still huge gains over the past year", "score": 7, "replies": [{"body": "I don't agree in regard to TSLA, since cars are only 1 of many segments that they are and will be in.\n\neven if all your reply is correct, my question still hold.", "score": 0, "replies": [{"body": "You don’t think tesla is overvalued ? Really ? Wow", "score": 7, "replies": [{"body": "Seems like most analysts agree on higher PT than the current price", "score": 0, "replies": [{"body": "What is you intrinsic value in them? Since u think they aren fair valued?? I would touch them unless they go below 500 and even then i would think twice before touching them\n\n\nAnd I simply HATE people saying, cars is not their only segment, no but it is 87% of their revenue so let’s be real at the present, to many uncertainties is priced into Tesla, and if any of them fails that stock will tank", "score": 5, "replies": [{"body": "500 is probably where the stocks should be but I bet if it made if back to 500 it would go much lower just based on fear.", "score": 2, "replies": []}, {"body": "Good luck. \n\nTime will tell.", "score": -1, "replies": [{"body": "Imagin thinking Tesla ain’t overvalued without making an intrinsic value\n\nEven with a annually revenue growth of 45% (which is insane), and p/e of 40 in 10 year and \nProfit margin of 11%, discount rate 12,5% (since that’s what i use for growth high risk companies to giver me a better margin of safety)\nTheir valuation still comes below current market price…\n\n\nI would freaking love to see your valuation that says they are fair priced/undervalued!!", "score": 4, "replies": [{"body": "The only way Tesla investors justify the price is with a growing margin from what they see today. \n\nNever mind they have government rebates, a luxury brand margins, somehow when they are making 25% of all cars on earth in 8 years their margins will be near triple what people currently pay for cars.  Only reason I’ve heard is their gigafactories will get more streamlined and vertically integrated.\n\nI don’t see why a competitor wouldn’t be undercutting their price by, oh, $20k a car, but hey, that’s me. It’s sacrilegious to say EVs might not be a great fit for all consumers.\n\nHonestly Tesla is the strongest canary in the coal mine for this crash.  If it’s still strong, we still have a ways to go.  It’s the final boss battle to slay before a true correction.", "score": 3, "replies": [{"body": "Just look at this other dudes argument for them being fair valued.\n\nDoesn’t make valuations himself cuz he is not a “analyst” (bullshit excuse)\n\nThe big bag holders has a higher price target (I wonder fucking why a bag holder would say that) \n\nTesla is more than just a car company (even though 87% of their revenue is from cars, but fair enough, they don’t have the margins to be a tech company either though)", "score": 3, "replies": []}]}, {"body": "I'm not an analyst, but most analyst thinking that their PT is higher than current price", "score": 1, "replies": [{"body": "Do you know why? How often is a 12 month price target correct, almost never, it’s numbers pulled out of a money ass \n\nYou don’t have to be an analyst to make an intrinsic value, it’s a basic tool to calculate your margin of safety? But hey this just goes to show people has no idea that valuations matter", "score": 2, "replies": [{"body": "You're beating a dead horse bro loll.", "score": 2, "replies": []}, {"body": "Time will tell", "score": 1, "replies": []}, {"body": "Who cares about valuation when they’ve made big gains with $TSLA lol.. rather be an idiot making money than a genius who misses out", "score": 1, "replies": [{"body": "I’m not losing money, hell my portfolio is in the green YTD also.\n\nAnd your mindset is textbook greater fool theory good luck in the long run, when we enter another cycle in the market", "score": 0, "replies": []}]}]}]}]}, {"body": "Oh you don’t have any intrinsic value? You just follow what people write in google and that have made you good short term gain on Tesla well done…", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Grantham trying to prove he is still relevant but don’t have a clue of the exponential growth and eco social influences of crypto or fintech", "score": 2, "replies": []}, {"body": "The guy is 83…", "score": 1, "replies": []}]}, {"body": "I agree with the commodities being over valued sentiment. Over the last month there was a run toward commodities. The problem being that every commodity had seen a massive run up due to pandemic dynamics.\n\nWeirdly, precious metals hadn't done anything throughout this wild inflationary period. They should not fair any better as rates raise. Precious metals may never again be used as a storage of wealth.\n\nCrypto may have ended up being one huge pump and dump, fueled by inflation.\n\nAnd Japan hasn't been relevant to an investor since the days Wesley Snipes featured in movies.", "score": 0, "replies": [{"body": "Maybe worst take on this thread", "score": 1, "replies": [{"body": "The Japan part was mostly a joke. Needed a reason to reference Wesley Snipes.\n\nOther than that, what part am I wrong about?", "score": 1, "replies": []}]}]}, {"body": "Why didn't he say it when markets were 10% higher? Lol... False prophets will come out to teach you.", "score": 0, "replies": []}, {"body": "Dont invest in emerging markets unless you know what you are doing.  Dont pull a Peter Schiff.", "score": 1, "replies": []}, {"body": "\\*facepalms\\*  \n\n\nI think I've said more than once in this subreddit just how much I loathe the term \"bubble.\" Not what it's supposed to represent in market terminology, mind you, but the fact that both the \"experts,\" and people who like to sound like they are, use it all the time. It's being thrown around in every post and I'm thinking to myself \"welcome to hell.\" It's like O'Hagen threatening to pistol whip the next person who says \"shenanigans.\"", "score": 1, "replies": [{"body": "I'm pretty sure a guy that has been investing for like 50 years knows what a bubble is", "score": 2, "replies": [{"body": "Not saying he doesn’t. I just hate that term because everyone uses it", "score": 1, "replies": [{"body": "Just because some people over use it doesn't mean no one can ever legitimately comment on it lol.  This guy is qualified at least.", "score": 1, "replies": [{"body": "I know. But I'm saying EVERYONE is using it now and you can tell who isn't an expert throwing it around to get upvotes. It drives me nuts", "score": 1, "replies": [{"body": "I mean you were responding to a thread about someone who is an expert saying it, so one would assume you are referring to the topic of the thread", "score": 1, "replies": [{"body": "Just dismay in particular for that word, totally meant to be lighthearted mostly. We kinda need that in all of this doom and gloom flooding the subreddit", "score": 1, "replies": [{"body": "Doom n gloom 2022, lets hope we all survive it", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I like how Grantham includes some of his history here.  Basically, as a young investor he got badly burned by a bursting bubble.  So it looks like he got very strongly emotionally affected by it, which would explain why he's always seeing bubbles about to burst.\n\nHe could be right this time.  Or he could be wrong.  I won't pretend to know, which is why I just have stuff I will hold in good times and bad, and keep adding regularly whether bear, bull, or any other animal.", "score": 1, "replies": []}, {"body": "Commenting to check back on this in a year. But I think after January ends, the market could stabilize. Once Hedge Fund redemptions from the poor performance of 2021 is finished, the slide could be done. There is a lot of liquidity that has no where to go but back into the market as February starts. Nasdaq is already down almost -15%, the economy is not shutting down like it did in 2020 which caused a drop of -30%. Interest rates are still super low, and inflation is the stock market's friend. Jeremy Grantham has seen a lot 🌈🐻, but the current market conditions of such low interest rates and so much new money in circulation has not existed before in his 83 year life.", "score": 1, "replies": [{"body": "Did hedge funds have a bad year in 2021? I think on average they were at 11% or something", "score": 1, "replies": [{"body": "This article says the hedge fund industry returned a measly 5% in 2021, far below the S&P 500 return of 28.7%, including dividends.\n\nWhen they say industry returns, I guess it depends on if they are doing a a simple average where they just take the return of each fund and average it, or a weighted average taking into account the size of capital undermanagement. Here I think they use the weighted average, a better reflection of the industry as a whole.\n\n[https://www.bloomberg.com/news/articles/2022-01-17/tci-leads-top-hedge-funds-creating-record-65-4-billion-in-gains](https://www.bloomberg.com/news/articles/2022-01-17/tci-leads-top-hedge-funds-creating-record-65-4-billion-in-gains)", "score": 1, "replies": []}]}]}, {"body": "\"As of today, the U.S. has seen three great asset bubbles in 25 years, far more than normal. I believe this is far from being a run of bad luck, rather this is a direct outcome of the post-Volcker regime of dovish Fed bosses...\" \n\nWhat a line", "score": 1, "replies": []}, {"body": "Can we always add a little disclaimer about these guys and their opinions by at least pointing their ability to beat the S&P500?", "score": 1, "replies": []}, {"body": "Puh it will be painful when all these punishments have been levied on non-EVs here in the EU and then the financial part of EVs collapse. But frankly it’s too absurd to continue much longer, I’ll be glad if society gets a cold shower on that.", "score": 1, "replies": []}, {"body": "RemindMe! 3 months", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2022-04-21 10:44:20 UTC**](http://www.wolframalpha.com/input/?i=2022-04-21%2010:44:20%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/s8whnc/jeremy_grantham_let_the_wild_rumpus_begin/htl0brq/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fs8whnc%2Fjeremy_grantham_let_the_wild_rumpus_begin%2Fhtl0brq%2F%5D%0A%0ARemindMe%21%202022-04-21%2010%3A44%3A20%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20s8whnc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Boomer predicting 134 crashes throughout past 10 years. And he will be right this time.", "score": 1, "replies": []}, {"body": "He’s describing deflation across the board. The exact opposite of what he claims to be the problem. \nMy guess, the fed will tighten enough and scare people into a slowdown and then have to reflate it all. This might be a 6-9 month process. \nBuy qualify, with reasonable multiples, and average in as it goes down. \nFor those wanting to short trade, learn to short.", "score": 1, "replies": []}, {"body": "As someone who started investing in Feb 2020, and then saw the Market crash the following month (along with my money), it would like to know why the VIX is way down compared to that time if we are in a super bubble?", "score": 1, "replies": []}, {"body": "Tldr; everything is bad, but keep holding everything.", "score": 1, "replies": []}, {"body": "He’s been calling for a crash for 3-4 years.  He’s a Doomer.", "score": 1, "replies": []}, {"body": "If you keep calling for a crash often enough, you'll eventually be right. Just like a broken clock.", "score": 1, "replies": []}]}
