{"title": "$SPY $QQQ $IWM $DIA $VIX end of day flows at the close on Friday...", "selftext": "$SPY $QQQ $IWM $DIA $VIX Bubble Flow and P/C Ratios as of the close on Friday. Included are also the Risk Ranges Alerts, Flow Triggers and Portfolio Hedge Factors.  Sorry for the lack of commentary as I have family obligations today Sunday 8/1 but will try to answer any questions in the comments below. Have a Great Sunday folks!\n\n&#x200B;\n\nhttps://preview.redd.it/uuhohqbslre71.png?width=1140&format=png&auto=webp&s=7acb31b76aa61af45a10988d1e6ff288871f914a\n\n&#x200B;\n\nhttps://preview.redd.it/56ps2c9zlre71.png?width=1774&format=png&auto=webp&s=60ea681f1004b339ade850ece3e08a3205004438\n\n&#x200B;\n\nhttps://preview.redd.it/mmu1mtsslre71.png?width=1149&format=png&auto=webp&s=531547bf12fc8a06ea7b25d3a0320b961fe3c782\n\n&#x200B;\n\nhttps://preview.redd.it/7xxw5c6tlre71.png?width=1152&format=png&auto=webp&s=416fd7267832a09bf490a8f53b7c30d54302719d\n\n&#x200B;\n\nhttps://preview.redd.it/tzmn80m0ote71.png?width=1765&format=png&auto=webp&s=1de24dd00d843f41aed406f5343893a90add1d35\n\n&#x200B;\n\nhttps://preview.redd.it/0rwbjq81ote71.png?width=1158&format=png&auto=webp&s=48bebd1ce9f02e82f64190ba2ac7e209e6a16a2e\n\n&#x200B;\n\nhttps://preview.redd.it/3d3sd9t1ote71.png?width=1768&format=png&auto=webp&s=83026e8053898d06014286199285390c5790da3c\n\n&#x200B;\n\nhttps://preview.redd.it/hppu8aa2ote71.png?width=1256&format=png&auto=webp&s=877dce8fa559849c5c4a2f6a59fee5cd02846493\n\n&#x200B;\n\nhttps://preview.redd.it/o2b7ofq2ote71.png?width=1259&format=png&auto=webp&s=88aef8faf7fd08718df3dee350b5e7ada9d01000\n\n&#x200B;\n\nhttps://preview.redd.it/ngi58m43ote71.png?width=1252&format=png&auto=webp&s=fdf64cc9436155171aaf373cf27e60413cdcc6ba\n\n&#x200B;\n\nhttps://preview.redd.it/vig2pvi3ote71.png?width=1254&format=png&auto=webp&s=7deedd79c05c7f3e734ea046507f04232f158687", "id": "ovub2q", "created_utc": 1627832238.0, "score": 25, "upvote_ratio": 0.83, "num_comments": 41, "comments": [{"body": "Is spy gona rally this week from tech ER?", "score": 7, "replies": [{"body": "Idk Amazon shit the bed", "score": 4, "replies": []}, {"body": ">I feel like the market is playing chicken seeing whos going to jump first. From the positioning I've been seeing the the big players are already positioned for whatever outcome The flows look to me like the roulette wheel in Vegas they have almost every number covered across the indexes and the the VIX has seen some flow that covers their asses until the end of the year. It pretty crazy to look at, been scratching my head. Go check out some of my previous post to get an idea of the positioning. I have been tracking all the flow on my Twitter prior to joining Reddit (I'm new here) btw if you want to go further back... https://twitter.com/LocustFunds", "score": 2, "replies": []}, {"body": "I don't think so, more like sell off is coming", "score": 5, "replies": [{"body": "/ES has had big boy orders up at 4440 for almost a week and a half. I wouldn't be shocked if we see that before any significant dump.", "score": 6, "replies": [{"body": "End of the month and 1st couple days of the beginning of the month are usually bullish days. From the positioning I've been seeing the the big players are already positioned for whatever outcome The flows look to me like the roulette wheel in Vegas they have almost every number covered across the indexes and the the VIX has seen some flow that covers their asses until the end of the year.", "score": 1, "replies": [{"body": "Some storm is brewing", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "SPX futures", "score": 5, "replies": []}, {"body": "First day?", "score": 1, "replies": []}]}]}, {"body": "Puts it is", "score": 4, "replies": [{"body": "You’re convinced that easily? Jesus", "score": 5, "replies": [{"body": "Look at China index", "score": 1, "replies": [{"body": "China shakedown duh?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Thanks OP this is dope. Are you making these charts yourself or pulling from some software or service that automates them?", "score": 3, "replies": [{"body": "I pull all this data from the Options Matrix. The data is second to none, so many tool and metrics for tracking positioning as well as the real strength in the positioning. It stream live option flow by the millisecond. If you are interested in checking it out message me.", "score": 2, "replies": []}]}, {"body": "🐻🐻🐻🐻🐻", "score": 3, "replies": []}, {"body": "So calls or puts? I only see colorful circles", "score": 5, "replies": [{"body": "Red = Puts\n\nGreen = Calls\n\nP/C = Put/Call Ratio\n\nPuts lead calls in $SPY $IWM $DIA. $QQQ were a push hence closed delta neural", "score": 2, "replies": []}]}, {"body": "Option flow is the most useless tool in the market, yet retail thinks it’s their savior", "score": 5, "replies": [{"body": "Thoughts on www.spotgamma.com? Their levels historically tend to be pivotal", "score": 0, "replies": [{"body": "Nothing wrong with Spot Gamma. I use the Options Matrix. Its on a whole other level in my humble opinion.", "score": 1, "replies": []}]}, {"body": "If you don’t mind me asking what makes you say that?", "score": 0, "replies": [{"body": "Because let’s take a call flow for example, you can’t tell if it’s a call but, a naked short call, a hedge against 100 short shares, or a spread. All you know is someone bought or sold some calls, not what the intended purpose is.", "score": 3, "replies": [{"body": "Every options trade has a buyer and seller right?  This platform has the aggressor data. Its the baked into the energy metric. Aggressor is who was bidding harder - buyer or seller. Therefore by tracking the aggressor flow buyers and sellers you can gauge in which direction the flow is moving hence asset direction in my humble opinion. This platform also calculates actual price vs theoretical price on the spot. I myself don't know of any other platforms available to retail that  has Theoretical price calculation or Aggressor side data.", "score": 1, "replies": [{"body": "Sure, but that doesn’t take away from what the intended purpose for these contracts may have been, in that it’s completely vague to the his bias of the buyer", "score": 3, "replies": []}, {"body": "This is not entirely correct.  You can't actually tell who the aggressor is, you can try to infer the aggressor based on the strikes and time of execution but it is just an educated guess.  And it seems this is baked into the energy metric.  But the bubble chart doens't take this into account.  However, it is generally true that overwhelming puts executed (regardless of who the aggressor is) is bearish and overwhelming calls traded is bullish.  There are many other tools like this FYI.", "score": 2, "replies": []}]}]}]}]}, {"body": "$SPY $QQQ $IWM $DIA $UVXY $VXX GEX at the close on Friday...\n\nhttps://www.reddit.com/r/Daytrading/comments/ovu2w1/spy\\_qqq\\_iwm\\_dia\\_uvxy\\_vxx\\_gex\\_at\\_the\\_close\\_on/", "score": 1, "replies": []}, {"body": "Spy’s gonna get very ugly very soon", "score": -5, "replies": [{"body": "Why you say that?", "score": 5, "replies": [{"body": "Because if you say it every other day you won’t be wrong.", "score": 13, "replies": []}, {"body": "Because the economy is about to be exposed just remember it his comment.", "score": -2, "replies": []}]}]}, {"body": "Anyone have a link or something as to what this means and how I can use it?", "score": -1, "replies": [{"body": "Red = Puts\r  \n\r  \nGreen = Calls\r  \n\r  \nP/C = Put/Call Ratio\r  \n\r\r  \nPuts lead calls in $SPY $IWM $DIA. $QQQ were a push hence closed delta neural", "score": 1, "replies": [{"body": "So in spy iwm and dia there's greater anticipation of a correction than in QQQ? Thanks", "score": 0, "replies": [{"body": "I feel like the market is playing chicken seeing whos going to jump first. From the positioning I've been seeing the the big players are already positioned for whatever outcome The flows look to me like the roulette wheel in Vegas they have almost every number covered across the indexes and the the VIX has seen some flow that covers their asses until the end of the year. It pretty crazy to look at, been scratching my head. Go check out some of my previous post to get an idea of the positioning. I have been tracking all the flow on my Twitter prior to joining Reddit btw if you want to go further back... [https://twitter.com/LocustFunds](https://twitter.com/LocustFunds)", "score": 2, "replies": [{"body": "Yeah it seems like the market is going to crash any second at this point", "score": 0, "replies": []}]}]}]}]}, {"body": "SPY is rumored to dip to $420 to $426 any time from now till December 31. I'm not touching SPY with a ten foot pole", "score": -9, "replies": [{"body": "You scared of a 5% dip over 5 months!?!?", "score": 8, "replies": [{"body": "SPY is already dropping several dollars here and there. Not a good thing if you're doing options", "score": -2, "replies": [{"body": "Dude SPY just hit all time highs on Thursday. What on earth are you on?", "score": 11, "replies": []}]}]}, {"body": "“Rumored” wtf does that even mean?", "score": 3, "replies": []}]}]}
{"title": "GUSH TA Where we go from here?", "selftext": "We all know the price of gas is going up meaning the price of oil is going up. Maybe we can offset the high price of gas we pay at the pump with some oil tendies. I found a trend in the chart with GUSH that would put the stock at 110 a share around SEPT 15th. The chart has been in a upward trend this past year and I see it to continue. With  oil prices on the rise oil companies are seeking oil rich areas in the Eagleford shale, Permian basin and Delaware basin.\n\nAnalysts are predicting oil production to rise into 2022\n\nLooking ahead, Goldman Sachs sees Brent prices averaging above $80 in the third quarter, with potential spikes “well above” that level as demand comes roaring back. JPMorgan, meanwhile, expects crude oil prices to “decisively” break into the $80s during the final three months of the year.  Analysts at Bank of America are even more bullish. They argue Brent prices could see $100 in the summer of next year. That would mark a return to triple digits for the first time since 2014.  It comes as all three of the world’s main forecasting agencies — OPEC, the International Energy Agency and the U.S. Energy Information Administration — expect a demand-led recovery to pick up speed in the second half of 2021.March 2021, which is 1.4 million b/d more than February. The EIA estimates U.S. crude oil production rose to 10.9 million b/d in March and almost 11.0 million b/d in April..It's estimated that U.S. crude oil production will average 11.9 million b/d in 2022.\n\nI drew some trend lines here on my webull chart where I'm predicting the price to be around sept 15. I noticed at around feb 1 that the stonk was roughly $50 a share. It rose $40 higher to top out roughly $90 a share and then fell $30 to bottom around 60 a share. . The stock continued this pattern to top out $10 higher a share each time and, to fall and stop $10 higher than the last bottom. All dips at lows around two and a half months apart. Plus its just started to come out of over sold on RSI\n\nhttps://preview.redd.it/sasan9g3foe71.png?width=2460&format=png&auto=webp&s=9e62827aa5c1ce9eb714f439b7f3aef67e57450c", "id": "ovltja", "created_utc": 1627792830.0, "score": 13, "upvote_ratio": 0.68, "num_comments": 41, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|4 months ago\n**Total Comments**|19|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/ovgacl/gush_dd_energy_play_for_tendies_degenerates/) \n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Imagine doing TA on a 3x leveraged ETF that does daily rebalancing. \n\nYou do know that this is a derivative?", "score": 8, "replies": [{"body": "Yeah i seen that it was leveraged. Im looming more to see what people thought about it before i buy in. Im not gonna yolo or diamond hand this play. Probably one call 80 strike exp 9/17", "score": 1, "replies": [{"body": "U know what daily rebalancing mean? \n\nU do realise there’s no such things as “support” or “resistance” level for a leveraged derivative product that do rebalancing on a daily basis? \n\nIf you don’t get why, let me just condense it down for you - why does nobody do TA on any call option price? \n\nDo you do TA on a call option or do you do TA on the underlying?\n\nJust humor me and read this \n\nhttps://www.investopedia.com/articles/financial-advisors/082515/why-leveraged-etfs-are-not-longterm-bet.asp", "score": 3, "replies": [{"body": "No sure i sure don't. Im not trying to talk people into buying into this but more to see if its a good play or not. Im judging from your response its not. You say you can't use support and resistance but its fallowed the support and resistance the past 5 months", "score": 1, "replies": [{"body": "No, it’s 2 different things. \n\nIt could be a good play but it’s not because “support” or “resistance” held. \n\nSupport resistance happens where there is strong demand/supply areas and traders literally look at price level and determine that to be a good price to buy or sell. \n\nIf you can understand why option pricing has no support or resistance you’ll understand why TA on GUSH is pure nonsense. \n\nThe price on GUSH has nothing to do with demand and supply and everything to do with the underlying shares. \n\nTA is basically trying to decipher what’s the supply/demand relationship.", "score": 3, "replies": [{"body": "Im a retart and still having issues figuring it out. Im at Walmart right now but when i get home im gonna sure dig deaper. I figure if oils doing good and large oil companies are making money how could this etf go down. Almost sounds like its a scam stock or that a person is pretty much gambling red or black buying in on it .", "score": 1, "replies": [{"body": "It’s not a scam stock. But the quirk of daily rebalancing can fuck u up. U need to understand how it works and what it does to the price. \n\nI was long GUSH myself during the run up to 100 from 40 last year.", "score": 3, "replies": [{"body": "Whats your opinion on the next month?", "score": 1, "replies": [{"body": "I don’t see straight continuous bull run in underlying shares that GUSH needs to move higher. \n\nI do see oil price higher. \n\nBtw daily rebalancing of 3x leverage means if you have down up down up down up days in the underlying shares you end up losing money. You can read the link I gave u which explains why it happens\n\nThe reason u lose money is not because of the leverage but rather because of the rebalancing. You’re literally recognising what should have been a paper loss.", "score": 3, "replies": [{"body": "Yes sir i read it but dont understand it as much as id like to. Ive been working the oilfield the last 15 years of my life so im not the smartest guy in the world but i have a little money to play with. I'll probably scrap the option play and buy a share and watch where it goes. Im gonna read up and watch some youtube vids to understand levraged etf more in-depth", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Lol thanks for sending that i humored you and read it . From what i read i could get a better return or i can get a worse one. All kidding aside i value your option thanks", "score": 1, "replies": [{"body": "The info you’re supposed to understand is the daily rebalancing", "score": 3, "replies": [{"body": "Maintaining a constant leverage ratio, typically two or three times the amount, is complex. Fluctuations in the price of the underlying index change the value of the leveraged fund's assets, and this requires the fund to change the total amount of index exposure.", "score": 1, "replies": [{"body": "Exactly. \n\nI.e price level of GUSH is based on whatever you’ve copied and paste here and has nothing to do with demand and supply. \n\nTA is a technique that helps to determine supply and demand. Hence “overbought” vs “oversold” levels, support is where many buyers previously bought and may be interested to buy again. Resistance is where sellers sold and may be interested to sell again.\n\nGUSH price is not a result of demand supply relationship.", "score": 2, "replies": [{"body": "I don't think I'll ever understand daily balancing and the way that GUSH functions like you but I'm learning more, From what I'm seeing is the main problem with daily balancing is the fees associated with it. Like if you had 30% stock , 30% bonds, 30% in cash and 10 percent is gold and if those percentages change like 20 % stock and 45 in bonds they rebalance them to original percentages. Is that close/?", "score": 1, "replies": [{"body": "No it’s not the fees. \n\nSay when stock drop 5% today and rebound back tomorrow. You are @ breakeven. \n\nHowever in daily rebalancing. If stock drop 5% today and rebound back tomorrow, you lose money because you took loss on first day instead of paper lose in the first scenario.", "score": 2, "replies": [{"body": "These type of etfs sound like a good investment after a market crash once recovery starts. I was looking at the other 3x and 2x etfs and they all had huge swings", "score": 1, "replies": [{"body": "It works when there’s strong directional movements - few consecutive up days or down days. \n\nWhen it has up down up down whipsaw movements even if it ends up more up than down ultimately you may be underwater due to them recognising profit or loss on a daily basis. \n\nIn such situation go buy the underlying shares and trade on margin. Or go buy calls of the underlying shares.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "All sounds great but what if delta variant goes crazy this fall and winter and things begin to shut down in the US and the rest of the world may shut down as well as we head into another COVID winter. Just a thought 💁🏽‍♂️", "score": 5, "replies": [{"body": "I hear man. Theres a number of things that could mess the play up. I'm not gonna get in too deep on it. I was gonna buy one contract  80 strike exp 9/17", "score": 1, "replies": []}, {"body": "Good call on that delta variant. I look to be feeling some effects from it. I bought 1 85 strike  exp 9/27. Kinda tankin on me now. Had to get at least one to try out the TA", "score": 1, "replies": []}]}, {"body": "Biden shut down drilling and fracing on fed lands?", "score": 3, "replies": [{"body": "I don't think so, I know people still doing it right now, they may have limited leases but they have not banned it.  \n\nYes they paused new oil leases but there are tons of oil leases already going on and probably for a good amount of time into the future.  It is probably more of a false show then anything else, just appeasing to some of his people till they look the other way.", "score": 3, "replies": [{"body": "Exactly right. It's a boom in NMs Lea and Eddy counties.", "score": 2, "replies": [{"body": "Ya I was down there for a long time till covid, this time away has been nice and I probably won't go back.", "score": 2, "replies": [{"body": "What did you do out there?", "score": 3, "replies": [{"body": "Frac, toe prep, cement, during various times.  It was a great a great time and I miss it but being home is pretty fun as well.", "score": 2, "replies": []}, {"body": "I work for DES solids control. I was around pyote but I'm gonna get put on another rig . Hopefully where I got phone service", "score": 2, "replies": []}, {"body": "What kinda work do you do?", "score": 1, "replies": [{"body": "I'm a geologist. Fontunate to have survived the bust last year and now we're busy AF again.", "score": 2, "replies": [{"body": "I was on a rig with a mud logger that was a geologist for Admiral but they ended up laying him off when covid hit. I got laid-off  for about 5 month then when to work on a callon rig in late october", "score": 1, "replies": []}, {"body": "I hope natural gas takes off again. I'd really like to go back to east Texas. I like having a walmart in 30 min distance no matter where you drill. Bad part is working with high mud weights like that its hard to control low gravity solids. Plus its hot hole. We were getting 215 degrees out of the flowline. We had to use a aluminum vis cup because the normal plastic ones melt", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Your right boss. Thanks for the correction", "score": 1, "replies": [{"body": "They put a 2 month temporary halt on leasing a few months back, but we're back to leasing drilling and fracing. It's a boom in the Delaware right now. Rigs. Everywhere. But it's the private equity companies picking up rigs. The public ones have held activity fairly steady this year and plan to until 2022 so as to not grow production in an environment where OPEC is holding millions of bbls back. I like EOG and DVN. Both have great balance sheets and last quarter issued a special dividend when oil averaged 53ish a bbl for the quarter.  I'd expect the same this quarter with oil much higher now, unless they fork over cash for some of Shells acreage in the Delaware.", "score": 3, "replies": []}]}]}, {"body": "Can you do some TA on playing Russian roulette?", "score": 2, "replies": [{"body": "You can do TA on anything that has nipples", "score": 1, "replies": []}]}, {"body": "🤣", "score": -1, "replies": []}]}
