{"title": "$SPX $SPY broke out of its range. Fridays end of day flows, GEX and a few charts.", "selftext": "&#x200B;\n\n[$SPY Bubble Flow](https://preview.redd.it/ljythi5c31g71.png?width=470&format=png&auto=webp&s=511f916e9c04983de3a42f4b96d4e2683f37499a)\n\n&#x200B;\n\n[$SPY P\\/C Ratio. Puts slightly leading calls in premium.](https://preview.redd.it/0hfrdw7d31g71.png?width=1757&format=png&auto=webp&s=b39d218b5d12b89271cd8f589a39595ec276dc9a)\n\n&#x200B;\n\n[$SPY Trade Tape page 1 of 2](https://preview.redd.it/fzolbgod31g71.png?width=1762&format=png&auto=webp&s=570f8193acc2d061e1267e3107400574519fd9dd)\n\n&#x200B;\n\n[$SPY Trade Tape page 2 of 2](https://preview.redd.it/0vpcw70e31g71.png?width=1762&format=png&auto=webp&s=313d2c5b9e3766310e9d5a4f9ca233766bb76e13)\n\n&#x200B;\n\n[$SPY GEX. Gamma squeeze\\/melt up continues.](https://preview.redd.it/j93dgy5h31g71.png?width=1767&format=png&auto=webp&s=8ca43eeb41fb9ae997bc0443f879969f8ac563f8)\n\n&#x200B;\n\n[$SPY Live OI Chart. SPY GEX chart confirming we are in a gamma squeeze. VF, MF and Power Blocks not confirming the move but of course price is all that matters.](https://preview.redd.it/xuw1jdhk31g71.png?width=1656&format=png&auto=webp&s=132f2cc0eb3c9b9262ce7707901f0f4ac16b3a3c)\n\n&#x200B;\n\n[$SPY Live Chart marked up.](https://preview.redd.it/e4xoy7qm51g71.jpg?width=1656&format=pjpg&auto=webp&s=660f9cb48c044747e48ecce12bc4f4771ff7cd11)\n\n&#x200B;\n\n[$SPY Daily BB Chart. Burning thru the negative divergence but MF and MO continue to wain here.](https://preview.redd.it/rf3ljqwi31g71.png?width=1633&format=png&auto=webp&s=946f7286efe1b845aaacd821abe7d81368306a2e)\n\n&#x200B;\n\n[$SPY 1 Hour View. Breakout in progress, key short term levels. ](https://preview.redd.it/es7jb2az91g71.png?width=1633&format=png&auto=webp&s=25e8eb544ce13a6e9a97cd33cc45e1c20670f41d)", "id": "p04zgo", "created_utc": 1628383594.0, "score": 78, "upvote_ratio": 0.82, "num_comments": 41, "comments": [{"body": "OP, you are missing a crucial piece of information, each quarter JPM has a passive investment ETF that opens a gigantic put spread collar every quarter. In the SPX, they are short 45k cons 3450P, 4420C, and long 4150P - something like that, can’t remember. It’s effectively pinning the whole index, similar thing happened in June. Gonna take a good amount of effort to overcome the wall of gamma they have supplied dealers across the street\n\nEdit: Also OP not familiar with your chart so not seeing this clearly, how is that one chart you posted showing clearly “confirming we are in a gamma squeeze”", "score": 32, "replies": [{"body": "I believe they are now doing a monthly trade instead of quarterly.", "score": 5, "replies": [{"body": "Yes this is correct, they have changed over, nice catch!", "score": 2, "replies": [{"body": "Do you follow the Croissant?", "score": 2, "replies": [{"body": "🤫🤫 yes, don’t let the secret out", "score": 2, "replies": [{"body": "=X", "score": 2, "replies": []}]}]}]}]}, {"body": "Which ETF is this? Do you any have any links to info?", "score": 2, "replies": [{"body": "JPM hedged equity funds", "score": 3, "replies": []}]}, {"body": "Hey, any chance you could explain why this pins SPY? And how can this be broken as now they do this on a monthly basis.", "score": 1, "replies": [{"body": "They are long gamma bro, so they sell the rips, and buy the dips, hence the 📍\n\nEdit: can be broken by getting and staying over 4220 SPX significantly and for some duration, basically need buyers to step in and overcome dealer positioning, not easy to do, but we appear to be close", "score": 3, "replies": []}]}]}, {"body": "I love your charts but I have no idea what's going on in any of them. Lol. Expand on gamma squeeze? I'm new.", "score": 48, "replies": [{"body": "I think it means calls till jpow stops the printer", "score": 33, "replies": [{"body": "Fantastic, I have buttons on my phone for that!!!!", "score": 28, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "For the record I am not a bull or a bear, I am a full time trader. I trade both long and short on a regular basis. Most days I have 0 idea what the price is headed until I receive a signal.  \n\nI am simply tracking the data, presenting it as it is nothing more nothing less and that data suggests that there has been ongoing positioning according to the live flow that deep pockets have been buying put call spreads across all indexes as well as calls in VOL. The data also suggests that the weighting is heavily shifted to put side. \n\nThe kind of money going into this is not retail. It very well may be a hedge but until those positions get unwound I would think anyone looking at the data would proceed with some caution here imho. Just my two cents anyway.", "score": 13, "replies": [{"body": "Well, your charts are beautiful. And puts are indeed outweighing calls, which is odd as calls are usually up 2:1 over puts. Betting on things going down is always risky, but there is a consistent theme.", "score": 8, "replies": [{"body": "People are paying up for JHole protection.  Watch it go away after...", "score": 1, "replies": []}, {"body": "I actually think this is false. The ongoing put:call ratio for SPX is 1.75.", "score": 1, "replies": [{"body": "That's my bad then. I haven't seen a chart of P/C ratio, just anecdotally flipping through them the ratio is fairly low. That's my mistake for pretending I knew something I didn't. \n\nIs 1.75 a long term P/C ratio?", "score": 1, "replies": [{"body": "It’s the average over many years. When it reaches 2 and above it is usually aligned with much higher volatility.", "score": 1, "replies": []}]}]}]}, {"body": "It’s hard to look at one data set and make a macro statement.  I’m betting we grind higher but still short es futures.  Removing systematic risk helps me sleep\n\nPerhaps you could account for that by including an executive summary of where other money flow is going eg Russel +$2B (2.3%) WoW.\n\nAlso the bubbles are misleading.  OTM options are cheap so ppl buy lots of them, etc. It would be interesting to normalize the cash flows and account for contracts notional value.  For instance, buying 2 x ATM puts shows more confidence that eg 4 x deep OTM puts\n\nLastly, consider including a link to a GitHub read me page that explains the calculations and links to detailed explanations", "score": 4, "replies": [{"body": "If you care to take a look at my other post (as well as older posts on my profile) specifically coving other index flows. Just posted this $IWM flow report. [https://www.reddit.com/r/StockMarket/comments/p0dzt1/iwm\\_russell\\_small\\_caps\\_remains\\_the\\_laagered\\_end/](https://www.reddit.com/r/StockMarket/comments/p0dzt1/iwm_russell_small_caps_remains_the_laagered_end/)\n\nI will be also putting something together on the QQQ later if you care to circle back.", "score": 2, "replies": [{"body": "$NQ $QQQ Report... https://www.reddit.com/r/options/comments/p0gnhv/nq\\_qqq\\_friday\\_end\\_of\\_day\\_flow\\_gex\\_risk\\_range\\_2x/", "score": 1, "replies": []}]}]}]}, {"body": "Underlying data and tracking flows is not \"monkey scratch\".  The trades identified and presented are most likely parts or contingents of more complex trades/strategies.  Blindly entering a trade based on a single alert is a recipe for disaster in general. Do your own DD.", "score": 4, "replies": [{"body": "This makes a ton of sense", "score": 1, "replies": []}]}]}]}, {"body": "OP, can you please state your conclusion? What kind of range did it break out of? What does that mean etc.?", "score": 15, "replies": [{"body": "Means that spy is breaking out of a range (channel) that it has been in for a while. When range breaks after periods of consolidation price has the ability to make a directional move - in this case, likely to the upside.", "score": 13, "replies": [{"body": "I think in order for this to happen, MFAGA needs to continue it's rise unless they let the big banks take their place and then some. If somehow MFAG did continue it's rise, it would be the first time it happened this year after earnings.\n\nPlus, look at the charts around this time 3 months ago. Essentially an identical run up/peak. But I'm typically wrong.", "score": 4, "replies": [{"body": "Don’t worry, I’m typically wrong too! For another fun example you can look at the Tesla 2hr chart. I bought Fd’s last week thinking it would break to the upside and you can probably guess how that went.", "score": 2, "replies": [{"body": "Dude same! I love losing money on tsla!", "score": 3, "replies": []}, {"body": "Everything that can go wrong usually does go wrong.\n\nThose AMD guys also got hammered.", "score": 2, "replies": []}]}]}]}]}, {"body": "How can anyone go against Brrr Brrr ? J Money won't stop and he ain't gonna stop", "score": 5, "replies": [{"body": "Yes, They can even reverse it and the FED doesn't print paper curency the Treasury Department prints money.", "score": 4, "replies": []}, {"body": "How? Because printing $ doesn't do shit at some point. We are at that point, imo. They created reverse repos in order to not let inflation run wild. They didn't exist a year ago, now it's always near 1T. Honestly? They fly by the seat of their pants. They don't really know wtf they are doing anymore. No fiat economy has ever become this insane in human history.", "score": 1, "replies": []}]}, {"body": "very interesting content, hadn't seen the bubble chart call/put format before. if you don't mind me asking, what tools are you primarily using to look at this data, and are these screenshots from a tool or are you manually creating the visualizations?", "score": 5, "replies": [{"body": "It’s the OptionMatrix by vigtec", "score": 3, "replies": []}]}, {"body": "The FED is going to start buying less TRESURY SECURITIES this month", "score": 8, "replies": [{"body": "Lul unemployment is still too high. How many times does JPow have to repeat himself before you guys actually believe he isn't going to do that?", "score": 17, "replies": [{"body": "They aren't decreasing the buying substantially and the employment report increased by 1 million people   and we have 2 big market crashes around September 2000 and 2008 but who knows what this year will bring, be vigilant.", "score": 10, "replies": []}]}]}, {"body": "I think we’ll see $spy 445 before the next cool down", "score": 1, "replies": [{"body": "I saw some 445-447 flows during the week.", "score": 1, "replies": []}]}, {"body": "Not very familiar with these indicators.  However in several of the sequent counters (based on Fibonacci retracements) plus each platform overlay both the SPY & QQQ hit a hard sell signal on Friday.  The SPY got there first on Thursday the Q’s on Friday and the DIA is only 2 days away.  Inversely the UVXY & VIXY both also hit all time lows on Friday.  Could equities continue to rally, sure but do feel unlike other times when it decides to retract it’s gonna be fast & hard.  Rates are also very jumpy. At the very least it’s all setting up for the culmination of this summer rally maybe more.  Buckle up", "score": 1, "replies": []}]}
{"title": "Expected moves this week, SPY, Robinhood., Coinbase, NIO, Palantir, Disney and more.", "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was higher by about 0.7% vs the 1.0% expected move options were pricing.\n\n**This Week – SPY** options are pricing less than a **1%** move (in either direction) for the upcoming week. That corresponds to about **$438** as a *bearish expected move* and **$446** as a *bullish expected move*.\n\n**Implied Volatility** – The VIX was lower on the week from around 18 to close Friday near 16. That is below its historical average and index/etf expected moves for the next week are tight as a result.\n\n**Expected Moves for This Week** (via Options AI)\n\n* SPY **0.8%**\n* QQQ **1.1%**\n* IWM **1.9%**\n* DIA **1%**\n\n&#x200B;\n\n### In the News\n\nRobinhood (HOOD) options were listed on Wednesday and the stock joined the ranks of the meme stocks, at least for a few days. The highest strike originally listed was $70, and initially, there were only monthly expiries. As we’ve seen in other meme stocks, the highest call strike becomes popular in retail, and $70 was where the stock closed on Wednesday as short gamma ran out above that level. The stock finished the week at $55. Weekly options and higher strikes have now been added (as high as $170). The $70 strike, August 20th remains the strike with the most open interest as of now.\n\nSkew to the upside is sharp, with the 55 calls expiring this week around 155 IV, while the 75 calls are around 205 IV. Translation, positions that buy nearer to the money and spread by selling OTM are favorable cost/skew. The expected move for this week is about 15%:\n\n&#x200B;\n\nhttps://preview.redd.it/c84e4kfhj5g71.png?width=569&format=png&auto=webp&s=76171e8657cee7cfb9a5724ec9496ffa2e323917\n\n### Expected Moves for Companies Reporting Earnings\n\nSome earnings of note this week include Palantir, AMC, Disney, and Coinbase. Expected moves are important as both a gut check for risk/reward as well as strike selection. Links go the Options AI calendar where you can search for other stocks as well.\n\nMonday\n\n**Trade Desk** TTD / [Expected Move: **8.6%**](https://tools.optionsai.com/earnings/TTD) / Recent moves: -26%, +7%, +27%\n\n**Workhorse** WKHS / [Expected Move: **12%**](https://tools.optionsai.com/earnings/WKHS) / Recent moves: -2%, -8%, -3%\n\n**AMC** AMC / [Expected Move: **15%**](https://tools.optionsai.com/earnings/AMC) / Recent moves: +6%, +4%, +9%\n\nTuesday\n\n**Fubo TV** FUBO / [Expected Move: **12.7%**](https://tools.optionsai.com/earnings/FUBO) / Recent moves: +10%, -19%, +2%\n\n**Coinbase** COIN / [Expected Move: **8.4%**](https://tools.optionsai.com/earnings/COIN) / Recent moves: -3%\n\nWednesday\n\n**NIO** NIO / [Expected Move: **7.6%**](https://tools.optionsai.com/earnings/NIO) / Recent moves: +2%, -13%, -3%\n\n**Ebay** EBAY / [Expected Move: **5.2%**](https://tools.optionsai.com/earnings/EBAY) / Recent moves: -10%, +5%, -7%\n\nThursday\n\n**Palantir** PLTR / [Expected Move: **7.6%** ](https://tools.optionsai.com/earnings/PLTR)/ Recent moves: +9%, -13%, +8%\n\n**Baidu** BIDU / [Expected Move: **5%**](https://tools.optionsai.com/earnings/BIDU) / Recent moves: 0%, -3%, -3%\n\n**Disney** DIS / [Expected Move: **3.3%**](https://tools.optionsai.com/earnings/DIS) / Recent moves: -3%, -2%, +2%\n\n**Rocket** RKT / [Expected Move: **7.1%** ](https://tools.optionsai.com/earnings/RKT)/ Recent moves: -17%, +10%, -3%\n\n&#x200B;\n\nAs always, let me know in the comments anything I screwed up here, or if there are any other stocks you have your eye on.", "id": "p0gomv", "created_utc": 1628436457.0, "score": 101, "upvote_ratio": 0.89, "num_comments": 45, "comments": [{"body": "So basically it can go up or it can go down.", "score": 63, "replies": [{"body": "Yea or sometimes sideways", "score": 15, "replies": [{"body": "And occasionally splits", "score": 6, "replies": []}, {"body": "Sometimes it doesn't move at all", "score": 4, "replies": []}]}]}, {"body": "Sofi on Thursday.", "score": 16, "replies": [{"body": "OP, is there a prediction for SOFI?", "score": 3, "replies": [{"body": "I’ve been checking earnings whisper and the googles and haven’t seen any info other than -$0.10 eps consensus, so I’m hoping for a beat of course. I’m high on sofi to the extent I won’t sell cc’s only puts and hope I get assigned", "score": 6, "replies": [{"body": "I saw -.05 myself, though i doubt that matters.  A beat would be nice, but they need to show a boost in users.", "score": 2, "replies": [{"body": "True that, I am about to move over from wfc to them after a transfer processes soon. So next quarter they will have plus 1 lol", "score": 2, "replies": []}]}]}, {"body": "A surprise beat And a significant increase in users would do the trick.  Let it run a little and hope the Apes, in their eternal quest for a squeeze, pile in due to the 18% SI.  Who knows The probablility,  but I’ve got tons of hope.", "score": 3, "replies": []}]}]}, {"body": "These have never been correct since I’ve started seeing these posts pop up", "score": 29, "replies": [{"body": "Thanks for this", "score": 7, "replies": []}, {"body": "This is the weatherman’s version of projected moves", "score": 2, "replies": []}, {"body": "Really? I've been able to use this to win on iron condors on 8/9 times in this recent earnings round (8/8 actually.  I got super lucky and my AMZN condor never filled, but it woulda been blown out of the water).", "score": 1, "replies": []}]}, {"body": "Anyone else thinking of playing calls on disney?", "score": 7, "replies": []}, {"body": "coin over 300.  Bitty is hot!", "score": 6, "replies": []}, {"body": "Can u please comment on PATH movement in next 1-2 weeks?", "score": 3, "replies": []}, {"body": "PTRA and SNDL for me.", "score": 2, "replies": []}, {"body": "So spy weeklies printing or dumping", "score": 2, "replies": [{"body": "Dumping", "score": 2, "replies": [{"body": "That’s what I’m thinking", "score": 2, "replies": []}]}, {"body": "When spy is flat like this is predicting, it's boring and kills puts and calls obviously. Too bad op is wrong and we drop 2.5% tomorrow", "score": 2, "replies": [{"body": "I have spy puts I bought at close Friday. I will be thrilled if we drop 2.5%.", "score": 3, "replies": [{"body": "Indeed hope so", "score": 1, "replies": []}]}, {"body": "Jesus I hope so. I have some puts and a few calls to hedge, but like 50 VXX calls, so I need some bear news", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I cut my teeth at WSB. I’m not sure you could keep up with my dumb plays", "score": 2, "replies": []}]}]}, {"body": "You missed berkshire's earnings.", "score": 1, "replies": [{"body": "Right?! I'm holding like 20k shares of theirs.... Ramen tonight. Hold for life", "score": 4, "replies": []}, {"body": "I plan to sell covered calls on BRK.A\nDo I need to own their shares?", "score": -4, "replies": [{"body": "That’s what a covered call is", "score": 6, "replies": []}, {"body": "You could sell naked calls, if it had liquidity (and options)", "score": 1, "replies": [{"body": "I just have $5k account", "score": 0, "replies": [{"body": "Well you sir cannot even do brk/b", "score": 3, "replies": []}, {"body": "Poor man's covered call, buy a call ITM 30+ DTE then sell weekly calls on that", "score": 2, "replies": [{"body": "Thanks for all the love", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Where do those “expected” numbers come from?", "score": 1, "replies": [{"body": "Delta/IV of the option chains", "score": 2, "replies": []}]}, {"body": "Recent moves are just the option returns the day of prior quarterly earnings? Thanks for putting this together btw!", "score": 0, "replies": []}, {"body": "Thank you for the informative post!", "score": 1, "replies": []}, {"body": "App tomorrow", "score": 1, "replies": []}, {"body": "How do you calculate the expected move based on options prices.", "score": 1, "replies": []}, {"body": "Shopify is going up this week it's currently at $1523", "score": 1, "replies": []}, {"body": "$ELY reports Monday after close...numbers should be good...like it long term either way but a bounce to 35 would be nice for options expires aug 13.", "score": 1, "replies": []}, {"body": "Thank you very helpful.  Anything on UPST?", "score": 1, "replies": []}, {"body": "For me, it's more CLF, maybe more SOFI, and always puts on RCL/CCL. Not sure of any expected moves, but just a \"general nowish up to 2022\" sort of conviction.", "score": 1, "replies": []}]}
{"title": "$WISH Discussion: US/China trade tensions.", "selftext": "Given that $WISH hv a significant number of Chinese merchants, many investors may be concerned over growing trade tensions between US and China but here’s my take. \n\n1. Many businesses in US depend on China. We may not be familiar with the names of the many SMEs in US that depends on or benefits from China’s cheaper production costs but we most likely have heard of the big names such as Tesla, Apple, Gillette, Levi’s, Barbie dolls, Ray Bans, Nike, Converse etc and the list goes on and on.\n2. Game theory. US is not likely to fuck themselves, their economy and China is not going to fuck themselves either, exiting from such a large market. Both sides are going to suffer the loss of an unprecedented number of jobs and the effect of which is an unimaginable hit in their economies. The best outcome for both cums from co-operation.\n3. If for any reason that the size of their genitals matters more to them than their economies and people, we must remember that the rest of world gets fucked as well. This shit could cause a recession that spreads faster than a STD in college, so that’s additional protection (pun fully intended). If all else fails, maybe the UN may just send Samuel L Jackson down as The Negotiator to diffuse the tensions. \n4. With all that being said, if push comes to shove. Imo for a worst case scenario, they may just go into a “you-do-yours, I-do-mine” mindset and maybe China stocks get delisted from US stock exchange. Imagine this: BABA, JD, PDD delisted from US markets. Guess what... $WISH is an American based e-commerce platform. Boom. Mic drop.", "id": "p0ft76", "created_utc": 1628433531.0, "score": 81, "upvote_ratio": 0.8, "num_comments": 42, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|1 month ago\n**Total Comments**|6|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/o9d6ye/wish_dd_why_is_wish_local_and_its_discovery_based/) [x](https://www.reddit.com/r/wallstreetbets/comments/oong8u/wish_dd_the_sleeping_giant_and_potential_1020x/) [x](https://i.redd.it/rmm14aumpjc71.jpg) \n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Well I spent 5 years for a 2 year degree, didn’t get one STD.  \n\nGREAT point of view, WISH  🚀 to the 🌙", "score": 25, "replies": []}, {"body": "let's fucking go wish! earnings gonna blow estimates..", "score": 17, "replies": [{"body": "I sure hope so, I’m down like 15% for the year total.  Hahaha", "score": 9, "replies": [{"body": "baby losses. you need to step that up", "score": 8, "replies": []}, {"body": "well....im sorry.", "score": 2, "replies": []}]}]}, {"body": "I believe Liam Neeson would be a better negotiator. Last time, the negotiations were pretty short", "score": 5, "replies": [{"body": "For a softer approach maybe Morgan Freeman could be a potential as well", "score": 3, "replies": []}]}, {"body": "I BELIEVE THAT WE WILL WIN !!! 🦍🚀", "score": 3, "replies": []}, {"body": "I keep eating 🥊 but I keep coming back Wishing and dishing 🚀 to $100 and beyond!!!", "score": 3, "replies": [{"body": "😂 interesting. Whenever I post a bullish statement about $Wish, do the opposite and make lots of money. 😁", "score": 1, "replies": []}]}, {"body": "Production can always be moved elsewhere, if Americans or the rest of the world dont really want to be hostage of China", "score": 8, "replies": [{"body": "True, when a country with a bigger population of workforce that works harder, better, cheaper and faster than China comes along.", "score": 5, "replies": []}, {"body": "that's not that simple, for a nation to replace China as new manufacturing world factor must have equipped with most complete supply chain: from raw material, processing tech, transportation, distribution to quality workers,  all those sector is crucial and requires decades of investment. the entire world might realized that need an alternative such India or Vietnam, but those countries still has a lot of work to do to catch the same level as China, and China is not sitting there and waiting to be outcompeted.\n\nThe entire west is going to dependent on China, at least for next 10 years, and **Sleepy Joe (not my president)** is not doing enough.", "score": 0, "replies": [{"body": "They dont need to replace china.\n\nJust a sizeable percentage enough not be subject to \"blackmail\"", "score": 1, "replies": [{"body": "India could be a potential competitor, they have same population size but considered, from indian political situation..... It's pretty mhee, INDIA 's now single handly screwing the world health with pending pandemic and how that heavily weights on post pandemic recovery, i found it highly unrealistic........\n\nother good candidate is Vietnam, but one shall consider that they have communist govt just like China with almost same economical model (socialist state controlled capitalism) but with far less workers, giving few years to come they could create same China problem: using the supply chain to negotiate with West.......\n\nThis entire whole West vs China, is more about USA fears China's GDP is going to surpass american one by 2030, and USA tries to force China to sign PLAZA ACCORD 2.0, exactly like what they did with Japan, the only difference is China said NO, thus the beginning the This stupid trade war.", "score": 2, "replies": [{"body": "India may seem closest to China by population and cheap too but it’s divided by languages which imo is the main reason for the turmoil over there, no one fucking understands each other. There are over 19,000 languages or dialects spoken in India as mother tongues. Try coordinating that to work as a productive team vs China.", "score": 2, "replies": [{"body": "but hey, i don't find that as a negative aspect of market: more competitiveness creates more high and low, and we like buying the dip, rite?\n\nAs for risks factor within the stock, i believe USA is as same as risky as Chinese ones.", "score": 2, "replies": [{"body": "Yea completely agree with ur point, I think a competitive environment is also good for growth and to keep everyone on their toes. Just on the point of moving production elsewhere, I thought for a bit and can’t think of any country which can actually match China’s productivity and costs.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "US has zero ability to reduce dependency on China, much less abandon it. Bad theory craft. But proceed, I’m waiting for a killer entry to load it up.", "score": 1, "replies": []}, {"body": "Wish eafings gonna explode", "score": 1, "replies": []}, {"body": "[removed]", "score": -6, "replies": [{"body": "Don’t bring your shit over here, go over to wish subreddit", "score": 5, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "I welcome all comments that is a value add to the discussion about stocks and mkt. What’s next, you gonna bring a comment that the shit u ordered don’t fit well?", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Ok I’m gonna entertain you since u like superficial conversations, what did you buy from Wish which didn’t arrive and when?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Shit thrashers like you are a dime and dozen. 2.5b rev 2020, 3.2b rev projections for 2021, 100m monthly active users, over 3m of items sold daily, most downloaded app for past 3 years are facts. There is a higher chance that you are either shit trashing or ur credit card declined than u not receiving the goods imo. From my experience, I hv purchased and received 100% of my items on wish without any issues. If u show ur purchases, I’ll show mine.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Wtf u talking about, get the fuck outta here", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Wish as a company is likely going bankrupt due to the 400% increase in international shipping duuuh", "score": -14, "replies": []}, {"body": "if i hadnt sold covered calls I'd be toast\n\nhttps://imgur.com/a/0uKg4qG", "score": 1, "replies": [{"body": "I've been trading covered calls since March so I can still seek nourishment while I wait for shares to appreciate above $20.", "score": 2, "replies": []}]}, {"body": "wtf is this plot twist, too high for this shit", "score": 1, "replies": []}, {"body": "Investors are loading up on baba, some investors.", "score": 1, "replies": []}, {"body": "And then there is the Beijing 2022 Olympics to consider.  I think the real value to WISH is its commitment to follow the data, which is being sucked up by the highly engaging mobile app.", "score": 1, "replies": []}]}
