{"title": "[deleted by user]", "selftext": "[removed]", "id": "1eeruh2", "created_utc": 1722231481.0, "score": 137, "upvote_ratio": 0.9, "num_comments": 97, "comments": [{"body": "Bro stop, I need AMZN to go up...", "score": 77, "replies": [{"body": "Yeah this just made me *guh* amazon $165 after earning's now", "score": 17, "replies": [{"body": "Motherfucking Nostradamus over here!\n\nAnd this joker is now claiming he sold Wednesday for a 50% gain. lmao what a 🤡", "score": 1, "replies": [{"body": "It's where I set my double calendar $165/$195, I was profitable on every company I played for earning's using double calendars ON, Meta, Aapl, Amzn, DKNG - Made 8% trading this week, next week have double calendars already set on LLY, DDOG and ELF. LLY $730/$795/$870, DDOG $90/$125, ELF $140/$160 - Either direction am winning!", "score": 1, "replies": [{"body": "Fucking A man - not massive gains but not regarded. Mad respect and keep it up!!", "score": 2, "replies": [{"body": "You're experienced lol, you know double calendars are not crazy gains damn pnl chart always lying to me lol. If can make 50-80% of the original debt paid it's a good trade, have had 150% highest so far but double calendars are pretty damn safe imo!", "score": 1, "replies": [{"body": "No totally agreed, I just never expect smart, risk averse and savvy traders on this subreddit. So when someone is making 8% and is happy I'm all about it. :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "To shreds you say?", "score": 7, "replies": []}]}, {"body": "Probably not alone in being more interested in the $400K BA position", "score": 16, "replies": [{"body": "BA is in a weekly accumulation phase, you think USA will give up on its biggest domestic manufacture defence company, while China and Russia is getting stronger? I don't think so.\n\nLast few short entries on the daily chart for BA have all failed, price ranges are tightening up in even the weekly chart, this shows that a big move is waiting to happen, News have been taking a shit out of BA, so i'd wager the upside is more likely.\n\nAll in all, BA is only around 120B right now, this does not reflect BA's true value, the government just gave BA a sweet plea deal, in exchange for more government oversight (ie. the government wants to control what BA will be producing), this is ultimately what government wants, as the USA is consolidating industrial power to counter China.", "score": 7, "replies": [{"body": "Bro Boeing has an outgoing ceo with no replacement \nMiddle management has no teeth and executive level are incompetent crooks \n\nIt has a lot of issues that need to be resolved before it sees a true spike in price \n\nIt’s not undervalued right now, it’s valued due to its issues \n\nIf it didn’t have the monopoly it has it would be getting obliterated \n\nSince it’s to important to fail, it’ll just be dead money \n\nBest thing you can do is channel trade it for the 5-7 range it likes to stay in", "score": 10, "replies": [{"body": "Buy when an industry leader is weak.", "score": 6, "replies": [{"body": "Agreed but you have to figure out when the turn around is and enter, otherwise it’s dead money", "score": 2, "replies": []}]}, {"body": "Technicals showing key entry points coming up for weekly institutional players at around 195, we will see what they do, the bottom is in, the only way is up.\n\nMy expectation is it will trade around 220 and 240 before end of year, when new CEO is announced and supply chain issue ease, the stock will go back to 300 - 350 range.", "score": 2, "replies": [{"body": "I do not agree that the bottom is in for this equity", "score": 2, "replies": [{"body": "I hope you are wrong, if BA drops again it will be in the COVID channel, i really dont think all the bad news can really compare with COVID. My belief is that, seeing how the 200D MA is around 200 dollars, the institutional holders are essentially lowering there cost basis with this 180-190 trading range, which is like a -10%, this is a good psychological level to keep buying the dip for the institutional owners.\n\n  \nThis is why most price targets are 220, that makes an intuitive 10% gain.", "score": 3, "replies": [{"body": "I have no stock in this at the moment but I at times day trade it \n\nI always keep an eye on it because if it goes low enough I’m definitely a buyer", "score": 2, "replies": [{"body": "I dont know if you do technical analysis, my cost basis is 185, which right now is right on the daily 20MA, according to price action rules, we get one last short entry at 195ish for daily bears the support for that one is 190, if that is bought out then we will breakthrough to 200-220 range, and you likely wont be able to get on the sub 200 boat.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Thats right, everyday has opportunities! GL and HF!", "score": 2, "replies": []}, {"body": "UPDATE on BA, as expected we had liquidation at 195 and an inducement that went as low as 183, i took daily profit at 197 and bought back before close, this is the first time in months where the price action actually shows a bullish structure.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The drop was a mitigation of the liquidity between 170-185, i highly recommend watching Lewis Kelly and theMovingAverage on youtube, having an understanding of market structure has been helping me make banks, these are free resources, good luck out there!", "score": 0, "replies": [{"body": "Dude \n\nYou literally got lucky they hired a ceo \n\nKeep your YouTube trash \n\nThis one time you were lucky, and I was still correct about the ceo being a catalyst is a one off\n\nIn the marathon of trades you would of lost 9/10 times", "score": 2, "replies": [{"body": "I guess thats why my account grew from 20k to over 500k, because i keep getting lucky!", "score": 1, "replies": [{"body": "My account is right there with you \n\nStarted with 50k\n\nNow at 450k\n\nLet’s go opposites on a trade one of these days\n\nApple, Amazon and Intel report after the bell…….\nI’ll go opposite you on any of them if you think you are that good", "score": 2, "replies": []}, {"body": "How’s that Boeing today", "score": 1, "replies": [{"body": "Puts printing hard!", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": [{"body": "Fucking 🤡.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Awesome", "score": 1, "replies": []}, {"body": "Do all theses stocks typically increase after earnings reports or it depends on the level of earning?", "score": 1, "replies": [{"body": "Dude \n\nIt’s earnings \n\nIt can drop like a stone\n\nRise like a rocket \n\nOr do nothing and screw all the options and puts players due to no movement \n\nEarnings is always a gamble unless you have insider info which I don’t \n\nI’m not Nancy pelosi lol \n\nGood luck and have fun", "score": 1, "replies": [{"body": "Ok. But you said there’s opportunity every day. How do you spot those opportunities?", "score": 1, "replies": [{"body": "With my eyes", "score": 1, "replies": [{"body": "Great! Tell me your best guesses for this week please. I want to twin trade with you:)", "score": 1, "replies": [{"body": "Impossible \n\nI just look at stuff and react in real time \n\nSorry man \n\nGotta do your own work", "score": 1, "replies": []}]}]}, {"body": "Just buy the stock right before the price goes up. Then sell before it goes down... duh", "score": 1, "replies": [{"body": "https://finance.yahoo.com/news/investors-are-rooting-for-companies-this-earnings-season-morning-brief-095906594.html", "score": 1, "replies": [{"body": "Well that’s obvious. I want to buy options. How do you spot the stocks that will go up? Do you have a website for that please", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Technical analysis is not magic, its really about understanding how OTHER players will act (traders and institutional investors), smart money makes entry at key entry points ONLY, you can essentially anticipate when they will be long/short. My honest advise is to watch the 195 short, if that runs out of juice, buy the second entry long which should be around 193.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "I hope the great rotation comes back", "score": 10, "replies": [{"body": "Ohh the term that Wall Street Journals used to scare retail so that they could buy the big stocks at a cheaper price.", "score": 9, "replies": [{"body": "It's fucken WILD how easily this shit works. \n\nGet a catchphrase out in the mind of people and boom.", "score": 5, "replies": []}]}]}, {"body": "WARNING: position is in Canadian Dollars", "score": 18, "replies": [{"body": "Why you using Canadian pesos? Use the greatest currency in earth history, freedom dollars please.", "score": 33, "replies": [{"body": "its called Canadian Yuan", "score": 10, "replies": []}, {"body": "More mexicans in USA bruh", "score": 1, "replies": []}]}, {"body": "Fake money![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "Never bet on amzn going up", "score": 7, "replies": [{"body": "Inverse the professional portfolio destroyer.", "score": 4, "replies": []}]}, {"body": "https://preview.redd.it/5w665kw7mefd1.jpeg?width=3024&format=pjpg&auto=webp&s=286723c97ba283b9ad57cfd94f7b09e68ccb582a\n\nHere is my prediction boys, beautiful chart!", "score": 7, "replies": [{"body": "Interesting choice of crayon color", "score": 4, "replies": []}, {"body": "Bulletproof, i will save it for comparison", "score": 2, "replies": [{"body": "Literally cannot go tits up", "score": 1, "replies": [{"body": "Well…", "score": 1, "replies": [{"body": "Did you hodl or sold bru!!??", "score": 1, "replies": []}]}]}]}]}, {"body": "Good luck you crazy bastard", "score": 5, "replies": []}, {"body": "Well my calls are fucked", "score": 6, "replies": []}, {"body": "I think Amazon is gonna kill earnings too. Dividend announcement. \n\nThey just secured NBA rights. They're making moves", "score": 3, "replies": []}, {"body": "meh, 5DTEs, boring and straight up comatose", "score": 3, "replies": []}, {"body": "RemindMe! 5 days.", "score": 3, "replies": [{"body": "I will be messaging you in 5 days on [**2024-08-03 07:20:45 UTC**](http://www.wolframalpha.com/input/?i=2024-08-03%2007:20:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1eeruh2/42000_amazon_yolo/lfgdytc/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1eeruh2%2F42000_amazon_yolo%2Flfgdytc%2F%5D%0A%0ARemindMe%21%202024-08-03%2007%3A20%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201eeruh2)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 6, "replies": []}, {"body": "Just got reminded!", "score": 1, "replies": []}]}, {"body": "after it goes up, people will sell, and it goes back down.", "score": 3, "replies": [{"body": "Very true.", "score": 2, "replies": []}]}, {"body": "Well this didn’t play out well", "score": 3, "replies": [{"body": "Its only monday.", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/wfmnl7wi56gd1.jpeg?width=1232&format=pjpg&auto=webp&s=361d85b7b6df041655cc61c6115735766f010660\n\nI sold Wednesday for 20k profit.", "score": 3, "replies": [{"body": "lmao\n\nSure you did. Terrible call, terrible play.", "score": 2, "replies": []}]}, {"body": "Remind Me! 5 days", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Source?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sorry but you don’t know when and at what price Bezos’ stocks will be sold", "score": 0, "replies": []}]}]}, {"body": "My breakeven is 195 after earnings", "score": 1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 47 | **Previous Best DD** | \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Dude, I've got >1k shares of AMZN. You stay away from it, I need it to keep going up!", "score": 1, "replies": [{"body": "GODDAMNIT DUDE YOU FUCKED IT ALL UP!", "score": 1, "replies": []}]}, {"body": "Something tells me you are going to lose this money.\n\n!remindme 4 days", "score": 1, "replies": []}, {"body": "Amazon now taking notes", "score": 1, "replies": []}, {"body": "Went in 190c w 500€ ain’t much but it’s honest work ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Guh", "score": 1, "replies": []}, {"body": "Congratz 😂", "score": 1, "replies": []}, {"body": "Imagine yolo’ing into a stock when the guy who founded the company is just waiting to dump millions of shares on you as soon as the price rises. You belong here friend", "score": 1, "replies": [{"body": "I've been checking SEC filing everyday for Jeff's sales, he sold 1.8B out of the 5B, he is not selling now. All his $200 sell orders were essentially ALL bought up, there is clear bullish momentum up until the earnings play timeframe, where professional traders usually stay on the sidelines. \n\n  \nIf Jeff isn't selling at these prices, I'm not going to either? My belief is that Jeff won't sell at these levels because he knows what's up, his lizard brain is too smart.", "score": 3, "replies": []}, {"body": "I also checked his selling filings in February, those show clear consistent selling, which is not the case this time. I don't wanna overanalyze this, but last time he sold 8B he sold into the uptrend ONLY, so this time it is kind of weird that he only sold so little and all within 2 weeks.", "score": 2, "replies": [{"body": "He’s selling at $200. That’s the price he wants for his shares for what ever reason so until he’s done selling Amazon isn’t going past $200. Look at how it rejected hard at $200 several times on the days he was selling. Between him sitting on the bid with massive sell orders, and everyone else knowing this info, unfortunately $200 is the ceiling for Amazon until this guy is done selling. \n\nOnce he’s done, or even 75% done with his sales, I’d love to play Amazon as I think it should be a 3T company with their hands in so many different things. But not before then. Just my .02", "score": 2, "replies": [{"body": "Fair enough, but my perspective is that, he is selling at AT ALEAST $200, you are correct in that his sell orders are public info. When his first sell orders showed up at the nice round number of $200 on the SEC system, this info gets forwarded to the trading analysts, having worked in a hedge fund, what usually happens is that trade desk will SHORT the stock (because they know there is a big seller at $200 acting as good resistance), however, if you look at the chart, all the shorts are bought up, there is very clear strong bullish momentum.\n\nThe last higher high happened on July 11th premarket at 201.33, which is actually the ATH, trend line rules (ie. rules for the algos, who are actually the mainstream traders now) says that we should look for new low extremes, which i believe was found at 176.8 on Wednesday July 25th. Thursday and Fridays trading sessions short entries were all bought up, the next key level short entry is at 188 for the hourly players, which could be significant, so i will be watching that closely, if that one fails, we could easily break in to 193-200 trading range again.\n\nBeing this close to earnings, i reasonably believe that the bulls (who are showing strong sentiment) can neutralize the 1Hr bears and stabilize the price at around 190 right on earnings, which sets up for a very nice breakout to 200-210 range. Just my 2 cents.", "score": 2, "replies": [{"body": "If you read his initial filing, he is selling for either $195, or $197. I forget the exact number, but he disclosed that on the form. And it’s pretty obvious from his transactions he’s selling at $200. If you’re looking to put an “at least” price, it’ll be the estimated value his SEC forms designated originally.", "score": 2, "replies": [{"body": "The stock reached 200 end of June, and retraced back to 192, he filed right after, which gets processed first week of July, SEC filings requires a filling in a price that is \"reasonable and not disputably deviating from the immediate market price\", so the filing clerk put in 195-197, which is right on the middle range.", "score": 1, "replies": []}, {"body": "Jeff does not do his own filings, he simply says to his staff \"hey i wanna sell some stocks\" and the clerk files a form, he doesnt do his own forms bro.\n\nThink about it this way bro, he is like us wsb chads, at 200$ he is taking 1.8B profits off, which is only 30% of his long position of 5B, which actually means he is holding 70% of his position. Now when do we hold onto a position? When do we keep holding our green calls?\n\n... When we thinking maybe tmr we ✈️🌕", "score": 1, "replies": [{"body": "Ok, enough…..I don’t really care stop blowing up my inbox. Good luck with your position", "score": 2, "replies": [{"body": "My bad bro, sorry for the cognitive dissonance", "score": 3, "replies": []}]}]}]}, {"body": "I want to believe. Holding 6000 shares here.", "score": 1, "replies": []}, {"body": "RIP bro", "score": 1, "replies": []}]}, {"body": "Btw my breakeven is at 195, so even at the lower trading range i should be ITM. Of course the market could put its pp in my buttho and i will be truly regarded :(", "score": 1, "replies": []}]}]}]}]}
{"title": "One Final Shakeout Likely Coming - High Odds Market Will Have Bottomed by Wednesday on FOMC", "selftext": "https://preview.redd.it/vaaq8k0q0ifd1.png?width=1578&format=png&auto=webp&s=81686c0337781c2b72686d1cc83d2ee52fd885f4\n\nAn important preface, if you don't like technical analysis please skip this post. This is technical analysis combined with \"educated-guess\" timing based on the earnings calendar and the fed meeting this week.\n\nThis is the $SPY 1-hour chart.  \nWe have effectively been trading inside a falling channel since Wednesday July 17. This channel is demarcated by the support and resistance dark red lines.  \nInside this falling channel highlighted in blue are the counter-rallies. They are \"counter\" because they go against the trend, which has been down for a little over a week.\n\nAt the very bottom of the chart is the stochastic ( I use tailored settings for the stochastic so yours will likely look different )  \nEvery time the stochastic has approached overbought territory ( around 80 ) and crossed down in the last couple of weeks, it resulted in the market topping and starting a wave of selling.\n\nWe have completed two waves so far and one final shake out is likely ahead here's why :  \n1- This is the busiest earnings week for big tech, which means elevated volatility.  \n2- Fed meeting coming Wednseday, also means more volatility than usual.  \n3- Buyers attempted to clear a key level of resistance at $547 three days in a row and failed each time. They tried last Thursday, again Friday and for the third time today and failed. This is a key \"pivot zone\" because it was support in the past and has acted as resistance since. It's a \"pivot zone\" because whenever price crosses this level it pivots from support to resistance and vice versa.\n\nAll of this is happening as buyers are running out of momentum. Which tells me there isn't conviction -- yet -- to commit to higher prices. Elevated volatility and lack of conviction always leads to shake-outs. So I'm now anticipating one final shake-out sell off, to shake out all the weak hands leading to capitulation and the beginning of a new uptrend.\n\nBased on the economic calendar this week, I think the most likely day to conclude this 2-week correction and start a new uptrend is Wednesday in reaction to the FOMC. Inflation data has been surprising to the downside, bringing rate cuts closer. If J Powell hints at all that this is the case, the market will love it and we will rally.\n\nIn the meantime, I've taken profit on $QQQ calls that I opened last Friday and I'm just waiting patiently now.", "id": "1ef6slh", "created_utc": 1722277412.0, "score": 135, "upvote_ratio": 0.87, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 422 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/qsk34m/woof_woof_this_dog_is_about_bark_up_a_tree_a_big/) [x](https://www.reddit.com/r/wallstreetbets/comments/u446bu/long_amd_my_next_potential_10x_amd_trade/) \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Great stuff. Never knew buried underneath all the loss porn and regard yolo calls is actual technical analysis that makes perfect sense. Wonders never cease!!", "score": 83, "replies": [{"body": "https://preview.redd.it/0j46chu9gifd1.jpeg?width=3000&format=pjpg&auto=webp&s=a55180942e6fd817d7fa0308273ecd1a7c43d83d", "score": 43, "replies": []}]}, {"body": "You are the bottom", "score": 53, "replies": [{"body": "Said your uncle about you.", "score": 39, "replies": []}]}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 22, "replies": []}, {"body": "Please sir, just give me my fries already.", "score": 28, "replies": [{"body": "Would you like coke with that sir? & I'm not talking about the drink.", "score": 23, "replies": [{"body": "❄️❄️❄️💲💲💲", "score": 7, "replies": []}]}]}, {"body": "Lots of earnings, FOMC this week, and Employment situation friday will create a heck of a week. I expect another leg down for sure but we are almost done.", "score": 38, "replies": [{"body": "Sometimes I think most of you are very young, to see a market this inflated and have small corrections and say \"one last small correction and we're done\" is absolutely insane.", "score": 36, "replies": [{"body": "I'm 44. There are far more insane things in this sub.\n\n$MMFI indicates we still have more downside", "score": 20, "replies": [{"body": "I'm saying we're due a much larger correction than these small dips, after rate cuts we'll see a surge but come winter when the elections are over with, I'd be absolutely stunned if there's not a major correction if not a full on crash. Apologies I accused you of being one of the youngins but this subreddit often seems oblivious that crashes actually happen.", "score": 1, "replies": [{"body": "Longer term, yea there is something brewing but until then we'll have some upward momentum. Let's dig in to this because there are lots of things to be concerned about:\n\n* Rates have been at their highest for 18 years. Unemployment has been ticking up and finally at 4.1%. We'll see what it is this friday. Historically, when unemployment is ticking up, it skyrockets over the next 8-12 months the moment rates start cutting.\n\n* The yield curve has been inverted for the longest ever in history. This is probably the gloomiest thing for the market long term. Once that short term yield starts falling, things will get ugly.\n\n* The Sahm indicator has *just* started flashing a recession warning, the first time since the first huge unemployment spike from COVID. \n\n* GDP however isn't showing good or bad signals yet. That would be the last domino to fall.\n\nWhat is your thesis for a late-year correction?", "score": 15, "replies": [{"body": "Not to mention household debt is at an all time high, there's a massive disconnect between how the economy is doing and how people are doing, in both the US & the UK. There's only so long you can kick the can down the road, people will not be able to continue spending. My thesis for late year as that the US would move heaven & earth to not allow a pre-election crash, but when the dust settles there's only so long you can contain it.\n\n  \nI actually have a much darker view of the next two years with things escalating between Israel & Iran, specifically with Hezbolah, and with China taking Taiwan, but geopolitical events are even harder to predict than the market.", "score": 9, "replies": [{"body": "Household debt has been at or near all time highs for the last 20+ years. Imagine if you were calling for a recession that whole time. You'd miss out on some monster rallies.\n\nIf you are actually concerned about household debt don't look at nominal terms look at percentage terms. I think this shows a more accurate view of how Americans are faring:\n\nhttps://fred.stlouisfed.org/series/TDSP", "score": 8, "replies": []}, {"body": "So are you moving into bonds?", "score": 4, "replies": [{"body": "Gold, and at these interest rates heavy into cash. My only stocks are Walmart & NextEra energy at the moment, I was 90% in stocks until about 3 weeks ago.", "score": 2, "replies": []}, {"body": "T-Bill and chill", "score": 1, "replies": []}]}]}, {"body": "My prediction. We won't see the carnage until after the elections and it will be a couple of months into the term  so the other side can blame whatever is happening on them.  I think op is probably right about a correction short term.", "score": 2, "replies": []}, {"body": "Me and you have the same conviction, hence why I’ve loaded up on TLT and GLD. Do you have a discord by any chance?", "score": 1, "replies": [{"body": "nah but i've been meaning to jump in the wsb discord", "score": 1, "replies": []}]}]}, {"body": "depends. In 2022 everyone thought the market was gonna do a 2008.", "score": 7, "replies": []}, {"body": "September", "score": 2, "replies": []}, {"body": "I've been buying up TLT January 100c just for this possibility. I'll either make a little on upcoming cuts or make bank on a major correction", "score": 1, "replies": []}, {"body": "Then post your positions", "score": 1, "replies": [{"body": "My position is gold.", "score": 2, "replies": []}]}, {"body": "I also planned to stop trades right after election and hedge by buying gold", "score": 1, "replies": []}]}]}, {"body": "*”QQQ is up 67% in 2 years, and we’ve only went down -7% in the last 3 weeks, therefore this has to be the bottom so we can resume the uptrend, I’m sure”*", "score": 7, "replies": [{"body": "For the MAG7 that number is 179% in two years", "score": 1, "replies": []}]}, {"body": "Wouldn't it be funny if both of you were dead wrong and the correction is already over and MSFT will rocket after earnings? \n\n\\*Yes, i know that wouldn't magically fix the rest of the stock market but at least AI concerns would be lessened", "score": 0, "replies": [{"body": "I could see a 10% spike before a crash so that wouldn't surprise me, but if by this time next year there hasn't been a significant correction if not a crash I'd be stunned", "score": 4, "replies": []}]}]}]}, {"body": "1dte spy calls?", "score": 7, "replies": [{"body": "1w", "score": 7, "replies": []}, {"body": "i got weekly puts so yes", "score": 3, "replies": []}]}, {"body": "Nice crayons", "score": 7, "replies": []}, {"body": "So what you’re saying is you’re all in on calls 2pm Wednesday? Lol", "score": 7, "replies": []}, {"body": "Nothing matters until the earnings come it. Flat until we see where we are headed.", "score": 10, "replies": [{"body": "Exactly, buyers are not running out of steam, they wait for the earnings report, as is sensible.", "score": 2, "replies": []}, {"body": "Guh", "score": 1, "replies": []}]}, {"body": "Nice, what were the trade volumes on those days it bumped up against?", "score": 3, "replies": []}, {"body": "What are your stochastic settings?", "score": 4, "replies": []}, {"body": "I love lines", "score": 3, "replies": []}, {"body": "What’s the lowest you think we’ll see? I’m thinking that whatever the news we get, we’ll dump hard on Wednesday before the eventual rise we will see before September", "score": 5, "replies": [{"body": "A rise in september? this is an election year. september will be bloody and rate cuts will be priced in a month prior.", "score": 2, "replies": [{"body": "I said before September. Not during. They will pump it up before September and then drop it hard", "score": 3, "replies": []}]}]}, {"body": "I see a stegosaurus facing left", "score": 4, "replies": []}, {"body": "So was Tuesday not the final shakeout? Yesterday was brutal, and looking at pre-market, today isn't going to be any better.", "score": 2, "replies": []}, {"body": "**STOP JINXING IT!**", "score": 2, "replies": []}, {"body": "A watched bottom never happens", "score": 2, "replies": []}, {"body": "Yes definitely bottoming soon. No recession coming. Trump win in the bag....", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You got to be kidding.", "score": 1, "replies": []}, {"body": "why are you asking that instead of looking it up?", "score": 1, "replies": []}]}, {"body": "Would you like fries with that?", "score": 1, "replies": []}, {"body": "Wouldn’t be surprised to see another leg down although I generally don’t trust TA that much and I trust it less when just referencing one indicator.", "score": 1, "replies": [{"body": "TA is astrology for men. You can combine as many as you want, as long as your indicator/indicator-combination isn't reliable it won't be of any use.", "score": 4, "replies": [{"body": "That’s why I generally don’t put a ton of weight into indicators. But if I see several indicators all telling me the same thing, then I might pay more attention.", "score": 3, "replies": []}]}]}, {"body": "Sounds like a pivot zone", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "So puts it is", "score": 1, "replies": []}, {"body": "Hope you’re right, been a rough 3 weeks.", "score": 1, "replies": []}, {"body": "What about a fourth wave", "score": 1, "replies": []}, {"body": "Good thesis, but it's priced it.", "score": 1, "replies": []}, {"body": "Thi is incredibly unrealistic. The first downtrend was due to a rotation into russel 2000 due to certainty reg. lower rates. The second downtrend was due to fears of AI earnings being bad, as tesla and google failed. There's no catalyst here. the FOMC will remain nominal, given the GDP, unemployment, and PCE all fall in line. we also know there won't be a rate cut in july.", "score": 1, "replies": [{"body": "FOMC will limp dick the narrative and be the catalyst.", "score": 2, "replies": []}]}, {"body": "Yada yada market will keep falling yada yada yada buy after market bottoms yada yada.   One regard of a post.", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Weirdly, this all seems fundamental and macro to me. (Except for the chart that I ignored. Pretty colors of the past.)", "score": 1, "replies": []}, {"body": "So \"Making shit up\" combined with \"educating making shit up\". Love to see it. ", "score": 1, "replies": []}, {"body": "No chance", "score": 0, "replies": []}, {"body": "We're in the first part of the correction still. It is oversold temporarily. I have bought calls for this week then will resume my gbear activities", "score": -3, "replies": [{"body": "sucks when you know what's going to happen but get the timing wrong", "score": 7, "replies": [{"body": "My dumbass sold puts before the drop, missed out on 90k. Learned some hard lessons this week. All good", "score": 0, "replies": []}]}]}, {"body": "Oh. Though I just started learning EWT and staging.", "score": 0, "replies": []}, {"body": "LMAO that got old real quick", "score": 0, "replies": []}]}
