{"title": "Berkshire Hathaway cuts stake in China's BYD to below 5%", "selftext": "Warren Buffett's Berkshire Hathaway (BRKa.N), opens new tab reduced its stake in BYD (002594.SZ), opens new tab to below 5%, in what could be the final time Berkshire discloses stock sales in China's largest producer of electric vehicles.\nBerkshire lowered its stake in BYD's issued H-shares to 4.94% from 5.06% on July 16, according to a Monday filing with the Hong Kong Stock Exchange. The stake had been 7.02% as recently as June 11.\nHong Kong requires larger shareholders to disclose, opens new tab sales when their resulting stakes fall below whole percentage numbers. Disclosures can stop once ownership stakes fall below 5%.\nBerkshire began investing in Shenzhen-based BYD in 2008 when it paid $230 million for about 225 million shares, then equal to a 10% stake.\nIt began selling BYD shares in August 2022, after the stock price had risen more than 20-fold, and two months after it set a record high.\nCharlie Munger, Berkshire's late vice chairman, was the impetus behind the original BYD investment. Berkshire invests mainly in the United States.\nBYD was founded by Chinese chemist Wang Chuanfu in 1995 as a maker of rechargeable batteries.\nIt surpassed billionaire Elon Musk's Tesla (TSLA.O), opens new tab last year as the world's largest electric vehicle maker, though Tesla has since regained the top spot. In the second quarter, BYD sold 426,039 electric vehicles while Tesla sold 443,956.\n\nSource: https://www.reuters.com/business/finance/berkshire-hathaway-cuts-stake-chinas-byd-below-5-2024-07-22/", "id": "1e9p3r6", "created_utc": 1721681531.0, "score": 247, "upvote_ratio": 0.94, "num_comments": 77, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "He’s on a bit of a selling spree eh? Wonder what the Oracle sees in the near future…", "score": 109, "replies": [{"body": "I could be wrong but I’d be surprised if Warren is still steering the ship, especially after Charlie died.", "score": 64, "replies": [{"body": "He’s steering it right into cash thats what hes doing!!!", "score": 42, "replies": []}]}, {"body": "Probably being cautious.  If he buys anything it'll probably be more Chubb and Oxy.", "score": 20, "replies": []}, {"body": "He probably sees high dividend yields in T-bills because of high interest rates because of stagflation where the Fed can't lower rates.\n\nEdit: He may have sold some commercial bank stocks because the economy would slow in stagflation. He probably bought home builder stocks months ago because the housing shortage and stagflation may ad value profits and value to home builder stocks. He's probably avoiding stocks because it's hard to find companies that are not overpriced in regards to price over earnings and growth. He maybe diversifying his foreign holdings away from China because of the threat of more trade tariffs and other geopolitical risks. If stocks correct, then would be the time to sell t-bills and buy stocks and maybe long bonds if inflation turns into deflation.", "score": 9, "replies": [{"body": "I dun think buffet  generally holds debt instruments except for t bills… he was always against long duration bonds… but the rest I tend to agree on… he might be waiting on a short term over correction/recession… I mean for his BYD he is still holding about 5% stake of the entire company publicly traded… so it’s still very high…", "score": 3, "replies": []}]}, {"body": "Hopefully not the light…", "score": 3, "replies": [{"body": "Yeah because he’s so young.", "score": 3, "replies": [{"body": "Floating head tech", "score": 2, "replies": []}]}]}, {"body": "His death, his priorities are different", "score": 5, "replies": []}, {"body": "It's gone to an unreasonable valuation and will drop.  Then go back up again at some point.", "score": -5, "replies": [{"body": "That’s quite insightful.", "score": 5, "replies": [{"body": "Thats all he does.", "score": -2, "replies": []}]}]}]}, {"body": "China stocks, political risk, he's wise and doesn't want to take risks on that matter. Neither do i.", "score": 63, "replies": [{"body": "Not to mention the Chinese EV industry is in a race to the bottom in terms of price. A good news for consumers, but horrible for the industry.", "score": 34, "replies": [{"body": "BYD is already making a ton of money, unlike most EV makers.   \nAnd they are expanding to other countries.  \nMany of their competitors are going to die out.", "score": 14, "replies": []}, {"body": "just go look at floor workers terms , not even a fucking rat race, rats got cheese", "score": 1, "replies": []}, {"body": "Chinese people love cars and they love luxury cars. Nobody owns homes - you show off by having a nice car. I think it’s a pretty profitable business.", "score": -11, "replies": [{"body": ">Nobody owns homes\n\nEither this is a joke, or you don't know what you're talking about.  China has one of the highest, if not the highest, home ownership rates in the world at around 90%.", "score": 15, "replies": [{"body": "Well he's 'technically' right when he say nobody on China own homes cuz in communist china, you cannot legally own anything. Buying a property in china legally means the government is leasing it to you ", "score": 1, "replies": [{"body": "Don't pay your property tax and report back what happens", "score": 4, "replies": [{"body": "I guess in china they tax you for leasing the land. ", "score": 1, "replies": []}]}]}, {"body": "Yes people do buy their property. But it’s pretty much all condos, or poor villages where there aren’t many cars. Large suburban homes like you see everywhere in the US and very hard to find.", "score": -1, "replies": []}]}]}]}, {"body": "Yes.  Buffett said he sold TMSC last year due to geopolitical risk.", "score": 7, "replies": []}, {"body": "One risk has been eliminated this week since we know who our next ruler will be so that helps the market. The VIX is down this week. ", "score": 2, "replies": []}]}, {"body": "What else was cut? Is it possible that this is cash accumulation?", "score": 15, "replies": [{"body": "Bank of America I believe", "score": 14, "replies": []}]}, {"body": "The political social conidition in China is a mess right now、not even considering the recent housing market crisis effects on the economy. Personlly I am not touching China 100% until that person is gone. After his removal of the term limit things has forever gone downhill.", "score": 15, "replies": []}, {"body": "Warren usually sells stock and increases their cash position just before what he sees as a negative liquidity cycle.", "score": 14, "replies": []}, {"body": "I want to see Buffett make a $100+ billion acquisition before he passes.", "score": 19, "replies": [{"body": "All cash deal!\n\nedit: though more seriously they can acquire ATD with cash and still have like 100 billion left over. It is mind-blowing.", "score": 1, "replies": []}]}, {"body": "opens new tab", "score": 10, "replies": []}, {"body": "Everyone is arguing but still missing the fact they made 20x on a pretty large purchase. Logic alone will tell you it's a good idea to take profits at some point. He still has almost 5% stake, it's not like he's totally pulled out of China. Taking profits, holding cash and/or rebalancing is never a bad idea when you are 20x on something as risky as a Chinese stock.", "score": 3, "replies": []}, {"body": "In Warren I Trust.", "score": 7, "replies": []}, {"body": "BYD's sales look good but profits are too low and there's too much competition for electric cars in China", "score": 8, "replies": [{"body": "BYD is just a reseller of chips they put together.  Without chips, there’s no business and existing cars will be bricked if they need repair.", "score": -13, "replies": [{"body": "“BYD is just a reseller of chips they put together”\n\nEh, no.", "score": 5, "replies": []}]}]}, {"body": "BYD is killing it right now, selling into strength. \n\nBad move IMO, Remember they also sold TSMC, also a bad move.", "score": 8, "replies": [{"body": "Selling cars at a loss to gain market share isn't a good move especially with the competition in China doing it. Even if BYD survives they are going to have to pay back a mountain of debt. The upside is here in Australia where we have no money losing car manufacturing we can pick up EV's and Hybrids below cost.", "score": 0, "replies": [{"body": "Last I checked BYD and telsa arr the only companies not selling EVs at a loss.", "score": 3, "replies": []}, {"body": "you havent researched BYD at all. its profitable and expanding to other regions quickly. it would only need to get one year of earnings to repay its debt - that is extremely good.", "score": 2, "replies": [{"body": "you haven't been looking at \"recent reports from China at all have you\". The whole automotive retail sector has collapsed leaving Chinese manufacturers having to sell vehicles below cost just to retain their market share.\n\n[https://www.wsj.com/business/autos/china-auto-sales-fell-in-april-amid-ev-price-war-0423a62a](https://www.wsj.com/business/autos/china-auto-sales-fell-in-april-amid-ev-price-war-0423a62a)\n\n[https://www.businesstimes.com.sg/international/global/car-dealers-collapse-signals-another-bruising-year-china-market](https://www.businesstimes.com.sg/international/global/car-dealers-collapse-signals-another-bruising-year-china-market)", "score": 1, "replies": [{"body": "[https://carnewschina.com/2024/04/09/byd-makes-us1250-profit-per-car-as-it-goes-for-market-share-above-all-else/#google\\_vignette](https://carnewschina.com/2024/04/09/byd-makes-us1250-profit-per-car-as-it-goes-for-market-share-above-all-else/#google_vignette)", "score": 1, "replies": [{"body": "Actually read what you posted, BYD are discounting to retain market share this 1/4. You have to remember the news article is looking at old numbers as 1/4 reports do lag. BYD will be struggling to break even this 1/4 if they want to keep their numbers up because they are up against some very stiff competition from GWM, SAIC who are also selling at cost or lower. On top of this US and EU tariffs are going to destroy their sales numbers.", "score": 0, "replies": []}]}]}]}]}, {"body": "> also a bad move.\n\nDepends on what was driving either move", "score": 0, "replies": []}]}, {"body": "I am a Chinese. The Chinese economy is going down. The problem is with dictatorship. When you have a dictatorship, you can't have innovation. No innovation no future. With a dictatorship, you also can't use the law to protect your investment from hostile government takeover.  The problem was always there. In the past two decades, investors were willing to ignore that because the cheap labor in China made them rich.", "score": 6, "replies": [{"body": "This is a very simplistic view of the economy, if we can call it a view at all. \nJiang Zemin was also a dictator, who even went into power via a coup, but China’s economy started to take off in his term.\nThe problem of China’s economy right now mostly come from real estate bubble burst. It damaged the real economy, consumer confidence, job market, etc. Not to mention that strong USD has caused severe capital outflow.", "score": 8, "replies": [{"body": "I trade stock for a living and constantly beat the market. Where do you get the economy 101 training?", "score": -5, "replies": [{"body": "Congratulations on the gains, but you understand that this doesn’t automatically make you an economy expert, right?\nI’ve already commented why I thought your view was simplistic, and put my take on the issues of China’s economy.\nI’m happy to discuss/debate, but this conversation can end here if your only argument is how well your portfolio performed in this epidemic bull market.", "score": 4, "replies": [{"body": "How is that going to help me? This conversation should have ended for you because your own opinion is not subject to change. This conversation can end here for me because I don't value your input as an economy noob.", "score": -4, "replies": []}]}]}]}, {"body": "BYD is going to be about expansion into other countries not China. Besides EV adoption is much quicker in China.", "score": 13, "replies": [{"body": "If you think you are smarter than Warren Buffet, go ahead.", "score": 11, "replies": [{"body": "He also sold TSMC a year ago. Terrible move so far.", "score": 9, "replies": [{"body": "So far...", "score": 0, "replies": []}]}, {"body": "Buffet is great but he has different goals. He prioritizes managing risks. He believes there is a risk China invades Taiwan. I know it’s just western propaganda. Most Taiwanese aren’t worried seriously worried about it.", "score": 8, "replies": [{"body": "Not propaganda. Taiwan is most certainly worried about an invasion. I just went through a 30-minute air raid drill today at 1:30 pm and had to shelter in place for that time period. The government here doesn’t just make its citizens do this for nothing.", "score": 5, "replies": [{"body": "if they're so worried about it why are thye provoking it", "score": 0, "replies": [{"body": "What do you mean by “provoking”?", "score": 2, "replies": []}]}]}, {"body": "dude theres no invasion theres billions and billions and billions of market and jobs and travel between the two..why would anyone stop that.", "score": 1, "replies": []}, {"body": "This is about a lot more than just Taiwan. My 70% investment return so far this year and sharing the same view of China as Warren Buffett give me more than enough confidence in my assessment of the situation of China.", "score": -5, "replies": []}]}]}]}, {"body": "Yes, all the problems in China are caused by dictatorship.\n\nIf it weren't for dictatorship, DJI would have achieved 100% market share, and China's EVs would have been able to fly into the sky.\n\n(sarcasm)", "score": 2, "replies": [{"body": "trump will turn it into a DICTATORSHIP IF he also wins the senate and the house,\n\nthis is not fear fud, its a FACT, now if the democrats win house or senate, we will have another round of stupid impeachment trials again, a joke of a republic.", "score": 2, "replies": []}]}]}, {"body": "This is Warren betting on Trump winning", "score": 6, "replies": [{"body": "Didn’t Trump say he was okay with BYD producing and selling cars in America?", "score": 5, "replies": [{"body": "If they hire Americans. Yes. But that would take away their financial advantages of producing in China, and they wouldn't be able to compete against established American manufacturers unless China helped fund them operating at a loss until successful but that would still mean more competition for labor which would drive up wages", "score": 2, "replies": [{"body": "you do know that tesla also produces most of their cars in china...  \nmost of BYDs advantages are from vertical integration of supply chain.", "score": 1, "replies": [{"body": "Tesla's cars sold in the US are not made in China. \n\nIn fact, one of their Chinese suppliers is a customer of mine, and Tesla makes them build the American car parts for the motor in Reno, NV.\n\nHuashuo is the parent company in China, and Halms LLC in Reno, NV, is where they make it.\n\nI have several customers in the US that make Tesla parts.", "score": 2, "replies": []}]}]}]}, {"body": "Buffett doesn't make  buy and sell decisions based on who may or may not win an election.\n\nAlso Buffett is a Democrat, but he didn't panic sell out of the market the last time Trump won, so why would he do it this time.", "score": 4, "replies": []}]}, {"body": "Diamond hand frens, Chinese government ain’t gonna let them get away with it", "score": 1, "replies": []}, {"body": "They are going to take an Intel stake, that will send the stock up to 150+", "score": -3, "replies": [{"body": "Intel would have to become an efficient company first", "score": 11, "replies": []}, {"body": "Hell no!", "score": 1, "replies": []}]}, {"body": "Trump effect", "score": -5, "replies": []}, {"body": "Buffett is becoming a day trader.  Sold BAC few days ago.", "score": 0, "replies": []}]}
{"title": "Is the Corporate Bond Market Signaling an Incoming Stock Market Crash?", "selftext": "", "id": "1e99h9x", "created_utc": 1721638452.0, "score": 162, "upvote_ratio": 0.77, "num_comments": 81, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Everything is signaling a stock market crash … lol but it’s not actually crashing .. yet anyway", "score": 447, "replies": [{"body": "The crash won't come when people are expecting it and bracing for it, it'll come when everyone is feeling bullish and optimistic.", "score": 170, "replies": [{"body": "This is about right.\n\nAbout the time when the next \"wealthy\" generation is looking to hand off their wealth & everything is hunkydorey... poof.  \n\nThe great wealth transfer will be scooping p&g and apple the next time market crashes 50% like 08.", "score": 67, "replies": [{"body": "Stocks could still double before crashing 50% and your right back to where you are today.", "score": 63, "replies": [{"body": "This is fair.  \n\nI also recognize it is an extreme amenity to be able to have a boatload of cash available on sidelines to throw at market corrections.  \n\nElder Milennial, but this whole meta has a fkin miss cleo voodoo vibe. \n\nDunno.  Everyone agrees shit is off.  But we still rippin.", "score": 17, "replies": [{"body": "in the meanwhile keep rolling your net worth in calls.", "score": 2, "replies": []}]}]}, {"body": "I do not understand. can you elaborate more please ?", "score": 6, "replies": [{"body": "Depression era \"wealth\" thinks everything is wonderful & America really booming.  70s inflation and 80s crashes ruin em.  \n\nSame again in 2000 // 2008.  \n\nAbout ripe to start making sure not tooooooo many people get that loot.  \n\nBut people panic sell to preserve what they can at that age.\n\nMy grandma worked for Norwich pharma which got bought out by p&g in like the 50s or whatever.  His p&g stock never got sold.  \n\nBought double in 08 before he passed it down.", "score": 25, "replies": [{"body": "I do not understand. can you elaborate more please ?", "score": 4, "replies": [{"body": "Casino tricks everyone into thinking they can get rich.  But most never do.", "score": 8, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Crashes happen every 20 - 30 years.  I'm not saying it's going to happen tomorrow.  That's not crystal ball shit.\n\nI'm saying every retiring generation gets wrecked by crashes and if you want to build off their wealth, rather than hoping for an inheritance, buy what they are selling to preserve capital.\n\nThis will happen within the next few years.", "score": 2, "replies": [{"body": "more like 10-15", "score": 1, "replies": [{"body": "Yeah.  Way more frequent and severe, and quickly rebounding, the last couple of big downs.   Everything is much larger now, more severe, more wealth generating, more wealth stealing, more frequent in both directions.\n\nMore extreme.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Stock market bubbles are like sex. It always feels best right before it ends. \n\nThings feel pretty good right now.", "score": 23, "replies": [{"body": "It's been 2 whole minutes. The good things are just getting started", "score": 4, "replies": [{"body": ">it's been 2 whole minutes.\n\nAlso like sex.", "score": 2, "replies": []}, {"body": "We're not from Havana baby!", "score": 2, "replies": []}]}, {"body": "Those blackwell chips next year will be like cocaine.", "score": 1, "replies": []}]}, {"body": "If anything the market is lower now than could be expected looking at its half-year trend. So unless some unforeseen calamity happens, it will probably be doing all right for a while.", "score": 2, "replies": []}, {"body": "yup, it's already started crashing cause even a regard like me bought calls.", "score": 2, "replies": []}, {"body": "Who are the winners when it crashes?", "score": 2, "replies": [{"body": "Whoever shorted the most stock and bought the most puts I would guess.", "score": 5, "replies": []}]}, {"body": "So.  Now?", "score": 1, "replies": []}, {"body": "So, like until a week ago?", "score": 0, "replies": []}]}, {"body": "Key word, yet! It’s a game of hot potato and I’m the regard going to get caught holding it", "score": 9, "replies": []}, {"body": "Inflation…. Its in the equities market now", "score": 3, "replies": []}, {"body": "Needs to wait until after the election", "score": 3, "replies": []}, {"body": "Was just about to say the exact same thing. \nWe're another 3 years away from a crash", "score": 3, "replies": []}, {"body": "Except the VIX is still below 20.  \nhttps://www.reddit.com/r/wallstreetbets/s/ZLJezFXSP7.  \nBut there are still all those other indicators.", "score": 4, "replies": [{"body": "The VIX can hit 20 in a day", "score": 9, "replies": [{"body": "yeah the VIX is a lagging indicator, like pretty much all of them, it can reach any number just needs to crash hard enough.", "score": 3, "replies": []}]}]}]}, {"body": "It's signaling green dildos for the whole week", "score": 64, "replies": []}, {"body": "It’s signaling you are regarded", "score": 47, "replies": [{"body": "His tarot reading says different - which are you going to believe?", "score": 5, "replies": []}]}, {"body": "No this goes on forever like this.", "score": 12, "replies": []}, {"body": "Please dont give a heck to analysis like\"I farted hard ,today is gonna crash\"", "score": 25, "replies": [{"body": "But that happened, and it is", "score": 2, "replies": []}]}, {"body": "Is this a zoomed in image of djt’s signature?", "score": 8, "replies": []}, {"body": "You can't really time the crash. The one indicator that gives you a better chance at guessing the direction is jerbs.\n\nThe 401K system is essentially set up to keep pumping stocks. The more people working, the more paychecks are issued, and the more money is taken out of those to directly go into stonks. Literally every single week, Billions of $s are funneled into the markets because people are working. The higher wages go, the higher the contributions.\n\nThe past few years, due to the effects of inflation, wages have risen substantially. This has resulted into massive inflows of $ into stonks.\n\nIf/when wages start to flatten and/or job layoffs increase dramatically, you will finally see the beginning of a downturn. Again, that doesn't mean a crash. Just a repricing. A crash requires a substantial cascade effect of less jobs.", "score": 6, "replies": []}, {"body": "The only signal I am getting is that you're poor and into bum stuff.", "score": 16, "replies": []}, {"body": "no, junk bonds are weighted domestic. its a domestic trade based on protectionary measures by new admin.\n\nbloomberg interview talking about it - [https://www.youtube.com/watch?v=fk7ukihslEw](https://www.youtube.com/watch?v=fk7ukihslEw)", "score": 5, "replies": []}, {"body": "Stock market will never crash again.", "score": 13, "replies": []}, {"body": "Crash would be something breaks. Dip maybe.", "score": 6, "replies": []}, {"body": "I've been under the impression we have been in a bubble since mid 2018. Yet we are somehow able to keep this market going. Fundamentally it doesn't make sense", "score": 4, "replies": []}, {"body": "Warren Buffett selling huge chunks. Signal? Sure.", "score": 2, "replies": []}, {"body": "no", "score": 2, "replies": []}, {"body": "Fed is ready to pump more money into the market. Buy everything when it dips", "score": 2, "replies": []}, {"body": "it's different this time", "score": 2, "replies": []}, {"body": "There’s no such thing as “crashes” anymore, the fed will just come in print an ungodly amount of money and all will be fine", "score": 2, "replies": []}, {"body": "Doubletop", "score": 2, "replies": []}, {"body": "No", "score": 2, "replies": []}, {"body": "😒", "score": 1, "replies": []}, {"body": "Yes 👍🏼", "score": 1, "replies": []}, {"body": "Stock up on calls! Market crash imminent!", "score": 1, "replies": []}, {"body": "I feel it coming or a correction at least", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "the CCC index is like 40% <500 OAS and 30% >1000 OAS. It’s very bifurcated currently. Sure some companies will fail but the CCC OAS is misleading IMO.", "score": 1, "replies": []}, {"body": "No, this is just the signal for people who got adjustible rate loans to go ahead and adjust their pants down and adjust their position to all-fours.", "score": 1, "replies": []}, {"body": "BofA made a chart named Exhibit 4: Low Quality credit dispersion is the wildest since 1999-2022\n\nI find that hard to believe", "score": 1, "replies": []}, {"body": "Babe wake up, latest market crash predictor just dropped", "score": 1, "replies": []}, {"body": "I remember around 2012 big financial brains were on CNBC saying they were in safer investments with sidelined cash. All the charts and market indicators showed a 2008 level stock market crisis was in the making. Even noted economist Nouriel \"Dr Doom\" Roubini who predicted the 2008 financial crisis was predicting a bigger crash.    \n\nSo what happened? They all missed out on one of the bigger Bull Runs that lasted 11 years. \"Dr Doom\" is still at it. He'll be right ... eventually.   \n  \nWe can accurately predict the weather one week out, but we can't predict the markets close two days out, let alone the next day.", "score": 1, "replies": []}, {"body": "Just say the world's coming to an end", "score": 1, "replies": []}, {"body": "When everyone around you or on the streets talks about it it’s time for you to mitigate the risks. Money comes in quiet.", "score": 1, "replies": []}, {"body": "Not till March 2025... we gotz some time", "score": 1, "replies": []}, {"body": "No, is not signaling an incoming crash, it's just signaling the volume of the crash.", "score": 1, "replies": []}, {"body": "Maybe", "score": 1, "replies": []}, {"body": "Go bask in history. Once feds starts dropping rates violently we are hosed. So we are ok for now. Just for now. Oh boy", "score": 1, "replies": []}, {"body": "No, because the market cannot signal anything.  Events cause crashes--not Sharpie fumes.", "score": 2, "replies": []}, {"body": "Bond market isn't the most accurate indicator. Crashes usually coincide with job loss claims", "score": 0, "replies": [{"body": "And job loss aka default risk is what bond prices are predicting.", "score": 8, "replies": []}]}, {"body": "Graphs only go up 📈", "score": 0, "replies": []}, {"body": "Stocks go up", "score": 0, "replies": []}, {"body": "When china invades taiwan gonna crash nasdaq", "score": 0, "replies": []}, {"body": "Ripe for a Trump Administration.", "score": -2, "replies": []}]}
