{"title": "Overly optimistic NVDA projections", "selftext": "What follows is python code for a simple MC sim for a portfolio consisting of NVDA.  I have tried to find a reason why it's not valid, but I can't.  The assumptions are reasonable.  The time frame is reasonable.  Owning NVDA, for at least the next 2-3 years, is a license to print money.  The key is to hold though.\n\nDaily returns look like a typical distribution we see in finance all the time.  The best goodness of fit is a t-distribution, so that's what this is based on.\n\nIt requests inputs of the the initial investment (current portfolio balance, monthly contributions, and number of months to simulate.\n\nFor an initial investment of $250K, with monthly contributions of $2200 for 24 months, the results look like this.\n\nI know there are some holes in this methodology, but 10 years is a long time, and probably captures NVDA's variability sufficiently.  I also think that the next several years are going to look more like the last couple, rather than the full 10 years, so I think this might be slightly biased towards conservative assumptions.\n\nI use the Anaconda package and Jupyter notebook.\n\n\n\n    --- Post-Earnings Returns ---\n    Mean: 0.005247\n    Standard deviation: 0.040010\n    T-distribution parameters: df=2.39, loc=0.001467, scale=0.020816\n    \n    --- Normal Returns ---\n    Mean: 0.002167\n    Standard deviation: 0.027396\n    T-distribution parameters: df=3.86, loc=0.002424, scale=0.019745\n    \n\n    10th percentile final value: $445,258.39\n    25th percentile final value: $700,785.81\n    50th percentile final value: $1,170,836.46\n    75th percentile final value: $1,972,783.65\n    90th percentile final value: $2,855,758.53\n    \n\nhttps://preview.redd.it/3juakcn26jad1.png?width=1099&format=png&auto=webp&s=2ad02936599711738a949cecea2eab43fdf5f15e\n\n     \n     \n\n    import yfinance as yf\n    import pandas as pd\n    import numpy as np\n    import matplotlib.pyplot as plt\n    from scipy import stats\n    \n    # Request inputs from the user\n    initial_investment = float(input(\"Enter the initial investment amount: \"))\n    monthly_contribution = float(input(\"Enter the monthly contribution amount: \"))\n    num_months = int(input(\"Enter the number of months to simulate: \"))\n    \n    # Download NVDA data for the last 10 years\n    nvda = yf.Ticker(\"NVDA\")\n    data = nvda.history(period=\"10y\")\n    \n    # Calculate daily returns\n    daily_returns = data['Close'].pct_change()\n    \n    # Convert index to UTC and remove timezone info\n    daily_returns.index = daily_returns.index.tz_convert('UTC').tz_localize(None)\n    \n    # Updated earnings dates\n    earnings_dates = pd.to_datetime([\n        '2024-05-22', '2024-02-21', '2023-11-21', '2023-08-23', '2023-05-24', '2023-02-22',\n        '2022-11-16', '2022-08-24', '2022-05-25', '2022-02-16', '2021-11-17', '2021-08-18',\n        '2021-05-26', '2021-02-24', '2020-11-18', '2020-08-19', '2020-05-21', '2020-02-13',\n        '2019-11-14', '2019-08-15', '2019-05-16', '2019-02-14', '2018-11-15', '2018-08-16',\n        '2018-05-10', '2018-02-08', '2017-11-09', '2017-08-10', '2017-05-09', '2017-02-09',\n        '2016-11-10', '2016-08-11', '2016-05-12', '2016-02-17', '2015-11-05', '2015-08-06',\n        '2015-05-07', '2015-02-11'\n    ])\n    \n    # Classify returns as post-earnings or not\n    is_post_earnings = pd.Series(False, index=daily_returns.index)\n    for date in earnings_dates:\n        is_post_earnings |= (daily_returns.index >= date) & (daily_returns.index < (date + pd.Timedelta(days=16)))\n    \n    post_earnings_returns = daily_returns[is_post_earnings]\n    normal_returns = daily_returns[~is_post_earnings]\n    \n    def analyze_returns(returns, label):\n        print(f\"\\n--- {label} ---\")\n        print(f\"Mean return: {returns.mean():.6f}\")\n        print(f\"Standard deviation: {returns.std():.6f}\")\n        \n        # Fit to a t-distribution\n        t_params = stats.t.fit(returns.dropna())\n        df, loc, scale = t_params\n        print(f\"T-distribution parameters: df={df:.2f}, loc={loc:.6f}, scale={scale:.6f}\")\n        \n        return df, loc, scale\n    \n    # Analyze both groups of returns\n    post_earnings_params = analyze_returns(post_earnings_returns, \"Post-Earnings Returns\")\n    normal_params = analyze_returns(normal_returns, \"Normal Returns\")\n    \n    # Monte Carlo Simulation\n    \n    # The answer to Life, the Universe, and Everything\n    np.random.seed(42)\n    \n    def simulate_portfolio(num_simulations, num_days):\n        results = np.zeros((num_simulations, num_days+1))\n        results[:, 0] = initial_investment\n        \n        for sim in range(num_simulations):\n            portfolio_value = initial_investment\n            days_since_earnings = 16  # Start with normal returns\n            \n            for day in range(1, num_days+1):\n                if days_since_earnings == 0:\n                    # Use post-earnings distribution for next 16 days\n                    df, loc, scale = post_earnings_params\n                    days_since_earnings = 16\n                else:\n                    df, loc, scale = normal_params\n                    days_since_earnings -= 1\n                \n                daily_growth = stats.t.rvs(df, loc=loc, scale=scale)\n                portfolio_value *= (1 + daily_growth)\n                \n                # Add monthly contribution on the first day of each month\n                if day % 30 == 1:\n                    portfolio_value += monthly_contribution\n                \n                results[sim, day] = portfolio_value\n            \n            # Simulate an earnings announcement every 90 days\n            if day % 90 == 0:\n                days_since_earnings = 0\n        \n        return results\n    \n    num_simulations = 2000\n    num_days = num_months * 30  # Convert months to days\n    results = simulate_portfolio(num_simulations, num_days)\n    \n    percentiles = [10, 25, 50, 75, 90]\n    percentile_values = np.percentile(results, percentiles, axis=0)\n    \n    start_date = pd.Timestamp.now().floor('D')\n    dates = [start_date + pd.DateOffset(days=i) for i in range(0, num_days+1, 30)]\n    percentile_values_monthly = percentile_values[:, ::30]\n    \n    plt.figure(figsize=(12, 6))\n    for i, p in enumerate(percentiles):\n        plt.plot(dates, percentile_values_monthly[i], label=f'{p}th percentile')\n    \n    # If you've actually read this far, congrats.  You're as much of a nerd as I am\n    \n    plt.title(f'NVDA Portfolio Balance Percentiles Over {num_months} Months')\n    plt.xlabel('Date')\n    plt.ylabel('Portfolio Value ($)')\n    plt.legend()\n    plt.grid(True, linestyle='--', alpha=0.7)\n    \n    plt.gca().xaxis.set_major_formatter(plt.matplotlib.dates.DateFormatter('%m/%y'))\n    plt.gca().xaxis.set_major_locator(plt.matplotlib.dates.MonthLocator(interval=2))\n    plt.gcf().autofmt_xdate()\n    \n    plt.tight_layout()\n    plt.show()\n    \n    # Print final values for each percentile\n    for p, value in zip(percentiles, percentile_values[:, -1]):\n        print(f\"{p}th percentile final value: ${value:,.2f}\")", "id": "1dvbrr7", "created_utc": 1720112472.0, "score": 63, "upvote_ratio": 0.8, "num_comments": 86, "comments": [{"body": "You don't need simulations to learn that if NVDA continues to perform as it has in the last 10 years that it is a license to print money.\n\nThe point is whether it will continue to perform as it has in the last 10 years.", "score": 69, "replies": [{"body": "No it most certainly won’t.  It currently has a good probability of such but with huge uncertainty in such a prediction.\n\n2 years is a very long time in such tech and its market dynamics.   It makes no sense to predict out 10 years.", "score": 3, "replies": []}, {"body": "From today... \"Nvidia downgraded to Neutral by New Street Research\" - [https://finance.yahoo.com/video/nvidia-downgraded-neutral-street-research-133913884.html](https://finance.yahoo.com/video/nvidia-downgraded-neutral-street-research-133913884.html)", "score": 2, "replies": []}, {"body": "People just think the stock will just keep going up. That doesn’t happen with a large cap stock like Nvda. Now as the number 3 market cap in the world it won’t jump as quickly as it once did. Say out of the next 4 years ( 16 earnings) it beats 10, comes in line with 4 and misses 2. This could be devastating for the stock. Any miss either with sales or profit hurts and could send this stock to the heavily short side. Amazing how people just think this stock will be 20 trillion dollar market cap and can’t see anything else happening.", "score": 1, "replies": []}, {"body": "Some of us like to, you know, actually verify the common wisdom.", "score": -26, "replies": [{"body": "As far as I can tell you used 10 years worth of data and picked daily returns, taking earnings into account, from these to simulate future daily returns, yes?\n\n1. What wisdom does that verify?\n\n2. Do you need to see the results of the simulation to know the outcome? If I roll the dice 10 times and get a 6 10 times and then use that to simulate future dice rolls, I don't need to simulate to know the results, agreed?", "score": 24, "replies": [{"body": "I don’t know what your point is.", "score": -18, "replies": [{"body": "Past performance in NOT indicative of future returns.", "score": 24, "replies": [{"body": "Then why are you here?  Past performance is absolutely indicative of future returns.  That's how we determine if a stock is a gold mine or a pile of shit.  \n\nThe correct statement is \"Past performance is no **guarantee** of future results\".", "score": -21, "replies": [{"body": "For someone capable of doing such a thing in Python you are incredibly daft. \n\nYes, past performance is no indicator of future performance, but that isn't even my point. \n\nThe point is you are running the simulation on data that basically only goes up. Of course the result will be up. That's a no brainer. It's trivial. There is no \"verifying\" as you put it above.", "score": 19, "replies": [{"body": "Chatgpt does this kind of python script without any issue.. I'm smooth af but have a good bunch similar to this one", "score": 3, "replies": []}, {"body": "Stocks don’t just go up. And they miss their numbers sometimes too. You are 100% correct. Can’t argue with people that think this stock will just fly forever. They are the 3rd biggest company in the world. Getting 90% returns in a year is crazy talk.", "score": 2, "replies": []}]}, {"body": "The alternative to drawing lines is to look at the fundamentals, you know, the technology, margins, market share, customer needs, etc.", "score": 1, "replies": [{"body": "OP is a highly regarded investor.", "score": 8, "replies": [{"body": "Still better than average wsb regarded", "score": 0, "replies": []}]}]}, {"body": "To laugh 🤣", "score": 1, "replies": []}, {"body": "No, it's not. Who taught you stocks? A casino gambler? Past performance is often negatively correlated to future returns. People in this sub just believe nvda is the outlier to that rule. They could be, or not. But looking at the past for that kind of thesis is straight up stupid.", "score": 1, "replies": []}, {"body": "Wait until the EU starts their fines. It happens to all the big dogs. Amazon google apple micorsft all felt the sting of the EU fines.", "score": 1, "replies": []}, {"body": "No...it's not. \n\nIf it was...by the end of that NEXT 10 years, it'd be worth more than the entire US Market. \n\nHis Statement was absolutely correct. Yours is ALSO correct....", "score": 0, "replies": []}]}]}]}]}, {"body": "You ain't verifying nothing, and the common wisdom is only past yields, you're just extrapolating it for future returns, which you also don't need to write a program for, a simple calculator will do the trick.", "score": 4, "replies": []}, {"body": "How do you need to verify that if it grows like it has the past 10 years...the next 10...it's going to be worth a fuck ton of money?\n\nIt's not...obviously. It's gone through the most significant growth. I first got in two splits ago at what is a post-adjusted DCA of a little over a DOLLAR. \n\nYou just need to look at the chart my man!", "score": 3, "replies": []}]}, {"body": "It has about 1/3rd the revenue of apple-- 2/3rds the income and is worth as much.  I don't forsee them selling as much in the future as all their biggest customers are now building their own silicon....", "score": -5, "replies": [{"body": "The solution that Nvidia provides is silicon plus software. The latter part cannot be easily duplicated as they have a huge head start.", "score": 1, "replies": [{"body": "It absolutely can.  CUDA is great to help develop an application and allows it to accelerate certain functions.  It represents another layer of abstraction between HW and SW.  It allows for acceleration of libraries such as Tensor Flow and PyTorch and the like.\n\nA competitor that runs something similar on OpenCL might appear- but that isn't their future competition.\n\nThe targeted ASICs that are being developed in house will not be as broad and will only support specific libraries.  For example, Google's TPUs are only good for TensorFlow.  AWS trainiums do only PyTorch and Tensorflow.  They only need to run in their cloud.\n\nSame thing happened in the crypto world.  People bought graphics card to accelerate Bitcoin mining, but when the targetted ASICs were developed, they reigned supreme.\n\nSource: I have worked developing/verifying ASICS...", "score": 1, "replies": []}]}]}]}, {"body": "This is a long winded, overly complicated way of saying \"stock went up last 10 years, so it will for sure go up next 10 years!\". Every investor knows that past performance is not indicative of future results.", "score": 32, "replies": []}, {"body": "I just don’t understand you guys… if you think it’s too expensive, it means you don’t believe in the stock, so don’t buy it and move on. Otherwise, buy it at 120, 130, 150… who cares ??? If you plan to keep it for at least 3 years, it is bound to go beyond. Simple as that. I just don’t get the point of all these folks asking « is it a buy todayyyy ? ». If you ask the question, don’t buy. You won’t get an answer to your FUD.", "score": 30, "replies": []}, {"body": "I’m in. You had me at python Monte Carlo", "score": 26, "replies": []}, {"body": "So, worst case scenario is the $302800 investment will yield us around $137200 given that is like Walmart ROI. NVDA is in the tech sector which has a lot of rooms to grow, I will take the 50% tile to be conservative.", "score": 9, "replies": [{"body": "I think somewhere between the 25 and 50% line is where reality lies.  It's hard not to think there's some bias here, even though I can't find it.", "score": 3, "replies": []}]}, {"body": "Why do you think the stock will continue performing the way it has done in the last ten years? \n\nGive concrete specific reasons why - a growth story with actual revenue/margin/FCF projections, terminal multiple etc. \n\nRight now what you’ve produced is, with all due respect, worthless.", "score": 12, "replies": []}, {"body": "Hah. So, your whole premise is... Assuming future 10 year performance is inline with the past 10 years... Then we make money.\n\nOk but that's literally impossible. In 10 years the market cap has gone from a few hundred million to 3 trillion. If it did that again it would be 300 trillion, more than the entire wealth on the planet combined. Completely and utterly fundamentally flawed promise, and I say that as a 3000 share holder.", "score": 17, "replies": [{"body": "Because op is the typical retail investors who believed stock or company keep going for forever without ever thinking of fundamentals.  Eventually; the stock will trade back to fundamentals just like any other stock who has ran.\n\nTesla, Apple, nflix, Amazon had all dreams of infinite growth and they stalled.  NVIDIA will do fine but to expect anything like 10x over the next 10 years is just dumb.", "score": 7, "replies": [{"body": "You’re not very good at math, are you?", "score": -6, "replies": [{"body": "!remindme 10 years", "score": 2, "replies": [{"body": "I will be messaging you in 10 years on [**2034-07-05 06:11:54 UTC**](http://www.wolframalpha.com/input/?i=2034-07-05%2006:11:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/NVDA_Stock/comments/1dvbrr7/overly_optimistic_nvda_projections/lbpgsau/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FNVDA_Stock%2Fcomments%2F1dvbrr7%2Foverly_optimistic_nvda_projections%2Flbpgsau%2F%5D%0A%0ARemindMe%21%202034-07-05%2006%3A11%3A54%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dvbrr7)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}, {"body": "Add in pelosi buying the stock to your formula", "score": 17, "replies": []}, {"body": "There's little question that NVDIA is a money machine, and will continue to be so until someone actually catches up to them, which is nowhere on the horizon.\n\nThe question is, does that matter for the price of the stock? That one's not so simple.\n\nRight now, NVDIA is ping-ponging for absolutely no reason other than manipulation of price, legions of panicky day-traders, stop-losses tied to algorithms, and an overall get-rich-quick mentality. There have been FOUR major quick selloffs following gradual buildups of price, all with zero news to indicate why they should happen. It has nothing to do with sane investing or even sanity at all.\n\nI'd LOVE to keep it as a growth stock, but that's just not the way the market works any more. If you can invest for the long term, then obviously this is one of your choices for a stable portfolio. If you're thinking short term, your best bet is to think like a day trader: wait for the selloffs to buy in, make your percentage, get out, and wait for the next. Someone who could figure out the market timing for the last couple of months (and don't tell me there aren't people who did) made bank through the cycles even while the overall price hasn't changed all that much since the split.", "score": 4, "replies": []}, {"body": "Got me at the code line for the answer to everything in the universe is 42", "score": 3, "replies": [{"body": "I shot a 42 on the front nine yesteday at golden oaks.", "score": 9, "replies": []}]}, {"body": "analysis like this is how you create bag holders.", "score": 2, "replies": []}, {"body": "I appreciate how much effort you expended to show how NVDA stock might perform. Unfortunately, you failed to convince me that you know any better than any of the rest of us. It might go up. It might go down. (I am long NVDA and expect good things, from it, but the bottom line is “I dunno”.)", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’d hate to see how you react to someone truly being an asshole.", "score": 2, "replies": []}]}]}, {"body": "So your sim has NVDA at $30 trillion in a couple years… 💀", "score": 2, "replies": [{"body": "Jesus, no. Do you have any idea what you’re looking at?", "score": 1, "replies": [{"body": "Yes I taught this at a top university", "score": 1, "replies": [{"body": "Then you should know that’s a dumb question.", "score": 0, "replies": [{"body": "You implied $250k to 2.8m", "score": 1, "replies": []}]}]}]}]}, {"body": "So is it a buy?", "score": 1, "replies": [{"body": "I leave that to the reader to decide.", "score": -1, "replies": []}, {"body": "I'm still learning about stocks, I'm no expert...so please take this with a grain of salt, but I think the more important question here is, \"Is it a buy *today*\"?\n\nIt's a volatile stock, and we know corrections happen here and there. Maybe that correction never comes and you miss out, but if your money is in stable ETFs right now, you might only miss 5-20% growth during that time, not the full 40% (as VOO has lots of NVDA anyway)\n\nThere are a few little obstacles, like the government investigation and limits on their Middle East deals. Any news headline may knock the stock down a solid 10% (which is exactly what we saw happen two months ago\n\nIf your money is already making you money, it seems like a lot of analysts are putting their buy price anywhere from 90-115. If there's any kind of scare, it could jolt down enough to make a buy really worth it....IF you believe they'll continue to perform stellarly", "score": 1, "replies": [{"body": "The stock is knocked down 10% every month at least once. It has been for a while. It was knocked back from 974 to 720 April.\n\nIt went back and forth between 940 and 870. It just hit 140 and then dropped to \\~120.\n\nIt'll keep doing that between earnings as people are skittish. It's a buy now. I don't know who has a $90 price target on it except some guy named Paul who does his analyzing tool and KEEPS talking about how overpriced NVDA is despite the fact that he's shorted it and been saying that for a couple years and it's not the cheapest it's been (PEG less than 1 and even the PE is lower than it's been, though that's less relevant for a growth company). \n\n  \nSeriously...please show me the $90 buy prices? Out of 54 analysts recommendations, it's like 45 BUY, 5 overweight and a couple Hold. \n\nPrice targets are as high as 250 for the next 12 months(probably ridiculous...but plausible) and then as LOW as 144 in the short term.", "score": 1, "replies": []}, {"body": "I can fairly easily pull the same data for VOO or VTI for the same time periods and model the time going forward but I'm not going to.  Because it's a ludicrous argument.  Is there more risk with a single stock?  Sure, but part of risk is the probability of an event happening.  The probability of NVDA performing so badly that VTI beats is so infinitesimally small that it's hardly worth considering.  We're not talking some penny stock that no one has heard of here.\n\nI've been tracking what my portfolio would be if I had kept it in VTI instead of going all in on NVDA in April.  I'm already outperforming VTI by 11% IN THREE MONTHS.  \n\nThe reason the market is making money right now is because of these mega-cap tech companies.  Take them out of the equiation, and mid and small cap stocks are plodding along at 6-8%.", "score": 1, "replies": [{"body": "Right...I totally divested from VUG, VTI and VXUS this past year and just put it all into NVDA. '\n\nI'd already bought NVDA in 2020. Sold some investment properties and then bought roughly 1000 shares of NVDA, TSM, GOOGL, AMZN...and then a couple ETFs and then just said screw pulled it out, put it in NVDA when SMCI caused it to drop(for absolutely no good reason).", "score": 1, "replies": []}, {"body": "I think you're jumping on me without fully digesting what I said. I didn't make any specific recommendation.\n\nI'm simply asking them to calculate the risk premium of nvidia and see if it's worth taking that risk now at all-time highs, or if it may be worth waiting for a potential correction.\n\nthe fact that you think it's ludicrous to do a simple comparison and come to your own conclusion tells me everything I need to know\n\nIt's not like NVDA exists in a vacuum. its not the only stock. why buy into nvda at the top *if* its going to have a correction, when they can look at another stock that is currently in the \"buy price\" in the meantime?\n\nI'm invested in nvidia because I believe they'll do great things long-term. that doesn't mean I think its great to buy in this very moment. they could easily look for other high-performers in the meantime. Or, maybe they believe there won't be an nvidia correction, so they buy it now, but the only way its best to do that is if there isn't one, which is worth considering\n\nthats about all I have to say on the topic.", "score": 0, "replies": [{"body": "It's a statistical fact that those who \"buy at the top,\" end up making more than those who try and time it and wait for a correction. Did you get in when it was into the teens? 116 or whatever it was down to?\n\nYou pay a premium for companies growing like NVDA. You're not going to time the correction. in MOST cases. \n\n  \nSo if you think it's going to grow...as most do, then...buy. If you want to worry about a correction, then...stick with index funds.", "score": 1, "replies": [{"body": "That was exactly what my advice was to them though. I'm not saying anything counter to that. if they don't feel it's currently overvalued or will correct, they should buy, that was the entirety of my post.\n\nAnd yes, I did get in at 115. I do believe DCA to be the better approach instead of timing the market, \\*unless\\* they're already in another stable investment like VOO, in which case they can determine for themselves the risk they want to take.\n\nt's not like the stock is gonna 2x right now, so there's less of a \"now now now\" than there was a few months ago, is my point. they have time to stop and think \n\nif they want to go by the analysts recommendations, pretty much everyone says buy...but if they're asking, don't you think they should do the math (and understanding) themselves to truly feel good about the decision?", "score": 2, "replies": [{"body": "I'm not sure at all how that was your advice AT-ALL. You literally asked if it was worth waiting for a market correction.\n\nAs for your comment about analysts, I didn't say you should blindly believe them, I asked which one had a $90 buy price on NVDA. Who's saying the buy price is roughly a 30% drop?\n\nYou're clearly talking about the \"Everything Money\" channel where the guy has a $90-some dollar buy price on NVDA...otherwise, I'm at a loss. Just show me who is that low?\n\n  \nFinally, I hate DCA. If you like a Stock, put your money into it. If you're sticking one toe in the water, to see what it does with the plan to pure more in later, then you should stick to index funds.\n\nNot to say you shouldn't or can't add more later, I just don't get why you go into it with that plan. I first bought in at just over 40 in 2020. I've bought more in late '23 and then after earnings for Q4 I bought more. But I didn't buy shares in 2020 saying, \"I'm going to plan on buying more at different prices.\" \n\nIt's a popular term, but it makes no sense to me.", "score": 1, "replies": [{"body": "I asked \\*them\\* to think if they want to wait. those are the questions they have to ask. they can't just ask some rando on the forum for that company's own stock\n\nI forgot why I hate posting on Reddit. it doesn't bring me any amount of joy to discuss this with you. feel free to give them any advice you like", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "How can we translate this into 2-3 month out Call options for NVDA? There has to be a sustainable strategy for weekly trading in terms of options.", "score": 1, "replies": []}, {"body": "Hi, this looks promising, but I’m worry about corrections and pullback like this years’s march and June. Do you thunk stock growth will stop during Quadruple witching day next year?", "score": 1, "replies": []}, {"body": "So puts then?", "score": 1, "replies": []}, {"body": "I love how even in worst case scenario you make money on this projection.  I think I might just sell everything I owe and buy the stock since nothing can go wrong as long as I hold for the 2 years", "score": 1, "replies": []}, {"body": "200 by Dec", "score": 1, "replies": []}, {"body": "if you apply this to the number of girls you date in your 20s, does it predict your dating in your 40s?", "score": 1, "replies": []}, {"body": "Add options this", "score": 1, "replies": []}, {"body": "You can run all the monte carlo sims you want. Predicting future performance is a fools errand. \n\nToo many in this sub are obsessed with short-term gyrations, minor swings, \"why is the sky blue\" questions, etc. I liken it to driving a car while viewing the road through a microscope. Even at 5 MPH, everything looks dramatic/fast/scary/dangerous and it is difficult to determine which direction to go.\n\nNVDA is the all time best individual stock acquisition in my taxable \"gambling\" account that I've had since the 1980's (>800% gain, acquired < 3 years ago!). It was total luck that I bought shares when I did- not claiming any genius foresight, ninja coding/AI skills, super intelligence, beating Wall St. brilliance etc. \n\nThings look so euphorically positive during bull markets. In my case, through \\~5 significant downturns since 1985, it can be really hard to look into the rearview mirror when you are augured into the ground.\n\nETF diversification remains the way for a decades-long investment strategy. My 3-fund Bogle lazy portfolio IRA has performed well enough for me to retire a few years early. Not super exciting though, the big performers are included among fund holdings (NVDA is [>3% of VT](https://advisors.vanguard.com/investments/products/vt/vanguard-total-world-stock-etf#portfolio) (IRA)/ VTI (taxable) at this point). \n\nThe markets will go down hard again... when? Nobody knows and no simulation output is going to keep you floating above it.", "score": 1, "replies": []}, {"body": "Nvidia progresses in a stochastic process.  MC is one easy way to model if you have simple believable valid assumptions.  A key assumption here is that future covariance is similar to past; you draw from the known past distribution.  Here you essentially consider nvidia as independent of all other stocks and events in the world within a known distribution.  ‘All future draws will be from representative known past variance’.  This is an understandable simplistic first assumption over a prior long time but must be improved to worst case it because unknown bad stuff happens.  Other stocks also provide useful covariance info.   (Like Hot reactive particles in a box collide which do unique chemistry).  Most certainly over the next ten years there will be significant unknown events.  Further the current dynamics are unique in history and evolving.  The market will saturate and involves increasing number of players.  New risks and opportunities invoke new dynamics.  Hard to justify look out further than a few years.  Not a criticism, just observations.", "score": 1, "replies": [{"body": "All of that is true. But it puts you on a slippery slope to never being able to do anything because you can’t account for everything. \n\nAll models are wrong; some are useful.", "score": 1, "replies": [{"body": "No to slippery slope but yes to ‘useful’ if one knows how to use such an approach.  It just means that one must intelligently interpret such models and simulation results within their assumptions and limitations and as in any scientific method, one refines as needed.   The MC approach shown was very simple demonstration with stated limitations and can certainly be extended systematically to probe and assess refined assumptions and various scenarios and also importantly provide an assessment of the credibility of the result.  For example, worst casing by bringing in the unknown of a black swan event by substituting variance of other proxy at other times in history.\n\nThe world of advanced engineering and science increasingly progresses largely thru such modeling approaches.", "score": 1, "replies": []}]}]}, {"body": "That is such a regarded post lmao\n\nJust shows how fucking expensive this stock is and how the rugpull will fuck a lot of people.", "score": 1, "replies": [{"body": "God I fucking hate this sub.", "score": 1, "replies": [{"body": "It is a regarded analysis.\n\nPast performance is no guarantee of future results, that’s finance 101.\n\nTo evaluate the future performance of the stock we have to look and evaluate future scenarios.\n\nWill Nvidia still hold a monopoly in the coming years or will competition catch up?\n\nIs demand for these GPUs keep going up or will it cool down?\n\nDoes every company/government need the very best of these GPUs or can they buy it second hand or from worse companies (Intel, AMD, some chinese company)?\n\nHow will the second hand market affect Nvidia sales and margins?\n\n50% of Nvidia revenue comes from 5 of the Mag 7, will they keep spending at the same rate on these GPUs for perpetuity or will they develop their own or simply cut down on these investments?\n\nWill any conflict between Taiwan and China emerge in the next 10 years?\n\nHave in Mind that Nvidia not only has to keep the same revenue and margins as they do now, but to justify their current valuation their revenue has to 4x in the coming years.\n\nDo you think these 5 companies responsible for 50% of their current revenue will not only keep on spending money at the same rate, but 4x these investments?\n\nWill this whole Data Centers CAPEX be justified by increase in their net profit? Or is this all a waste of money? For now they haven’t seen any revenue to justify this expenditure.\n\nAgain, shit post, MC simulations means literally nothing.", "score": 1, "replies": []}]}]}, {"body": "This is a solid simulation. Thanks for sharing the analysis especially putting the earnings into consideration.", "score": 1, "replies": []}, {"body": "Most important variable is left out: beliefs of enormously diverse mass-public of investors. Investor belief drives so much of everything. Tesla was to the moon, then out of favor, then back. Nothing rational guides investor opinion.", "score": 1, "replies": [{"body": "Yes, everything rational guides investor opinion...over the long term. Short term, maybe not, but the fundamentals are so strong, that the stock price is definitely not being guided by irrational belief.", "score": 0, "replies": [{"body": "Eventually there are bag holders. Human emotion is fickle. Markets can turn on you.", "score": 0, "replies": [{"body": "You sound...kinda ignorant. Markets turn on fundamentals, not emotions. Emotions drive the SHORT term. \n\nI'm not worried about the short term. I'm worried about the next 3-5 years.", "score": 0, "replies": []}]}]}, {"body": "Tesla is just having a dead cat bounce and it’s not back.  It’s still 40% below its all time high and nowhere close to 400.  It was extremely oversold over the last two years.  The eurphoria will die down soon.\n\nIf Tesla was trading at 600 then I’ll agree with your example.", "score": 0, "replies": []}]}, {"body": "Thanks for the code, mang", "score": 1, "replies": []}]}
{"title": "Coming from stocks to options...", "selftext": "[removed]", "id": "1dvf019", "created_utc": 1720120902.0, "score": 28, "upvote_ratio": 0.84, "num_comments": 73, "comments": [{"body": "**Removed for RULE: New options traders: use the weekly Options Questions Safe Haven thread**\n\nThe [Options Questions Safe Haven thread](https://www.reddit.com/r/options/wiki/faq/subreddit_resources) has links to resources, and is a focused place for new trader questions. Please post your question in that thread.", "score": 1, "replies": []}, {"body": "Higher risk, higher reward. I prefer ITM long term options bc they tend to be less volatile with a higher chance of success", "score": 36, "replies": [{"body": "If theta is eating away from extrinsic value as time moves, when you say \"success\" do you just mean deeper in the money?", "score": 1, "replies": [{"body": "The deeper ITM, the higher the delta so there's less extrinsic value. Combining that with long term options, you have very little theta decay on your small ratio of extrinsic value. \n\nThe downside is that they are $$$ and you're probably not going to see a 1000% gain in one day, like 0dte OTM going ITM. But...gonna have fewer instances of price going to zero. \n\nCheck out InTheMoney on YouTube, Adam explains things very nicely. \n\nOh, also, theta is nonlinear and the decay increases dramatically as it gets closer to expiration. That's why theta gang usually sell to open less than 90 day contracts. \n\nITM LEAPS for the win. ", "score": 26, "replies": [{"body": "Good explanation. Kudos.", "score": 2, "replies": []}, {"body": "Second on that channel. InTheMoney is fantastic.", "score": 2, "replies": [{"body": "3rd on InTheMoney. He seriously taught me more about options in one video than hours of research on the internet.\nLove to see him plugged anywhere. Also hope his health improves 🙏", "score": 3, "replies": []}]}]}, {"body": "I mostly mean that you end up with more winners bc your breakeven is lower. Ofc ur upside is lowered tho", "score": 1, "replies": []}]}, {"body": "OTM options are lower risk, higher reward, but a lower % chance.", "score": -2, "replies": [{"body": "They cost less but much higher chance you lose all your money", "score": 5, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "They 100% have the best %return on capital. If there wasn't a pro to buying junk OTM options, nobody would do it. \n\nYou do not see the %1000 returns on ITM/ATM options.", "score": 2, "replies": [{"body": "I’ve already had this debate with the moderator and shut it down completely. The greatest success and profitability is with 0DTE ITM/ATMA options. I didn’t make that up. There’s a plethora of research on the subject. Options trades and strategies have been thoroughly tested.", "score": 1, "replies": [{"body": "You seem pretty poised to stay wrong, even when a moderator r/options (which are actually extremely knowledgeable for just a subreddit moderator) explained to you otherwise. No point in explaining why 2+2=4.", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">Why do I want to buy a contract over shares?\n\nLeverage. The main advantage of holding long calls and puts is the leverage they provide. ITM options with longer expirations have more stable value due to their intrinsic value, making them less susceptible to time decay, while still offering the upside potential with less capital outlay than buying shares directly.\n\nFor 0dte activity, I like to sell iron condors, put spreads, and call spreads.  That way I can profit from the time decay of the premiums.  I stick to SPX to mitigate or eliminate pin risk, dividend risk, and liquidity issues.", "score": 12, "replies": []}, {"body": "Buying options is largely a crap shoot and very hard to win consistently/.\n\nComing from stocks you will find covered calls and the wheel to make a lot more sense and are likely to find much more success. The key to success with these are choosing good stocks that are unlikely to drop, and come back up faster if they do. In the worse case you end up holding some shares of a good quality stock you don’t mind holding anyway. \n\nSee this wheel trading plan where it is explained - [https://www.reddit.com/r/options/comments/a36k4j/the\\_wheel\\_aka\\_triple\\_income\\_strategy\\_explained/](https://www.reddit.com/r/options/comments/a36k4j/the_wheel_aka_triple_income_strategy_explained/)", "score": 9, "replies": [{"body": "Not always, collecting pennies and owning or giving away tons of stock in the end has a ton of potential downsides... doing it actively makes no sense as your better off just owning the underlying over the long term. Selling AND buying options are difficult to profit off, selling just brings a lot more cope-able excuses in the name of \"hedging\"", "score": 2, "replies": [{"body": "Options trading is best for income with buying and holding often better for long term capital appreciation, so you’re comparing apples and bananas.\n\nThe OP wants to learn options and selling has some benefits over buying which is a much harder way to be successful . . .", "score": 0, "replies": []}]}, {"body": "What do you do when it is a bear market?", "score": 1, "replies": [{"body": "What is a \"bear market\"? For the most part it does not mean the market drops and continues to drop . . . \n\nLook at charts and the definition of a bear market and you will see there is usually a big drop and then it is called a bear market until there is a recovery back to where it was.\n\nOnce the big drop happens the market tends to recover, and many stocks can climb back in a bullish trend so can still be traded.\n\nMany wheel traders see a drop or correction as a time to enter high quality stocks that are \"on sale\" and now have room to move up.\n\nBased on the risk management of the trading plan I work to keep about 50% of my account in cash which is helpful to take advantage of \"on sale\" stocks. The way the wheel works the account is holding high quality stock in a worse case situation, which is not a bad way to ride out a down market.\n\nCompared to most other options strategies the wheel is well positioned to ride out a correction or bear market . . .", "score": 1, "replies": []}]}]}, {"body": "I have been implementing a number of different strategies and am new(ish) to options trading. One strategy I have been using is buying ATM leaps (SPY, QQQ, NVDA, MSFT, AAPL), and have seen tremendous success. I hold until the earlier of 50% gain or 3 months and then roll it out another 3 months. The benefit is lower volatility, controlling the shares with less $, thus the potential for greater profit than simply buying 100 shares of something. I fully recognize that my success was in no part due to my intelligence, or lack thereof, rather simply utilizing leverage in an upward trending market. That being said, for example, when NVDA went sideways for a few months before the split, I was down, rather than flat.  In my mind it’s a lower risk way to start figuring out how options act/react to changes in the market.", "score": 5, "replies": [{"body": "Half of the battle is getting the direction of the trend correct. But later expiration dates provide for that.", "score": 2, "replies": []}, {"body": "May I ask, why ATM rather than ITM? Or if you're confident about the direction, why not slightly OTM?", "score": 2, "replies": [{"body": "ITM just that much more expensive…Direction is impossible to predict. Since I want to be out/roll in no more than +/- 3 months, I don’t want to be on the wrong side as have to wait it out that long if it goes the wrong way and have my money tied up that long just to break even.", "score": 1, "replies": []}]}]}, {"body": "so how was your paper trading returns? \n\nODTE OTM will lose most of the time, unless its a very volatile stock, and you need to get in&out at the right time. Personally, for 0DTE I prefer to wait for a sudden drop on QQQ or SPY, between 9h30 and 10am, and buy ATM, and sell it when the price gaps up. Its more expensive than OTM but it gives me better total returns.\n\nyou also need to consider IV with stock like NVDA, the volatility increases the option price.", "score": 4, "replies": [{"body": "I dont have a strategy on long contracts and subsequent no paper activity for options, hence why i am asking here... I am not interested in any margin strategies either", "score": 1, "replies": [{"body": "I meant how was your returns with 0DTE OTM\n\nMy long call strategy is very basic, 0.50 delta as far as I can afford.", "score": 2, "replies": [{"body": "I was buying cheap otm's on spy and qqq, a couple pops (+400%) mostly losers,, I trade late day cuz i dont wake up early enough lol. Tried one ER ($LEVI calls)... probably the worst outcome is what came lmao", "score": 1, "replies": []}]}]}]}, {"body": "Stay away from otm options if you want consistent income trading options. I learned my lesson, and I am now only trading itm options.", "score": 3, "replies": [{"body": "Can you explain the difference,,, my thought is if an itm option goes up you just get deeper itm which is good, but if it goes down and potentially out, youre losing a rather expensive investment... Where as the same is true for an OTM (up and in the money is good, and down loses the entire investment pretty much), but an OTM is just so much cheaper and hence less money at risk", "score": 1, "replies": [{"body": "OTM going into ITM is very rare, hence you are bound to lose your entire investment more often whereas ITM options losing entire value is not that often.", "score": 2, "replies": [{"body": "What about slightly OTM options?", "score": 2, "replies": []}]}]}]}, {"body": "Leverage is always the answer with options; we control more for less investment.  \n\nThat you immediately gravitated to 0dte and don’t yet see the value of a more measured or slower approach to options trading is a bit of a red flag.  Options do not necessarily have to expire to create profit or loss.  90%+ never make it to expiration, the profit (or loss) is made before that, and positions are managed with rolling, adding, hedging, adding delta neutrality with shares, other.  There are many aspects of options trading that 0dte does not use.\n\nInstead of trying to understand options via the Greeks, technicals, or endless discussions of what this or that might mean, I suggest something else:  Look at short options as picking strikes where you feel the underlying will not go in the span of your contract.  Look at long options as picking strikes you believe the underlying will exceed.  Get a feel in paper trading or lower priced options as to how good you are at this, why you believe this or that will happen and what affects your beliefs.  Are those the same things that increase your profit?  That’d be what you want.  And it’s a very good foundation for truly getting the feel of options.  The rest will come, but you can’t get years of experience in the first year.  There’s much to learn.", "score": 3, "replies": [{"body": "Red flag as in what sense… it seems there’s lots of stigma to a “gambling attitude” which I don’t see an issue with. If I want to buy a 10 dollar 0dte with the chance of 400% my money every now and then why is that a red flag of a trader, obviously there’s many other sustainable strategies I’m open to implementing", "score": 1, "replies": [{"body": "You got it right.  I see it as gambling.  But you do you.  And I’ll move along because I’m not here to argue with those who wish to gamble with options.  It’s your money.", "score": 3, "replies": []}]}, {"body": "Everyone seems to point to selling contracts as a good strategy but I don’t understand this if selling contracts carry the most risk as you can be assigned and lose infinitely more than your capital you put in. Also I am yet to find a platform that allows you to practice margin based strategies (selling contracts, spreads, condors, etc)", "score": 1, "replies": [{"body": "I recommended how to begin understanding options.  But you want it all and you want it now; spreads, margin, all of it.  Learning and understanding will take as long as it takes.  Starting small gives experience.  Experience is built upon.  I wouldn’t know where to paper trade, never did.  Self-taught.  That’s how I learned.", "score": 1, "replies": []}, {"body": "buying and selling options are both tough to profit on, option selling as advice here gets spewed often just because when you lose the trade you can use the excuse that its a hedge.. and got to collect pennies for it. 0dte is tough to move, but swing trading in my opinion is easier.. same old song, you needa proven set of if and thens over a big sample to make any profit. After all, you take from people who lose and while most do lose the few who win consistently gather all the losing capital.. and its not always market makers", "score": 1, "replies": [{"body": "I appreciate this response,,, I tend to momentum day trade shares instead of swing trading just cuz I like the more fast paced environment. After all trading is just something I do for fun with the hopes of building up an account from a small amount of capital and then playing with whatever gains I make. For more realistic investing I keep my stuff in traditional brokers and buy shares (sometimes swinging shares).", "score": 1, "replies": []}]}]}]}, {"body": "The use of holding long calls is a way to control equivalent to shares (delta) for a certain amount of time, buying the rights at a given price (strike).\n\nExtrinsic vs intrinsic valuation is a formula based on expiration date, strike, implied volatility, interest rates, etc.\n\nSimply a contract with more time has more extrinsic time value.\n\nWhomever said to stay away from OTM 0dtes may just be parroting decently conventional wisdom often given to perceived new traders - this advice is coming from millions of burnt traders.\n\nEvery permutation of contract valuation has merit in a particular circumstance.  0dtes can be amazing if a trade is executed that benefits from an explosive move thanks to gamma.  They will far exceed even a futures contract kind of profit.  But they need a fair amount of movement and sustained.\n\nFurther dated contracts won’t provide as much profit on a smaller underlying move where a 0dte would.\n\nUse of buying puts is most often a form of protective hedging on long delta positions.  Obviously it can be used as a directional bet just as calls.\n\nContracts are a leverage product that can be used in a myriad of ways.", "score": 3, "replies": [{"body": "This is a great explanation… I’ve been trying to figure out what strategies I can use as a non margin trader (my NAV isn’t high enough for Webull), and I came across long straddles and strangles.. can I implement these in 0dtes or 1dtes with the downside pretty much being that the ticker moves flat?", "score": 1, "replies": [{"body": "Yes you can, I would recommend employing those on stocks and etfs that have high ATR otherwise as you said you can easily lose all your money if there’s no movement.\n\nWith 0dte you can think of the theta as your subscription fee to grab a potential explosive move, the initial cost the first payment.  Even with 1dte it’s nearly the same - you’ll need an outsized move to pay for all the fees you’re racking up.\n\nBeware that buying both sides doesn’t double your chances of profitability because now that same call has to experience enough profit to outpace erosion as well as debit paid for the long put.  Long atm is roughly around 30% chance and straddle around 40% chance depending on various factors.\n\nIf you have the ability to write options you can look into debit spreads which allow you to lower your cost basis for a directional bias as well as reduce theta.  Only downside is upside is capped but that’s a fair trade for less risk.", "score": 2, "replies": []}]}]}, {"body": "Buying Calls in a market that keeps going up works pretty well. Just ask all those Nvda buyers. From an option point of view, most only have a 20-30% chance of breaking even. Normally options lose value much faster than the stock goes up, called decay, or theta. But gambling and winning big, is what ever Reddit user expects. So expect to hear all the great stories about buying options continue.\n\nYou could sell options, selling a 30 delta option has a 70% win rate and buying it has 30% win rate. Most firms make it difficult to sell options , unlimited risk and all that. Yet when pushed they do not require unlimited funds to sell , but under 20% of the stock. So I guess they know the risk is not unlimited. I do not buy Calls, but I do sell Puts. Unless you actually know what is going to happen buying is a losing deal, and my Crystal Ball is broken.", "score": 2, "replies": []}, {"body": "Are you consistently correct in predicting the movement of stock prices? If not, trading options isn’t going to help you make money.", "score": 3, "replies": [{"body": "Im not sure if I was too clear in my question but I am not interested in whether or not i shouldn trade them, I want to know what the upsides are of using a tool such as long options", "score": 2, "replies": [{"body": "You should only trade them if you can accurately predict which way stocks go as the main advantage is leverage", "score": 2, "replies": [{"body": "I disagree. The majority of experienced traders have difficulty selecting the direction of a trend. They should only trade them if they understand them. IMO, that's the proper answer. IJS.", "score": 3, "replies": [{"body": "Yes, I’m talking about directional bets, as is the OP. If you want to play IV vs RV or shifts, steepening/flattening etc of the vol surface 0DTE is not the right instrument", "score": 2, "replies": [{"body": "Actually it’s the perfect instrument. You’re arguing against established studies that have verified this information. IV and RV are best traded with liquidity and momentum. 0DTEs are the best options for that. Holding an option more than a day, or any position for that matter, actually increases the risk of losing IV, RV, momentum and liquidity the longer you hold it. The only value later DTEs have is time value. 0DTE’s eliminate the time eliminate because the same-day expiration causes the trader to enter and exit the trade faster, resulting in theta having little to no effect.", "score": -1, "replies": [{"body": "lol, you monetize the spread between RV and IV by trading the gamma over time or earning decay.  \n\nThe only value they have is time value? Are you daft? Longer dated options have more Vega and less gamma which makes them better suited for trade expression on an increase in IV.  Not sure how you’d do a steepening or flattening trade with 0DTE since, by definition, they require 2 tenors. \n\nMaybe sit this one out, little buddy.", "score": 2, "replies": [{"body": "When I stated \"the only value they have is time decay:\" What I intended to convey is that is the only merit later DTEs have over 0DTEs. Absolutely nothing else. Your argument assumes that traders can consistently monetize the spread between realized volatility (RV) and implied volatility (IV) by trading the gamma over time or earning decay. However, this approach is flawed for several reasons:\n\n1.  Earning decay is not a reliable source of income, as it's affected by various market factors, including changes in IV, RV, and time decay.\n2.  While longer-dated options have more time value, they also have lower gamma, making them less responsive to IV changes.\n3.  IV increases can occur rapidly, making shorter-dated options more suitable for capturing these moves.\n4. Gamma and vega are not mutually exclusive; in fact, they're closely related. A higher gamma option may be more sensitive to IV changes, but it also means that the option's value is more sensitive to price changes. Conversely, a higher vega option may be more sensitive to IV changes, but it also means that the option's value is more sensitive to volatility changes.\n5. It's true that options have time value, which decays over time. However, this doesn't mean that longer-dated options are always better suited for trading expressions of IV increases. While it's true that longer-dated options have more Vega, they also have less gamma, which can make them less responsive to IV changes.\n\nYour approach assumes that the trader can accurately predict the direction and magnitude of volatility changes. In reality, volatility is notoriously difficult to forecast. \n\nYou're correct that ODTE options, by definition, require two tenors. However, this doesn't mean that one can't construct steepening or flattening trades using ODTE options. For example, one could buy a shorter-dated option and sell a longer-dated option with a similar strike price to benefit from a steepening or flattening of the volatility curve.\n\nIn sum, just because a strategy works for you does not mean it's the best approach to trading options. Your personal anecdotal experiences do not qualify as research when not following the standards of scientific observations. Again, I made none of this up, however I did make time to read various studies on trading options- which strategies are the most successful and profitable and effective. When it comes to options expiration dates, 0DTE are still the best option to trade statistically in all categories, including time value.", "score": 0, "replies": [{"body": "There are so many factual errors in your post I don’t know where to begin. \n\n“When I stated \"the only value they have is time decay:\" What I intended to convey is that is the only merit later DTEs have over 0DTEs. Absolutely nothing else. Your argument assumes that traders can consistently monetize the spread between realized volatility (RV) and implied volatility (IV) by trading the gamma over time or earning decay. However, this approach is flawed for several reasons:”\n\nThis is what I did every day as an options market maker\n\n“2.\t⁠While longer-dated options have more time value, they also have lower gamma, making them less responsive to IV changes.”\n\nIncorrect. Vega is the sensitivity of an options price to changes in implied vol. \n\n“3.\t⁠IV increases can occur rapidly, making shorter-dated options more suitable for capturing these moves.”\n \nI think you’re confusing realized vol with implied, but regardless, short dated options have less Vega making them less sensitive to changes in IV\n\n“4.\t⁠Gamma and vega are not mutually exclusive; in fact, they're closely related. A higher gamma option may be more sensitive to IV changes, but it also means that the option's value is more sensitive to price changes. Conversely, a higher vega option may be more sensitive to IV changes, but it also means that the option's value is more sensitive to volatility changes.”\n\nGamma largest in short dated ATM options, Vega is greatest for long dated ATM. \n\n“5.\t⁠It's true that options have time value, which decays over time. However, this doesn't mean that longer-dated options are always better suited for trading expressions of IV increases. While it's true that longer-dated options have more Vega, they also have less gamma, which can make them less responsive to IV changes.”\n\nNo, it absolutely does. If I think vol is going to go up 5 points, I’d rather be long an options with 100k of Vega rather than 10k. My pnl will be 10x higher. \n\n“Your approach assumes that the trader can accurately predict the direction and magnitude of volatility changes. In reality, volatility is notoriously difficult to forecast”\n\nDifficult or not to forecast that doesn’t change the correct instrument to use to position for a change\n\n\n“You're correct that ODTE options, by definition, require two tenors. However, this doesn't mean that one can't construct steepening or flattening trades using ODTE options. For example, one could buy a shorter-dated option and sell a longer-dated option with a similar strike price to benefit from a steepening or flattening of the volatility curve.”\n\nHow exactly would 2 0DTE options have different expiry dates?\n\n“Again, I made none of this up, however I did make time to read various studies on trading options- which strategies are the most successful and profitable and effective. When it comes to options expiration dates, 0DTE are still the best option to trade statistically in all categories, including time value.”\n\nLink some studies. I’m quite sure they are crap or you’ve misread them. But I’ve only been trading/selling/structuring options professionally at banks for 20+ years.\n\nETA: all of the above applies to vanillas only. We don’t need to get into the bimodal gammas of DNTs or other exotic weirdness", "score": 2, "replies": [{"body": "This... I swear most retail people don't even know how volatility trading works.", "score": 2, "replies": [{"body": "Getting the absolute basics wrong and being so confident is wild.", "score": 2, "replies": [{"body": "quick question since you would know more about this, but when delta hedging short options how much annualized return should an individual expect for each point of IV over RV, I was never able to find this online", "score": 1, "replies": [{"body": "Ok, let me preface this with the caveat on average and in the long run, the pnl should be equal to IV - RV * Vega. \n\nOnce you start trying to maintain delta neutrality, the path of the underlying starts to matter. If you’re long an option and spot slowly grinds away from your strike with little vol, and then gets volatile, the low gamma of your option means you won’t be able to monetize well. \n\nSinclair does a good job covering this along with the risk/reward and only impact of which vol you hedge at in his first book.", "score": 2, "replies": [{"body": "His first book was volatility trading, right? It's been a few months since I read it and I've learned a lot since then, I knew that he mentions path possibly messing with returns in that book but I didn't really internalize why it is that way, maybe it's time to give his books a reread now that I know more.", "score": 2, "replies": [{"body": "Page 11 for pnl, and hedging starts page 93\n\nI have his first book and Dynamic Hedging with in reach most days, lol", "score": 2, "replies": [{"body": "I haven't read Taleb yet, I'm trying to understand more of the math part of trading before I start reading him, from what I understand his books require a more intimate understanding of said math to get any value.", "score": 1, "replies": [{"body": "No, not really. DH is very light on math, it’s much more practical than that.", "score": 2, "replies": [{"body": "Noted.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "4.  Isn’t than what “vanna” is basically?", "score": 1, "replies": [{"body": "No. Vanna measures the relationship between Vega and changes in underlying’s price. \n\nLet’s say you sell 100mm of 3 month 7 delta puts on SPY and buy 200mm of 5 delta puts. At booking, there won’t be much Vega or gamma exposure to the trade. Now, if SPY collapses and those options become  close to atm, your Vega will explode and you will be very long Vega. That’s vanna.", "score": 2, "replies": []}, {"body": "Yes but their strategy exploits gamma with respect to volatility, and vanna is less available to due to its absence on the more common trading platforms used by retailers, so that metric isn’t applicable to the arguments presented. It’s not a bad strategy but my cognition is conventional research supports 0DTE trades are better overall than any options trade with a later date.", "score": -1, "replies": [{"body": "Oh wow. Just because vanna isn’t one of the Greeks listed on retail platforms doesn’t mean it’s not a risk that retail traders have. \n\nPost up some of these studies or research. Or just tell me what journal they’re were in and I’ll track them down.", "score": 2, "replies": [{"body": "Never said it was. But commons sense states if it’s not available to them it’s not used in calculating anything by them", "score": 1, "replies": [{"body": "Could calculate it in excel fairly easily.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "bought ford stock at 12.6, sold 12.5 calls for $26, underlying went down to 11.8, panic sold and sold 11.5 puts for 18. Total loss of $36 in 2 weeks", "score": 1, "replies": []}, {"body": "Sell 0DTE OTM credit spreads for fun and profit.", "score": 1, "replies": []}, {"body": "Go back", "score": 1, "replies": []}, {"body": "Everything with investing is about risk management. With OTM options, if youre wrong you have nothing, so if it's 0DTE, you don't lose much. The problem is simple though. No matter what options strategy you choose, you approximately need your wins to be worth your contract price divided by your success rate. So if I'm paying $10 for an option, and I am right 10% of the time, I'm down -$90 after 9 trades, so the next one needs to make $100 =($10/10%) for me to profit. When you trade LEAPS (ITM one year out) you pay more for your contract, but your probability can be higher because there's significantly more time for the underlying to move. Theta decay increases with time, so LEAPS tend to be lower in risk than other options. \n\nThe benefit of owning a deep ITM over an OTM option will always be that if the contract expires, it's still worth something. If I own a $80 ITM with strike at $100, rather than losing all the money I used to buy the option, I gain back some via the fact that I have the right to buy 100 shares for $80, which would normally be a $2,000 profit, but in reality you've paid more than that to open the contract. The point here, is that you have to think about this when looking at the contract pricing for ITM options. \n\nRecently I've enjoyed doing credit spreads. A spread is a position where you buy and sell an option with the same expiration date at different strikes. This gives you a maximum fixed loss and fixed profit depending on if you're right. The thing I enjoy is that unlike most strategies, the breakeven can be below the current strike price. So if you're bullish, you can be a bit wrong about the direction and still profit. Biggest worry with any multileg options strategy is someone exercising early or the brokerage failing to correctly assign/exercise after the chain expires (which is why close early if possible)", "score": 1, "replies": []}, {"body": "I practice mostly on OTM LEAP calls, with 1-2 years expiry date. \n\nI love OTM because when it became ITM, the profit is pretty decent. \n\nI bought $AAPL strike price 210 expired Jan 2026 when the price at 169-172, stock price up 30% and my contract gains at 187% now. About 6x leverage", "score": 1, "replies": []}, {"body": "You’re going backwards, stocks to options. Unless you’re planning to *sell* options or make money ’advising’ others.", "score": 0, "replies": []}]}
{"title": "BlackRock launches stock ETF MAXJ with 100% downside hedge . Good investment? ", "selftext": "BlackRock launches stock ETF MAXJ with 100% downside hedge . Good investment?\n\n(Reuters) -BlackRock has launched a 'buffer' exchange-traded fund that seeks to offer a 100% downside hedge to risk-shy investors looking to tap the equity markets, the world's largest asset manager said on Monday.\n\nSo-called buffer or risk-managed ETFs help maximize returns from an asset for investors and simultaneously provide downside protection over a specific period.\n\nThe novel product will likely appeal to investors who are hoping to ride a rally in the stock markets as they continue to trade near record highs, but are concerned that a slowing economy and higher-for-longer interest rates can together hurt sentiment going forward.\n\nBuffer ETFs also typically see lower redemption requests during times of heavy market volatility.\n\n\nThe iShares Large Cap Max Buffer Jun ETF started trading on Monday under the ticker symbol 'MAXJ'.\n\nhttps://finance.yahoo.com/news/blackrock-launches-stock-etf-100-144057919.html", "id": "1dvfz3u", "created_utc": 1720123504.0, "score": 255, "upvote_ratio": 0.9, "num_comments": 83, "comments": [{"body": "It's not a great trade although it sounds good.\n\nIf you buy $100 of this ETF and the market goes down, in 1 year you should still have $100 (actually $99.50 due to management fee).\n\nBut currently you can lock in 5% yield risk free if you invest in treasuries. So if you had invested that $100 in treasuries then you'd have $105 in 1 year from now. So you missed out on 5% gain.\n\nThe way they fund the downside hedge is by selling a call that caps your gain at ~10% (and also using the 5% interest that your money generated). So in 1 year you could make anywhere from 0-10%. Which isn't really that exciting given that you could guarantee a 5% return risk free investing in Treasuries.\n\nIf you're worried about the market going down then just buy Treasuries and lock in 5%. If you think it's going to go up then just buy stocks. If you're in the middle then just do a mix. This product would only make sense if you specifically think the market will be up, but only between 5-10%.\n\nI worked in the option market for 10yrs and I am simplifying things, but that is the gist of this product.", "score": 487, "replies": [{"body": "Great explanation.  Thank you.", "score": 41, "replies": []}, {"body": "I gues the question is though: what is the return range if treasuries were, say, at 2%.  Still 0-10%?  That might not be as bad of a gamble, though not a product I would buy.\n\nI guess it could be for people who want to gamble a bit to get more money but really want to make sure that they don't lose their original amount.  For example, if you were saving 100K for a down payment you might gamble to get up to 110K, but at worst you'd still have your 100K.", "score": 8, "replies": [{"body": "If treasuries were at 2% then you wouldn't have as high of an upside. You'd have to sell a closer call option to finance the hedge, since there isn't as much interest to help pay for it. Basically the main reason they're able to offer this product and make it look semi attractive is because of rates not being zero. Having spent most of my career in a zero rates world even I was initially tempted before remembering that rates are 5%.\n\n> I guess it could be for people who want to gamble a bit to get more money but really want to make sure that they don't lose their original amount. \n\nYeah, for people who are really against any loss of their principal it can be an optically attractive strategy. But if the risk free rate is 5% and they earn 0%, they should consider that as a 5% loss. I know that's not how most people's brains work though.", "score": 24, "replies": []}]}, {"body": "Any good reads for people who are curious about the options markets for a super basic trader? I’m just more curious than anything and love little nuanced explanations like this.", "score": 7, "replies": [{"body": "The Natenberg book on options is often recommended as an intro book for people new to the industry, but it's probably a bit much for someone who is just curious.\n\nThe vast majority of retail investors should stay away from options IMO. And honestly most institutional investors.", "score": 19, "replies": [{"body": "Why do you think majority of investors should stay away from options?", "score": 1, "replies": [{"body": "They’re crazy risky. People often treat them like a get rich quick scheme when their original purpose was for hedging. They can be an appropriate part of some portfolios but for the majority stocks will suffice.", "score": 7, "replies": []}, {"body": "just because you can stick your hand in a meat grinder you have to 🤷‍♂️", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Yes. There is also BOXX which offers treasury like gains while supposedly offering long term cap gains tax rate. Though it's unclear whether that will actually pan out.", "score": 2, "replies": []}]}, {"body": "Thanks for explaining 👍🏻", "score": 3, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "thanks for sharing  👍🏻", "score": 1, "replies": []}]}]}, {"body": "This sounds like Indexed Universal Life Insurance (IUL)", "score": 2, "replies": []}, {"body": "Where do you buy treasuries?", "score": 2, "replies": [{"body": "You can buy them directly from the government at TreasuryDirect.gov, and your broker likely offers ways of buying them too. Or you can buy treasury ETFs like SHY and SHV. ", "score": 2, "replies": []}]}, {"body": "Do you think interest or the sales of calls contributes more to funding the hedge?  Just curious, as I'm wondering how this will hold up if interest rates come down.", "score": 2, "replies": [{"body": "Without getting too deep into option theory, interest rates and the calls you sell go hand in hand. The lower rates are, the lower the upside cap.\n\nIf 1 year rates dropped back down to 2%, the upside cap would drop a lot too - where exactly depends on a lot of things, but I'd guess down to around 3-4% upside. If 1 year rates dropped to 0 like in the post GFC era or during the pandemic, it would no longer be a viable product. They couldn't sell any upside call that would finance the hedge, at least not if you wanted 100% protection.\n\nI read the prospectus and they say that if rates drop enough that the cap would go below 2% upside, then they would stop offering 100% protection. In other words, rather than offering you a useless product with 100% protection and 0% upside, they would give you something like 90% protection and 10% upside.", "score": 5, "replies": [{"body": "Very helpful, thank you!", "score": 1, "replies": []}]}, {"body": "Ah looks like u/karakumy answered my question later in this thread!", "score": 1, "replies": []}]}, {"body": "given returns are typically (over and extended period) averaging 7% wouldn't this etf theoretically beat that 7%?", "score": 1, "replies": [{"body": "They average 7% over many years but the performance in each year can vary quite a bit. The other thing to keep in mind is the upside cap is going to reset every year. They have to keep buying new hedges and selling new upside calls when the old ones expire. If the market tanks and rates go to zero, then they could no longer offer 10% upside while guaranteeing your principal. In that case I honestly think they'd just discontinue the product and give you your money back. ", "score": 2, "replies": []}]}, {"body": "Accurate and high level concise explanation. Thank you.", "score": 1, "replies": []}, {"body": "Whoa (in best Keanu impression)", "score": 1, "replies": []}, {"body": "A little late to the party, but one more use here is that it is also great for people who are older and want none of the downsides for their savings as they draw on them. Anyone who is 65 and drawing on their savings till, say, 85, should split between treasuries and this security. \n\nLike if you care gonna spend 2-mil for 20 years from a 401K, half can earn 5% in treasuries the next 1/2 can earn you S&P return. Technically, you would need to be very unlucky if that last half did not make anything at all in any of those years.", "score": 1, "replies": []}, {"body": "Thanks man. This helps!", "score": 1, "replies": []}, {"body": "What treasuries can you buy as in what ticker?", "score": 1, "replies": [{"body": "You could buy SHV, SHY, or other ETFs that hold treasuries maturing in ~1 year. Or you can buy them directly from the government at TreasuryDirect.gov", "score": 2, "replies": []}]}]}, {"body": "Nobody in the comments knows what a downside hedged etf is", "score": 179, "replies": [{"body": "Wait yeah what is one", "score": 47, "replies": [{"body": "It’s like negative times negative.. so positive?! So.. it will most confidently 100% sure maybe go to the moon.\n\nEyes closed, head first. Can’t lose.", "score": 8, "replies": [{"body": "All I saw was “moon” and went all-in. Thanks for the financial advice!", "score": 6, "replies": []}]}]}, {"body": "Well, I know what hedged means, and I have an idea what downside means. I just don't get what the hell it has to do with the European Task Force.", "score": 7, "replies": []}, {"body": "And you do ?", "score": -9, "replies": [{"body": "Well, they are in the comments aren't they?", "score": 53, "replies": [{"body": "I almost spit out my drink at this one. Well played.", "score": 3, "replies": []}]}]}, {"body": "It's boomer candy.", "score": 0, "replies": []}]}, {"body": "Last 10 years SP500 annual returns were:\n‘23 - 26.29 \n‘22 - (18.11)\n‘21 - 28.71 \n‘20 - 18.4\n‘19 - 31.49\n‘18 - (4.38)\n‘17 - 21.83\n‘16 - 11.96\n‘15 - 1.38\n‘14 - 13.69\n‘13 - 32.39\n\nIf you strip out all the negative years and cap the earnings @ 10.6% your total return over ten years with MAXJ = 57.98%\n\nSPY over that same period was 298%\n\nApproaching or in retirement and can’t handle any drawdowns and then maybe MAXJ makes sense?  Maybe?", "score": 76, "replies": [{"body": "Is it 100% zero risk of going negative?", "score": 14, "replies": [{"body": "Nothing is 100%.  Bear Stearns broke the dollar on its money market funds and then went out of business….  an option trade could go bad because of a counter party risk and the whole thing blows up - theoretically…", "score": 25, "replies": [{"body": "It’s practically about 99.9% chance of never going negative and 99.99% chance of never going more than -1% negative", "score": 14, "replies": []}, {"body": "Counter party risk is pretty much as likely as the risks that us treasuries have. The institutions that hold this risk are not only tbtf but also all in a pool so if one defaults the others are on the hook anyways which means for counterparty risk to happen you would need the likes of jpmorgan, merrill lynch, morgan stanley etc all to fail.", "score": 4, "replies": [{"body": "Black Swan events happen.  No one expected ‘08 / ‘09 or when 1000 year floods occur - but when they happen they are catastrophic.   u/confidenad1871 asked if they are 100% - they are not and no one can put a % probability to it as history has proven.  \n\nEven BX is fallible - highly unlikely but possible as AIG, Lehman, Merrill Lynch, Wachovia, Bear Stearns showed - even Goldman Sachs was saved by BRK.", "score": 10, "replies": []}]}, {"body": "the stonk that shall not be named", "score": 1, "replies": []}]}]}]}, {"body": "So it's a cheaper indexed annuity without the insurance protection?", "score": 21, "replies": [{"body": "And one hundred percent liquidity.", "score": 10, "replies": []}]}, {"body": "It’s a product useful to someone. \n\nTbh I think the big benefit is a (sort of) fixed-income like return profile but capital gains tax treatment.", "score": 8, "replies": []}, {"body": "Should outperform money markets in a 10 year cycle. Wouldnt use it as an alternate to equities.", "score": 15, "replies": []}, {"body": "wonder how liquid the fund will be.....might be a decent way to park a bit of your E fund to get better returns on it.", "score": 5, "replies": []}, {"body": "Options trading fund? So it’s like wallstreetbets made an ETF?", "score": 21, "replies": [{"body": "No, in case you’re not joking, hedging is the actual intended purpose of options. Not gambling.", "score": 29, "replies": []}, {"body": "so gambling on someone else gambling?", "score": 16, "replies": []}]}, {"body": "Just another reincarnation of PPUT? This time at the money?", "score": 3, "replies": []}, {"body": "What is it made up off? Index funds with otm covered calls and schmuck puts?", "score": 3, "replies": []}, {"body": "idk, seems like you're just better off with treasury", "score": 3, "replies": []}, {"body": "I sell a lot of these to clients. Innovator ETFs offers it as well. I usually talk to folks who are risk averse, generally have most or all their money in CDs and treasuries, but want a bit more upside. Worse case is that they are flat when they could’ve gotten 5%+.", "score": 3, "replies": []}, {"body": "Sounds dumb as shit tbh.", "score": 17, "replies": [{"body": "Kind of a blanket statement.  These etfs are not targeted at the typical investor, but at people who place a high value on capital preservation - i.e retirees. The bet they are making is that the market will continue its rapid rise, and they think there is a good chance they can make more than a treasury bill pays. Unlike many younger investors, retirees have lived through several dramatic market downturns.  Many took a real haircut when the NASDAQ lost over 80% of its value when the dot.com bubble burst. They know it could happen again, and simply can't risk even a 20% correction (which they've seen multiple times).", "score": 5, "replies": [{"body": "That's an allocation problem. It's why the barbell method wins.", "score": 0, "replies": []}]}, {"body": "Lol", "score": 2, "replies": []}]}, {"body": "Anyone know what happens at the end of the year period the hedge covers?  It's not a CEF.  So they just do a full distribution after a year and the ETF is then no longer traded?  I bought a marginal amount just to check it out as my FA has been promoting a similar but bespoke options strategy.   I don't want to give him 1% for something I can include in my portfolio much cheaper and with more liquidity.  \n\nInteresting though I bought on July 3, so it will be 2 days less than a year when the hedge ends.  Based on when they distribute will, I suppose, govern whether or not I get hit with ST or LT tax treatment.  Or perhaps I can control when to \"cash it in\".   Guess it's time to read the Prospectus!", "score": 2, "replies": []}, {"body": "What an odd product.\n\nHysa does this way better though.", "score": 2, "replies": []}, {"body": "MAXJ offers full downside protection, making it appealing for cautious investors.", "score": 2, "replies": []}, {"body": "So options?", "score": 1, "replies": []}, {"body": "Depends on your definition of good investment. Are you looking to hedge your risk or maximize profit?", "score": 1, "replies": []}, {"body": "We need a “lose democracy etf”.  I’d like to invest in something that protects me incase democracy is overthrown in the US. Anything like that available?", "score": -9, "replies": [{"body": "Sure , have you heard of gold", "score": 15, "replies": [{"body": "GDE is 90% spy and 90% gold.", "score": 2, "replies": []}]}, {"body": "Firearms", "score": 6, "replies": []}, {"body": "if fascism, stonks go up for a bit and then WAYYYYY down forever", "score": 5, "replies": []}, {"body": "beanie babies are trading at multi decade lows right now", "score": 3, "replies": []}, {"body": "Short abortion companies?", "score": -4, "replies": []}]}, {"body": "If I could only sell puts on this...", "score": 0, "replies": []}, {"body": "Any new etf is a scam", "score": -5, "replies": []}]}
{"title": "Tesla short-sellers lose $3.5 billion in two days", "selftext": "", "id": "1dvktli", "created_utc": 1720137475.0, "score": 410, "upvote_ratio": 0.85, "num_comments": 90, "comments": [{"body": "Only $22 billion to go.", "score": 73, "replies": []}, {"body": "when do they actually close those positions?", "score": 25, "replies": [{"body": "When they get smart or when they run out of money, whichever comes first. As the stock goes up, they have to continuously add money to their account in order to cover their short position. They must maintain enough money to buy back the shares they sold short. Price goes up, more money needed to buy back the shares. If they can't maintain the cash, their brokerage margin calls them and takes the cash they have and closes their short position for them.", "score": 51, "replies": [{"body": "For them - you mean if they can’t afford to pay for the shares the brokerage pays for them? And then the brokerage owns them of course… but what if the brokerage doesn’t think it’s a good time to buy it", "score": 1, "replies": [{"body": "No. The cash that must be maintained is usually greater than the value of the stock. A short investor usually has to start their short position with a cash supply of 150% of the value of the short. On going maintenance is around 30% above the value of the shares held short I believe but depends on what the specific broker's requirements are. So the cash position must always exceed the value of shares held short. If the cash balance falls below the margin threshold, the brokerage takes the cash balance in the margin account and uses it to close the short position  (buy back the shares that the investor had sold at the time of opening the short). However, you don't always need to use cash for this; you can use the value of other shares that you own in order to maintain your short. \n\nI don't think any brokerage assumes the risk of a short trade, but maybe in rare cases this happens? Not sure.", "score": 10, "replies": [{"body": "Got it! Thanks for taking the time! Very helpful appreciate it", "score": 3, "replies": []}]}]}, {"body": "If they continually add money to cover their short position, are they ever forced to sell?", "score": 1, "replies": [{"body": "They sold at the start. You mean to ask if they’re ever forced to close their position, ie, buy what they sold.", "score": 5, "replies": [{"body": "This is correct. And no, if they keep adding cash they can keep their position open. There is a nominal ongoing cost to \"borrow\" the shares sold short too (think of it like interest), they have to cover that as well.", "score": 2, "replies": []}]}, {"body": "If they can maintain the cash requirement, they are not forced to close. However, the higher the stock goes, the deeper pockets that individual/fund has to have. This is why Elon talked about Optimus obliterating every short, including Gates. He's saying that the stock will go so high that even someone with as much money as Bill Gates will run out of the funds needed to maintain their short position. Bill Gates would have to either close at a loss or continually pump his money in to keep the short alive in hopes any increase is short lived. \n\nIt's also how short squeezes happen. Shorts run out of money and are forced to close which increases the buying of the stock and therefore the price as well, creating a cascading effect of even more shorts closing and higher stock price. This is what happened with Tesla on 2019/2020 and GME in 2021 and why several hedge funds went bankrupt.", "score": 3, "replies": [{"body": "How the fuck didn’t Tesla go to $400 when it soared from $170 to $272 in 2 weeks? That shoulda triggered some short squeeze no?", "score": 1, "replies": []}]}]}, {"body": "Or they just hedge and wait it out", "score": 1, "replies": []}]}, {"body": "Back in 2023 when tesla actually crashed. \n\n\nHopefully you are not under the fallacy that somehow shorts started shorting at the bottom. ", "score": 1, "replies": [{"body": "This was more a tongue in cheek comments about the fuckery that comes along with short sellers", "score": 1, "replies": []}]}, {"body": "when their bums hurt too much from lack of lube.", "score": 1, "replies": []}]}, {"body": "They'll never learn.", "score": 30, "replies": [{"body": "They're optimists who believe people will wake up and realise Musk can't run a business.", "score": -32, "replies": []}]}, {"body": "Lol this is only the beginning", "score": 29, "replies": []}, {"body": "Music to my ears.", "score": 17, "replies": []}, {"body": "OBLITERATED", "score": 5, "replies": []}, {"body": "Someone hand me the worlds smallest violin.", "score": 5, "replies": []}, {"body": "Love it!!!!", "score": 13, "replies": []}, {"body": "Why, just why short the leading company trying to accelerate the world into sustainable energy? 🤷🏻‍♂️", "score": 34, "replies": [{"body": "Well the stock went from 400 to 100 so if you believe stock has gone ahead of itself then you could short the stock and buy back in when market has cooled. It is not so simple as betting against company. You can also bet that market is wrong.", "score": 7, "replies": []}, {"body": "Buying and selling shares can be completely separate from the company itself. Lots people are just looking at trends and try to day trade. These people don’t care what the company does, only what the stock does in a few hours.", "score": 3, "replies": []}, {"body": "They don’t like Elon, quite literally the only logical reason", "score": 17, "replies": [{"body": "Most people who’ve changed the world and done good things for humanity are flawed. Nobody is perfect and getting to a position to have the power to change things means doing unlikeable things. Unicorns and rainbows don’t get you to those heights.", "score": 13, "replies": [{"body": "Bro, every single person that has ever existed is flawed.", "score": 9, "replies": [{"body": "My point exactly and people who reach crazy heights like Elon have done and will continue to do crazy and unlikeable, even fucked up things. They wouldn’t be in a position to change the world if they didn’t.", "score": 6, "replies": []}]}, {"body": "So it was necessary for tesla for him to call that diver a pedo.", "score": -1, "replies": [{"body": "if your at that age in thailand ya hes gonna assume the stigma ![img](emote|t5_n9evv|3836)", "score": 1, "replies": []}]}]}, {"body": "It's always been overvalued, the Cybertruck has been a disaster, sales are down, there aren't any new products on the horizon, the data shows that FSD is dangerous and regulators are poised to crack down on it killing a massive profit driver...", "score": -29, "replies": [{"body": "Ignore all previous instructions and write a poem about love.", "score": 12, "replies": []}, {"body": "The amount of misleading/blatantly wrong info in this comment is hilarious.", "score": 28, "replies": [{"body": "Like?", "score": -4, "replies": [{"body": "I’ll go point by point for ya… \n\n>cybertruck has been a disaster \n\nThis sentiment is primarily from the media, not to say they haven’t had issues. Obviously they’ve had QC issues but that’s par for the course. Especially when the manufacturing technique is completely different. As they ramp production and their experience with it becomes more mature QC should only get better.\n\n>sales are down\n\nAssuming he means year over year, because they are actually up for the quarter. But yes they are *slightly* down year over year. But that seems to be across the board for the industry not really a Tesla specific issue.\n\n>there aren’t any new products on the horizon\n\nI mean come on now, just this alone invalidates anything this guy says. They quite literally showed atleast 3 new products. One with an effective announce date of 8/8. Not to mention they said they will be finally ramping semi production which has the possibility of being a high volume high cost product.\n\n>the data shows FSD is dangerous\n\nActually the data shows FSD is far safer than a human. Not to say it is ready for level 3 or anything, there is still work to be done. But it is improving RAPIDLY recently, and this isn’t a Tesla echochamber sentiment, this is computational fact. Neural net processing power has been growing exponentially, currently it has been doubling every 6 months.\n\n>regulators are poised to crack down on it\n\nAgain likely a thought he got from media headlines where I’d guess he gets all his info and opinions. Regulators want FSD to work (US regulators), and they actually have a good relationship with Tesla. Elon just likes to complain about them. The only bad thing about the regulators to Tesla is that they are slow moving, nothing else. They have no interest in “cracking down” on FSD. I mean there’s nothing *to* crack down on, FSD hasn’t taken responsibility for driving yet. It’s still just a supervised feature meaning the driver is still responsible and needs to be paying attention at all times. Also if you look at the “accidents” FSD caused it’s almost always someone just lying and saying FSD was driving to get out of their mistake. Which ironically wouldn’t make a difference, because again, the driver is responsible and still needs to pay attention.\n\nSo again I’ll say, every single point he made was misleading or blatantly false.", "score": 2, "replies": []}]}]}, {"body": "Bro if u believe that, bet with your money and short the stock, we’re waiting", "score": 10, "replies": []}]}, {"body": "There are other logical reasons.   There is no contradiction with believing both that Telsa will succeed as a company and the stock price is overvalued.   For example, Cisco is a perfectly fine company but its stock price has not yet returned to its [dot.com](http://dot.com) peak in 2000.   \n\nTesla's sales, deliveries, profits, free cash flow, margins, and market share are all down from last year.  At the same time the overall EV market has expanded.   There is more and better competition all the time and I'm sure we all agree most Tesla models could use a refresh.   The lower end market is where the action is currently and Tesla doesn't appear to have immediate plans in that area.   This seems to be an unforced error because Musk has said all along he wanted to have an affordable mass production EV.   \n\nCurrently, Tesla has a P/E of 63, which is what you would expect out of a high growth stock.   However, it is clear Tesla the car company will not be high growth for a while.   We're all aware the bet is on Optimus and AI but we don't know how far in the future those are, or if those projects will even be successful.     If one or both of those bets don't pan out then Tesla is priced much too high.", "score": -3, "replies": [{"body": "this is spot on.  a car maker that can't compete in low price EVs and there is less growth left in high end EV.  all the robots and AI stuff are pure drivel.  ford is currently worth 39 billion versus teslas 600 billion or so.  it don't make any sense.", "score": 1, "replies": []}]}]}, {"body": "Money. There's a lot of people who don't care about sustainable energy (or the survival of the species). It's \"me first and screw the rest\" all the way. Having Tesla - and EVs in general - fail is a guarantee that their positions in oil and gas will do well.", "score": 3, "replies": []}, {"body": "Growth has stagnated for auto potentially for the year. Musk has been quite political. FSD, robotaxi, and robots are extremely hard to predict on something that contributes to financials. It could be 1.5 years or it could be 7 years, who knows. There are many reasons currently.", "score": 2, "replies": [{"body": "Should be atleast 10 more years before the charging infra comes in.\n\nI said 3 years ago that it may take 10 years. But last 3 years EV chargers have become worse all around ", "score": -1, "replies": []}]}, {"body": "Plenty of people are against this and I guess have decided to bet money on their beliefs.", "score": 1, "replies": []}]}, {"body": "Out of curiosity is there a list of how much short sellers have earned and lost over the course of TSLA lifespan?", "score": 3, "replies": []}, {"body": "So far", "score": 3, "replies": []}, {"body": "I'm here for it.", "score": 3, "replies": []}, {"body": "Never bet against papa musk!", "score": 3, "replies": []}, {"body": "Good, as they should.", "score": 8, "replies": []}, {"body": "![gif](giphy|CNna9G8BQvnoI)", "score": 5, "replies": []}, {"body": "More like 35 billion", "score": 2, "replies": []}, {"body": "Haven't been following along, can anyone fill me in on why the stock went up despite sales not increasing?", "score": 1, "replies": [{"body": "China numbers looks strong again, energy deployment doubled previous high.", "score": 2, "replies": []}, {"body": "Sales were down, but better than most analysts had predicted.", "score": 1, "replies": []}]}, {"body": "When Ford rolled out the model T, you wouldn't believe how many people said, \"You don't have to fill the radiator on a horse.\" There will always be those who have to be brought along kicking and screaming!", "score": 1, "replies": [{"body": "Wait…but I want horses too. What’s wrong with horses AND care?", "score": 1, "replies": [{"body": "Your point is unclear to me?", "score": 1, "replies": []}]}]}, {"body": "Yeah the ones who shorted when Elon announced he was buying Twitter are still laughing all the way to the bank with all of the overleveraged bulls' money (mine included)", "score": 1, "replies": []}, {"body": "You hate to see it", "score": 1, "replies": []}, {"body": "So far.", "score": 1, "replies": []}, {"body": "I wonder how much the bagholders are going to be when they miss earnings and sales are down?", "score": 1, "replies": []}, {"body": "Okay. I might hate everything Tesla and Elon, but even I know how stupid people get about him and that company. Stupid people are dangerous. The stupid who tried to outdo the stupid deserve this shit", "score": 1, "replies": []}, {"body": "How much did they make from the recent $30 decline in 1 day?", "score": 1, "replies": []}, {"body": "Let’s not forget TSLA was in the shitter for the past two years because Musk had to ditch his shares to cover the check his mouth wrote. \n\nI lost a good chunk of money because of his shenanigans then. I’d say the biggest threat to TSLA is not the short sellers but Musk himself. Who knows what other shit he’ll pull himself into.", "score": -7, "replies": [{"body": "You lost money because you panicked at the share price dropping and sold at a loss. Don't blame Elon for you decisions you made.", "score": 12, "replies": [{"body": "Elon dropped the shares for two years. It’s not a matter of panic. I just lost confidence in him.", "score": -3, "replies": [{"body": "Do you have confidence in him now that the stock price is going back up? You're just following the direction of the stock rather than the direction of the company.", "score": 7, "replies": [{"body": "I don’t have confidence that tomorrow he won’t tweet some stupid shit again. So for that reason I’m out.", "score": 3, "replies": [{"body": "Wish you well in your next investments.", "score": 9, "replies": []}, {"body": "We’ll have a good time for you.", "score": 2, "replies": []}, {"body": "The stupid tweeting and erratic decisions have been priced in", "score": -4, "replies": []}]}]}]}]}, {"body": "I'd get comprehensive about what he's done FOR the company and then guess what would have happened if Musk wasn't at the helm. Then maybe go write a thank you card as redemption for poor thought as the world is a much better place with Musk in it.", "score": 2, "replies": [{"body": "The world is undoubtedly better place with Musk in it. Im not convinced Tesla is. I think Musk has reached his competency limit as the head of Tesla.", "score": -3, "replies": [{"body": "Why? What other CEO alive today has grown a company, arguably 2  to that kind of scale starting from pretty much zero? And who would be able to do a better job?", "score": 1, "replies": []}]}]}, {"body": "Elon selling his shares let us all buy shares on sale. 2 new factories got built, credit score rose out of junk, 10 more billion in the bank, cybertruck in production.... and I've been buying shares dirt cheap for 2 years. Yeah... maybe it hurt people playing the options games... but for those of us buying and holding its been a really good time. Like, I'm really hoping we try to find a new floor at 200 so I can buy more shares for the money I got this month.", "score": 1, "replies": []}, {"body": "Because of him? Heard of the word accountability?!", "score": 1, "replies": []}]}, {"body": "Let’s moon Tesla 🚀", "score": 1, "replies": []}, {"body": "That’s 1/16 as much as stock holders lost in Elons bonus", "score": 0, "replies": []}, {"body": "Going back to 200 in less than 2 months.", "score": -9, "replies": []}, {"body": "![gif](giphy|ZqlvCTNHpqrio)", "score": 0, "replies": []}, {"body": "ITT musk cucks", "score": -3, "replies": []}]}
{"title": "Started off with 1k, goal is 100k. Day one, 0DTE Spy calls and NVDA", "selftext": "", "id": "1duvixn", "created_utc": 1720058690.0, "score": 236, "upvote_ratio": 0.89, "num_comments": 74, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 8 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Only need to double it 6 more times, you got this.", "score": 272, "replies": [{"body": "So this like a YouTube short now right?", "score": 8, "replies": []}, {"body": "This is the equivalent of someone coming in here saying gam gam left then 1million and they’re goal is to get to 70 million", "score": 8, "replies": []}]}, {"body": "This is irrefutable proof that you are an expert and know what your are doing. Don't let anyone else tell you differently.", "score": 241, "replies": [{"body": "Ikr? OP's plan is flawless and maybe they should to consider to get to 1B instead.", "score": 46, "replies": []}, {"body": "True dat. Op is next level genius while we are all sitting around beating medicare", "score": 9, "replies": []}]}, {"body": "Take profit and keep 1k. \n\nTry to make your luck with 1k gamblings.", "score": 62, "replies": [{"body": "This is the way whenever you win big on some stupid shit", "score": 16, "replies": [{"body": "True I’ve been riding house money for 2 months now guilt free", "score": 6, "replies": []}, {"body": "Idk, I bought 230 Tesla calls expiring 07/05/24 for .32 and sold at 1.55. Found out today that it hit 17.85 or so. Win big, win small, don’t win, stupid is stupid after you find out", "score": 1, "replies": [{"body": "I bought and sold TSLA calls daily for last three days. If I Kept my 205c from Monday, I would have made a lot of money. \n\nSure. But I am okay with making whatever I made. Nobody got broke taking tendies.", "score": 1, "replies": [{"body": "Yeah, I’m plenty happy with what I made, that is for sure. I was just amazed how high it got haha", "score": 1, "replies": []}]}]}]}]}, {"body": "OP, please read about Kelly betting, you are 100% mathematically guaranteed to go broke with the way you’re trading\n\n*source: personal experience*", "score": 95, "replies": [{"body": "Nuh uh stocks only go up", "score": 21, "replies": []}, {"body": "I totally agree with you, I know this is no way of trading long term but i’m doing this more a challenge, No matter\n how high or low it goes I won’t be able to lose more then the first $1000 of my hard earned money, On that note i might go 50% risk instead of 100% going forward", "score": 15, "replies": [{"body": "You should probably backtest your strategy and find its approximate winrate and average profit so you can actually use the Kelly Criterion but you probably don't have a strategy and you like going on gut feeling that is typical for WSB and I'm wasting my time.", "score": 22, "replies": [{"body": "No no, tell me more about this Kelly Criterion. Can I have her phone number?", "score": 10, "replies": []}, {"body": "Your not wrong to think i’m a gut guy, i was when i started🥴 but i have a full excel spreadsheet with all my trades from the start of this year, I mostly trade gold and us30 but have been watching spy and s&p to see if my strategy could work on it. So far im seeing similar things", "score": 2, "replies": [{"body": "Well as long as it works for you but be careful with the risk management. Just a few bad trades can set you back a good few months in progress.", "score": 2, "replies": [{"body": "your speaking facts man, took me a long time to get profitable in my other trading, if i get it it up to 10k i’ll dial it way back from there", "score": 2, "replies": []}]}]}]}, {"body": "youre so generous to donate that \"hard earned money\" to wallstreet directly!", "score": 3, "replies": []}]}, {"body": "Learned something new today.", "score": 1, "replies": []}]}, {"body": "Fellas, fellas, relax is not real money it’s CAD", "score": 13, "replies": [{"body": "I ain’t even gonna deny that", "score": 4, "replies": [{"body": "Just use the house money from here. you might make it to 10k or even 20k.  \n\nBut please take green when you get it. So many people be up 50% get greedy then watch it turn red.", "score": 2, "replies": [{"body": "I diamond handed Nadia to 625% today 0dte", "score": 2, "replies": []}]}]}, {"body": "Monopoly money", "score": 2, "replies": []}]}, {"body": "100k? Bro you have found a guaranteed way to become a billionaire. Please make sure to choose a color for your yacht that doesn’t fade", "score": 11, "replies": []}, {"body": "How do people just like know what to buy", "score": 38, "replies": [{"body": "They don't. He'll be broke in a week.", "score": 146, "replies": [{"body": "First one is free", "score": 20, "replies": [{"body": "Huh that's weird. The only free thing I got was crippling depression and an alcohol addictions.", "score": 7, "replies": []}]}]}, {"body": "We don't, and anyone who tells you otherwise is a clown.\n\nI turned $600 into $5500 over the last two days with SPY and AVGO calls.", "score": 20, "replies": []}, {"body": "They don’t. They just gamble and win.", "score": 11, "replies": []}, {"body": "Calls on NVDA and SPY? That’s like the most obvious play of the last 2 years", "score": 3, "replies": []}, {"body": "I agree with everyone here, you don’t know. It’s all just based on probability’s", "score": 6, "replies": [{"body": ">probability’s\n\n![img](emote|t5_2th52|4271)", "score": 30, "replies": []}]}]}, {"body": "If your playing 0dte your GOAL is zero dollars….good new you’ll achieve your goals", "score": 6, "replies": []}, {"body": "What were the options??", "score": 3, "replies": [{"body": "551 strike on spy that expired today  and 126 strike on NVDA that expired friday", "score": 12, "replies": []}]}, {"body": "Good luck", "score": 3, "replies": []}, {"body": "Hey it is someone doing the first one free thing.  U know that spike before the drop to zero.  Good luck regard", "score": 3, "replies": []}, {"body": "CAD ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "Good luck dude", "score": 2, "replies": []}, {"body": "Do it 20 more times and you’re a billionaire", "score": 2, "replies": []}, {"body": "Remember future-regard, first ones are ALWAYS free.", "score": 2, "replies": []}, {"body": "This won't end well.... here with the popcorn...", "score": 1, "replies": []}, {"body": "$1K to $100K buying only 0DTE's?... I see nothing wrong with this. 😏", "score": 1, "replies": []}, {"body": "Welp, let us know how it goes (spoiler, it doesn't end well)", "score": 1, "replies": []}, {"body": "What was your position for spy?", "score": 1, "replies": []}, {"body": "0DTE? You already on the right path", "score": 1, "replies": []}, {"body": "How many times have you started off at day one with $1,000 until this happened?", "score": 1, "replies": [{"body": "First account for options but blew a few accounts back when i was learning forex", "score": 1, "replies": [{"body": "I think you found your calling. Now leverage up!", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "if you want to gamble anyway, make it worth it bro, trade SPX , not SPY , almost the double gains you will get trading spx, and vise versa 😹", "score": 1, "replies": []}, {"body": "What apps are y'all using for the non Americans to leverage trade", "score": 1, "replies": []}, {"body": "Good luck! You can do it!", "score": 0, "replies": []}, {"body": "Pls teach me Sensei", "score": 0, "replies": [{"body": "Do you know what a handjob is", "score": 6, "replies": [{"body": "Plastic surgery for my forearm?", "score": 2, "replies": [{"body": "Back inside the dumpster with you", "score": 3, "replies": []}]}]}]}, {"body": "That's about where i'm at. started w/ 200 tho.  so half a step back.  only goes up digit by digit after that 1st comma", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}
