{"title": "Trump Tariffs Will Potentially Tank Markets", "selftext": "[removed]", "id": "1e89rt1", "created_utc": 1721521461.0, "score": 13, "upvote_ratio": 0.59, "num_comments": 79, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 2447 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/10sb80h/sqqq_analysis_potential_turnaround_on_222023/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Those corporate tax cuts aren’t going to pay for themselves.", "score": 15, "replies": [{"body": "And the billionaires are going to pay for it!…", "score": 3, "replies": []}]}, {"body": "I don't think he is going to do much of what he's spouting. He just wants the market to tank under Biden before the election.", "score": 9, "replies": [{"body": "He raised tariffs last time why wouldn’t he again?", "score": 7, "replies": [{"body": "The president can only impose tariffs for the purposes of national security - else,  it's congress' purview.\n\nThe 2028 tariffs/trade war was a disaster for US agriculture and,  I hope, congress/ Department of Commerce would intervene", "score": 5, "replies": [{"body": "Do you honestly think that either congress or the justices will do anything to stop anything? Have you not been watching?", "score": 6, "replies": []}, {"body": "So anything from Asia can be tariffed basically.", "score": 1, "replies": []}]}, {"body": "to pay for his corporate and rich tax cuts that will cost us 5 trillion dollars over 5 years", "score": 5, "replies": [{"body": "It was fun when they lowered the deposit requirement for banks a few months before Covid started too. Financial system could’ve collapsed if they implemented the rule any earlier, all cause he hired a guy that his son in law googled, to be secretary of the treasury.", "score": 1, "replies": []}, {"body": "That's why all fortune 500 companies are back the Democrats.", "score": 1, "replies": []}]}]}, {"body": "yep he just wants to buy your vote, he has stated that at the vegas and wisconsin rally. and he probably will fail to deliver.", "score": 1, "replies": [{"body": "Nobody commenting here will benefit from Trump imposing Tariffs in order to cut taxes and explode the National Debt to absurd levels. Why anyone on Reddit thinks Trump will benefit them or ANYONE they know is beyond comprehension", "score": 1, "replies": []}]}]}, {"body": "cooperative languid retire oil dime late hat chief fearless rain", "score": 8, "replies": [{"body": "Trump wants a minimum 10% tariff on all imported goods, as well as a 60% tariff on Chinese imports. These new tariffs will be on a completely different level.", "score": 1, "replies": [{"body": "For every 1 manufacturing job created in the USA at least 10 more jobs created. Also with trump we will have cheap oil produced in the USA. Economic boom.", "score": -5, "replies": [{"body": "The number of jobs created doesn't really matter. What matters is earnings. The biggest corporations make like half or more of their revenue from overseas. His tariffs would immediately result in retaliatory tariffs. I just don't see how this would benefit the stock market long term.\n\nThe US already has cheap oil under Biden (compared to other developed countries). The US is currently the largest oil producer in the world.", "score": 2, "replies": [{"body": "Why do you think small caps are on the rise betting on a trump win . More jobs created in the USA will benefit the middle class which has supported this country for the last 50 years. Last time trump was president economy was booming until covid hit.Dont know if you noticed but with bidens policies we are  heading into recession. That's why rate cuts are coming and economic collapse.", "score": 0, "replies": [{"body": "You are focused way more on the economy at large than the stock market specifically. The two are only weakly correlated.\n\nSmall caps are on the rise because rate cuts are more likely now, and small caps do better when interest rates are low. By the way, Trump actually wants to delay cutting interest rates until after the election because he doesn't want Biden to take credit for it. So if he had his way, we wouldn't be seeing this increase.\n\n\nAlso, small caps have only been doing well for like a week and for the last 3 days they've been declining too. Chill.\n\nWho's predicting a recession? Just look up 2025 GDP forecast. Nobody is expecting a recession.", "score": 1, "replies": [{"body": "Time will  tell the fed cutting rates and unemployment on the rise are not signs of economic prosperity.", "score": 1, "replies": []}, {"body": "serious question how come at the beginning of the year when they were pricing in five cuts small caps didn’t moon?", "score": 1, "replies": []}]}, {"body": "Stop making things up.\n\n1. Google current USA oil output and stfu\n2. Google number of US stock market highs 2024 and stfu.\n\n\"Crude oil production in the United States, including condensate, averaged 12.9 million barrels per day (b/d) in 2023, breaking the previous U.S. and global record of 12.3 million b/d, set in 2019. Average monthly U.S. crude oil production established a monthly record high in December 2023 at more than 13.3 million b/d.\"\n\n\"The S&P 500 has set 24 new all-time highs in 2024 after going two years without one, as US stocks have been on a $12 trillion rally since late October.\"\n\nJFC you people are clueless. Do you have any other theses or hypotheses based on just flat out ignorance and stupidity that I need to Google for you?\n\nYou know the INTERNET exists right!? Stop making shit up! You are literally in an \"investing\" sub talking about the market being shit!? Jfc ![img](emote|t5_2th52|4259)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}]}, {"body": "the US already is the largest oil producer in the world", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "When they start the name calling you know they are losing the debate. Check back in a couple months and we will see. What I'm saying is we are heading into a recession yeild curve uninviting, fed rate cuts, unemployment on the rise, China's economy collapsing, businesses in USA reporting weak earnings. These are bearish market indicators. There will be another run up but soon after the rate cuts start turmoil.", "score": 0, "replies": []}, {"body": "If you read my comment I said cheap oil .", "score": 0, "replies": [{"body": "\n\"Crude oil production in the United States, including condensate, averaged 12.9 million barrels per day (b/d) in 2023, breaking the previous U.S. and global record of 12.3 million b/d, set in 2019. Average monthly U.S. crude oil production established a monthly record high in December 2023 at more than 13.3 million b/d.\"\n\n\"The S&P 500 has set 24 new all-time highs in 2024 after going two years without one, as US stocks have been on a $12 trillion rally since late October.\"", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "\n\"Crude oil production in the United States, including condensate, averaged 12.9 million barrels per day (b/d) in 2023, breaking the previous U.S. and global record of 12.3 million b/d, set in 2019. Average monthly U.S. crude oil production established a monthly record high in December 2023 at more than 13.3 million b/d.\"\n\n\"The S&P 500 has set 24 new all-time highs in 2024 after going two years without one, as US stocks have been on a $12 trillion rally since late October.\"", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|18630)", "score": 1, "replies": []}, {"body": "Read my comment", "score": 0, "replies": []}, {"body": "Do you know what crude oil production is?", "score": 0, "replies": []}, {"body": "Do you understand supply and demand?", "score": 0, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "![img](avatar_exp|135220841|fire)", "score": 1, "replies": []}, {"body": "\"The S&P 500 has set 24 new all-time highs in 2024 after going two years without one, as US stocks have been on a $12 trillion rally since late October.\"", "score": 1, "replies": [{"body": "The money printing has been full on since covid and is continuing. You must be a kid The way you talk. Where do you think all those trillions are coming from.", "score": 1, "replies": [{"body": "Trump printed twice as much in less time. Try again", "score": 1, "replies": [{"body": "No one said trump did print more if read the sub others comments also said some of it was from covid. What I'm saying is all the money that is being printed is partially why markets have skyrocketed. There no convincing you so I digress.", "score": 1, "replies": [{"body": "Again, Trump added twice the DEBT in LESS time because he was not President the entire time Covid was an active threat. That ended January 2024! \n\nThe National emergency JUST ended in January 2024. \n\nDo the math! Nothing you said about this matches what you said. The markets hit NEW Highs AFTER the state of emergency ENDED. \n\nhttps://www.crfb.org/blogs/trump-and-biden-partisan-breakdown-new-debt\n\nTrump added DEBT and Biden added HALF as much as Trump! \n\nThe market rallied AFTER the national emergency ENDED. \n\nDo you Understand!?", "score": 1, "replies": []}, {"body": "24 new highs this year. \n\nState of emergency terminated Jan 2024. \n\nBiden President during pandemic LONGER than Trump and Biden added HALF the debt Trump did. \n\nWhat is confusing you here?", "score": 1, "replies": []}, {"body": "Explain your confusion: \n\n24 new market highs this year. \nGood? \n\nState of emergency terminated Jan 2024. \nGood still? \n\nBiden President during pandemic LONGER than Trump. \n\n2020-2021 (Trump) ONE year 8 Trillion \nvs \n2021-2024 (Biden) THREE years 4 Trillion \n\nTrump added EIGHT Trillion. \nBiden added FOUR trillion--HALF the debt Trump did. \n\nMarket MUCH better under Biden with HALF of the debt TRUMP created! \n\nWhat is confusing you here?", "score": 1, "replies": []}, {"body": "So you blame Trump for the debt? Do you know how words work? \n\nhttps://www.crfb.org/blogs/trump-and-biden-partisan-breakdown-new-debt", "score": 0, "replies": [{"body": "The sky is blue can't you see", "score": 1, "replies": [{"body": "Explain your confusion: \n\n24 new market highs this year. \nGood? \n\nState of emergency terminated Jan 2024. \nGood still? \n\nBiden President during pandemic LONGER than Trump. 2020-2021 (Trump) vs 2021-2024 (Biden) \n\nTrump added EIGHT Trillion. \nBiden added FOUR trillion--HALF the debt Trump did. \n\nWhat is confusing you here?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "What the fuck are you trying to say.", "score": 1, "replies": []}]}]}, {"body": "What. Trump tariffs and trade war with China tanked the market in 2nd half of 2018.", "score": 2, "replies": [{"body": "unique rock ripe crown compare public pathetic innocent frame zonked", "score": 2, "replies": []}, {"body": "OP was 12 then", "score": 0, "replies": []}]}, {"body": "Right!", "score": 0, "replies": []}]}, {"body": "Maybe for shitty companies overextended in China ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Can’t get much worse than with Bidenomics.", "score": 0, "replies": [{"body": "Completely not happy about government spending continuously increasing. the debt is another factor that we will have to come to face. Trump raised the debt 8 trillion and inflation started ramping up his last year in office. Biden on his way to adding 5 trillion.", "score": -1, "replies": [{"body": "Covid is partly to blame for the 8T. Remember, the CARES act alone was just under $2T, passed by Congress nearly unanimously. Then there were the stimulus checks. And then a bit more money for businesses that were forced to shut down", "score": 8, "replies": [{"body": "absolutely, 2T of the 6T was COVID related. and honestly it was too much. my wife got to sit at home and collect unemployment around $1200 a month for a 6 months when her actual weekly income as a part time employee was like $100 a week. I'd like to see some people start to embrace fiscal responsibility because our debt rating will get downgraded.", "score": 6, "replies": [{"body": "Feel free to send a few checks to the IRS.\nhttps://www.irs.gov/irm/part3/irm_03-008-045r", "score": 2, "replies": []}]}]}, {"body": "You blame the POTUS for corporations setting new records on their PROFITS above and beyond THEIR costs!? How? \n\nSeriously, corporations had 25% INCREASES in profit margins! Do you think they made that using \"market magic\"? \n\nThat IS inflation you fucking nugget\n\nHow stupid are you!?", "score": 5, "replies": [{"body": "It's usually the lest intelligent person  in the room that calls everyone else stupid to hide their own short comings.", "score": 1, "replies": [{"body": "Sure, but how am I incorrect?\n\nYou also intelligently misspelled \"least.\"\n\nThat's honestly impressive since phones and computers both have spell check. Maybe you are actually more intelligent than me. Because I am completely unsure how you accomplished that tbh.", "score": 1, "replies": []}]}]}, {"body": "President doesn’t control spending. That’s congress. The weaponization of the plandemic was bad for everyone, not just American taxpayers.", "score": 8, "replies": []}, {"body": "Because of covid shit loads of money spent on stimulus checks and shoring up the banks and other businesses.", "score": 1, "replies": [{"body": "Explain your confusion:\n\n24 new market highs this year. Good?\n\nState of emergency terminated Jan 2024. Good still?\n\nBiden President during pandemic LONGER than Trump.\n\n2020-2021 (Trump) ONE year 8 Trillion \n\n2021-2024 (Biden) THREE years 4 Trillion\n\nTrump added EIGHT Trillion. \n\nBiden added FOUR trillion--HALF the debt Trump added. Biden was president during Covid 3x longer and added 1/2 the debt Trump did. \n\nMarket MUCH better under Biden with HALF of the debt TRUMP created!\n\nWhat is confusing you here?", "score": 1, "replies": []}]}]}, {"body": "The market could...but bidens way will eventually have catastrophic results, trumps plan might magnify it which might be a good thing.  If the markets shit the bed for a bit, I will be OK, if they run somehow I will still be good.", "score": -6, "replies": [{"body": "The market is not the economy. Average taxpayers have gotten screwed under Biden even worse than under Obama/Bush policies", "score": -8, "replies": [{"body": "the average taxpayer will shoulder most of the burden of a flat 10% tariff which is the same as raising taxes on them $1500 annually. i pay about $15k in federal taxes annually so thats  a 10% increase.   i really liked being able to deduct mortgage interest on my taxes which TCJA took away. \n\nTCJA tax cuts would deliver an average $175,000 tax cut for the top 0.1 percent.   His cuts favor the wealthy primarily, look at 2020 - \n\nhttps://preview.redd.it/flhpdjq4qrdd1.png?width=1440&format=png&auto=webp&s=219b3cffaa7e78bd78f862517f2b87113ad18bbe\n\nSource: Institute on Taxation and Economic Policy (ITEP), “TCJA by the Numbers, 2020.” [https://itep.org/tcja-2020/](https://itep.org/tcja-2020/)", "score": 11, "replies": []}, {"body": "You're correct and still incredibly wrong. Do you remember the FED saying how long rates needed to stay higher than inflation to have ANY effect at all? \n\nYou do not SEE the effects of interest rates or changes that are made for 12-18 months. Do you know how I know? \n\nBecause the FED fucking explained that multiple times. \n\nAlso, if inflation is high and \"oh blah blah Biden!\" why were companies reporting PROFITS increasing by 25 fucking percent!? I didn't say prices increased by 25% I said *PROFITS* increased by 25%! \n\nWhy were RECORD profits made if THEY PAID more? Because *THEY* DID NOT PAY MORE, you did! \n\nYou were price gouged and blamed the President!? \n\nYou belong here, regard.", "score": 5, "replies": [{"body": "The FED is an abomination against the Constitution, tovarisch regard.", "score": 0, "replies": [{"body": "The FED is mentioned in the constitution as many times as F-16s, the internet, Space Force, McDonalds, Campbells Soup, Donald Trump, and AR-15s. \n\nAre those also abominations? \n\nEdit: Slavery is mentioned more times than the FED. Would you prefer that we have slaves instead of the Federal Reserve? Would that solve the ongoing abomination as you see it?\n\nGreat job flexing your big brain though.", "score": 0, "replies": []}]}]}, {"body": "For sure we have been screwed in those ways, for my household the policies surrounding healthcare brought to us through Obama, canceled by Trump and reinstated by Biden have been costing my household an extra 10k a year.  We are currently working with our local state government to ban how copay accumulators are distributed and applied to out if pocket maximums.", "score": -3, "replies": []}]}]}]}, {"body": "Trump will tank democracy.", "score": 0, "replies": [{"body": "Haha was going to say. End of democracy sounds worse than a tanked market and economy. Don’t get me wrong, both are bad, but the market would be the least of my worries if democracy is gone. ", "score": 7, "replies": []}, {"body": "Sir, this is a constitutional republic", "score": -1, "replies": [{"body": "Republic and democracy are not mutually exclusive?", "score": 2, "replies": []}, {"body": "Why can no one ever give an actual definition of that and how it differs to a democracy?", "score": 1, "replies": []}]}]}, {"body": "He'll be a lame duck from day one, they're probably gunning for hyperinflation", "score": 0, "replies": []}, {"body": "He needs to bring it down so he can easily lift it up after he get elected and stating that he saved the market lol Nice political strategy", "score": 0, "replies": []}, {"body": "Trump comments impacting markets negatively will stop until elections as that will start showing up impacting 401k and will likely kill his chances of becoming president", "score": 0, "replies": []}]}
{"title": "'Black Swan' investor warns the 'greatest bubble in human history' is about to pop and stocks could lose more than half their value", "selftext": "", "id": "1e8udqf", "created_utc": 1721590138.0, "score": 20, "upvote_ratio": 0.61, "num_comments": 71, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 10 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "we been hearing this for years.. and nothing has happened.. what makes this different?", "score": 84, "replies": [{"body": "This guy said it, like, today though.", "score": 31, "replies": [{"body": "they been saying this since 2018. buy a little over time, you wont have to worry about drops or not", "score": 3, "replies": []}]}, {"body": "said someone in 2007...", "score": 4, "replies": [{"body": "i mean by all means place puts", "score": 3, "replies": []}]}, {"body": "The difference is every year we are getting there closer", "score": 1, "replies": [{"body": "Stocks are also going up higher every year.", "score": 1, "replies": []}]}]}, {"body": "Just put my fries in the bag bro", "score": 80, "replies": [{"body": "And don’t forget to put $20 on pump 5", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|52627)", "score": 5, "replies": []}]}, {"body": "Bearish propaganda", "score": 65, "replies": [{"body": "Right. Positions or stfu", "score": 9, "replies": [{"body": "I always find it interesting that stuff like this isn’t considered market manipulation.", "score": 3, "replies": [{"body": "This or naked short selling, they can't find a regular way to get their money back", "score": 1, "replies": []}]}]}]}, {"body": "It might be the biggest stock bubble, but currency and bond bubbles are bigger.  What I find odd, few are talking about this and instead focusing on the stock market.", "score": 11, "replies": [{"body": "What do you mean with currency bubble?", "score": 1, "replies": []}]}, {"body": "If that’s true then I’ll just keep doing what I’ve always done. Buy a little every paycheck till I retire", "score": 24, "replies": [{"body": "Smart. Never go wrong", "score": 2, "replies": []}, {"body": "Best strategy for investing there is. Just ride the peaks and troughs. It always trends up over time", "score": 1, "replies": []}, {"body": "Do you buy index funds or stocks", "score": 1, "replies": []}]}, {"body": "Someone correct me if I'm wrong but didn't stocks lose up to 80% of their value in 1929? Wouldn't that have been the greatest bubble in history?", "score": 7, "replies": [{"body": "I was just going to post to that effect and there are multiple controls in place that will prevent the entire market from being overvalued.\n\nI would also say our housing bubble was pretty bad and not only did we recover from it, a lot of people made a lot of money in the process.  \n\nA lot of individual stocks are overvalued and you will see \"micro bursts\" of securities, however this is a sign of a healthy market.", "score": 2, "replies": []}]}, {"body": "He should write a book.", "score": 5, "replies": []}, {"body": "That's great Grandpa, it's time for your medication now.", "score": 6, "replies": []}, {"body": "Nicholas Nassim Taleb is a crazy dude", "score": 3, "replies": []}, {"body": "I wish I could bet on the fact that someone will always claim doom and gloom, because it happens every fucking month.\n\nIt’s like they’re taking turns until one hits the jackpot.", "score": 3, "replies": [{"body": "I wish I could bet on one single person in every comment thread on this website saying \"stonks go up\" because it happens every fucking day.\n\nIt's like they're all trying to keep manifesting the continued delusion that we aren't all fucked bigly.", "score": 1, "replies": []}]}, {"body": "I'm glad my entire portfolio is call options. 🥴", "score": 3, "replies": []}, {"body": "I wanna see his 10 year portfolio return.", "score": 3, "replies": []}, {"body": "If you actually read the article you would see that he said he thinks the market rally will continue on the run-up to rate cuts", "score": 5, "replies": [{"body": "I actually agree with this take.  Past performance isn’t indicative of future results but we cut rates due to bad economic data.  What are the chances the fed got it right this time?\n\nI’m half cash, half long on tsm / nvda.  Most likely we see a blow off top then movement down.  Long term up and to the right though", "score": 1, "replies": [{"body": "Really going out on a limb there with that “to the right” prediction", "score": 4, "replies": []}]}]}, {"body": "They’ll quadruple by then", "score": 2, "replies": []}, {"body": "Good. I would love to watch it happen while being too much a baby to buy in and then regret it later", "score": 2, "replies": []}, {"body": "L O L. How long is he been talking that nonsense? Hopefully not the whole way up.", "score": 1, "replies": []}, {"body": "In other news, my legs fell asleep while on the shitter reading this dribble", "score": 1, "replies": []}, {"body": "ATH on all stocks by EOY", "score": 1, "replies": []}, {"body": "So he thinks the rich wont enrich themselves? These guys are insane. Stock and Bond markets will literally be backed even if the entire US is 4th world.", "score": 1, "replies": []}, {"body": "And then they will go back up. So it has been written, so it shall be", "score": 1, "replies": []}, {"body": "Says the man who has everything invested fear", "score": 1, "replies": []}, {"body": "What year was this?", "score": 1, "replies": []}, {"body": "All the money we created has to go somewhere.", "score": 1, "replies": []}, {"body": "Well, NVDA and APPL will both be $1k by the end of the year then", "score": 1, "replies": []}, {"body": "This is like the 35th time I’ve heard this. Just this year.", "score": 1, "replies": []}, {"body": "**Priced In**", "score": 1, "replies": []}, {"body": "Is Nvidia this bubble?", "score": 1, "replies": []}, {"body": "With the horizon far enough ahead, this prediction is easy to make. Yes, the markets will definitely crash another time, but this guy doesn’t mention when…", "score": 1, "replies": []}, {"body": "If i had listened to All those morons who have claimed this the past years id have less money now than if the market looses 50% tomorrow.", "score": 1, "replies": []}, {"body": "\"Man who buys exclusively deep OTM puts says to panic sell\"", "score": 1, "replies": []}, {"body": "I’m ready to buy VOO 2020 style", "score": 1, "replies": []}, {"body": "In Germany we have economists that say this kind of stuff while working for gold companies. Can’t make this shit up.", "score": 1, "replies": []}, {"body": "“His hedge fund specializes in tail-risk hedging, a strategy that seeks to prevent losses from unforeseeable and unlikely economic catastrophes, also known as black swans”.  The dude is just selling his services.", "score": 1, "replies": []}, {"body": "Guys trust him, he’s predicted 78 of the last 3 bubbles", "score": 1, "replies": []}, {"body": "In a crash you only lose when you sell.   Unless you're doing options.   Then it can be very bad.", "score": 0, "replies": [{"body": "Yes but in 1929 you had to hold the bag for decades to keep from having a loss.", "score": 1, "replies": [{"body": "That type of slow regrowth can never happen again, barring a world War or something catastrophic that destroys companies.  \n\nYes.  It took 25 years. \n\nNow we are much more linked to internal trade and the rebound will be much quicker, taking years, not decades.  Also helping is electronic trading, a better understanding of panic selling, and better real-time communication instead of the old telephone/broker/floor trader method. \n\n1929 was also hampered by the dust bowl era, where agricultural shortfalls didnt pump the economy, poor understanding of the relationship between money factors, and  the fact that by virtue of being on the gold standard, a tanking dollar also tanked the value of gold.    Now that we arent, a drop in the dollar moves gold up.", "score": 1, "replies": []}]}]}, {"body": "I’m predicting the sun will come up tomorrow. Republicans will claim it’s because of Trump. Lol.", "score": -2, "replies": []}]}
