{"title": "5 criteria to spot the next Nvidia ! And How much 10,000 invested at its IPO is now worth ?", "selftext": "Hi everyone ! \n\nI am new to this community and i would like to share with my discoveries after having analyzed different winners like Nvidia , tesla, monster beverages , Microsoft, Elf Beauty or Cisco in the 90s . I have studied all these monster stocks and tried to see what do they have in common ! Catching one stock like Nvidia can change your life financially forever ! Nvidia stock appreciated at rate of 38,11% annually since 1999 and is one of the most successful stocks of all time .  I hope my post will be appreciated by everyone because I want to improve everyone's knowledges here. \n\nIt's a nice mix of fundamental and technical analysis! Like that i,t would not be pure luck to make it big at the stock market! \n\n\n\nFirst Criteria : Positive Revenue Growth (minimum 20% annual growth for the last 3 year)\n\n\n\nRevenue is the first and most important criteria because without revenue, no income . It's mean no business.Nvidia Revenue went from 150 million to almost 61 Billion in 2024 . That's a rise of 38500% or 27% annually since 1999 ! Other monster stocks like Tesla, Monster ,Microsoft or Cisco shared these kind of revenue growth when they were exploding ! It's logical because companies with fast revenue growth should expect future rapid stock growth ! \n\nhttps://preview.redd.it/8lgl99v2vkad1.png?width=622&format=png&auto=webp&s=681589668c8708dcd442f1758d9c5fdb00c99af7\n\n\n\nSecond Criteria : EPS Growth (minimum 20% growth the last 3 years)\n\n  \nA positive EPS growth is also important ! Earnings per share (EPS) is a measure of a company's profitability that indicates how much profit each outstanding share of common stock has earned. Without profits it will be harder for a company to invest in itself to improve itself from competition ! The majority of explosive stocks that I mentioned earlier got positive EPS growth . The only exception is Tesla that got its first positive EPS in 2020. Sometime a stock can rise with negative EPS because investors expects the company will one day be profitable !  It worked with Tesla and with some other. Sometime, you could hit the jackpot with this kind of stock, but it's preferable to invest in profitable stocks. \n\nHere are the data for Nvidia ! I don't have data before 2012, but you can see it was mainly positive from 2012 to 2024. NVidia EPS went from $0,26 in 2014 to 13,12 currently ! that a compound growth rate of 48% for the last 10 years . The EPS was multiply by 50 .  The stock went from $0,3 early in 2014 to $128 currently !  Not coincidence !\n\n\n\nhttps://preview.redd.it/7e74ublbzkad1.jpg?width=1362&format=pjpg&auto=webp&s=78151a21e5bce954cf58d5b9d703d7154c5c4095\n\n  \nThird Criteria : The rising expenses in Research and development (competitive advantage ) \n\nThis one is very underrated , but is very important . This expenses are strategically done to improve the company's products and to find a way to distinguish them from the competition ! This expense are also done to better understands their customers and to create better products for them . It's a MAJOR way to gain an ADVANTAGE  on the competition at IT'S ALSO A WAY TO DETERMINE HOW MANAGEMENT BELIEVE  IN THE COMPANY !  If the management believe in their company, they will invest in it . By doing this well, you can be a successful ! Nvidia  did this successfully with years ! Here are the chart ! The company multiplied its expenses by almost 8 since the last 10 year and the rest is history ! That's a annual rise of 23% in this section! The other companies I have mentioned share this too !\n\nhttps://preview.redd.it/g7tqclvi1lad1.jpg?width=728&format=pjpg&auto=webp&s=e35fc07944bce9a4af69848560b1bce568fc5a87\n\n\n\nNumber 4 : The management \n\nThere are no quantitative way to measure this one but is very important for the long term investor ! The CEO and the management need to be transparent , ambitious and competent in their field ! Mr.  Jensen Huang has proven he has all these qualities since he co founded the company in 1993 ! The only way for me to find a quick way to evaluate management is to see a positive growth in Research and Development to see if the management believe in the company !\n\n\n\nThe number 5 : 52 week high ( Momentum and technical analysis)\n\nThis one is very different from the 4 others because this one is the chart analysis but it's very easy ! We are looking for positive price momentum for a potential future rise . The 52 week high method has proven to be successful with time because many successful investors and traders use this since the dawn of time . 52 WEEK is a new high in the YEAR ! In theory, if a company make a new high in a year, it's a positive momentum sign. You can invest in the best company possible ,but if you do it at the wrong price or the wrong moment , you can lose your hard earned capital ! This is why price momentum come here and is unfortunately very underrated ! Here we go with some examples of a yearly chart of Nvidia! For example, let's say you did your homework by studying NVidia and saw a new high in 2013 of $0,4 . you buy and decide to ride the wave with time and add to the position when the stock makes new 52 week high.  You will be rewarded\n\n\n\nhttps://preview.redd.it/uay2auw94lad1.jpg?width=647&format=pjpg&auto=webp&s=6b4b5197e37f194c9435c668620349653631097b\n\nHere's the chart of the company from 1999 to today \n\n\n\nhttps://preview.redd.it/b3xhjmz75lad1.jpg?width=1026&format=pjpg&auto=webp&s=0d5ffa41b139e24c242ed696b11f41853f5c1855\n\nThe stock went from $0,4 to $128 today ! That's a rise of 32,000% in just ten year . It would have turned 10,000 into $3,2 million. The 52 week chart helps us to see the long term trend and to ride with it . Have you also added tot the position each time the stock makes a new high , you could have made money too ! The beauty of this method is there's no need to catch bottoms. You just ride with the trend ! You should also have a good stop loss to protect your capital if you're wrong . Some people have a stop loss of 10% of the share price. Other it's 5 or 6% . This one is up to you ! I will do a future post about my investment strategy ! \n\n  \nSome more examples of the 52 high strategy (Yearly chart)\n\n\n\nhttps://preview.redd.it/uctuj0lwflad1.jpg?width=1212&format=pjpg&auto=webp&s=05296b00daf111f43b7df85bfed577816e6b7b0a\n\n\n\nhttps://preview.redd.it/iv7zxztyflad1.jpg?width=1146&format=pjpg&auto=webp&s=bb6c00ba19af5561c084ca92ac6520a00d7a8278\n\nhttps://preview.redd.it/8v8n5xjzflad1.jpg?width=782&format=pjpg&auto=webp&s=6c3b3861d3862887619555ac425fb1887c1e28a0\n\nhttps://preview.redd.it/yxztrp6aglad1.jpg?width=782&format=pjpg&auto=webp&s=4c3dc231e26fc0c1bbe3a0aca9f60b80588ff083\n\nAll these monsters stocks surged like that too and the 52 week strategy applied to them could have make you wealthy. Like that, you could invest strategically in monsters stock thanks to a mix of technical and fundamental analysis. It will not be just pure luck to be successful at the stock market ! Sure it's not a 100% win  rate strategy ,but you can make it big with a good money management.\n\n\n\n  \nNow how much is the an original investment of $10,000 would be worth today ! \n\nhttps://preview.redd.it/yyqc97pc6lad1.jpg?width=1920&format=pjpg&auto=webp&s=bf62afc9541188bdae5dfd3e392cfe0e88d1b08b\n\n  \nIt's not a mistake . With adjusted prices and with stock splitting included , the stock has adjusted price at its IPO of $0,04 ! Today the stock is trading at $128 . 128/0.04 = 3200.  10,000\\* 3200 = $32 million \n\n\n\nYes you cannot go back in time and invest in it , but i shared with you some discoveries about future potential Nvidia that could change your financial life ! Thanks to the 52 week high strategy, you could have well surfed the trend of Nvidia with years and could have built a huge capital with time ! Don't forget that there's actually a future Nvidia in the making! You missed this opportunity, then another one will arrive.😊 It's life!\n\n  \nI hope that this post was positive and helpful to guide you to find the next NVidia !I have worked for hours to make it !\n\n  \nPlease be respectful ! If you have any questions ,I will answer to them  !", "id": "1dvlcvr", "created_utc": 1720139231.0, "score": 205, "upvote_ratio": 0.88, "num_comments": 96, "comments": [{"body": "TLDR. So what's the next NVDA?", "score": 97, "replies": [{"body": "The next NVDA is NVDA.", "score": 36, "replies": [{"body": "There's a lot of truth to that's dad became a multimillionaire from Nvidia several times over. I'm looking for my own Nvidia to give me the same success. Ironically, it just may be Nvidia. It won't return as much for me, but it doesn't have to, because I make twenty times what he did.", "score": 1, "replies": []}, {"body": "PLTR", "score": -9, "replies": [{"body": "SOFI", "score": -6, "replies": [{"body": "URMOM", "score": 16, "replies": []}]}]}]}, {"body": "Asking the only important question!", "score": 30, "replies": []}, {"body": "Avgo", "score": 4, "replies": []}, {"body": "Nvidia was the next Tesla\n\nTesla is the next Nvidia", "score": -12, "replies": []}, {"body": "NVIDIA puts...", "score": -8, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "Nice analysis. Would be great to have a stock scanner based on these criteria.", "score": 13, "replies": [{"body": "Thanks! You could do it on  stock rover or finviz . However you cannot put the management section on the screener because it's not quantifiable!", "score": 6, "replies": [{"body": "I do that part on my own. I only invest in a stock if I really like the CEO.", "score": 4, "replies": []}]}]}, {"body": "That's pretty much my dad's story. He didn't get in at the IPO, but shortly thereafter with a tad more than $10k. Today it's 100000 shares thanks to splits. Pretty good for a guy who retired with a modest pension who never made all that much, with 4 kids. He doesn't seem to worry as much these days, so it is life changing", "score": 8, "replies": [{"body": "Thanks for sharing your story! It's motivating! I am curious to know how much he's worth , if you don't mind?", "score": 3, "replies": [{"body": "Believe it or not, I didn't even know about the extent of the Nvidia holdings until the past few months. I knew he dabbled but didn't know it was that many shares. But 100k shares times $125ish is $12.5 million. That's the part of the portfolio I know about for sure, but the rest of it is made up of the Magnificent 7 minus Tesla, and my mom has indicated within the past couple of weeks that there is a significant amount of Broadcom.... all held for a long time. The inspiring part for me is that this apparently all\nTook place after retirement (again with a\nmodest pension and modest cash savings to invest). What it teaches me\nIs to never give up. I've been through some hard times and fell behind where I'm supposed to be, but savings x time at compounded interest is getting me\nBack in the saddle in a hurry. So when I heard what he had built, it inspired me to keep\nOn doing what I am doing. I'm told\nThat the majority of Warren Buffetts net worth came after the age of 65, so I'll always keep trying", "score": 7, "replies": [{"body": "Wow ! Wonderful! He is a canslim (William O Neil) student?  I am one of his disciples and use his methods! It's rare to hear success stories of this kind ! He is a hero and a goat ! The media always talks about the risk of the stock market,but rarely about success stories like him !", "score": 2, "replies": [{"body": "Actually, he was a momentum/growth person early on but soon realized it was difficult for him to find the ins and outs of the market.... and he hates being subject to the whims of fickle traders. His strategy is one of willful neglect. Invest in the companies that are changing the world, and try not to sell\nIf traders and short termers are bailing, because if you do, a couple of bad things happen... you pay taxes, and you also may miss out on the next big run up. It's more like  buy and hold for\nGrowth stocks rather than value stocks. This epiphany came to him when he got a windfall just before his first purchase of Nvidia, Microsoft and Apple in the late 1990's. He worked for three years at a small college in the early 1970's. About $4k was put away for him in a retirement fund. He literally forgot about it. They caught up with him 25 years later and asked what he wanted to\nDo with the funds. His jaw dropped when they told him it was $98k. The lightbulb by went off in his head. Invest in solid, profitable companies and let them grow in value over a long period of time. That how the Nvidia and mini Mag 7 purchases started. Buy, hold, and forget", "score": 5, "replies": [{"body": "Thanks! This biography is very incredible!  A true legend of investing!", "score": 2, "replies": []}, {"body": "This should almost be a sticky for investing in general. I hope that my son has a similar story some day!", "score": 1, "replies": [{"body": "Well here's something to teach him. If he maxes out his IRA, $500 a month, from young adulthood until retirement, he will have $4.5 million if invested in a S & P 500 fund making 10 percent a year. It's pre-tax, so contribute or pay it in taxes. I know that $500 a month may be difficult, but let's say you do $100 a month....that results in $900k, which makes for a comfortable retirement if SSI is added on top of that. It seems like magic, but it's just math. Plug the numbers into an investment calculator and that's what you get. Just contribute regularly in the greatest wealth creator\nIn history, live your life, and retire a\nMultimillionaire. It's inevitable and you don't even have to be great at picking stocks!", "score": 3, "replies": [{"body": "Spot on... i use a compounding calculator... but my financial literacy came late in life. The set it and forget it mentality is no joke assuming you have some runway.", "score": 2, "replies": [{"body": "Yeah, I'm a little late to it too, but plugging in numbers into a compounding calculator is eye opening... hard to believe the numbers  but it teaches me to never give up, because most wealth accumulates later in life, so if you are a little late to the game, you can still make big gains if you put away as much as you can. And even though we are on a subreddit about one of the best stocks of all time, the fact is you don't have to be a great stock picker to retire well. Money x time, compounded results in big gains", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Bruh NVDA got big only 2 years ago, it's not time to move on yet.", "score": 38, "replies": [{"body": "the company was always huge with billions of revenue bro..", "score": 12, "replies": [{"body": "Relatively", "score": 7, "replies": []}, {"body": "When revenue jumps that fast, it can also plummet that fast.", "score": 6, "replies": []}]}, {"body": "Not really. I put 100,000 in NVDA in 2020 at and it went up about 6X that within a year. \n\nThat was pretty big. I'll GLADLY take any company that can do that at this point.\n\nTSM is the most likely. I got in at \\~80 a share for again...\\~1000 shares. I think it's pretty reasonable to expect that to 3-4X with them making the majority of ALL chips and their expansion plans.", "score": 5, "replies": [{"body": "I bought a bunch of NVIDIA shares in 2018 and then sold because everyone on reddit was already saying it was WAYYY overpriced. It was a $300 million company back then. It was already huge and had increased exponentially in market cap. I thought I may have missed out. Wish I would have left it alone, I'd have like 300k in the stock today lol", "score": 2, "replies": []}]}, {"body": "I bought a bunch of NVIDIA shares in 2018 and then sold because everyone on reddit was already saying it was WAYYY overpriced. It was a $300 million company back then. It was already huge. Wish I would not have listened, I'd have like 300k in stock today lol", "score": 2, "replies": []}]}, {"body": "Hats off bud, that’s solid. I wish there was an easy way, I.e: a website that would give you a list of IPO’s and make it easy for us", "score": 7, "replies": [{"body": "stockanalysis.com lists all past and upcoming IPO's.", "score": 7, "replies": []}]}, {"body": "You forgot the most important one: the next company to hit the biggest will be the one that breaks every single one of those rules and more.", "score": 20, "replies": []}, {"body": "My first criteria is its boss has to have a leather jacket.", "score": 12, "replies": [{"body": "🤣🤣🤣", "score": 2, "replies": []}, {"body": "Criteria #2: have they signed a woman's chest", "score": 2, "replies": []}]}, {"body": "hey this is amazing thank you OP!!", "score": 12, "replies": [{"body": "Thanks! I worked so hard to write it ! I just wanted to share for free my knowledge ! Many would have charged $1000 for it !", "score": 17, "replies": [{"body": "I'm going to turn your criteria into a formula and then generate a web application so that we can plug in other stock tickers and see if it fits your analysis. I need to get an API first though. Thanks for the analysis.", "score": 14, "replies": [{"body": "I’m following you for this 😄", "score": 8, "replies": [{"body": "I'd do the same, but do not see a follow option.", "score": 1, "replies": []}]}]}, {"body": "Now if there was a way to take your findings and criteria and turn it into an equation. Or formula then we can use it.", "score": 7, "replies": [{"body": "You can also look at your industry preference and find companies that have traded over 3 years since ipo.  Then you would find ones that fit the criteria and find which match the criteria. 😉", "score": 3, "replies": [{"body": "QBTS is one of my bets. But it's a loong way from paying off. \n\nBut after what NVDA did, I'm not looking for 4-5-6X profits from one stock. I'm looking for good, solid growth. \n\nBuying NVDA in 2020(not because I knew shit about it, because my friend at MS did)...I'm still on what was my investment strategy. Look for the large growth when interest rates are high.\n\nTSM#2 holding.  \nAMZN #3  \nGOOGL #4  \nMSFT #5\n\nthen a few fliers and AVGO...but picked that up only recently and as more of a short-term play. \n\nTSLA would be in that group, but...I got out too early. Not enough faith in the direction. My bad. \n\nBut after the growth of NVDA, I just want steady 10-20% growth and I think these companies will provide it with actually more upside. I'd include AAPL, but I'd have to sell something. \n\nI took what I had still on the sidelines and bought 400 more shares in MSFT and 1000 more in AMZN a few months back.", "score": 3, "replies": [{"body": "You might have another shot at a Musk play if SpaceX ever goes public and makes some profits as they figure out what to do in space for mining resources and things\n\nAre you concerned about issues with China taking over or trying to take over Taiwan and how that affects #2 on your list? Ty", "score": 1, "replies": [{"body": "No, I'm not. 3 fabs in AZ, 2 in Japan, 3 in Germany.", "score": 2, "replies": [{"body": "Okay, I will look into this then. Thank you for the lead", "score": 1, "replies": []}]}, {"body": "\\*I'll also never invest in another Musk company again. The guy is an absolute clown.", "score": 2, "replies": [{"body": "Totally get that :)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Amazing knowledge, thanks a lot", "score": 4, "replies": []}]}]}, {"body": "Was the moon landing real?", "score": 8, "replies": [{"body": "You think the moons real bro?", "score": 5, "replies": [{"body": "Not when I was an Atheist, but now I’m full on believer.", "score": 3, "replies": []}]}]}, {"body": "You know its a bubble when regular people think they have cracked the code on how to make money", "score": 4, "replies": [{"body": "Lmao fr", "score": 1, "replies": []}]}, {"body": "$PLTR? Lol", "score": 3, "replies": []}, {"body": "Forgot the whole bit about being a decade ahead of the market for 20ish years until it was suddenly noticed, but that's not important right now.", "score": 3, "replies": []}, {"body": "If you follow IBD & the CANSLIM method you would already know all of this & more.  Many new investors are not aware of all the great resources available.", "score": 3, "replies": []}, {"body": "You will failed to spot the next big data things.", "score": 3, "replies": []}, {"body": "An obvious one is Palantir based on how much their revenues seem to be growing and interest in the stock.\n\nI would also look at Soundhound AI, Crowdstrike (which has grown already but will continue to), and then Photronics", "score": 3, "replies": []}, {"body": "So what’s the next Nvidia today?", "score": 3, "replies": []}, {"body": "Thanks for your detailed insights. I have found two that is definitely better than NVIDIA: NVDX and NVDL.", "score": 6, "replies": [{"body": "When NVDA is bleeding🩸, these are hard to hold. I rather hold the underlying stock.", "score": 7, "replies": []}, {"body": "Don't forget NVDY. It's nice to get paid for putting up with its volatility", "score": 5, "replies": []}]}, {"body": "And you did this for free, great job man, really", "score": 5, "replies": []}, {"body": "So you’ve basically written a book on what someone else could have told you in a couple sentences", "score": 9, "replies": [{"body": "Yep. Quite of a few of these verbose and yet vacuous “hot” takes floatin around that do little else except flex OPs command of graphs and language.\n\nReminds me of my own posts 🤔", "score": 6, "replies": []}]}, {"body": "I have a question, folks and OP, why use EPS growth and not just earnings growth? Does it make a difference when the number is relative anyway?", "score": 2, "replies": [{"body": "Generally, it's equal ! Both work!", "score": 3, "replies": [{"body": "Good to know, thank you!", "score": 2, "replies": []}]}]}, {"body": "But you won’t.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yes , it's true !", "score": 2, "replies": []}]}, {"body": "Hindsight is always 20/20. \n\nHow could you have seen positive revenue growth for two decades at the time of IPO?\n\nWhat indicators were available at 1999 to make you want to keep your investment of 10k for over 20 years. \n\nHow could you forsee the AI boom of 2020-2024 back in 1999. \n\nThis retrospective analysis is great but it's always hard to see long-term potential with companies at IPO.", "score": 2, "replies": []}, {"body": "great hindsight post.  useless for what's next.  alls i knows is ...OPENAI will be the fastest to 1T MC of any company in history. Get into that mofo on day 1 of IPO, yes it will be very very overpriced. Hang on and see a couple of multiples in a few years.\n\nNot since GOOG has there been as much hype over a tech stock", "score": 3, "replies": [{"body": "lol investing all your money in an LLM expecting it to produce AI 😂", "score": 0, "replies": []}]}, {"body": "I'm not reading all that.\n\nThere is no \"next NVDA\", which is why it's such an awesome play. Being aware of living through history while living through history is one of life's richest gifts. Enjoy it.", "score": 2, "replies": []}, {"body": "!remindme 1 day", "score": 1, "replies": [{"body": "I will be messaging you in 1 day on [**2024-07-07 05:18:14 UTC**](http://www.wolframalpha.com/input/?i=2024-07-07%2005:18:14%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/NVDA_Stock/comments/1dvlcvr/5_criteria_to_spot_the_next_nvidia_and_how_much/lburo87/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FNVDA_Stock%2Fcomments%2F1dvlcvr%2F5_criteria_to_spot_the_next_nvidia_and_how_much%2Flburo87%2F%5D%0A%0ARemindMe%21%202024-07-07%2005%3A18%3A14%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dvlcvr)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}]}
{"title": "Buy more NVDA or go for AVGO before split? I’m a REGARD. TIA for input.", "selftext": "", "id": "1dvpaig", "created_utc": 1720152953.0, "score": 38, "upvote_ratio": 0.8, "num_comments": 81, "comments": [{"body": "AVGO before split >>>", "score": 28, "replies": [{"body": "This is the way.", "score": 5, "replies": []}, {"body": "This", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[You can get with this, or you can get with that.](https://youtu.be/wCDIYvFmgW8?si=lcGqRab5sv5ShmE4)", "score": 3, "replies": [{"body": "I think I’ll go with this; cause this is where it’s at…", "score": 2, "replies": []}]}]}]}, {"body": "This", "score": 0, "replies": []}]}, {"body": "Both", "score": 13, "replies": [{"body": "I’ve been loading up on NVDA for a months. Can’t help but see it as a long term winner but I want a piece of AVGO and Pelosi bought calls that seem to value it at 8x the current value.", "score": 8, "replies": [{"body": "Exactly. Do both. Treat your self.", "score": 9, "replies": [{"body": "You son of birch….im in.", "score": 4, "replies": []}]}, {"body": "No she didn't.\n\nThe calls are deep ITM.  Like... deeeeeeep in the money.  \n\nShe's just leveraged to the tits, that's all.", "score": 4, "replies": [{"body": "Wish I had those kind of tits…", "score": 3, "replies": []}]}, {"body": "Nah it's a deep itm call. Check it out. $800 pre split means $80 post split. With the stock going to $170.", "score": 5, "replies": [{"body": "How does she turn a profit on that with such a wide delta? Super novice to stock trading. Just buying shit like LLY, Tesla, Amazon, Costco, and NVDA since December of 2023 because wtf not…I use most of that shit as a consumer and don’t see them as high risk given their profits and the fact that they’re household names.", "score": 3, "replies": []}]}, {"body": "What calls did she buy? What strike and expiration?", "score": 2, "replies": [{"body": "“On June 24, she sold off 2,500 shares of Tesla (NASDAQ:TSLA) while buying 20 Broadcom (NASDAQ:AVGO) call options with a strike price of $800 and an expiration date of June 20, 2025.”\n\nTits up. Deep ITM calls on AVGO.", "score": 1, "replies": []}]}, {"body": "What’s the thesis for pelosi valuing it at 8x current value just because she bought an ITM call?", "score": 2, "replies": [{"body": "Bro, I’m such a novice at this. I was legit asking for edification because I’ve seen some folks discuss it. Good purchase for me or bad? If she’s bullish on it, why wouldn’t my simple ass be? She clearly has better intel.", "score": 1, "replies": [{"body": "She also lost 20% a couple years ago.... buying just because she does is dumb at best", "score": 1, "replies": [{"body": "And at worst?", "score": 2, "replies": [{"body": "Worse, duh", "score": 0, "replies": []}]}, {"body": "Nancy hasn't beaten the market long term and actually trends below. She's had a few good post covid years with her trades because she went heavy into tech, which isn't even her whole portfolio. You can pick Buffet's 5 biggest tech trades and they probably blow her percentages out of the water.", "score": 3, "replies": [{"body": "Maybe just go SMH and play it balanced. 🫤", "score": 1, "replies": []}]}]}]}]}, {"body": "I beg your biggest pardon?! 8x it's value???!!!😍\n\nIs that before or after the split? (Ie 8x the split price or pre-split)?", "score": 1, "replies": []}]}]}, {"body": "Or get some of that TSM", "score": 11, "replies": [{"body": "Goat stock", "score": 3, "replies": []}]}, {"body": "AVGO", "score": 6, "replies": [{"body": "Is AVGO going even higher?\n\nI ve been burned by buying at ATHs...", "score": 3, "replies": [{"body": "I believe so", "score": 2, "replies": []}, {"body": "IMO it’s dropping more before the split and probably some after as it seems most splits do. Maybe this one won’t but I’m holding out.", "score": 2, "replies": []}, {"body": "Honestly, the whole market is due for a nasty 20%+ correction. That said, it may rise 20% before we get it, or it may happen on Monday. No one knows.", "score": 1, "replies": []}]}]}, {"body": "Check wsb", "score": 3, "replies": []}, {"body": "Buy AVGO in February. This strategy worked for me so it should for you too", "score": 3, "replies": [{"body": "Why because it’s cheaper than current price?    I bought nvidia 10 days before split and I made 18% which still holds post split.  Sometimes is better to buy some pre split.   I have a few AVGO also", "score": 3, "replies": []}]}, {"body": "id do avgo. nvdas great but it wont just continue to spike. its market cap would be like 20 trillion or something", "score": 5, "replies": [{"body": "If Nvidia hits 20 trillion market cap I'll be a multi-multi-millionaire.", "score": 8, "replies": []}, {"body": "Yeah, it’s been flying higher than Hunter Biden. Seems like a winner so far.", "score": 9, "replies": [{"body": "im gonna buy small increments to start, it seems to me even great companies tend to underperform post split", "score": 2, "replies": [{"body": "That’s how I’ve been going with NVDA. Now I’m in LLY because people are addicted to a drug that makes them lose weight. They can’t just stop taking that. Seems like a good business model. Like a drug dealer just corporate.", "score": 3, "replies": [{"body": "They also have other drugs in the pipeline seeing similar if not better results. They are my next big buy. Not financial advice.", "score": 1, "replies": []}, {"body": "If you’re talking about ozempic, that’s novo nordisk (NVO) not Eli Lilly (LLY).", "score": 0, "replies": [{"body": "I have both. I’d like to inject myself with both. GLP-1’s are a miracle drug.", "score": 1, "replies": [{"body": "I'm on mounjaro (lilly), fixed my blood sugar, fixed my liver (had NAFL for years), even my cholesterol is in the green.  Plus, I'm not addicted to food anymore, and I've lost about 70 lbs.", "score": 6, "replies": [{"body": "God bless, brotha. Seems like a miracle drug. I don’t see any backsliding with that stock given the breakthrough they’ve had. Clearly going to R&D (e.g., Alzheimer’s DRUG FDA recently approved).", "score": 3, "replies": []}, {"body": "Hwoo-Haaa...", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Trumpets love to weasel politics into every conversation they have.", "score": 2, "replies": [{"body": "I’m not a trumpet. I think they all stink like shit and have personal agenda, which is placed before the interests of their constituents. Anyone who worships a politician is psychologically maladapted and unable to think for themselves. I just put that in there because she’s [Pelosi] a politician and it seemed fitting.", "score": 3, "replies": [{"body": "While this is true, I don’t like the “both sides are the same” rhetoric. One is a corrupt, bureaucratic, geriatric cadre of self-important selfish narcissists. \n\nThe other side wants to “neutralize” people they don’t like.", "score": 3, "replies": [{"body": "So identical clones?", "score": 1, "replies": []}, {"body": "Both sides are the same , you just have a blind spot to the side you politically align yourself with .", "score": 0, "replies": [{"body": "The “both sides” argument died when ONE side became the cult of a con man and attempted a coup", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "$SMH", "score": 2, "replies": [{"body": "👀👀👀", "score": 2, "replies": []}]}, {"body": "Do we know how the splits gonna work is it like the 10-1 split nvidia did", "score": 2, "replies": [{"body": "It’s gonna be 10-1", "score": 2, "replies": []}]}, {"body": "AVGO calls are too expensive right now anyway. I do have some calls for NVDA for the end of this month. But once the split for AVGO goes through, I'm going to get some in the money calls all the way past the earnings. \n\nSome people have been commenting AVGO will drop a bit before the split, and that is definitely very possible. I do wonder if it's because people sell their calls, wait for the split to happen and then reposition accordingly. Either way, can't go wrong if you're planning to do calls long term with these two.", "score": 2, "replies": []}, {"body": "I have calls for both", "score": 2, "replies": []}, {"body": "AVGO puts", "score": 2, "replies": [{"body": "Genuine question, why puts? It's bound to spike for a while after the split, no?", "score": 2, "replies": []}]}, {"body": "It goes nvidia, Tsm then avgo why pick 3rd best?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I would hold off it’s going to drop price on the split for a little after imo", "score": 1, "replies": [{"body": "Why? Explain like I’m 5 years old please.", "score": 1, "replies": [{"body": "I can only tell you what I’ve seen and that is splits seem to make stocks drop price before and a little after the split. Just what I’ve seen but not an expert trader by any means", "score": 2, "replies": [{"body": "Sweet. I was gonna go in of CMG and it didn’t bounce like that. I’m super green at this shit.", "score": 1, "replies": [{"body": "It’s a lot of learning and hard to keep track unless you do this for a living.", "score": 2, "replies": []}]}]}]}]}, {"body": "I should’ve taken that advice 6 hours ago. AMD jumped 10 points today", "score": 1, "replies": []}, {"body": "Why would you spend on AVGO when you could have multiple shares of NVDA and TSM?", "score": 1, "replies": []}, {"body": "NVDA, AVGO, ASML & TSM : THE AVANGERS", "score": 1, "replies": []}, {"body": "Broadcom is going to get a kick with the new iPhone soon released !", "score": 1, "replies": []}, {"body": "Or buy AMD", "score": -2, "replies": [{"body": "Not right now", "score": 3, "replies": [{"body": "Could you give a reason why? I was gonna buy AMD ..", "score": 1, "replies": [{"body": "IMHO it’s too expensive rn", "score": 1, "replies": []}, {"body": "Spike 5% today", "score": 1, "replies": []}, {"body": "It’s peaking now. Wait for a dip", "score": 1, "replies": [{"body": "I honestly feel like everything is peaking right now", "score": 1, "replies": [{"body": "AMD's peak was around 220$ bruh. AMD is having a huge dip rn. Most Wall Street analysts analyze AMD's stock should be around $180 to mirror its true value.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "AVGO is the way", "score": 0, "replies": []}, {"body": "Nvda is done. Overvalued", "score": 0, "replies": []}]}
{"title": "These are the stocks on my watchlist (7/5) ", "selftext": "These are the stocks on my watchlist (7/5)\n\nHi! I am an ex-prop trader who trades equities.\n\nThis is a daily watchlist for trading.\n\nI might trade all the stocks on here, or none of them, on any given day. I might trade stocks that do not appear on here! I hold no positions in any stocks long-term but Amazon/Mag7/general broad market indices. (unless otherwise noted in these tickers). If you are on old reddit, click “show images” at the top to see all the charts quickly.\n\nI usually make these watchlists premarket, but can be delayed if I am trading the open. These are not mean to be taken as gospel or any recommendation to buy/sell.\n\nMany stocks I post are <$500M market cap. These are potentially good candidates to day trade; I have no opinion on them as investments. PLEASE ask specific ones. Questions like “Thoughts on _____?” will be ignored unless you add detail to the question. “Is ___ a good investment?” will be ignored. I will block you if you are a troll.\n\nNews: [Payroll Revisions Point to Cooling US Labor Market](https://www.bloomberg.com/news/articles/2024-07-05/payroll-revisions-point-to-cooling-us-labor-market)\n\n**[TSLA](https://www.tradingview.com/chart/?symbol=TSLA)-** Released Q2 TSLA delivery numbers on Tuesday. We broke the 250 level. Going to stay hands off in this for now (got burned trying to short too early), but if we get overextended then I’ll look into a short.\n\n**[MDWD](https://www.tradingview.com/chart/?symbol=MDWD)-** Up on a supposed $34 takeover offer.\n\n**[M](https://www.tradingview.com/chart/?symbol=M)-** Buyout offer for M for $6.9B. (Current bid is roughly $24.80)\n\n**[MARA](https://www.tradingview.com/chart/?symbol=MARA)/[RIOT](https://www.tradingview.com/chart/?symbol=RIOT)/[COIN](https://www.tradingview.com/chart/?symbol=COIN)/[HOOD](https://www.tradingview.com/chart/?symbol=HOOD)/[BITO](https://www.tradingview.com/chart/?symbol=BITO)-** We saw BTC and the entire CC market tank due to Mt. Gox payout fears, because it releases more supply into the market. (Roughly 1 Million BTC was lost during the hack)\n\n**[AMZN](https://www.tradingview.com/chart/?symbol=AMZN)-** And again, watching AMZN for any potential upswings.\n", "id": "1dvxwo2", "created_utc": 1720185818.0, "score": 125, "upvote_ratio": 0.81, "num_comments": 83, "comments": [{"body": "Waiting for HIMS to pop again after earnings 8/5", "score": 26, "replies": [{"body": "🤞", "score": 4, "replies": []}, {"body": "I think I'm going to have to buy calls now since their earnings is on my birthday. I was hoping to get in around $19.50 but I don't think that's going to be possible anymore.", "score": 4, "replies": [{"body": "I’d get in asap, they were already doing great with their ED meds and hair loss and they announced their selling semaglutide cheaper than Noro and Lily nfa", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 3, "replies": [{"body": "🙏🏻", "score": 1, "replies": []}, {"body": "Now I’m wondering if I should just cash out or only sell to cover my initial investment and keep watching it rise", "score": 1, "replies": []}]}, {"body": "Fingers crossed!!  I'm long", "score": 2, "replies": []}]}, {"body": "Bought ASTS around the end of may because of your recommendation, already up a good amount! Thank you!", "score": 6, "replies": [{"body": "These are NOT recommendations to buy or sell, just a watchlist for what stocks I'm interested in potentially trading for the day!!! Please don't interpret them as such!!!! But congrats on the gain!", "score": 13, "replies": [{"body": "I am aware, made sure to dig a bit before I bought. Thanks for the daily help!", "score": 6, "replies": [{"body": "Whew, that's very good to know lol. No problem, glad you got value from the watchlist!! :)", "score": 6, "replies": []}]}, {"body": "😂  ♥", "score": 2, "replies": []}]}]}, {"body": "Love to see the # of upvotes and replies growing daily", "score": 12, "replies": [{"body": "I do too, it encourages me to keep posting !!! :)", "score": 12, "replies": [{"body": "Keep it up ![gif](emote|free_emotes_pack|joy)", "score": 2, "replies": []}]}]}, {"body": "Do you have a position in AMZN or why are you always watching?", "score": 9, "replies": [{"body": "Yup, it's a longer term investment though- I usually just sell calls against my position but I thought this upswing was notable since we've never seen it go to $200 before (ATH).", "score": 16, "replies": []}]}, {"body": "OP what is your performance? Are you actually beating the market?", "score": 5, "replies": [{"body": "Yep, beating the market in my long-term portfolio.\n\nBut \"beating the market\" doesn't mean much in trading, it's more about the raw PnL. (my short term trading account isn't that impressive tbh, I don't trade too seriously anymore.)", "score": 3, "replies": [{"body": "Okay cool, I've seen a few of your threads, just curious whether you are really worth following and how legit you are.", "score": 5, "replies": []}]}]}, {"body": "I sold TSLA and will continue to hold AMZN for a long time more.  I don't really think electric vehicles are catching on as much as the media hypes it.  If I were to buy a e-car, it would probably be a Toyota.  TM has a pretty good divdend yield.  I don't believe in investing much in trains, planes or autos.  Tho I own boy UNP and CNI.  Both have been pretty good over the years.  Curious about the recent LLY.", "score": 6, "replies": [{"body": "I’m also long on AMZN. Lots of upside potential still.", "score": 1, "replies": []}]}, {"body": "my watch list is simply VTI", "score": 12, "replies": [{"body": "Thank you AngooriBhabhi, very cool!", "score": 25, "replies": []}, {"body": "Then why are you even on this sub?", "score": 1, "replies": [{"body": "to let people know index investing is best instead of hand picking stock", "score": 0, "replies": [{"body": "It would be a REALLY boring sub if everyone just bought VTI lol.", "score": 8, "replies": [{"body": "boring is good in finance", "score": 4, "replies": [{"body": "Boring isn't good in reddit :) have a great day!", "score": 5, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "u dont get it", "score": -1, "replies": []}]}]}]}]}, {"body": "I've been waiting for an exit point on TSLA and now I'm almost considering holding it as well", "score": 4, "replies": [{"body": "I literally sold right BEFORE that 16% rally goddamn XD", "score": 6, "replies": [{"body": "Atleast you are free from this lol. I hope you made some money! I would periodically DCA when I felt that the price was ignorantly low. I last picked some up at 164. I'm up above 20% currently and will probably let the green days go and sell when this momentum fizzles", "score": 5, "replies": []}]}]}, {"body": "Thoughts on SHOP? Good last quarter, stated poor guidance for future because of the economy", "score": 4, "replies": []}, {"body": "Appreciated", "score": 4, "replies": [{"body": "I appreciate YOU", "score": 3, "replies": [{"body": "YOU calls, got it.", "score": 3, "replies": []}]}]}, {"body": "I hope Tesla goes back down, I was hoping to buy some when it dipped to 147 in April. I guess I learned my lesson.", "score": 2, "replies": []}, {"body": "Why not MSFT?", "score": 2, "replies": []}, {"body": "$HE Hurricane Electric keeps going down due to fires or something with the power grid in Hawaii. I'm not buying just watching at the moment.", "score": 2, "replies": [{"body": "Jesus it's been a while since I looked at this, thank you for the headsup!", "score": 0, "replies": [{"body": "It still is a don't buy though. I'm not trying to pump the stock in any way. But in a week or 3 months it very well may be likely reverseal. Cheers", "score": 3, "replies": []}]}]}, {"body": "Do you think TSLA will dip before the Aug 8 event?", "score": 2, "replies": [{"body": "If I could see the future I'd be a QUADRILLIONAIRE and RIDING JETSKIS on my PRIVATE ISLAND", "score": 18, "replies": [{"body": "Lmaoooo", "score": 2, "replies": []}]}]}, {"body": "What’s the bullish case for Apple at this point? Aren’t valuations starting to ring some alarm bells for some of you?", "score": 4, "replies": [{"body": "I don't have AAPL on my watchlist so IDK man lol", "score": 7, "replies": []}, {"body": "Yea man I'm in the same boat. I usually trade Apple but I've been staying away recently. Missed out on a lot of gains, though.", "score": 2, "replies": []}, {"body": "AAPL is a hard bubble at this point; the stock's still up solely on the basis of \"Their AI is amazing and it hardly hallucinates at all,\" with potential investors I guess betting that AAPL will win the AI wars.\n\nI dunno man, I got out at $215. $225 is just crazy. I don't see anything supporting it.", "score": 1, "replies": [{"body": "they are gonna raise prices for their new iphone models, also Iphone sales have been dropping and people think this AI poop will make sales good again which i agree with hence im bull for the next 2 years", "score": 4, "replies": [{"body": "If demand is dropping, raising prices is -not- how you get more sales. That's actually the opposite of how you get more sales.  It might improve profit per unit, though, which is almost as good.\n\nThe AI is going to have to do something more interesting than, \"Hey Siri play me a song,\" or, \"Hey Siri how do I make soup for dinner?\" And so far I haven't seen any interesting new use cases.", "score": 3, "replies": [{"body": "My thesis is that they have finally changed the camera layout (design change to help identify which phone is the new model) and also the past few years people hadnt really been upgrading their iphones because nothing changed so now they probably will. Apple is a cult you buy a product? You keep buying forever,I myself am a iphone 13 user and I want to upgrade. It doesn't matter if it doesnt sound smart, people WILL upgrade at some point anyways so ai is just something that will give them the extra push needed to make the decision, after iphone 16 sales will likely go up for at least 2 years! Lastly you have to consider that in the future AI can become some type of subscription further tying you into the apple ecosystem, services have seen considerable growth lately and now account for 1/4 of apple's revenue if I'm not wrong", "score": 2, "replies": []}]}]}]}]}, {"body": "Thank you again for posting this!", "score": 1, "replies": [{"body": "Happy to be back! Hope you had a great 4th of July!", "score": 6, "replies": []}]}, {"body": "odds the macys offer will go through? thinking of buying.", "score": 1, "replies": [{"body": "I don't know, I generally stay away from merger-arb trades", "score": 3, "replies": []}]}, {"body": "Dang so BTC can be \"hacked\"?", "score": 1, "replies": [{"body": "No, but the exchanges holding them can be", "score": 2, "replies": []}]}, {"body": "Good ones to look into and dig deeper.  I just have a gut feeling that TSLA is going to go higher and higher.  Thanks!", "score": 1, "replies": [{"body": "I suggest you read the latest one! This one is from 4 days ago.", "score": 1, "replies": []}]}, {"body": "I searched wulf and was brought here but no mention of it. You have other miner stocks on there, why not Wulf? Especially with the news yesterday", "score": 1, "replies": [{"body": "This watchlist is from 16 days ago dude...", "score": 1, "replies": [{"body": "Im looking for sentiment of this stock through Reddit, thought you had mentioned it? It’s been doing well and 16 days isn’t that long, I’m looking medium term, not to day trade. Would it not make your watchlist at this point?", "score": 1, "replies": [{"body": "That's Google Search's problem, not me.\n\nIDK why people ask \"why is this not on your watchlist?\". It's because I'm not watching it lol. There's no ulterior motive for it. \n\n>This is a daily watchlist for trading.", "score": 1, "replies": []}]}]}]}, {"body": "Thoughts on BITF? They announced expansion to the us, are going to announce a new ceo, and have increased their hashrate", "score": 1, "replies": [{"body": "Coinbase would have made more money if they simply bought Bitcoin instead of starting Coinbase- ultimately I think the best EV of investing in the CC space is to just invest in BTC.", "score": 1, "replies": []}]}, {"body": "Hi! Im new to trading here and i just bought nvda but the stocks are going down right now. Do u think it is going to keep flopping or should I keep holding onto my share?", "score": 1, "replies": [{"body": "For the long term, I'd probably hold it! \n\n  \nEDIT: But I don't know your financial situation, so take that with a grain of salt.", "score": 3, "replies": [{"body": "would you recommend keep buying more shares if it were to drop?", "score": 1, "replies": [{"body": "I have no idea since I don't know your financial situation, sorry!", "score": 2, "replies": []}]}]}]}, {"body": "You should look into MSTR regarding BTC.", "score": 1, "replies": []}, {"body": "I’m here for the next NVDA. Who are they?", "score": 0, "replies": []}]}
{"title": "Imagine thinking TSLA is a good investment", "selftext": "", "id": "1dwbwv0", "created_utc": 1720222794.0, "score": 124, "upvote_ratio": 0.88, "num_comments": 96, "comments": [{"body": "Well it’s not above $260 EOW. Is that guy still fucked?", "score": 55, "replies": [{"body": "Probably. Likely lost 120k instead of 160k lmao", "score": 48, "replies": [{"body": "Yup, premium chasing with spreads is risky", "score": 17, "replies": [{"body": "Call me Princess 👸💗", "score": 6, "replies": [{"body": "Just be careful before you become a lion king meme too😭🥺", "score": 7, "replies": [{"body": "I lost THOUSANDS these past few weeks shorting\n\nBarely even from my other gains", "score": 7, "replies": [{"body": "But did you have fun? That’s the real question :D\n\nI swear it’s always shorting lol, I lost like $8k from SOXS and SQQQ before I finally accepted we are in a bull **bull** market", "score": 12, "replies": [{"body": "This.  I’ve lost so much shorting over the last 3 years.  I quit selling calls; only a small amount of cc", "score": 2, "replies": []}, {"body": "I also lost a lot selling LULU and FDX puts so it really depends on the company but yahhhh very much a bull **bull** market now\n\nMakes me scared to sell puts when we go up like this tho", "score": 1, "replies": [{"body": "You do what you must. Selling puts is always safer than selling calls. I've been burned enough to have internalized that lesson. When I sell calls these days, it's to squeeze out a few hundred extra dollars off a profitable put position (due to a discount on bp requirements for strangles).", "score": 4, "replies": [{"body": "Historically, it's been safer to sell puts than calls, but I think we're all afraid to be caught during a correction", "score": 3, "replies": [{"body": "What you can do is reduce your duration and accept less premium, so whatever shenanigans happen, it gets cleared by eow. Right now is a good time for it, as we are heading into earnings season right at the end of the month.", "score": 2, "replies": [{"body": "I only sell weeklies...", "score": 1, "replies": [{"body": "Then your puts are probably too close, IMO.", "score": 2, "replies": [{"body": "I got burned selling ADBE, COST and TSLA calls right before they spiked overnight", "score": 1, "replies": [{"body": "Puts are just safer than calls, except maybe in actual bear markets, but even then you have to be extra wary of calls. This sub must remember how a whole lot of people got wiped out in March of 2020 because they sold calls, right before a 4% move up in the indices. The problem with calls, basically - \n\nBull market - lots of things will pump with no discernible reason because the mood of the market is good. Be it narratives around a sector or meme stocks. Speculative buying can trigger on a whim.\n\nBear market - the market is going down, but most of the biggest one-day gains in the history of financial markets have come as bear market snap-backs.", "score": 2, "replies": [{"body": "I agree and especially this:\n\n>most of the biggest one-day gains in the history of financial markets have come as bear market snap-backs.\n\nAin't that the golden truth ✨️", "score": 2, "replies": []}, {"body": "whats your way of trading in a bear market? selling straddles with tight TP or bcs with rolling if itm?", "score": 1, "replies": [{"body": "If it's a 2020-style bear market, where even liquidity starts breaking down, sit out. But it would have to be a pretty serious bear market. I was selling puts throughout 2022 and 2023. Just don't be greedy and baited by volatility. If you're getting 10 cents at puts 10% below the current underlying value, sell at 20% below the current price. Keep things weekly and buy out profits early (unless you're fine getting assigned).\n\nBear markets are usually a time to start building some long term positions.", "score": 1, "replies": [{"body": "interesting to read - i guess if vix creeps up during a bear market it will be viable again to sell tail risk hedges, right now is not a good time for it since you‘re getting in to low of a premium as it seems\n\nhow do you structure your long positions to build up? letting your short puts get assigned and then sell covered calls?", "score": 1, "replies": [{"body": "Taking assignment or buying outright if the price is right. When you are building a long position during a bear market, you are typically looking out a year or two, when prices have appreciated a bit following. You'll qualify for long term capital gains too, which is very important for keeping your money.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Real, this is why I’m glad SMCI isn’t at ATH. But now I’m trying to be more conservative and do FAR OTM puts 😂", "score": 2, "replies": []}]}, {"body": "lol I sell soxs it goes up I buy it, it gets destroyed, I’ve accepted soxs is a stock only made to destroy my portfolio. I made $800 on soxs once and lost ever since. I stay away now.\n\nMy friend loves SOXL and I like betting against him. Nope.", "score": 1, "replies": [{"body": "Word", "score": 1, "replies": []}]}, {"body": "yep same here with SQQQ and SOXS, just glad I decided to flip the switch when I did. I dumped my SQQQ at like $20 and it’s a $7 now, unbelievable", "score": 1, "replies": []}]}]}]}, {"body": "I’ll call you mistress S", "score": 2, "replies": []}]}]}]}, {"body": "It’s 262 now guys I think he’s fucked", "score": 1, "replies": []}, {"body": "No clue what this is about but if 260 was his break even, he likely closed before then so he didn’t get demolished.", "score": -2, "replies": []}]}, {"body": "I pointed out to him that his tickers are risky,  He told me scared money make no money.  I replied back scared money don’t blow up accounts.\n\nI hope the dude is Ok🕺 it’s just money.  Health and other things are more important", "score": 32, "replies": [{"body": "TSLA burned me years ago so I feel his pain. It's the OG meme stock.\n\nI think somebody in the daily thread mentioned he's still up YTD. He'll recover.\n\nEdit: Yeah he's fine lmfao. Still up at least 100K https://reddit.com/r/thetagang/comments/1d5s0kp/ytd_gains_selling_ccs/", "score": 16, "replies": [{"body": "Imho,  John Bogle Books are mandatory read.   Most people are eventually gonna get blown up", "score": 6, "replies": [{"body": "That's basically the strategy I've come to. Buy & hold, selling covered calls on my risky stocks to hedge. It's what CCs were made for lol", "score": 7, "replies": []}]}, {"body": "World's greatest shitcoin.\n\nBut really, people just need a healthier aversion to playing with calls. It's way worse than with puts.", "score": 5, "replies": [{"body": "Why do you say that?", "score": 1, "replies": [{"body": "Because we are in a market where these kind of sudden moves to the upside are far more common than flash crashes. Just think about all the things you've seen in the past few years pump just because of market mood, without any discernible catalyst. And it's much more difficult salvaging a blown short call position, unless you have some underlying stock, because you are getting assigned short at a higher price than taking a long position at a lower price.\n\nBear in mind that typically when people get their calls blown out, it is often in the middle of a parabolic move where a stock is catching fire, so it often goes that the next few sessions see the stock going even higher still.", "score": 7, "replies": [{"body": "I really wished I saw your post before the year started.  The vast majority of my losses came from bearish plays", "score": 2, "replies": [{"body": "Longevity as a premium seller means avoiding landmines, because even one might set you back months or, in the worst case, end you,.\n\n1. Avoid holding short options into earnings. There's always time to benefit from volatility after the move.\n2. Be wary when selling calls, even in bear markets, since the biggest single day gains in market history have been bear market snap backs. A lot of people wiped in March 2020.\n3. Lighten up before big data release days, especially ones that can set the narrative and get everyone's attention.", "score": 1, "replies": [{"body": "Good points; I got out of Tesla with losses but it would have creamed me to 4x the losses if I’d stayed in.  \n\nSelling calls have fcuk me harder than anything else", "score": 3, "replies": [{"body": "My bloodletting was getting killed on BYND calls during the meme stock craze of '21\n\nIrrational pumps can happen anytime. Irrational dumps, only during technical malfunctions, like what happened to berkshire recently.", "score": 1, "replies": []}]}]}]}, {"body": "All based on gut and observation or you derived this based on statistics ?", "score": -3, "replies": [{"body": "[https://www.reddit.com/r/thetagang/comments/1dwbwv0/comment/lbuaugh/](https://www.reddit.com/r/thetagang/comments/1dwbwv0/comment/lbuaugh/) I posted this in another thread", "score": 4, "replies": [{"body": "Okay, doesn’t answer my question though but sounds like you’re mostly basing this off observation.", "score": 1, "replies": [{"body": "At some point, you should trust your eyes.", "score": 3, "replies": [{"body": "I do. When I see claims not backed up and clear questions avoided, that gives me enough information to determine a conclusion for myself. \n\n\nMight I recommend using data. It doesn’t erase your observations. So now you have two types of information. Usually works out better.", "score": -1, "replies": [{"body": "Might as well stick your hand in the fire enough for the lesson to sink in.", "score": 1, "replies": [{"body": "That doesn’t make sense. We are talking about options.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "RIP ME BRO", "score": 1, "replies": [{"body": "NEVER BACK DOWN 👑", "score": 2, "replies": [{"body": "Thanks bro", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Love it", "score": 1, "replies": []}]}, {"body": "I’m good but my YTD gain went from 50% to 30% after TSLA fucked me lollll u/mikesugs13", "score": 2, "replies": []}, {"body": "I hope it's not /u/stormwillpass. That guy has been fked by TSLA before.", "score": 1, "replies": []}]}, {"body": "I was looking for this post earlier…he stopped posting…it made me feel less shitty about my 5k loss", "score": 19, "replies": [{"body": "Well it's all in retrospect. If 5k is your whole account, then that's horrible. Same with him. I remember I had a 10k lost and another guy had a 100k lost.. well that 10k was a much larger portion of my account than that 100k was of the bigger loss guy. \n\nNot trying to tell you to feel bad but just saying be careful comparing yourself to others when looking from the outside in.", "score": 8, "replies": [{"body": "I lost 50k in TSLA in 22 and made 110k on Msft and Nvda in 23. It’s all about the end game we’re all looking for. Bottom line for me is I started with $130k in 2018 and hit 550k in 2022 and am now at 498k today. 2023 was a terrible year for me but I’ve gotten a bit smarter and am much more patient then I was. You can’t 5x your acct in 4 yrs without the chance of losing 1/2 the value in 1 yr. It’s a risk reward feeling. I am willing to risk 1/2 my acct in one year to grow it 5X in 4 or 5.", "score": 2, "replies": [{"body": "O I understand the reasoning. Buy it sounds like it's working for you. Plenty of folks who just blow up their accounts...but a side question...how much did you start with and where did you get that start up capital from?", "score": 1, "replies": [{"body": "I started with $130k from my 401k rollover account in 2018. I was just buying stock and writing covered calls on a monthly basis and then started expanding into credit and debit spreads. still writing a few CC's. Account value is  just over $500K today about 270% higher", "score": 1, "replies": [{"body": "Thanks for responding. I was curious as to how people were getting such large start up capital but that brings more clarity for me. I know others may have inheritance, rich parents,  or something similar but I think your method of getting start up capital is more attainable for the average joe like myself.", "score": 1, "replies": []}]}]}]}]}, {"body": "That hurt for a while", "score": 1, "replies": []}]}, {"body": "no way you just felt the need to roast a man who got steamrolled out of about 120k lmao", "score": 9, "replies": [{"body": "I'm banned from WSB so I have to settle for roasting you regards", "score": 8, "replies": [{"body": "fair enough", "score": 2, "replies": []}]}, {"body": "LOL", "score": 1, "replies": []}]}, {"body": "Left $10k on the table because thinking selling $230c for this week was a good idea.", "score": 6, "replies": [{"body": "As long as you profit, it’s a win", "score": 9, "replies": []}]}, {"body": "Don't be mean to lion 😡\n\nYou killed Mufasa", "score": 12, "replies": [{"body": "Just realized the irony in the name relative to the meme lol", "score": 7, "replies": [{"body": "The lion that watched over us 😭", "score": 3, "replies": [{"body": "wsb has guh dude, we have the lion king!", "score": 4, "replies": [{"body": "#🦁👑\n\n#ﮩـﮩﮩ٨ـ🫀ﮩ٨ـﮩﮩ٨ـ#", "score": 3, "replies": []}]}]}]}, {"body": "Thanks u/ykoreaa for sticking up for me", "score": 2, "replies": []}, {"body": "Lmfao ok lady", "score": 3, "replies": [{"body": "Lions was talking to this chick days ago while the position was open saying he hoped it hit 220 EOD. Poor fella.", "score": 1, "replies": []}]}]}, {"body": "Fs in chat\nF", "score": 5, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "Bear here, if you don't intend to size into a short, you wait for daily low to be taken out before initiating.", "score": 5, "replies": [{"body": "Sorry I don’t understand what you’re saying. \n\n\nYou wait until it goes very low before shorting?", "score": 1, "replies": [{"body": "The most basic sign of weakness in a rally is that buyers show a day in which they no longer can keep price above the prior day's low. There are better entries to be found, but that's what baby bears should be looking for as a start.", "score": 5, "replies": []}]}]}, {"body": "Don't sell calls on batshit crazy stocks like TSLA especially when they're in an uptrend. Hope his calls expired worthless and he escaped mostly unscathed", "score": 4, "replies": [{"body": "No, Tesla ended the day around 250 yesterday so he is taking a pretty sizable loss. Low 6 figures", "score": 2, "replies": [{"body": "P.S I hope he at least took assignment of the short shares and didn’t realise the loss. I don’t think it’ll stay at these levels after it fills the $270 gap.\n\nHe can write puts against those to pay off the margin interest", "score": 1, "replies": []}, {"body": "Fuck. Don’t write so many calls on meme grade stocks, people. Not worth the risk", "score": 1, "replies": []}]}]}, {"body": "Omg I just saw this lmfao u/ykoreaa u/bandicleaner2 RIP ME", "score": 3, "replies": []}, {"body": "Hint: never be short any stock over 100b market cap in a bull market", "score": 4, "replies": [{"body": "That is right, a 100 b stock is a gorilla and they did not get there by incompetence.", "score": 2, "replies": []}]}, {"body": "TA game still strong, don't short going into earnings", "score": 2, "replies": [{"body": "(i don't like picking individual stocks for reasons like all of this, so i'm about to say something stupid).\n\nsure, but isn't the increased volatility of earnings the reason why people just start one or MANY 5 delta strangles on things?  they THINK that NICE huge higher volatility is an EASY gullible target for them.\n\n.........and then every now and then they get crushed like this.......", "score": 1, "replies": []}]}, {"body": "I think it's a good investment, but managed to wreck myself with a few not so quick shorts.", "score": 2, "replies": []}, {"body": "I mean to be fair he was shorting it", "score": 2, "replies": []}, {"body": "From a comment of his last week\n\n> I have 19x 210/240 and 26x 220/260 c for TSLA expiring 7/5 for about $13K in premium received. If TSLA is above 220 EOW\n\nAt $251, his loss was about about 57,000 (max loss on 19x 210/240 CCS not including premium) + 80,600, or 137,600. Minus 13k premium it's about 124.6k loss. Unsure of when he actually closed.\n\nIf closed around 240-250, his loss was between 57,000 + 52,000-78,000.\n\nSo between 109k to 135k.\n\n~96-122k after premiums.", "score": 2, "replies": [{"body": "Wonder how it turned out after yesterday. If he rolled things forward or not.", "score": 1, "replies": [{"body": "Can't really roll spreads since he'd be buying back the 10-wide spread for max loss of 10 debit, and the new spread would at best be around half of that. If it were just short options it would've been easier to manage if it were a few contracts. Becomes difficult when it was a large percentage of his account.", "score": 1, "replies": [{"body": "Ah. I don't play anything other than basic long calls, CSPs, and CCs. Never took the time to really study spreads, condors, and anything else fancy named.", "score": 1, "replies": []}]}]}]}, {"body": "It's crazy that I was actually watching tesla for the past few weeks and was about to pull the trigger on a spread....glad I kept away from it", "score": 1, "replies": []}, {"body": "It will tank again, but probably not in time to save this guy.\n\nFar OTM leaps work well for me. Missed the big run the last week or so. Did get in \"at the top\" at the end of trading ~~Thursday~~Wednesday.  Closed out Friday night for a 7% gain.  Not great, but still green.", "score": 1, "replies": []}, {"body": "u/free_lions seems you got some fans here, good job dude.", "score": 1, "replies": []}]}
{"title": "Tesla stock rises again, extending monster 40% rally over the last month", "selftext": "", "id": "1dw2683", "created_utc": 1720197273.0, "score": 195, "upvote_ratio": 0.75, "num_comments": 109, "comments": [{"body": "The stock has pared all of its year-to-date losses, jumping more than 70% from its late-April lows.", "score": 18, "replies": []}, {"body": "I painfully decided to sell my Tesla calls. It was a hard decision, but I tend to want to hold for too long and end up getting burned. Here's to hoping for a modest pullback!", "score": 13, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Still down cause my dumbass bought that shit when it was at peak a couple years back.", "score": 7, "replies": [{"body": "You are not alone", "score": 5, "replies": []}, {"body": "Same but I averaged down during that dip a few months ago. Almost high enough for me to break even and then I’ll sell it all. Fingers crossed!", "score": 3, "replies": []}, {"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Every time Tesla takes a big dip I’ve been buying more shares. Now up to $200k worth of shares and going to keep buying. Not because of the cars, but because of Optimus. I don’t think most people realize just how disruptive it’s going to be. Humanoid handed robots are going to hit people with the same shock that generative AI is, and Tesla is on track to be the main player there.", "score": 19, "replies": [{"body": "Optimus and energy are the things a lot of people don’t realize. I recently did a project for sustainable energy and learned a lot about it. Tesla is light years ahead of most other companies with it. From integration to the software. It’s very impressive.", "score": 11, "replies": []}, {"body": "But Tesla isn't first to market. Boston Robotics is. And even they have to fight Chinese copycats.", "score": 2, "replies": [{"body": "Yeah, no. You making a lemonade stand isn’t putting Tropicana out of business kiddo, especially if you charge $90 for a glass of your lemonade. 🤡", "score": -1, "replies": [{"body": "Except that TSLA won't be Tropicana either. At best it'll be a Samsung, Sony, LG, or other electronics manufacturer.  At worst it'll be a Chinese manufacturer like Xiaomi, Huawei, etc. \n\nTesla won't be able to produce the quantities and compete on price.", "score": 2, "replies": [{"body": "Nah, that’s stupid. They are already the Apple/Coca-Cola/ McDonald’s of EV’s. Other companies will fall and go bankrupt, ALL ev companies would need to disappear before Tesla even has a chance at disappearing. That’s the difference between American vs those Asian companies you’re naming.", "score": 0, "replies": []}]}]}]}, {"body": "Optimus is a freakin‘ puppet. Tesla is lightyears behind Boston Dynamics and others. For crying out loud, Toyota had a more capable „humanoid robot“ over 10 years ago. You can watch it play the violin at their headquarters.", "score": 15, "replies": [{"body": "We are 50 years away from a useful Optimus. Maybe longer. xAI is way behind. Elon is just the best carnival barker.", "score": 16, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Don’t try to speak sense to a cult member during culting", "score": 6, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": -3, "replies": []}]}, {"body": "It's not all about capability. It's mainly about being able to make a humanoid that is designed to be manufactured at impossible scales. Boston Dynamics only probably had atlas robots in the 10s and each unit probably cost 500k to 1 million. Of course it was going to be more capable than tesla. We're talking here about building billions of humanoids at a production cost of 10k a bot. \n\nCapability helps, which is why tesla is trying to increase capability with each new gen, but that can't come at the expense of price otherwise the whole project doesn't make sense to begin with", "score": 9, "replies": [{"body": "“Billions of humanoids”. \n\nBillions? With 9 billion people on Earth? To what purpose? Do you fanboys ever run any numbers? Have you heard of something called a “sense check”?\n\nThere are about 4 billion smartphones in use at a price range of roughly $300 to $1500, and you people think there’s a market for *billions* of robots at $10k a pop?\n\nLMAO", "score": 12, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Just say you don't get the argument before acting like you've understood it.\n\nThe goal is to replace people doing repetitive tasks. \nThis won't be a smartphone - of course some individuals would buy some, but at least for the first years, no one would be able to. These would most likely be rented out to businesses to undercut human labour. The economics of corporations employing hunanoids to do the final bit of automation that still needs humans in the loop even at billions of humanoids would still be cheaper than employing people. Of course, they need to be at least half as capable as people at doing repetitive tasks, which is why these aren't on the market yet. If you think that's unlikely, then that's on you. The hundreds of humanoid startups in the last year and hundreds of thousands of engineers working on these in some way, shape, or form seem to disagree.", "score": -1, "replies": [{"body": "You’re proving my point and you don’t even notice it. 🤦‍♂️ JFC. \n\nThere’s about 9 billion people on Earth. Accoridng to OECD, about 65% of those are working age. So, let’s say 6 billion. \n\nHow many of those work in jobs that are mostly repetitive tasks? It’s not teachers, lawyers, doctors, architects, assistants, carpenters, plumbers, electricians, …\n\nAnd before you pull out that research that says 90% of employees are burned with *some* repetitive tasks: that’s obviously not the same thing. \n\nLet’s be very generous and say it’s half, so 3 billion. How many of those could *actually* be replaced, considering we’re talking across the world here - from the US to Kiribati? It would be a small percentage. Certainly not “billions”. \n\nAnd, by the way, even if it were - what would we do will an extra couple of billions of unemployed people?\n\nIt takes five minutes of critical thinking to realize that the hype is b.s.", "score": 1, "replies": [{"body": "1. Individual robots won't be as good at humans at doing tasks. Not for anytime soon. They don't have the dexterity that humans have, their limbs, fingers etc have less degrees of freedom than those of humans, and they wouldn't be able to create ways to become more efficient at tasks as they carry them out like humans can. So for every task that a single human can do well, you'd need to throw a few humanoids at it. \n\nBut why would we still make humanoids if the limitations are clear? Because if you can get the cost of manufacturing singular humanoids down by a large enough margin, it'd be cheaper to employ multiple humanoids for the same task that one human would do. Calculations: let's say you have to pay a labourer a salary of 50k a year. That's 50k a year for every year that you need them. And you can't overwork them. And you ethically can't ask them to do something that might be dangerous to them. On the other hand, you've got humanoids that Tesla makes for 10k, and let's say they sell the services of a humanoid at $2 an hour. Assuming that you need 3 humanoids to do the work of 1 human  that's a labourer you can get for $6 an hour. Far below any minimum wage. And you can get then to work in toxic environments, to do things that humans can find dangerous, they are patient enough to tolerate your verbal abuse as an employer that was probably caused by your frustrations at home.\n\nYou can also get them to do more complex tasks like plumbing and wood working as long as you can improve their robot brain and throw more humanoids at a task than you would have humans doing the same task.\n\n2. When you have near unlimited cheap labour, tasks that people didn't do due to a lack of cheap manpower become feasible. The number of jobs available to do isn't limited. Eg a lot of places are understaffed because the foreman doesn't have the budget to hire a few more workers. Or every home doesn't have a dedicated maid, butler and nanny because you'd have to pay then a living wage. This is where cheap unlimited labour comes in. \n\nAnd as for the question of what happens when everyone loses their jobs? We don't know. Maybe this makes governments wake up and introduce some form of UBI. Maybe even money ceases to be a thing. Maybe it means we find increasingly complex or different tasks for the human population to take, like what happened post industrial revolution. But that doesn't take away from the feasibility of billions of humanoids.", "score": 2, "replies": [{"body": "Why make humamoids? For no practical reason whatsoever. For any menial task you want done, specialized robots or those that are geared towards a particular set of tasks, are much more effective and efficient. And those that are limited to those tasks also pose less of a potential threat. \n\nMaking humanoids is a gimmick. A PR stunt. Because writers and movie makers have been fantasizing about it for generations - at least since Fritz Lang‘s 1927 „Metropolis“. So, lots of engineers are trying to answer the question: „*Can* we make human-like robots?“ That doesn’t make it a practical idea. And it sure as hell doesn’t mean there’s a market of a couple of billion units out there. Too much complexity without any real advantage in functionality. \n\nPut it this way: over the next couple of decades, we’re much more likely to see R2D2s rather than C3POs. \n\nIt’s just more Musk hype. Next year, he’ll tell us Tesla will solve time travel by the end of the decade, and people will believe that, too.", "score": 2, "replies": [{"body": "Sure you can design a robot that can sweep your floor better than a humanoid, and another that can mop your floor better than a humanoid, and another that can cook your food better than a humanoid, and another that can organise your home better. But by the time you've designed all of these different robots, you've got a few problems to deal with:\n1. The human world was built for the humanoid form. You have to redesign the environment for these robots. The floors in homes were made to be easy for humans to clean. It means that your sweeping robot can't climb the stairs and can't get into rooms with closed doors. Without you removing the staircase in your house, without you adding automatic doors that open for the robot or without you building some rube Goldberg contraption that's also designed to maneuver the human world that would be expensive to manufacture especially at scale, you're not beating the humanoid form that can just pick up tools made for humans and do work the way humans do. \n2. Let's say you manage to create individual robots for every single task (we'll gloss over how daunting such a task would be), it's still not cost effective to do that over humanoids. You'd need multiple production lines, multiple different software and/or ai models for each one of those robots. All this means is that you can't get the benefit of creating one highly efficient production line that can make only one thing and one thing well - the humanoid robot. Economies of scale kick in when you can do that. For example, you can design 10 different actuators and make 10 production lines for those actuators and pay off the cost of those 10 production lines fairly easily, or you could have thousands of different ones for thousands of different robots. One choice is clearly more cost effective than the other. One robot and one brain that can do everything but to a a slightly worse standard than an individual dedicated robot is best.\n\nYou complaints around complexity are the same ones people had with Tesla attempting to commercialise the t-zero. \"Electric cars are too complex\". \"They can't even make 100 of them, how are they going to have millions\". \nJudging future potential by current limitations as if the physics says that we can't do something.\n\nAnd, no, there's a difference between suggesting time travel and suggesting commercialising robots that already exist (Boston Dynamics atlas) with machine learning principles that have already been figured out.", "score": 2, "replies": [{"body": "Newsflash: robots have been designed for specific types of tasks for decades. Even for a general „home helper“ robot, there’s no reason for it to be humanoid. It could probably do a lot more things if it wasn‘t. Nobody said you need separate ones for sweeping and mopping. Geez - tool attachments ring a bell?\n\nAnd I don’t know anyone who said electric cars were too complex. Everyone knows they’re simpler. People were skeptical about battery tech (still a challenge), ethics of the battery supply chain (huge problem), and charging infrastructure (becoming more of a challenge when every EV sucks power as fast as a small town does).", "score": 1, "replies": [{"body": "This is about being able to leave your home in the worst state possible and then getting back home to a fully clean house - a made bed, swept floors, washed dishes, cooked food all without you having to input anything - when adding attachments. The exact same robot that did that can also mow your lawn, do carpentry, and work in a factory.\n\nFor a production cost of 10k. \n\nPlease enlighten me on how your magical non humanoid contraption can do all that for less than 10k.\n\nThe complexity was to do with things like potential thermal runaway with electric vehicle batteries. To do with reliability and how they could never match the reliability of traditional ICE vehicles.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Flippies don't matter when you have hands.", "score": 0, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Optimus: Boston dynamic = Tesla: other EV vehicles that failed to manufacture in scale. ", "score": 1, "replies": [{"body": "lol. Are you saying Tesla fails to manufacturer at scale? They are the largest EV manufacturer in the world. BYD beat them for one quarter, but Tesla remains king. Optimus is going to make Tesla the next Nvidia of the stock market.", "score": 1, "replies": [{"body": "You read my ratio the other way. ", "score": 1, "replies": []}]}]}]}, {"body": "Plz rally some more. Plz plz plz.\n\nThis is perfect for buying CHEAP OTM puts. \n\nThanks team!", "score": 2, "replies": []}, {"body": "I got a look at the interior of a cybertruck yesterday. What a joke. Elmo is a conman.", "score": 4, "replies": [{"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": -1, "replies": []}]}, {"body": "I was so tempted to sell all my TSLA shares when Elon fired the supercharger team. But I held on and even bought more after I got the free month trial of FSD for my model 3. \n\nI’m a true believer. FSD is here; it’s going to get better; and once people discover that they don’t have to drive there will be no going back. \n\nNo other company’s self driving tech will ever be as good as Tesla’s FSD because they have “normal” CEOs who would never dream of pouring the insane resources that Elon has committed to this.\n\nIn 10 years, Tesla will be the number one selling car manufacturer in America. Not sure about globally because BYD competition. But US legacy manufacturers are doomed. \n\nNow let’s add AI, robots, and home energy solutions to the mix. \n\nBullish.", "score": 7, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Of course ! Right after I sold at 210 😭", "score": 1, "replies": []}, {"body": "Why is the stock doing so shit today lol", "score": -4, "replies": [{"body": "People taking gains?", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "\"Your submission is manually reviewed due to spam control. -2\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I’ve seen milk age slower in the Florida sun then this comment", "score": 1, "replies": []}]}, {"body": "I sold all TSLA shares in early January after holding 11 years. Added to my NVDA holding. Now I’m thinking about coming back into TSLA with the robo-taxi in the on-deck circle for Aug 8.", "score": 0, "replies": [{"body": "Check numbers and figure of both $NVDA and $TSLA…and future forecast… Then consider Mr. Musk sold tons of $TSLA shares to acquire Twitter and raise funds for xAI…what will be his next fad? I’m not so sure that both $NVDA will become weeds and $TSLA flowers ;-)", "score": 1, "replies": [{"body": "Im thinking about the inevitable hype build-up to the robotaxi. Might be wise to ride the wave.", "score": 2, "replies": [{"body": "Robotaxi is more dream than reality:\n\n\"Everyone else has found out that what they thought was a two or three-year project turns out to be a 10 or 20-year project,\" said Philip Koopman, a Carnegie Mellon University professor working on autonomous vehicle safety. \"Tesla's found that out too.\"", "score": 2, "replies": [{"body": "Agreed, but that doesn’t mean the stock won’t surge in anticipation of the unveil and maybe even afterward.", "score": 1, "replies": []}]}]}]}]}]}
