{"title": "\"NVDA falls in 'sympathy' with Micron\"", "selftext": "Says who?  Who makes up these rules?!?  I swear it's an inside cabal of big institutional traders manipulating the daily movement on a stock.\n\nIf you take the 10 biggest money movers and they all agree \"ehhhhh let's short the stock and blame it on Micron\" \"oooh yea good idea boss\" \"yeaaaa great!!\"\n\nThen boom we down  $3 for no reason.\n\nWatch tomorrow this same gaggle of thieves moves it either direction on yet another stupid reason - climate change, Jensen Huang's shoes were untied, someone parked in his parking spot, medical research using Blackwell GPU fails to find the cause of genetically small penile syndrome of said cabal members... \n\nWho knows.  Watch.  Mark my words.", "id": "1dpubbg", "created_utc": 1719502753.0, "score": 94, "upvote_ratio": 0.77, "num_comments": 126, "comments": [{"body": "There’s no other company Id rather be invested in!", "score": 33, "replies": [{"body": "Fine, but Micron is the main supplier of memory for the B200, and NVDA does not make memory chips...So their demand staying just high, and not exploding is a very good proxy for NVDA orders....in a not good way...", "score": 16, "replies": [{"body": "MU isn’t the only company capable of making HBM, NVDA has other sources but they ARE the only source of Hopper and Blackwell", "score": 3, "replies": []}, {"body": "How is TSMC doing regarding orders?", "score": 1, "replies": [{"body": "Modest...but those type of orders are for the long term. You can't use TSMC as proxy for next quarter more like 1 year out...They said: \"**TSMC anticipates second-quarter revenue to grow 9% sequentially to TWD 646 billion at the midpoint** (in USD terms, 6% to $20 billion).\"", "score": 2, "replies": []}]}]}]}, {"body": "I'm not sure bout the cabal, but I also don't get why a bad result for MU should indicate anything bad for NVDA, or ARM for that matter. \n\nIt's just a one day annoyance, don't make any major moves because of this. NVDA sells every chip is makes, in fact many are sold before even made, and for A LOT of $$$. That's a company to stay invested in.", "score": 18, "replies": [{"body": "Wasn’t a bad result at all", "score": 5, "replies": [{"body": "Yeah, honestly I didn’t pay attention. I just saw the reaction. Nevertheless… MU is so far behind NVDA, their earnings having any impact makes little sense. The only I think about MU is when they report.", "score": 2, "replies": []}, {"body": "Exactly it was the guidance. People are expecting too much too soon. AI is still in its infancy.", "score": 1, "replies": []}, {"body": "I agree. 17% qoq if I remember correctly", "score": -1, "replies": []}]}, {"body": "That's all priced in. That's the whole point of its high price to earnings, book, sales. It's expected to do exactly what you're describing. The stock market doesn't care that stocks do what they're supposed to do. It only cares when stocks exceed or disappoint expectations.", "score": 2, "replies": []}, {"body": "They did mention that they have manufacturing constraints though. So their incapacity to meet demand means NVDA sells less chips.", "score": 1, "replies": []}, {"body": "They need micron for the fastest memory used by Blackwell... just like they need TSMS... and TSMS nees ASML ... \nFor some parts there is only 1 suplier.", "score": 1, "replies": []}]}, {"body": "So when it goes up 5 percent in a day on no news its all natural price action but down 2 percent its all manipulation?", "score": 13, "replies": [{"body": "Lol! I so agree with you. That 6% gain was complete manipulation. 😂🤣", "score": 0, "replies": []}, {"body": "Down for stupid reasons.  Do you know how to read or does your mommies cellphone not have large enough fonts?   Her basement too dark?", "score": -11, "replies": [{"body": "Why so angry?\nDid you load up more shares $140? 🤣\nIf you know why the “manipulating forces” hits stocks and makes them go down so well, could you tell me what they’re manipulating next so I can get load up puts and get rich with 100% certainty? 🤣", "score": 0, "replies": [{"body": "No.  I loaded up at $12 (split adjusted) and have no spare money. 😂😂 But point well taken.", "score": -2, "replies": [{"body": "Nice! Stop shitting on people all over the comments then! 😂😂 Why are you up 1000% AFTER this correction picking fights with people? 🫣🫣😂", "score": 0, "replies": []}]}]}, {"body": "My bad didnt know i was talking to a 9 year old", "score": -1, "replies": []}]}]}, {"body": "Micron is sold out through 2025. Everything else they produce or can muster will all be bonus to the bottom line. The backlog will only get bigger. Buy this dipski ladies and gents.", "score": 10, "replies": []}, {"body": "I purchased another 150 Shares of NVDA today. Holding 750 Shares and ain’t skeered at all. Imagine watching it Pop and You did not load up on the dip", "score": 11, "replies": [{"body": "Yea I bought more back in April when it dipped a bunch.", "score": 1, "replies": [{"body": "Great", "score": 3, "replies": []}]}]}, {"body": "When the timing is 100% the same for borth downturns in afterhours at earnings release, it is.\n\nIf it right or sustains it is another question.", "score": 9, "replies": []}, {"body": "OP just found out that the market is manipulated", "score": 36, "replies": [{"body": "No always knew just today is so blatant.", "score": 4, "replies": [{"body": "You're ignoring what user jazzjustice [said.](https://www.reddit.com/r/NVDA_Stock/s/OfejcDx10y).", "score": 3, "replies": []}, {"body": "Yeah same here.  I know it is. But damn these dickheads don't even care to pretend it's fair anymore.", "score": 1, "replies": []}, {"body": "wait till you follow gamestop", "score": 1, "replies": []}]}, {"body": "You're both highly regarded.", "score": 0, "replies": []}, {"body": "They prefer the term Illusionist", "score": -1, "replies": []}]}, {"body": "Wall Street large scale traders need the profits to keep flowing on month to month basis. \n\nThat’s why they have to keep selling and buying. It’s so they can pay the salaries of brokers and other staff. \n\nThat’s why trading options is never reliable.", "score": 11, "replies": [{"body": "parasites", "score": 3, "replies": []}, {"body": "Can you expand more upon why trading options is never reliable? Have a retired dad that is into the whole trading options & selling covered calls thing but I don’t know much about it to comment as to whether what he’s doing is good/bad for his retirement.. or just in general", "score": 1, "replies": [{"body": "Trading options is like gambling imo. Long term investing always comes out on top. But people who’re good at it and know what they’re doing may make money. It’s still too much for the normal man.", "score": 11, "replies": [{"body": "100%.\n\nsometimes I'll buy a call to flip or play out, but I know the money may fail because I'm not a hedge involved person. \n\ntried and true, buy and invest for longterm. it's true of all best practices for savings.", "score": 6, "replies": [{"body": "What do you mean by not being a “hedge involved” person?", "score": 0, "replies": [{"body": "I ain't rich", "score": 0, "replies": []}, {"body": "I am hedged w/ sqqq, tza and srty. Hedges can off set losses in periods of sideways trading or steep selloffs. They are more important than a crappy stock you thought would pay off", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Media will always try to magnify whatever movement is happening that day; the more clicks=more money. If it’s going up, it’s the next biggest thing, when it’s going down, it’s a bubble that is finally popping. Stick to key facts, what are sales=demand, what is EPS, what products or unique qualities is this company bringing to the table that others have not or cannot. Although AI “booming”, if the chips fall into place and robotics and CUDA/omniverse progress how this company is forecasting, it could be just the beginning. If it turns out that it doesn’t work out or that there aren’t enough applications besides the few major tech companies, then maybe we really will see a bubble pop. This company still has a great growth outlook and strategy to maintain dominance (in my opinion) but it is still fairly speculative at this moment in time; I feel that we haven’t truly been able to see AI perform to it’s supposed potential (yet). I’m really excited to see what this company looks like in 5-10 years and will roll with the volatility in the near term to continue to secure a long term gain. That being said, profit taking is basically the entire goal of investing, I’ve taken my fair share of profits so far off NVDA but don’t see myself not having a position with the company for the foreseeable future.", "score": 5, "replies": []}, {"body": "I’m 1391 shares NVDIA and 100 shares MU, I’m here for the ride no matter where it goes and I will not sell for years.", "score": 4, "replies": []}, {"body": "It happens when stocks go up too. Get over it.", "score": 3, "replies": [{"body": "Get over what?\n\nI could careless about dips. There's nothing to get over.     I buy more - well I would.  I'm fully vested in NVDA since 2020.  I don't screw with options so I can ride anything out.   \n\nMy point was the reasoning for it to go down was \"in sympathy\" of another stock issues.   That's all I was pointing out.  A stupid reason to dip.  That's all.", "score": -1, "replies": []}]}, {"body": "Buy nvda on each micron dip.", "score": 3, "replies": []}, {"body": "Hey, Paypal went up 11 cents!", "score": 3, "replies": []}, {"body": "The stock moved when huang signed someones tits, didnt hear you cry wolf then", "score": 5, "replies": [{"body": "Not crying wolf about jack squat.  Do you have reading comprehension issues?  I could give two squats about it going up or down.  I've been in since 2020 and not leaving anytime soon.  \n\nThe stock going down wasn't my point.  It was quoting an article about WHY it went down.  Stupid reasons\n\n\nYou have me confused with these day traders with options losing their hats.\n\nI could easily - EASILY ride out if this thing goes down double digits and you wouldn't hear squat.   Again for the hearing impaired...  My comment was about a news article about why it went down.  Plain and simple.", "score": -3, "replies": [{"body": "You do realise that NVDA chips uses Microns memory tech in their chips right? \n\nI swear this sub is full of idiots, ofcourse if MU posts watered down guidance that will have a knockon effect on NVDA. Not to mention that both of them are in the AI space and most indices and funds move in tandem when one stock moves low if they have positions in other stocks in that sector. \n\nSo stupid", "score": 11, "replies": []}, {"body": "\"I really don't care about it going down, but I do care about random opinions as to why. Let me write up a whole post about how much I don't care!\"\n\nYour comments are weirdly defensive, like you're butthurt about something.", "score": 1, "replies": []}]}]}, {"body": "this is an indicator: NVDA buys MU's chips. if MU's earnings weren't a huge blowout, it points to NVDA's not being blowout either.", "score": 4, "replies": [{"body": "MU is in a much more competitive area with razor thin margins. Nvidia is peerless at the moment and can jack up their prices and revenue.", "score": 2, "replies": []}, {"body": "That’s one theory. However, they have back orders through 25 for Nvda. I don’t see where micron has any influence in Nvda upcoming quarterly earnings report. What micron does have is a keeping up with demand problem and that’s going to cost some money to resolve.", "score": 2, "replies": []}, {"body": "Fair point!", "score": 1, "replies": []}]}, {"body": "It is absolutely a fucken manufactured game dude.\n\nHoly shit. It's worse than a fucken casino. A casino at least has its odds there for you to see.\n\nThis is wild. They'll pump it up, and then drop it. Cashing in both sides. \n\nIt's fucken annoying. 😑", "score": 2, "replies": []}, {"body": "They're just headlines. Teach the algorithms you won't be pulled in by those types of headlines and you won't reward the types of \"news\" outlets that publish that kind of stuff by not clicking or lingering over them and by explicitly indicating you're not interested in it when the option is available. \n\nI hardly see those silly kinds of headlines anymore since I started heavily curating my feeds.", "score": 2, "replies": []}, {"body": "Hell just watch WMT for a while if you don’t believe it is manipulated. I will be up 5k one week then down 7k the next with no news or anything impacting them. Just large scale investors taking profits", "score": 2, "replies": []}, {"body": "I'm invested in both and as long as they getting greens across the board on their earnings I don't understand anyone selling. Best thing is to just keep buying as both keep growing", "score": 2, "replies": []}, {"body": "The people who make money predict the stock market not the actual stock. They know when inside trading happens. Look at PLTR stock, one analyst gave it a low rating and it suddenly falls, people get scared and sell their shares and the stock drops and who buys it? Micron went down huge after quarterly earnings , it was a good evaluation however it did not meet expectations even though it met expectations lol. Guess what now people will sell and the stock will drop and will be bought up. It’s no accident.", "score": 2, "replies": []}, {"body": "It’s only option players that should be mad 😡 \nOr I should say here is the play going forward \nLoad up on options a couple weeks and or days before earnings set price target 10-20 percent above current price and sell just after strike price is reached. Then switch to covered calls until next earnings. Only one quarter  out of last 9 has this failed.", "score": 2, "replies": [{"body": "Yea.  Option traders or purchasing on margin...", "score": -2, "replies": []}]}, {"body": "MU is such a disappointment 😔😔", "score": 2, "replies": [{"body": "Not if you bought in early enough!", "score": 2, "replies": []}]}, {"body": "They’re just crybabies.", "score": 1, "replies": []}, {"body": "Institutions come up with all sorts of crazy stories to short the stock to give retail traders an excuse as to why", "score": 1, "replies": []}, {"body": "Hey man you’re not wrong about the cabal. But it’s also the same cabal responsible for buying it up. So price is driven by the market, and the market is driven by cabals. ☕️😋", "score": 1, "replies": []}, {"body": "It’s over!", "score": 1, "replies": []}, {"body": "Investment 101. Welcome to investing.", "score": 1, "replies": []}, {"body": "“Free market”", "score": 1, "replies": []}, {"body": "Like when the Saints won the Superbowl after Katrina. Everything is controlled by someone (s).\n(r/unpopular opinion)", "score": 1, "replies": []}, {"body": "Who gives a shit, buy and hold.", "score": 1, "replies": [{"body": "Yea that's not the point.  I've bought in 2020 and still holding - not complaining about price fluctuations.   Is reading comprehension one of your skills?\n\nI'm pointing out the folly of selloffs for sympathy of another company.   Collusion by a group of investors and how it'd be nice to be on their \"list\" when they decide to sympathetically make a move because another stock had issues during their earnings release.\n\nRead son.   It can be dark down in mommies basement so bring some light with you.", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "But it had a runup right? Big money all ways sells of leaving you holding into a dip. They will simply buyback after selling off. Thats one reason Options are risky.\nMu is fine. Buy the dips and hold long. I bought 150 more nvda today.   750shares! \nI did have my finger on the MU trigger but did not pull it. I will likely regret it unless the higher inflation rate hits sooner rather than latter", "score": 1, "replies": []}]}, {"body": "Sorry OP, it's my fault. I bought some more shares, that's what has been causing the drop.", "score": 1, "replies": [{"body": "Don't apologize to me I'm not losing anything.  You only lose when your options decay or you sell at a loss.\n\nBeen in since 2020 and staying in until retirement in 15 - 20 years.", "score": 0, "replies": [{"body": "How are you 40 years old and still this childish", "score": 1, "replies": []}]}]}, {"body": "It appears many here in this sub need to learn a thing or two about CAPM and efficient markets.", "score": 1, "replies": []}, {"body": "Hmm I wonder if amc will “sympathy” moon with gme then", "score": 1, "replies": []}, {"body": "Be patient i just enter in march and may. Im around 30 or 40% gain those positions way before earnings.  We are about a month and some days to the earnings date.", "score": 1, "replies": []}, {"body": "If you truly believed that some Trilateral Commission-like cabal of big investors was manipulating the market, then why on earth would you invest in publicly traded stocks? \n\nThe market moves by virtue of the famed \"invisible hand,\" the hundreds of thousands of decisions made by investors, big and small, around the world – *and moves randomly.* Commentators *have to comment –* so they come up with plausible, and possibly even accurate, ideas about what *might have affected the stock price.* But they cannot know. You cannot know.\n\nAnd, as many others have said, if you believe in the stock (and that's quite reasonable), then why would you care what it does in one day? One day's movement up or down is noise and *is irrelevant to long-term investors.*", "score": 1, "replies": []}, {"body": "Oh FFS. You guys are becoming indistinguishable from the GME crowd.\n\nListen to yourself. “MMs colluding to suppress.” The CEO was revealed to have dumped a ton of shares. Now other insiders are dumping. I’m not suggesting they’re running for the hills. Maybe they want to have some liquid capital for personal reasons. Who knows?\n\nBut to suggest that a company that was running a daily RSI of >80 for multiple consecutive days that had doubled its market cap in a few months which also saw insiders dumping loads of shares is actually some sort of conspiratorial attack on an “undervalued” stock is just silly.", "score": 1, "replies": []}, {"body": "Next 12 month only \"buy\" for NVDA", "score": 1, "replies": []}, {"body": "It is 👌", "score": 1, "replies": []}, {"body": "Chill out dude. Your brain is latching on to patterns in the random stock movements and doing what it evolved to do: to attribute those patterns to some agent endowed with both ability and purpose, instead of attributing them to the collective push and pull of the very many actors that make up the stock market.\n\nNot saying that some stock movements aren't caused by agents intentionally moving the price in a particular direction, but to ignore the many other actors that make up the market seems ridiculous. How many outstanding shares does NVDA have anyway, and how many do you think you would have to short or buy to move the price in a particular direction?\n\nThe irrational overly exhuberant posts I see on NVDA here terrify me. You expect NVDA to do nothing but rise and then blame some incognito agent for the (very modest) drop when investors see signs in the broader industry that things may not be as rosy as the high NVDA valuation demands? If we do enter a bubble and it pops, I fully expecting you all to ignore the reality, try to catch the falling knives, and blame your incognito agent of choice for purposely manipulating the market.\n\nIf the stock market was the weather, you would blame the thunderstorms on some untraceable agent for purposely unleashing destruction on a perfectly fine community and probably attribute all sorts of ill intent to that agent---when in fact there is no agent but just a complex dynamical system with lots of interactions between air pockets to give rise to the thunderstorms. No agent required.", "score": 1, "replies": []}, {"body": "Ppl who shorted nvidia a lot at 130", "score": 1, "replies": []}, {"body": "\"NVDA is going to the moon!\"  \n\n\nSays who? Who makes up these rules?!? I swear it's an inside cabal of collaborating Reddit traders manipulating the daily movement on a stock.", "score": 1, "replies": []}, {"body": "Just HOLD!!!!", "score": 1, "replies": [{"body": "Oh yea.  I wouldn't sell if it dropped to 75.  Id sell off the kids to buy more at that point.\n\nMy only point of this post which seems to be lost among a few was to point out the stupid reasoning used by whoever as to why it went down.", "score": 2, "replies": []}]}, {"body": "every stock specific subreddit devolves into yelling about CRIME AND THE SHORTTSSS even stocks that are up 100’s of % \n\nwhat a phenomenon", "score": 1, "replies": []}, {"body": "I learned a long time ago that when my broker called with a play that it usually meant great results for a month or two then the bottom would drop out. They use retail investors to make institutional investors rich as they say we are the dumb money.", "score": 1, "replies": []}, {"body": "whales want to eat cheap", "score": 1, "replies": []}, {"body": "These big money players are the ones who inflated the stock to begin with, what's your point? You are just along for the ride, you are aware of that right? \n\nRetail investors are just pissing with the wind hoping it doesn't change direction on them in an instant leaving them with piss all over themselves.", "score": 1, "replies": []}, {"body": "You never see these posts when NVDA skyrockets from bullish news from TSM, SMCI, DELL etc.\n\nSTFU and learn to have patience jesus christ", "score": 1, "replies": [{"body": "Patience??  Lol.  Been in for over 4 years with no end in site so WTF you running your mouth about??", "score": 1, "replies": []}]}, {"body": "Nvdia is in sympathy with all ai related companys rn", "score": 1, "replies": [{"body": "Fair point.", "score": 0, "replies": []}]}, {"body": "We'll likely see 116 before any significant uptick. In any event, I'm holding.", "score": -4, "replies": [{"body": "If it goes to 116 holy I'm buying a boat load 116 is an amazing price", "score": 6, "replies": [{"body": "Yeah that's stock up time for sure", "score": 3, "replies": []}, {"body": "I'm sure that we'll see below 120 again at some point to work off some of the overbought status and to grab liquidity. I'll load up in the 110-117 range. Not sure we'll get to the 110 range but i'd love it if we could lol", "score": 1, "replies": []}]}, {"body": "Looks like you want it to go to 116, so you can add more; nothing wrong with that, but wishing it goes down and making a statement that it will go down there are two different things..", "score": 2, "replies": [{"body": "I *don't* wish it to go down, that's where I see the next meaningful level of support and an impending ema/sma crossover says it will likely go down.\n\nI didn't say will. I said likely. Statistically I'm correct if this crossover finalizes and doesn't reverse. It may not happen. It was still likely. Which was what I said.", "score": 2, "replies": []}]}, {"body": "Your estimate turned out to be right, reached down to 118 today/no news. Kudos👍", "score": 2, "replies": [{"body": "Hopefully we can get a bounce here....otherwise we're looking at possibly dropping to 110 and I don't have much cash left to throw at it without getting my exposure percentage out of whack.\n\nAlso, for what it's worth, your kudos means more that the downvotes I got for saying 116.. Upvote for you.", "score": 1, "replies": []}]}, {"body": "If you're DCA there is no bad time to buy", "score": 1, "replies": [{"body": "Yep. I buy more twice a week. Mondays in HSA and Tuesdays in taxable.", "score": 2, "replies": []}]}]}]}
{"title": "Calls on NVDA worth it?", "selftext": "Professional option traders or experts what do you guys think call options on NVDA for Jan/17/25 @150 with premium about $12 per contract? I think 150 is a target set by many analysts and I still think it has room to get there. Of course a lot of profit taking and juicy are gone now so it won’t be explosive as before but there’s still some meat left for the last bite. Is risk/reward making sense for you guys? Looking to load it heavily if it has a decent chance.", "id": "1dpwx3s", "created_utc": 1719509250.0, "score": 26, "upvote_ratio": 0.67, "num_comments": 138, "comments": [{"body": "You're going to get differing views because nobody knows the future.\n\n\nAs the other guy wrote, your breakeven is $162. If you truly believe it can climb 30% by expiry, valuing the company at almost 4T, then go for it.", "score": 73, "replies": [{"body": "Talking heads on my television day Nvda will be back to 1k by the end of 2026 so roughly $30 per month for the next 2.5 years. \n\nOP will be rich. \n\nVirtually impossible to go tits up.", "score": 26, "replies": [{"body": "Kramer recommends this stock", "score": 5, "replies": [{"body": "So, buy puts? 😂\nNVDA is going negative.", "score": 8, "replies": []}]}, {"body": "*literally can't go......", "score": 2, "replies": [{"body": "I knew I screwed it up when I wrote it lol", "score": 2, "replies": []}]}, {"body": "Nope. I mean if you look at the volatility in the stock you can totally see it trade sideways until 2025 and then go up 100% by 2026. But in that case your Jan 25 calls are expiring worthless and you've just added $12 to your breakeven on your 2026 calls. Timing is everything. Will NVDA go a lot higher? Sure. Will it go up 30% by Jan 25? Unlikely.", "score": 2, "replies": []}]}, {"body": "That’s not entirely true about breakeven. That’s breakeven at expiration. The overwhelming majority of options are not held till expiration.", "score": 21, "replies": [{"body": "Yeah, I know that. He immediately makes money if it goes up, but it's always good to keep the breakeven in mind because at any point in time, when he's down on the trade, he has to evaluate if the breakeven is possible by expiration to actually guarantee a profit just on intrinsic value. I used to buy options only if I believed it could reach my breakeven because fighting theta is a second battle within the war haha.", "score": 10, "replies": [{"body": "Ya I don’t care at all about break even. When I buy an option I have a profit target and stop loss. If option goes down 25-50% (depending) I’m out. \n\nWith options you can be right about direction and magnitude but wrong about timeframe and lose a lot of money. And that really sucks.", "score": 7, "replies": [{"body": "Ya, but see, you have a plan. Others don't. Hahaha! :)", "score": 2, "replies": []}, {"body": "Just switch it up and sell options. When you sell puts....your starting with a 66.6% chance of being correct. (Both staying sideways...and going up....are good for your put. You only lost if it drops)", "score": 1, "replies": []}]}, {"body": "How does it work, value before breakeven?\n\nFrom what I was understanding, because you pay the premium for the contract, that's factored into the required sell price in ordder to make your money back. Why would something like that not be applicable? \n\nSorry for the silly question. I've just been dipping into options recently and trying to learn.", "score": 1, "replies": [{"body": "Option prices move up and down throughout the day. So you can make money before it reaches the breakeven price.", "score": 2, "replies": []}]}]}]}, {"body": "Unless you think it can go to 174 or more I wouldn't even consider it. Say you think there is a 50% chance it goes to 162 by expiration that's a negative EV play. And most likely you're overestimating the chance it goes there. Personally I'd have to have moderate to high confidence it could go to 175 by expiration before I'd even consider such a trade.", "score": 3, "replies": []}, {"body": "It’s such a volatile stock, though, that it could very easily be over $150 by the end of next week..in which case, OP can flip it for a fast (and huge) profit. So, in complete agreement with your first statement - there are a hundred different ways to approach this and none of them are necessarily wrong since nobody knows the future (except for u/TastyFennel540 ).\n\n*edited*", "score": 6, "replies": [{"body": "It wont be 150 by the end of next week, maybe 140 at most.\n\n150 ! no", "score": 3, "replies": [{"body": "I'd be happy with a cool 134 🥲", "score": 10, "replies": [{"body": "God, me too...", "score": 3, "replies": []}]}, {"body": "lol, I edited my comment. But even at $140 - buying a call at that premium is a stupid easy flip. Wait for it to drop and buy back low.", "score": 2, "replies": []}]}]}]}, {"body": "Considering that you'd be sitting across 2 ERs, that's not a bad deal, provided it pops on at least one of those ERs.\n\nI have a handful of those, so watching keenly", "score": 8, "replies": []}, {"body": "I’m pretty bullish about Nvidia, but I think the near term looks like it may entail more range restricted fluctuations and potentially another pullback at some point, largely in the absence of major catalysts. I’m not an expert on anything whatsoever, so don’t listen to me, but that’s just how I see it.\n\nEarnings are looking likely to remain strong for at least another few quarters, but the higher it goes, the more investors are going to search for warning signs. I think their networking sales may be one of the next scapegoats, as hyperscalers are going with Broadcom more frequently from what I’ve read.\n\nIf you’re going to go with calls for $160, maybe consider a calendar spread so you can at least offset with some premium along the way.", "score": 8, "replies": [{"body": "I think the main plateauing is due to people taking profits at a point in their lives / careers where they want a house, a new car, or even just to diversify because Nvidia suddenly comprises 75% of their portfolio instead of 20%, which was already a huge chunk but probably made sense for employees.", "score": 6, "replies": []}, {"body": "$150 not 160…. I get what you are saying tho… 10 pts is huge difference so just wanted to point out.", "score": 3, "replies": [{"body": "Yeah my bad there. $150 is ofc much better.", "score": 1, "replies": []}]}]}, {"body": "Your break even is 162? I'd say no way", "score": 12, "replies": [{"body": "Theoretically yes the break even is 162 but this stock has ridiculous IV you don’t even have to wait it out to take profit. Let’s say if the contract has some time left and if it’s near 150 then I think you can squeeze out with some profits.", "score": 6, "replies": [{"body": "80% of options expire worthless. You do you, but only gamble money you can afford to lose", "score": 14, "replies": [{"body": "I mean to counterpoint, you just reiterated what OP said, which is to sell before expiration. 80% expire worthless, not 80% are always worthless.", "score": 10, "replies": []}, {"body": "95%", "score": 2, "replies": []}, {"body": "So based on your calculated risk/reward profile it doesn’t make sense to execute this option? Just asking.", "score": 2, "replies": [{"body": "Buying options that far OTM is almost always a bad idea. You need to be 100% sure of it reaching that target; if you're not, you need to buy ITM options to limit your exposure to risk. \n\nYou sound very much like you don't know what you're doing, so buying OTM options is something you should absolutely avoid; you don't sound like you know about IV loss or anything else. \n\nBuying long-dated ITM options for stocks you're very positive about is fine-ish for people new to options; NVDA is getting into some very volatile areas though, so it's not super suited to beginners. The volatility has increased the price, and that volatility might go down while the price steadily climbs, meaning with your OTM options you could lose on two fronts while still being \"right\": if the price doesn't reach high enough fast enough, and if the IV falls enough.", "score": 4, "replies": [{"body": "Absolutely agree with your last sentence.", "score": 2, "replies": []}]}, {"body": "Do you mean exercise or buy?", "score": 3, "replies": [{"body": "Buy or place a bet", "score": 2, "replies": [{"body": "I would not, but I only touch one stock, so I'm not the best person to ask", "score": 0, "replies": [{"body": "Which stock and why?", "score": 1, "replies": [{"body": "GME, and that list is quite long", "score": 6, "replies": [{"body": "I agree that if GME is the only stock you trade then you're definitely not the one to ask. Which no one did. So why did you respond?", "score": 4, "replies": [{"body": "Because I'm a financial analyst (not advisor) and know how to trade options", "score": 3, "replies": [{"body": "So do I but I don't see what knowing how to trade options has anything to do with it. The question is about predicting NVDA future value, not how to place a trade.", "score": -1, "replies": [{"body": "You seem mad at me for replying with my opinion... Stop wasting both our times", "score": 3, "replies": [{"body": "Not mad at you, just skeptical of ape opinions.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nice", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Myth. More like 30%", "score": 0, "replies": [{"body": "https://pro.thestreet.com/investing/options-expiration-day-reminds-us-time-really-is-money-16118647#:~:text=Generally%20speaking%2C%2080%25%20of%20options,market%20closes%20on%20expiration%20day.", "score": 1, "replies": []}]}]}, {"body": "The price range is 180+ for Jan 2025.", "score": 2, "replies": [{"body": "Based on what and whom?", "score": 1, "replies": [{"body": "The expected move for Jan 17 2025 is +/- 49.33, so if that move is all in the positive direction you get 174.00. If it's only partially in a positive direction, 150 isn't unrealistic.", "score": 0, "replies": [{"body": "That’s not how it works dude", "score": 2, "replies": [{"body": "Whatever, dude, that's probably where the 180 number came from.", "score": 1, "replies": []}]}, {"body": "The only thing it says is the market expectation at this time. It’s not even guaranteed to stay within this range", "score": 1, "replies": [{"body": "I know, but expected move seems to be where the 180 number came from.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Ask your magic 8 ball.", "score": 3, "replies": [{"body": "Unfortunately I only have 2 balls,,,, very sad", "score": 4, "replies": [{"body": "Just attach those two and you got a 8 shaped one. JK", "score": 1, "replies": [{"body": "Damn that’s correct can’t deny lol", "score": 2, "replies": []}, {"body": "Turn that sideways…..  infinity balls!!", "score": 1, "replies": []}]}]}]}, {"body": "honestly, it's hard to say.  You could buy a few and set scales as you come into profit. These kinds of trades become very personal bc of how they might fit into one's account.  No idea what your account size is. If you aren't really sure and you want less risk I would buy a closer dated NVDA option.  Generally speaking a stock tends to go a bit sideways for some time after a split so no need to rush into anything. NVDA dropped to 115 from 141 .... could a $26 drop happen again? ... yes. .. don't be silly and YOLO anything", "score": 3, "replies": []}, {"body": "Why not ITM options like 120? You can get gains anyways if the stock price goes up.", "score": 3, "replies": [{"body": "Yeah but that’s way too expensive compare to 150", "score": -2, "replies": [{"body": "I don't consider these \"expensive\". Say you want to invest $20k. You buy any of these calls for $20k. If the stock goes up, they will go up, no matter what strike you bought. With ITM calls, you may get less gains but less risks also.", "score": 3, "replies": [{"body": "ITM has implicit value and OTM does not, you get what you pay for.", "score": 1, "replies": [{"body": "Intrinsic value.", "score": 1, "replies": [{"body": "Yes, that’s a better term for it.", "score": 1, "replies": []}]}]}]}, {"body": "Resuce cost by selling puts and synthetic calls", "score": 2, "replies": []}, {"body": "Also think about why auntie Pelosi bought deep ITM calls for her positions.", "score": 1, "replies": [{"body": "She rich I ain’t", "score": 2, "replies": []}]}, {"body": "Expensive is a mindset. If you lose it all then yours were way too expensive than buying in the money options. I used to make that mistake. Now I only buy itm options with a certain delta. It’s been working great.", "score": 1, "replies": []}]}]}, {"body": "So, this seemed like a thing to do:  Bought 20SEP24 115 CALL against MU this morning.  I’m going to sell .2 delta weekly calls until the 1st week of SEP.   I think this will make some $$.  Maybe a similar play exists for NVDA?", "score": 2, "replies": [{"body": "How so? U meant 9/20?", "score": 1, "replies": [{"body": "Ooopps….  Yea.   20SEP24.", "score": 1, "replies": [{"body": "How you came up with the strike price? What logic?", "score": 1, "replies": [{"body": "It is a “Poor Man’s Covered Call” or long diagonal.  Buy an in the money call dated 90 or 180 or 360 DTE and sell shorter dated calls, using the long dated call as protection.  0.7-0.8 delta is close enough to ATM to maintain some liquidty while not being horribly susaptable to theta.  Of course, as price moves, the greeks will move as well.  It is a bullish position meant to behave and profit the same way as owning the shares for far less capital invested.  \n\nSMB Capital, Options Play or the Schwab Edcuational Vids on You Tube explain the strategy well.  Maybe do some research and play around papertrading one?  \n\nAlso, 115 looks to be a nice support level for MU. \n\n🍻", "score": 2, "replies": [{"body": "Interesting thanks for info. Will look into it", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think you’ve got a good shot to profit, but not necessarily be in the money. \n\nI think a big risk you’ve got to deal with besides the usual “Ai bubble” talk is the threat of more war. I, personally, don’t see us going to war with Russia but a lot of people are predicting it. The only reason I mention that sort of thing is if the world is preoccupied in Eastern Europe, China can do whatever they want with Taiwan. \n\nI don’t think we will go to war, and I don’t think Chins will either right now. But it’s the fear that will make semis like TSM drop, and NVDA has ties directly to it. Maybe I sound crazy, but a long call that 7ish months to go has two earnings reports, a presidential election, and two more potential international conflicts on the horizon. \n\nWith that said. Print this man his money.", "score": 2, "replies": []}, {"body": "I need it to be $150 by January 2026 haha. 2025? That’s a lofty goal imo but depends on the next two quarters of earnings data of course.", "score": 2, "replies": [{"body": "144.50. 10.21.24", "score": 2, "replies": []}, {"body": "$150 2026? What premium did you pay? That fucking expensive contract damn", "score": 1, "replies": [{"body": "Technically I sold the 150s… I bought a Jan 2026 950/1500 debit spread before earnings in May for about $14,900. Now I have ten 95/150 spreads. Up about 60% but max profit is 40k", "score": 2, "replies": [{"body": "Nice", "score": 2, "replies": []}]}]}]}, {"body": "Personally, I would reduce my risk exposure somewhat and go slightly more ITM like 130-140. I know that return ain’t as sexy but if nvda does shoot up and your option is way in the money then you’re still profiting big. Alternatively, idk how many contracts you planned on buying but you could always buy shares, and then just trade nvda options more short term. That’s what I’m doing. Every time Nvda has dropped I just buy more shares, and then just trade it daily based on the trends.", "score": 2, "replies": []}, {"body": "I got calls jan/17/25 @235 premium is like $2. I plan on selling them once they print some  premium", "score": 2, "replies": [{"body": "235 is just way to high and I don’t think it will hit that but on the meantime you are just trying to get some squeeze out of premium so I get you", "score": 2, "replies": [{"body": "I always try to squeeze premium. I printed 300% on cheap ass amazon calls i bought yesterday.", "score": 1, "replies": [{"body": "So how does it work and what’s your logic and how you play?", "score": 2, "replies": [{"body": "I bought amazon calls $210, $220, and $235 calls yesterday. The higher the price the further the expiration date. The most i paid for premium per contract was .05. Look at amazon the last week theres been huge gains. I try to buy cheap contracts when the price is climbing and they have been hitting at least 100%. I bought 20 contracts for my $210 call sold 5 to cover my price paid for all 20, sold another 10 for profit and held last 5 till close and still made decent profit. Im trying to follow my own method of cheap and long with NVDA, gives me plenty of time to catch the dips to lower my cost of contract. I’m spread across the board with calls all the way to January. Personally i think Nvidia will be insane gains in the next few months, but i have yet to see. Im no expert Im just throwing shit at the wall to see if it sticks.", "score": 0, "replies": [{"body": "0.05 per contract is what I actually wanna pay for trading contract but at the same time since the premium is so low the chance to hit is unlikely even if the price goes up. But I see what you are doing there. As far as expiration, how far out you doing it? You have some sort of like standard protocol you follow?", "score": 1, "replies": [{"body": "No protocol yet. I started literally writing a doctrine for myself but i haven’t figured out my timeframe yet. Currently I’m as far as 7 months out but i have contracts for every single month. But the most spending on those is $1 premium, i refuse to go over $1.5 thats too much. I am getting burned from theta tho, which is the issue with long balling it, but I’m not missing potential gains. Im finding it a-lot easier to manage the funds because instead of stressing about losing my ass on every single contract all at once instead i can get fucked one at a time. I really only need 1 to hit out of the 7 or 9 contracts i have to break even. We were looking at something like 20% gain per month for nvidia before this correction period. If i can wait it out one has to hit. And if this works i know my doctrine will work.", "score": 1, "replies": [{"body": "Interesting theory but I see what you are trying to do…. Yeah anything under $1 is what I want as well.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "There's a critical resistance at $140 that we got pushed off with strength.   \nI'm still holding my shares, but on the monthly chart next support is around $75. \n\nLooks like VOL is thinning out and next week will be sideways, non-event due to 4th of July. \n\nI like the expiration on those $150c and it's not a bad play, per se...   \nJust think it's worth mentioning that our next range bottom is $118 with room to $108. \n\nThat being said, you could wait and watch for support test at those levels for high-efficiency adds on that contract.", "score": 4, "replies": []}, {"body": "$1200 per contract, is a boat load of $$..", "score": 1, "replies": [{"body": "I know. NVDA is fking crazy one fking contract is $1200…. Apparently it’s rich man’s game… I am speechless how people trading like thousands of these.", "score": 1, "replies": [{"body": "Institutions have large portfolios bud. It’s mind blowing relative to retail investor portfolios.", "score": 1, "replies": []}]}]}, {"body": "Yes.... But possibly, no.\n\nI hope this helps.", "score": 1, "replies": [{"body": "No", "score": 1, "replies": []}]}, {"body": "Is Jensen still selling?", "score": 1, "replies": [{"body": "I think he’s done with it but regardless don’t matter he can do whatever he pleases", "score": 2, "replies": [{"body": "Jensen is worth $60B (I believe solely from his Nvidia equity) — does it matter if he sells $30M of stock? It’s literally a drop in the bucket for him and gives him liquidity. I’d be concerned if he sold $30B, not $30M.", "score": 1, "replies": []}, {"body": "Which is why NVDA has the 1,000 ft pole for me. I’m ok “missing out” on that one haha", "score": 0, "replies": []}]}]}, {"body": "How many contracts do you plan on buying? If it’s just a long play on NVDA you’d be much better off buying a little over half of the contracts and going long the Jan 123 calls for 21.25. You would have the same amount of capital and risk but your break even price would be $144.25 as opposed to $161.70. With whatever amount of capital you’re using you could also buy more contracts of the Jan 123-150 call spread for $9.70 with a max profit of $17.30 which would be a little under an 80% ROI in 6 months, not bad. I’m pretty sure everyone on this board would love to make annual 160% returns. I honestly think NVDA is going to the moon, I personally think that within 2 years NVDA will have a $5 trillion market cap which would put the stock around $200. Right now they have an 80% market share and they are a metric fuckway ahead of any competition. JMHO. MAQ", "score": 1, "replies": [{"body": "40-50 contracts. Which is why I am meticulous on this and trying to do analysis as much as I can with all of information available. AI hype is real and I really underestimate all these years. On the meantime, I gotta figure out the option strategy which will have the best risk/reward.", "score": 1, "replies": [{"body": "Okay, so instead buy 30 contracts of the Jan 123 calls for $21.25. Your break even will be $17.45 lower than buying the 150’s. Actually if you are looking for the best risk/reward you could buy 60 Jan 123-150 call spreads for $9.70, if the stock trades $150 or over then you’d make close to 80%, you’ll make money if the stock trades over $132.70 as opposed to needing the stock to trade over $161.70 with the 150 calls. To make the same return as the call spread with the 150 calls you would need NVDA to trade over $171, Just sayin. MAQ", "score": 2, "replies": []}]}]}, {"body": "Yes", "score": 1, "replies": [{"body": "All day, every day and twice on Sundays", "score": 1, "replies": [{"body": "No twice on Sundays", "score": 1, "replies": []}]}]}, {"body": ">I think 150 is a target set by many analysts\n\nFinbox says:\n\nAnalyst Targets\n\n50 targets\n\nLow $85\n\nHigh $200\n\nAverage$131.78", "score": 1, "replies": []}, {"body": "I was looking at buying NVDA  1-25 130 strike and Selling  150  debt for $650.\n  136.50 BE.    Max Profit 1350.00 \n   I’ve only bought  call option on TQQQ a couple years ago .", "score": 1, "replies": []}, {"body": "I see often “OP” here. What’s “OP”?", "score": 1, "replies": [{"body": "OP /Original Poster (Original person asking or giving said question/opinion for the post.", "score": 1, "replies": [{"body": "Thank you. Now it makes sense when I read it. Lol", "score": 1, "replies": []}]}]}, {"body": "Yeah man, go for it. Buy the stupidest shit you can think of", "score": 1, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "How bout I sell the option to you and we'll see if it's worth it.", "score": 1, "replies": []}, {"body": "Its in a consolidation phase with resistance at 127ish and support at 121. I’d wait for it to consolidate a bit before rebuying in especially options", "score": 1, "replies": []}, {"body": "Hell no. Did you not see the 50k+ contracts that were fucked on 6/21? No?", "score": 1, "replies": []}, {"body": "Eh I'd be waiting to time for downside", "score": 1, "replies": []}, {"body": "One week ago those calls were 20 so seems like it has a lot of potential", "score": 1, "replies": []}, {"body": "Yahoo finance had a a story interviewing  a “hedge fund” with a 100% gain yr end price target. Said fund has $3M aum. lol. NVDA sales per employee per mkt cap is $100M at this point. Meta is around $15M", "score": 1, "replies": []}, {"body": "FYI there’s no “professional option traders and experts.”\n\nSo id start there, and just make your own decision.", "score": 1, "replies": []}, {"body": "Yes, until the next earnings it is.", "score": 1, "replies": []}, {"body": "Aapl,msft,AMZN,googl make around 40% nvda revenue, Imagine if one decides to scale back on theyr AI investments.\nEven if they don't, I can't see nvda having beating 200% rev growth YoY for many consecutive quarters", "score": 1, "replies": []}, {"body": "I'm gonna be real with you, and not to disparage the others who've commented here, but the answer is pretty obvious to me. You said it yourself, the premium is MASSIVE. It looks to me like hedging on a massive scale has propped this stock up, it is very much a bubble. Ideal circumstances are to get in when the option chain is low or decent premium and demand is low. IMO that option chain has already reached critical mass, don't waste your time. Look for opportunities elsewhere. If anything, sell contracts on this one, don't buy.", "score": 1, "replies": []}, {"body": "Wait till closer to earnings, then buy a few puts just in case and way more calls!", "score": 1, "replies": []}, {"body": "I'll sell you all the NVDA250117C150 contracts you want 😉", "score": 1, "replies": []}, {"body": "150 PT is a 1-year target. if so, I would go longer out and deeper ITM", "score": 1, "replies": []}, {"body": "Honestly no one knows the future, I have the opposite position as you (3/21/25 120p), but it can go either way. It all comes down to how you’re evaluating NVDA’s current price. Just prepare to lose money if you it doesn’t go your way.", "score": 1, "replies": [{"body": "I think the current price is ridiculous in my honest opinion but what I think doesn’t matter. In fact, I’ve been thinking the price for NVDA is fucking ridiculous since like 2022. Look how it went against my wills.", "score": 1, "replies": []}]}, {"body": "Do it and see what happens", "score": 1, "replies": [{"body": "Would u?", "score": 0, "replies": [{"body": "Nope but that doesn’t mean you shouldn’t.  If you want to go for it that’s up to you", "score": 2, "replies": []}]}]}, {"body": "IV too high. Gonna trade sideways and eventually down once the market realizes none of these companies have actual AI. Also, imagine the compute once Quantum computing becomes the main method of large data banks (needed because of energy) and that’s where NVIDIA will either buy up everyone or lose market share.", "score": 0, "replies": []}, {"body": "What’s the thesis? If you do individual calls thinking “premium is juicy” you are essentially gambling", "score": 0, "replies": [{"body": "Premium is not juicy because I am paying for it not collecting it so it’s against me", "score": 2, "replies": [{"body": "If you are buying options you have an intrinsic disadvantage because the premium is overstated on expectation. I would argue that it is possible to make money buying options, but it's definitely much harder. \n\nIf you are thinking that premium looks cheap, you do not have a consistent edge and you are still gambling (even though I got what you were doing backwards :) )", "score": 1, "replies": [{"body": "NVDA premium is never cheap. I am betting that NVDA will go up and hype is not over yet although the growth won’t be as explosive as before but it still has some juice left.", "score": 1, "replies": [{"body": "That’s nothing more than trying to read the tea leaves. You are just gambling", "score": 1, "replies": []}]}]}]}]}, {"body": "Have an exit plan. Will you hang in if it drops 10%, 20%, 30%. Under what circumstances would you sell 50% of your options and let the rest ride? When does it make sense to buy puts if you decide to hold through a trough? Can you stick to an exit plan if you make one?", "score": 0, "replies": []}]}
{"title": "$TSLA Daily Thread - June 27, 2024", "selftext": "Fun chat. No comments constitute financial or investment advice.  ⚡", "id": "1dpgi1p", "created_utc": 1719455409.0, "score": 24, "upvote_ratio": 0.9, "num_comments": 224, "comments": [{"body": "mourn support divide light point price elastic piquant disagreeable dime\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 11, "replies": [{"body": "I really like this guy. \n\nHe should replace Biden, like, tomorrow.", "score": 2, "replies": []}, {"body": "That was impressive.", "score": 1, "replies": []}]}, {"body": "The judge who scrapped Elon Musk’s $56 billion Tesla Inc. pay package will hold a hearing on whether a recent shareholders’ vote to revive the deal should affect her decision.\nDelaware Chancery Court Judge Kathaleen St. J. McCormick has no legal obligation to recognize the results of the June 13 vote, but she can choose to take judicial notice of the development. She said Thursday she would hear arguments on whether she should in late July or early August.\nIf McCormick does take judicial notice of the vote, she could theoretically rescind her Jan. 31 decision finding that the board that approved Musk’s compensation was “beholden” to the billionaire and not looking after shareholders’ interests. Tesla has argued that the vote addresses many of the concerns McCormick raised in her decision.\nAt the very least, the ruling will further delay the six-year-old case. McCormick has to issue a final ruling before Musk can appeal it to the Delaware Supreme Court.", "score": 10, "replies": [{"body": "https://preview.redd.it/gl13gwkt479d1.jpeg?width=959&format=pjpg&auto=webp&s=48a650b4c30abd47cb36ed131703be4e36c7505a", "score": 6, "replies": []}, {"body": "Watch McCormick quite literally delay her decision forever just so Elon can never get another comp package ever again", "score": 2, "replies": []}, {"body": "When is this hearing?", "score": 1, "replies": [{"body": "aug", "score": 1, "replies": []}]}]}, {"body": "Cyberbeast delivery on July 3 🥳", "score": 18, "replies": [{"body": "Gonna need some pics", "score": 3, "replies": [{"body": "Of course! Everyone is super excited!", "score": 1, "replies": []}]}, {"body": "congrats!", "score": 1, "replies": []}]}, {"body": "Oof Walgreens -23%", "score": 7, "replies": []}, {"body": "June has been good to us", "score": 7, "replies": [{"body": "Usually is", "score": 3, "replies": []}, {"body": "Long live June", "score": 2, "replies": []}]}, {"body": "SpaceX now valued over $200 Billion. At this rate they’ll over take Tesla soon enough.", "score": 14, "replies": [{"body": "Thunderfoot in shambles", "score": 6, "replies": []}]}, {"body": "Hoping the multiverse theory holds up, and theirs a version of me that's made better financial decisions, cuz i'm cooked, lmaoo", "score": 11, "replies": [{"body": "You still ok on the basics? Housing, food, insurance?", "score": 3, "replies": [{"body": "Yea, I was mostly joking, I appreciate it tho ❤️", "score": 4, "replies": [{"body": "Glad to hear it 😊\n\nI think (hope) most of us are pretty well-off considering everything and we should be thankful for that.", "score": 4, "replies": []}]}]}, {"body": "![gif](giphy|sKhl3kIaewOYRvh8Xr|downsized)\n\nI raise a glass in toast to rich King in the next universe over, Salud!", "score": 1, "replies": [{"body": "![gif](giphy|BPJmthQ3YRwD6QqcVD|downsized)", "score": 1, "replies": []}]}]}, {"body": "RJ detailing R2/R3 low-cost structure on the Rivian Investor Day right now: https://www.youtube.com/watch?v=NoOa25stPHI\n\nLooks quite impressive with a very Tesla-esque focus on cost savings in order to bring their mass market vehicles to fruition.\n\nI know there are a lot of Rivian skeptics in here due to financials alone, but as a company, their philosophy and focus is quite encouraging.", "score": 11, "replies": [{"body": "Leadership focused on evs, amazing.", "score": 4, "replies": []}, {"body": "good for -8%", "score": 0, "replies": [{"body": "Thanks for your contribution, Omar.", "score": 0, "replies": []}]}]}, {"body": "Whaaaat? Holy Balls! Too the Mooon!!!", "score": 7, "replies": [{"body": "![gif](giphy|cdNSp4L5vCU7aQrYnV)", "score": 4, "replies": []}]}, {"body": "Any chance we get updated musk incentive plan to 10T before robotaxi day \n\nAnd Roll out of driver assisted Tesla taxi app for Tesla owners  with updated details and timeline of robotaxj timeline in August", "score": 8, "replies": [{"body": "Give that man all the stock he wants for whatever bird he wants if he makes it a $10T company", "score": 3, "replies": [{"body": "That’s what they used to say about 1T", "score": 4, "replies": []}]}, {"body": "They change stated plans on a whim, why would you trust anything they plan. They are at show me not tell me stage of credibility", "score": 12, "replies": []}, {"body": "any detail regarding app + timing would be a big win imo.  hoping it's not just concept reveal, will blow your mind when it comes, yada yada...", "score": 2, "replies": []}, {"body": "He should wait until those 1,000 robots are operating in the factory first, then people might take him seriously.", "score": 2, "replies": []}]}, {"body": "I was thinking about the vote and that graph Elon shared. All those votes that came on the last day feels automatic. Almost like funds that automatically vote board recommendations. Any ideas why it looked like that?", "score": 4, "replies": [{"body": "Institutions with big stakes play their card close to the chest and only vote on the last day on controversial votes\n\nI can guarantee that Vanguard, Blackrock, State Street, etc. all voted on the last day after they quietly conversed in smoky rooms\n\nEven most of retail supporting didn't really matter in the end, the only votes that matter are the big institutions\n\nThis is a condemnation of how corporate governance works too but nothing you can do about it, that's how Disney somehow beat their shareholder revolt earlier in the year. They had Vanguard and Blackrock on their side, no one else mattered\n\nAll the noisy minnows ended up not mattering, even KoGuan Leo", "score": 4, "replies": []}, {"body": "The managers probably barely even cared", "score": 2, "replies": []}]}, {"body": "I wanna open a 529 but you can't even buy calls w it. Lame.", "score": 5, "replies": []}, {"body": "Let's see Paul Allen's robotaxi", "score": 11, "replies": []}, {"body": "https://preview.redd.it/hcmpczj6069d1.jpeg?width=1114&format=pjpg&auto=webp&s=d945cbecce03d619e6efda3c07ab5aab3361fab0\n\nNot sure if this was posted.\n\nUnclear if he truly believes this or if it’s a pump.\n\n48-50x incoming 🤷🏻‍♂️", "score": 10, "replies": [{"body": "alex voigt elon baiting going well", "score": 9, "replies": [{"body": "“He’s just pumping the stock bro” upvotemeok\n\n![gif](giphy|10JhviFuU2gWD6)\n\nI think I’ll trust the billionaire landing rockets, but hey that’s just me.", "score": -3, "replies": [{"body": "At the same time the guy expressing reasonable criticism (ok maybe a little too often during the day for a healthcare professional)  might have a point, too. 🤷", "score": 8, "replies": []}, {"body": "Goosedry sees 1 billion robots, 10 million robotaxis 24trillion number and swallows it hook line and sinker. Starts doing math in his head and picking out his mars mansion.", "score": 12, "replies": []}, {"body": "https://preview.redd.it/9tmrt9x6679d1.jpeg?width=959&format=pjpg&auto=webp&s=7e7bdff5c3ce50ca44e57c8b92c56d8114b27c15", "score": 1, "replies": [{"body": "At least everyone in the lounge isn’t retarded. See you on mars my man 🤝", "score": 1, "replies": [{"body": "![gif](giphy|3oz8xQVHQyzcq47kXu)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "‘merica + $TSLA 🥰\n\nhttps://preview.redd.it/jnlo9d5p569d1.jpeg?width=4032&format=pjpg&auto=webp&s=6da55ac1cecd86c54e27ad3c5f3ee3f471ee3e07\n\nhappy Thursday TL", "score": 9, "replies": [{"body": "a little snuff, a little trident, a random clown lego... nice", "score": 5, "replies": [{"body": "and a 🐷, so fun", "score": 2, "replies": [{"body": "Does that clown have a penis?\n\nAlso, Copenhage ftw.", "score": 3, "replies": [{"body": "hmmm, also curious if that's a clown schlong", "score": 3, "replies": []}, {"body": "![gif](giphy|H5C8CevNMbpBqNqFjl)", "score": 1, "replies": []}]}]}]}, {"body": "Haha, you sure that phone isn't blocking your view though? Hard to tell from this photo. I put mine on a magnet on the center console right near my right hand. Doesn't obstruct the windscreen.", "score": 3, "replies": [{"body": "Yeah this looks absurd.", "score": 2, "replies": [{"body": "so does your mom", "score": -2, "replies": []}]}, {"body": "interesting and it does not obstruct \n\nhad to figure out a way to watch TV after getting NTHSA strikes ❌", "score": -2, "replies": [{"body": "> had to figure out a way to watch TV after getting NTHSA strikes ❌\n\n🤦‍♂️", "score": 3, "replies": []}, {"body": "I have a phone holder that goes into the vents behind the steering wheel. Not blocking the windshield and doesn’t have the problem you are describing…", "score": 2, "replies": [{"body": "![gif](giphy|tF8vMUeGUkHNTgCC4E)", "score": 0, "replies": []}]}, {"body": "I hope you're not seriously watching videos while driving? That sounds like a disaster waiting to happen. Stay safe.", "score": 1, "replies": []}]}]}, {"body": "How are those chickens doing!?", "score": 3, "replies": [{"body": "had to get rid of the head hen to the farm behind us as she was picking in the rest to much, but they doing good 😌", "score": 1, "replies": [{"body": "❤️", "score": 1, "replies": []}]}]}]}, {"body": "who had first post yesterday?! me!\n\nno respect\n\n![gif](giphy|Te0mQ7oWbqot5LpaTT|downsized)", "score": 9, "replies": [{"body": "🥇", "score": 1, "replies": []}]}, {"body": "![gif](giphy|1OzIQHJ6nc5Zm)\n\nI really hope once we go past 200 tomorrow we never see below it again but I know that's too much to ask.", "score": 12, "replies": [{"body": "The legend is back", "score": 11, "replies": [{"body": "He's outdone Bjorn and Snoo for sure", "score": 1, "replies": []}]}, {"body": "Mfer", "score": 7, "replies": []}, {"body": "nateleb: \n\n*wakes up*  \n\n“i wonder how many people i can infect with my unhappiness today? 🤔”  \n\n“better get to it, maybe ill trojan horse with some lotr gifs they won’t see it coming”", "score": 3, "replies": [{"body": "BUY HIGH SELL LOW", "score": 3, "replies": []}]}]}, {"body": "Congrats to amzn investors on 2tril club", "score": 7, "replies": []}, {"body": "disclaimers - i hate talking about politics, and yes I think Trump is a buffoon, but Jesus H. Christ --Biden right now looks absolutely lost and 100% senile right now, this is getting ugly", "score": 7, "replies": [{"body": "It's so tough to watch.", "score": 3, "replies": []}, {"body": "I'd say hit him with aome adrenaline but he'd probably stroke out", "score": 2, "replies": []}, {"body": "It just started chill out, his adderall takes a bit to hit", "score": 2, "replies": [{"body": "he needs some redbull and cocaine stat!", "score": 1, "replies": [{"body": "Gotta spit on that thang!", "score": 0, "replies": []}]}]}, {"body": "Gotta hawk tuah him", "score": -1, "replies": []}]}, {"body": "4.7 Mile trip in SF:\n\n•\tWaymo: $22.54\n\n•\tUber: $24.98\n\n•\tTesla: ????", "score": 5, "replies": [{"body": "Just slightly undercut, that’s all you need to do at the beginning, then once you want to expand TAM drop prices.", "score": 2, "replies": []}, {"body": "$10 or bust", "score": 1, "replies": []}, {"body": "$0 doesn't exist.", "score": -1, "replies": []}]}, {"body": "coiling", "score": 6, "replies": [{"body": "Coiling for our entire life.\n\n![gif](giphy|FoH28ucxZFJZu)", "score": 4, "replies": [{"body": "our great depression is our lives", "score": 5, "replies": [{"body": "We’ve all been raised on ~~television~~ Tiktok to believe that one day we’d all be millionaires, and movie gods, and rock stars.", "score": 1, "replies": []}]}]}, {"body": "Uh the greater the coil, the greater the hmmm", "score": 1, "replies": []}]}, {"body": "Oh now we know the reason for 12.4 delay.\n\nhttps://preview.redd.it/2z1bim9tn19d1.jpeg?width=1012&format=pjpg&auto=webp&s=f3293029aa0ebe679827bb749bcab8b38b085100", "score": 8, "replies": [{"body": "That quote makes no sense shouldn't the latest version always be the best", "score": -7, "replies": [{"body": "I doubt sade fsd is possible based on 1 car sensor alone. It will require cars communicating with each other. It is just BS in terms of taxis right now.\n\nUnless it is a big city with a bus/taxi lane type setup.", "score": 1, "replies": []}, {"body": "Should be but sometimes it's worse", "score": 1, "replies": []}]}]}, {"body": "Meet Kevin suing CNN over the presidental debate (also apparently not asking for cash, which is cool).\n\nCNN waited until the last second to announce that independent channels could NOT provide commentary. \n\nI'm wondering how this will go since I also heard it's a private event. I'm european and would like an american's view on the matter. Preferably the pokemon guy", "score": 6, "replies": [{"body": "O fuck time to buy CNN", "score": 0, "replies": []}]}, {"body": "Rivian gonna bleed away all vw gains in no time.", "score": 6, "replies": [{"body": "I hope so, as I sold yesterday.  Ticking up on 2nd half of the presentation, though.  \n\nCouple random, obvious,  thoughts: If they had balls, they wouldn't be comparing themselves to legacy but instead to Tesla.\n\nIf they can get to profitability, they're in.  Question is, do the have a real path to profitibility?  Looks possible.", "score": 1, "replies": [{"body": "There should be room for many winners in EV, if boomers had any idea how much better they are than ice.", "score": 3, "replies": [{"body": "True.", "score": 1, "replies": []}]}]}]}, {"body": "PCE MoM GONNA BE ZERO 🥶🥶🥶🥶🥶🥶🥶🥶\n\nPowell gonna watch debate tonight while crushing beers. Wakes up tomorrow to ice cold data.\n\n✂️✂️✂️✂️✂️ cutsssss\n\nBook it 🔥", "score": 6, "replies": [{"body": "Cold I can buy, cuts being announced? naw fam, they are going to stay to their current party-line of saying maybe later, uncertain, etc.", "score": 6, "replies": [{"body": "I think so too.  AI productivity is Bearish for cuts, which is bullish for wall-street I would say", "score": 3, "replies": []}, {"body": "Oh I mean like next move might be a cut with 2-3 cool PCE/CPI", "score": 2, "replies": [{"body": "Ok that maybe i can see", "score": 3, "replies": []}]}]}, {"body": "Sack Indicator has been money lately. All signs point to green 💪", "score": 4, "replies": []}, {"body": "Cuts will be sell the news at this point… It’s been what, 2+ years of buying the rumor?", "score": 4, "replies": []}, {"body": "![gif](giphy|3orieLeZL5kyNqiLfO|downsized)", "score": 3, "replies": []}]}, {"body": "tried to teach my mom how to use ai for photo correction a few weeks ago. it’s really easy\n\nwhat ended up happening is that now she sends me a photo a day asking “can ai fix this”\n\n\nover and over with nothing clearly wrong with the photo just asking if ai can do what she’s thinking and not telling me it’s really fun for me\n\noh and she doesn’t just ask she asks first if she can ask about a photo and THEN if i say yes then she asks\n\nno mom you don’t need an ai to make the dog less black for god sakes lord jesus help me\n\nshe keeps asking how she can know what an ai can do i just said pretend you’re talking to me i can do anything on a computer and they’re pretty much the same. i think there was a miscommunication and now i represent ai to her", "score": 4, "replies": []}, {"body": "Options whales not gonna let us face rip", "score": 5, "replies": [{"body": "Prob need a decent p/d to beat 200", "score": 1, "replies": [{"body": "Yup. Window dressing now unless we maintain sentiment on p/d.", "score": 1, "replies": []}, {"body": "oof fat chance", "score": -4, "replies": []}]}]}, {"body": "Did boomer buying spree: vtv vnq vpu", "score": 7, "replies": [{"body": "![gif](giphy|8cdfoJuYuz2u27DAAO|downsized)", "score": 2, "replies": []}, {"body": "👴", "score": 1, "replies": [{"body": "Diversification", "score": 1, "replies": [{"body": "You've come a long way from diworsification", "score": 2, "replies": []}]}]}, {"body": "![gif](giphy|DWo6beGJTTqFi)\n\nCan I interest you in some municipal bonds Upvoteme?", "score": 1, "replies": [{"body": "I Don't trust my woke ass state gov", "score": 2, "replies": [{"body": "😂  now if you start posting about your lawnmower/mowing strategies, the transition to Boomer will be complete", "score": 0, "replies": [{"body": "Boomer w mostly tsla and nvda", "score": 2, "replies": []}]}]}]}]}, {"body": "Seems like someone likes the stock", "score": 2, "replies": []}, {"body": "https://preview.redd.it/44e0ws13r79d1.png?width=1835&format=png&auto=webp&s=507cd01b9740f6a7dd79b1102bea5882c507d374\n\nDo these crayons make anyone else horny?", "score": 2, "replies": [{"body": "https://preview.redd.it/y41uvyt7r79d1.png?width=1835&format=png&auto=webp&s=6093aeb1ec443b60318b11f40c7da2fba6b97666\n\nI can’t get more erect", "score": 2, "replies": [{"body": "I AM ERECT", "score": 1, "replies": []}]}]}, {"body": "Who are the fellas that cycle in here? I used to ride in college and am trying to get back into cardio workouts. Trying to look at used bikes and need pointers on whats dogshit and whats a good budget buy. There's a couple SPECIALIZED bikes within spitting distance of me for like 400-500 bucks.", "score": 2, "replies": [{"body": "Shepticles and nateleb1234", "score": 4, "replies": [{"body": "ew nate lmao", "score": 2, "replies": []}]}, {"body": "Really depends on the specific components and the state those are in. Specialized is a quality brand, usually higher price range. You could check out some cycling subreddits, at least those very specific smaller enthousiast subreddits haven't all turned to utter shit.", "score": 2, "replies": []}]}, {"body": "What's with this tweeting during the debate? That's the direction you want to take when folks are worried about who is behind the curtain running things?\n\nhttps://i.redd.it/qycvqmfq689d1.gif", "score": 2, "replies": []}, {"body": "jobless impossible lunchroom nose vanish outgoing stocking fretful fertile growth\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 4, "replies": [{"body": "Wow a whole subreddit dedicated to repeating lines from a movie. It's a good movie, but still...this seems to be OVER THE LINE", "score": 1, "replies": [{"body": "Yeah? Well, you know, that's just like uh, your opinion, man.", "score": 9, "replies": []}, {"body": "Shut the fuck up Donnie", "score": 2, "replies": []}]}]}, {"body": "Just finished the Rivian presentation.  \n\nRivian needs to flush out the specifics of their agreement w/ VW but the presentation impressed me w/ the sheer scale of it.  I think investors are going to need to better understand the outputs and profit flows of the jv before they can get more excited but I think they walked away fairly confident in the company.  Two questions:\n\nFirst, to the OGs/historians here, does this seem analogous to Tesla's situation circa 2017?  The JV certainly makes it a different situation, but how about prospective scale, COGS, etc?\n\nSecond, is Rivian's electronics platform and software good?  I know VW couldn't pull this off well, which is likely why they're partnering w/ Rivian on this.  With sensors and assisted driving aside, though, is Rivian strong enough in this area to pull this off?", "score": 4, "replies": [{"body": "I think rivian is fine as long as tesla plays fafo and makes cybertrucks and model x instead of going after rivian hard with a real truck, a real van and a real suv.", "score": 7, "replies": [{"body": "Quite possibly.  However, Rivian does look like it could carve out its own unique look and brand even if Tesla gives them competition.", "score": 5, "replies": []}]}, {"body": "The thing I found peculiar about the presentation was the Autonomy & AI segment. I feel like they’re going to be in for a rude awakening when they reach the same quandary Tesla reached: having several types of inputs combating against eachother for the real ground truth. Tesla made a very brave decision to bet on vision-only, and clearly it’s paying off. Will Rivian reach that point? \n\nI could totally see them just licensing FSD from Tesla a few years from now instead, especially when they are still nowhere near profitability before you even talk about the massive R&D spend they have ahead of them for autonomy.", "score": 1, "replies": [{"body": "They seemed to be more focused on vehicles and chargers, imho, w/ electronics and software not including assisted driving as the main focus for the JV w/ VW.", "score": 4, "replies": []}, {"body": "Tough to see anyone else competing with Tesla if they solve a version of lvl5 in next 1-5 years. The capex required upfront is suicided for most of the auto industry, maybe only Toyota could afford it? And that doesn’t include the software development.", "score": 2, "replies": [{"body": "If tesla can figure it out camera only within a few years so can nvidia, Chinese ev, cruise, waymo, mobileye etc... then they partner w a toyota or vw and you have real robotaxi competition. The threat isn't really rivian.", "score": 5, "replies": []}]}]}]}, {"body": "this regen braking concept for bike hub motors is freaking brilliant\n\nhttps://youtu.be/bLu6H-K4L2Y?si=GgFCmqavQudw7eWU", "score": 3, "replies": []}, {"body": "Geriatric Olympics happening right now", "score": 3, "replies": []}, {"body": "![gif](giphy|vhaj0GMFlIeFa|downsized)\n\nGet past 200 already", "score": 5, "replies": [{"body": "rivain cheap", "score": 1, "replies": []}, {"body": "Do I get to say “my soufflé!”?", "score": 1, "replies": []}]}, {"body": "bitch cant even hold 200 and they talking about 24t, thats crazy\n\n![gif](giphy|hjHEbcBtCMza2t7yAs)", "score": 4, "replies": [{"body": "It gets even funnier when you consider that the GDP *of the planet* is 100 TT.\n\nAlthough to be fair, the math gets wonky when you start doing this.  I don't think any of the projections are factoring hard-limits like the sheer material inputs that would be needed, or the energy requirements.", "score": 7, "replies": [{"body": "Tsla counting on mars GDP too.  500T secured bby.  Don't you ever doubt dear leader", "score": 8, "replies": []}, {"body": "Fooking doomer", "score": 6, "replies": []}]}, {"body": "Bruh in musk I trust", "score": 3, "replies": [{"body": "The doomer duo strikes again", "score": 0, "replies": [{"body": "Lol if you don't believe in 24 trillion u a doomer now", "score": 7, "replies": [{"body": "Not saying I believe that either, more of a comment to how you guys end a good day on a bad note.", "score": -2, "replies": [{"body": "Every day under 1 trillion is a bad day", "score": 5, "replies": []}, {"body": "It’s like 2 things can’t happen at once.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "![gif](giphy|ugOaZ3Wi8lqZW)", "score": 3, "replies": [{"body": "![gif](giphy|IorAqDrjKiDcc3QdN3|downsized)", "score": 4, "replies": []}]}, {"body": "sodomy w a stick", "score": 3, "replies": [{"body": "Damn anyone remember Hotdog On A Stick in the mall in the nineties??", "score": 3, "replies": [{"body": "hmmm not really", "score": 0, "replies": []}]}, {"body": "Banned by mistake. Approved. ", "score": 1, "replies": []}]}, {"body": "Both are too old and should not be forcing themselves back into the fold. This is an utter national embarrassment….but if I’m voting based on economic and social interests, I’m voting for the candidate with an established policy of support for EVs and green technology as well as support for reproductive/bodily autonomy rights. \n\nNeither will be able to run again in 2028 so we just have to get through 4 years with the least long-term damage possible.", "score": 3, "replies": [{"body": "I'm voting for AI President Lincoln this year", "score": 8, "replies": []}, {"body": "Either way half my portfolio takes a hit. \n\nCrypto and Tsla see saw.", "score": 2, "replies": []}, {"body": "I mean one is clearly about 10x as capable as the other", "score": 4, "replies": [{"body": "Not particularly worried about the person elected president. More so worried about the people advising him and making policy.", "score": 4, "replies": []}, {"body": "Which one are you referring to because it sure as hell is not dump", "score": 3, "replies": [{"body": "…. Even your CNN commentators disagree with you", "score": 1, "replies": [{"body": "I DIDNT HAVE SEX WITH A PORNSTAR", "score": 0, "replies": []}]}]}]}]}, {"body": "power hour LFG!", "score": 3, "replies": [{"body": "I would like to purchase 1 power hour please", "score": 4, "replies": []}]}, {"body": "yoo", "score": 2, "replies": []}, {"body": "fif", "score": 2, "replies": [{"body": "5th is the new 1st", "score": 2, "replies": [{"body": "![gif](giphy|xT0GqssRweIhlz209i|downsized)", "score": 1, "replies": [{"body": "![gif](giphy|VFByXZlDHAJBkEmee4)", "score": -1, "replies": []}]}]}]}, {"body": "Tesla would have to be near certain that the FSD problem is solved to actually unveil the robotaxi, right? Elon has been very optimistic with fsd timelines but Franz and Lars have made sure to temper his expectations and keep him from going all in. \n\nSo why unveil this big thing to the world if they weren’t certain they could solve it soon? It would be too much risk and embarrassment if they fail to deliver relatively soon. If it was still uncertain, why not wait another year until they are sure the problem is solved? As a stock pump it doesn’t make sense unless they actually have a rollout plan that is soonish.", "score": 2, "replies": [{"body": "well they did unveil a dude in a robot costume once", "score": 2, "replies": [{"body": "That was a recruiting event.", "score": 1, "replies": []}]}]}, {"body": "Will the FED cut to save the Yen?\n\nI took at $5k yesterday cuz 💴159.50 insane. When I went in January it was 💴142 already!\n\nhttps://x.com/geiger_capital/status/1805974550393295087?s=46&t=YuXM_s1XIUe8SVfPSLVygA\n\nGood post!\n\nCan’t wait to buy infinite ramen, udon, soba, sushi, 7/11 snackos - omg so much snacks, High Balls, Mario related merch etc.\n\nHope Japan figures it out 🥰", "score": 2, "replies": [{"body": "Japan like just interest rates man, nothing can be done, hands are tied.", "score": 7, "replies": []}, {"body": "![gif](giphy|3o7bueVxlU3uSGP2b6|downsized)", "score": 6, "replies": []}, {"body": "Japan can't figure it out because its mostly caused by their being financially wedded to the US.", "score": 3, "replies": []}, {"body": "They have us by the swap lines", "score": 6, "replies": []}]}, {"body": "![gif](giphy|9Fticsj7froxbpd5Sg|downsized)", "score": 3, "replies": [{"body": "![gif](giphy|WYjFsKQ66gR9gtWGiI|downsized)", "score": -1, "replies": []}]}, {"body": "🚀", "score": 2, "replies": [{"body": "🚀🚀", "score": 3, "replies": [{"body": "🚀🚀🚀", "score": 4, "replies": []}]}]}, {"body": "Hi. not been following the stock or visited the sub for a while (can recommend it) but unfortunately I just noticed some SP movement so now I have to ask what is going on.", "score": 2, "replies": [{"body": "VW buying 10% of Rivian (through dilution.)\n\n\nRimac launching robotaxi.\n\n\nFarley says \"eyes off the road in two years,\" sparking possible licensing deal rumours.\n\n\nTesla China numbers pretty good.\n\n\n8/8 hype rumbling.", "score": 13, "replies": []}, {"body": "VW invested 1b in competitor", "score": 2, "replies": [{"body": "5b 'over time'", "score": 1, "replies": []}]}]}, {"body": "what are we even doing…", "score": 1, "replies": []}, {"body": "PCE Friday is going to be ICE COLD\n\n![gif](giphy|KaW6fNYZf6eSk)\n\nPraying for 0.0% MoM so we go into a short 4th of July week with 🚀 on the markets 🇺🇸", "score": 0, "replies": [{"body": "Did you get back in?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/TSLALounge/s/otaIvDIDM0", "score": 0, "replies": [{"body": "imho, nothing wrong with waiting for real progress.  Same thing wall st is doing.", "score": 4, "replies": []}]}]}]}, {"body": "So hardly any excitement about touching $200.\n\nMaybe we all know that this will drop post deliveries as we are used to getting musked !!\n\nhttps://preview.redd.it/41792lnw279d1.jpeg?width=1179&format=pjpg&auto=webp&s=6ac7bad794d288c643d2a66c3bad91bcbffd8d40", "score": 2, "replies": [{"body": "never seen you express any sentiment aside from anger at tsla/elon, let alone excitement", "score": 11, "replies": []}, {"body": "RBC already commented that they’re anticipating much lower deliveries. I think it’s more or less priced in barring a massive miss beyond what’s already expected.", "score": 4, "replies": []}]}, {"body": "🚀", "score": 1, "replies": []}, {"body": "Meth head Omar/1001100 dude crying more about Rivian after he posted he bought the top a few years ago. So painfully transparent.\n\nhttps://twitter.com/wholemarsblog/status/1806358885760156111?s=61&t=ZA7y3hOG6w10pLm4TkyXJw", "score": 0, "replies": [{"body": "Yup. Seems like the kind of moron who would pay 80b plus for a 2021 rivian level company also lcid.", "score": 6, "replies": []}]}, {"body": "Pussyfoot", "score": 0, "replies": [{"body": "pussywillow \n\nalso have upvote fren", "score": 1, "replies": []}]}, {"body": "anyone going to siggraph this year? it’s in denver\n\nguess jensen will be there", "score": 1, "replies": [{"body": "Is there gonna be hookers n blow", "score": 2, "replies": [{"body": "there are pretty good after parties with decent number of girls for a nerdy type event\n\ni can probably find you some flake", "score": 2, "replies": [{"body": "So there will be one girl", "score": 4, "replies": []}, {"body": "Sounds like my type of event", "score": 1, "replies": []}]}]}]}, {"body": "robinhood overnight legging up blue yellow 🚀🚀🚀", "score": 1, "replies": []}, {"body": "Jfc Biden ", "score": 1, "replies": []}, {"body": "[https://www.reddit.com/r/TeslaModel3/comments/1doywsb/comment/ladnj9t/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/TeslaModel3/comments/1doywsb/comment/ladnj9t/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)", "score": 1, "replies": []}, {"body": "Cdk/snowflake car sales software hack continues. Hopefully tesla has found a way around it.", "score": 1, "replies": []}, {"body": "TSLA lounge in 2024 —-> diversified gay bear hate Elon lounge 😂😂😂", "score": -3, "replies": [{"body": "only chartists have such insightful lounge meta commentary", "score": 7, "replies": []}, {"body": "![gif](giphy|l3V0FBxSzWp6O0Lf2)", "score": 2, "replies": [{"body": "![gif](giphy|GpyS1lJXJYupG)", "score": -3, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Well, he is literally soaking them for $50 billion. Like sure if they made much more in earnings, but they don't.", "score": 1, "replies": []}]}, {"body": "btd", "score": -1, "replies": []}]}
{"title": "So what’s the play if SpaceX saves Boeing in space?", "selftext": "\nI don’t really understand 90% of what I read in here but surely someone has already thought it ", "id": "1dpiqh9", "created_utc": 1719462696.0, "score": 167, "upvote_ratio": 0.82, "num_comments": 111, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 5 months ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "NVDA?", "score": 507, "replies": [{"body": "I deleted my sell button", "score": 100, "replies": [{"body": "[Only play is to short Boeing and watch your bank account turn green while the entire company's space service contracts burst into flames](https://youtu.be/MC0K3muUJp0?t=562)", "score": 18, "replies": [{"body": "Nice", "score": 4, "replies": []}, {"body": "Fuck you mean short Boeing? That shits rocketing to the moon", "score": 5, "replies": [{"body": "> That shits rocketing to the moon\n\n\n\\* only because it was supposed to be going somewhere else and ended up being propelled by leaks and faulty engines.", "score": 6, "replies": [{"body": "Yeah that was the joke but them bums be downvoting", "score": 1, "replies": []}]}]}]}]}, {"body": "Well that doesn’t seem right… but like I said I don’t understand half of this beautiful mess in here. Maybe y’all need a beginners class", "score": -122, "replies": [{"body": "![img](emote|t5_2th52|31224)![img](emote|t5_2th52|4271)", "score": 27, "replies": []}, {"body": "False, NVDA is always the answer", "score": 14, "replies": []}, {"body": "The joke flew past your head faster than the upcoming NVDA bull run", "score": 5, "replies": []}, {"body": "booo", "score": 1, "replies": []}]}]}, {"body": "TSLA goes 🚀 just like it did when Elon saved those Thai kids from the cave.", "score": 116, "replies": [{"body": "You're right, better load up on puts for when he eventually calls an astronaut a pedo or something", "score": 66, "replies": [{"body": "If he calls Boeing Ceo a pedo do we buy calls?", "score": 43, "replies": [{"body": "Calls on space pedos", "score": 9, "replies": []}]}]}, {"body": "Elon scared those kids out of the caves by saying a pedo was now coming to get them lol.", "score": 7, "replies": [{"body": "Maybe the real pedo was the elons we made along the way", "score": 2, "replies": []}]}, {"body": "He even stayed up all night and developed a new kind of sub to save those kids! ", "score": 0, "replies": []}, {"body": "Well he just unbanned somebody on X that posted a video of a child being sexually exploited", "score": -1, "replies": [{"body": "No surprise.  Elon has always been a bit too obsessed with other pedophiles and has been quick to give them a safe space on X.", "score": -2, "replies": []}]}]}, {"body": "Boeing adds elon to their \"hit\" list?", "score": 216, "replies": [{"body": "Gonna send in Zuckerberg to get him in the ring at their MMA match.", "score": 34, "replies": [{"body": "Only if mommy says ok", "score": 3, "replies": []}, {"body": "20:1 on zuck and enough of a gamble.", "score": 1, "replies": []}]}, {"body": "So Tesla could be run by someone who's not an attention seeking toddler? \n\nCalls on TSLA\n\nEdit: Give me your downvotes you Elon dickriders. They feed my soul.", "score": -8, "replies": [{"body": "Calls on dickriders", "score": 7, "replies": []}, {"body": "See. What the heck is a call?\n\nThis could be why my portfolio is crap", "score": -29, "replies": [{"body": "Youre lost buddy, this is a casino.", "score": 14, "replies": []}, {"body": "Oh my sweet summer child, you don't even understand the meaning of crap yet. Stay in the shallows, thar be sharks in these waters.", "score": 4, "replies": []}, {"body": "Google or youtube it", "score": 2, "replies": []}]}]}, {"body": "I love this but can’t like it…it’s already at 69 upvotes.", "score": 0, "replies": [{"body": "gotta make it 420", "score": 1, "replies": []}, {"body": "you a freaky ass neighbor you a 69 god?", "score": 0, "replies": [{"body": "Hey, hey, hey, hey, run for you life?", "score": 1, "replies": [{"body": "Let me hear you say, \"OV-ho\"", "score": 1, "replies": []}]}]}]}]}, {"body": "Wait till BA bottoms and pick some up cheap. They have their mouth on the government teet and they aren’t going anywhere.", "score": 72, "replies": [{"body": "Okay just let me know when it bottoms so I know when to wait for a few more weeks", "score": 50, "replies": [{"body": "Just wait till I buy in. I’m good at bottoming out stocks.", "score": 18, "replies": [{"body": "Just bought a share. I'm sorry for those astronauts now.", "score": 3, "replies": []}]}]}, {"body": "Come on i already bought BA at the bottom twice.", "score": 24, "replies": [{"body": "I bought BA at peak covid, it's still in the green compared to my cost basis", "score": 3, "replies": []}]}, {"body": "Every days a new bottom for BA.   It’s like your favorite little twink", "score": 8, "replies": []}, {"body": ">bottoms\n\nCalls on GRND, got it", "score": 1, "replies": []}]}, {"body": "Incredibly bullish, from now on Boeing only need to launch people up there, and have NASA paid other players to get them down. ", "score": 9, "replies": []}, {"body": "If Boeing says no Elon will try to buy Boeing.", "score": 13, "replies": [{"body": "A friend of mine emailed Elon.  He said something like, “I thought you would find this article interesting.  It’s about how Boeing is using Carbon fiber to…” yadda yadda yadda.\n\nFive minutes later, Elon replies with the following:\n\n“Boeing sucks at manufacturing.”\n\nAnd that was the whole email.", "score": 8, "replies": []}, {"body": "Lmfao buying twitter, then boeing, would be the funniest way to lose all his money", "score": 1, "replies": [{"body": "Tbh SpaceXs functioning technology plus Boeing's government contracts would be pretty lucrative.", "score": 4, "replies": []}, {"body": "No worries, Tesla will just give him billions of dollars again.", "score": 2, "replies": []}]}]}, {"body": "Elon will blame the pedophile spaceship for not liking his idea and calling it useless.", "score": 30, "replies": [{"body": "I think he'll save them if he can impregnate them.", "score": 3, "replies": []}]}, {"body": "Starliner's proboems are in the service module, not the crew compartment. They can get back to Earth without a hassle* - they're keeping it up there to collect more data*\n\n*according to Boeing", "score": 10, "replies": []}, {"body": "Calls on Musk becoming first Trillionaire", "score": 5, "replies": [{"body": "Publicly known trillionaire, yes. Stealth wealth is a thing.", "score": 1, "replies": [{"body": "Nobody can hide hundreds of billions like that", "score": 1, "replies": [{"body": "You would be surprised. Maybe not in the US.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Yeah Boeing let all the idiots who bankrupted McD in and they pushed out Boeings management and took over, now look.", "score": 1, "replies": []}]}, {"body": "Elon does a fat rip of ketamine and joins them in space", "score": 13, "replies": []}, {"body": "it is a PR Disaster for Boeing.  It highlights to engineering incompetence of the entire company.\n\nbut for some odd reason, no boeing stockholder seem to care!", "score": 2, "replies": []}, {"body": "I'm waiting for it. Just to have a few fucking laughs.", "score": 4, "replies": []}, {"body": "SPY", "score": 4, "replies": [{"body": "Yes. Boeing promised me a new plane to see when y’all will attack", "score": -10, "replies": []}]}, {"body": "Maybe I can get out of DYXZ….", "score": 2, "replies": []}, {"body": "Whistleblower will be scared to be killed by AI", "score": 1, "replies": []}, {"body": "Jensen entered the chat", "score": 1, "replies": []}, {"body": "Didn’t Elon send a Tesla car to space ?", "score": 1, "replies": []}, {"body": "If he sent a Tesla to go get them, I'd say TSLA calls", "score": 1, "replies": []}, {"body": "Regards have proven time and again they have zero understanding of how space missions work so don't try to rationalise it. SpaceX is private anyways so Boeing puts I guess?", "score": 1, "replies": []}, {"body": "BA is too big to fail. Goodness, their quality is shoddy. The Executive suite and Board need to go.", "score": 1, "replies": []}, {"body": "Boeing has lots of government contracts and apparently carte blanche to murder people so id be very careful about betting against them.", "score": 1, "replies": []}, {"body": "Calls on Boeing since the more stuff goes south literally the higher the stock goes the next day, near  mystic shit going on. Edit: Down over the year, and the jumps aren't big, but I've been tracking days of bad news immediately followed by a small jump. Also removed a reference to a used car non dealership.", "score": 1, "replies": []}, {"body": "“Everything that follows is a result of what you see here”", "score": 0, "replies": []}, {"body": "Hopefully the state takes over Boeing and most leadership that contributed to deaths face jail. Boeing takes 10-20 years to go back to what it was.", "score": 0, "replies": [{"body": "Boeing is full of spooks already.", "score": 1, "replies": []}]}, {"body": "Nationalize spacex as a national security threat. Then deport Elon?", "score": 0, "replies": [{"body": "Govt running space x will surely lead to continued success", "score": 3, "replies": []}]}, {"body": "They’re not publicly traded, there is no play numbnuts", "score": 0, "replies": [{"body": "Boeing is", "score": 1, "replies": []}]}, {"body": "Most of the \"Boeing crew stranded on ISS\" clickbait headlines are complete bunk.  NASA is just being very cautious. There is no time pressure to get them down so they are double/triple checking everything and doing additional testing on the Starliner at ISS and on the ground.  This was meant to be a shakedown trip to find any remaining issues and that is exactly what it has been so far.", "score": 0, "replies": []}, {"body": "Nasa owns SpaceX so nothing will happen to boeing", "score": -36, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "It basically confirms my comment.", "score": -6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Nasa gave contracts to spacex AGAIN. \n\nMuskovich also confirmed that spacex would bankrupt without nasa contratcs.\n\nAsk yourself why nasa isn't doing this kind of things by itself but nasa gives it always to spacex.\n\n[https://arstechnica.com/science/2016/04/without-nasa-there-would-be-no-spacex-and-its-brilliant-boat-landing/](https://arstechnica.com/science/2016/04/without-nasa-there-would-be-no-spacex-and-its-brilliant-boat-landing/)", "score": -2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "definition for socialism", "score": 1, "replies": []}]}, {"body": "They would have bankrupted without a nasa contract 16 years ago, but they could now lose that source of revenue and be absolutely fine.", "score": 2, "replies": [{"body": "wrong \n\n[https://www.fool.com/investing/2023/08/27/despite-rare-profit-spacex-still-mostly-loses-cash/](https://www.fool.com/investing/2023/08/27/despite-rare-profit-spacex-still-mostly-loses-cash/)\n\n[https://www.reddit.com/r/SpaceXMasterrace/comments/182u2y6/is\\_anyone\\_else\\_worried\\_about\\_a\\_potential\\_spacex/](https://www.reddit.com/r/SpaceXMasterrace/comments/182u2y6/is_anyone_else_worried_about_a_potential_spacex/)", "score": 0, "replies": [{"body": "That reddit thread is almost unanimously people saying their financial position is fine, and that article states that they have turned billion dollar losses into profits as of last year. They have now likely significantly improved cash flow given the huge increase in starlink subs and launch cadence since the article was published.", "score": 1, "replies": [{"body": "muskovich fanboi, got it", "score": 0, "replies": [{"body": "Ad-hominem attacks do not constitute a valid argument.", "score": 1, "replies": [{"body": "So tell me how I'm supposed to arguing with someone who's blind for facts because of being fan?\n\nThe facts are simple - muskovich businesses would collapsed in year without money from US government and US tax payers. His business have no real profits without carbon credits, nasa's contracts and without licking putin's and xi's ass.\n\nYou're saying that one articles isn't valid because it's one year old.\n\nYou're typical muskovich fanboi.\n\nEDIT: Twitter is pure prove that muskovich can't run business without money from US government.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Did you parents not teach you to think before saying stupid shit online?", "score": 2, "replies": [{"body": "Maybe you should learn something about spacex's and  boeing's history.", "score": -4, "replies": []}]}]}]}
{"title": "Ain’t nuthin betta then meta", "selftext": "Entered into some cheap itm calls a couple days ago for a quick scalp. It ain’t much but it’s honest work. I’m getting better at listening to the gut and pulling profit. Now off to go start my 100k a year farming job. \n\n", "id": "1dprow0", "created_utc": 1719496009.0, "score": 1774, "upvote_ratio": 0.91, "num_comments": 362, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 368 | **Previous Best DD** | \n**Account Age** | 9 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Can I have some?  Down 50k", "score": 1, "replies": []}]}, {"body": "Bro said “it ain’t much” FUCK YOUUUU RICH MF![img](emote|t5_2th52|27421)", "score": 1078, "replies": [{"body": "Calls those contracts cheap.  Okay Bezos ", "score": 213, "replies": []}, {"body": "Mannn I’m over here at Wendy’s, get me some chicken nuggets", "score": 60, "replies": [{"body": "Saw those new $3 subway foot long dippers \nMight switch teams and play with my moldy deli meat instead of my rotten frosty, which is still good!", "score": 6, "replies": [{"body": "Idk.. the subway around here has been passing out salmonella....", "score": 2, "replies": [{"body": "They don’t charge extra for that", "score": 1, "replies": [{"body": "You got that right. Poison for all the Poors", "score": 1, "replies": []}]}]}, {"body": "Eating a foot long pretzal dipper was rock bottom", "score": 1, "replies": []}]}, {"body": "That ain’t chicken", "score": 1, "replies": []}]}, {"body": "I want a small investor WSB, not some rich asshole flaunting his wealth", "score": 1, "replies": []}]}, {"body": "1.5M play and mfs don't even charge their phones![img](emote|t5_2th52|51295)![img](emote|t5_2th52|51295)", "score": 512, "replies": [{"body": "[deleted]", "score": 308, "replies": [{"body": "Can you imagine the hassle of signing into and downloading all your apps every 2-3 days", "score": 60, "replies": [{"body": "his yes men do it for him.", "score": 78, "replies": [{"body": "Yes man here,  can concur, yes sir!", "score": 19, "replies": []}, {"body": "If they were smart, they would keep one or two back up phones to pretend they were switching them out, and pocket the $1200 the dumb fuck was expecting to spend on the new one.    \nI am smort.", "score": 1, "replies": []}]}, {"body": "Don’t have to imagine, iPhone download & signs in automatically to those apps when you get a newer iphone.", "score": 11, "replies": []}, {"body": "When's the last time u got a new phone?? U don't gotta do none of that, u just put ur old phone by the new phone & viola", "score": 5, "replies": [{"body": "Like 4 years ago cuz I lost all my money. But at least I keep it charged.", "score": 4, "replies": []}]}, {"body": "Your phone lasts 2-3 days???", "score": 1, "replies": [{"body": "Brand new, they usually do, right now, 20 mins", "score": 2, "replies": [{"body": "That's fair, my shit dies in 5 minutes because im too busy recording my wife and her boyfriend to charge it.", "score": 2, "replies": [{"body": "Mine dies cuz I’m watching your wife and bf. If you could upload faster that’d be great!", "score": 2, "replies": []}]}]}]}]}, {"body": "He gives the phone money and tells it to go charge itself", "score": 1, "replies": []}]}, {"body": "Why it’s always them don’t charge their phones", "score": 1, "replies": []}, {"body": "this is part of the reason why it was a successful play. lol", "score": 1, "replies": []}]}, {"body": "I can’t imagine still browsing Reddit with 2 milly play money.", "score": 1062, "replies": [{"body": "$2m is nothing. Thats like $20 from 2019", "score": 458, "replies": [{"body": "I’ll gladly take that nothing off your hands. 🤣", "score": 154, "replies": []}, {"body": "You know what. I'll give you a $20 note from 2019 and take those pesky $2m from 2024 off your hands.", "score": 50, "replies": [{"body": "I'll give you a 20 from the 60s", "score": 1, "replies": []}]}, {"body": "_It ain’t much but it’s honest work._", "score": 8, "replies": []}, {"body": "Where's your $2m?", "score": 0, "replies": []}]}, {"body": "when you have all the free time in the world you need things to pass the time.  reddit is easy and free.", "score": 17, "replies": []}, {"body": "I can’t imagine still options gambling with $2M… put that shit in an index and chill.", "score": 23, "replies": [{"body": "Have you ever won at gambling before?", "score": 21, "replies": [{"body": "no and i don’t intent to", "score": 31, "replies": []}]}, {"body": "Giving financial advice to the guy who has $5M in robinhood ![img](emote|t5_2th52|4271)", "score": 9, "replies": []}, {"body": "yeh anyone who does otherwise is outta touch", "score": 1, "replies": []}]}, {"body": "Cause it’s fake", "score": 28, "replies": [{"body": "https://preview.redd.it/tcsp2u22m59d1.jpeg?width=1179&format=pjpg&auto=webp&s=531543399906eebf1470914fbaee4651ab01e999", "score": 86, "replies": [{"body": "Send me a milly. Then I’ll believe it", "score": 44, "replies": []}, {"body": "Why use Robinhood? Max FDIC insurance is $250k, go to a real broker at that point", "score": 44, "replies": [{"body": "He doesn't intend on keeping it after a galaxy brain 0dte play to try and turn it into a billion", "score": 11, "replies": []}, {"body": "Pretty sure the vast majority of brokerages’ max FDIC insured is the standard $250,000.\n\nWhich ones have more?", "score": 8, "replies": []}, {"body": "Maybe the real brokers are his serious accounts", "score": 7, "replies": [{"body": "fr, whales over here", "score": 3, "replies": []}]}, {"body": "I think fdic is for savings account for investing it’s different", "score": 2, "replies": []}, {"body": "Brokerages have sipc coverage, not fdic.  Fdic is for banks.  The only way fdic is relevant is for the uninvested balance that is swept to partner banks (assuming gold).", "score": 1, "replies": []}]}, {"body": "Everyone is asking you for money……and I’m no different![img](emote|t5_2th52|4271)wanna wire a helpless Ole lady 5k just for shits and giggles?🤭", "score": 6, "replies": []}, {"body": "1st 3 letters of Username sounds like jew, def checks out 💯💯 we jelly", "score": 2, "replies": []}, {"body": "I’m confused, this can still be a paper account. What does that prove ?", "score": 1, "replies": []}, {"body": "Damn", "score": 1, "replies": []}, {"body": "Lucky man! I went from 1k to 43k back to 1k I lost it all on intel options last month :(", "score": 1, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That's what I was wondering, looks sus", "score": 1, "replies": []}]}, {"body": "I wouldn’t ask for money, just for a job 😂🙌🤝", "score": 1, "replies": []}, {"body": "I don't even need a milly,, I'll be good with 200k lol", "score": 1, "replies": []}, {"body": "OP are you a betting man? ![img](emote|t5_2th52|31224)", "score": 1, "replies": []}, {"body": "Why you got $5m in robinhood. Fuck RH", "score": 1, "replies": []}, {"body": "always goes up", "score": 1, "replies": []}, {"body": "truly amazing. where did you learn how to trade?", "score": 1, "replies": []}, {"body": "Uncle Sam is gonna have a word but nice job", "score": 0, "replies": []}]}]}, {"body": "I mean, there’s a HUGE difference between a millionaire and billionaire……. 😂", "score": 41, "replies": [{"body": "So he can make money but can he turn that millionaire into a pennyaire? That’s what the people want to see here😂", "score": 24, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "WAY!!!!", "score": 2, "replies": [{"body": "No mames wey!!", "score": 5, "replies": []}]}]}, {"body": "It’s almost like it takes 1000 millionaires to make a billionaire", "score": 11, "replies": [{"body": "Well it could take anywhere from 2 to 1000 millionaires to make a billionaire tbf", "score": 7, "replies": [{"body": "No, you have to literally get 1000 millionaires and stuff them together with a hydraulic press. Apply max pressure. Then voila a new billionaire pops out. That’s why they all look so weird.", "score": 17, "replies": [{"body": "Who the fuck is Viola??", "score": 17, "replies": [{"body": "A type of onion", "score": 1, "replies": []}, {"body": "https://www.baseball-reference.com/players/v/violafr01.shtml", "score": 1, "replies": []}]}, {"body": "But why can’t you get 4 $250millionaires in the hydraulic press. Need to study up on my billionaire creation science.", "score": 4, "replies": [{"body": "Because those aren't \"just\" millionaires, they're centi-millionaires.", "score": 2, "replies": [{"body": "Thank you for the clarification", "score": 2, "replies": []}]}]}]}]}, {"body": "What's the difference between a millionaire and a billionaire?  About a billion dollars.", "score": 1, "replies": [{"body": "or about a million dollars", "score": 3, "replies": []}]}]}]}, {"body": "That’s all I would do", "score": 5, "replies": []}, {"body": "Well you are in the 99.99% of humans on earth.", "score": 3, "replies": []}, {"body": "You can’t do anything with 2 milly. Two’s a nightmare. Can’t retire, not worth it to work. Oh yes, two will drive you un poco loco. Poorest rich person in America. The world’s tallest dwarf.", "score": 3, "replies": [{"body": "Early retirement ", "score": 3, "replies": []}, {"body": "How is it a nightmare to work 5 years while it grows, then retire? “Not worth it to work” doesn’t make sense, it’s worth it so you don’t eat into the principle and can retire in 5 years…", "score": 2, "replies": []}, {"body": "LOCO was one of the first stocks I found on WSB, thinking it was going to become CMG lol", "score": 1, "replies": []}]}, {"body": "I could be worth gorillions and I’d still spend a third of my day on twitter. Some of are really about this online shit big dog", "score": 1, "replies": []}, {"body": "it's lonely at the top", "score": 1, "replies": []}, {"body": "That’s a really good point. Lots of world out there to see.", "score": 1, "replies": []}, {"body": "While using robinhood 🤔", "score": 1, "replies": []}, {"body": "You’d be surprised how many rich dudes are just as bored as you when they poop.", "score": 1, "replies": []}, {"body": "Who says rich ppl can’t play Reddit!", "score": 0, "replies": []}]}, {"body": "Man I remember Reddit saying Meta was gonna die. Good play dude.", "score": 240, "replies": [{"body": "Meta went from $89 to over $500 since those endless posts about how no one was using anymore.\n\nA bit like nvidia and arm on this sub last year. Nvidia was the best short opportunity and arm ipo was bound to fail.\n\nMeanwhile PayPal and intel are still getting posts daily from people trying to pump those stocks.", "score": 127, "replies": [{"body": "Actually no Intel is consistently getting shit on in this sub.", "score": 51, "replies": [{"body": "I know it’s almost a buy from that alone lol.", "score": 32, "replies": [{"body": "I bought it today", "score": 7, "replies": []}, {"body": "I was thinking the same. Too bad I’m broke", "score": 3, "replies": []}, {"body": "I bought it, just based on valuation 132 billion LOL no way. I don't care if the companies shit they pull in 2x AMD. They can at least be 70-80% of amd value even they aren't better than amd.", "score": 3, "replies": []}]}]}, {"body": "I wish I bought Meta shares instead of options when it dropped that low. The share price recovered nicely…just way after my options expired. 🫠", "score": 16, "replies": [{"body": "Wish I'd bought Meta shares as well, but very pleased with the Amazon shares I bought, December 2022 for $85.07. Cha ching!", "score": 3, "replies": []}, {"body": "leaps my brother, leaps...", "score": 1, "replies": []}]}, {"body": "Don’t forget all the Reddit IPO doomsayers\n\nWhatever the Reddit sheeple upvote to the top, do/think the opposite.", "score": 2, "replies": []}, {"body": "So Intel next Meta?", "score": 1, "replies": []}, {"body": "GOOG was getting the same stupid ass slander this year", "score": 1, "replies": []}, {"body": "** Cries in AMD **", "score": 1, "replies": []}, {"body": "It went from $89 to $500 because they dropped their bet the company strategy on the metaverse plus big lay offs.", "score": 0, "replies": [{"body": "Well actually they didn't. They spend the same and loose huge amounts of money they just don't talk about it on earning calls and most people aren't smart enough to read the quarterly reports.", "score": 2, "replies": []}, {"body": "Some basic research would show that they haven't changed their direction on the metaverse. It was always meant to be a long-term plan. Please use critical thinking skills and the internet before spewing this garbage.", "score": 2, "replies": []}]}]}, {"body": "remember when Reddit said RDDT will be $0.50 stock and they will all short it after IPO and be rich?\n\nEdit: Butthurt losers downvoting :)", "score": 15, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 22, "replies": [{"body": "Good bot?", "score": 1, "replies": [{"body": "😂 what kind of bot is that?", "score": 3, "replies": [{"body": "When even the Bots are throwing shade you know you've made it.", "score": 1, "replies": []}]}]}]}, {"body": "That was before real companies actually expressed interest in data they could get from dumb comments lol.", "score": 6, "replies": [{"body": "If you can't anticipate such things then you are a clueless idiot and should stay away from stocks (remember stocks are future looking and Reddit had already done a $60 million deal with Google before the IPO)", "score": 10, "replies": []}]}, {"body": "I lost money on the ipo, fuck me why is it a shitty $60 stock", "score": 3, "replies": [{"body": "content is the king, especially moderated content.", "score": 5, "replies": [{"body": "so fucking retarted either way😭", "score": 1, "replies": []}]}]}, {"body": "Yeah, I am up 20% on it.", "score": 2, "replies": []}, {"body": "Up over 80% from Pre-IPO price!  WOOHOO.  Just sold my ABNB today to scoop up more RDDT.", "score": 1, "replies": []}, {"body": "the irony of reddit users shorting RDDT is palpable", "score": 1, "replies": []}]}, {"body": "I genuinely thought meta was going to stay depressed for a while after their IOS data privacy issues. I wanted to buy but kept looking for signs the dip had maxed out", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/y5u8lpefh49d1.jpeg?width=1153&format=pjpg&auto=webp&s=21500d42dd4b837716dce25946245e98bd32734c\n\n**\"It ain't much...\"**\n\nCongrats OP!\n\nAnd by \"congrats\", I mean go fuck yourself.\n\nAnd by go fuck yourself, I mean go fuck yourself.\n\nJust want to say congrats again!", "score": 360, "replies": [{"body": "[If he has $1.5 million to throw around on options, he better have a yacht and a lambo already.](https://youtu.be/0H4a_lHANYI?t=12)", "score": 32, "replies": []}]}, {"body": "How are you fuckers still greedy with 2 millions in the portfolio and doing monthly calls?! ![img](emote|t5_2th52|4271)", "score": 135, "replies": [{"body": "He's rich and probably has been for a long time, and this is play money. When you have fuck off money you can fuck off anyway you wish", "score": 117, "replies": [{"body": "Probably but you never know with the members of this sub.  I remember people who were rich but got super greedy and blown up their accounts, martymoho, analfarmer2 guys etc.", "score": 42, "replies": [{"body": "O yeah even the rich get fucked when they're stupid. Look at credit suisse. They did a great job staying solvent. Credit suisse is the mentor of many in this sub", "score": 8, "replies": [{"body": "dont matter how rich you get, you can always blow up your money", "score": 1, "replies": []}]}, {"body": "Yeah but as long as he has actual cash holdings, he's good.  It's the rich who dump all their money into stocks and keep like 5k or less in their actual bank account who basically gamble their lives.\n\nI would imagine if this guy has 500k in actual savings, he's pretty much set for life.  Assuming he already has like houses etc left from his parents.", "score": 1, "replies": []}]}]}, {"body": "I mean he cant truly retire with 2 million if he wants a nice life style. \n\nBetter to hit 5 million. And then retire. Put that in hysa and be comfortable for rest of the life.", "score": 2, "replies": [{"body": "No, playing monthly options with 2 million is the issue.", "score": 4, "replies": [{"body": "Playing monthly options with 100k and if you even make just 3000 a month with it is basically as much as minimum wage job alrdy.", "score": 1, "replies": []}]}, {"body": "hit port is over 5 milluon. just on robinhood.", "score": 1, "replies": []}, {"body": "With a 5% return he would be making 100k a year. He could basically retire anytime unless he wants to live in a big bay area house or something lol", "score": 1, "replies": []}]}]}, {"body": "you dumped 1.5 million in calls??", "score": 47, "replies": []}, {"body": "2.2 million and you’re using Robinhood for calls. God this some diabolical shit", "score": 67, "replies": []}, {"body": "Millions on a Robinhood account, boy do you belong here.", "score": 42, "replies": []}, {"body": "Whatever", "score": 23, "replies": []}, {"body": "im still crying for not buying Longer dated calls when it crashed to $415 ![img](emote|t5_2th52|4260)", "score": 17, "replies": [{"body": "if you aren't buying calls after today's drop, wtf are you even doing?", "score": 1, "replies": []}]}, {"body": "Step 1: have 1.5million in robinhood whike robinhood only insures 500k😂😂", "score": 59, "replies": [{"body": "Crazy", "score": 6, "replies": []}, {"body": "Actually he’s got 5m over there ![img](emote|t5_2th52|4275)", "score": 2, "replies": []}, {"body": "Robinhood has additional insurance that insures up to 1B.", "score": 0, "replies": []}]}, {"body": "Has 2 million+ dollars\n\nCan't spell properly \n\n![img](emote|t5_2th52|4271)", "score": 11, "replies": [{"body": "Photoshop", "score": 1, "replies": []}]}, {"body": "Literally cracking up.. not mad, slightly envious. I just wanna pay my $50,000 in debt and buy a small piece of land. Always keep in mind, if they can win this big tho.. you can too. 👍🏻", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|4260)", "score": 10, "replies": []}]}, {"body": "Photoshop", "score": 27, "replies": [{"body": "I was thinking the same thing. Crazy how many people believe it considering you can literally see the fuzz around the text if you zoom in.  Amateur level photoshop too", "score": 15, "replies": [{"body": "look at his post history lmao", "score": 4, "replies": [{"body": "What’s in there?", "score": 1, "replies": []}]}, {"body": "What are u talking about? My eyes aren't that good but looks fine to me. Why would there be fuzz around the text anyways??", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "and then poor regards like you would still be sceptical. Keep being poor bro.", "score": 2, "replies": []}]}, {"body": "Nah I think its real.  OP has done this trade a few times when META dips.", "score": 2, "replies": []}]}, {"body": "Congrats this is awesome. (Go fuck yourself)", "score": 5, "replies": []}, {"body": "Honestly Zuckerberg has committed war crimes against META bears over the last 18 months. One of them asked me for a dollar outside a homeless encampment", "score": 5, "replies": []}, {"body": "LMAO 7/26 calls! i know the exact reason you’re holding it op. this play WILL pay off even more", "score": 6, "replies": [{"body": "The earnings?", "score": 1, "replies": []}]}, {"body": "You’re insane OP. Regarded and insane. Congrats.", "score": 3, "replies": []}, {"body": "I'm sure there are many accounts like this, but it still blows my mind to see multi-million dollar accounts on Robinhood.", "score": 5, "replies": []}, {"body": "Really helps the anxiety sink in when you see people making hundreds of thousands of dollars and I’m here losing the little I have in comparison. Congrats and fuck you.", "score": 4, "replies": []}, {"body": "https://preview.redd.it/ixwwup1q359d1.jpeg?width=500&format=pjpg&auto=webp&s=f47c9a2d63694da79bde95e167afec047fba2298", "score": 5, "replies": []}, {"body": "Holy fuck dude. Congrats", "score": 3, "replies": []}, {"body": "I’m dumb. Can anyone explain to me how his screenshot calculates out to a 744k gain?", "score": 3, "replies": []}, {"body": "teach me the way", "score": 2, "replies": []}, {"body": "This Muh fukher dont miss...!!!", "score": 2, "replies": []}, {"body": "Step 1. Get million dollar. \nStep 2. Put it on non 0DTE or weekly OTM calls\n\nWho is this regard? This guy is sane and does not belong here. Get him outta here!", "score": 2, "replies": []}, {"body": "Almmmmsssss for the pooooooorrrrrr\n\nhttps://preview.redd.it/ckwjsxz9459d1.jpeg?width=1170&format=pjpg&auto=webp&s=4dd060c8d99298981ebe663266ef1b661735d7fa", "score": 2, "replies": []}, {"body": "U trynna pay off the remaining of my student loans", "score": 2, "replies": []}, {"body": "You suck the Zuck ?", "score": 2, "replies": []}, {"body": "I see your trick, if the battery is red then the portfolio is green.", "score": 2, "replies": []}, {"body": "50% isn’t really all that good compared to everything else going on. Some of us are up 400% in the last 5 months on Costco and Nvidia alone", "score": 2, "replies": []}, {"body": "As the saying goes, “you gotta have money to make money”", "score": 2, "replies": []}, {"body": "$2MM and still cant afford a charger. True regard.", "score": 2, "replies": []}, {"body": "https://preview.redd.it/jpdvbmeli59d1.jpeg?width=414&format=pjpg&auto=webp&s=a9d5b491db1ecf5ffa367d7557fa7d69723d8344\n\nHappy for you man", "score": 2, "replies": [{"body": "Please stop 😭", "score": 1, "replies": []}]}, {"body": "Dumb fake posts", "score": 2, "replies": []}, {"body": "What a loser photoshopping a position", "score": 3, "replies": [{"body": "Isn’t that what 90% of this group does ?", "score": 1, "replies": []}]}, {"body": "you put 1.5M into META? what was your reason?", "score": 1, "replies": [{"body": "Make money?", "score": 8, "replies": [{"body": "What was your reasoning behind meta calls", "score": 1, "replies": []}]}]}, {"body": "Congrats and I hate you… back to my 9-5 I go", "score": 1, "replies": []}, {"body": "Rookie numbers", "score": 1, "replies": []}, {"body": "Wow, fuck you ![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "Charge your phone!", "score": 1, "replies": []}, {"body": "Congrats! I see this (and similar posts) and realize just how little I understand any of this. lol", "score": 1, "replies": []}, {"body": "You bet 2m on options with at 100k/yr income? \n\nDamn man. I'd be scrooge mcduck with that 2m if I only had 100k/yr income. I hope to hell that's less than 10% of your net worth.", "score": 1, "replies": []}, {"body": "Congrats and fuck you", "score": 1, "replies": []}, {"body": "You had a lot of faith in meta to drop $1.4 million in hopes of that gain.", "score": 1, "replies": []}, {"body": "“Cheap” dawg I can’t afford GROCERIES 😭", "score": 1, "replies": []}, {"body": "Why would you use RH for this, you dumbass.", "score": 1, "replies": []}, {"body": "Are you just going to show off how big your dick is, or are you gonna teach us how to fuck?", "score": 1, "replies": []}, {"body": "This will inspire so many monkes here… embrace the loss porn hurricane coming", "score": 1, "replies": []}, {"body": "Imagine if you bought OTM calls", "score": 1, "replies": []}, {"body": "2 million in a RH account. \n\nTake some out buy some hooker and coke.", "score": 1, "replies": []}, {"body": "Charge ur phone bro.", "score": 1, "replies": []}, {"body": "Amazonnnnn", "score": 1, "replies": []}, {"body": "Can someone explain what the hell I’m looking at? He paid 26 and 56 dollars per share for some calls?", "score": 1, "replies": []}, {"body": "That’s good advice to listen to your gut. My brain makes me overthink good ideas to death", "score": 1, "replies": []}, {"body": "Crm better today. Big gains", "score": 1, "replies": []}, {"body": "Congrats you own the Wendy’s I shit at don’t you ![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "I need to learn how to invest", "score": 1, "replies": []}, {"body": "Nah meta is out for blood up until the DOD stomps their throats for feeding the CCP all their sweet sweet AI advancements.", "score": 1, "replies": []}, {"body": "Teach me da ways broda", "score": 1, "replies": []}, {"body": "Is this from Pornhub?", "score": 1, "replies": []}, {"body": "200 buys @ $26.30 means you spent $526,000 on those first calls, right? Or am I reading that wrong?", "score": 1, "replies": []}, {"body": "Jesus, take the money. Im a believer in Meta, its my largest holding (shares). At some point you have to take the W", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "Dude! Wanna buy me a table to go in my (hopefully) new house? Haha. Congrats man!", "score": 1, "replies": []}, {"body": "Insider?", "score": 1, "replies": []}, {"body": "Now you can afford a phone charger", "score": 1, "replies": []}, {"body": "don't know much about farming, do you?", "score": 1, "replies": []}, {"body": "I fucking hate you 😅", "score": 1, "replies": []}, {"body": "300k dollars (+15%) 🥶", "score": 1, "replies": []}, {"body": "😳🔥🔥🔥🔥🔥", "score": 1, "replies": []}, {"body": "OP’s post history is just insane", "score": 1, "replies": []}, {"body": "Once again, I am reminded that me buying 100k of options ain’t shit. Thought I was cool lol", "score": 1, "replies": []}, {"body": "Shit don’t even rhyme f u 😭😭😭\n \nWait nvm I’m refarted I was just hating too hard", "score": 1, "replies": []}, {"body": "Can you lend me a rack", "score": 1, "replies": []}, {"body": "Y'all rich kids kill me 😭😫", "score": 1, "replies": []}, {"body": "Ok, fuck you 😛", "score": 1, "replies": []}, {"body": "ITM 30 DTEs can go up 50% in a few days?", "score": 1, "replies": []}, {"body": "Interesting, you bought the 7/26 calls 10 minutes before the 7/19 calls. You’re still holding.", "score": 1, "replies": [{"body": "I bought the 7/26’s when meta dipped to 492-493 last week. The 7/19’s I bought around 506 in price. I sold the 7/26’s right out of the shower this morning. I’d show the receipt but for some reason I can’t add a photo? When I click on photo it doesn’t give me an option to add from gallery", "score": 2, "replies": []}, {"body": "https://preview.redd.it/zxm42xk6z59d1.jpeg?width=1179&format=pjpg&auto=webp&s=c701bb46dece8693ad4b780aa55ff3aadf2f7b83\n\nGot it", "score": 1, "replies": [{"body": "Oh no way. So the 8:40am and 8:50am trades were your sells😂 thought that was when you bought. I didn’t look to deep into it. Just was curious how your whale transactions looked on the charts. How much commission did you pay then? Each contract I think is 0.95 cents at least.", "score": 2, "replies": [{"body": "I forget what Robinhood charges per contract it’s not terrible. I thought it was 60 cents? Now I’m curious myself", "score": 1, "replies": []}]}]}]}, {"body": "You wanna slide me $100?", "score": 1, "replies": []}, {"body": "Now that yiu posted, your gonna lose it", "score": 1, "replies": []}, {"body": "Hello it's me the irs ready for my cut", "score": 1, "replies": []}, {"body": "> I’m getting better at listening to the gut and pulling profit.\n\nyou're deluding yourself into a gambling habit.", "score": 1, "replies": []}, {"body": "Dang bro are you farming ass or veggies?", "score": 1, "replies": []}, {"body": "This guys fucks. Seriously, congrats and fuck you", "score": 1, "replies": []}, {"body": "Hope your farming dank 😚💨", "score": 1, "replies": []}, {"body": "WHAT HOLD on, What is a Strategies Option?\n\nedit: NVM I am dumb hahah", "score": 1, "replies": []}, {"body": "If it’s good enough to screenshot it’s good enough to sell.", "score": 1, "replies": []}, {"body": "Legend Brotherman!", "score": 1, "replies": []}, {"body": "Look how good our economy is", "score": 1, "replies": []}, {"body": "You can afford to charge your phone now", "score": 1, "replies": []}, {"body": "1.5m puts it all on options instead of literally anything else to maximize the risk", "score": 1, "replies": []}, {"body": "I’m up over 200% on calls I bought last week, too bad I didn’t full port like you ![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "Step one: Have a million dollars", "score": 1, "replies": []}, {"body": "The irs is knocking at your door", "score": 1, "replies": []}, {"body": "CHARGE YOUR PHONE", "score": 1, "replies": []}, {"body": "Can someone help me understand wtf is happening here? I am not stock literate but I have $500 to gamble on that much potential out wtf???", "score": 1, "replies": []}, {"body": "THIS FUCKIN GUY", "score": 1, "replies": []}, {"body": "Betas for meta is Zucks motto", "score": 1, "replies": []}, {"body": "Lucky fuck", "score": 1, "replies": []}, {"body": "lol are we supposed to be impressed? Go tell your friends…. Oh wait….", "score": 1, "replies": []}, {"body": "The people here claiming it’s fake just can’t comprehend someone having a $6m portfolio when they’re trying to get through the $20k wall😂", "score": 1, "replies": []}, {"body": "Wish I knew how any of this works", "score": 1, "replies": []}, {"body": "And here I am losing my 1.4k of months saving", "score": 1, "replies": []}, {"body": "Lmao I gotta stop seeing this. And im here trying to make my 100k loss from $100 that I have left.", "score": 1, "replies": []}, {"body": "Yet I lost 60% on straight shares when I invest in them", "score": 1, "replies": []}, {"body": "Man, if all my liquid/security assets added up to $2M, I’d just live off the interest and quit my job. Maybe get a part time job just for fun. 😪", "score": 1, "replies": []}, {"body": "I can never time my entries or exits on meta lol", "score": 1, "replies": []}, {"body": "F’ing A Cotton! F’ing A!!!!", "score": 1, "replies": []}, {"body": "Is this true ??", "score": 1, "replies": []}, {"body": "MFs rollin’ with over 1M in bets, while I am sweating over a $2,000 bet.\nI am in the wrong group!", "score": 1, "replies": []}, {"body": "https://preview.redd.it/iwpcuomzb79d1.jpeg?width=1080&format=pjpg&auto=webp&s=1f8584a1d65ec972d9203d819096ddd6263e2772", "score": 1, "replies": []}, {"body": "some of you got too fucking much money", "score": 1, "replies": []}, {"body": "go charge your phone you rich mf", "score": 1, "replies": []}, {"body": "Help me? 😁 I want 20% of that and I’m happy lol", "score": 1, "replies": []}, {"body": "Congrats. One day I will learn, alas, today is not that day.", "score": 1, "replies": []}, {"body": "How much you make today bro?\nBro: only 300.", "score": 1, "replies": []}, {"body": "Every day I'm more convinced Bitcoin millionaires are fucking up reality.", "score": 1, "replies": []}, {"body": "It’s easy to make a lot when you have a lot. Rich mfs!", "score": 1, "replies": []}, {"body": "Wtf.  Not much lol", "score": 1, "replies": []}, {"body": "OOOOOOOOOOH OP GOOD STUFF", "score": 1, "replies": []}, {"body": "Dang and you didnt tag me when u made that call 😂 congratulations tho!!!", "score": 1, "replies": []}, {"body": "Just a few cheap calls initially worth a small house", "score": 1, "replies": []}, {"body": "Fucking beautiful", "score": 1, "replies": []}, {"body": "Can you explain what you mean they were “cheap” or how you found them. Would love to see the math", "score": 1, "replies": []}, {"body": "imma give you an address to go to for some fun, just knock on the dumpster lid when you get there ;)", "score": 1, "replies": []}, {"body": "$1.5 million options play, highly acoustic indeed ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "You should sell before you get wiped out by Rho.", "score": 1, "replies": []}, {"body": "Damn this dude is a legend check his account posts", "score": 1, "replies": []}, {"body": "than\\* ![img](emote|t5_2th52|12787)", "score": 1, "replies": []}, {"body": "Teach me please", "score": 1, "replies": []}, {"body": "Fuck u", "score": 1, "replies": []}, {"body": "I don't understand, he has 200 options at 502.5 $ while meta is worth 521. How are those options not worth 200x19.5$ but 2 milly?", "score": 1, "replies": []}, {"body": "Hey looks it’s that guy who painted for Facebook!", "score": 1, "replies": []}, {"body": "Nike!!!", "score": 1, "replies": []}, {"body": "His battery is dead from screenshotting and texting all his friends 😂 congrats!", "score": 1, "replies": []}, {"body": "Bro tell me you took profit?", "score": 1, "replies": [{"body": "https://preview.redd.it/kb6yal6l1e9d1.jpeg?width=1179&format=pjpg&auto=webp&s=511d4ce7d1536793ce029f134996a66cbdaba7dd", "score": 1, "replies": []}]}, {"body": "It’s cute", "score": 1, "replies": []}, {"body": "Ain't much 😇", "score": 1, "replies": []}, {"body": "you’re from the Northeast", "score": 1, "replies": []}, {"body": "sell now before we see 450 again", "score": 1, "replies": []}, {"body": "Man I’m just mad that no matter what I can’t make anything in the market :( I’m pissed that I’ve lost so much :( I just want to make some money :(", "score": 1, "replies": []}, {"body": "Great jobemote:t5\\_2th52:8883", "score": -1, "replies": []}, {"body": "Always guys with no battery left", "score": 0, "replies": []}, {"body": "He came to brag here, stop insulting ppl with your bank rolls, show richness by donating some. I will pass my account details. Need help to pay off my car loan . ![img](emote|t5_2th52|52627)", "score": 0, "replies": []}, {"body": "First of all, FUCK YOU, RIGHT IN THE FACE!!!! Secondly buying that amount of front month calls will work out great, until it doesn’t. Make sure you post a screen shot of your account when the value is $2209. MAQ", "score": 0, "replies": []}, {"body": "Nice paper trade", "score": 0, "replies": []}, {"body": "Nice one brah...![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)![img](emote|t5_2th52|4276)", "score": -1, "replies": []}]}
{"title": "Proof it’s all luck", "selftext": "Last time I told my girlfriend to randomly buy an option to see how she does. She is a trained nurse and has absolutely no fucking idea what an option is. I told her calls if you believe it goes up or puts if you believe it goes down. She looked through a few charts and decided to buy 126$ NVDA calls 07/19 at the bottom of the dip.\n\nWell, all I’m hearing now is that I’m an idiot as I lose on every option I touch (I’m majoring in finance at a renowned university in Germany) + I guess she’s addicted now.\n\nCheers", "id": "1dpwnw6", "created_utc": 1719508615.0, "score": 2440, "upvote_ratio": 0.95, "num_comments": 309, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 7 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Joke’s on you, she’s been getting lessons for years from her sugar daddy.", "score": 1, "replies": []}]}, {"body": "Did you explain how the first one is free?", "score": 2575, "replies": [{"body": "yepp, she will soon understand I guess. Unfortunately it will be my money", "score": 1212, "replies": [{"body": "Only if you're regarded... Oh wait...", "score": 294, "replies": [{"body": "Hopefully she gives you the best regard…", "score": 114, "replies": [{"body": "And hawk tuah", "score": 239, "replies": [{"body": "A regard & deep \n\n>hawk tuah", "score": 37, "replies": []}, {"body": "I hope she spits on that thang when her luck runs out.", "score": 1, "replies": []}]}, {"body": "Deep regard", "score": 20, "replies": [{"body": "Deepest of regards", "score": 20, "replies": [{"body": "Deepest hawk tuahs", "score": 1, "replies": []}, {"body": "Deep regard pie", "score": 0, "replies": []}]}, {"body": "Deepest, bluest, my hat is like a sharks fin!", "score": 2, "replies": []}]}]}, {"body": "One of us. One of us.", "score": 18, "replies": [{"body": "Thirteen! Thirteen! Thirteen!", "score": 1, "replies": []}]}]}, {"body": "Of course it will be your money. You don’t think her real boyfriend would let her spend his money do you?", "score": 99, "replies": []}, {"body": "classic", "score": 90, "replies": []}, {"body": "You're a student majoring in Finance. Basically an expert.", "score": 47, "replies": [{"body": "If only I was a student taking “accounting for regards” then I could accurately predict NVDA’s price action over the next month. ", "score": 9, "replies": []}, {"body": "You misspelled tarded teenager", "score": 1, "replies": []}, {"body": "Well, let's not get ahead of ourselves.![img](emote|t5_2th52|4640)", "score": 1, "replies": []}]}, {"body": "The plus side for her is that if she wins, it will be her money.", "score": 17, "replies": []}, {"body": "Our girlfriend soon, comrade.", "score": 21, "replies": []}, {"body": "![img](emote|t5_2th52|4267)", "score": 9, "replies": []}, {"body": "What you do is setup her up in ToS, but in a paper trading account.", "score": 11, "replies": [{"body": "Yeah so when she's gets it to $5 mil she can kill u", "score": 47, "replies": [{"body": "Chances are much higher she'll go broke", "score": 11, "replies": [{"body": "I'd much rather be responsible for someone going broke than be responsible for them not getting rich.", "score": 35, "replies": []}]}, {"body": "Why kill him? She has the other bf on the side😉", "score": 2, "replies": []}]}, {"body": "TO THE TOOOOOP", "score": 3, "replies": []}]}, {"body": "How will she understand if she’s using your money not hers", "score": 5, "replies": [{"body": "She won’t, that’s how it works. My wife’s money is hers but my money is somehow ours.", "score": 19, "replies": [{"body": "Well that doesn’t sound to fun", "score": 3, "replies": [{"body": "Trust me, it’s not. It fucking blows. MAQ", "score": 6, "replies": []}]}]}]}, {"body": "LMAO the ending.", "score": 1, "replies": []}, {"body": "Her gains your losses", "score": 1, "replies": []}, {"body": "I'm sending my regards to you", "score": 1, "replies": []}, {"body": "We are a ridiculous spieces, and I love it lol.", "score": 1, "replies": [{"body": "That \"i\" really lost it's way.", "score": 2, "replies": [{"body": "Shit man, it sure did lol", "score": 2, "replies": []}]}]}]}, {"body": "Whoever said that fuckin lied.\n\nIm still waiting for my free one.", "score": 53, "replies": []}, {"body": "Still waiting on my free one", "score": 9, "replies": [{"body": "That's not right.  Send an e-mail to SEC and CC Daddy J-Pow.", "score": 11, "replies": []}]}, {"body": "![img](emote|t5_2th52|4275)", "score": 3, "replies": []}, {"body": "My first 5 trades were amd between 3.x and 7.x", "score": 3, "replies": []}, {"body": "The most expensive thing in life is free!", "score": 1, "replies": []}, {"body": "I lost $400 yesterday buying my first 😭. I got up early, placed $660 of NVDA calls at market open, and was about to cash out $250 up. My boyfriend said I should wait for more gains. In the time it took me to explain to him why I shouldn't, it evaporated, lol", "score": 1, "replies": [{"body": "Dumbass ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|27189)", "score": 1, "replies": []}, {"body": "Congrats you just cracked RDDT top 10 funniest comment 2024… your quick wit will take you far in life… I can see the future…tbh that was the funniest comment I’ve seen in a long time…", "score": 1, "replies": []}]}, {"body": "\"Addicted\". This will not age well. Loss porn incoming from your gf.", "score": 575, "replies": [{"body": "Unfortunately it’ll be my money mate", "score": 238, "replies": [{"body": "You're a finance major and you don't have seperate finances? \n\nYou truly belong here.", "score": 119, "replies": []}, {"body": "It was never yours...", "score": 20, "replies": [{"body": "This guy girlfriends.", "score": 6, "replies": []}]}, {"body": "Well...then you'll have to decide if you want to lose all your money in time....or your gf.\n\nJkjk she can get \"lucky\" again!", "score": 49, "replies": [{"body": "yeah imagine she keeps getting lucky 13 times in a row.", "score": 24, "replies": []}, {"body": "Or possibly losing both!\n\nHaving a choice is quiet the luxury. \n\nSome of us here (like me) can't lose either because you can't lose what you don't have.", "score": 1, "replies": []}]}, {"body": "Just get her the fake stock tracker app", "score": 12, "replies": []}, {"body": "You thought you goofed with options? Letting your wife/gf use your money while she starts playing options is the epitome of regarded.     Here's to you.   🙌👏", "score": 6, "replies": []}, {"body": "No ur forgetting: its only your money if she loses, if she wins its her money", "score": 1, "replies": []}]}, {"body": "If he posts loss porn of his gf, is he a cuck?", "score": 15, "replies": [{"body": "Yes", "score": 3, "replies": []}, {"body": "Lmfao", "score": 1, "replies": []}]}, {"body": "She can recover by selling real porn", "score": 46, "replies": [{"body": "That's one of the better \"investment strategies\" I've seen in the sub.", "score": 23, "replies": []}, {"body": "I don’t usually advise this, but you’ll have to pimp her for feet pics 🤷🏼‍♀️", "score": 9, "replies": []}, {"body": "Lemme guess... Her name is Wendy?", "score": 3, "replies": []}]}, {"body": "Actual porn will fund the loss porn", "score": 6, "replies": []}, {"body": "> Babe, that's not what I meant when I asked for it", "score": 5, "replies": []}, {"body": "You know what follows loss porn…", "score": 1, "replies": []}, {"body": "Or maybe just a ‘Porn’ coming… ![img](emote|t5_2th52|51295)", "score": -4, "replies": []}]}, {"body": "Bullshit you have a girlfriend. Pics or it didn’t happen.", "score": 270, "replies": [{"body": "She's in Canada right now bro he can't get pics til later", "score": 150, "replies": [{"body": "\"My girl is in the shop rn; I'll introduce her to you next time\"", "score": 37, "replies": []}, {"body": "What's the original reference of this joke?", "score": 3, "replies": [{"body": "George glass", "score": 3, "replies": []}]}]}, {"body": "She goes to a different high school. You don't know her.", "score": 31, "replies": []}, {"body": "She goes to a different school bro you wouldn’t know her", "score": 6, "replies": [{"body": "In Canada", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 270, "replies": [{"body": "shared suffering is half suffering", "score": 102, "replies": []}, {"body": "🤣🤣", "score": 1, "replies": []}]}, {"body": "This is so legit.  I gave up on trying to pick individual stocks myself and just let my wife pick em.  Last 4 she has picked: CAVA (3x), LULU (lost ~15% and then I dumped it), RDDT (up 27%), and TSM (up ~25%).", "score": 62, "replies": [{"body": "Becky stocks strike again", "score": 20, "replies": []}, {"body": "Nursing school is fairly easy and gets you a really good paying job that’s in demand every where. The travel version of the job lets you get paid more to go travel the country. If you want more money you can go into admin or CRNA school and make stupid money.\n\nOP is getting a finance degree.\n\nThere’s a good chance his girlfriend is just much smarter than him and he doesn’t realize it.", "score": 5, "replies": []}]}, {"body": "She’s going to leave you.", "score": 61, "replies": [{"body": "nah, she only cares about cats. Im the degenerate trying to make that quick milly.", "score": 71, "replies": [{"body": "Her cat is her financial advisor.", "score": 38, "replies": [{"body": "imagine spending thousands to go to college when you couldve become a cat instead", "score": 18, "replies": [{"body": "I am not a cat ![img](emote|t5_2th52|12787)", "score": 8, "replies": []}]}, {"body": "I would be broke if that were true as my cats are hooked on catnip. 🤷‍♀️🐈‍⬛", "score": 2, "replies": []}]}]}, {"body": "Nah, she’s going to be on this sub next week making jokes about “my boyfriend’s mistress”", "score": 11, "replies": [{"body": "there’s gotta be a paper hands joke in there somewhere", "score": 5, "replies": []}]}]}, {"body": "A Mathematical Finance degree gives you the mathsy understanding of expectations and options pricing... and perhaps learning fundamentals (discounted value WACC whatever)... but for actual trading you need the experience and maturity to understand the trend...especially if you are buying long calls/puts. \n\nWhen you actually do the maths selling puts/calls make way more sense (or at most do diagonals when you are super convinced)...", "score": 19, "replies": [{"body": "nothing to add here 🤝", "score": 6, "replies": []}]}, {"body": "My wife did a year long option call on honest stock didn’t know options either. She uses their products and is a huge Jessica Alba fan. She spent a few hundred dollars on 3 dollar calls bought about 1,000 contracts. sold it for 30K profit a few months back when they reported their first profitable quarter. It would’ve peaked over 100K had she held a little longer but the game is making money.", "score": 18, "replies": [{"body": "Must be possessed by the spirit of Peter Lynch.", "score": 3, "replies": [{"body": "Moral of the story is women are much better traders than men.", "score": 3, "replies": []}]}, {"body": "3 dollar calls, 1000 contracts, for a few 100s. sorry im a beginner I dont get how 1000 contracts would be few hundreds, shouldnt it be 3000?", "score": 1, "replies": []}]}, {"body": "How do you lose money on every option you touch? Are you exaggerating? Please tell me you are. Maybe let your girlfriend trade your account for you instead…..", "score": 34, "replies": [{"body": "losing on every option is a little bit extreme tbh. I had some good calls during earnings. However I always end up buying otm calls in believe to easy flip them with profit. Currently holding 150$ 08/16 NVDA Calls as an example being down 40%", "score": 30, "replies": [{"body": "When I first discovered options I went from $16,000 to $5,000\n\nThen I realized I could buy contracts that were ITM, and simply catch the bounce on longer expirations.\n\nWent from 5,000 to 300,000 in about 4 months.\n\nStop buying OTM. Hope is not a strategy lol.\n\nSecondly, just a friendly recommendation....If you are adamant about longer calls, then wait for SPY to have a savage drop. I don't know anything thats more dependable than the SP500 for long calls. Of course there historically have been stretches where the market has not recovered for a few weeks to a few months at a time, but those instances are not common.\n\nBut seriously, stop buying OTM shit. thats what's fucking you. Unless you are deadset on getting a home run to post here on WSB, then gamble away sir lol.\n\nhttps://preview.redd.it/e9tj6l7go59d1.jpeg?width=1179&format=pjpg&auto=webp&s=e49fdf8d013eafa6d29cd7a5f7b50b0a9353e400\n\nIf a truck driver who never went to college can do it, Mr. finance can do it. Good luck man.\n\nEDIT: I’m not down money today. Webull calculates swing shares from earning drops incorrectly….. was up $900 yesterday and $3000+ today.\n\nScalped MU.", "score": 95, "replies": [{"body": "I’ll give it a shot (seriously). Appreciate your help man, best of luck to you, too.", "score": 26, "replies": [{"body": "PM me. I talk with a few redditors about daily Strat etc. check in on them and see what they’re up to. Can’t promise a quick reply but I’ll get back to you. Have a great day brother. We can’t let your gf beat you lmao", "score": 35, "replies": [{"body": "Can I PM you? Im interested in learning about want you know", "score": 6, "replies": []}, {"body": "Would love to learn more if you have the time :)", "score": 2, "replies": []}, {"body": "In terested to learn your strategies too.", "score": 1, "replies": []}]}]}, {"body": "Are you buying 0DTEs?", "score": 6, "replies": [{"body": "If I do, it’s with a very very small amount of my account. The majority of what I’m doing are monthlies", "score": 17, "replies": [{"body": "I read your last post, looks like you used to be doing weeklies.  Have you changed your approach?", "score": 7, "replies": [{"body": "Yes, I have more money now :P", "score": 14, "replies": [{"body": "Awesome, keep it going!", "score": 5, "replies": []}]}]}]}]}, {"body": "How the hell?!! How??!\n\nTeach a fellow truck driver how to afford a house for his family", "score": 15, "replies": [{"body": "Legitimate question, how much time do you actually spend trying to learn?\n\nMaking money is easy. Making millions of dollars in a week is impossible. The problem with most options traders is they don't understand options, even a little bit. I would be willing to bet you lose more trades to theta decay than you lose to you just flat out being wrong about a trade. \n\nBuy ITM options with long dates and treat them like shares, you'll make money.", "score": 22, "replies": [{"body": "I actually have a few of the mainstream recommended option books, although haven’t read them all entirely. Being a father of young kids, and working long hours, I’m just struggling to find time to dive deep into theoretical options. Most of the time it’s late at night, when I’m already tired and should get some sleep as well, so it’s pretty much an eternal struggle, between daily responsibilities and developing a plan-B.\n\nThe WSB degeneracy sure seems alluring some times, especially when I get through tough weeks at work, and come home to see massive gain porn posted, but then again it’s what every average Joe in here feels like; but the few times I’ve had success was with LEAPS, last being I made 300$ on a 2000$ 2-years-out call, after only 2 months in. The stock had very little volatility, but I was lucky to catch a nudge upwards.\n\nI guess writing it down makes it all make sense, but I struggle at being persistent at that, because I don’t know what my daily routine should be to be effective at it…\n\nWhat this guy is posting is just wild results though!", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": []}, {"body": "What trades did you make to go from 5000 to 300000?", "score": 7, "replies": []}, {"body": "This works in a raging bull market, will wipe you out very fast in a bear market", "score": 11, "replies": [{"body": "For real. Almost every stock has been up up up for the last year and a half.", "score": 2, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "This is incredible. Just today I thought: no more OTM unless LEAPS. How many DTE do you usually choose?", "score": 3, "replies": [{"body": "Monthlies normally, right now because a lot of the things I trade are near ATH I’m actually doing more shares than anything - I don’t like having the time pressure of even monthlies. I’m young and not in a rush so if I’m stuck holding Amazon long, I’m ok with that.", "score": 6, "replies": [{"body": "Great, thank you. I’ve had good luck starting out, but need to focus on consistent strategy. I’ve tended towards ATM and 1-3 months out (or LEAPS,) as I’ve been learning. That was just my inclination to balance RR, though. I’d like to expand such that I can earn in different types of markets, but need to tidy up for now. I have been happy to buy shares with gains, and have just started buying LEAPS to hold longterm, like shares, I guess. Thanks again, this helps.", "score": 3, "replies": []}]}]}, {"body": "Lil bookmark", "score": 2, "replies": []}, {"body": "Would it be okay if I asked questions in PMs? Excellent job so far and good luck :)", "score": 1, "replies": []}, {"body": "Curious: How far out in expiration do you target?", "score": 1, "replies": []}, {"body": "What is the easiest and cost to pull off, say to buy a Call option for SPY. I legit believe it will be up by end of the year.\n\nIf it doesn't, how do I ensure that I only loose the money I put in as premium?", "score": -1, "replies": [{"body": "It seems like you don't understand how options work.\n\nTo answer your question, buy a contract that's as far away and as deep in the money as you can afford. \n\nI would suggest you learn how options are priced.", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|29637)", "score": 1, "replies": []}]}]}]}, {"body": "How do I do the opposite of you? Please post your upcoming buys as well as predictions. Thank you.", "score": 7, "replies": [{"body": "Regarding my $150 NVDA Calls you better load on some Puts", "score": 9, "replies": []}]}, {"body": "Maybe try other strategies because yours clearly isn't working for you. You can also buy spreads to reduce an options upfront cost while also reducing the downside.\n\nBuying ITM calls is expensive, but LEAPS (over a year out deep in the money calls) decay much slower, and don't usually expire worthless. I like to look at the break even price as well because sure it might get to the strike price, but with the break even price you can quickly see how high relatively people are placing the premium on different options for the same date when scrolling through. I try to buy the lowest priced ones so that the least moves are needed to profit. \n\nI've been doing well selling puts on highly volatile stocks recently.", "score": 4, "replies": []}, {"body": "Oh fk", "score": 6, "replies": []}]}]}, {"body": "She should make all trading decisions from now on", "score": 15, "replies": [{"body": "I’ll definitely consider her advice now", "score": 9, "replies": []}]}, {"body": "Did she look through a few boys and pick you?", "score": 14, "replies": []}, {"body": "I turned $1K to $12K on the first option I ever bought back when I was in college. Wow, so easy I thought. Surely, if I keep my trades to $1K each, I couldn't possibly lose on 12 trades in a row.\n\nI was wrong....", "score": 10, "replies": []}, {"body": "You better wife her up", "score": 4, "replies": []}, {"body": "Expecting a loss porn from your gf on 7/19", "score": 4, "replies": []}, {"body": "Which university lol", "score": 3, "replies": [{"body": "Hamburger University", "score": 15, "replies": []}, {"body": "in frankfurt, now you can guess", "score": 4, "replies": [{"body": "Hot Dog Academy of the Gifted and the Blind", "score": 17, "replies": []}, {"body": "# Karmeliterschule", "score": 2, "replies": []}]}, {"body": "Imagine going to uni to do worst than wsb regards\nOne of us \nOne of us", "score": 6, "replies": [{"body": "Isn't  99% of reddit kids in uni?", "score": 2, "replies": []}]}, {"body": "Gotta be smth like University of Wuppertal if he‘s losing on every trade and studying economics", "score": 9, "replies": []}]}, {"body": "This is how to change someone to be a degenerate. Good job!", "score": 3, "replies": []}, {"body": "I guess we know who is paying for dinner tonight....", "score": 3, "replies": []}, {"body": "Lmfao OP what have you done. She’s one of us now.", "score": 2, "replies": []}, {"body": "If it's all luck then how do investment firms continue making money?", "score": 2, "replies": []}, {"body": "No it’s not", "score": 2, "replies": []}, {"body": "Umm, where's the proof here?", "score": 2, "replies": []}, {"body": "Bro regarded his girlfriend.", "score": 2, "replies": []}, {"body": "Puts on this guy’s finances", "score": 2, "replies": []}, {"body": "Time to put a ring on it.  Ride the 🌊", "score": 2, "replies": []}, {"body": "i like my theory better: women are smarter and better than you", "score": 3, "replies": [{"body": "there are actually several paper that suggest women are better traders", "score": 14, "replies": [{"body": "the female mind is better suited to analytical tasks while the male brain is suited to hitting stuff with a hammer\n\nhttps://preview.redd.it/by9sr2hhm59d1.png?width=1016&format=png&auto=webp&s=f3311026af97a8a4690765e32fd4c41a95113b16", "score": 12, "replies": []}, {"body": "Cathie Wood would like a word…", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|8883)", "score": 1, "replies": []}]}]}]}, {"body": "Markets are emotional & irrational in short time frames. She probably surmised by looking at a chart that recent history showed it’s more likely to go up than down", "score": 2, "replies": []}, {"body": "Put on some lingerie and ask her to choose between MU, AVAV and FSLR. They will ask skyrocket in the next weeks. Make her horny for exercise and assignment.", "score": 1, "replies": []}, {"body": "Become a nurse then", "score": 1, "replies": []}, {"body": "well no shit, no one can predict it to a T or they would be a richer than the entire world", "score": 1, "replies": []}, {"body": "Next have her try sports betting! 😂", "score": 1, "replies": []}, {"body": "First nurse to ever catch a case of poverty from her finance boyfriend.", "score": 1, "replies": []}, {"body": "How much does her husband make?", "score": 1, "replies": []}, {"body": "60% is the time the First one always wins", "score": 1, "replies": []}, {"body": "What if she’s just better than you", "score": 1, "replies": []}, {"body": "Girlfriend? Lies, positions or ban", "score": 1, "replies": []}, {"body": "Which university are you studying at?", "score": 1, "replies": []}, {"body": "You gotta give her the hawk tuah", "score": 1, "replies": []}, {"body": "Just tell her your prior trade losses are her fault for not overseeing you. Really it’s gross negligence for letting a known regard trade without adult supervision.", "score": 1, "replies": []}, {"body": "You should change your major right now.", "score": 1, "replies": []}, {"body": "This is why I’ll never trade with my wife.  She thinks I’m a genius, I don’t want to prove her wrong.  I get more tail this way too, just an fyi amigo", "score": 1, "replies": []}, {"body": "Plus she is now getting a new boyfriend who will obviously be a better trader", "score": 1, "replies": []}, {"body": "So she bought a $400 option and sold for $700?", "score": 1, "replies": []}, {"body": "“You know I’ve always been lucky at gambling. I’ve never won.”-one of Norm McDonalds friends.", "score": 1, "replies": []}, {"body": "Success is all gambling, but minimizing losses is a learned discipline", "score": 1, "replies": []}, {"body": "Poor by tomorrow", "score": 1, "replies": []}, {"body": "She'll make fun of you if she gains, get mad and blame you if she loses. Fucked either way.\n\nI never even give investing advice to anyone, especially my partner.", "score": 1, "replies": []}, {"body": "I see her making an only fans in her future when large Marge calls.", "score": 1, "replies": []}, {"body": "Get your ass back in the kitchen and make her a fucking sandwich.", "score": 1, "replies": []}, {"body": "Which university? University of regards?", "score": 1, "replies": []}, {"body": "This only proves that you are a regard.", "score": 1, "replies": []}, {"body": "What brokerage you using in germany", "score": 1, "replies": []}, {"body": "Sure you can play options or any kind of financial market product like that, yes you can treat it like a casino, some would even say... Sir, this is a casino. However, with options, maaan please... There's so much sht you can do with options, like it's ridiculous.. they are the most intricate product on the market hands down, and if you know wtf you are doing, you've studied, and know how to utilize certain strategies based off of whatever market dynamics you are seeing, it definitely stops being luck, definitely stops being like a casino... And that can even go for simple long calls and puts depending on how they are utilized and when. All you really proved is that anybody who's retail can open up a brokerage account and get to to trading without knowing wtf they are doing, they may win some trades they'll lose plenty.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/vdub3zqdg69d1.jpeg?width=1170&format=pjpg&auto=webp&s=0cbb34152d8ae8e88b63eca196b17ac2bf5db461", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Is she single currently?", "score": 1, "replies": []}, {"body": "First one is free of course.  Did you explain to her that if she keeps playing in the options market instead of working at the hospital she will soon be working behind the German equivalent of Wendy's?  ![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "*Did you tell her that Wendy's is full of genius options traders?*\n\n![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "If she keeps randomly pick options, she might still come out ahead", "score": 1, "replies": []}, {"body": "What’s the realized gain?", "score": 1, "replies": []}, {"body": "I can’t wait for your girlfriend to sleep on the couch and you go upstairs with her boyfriend.", "score": 1, "replies": []}, {"body": "I made money on my first one too. Batting .175 since.", "score": 1, "replies": []}, {"body": "she’s talent and chose a wrong field. the same to you, you should be a nurse", "score": 1, "replies": []}, {"body": "Okay but she doesn’t have a flair yet, you can still win.", "score": 1, "replies": []}, {"body": "Good news is she'll be sucking your dick behind a dumpster in a few months to make rent -- bad news is, there will be a line!", "score": 1, "replies": []}, {"body": "You tell her …. CALL me when you want me and PUT it where it feels good and don’t worry about the money", "score": 1, "replies": []}, {"body": "Another Wendy’s dumpster queen in the making", "score": 1, "replies": []}, {"body": "She loses and he will be behind Wendy’s… I like the odds on this one", "score": 1, "replies": []}, {"body": "clearly investing is art, not science", "score": 1, "replies": []}, {"body": "By girlfriend do you mean your girlfriend’s husband?", "score": 1, "replies": []}, {"body": "All the time and money you put in and she throws a dart at the board….this is the way", "score": 1, "replies": []}, {"body": "You should have led with you are a europoor so I would not have wasted 30 seconds of my life reading your post.", "score": 1, "replies": []}, {"body": "Congrats you just ruined her life too.", "score": 1, "replies": []}, {"body": "Why no body talk about PETco???", "score": 1, "replies": []}, {"body": "One of us! One of us!", "score": 1, "replies": []}, {"body": "Can I be your girlfriend's boyfriend", "score": 1, "replies": []}, {"body": "Any knowledge about stock movement that can be learned in your finance classes is priced into the option premiums.", "score": 1, "replies": [{"body": "so true lol", "score": 1, "replies": []}]}, {"body": "Marry her before she gets rich.", "score": 1, "replies": []}, {"body": "Tell her that her name is Wendy now and that you offer certain service (from) behind.", "score": 1, "replies": []}, {"body": "nurses are better trained", "score": 1, "replies": []}, {"body": "This is like the start of that “I tried heroin once post.”", "score": 1, "replies": []}, {"body": "Hmm that’s interesting. Very odd to see a “female “ trader so adapt. Perhaps she dated a finance bro before and she is just being nice to you ?", "score": 1, "replies": []}, {"body": "Perhaps, we are the regards", "score": 1, "replies": []}, {"body": "Just tell me what trades she makes and Ill give you a 10% cut.", "score": 1, "replies": []}, {"body": "You’ve opened Pandora’s box. Your life savings are herby forfeited.", "score": 1, "replies": []}, {"body": "Fresh meat", "score": 1, "replies": []}, {"body": "I’m dying", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Intuition has a lot to do with it. It was a solid play. Chart looked good. Strike price was sound. You don't need to be a finance professional and it probably doesn't help.", "score": 1, "replies": []}, {"body": "Now your nurse girlfriend got the disease of counting the minute before market opens. \n\n;)", "score": 1, "replies": []}, {"body": "That is the way it works yes", "score": 1, "replies": []}, {"body": "> randomly buy an option\n\nWell, yeah, this is all going to be luck. The idea is you have a plan based on market research and a careful consideration of past, present, and future market conditions. Or just dump it all in an index fund and let it ride for the next 30 years. Whatever floats your boat.", "score": 1, "replies": []}, {"body": "Sounds like my first time doing options. 125 cons on a MARA 0DTE call, 6 and a 1/2 hours later, and $5,600 richer. Fast forward to today, $16K in the hole.", "score": 1, "replies": []}, {"body": "Lol this is proof that when this bitch starts to crash it's going to crash really fucking hard.", "score": 1, "replies": []}, {"body": "Give her time. She’ll learn the ways.", "score": 1, "replies": []}, {"body": "Does Germany have Wendy's?", "score": 1, "replies": [{"body": "no but five guys", "score": 1, "replies": []}]}, {"body": "Plot twist. Girlfriend is just code for \"writing hand\", and OP made a good trade for once.\n\nMove over M Night Shamblamyawn.", "score": 1, "replies": []}, {"body": "See I setup my gf with a Roth IRA and options. that way you at least feel like she has a chance to be responsible and she has a hard limit set to how much she can deposit.", "score": 1, "replies": []}, {"body": "It seems like the dudes on here with finance degrees are the most clueless.", "score": 1, "replies": [{"body": "I may suck with option at the moment, however it’s only a fraction of what I’m investing so it doesn’t matter. Most of my money (which isn’t extremely much as I’m a student still) goes into boring index funds and blue chips.", "score": 2, "replies": [{"body": "Calling something a blue chip doesn’t stop you from losing money", "score": 2, "replies": [{"body": "That’s true, but so far I’m doing good", "score": 2, "replies": []}]}]}]}, {"body": "Propose her before she finds a better one", "score": 1, "replies": []}, {"body": "You're not wrong constantly you're just recognizing patterns way too late and you're not watching the stock for days and weeks to understand its personality and how it tends to move.\n\nI watch a stock for a couple days to a couple weeks before I understand where its highs and lows like to move", "score": 1, "replies": []}, {"body": "Mit welchem Broker kaufst du Optionen?", "score": 1, "replies": [{"body": "TR", "score": 1, "replies": []}]}, {"body": "Gute Story 🤣.. das wird noch.. aber der aktuelle Markt scheint literally schadhaft zu sein, wenn du versuchst mit financial literacy und Logik ranzugehen. Jeder kann jetzt traden mit hoher leverage und viele davon haben wahrscheinlich NOCH weniger Plan als deine Freundin. AAAABER die glauben sie haben den UBEBELSTEN Plan und das System belohnt sie, was den Größenwahn noch verstärkt.. und das solange bis sie ganz fix und auf einmal pleite gehen und dann heulen wie die Geier.. dann sind natürlich aber die ANDEREN SCHULD ;)", "score": 1, "replies": []}, {"body": "Let her lose all your money and then divorce. Then she gets nothing ha ha ha.", "score": 1, "replies": []}, {"body": "How’d she learn how to read charts", "score": 1, "replies": []}, {"body": "Just stick with stocks starting in C: crowd strike, cava, Carvana, crocs. Has worked out for me", "score": 1, "replies": []}, {"body": "Options and girlfriend is a bad mix", "score": 1, "replies": []}, {"body": "Or she’s more rational and you’re More emotional. That could be it haha she bought on a dip, do you do that or do you chase things going up and lose? That’s not proof of much as it’s only 1 time", "score": 1, "replies": []}, {"body": "Clearly she got advice from her other boyfriend.", "score": 0, "replies": [{"body": "This is the answer.", "score": 1, "replies": []}]}]}
{"title": "Wtf Boeing stock up almost 3%", "selftext": "- DoJ recommends charges\n\n- Just given sanctions \n\n- Their equipment here and in space isn’t working \n\n- Dozen other things \n\n\n=\n\nStock price going up.\n\nCan someone explain?\n", "id": "1dpxjw9", "created_utc": 1719510816.0, "score": 445, "upvote_ratio": 0.81, "num_comments": 236, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 35 | **Previous Best DD** | \n**Account Age** | 7 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1279, "replies": [{"body": "It's probably people closing out short positions for profit and buying shares. 2% is nothing", "score": 152, "replies": [{"body": "Closed not covered", "score": -4, "replies": []}]}, {"body": "OPs post history is gold ![img](emote|t5_2th52|4271)", "score": 47, "replies": [{"body": "Bro made a post over $80 fucking dollars 😂🤬", "score": 28, "replies": [{"body": "OP is clearly a minor", "score": 12, "replies": [{"body": "hopefully he only lost lunch money, and not his house...\n\nhaving been in information security for 20 years and seeing that companies suffer no long term ill effects from breaches anymore (and even get a bit of a bump), the fact they can't move astronauts properly is not going to hurt Boeing in the long term...", "score": 1, "replies": []}]}, {"body": "He's like 10 yo", "score": 0, "replies": []}]}, {"body": "Gives real Portnoy vibes of \"[Should I BUY MORE BOEING?!](https://www.reddit.com/r/wallstreetbets/comments/xybh4e/a_traders_journey_with_dave_portnoy/)\"", "score": 1, "replies": []}, {"body": "“Can you OD on mushrooms?”", "score": 1, "replies": []}]}, {"body": "I gotta start using that second line in real life.", "score": 14, "replies": []}, {"body": "What he meant was: How come is not down 45% down?.", "score": 5, "replies": []}, {"body": "The largest drop happened 6ish months ago. the last couple of months were rather steady, no big drops. In contrast, the big wave of bad news hit within the last couple of weeks.\n\nSo none of that bad news had any considerable impact on the stock. Which means Boeing being incompetent and criminally negligent is already priced in the current stock.", "score": 2, "replies": []}, {"body": "Down only 3% in the last 3 months and we’ve found out they’ve killed people in that time.\n\nYou a Boeing apologist?", "score": -133, "replies": [{"body": "Show your loss porn", "score": 84, "replies": [{"body": "I’m down $79.\n\n\nIt’s the principle of the thing.", "score": -86, "replies": [{"body": "I've heard this before, it may help... \"THe StOcK MarKet iS IrRatioNAL\"", "score": 36, "replies": []}, {"body": "You are a moron", "score": 43, "replies": []}, {"body": "How dare the stock market act in ways you don’t like!\n\nThe nerve!", "score": 7, "replies": []}, {"body": "Lol, calling other people a Boeing Apologist while you own stock in the company and talk about principles.", "score": 12, "replies": [{"body": "I own a share of Tesla so the price won't get back up to my cost.  voodoo economics, dude", "score": 2, "replies": []}]}, {"body": "🫵🤡", "score": 15, "replies": []}, {"body": "Broke boy", "score": 0, "replies": []}]}]}, {"body": "It’s the US’ strategic commercial aircraft supplier, and major player involved in military aircraft. They could kill 100 people a day in perpetuity and the suits wouldn’t allow them to go belly up. \n\nAnd the “terrible news” is always minor maintenance issues that yield no injuries. The crash that killed people was years and years ago in a third world country", "score": 11, "replies": []}, {"body": "they haven't killed anyone in 3 months. wtf are you talking about ? are you seriously talking about the whistle blowers? LOL go read the actual fucking quotes you dumbass.", "score": 12, "replies": []}, {"body": "Tell us where the bad man hurt you", "score": 2, "replies": [{"body": "Went from this 🤌to this 🫶", "score": 2, "replies": []}]}, {"body": "You literally asked", "score": 1, "replies": []}]}]}, {"body": "More buyers than sellers. Hope this helps.", "score": 431, "replies": [{"body": "Too complicated. Head hurts now.", "score": 21, "replies": []}, {"body": "This is the way.", "score": 31, "replies": [{"body": "This is the way", "score": 4, "replies": []}]}, {"body": "That's not how the market works at all. \n\nFor every seller there's a buyer, and vice versa. \n\nThe real answer is the market was expecting even worse news, and this is getting off lightly.", "score": -81, "replies": [{"body": "Lmao.  Truly regarded. \n\nEvery trade has a counter party. \n\nMore people willing to be the counterparty moves the price either up or down. \n\nA real zero iq take from you.", "score": 67, "replies": [{"body": "Nah fam every stock stays at its IPO price forever apparently", "score": 21, "replies": [{"body": "Really? So, we were lied the entire time? Damn bruh. I better invest in Cryptozoo then", "score": 3, "replies": []}]}, {"body": "U just said it yourself dummy. Every trade has a counter party. Say it again. Every trade of every single stock has a buyer and seller. Still with me? One buyer can be buying 100,000 shares and 100 sellers can be selling 200 shares. So tell me how number of buyers vs sellers matters one bit? Geniuses i tell ya", "score": -4, "replies": []}]}, {"body": "Not sure why I even look for plays in this subreddit when regards like you lurk in every thread", "score": 14, "replies": []}, {"body": "Are you trolling?", "score": 6, "replies": []}, {"body": "I’ll use this as a copypasta", "score": 7, "replies": [{"body": "had the same thought", "score": 3, "replies": []}]}, {"body": "It’s truly remarkable how regarded you are.", "score": 2, "replies": []}, {"body": "Ahh yes, the market that trades one share at a time.", "score": 1, "replies": []}, {"body": "This is the most regarded thing I’ve heard in a while", "score": 1, "replies": []}, {"body": "Idk why you are getting flamed lol ppl are so dumb here. Yea every stock trade has a buyer and seller its just the buyers are willing to pay more and bidding price up and sellers deciding to sell for higher. Thats all, not “more buyers than sellers”. Shit there can be one buyer and 100 sellers and price goes up. And number of stocks sold=number of stocks bought.", "score": -8, "replies": [{"body": "Why do you think the buyers are willing to pay more. \n\nI’ll wait.", "score": 2, "replies": [{"body": "Because they bought all the stocks sellers had at the lower price and the sellers next up have a higher price set. What are you waiting for? Its not up to the buyer its up to the seller what its sold at", "score": -4, "replies": [{"body": "So you are saying there’s more demand than supply?", "score": 3, "replies": [{"body": "There can be more demand with less buyers. Idk what you are even trying to say. What part of my statement is wrong since u are acting so smart? And whats the right answer? Buyers vs sellers doesnt matter one bit. There is always a buyer and seller. What matters is what price are the sellers selling at. Are they willing to crash the price lower to get rid of shares quicker? Or are buyers willing to pay higher prices to get more shares quicker. Number of buyers and sellers means jack all. Theres no more buying than there is selling. Its the same number and that number is called the volume. So tell me where im wrong instead of your vague bs questions if you are so smart. Im waiting.", "score": -1, "replies": [{"body": "I’m saving this for copypasta.\n\nMore demand = higher prices, less demand = lower prices. \n\nDemand is created by the number of buyers being larger than the amount of supply. \n\nI hope you are just a kid because holy shit.", "score": 2, "replies": [{"body": "Hahahaha omg grow a brain. Do all these buyers and sellers sell the same amount of stock always? Like i just said. 1 buyer can be buying 100,000 shares and 50,000 sellers can be selling 1 share. So tell me in what fucking world, would number of buyers and sellers matter. Can u do simple grade school math? Jesus", "score": 1, "replies": []}]}]}, {"body": "Please do save it for a copypasta so people can see just how dumb you are. But thats what i thought u cant point to one thing and give the “correct” answer cause ya dont know shiet", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "CEO of Boeing here. Thanks for the new pool. Thanks for playing.", "score": 222, "replies": [{"body": "Haha", "score": 2, "replies": []}]}, {"body": "The hitman assassinated all the short sellers", "score": 34, "replies": [{"body": "Then who is going to buy back the shares to cover the short positions?", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 134, "replies": [{"body": "Cuttin costs, it's healthy, yo", "score": 15, "replies": []}, {"body": "'shooting star' - pretty fireworks display make stock go up. That's the way it works in defense.", "score": -1, "replies": []}, {"body": "Playin the long game\n\n\"Hehe yeah our rocket sucks but at least we didn't kill people!! #FuckSpaceX #BoeingOrNotGoing\" - Boeings CEO", "score": -3, "replies": [{"body": "Boeing didn't build the rocket, which worked fine.  They built the capsule.", "score": 2, "replies": [{"body": "A HA! ☝️", "score": 2, "replies": []}]}]}]}, {"body": "uncertainty has become certain", "score": 28, "replies": []}, {"body": "You don’t get .. don’t you.. it’s in the best interests of the US for Boeing to succeed…", "score": 24, "replies": [{"body": "Seriously.  I started making so much more money in the stock market when I understood how utterly corrupt American capitalism is.", "score": 3, "replies": []}, {"body": "Then why have such terrible management who are only in it to take as much value of the company for themselves? Wouldn't the US be putting the most talented people in executive and board positions?", "score": 5, "replies": [{"body": "It’s like your son is fucked up.. he is a grown up.. wtf you gonna do", "score": 22, "replies": [{"body": "beat some sense into him and let him dry out in his room for a couple weeks", "score": 4, "replies": [{"body": "Yup that's kinda what's going on.", "score": 11, "replies": []}]}]}, {"body": "Unfortunately, the “talented” people business schools are churning out are great at making money for themselves. But when it comes to actually running a successful company with a great product, most of them suck at that. Case in point all the corporate vulture firms who are great at dismantling and destroying long term prospects for a company to make a quick buck. \n\nIf only companies had leaders more like Lisa Su at AMD or Siddhartha Lal at Royal Enfield. Someone who was brilliant and ballsy enough to turn around an essentially extinct company to a market leader. ", "score": 5, "replies": []}, {"body": "Well Boeing used to be run by Engineers, who would move up into management later in their careers. Then a bunch of MBA dipshits over at McDonell Douglas ran their company into the ground, merged into Boeing, rather than being fired for running their company into the ground they were integrated into Boeings management structure. Being Chad MBAs and not nerdy dweeb Engineers they sharked their way to the top and ran all the Engineers out. Fast forward 30 years and Boeing starting to look a lot like McD, who could have ever guessed that would happen.", "score": 4, "replies": []}]}, {"body": "The USA just need Boeing to sell planes/weapons and create jobs. They don't care how well the stock does.", "score": 1, "replies": []}]}, {"body": "Once the bad news wears off investors just want to make money without feeling like an asshole. \nNo one really gives a shit about morals of companies they just want the green bucks.", "score": 60, "replies": [{"body": "Money over deaths", "score": 16, "replies": [{"body": "Pretty much.", "score": 7, "replies": [{"body": "That's why I like drone companies. Directly profiting from the deaths of others makes me feel like a real capitalist.\n\n\nI'd invest in sadness and cancer if I could, but settle for cigarettes and alcohol. ", "score": 12, "replies": [{"body": "Also called the s&p 500", "score": 11, "replies": []}, {"body": "I’d buy puts on Palestinian children’s lives for a %20 return.", "score": 2, "replies": [{"body": "Edgy", "score": 1, "replies": []}]}, {"body": "I see a path! Reit's, and Pharma will get you there, pharma pushes cancer sick to eventually mortgage homes to pay for expensive meds, lose home due to sickness, Reit moves in, outbids private home owners, flips home to rental at twice mortgage payment. Use divi's from both to buy drone company stocks. Light one up for yourself cause you've had a hell of a day? Edit: Spelling", "score": 1, "replies": []}]}]}]}, {"body": "I mean that or…. the people who made the managerial decisions that led to the rampant extremely dangerous defects being held to account is a market efficiency that benefits the disembodied company and its shareholders.", "score": 2, "replies": []}, {"body": "it's all about bucks kid. the rest is conversation", "score": 2, "replies": []}]}, {"body": "I think the only logical thing that can drive this stock down is a positive earnings report.", "score": 16, "replies": []}, {"body": "**Basic Principle:**\n\n* **Planes go up as intended = stock goes up.**\n* **Planes come down unplanned = stock goes down.**\n\nHere's the breakdown of the situation:\n\n1. **Shuttle Launch:**\n   * The shuttle successfully launched and reached the ISS. According to our principle, since it went up as intended, the stock goes up.\n2. **Current Situation:**\n   * The shuttle is now stuck at the ISS. This introduces an unusual scenario: it went up but hasn't come down, meaning the full operational cycle hasn't been completed.", "score": 12, "replies": [{"body": "My investment are more like the Titan submarine. It goes down and never comes back up", "score": 6, "replies": []}, {"body": "The shuttle’s been retired for almost 2 decades now bro, it’s a dinky little capsule we’re talking about here. You know like the ones a bunch of dudes with slide rules at North American Aviation were able to design and build almost 50 years ago to get us to the moon and back.", "score": 1, "replies": []}]}, {"body": "An undertaker once told me that death is a great business to be in", "score": 9, "replies": [{"body": "Very predictable revenue stream.", "score": 4, "replies": []}]}, {"body": "I'll attempt to explain this phenomenon. \n\nLimited number of companies in indices. \n\nEveryone and your  grandma and grandpa is in index funds.  S&P mostly with other popular indices all chasing the same sto ks.\n\nThere is an infinite amount of money all chasing the same indices so everything will always go up as there will always be net buyers then sellers unless the economy tanks.", "score": 8, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Over the long run, if you stay invested in s&p yeah you are really safe.  Thats been proven not only for s&p but for other indicoes as well.   Of course, if a company is mismanaged, it is going to go down.   But in general, most of the buying is via indices and in the long run, quality companies will keep going up too.\n\nAny unexplained move up for companies like boeing mosy like is a result of index funds that follow SP 500 or transports buying as 401k money flows in.  Retail isn't buying boeing", "score": 4, "replies": [{"body": "Ge", "score": 1, "replies": []}]}]}]}, {"body": "You bought puts, that's why ", "score": 7, "replies": []}, {"body": "I told you, calls on boeing, but y'all don't listen", "score": 5, "replies": []}, {"body": "Stocks only go up, dumbass", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "1/3 military 1/3 civil 1/3 services is roughly their ratio", "score": 4, "replies": [{"body": "services to civil or military?", "score": 1, "replies": [{"body": "Yes.", "score": 3, "replies": []}, {"body": "both", "score": 2, "replies": []}]}]}]}, {"body": "Simple econ: planes crash, fewer planes to go around, greater demand.", "score": 4, "replies": []}, {"body": "not as bad as it could have been for boeing", "score": 3, "replies": []}, {"body": "You must be new here🍻", "score": 3, "replies": []}, {"body": "Found the guy who thot puts would be easy money", "score": 3, "replies": []}, {"body": "Dropping dead weight", "score": 3, "replies": []}, {"body": "Because I brought puts ![img](emote|t5_2th52|4260)", "score": 3, "replies": [{"body": "Where’d you bring em?", "score": 1, "replies": []}]}, {"body": "Im assuming all of that is eclipsed by boeings offer to purchase Spirit. So theyre pricing in, the pricing in of spirit thats priced in to the priced in stock.....something something priced in.", "score": 5, "replies": [{"body": "Boeing offered to buy spirit??", "score": 0, "replies": [{"body": "spirit aerosystems.....", "score": 3, "replies": [{"body": "this guy fucks", "score": 1, "replies": []}]}]}]}, {"body": "Stock buy back.   You think Apple was getting its bumps from its amazing bullshit AI?", "score": 2, "replies": []}, {"body": "I mean if you're not even safe in space you best believe I'm buying the shit outta the stock.", "score": 2, "replies": []}, {"body": "When the stock hits 190$ buy puts", "score": 2, "replies": []}, {"body": "This is buy the rumor sell the news in reverse.", "score": 2, "replies": []}, {"body": "What use of charges if all whistleblowers are dead. People now probably have confidence that CEO took care of things", "score": 2, "replies": []}, {"body": "ayye fellas, we found someone who actually wants to make sense of the stock market haha.... nothing makes sense, either ride the train or get ran over", "score": 2, "replies": []}, {"body": "Short covering.", "score": 2, "replies": []}, {"body": "Boeing went up because it will not get destroyed. They will only get some fines (cost of doing business pretty much)", "score": 2, "replies": []}, {"body": "It’s on sale, maybe a bottom.", "score": 2, "replies": []}, {"body": "What other plane are you going to fly in CONUS? That's what I thought. Buy calls.", "score": 2, "replies": []}, {"body": "Half a trillion in backorders. Boeing will be A-ok", "score": 2, "replies": []}, {"body": "So basically what you're saying is it can't get any worse? Bullish!!", "score": 2, "replies": []}, {"body": "Almost 3 while percent? Damn, it's almost back to where it was a few months ago... Oh wait. No it's not even fucking close. Lol", "score": 2, "replies": []}, {"body": "War is coming. ", "score": 2, "replies": [{"body": "Buys more rtx and lmt", "score": 1, "replies": [{"body": "haha. im actually hoping boeing has more troubles and their stock plummets. would love nothing better than to pick up boeing stock for cheaper, like around $120", "score": 1, "replies": []}]}]}, {"body": "It was criminally undervalued. Our floor is at 165. Agent 747 could personally kill every astronaut on live television prompted by the arrest of Calhoun and we're not dropping below that. With that in mind, who were these pussies selling with only a couple bodies on the line at 190? Let's roll them dice.", "score": 2, "replies": [{"body": "Undervalued maybe, but criminally? It's sitting at the same valuation as Airbus now. And that with Airbus being profitable while Boeing hasn't been since 2018.", "score": 2, "replies": [{"body": "BA is made in USA and backed by Uncle Sam both financially and with a blind eye. It's that industry leading edge.", "score": 3, "replies": []}]}, {"body": "I see what you did there 🙂\n\nAssociating Boeing and criminals. Nice!", "score": 1, "replies": []}]}, {"body": "China taking deliveries again?  Perhaps they started ramping up production again? this is forward looking so in 3-4 months they could be back to 38 planes a month along with reducing they're back log of stored planes.", "score": 1, "replies": [{"body": "pretty sure a deal with Israel for 30 is closing soon.", "score": 3, "replies": []}]}, {"body": "Get used to it", "score": 1, "replies": []}, {"body": "its rigged\n\nduh", "score": 1, "replies": []}, {"body": "bull trap obviously.", "score": 1, "replies": []}, {"body": "Everyone betting this is last oversight snafu for production constraints......", "score": 1, "replies": []}, {"body": "It’s going to the moon!", "score": 1, "replies": []}, {"body": "there's more buyers then sellers? helps?", "score": 1, "replies": []}, {"body": "It’s gonna go back down. Anything from $160-169 is a buy for me", "score": 1, "replies": []}, {"body": "Bad news is good news", "score": 1, "replies": []}, {"body": "Im guessing you have puts lol", "score": 1, "replies": [{"body": "100%", "score": 0, "replies": []}]}, {"body": "disgusted office existence six rotten deer marvelous alive zesty unpack", "score": 1, "replies": []}, {"body": "all of that already priced in, not too bad outcome", "score": 1, "replies": []}, {"body": "It doesn’t matter. Nobody can call Boeing right just stay away too many other stocks out there. I’ve been recommending SMCI and TNA this week. Follow along next week for some more winners.", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "TSLQ is interesting here", "score": 1, "replies": []}, {"body": "Stupid regard", "score": 1, "replies": []}, {"body": "Keep your voice down they’ll hear you", "score": 1, "replies": []}, {"body": "Dave Portnoy punching the air rn", "score": 1, "replies": []}, {"body": "Op losing on puts", "score": 1, "replies": []}, {"body": "Just a bounce lol", "score": 1, "replies": []}, {"body": "The whistleblower keeps dying", "score": 1, "replies": []}, {"body": "An article came out about they just built a multi billion dollar facility for the potential NGAD production if they are awarded the contract.", "score": 1, "replies": []}, {"body": "It's because you bought puts.", "score": 1, "replies": []}, {"body": "Crammer said they need to prosecute Boeing so stocks go up as intended", "score": 1, "replies": []}, {"body": "One of the best airplane developers on Microsoft flight simulator released their awaited Boeing 777 for the game, people loved it", "score": 1, "replies": [{"body": "Hey 1984 is on the phone.", "score": 1, "replies": []}]}, {"body": "Sanctions against Boeing for previous mechanical failures had already been priced in, this wasn't news for anyone.\n\nTheir space stuff not working is not a game changer, it was the first real use of the rocket so of course there will be teething issues, SpaceX didn't become brilliant overnight. If the ship had a catastrophic failure, fair enough but it's some silly hydrogen issue and they arrived safely (any landing you can walk away from n all that).\n\nA lot of the news headlines recently about Boeing have been completely unrelated to the company. A 737 bought 20 years ago and suddenly has a tyre issue is not Boeing's fault, emergency decent on pressurisation failure was not a Boeing issue. Ever since the legitimate Boeing failures, any issue involving any Boeing plane has immediately got branded a Boeing issue and people didn't use their common sense to realise there is more things at play (such as the operator's maintenance teams).\n\nIn conclusion, Boeing had bad headlines months ago which got priced in, nothing since then has been significant enough to move the share price.\n\nHowever, my trades lose money so feel free to disregard that completely and inverse me", "score": 1, "replies": []}, {"body": "They hired a new CBO  ---  Chief Bolt Officer", "score": 1, "replies": []}, {"body": "Employee stock purchase program hits tomorrow", "score": 1, "replies": []}, {"body": "The bottom is around 165-185 especially after the CEO announced negative cash flow a few months ago.", "score": 1, "replies": []}, {"body": " Nothing fell off any planes this week I guess", "score": 1, "replies": []}, {"body": "An excuse to funnel them more money for mil/aero skunkworks under the guise of “misc expenses” during audit.", "score": 1, "replies": []}, {"body": "Aerodynamic lift bro", "score": 1, "replies": []}, {"body": "Think about what your gut, instincts, and knowledge tells you about the direction the stock should go, then do the opposite", "score": 1, "replies": []}, {"body": "Next week after your Puts are worthless, this is the way of Wall Street", "score": 1, "replies": []}, {"body": "People who don't have Elon's cock in their mouth?", "score": 1, "replies": []}, {"body": "The market hates nothing more than uncertainty. In regard to Boeing, there was more uncertainty yesterday than there is today.", "score": 1, "replies": []}, {"body": "Mania over common sense.  Prepare.", "score": 1, "replies": []}, {"body": "Bad news = good news. Bers r fuked", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "Corporate assassination squads: very bullish", "score": 1, "replies": []}, {"body": "They found out I bought puts and had a meeting.  The vote went like this “He bought puts.  Fuck this guy, am I right?” An eruption of I’s.  “The I’s have it.  Fuck this guy.”", "score": 1, "replies": []}, {"body": "When stocks go down on good news \"It was already priced in\". When stocks go up on bad news \"It was already priced in\". The algo that is running the market making millions of trades a second \"uh, I'm just reacting to price points and posts on twitter, like I give a fuck\".", "score": 1, "replies": []}, {"body": "Has one whistleblower survived? No? Bullish.", "score": 1, "replies": []}, {"body": "You’re deep in the dunning kruger valley gambling with people that have far more information and resources than you. Expect mixed results at best", "score": 1, "replies": []}, {"body": "OP: I just bought options why is not down 50%", "score": 1, "replies": []}, {"body": "Well you see..when selling pressure stops, stock tends to go back up.", "score": 1, "replies": []}, {"body": "Dave Calhoun did a company meeting and answer Q&A from the employees as well as address concerns and visions for what he plans on doing on Wed 26th", "score": 1, "replies": []}, {"body": "America will collapse before it lets Boeing die. That's why. The institutional momentum behind this company is absurd.", "score": 1, "replies": []}, {"body": "Priced in.", "score": 1, "replies": []}, {"body": "Boeing has decided Shorters get the whistle blower treatment", "score": 1, "replies": []}, {"body": "Boeing makes things that are actually designed to kill people bro. They do well at it. Defense and war aren’t going away. Boeing isn’t going down the toilet because your puts are fucked.", "score": 1, "replies": []}, {"body": "BA is definitely manipulated by Wall street heavily. This is basically the US version of Mikoyan.", "score": 1, "replies": []}, {"body": "The news that Airbus is having delivery issues reduces the risk of more airlines jumping from Boeing is really great news.", "score": 1, "replies": []}, {"body": "3% is not news.", "score": 1, "replies": []}, {"body": "Bullish", "score": 1, "replies": []}, {"body": "Honestly, it doesn't really change the business outlook, considering that Airbus is the only competition. They're both having a tough time living up to the current demand as it is.\n\nSucks, but that's how it works.", "score": 1, "replies": []}, {"body": "Bro u know Boeing is military industrial complex too important to fail, and shit is heating up for our \"greatest ally\" in the middle east where they're trying to open up a second and third front to their war and kick off world war III", "score": 1, "replies": []}, {"body": "Don’t stress it. You’ll pop a bolt or something.", "score": 1, "replies": []}, {"body": "Another crash is priced in.", "score": 1, "replies": []}, {"body": "Looks like you were born yesterday", "score": 1, "replies": []}, {"body": "Stocks like this tend to rise once the penalties become clear.  It often occurs.", "score": 1, "replies": []}, {"body": "At this point, it is pretty much obvious that boeing will start murdering people to keep the stock high, they really care.", "score": 1, "replies": []}, {"body": "If Boeing taught us anything it's that what goes up must come ..crashing down killing everyone involved.", "score": 1, "replies": []}, {"body": "I know why. Airbus announced something about they cant take Boeings share of the market and is backlogged. Makes boeing look decent", "score": 1, "replies": []}, {"body": "goes up bc in the future they get something right lol. stocks isn't the economy or something, but I agree if you're having issues why wouldn't it be dropping or stay flat?", "score": 1, "replies": []}, {"body": "Sir, this is a casino", "score": 1, "replies": []}, {"body": "Corruption is a hell of a drug.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "the fact that some of you think that logic and reason guide stock prices always amuses \n\nthey don't call it speculation for nuttin'", "score": 1, "replies": []}, {"body": "Whacking whistleblowers is called good ass guidance.", "score": 1, "replies": []}, {"body": "Bottom probably in.  They just sent a rocket into space, pretty cool in my opinion.", "score": 1, "replies": []}, {"body": "Guess killing their customers does pay off.", "score": 1, "replies": []}, {"body": "\"It's possible that we are in a completely fraudulent system.\"", "score": 1, "replies": []}, {"body": "> DoJ recommends charges\n\nThat's the thing, BOEING has basically proven that they're bulletproof, they can have the whistleblowers killed, and the U.S. Congress can't do anything except a verbal scolding", "score": 1, "replies": []}, {"body": "Pump and dump lol", "score": 0, "replies": []}, {"body": "It's because the shuttle explosion in 2 weeks is already priced in", "score": 0, "replies": []}, {"body": "Boeing is a ghey boomer stock", "score": 0, "replies": []}, {"body": "I realized it wasn’t time to buy the dip yet as yesterday I literally selected flights avoiding the use of the Max line of Boeing. I’ve never done that before but I’d rather not have the plane im in drop out of the sky, especially over the ocean.", "score": -2, "replies": [{"body": "only scared regards do that.", "score": 2, "replies": []}, {"body": "Just take some swimming lessons.", "score": 2, "replies": []}]}, {"body": "Maybe a lot of covering. May be that big volume runners see this as a perfect liquidity trap and basically capture and run our markets anyways, so for them the only question is, how much liquidity can we gobble up. That makes for a different game to play.", "score": -1, "replies": []}, {"body": "Basically airbus has production issues meaning that CEOs are going to have to choose between making slightly less profit or putting you into a flying death trap. The choice they made is reflected in the price.", "score": -1, "replies": []}]}
{"title": "Loss update 655k", "selftext": "Reloaded 100k\n\nThese are the biggest options holdings: \n\nTSLA 29k\nCORZ 42k\nNVDA 10k\nSPWR 10k \nMU 6.5k\n\n\n", "id": "1dpxm9y", "created_utc": 1719510982.0, "score": 2108, "upvote_ratio": 0.95, "num_comments": 727, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 89 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "I'm up 23k this month. Thank you CCL", "score": 2, "replies": []}, {"body": "thanks for making me feel better about losing  300 this past month", "score": 1, "replies": []}]}, {"body": "thx for makin me feel better abt my 5k loss today", "score": 1837, "replies": [{"body": "Thanks for making me feel better about losing $350 today", "score": 604, "replies": [{"body": "Thanks for making me feel better about losing $60 today", "score": 398, "replies": [{"body": "Thanks for making feel better about not trading today.", "score": 515, "replies": [{"body": "Thanks for making feel better about not trading this month.", "score": 213, "replies": [{"body": "Thanks for making me feel better about never trading and spending all my money on blow and hookers. I lost the same…. But blow and hookers!", "score": 291, "replies": [{"body": "Thanks for making me....dad", "score": 97, "replies": [{"body": "Thanks", "score": 10, "replies": [{"body": "Th", "score": 10, "replies": [{"body": "T", "score": 3, "replies": [{"body": ".", "score": 5, "replies": [{"body": "*tumbleweed*", "score": 4, "replies": []}, {"body": "Thanks for feeling….", "score": 3, "replies": []}]}]}]}]}, {"body": "Chicken or the egg?", "score": 7, "replies": []}]}, {"body": "Thanks for making me feel better about my $709 profit today.", "score": 25, "replies": [{"body": "Thanks for making me feel better of my -12k nvidia loss 😂", "score": 11, "replies": [{"body": "This will end with Musk feeling better about his $20bn SpaceX reevaluation", "score": 4, "replies": []}]}]}, {"body": "I bet this was more enjoyable way to spent👌🏻", "score": 20, "replies": [{"body": "Hooker calls all damn day.", "score": 2, "replies": [{"body": "Then pick up foo...she wanna give you that hawk twah", "score": 3, "replies": [{"body": "Calls on Valtrex", "score": 5, "replies": []}]}]}]}, {"body": "Did you say “butt blow” v", "score": 4, "replies": []}, {"body": "Hunter?", "score": 2, "replies": []}, {"body": "Hunter, is that you?", "score": 2, "replies": []}, {"body": "https://preview.redd.it/nsyqp4lwyc9d1.jpeg?width=1920&format=pjpg&auto=webp&s=9defcf080616a520b17f56b37e6ce0e36db9b0a9", "score": 2, "replies": []}]}, {"body": "Thanks for making me feel better about my wife leaving me.", "score": 3, "replies": []}]}, {"body": "Thanks for the memories even though they weren’t so great", "score": 31, "replies": [{"body": "Thanks for making me feel better about my small PP", "score": 33, "replies": [{"body": "🤣", "score": 3, "replies": []}]}, {"body": "Wait...you guys lost money today?", "score": 13, "replies": [{"body": "You guys still have money?", "score": 18, "replies": [{"body": "You guys had any money to begin with to lose?", "score": 10, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}]}, {"body": "He tastes like you only sweeter", "score": 1, "replies": []}]}, {"body": "you are the  true winner of this day", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|31226)", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about losing my job today", "score": 1, "replies": []}, {"body": "this... slept in and missed any time to trade.. ate an old tigers milk bar from the cupboard instead..", "score": 1, "replies": []}]}, {"body": "Thanks for making me feel better about a quarter falling out of my pocket today.", "score": 6, "replies": []}, {"body": "Thanks for making me feel better about losing  $0 cause im still holding my losses", "score": 5, "replies": []}, {"body": "Ha, I only lost 30 bucks so far xD", "score": 9, "replies": [{"body": "Not feeling too bad about losing $120 today.", "score": 1, "replies": []}]}, {"body": "Thanks for making me feel better about losing $2.68 today", "score": 5, "replies": []}, {"body": "thanks for making me feel better about losing $20 today", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about only making $45 yesterday", "score": 1, "replies": []}]}, {"body": "Down 270", "score": 1, "replies": []}, {"body": "Right I lost $250 on MU earnings and this makes me feel like I’m up 300%", "score": 0, "replies": []}]}, {"body": "Thank you for making me feel better about my $871 loss today\n\nhttps://preview.redd.it/snv0r018s69d1.jpeg?width=1440&format=pjpg&auto=webp&s=a9fc0a501507284c4511083c88d2a1ea9846d880", "score": 26, "replies": [{"body": "Excellent record, Can you let me know your next option purchase? So I can obviously inverse the shit out of it.", "score": 17, "replies": [{"body": "I was thinking Nike calls after the massive dip", "score": 8, "replies": [{"body": "Thanks bub. Waiting until Monday, I’m seeing alot of people saying “cool” PCE tomorrow. Might skew my numbers.", "score": 1, "replies": [{"body": "That was bull shit! I knew Amazon would come down a few bucks I just mistimed the entry. Fml ![img](emote|t5_2th52|4267)", "score": 1, "replies": []}]}]}]}]}, {"body": "🍻", "score": 11, "replies": []}, {"body": "Thanks for making me feel better about my $151 loss today", "score": 6, "replies": []}, {"body": "Thanks for making me feel better about my LEAP calls going down .05 today ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "He is a millionaire and you are not!", "score": 1, "replies": []}, {"body": "Thanks for making feel better about my 2.3k loss today", "score": 1, "replies": []}, {"body": "Thanks for reminding me how it feels being on the moon 🤣\n\nhttps://preview.redd.it/vd5bqhac9e9d1.jpeg?width=550&format=pjpg&auto=webp&s=6b77f0fd63df365612ea06259f69a01eeaf5dd71", "score": 1, "replies": []}, {"body": "I lost 6k so I guess this is nice", "score": 1, "replies": []}]}, {"body": "Wow my 2k losses ain’t shit!!! I gotta step up!!", "score": 432, "replies": [{"body": "I believe in you.", "score": 56, "replies": [{"body": "Just gamble more in options!", "score": 1, "replies": []}]}, {"body": "I moved just about everything into Walmart right before the slump. Down $1,200 this week.", "score": 12, "replies": []}, {"body": "Even my 6k loss is nothing compared to this. Gratz OP", "score": 4, "replies": [{"body": "thanks for making me feel better  about my 7k loss", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 481, "replies": [{"body": "No it won't, I wish I had $126,000", "score": 215, "replies": [{"body": "Yeah, I wish I even had 655k to lose in the first place", "score": 101, "replies": [{"body": "yeah... if I had 655k I would not even need to gamble", "score": 57, "replies": [{"body": "That’s the truth!", "score": 7, "replies": [{"body": "No it isn't, lol", "score": 1, "replies": [{"body": "it depends on where you live, but in my example, if it is one of the European countries, this amount would allow me to live well for the rest of my days 😏", "score": 1, "replies": [{"body": "How many days is that?", "score": 1, "replies": []}]}]}]}, {"body": "You would if it was your dad's money and you needed to prove to your old man you are not a worthless mooching loser in order to stay in the will.", "score": 1, "replies": [{"body": "damn out of the will and out of money double whammy", "score": 2, "replies": []}]}, {"body": "Man, I'm trying to become an expat and figure out what country I wanna move to I can live comfortably for 2k a month.  If I had 655k to kick off that venture, I'd buy a rental property where I live now, and go move to wherever and buy a nice ass house and live like a king.", "score": 1, "replies": []}, {"body": "what would you do with 655k that is safe yet would provide an income? \n\nNot that I have that but wondering anyways", "score": 1, "replies": [{"body": "Not 0DTEs thats for sure. ![img](emote|t5_2th52|52627)", "score": 9, "replies": []}, {"body": "a lot of busy ppl with a pile $ go to a financial advisor. a good one will be managing in the 9 figures.", "score": 5, "replies": [{"body": "Who needs financial advisors when you have WSB?", "score": 2, "replies": []}]}, {"body": "Pay off my mortgage, help my family and friends as much as I could, donate a portion to charity and then put a percentage away in a growth fund and leave it.", "score": 2, "replies": [{"body": "I must be living in the wrong region or different time from you cause these days and where I am at I can't do a fraction of that with 600k. A typical mortgage alone is 800k", "score": 3, "replies": [{"body": "where you at? here is one house from where I am at, you can find cheaper too [https://www.realtor.com/realestateandhomes-detail/7987-E-43rd-Ln\\_Yuma\\_AZ\\_85365\\_M90536-40578?from=srp-list-card](https://www.realtor.com/realestateandhomes-detail/7987-E-43rd-Ln_Yuma_AZ_85365_M90536-40578?from=srp-list-card)", "score": 1, "replies": []}]}]}, {"body": "655k in spy is about 16k/year in dividends, in high dividend stocks like Keycorp that would be 39k/year. 16k/year is enough to pay rent in various areas. by putting it in a high dividend stocks you can start paying a mortgage. The amount of dividend that 655K produces is not life changing but it certainly takes away many worries and increases the ability to save. SPY would be the best option because of the continuous appreciation. If anything, this has made me realize that I do not need to make 10mil my goal instead it should be 1mil.", "score": 2, "replies": []}]}]}, {"body": " This fucker is still winning when 126k is more than I've ever had.. ![img](emote|t5_2th52|4271)", "score": 20, "replies": []}, {"body": "$10k would make a huge difference to me, this guy has over 10x that left. Needs to stop whining, or give me $10k the gamble the rest away.", "score": 18, "replies": [{"body": "You sound poor", "score": 4, "replies": []}, {"body": "I agree! Give us both $10k!", "score": 7, "replies": [{"body": "Give us 3!", "score": 3, "replies": []}]}, {"body": "What will u do with 10k", "score": 1, "replies": [{"body": "Mostly pay off some credit card debts I had to get into due to the mortgage crisis last year absolutely fucking us. Having to work less to help my dad with his cancer as well so going to be trickier paying it off but should still be doable", "score": 2, "replies": []}]}]}, {"body": "If I had that much, I'd retire right now. Maybe I'd play 10k on the market but that's it.", "score": 2, "replies": []}]}, {"body": "Just don't be poor. EZ", "score": 6, "replies": [{"body": "How don't more people know this one simple trick!", "score": 3, "replies": []}]}, {"body": "real", "score": 1, "replies": []}]}, {"body": "Nah. I'd kill to have what he has after all that loss.", "score": 1, "replies": []}, {"body": "You know there are other emojis out there you brainless regard", "score": -5, "replies": [{"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 6, "replies": []}]}]}, {"body": "Did you make money on meme stocks and decided to give it back or money came from another source?", "score": 134, "replies": [{"body": "His dad worked at coal mine for 45 years for it", "score": 185, "replies": [{"body": "makes me think of all my student loans I am gambling", "score": 13, "replies": []}]}, {"body": "Why are you personally attacking me?", "score": 5, "replies": []}, {"body": "Even with a free source of money, imagine having 650k to gamble and using Robinhood as a broker.", "score": 2, "replies": []}]}, {"body": "Now this is pod racing. ", "score": 454, "replies": [{"body": "Now this is star wars acolyte. The power of 1, the power of 2, The power of many losses", "score": 73, "replies": []}, {"body": "I *HATE* SAND!", "score": 5, "replies": [{"body": "It’s coarse, and rough, and gets better gains than my portfolio.", "score": 1, "replies": []}]}, {"body": "Oh my god.. I'm gonna...", "score": 9, "replies": [{"body": "Bust a move! ![img](emote|t5_2th52|4276)", "score": 10, "replies": [{"body": "Gotta groove.", "score": 1, "replies": []}]}]}, {"body": "TRON lightcycle Power run !!!", "score": 6, "replies": []}, {"body": "Yes?", "score": 1, "replies": []}]}, {"body": "My goal in life is to be able to lose $600k and not care enough to post it Reddit for shits n gigs.", "score": 91, "replies": [{"body": "Every upvote on this picture cost him 400$.", "score": 19, "replies": []}]}, {"body": "Why you hate money", "score": 245, "replies": [{"body": "Past trauma", "score": 44, "replies": []}, {"body": "Because he looked at the money and it looked back at him?", "score": 37, "replies": [{"body": "He had to do it. The money was staring at him. Menacingly.", "score": 13, "replies": []}, {"body": "OP was definitely mad at their money.", "score": 1, "replies": [{"body": "OP is Cramer?", "score": 2, "replies": []}]}]}, {"body": "He’s just donating it to people more fortunate than him. ", "score": 13, "replies": []}, {"body": "blame it on Andrew Jackson", "score": 1, "replies": []}, {"body": "It's his parents money. He hates them because of years of neglect due to the fact they are always at work.", "score": 1, "replies": []}]}, {"body": "God damn, you could’ve opened a Wendy’s ™️ franchise with that and had your own army of sex slaves\n\n![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)![img](emote|t5_2th52|52627)", "score": 115, "replies": [{"body": "Damn... I want my army of sex slaves! ![img](emote|t5_2th52|4260)", "score": 18, "replies": [{"body": "well you can too! just have 655K laying around", "score": 14, "replies": []}, {"body": "Just look around here, I'm pretty sure OP is looking for a side gig right now ![img](emote|t5_2th52|52627)", "score": 3, "replies": [{"body": "Theres always a side gig at the back of Wendy’s.", "score": 1, "replies": []}]}, {"body": "Not this army you don’t.", "score": 1, "replies": []}]}, {"body": "Not interested in the first part but how can I achieve the second part? I still have all of my organs, I think I can muster up enough if need be.", "score": 1, "replies": []}]}, {"body": "What kind of sorcery is this? Where do regards get this kind of money to blow?", "score": 92, "replies": [{"body": "Inheritance and trust funds.\n\nOr daddy.", "score": 64, "replies": [{"body": "sugar daddy\\*", "score": 2, "replies": []}, {"body": "Don't forget it's 2024. Mommies have money too.", "score": 1, "replies": []}]}, {"body": "It’s called a job ![img](emote|t5_2th52|4271)", "score": 10, "replies": []}, {"body": "Work hard.", "score": -19, "replies": [{"body": "You worked hard and blew it for this?  Dude, that's fucking sad.", "score": 9, "replies": [{"body": "Thinking middle class is as good as it gets\n\nJust as sad ![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "Lol. If you only knew.", "score": 2, "replies": []}]}]}, {"body": "Honestly, I'm not sure if I believe you, the way you're throwing around numbers like this", "score": 6, "replies": []}, {"body": "I always wonder, how can you earn so much money and make such stupid decisions?", "score": 2, "replies": [{"body": "Wendys assistant manager ![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|8882)", "score": 5, "replies": [{"body": "Promotion for Wendy Asset Manager incoming ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}]}]}, {"body": "HOLY FUCK", "score": 37, "replies": [{"body": "At least his is going the right way, sick of all these green lines, get that weak shit outta here", "score": 6, "replies": []}]}, {"body": "Lost over 40k today. I feel better.", "score": 31, "replies": [{"body": "Cheers homie", "score": 17, "replies": []}, {"body": "Lost 40k how", "score": 1, "replies": [{"body": "How?", "score": 1, "replies": []}]}]}, {"body": "I'm hoping for OP it was easy money to begin with, like from a previous yolo because it would be heart breaking if they were hard earned money from years of 9to5, either OP's or inherited.", "score": 28, "replies": [{"body": "Would it be worse if it was from grandma's last will and testament or of it was 20 years of work savings?", "score": 2, "replies": []}]}, {"body": "Really outdid everybody on this sub this month, congrats!", "score": 23, "replies": []}, {"body": "Brother... you still have more to YOLO!", "score": 64, "replies": [{"body": "And YOLO we will", "score": 87, "replies": [{"body": "You will win big time\n\n🙏🙏🙏", "score": 16, "replies": []}, {"body": "How much YOLO left?", "score": 3, "replies": [{"body": "Got plenty of ammo to play with.", "score": 1, "replies": []}]}]}, {"body": "If we YOLO twice? Does that mean YOLT?", "score": 15, "replies": []}]}, {"body": "Not great, not terrible.", "score": 18, "replies": []}, {"body": "Thanks for making the whole of WSB feel better ![img](emote|t5_2th52|4271)", "score": 15, "replies": []}, {"body": "https://preview.redd.it/wm8n10mrx69d1.jpeg?width=634&format=pjpg&auto=webp&s=a5db533935b9a0453b0bf639a3fa292b6a66c1dc", "score": 12, "replies": [{"body": "Even survives in space.", "score": 0, "replies": []}]}, {"body": "hey bud ur doin gr8, keep folow ur dreams and nevr give up ok cheers", "score": 26, "replies": [{"body": "And never *ever* stop and ask yourself “is this going well? Am I good at this?”", "score": 8, "replies": []}]}, {"body": "Thank you for your donations and for raising the morale of the entire subreddit. ![img](emote|t5_2th52|8882)", "score": 10, "replies": []}, {"body": "Wow, this bad of a loss in a bull market…..", "score": 7, "replies": [{"body": "Can't be a bull market if inflation keeps market at an all time high. If we print a couple more trillion the market will go up. Inflation will naturally keep the market increasing.", "score": 1, "replies": []}]}, {"body": "Jesus wept", "score": 9, "replies": []}, {"body": "Generational lost opportunities.  Unreal.", "score": 7, "replies": []}, {"body": "Congrats and fuck you", "score": 7, "replies": []}, {"body": "Thanks and I was worried about my $2k.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "That’s the plan", "score": 4, "replies": [{"body": "Please post your calls and puts I will follow you like they followed Gump when he ran across America", "score": 3, "replies": []}]}]}, {"body": "*Dude. Stop. You beyond suck balls at this. Donate your money to charity if you want to keep throwing it away…*", "score": 17, "replies": [{"body": "Donate it to me I'll atleast put it to good use one copius amounts of alcohol, then it's not just throwing it away ![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "Would he rather give it to some rich fucker on wallstreet or some poor fucker on wallstreetbets?", "score": 2, "replies": [{"body": "If it were me I'd give it to the rich fucker because that rich fucker might have to give me back more than I gave him", "score": 1, "replies": []}]}]}]}, {"body": "All you’ve literally done is lose with massive amounts of money. I doubt you reloading with 100k will be any different.", "score": 11, "replies": [{"body": "I really want to know what his strategy is so I know to inverse that place", "score": 7, "replies": [{"body": "He put his newest positions in the description\n\nEdit: Sorry, no he didn't. Not specifics anyway.", "score": 2, "replies": []}]}, {"body": "His strategy is clearly called “gamble and hope”", "score": 1, "replies": []}]}, {"body": "I literally was down like 96% and bought CORZ myself. Of course I got it at 0.10 a share (no options because it's too hard to know when it will moon) and have held for 16 months but it totally turned me to being up 68% all time. You're going to do great 👍👍", "score": 10, "replies": [{"body": "Nice entry.  You and those who got warrants made out.", "score": 6, "replies": [{"body": "Best exit from ch11 I've ever seen.", "score": 6, "replies": []}]}]}, {"body": "My 85k has the exact same chart lol! If you have that much left buy far dated calls into spy or qqq and just wait a year or more", "score": 6, "replies": [{"body": "The moment he does that within a few months the market will have a big correction. lol", "score": 1, "replies": [{"body": "That’s funny cos I lost out on aapl and spy calls I kept piling onto in April but paper handed before rebound", "score": 1, "replies": []}]}]}, {"body": "Imagine gambling 655k… HOLY SHIT", "score": 5, "replies": []}, {"body": "You could ski down that", "score": 5, "replies": [{"body": "Double black", "score": 3, "replies": []}]}, {"body": "Bro was almost at a million omg", "score": 5, "replies": []}, {"body": "This doesn’t make me feel better. This actually pisses me tf off… here I am 28 years old trying to move out of my parents and buy my first house and here is your dumbass literally losing a house I couldn’t even afford…", "score": 4, "replies": [{"body": "Whether you think you can or cannot. . .you are correct.", "score": 4, "replies": []}]}, {"body": "$800k is just enough money to move to a cheap country and live relatively comfortably without ever working again. Yeah, I know that it's nothing compared to the thrill of blowing it all on your phone's screen, but just to put in perspective, how much you gave up ...", "score": 5, "replies": []}, {"body": "You hate money", "score": 8, "replies": []}, {"body": "People were giving me shit alllll day in DMs about starting with 650k and pushing it to a milly. See, this is the outcome I did NOT want, but I applaud this man for his dedication", "score": 8, "replies": [{"body": "Yep, takes balls to do this and post the losses. Salute to OP ![img](emote|t5_2th52|8882)", "score": 2, "replies": []}]}, {"body": "This one fucking hurts, sorry OP.", "score": 4, "replies": []}, {"body": "Damn son ![img](emote|t5_2th52|4275)", "score": 3, "replies": []}, {"body": "Jesus Christ….at least tells us how you got there", "score": 5, "replies": [{"body": "It’s 3 years of losing; TSLA FB DIS were big losers for me . Lots of long term expiry’s but also short calls.", "score": 6, "replies": []}]}, {"body": "We appreciate your contributions:)", "score": 3, "replies": []}, {"body": "Look at it this way though OP: You got a kick-ass flair now that may get you free tendies at the local wendy's!", "score": 5, "replies": []}, {"body": "And you still don't feel anything, do you?", "score": 4, "replies": [{"body": "   _", "score": 8, "replies": []}]}, {"body": "See you at Wendy’s", "score": 4, "replies": []}, {"body": "ALL HAIL TODAY’S KING!", "score": 3, "replies": []}, {"body": "Crown this man.", "score": 3, "replies": []}, {"body": "Let’s form a bag holding club.", "score": 4, "replies": []}, {"body": "NVDA is in a range MU guidance is a miss TSLA is TSLA and SPWR is dying. \n\nAnd you probably have/had nearly 100% of your account holding options at every point in this graph. \n\nYou belong here", "score": 3, "replies": [{"body": "Ty", "score": 1, "replies": [{"body": "Listen man you really can make that all back, but your entire approach has to change. Try and build it up slowly (I would put MAX 5K in options and leave the rest 120K in cash) so like 4% at a time. Play it safe", "score": 2, "replies": []}]}]}, {"body": "Guess he doesn’t mind working another 10 years", "score": 6, "replies": []}, {"body": "I didn't hear no bell? did any y'all hear one?", "score": 6, "replies": [{"body": "It’s 6 46 closing bell was at 4 my Wi-Fi was down but I’m sure on Bloomberg the bell rung and everyone cheered\nWell not op", "score": 1, "replies": []}]}, {"body": "Lost 655k, reloaded 100k\n\nTruly a moron of the highest order", "score": 6, "replies": []}, {"body": "For the love of God just let it collect the 5% APY in RH and you’d be up so much ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271) a true regard! ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "My guy! What is going on?", "score": 3, "replies": []}, {"body": "My regards, regard.", "score": 3, "replies": [{"body": "🫡", "score": 1, "replies": []}]}, {"body": "Go to a meeting bro", "score": 3, "replies": []}, {"body": "At $700k portfolio levels all you had to do is buy the index fund, STFU, do nothing and hit $1MM by Q2 of 2025. \n\nBut nope OP wanted that lambo cocaine hooker mansion money so bad he decided to gamble away his life savings on options.\n\nMe thinks OP is a trust fund baby and this is his gambling account.\n\nOP stop trying to chase these 1000% lotto shot options return post that you keep seeing. These regards just happen to be insanely lucky buying the right FD OTM position right before the underlying took off to the moon. They were stupid and lucky OP. You don't have their luck.", "score": 3, "replies": [{"body": "No trust fund or inheritance here .", "score": 2, "replies": []}]}, {"body": "I can see where you went into options.", "score": 3, "replies": [{"body": "Always was.", "score": 1, "replies": []}]}, {"body": "thank you for making me feel good about my $19.5k loss", "score": 3, "replies": [{"body": "Cheers!", "score": 1, "replies": []}]}, {"body": "You would have more success following some of the regarded DD on this sub. Seriously. \nWho’s money are you setting on fire? Trust fund kid? Grandma died?", "score": 3, "replies": [{"body": "I’ll be follow some DD on here.  What should I look at?", "score": 1, "replies": []}]}, {"body": "Holy shit. I felt bad about my total losses. I’m not even at 10% of this total!! You’ve given me hope to get back into the casino!!", "score": 3, "replies": [{"body": "🍀", "score": 2, "replies": []}]}, {"body": "Down 650k \"Reloaded 100k\"\n\nFuck you", "score": 3, "replies": []}, {"body": "Can you please write an update to Market Wizards? Market Wiztards would be a good title. On a serious note they say you learn the most when you fail so I think you leaned a lot :)", "score": 3, "replies": [{"body": "🧮", "score": 2, "replies": []}]}, {"body": "damn i made 4k on a 150 bet on spy 0dte last week and then turned 2k of that into another 4k the next day doing the same thing and then promptly took a 2k loss trying again and again by the end of the week. Promptly freaked out, transferred 4k to an HSA for dental work and bought a MacBook with what was left. \n\n  \nAnd I thought I was regarded.", "score": 3, "replies": []}, {"body": "Start building again brother 💪 from a regard who lost over 100k as well", "score": 3, "replies": [{"body": "Just saying it was 6 mo. ago when I lost everything I was devastated, borderline thinking of the rope. Fast gwd back to 28k, slowly building will only play option with 5k", "score": 4, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "🫡", "score": 2, "replies": []}]}, {"body": "You lost this on Meta that’s 5x’d since the Ukraine war kicked off..\n\nImpressive", "score": 3, "replies": []}, {"body": "yo can i get like 5k, I'll lose it for you", "score": 7, "replies": []}, {"body": "Don't worry, you still have 16.18 percent to YOLO.", "score": 2, "replies": []}, {"body": "You toned it down quite a bit with those 3 calls. Keep at it twin", "score": 2, "replies": []}, {"body": "We appreciate your liquidity o7.", "score": 2, "replies": []}, {"body": "This is me in the future lol", "score": 2, "replies": []}, {"body": "How", "score": 2, "replies": []}, {"body": "Thank you for making me feel better.", "score": 2, "replies": []}, {"body": "Bro. Did you even try?![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "I am so erect rn", "score": 2, "replies": []}, {"body": "Wtf got dayum!!", "score": 2, "replies": []}, {"body": "World Series of Poker Main Event is in like two weeks. Maybe you’re better with cards?", "score": 2, "replies": []}, {"body": "Incredible 👏👏", "score": 2, "replies": []}, {"body": "Jesus", "score": 2, "replies": []}, {"body": "Jesus fuck bud", "score": 2, "replies": []}, {"body": "Just donate your money to us, it’ll feel less painful than seeing that.", "score": 2, "replies": []}, {"body": "makes my 34k loss seem like I lost a nickel between the cushions.", "score": 2, "replies": [{"body": "Bought too many pickles", "score": 1, "replies": [{"body": "It happens. Hopefully they were kosher.", "score": 2, "replies": []}]}]}, {"body": "It's so funny that we all have to exact same chart pattern", "score": 2, "replies": []}, {"body": "Thanks for making me feel better about still being down 200k from the 2021 peak. Margin effed me so hard.", "score": 2, "replies": [{"body": "I feel you… I got margined out of 5-90k gain on btc on a flash crash .", "score": 2, "replies": []}]}, {"body": "What options are you holding for Corz? \n\nThat could payout big time", "score": 2, "replies": [{"body": "https://preview.redd.it/fnvcwnop179d1.jpeg?width=1290&format=pjpg&auto=webp&s=f86f83344ddbd283e3564fee6fe66e8ed9249b50", "score": 1, "replies": [{"body": "Good luck. I want to enter a leap position soon just want to get a better entry", "score": 2, "replies": [{"body": "Thanks. I like CORZ . It’s a big BTC play.", "score": 2, "replies": [{"body": "Entered into Corz last week.\n\nUp nicely on my position \n\n🙏🏻🙏🏻 big thank you on the tip", "score": 2, "replies": [{"body": "Congrats!  I sold out 10k and bought OTM weekly’s for 2k  in case it pops again so took in 8k of gains .", "score": 2, "replies": [{"body": "I got leaps so I’m gonna let it ride a bit", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Now remember, you lost an amount equivalent to a small house or a condo.\nAlways remember that.\nNever forget.", "score": 2, "replies": [{"body": "More like a bathroom remodel.", "score": 1, "replies": [{"body": "Condos are like 400k to 800k", "score": 1, "replies": []}]}]}, {"body": "all i'm seeing is you've still got dry powder for 0dte SPY options", "score": 2, "replies": [{"body": "My man.", "score": 1, "replies": []}]}, {"body": "May the tendies be with you.", "score": 2, "replies": []}, {"body": "This is the shit wsb is built on \n\nWell done", "score": 2, "replies": []}, {"body": "All-time bag fumble", "score": 2, "replies": []}, {"body": "OPs got some magic going on. 1 month ago he shared in a post titled \"diamond hands broke me\" that he was down 623k and had 16k left. Now he has lost more money and is down 655k yet he has 126k left. The more he loses, the more he has!  \n\nAnd if he can afford to add 140k+ per month this loss is merely a flesh would.", "score": 2, "replies": [{"body": "Not magic my friend. Reloaded my account x.x", "score": 1, "replies": []}]}, {"body": "I really thought I was going to get baker acted over 200k, oh man", "score": 2, "replies": [{"body": "Money isn’t important", "score": 1, "replies": []}]}, {"body": "I’m very proud", "score": 2, "replies": []}, {"body": "This is that good shit. It's a nice downward line to make me feel better about myself.", "score": 2, "replies": []}, {"body": "Thanks for making me feel more assured that my options trading is a thing of the past!", "score": 2, "replies": []}, {"body": "Reload 100k what the fck bro!!", "score": 2, "replies": []}, {"body": "🤮🤮🤮 here I am having a heart attack over $1k", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Sorry buddy.", "score": 2, "replies": []}]}, {"body": "Oh my gourd!  ![gif](emote|free_emotes_pack|dizzy_face)", "score": 2, "replies": []}, {"body": "This is the quality stuff we need on this sub. I wish I could have given you an award if I didn’t just lose 7K on my puts today.", "score": 2, "replies": []}, {"body": "Need more porn like this one, so we will have more 4-5 figs Degen coming in giving liquidity saying yea its fine my 10k losses all time, look at this guy, im good.", "score": 2, "replies": []}, {"body": "Bro, try shares. You’ll lose money much slower.", "score": 2, "replies": []}, {"body": "I could have made you a $5 profit with $655,556.", "score": 2, "replies": []}, {"body": "Haha my boy!", "score": 2, "replies": []}, {"body": "Greed. Playing it safe and going for 0.5% per day investing in share would've earned you enough. \nFor you is not about the money, is an addiction . Use that 100k for professional help before you ruin your life completely ", "score": 2, "replies": []}, {"body": "https://preview.redd.it/24fhom79ca9d1.jpeg?width=1170&format=pjpg&auto=webp&s=c0daf70f65a9df7e0107a80c1d56316cc7fb34ca", "score": 2, "replies": []}, {"body": "With that money in JEPI u could have had ur rent covered and groceries expensed. But NO, you wanted to be regarded.", "score": 2, "replies": []}, {"body": "If u bought 120k in puts in nkee it wouldve be worth 8m rn", "score": 2, "replies": [{"body": "I don't think you can buy that many even if he tried.  Maybe across 5 different brokerages.  Even then I doubt they sell that many.", "score": 1, "replies": []}]}, {"body": "You rich mf you", "score": 2, "replies": []}, {"body": "thanks for making me feel better about buying and holding bitcoin instead of throwing away money like this.", "score": 2, "replies": []}, {"body": "I typically don’t take long term positions but I have a few $corz leaps. $35k worth roughly. Little worried that warrants have been a bit of a damper lately but I imagine they’ve gotten through a chunk of them. Hopefully pops off if they can pull another big deal in the next couple months.", "score": 3, "replies": [{"body": "Clearly I’m no expert but luckily CORZ wasn’t my own pick, it was a fellow degenerate.  So far so good, the warrants are technically in the money now so maybe it’s priced in.", "score": 1, "replies": [{"body": "Ah yeah I follow very few plays but someone that’s very intelligent in the crypto sphere signalled this one. I only initially bought maybe $10k worth and they’re already up over 200% in less than a month.", "score": 3, "replies": []}]}]}, {"body": "What positions caused you to lose so much? Like it wasn’t even close. Straight down.", "score": 1, "replies": []}, {"body": "Would you like to donate some money to poor(me) instead ?", "score": 1, "replies": []}, {"body": "[Looks like the US & Canada border](https://www.reddit.com/r/wallstreetbets/s/O4Ri3bU4LC)", "score": 1, "replies": []}, {"body": "So in the last 39 days you’ve managed to lose another $32K. That’s impressive.", "score": 1, "replies": []}, {"body": "That’s alotta Nuts!", "score": 1, "replies": []}, {"body": "Keep going. You got this!", "score": 1, "replies": []}, {"body": "How do you have this kind of money to gamble?", "score": 1, "replies": []}, {"body": "Why you play such short expirations", "score": 1, "replies": []}, {"body": "Better open up a hedge fund and hedge against yourself at this point.", "score": 1, "replies": []}, {"body": "In this market that’s hard to do. You must be very special.", "score": 1, "replies": []}, {"body": "Holy fuck", "score": 1, "replies": []}, {"body": "JFC hit me up and let me manage your money. I’ll def have much better results. You’ll make money smh", "score": 1, "replies": []}, {"body": "Someone has to do it for the boys", "score": 1, "replies": []}, {"body": "I feel like any half decent dividend stock could've have you and your kids a great life but you're the one with the money so maybe you have a plan I don't understand.", "score": 1, "replies": []}, {"body": "That sucks man lmao", "score": 1, "replies": []}, {"body": "That's a fucking house or two!", "score": 1, "replies": []}, {"body": "Youve almost hit the sacred 666,666", "score": 1, "replies": []}, {"body": "Still enough for comeback and yolo into Spy 0dte puts tomorrow ( I'll be right once!!)", "score": 1, "replies": [{"body": "Thanks mate!", "score": 1, "replies": []}]}, {"body": "You coulda bought Robinhood Gold and let it sit but instead you do this.", "score": 1, "replies": []}, {"body": "218 years of tax loss harvesting", "score": 1, "replies": [{"body": "Just need that one degenerate 660x play …", "score": 1, "replies": []}]}, {"body": "What do you get out of posting it here?", "score": 1, "replies": []}, {"body": "Don't worry, I'm sure you will win it all back.", "score": 1, "replies": [{"body": "🙏🏼", "score": 1, "replies": []}]}, {"body": "Loser", "score": 1, "replies": []}, {"body": "Dude lost brand new 5bd house and reloaded a brand new 911 next to it like he is gaming ![img](emote|t5_2th52|4640)", "score": 1, "replies": [{"body": "Should I have gotten the 911 instead?", "score": 1, "replies": []}]}, {"body": "Dude I made sure I saved enough money for good quality rope just incase and mine was 6x less than this haha.", "score": 1, "replies": []}, {"body": "Can I have the rest to hold onto it so you don’t lose it playing options?(let me lose it playing options)", "score": 1, "replies": []}, {"body": "You hate money op", "score": 1, "replies": []}, {"body": "Is that all your winnings from the first squeeze?", "score": 1, "replies": []}, {"body": "How the f do you 'reload' 100k back on the account?", "score": 1, "replies": [{"body": "Wire transfer", "score": 1, "replies": [{"body": "How do you you get 100k to wire to broker? ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}, {"body": "126K should be easy then.", "score": 1, "replies": []}, {"body": "Wild that people have so much money to burn instead of doing something worthwhile", "score": 1, "replies": []}, {"body": "Is this fake? Who has so much money to burn?", "score": 1, "replies": []}, {"body": "Golly that’s some porn there. Regard salute 🫡![gif](emote|free_emotes_pack|facepalm)", "score": 1, "replies": [{"body": "🫡", "score": 1, "replies": []}]}, {"body": "Ouch. I hope you recover. Godspeed. ", "score": 1, "replies": [{"body": "🙏🏼 Just one Yolo 🚀", "score": 1, "replies": []}]}, {"body": "You should probably stop trading options. Just a thought.", "score": 1, "replies": [{"body": "Not a bad thought", "score": 1, "replies": []}]}, {"body": "All in QQQ puts 1 month out you’ll make your money back", "score": 1, "replies": [{"body": "🐂 ❤️", "score": 1, "replies": []}]}, {"body": "I lost $600 the other day and I was about to have a heart attack man, I’d fucking die 600 times if I lost 600k", "score": 1, "replies": [{"body": "Money is relative man.\n\n$600 to you is Pennies to others.", "score": 1, "replies": []}]}, {"body": "You have more to lose don't give up lol", "score": 1, "replies": []}, {"body": "roughly what % of your net worth? (is this money you can easily afford to lose). I gave back around XXX of gains, it hurts a ton, but doesn't impact my daily life, just makes me sick to think about.", "score": 1, "replies": [{"body": "It always hurts.  A friend lost 3-4m in alts after making it on btc and wanted to diversify .   He’s okay but he will likely never make it back.", "score": 1, "replies": [{"body": "I guess diversification is relative. Imagine if he put that money in a SPY / HYSA. After a couple of huge options wins, you start thinking that you have an edge, when you don't.", "score": 1, "replies": [{"body": "That’s exactly right.", "score": 1, "replies": []}]}]}]}, {"body": "It’s a loss only if you sell btw can you hold a bit ??", "score": 1, "replies": []}, {"body": "Just tell me what do I need to do to “reload 100k” every once in a while", "score": 1, "replies": [{"body": "Work hard every day as if you already make enough money to buy a 20mm dollar house. Multiply x 365x5 you can get there in almost any industry.", "score": 3, "replies": []}]}, {"body": "thats funny that it says 'investing' right there in the header.", "score": 1, "replies": []}, {"body": "What a charitable fella...UN needs you", "score": 1, "replies": []}, {"body": "holy shit how do you lose this much and stay sane", "score": 1, "replies": []}, {"body": "Nice loss op. When you buy CORZ? You diamond handing that?", "score": 1, "replies": [{"body": "got CORZ about a month ago. That play has been good.", "score": 1, "replies": []}]}, {"body": "All you had to do was buy shares and hold.", "score": 1, "replies": []}, {"body": "For every regard there’s an idiot", "score": 1, "replies": []}, {"body": "Who has this money to lose lol", "score": 1, "replies": []}, {"body": "You might want to take up golf, fishing or some other hobby ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Thanks for making me feel good about my profit today", "score": 1, "replies": []}, {"body": "You made $12 though.", "score": 1, "replies": []}, {"body": "this how my account be lookin w the straight cliff drop", "score": 1, "replies": []}, {"body": "Thank you for making me feel better.", "score": 1, "replies": []}, {"body": "now the only way you can go is up ![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "That’s what I was thinking", "score": 1, "replies": []}]}, {"body": "True loss porn, it's so good I'm getting hard.", "score": 1, "replies": []}, {"body": "Lol.  Was there ever a time when you went up?  Or just lost and kept chasing the dragon you never even tasted?", "score": 1, "replies": [{"body": "Yea I had a couple good run ups, 200k or so.  That was the beginning of the end. .", "score": 2, "replies": []}]}, {"body": "Let us know what you’re buying next", "score": 1, "replies": [{"body": "CORZ TSLA SNAP BA AMD LUCID MU SPWR ….  Lmk what you got", "score": 1, "replies": []}]}, {"body": "It looks like you’re pretty bad at this", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Brother, dont chase your losses. In my opinion ur probably going to lose it all. And then off yourself. Take it all out. If u want a chance to make it back, buy some crypto. They are all heavily discounted right now. Hit me up for some crypto picks. But wsb is truly for degenrates. Be careful u can lose ur money so fast. Im totally done with options, lost a fuck ton. (5gs canadian) but thats alot for me.", "score": 1, "replies": [{"body": "What crypto?", "score": 1, "replies": [{"body": "Theres a few, polygon very well established, stx, u can try something slightly riskier like aerodrome. Down 60+% from ath, they have invetments from coinbase", "score": 1, "replies": []}]}]}, {"body": "You still have too much money", "score": 1, "replies": [{"body": "Some certainly think so…", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yea, probably.", "score": 1, "replies": []}]}, {"body": "If u need help and your serious about turning your account dm me, ignore all the bad advice on here, I’ll help u personally one on one.", "score": 1, "replies": [{"body": "Post here I’ll drop cash on your picks.   Everyone will witness our wins.", "score": 1, "replies": [{"body": "I guess ur not that serious I told u I’ll give u a one on one personalised coaching to be a better trader overall, just giving u picks an trades is pointless you won’t learn anything I want to teach u not only how to make trades an money but how to keep doing it independently so when I’m not coaching you u won’t blow up your account an be able to continue your growth. DM me if you’re actually interested and serious.", "score": 1, "replies": []}, {"body": "If u don’t take the market seriously any amount of money u throw at it won’t matter it can evaporate even trillions of dollars, even if 800k is your play money it’s nothing in the market.", "score": 1, "replies": []}]}]}, {"body": "I can probably retire if I had 655k", "score": 1, "replies": [{"body": "Probably not sadly.", "score": 1, "replies": []}, {"body": "You absolutely could! If u actually invested it properly with safe stocks like VOO etc. Lived below your means for a couple years while you worked. This guy prefers to go broke, eventually", "score": 1, "replies": []}]}, {"body": "You realize the line is supposed to go in the other direction, right?", "score": 1, "replies": [{"body": "Why hasn’t anyone told me?", "score": 2, "replies": []}]}, {"body": "Shoulda bought tsm calls. I’m hearing it’s going to the moon", "score": 1, "replies": [{"body": "What’s tsm", "score": 1, "replies": [{"body": "Taiwan semiconductor manufacturer. The stock to retire this whole subreddit", "score": 1, "replies": [{"body": "Ok I’ll drop 5k on it", "score": 2, "replies": [{"body": "Bet the mortgage king", "score": 1, "replies": [{"body": "😂 … if this was my mtg id be in trouble.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "😍😍😍😍😍😍😍‼️‼️‼️", "score": 1, "replies": []}, {"body": "I'm sorry for your loss", "score": 1, "replies": [{"body": "Ty buddy", "score": 1, "replies": []}]}, {"body": "I just came daddy 🤤", "score": 1, "replies": []}, {"body": "I mean.  Wow.", "score": 1, "replies": []}, {"body": "There’s no coming back from this.", "score": 1, "replies": [{"body": "I’ve seen movies where they come back.", "score": 2, "replies": [{"body": "https://preview.redd.it/byt3b176w79d1.jpeg?width=715&format=pjpg&auto=webp&s=0c6dd91f9735597472fc537b391afeb4bdf5ea42\n\nDo as I say. Not as I do.", "score": 2, "replies": [{"body": "🚀🚀🚀", "score": 1, "replies": []}]}]}]}, {"body": "I need to stop complaining about my 1k loss lol", "score": 1, "replies": []}, {"body": "If ever anything deserved  an .....F\n\nMy brother , \n\n🫡🫡  F  🫡🫡", "score": 1, "replies": [{"body": "🫡", "score": 1, "replies": []}]}, {"body": "He still is left with more than my net worth so he good", "score": 1, "replies": []}, {"body": "Thank you for your service.", "score": 1, "replies": [{"body": "🫡", "score": 1, "replies": []}]}, {"body": "Wow.", "score": 1, "replies": []}, {"body": "JOEEEEE DONALD", "score": 1, "replies": [{"body": "Who won?", "score": 1, "replies": []}]}, {"body": "You're doing it wrong", "score": 1, "replies": [{"body": "I think I was holding it wrong", "score": 1, "replies": []}]}, {"body": "Reloaded from where?", "score": 1, "replies": []}, {"body": "Posts like this make me physically ill", "score": 1, "replies": []}, {"body": "Lmfao", "score": 1, "replies": []}, {"body": "🤷‍♂️", "score": 1, "replies": []}, {"body": "would’ve crushed this in tony hawk pro skater", "score": 1, "replies": []}, {"body": "So close to 666", "score": 1, "replies": []}, {"body": "Lmfao @ people using another shitty app…", "score": 1, "replies": []}, {"body": "I hope that’s not your only accout", "score": 1, "replies": []}, {"body": "I have a great website to help! It’s called Indeed.com", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4260) damn", "score": 1, "replies": []}, {"body": "Still more buying power than me...", "score": 1, "replies": []}, {"body": "Damn and I’m still can’t get over spending $5 for my BK meal", "score": 1, "replies": []}, {"body": "Reloading 100k\n\n![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "It's not a good sign when your chart looks like Nebraska's northern/eastern border", "score": 1, "replies": []}, {"body": "What’s your next move?", "score": 1, "replies": []}, {"body": "How did you make your start money?", "score": 1, "replies": []}, {"body": "Damn if you had given that 655 to me it’d be a house and a portion of my retirement", "score": 1, "replies": []}, {"body": "*checks profile* \n\n“Active in these communities “\n\nPANIC ATTACKS \n\nNO FUCKING SHIT U DONT SAY?????", "score": 1, "replies": []}, {"body": "Bruh reloaded 6 times ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Goddamn you’re bad at this. Respect.", "score": 1, "replies": []}, {"body": "Goddamn you’re bad at this. Respect.", "score": 1, "replies": []}, {"body": "This man is a true degenerate. Respect ", "score": 1, "replies": []}, {"body": "https://preview.redd.it/qexx78yb789d1.jpeg?width=500&format=pjpg&auto=webp&s=4e07489c4cbdbda19520a3a54842ecaf986166bb", "score": 1, "replies": []}, {"body": "You got a gambling problem bro. Quit and never look back.", "score": 1, "replies": []}, {"body": "How did you do it?", "score": 1, "replies": []}, {"body": "I hope ur having fun at least bro", "score": 1, "replies": []}, {"body": "I might not be making money but at least I’m not this stupid. Thanks op, you’re a hero", "score": 1, "replies": []}, {"body": "Holy fuq how are you throwing money away like this?", "score": 1, "replies": []}, {"body": "Think of all the tax savings", "score": 1, "replies": []}, {"body": "I would sign up to your discord just to take the opposite bets you make.", "score": 1, "replies": []}, {"body": "This sub is never dull. A dude posted $10M+ account yesterday. Today we have this guy ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "dont worry.. you make it all back in one trade...", "score": 1, "replies": []}, {"body": "There was a moment of hope. I hope you enjoyed it", "score": 1, "replies": []}, {"body": "I'm only down 40k, so this makes me feel better.", "score": 1, "replies": []}, {"body": "No fucking way", "score": 1, "replies": []}, {"body": "Can I have your other $120k? You might as well put it to a good use since you're on track to lose it anyways lol", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about being a loser", "score": 1, "replies": []}, {"body": "Wait, you lost over half a million and decided to do even more? ![img](emote|t5_2th52|4271) king regard ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "What happened 3 months ago?", "score": 1, "replies": []}, {"body": "https://preview.redd.it/snxne1qjm89d1.jpeg?width=600&format=pjpg&auto=webp&s=0e9d99b2f3dee044ad15a80b343d5f4a714e73b8", "score": 1, "replies": []}, {"body": " yess", "score": 1, "replies": []}, {"body": "WTF", "score": 1, "replies": []}, {"body": "Shoulda bought lottery tickets.", "score": 1, "replies": []}, {"body": "I feel much better about my 60k loss now", "score": 1, "replies": []}, {"body": "Umm. Just take that to the roulette table my man", "score": 1, "replies": []}, {"body": "Tf buddy", "score": 1, "replies": []}, {"body": "Take out a cash loan and start over. Dont quit.", "score": 1, "replies": []}, {"body": "At this point you are just very talented in losing money", "score": 1, "replies": []}, {"body": "Share your strategy 😂", "score": 1, "replies": []}, {"body": "Guh moment", "score": 1, "replies": []}, {"body": "Congrats OP you make it to the hall of shame!! Keep up", "score": 1, "replies": []}, {"body": "Winning!!! At losing.", "score": 1, "replies": []}, {"body": "How did you do this bro?", "score": 1, "replies": []}, {"body": "Whenever I see these giant numbers i gotta wonder if they real or just paper trading", "score": 1, "replies": []}, {"body": "I cant even imagine what it feels to have such amount. Crazy", "score": 1, "replies": []}, {"body": "I hope you're rich AF and this is spare change for you..", "score": 1, "replies": []}, {"body": "OP, how are so mentally strong to be posting this ?", "score": 1, "replies": []}, {"body": "Now all you have to do is the opposite", "score": 1, "replies": []}, {"body": "Thanks for making feel better about my chronic pain.", "score": 1, "replies": []}, {"body": "I’m down almost as much in the past 3 years ($675k->$110k).", "score": 1, "replies": []}, {"body": "Please tell me you started with $7000 and went up and down.   Man!   That was painful.", "score": 1, "replies": []}, {"body": "Dont understand why you dont put such amounts of money in something safe...its already lifechanging money, why do you need to have such a huge risk", "score": 1, "replies": []}, {"body": "How do you lose 600k?", "score": 1, "replies": []}, {"body": "Thx for making me feel better of my 30k loss", "score": 1, "replies": []}, {"body": "How dafuq did you lose on CORZ? Turnaround business together with AI hype **and** insider buying? Bro how?", "score": 1, "replies": []}, {"body": "Do you hate money or money hates you ? ![img](emote|t5_2th52|31225)", "score": 1, "replies": []}, {"body": "From the chart I can tell it is 0dte.", "score": 1, "replies": []}, {"body": "Thanks for making me feel better for living pay cheque to pay cheque today", "score": 1, "replies": []}, {"body": "Salute", "score": 1, "replies": []}, {"body": "Blood for the blood god!", "score": 1, "replies": []}, {"body": "Keep going! There's still more to lose", "score": 1, "replies": []}, {"body": "Market makers love you", "score": 1, "replies": []}, {"body": "Thanks for making me feel better spending 60 cent on a ice cream. This one I will eat for you.", "score": 1, "replies": []}, {"body": "Posting that screenshot here proofs that it ain’t about the riches, and all about the rush. Hope this one moment of bliss was enough because as soon as you put your phone down emotional damage will come knocking.", "score": 1, "replies": []}, {"body": "Ain't no way cuz!! You coulda literally just bought a cheap condo and lived on the freeski with the rest in index funds.  ![img](emote|t5_2th52|4260)", "score": 1, "replies": []}, {"body": "All I see is that you can only lose more 18% and win infinite %. Keep going bro you will make it", "score": 1, "replies": []}, {"body": "Thanks for making me feel better with my $250 profit.", "score": 1, "replies": []}, {"body": "Are you normal?", "score": 1, "replies": []}, {"body": "Your advantage you still have cash to recover. You can recover all your money with such amount of cash ", "score": 1, "replies": []}, {"body": " What did you do ?", "score": 1, "replies": []}, {"body": "The first time I saw such huge loss. More than 600k loss is a record of Reddit", "score": 1, "replies": []}, {"body": "At least you have a lot of capital loss to deduct", "score": 1, "replies": []}, {"body": "When you say reloaded\nDoes that mean these are paper trades", "score": 1, "replies": []}, {"body": "Double down!", "score": 1, "replies": []}, {"body": "Did u lock in the 12$ profit? From the unnamed stock?", "score": 1, "replies": []}, {"body": "Just casually reloading 100K into your account and full porting it? Either you belong here or you are some rich trust fund kid", "score": 1, "replies": []}, {"body": "Thank for the loss pron, I feel so much better", "score": 1, "replies": []}, {"body": "How did you make this money? I’m really curious about that", "score": 1, "replies": []}, {"body": "This is all from buying options in game?", "score": 1, "replies": []}, {"body": "I need at least 10k to put down on a house feel free to pitch in", "score": 1, "replies": []}, {"body": "Jizzzz in my pants 😅", "score": 1, "replies": []}, {"body": "I guess im in the right group 😅😂! Stay strong its just money!", "score": 1, "replies": []}, {"body": "Finally… someone more stupid than me", "score": 1, "replies": []}, {"body": "With little to no effort you could have been a millionaire ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "i envy your spending power", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about my NKE losses", "score": 1, "replies": []}, {"body": "I have paper losses of like 32k and this made me feel a lot better. Ty lol", "score": 1, "replies": []}, {"body": "This is some real loss porn. I’ll be jerking it good to this later.", "score": 1, "replies": []}, {"body": "Damn you better find your local wendys and claim your dumpster quick", "score": 1, "replies": []}, {"body": "My all time loss is $14k. I don’t feel so bad now.", "score": 1, "replies": []}, {"body": "Reload", "score": 1, "replies": []}, {"body": "1 mil nav ??? Omg ,", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about my $1 loss today!", "score": 1, "replies": []}, {"body": "Could of had a Lamborghini", "score": 1, "replies": []}, {"body": "Reminds me of my friend that told me not to post my portfolio on Reddit. Like what’s the worst that can happen? Someone hacks my account and pays down my 40k in margin? 🤣", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about NVDA.", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about losing $12 dollars today. Rip 🙏", "score": 1, "replies": []}, {"body": "Thanks for the loss porn", "score": 1, "replies": []}, {"body": "I lost 35k but man this gotta hurt :/", "score": 1, "replies": []}, {"body": "!GUH", "score": 1, "replies": [{"body": "#[GUH](https://www.reddit.com/r/wallstreetbets/comments/kkc8ev/just_in_case_yall_forgot_this_video_exists/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "At least there’s 126k more to lose", "score": 1, "replies": []}, {"body": "Its ok. Its just numbers 🐻💵🐻🤑🔥", "score": 1, "replies": []}, {"body": "Thanks OP, really needed to see this today!", "score": 1, "replies": []}, {"body": "This person should NOT have access to money or a trading platform. But seeing as it's robinhood, it all kinda makes sense", "score": 1, "replies": []}, {"body": "You belong here", "score": 1, "replies": []}, {"body": "Damn and I thought I was mad that I forgot my stop loss… I can’t imagine how I’d feel here.", "score": 1, "replies": []}, {"body": "Buy back in! You’re basically guaranteed to win this time!", "score": 1, "replies": []}, {"body": "Damn you could of used that money for hookers, blow, lambos and tendies", "score": 1, "replies": [{"body": "Could have, would have, should have…but didn’t… I gotta admit, it’s a pretty impressive loss.", "score": 2, "replies": []}]}, {"body": "Edging biting my lip", "score": 1, "replies": []}, {"body": "Bro, you’re outside the fun spectrum…", "score": 1, "replies": []}, {"body": "excuse me", "score": 1, "replies": []}, {"body": "Bunch of clowns commenting lol. Hang in there bro. Got plenty of gun powder left. You got this", "score": 1, "replies": []}, {"body": "Feels good to know I am not alone. This week was wreck -60% on account", "score": 1, "replies": []}, {"body": "Well done 👍🏼", "score": 1, "replies": []}, {"body": "Gatta love updates on losses. Funny part is your remaining balance is still more than 99% of this sub", "score": 1, "replies": []}, {"body": "And this is why I reload my account 100 at a time 😅😅", "score": 1, "replies": []}, {"body": "Damn.  Rich homos here!", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 1, "replies": []}, {"body": "This is the flavor of autistic I’m here for ![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "nice to see someone with a larger loss then me", "score": 1, "replies": []}, {"body": "Maybe buy shares if you have 600k to invest, much more stable", "score": 1, "replies": []}, {"body": "Bruh just staph", "score": 1, "replies": []}, {"body": "Would love to know what your next moves are 👀", "score": 1, "replies": []}, {"body": "I am down 65k but god damn!", "score": 1, "replies": []}, {"body": "You got this. Obviously you've done great,  just keep that intuition that got you there", "score": 1, "replies": []}, {"body": "Was does someone always have to raise the bar?", "score": 1, "replies": []}, {"body": "Thanks for making me feel better about being lame and just buying index funds over and over.", "score": 1, "replies": []}, {"body": "thanks for making me feel better about my 50 dollar gain today", "score": 1, "replies": []}, {"body": "Oh what the fuck man ![img](emote|t5_2th52|27421)", "score": 1, "replies": []}, {"body": "You'll get back on your feet", "score": 1, "replies": []}, {"body": "You made me feel worse bc you have lost more money than I've ever made in my lifetime. Damn.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "Almost there!!!", "score": 1, "replies": []}, {"body": "So reverse all his options and guarantee win. ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Sunpower sucks donkey dick. Whole thing is going down like your stepmother", "score": 1, "replies": []}, {"body": "You have a disease", "score": 1, "replies": []}, {"body": "Could have just dropped that on a new tech biz I'm building :( congrats on the extreme loss. Back to the top tomorrow.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/bvpiijvrco9d1.png?width=1440&format=pjpg&auto=webp&s=5dd0422d04a248800488bafc9f98b10148104c96", "score": 1, "replies": []}, {"body": "Do you know how many hookers and all you can fuck orgies you can buy with 655k?", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4260)![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "You'll strike it big soon. Count it all as a lesson! You got this!", "score": 1, "replies": []}, {"body": "Rookie numbers", "score": 1, "replies": []}, {"body": "Bro if you wanted to light money on fire u coulda just gave it to me my girl prob coulda burned it even faster than this", "score": 1, "replies": []}, {"body": "I mean, you're still holding your options lol, you haven't lost yet and likely aren't going to with two of those holdings. Nice!", "score": 1, "replies": []}, {"body": "I feel a lot better about buying pre 33 now", "score": 1, "replies": []}, {"body": "The type of problem I want, except I wouldn’t do options", "score": 1, "replies": []}, {"body": "Buy high buy low buy low then moonshot", "score": 1, "replies": []}, {"body": "respect", "score": 1, "replies": []}, {"body": "Guh", "score": 1, "replies": []}, {"body": "tnx for nothing", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|31226)", "score": 1, "replies": []}, {"body": "Damn baller", "score": 1, "replies": []}, {"body": "Ooff is right", "score": 1, "replies": []}, {"body": "Wow I’d been quit", "score": 1, "replies": []}, {"body": "\n⠀⠀⠀⣴⣴⡤  \n⠀⣠⠀⢿⠇⡇⠀⠀⠀⠀⠀⠀⠀⢰⢷⡗  \n⠀⢶⢽⠿⣗⠀⠀⠀⠀⠀⠀⠀⠀⣼⡧⠂⠀⠀⣼⣷⡆  \n⠀⠀⣾⢶⠐⣱⠀⠀⠀⠀⠀⣤⣜⣻⣧⣲⣦⠤⣧⣿⠶  \n⠀⢀⣿⣿⣇⠀⠀⠀⠀⠀⠀⠛⠿⣿⣿⣷⣤⣄⡹⣿⣷  \n⠀⢸⣿⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣿⣿⣿⣿⣿  \n⠀⠿⠃⠈⠿⠆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⠿⠿⠿  \n  \n⠀⢀⢀⡀⠀⢀⣤⠀⠀⠀⠀⠀⠀⠀⡀⡀  \n⠀⣿⡟⡇⠀⠭⡋⠅⠀⠀⠀⠀⠀⢰⣟⢿  \n⠀⣹⡌⠀⠀⣨⣾⣷⣄⠀⠀⠀⠀⢈⠔⠌  \n⠰⣷⣿⡀⢐⢿⣿⣿⢻⠀⠀⠀⢠⣿⡿⡤⣴⠄⢀⣀⡀  \n⠘⣿⣿⠂⠈⢸⣿⣿⣸⠀⠀⠀⢘⣿⣿⣀⡠⣠⣺⣿⣷  \n⠀⣿⣿⡆⠀⢸⣿⣿⣾⡇⠀⣿⣿⣿⣿⣿⣗⣻⡻⠿⠁  \n⠀⣿⣿⡇⠀⢸⣿⣿⡇⠀⠀⠉⠉⠉⠉⠉⠉⠁", "score": 1, "replies": []}, {"body": "Have you ever thought that maybe this isn’t the right thing for you lmao\n\nYou’d have better success in meme coins at this point", "score": 1, "replies": []}, {"body": "Fuck I am so hard right now.", "score": 1, "replies": []}, {"body": "Have you thought about going long $noose", "score": 1, "replies": []}, {"body": "OP's search history:\n\n- Does an EIDL loan get discharged due to bankruptcy \n\n- Good bankruptcy lawyers near me", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}, {"body": "I have lost bit more. I am hoping I die soon. The regret and the what ifs are unbearable. Hope you are stronger than I", "score": 1, "replies": [{"body": "Don’t do that brother, then I’ll be alone In this boat.", "score": 3, "replies": [{"body": "I'm honestly too afraid to do it. I can't believe I'm saying this out loud, but if it comes to an end, I won't be mad.", "score": 0, "replies": [{"body": "Many people been there brother.  Get that out of your head.  I got your back.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "You got me on the first half.. :) I think I was in a bad headspace. Still am but I still got my son to live for. He deserves to have a good dad", "score": 2, "replies": []}]}, {"body": "Txt me.", "score": 0, "replies": []}]}, {"body": "Bro. You simply couldn't STOP. When is \"ENOUGH ACTUALLY ENOUGH?\" NOW ur down BAD over 500k and probably working a regular job. I can't even READ the posts no more. I just look at the portfolio and see the losses and comment. Your clowns. What DO u have todo in life to make 500k? So why do people throw it in the trash as if it's easy to come by. \"Ohhh if only I can get another 20%, or 50% trade if I YOLO\" like bro GROW UP. This is INVESTING. You're all just gamblers hoping things would change. Get some disciple in your lives and then things WILL ACUTALLY CHANGE 4 the better like you've always wanted. Until then, you'll stay the same if not getting worse off then you already are. God bless.", "score": 1, "replies": [{"body": "I just read \"reloaded 100k\" what an idiot. Should spend that on a car or maybe a rental property. Maybe a 401k to keep it out of his own hands! Bros on a demonic losing streak and can't seem to find a reason NOT TO TRADE. Bro must think \"if I trade THIS time things will change\" NO you just giving money away with a small dopamine rush that you get from placing trades. Bottom line gambler at best. EXPECTING, HOPING, and WISHING. I hope you get clean brother ✊", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/7cnp9oxhw59d1.jpeg?width=1280&format=pjpg&auto=webp&s=93fbc766d3636619c4965de29dfa3e2af69445c7", "score": 0, "replies": []}, {"body": "Annual income before taxes?", "score": 0, "replies": []}, {"body": "Yolo options is the reason most traders don't make it. You're also trading against market makers big time when you do large options.", "score": 0, "replies": []}]}
