{"title": "Flames shoot from Air Canada Boeing jet moments after take-off: ‘We’ve got an engine fire —holy s–t!’", "selftext": "[removed]", "id": "1dasz84", "created_utc": 1717815419.0, "score": 1126, "upvote_ratio": 0.91, "num_comments": 112, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 4 months ago\n**Total Comments** | 68 | **Previous Best DD** | \n**Account Age** | 6 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Compressor stall is not uncommon. Boeing doesn’t make engines.", "score": 686, "replies": [{"body": "Probably a bird strike, debris ingestion, or a blade failure.  Compressor stall would not repeat that many times in sequence.", "score": 63, "replies": [{"body": "or a whistleblower was on the manifest", "score": 45, "replies": [{"body": "Underrated comment.", "score": 9, "replies": []}]}]}, {"body": "Still a bad company with no real QA", "score": 4, "replies": []}, {"body": "[deleted]", "score": -129, "replies": [{"body": "I'm an aircraft maintenance engineer. Flames shooting out of engines isn't uncommon. I haven't seen indications or mention of this being a technical fault either.", "score": 84, "replies": [{"body": "how common does this happen with passengers on board? does the airline have a responsibility to ensure all parts of plane are functioning properly?", "score": 1, "replies": [{"body": "Depends on the type of engine. The ones I did ramp work on had fires out the exhaust relatively often, I guess. I tended to notice it more at night. \n\nAgain, I can't really say if the fires being seen here are a huge issue unless I can get my hands on some better info. The type of fire matters quite a bit (internal or external).\n\nThey'll investigate what happened, why did it happen, but if it's a [compressor stall](https://americanflyers.com/what-is-a-compressor-stall/), then nobody's gonna be losing their job.", "score": 10, "replies": [{"body": "Funny enough, I was on a flight with a flame shooting compressor stall in march! Take off was aborted, flames came up over the wing. \n\n[https://www.reddit.com/r/aviation/s/fbrHCS6V7W](https://www.reddit.com/r/aviation/s/fbrHCS6V7W)", "score": 4, "replies": []}]}]}, {"body": "Was there really abeed tocrash land? I mean was it that bad a situation or was there degree of panic?", "score": -19, "replies": [{"body": "Planes can safely take off with one engine because of stuff like this", "score": 20, "replies": []}]}]}, {"body": "Compressor stalls are a key engine phenomenon that isn’t build quality based, it’s physics.", "score": 27, "replies": []}]}, {"body": "Boeing seems to make very expensive scrap metal. It's one thing after another with them lately, so at what point is it Boeing's fault?", "score": -44, "replies": [{"body": "Well since airlines “rent” their engines from engine manufacturers, at this point it’s easy to say it is not Boeing’s fault.", "score": 24, "replies": [{"body": "They don’t “rent” the engines.  The airlines buy the engines and Boeing installs them.  The engines have an entirely different FAA Type Certificate from the aircraft.", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Power by the hour is a service plan, not an engine purchase plan.  Airlines still buy the engines first.", "score": 2, "replies": []}]}]}, {"body": "So what is it, you say, they do here? They don't seem verify the function of any parts, absolving them of responsibility entirely?", "score": -14, "replies": []}]}]}]}, {"body": "This thread is a great indicator of just how regarded this subreddit is. I happen to know a bit about aviation and the comments suggesting this event should move the market are absurd. Makes me wonder of the absurdity of the comments about things I know less about.", "score": 242, "replies": [{"body": "I can tell you with the utmost assurance that I have had the exact same experience when people are wildly, confidently wrong about almost everything related to my field of expertise. So I would wager that reddit (on average) is wrong about literally almost everything", "score": 80, "replies": [{"body": "Well, then. This is indeed \"market moving\"... i.e. puts on all those idiotic AI companies that train their models on \"reddit comments\"... 😁", "score": 13, "replies": []}, {"body": "I’m a tax accountant.\n\nI love when people tell me how I should know things that are not just wrong, but illegal.", "score": 4, "replies": []}]}, {"body": "I just farted! That is probably market moving I think...", "score": 27, "replies": [{"body": "This you by any chance?   Could be the butterfly effect.\n\nhttps://preview.redd.it/wdm84ezb3a5d1.jpeg?width=200&format=pjpg&auto=webp&s=482c3fa43667ee23c748933ec784811e852c0ae6", "score": 23, "replies": [{"body": "\"This ass has caused seven typhoons in the Philippines in the last year alone.\"", "score": 7, "replies": []}]}]}, {"body": "Yeah but like it or not the headline still says \"Boeing plane...\" and that's enough for a lot of the uneducated public. I mean Harbor freight also doesn't make jack stands but it's still a punchline going around about \"harbor freight jack stands\".", "score": 9, "replies": [{"body": "The seriousness or lack of in any situation has no bearing on public perception. People gonna react to big booms and shiny things even if the experts know it really wasn’t that big a deal.", "score": 5, "replies": []}]}, {"body": "the most confident and loudest are always wrong. they are quick to tell people they are the idiots and don't understand anything. when proven wrong they'll pivot and try to discredit you. it's tiresome. i'd say 75% of this sub does this shit often. which is why the sage advice of not listening to anyone when making your trades is key, absorb information but don't let it be your end reason for a trade. most of this sub wanted NVDA to \"die\" when it was under $150. same with META because they hate Zuck when it was under $100, same with Netflix cuz they can't use their Dad's account anymore. the list is extensive how often this sub is wrong.", "score": 9, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "This sub tried to probably buy calls on Sully", "score": 2, "replies": []}, {"body": "If enough people think this should move the market, it will. Doesnt matter if it SHOULD. only matters what people do. The market is a people game, not things.", "score": 2, "replies": []}, {"body": "I hope you don't actually ever take anyone in this sub seriously...", "score": 2, "replies": []}, {"body": ">Makes me wonder of the absurdity of the comments about things I know less about.\n\nThat's all of reddit.", "score": 1, "replies": []}, {"body": "Truly regarded to tell everyone how much you know while not actually sharing what you claim to know.", "score": 0, "replies": [{"body": "I can share what I claim to know but how will you verify if I am not a liar?", "score": 6, "replies": [{"body": "Well at least I know only a regard could ask this pretentious question.", "score": 1, "replies": []}]}, {"body": "oh look one of the regards op was talking about.", "score": 1, "replies": []}, {"body": "Everyone has something they are knowledgable about. Airplanes, football, nuclear physics, whatever. I was making an observation, not bragging. I think you're missing the point.", "score": -7, "replies": [{"body": "You missed the point. I never said you were bragging. The point is that you claim to know something other people here are not knowing and telling how absurd the comments are while not providing any facts.\nAlso this wasn't even supposed to be that serious, calm down people.", "score": 2, "replies": []}]}]}, {"body": "“I happen to know a bit about aviation”\n\n🤓", "score": 0, "replies": [{"body": "haha for real. i can go to chatgpt and google and then say that same sentence too. like yeah, we all know a \"bit\" of anything -_-", "score": 0, "replies": [{"body": "So everything you know about in life is because you have access to chat GPT? 🤔", "score": 1, "replies": [{"body": "if it's just \"a bit\" yes lol", "score": 1, "replies": []}, {"body": "all good bro i love you, just fcking around", "score": 1, "replies": []}]}]}]}]}, {"body": "I just got off a flight with *two* crying babies and a seatmate who felt compelled to fly despite having a cold. \n\nThe aircraft? Boeing. \n\nChilling.", "score": 50, "replies": [{"body": "That sounds right. Some would rather have the engine on fire than sitting next to crying babies.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 198, "replies": [{"body": "Air Canada owns most of their airplanes (and engines) but leases a handful. \n\nGE is the exclusive supplier (manufacturer) of engines on the 777-300ER.\n\nRolls Royce is also an engineer manufacturer (not specifically a lessor, although they do that as well) but not for this aircraft.", "score": 103, "replies": [{"body": "Ah good ol GE, another company that’s been turned into complete garbage.", "score": 28, "replies": [{"body": "Thanks Jack Welch! Fucking prick.", "score": 13, "replies": [{"body": "You misspelled Jeff Immelt", "score": 4, "replies": [{"body": "That's fair, but Welch was a fucking prick too", "score": 1, "replies": []}]}, {"body": "They throw a hand full of parts in the box when they ship em, just like Lego", "score": 3, "replies": []}]}]}]}, {"body": "I thought GE", "score": 16, "replies": [{"body": "Depends on the plane", "score": 3, "replies": [{"body": "Given this is a 777-300ER, it only comes with GE90 engines from General Electric.", "score": 11, "replies": []}]}]}, {"body": "These are GE-90s General Electric", "score": 7, "replies": []}, {"body": "Nobody cares boeing is always wrong in their eyes.  BIG red day monday!", "score": 6, "replies": [{"body": "Perfect dum, geh ber logic. Boring will see +2% Monday, of course.", "score": 2, "replies": []}]}]}, {"body": "Did they put the rocket engines on a jet by accident?![img](emote|t5_2th52|31225)", "score": 88, "replies": [{"body": "Air Canada Mars?", "score": 27, "replies": [{"body": "Air Mars, bitches. Red rock. Yaii yaiii!", "score": 7, "replies": []}, {"body": "To the moon!", "score": 2, "replies": []}]}]}, {"body": "Air Canada Motto:\nWe’re not happy unless you’re not happy", "score": 20, "replies": [{"body": "This is true.", "score": 2, "replies": []}, {"body": "My experience with them confirms the motto.", "score": 1, "replies": []}, {"body": "The flight I was on was serviced exclusively by 50+ year old cunts. Where did they source them all, Quebec?", "score": 0, "replies": []}]}, {"body": "It's probably just a bird strike -- bird ingested into the engine.   That issue effects all manufacturers of all aircraft and aircraft engines so it isn't a Boeing problem.\n\nWe've gotten to the point in the mania where any problem onboard a Boeing aircraft is attributed to faulty manufacturer of the aircraft.   A person cropdusts the aisle and that's somehow Boeings fault.", "score": 3, "replies": []}, {"body": "Unrelated to investing… well maybe not… if the public perception of flying is changing… but is flying getting more dangerous and accident prone or are we just seeing more reports of it?", "score": 7, "replies": [{"body": "You're just noticing it more. I doubt the stats have changed recently. There are over 100,000 commercial flights per day in the world.", "score": 26, "replies": []}, {"body": "For some reasons the press is focused more on Boeing nowadays.\n\nIf an Airbus crashes, it will change its focus, telling that all airplanes made by Airbus are going to fall very soon.", "score": 6, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Don't presume too much.\n\nAnyway, it takes more than 'regulations' to make something infailibile.\n\n[List of accidents and incidents involving the Airbus A320 family - Wikipedia](https://en.wikipedia.org/wiki/List_of_accidents_and_incidents_involving_the_Airbus_A320_family)", "score": 5, "replies": []}]}]}]}, {"body": "You dont have to convince me, I already have calls", "score": 3, "replies": []}, {"body": "The engines are made by GE. And most likely not a GE design issue. The GE90 is robust as hell", "score": 2, "replies": []}, {"body": "GE makes the engines.", "score": 1, "replies": []}, {"body": "excuse me but I haven't seen 1 unfunny joke yet about door plugs? normally there's 6 or so by now.", "score": 1, "replies": []}, {"body": "Dammit, knew I should've bought Boeing calls.", "score": 1, "replies": []}, {"body": "777 afterburner", "score": 1, "replies": []}, {"body": "Next time I board a plane “we who are about to die salute you!”", "score": 1, "replies": []}, {"body": "Agent 47 is really going to have a full schedule this year.", "score": 1, "replies": []}, {"body": "The jet engines are not actually made by Boeing", "score": 1, "replies": []}, {"body": "Fuck; I over exaggerated when my piss burned last night. WTF Boeing?", "score": 1, "replies": []}, {"body": "At this rate boeing could murder people and it wouldnt effect the share price.", "score": -3, "replies": [{"body": "Yea, like people who blow whistles actually.", "score": 0, "replies": []}]}, {"body": "Why don't all the airlines just get their plans inspected properly especially if they are made by Boeing?\n\nFederal government need to take steps to ensure people's safety.", "score": -2, "replies": [{"body": "The f you talking about?  You know Boeing doesn’t make the engines?  Educated yourself better before forming opinions", "score": 6, "replies": []}, {"body": "You don't take your car into the shop every time the engine backfires, do you?", "score": 1, "replies": [{"body": "I'm 35 and have driven cars my age since I got my licence and I have never had one back fire unless I was regarded and got the distributor in wrong.", "score": 3, "replies": [{"body": "My mate who owns a Golf GTI, purposefully backfire the engine when he drives past groups of chicks.", "score": 3, "replies": [{"body": "By bouncing it off the rev limiter so unburnt fuel ignites in the exhaust? That's not a back fire, a back fire is fire coming out of the intake side.", "score": 1, "replies": [{"body": ">A **backfire** or **afterburn** is combustion or an explosion produced by a running [internal combustion engine](https://en.wikipedia.org/wiki/Internal_combustion_engine) that occurs in the exhaust system, rather than inside the [combustion chamber](https://en.wikipedia.org/wiki/Combustion_chamber).\n\n[Back-fire - Wikipedia](https://en.wikipedia.org/wiki/Back-fire)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Its a Bang", "score": 0, "replies": []}, {"body": "Diversity is our strength", "score": 0, "replies": []}, {"body": "GE + Boeing = 🤔", "score": -2, "replies": [{"body": "Majority of engines on Boeing planes are GE", "score": 3, "replies": [{"body": "Yes hence my posting. Neither one of those companies are doing too well.", "score": -2, "replies": [{"body": "Define “not doing well” for GE", "score": 1, "replies": [{"body": "4th largest contributor of CO2, repeated violations for polluting ground water and rivers, misleading investors and being fine by the SEC, one of the major companies that absolutely is destroying the middle class for the past 40 years, taking away, hard-earned pensions from its own employees.\n\n\nLike I'm all for the work I read they are doing in renewables, but that's a Band-Aid compared to the centuries they have spent pillaging from its consumers, its own employees, and the planet in general.\n\n\nA little something:\n\nhttps://www.reddit.com/r/explainlikeimfive/s/4wseAHpZ95\n\n\nI consider them the government's personal Enron they're just lucky they were too big to fail.\n\n\nAnd don't get me wrong they're not alone in this, almost all the Fortune 500 companies have a shady history, but anytime I hear or read a story about GE, it is always the worst of the worst.\n\n\nAs for the stock itself. It never fully recovered to pre 2008 performance, where seemingly every other blue chip has at least doubled its value.", "score": -1, "replies": []}]}]}]}]}, {"body": "Oh my God Boeing makes the most unsafe aircraft engines", "score": -6, "replies": []}, {"body": "Relaxing regulations. No one saw this coming.", "score": -3, "replies": []}, {"body": "Just your ordinary Boeing stuff", "score": -22, "replies": [{"body": "Has nothing to do with Boeing. Airplane is a 2008 build and Boeing didn't make the engines.", "score": 15, "replies": [{"body": "Can’t you take one joke ?", "score": -23, "replies": [{"body": "Let me know when one appears", "score": 26, "replies": []}]}]}]}, {"body": "Another pilot error. Those Boeing pilots just can’t operate the perfectly working planes according to guidelines", "score": -8, "replies": []}]}
{"title": "All in on NVDA", "selftext": "Just put all life savings in super far OTM monthlies calls on NVDA for the split, it’s gonna be $80 or $140. This is probably the most regarded thing I’ve done lol", "id": "1davb22", "created_utc": 1717823527.0, "score": 82, "upvote_ratio": 0.75, "num_comments": 138, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 11 months ago\n**Total Comments** | 37 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "You’re about 6 months late on this, bud", "score": 1, "replies": []}]}, {"body": "Most valuable company in the world is msft, at 3.2T. 2000$ would put Nvidia at 5 trillion…..in a month….these might as well be worthless", "score": 210, "replies": [{"body": "And NVIDIA 1400 $ ?\n\nEdit : Is it a more reasonable choice to CALL NVIDIA at $1400 by 21 june 2024 ? This make the stock Price @ 140$ After split..\nWhat do u think about that ? Its unthinkable or there is a good probability ?", "score": 12, "replies": [{"body": "[deleted]", "score": 32, "replies": [{"body": "I can't back in time. I'll sell monday", "score": 5, "replies": []}]}]}, {"body": "https://preview.redd.it/93k5arszee5d1.png?width=864&format=pjpg&auto=webp&s=3c6b17784013e5bf2008cfe877a9e79ef2239f41\n\nActually you are the true regard who doesn't know how to do math. An $80 jump on Monday would only be an increase in valuation of 2-300 billion. $3T/$1200=$2.5B per dollar-share. $80 dollar-share x $2.5B=$200B. These will print. ![img](emote|t5_2th52|4275)", "score": -9, "replies": [{"body": "Lol this guy don’t have a clue how splits work", "score": 11, "replies": [{"body": "I split your Mom ask her![img](emote|t5_2th52|8882)", "score": 2, "replies": []}]}, {"body": "Oh wow u went even closer expo, u go so hard!", "score": 3, "replies": [{"body": "For your pleasure ![img](emote|t5_2th52|4275)", "score": 2, "replies": []}]}, {"body": "ouch my last braincell just committed suicide after reading this ![img](emote|t5_2th52|4271)", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "Nvda will have 10x shares so it’s 25 billion x $80", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4259)![img](emote|t5_2th52|31226)", "score": 1, "replies": []}]}]}]}, {"body": "This may be the stupidest shit I have ever seen not just on Reddit, not just on the internet, but in my entire fucking life", "score": 99, "replies": [{"body": "It is stupid but only 8k, not like he is gonna lose a limb, if it was 80k it will be the stupidest", "score": 10, "replies": [{"body": "For someone this financially illiterate 8k must be a lot", "score": 21, "replies": [{"body": "OP will need to pawn off all of his family’s electronic goods", "score": 7, "replies": []}]}]}, {"body": "Thank you", "score": 7, "replies": []}]}, {"body": "Man i gotta sell some 2000$ calls to you", "score": 68, "replies": []}, {"body": "NVDA is not reaching 2k buddy", "score": 100, "replies": [{"body": "Hoping for 200 by 6/28 is wild. He needs a 15% move next week just to not end up red by Friday, and 18% move subsequently for the Monday after.\n\nIf NVDA trades sideways all next week or dumps, he’s cooked!", "score": 45, "replies": [{"body": "Odds are over a million to one and the payout is not even paying out that. Literally a case where buying lottery tickets would be a sounder investment strategy.\n\nHe's also bought as IV was rising so even though he bought deep OTM calls, he still paid a premium for them.", "score": 31, "replies": []}, {"body": "I know right? That’s really regarded", "score": 5, "replies": [{"body": "if NVDA moves sideways for even one day, you're toast. how can you be so regarded?", "score": 3, "replies": [{"body": "Because I belong", "score": 0, "replies": []}]}]}, {"body": "How much did it dump last time it split? Quite a bit right?", "score": 1, "replies": []}]}, {"body": "Emotions shattered into pieces", "score": 3, "replies": []}, {"body": "With Nvidia at 120 I think is on his way to overtake MSFT as the most US valuable Company. With 12b outstanding shares it will need 100$ to reach that. I think it will happen, and that was the reason for their stock split.", "score": 6, "replies": [{"body": "5 trillion market cap by June 21 is wild", "score": 6, "replies": [{"body": "Leave that to gen z fomo ;)", "score": 3, "replies": [{"body": "retail barely makes a dent in the market", "score": 1, "replies": []}]}]}, {"body": "120 on monday post stock split. How much would it need to increase and justify 200-220 stock price. Let me put it better. To surpass MSFT at 3.2 and become most valuable company. What will the stock price be then? Thx", "score": 2, "replies": [{"body": "Above 140 if MSFT does not go up. If it does, maybe Nvidia will need to hit 150 160$ per share.", "score": 1, "replies": []}]}]}, {"body": "I mean… eventually it will? Stocks only go up ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "Maybe in 1 to 3 years...definitely not in a month lmao.", "score": 1, "replies": []}]}, {"body": "This has to be the fastest way to lose money, even burning it would be slower", "score": 25, "replies": [{"body": "![img](avatar_exp|161749478|cry)\n\nOver the course of a month", "score": 3, "replies": []}]}, {"body": "Why would you buy 30 OTM calls when you could buy just one or two ITM calls", "score": 19, "replies": [{"body": "There are very little chance to get 10 bagger if you buy ITM options. Some regards only accept that kind of profits because +100% is \"too little\"", "score": 6, "replies": [{"body": "You have about the same chance of getting a ten bagger when you don’t buy any options", "score": 5, "replies": []}]}]}, {"body": "price sort grab cagey chief waiting panicky bow include innocent", "score": 16, "replies": []}, {"body": "You are a box of rocks. You expect NVDA to add another 1.5T in Market Cap in 3 weeks? This is the dumbest bet I’ve ever seen. What is your break even price with the trades?", "score": 12, "replies": [{"body": "It’s not gonna work out very well for me😂", "score": -3, "replies": []}]}, {"body": "Lol and I thought my $1220 6/28 Calls was absurd. May the odds be ever in our favor!", "score": 18, "replies": [{"body": "Why would $1220 be absurd? It was $30 above that last week?\n\nAnd $50-$80 intraday moves are not uncommon with this stock.", "score": 8, "replies": []}]}, {"body": "Should have donated your money to charity, rather than the market.", "score": 20, "replies": [{"body": "Summer is here and It’s about time these hedge fund managers get a new boat so I gotta contribute", "score": 18, "replies": []}, {"body": "Thetagang gotta eat too", "score": 2, "replies": []}]}, {"body": "And I thought my $150c September was bad ![img](emote|t5_2th52|4275) lol this is wildly outta control ![img](emote|t5_2th52|4271)", "score": 5, "replies": [{"body": "150 next week", "score": 1, "replies": [{"body": "I hope so!!", "score": 1, "replies": [{"body": "I'm thinking it'll bounce between 110 and 140. Set your limit sells and don't be greedy!", "score": 1, "replies": [{"body": "140 would be amazing!!", "score": 1, "replies": []}]}]}]}]}, {"body": "Godspeed, regard. You're gonna need Jesus on this one", "score": 9, "replies": [{"body": "Even Jesus himself will need some help on that", "score": 6, "replies": [{"body": "His cousin Diaz will help him out.", "score": 3, "replies": []}, {"body": "Jesus probably sold him these calls", "score": 3, "replies": []}]}]}, {"body": "https://preview.redd.it/ry88kx818d5d1.jpeg?width=1290&format=pjpg&auto=webp&s=293dd8dfb04819110b3789c86dd1256a74b755c3\n\nAnnnnnd just like that, it’s gone! 😂😂😂😂😂", "score": 8, "replies": [{"body": "https://preview.redd.it/klf4p53gde5d1.png?width=324&format=pjpg&auto=webp&s=60a21b7fc7f8dd0d2b3576723cc77c5c9f341756", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "Why didn't you donate the money instead of giving it to the MMs who already have more than enough money?", "score": 4, "replies": []}, {"body": "Well...Stocks tend to sell of on the split date with profit taking from institutions. However historically stock prices rise during the weeks following the split date. Also take into consideration the impact a Fed meeting and CPI have on the market this coming Wednesday. Going into that from the split date could potentially create a muted response to the split...which creates a great buying opportunity this week. If the Fed is dovish on Wednesday there is a possibility NVDA could move up to 120 or 130 in the coming weeks. His calls don't necessarily need to get to 2000 (200 post split) for him to make money depending on what he bought the options for, NVDA just need to rise higher than the price he bought the options at and IV stay the same or rise.", "score": 4, "replies": [{"body": "This is gold!", "score": 2, "replies": []}]}, {"body": "1-800-BETSOFF is all you should be doing now...", "score": 3, "replies": []}, {"body": "$150 by end of June? Possibly. $200 is a far shot", "score": 3, "replies": []}, {"body": "https://preview.redd.it/6zjrs4vhdg5d1.jpeg?width=464&format=pjpg&auto=webp&s=200bf473ad68ca0ca94f7942a92fbc97e99fa530", "score": 3, "replies": []}, {"body": "Playing options on Flower Foods is… unorthodox", "score": 2, "replies": []}, {"body": "That’s definitely regarded!", "score": 2, "replies": []}, {"body": "Honestly depends on how long it took you to save those \"life savings\". If you make like 100k a year, I can see dropping a few G's on a gamble play every now and then. Still regarded as ever, but my favorite pedofile once said \"You Only Live Once, that's the Motto ninja YOLO\"", "score": 2, "replies": []}, {"body": "Lol, could have used that money to buy two decent strikes and double or triple that money.\n\nBut here we are with a head scratcher of a move.", "score": 2, "replies": []}, {"body": "This is wild.", "score": 2, "replies": [{"body": "This is not only wild, it’s regarded😂", "score": 1, "replies": []}]}, {"body": "It only has to go up, not hit the strike", "score": 2, "replies": [{"body": "U understand what I’m tryna do here", "score": 1, "replies": []}]}, {"body": "I can’t tell if you like money or hate money too much with this regarded play", "score": 2, "replies": []}, {"body": "\"super far OTM\" bro its less than 3 weeks....", "score": 2, "replies": [{"body": "Just need it to go to 135!", "score": 2, "replies": []}]}, {"body": "🚀🚀🚀", "score": 2, "replies": []}, {"body": "Hes about to have non-standard options with no liquidity.  Sell before split. ", "score": 1, "replies": [{"body": "Oh damn then I’m fucked", "score": 1, "replies": []}]}, {"body": "What happens to these options when the split happens?", "score": 1, "replies": []}, {"body": "That delta is less than 0.1 btw", "score": 1, "replies": []}, {"body": "You are about to have a shit ton of calls", "score": 1, "replies": [{"body": "Ikr!!! I wanna see what 900 contracts feel like", "score": 1, "replies": [{"body": "Remind me Monday", "score": 0, "replies": [{"body": "Bet", "score": 1, "replies": [{"body": "I wanna see", "score": 1, "replies": []}]}]}]}]}, {"body": "$2000 strike calls expiring in a month?\n\nLMAO", "score": 1, "replies": []}, {"body": "Top signal", "score": 1, "replies": []}, {"body": "Will be, not would be", "score": 1, "replies": []}, {"body": "Never go full regard", "score": 1, "replies": []}, {"body": "Holy shit", "score": 1, "replies": []}, {"body": "!remindme 2 weeks", "score": 1, "replies": [{"body": "Don’t do me like that brooooo", "score": 0, "replies": []}]}, {"body": "could’ve just bought shares in NVDL or NVDX if you’re that fucking bullish…instead of putting a time stamp on your regarded brain", "score": 1, "replies": [{"body": "That’s mean but ur right", "score": 1, "replies": [{"body": "that’s why i’m sitting in 2x leverage through 2026 but I watch their guidance very closely come late August when they report again", "score": 1, "replies": []}]}]}, {"body": "Do you need nvda to hit 200? Idk man", "score": 1, "replies": [{"body": "Hits 140 I’m good", "score": 1, "replies": []}]}, {"body": "I wonder why those options are so cheap....", "score": 1, "replies": []}, {"body": "Everyone’s clowning OP for these stupid plays meanwhile I’m just giggling at how the 2k call is the one with a small profit so far", "score": 1, "replies": [{"body": "I was up 40-70% across the board on Thursday but I didn’t sell lol", "score": 1, "replies": []}]}, {"body": "Can somebody message me and remind me to check back on Friday", "score": 1, "replies": []}, {"body": "Ah. There it is. Time for zee bears to play.", "score": 1, "replies": []}, {"body": "Be ready to close all those on basically any pop that makes them green and hope someone else is more regarded on the other side.", "score": 1, "replies": []}, {"body": "NVDA is about to do a 10-1 stock split on Monday.", "score": 1, "replies": [{"body": "Yea Ik", "score": 1, "replies": []}]}, {"body": "Can you just donate the money to me instead?", "score": 1, "replies": [{"body": "I wish I can but I need to gamble", "score": 1, "replies": []}]}, {"body": "You belong here", "score": 1, "replies": [{"body": "thank you", "score": 1, "replies": []}]}, {"body": "You just convinced me to buy 100 shares .. so I can sell regards covered calls....", "score": 1, "replies": []}, {"body": "How do I buy puts on u/Prior_Parsnip6133?", "score": 1, "replies": []}, {"body": "Yep you belong here. Wave bye bye to that money.", "score": 1, "replies": []}, {"body": "It is gonna be alot harder to move after the split. You fucked", "score": 1, "replies": []}, {"body": "You are 🧠 😵", "score": 1, "replies": [{"body": "Ur right", "score": 1, "replies": []}]}, {"body": "There are more fun ways to lose $7000", "score": 1, "replies": []}, {"body": "You're gonna be rich if it pulls a TSLA... but broke for anything less!", "score": 0, "replies": [{"body": "99.999% imma be broke af", "score": 1, "replies": []}]}]}
{"title": "NVIDIA June 14th $1600 Call Option", "selftext": "If you look back at my post from 16 days ago you will see I was questioning buying $1600 call options for NVIDIA at the cheap price of $18 per call. I got called crazy and dumb by fellow redditors. Looking back I won’t listen to what others have to say because just two days ago I got curious and checked and saw they happened to be trading around $85 in the recent run by NVIDIA. Moral of the story if the options are cheap and you have a gut feeling that a catalyst may temporarily swing the price of the call option then just go ahead and get some. The catalyst I honestly had in mind was the 10-1 stock split which still hasn’t occurred yet. I am the type of individual who overthinks everything, but maybe just maybe one of these days I will learn to trust my gut. It ends up being right most of the time!", "id": "1db4a6j", "created_utc": 1717857177.0, "score": 744, "upvote_ratio": 0.83, "num_comments": 338, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 4 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "That one time you'll actually trust your gut and do the move, it's going to go against you. \n\nSource: me.", "score": 2213, "replies": [{"body": "Happens 100% of the time. Neglect your gut until you trust your gut and it’s wrong and then the cycle begins anew", "score": 313, "replies": [{"body": "https://preview.redd.it/r8ble8iaae5d1.jpeg?width=820&format=pjpg&auto=webp&s=468c4cf162dd9a9a6d2145ad958157463695bd67", "score": 161, "replies": [{"body": "What if I called your wife a ho OP, would you still go with calls?", "score": 1, "replies": []}]}, {"body": "You neglected your gut bacteria. Eat more yogurts.", "score": 35, "replies": [{"body": "Need probiotics for gut to be right 100%. Not a financial or a medical advice", "score": 1, "replies": []}, {"body": "He eats man-aise..... Same thing?", "score": 1, "replies": []}]}, {"body": "That’s a sign ur gut sucks", "score": 3, "replies": [{"body": "Might be IBS", "score": 14, "replies": [{"body": "Irritating bowel syndrome?", "score": 2, "replies": [{"body": "Irrefutable buy signal", "score": 10, "replies": []}, {"body": "Irritating bs", "score": 2, "replies": []}]}]}]}, {"body": "Moral of the story do the opposite of what your guy says", "score": 1, "replies": []}, {"body": "It's your gut paying you back for doubting.", "score": 1, "replies": []}]}, {"body": "Gut wiped out pretty much all my gains for the year over the past couple weeks.", "score": 30, "replies": [{"body": "That's why you inverse your gut and go with your 6 pack.", "score": 7, "replies": []}, {"body": "If your gut was bearish, you have a gut problem", "score": 1, "replies": [{"body": "I was a week early on puts and then a week early on calls 😔", "score": 1, "replies": []}]}]}, {"body": "At one point last year I had 33 $900 calls for 6/21/24...and I sold them in fear tooooo early, would of bagged 500k...sometimes u gotta do it and let it ride completely..FML", "score": 27, "replies": [{"body": "When I see this type of stuff and in my own experience, I think what are the chances I would have actually held all the way through to realize the $500K gain? I’m sure at some point I would have sold. Up $50K $100K $250K do you think you would have kept holding? Prolly not", "score": 24, "replies": [{"body": "Trick is to fall into a coma for dte minus 1.", "score": 2, "replies": []}, {"body": "As fast as it went...it did climax (lol) right at 500k for like a week after Q1 earnings..I'm pretty sure no less then 350k..", "score": 2, "replies": [{"body": "If I had held 30 more days...only...IF...", "score": 0, "replies": []}]}]}]}, {"body": "Real", "score": 6, "replies": []}, {"body": "Lmao happened a couple times for me but I also won a few times.. you win some you loose some", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": []}, {"body": "Wuts a gut", "score": 4, "replies": []}, {"body": "yep", "score": 2, "replies": []}, {"body": "Speaking from experience", "score": 2, "replies": []}, {"body": "Me on every single multiple choice test ever", "score": 2, "replies": []}, {"body": "Source is actually universe on this one.", "score": 2, "replies": []}, {"body": "Lol, me too. I lost a lot that day.", "score": 1, "replies": []}, {"body": "Hurts even more when you trust the TA and your gut when you’re so sure about a trade", "score": 1, "replies": []}, {"body": "I think you may have a leaky gut. You should eat more probiotics", "score": 0, "replies": []}, {"body": "It’s always the plays that feel like the surest best that screw you.", "score": 0, "replies": []}]}, {"body": "Don’t confuse pure dumb luck with good instincts. That’s how they get you.", "score": 436, "replies": [{"body": "OP thinks he's on the good instincts side. Doesn't realize he's on the dumb luck side. \n\nHe'll be working at Wendy's by the end of the year.", "score": 64, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "He’s betting on an IV hike", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Implied volatility", "score": 2, "replies": []}]}]}, {"body": "Pretty sure that would make nvda the most valuable company in the world", "score": 1, "replies": []}]}]}]}, {"body": "Wait what? There's a 10 to 1 split? Are you an insider?", "score": 170, "replies": [{"body": "I'm inside my house right now, does that count?", "score": 67, "replies": [{"body": "Are the splits with us right now?", "score": 9, "replies": []}]}, {"body": "Insider? I barely even know her!", "score": 16, "replies": [{"body": "Never been inside her either :/", "score": 6, "replies": []}]}, {"body": "Announced Thursday happening Monday 10-1 split", "score": 0, "replies": [{"body": "It was obviously satire. Every single news site is reporting about it, every 3rd post on every stock related sub reddit is about the split.", "score": 3, "replies": []}, {"body": "Touch grass. Please.", "score": 0, "replies": []}]}]}, {"body": "“The catalyst that I had in mind was the 10-1 stock split”\n\n![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271) thanks chief, what an unheralded and secret catalyst your ‘gut’ came up with. And you let your genius get stifled by wsb?\n\nBelongs here like a mod, this regard", "score": 843, "replies": [{"body": "Truly, the Pythagoras of our time", "score": 141, "replies": [{"body": "The Archimedes of oompa loompa land.", "score": 51, "replies": []}, {"body": "OP is Quasimodo fr", "score": 12, "replies": []}, {"body": "“The sum of the square root of an isosceles triangle is equal to the square root of the remaining side.”", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|51295)", "score": 4, "replies": []}, {"body": "Truly, the Stephen Cocking of our generation", "score": 8, "replies": []}, {"body": "praise and glory be to the triune god", "score": 7, "replies": []}]}, {"body": "High five, fuck op hahhaahahahah", "score": 7, "replies": []}, {"body": "Dang, how did we not think of the 10-1 split? That’s probably not priced in, right?", "score": 2, "replies": []}, {"body": "Wait, NVDA is having a stock split?? Why didn’t anybody tell me. I’m ready to buy when market opens", "score": 0, "replies": []}]}, {"body": "You can check out this options calculator here:\n\nhttps://www.optionsprofitcalculator.com/\n\nJust to see what you're looking at. Aka the likelihood of good payouts. \n\nIf you think you know better than the system, then hey what the heck, it's your money. But also good to have a gut check against some real numbers every now and then.", "score": 137, "replies": [{"body": "What the fuck are those advanced strategies? They read like sex positions.", "score": 69, "replies": [{"body": "That was literally the point. Coked out finance bros in the 80's being funny", "score": 47, "replies": [{"body": "That's believable enough.", "score": 13, "replies": []}]}, {"body": "naked poor man leg spreads", "score": 29, "replies": [{"body": "Someone's been to Bangkok!", "score": 8, "replies": []}, {"body": "now also supports the Wendy's spread", "score": 1, "replies": []}]}, {"body": "optionstrat i found is way better", "score": 10, "replies": []}, {"body": "You never done a jade lizard or put broken wing? Personally, I am a big fan of backspreads as opposed to normal spreads.", "score": 9, "replies": [{"body": "I’m always getting bent over", "score": 9, "replies": []}]}, {"body": "you guys use strategies?", "score": 2, "replies": []}]}]}, {"body": "I trusted my gut and so far down 50k.", "score": 179, "replies": [{"body": "You should have waited for a catalyst ", "score": 71, "replies": [{"body": "Someone that converts people into looking for catalysts has a heart of palladium in my book. I dub thee the catalytic converter", "score": 10, "replies": []}, {"body": "A 10-1 stock split to be specific", "score": 1, "replies": []}]}, {"body": "You trusted the wrong gut, next time trust OP's gut", "score": 8, "replies": []}, {"body": "Unrealized means not real", "score": 7, "replies": [{"body": "unrealized means diamond hand time baby!", "score": 3, "replies": []}]}, {"body": "Try pepto", "score": 5, "replies": []}, {"body": "Next time you need someone in your gut", "score": 3, "replies": []}, {"body": "Try pepto", "score": 5, "replies": []}, {"body": "Looks like you need to go for a poop transplant therapy. Your gut microbiota needs to be swapped.\n\nDisclaimer: this is not a medical advice. Just an opinion.", "score": 0, "replies": [{"body": "I can poop in your mouth for free ![img](emote|t5_2th52|4271) 💩", "score": 2, "replies": [{"body": "We gonna need to see your all time graph first.", "score": 1, "replies": [{"body": "gOnNa NeEd 2 SeE aLl TiMe GrApH fIrSt", "score": 1, "replies": []}]}]}]}]}, {"body": "The most profitable trade is always the  one you thought about but didn't pull the trigger on.", "score": 59, "replies": [{"body": "And if you pull the trigger it magically turns to the worst trade of your life", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 32, "replies": [{"body": "It was .45c eod friday. Maybe he meant $1.80 and just cherrypicked that moment 2 days ago when it shot up at open to above 1250? He's a true savant.  \nAlso, in 2021 i used to trade the 01/2024 -  300 and 400 leaps. At one point in 2022 the 400s got down to under $2. Now THAT was the greatest NVDA pickup if anyone managed to snag it then. (not me)", "score": 28, "replies": [{"body": "Whoever picked those 400c back in 2022 is busy swimming in their Olympic-sized pool of money, Jesus Christ LOL", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "We’re talking about the crazy diamond hand fuckers who had Olympic sized swimming pool capital to buy those calls, but not pool + yacht combo. \n\nThey probably just bought their yachts with the money they made by selling those at this past high lol", "score": 2, "replies": []}]}]}]}, {"body": "I think he meant the contract price was $85 or $0.85 a share.", "score": 14, "replies": []}]}, {"body": "You missed your one gut feeling. The others will be losses. See, you’re just a regard like everyone, nothing special.", "score": 42, "replies": []}, {"body": "Results-based thinking is pretty dangerous in this game. I encourage you to buy weeklies that are 40%+ OTM going forward though.", "score": 45, "replies": [{"body": "I think the more amazing thing is there’s still premium on options 25% OTM on a $3T stock that expire in 7 days", "score": 13, "replies": [{"body": "On top of that the contract OP is referencing has thousands in open interest as of Friday close.", "score": 3, "replies": []}]}]}, {"body": "The Market operates just like a drug dealer, it always gives you a nice taste….almost on the house……and then you’re hooked.", "score": 23, "replies": []}, {"body": "How does this work with the stock split taking place Monday?", "score": 10, "replies": [{"body": "You get 9 additional options contracts for each one that you currently own and they would each be for a strike price that is 1/10th of what it currently is.", "score": 10, "replies": [{"body": "Sounds juicy!", "score": 3, "replies": []}]}, {"body": "10x ur position", "score": 6, "replies": []}]}, {"body": "Yes, let’s trade based on a hindsight portfolio that spiked up for 3 minutes after market open a couple days ago. Genius", "score": 9, "replies": []}, {"body": "I bought some $1750 March 17 2025 calls for somewhere around $75. Not crazy. Bulletproof. After the split, do we seriously doubt NVDA will hit $175 by March 2025? Please. Printer go brrrr fellow ape, everyone else will bitch and moan about how they’re “waiting for the pullback”.", "score": 8, "replies": []}, {"body": "Oh, bravo, you financial wizard! So, let me get this straight: you threw darts blindfolded and accidentally hit a bullseye, and now you’re the new Warren Buffett? Classic WSB move. \n\n\"Cheap\" $18 calls on NVIDIA? Clearly, you’ve got diamond hands and a gut feeling that even Nostradamus would envy. And the 10-1 stock split that hasn’t even happened yet? Genius! Truly, betting on phantom catalysts is a strategy worthy of ape admiration. \n\nI guess we should all ignore the haters and follow our \"gut\" feelings. Because, as you so brilliantly demonstrated, if you randomly YOLO enough, you might just stumble into tendies. Thanks for the enlightenment, Nostrapredamus. Keep trusting that gut of yours – it's obviously a financial oracle. 🚀📈💎🙌", "score": 36, "replies": [{"body": "That's a lot of words to tell the lad he's regarded.", "score": 39, "replies": [{"body": "He said what we were all thinking lol", "score": 8, "replies": []}]}]}, {"body": "So the stock needs to go to 4T for you to make money? No problem, wish I thought of that.", "score": 7, "replies": [{"body": "No the premium just has to go up for you to make money.", "score": 3, "replies": [{"body": "Ah!", "score": 2, "replies": []}]}]}, {"body": "Yesterday morning me: \"This zombie company, run by a grifter CEO and supported by a literal cult just tripled in 2 weeks on vibes. Not sure why it plunged overnight, probably just profit-taking, but my gut is telling me that this coked-up dude in a bathrobe who seems chill losing a quarter B is going to say something to rocket this and my gut was right once in 2021 so the 5000% IV on these OTM calls is just more confirmation that I'm a fucking savant.\"", "score": 12, "replies": []}, {"body": "This post is sponsored by kombucha", "score": 4, "replies": []}, {"body": "I got the script brother. Wednesday, they’re gonna announce rate cut, NVDA to 200$ post split 🚀🚀🚀🚀🚀🚀 we eating Wangyu beef, caviar. I will lick Dubai’s gold ice cream between the hottest OF titties 🤑🤑 BIDEN 2024 🦅🇺🇸", "score": 36, "replies": [{"body": "Definitely not announcing a rate cut.", "score": 9, "replies": [{"body": "Next you are gonna say Wangyu beef isn’t even real!", "score": 1, "replies": [{"body": "Nope, just that non farms were highest in 5 months. Meaning ZERO chance rates are coming down.", "score": 1, "replies": []}]}, {"body": "Daddy chill", "score": 1, "replies": []}]}, {"body": "You son of a bitch, I like how you think.", "score": 2, "replies": []}, {"body": "U had me till the Biden 2024", "score": 6, "replies": []}, {"body": "Don't get it.  Why would you want to lick Biden's titties?", "score": 1, "replies": []}, {"body": "I hope the fuck so. I will have 50 140c 5dte come Monday. 🤞🏻", "score": 1, "replies": [{"body": "130$ today already. They just need to do the same shit 1 more day 💰💰💰 easy bagger. All the mf called me regard but don’t show their position 🤪🤪", "score": 2, "replies": []}]}]}, {"body": "I do the opposite of my gut and lost just as much", "score": 4, "replies": []}, {"body": "The lotto tickets lose much more frequently and much higher percentage of premium than the options with strikes that are right next to the share price when you buy it.  So, knowing that is part of the equation in deciding whether an option is worthwhile.", "score": 5, "replies": []}, {"body": "999 out of 1000 you lose money Andy.", "score": 4, "replies": []}, {"body": "People that aren’t able to believe that it’s just gambling are willlld.", "score": 4, "replies": []}, {"body": "Thats how day trading works. That same call will most likely expire worthless", "score": 4, "replies": []}, {"body": "I also played something similar in late may, made a lot, but got nervous and sold, only for it so go up even harder and longer💦😩", "score": 5, "replies": []}, {"body": "Lesson is no one knows the fuckin future. Sometimes you could be right and sometimes wrong", "score": 3, "replies": []}, {"body": "It’s the law of averages.  I think about playing a few strategies a week.  Some will certainly pan out, but most will not.  \n\nTo fix this, I am developing my very own crystal ball.  It’s not working yet, though.  ", "score": 4, "replies": []}, {"body": "If ur june 14 1600 hits then my july 12 1170 will be printing 😎", "score": 5, "replies": [{"body": "Your 7/12 1170s should be on fire next week imo.", "score": 3, "replies": []}]}, {"body": "I’ve been right on the direction of three plays in a row this week and only broke even. Good luck with your deep OTM options. Hope it works out for you next time genius guy.", "score": 3, "replies": []}, {"body": "The key is not going balls deep on each intuition with deep OTM calls expiring in 5 days", "score": 4, "replies": []}, {"body": "I just looked at your post history. You put 100% of your portfolio on BB at $19.33? Bro, your gut sucks.", "score": 4, "replies": []}, {"body": "The thing is that it went up because you didn't buy. If you would have bought it would have tanked. Please don't touch the stock or options but please do buy puts or short naked so us regards can continue to be invested and buy more. Please do send a two weeks notice to everyone before you buy so everyone gets a chance to offload before you onboard.", "score": 3, "replies": []}, {"body": "You weren’t running to robinhood to buy calls when nvidia was 720 like 45 days ago? Oh wait, that’s me.", "score": 4, "replies": [{"body": "Attaboy!", "score": 1, "replies": []}]}, {"body": "\n\nWe ALL have these plays we don't do and they make $$$.", "score": 6, "replies": []}, {"body": "oh this comming weeks wsb gonna be a content goldmine", "score": 3, "replies": []}, {"body": "Basically, don’t worry what others think. True in many areas of life.", "score": 3, "replies": []}, {"body": "You would have held until they expired worthless anyway you regard lol", "score": 3, "replies": []}, {"body": "I sold 1600$ calls for end of this year bc i wanted to get some of that DFV cake... Should have kept my ETFs too..", "score": 3, "replies": []}, {"body": "That's to high level and to close to the expiration date, I guess .", "score": 3, "replies": []}, {"body": "So basically......you thought you saw something.....were brave enough to post about it. Then let strangers scare you away from the trade despite \"your gut\", then come back to post about it? \n\nHehehehe, yes, you will do nicely for the markets and the mighty liquidity that determines all. \n\nGo ahead and just switch over to 0 DTE derivatives. Make this process easier on yourself and quicker for the market. 😈🤑🤑😁", "score": 3, "replies": []}, {"body": "Ok hindsight harry", "score": 3, "replies": []}, {"body": "Good God OP don't post anything like this ever again you're not the genius you think you are. Anytime anyone makes money in the options market it's sheer dumb fuckin luck. \n\nBest plays are you buy LEAPs on solid companies 1-2 years out right after the stock crashed after a shitty earnings but it's still a solid company with growth. Did that with META and bagged 20k. Could've lost a ton had there been a recession that takes half a decade to recover. Still nothing but dumb fuckin luck so please just say it as such. Everyone that's winning in the casino right now is because it's a free bull market until it isn't", "score": 5, "replies": []}, {"body": "Ok", "score": 2, "replies": []}, {"body": "Gut feeling ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "totally dude, i wont bough $50 PLTR cals for $0.5 and sold them for $5! And the stock has never hit $50 ever.", "score": 2, "replies": [{"body": "checking my  receipts - sold them for $2.50 not $5.", "score": 1, "replies": [{"body": "That's almost half.", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}]}, {"body": "There’s a reason why people dont trust their gut ALL the time. \n\nIt’s because our gut can be a lying piece of shit and we’ve been burned hard by it before. \n\nFool me once, shame on you\nFool me twice, cant get fooled again", "score": 2, "replies": []}, {"body": "This was embarrassing to read. I look forward to seeing your loss porn in the coming weeks.", "score": 2, "replies": []}, {"body": "Did you buy them?", "score": 2, "replies": []}, {"body": "Got it. All we need to trade successfully is our gut instinct", "score": 2, "replies": []}, {"body": "I don't even want to know how much the 7/19 $1450C are now. I bought one for $4.65 and sold it for $8.20", "score": 2, "replies": []}, {"body": "I don’t know why everyone hear would listen to ppl pretending they are certain about stuff nothing is a certainty however tells you something won’t or will happen is naive.", "score": 2, "replies": []}, {"body": "This is the reason I always wonder why people get on here and ask for advice on what to do.  These people on here try to help but are not financial advisors.  Don’t ask and then come back and complain.", "score": 2, "replies": []}, {"body": "“Hey there is a bubble” “how do u know?” “Trust me”", "score": 2, "replies": []}, {"body": "Nvidia has a crazy gamma thing were stupid OTM calls still move with the price a lot. It can be played. \n\n\nExpect that to reduce with the split though, unfortunately. Gamma bros will still have SMCI.", "score": 2, "replies": []}, {"body": "crazy", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I thought it happens on Sunday.", "score": 1, "replies": []}]}, {"body": "They’re worth double now tbf, but you really shouldn’t play around with close to 0dtes unless you’re a true regard.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "What's worse is that you choose the correct strike and then it's 1 week or 1 day too early for the move to happen and your contract expires worthless", "score": 1, "replies": []}, {"body": "You think that NVDA can reach 1600 by 14JUN24 due to the stock split, like the equivalent of 1600 by 14JUN24 would reach 160 ? \n\nA lot of people could potentially buy because \"its cheap now\" but also a lot of people had access to shares already OR had bought fractional shares. Who knows maybe there'll be a retail pepega moment where people go \"omg it dropped to 120!! BUY NOW\" without understanidng what a stock split is.", "score": 1, "replies": [{"body": "When Tesla split, in some random trading discord I was in someone wrote \"I guess the bears finally won\" 100% unironically. That being said I doubt there are enough people like that to significantly move the stock price.", "score": 1, "replies": []}]}, {"body": "Please mister genius man with the gut feeling of the truest of chads, buy and HOLD those OPTIONS till expiration next time...", "score": 1, "replies": []}, {"body": "You did great", "score": 1, "replies": []}, {"body": "Good luck 🍀👍", "score": 1, "replies": []}, {"body": "My gut tells me it's time for me to go to the bathroom and make a deposit", "score": 1, "replies": []}, {"body": "You can look at in two ways \n1. Learning lesson \n2.Hate Fear sympathy blame \n\nOnly as important as what you put on this moment \nSemper Fi \nOne Arm One Leg Drive On", "score": 1, "replies": []}, {"body": "What’s on June 14th?", "score": 1, "replies": []}, {"body": "My gut says all on black and spin the wheel!!", "score": 1, "replies": []}, {"body": "Put your money where your mouth is. Make the play and post your gain/loss porn", "score": 1, "replies": []}, {"body": "lol that’s a week away. Don’t they have some inflation thing I would not risk it. I can already hear  it “ we need more data.”", "score": 1, "replies": []}, {"body": "Market makers will still screw you over, they have AI that calculates everything to the T and will always profit", "score": 1, "replies": []}, {"body": "👀", "score": 1, "replies": []}, {"body": "Yep, you definitely belong here", "score": 1, "replies": []}, {"body": "Don't be afraid to make a bet. Just be smart about sizing.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "in Huang we trust", "score": 1, "replies": []}, {"body": "\"I KNEW I SHOULD'VE BET HEADS!\"", "score": 1, "replies": []}, {"body": "Nvidia is one of few stocks where weekly and monthly calls would have actually worked and only some of the time", "score": 1, "replies": []}, {"body": "FOMO is real, I should seriously just bite the boot and follow Granny Nancy like I thought in February. I wouldn't be up as much as she is, but man, I wouldn't be here either... Jaja", "score": 1, "replies": []}, {"body": "OP’s hesitation is why NVDA soared", "score": 1, "replies": []}, {"body": "Being that out of the money and so short time period is called gambling but gz.", "score": 1, "replies": []}, {"body": "This is called confirmation bias", "score": 1, "replies": []}, {"body": "4x for a lotto play isn’t worth it", "score": 1, "replies": []}, {"body": "Remindme! 2 weeks", "score": 1, "replies": []}, {"body": "Why is everyone arguing with him? Let him take his own advice, and hell disappear from the subreddit when he has to re-sell his options for $1 each!", "score": 1, "replies": []}, {"body": "I mean, it’s gonna open at a hair over $120 on Monday. I guess it *could* make it to $160 by EOW but that’s the equivalent of it going up $400 in one week pre-split. Possible, but unlikely….", "score": 1, "replies": []}, {"body": "I see posts like this a lot. Why buy so deep out of the money? Likelyhood of success is so poor. You’re talking about a number that may as well be impossible because of the market cap. Not saying that it wouldn’t happen but you’re most likely to fail because of it. If you would’ve bought at the money, you would’ve almost tripled your money and that was a nearly guaranteed move. If you can’t afford to sweat over 7k per contract then pick another stock. You want to make money bro, don’t lose it. If you would’ve done that, do you think you would’ve sold at 85?", "score": 1, "replies": [{"body": " But he had a catalyst.  On May 24 he was aware of the stock split announced on May 23. 😂😂😂", "score": 1, "replies": []}]}, {"body": "Mine usually says, “impending doom! Sell everything! Short everything!” Then the market rips and I get steamrolled", "score": 1, "replies": []}, {"body": "You would have earned a lot more with smaller call options.", "score": 1, "replies": []}, {"body": "It’s all about risk management, but regards can only see confirmation bias and use one datapoint to boost their risk tolerance. Good luck", "score": 1, "replies": []}, {"body": "Your gut does not prove to be right most of the time.", "score": 1, "replies": []}, {"body": "My all time P&L strongly disagrees with you.", "score": 1, "replies": []}, {"body": "You’re a genius stock trader but also regarded with a capital T.", "score": 1, "replies": []}, {"body": "Your stomach and brain were connected in the womb until separated by your spine, that’s why they say trust your gut.", "score": 1, "replies": []}, {"body": "Care to explain? Im new", "score": 1, "replies": []}, {"body": "The stocks about to be ~$120. No way your 1600 will hit.", "score": 1, "replies": []}, {"body": "I think the 10-1 split is going to cause a huge sell off Monday. People will shave 10-20% off and take some profits.", "score": 1, "replies": []}, {"body": "Cry more", "score": 1, "replies": []}, {"body": "You’re cooked possibly, better hope this Wednesday we go back up", "score": 1, "replies": []}, {"body": "All these newbies got lucky with NVDA and think they’re suddenly a god when it comes to options", "score": 1, "replies": []}, {"body": "\"Gut feeling\" is not a validation of any sort to bet on something esp your hard earned money. Youll learn it very quickly the next time because the probability % is extremely low. Good luck though", "score": 1, "replies": []}, {"body": "That can reverse anytime so if you are up 300% or so, you should probably sell while ahead because the closer you get to the 14th and it isn’t $1600 you will end up worthless.", "score": 1, "replies": []}, {"body": "Not shitting on you but you are now fighting the Theta gang. $85 was Friday… the decay is real and will be melting away fast next week.   $85 is as high as it will go.    I can’t see it running from $120 to $169 by Friday even if they announce rate change next week", "score": 1, "replies": []}, {"body": "The split happened after Friday’s close.", "score": 1, "replies": []}, {"body": "What-ifs are a thief of life", "score": 1, "replies": []}, {"body": "LOL there’s no way it’s going to 1600 anytime soon 😆", "score": 1, "replies": []}, {"body": "Nice job trusting your gut! Anyone else having a 'told you so' moment?", "score": 1, "replies": []}, {"body": "That option will be worthless in 6 days. Sell it on market open Monday and be thankful you are getting anything for it.", "score": 1, "replies": []}, {"body": "I think my gut is full of shit based on my losses this year. 😂", "score": 1, "replies": []}, {"body": "Maybe the mods can make a *woulda, coulda, shoulda* tag for this post ![img](emote|t5_2th52|18630)", "score": 1, "replies": []}, {"body": "said this when it was 300", "score": 1, "replies": []}, {"body": "FOMO hindsight 20/20, relatable, yet, u could also get fkd when u finally went ahead with it...", "score": 1, "replies": []}, {"body": "If you had good instincts you wouldn’t have post this garbage", "score": 1, "replies": []}, {"body": "How much will this make you ?", "score": 1, "replies": []}, {"body": "“Hey guys, I went back through my post history and discovered I was a genius.”", "score": 1, "replies": []}, {"body": "My gut says it will go down shortly after the split. Howbowdat OP?", "score": 1, "replies": []}, {"body": "The Ole shoulda, woulda, ![img](emote|t5_2th52|4267)coulda plays are always the best ones.", "score": 1, "replies": []}, {"body": "Can we make this guy a mod?", "score": 1, "replies": []}, {"body": "So you got right one time?", "score": 1, "replies": []}, {"body": "Fuck bro, are you an oracle. Why come here twice about trades you haven’t done to bitch about being swayed by a hive of regards", "score": 1, "replies": []}, {"body": "Still doubt it goes that high after the split though, we'll see", "score": 1, "replies": []}, {"body": "It's the guys who trusted their gut's money we earn here, so go on.", "score": 1, "replies": []}, {"body": "and have you asked GPT for permission?", "score": 1, "replies": []}, {"body": "What was the spread .05-.85", "score": 1, "replies": []}, {"body": "Trusted my gut and bought Nvidia calls last week. It managed to eat my 2 months' gains.", "score": 1, "replies": []}, {"body": "Isnt it splitting on Monday?", "score": 1, "replies": []}, {"body": "Yeah thats why you dont post your trades here, they will meme tf outta you.", "score": 1, "replies": []}, {"body": "I trusted my gut with the 1st wife and now the 2nd wife and it was wrong both times", "score": 1, "replies": []}, {"body": "after split.", "score": 1, "replies": []}, {"body": "What about the 1000 other trades you trusted your gut on that went to zero?  A true degenerate gambler my friend 🤝", "score": 1, "replies": []}, {"body": "Intuition is gambling. You're going to lose everything, either this time or next time. Stocks like Nvidia don't come around very often. So don't boast about making the right bet this time. Make people laugh", "score": 1, "replies": []}, {"body": "I bought an $1100 for Sept a few months ago and people thought I was nuts at $33", "score": 1, "replies": []}, {"body": "Wouldn’t trust those premiums, check Monday morning after everything settles", "score": 1, "replies": []}, {"body": "I had that feeling and I bought 5 $1500 calls for 6/21 around then. Now I've got 50 6/21 $150 calls.", "score": 1, "replies": []}, {"body": "Loss porn nice", "score": 1, "replies": [{"body": "This is as far as it will go. Glad you didn't take them.", "score": 1, "replies": []}]}, {"body": "Someone talk me out of 250c June 2025 leaps", "score": 1, "replies": []}, {"body": "Congrats, you’re about to lose 100% of your money", "score": 1, "replies": []}, {"body": "Yes, please, do it...and then write again in a few months while working at Wendy's back alley.", "score": 1, "replies": []}, {"body": "Rip", "score": -1, "replies": []}, {"body": "So you probably would have held it till expiry thinking it would keep going up and gotten hosed. Think about it that way.", "score": 0, "replies": []}, {"body": "OP I just really want you to know I'm glad you're here. Without people as dumb as you putting money in the market, I would never make any money.", "score": 0, "replies": []}, {"body": "Crazy and dumb", "score": -2, "replies": []}]}
{"title": "OG NVDA owners know the feeling", "selftext": "", "id": "1db80fv", "created_utc": 1717867540.0, "score": 7364, "upvote_ratio": 0.94, "num_comments": 367, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 12 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Bought Nvdia at 25, sold it at 26😅", "score": 1758, "replies": [{"body": "You should be the mayor here, a true REGARD", "score": 661, "replies": [{"body": "I bought amd at 2.75 and sold at 2.10 because it was losing money", "score": 206, "replies": [{"body": "Damn I bought 200 shares of AMD at $2 and sold when it was $4 and thought I was the man. Still punching air to this day", "score": 145, "replies": [{"body": "In 2017, I bought 35 shares of AMD at 11 and sold it at 49 in 2020.", "score": 31, "replies": [{"body": "That’s a massive W, you can’t be upset about that", "score": 39, "replies": [{"body": "IDK if I would call $150 profit massive", "score": 2, "replies": [{"body": "Not (49-35) * 11\n\nBut (49-11) * 35", "score": 15, "replies": []}, {"body": "That’s a 1200 profit my fellow math wizard. A 3x. Not life changing, but what do you expect from a $400 investment? A win’s a win.", "score": 12, "replies": [{"body": "I was 13 years old in 2017 so that money was huge for me at the time. Also, the shares were bought under my dad's name.", "score": 1, "replies": []}]}, {"body": "The math, oh no!", "score": 1, "replies": []}]}]}]}, {"body": "Was 2500 shares, it taught me to diamond hands though", "score": 31, "replies": [{"body": "Fuck that hurt just reading that.", "score": 15, "replies": []}, {"body": "Wowza, lesson learned. Hopefully you re-entered and caught some of the wave.", "score": 3, "replies": []}]}, {"body": "I begged my mom to let me spend my $1000 in saving to buy AMD when it was $14.\n\nShe did the smart thing and not listen to me, but I would also be much richer rn if she had.", "score": 8, "replies": []}, {"body": "I did this too", "score": 0, "replies": []}]}, {"body": "Same. I bought like 6000 shares of AMD at 2.55 and when it went $2.25 i cut my losses (circa 2002?)", "score": 11, "replies": [{"body": "Even more in than I was", "score": 1, "replies": [{"body": "Had 10000 in at 3 out at 10 lol never again", "score": 1, "replies": []}, {"body": "i was a true AMD fanboy. i used to work nearby AMD but I would take my lunch and eat it in the parking lot of AMD because it was actually extremely pleasant and had lots of green hills of grass and sunny sky, and hardly any people. i remember everyone was raving about pentium 4 or so, and AMD's shining star was Celeron. AMD was making low power requirement, highly efficient CPUs, whats not to love?", "score": 0, "replies": [{"body": "Celeron is Intel, just FYI", "score": 7, "replies": []}]}]}, {"body": "call me crazy but statements like these, opportunity loss, feels a lot worse than actual realized loss.\n\nactual loss... held to expiration, whatever, stuck thru the play to the end, lost like a man. selling too early but moons later? paper handed bitch.", "score": 1, "replies": []}]}, {"body": "Hey, I did the same thing! Lmao.", "score": 3, "replies": []}]}, {"body": "Bought $100 of bitcoin at $0.17, used it to pay for a Usenet subscription", "score": 51, "replies": [{"body": "you are almost comparable to the guy buying pizza.  Thats gonna haunt you for the rest of your life.", "score": 16, "replies": [{"body": "It helps a little bit that I bought back in at $450 then sold at $800. That’s a profit!", "score": 16, "replies": []}]}, {"body": "Me too. Wasted 5k worth of btc purchasing weed on the dark markets over 2012-2015", "score": 6, "replies": []}]}, {"body": "True regards buy at 25 sell at 24. This man doing better than half the sub.", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/xjwgr1k77e5d1.jpeg?width=800&format=pjpg&auto=webp&s=f44787d905d792a6772bdf69a572cb674485de9e", "score": 77, "replies": []}, {"body": "Bought at 450, sold at 350", "score": 122, "replies": [{"body": "You belong here haha", "score": 52, "replies": []}, {"body": "We are mirror images. I bought at 350 and sold at 450.", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4260)", "score": 1, "replies": []}, {"body": " When it is above 400 it never went back to 350", "score": 1, "replies": [{"body": "I’m just that good.", "score": 1, "replies": []}]}]}, {"body": "I played NVDA for years because it regularly bounced between resistance bands. Buy leap, wait two weeks, sell leap. Make 10%, occasionally lose 20%.\n\nThen got bored with it and moved onto other stocks.  Then crypto mining takes off and the stock jumps. I kept thinking I'll buy the dip. But it never really dipped enough for me to jump in.", "score": 23, "replies": []}, {"body": "Had AMD at $4, sold it at $7 🤡", "score": 20, "replies": [{"body": "I had AMD at 10. Sold at 14$ like a bitch.", "score": 5, "replies": [{"body": "Sold my AMD shares and gave the proceeds to Wendy’s and left them a note “More regards coming to clean dumpster!”", "score": 1, "replies": []}]}, {"body": "My friend said that AMD is going bankrupt so I bought it at $11. Sold it at $22 just to show him.", "score": 3, "replies": []}, {"body": "I had it back then, too, when Rory Reed was the CEO.  I remembered that their Freedom Fabric was supposed to revolutionize the world with it's cost savings on energy usage.  Also sold a small gain which I used for a down payment for my house.", "score": 2, "replies": []}, {"body": "Heh, I did 140-210 with AMD... I was hoping it went back to 140 again (actually had the buy order) and I missed the bounce by just a little.", "score": 1, "replies": []}, {"body": "I dumped 2k shares of AMD at about $4 to put in a granite countertop on a house I sold for half of what it’s worth today….\n\nAnd I had plenty of money to keep the stock and the house", "score": 1, "replies": []}]}, {"body": "Bought at 206, sold at 550 to buy a truck. Don’t regret selling green!", "score": 16, "replies": []}, {"body": "Bought at $290 and sold at $140. Then bought again at $600", "score": 12, "replies": []}, {"body": "Bought at 190,sold at 450 :)", "score": 33, "replies": [{"body": "Get out! I’ll need blue chew soon if I see any more posts about gains!", "score": 8, "replies": []}, {"body": "bought at 190, still have it", "score": 6, "replies": [{"body": "bought at 170s ,sold at 180s ,I thought it was overpriced 😆", "score": 9, "replies": [{"body": "Bought at 121 sold half when it doubled, let the rest ride into the sunset.", "score": 3, "replies": []}]}]}]}, {"body": "Bought AMD at $1.63 sold at $1.92 about 10 years ago.", "score": 14, "replies": [{"body": "was that when bulldozer came out?", "score": 2, "replies": [{"body": "Yeah somewhere around then, before Zen was released.  Then it shot to $10, then $20...\n\nLooking now, maybe it was more like 2016, not quite 10 years ago.\n\nAlso: typing this on on a 7900X. =\\", "score": 5, "replies": []}]}, {"body": "I was here when AMD was the hot topic for going from $4 to $6 a share. Should have bought and hold, but somehow thought: \"nah, its done\" ![img](emote|t5_2th52|27421)", "score": 1, "replies": []}]}, {"body": "Bought at 15, sold at 55", "score": 4, "replies": []}, {"body": "I’m sending a Reddit cares message", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|31224)", "score": 3, "replies": []}, {"body": "Warren Buggett, is that you?", "score": 2, "replies": []}, {"body": "[https://www.reddit.com/r/Bossfight/comments/o8ay68/cash\\_money\\_brother\\_of\\_blake/](https://www.reddit.com/r/Bossfight/comments/o8ay68/cash_money_brother_of_blake/)", "score": 1, "replies": []}, {"body": "OG!", "score": 1, "replies": []}, {"body": "Smart moves", "score": 1, "replies": []}, {"body": "At least you won't be holding a bag", "score": 1, "replies": []}, {"body": "best return i've seen on this sub and surely better than all the other regards commenting", "score": 1, "replies": []}, {"body": "Bought at 12.50, sold at 14.75", "score": 1, "replies": []}, {"body": "bought at 120 2 years ago, only 1 share though  😄", "score": 1, "replies": []}, {"body": "I bought at 350 and sold at 450!", "score": 1, "replies": []}, {"body": "bought AMD at 11, sold it at 22  \ni think about that a lot", "score": 1, "replies": []}, {"body": "Bought at $40, sold at $155. Thought, almost 4x my money in 1.5 years, great. Now it’s literally my biggest financial failure. All of my losses together are less than I lost by not holding Nvidia.", "score": 1, "replies": []}, {"body": "Still outperforming 99% of this sub then", "score": 1, "replies": []}, {"body": "I bought about two grand worth of Nvidia when I was in ninth grade at like $12 a share and sold it for 14", "score": 1, "replies": []}, {"body": "there is no loss. how you deduct now from your taxes??", "score": 1, "replies": []}, {"body": "You made a profit. Good for you.", "score": 1, "replies": []}, {"body": "I sold at about $160 for some sweet break even action. Literally as the engine started and the pedal hit the metal. Fomo’ed in back just under a grand and I’m never looking back.", "score": 1, "replies": []}, {"body": "Take profits.", "score": 0, "replies": []}, {"body": "My grandpa bought apple in the 80s and sold in the early 2000s for a massive 400% gain.", "score": 0, "replies": []}]}, {"body": "You mean these losers didn’t check their crystal ball to see which stocks will 8x in only a year?", "score": 550, "replies": [{"body": "funny part was the crystal ball was chat gpt bro\n\n>chat GPT told me to buy NVDA @ 275 last year", "score": 100, "replies": [{"body": "isn’t that insider trading?", "score": 69, "replies": []}]}, {"body": "If only, someone... just thought to make a giant ass calculator that can simulate reality and predict the future.... like a digital twin or something, to practice singals and systems and control theory... if only there were some magic device that was really really good at doing calculus in parallel on a giant matrix of numbers for the polynomials that can easily be transformed and geometrically manipulated.", "score": 43, "replies": [{"body": "Ohh look, we spotted an smart ass here.\n\nSir,\n GTFOH\nthis is a casino!", "score": 14, "replies": [{"body": "So counting is a problem, even if it’s cards? ", "score": 0, "replies": [{"body": "Being smart is a problem here ![img](emote|t5_2th52|31225) We can't understand basic stuff ![img](emote|t5_2th52|31226)", "score": 5, "replies": []}]}, {"body": "So counting is a problem, even if it’s cards? ", "score": -2, "replies": [{"body": "counting cards isn't illegal, but casino will ban you. ![img](emote|t5_2th52|18630)", "score": 2, "replies": []}]}]}, {"body": "*Straightens out leather jacket*, the next industrial revolution is here!", "score": 6, "replies": []}, {"body": "Huh", "score": 6, "replies": [{"body": "Don't worry, its all irrelevant... hey look.... CEO signing titties.\n\nDouble float, nah... double d hells yea", "score": 26, "replies": [{"body": "Damn, I wanna sign some titties 😟", "score": 3, "replies": []}]}, {"body": "his word salad was a metaphor for chat GPT", "score": 4, "replies": [{"body": "His word salad was a metaphor for graphics processors.", "score": 3, "replies": []}]}]}, {"body": "ass calculator?", "score": 1, "replies": []}]}, {"body": "I saw that a politician bought NVIDIA, so I did too.", "score": 1, "replies": []}]}, {"body": "Holding since 2017 lol. What is an exit strategy? I am +2000%.", "score": 285, "replies": [{"body": "Holding since 2016.", "score": 62, "replies": [{"body": "2015 checking in. Bought on a whim of a random reddit comment and never figured out the selling thing", "score": 60, "replies": []}]}, {"body": "Damn, and I thought my +900% was a lot.  Kudos to you.", "score": 25, "replies": []}, {"body": "Don’t cash out that 1 share!", "score": 10, "replies": []}, {"body": "Up 3000%. Also not sure what this selling thing is.", "score": 11, "replies": []}, {"body": "Same. Last Thursday I could have sold 3 shares and recouped my entire initial investment.", "score": 4, "replies": []}, {"body": "To stay till something better show up", "score": 8, "replies": []}, {"body": "I bought at 2018, 1500%", "score": 2, "replies": []}, {"body": "I am also up +2000% but that’s because I bout it in account that is basically set and forget. It it was in my active trading account I would have sold long ago. No idea when to get out.", "score": 2, "replies": []}, {"body": "Save it as an inheritance to your kids.  Once it's transferred to them, their cost basis is the price at transfer so they don't have to pay all the capital gains.", "score": 5, "replies": [{"body": "That’s not how tax works", "score": 2, "replies": [{"body": "What do you mean?", "score": 1, "replies": []}, {"body": "I'm very curious about why you don't think it works that way.  Care to elaborate?", "score": 1, "replies": [{"body": "If you pass away and your kids inherit your account, they will get taxed immediately, and forced to liquidate enough assets to cover the bill. That’s why there are inheritance taxes. It’s very difficult to escape them legally.", "score": 1, "replies": [{"body": "Are you talking about inheritance tax? because I'm really not sure what you are referring to\n\nInheritance tax only exists in 6 states.  It only applies to 2 states for kids.  And no states have inheritance tax for spouses.\n\nObviously these are state taxes and there is no federal inheritance tax.\n\nThat's how tax works . . .", "score": 1, "replies": []}]}]}]}]}, {"body": "Same. I would be holding from way before if I had gotten off my ass and made a brokerage account etc. My friend kept telling me to put money into nvda because his thesis was self driving cars will become a everyday thing and every car will be using nvda chips. And me being a gamer since the 80s and always being on team green was on board. He was totally wrong about the application that would send nvda (this was even before crypto was mainstream) but he was right about the stock.", "score": 3, "replies": []}, {"body": "Sell and retire", "score": 1, "replies": [{"body": "I am gonna be so rich from this one stock yeey", "score": 1, "replies": []}]}, {"body": "2016, up 13,000%", "score": 1, "replies": []}]}, {"body": "I remember telling my neighbors to buy NVIDIA in 2015 and they were like ya bud okay.\n\n  \nWhos laughing now!", "score": 150, "replies": [{"body": "Were you laughing when you told them? Maybe they are watching a funny tv show and laughing right now, we can never know who’s laughing now.", "score": 55, "replies": []}, {"body": "But did you buy? And hold?", "score": 9, "replies": [{"body": "yessir\n\nI made a nice 10 bagger.  If I had balls i'd have bet more on it.", "score": 18, "replies": []}]}, {"body": "are you my neighbor???!!!", "score": 0, "replies": []}]}, {"body": "Yeah, I owned it.\n\nI sold it too. Before ChatGPT. Feels bad. I had over 100 shares at one point, around like $80 a share. I feel like an idiot for selling at a 5% gain..", "score": 161, "replies": [{"body": "Hindsight is 20/20.  It will consume you from the inside if you dwell on it.\n\nEveryone who is trading does this eventually.  Should have sold, should have bought, should have bought more, should have held, etc.  \n\nBut that is judging your decisions after the facts are revealed.  That's unfair to yourself.  Because we must make choices with what we know at a given time.\n\nThe better thing to do is take that experience and let it steer you to spotting the trends more clearly and looking for the next position.", "score": 157, "replies": [{"body": "Damn, dropping sophisticated af logic and reasoning. You sure you on the right sub?", "score": 56, "replies": []}, {"body": "My man, you don’t belong here.", "score": 10, "replies": []}, {"body": "Did ChatGPT write this?", "score": 13, "replies": [{"body": "haha no...  I've never used ChatGPT either.", "score": 8, "replies": []}, {"body": "No but a regard did", "score": 0, "replies": []}]}, {"body": "I'm a therapist and I couldn't have said it better myself. In fact, I can't, so I'm going to steal what you wrote here and use it with clients and never give you credit. Thanks!", "score": 2, "replies": []}]}, {"body": "Investing is all about Time Value Of Money. Before I sell anything, I think to myself “what will I do with that money TODAY that would get me better gains?” If I can’t think of anything, I just HODL. Sometimes I will take money out and keep track of my “old” stock and buy back in (especially if it’s lower.) I’ve done that often with NVDA. \nSometimes you are wrong, but you can only go with what information you currently have. Otherwise, stick your money in a 5% money market and you are guaranteed returns.\nCorporations and banks are always putting their money into something. That’s what corporate paper and overnight lending is all about. (That’s what Apple does with all their cash). They lend money overnight to other companies or banks to meet regulatory requirements … Time Value of Money.", "score": 12, "replies": []}, {"body": "Imagine how you would feel selling at a 70% loss.", "score": 5, "replies": []}, {"body": "I remember reading about crypto here back in 2007ish. Was going to buy 20 bitcoin @ $1. I was broke. Talked myself out of it.", "score": 3, "replies": [{"body": "Bitcoin didn’t exist in 2007. The white paper was published in 2009. It got traction in 2011-2013.", "score": 2, "replies": [{"body": "Then it was probably around 2012/2013ish.", "score": 1, "replies": []}, {"body": "r/ali", "score": 1, "replies": []}]}]}, {"body": "Well if it feels that bad you can always buy some shares for around $110 come Monday.  I for one will never be able to time things properly so I'll just fall back to knowing it's way overvalued while also not particularly liking the company's ethics and continue to invest elsewhere.", "score": 1, "replies": []}, {"body": "I sold at 5% gain too, in December. Still painful lol", "score": 0, "replies": []}]}, {"body": "https://preview.redd.it/fjjyt2ytme5d1.png?width=1440&format=pjpg&auto=webp&s=fa44a1e6abfb71f1fc4c083a0b55803f7db15ca1", "score": 36, "replies": []}, {"body": "I have never been touched by a woman", "score": 37, "replies": []}, {"body": "People told me I’m an idiot buying the top when I bought at $500. Who’s the idiot now!?", "score": 47, "replies": [{"body": "Probably still you if you’re here", "score": 47, "replies": []}, {"body": "Regarded clocks are right twice a day.", "score": 12, "replies": []}]}, {"body": "https://preview.redd.it/41qo7294yd5d1.jpeg?width=1273&format=pjpg&auto=webp&s=a0fc1ebecbc5a420fb74ba4d742f16b916bcecbb", "score": 54, "replies": [{"body": "Its two 14 year olds", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 1, "replies": []}]}, {"body": "r/nbacirclejerk leaking again.", "score": 4, "replies": [{"body": "I prefer them to wallstreetbets these days. Reddit is a continuously evolving pile of shit.", "score": 1, "replies": []}]}]}, {"body": "I did :)\n\nBut only a small amount :(", "score": 12, "replies": [{"body": "Same, you’re not alone. Wish I had bought more but I’m glad I got any at all", "score": 3, "replies": [{"body": "Comment order in this thread too good not to post:\n\nhttps://preview.redd.it/pwsnfmiikh5d1.jpeg?width=636&format=pjpg&auto=webp&s=21ee88b523ae4701bfaeb25e5fd75b83567f5a04", "score": 5, "replies": [{"body": "My wording throws it off a bit but I guess it passes lol", "score": 1, "replies": []}]}]}]}, {"body": "I bought at 350 sold at 420  💀", "score": 12, "replies": []}, {"body": "But did he buy before the crypto mining boom?", "score": 18, "replies": [{"body": "Yeah, bought it before trump was president.", "score": 0, "replies": []}]}, {"body": "I had AMD before GPT... still waiting for Lisa to start signing balls", "score": 9, "replies": []}, {"body": "NVDA was hovering around $150 for almost a year when their gaming business and crypto mining slowed down, anyone could have gotten in if they wanted", "score": 36, "replies": [{"body": "There're stocks that will blow up but anyone could get in right now. Unfortunately I don't know what they are so I won't be buying them", "score": 45, "replies": [{"body": "Neither do I, but my money is on CRISPR companies as well as mRNA companies.", "score": 8, "replies": [{"body": "What CRISPR companies do you like? I need to spread my bets around a bit more. All my moonshot money is in immunotherapy right now.", "score": 2, "replies": [{"body": "I got Crispr Therapeutics, Intellia and Editas. Not because I \"like\" them all, but because I'm not sure what horse to bet on, so I bet a little bit on each.\n\nWhich ones do you have?", "score": 4, "replies": [{"body": "Iovance and Immunitybio. Both have FDA approval for similar types of drugs that boost the natural killer cells in the immune system. I got both to hedge. Iovance has a more diverse pipeline so I'm long there. Immunity might grow quicker short term, next earnings will be the first time they've made a profit.", "score": 2, "replies": []}]}]}, {"body": "Yup. I don't know what's the next new over hyped thing will be in the future, but I also think it's CRISPR or Space.\n\nThat's why I own 500 shares of RKLB and 200 shares of NTLA.", "score": 1, "replies": []}]}]}, {"body": "Can you let me know what stock is currently hovering a low price and is about to explode 1000%?", "score": 15, "replies": [{"body": "You may not want to hear this but rddt could easily squeeze in 10x more ads and sell 10x more data and people would still use the site.", "score": 2, "replies": []}, {"body": "Tesla is pretty much in the same situation right now as Nvidia was back then. Core business slowing, stock almost down half from its peak, looking for the next big thing.", "score": 4, "replies": [{"body": "Well, Musk might resign on june 13th..", "score": 6, "replies": []}, {"body": "Tbh great point. That’s a stock I could see pivoting and exploding in the next 1-2 years… but for many reasons it’s too risky for me personally", "score": 2, "replies": [{"body": "I'm having trouble understanding how Tesla could explode in the next 1-2 years. Mind sharing your thoughts? \n\nI actually like Teslas, but what I see happening in the market currently: \n\n* EV sales are down across the board due to plateauing or tax incentive drying up or whatever \n* Aside from the supercharger initiative, there's not really been a huge push to increase EV charging infrastructure - at least where I live I feel like the infrastructure has stagnated\n* Hybrid and other types of intermediary vehicles with an ICE have seen a resurgence, and ICE technology and fuel efficiency continues getting better every year\n* Tesla is embroiled in self-driving and autopilot controversy. Weren't we supposed to have fully autonomous, end-to-end self-driving cars already?\n* Tesla body styling is polarizing and hasn't been updated in years/ever? \n* Elon is a polarizing figure and is no longer the tech guru / media darling that he used to be. I don't see him clawing his way back into the public's good graces.\n* Tesla build quality is an absolute crapshoot\n* Cybertruck \n\nSpeculative, but I guess I could see if they deliver on completely automated self-driving, that could bring in additional customers and completely upend the ride share business, but that requires regulatory changes and political maneuvering that would be >1-2 years in the making. I guess my imagination is failing me on ways in which Tesla could explode in 1-2 years that doesn't involve it evolving into something completely different than just a car company.", "score": 3, "replies": [{"body": "Tesla is still by far the leader in autonomous driving development, that’s why they’re not evaluated as just a car company. Selling cars was never the end goal, they wanted all the driving data that could lead them to make autonomous driving networks a reality. The developments in AI chips will likely speed up their progress (once they actually get them) so the speculation may very well heat up again.\n\nThis goes for Elon’s robot projects as well.", "score": 2, "replies": [{"body": "You will find other manufacturers that are rather ahead on autonomous driving. Musk doubling down on their use of exclusively optical sensors rather hamstrung them. The big manufacturers like GM and such have caught up with level 2 and it seems like Mercedes is getting to level 3. A shame but TSLA rather blew their lead.", "score": 3, "replies": []}, {"body": "Tesla getting rid of LiDAR may make them incapable achieving true fsd while the competition won’t repeat that mistake. \n\nIf that’s the horse the entire company is hanging on, then it’s not a very good bet. ", "score": 2, "replies": [{"body": "Not a good bet to you maybe. A company with hope of a massive breakthrough will always be valued higher than a stable company with low chance of huge growth. Elon is where he is because he knows how to sell hope to the investors (and occasionally make it actually happen).", "score": 1, "replies": [{"body": "Agreed regarding Elon being an expert at selling hope. No one has a more loyal following than he does. That’s why I don’t think the stock will ever really crash to its “true value” I.e. below $100. There’s too many ride or die Elon fans who will never sell, unless he leaves. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I bought RIVN too soon, but picked up more on its way down to ~$8.  Back over $11-ish.  R2 out in 2026, and R3 platform already being developed.  They are innovating faster than TSLA in terms of vehicles, but RIVN doesn’t have the AI, solar battery back up, or robot plays.  Split money between both.  I have over $250k in them in my IRA.\n\n1000% gains in 10 years. \n\n*Mic dropped.", "score": 1, "replies": [{"body": "Just checked myself, I would have over $250k if I didn’t lose over $50k in RIVN.\n\nThis is the way.", "score": 1, "replies": []}]}]}, {"body": "ask chatGPT", "score": 1, "replies": []}, {"body": "I will tell you if you promise to buy huge number of the company’ shares right after I tell and not sell until I say you can. You must have at least 80 million to invest, otherwise the offer doesn’t stand. Also, note that 10x in short time is a very, very real possibility but all usual disclaimers apply.", "score": -1, "replies": []}]}, {"body": "I told so many people to jump in around the time the GPU shortage happened end of 2020/start of 2021, thought once supply caught up with demand Nvidia would leave AMD in the dust when it came to the GPU market. Wasn’t expecting them to take off like this though.", "score": 5, "replies": []}, {"body": "I got in when it was in the 40s.", "score": 2, "replies": []}]}, {"body": "Those girls are like 14", "score": 7, "replies": [{"body": "Agree. I think I'd prefer shares that attract 19-year-olds.", "score": 7, "replies": []}, {"body": "they are 25 going on 14", "score": 4, "replies": []}]}, {"body": "My biggest regret of my trading career is this stock \n\nI’ve been a gamer all my life \n\nAt one time a GameStop store manager \n\nI love Nvidia as a company \n\nLove its products \n\nJust always felt like it couldn’t keep going higher and it always did, I look for the value stocks with room to run back after a loss so my risk is minimal \n\nNvidia never really pulled back lol \n\nEven a month ago at 800 thought I missed the train. \n\nWorst mistake ever \n\nThis kind of stock made a life changing difference for so many and I missed the boat \n\nCongrats to all you new millionaires on this one stock", "score": 13, "replies": [{"body": "Paper millionaires if they haven’t sold for profit", "score": 4, "replies": []}]}, {"body": "That ![img](emote|t5_2th52|4276) feeling", "score": 17, "replies": []}, {"body": "Wrong meme template regard, should be he sold NVDA before ChatGPT. \n\nAnyways, I am poor.", "score": 16, "replies": []}, {"body": "I bought 12 shares at 130 and still have them. I'm up like 830% and now with the split have 120 shares. It isn't a life changing amount of gains but I like seeing big green number", "score": 4, "replies": []}, {"body": "It's me.\nWait, we can invest in ChatGPT/OpenAI? What's the market I didn't find anything??", "score": 3, "replies": [{"body": "You can invest into Microsoft, the largest investor into OpenAI", "score": 7, "replies": [{"body": "Yeah I've invested already so it's good.", "score": 1, "replies": []}]}]}, {"body": "Bought at 250 and watched it goto 120 but never sold.", "score": 5, "replies": []}, {"body": "Bought at $1 still holding.....yawn....dammit is was only a dream 😢", "score": 5, "replies": []}, {"body": "I was trying to pick between Nvidia or vuzik for AR before chatpgt was a thing. Nvidia was 40 and vuvik was 6. I picked vuzik is currently 1.50.", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "🤣", "score": 1, "replies": []}]}]}, {"body": "chat GPT told me to buy NVDA @ 275 last year", "score": 3, "replies": []}, {"body": "Bought first at 180 sold at 165", "score": 3, "replies": []}, {"body": "What if I owned TSM before chatgpt can I get sloppy seconds?", "score": 3, "replies": []}, {"body": "I thought that said he owned Nevada", "score": 3, "replies": []}, {"body": "“He owned NVDA\n\nBefore the stock split in 2021.”", "score": 5, "replies": []}, {"body": "Yeah man cool post. Just post the video link or let us know who’s in the meme template.", "score": 14, "replies": [{"body": "That’s JoJo and Emma Roberts from the 2006 family film Aquamarine where they were 15 and 14 respectively.", "score": 40, "replies": [{"body": "![img](emote|t5_2th52|4640)", "score": 12, "replies": []}, {"body": "Luckily I just turned 10", "score": 11, "replies": []}, {"body": "I was about to sh bc they look hella young", "score": 5, "replies": []}]}, {"body": "FBI open up", "score": 8, "replies": []}]}, {"body": "I used money that I WANTED to spend on an RTX 3080 on shares of NVDA during the pandemmy. I held and used a credit card when one became available a year later. Best decision ever.", "score": 2, "replies": []}, {"body": "Bought at 140 pre split and sold at 280. Back during the Lisa Su & early ryzen days..", "score": 2, "replies": []}, {"body": "I bought one share at $230 and sold for $275 after earnings thinking I sold near the top", "score": 2, "replies": []}, {"body": "Owned 2500 shares since 2012 when AMD hired lisa siu. Ready for sex with all the fathers.", "score": 2, "replies": []}, {"body": "Bought at 6.89 still holding aka forgot I had a motif", "score": 2, "replies": []}, {"body": "Bought at 228, still hold it", "score": 2, "replies": []}, {"body": "Wish I bought more during the 2021 sell off", "score": 2, "replies": []}, {"body": "Bought and own 390 shares since my initial purchase of $220.00 per share.\nSeemed expensive and risky at the time.", "score": 2, "replies": []}, {"body": "Bought at 457 avg and still holding ;)", "score": 2, "replies": []}, {"body": "How do people do this shit? I have no clue where to start in investing and no one online does anything but brush me off", "score": 2, "replies": []}, {"body": "i bought in 2018 and forgot about it", "score": 2, "replies": []}, {"body": "i got shitfaced and bought 2k shares years ago.\n\ntotally forgot i did it till it blew up", "score": 2, "replies": []}, {"body": "Bought 120 at 24 (adjusted).\n\nSold 20 at 1200 on wednesday. still holding the rest.", "score": 2, "replies": []}, {"body": "If only I had more from then. I think 160 was my best buy", "score": 2, "replies": []}, {"body": "I've owned my shares since like 2018, $37 average price! I haven't gotten any over the pants handys though. How do I telegraph my position in a socially acceptable way to get some ace?", "score": 2, "replies": []}, {"body": "https://preview.redd.it/xaxyodbzwf5d1.jpeg?width=1290&format=pjpg&auto=webp&s=700c2e9327c7e345d3502769a277d64015946cfe\n\nDoes this count? It would have been at least 2200% profit if I didnt sell it.", "score": 2, "replies": []}, {"body": "Bought 20 shares at $44. Feeling like a genius", "score": 2, "replies": []}, {"body": "I bought at 85 and held if that counts", "score": 2, "replies": []}, {"body": "Way back in college I had to sell my shares of Google to move to a new apartment.\n\nThe clickbait headlines of 'If you bought 1k Google in 2003 here is how much you would have now...' those suck to read.\n\nI feel your pain.", "score": 2, "replies": []}, {"body": "Yeah.... I've owned long enough my only regret is having a diverse portfolio.  I put the same amount into each stock, they're all doing well but Nvidia is at like 640% gain", "score": 2, "replies": []}, {"body": "Even at 1208.9, now 120.89, NVDA's P/E ratio has still not caught up with its actual earnings", "score": 2, "replies": []}, {"body": "I bought at $270 and still holding", "score": 2, "replies": []}, {"body": "It's ok guys i was down 60% on nvda in 2021 and sold cuz \"it was overvalued\" at the time. The cake is a lie.", "score": 2, "replies": []}, {"body": "While I did buy before ChatGPT, it would be [cool if this was real](https://imgur.com/a/96-problems-wym6Bj3).  Only caught it in the middle of the split today.", "score": 2, "replies": []}, {"body": "Bought at 125 sold around 360.", "score": 2, "replies": []}, {"body": "I have that one Nvidia card sitting on my 7 yo laptop.  \nDoes that count?", "score": 2, "replies": []}, {"body": "Bought at 95 in 2018, sold at 115 🤣", "score": 2, "replies": []}, {"body": "This guy (me) owned it and sold at $420.69 and did a victory lap thinking he timed the top “surely it can’t go any higher“ 🤡", "score": 2, "replies": []}, {"body": "I had a handful of shares of AMD from early 2000 that I sold in 2020.  Put a few thousand into Nvidia and cashed out after it moved up about 10%.", "score": 2, "replies": []}, {"body": "I bought at 190 and it dropped to 110. I shit my pants and sold at 183 to just get rid of the fucking thing. Then it shot up to the moon. \n\nSo sad", "score": 2, "replies": []}, {"body": "Long before ChatGPT, WSB, or even reddit, a friend of my dad took his entire retirement account and put it in NVDA. A lot of people thought he was crazy - now he has a mansion in Hawaii and spends half the year traveling around the world golfing (and he still kept the majority of it!).", "score": 6, "replies": [{"body": "And that man’s name…. Was Albert Einstein", "score": 6, "replies": []}, {"body": "that's not intelligent, but very glad it worked out for the guy", "score": 3, "replies": []}]}, {"body": "Invested in 2021. So yes.", "score": 2, "replies": []}, {"body": "What if I owned shares at 130 avg and sold at 400 😩", "score": 2, "replies": []}, {"body": "I did own NVDA before ChatGPT and not even my gf looks at me like that.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I know someone, who started to work for Nvidia in 2016. He is still employed.", "score": 2, "replies": []}]}, {"body": "Wish I had bought more back then but yeah", "score": 1, "replies": []}, {"body": "bought at 820 sold at 790", "score": 1, "replies": []}, {"body": "For the record I’m an OG but never had this happen. I guess that says how old, fat and disgusting looking I am.", "score": 1, "replies": []}, {"body": "OG owner here, sold half @ 750 fml", "score": 1, "replies": []}, {"body": "Bought at 650 and sold at 890 lol", "score": 1, "replies": []}, {"body": "I feel seen", "score": 1, "replies": []}, {"body": "+800% 😎", "score": 1, "replies": [{"body": "Fatality.", "score": 1, "replies": []}]}, {"body": "I bought an etf for my retirement 3 years ago that is heavily invested in nvda damn I didn’t even know that till maybe a year ago", "score": 1, "replies": []}, {"body": "What if I told you… i own both.   And got in way early bc this shit was obvious to anyone paying attention.      Schwing?\n\nhttps://preview.redd.it/thcit2be1g5d1.jpeg?width=2088&format=pjpg&auto=webp&s=70e9b17c5351f22d57280c6ecf3708b445610ae5", "score": 1, "replies": []}, {"body": "Keep your stocks. I’ll take these two chicks!!!!", "score": 1, "replies": []}, {"body": "I bought at $1,020, now it's at $1,200 but I did own it when it was at 450", "score": 1, "replies": []}, {"body": "Erm... so did I.  VTSAX", "score": 1, "replies": []}, {"body": "I hope their d\\*\\*k didn't explode like their portfolio......![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "OG is like 2020 now?", "score": 1, "replies": []}, {"body": "I got $1000 worth when it was $14 in highschool and sold it when it was like $30. My first stock purchase. I don’t even want to do the calculation to see how much it would be worth today to stop me from offing myself", "score": 1, "replies": []}, {"body": "Bought month chatgpt released expecting to go moon after seein not much of movement I sold it thinking maybe people fearing conflict againts china and taiwan so I bought intel instead brooo![img](emote|t5_2th52|31225) market is too stupid for me they always realise potentials too late", "score": 1, "replies": []}, {"body": "Been holding 300 shares since it was $11.50, and they first started really talking about autonomous driving and AI.  Talked my dad to pick up a few hundred in the low 20s. He gets me a nice bottle of scotch every time he's in town.\n\nGlad they are doing the stock split, as that will help me trade it more actively.", "score": 1, "replies": []}, {"body": "Yesterday my account showed the split but prices didn't change, so it looked like a massive profit. Now it's showing both the split and new pricing, but it's acting like that's a loss compared to the error before.\n\nTotal account value is where it should be now, but the weirdness almost gave me a heart attack yesterday because it implied my account doubled for no reason. If only", "score": 1, "replies": [{"body": "Mine split correctly with a revaluation so no overall value change from COB. German depository laws (where I live) are quite strict on this and brokers must reflect this.", "score": 1, "replies": []}]}, {"body": "ugh I only had 2.5 shares 🥴 still up $1,997 tho 🤑", "score": 1, "replies": []}, {"body": "Wait what happened with chat gpt and nvda?", "score": 1, "replies": []}, {"body": "Better sell now because their stock is going to be barely over $100 come Monday.", "score": 1, "replies": []}, {"body": "Sold my 3 shares to buy a car so i could work \n😭👍", "score": 1, "replies": []}, {"body": "I bought NVDA just because I use their Graphics card. 50 shares at around 250-300. Cashed 20 at around 500. I shoulda bought more.", "score": 1, "replies": []}, {"body": "29.9 avg checking in. Will be 2.9 on Monday.", "score": 1, "replies": []}, {"body": "I owned NVDA in 1999 and sold it in 2000. Sadface.jpg", "score": 1, "replies": []}, {"body": "People were trying to tell me to sell when the market cap hit 1 trillion and now we are above 2", "score": 1, "replies": []}, {"body": "Emma Roberts is so hot 😍", "score": 1, "replies": []}, {"body": "Bought at 185 sold at 890. Bought a house bc of it", "score": 1, "replies": []}, {"body": "Still holding since January 23, 2015 🤑", "score": 1, "replies": []}, {"body": "all amateurs. Bought 30k of NVDA in 2002 - split adjust around $2 - forced to liquidate in 2008 divorce because didn't have cash to pay my wife half of its value at that time.\n\nIf I had not gotten divorced, I would be writing this post from my yacht instead of my mom's basement.", "score": 1, "replies": []}, {"body": "\\*DISCLAIMER: Photo shown on this post may vary on real life. Expect nothing to not being disappointed. We aim to keep doing business with you", "score": 1, "replies": []}, {"body": "For some reason this photo seems explicit as fuk", "score": 1, "replies": []}, {"body": "I got heavy into Nvidia during Covid all because of Two Minute papers. And now I'm holding on to my papers!", "score": 1, "replies": [{"body": "What a time to be alive!", "score": 1, "replies": []}]}, {"body": "Bought at 37. Bought more at 46. Bought yet more at 185.", "score": 1, "replies": []}, {"body": "Bought SIRI at 9 cents, sold for 20 cents 🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃", "score": 1, "replies": []}, {"body": "I owned AMD at 1.83 a share \n\nI sold AMD at 2.10 a share \n\nI think about this often…", "score": 1, "replies": []}, {"body": "I bought 100 dollars worth of Nvidia a year and a half ago. Sold it because I ate McDonald’s for a month. Now I own 100 dollars worth of Nvidia stock and also depressed", "score": 1, "replies": []}, {"body": "I thought their video cards were dope and dunking in AMD poors was too fun\n\nWho knew?\n\nhttps://preview.redd.it/3sqgjahxpq5d1.jpeg?width=1224&format=pjpg&auto=webp&s=528b0cefac519cfdcb22cc3ec998c0d8076a8e9b", "score": 1, "replies": []}, {"body": "Yeah and then sold it for a 100% gain.\n\nAnd then years later the same again.\n\nSo, that was a nice house I missed out on lol", "score": 1, "replies": []}, {"body": "Guys, my friend is a researcher and he asked me to ask you guys who those two girls are/the source of the meme.\n\nIts important.", "score": 1, "replies": [{"body": "https://knowyourmeme.com/memes/jojo-whispering-to-surprised-emma-roberts", "score": 2, "replies": []}]}, {"body": "F*ck nvidia! Sincerely Linus", "score": 1, "replies": []}, {"body": "My coworker bought $100k in 2017. It's worth something like 4 mill now. He's the kind of guy that can never lose. Happy for him I guess. ", "score": 1, "replies": []}, {"body": "229 cost basis checking in", "score": 1, "replies": []}, {"body": "and what about those that own NVidia before pandemic gaming boom and crypto currency mining?", "score": 1, "replies": []}, {"body": "Had 65 @ $54 and sold when it was flat.  Had 250 @ $150 and sold. Sadly I remind myself of this daily.", "score": 1, "replies": []}, {"body": "bought at 225 pre-split, bought more at 300, 400 and 880.. still holding.. 180,000$ total", "score": 1, "replies": []}, {"body": "🍆🍆🍆", "score": 1, "replies": []}, {"body": "If yall had AMD and sold it early for a small profit really the only reasonable thing left to do is donate those gains to me. Every single dollar is one entry into 2-10k raffles. Once I accumulate enough to pay my mortgage off I choose winners. Get in before it’s too late!", "score": 1, "replies": []}, {"body": "Ahahahhahahahhahahhhhh", "score": 1, "replies": []}, {"body": "i really hate this meme", "score": 1, "replies": []}, {"body": "I owned it before ChatGPT.  And sold it before ChatGPT, at +200%.  Does it count?", "score": 1, "replies": []}, {"body": "TIL: OG NVDA owners use pedo meme templates. ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "My situation is more funny.\n\nI bought 10+ NVDA in 2020, and GOGL, and AAPL. And you know what? All my shares are blocked because of 2022 and sanctions (and guess where I'm from).\n\nI've lost every western share and I have no chance I can get them back, because of \"collective responsibility\".", "score": -2, "replies": [{"body": "Rip bro, should have lived in a different country", "score": 6, "replies": []}, {"body": "They are frozen though together with any dividends. They are solid shares so when things improve, you will be able to realise any gains, which have been good since 2022.\n\nSome assets are genuinely at risk but they tend to be those of the state and state related entities. They don't want to go near the accounts of private people.", "score": 1, "replies": [{"body": "I agree with you, but I don’t believe that things will improve. Even when I reach retirement age.\nAt 2022 I immediately accepted that I had lost $12000. But now I should accept that I have lost much more than that amount :)", "score": 1, "replies": [{"body": "I know what you mean. I disinvested earlier, in 2014. It is a shame as I worked in RU on capital market infrastructure reform. By that point I no longer considered investment there safe. Harder for you as you hold only your national passport.\n\nAlthough backed by the *Siloviki*, there is a lot of dissatisfaction with the way things are going and the paranoia at the top. It will change and eventually your investment will be unlocked.", "score": 1, "replies": []}]}]}, {"body": "That's a payback for my lost 27 shares of Yandex", "score": 1, "replies": [{"body": "My YNDX shares are also blocked now.", "score": 1, "replies": []}]}, {"body": "Who blocked you? Your own government or western sanctions?", "score": 0, "replies": [{"body": "Western sanctions.", "score": 1, "replies": []}]}]}, {"body": "Bastards", "score": 0, "replies": []}, {"body": "all the of models that know you have more than 1 NVDA share/1 BTC/1 ETH be like...", "score": 0, "replies": []}, {"body": "Wow.  Anyone recognize those babes?", "score": 0, "replies": [{"body": "Those are children.", "score": 6, "replies": []}]}, {"body": "Never bought $NVDA… ever.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Please. My Ai Girlfriend hypes me up all day ! \" No papa dont touch me there \"  Need Nvidia to patch that actually kinda odd.", "score": 1, "replies": []}, {"body": "I don't think AI is a \"hype\", I think it is one of the most significant developments of our era.", "score": 1, "replies": []}]}]}
{"title": "Made 6k off nvidia 20yrs old, what do I do???", "selftext": "", "id": "1db9cv5", "created_utc": 1717871228.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 103, "comments": [{"body": "retire and buy mansions in the richest areas in the world, make sure they have enough space for your lambo collection too", "score": 189, "replies": []}, {"body": "SPY and chill. stay away from this sub.", "score": 97, "replies": []}, {"body": "save it and don't forget taxes, though if that's your only income, you probably won't end up with any liability.", "score": 22, "replies": []}, {"body": "Masturbate furiously.", "score": 21, "replies": []}, {"body": "https://preview.redd.it/gzpaek6x9e5d1.jpeg?width=500&format=pjpg&auto=webp&s=83d9a8e898a5bb5dfb7f2da32e3ca1fe13b23a48", "score": 58, "replies": []}, {"body": "Simple.  Get a used Mazda Miata, a small bag of cocaine, and a trashy girlfriend and have a really fun week.", "score": 23, "replies": []}, {"body": "Don’t worry about the sudden hurdle of owning significantly more assets than you’re used to. Try to spend it slowly and on risky gambles, that way you’ll be back to where you were in no time 👍", "score": 17, "replies": []}, {"body": "VTI and Chill!", "score": 8, "replies": []}, {"body": "wHaT dO i DOooO??!\n\nGAMBLE IT ALL AWAY", "score": 10, "replies": []}, {"body": "Lambo", "score": 10, "replies": []}, {"body": "Go to the casino and double it!", "score": 5, "replies": []}, {"body": "Get an education, get a job and make a contribution to society.", "score": 4, "replies": []}, {"body": "masturbate\n\na lot", "score": 3, "replies": []}, {"body": "Get a job", "score": 3, "replies": []}, {"body": "Clearly you need to start a youtube channel so everyone else can learn.", "score": 3, "replies": []}, {"body": "Gamble that shit dude! Imagine making $12k as a 20 year old", "score": 5, "replies": []}, {"body": "Turn it into 200 million like that one guy.", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Take your boys to the bar", "score": 2, "replies": []}, {"body": "SPY 1000c 0dte", "score": 2, "replies": []}, {"body": "Easy double up on spy 0dte", "score": 2, "replies": []}, {"body": "travel here\n\n**Chicken Ranch**  \n10511 Homestead Road  \nPahrump, NV 89061\n\n  \nbring money", "score": 2, "replies": []}, {"body": "Learn as much as you can about trading.", "score": 4, "replies": []}, {"body": "Put it all in bitcoin", "score": 2, "replies": []}, {"body": "How much did u invest", "score": 1, "replies": []}, {"body": "Do it again", "score": 1, "replies": []}, {"body": "You need to send me some money", "score": 1, "replies": []}, {"body": "Hookers and cocaine what else", "score": 1, "replies": []}, {"body": "Buy subway", "score": 1, "replies": []}, {"body": "Goto Disneyland and blow it all.  Lol no you pay taxes.", "score": 1, "replies": []}, {"body": "Put it in a high interest savings account and fuck off with it.", "score": 1, "replies": []}, {"body": "Surprised nobody has mentioned that you’re a racist if you don’t send it to 123 Gaza Strip Blvd.", "score": 1, "replies": []}, {"body": "Double it ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "Hookers and blow", "score": 1, "replies": []}, {"body": "Sell, and buy 0DTE SPY puts on Wednesday", "score": 1, "replies": []}, {"body": "Flapjack and hookers", "score": 1, "replies": []}, {"body": "Self suck", "score": 1, "replies": []}, {"body": "FDs all the way", "score": 1, "replies": []}, {"body": "Quit your job at Wendy’s? ", "score": 1, "replies": []}, {"body": "Keep playing and lose it all 👍", "score": 1, "replies": []}, {"body": "r/bogleheads is that way 👉", "score": 1, "replies": []}, {"body": "Gamble it all on spy 0DTE", "score": 1, "replies": []}, {"body": "Keep it for 10 more years", "score": 1, "replies": []}, {"body": "The answer is always coke, hookers and blackjack.", "score": 1, "replies": []}, {"body": "Make another 6k and then another another another another another another another... AND THEN RETIRE", "score": 1, "replies": []}, {"body": "Gamble it all on OTM 0DTE", "score": 1, "replies": []}, {"body": "Full port weekly ITM puts on it next week", "score": 1, "replies": []}, {"body": "Keep holding until at least the next earnings.", "score": 0, "replies": []}, {"body": "Retire", "score": 0, "replies": []}, {"body": "The Dems want to make short term capital gains tax almost 50% which is crazy. That means if you made $5K off a trade you would have to give them half. They also want a unrealized capital gains tax meaning that you will get tax on any profit you make 25% even if you don’t sell the stock.", "score": -3, "replies": []}, {"body": "Dude im 21. Id go 80% VT 10% liquid cash cause you never know and 10% gifts, debts, stuff I want, etc", "score": 0, "replies": []}, {"body": "Go to college", "score": 0, "replies": []}, {"body": "Put it in a Roth IRA", "score": 0, "replies": []}, {"body": "Sell crack and watch the money bounce back.", "score": 0, "replies": []}, {"body": "Use it as a down payment for a new bmw", "score": 0, "replies": []}, {"body": "Even if it may sound like a lot to someone in your position in life, just remember that 6k is nothing. 2 or 3 months of expenses in a more or less expensive US city. Don't waste it.", "score": 0, "replies": []}, {"body": "Repost a year from now when you lose it all. Remindme! One year", "score": 0, "replies": []}, {"body": "https://preview.redd.it/ee6w31hmue5d1.jpeg?width=1178&format=pjpg&auto=webp&s=d1937a9d60ce6f37d4ac7e0cea37bc7840dc94c5\n\nTry harder and hold your NVDA. It’s golden for the next 5 years. Expect another split in 2-3 years.", "score": 0, "replies": []}, {"body": "Save it", "score": 0, "replies": []}, {"body": "Go have fun", "score": -2, "replies": []}, {"body": "20 years old. Def go buy drugs and alcohol", "score": -2, "replies": []}, {"body": "It’s about to split if I’m not mistaken. I say hold and see how things go after the split. Whit the way this stock has been growing I would ride it through the split and see if it still trends up", "score": -1, "replies": []}]}
{"title": "Is the $NVDA Stock Split a Near Term Top? DEEP DD INTO STOCK SPLITS HERE", "selftext": "it's been a long time WSB. I figured I'd drop a DD post to help you all have some context around $NVDA's stock split that will go live on Monday & what has historically happened to Tech Co's after executing a stock split.\n\n**NOT FINANCIAL ADVICE.**\n\n**TL;DR - The $NVDA stock split is BEARISH given the historical performance of tech co. stock splits.** Scroll to the bottom for positions\n\nLet's start by looking at a list of recent stock splits, how they performed over the next couple sessions:\n\nI. $AAPL 4 for 1 stock split announced on 7/30/20 (w/ earnings), went active on 8/28/20:\n\n* Performance after **announcement** of stock split to stock split actual date:\n   * Opened at $100.48/share on 7/31/20, closed at $122.11/share on 8/28/20 for a gain of +21.5%\n* AFTER STOCK SPLIT GOES LIVE PERFORMANCE: reference $122.11/share closing price\n   * 3-day: +5.3%\n   * 6-day: -9.6%\n   * Got to as low as $107.7/share within 1-month for a drawdown of -11.8% after stock split was announced before bouncing\n\nII. $AMZN 20 for 1 stock split announced 3/9/22, went active on 6/3/22:\n\n* AFTER STOCK SPLIT GOES LIVE PERFORMANCE: reference on 6/3/22 of $122.35/share closing price\n   * 3-day: -1.0%\n   * 6-day: -15.3%\n\nIII. $TSLA 3 for 1 stock split announced on 8/5/22, went active on 8/24/22 at close:\n\n* AFTER STOCK SPLIT GOES LIVE PERFORMANCE: reference on 8/24/22 of $297.10/share closing price\n   * 3-day: -4.1%\n   * 6-day: -6.7%\n\nIV. $NVDA 4 for 1 stock split announced on 5/21/21, went active on 7/20/21 (a rare bullish stock split):\n\n* AFTER STOCK SPLIT GOES LIVE PERFORMANCE: reference on 7/20/21 of $185.80/share closing price\n   * 3-day: +5.1%\n   * 6-day: +4.8%\n      * $NVDA actually was selling off prior to the stock split date here where it reached as high as $203.37/share before closing at the near-term bottom of $187.47/share (-7.8%) the day RIGHT before the stock split date (7/19/21)\n\nThere are many other examples like Tesla's 5 for 1 stock split on 8/28/20, $GOOG 20 for 1 stock split on 7/15/22, & others. I've compiled a database of tech company stock splits from $CSCO to $MSFT back to 1991 to obtain the following stats:\n\nAverage 3-day performance after a stock split: ***-0.8%***\n\n% of times negative 3-days: ***52.0%***\n\nAverage 6-day performance after a stock split: ***-3.4%***\n\n% of times negative 6-days: ***72.0%***\n\n*\\*\\*days measured as next 3/6 trading days, not calendar days*\n\n*---*\n\nI like my odds here on a bearish play on $NVDA following the stock split on Monday.\n\n**POSITIONS**: July 5 $1140P. If it gets to \\~$1000 (or $100/share split adjusted), my plan is to buy the dip.\n\nHappy tendie hunting you regards", "id": "1dbahrj", "created_utc": 1717874290.0, "score": 198, "upvote_ratio": 0.84, "num_comments": 147, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 89 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/psnsv1/evergrande_misses_some_interest_payments_china/) [x](https://www.reddit.com/r/wallstreetbets/comments/kctigo/ysg_invest_in_chinas_emerging_becky_fundamental/) [x](https://www.reddit.com/r/wallstreetbets/comments/fx94vv/paycheck_loan_dd/) \n**Account Age** | 8 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "“If one puts an infinite number of monkeys in front of  typewriters, and lets them clap away, there is a certainty that one of them will come out with an exact version of the 'Iliad'. Upon examination, this may be less interesting a concept than it appears at first: Such probability is ridiculously low. But let us carry the reasoning one step beyond. Now that we have found that hero among monkeys, would any reader invest his life's savings on a bet that the monkey would write the 'Odyssey' next?”\n\n- Abraham Lincoln", "score": 90, "replies": [{"body": "Underrated comment", "score": 3, "replies": []}, {"body": "I love that concept, although actually there would be an infinite number of monkeys typing the Iliad. And an infinite number of those would type the Odyssey next. \n\nEven if the vast, vast majority of monkeys typed no lines from Iliad, and of those that did, the vast, vast majority did not type any lines from the Odyssey.", "score": 3, "replies": [{"body": "Yes but the real question is... of those monkeys, how many of them typed out a bullish DD on NVDA stock spilt?", "score": 3, "replies": []}]}, {"body": "Only thing this chimp is clapping is ur mumz sweet buzzumz", "score": 7, "replies": []}]}, {"body": "So what you're saying is, most tech stocks go down after a split except NVDA. Got it.", "score": 255, "replies": [{"body": "sure, but in the past it was -8% from announcement to the split going live. $NVDA is +27% since announcing the split this time", "score": 50, "replies": [{"body": "Did you find any examples in your research of stocks that continue to trend up after splits? Is this selection bias?\n\nFundamentally what was going on in those companies at the time of split? Had they just completed an unbelievable quarter and kept strong guidance?", "score": 25, "replies": [{"body": "https://preview.redd.it/9xri00t9jj5d1.png?width=1200&format=pjpg&auto=webp&s=a7e9f8157fc5adb085c78d1bd5662946b6c0e7ac", "score": 13, "replies": [{"body": "Op seems to be focusing on the extreme short term of the days/week of the split which might explain the difference", "score": 22, "replies": [{"body": "Exactly, 6 days?? Thats nothing", "score": 7, "replies": [{"body": "On something like wsb it makes sense since many people are trading swings/volatility. I feel like premiums will be brutal on nvda options rn. Either way, I don't have a horse in this race, sold most of my semiconductor positions a week or two ago.", "score": 3, "replies": [{"body": "I also feel the market is high now. I have some bullish positions but will sell them short term and stay with some of the real stocks", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m not going to look into it because i don’t care, but aren’t most/all splits announced while simultaneously announcing blowout earnings and guidance?", "score": 4, "replies": []}, {"body": "Yes, which is why I calculated the % chance of the stock being negative in the forward 3 days is ~52%. Can slice up the data based on fundamentals but in my exp a general overview always works best bc ur always susceptible to torture the data to get what you want", "score": 3, "replies": []}]}, {"body": "Interesting, interesting (scribbles illegibly in crayon)", "score": 19, "replies": [{"body": "Stop wasting food!  Don't you know there's a recession coming?", "score": 3, "replies": []}]}, {"body": "NVDA has retreated 6% from its ATH, so what does that do to your calculations?", "score": 2, "replies": []}]}, {"body": "Not financial advice ![img](emote|t5_2th52|27189)", "score": 1, "replies": []}]}, {"body": "I have a 960p 6/28 (gap fill area) so it will probably keep going up in a literal straight fkn line", "score": 247, "replies": [{"body": "Thank you for your service", "score": 79, "replies": [{"body": "i'm not expecting it to go down as far as my strike but any significant downside will pump the IV enough to profit some.", "score": 12, "replies": []}]}, {"body": "I read this as \" a literal straight fucking line and a literal straight fucking kill me\" simultaneously.", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "1100p here, good luck!", "score": 4, "replies": []}, {"body": "🫡", "score": 1, "replies": []}]}, {"body": "People that bought $Amzn and $Goog after the split dips are up pretty nicely right now, don't see why it wouldn't be the same here. Or it just shoots straight to $200 because I have literally no idea what I'm talking about.", "score": 34, "replies": [{"body": "Goog and amzn weren’t valued at $3T when they split. There’s no ceiling to market valuation but that’s still ridiculously high", "score": 4, "replies": []}]}, {"body": "I’m just going to long hold my shares long term", "score": 31, "replies": [{"body": "This. And buy the dip", "score": 14, "replies": []}]}, {"body": "People have not learned yet. Don’t bet against nvidia", "score": 41, "replies": [{"body": "I did yesterday and made $2k put’n they ass", "score": 7, "replies": [{"body": "Long term you shouldn't. Short term you can always scalp here and there almost weekly", "score": 16, "replies": [{"body": "Can’t wait for the eventuality of Nvda being red two weeks in a row. Yes it’s a good company, yes they make money but stocks don’t always go up", "score": 2, "replies": [{"body": "And they say where's there fear, call all your bets. Now who's right?", "score": 2, "replies": []}, {"body": "Yea im hoping to make out huge on some puts post split. 110p almost guaranteed to pay out if you buy further out enough. 120 should easily pay out.", "score": 1, "replies": [{"body": "There’s probably people in this sub sitting on $400 puts that were “guaranteed” to print", "score": 0, "replies": [{"body": "400p? Yea thats way otm. 110/120 (this is split adjusted btw) are barely otm. Further out as in 6 months plus.", "score": 0, "replies": [{"body": "bro we talking about when nvda was 400-500 range 1 year ago. people lost their ass over 400p.", "score": 3, "replies": [{"body": "Well no shit. Either way that's way otm. They got what's coming to them. Im talking less than 2%-10% otm on cons way further out than what most degenerates buy. The dude comparing the 2(and you since you seem to lack perspective) shows me you haven't traded cons that far out and so close to itm.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "When have I ever long term any stocks! It’s in and out scalping. I scalp weeklies all the time!", "score": 1, "replies": [{"body": "Yes but the OP to this thread was referring to betting long term. \n\nI love scalping when I can and if the set up looks right. When NVDA hit 1240 over night the first time this past week I was eyeing the 1200p before open. At 1250 you could grab them for almost 4 or 5 bucks a con and they sold for around 28 bucks at peak. I never hold that long so only sold for 3x instead of almost 6x.", "score": 2, "replies": [{"body": "What you coulda’s will mess with your trades", "score": 1, "replies": [{"body": "Yea I hit my minimum 50% and more. I'm not immune to being greedy though.", "score": 1, "replies": [{"body": "I use be just as greedy as the most of us. But after losing so much I have to be frugal with my bets!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Good for you", "score": 1, "replies": []}]}]}, {"body": "Stock split or not, the question is if investors feel comfortable with 4tril valuation now.", "score": 32, "replies": [{"body": "Same thing I’m thinking. Everyone is saying we are in the start of the AI cycle so I guess we most be comfortable with a higher valuation.", "score": 9, "replies": []}, {"body": "I think this will be the bottom line for a lot of people. Yes...ok. Its the market leader atm and for the foreseeable....but $4T MC. It's been pumped to f#@k way to quick. I dont believe it's worth it's current MC...but that's not to say it won't continue to pump. The markets are regarded and lots of stuff doesn't make sense.", "score": 3, "replies": []}]}, {"body": "I was excited for this until I read your NOT FINANCIAL ADVICE. I only come to WSB for top notch financial advice. ![img](emote|t5_2th52|31226)", "score": 25, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Like stop signs.  If you remove them, they're not there!", "score": 2, "replies": []}]}, {"body": "PUT YOUR HANDS UP Randomly-Looking!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}, {"body": "https://preview.redd.it/3cxo7g5ppe5d1.jpeg?width=1080&format=pjpg&auto=webp&s=e4ccb78c7159125213c277520ceed20f7b45c052", "score": 26, "replies": [{"body": "Love this for you", "score": 13, "replies": []}, {"body": "Your breakeven price is going to be $9.18 come Monday ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)\n\nNo in all seriousness though, how'd you buy contracts on a Saturday?", "score": 10, "replies": [{"body": "The contracts have been adjusted along with the strike price and breakeven price. They updated today which is why they have today's date. The only thing not updated is the stock price.", "score": 8, "replies": [{"body": "Yeah that's why I said in all seriousness before my next point, because the first part was a joke, player\n\nReally trying to figure out how they purchased contracts today though", "score": -3, "replies": [{"body": "They didn't buy them today. They were updated today. My contracts have today's date on them as well even though I bought them on 6/3", "score": 3, "replies": [{"body": "👍", "score": 1, "replies": []}]}, {"body": "They?", "score": 1, "replies": [{"body": "Them", "score": 4, "replies": [{"body": "Wumbo", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I just ask for a simple drop to raise IV and overall contract value. Anything x400 will get the chubb going.", "score": 1, "replies": []}]}, {"body": "So why don't you just wait a week or 2 after split and go long instead of trying to time a top?", "score": 6, "replies": [{"body": "That’s literally what OP said they would do if it reverts to $100 or lower in the coming weeks", "score": 5, "replies": [{"body": "Ya, but they have puts instead which is just asking for it...", "score": 1, "replies": []}]}]}, {"body": "U didnt cross reference your research fam, look at the overall market and NVDAs finanicals during the drop after stock splits years ago. Dnt be a 🏳️‍🌈🐻 and miss out on % going up. Of course bearish mondays are a thing but wait max a few days to a few weeks after split u will see your mistake 📈", "score": 15, "replies": [{"body": "He ain't saying it's going down long term. He's just saying a pull back after a split is not uncommon. He even said he will buy the damn dip, what do you want, it to continue on a parabolic arc forever?", "score": 7, "replies": [{"body": "I mean…. that’d be pretty nice tho.", "score": 1, "replies": []}]}]}, {"body": "Once again I will comment on $nvda, this stock ain’t going nowhere but up, why? Cause they are selling out of chips they haven’t even released yet let alone the next generation after Blackwell has been announced.  Until it is reported that a slow down in sales is happening, it’s up from here.", "score": 18, "replies": [{"body": "Yep and more and more general companies have over paid tech bros who will sit in the board room and say “if we don’t get on the AI train we’re going bankrupt.”\n\nNext thing you know Jiffy Lube is running 10,000 5090s in a warehouse to analyze techs bathroom habits and the trajectory of Susan’s roof vs the roofers nail gun that ejected a nail into the road allowing Carl to get insurance to cover his replacement tire.", "score": 16, "replies": [{"body": "5090 would be next gen gaming gpu not for ai. I know that's not the point, but it's worth pointing out.", "score": -3, "replies": []}]}, {"body": "It’s practically a defense industry stock now…..at some point it’s going to be making fuckin terminators.  Might as well just go along for the ride.", "score": 3, "replies": []}]}, {"body": "That’s it I’m selling NVDA and loading up on intel.", "score": 13, "replies": [{"body": "regarded play bro", "score": 17, "replies": []}]}, {"body": "inversing this for sure, calls it is", "score": 7, "replies": []}, {"body": "Have you considered it goes straight up and consolidates after your puts expire? guess you could always roll them while Hodlers get 🤑", "score": 3, "replies": [{"body": "Well at least the stock goes straight unlike their CEO with a woman’s name! Who the fuck name their son Jen?!?", "score": -6, "replies": [{"body": "His name isn't Jen. His mom was named Jen. That's why he is called **Jens Son** (Jensen).", "score": 2, "replies": [{"body": "No shit! It’s a joke!", "score": -2, "replies": [{"body": "Hope you can tell mine's a joke too.", "score": 1, "replies": [{"body": "I was talking about your comment", "score": -1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "PUT YOUR HANDS UP lostfinancialsoul!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Splits tend to be sell the news events. No one was sitting on the sidelines waiting to make a major buy until the split. They would have just bought fewer shares before.", "score": 2, "replies": []}, {"body": "Huge call after split?", "score": 2, "replies": []}, {"body": "That's it. I'm buying calls then", "score": 2, "replies": [{"body": "Because you just said that, don’t we have to inverse and get PUTs?", "score": 2, "replies": [{"body": "Because you just said that too don't we have to inverse your inverse to get calls?", "score": 3, "replies": [{"body": "It's inverses all the way down", "score": 1, "replies": []}]}]}]}, {"body": "Did you measure max drawdown after the split that would be an interesting one", "score": 2, "replies": []}, {"body": "How many of these were splitting after consecutive quarters of accelerating double and even triple revenue growth?", "score": 2, "replies": []}, {"body": "Welp. My calls are certainly fucked. I can only pray that a miracle will happen", "score": 2, "replies": []}, {"body": "Bought ATM puts at Fridays close for this very reason. See you behind Wendy’s", "score": 2, "replies": []}, {"body": "Am I cooked?\n\nhttps://preview.redd.it/2adr7aprrg5d1.jpeg?width=1170&format=pjpg&auto=webp&s=63dc63c688c57f0386c009fa85b810d00e64f7c9", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Well done regard", "score": 2, "replies": []}]}, {"body": "Priced in. I’m glad people are bearish - it gives me hope that my calls will print.", "score": 2, "replies": [{"body": "They did", "score": 1, "replies": []}]}, {"body": "This is solid advice for short term options play. Long term, shares I would hold.", "score": 2, "replies": []}, {"body": "NVDA shouldn't be compared to those other companies. It has a different story behind it and won't behave in the same way.", "score": 3, "replies": []}, {"body": "My guess is it runs 3-5 days post split before a pull back to under $100(post-split)", "score": 3, "replies": [{"body": "Probably trade sideways for a bit to screw retail going both ways", "score": 6, "replies": []}]}, {"body": "6 months after the splits you mentioned, where were these stocks? I know NVDA was way up in November 2021  then crashed back down in 2022. But it hit 300+ in Nov 2021 before backing down to 230s in Feb 2022. That’s a sizable gain in 6 months. What were these others - curious if you have that info. I expect NVDA to keep going higher until Jan 2025 when the Year to Year Q earnings growth won’t be 300% each Quarterly report.", "score": 2, "replies": []}, {"body": "Four cherry-picked examples is certainly a “deep DD” for wsb", "score": 2, "replies": [{"body": "Right? He didn’t even go to any stores and count shoppers or bags. Low effort.", "score": 2, "replies": []}]}, {"body": "So I should sell some CSPs for a price I like for NVDA?", "score": 1, "replies": []}, {"body": "Do you know based on your research on this, or would you think other tech and AI stocks will follow this trend like they’ve been following NVDA’s movements for the most part? I took a QQQ put mid day Friday hoping this week won’t look great for other similar stocks.", "score": 1, "replies": []}, {"body": "Interesting. Now do 1-2 years after the split. Two of your examples were during 2022 which was one of the worst market years in recent history.", "score": 1, "replies": []}, {"body": "Sooo… my fidelity “glitched” today and distributed extra NVDA shares to my account, which I quickly saw, refreshed, and disappeared. If truly not a glitch and Fidelity fucked up… it would indicate a 9:1 stock split based on the distribution I saw in my account", "score": 1, "replies": []}, {"body": "Just calls.. its nvidia ffs the most hyped uber wonder stock oat!", "score": 1, "replies": []}, {"body": "Math = 100 quantity of any item split into 10 equal groups = 10 groups with each containing 10 items\n\nStock math = 100 quantity of any item split into 10 equal groups = 10 groups with each containing 10+ items", "score": 1, "replies": []}, {"body": "No idea wtf bearish means here ... Maybe you mean big hairy man?\n\nhttps://preview.redd.it/sfox9ou3yk5d1.jpeg?width=1013&format=pjpg&auto=webp&s=8ae8915f5b566e1859f0836841fe1edee5fd30bc", "score": 1, "replies": []}, {"body": "What about a year after?", "score": 1, "replies": []}, {"body": "Palantir", "score": 1, "replies": []}, {"body": "Is this still in play?", "score": 1, "replies": [{"body": "I'm still in at least until next week unless we get a god candle courtesy of jpow tomorrow", "score": 1, "replies": [{"body": "I’m thinking we drop due to CPI then rip when jpow speaks or other way around. Since we’re already at an all time high for spy and qqq.", "score": 1, "replies": [{"body": "or the opposite. Either way, today's underperformance of nvda vs the nasdaq and rest of mag7 was very trlling", "score": 2, "replies": [{"body": "You still in this?", "score": 2, "replies": [{"body": "yeah, at least until Monday. I went giga long $TSLA and $SOXL yesterday so not too hurt by the Ls on these puts as of today. Should've taken profits on some on the Monday dip in hindsight", "score": 2, "replies": [{"body": "The good thing is you won’t lose Wayne enterprises by gambling 🎰 on options", "score": 1, "replies": [{"body": "I bagheld them to -60% now they're green so that's another lambo for me", "score": 2, "replies": [{"body": "You got 💎 🙌", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Give us an update on your position.", "score": 1, "replies": [{"body": "in the green now lmao", "score": 2, "replies": [{"body": "Congrats bro", "score": 1, "replies": []}]}]}, {"body": "I have never seen a stock give so many top signals as Nvidia. It is truly incredible. Especially considering what happened from August 2023 to the end of that year.\n\n10-1 split? Come on.\n\nFanvidia fanbois don't know how lucky they are their beloved graphic card brand is giving them so many signs.\n\nAlmost like this was engineered, to prevent a wide-market crash or something.\n\nThe mother of all soft landings.\n\nWill start trading like a 3T blue chip, and not like a biotech penny stock. Or we are heading for the biggest bubble in the history of bubbles.", "score": -13, "replies": [{"body": "up to this point, some of it is warranted given Jensen has built a company that does \\~50% free cash flow margins which is unheard of in business unless you're Pablo Escobar in the cocaine business. But this is no longer a secret, & now that every cab driver & grandma has bought in, a big correction looms..", "score": 16, "replies": []}, {"body": ">Almost like this was engineered, to prevent a wide-market crash or something.\n\nHold up, let me get my tin foil hat.", "score": 0, "replies": []}, {"body": "Nice. Downvoted by loyal brand chasers.\n\ni'll take the badge.", "score": -6, "replies": []}]}, {"body": "Following", "score": 0, "replies": []}, {"body": "RemindMe! 14 days", "score": 0, "replies": []}, {"body": "Nicely done", "score": 0, "replies": []}, {"body": "AI is hype and bullshit/smoke and mirrors. Can’t wait for this card house to come crashing down.  Too big to fail, you bet it is", "score": -4, "replies": []}]}
