{"title": "Tech stocks: which other charts to watch?", "selftext": "If i want to make a forecast for let's say NVDA or AMD, which other charts you have to keep in mind? Like \n\n- SPY SPDR S&P 500 ETF\n- ISHARES PHLX SOX SEMICONDUCTOR SECTOR INDEX FUND NASDAQ \n- SX110\n\nWhich one should i use? All of them?\n\n", "id": "6l7dcq", "created_utc": 1499178514.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 13, "comments": [{"body": "Is this for intraday trading?  If so, indexes like SOX or even nasdaq's NDX can lag slightly.\n\nEither way you're better off with:\n\n[Nasdaq mini futures (NQ)](https://www.barchart.com/futures/quotes/NQ*0/all-futures)\n\nWho's your broker?", "score": 1, "replies": [{"body": "I use eToro. you know it? Only SPDR S&P 500 and XLK Technology Sector.\n\nWhich ones i need for swingtrading/long term? Got tradingview too", "score": 1, "replies": [{"body": "I think both those brokers should have NQ.  NQ is the ticker for nasdaq mini futures.\n\nYou can also look at QQQ since it has high volume & large market cap, it's better to look at those than an index or XLK which have lower volume and will move after QQQ and NQ have moved (more for intraday).  But for swing/long, seeing the volume for NQ and QQQ can be helpful.", "score": 1, "replies": [{"body": "So the ones i mentioned are not as good as QQQ and NQ? ", "score": 1, "replies": [{"body": "* You can also look at QQQ since it has **high volume & large market cap**\n\n* it's better to look at those than an index ticker or XLK which have lower volume\n\n* and will move after QQQ and NQ have moved (more for intraday), but for swing/long, seeing the volume for NQ and QQQ can be very helpful.\n\n* S&P, no, it's not as good as Nasdaq when looking at NVDA/AMD or any tech stock.", "score": 1, "replies": []}]}]}, {"body": "Isn't eToro the broker that lets you follow other traders moves? ", "score": 1, "replies": [{"body": "Yes its for noobs", "score": 1, "replies": [{"body": "Has it worked at all?", "score": 1, "replies": [{"body": "Shure works great. Which CFD platforms would you recommand", "score": 1, "replies": [{"body": "Which country are you in? And I would recommend options > CFD's. ", "score": 1, "replies": [{"body": "Belgium. Why you like options more?", "score": 1, "replies": [{"body": "With CFD's if you're right about the movement but wrong about the timeframe you're screwed. With options you don't have to worry about that as much.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "🇺🇸 Happy 4th WSB! 🇺🇸 Use today to catch a short break from losing money and celebrate America. Maybe time to go long on $BA, $RTN, $GD, and $NOC?", "selftext": "", "id": "6l86g0", "created_utc": 1499186848.0, "score": 68, "upvote_ratio": 0.92, "num_comments": 11, "comments": [{"body": "What are you talking about? Since the market is closed it's the high time for some DD and tech analysis! \n\nIn seriousness, happy 4-th to everyone!", "score": 29, "replies": [{"body": "So baba like a traitor?", "score": 5, "replies": []}]}, {"body": "I was able to actually go outside and interact with normal people at a BBQ.\n\nWasn't able to lose money in the markets, Vanguard kept giving me this warning when I logged in that it was July 4th. The withdrawals were surprisingly not that bad; the beer probably helped.\n\nJerked off to the butts I saw at the BBQ since I did something to piss my gf off (was pretty drunk so who knows). \n\nA good day. ", "score": 16, "replies": [{"body": "damn", "score": 1, "replies": []}, {"body": "This too real", "score": 1, "replies": []}]}, {"body": "Long $BA", "score": 3, "replies": [{"body": "Their market in India and China is about to be insane. ", "score": 1, "replies": []}]}, {"body": "LMT bitches.  ", "score": 3, "replies": []}, {"body": "$HII, $Gd, $OA", "score": 1, "replies": []}]}
