{"title": "$8000 no directional bias ER win!", "selftext": "&#x200B;\n\nhttps://preview.redd.it/6dp6gwh4hy851.png?width=1125&format=png&auto=webp&s=113721236c139718c8e86f1216d46d3688100cea\n\n&#x200B;\n\nPosting this not to brag but to inform on the power of selling premium.\n\nAbove is $8000 Realized in a single day playing ER with no directional bias!\n\nIf any new traders have any questions feel free to pm me id love to help.", "id": "hlfs7c", "created_utc": 1593918722.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 30, "comments": [{"body": "Can you write in detail what you did? Seems very interesting, but I'm not sure I follow completely.\n\nMy guess is that on 07/01/20 you sold 100 contracts of the 10 straddle and 100 contracts of the 12.5c and 7.5p strangle, all with 07/17/20 expirations, and closed all positions the enxt day on 07/02/20.\n\nAlso wondering what open interest, volume, and the bid-ask spreads were on the chain, and how you identified the trade in the first place?", "score": 7, "replies": [{"body": "I sold short strangles and short straddles , i represented about 50% of OI on the 12.5 and 7.5 strikes , i identified the trade based on my own data crunching", "score": 1, "replies": [{"body": "Nice win, why didn't you hedge either side though?\n\nI'm surprised you managed to get a fill representing about 50% of OI - was the bid-ask spread tight enough or was slippage an unfortunate practicality here?", "score": 1, "replies": [{"body": "honestly i normally would never go into this kind of low liquidity it’s awful and stupid , but my data was saying everything lined up here, so i went in big. It’s funny cuz i filled at .55 for the strangles and later in the day the stock shot up for no reason ( look at the chart ) and the mark was .9, yeah that hurt , bid ask very wide , bought them back for about .15 on average and before close we’re worth .1, yes lots of slippage lots of money left on the table, it is what it is.", "score": 1, "replies": []}]}]}]}, {"body": "This looks like a post to harbor new players to their paid service or private server. Why would you ask for dm instead of answering questions on post itself and just a screenshot of play with no details of actual option looks like deliberate to recruit people.\n\nIf I am wrong then please post the play with actual play screenshots and start answering questions on the thread instead of DM", "score": 6, "replies": [{"body": "I did answer questions on the thread, it was 100 short strangles and 10 short straddles.", "score": 1, "replies": [{"body": "Yes but you haven't given any details on why this trade and what potential loss you would have had. Also asking people to pm is usually seller thing. Based on your history you have done same thing over an over again.", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Why would I be mad over a stranger on internet? I am just trying to make things clearer. All my post did was allegations. You can easily deny it with facts but your choosing to make this one on one issue.\n\nCan you say you are not posting these to get people to join your group or services. Because looking at your history it definitely looks like that.", "score": 1, "replies": [{"body": "i don’t have a service , i have a group but i could care less if anyone joins or not, you seem focused on me a lot ... you should focus on your trading and maybe you’d see better results", "score": 1, "replies": [{"body": "Thanks for the advice", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Please indicate your strategy, trade position, and why you chose the underlying. \n\nTrade journal posts without a narrative are taken down.", "score": 5, "replies": []}, {"body": "The risk you took was immense. 100 contracts on a position like this could have went way too wrong if stock had a huge move either side", "score": 3, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Lol", "score": 2, "replies": []}, {"body": "I guess you got a reply from downvotes see ya soon working for a law firm as clerk cause you were deep in a margin calll and now sued by broker", "score": 1, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Good luck with that toddler!", "score": 3, "replies": []}]}]}]}]}, {"body": "If you play this strategy consistently then you would have lost very bigly on many of the recent ER’s, so why don’t you show us those losing trades also?\n\nAnd if you haven’t lost any trades, then I guess it must be the crystal ball you use that you’re trying to sell in DM’s.", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Wow, you mad bro?\n\nNo harm intended, good luck with your trades. Peace.", "score": 0, "replies": []}]}]}, {"body": "How many contacts?", "score": 2, "replies": [{"body": "Be careful of unlimited risk strategies", "score": 4, "replies": []}, {"body": "100", "score": 0, "replies": [{"body": "What does ER stand for?..", "score": 1, "replies": [{"body": "Earnings", "score": 2, "replies": [{"body": "Cheers. Some nice earnings news coming up this week to do the strangles on. Not sure if I'd do the same size as yours though. Well done. 👍👍", "score": 1, "replies": [{"body": "Thank you, yeah gotta put it in the context of your account .", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Please enlighten us what could have been your max loss.", "score": 2, "replies": [{"body": "$25000, looks like.\n\nEdit:  or is he short all 4 strikes? Yikes.", "score": 2, "replies": []}]}, {"body": "Selling strangles and short straddles into earnings... sounds like a good way for noobs to blow up their account assuming they lie to get high level options approval.\n\nMaybe you can share your decision making process here in presumably funding the strikes and DTE for the vol crush after earnings.", "score": 2, "replies": []}, {"body": "Congrats. The invitation for free PM, and the fact that a single win with massive risk qualifies you to help new traders will be seen with suspicion.", "score": 1, "replies": []}, {"body": "Lol not to cry about it but the amount of hate after i try to make an informative post is insane; its pretty low. The fuck do i have to gain, i am showing a strategy that can benefit others. Toxicity really doesn’t make others want 2 share ideas , stop hating and spend time studying instead jeez.", "score": 0, "replies": [{"body": "There is no information in your \"informative post\".\n\nGJ making 8k in a day.\n\nHope you don't turn around and lose it all on a bad set of trades tomorrow.", "score": 1, "replies": []}]}]}
{"title": "Investing in Tesla a good idea?", "selftext": "[deleted]", "id": "hlkc1z", "created_utc": 1593944089.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 28, "comments": [{"body": "Buy 2 shares of TSLA.. stock takes a 50% haircut you’re only down ~$1K. Nbd", "score": 2, "replies": [{"body": "Never going to happen. That’s just stupid to say", "score": 0, "replies": [{"body": "Would never buy puts on TSLA, but would also never pay the current (and expanding) P/E multiple. Other clean energy plays also very expensive ENPH RUN", "score": 2, "replies": [{"body": "I have 20 shares of Tesla and a 7/10 1050 put. If it does dip it will never fall under 980 ever again. People making an ass of them selves thinking 600", "score": 0, "replies": [{"body": "I think what amuses me most about TSLA cultists is the absolute CONVICTION they have that the stock can’t trade down. I would find them more credible if they were open to intermediate-term weakness as an oppo to add.", "score": 2, "replies": [{"body": "The support at 910 and then again around 980 and 1005 means unless anything huge dip (not likely) it will not drop last 980. I have and will continue to put my life savings in that", "score": 0, "replies": [{"body": "A dip to $780 is still bullish", "score": 3, "replies": [{"body": "Hell no. You can buy those puts for penny’s go ahead", "score": 1, "replies": [{"body": "“Hell no”.. a dip to a historical demand zone isn’t bullish? Btw.. the Oct 16th $780 Ps are trading for almost $3K/contract, not “penny’s” 🤔", "score": 1, "replies": [{"body": "Oct? It will be around 1500 by then. Wait for the weekly options they till be penny’s any date you want", "score": 1, "replies": [{"body": "Why would I buy weeklies if we’re talking about intermediate-term pricing? Btw, it’s “pennies”** \n\nAlso, contracts expiring “Any date you want” would not be considered weeklies. Weeklies are contracts that expire within days or weeks, not months.", "score": 1, "replies": [{"body": "Just pick a date and wait till that week. I will sell you personal puts.  Go ahead give your money away. October when share prices is 1500 I will sell you some 800 puts", "score": 1, "replies": [{"body": "Like I said.. I would never buy puts on TSLA. That was YOUR idea. But I would consider initiating at $780", "score": 1, "replies": [{"body": "I hope Tesla dips to 1050 tomorrow morning and your have the opportunity to buy in.", "score": 1, "replies": [{"body": "Market will probably open green", "score": 1, "replies": [{"body": "Hey man. I just want you to know I’m over 100 percent officially", "score": 1, "replies": [{"body": "Well done", "score": 1, "replies": [{"body": "125 now", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Please do not invest based on the opinions of anonymous strangers on the internet. There are stories on reddit weekly, if not daily, of people losing quite a bit of money doing exactly that. If you are new to investing, I would be more then happy to point you in the right direction in regards to learning how to properly research and form valuations of companies, just shoot me a message.", "score": 2, "replies": []}, {"body": "This question is posted here 4x times a day. Do your own research in this Subreddit.\n\nImho, Tesla will pump up to 2.000 simply because of Meme. Battery day will be huge and is set for September 15. Up until then, rocket.", "score": 6, "replies": []}, {"body": "Yes. Also msft is a good deal imo", "score": 4, "replies": []}, {"body": "No, they are fgoing to stop growing, fall to 300 tomorrow and never hit their current price ever again.", "score": 1, "replies": []}, {"body": "Downvoting, pissed of this repetitive Tesla questions. Lazy assholes can't even scroll enough to read existing posts.", "score": -4, "replies": [{"body": "Calm down you twat", "score": 8, "replies": [{"body": "They're not wrong though. This sub gets countless posts like this one that are basically \"Hey, I'm new, tell me what to believe and do all my research for me\". \n\nIt *is* lazy and it's tiring seeing these nonstop. If the OPs put even a shred of work in first or showed they *tried* to do a deeper dive, it wouldn't be as bad. Most just don't even put the effort in into searching first.", "score": 2, "replies": []}]}, {"body": "Dude chill.. who hurt you?", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "China is known for its pump and dumps, stride carefully friend.", "score": 3, "replies": []}]}]}
{"title": "Is 3+% weekly return sustainable ?", "selftext": "Been trading about 3 months. I came across the theta gang cash secured put YouTube video in March and this strategy just seemed to speak to me. I started with $1300 selling weekly puts in MRO, GPRO, ACB, CHK (RIP), AMC, HTZ (don’t judge), AAL, M, a few others. Any good/recent threads on this, let me know. \n\nI’ve made just over $600 in the time being, and currently averaging 3.46% weekly returns. Is this sustainable? I am trying make projections and even if you are projecting 3%, 2.85%, even 2.5% a week, the annual rates of return are ridiculous when you look out next year and thereafter. \n\nBig runs on ACB a month or so back and recently on CHK, just taking conservative strikes below strike (and way below for CHK, like $4 when it was at like $16), and it has been paying. For these two in particular, I was seeing 9% a week for short durations. Haven’t seen a big loss yet, less than $9 loss one week. I’ve buying back contracts if I see the stock turning away, I am not interested in assignment, or cash secured calls.\n\nI guess I am asking, anyone with a similar strategy? For how long? What’s your account look like, weekly/annual ROI?\n\n\nEDIT: thanks for the conversation, I appreciate the info. Looks like it’s not exactly scalable or as profitable in the long term. And I’m shooting from the hip with these stocks.", "id": "hluffb", "created_utc": 1593983884.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 40, "comments": [{"body": "3% x 4 weeks =12% a month. 12 x 12= 144% a year. If you were able to make 144% a year consistently, every hedge fund would be foaming at the mouth to get your strategy. 3% a week is not sustainable in the least bit. Maybe 3% a month.", "score": 17, "replies": [{"body": "You can easily make 144% a year on a small account. It won’t scale to hedge funds.", "score": 2, "replies": []}]}, {"body": "Nope, not at all.", "score": 15, "replies": [{"body": "Yea? I guess I figure it’s not scalable. My projected ROI scales down each year, as the amount grows. I was thinking 3% is not a bad target for the time being. Maybe I need bring that target down a bit. What’s your experience with cash secured puts? Where was the ceiling? Is 1% per week manageable?", "score": 2, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "Nah, I’ve only been doing this since March. Like I mentioned in another response, I get that anyone who showed up with some cash over the past 4 months is making money. But I think these strategies can make more than index funds. I have to be honest, I feel like  .5% gain per week is possible with this strategy, and yea, that’s 25% annual ROI. I’ve questioned scalability. I haven’t managed a mid size/large account. We’ll see.", "score": 3, "replies": []}]}]}]}, {"body": "Those tickers show some playing with fire on companies that are bankrupt, or could be within a years time. That's why your return is high, because of the amount of risk you are taking. No judgement, just trying to add perspective. (I myself snagged some fast gains on AMC and GME, despite grim long term prospects)\n\nHigh risk for high IV premium is nice when it works. Just know there is a fair potential to get burned, or at least stuck bag-holding something for a very long time.", "score": 12, "replies": []}, {"body": "Selling puts can be like playing Russian Roulette.  You win a lot but you occasionally die.  I sell puts every week and I keep roughly 50% in cash.  Risk management is absolutely key when selling puts.  I spread the risk out among different instruments, strikes, and expirations. For example I never sell my whole AAPL position on a single strike and expiration.  I'll usually break it up among strikes and dates (e.g. 20%, 20%, 20%, and 40%).  I also do the same with calls.  I don't mind owning the stock if the market tests the strikes for my calls (turn it into a covered call) or I'm assigned on the puts.", "score": 8, "replies": [{"body": "I like that. So you diversify within the same stock. And you can have some contracts falling into the risk side of the spectrum, and then you are backing down the strike (or up for calls) to moderate the play.", "score": 3, "replies": [{"body": "Correct.  I see it as vertical diversification  (different strikes) and horizontal diversification (different expirations).", "score": 3, "replies": []}, {"body": "I plan on doing this more as I scale up. Currently I'm trying to only do 1 contract at a time per underlying and having 10 to 20 underlying at a time I'm working on to diversify that way", "score": 2, "replies": []}]}, {"body": "So tldr??? -sell puts on different strikes, diversify with companies you wouldn’t mind owning, and wheel when need be", "score": 3, "replies": [{"body": "Calls and puts.  Different strikes and different expirations.", "score": 3, "replies": []}]}]}, {"body": "no. not long term.", "score": 9, "replies": []}, {"body": "Let me ask you this. If a nuclear war started and all the underlying stocks from your puts lost 75% overnight and you get assigned, are you really 100% cash secured?  \nI can make 2% a month but no way it is cash secured.", "score": 6, "replies": [{"body": "I understand, being knowledgeable of a worst case scenario. But if WW3 starts tomo, nearly all securities and investments take a hit, right? Not saying this is full proof. What’s full proof?\n\nEdit: foolproof. Maybe I shouldn’t invest...", "score": 4, "replies": [{"body": "Fool proof if it really is 100% cash secured if you got assigned all stock. I’m selling puts on margin and I’m not always comfortable with it. This generates 2% a month. If I would try to do this on a weekly basis I would get no sleep. But maybe I’m overestimating risk.", "score": 3, "replies": [{"body": "Hey... so if this happens, what would happen at a brokerage where traders do this a lot? Margin Call?", "score": 2, "replies": [{"body": "IB closes positions automatically if your net value drops below $2000 and you’re trading on margin. Of course when there’s a gap that won’t stop the loss. We do have a negative balance protection in Europe.", "score": 2, "replies": [{"body": "By net value you mean your total portfolio value minus what you owe on margin?  Or something different?", "score": 2, "replies": [{"body": "I think it’s called liquidation value, just everything in the account when converted to cash.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "It's not sustainable. Even 1% a week is not sustainable. 0.5% a week is a more reasonable long term goal if you are selling option premium.\n\nAre you selling weekly ATM puts? I think this is a good strategy, but you have to be cautious about your choice of underlying and be willing to stick things out if the trade goes against you. I would be very careful using this strategy on stocks like GPRO, CHK, AAL, HTZ, and similar. You seem to have gotten lucky.", "score": 6, "replies": [{"body": "I am selling weekly puts with strike below current price. I have a few stocks in reserve each week that can easily see 1.5-2% returns. Then I listen/look out for anything with anticipated volatility. \n\nIf I realize 75% of my premium, I exit the position. 75% is more than enough if most cases to keep me on track.", "score": 1, "replies": [{"body": "I just don't see this strategy working out in the long run on stocks that are at high risk of bankrucpty. There are so many solid companies with high volatility right now, like LUV, DIS, and JPM. There is no reason to bottom fish.", "score": 5, "replies": []}, {"body": "It works until it doesn’t. It’s been a great market for selling puts the last few months. Even a moderate downturn will wipe out a lot of those gains though. Anything in excess of 1% per week may work most of the time but will ultimately see returns significantly mitigated when things go south.", "score": 3, "replies": []}]}]}, {"body": "You can regularly receive very high premiums when selling insurance on companies going bankrupt or at high risk for bankruptcy. People pay those premiums for a reason. You don’t need us to tell you whether or not that’s sustainable, you must already know. :) \n\nGenerally people would classify put selling as an undefined risk trade since you can lose 100% of your collateral - worst case scenario. For many companies those kinds of losses are extremely low probability. Once you start playing with companies where that “unlimited risk” is within the realm of possibility, you can receive high compensation for taking on that burden. You’re getting a discount on your current returns subsidized by huge inevitable losses in your future.\n\nThat said, awesome 3 month return! Stay safe out there though!", "score": 5, "replies": []}, {"body": "Ive had a great last few months making 17% gain on my account in June & 9% in May...ive been trading options for years now (cfd's before but thats another story) & yes those are very high results vs the norm for sure, but as a measure it would be an amazing result for most traders to end the year even having average say 2%-3% per month let alone a week, especially if you are tightly managing your risk...the big danger here is setting an expectation on returns can cloud your judgement sub-conciously when it comes to picking the right trades.\n\nThat leads me onto option picking in general, it seems theres a lot of focus on high IV options as weapons of choice to generate yield for some....whereas myself I was mostly trading spread options on very solid stocks when it comes to financials, earnings and a track record of outperfroming the market, the gains I make I think demostrate there is really not as much of a disadvantage to trading those at all, and consitency will be far greater imo.", "score": 3, "replies": []}, {"body": "I did a quick sniper hit on ACB and got lucky. Then did the same on CHK and got killed. \n\nIt taught me to stay in my lane.", "score": 5, "replies": [{"body": "ACB was good, then I gave about half of it back. My lesson for CHK was to go WAY low, like when it was at $16, I was selling puts at $4. I did well with CHK. This week I am playing INO $18.5p, sold at $80 premium. \n\nHow long have you been at this strategy? What’s the ROI over time looking like?", "score": 1, "replies": []}]}, {"body": "The don't judge part on only HTZ cracks me up a bit. CHK was always heading towards bankrupty, many think AAL is again. GPRO and M are also both that I haven't looked into personally, but typically get harped on on investing subs. ACB could also crash at any time again.\n\nMy point being is that most people in this sub consider most if not all these tickers as picking up pennies in front of the steam-roller. Maybe you'll end up fine, but you could lose over $1000 on a single AAL put at the wrong time.\n\nPersonally, I've only been seriously selling CSPs for a little over a month. I average about 1% weekly and play it safer for the most part (BAC, T, MET, KR, etc.)", "score": 3, "replies": []}, {"body": "I know people who make 1% every day on average but who have several red weeks. Because you're talking statistics, my advice for you is to track your progress weekly, monthly, quarterly, and yearly. This will smooth out large increases or decreases and will give you a better picture overall. You're selling puts so your bullish during a pandemic that is spiraling out of control. My money is that you will not be able to maintain 3%+ weekly because of the volatility to the negative side.", "score": 3, "replies": []}, {"body": "Ive sustained decent return the past year with a mixture of couple strategy, csp being one of them (3 to 6% weekly on average), but let me tell you.. it gets harder and scarier as your fund grows larger. Would you be comfortable doing 100 htz contract from 10 as your account size grew to 16k? \n\nIn short yea it's possible, but you are also pushing yourself further down the risk curve as you grow.", "score": 3, "replies": [{"body": "HTZ and CHK are extreme examples. I focus on a number of others that seem less volatile. But I hear you, 15 HTZ Puts at $1, is still $1500. And yea, as the balance grows, all the sudden it feels like you’re all in and on shaky ground. \n\nI suppose I have all of my focus on only aspect of the thetagang strategy. So I am building, what’s the next part of the strategy? Do I need to start looking at spreads to limit exposure?", "score": 1, "replies": [{"body": "Umm i personally don't like spreads (except for certain circumstances). I personally like PMCC (diagonal spread) and CSP the most.\n\nI have all my trade documented under trade log on my blog since i first started trading option if you are interested. I started with 12k then slowly added capital to 32k. \n\nhttps://onemadlad.wordpress.com/", "score": 3, "replies": []}, {"body": "Theta is still fine but you can limit exposure by choosing more quality companies and smaller deltas", "score": 3, "replies": []}]}]}, {"body": "One of the major tenants of selling puts is being comfortable holding the security if you do get assigned, do you really feel comfortable holding any of those companies if you're forced to?", "score": 3, "replies": [{"body": "Given the pandemic, I definitely have more time to focus on the hour by hour. I am looking at the contract throughout the day. If I think we’re going in the wrong direction, I am trying exit the strategy. I guess that’s where I’ve been lucky. And it sounds like luck - most of the plays go as expected. And the ones that haven’t, I’ve been able to buy out of and take a loss. Big losses just haven’t come yet, I guess. That probably sounds arrogant. I recognize the market is doing weird stuff right now and a lot of people are making money just by showing up.", "score": 3, "replies": [{"body": ">time to focus on the hour by hour. I am looking at the contract throughout the day\n\nYou're a day trader on bankrupt companies?", "score": 5, "replies": [{"body": "Looks like I have day traded on two or so bankrupt companies. I don’t think any of my other plays have gone bankrupt. AMC may be heading there. Yea, this probably qualifies as day trading. And I’m probably not a great day trader. But I play more than BK companies.", "score": 1, "replies": [{"body": " You can keep up 3% playing high risk stocks until it doesn't work.  Not one of those companies listed would be one you would have been happy buying 4-5 months ago.", "score": 4, "replies": []}]}]}]}]}]}
{"title": "CALLS ON TSLA,GPS ALL THE WAY🚀🚀🚀", "selftext": "[removed]", "id": "hlf8p8", "created_utc": 1593916146.0, "score": 50, "upvote_ratio": 0.87, "num_comments": 31, "comments": [{"body": "Just beat me to this post damnnit", "score": 10, "replies": []}, {"body": "WE WILL HAVE KIM KARDASHIAN AS FIRST LADY..😂🤣 HOLY FUCK", "score": 16, "replies": [{"body": "Never saw that coming !", "score": 4, "replies": []}, {"body": "Oh fuck", "score": 2, "replies": []}, {"body": "the first thicc lady. \n\nMURICA NUMBER WON!\n\nCHINA NUMBER TWO!", "score": 1, "replies": []}]}, {"body": "Puts on America.", "score": 18, "replies": [{"body": "Calls on Kim ( . Y . )", "score": 9, "replies": []}]}, {"body": "Gov financial support for GPS incoming", "score": 4, "replies": []}, {"body": "If Tesla isn't 5,000 by 2024 when NASA launches their Artemis mission to the Moon. I'm buying those calls. Daddy Elon is going to let me buy my wife's boyfriend a really nice car", "score": 5, "replies": []}, {"body": "LINK OF PAPA MUSK OFFICIAL ENDORSEMENT: [https://twitter.com/elonmusk/status/1279577069005897728](https://twitter.com/elonmusk/status/1279577069005897728)", "score": 6, "replies": [{"body": "Scroll down a little bit to Ines Helene tweet and see her on her IG. Good time", "score": 2, "replies": [{"body": "Lol. That Lardashian butt lift. \n\nIn IG videos the cheek are unnaturally shaking like sexy jello", "score": 1, "replies": []}]}]}, {"body": "Yep - this is the well balanced CEO I trust with my investment money", "score": 2, "replies": []}, {"body": "Kanye is a fixking God level marketer. GPS to the mother fucking moon", "score": 2, "replies": []}, {"body": "Efffffff I had GPS puts!!!!!!", "score": 1, "replies": [{"body": "Sell before you take a loss. Or keep if it seems like a win", "score": 1, "replies": [{"body": "Sheeet who knows come Monday what this news will do now 🤦‍♂️", "score": 1, "replies": []}]}]}, {"body": "Wish I bought those calls on Friday...", "score": 1, "replies": []}, {"body": "I bought gap puts that expire the end if this week", "score": 1, "replies": [{"body": "Me too Monday is going to be scary. Hopefully people sell thinking Kanye is taking his focus off gap", "score": 1, "replies": []}]}, {"body": "He’ll do his Kanye best", "score": 1, "replies": []}, {"body": "how about this Daddy Musk's tweet:\n\nhttps://twitter.com/elonmusk/status/1279597691182313472?s=20\n\nshit. i think SpaceX is about the most successful private space tech company. i'll dump all my life saving and my kids college funds when SpaceX IPO and ride its 🚀 to the MOON!", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "I dont even know what to believe anymore. It's so fucking insane to imagine that Kanye would run, that it's almost a guarantee at this point. America is becoming an actual meme state.", "score": 1, "replies": []}, {"body": "I'm buying puts on tsla. Dirt cheap lottery tickets", "score": 1, "replies": []}, {"body": "I would like to publicly state if Kanye West (or Kim Kardashian) run for president in 2024 I will be voting for them.", "score": -4, "replies": [{"body": "No one cares", "score": 16, "replies": []}, {"body": "Ignoring the politics ... you might be delusional enough to risk the biggest bet on here with the biggest pay out. \n\nThis bet will be easy for you then since the money might already be going to him. Take whatever you are going to donate to him in a $GPS 18.5C and donate the full winnings to his campaign (max $2,800 directly to each candidate per election) and keep the rest. Or go all in with everything you have like Bernie bro's did with savings and student loans. If he wins a primary position you can donate up to $106.5k (Keep anything over Combined $109.4k) to the convention as an individual. \n\n$GPS will be his official presidential gear (similar to Official MAGA hats gear were for Trump). That will easily give you front row seats to the convention party if you contact them regarding your  significant  donation. Those political donations can be written off. \n\nOr he loses and you only lose your initial investment. Write it as a loss in taxes. Biden or Trump Admin will probably relax the tax burden for covid-relief for large capital losses In 2020. Good luck dude. Hope you get your Political moon landing. Finally, post pics to this place from convention floor. If he is running 3rd party like Green Party this will actually be really fucking likely that you can get a VIP spot. \n\nAll in. All in. All in. 🚀🚀🚀 🚀  🚀 \n\nLegal note: You should talk to an investment banker, psychologist, and a tax lawyer instead of listening to my advice. Don't sue me if you lose all your money and tendies since it's your own decision to show off", "score": 2, "replies": []}, {"body": "The amount of people who would vote for Kanye is too high, IMO.", "score": 3, "replies": []}]}]}
{"title": "$8000 no directional bias ER win!", "selftext": "https://preview.redd.it/62lzuypvgy851.png?width=1125&format=png&auto=webp&s=60444bf1485a7131bbca6a949cc3e2eca87615b1\n\nPosting this not to brag but to inform on the power of selling premium.\n\nAbove is $8000 Realized in a single day playing ER with no directional bias!\n\n&#x200B;\n\nIf any new traders have any questions feel free to pm me id love to help.", "id": "hlfrtg", "created_utc": 1593918668.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 31, "comments": [{"body": "Can you explain what spreads you were playing here and your timing for entry/exit and overall strategy if you don’t mind?", "score": 10, "replies": [{"body": "he sold two strangles\n\na great resource is CBOE's [printable workbook](http://www.cboe.com/learncenter/pdf/masteringoptionsstrategies.pdf)", "score": 12, "replies": [{"body": "To be clear, he **opened** two strangle positions (ie he bought one and he sold one - he didn’t sell two), right?", "score": 2, "replies": [{"body": "Correct tos wouldn't show 4 otherwise", "score": 2, "replies": [{"body": "Nah I sold 100 contracts of strangles and 10 contracts of straddles", "score": 4, "replies": [{"body": "nice, did you sell them right as the earnings call was happening, while watching the chart? i'm trying to imagine how you were so confident the price would not move too much", "score": 1, "replies": []}]}]}]}, {"body": "Wow, when did this come out? I've only seen that book they used to send when you first ack'd you know risks are involved with options. This looks great!", "score": 2, "replies": [{"body": "They don't send you this, they want you to lose", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "dis is de tru tru", "score": 2, "replies": []}]}]}, {"body": "Ah, makes more sense thanks. I was looking at it like an iron condor and confused by the p/l", "score": 1, "replies": []}]}]}, {"body": "Ya these kind of spreads are extremely risky if there's a big move in either direction you basically lose everything. If you do this it's highly recommended you don't sink all your capital in at once, because although writing options in the money often \"wins\" more often than buying them, you can still \"lose\" and it's all gone, just like FDs. TLDR spy 420c", "score": 14, "replies": [{"body": "Yup,  This is nothing, there are hedge funds that blow up their entire portfolios using this, pass..m", "score": 3, "replies": []}]}, {"body": "Still not paying you shit till you pay me.", "score": 6, "replies": []}, {"body": "BAN", "score": 5, "replies": []}, {"body": "looks like you did two short strangles. How did you choose CULP?", "score": 3, "replies": [{"body": "I PM'd this terd, he's just trying to get us to buy into some subscription service, all his gains are photoshopped, \n\nBAN", "score": 12, "replies": []}, {"body": "Data brother :)", "score": -12, "replies": [{"body": "“When both hands are clapped a sound is produced; listen to the sound of one hand clapping.”", "score": 5, "replies": []}, {"body": "BAN", "score": 1, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Gay!", "score": 1, "replies": []}]}]}]}]}, {"body": "What upcoming ER are you looking at playing?", "score": 2, "replies": []}, {"body": "teach me", "score": 2, "replies": []}, {"body": "can't tell from your screen shot, you sold an iron condor through earnings??? yeahhh good luck with that strategy", "score": 1, "replies": []}, {"body": "Even a blind squirrel can find a nut.  Good job, retard.  \n\nBut seriously, this is a retarted play I would expect to only find in WSB.  Enjoy them tendies!", "score": 1, "replies": []}, {"body": "Ban this fool for hocking his snake oil bullshit", "score": 1, "replies": []}, {"body": "don't pat yourself on the back after getting lucky\n\nalso iron flies suck, strangles are better.", "score": 1, "replies": [{"body": "LOL this was not an iron FLY  . I was short strangles and straddles , with a 10:1 ratio .", "score": 0, "replies": [{"body": "what? you shorted 10 strangles for every 1 short straddle? how many in total...when did you close?", "score": 0, "replies": [{"body": "That’s correct . 100 short strangles 10 short straddles , closed later in the day", "score": 0, "replies": []}]}]}]}]}
{"title": "Calls on TSLA", "selftext": "[removed]", "id": "hlt6t7", "created_utc": 1593979529.0, "score": 177, "upvote_ratio": 0.94, "num_comments": 39, "comments": [{"body": "Buying call at 9:30 tomorrow selling at 10:40 will be swimming in tendies", "score": 51, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "That’s lowest volume time hell no", "score": 10, "replies": [{"body": "That’s very smart of you. New here?", "score": 5, "replies": []}]}]}]}, {"body": "Buying puts against a founder/CEO with the hottest products in both markets he's in, who can do shit like this and waltz into the S&P500 while telling the SEC to suck his cock is as good as literally setting money on fire.", "score": 30, "replies": [{"body": "Well, the shit sold out in 4 minutes. So...Q2&Q3 profits secured? \n\nU MAD?", "score": 3, "replies": []}]}, {"body": "his shop is powered by $SHOP\n\n$SHOP 2000C", "score": 82, "replies": [{"body": "If they take $PYPL as payment  \n$PYPL 200C", "score": 7, "replies": [{"body": "Just buy calls on all of them.", "score": 3, "replies": []}]}]}, {"body": "Everything is selling at Tesla like hotcakes. Doesn't matter if it's a bubble or meme stock. It only goes up and it makes me money", "score": 28, "replies": []}, {"body": "Holy fuck this guy is more autistic than we thought", "score": 38, "replies": []}, {"body": "Lmfaooo and they only come in the color red", "score": 10, "replies": []}, {"body": "This is the shit that will secure a profit in Q3 as well.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Couldn't figure out how to buy. Price didn't show up. Are they really 69.420?", "score": 3, "replies": [{"body": "[yup](https://imgur.com/a/qce2GN1)", "score": 3, "replies": [{"body": "Think I'll get a good roi on these?\nAlso, name checks out", "score": 2, "replies": [{"body": "Well if you keep the #1 law in mind you’ll be ok", "score": 1, "replies": []}]}]}, {"body": "thats about 70$ not 70k.", "score": 2, "replies": [{"body": "europeans use . instead of , for separating 3 digits. so you could see how it would be confusing.", "score": 1, "replies": []}]}]}]}, {"body": "Tsla 5000 eom. Elon is way to positive on twitter rn", "score": 6, "replies": [{"body": "Too* moron", "score": 2, "replies": []}]}, {"body": "What if he is selling shorts to give us all a hint of what to do...just saying, maybe it is a secret message....", "score": 7, "replies": [{"body": "My god. I can’t believe I didn’t see it! Thank you. Knowing Elon it has definitely a symbolic meaning.", "score": 5, "replies": [{"body": "Haha, trust me, I am the biggest bull in this market, however, its just extremely weird and weird timing.", "score": 2, "replies": []}]}, {"body": "He’s telling us the price is too high through short shorts this time", "score": 1, "replies": [{"body": "Wait. Maybe they're short shorts because we need to short the shorts...", "score": 1, "replies": []}]}]}, {"body": "Is the website down or something?", "score": 3, "replies": []}, {"body": "Elon where’s the gold at ?", "score": 3, "replies": []}, {"body": "Lowkey love the merch ... perhaps I’ll become a Tesla hype beast", "score": 3, "replies": []}, {"body": "Short tsla above 1250 thank me later", "score": 12, "replies": [{"body": "[deleted]", "score": 71, "replies": [{"body": "i shorted TSLA back in the 4th of February right when it crashed when most people lost money FOMO'ing", "score": 3, "replies": []}, {"body": "They never learn, do they?", "score": 1, "replies": []}]}]}, {"body": "Fucking hell, I'm a Tesla short and I so want to buy them! Resupply this shit Elon!", "score": 2, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "Sexy Elon Customer", "score": 1, "replies": []}, {"body": "SELL ELONS CLOTHES-SEC", "score": 1, "replies": []}, {"body": "Funding Secured.", "score": 1, "replies": []}, {"body": "Did he have one of Epstein’s young girls model the shorts for him or what?", "score": -15, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "SEC", "score": 1, "replies": []}]}]}]}
