{"title": "SPRT - share price increase is unavoidable", "selftext": "**INTRO**\n\nThe upcoming merger of Support.com and Greenidge in the 3rd quarter must, according to all rules of the market, lead to a massive price increase.\n\nIn this DD I will show you why this is the case, based on the company data, the annual reports and the balance sheets of the companies. All my theses I will provide with the original sources of the companies, so that all data can be checked/confirmed by yourself.\n\nI will try to keep it short, but still want to give you a good overall view.\n\n&#x200B;\n\n&#x200B;\n\n**COMPANY PROFILES**\n\nThis merger involves the two companies Support.com and Greenidge. Below is a brief overview.\n\nSupport.com, as the name suggests, provides technical and customer support services. They are currently expanding into on-demand fintech and cryptocurrency support to meet the growing demand in the segment.\n\nFittingly, they have agreed to merge with Greenigde. This merger is not a rumor or in talks, but is already final and will be executed in Q3. \\[1\\]\n\nGreenidge is a bitcoin miner that operates its own green power plant in Upstate New York. This is a special feature, because green energy is becoming more and more important in the crypto sector and mining, the process of \"creating\" bitcoin, is based on computationally intensive processes that require a lot of energy. Through their own green gas power plant, they can operate very profitably, and are far ahead of the competition.\n\nThrough the merger, Greenidge will be publicly tradable via Support.com.\n\n&#x200B;\n\n&#x200B;\n\n**WHY SHOULD THE SHARE PRICE RISE?**\n\nCurrently the market cap of SPRT is about $100M USD, after the merger within the next months (no exact date yet, only Q3 is known \\[1\\]), the market cap will be about $1.6B, if we assume a price of $5 USD per share.\n\nThis is based on this formula:\n\n*5 USD (share price) \\* 38M (outstanding shares) / 0.12388 (merge ratio) = \\~1.6B (market cap after merger)*\n\n&#x200B;\n\nSince the merger has been finally decided but not executed yet, the current ticker SPRT only considers support.com. Hence the current low market cap.\n\n&#x200B;\n\nTherefore, for the time being, we only take a closer look at support's assets.\n\n&#x200B;\n\n&#x200B;\n\n**SUPPORT AS A SOLID BASE**\n\nSupport.com currently holds 40M USD net cash. Net cash is cash that sits in the company after all deductions. After taxes, expenses and liabilities. Pure earned assets.\n\nIn addition, there are of course other assets such as real estate, hardware and the like that currently come to a value of 39M USD.\n\n&#x200B;\n\n|NET CASH|TOTAL ASSETS|TOTAL VALUE|\n|:-|:-|:-|\n|40M USD|39M USD|**79M USD**|\n\n&#x200B;\n\nSo if you were to liquidate the company now, you could realize cash withdrawals and realizations of 79M USD \\[2\\]. That doesn't take into account customer data, business relationships, future profits, existing contracts, etc. pp. All these things that actually contribute to the value of a company.\n\n# As a reminder, the market cap is ~100M USD. That means just the pure assets of just that one company is almost identical to the current valuation. And that doesn't even include the value of Greenidge.\n\n&#x200B;\n\n&#x200B;\n\nIf you think I have a point here, just wait and see. Because the real kicker is what Greenidge brings to the table.\n\n&#x200B;\n\n&#x200B;\n\n**GREENIDGE AS A MULTIPLIER**\n\nGreenidge can't be traded publicly yet (hence the merger) and is therefore still grossly undervalued compared to its direct competitors (e.g. RIOT). The nice thing is, you can compare these values very accurate because mining is really only about the hashrate. With this you can see how profitable a miner is running and where its market value is.\n\n&#x200B;\n\nThe hashrate of RIOT (the direct competitor) is 1.1 EH/s with 43MW and the expected output of SPRT should be 41MW and at the end of the year 45MW.\n\n&#x200B;\n\nWhy should be and not is? There was a ban in New York State on power plants being used for bitcoin mining. This ban has now been lifted and 100% of the juice can go to mining. \\[3\\]\n\n&#x200B;\n\nThat means Greenidge's performance is really ramping up lately. I did a detailed comparison of Greenidge with its two main competitors MARA and RIOT and researched and compared all the data by hand. Please check out this thread for that [https://www.reddit.com/r/pennystocks/comments/o0l0ra/i\\_compared\\_sprt\\_with\\_its\\_two\\_main\\_competitors/](https://www.reddit.com/r/pennystocks/comments/o0l0ra/i_compared_sprt_with_its_two_main_competitors/)\n\n&#x200B;\n\nHere is just the table that shows the core values in comparison\n\n&#x200B;\n\n&#x200B;\n\n|STOCK|Marathon Digital Holding (MARA)|Riot Blockchain Inc. (RIOT)|Greenidge / Support  (SPRT)|\n|:-|:-|:-|:-|\n|**TRADING AT**|\\~$30 USD|\\~$35 USD|\\~$4 USD|\n|**MARKET CAP**|$2.9B USD|$3.35B USD|$1.6B USD (combined)|\n|**HASH RATE**|1.46 EH/s|1 EH/s|1.1 EH/s \\[B\\]|\n|**MINING COST**|$28 MWh|unknown \\[A\\]|$22 MWh|\n|**REVENUE 2020**|$4.4M USD|$3.9M USD|$12M \\[C\\]|\n|**MINTED BTC 2020**|254 BTC \\[D\\]|1,005 BTC|1,186 BTC|\n|**SOURCE**|[https://ir.marathondh.com/news-events/press-releases/detail/1240/marathon-reports-first-quarter-2021-results](https://ir.marathondh.com/news-events/press-releases/detail/1240/marathon-reports-first-quarter-2021-results)|[https://www.riotblockchain.com/news-media/press-releases/detail/101/riot-blockchain-announces-financial-highlights-for-the](https://www.riotblockchain.com/news-media/press-releases/detail/101/riot-blockchain-announces-financial-highlights-for-the)|[https://corporate.support.com/wp-content/uploads/2021/03/Greenidge-SPRT-Merger-Release-FINAL.pdf](https://corporate.support.com/wp-content/uploads/2021/03/Greenidge-SPRT-Merger-Release-FINAL.pdf)|\n\n\\[A\\] no data found for that but they  relocated to Massena, New York to reduce costs. The good news -  Greenridges Power Plant is already located in NY.\n\n\\[B\\] will increase to 2.6 EH/s in 2022 (expansion is already fully funded)\n\n\\[C\\]  this is only Greenidge though. Combined with support.com 2020 revenue  of $44M it totals to $56M. The net cash of both companies combined is  $70M USD. Net cash!!\n\n\\[D\\] but they bought 4,812.66 BTC end of 2020 for a total of $150M USD. So they are holding a lot of BTC but did not mined it.\n\n&#x200B;\n\nAs I said, please check out the link to my detailed comparison ([https://www.reddit.com/r/pennystocks/comments/o0l0ra/i\\_compared\\_sprt\\_with\\_its\\_two\\_main\\_competitors/](https://www.reddit.com/r/pennystocks/comments/o0l0ra/i_compared_sprt_with_its_two_main_competitors/)) but from this data alone you can see that Greenidge is actually superior to its competitors in every aspect, mines more efficiently, generates more bitcoins and even makes more profit, but still only reaches half of the market cap.\n\n&#x200B;\n\nIf we now take into account the current valuation of Support plus the value Greenidge brings to the table, I think the market cap would have to at least double to be valued similarly to its direct competitors. Accordingly, the share price would have to rise from 5 USD to 10 USD.\n\n&#x200B;\n\n&#x200B;\n\n[with a similar market cap close to the competition, the price rises to at least 10 USD](https://preview.redd.it/uy7nhrwhiz571.png?width=600&format=png&auto=webp&s=4fe3be6ee165b0d837d5d737ee64276a3401c067)\n\n**POTENTIAL**\n\nI don't want to scare you off by saying that this price is even too low but my honest personal opinion is that this is even too conservatively calculated.\n\nGreenidge will be the first US listed miner with its own 100% ecological green-energy power plant \\[4\\]. Green energy is an ever-burgeoning topic in the crypto discussion and is becoming more and more important. Elon Musk \\[5\\] brought the topic up again a few days ago when he announced that Tesla will accept BTC again if 50% of the miners are green. Greenidge is completely CO2 neutral \\[6\\].\n\nBoth companies are still growing (Greenidge more than Support) and have a nice roadmap with many interesting points. However, in this analysis, I have not considered the future prospects. If you take into account that Greenidge is still expanding its power plant (so it can further extend its lead in energy costs and capacity) and plans to expand its hashrate to 2.6 EH/s by 2022, you can see where the journey is going.\n\n&#x200B;\n\n[the roadmap shows there is great ambition](https://preview.redd.it/t5b35npqiz571.png?width=640&format=png&auto=webp&s=ffb81ebcca94694dede4b01dee0f7c3f0fd059f2)\n\nIf one then also assumes that Bitcoin prices will tend to rise, then of course the revenue will rise even further.\n\nAs I said, it's important to me that you understand that all of these future projections are not included in the above calculation at all. There we are talking about the financial statements and balance sheets of the companies. All data is based on the real data and is not fantasy dollars, rumors or possible outlooks but only facts.\n\n&#x200B;\n\n&#x200B;\n\n**CONCLUSION**\n\nI am bullish. That's for sure. But I'm not connected to the companies or anything. I didn't know either company before doing my research. I formed my opinion independently and spent days going through press releases, financial statements and balance sheets to research all the data directly at the source.\n\nI have been invested for a few days, but I am not a financial expert. I share with you my findings because I am personally convinced of them. I invite you to discuss and I have linked you some relevant sources to verify what I wrote and to make your own decisions.\n\nIn my opinion, the share price has to go up. All the facts are in favor of it. Why it has not exploded yet has two reasons in my opinion.\n\n1. no hype\n2. the stock is massively shorted by institutions. More than almost any other stock.\n\n&#x200B;\n\n&#x200B;\n\n[See this screenshots with filters visible to rebuild the view on Yahoo for yourself. ](https://preview.redd.it/cd8opv7wiz571.png?width=1531&format=png&auto=webp&s=eb6dff9b522cf9edabb075956c8b7a01d178ae5e)\n\n&#x200B;\n\nLook at how much the short float increased in the last weeks. This stock is artificially held down. Maybe until the merger took place, I don't know yet but I am already investigating it and start to see a pattern. Again, you can look at the short float increase at yahoo or any other tool.\n\n&#x200B;\n\n[pay special attention to the red line that is showing the rising short &#37; of float](https://preview.redd.it/27mr3uayiz571.png?width=1533&format=png&auto=webp&s=172b38cad340737bead8527abcee068d9a6a0e80)\n\n&#x200B;\n\nWithin the next days I will make a dedicated post about the short situation of this stock but again, that is not what this is about. In this DD I only focused on hard facts and validation.\n\n&#x200B;\n\nI look forward to discuss with you!\n\n&#x200B;\n\n**SOURCES**\n\n\\[1\\] Merger Agreement [https://www.sec.gov/Archives/edgar/data/1104855/000119312521091327/d131914d425.htm](https://www.sec.gov/Archives/edgar/data/1104855/000119312521091327/d131914d425.htm)\n\n\\[2\\] Net Cash / Assets Support [https://www.investing.com/equities/support.com-financial-summary](https://www.investing.com/equities/support.com-financial-summary)\n\n\\[3\\] Crypto Mining Bill NY [https://www.coindesk.com/new-york-crypto-mining-bill-dies-in-assembly-after-passing-state-senate](https://www.coindesk.com/new-york-crypto-mining-bill-dies-in-assembly-after-passing-state-senate)\n\n\\[4\\] official merger announcement [https://corporate.support.com/wp-content/uploads/2021/03/Greenidge-SPRT-Merger-Announcement-032221-FINAL.pdf](https://corporate.support.com/wp-content/uploads/2021/03/Greenidge-SPRT-Merger-Announcement-032221-FINAL.pdf)\n\n\\[5\\] Elon Musk Green-Energy [https://www.businessinsider.com/elon-musk-bitcoin-tesla-payment-green-energy-environment-2021-6](https://www.businessinsider.com/elon-musk-bitcoin-tesla-payment-green-energy-environment-2021-6)\n\n\\[6\\] Greenidge carbon neutral [https://www.prnewswire.com/news-releases/greenidge-generation-bitcoin-mining-operation-to-be-carbon-neutral-in-2021-and-beyond-301291782.html](https://www.prnewswire.com/news-releases/greenidge-generation-bitcoin-mining-operation-to-be-carbon-neutral-in-2021-and-beyond-301291782.html)", "id": "o2k7xt", "created_utc": 1624004747.0, "score": 69, "upvote_ratio": 0.82, "num_comments": 46, "comments": [{"body": "Soooo... stellar long term but short attack hell in the meantime which is killing my jul 18 calls.\n\nIs there anyone that can spread some viral memes to increase exposure .. or so. E kind of stunt that lands on CNN..\n\nI think a little creativity is needed cover those who like the stock now\n\nI'm one of them", "score": 13, "replies": []}, {"body": "Good DD", "score": 11, "replies": [{"body": "Glad you like it", "score": 6, "replies": []}]}, {"body": "Just loaded at 4.01 today hope it works out. Thanks", "score": 6, "replies": [{"body": "Nice GO SPRT!", "score": 4, "replies": []}]}, {"body": "Added again at 4.02", "score": 5, "replies": []}, {"body": "I agree hope the DD comes to fruition. Over 2k in shares and 40 calls expiring in December", "score": 6, "replies": [{"body": "Are you rich?", "score": 1, "replies": []}]}, {"body": "Only reason not to be in SPRT right now is if you hate money.  I also reckon the merger is going to happen sooner than we think (maybe July/august instead of September).  Insider’s have been buying up a load of stock in the last few days (Rook Caroline CEO exercised 2083 units of stock just this week).", "score": 5, "replies": []}, {"body": "I'm sorry. I can only give you one upvote. I have already owned some SPRT. I like them for fundamentally strong and I hope they can better perform after merging. I don't know why shorties like keeping it price artificially low, I'll try to add some more if it's continue to drop today. Buy the dip and averaging down. The price should be above MARA trading price.", "score": 5, "replies": [{"body": "There is always the option to award 🥇 .. just kidding. I am already looking deeper into the shorting and there might be a pattern. I will do a follow up on that soon.", "score": 5, "replies": [{"body": "I look forward to your great post again.", "score": 3, "replies": []}]}]}, {"body": "So what's your call on stock price approximately after q3?", "score": 5, "replies": [{"body": "I can only tell you that I think \\~$10 USD would be the bottom of a fair validation.", "score": 5, "replies": []}]}, {"body": "6000 shares and holding", "score": 5, "replies": []}, {"body": "Next profit I close is going into buying more SPRT shares. LFG boys!", "score": 5, "replies": []}, {"body": "Good 👍", "score": 5, "replies": []}, {"body": "Cool well I have calls expiring today if they can quit fuckin around and get after it already, that'd be great.", "score": 3, "replies": [{"body": "Don't buy options. Just hold shares. This stock is heavily manipulated", "score": 6, "replies": [{"body": "I have 3 contracts for $10 calls expiring today I'd like to see something from.", "score": 5, "replies": []}, {"body": "Can i ask why please?", "score": 2, "replies": []}]}]}, {"body": "There's something I don't understand. If the company goes from 100m market cap to 1.6b market cap as you imply, doesn't that mean there would be 10x+ in returns from the investment post merger? Yet, you only detail that the stock will run up around double, from 4$ to 10$. I'm not an expert in mergers, so not sure how this works.", "score": 4, "replies": [{"body": "There will also be more shares", "score": 2, "replies": []}, {"body": "Oh, I just see your comment now. Sorry for leaving you hanging for so long.\n\nYou need to take two share prices into consideration.\n\n1. share price of SPRT\n2. share price of GREE (after merger)\n\nThe $4 to $10 increase is for the SPRT share price. But whatever the SPRT share price is divided by the merger ratio, will become the GREE price when the merger happens.\n\nFor example, if the share price of SPRT is 5 USD and the ratio is 0.116 then GREE will be 5/0.166 = 43 USD (the final exchange rate will be calculated using a ten-day volume-weighted average trading price).\n\nIf you now look at the calculation I did in the DD you see that this, multiplied with the outstanding shares, will become the market cap post merger.\n\n5 USD (share price) \\* 38M (outstanding shares) / 0.12388 (merge ratio) = \\~1.6B (market cap after merger)", "score": 1, "replies": []}]}, {"body": "What are your positions?", "score": 5, "replies": [{"body": "2k af 4.10c avg", "score": 4, "replies": [{"body": "Nice 400 @ 4.08 since 2 weeks ago", "score": 6, "replies": []}]}]}, {"body": "Nice dip below 4 there", "score": 4, "replies": []}, {"body": "I just love how they released “flat line hedge fund sentiment” and a “lawsuit” before options expire and when there were no shares available for them to cover a 45% short interest amount. Lmao this is ridiculous. Where is the SEC in all of this? \n\nDid you guys even watch the CNBC interview with David Lauer last night (former citadel trade advisor)? They randomly pulled into 2 guys who asked entrapment questions to use to sue him. The market is bleeding because they want retail to fail. They’re already buying our home and renting it back to us. Stagnant wages. Now they try to manipulate our “investments.” BS man", "score": 5, "replies": []}, {"body": "This one looks really good with a quick glance. I'll look into it a little further because I'm opening a position today and this one will certainly be high on my list.", "score": 5, "replies": [{"body": "keep us updated", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Thank you. I really have no idea but I expect it to be later rather than sooner. Personally I want to hold the stock a bit longer anyway, so I am pretty patient but of course I cant wait to see the liftoff as soon as the date goes public.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Of course I will act when opportunities arise but right now I plan to hold through even after the merger happened. Yes, I am personally looking forward to 2022 and ongoing because I also expect btc to rise and if greenidge is able to stick to its roadmap and the power plant expansion than they will continue to mint more bitcoins with lower costs then the competitors.   \n\n\nI am sure you could sell on the merger date with a great profit but I am also in for the longer term.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I am bullish crypto since years and nothing changed from the fundamentals there. The need for digital assets is unchanged and the technology is evolving steadily. \n\nIts neither the store of value nor the easy form of payment yet but if you look at the rising costs of traditional banks, negative interest rates and the less trusting in institutions it seems like a logical conclusion. \n\nSmart Contracts that reduce the middle man, payments that include double-entry accounting by nature .. there are a lot of reasons why crypto currencies could become more and more important. \n\nAnd at the very least, it is a speculative asset that is here to stay.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Nice DD. I'll buy some. Shares only.", "score": 2, "replies": [{"body": "You have a great entry point right now. Just dont get afraid of the daily reds. Look at the weekly charts and wait for the merger date. It will lift up then.", "score": 1, "replies": [{"body": "I'll wait for the daily SMA50 at 3.40", "score": 1, "replies": []}]}]}, {"body": "Good stuff! Seems like we're both on the ball with our SPRT DD.", "score": 2, "replies": []}, {"body": "Solid", "score": 2, "replies": []}, {"body": "Have you looked into Argo blockchain at all", "score": 0, "replies": [{"body": "No, I compared SPRT with two other competitors but maybe I'll do a follow up. Here is the comparison I did https://www.reddit.com/r/pennystocks/comments/o0l0ra/i\\_compared\\_sprt\\_with\\_its\\_two\\_main\\_competitors/", "score": 3, "replies": []}]}, {"body": "Do you think I should exit my $5 call for sprt expiring mid July?\n\nIt is a bit too close of the expiration date I feel like but at the same time I feel that the stock could explode next week", "score": 0, "replies": [{"body": "If only I knew. They will announce the exact merger date in Q3 which will start of course in July. Once the date is known, it will pump. Personally, I don't think it will happen in July but we cant tell.", "score": 2, "replies": [{"body": "I kinda need it in July 🌡️🌡️🌡️🌡️", "score": 2, "replies": []}]}]}, {"body": "MJFCOIN TOOO THE MOON BAYYYBAYYY $$$$$$$$", "score": 0, "replies": []}, {"body": "r/SPRT I sure am picking up another 10,000 shares today. r/SPRT is looking like r/KOSSstock which ran from roughly $4 to $125 on a short squeeze. r/SPRT \\#1 listed on this short squeeze article. https://m.benzinga.com/article/21981135", "score": 1, "replies": []}]}
{"title": "The s and p 500 going up every day. Your thoughts?", "selftext": "Few weeks ago people were saying every thing will crash and they will sell all their index funds. Since the last few days the s and p 500 has been continuously going up. \n\nDo you think now the fear of recession/inflation is gone? Or do you think there is still a big chance we could crash and we should proceed with caution?", "id": "o2j4sx", "created_utc": 1624000194.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 47, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "It’s now down 3 days in a a row", "score": 5, "replies": []}, {"body": "The S&P has been down all week. What are you watching?", "score": 4, "replies": [{"body": "And it's been flat for a month prior as well.", "score": 2, "replies": []}]}, {"body": "look again today", "score": 8, "replies": []}, {"body": "General market rule; when everyone knows something is going to happen it usually doesn’t.", "score": 15, "replies": [{"body": "But almost everyone is still bullish on the stock market. Does that mean it's going to go down? I'm confused.", "score": 2, "replies": [{"body": "Some are bullish, some are bearish. But no one truly knows what will happen and when.", "score": 1, "replies": []}, {"body": "Retails can be bullish, but the smart money who actually controls the market.", "score": -1, "replies": []}]}, {"body": "“Chart will move to the right” \n\nCheckmate", "score": 1, "replies": [{"body": "Well fuck.\n\nNow every single trade will stop Monday.\n\nFrozen at bid ask spreads that will shake the strongest of the Gods", "score": 2, "replies": []}]}]}, {"body": "I don’t think we will crash but we might see a pullback. There are always people talking about a crash but it rarely happens and if it does most of the time it will quickly bounce back up but i think you should wait a bit to buy in the or options on the S&P 500 we are almost at ATH and you should never buy in at ATH. There will always be another Pullback or Red day. One rule that really helps me not to fomo in to some play is „The Stock market is a device for transferring  money from the inpatient to the patient“ -Warren Buffet.", "score": 9, "replies": [{"body": "The S&P has been at an all time high most of the time. It has always trends up. Chasing a couple percent differently because you think there might be a pullback is silly.", "score": 7, "replies": []}, {"body": "Who cares. Jus buy in whenever you have cash if ur a long term invester", "score": 5, "replies": []}, {"body": "Today's ATH, is next week's pullback, so why not just buy now?", "score": 4, "replies": [{"body": "Yeah for most people that would be the better choice but i play around with options a lot so i always wait for a dip.", "score": 1, "replies": []}]}, {"body": "What is ATH?", "score": 2, "replies": [{"body": "All time high", "score": 2, "replies": [{"body": "Wow lmao thank you", "score": 2, "replies": []}]}]}]}, {"body": "No matter what anyone says. The markets have always risen due to inflation over decades. Do not let the interest of traders change this hard truth. Which is why assets in general tend to rise with inflation over time.", "score": 2, "replies": []}, {"body": "Stocks go up", "score": 3, "replies": [{"body": "Yes but a couple of weeks ago people were saying \"inflation..feds increasing rates...crash... I am selling everything\"\n\nIs that fear gone now for some reason? Did I miss something?", "score": -1, "replies": [{"body": "Those are gay bears", "score": 5, "replies": [{"body": "Lots of recent loss porn still putting against the market which is already on the next hole teeing off", "score": 1, "replies": []}]}, {"body": "Yeah, a lot of people are morons. Especially on tbe internet.", "score": 2, "replies": []}, {"body": "It's almost as if we're not a hivemind.", "score": 1, "replies": []}]}]}, {"body": "[This is a 90-year history chart of the S&P500 in log scale](https://imgur.com/a/gitcawY). Yes, the crashes are scary, but notice the main trend? It goes up much more frequently, and with a net upward trend in value. If you just buy and hold, you get all the bad days, but you also get every good day, and that tends to be better in the long run. You only need 4 or so holdings to have a great diversification, depending on your risk preference. It all depends on what you're trying to do.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "This statement is dumb.\n\n„Bet against the US”\nIt has nothing to do with betting against the US, its about buying something overvalued. And because of people like you its overvalued in the first place, because newbies think that the price is always justified", "score": 1, "replies": [{"body": "So you blame newbies for it being overvalued? In the grand scheme of things, newbie retail money is barely a drop in the stock market’s bucket.", "score": 1, "replies": []}]}, {"body": "I 'll post what I posted in another comment.\n\nA couple of weeks ago people were saying \"inflation..feds increasing rates...crash... I am selling everything\"\n\nIs that fear gone now for some reason? Did I miss something?", "score": -1, "replies": [{"body": "These people will always exist in a bull market.", "score": 0, "replies": []}, {"body": "Those people are still afraid. Everybody else is making money", "score": 0, "replies": []}]}]}, {"body": "Are you new here? People always talk about how things are going to crash, but their predictions never comes true, because they don’t have a clue about what they are talking about.\n\nCould things crash tomorrow? Sure, but I don’t know. Do I think the risks are higher today? No, but I don’t know and I don’t care.\n\nAll I can do is to invest as normal, and frankly, I hope things comes down so I can buy at a higher yield.", "score": 0, "replies": [{"body": "Never come true? Things crash all the time. You just can't predict when. It could be another ten years from now or tomorrow. But if it's ten years from now you miss out on all the gains the market makes by not investing today.", "score": 3, "replies": [{"body": "I literally said that. Didn’t you read further than the first sentence?", "score": 4, "replies": []}]}, {"body": "I started reading the sub during corona times so yes I am new but the talks of crash made sense to me.", "score": 1, "replies": [{"body": "It usually does. You are going to experience this a lot.", "score": 1, "replies": []}]}, {"body": "Do you consider it investing when you buy a stock after reading a post on reddit saying it was gonna gamma storm and MOASS?", "score": -4, "replies": []}]}, {"body": "Even if you bought at the top and everything crashed to hell, you'd still bounce back eventually. \n\nEven if you did that 50 times, you'd still come out of it fine. Unless the world collapses, you'll be fine. \n\nIn the long term, crashes don't really matter. They really only affect you if you need the money now, like people in their retirement age.", "score": 0, "replies": [{"body": "I agree with your logic but when it comes to stocks there is a survivor bias. If you invest in companies like Google, Apple, etc (not just tech but \"good\" companies), you're right. If you invest in ETFs or some other index, you're right.\n\nBut there are a lot of companies that went bust. NorTel is my favorite example. High flying one moment and a generation later, no one even knows what it was until they Google it. I feel like a lot of these tech companies that are fast money now won't last.", "score": 1, "replies": [{"body": "Oh I was talking about investing in the index itself. Like buying SPY.", "score": 1, "replies": []}]}]}, {"body": "Im hoping Ford goes back to 11$ so people will realize that the stock market is not Fortnite. Too many overvalued stocks going up because people think EVs are Poggers", "score": 0, "replies": [{"body": "We are transitioning into a new world. In 10 years a lot of these companies will fail to adapt and some of the companies we call overvalued today will outpace these boomer stocks that fail to innovate.\n\nGm", "score": -1, "replies": [{"body": "Who's going to break it to him?", "score": 1, "replies": []}]}]}, {"body": "Thing is....your on a sub called ‘stocks’ which is broad and includes short term traders, medium trading types, long term holders, and anywhere in between. What one type may call crash is not what the other might. I would call the recent pivot out of speculative stocks a market crash of sorts even though the broad market went up. \n\nAdd to this that many many people here started like a year ago and don’t have experience of decades of people fearing crashes.", "score": 1, "replies": []}, {"body": "Bearish now", "score": 1, "replies": []}, {"body": "Cnbc and the people parroting their talking points are often wrong, you sound surprised.", "score": 1, "replies": []}]}
{"title": "69-tweet thread on Tesla’s Q2 forecast by @ICannot_Enough", "selftext": "", "id": "o2kl51", "created_utc": 1624006289.0, "score": 192, "upvote_ratio": 0.98, "num_comments": 40, "comments": [{"body": "A 10x GAAP net income YoY, nice", "score": 36, "replies": []}, {"body": "we are at the bottom of the hockey stick/s-curve, 2022/23 will see enormous growth.", "score": 24, "replies": [{"body": "Due obviously to Berlin and Austin ramp. And Shanghai phase 3, whatever it ends up making.\n\nTruly glorious.\n\nIt won't be long until Tesla climbs the ladder of vehicles sold per year, passing one legacy company after another. Sometimes it'll be 2-3 places at a time.", "score": 26, "replies": [{"body": "This is what I'm most looking forward to. And it will happen *so* quickly, too. Can't wait to see the company in 5 years.", "score": 8, "replies": []}]}, {"body": "Tesla guided to > 50%.  So most would assume possibly 60-70% this year and next.\n\nBut the plan is 100GWh of internal cell production next year, hitting a rate of 200 GWh by the end of the year ON TOP of doubling orders from suppliers.\n\nI know several Youtubers are planning as much as 100% growth this year and the next two years. That would be truly awesome.   It would mean that Tesla’s unprecedented 50% annual growth rate for any company in a large capital intensity intensive industry ever, is about to be nearly doubled for at least a short time!\n\nOr that > 50% was effectively sandbagging:-)\n\nTrying so hard not to get my hopes up.", "score": 5, "replies": [{"body": "Did you listen to the calls? Yes the reports say 50%, but Elon and Zach clearly guided higher. They said stuff like \"for this year and next year we expect it to be considerably higher than that\" (paraphrased from memory).", "score": 4, "replies": [{"body": "60%-70% is by any definition considerably higher than 50%.  That’s 20%-40% higher.  100% growth is gobsmackingly higher:-)", "score": 2, "replies": []}]}]}]}, {"body": "A long but informative [thread](https://twitter.com/icannot_enough/status/1404122391027060736?s=21)\n\nMy [favorite](https://twitter.com/icannot_enough/status/1404126255650328579?s=21)\n\nLooks like they’re doing a quarterly forecast on [Clubhouse](https://twitter.com/ajtourville/status/1405216417050411020?s=21) on Saturday 6/19 at 8pm EST", "score": 20, "replies": []}, {"body": "Plaid will start to accelerate and cybertruck news coming.", "score": 23, "replies": [{"body": "Ludicrous speed of revenue and profit growth", "score": 7, "replies": []}]}, {"body": "Is this saying $3.93 earnings per share in 4Q?  So that if price is still 600, forward P/E would be 50?  That puts tsla on same level as AMZN", "score": 13, "replies": [{"body": "Yes, but he's counting with a one time $1.6B favorability hitting on Q4 (supposedly) based on accumulated loses. He explains it here: [https://youtu.be/202NJA693sA?t=316](https://youtu.be/202NJA693sA?t=316)\n\nHe also says that because it'll be a one off, it'll be discounted by analysts.", "score": 2, "replies": [{"body": "Agree, as it should be discounted. However you and I both know headlines will be something to the effect \"Tesla reports $3.93 EPS with $1.6 tax allowance and vehicle credits.\" Followed by a myriad of \"Is Tesla really profitable,\"...  \"Looking under an empty hood of Tesla Q4 earnings\".... instead of what they're doing right.", "score": 2, "replies": []}]}, {"body": "Sure is. I think his gross margins might be too high for the rest of the year and I also don't think they will achieve that. Significant tooling costs are expected in Q3 and Q4 for the new factories", "score": 2, "replies": []}, {"body": "That includes one time income from Tesla getting credit for years of losses. I believe it is called a deferred tax allowance.  Wall Street will mostly back that out. It will however help the PE ratio, look better over the long run. Just do not expect it to provide an immediate pop to the stock.", "score": 2, "replies": []}]}, {"body": "Nice", "score": 6, "replies": []}, {"body": "How does he all of the sudden jump from 22% margins to 30%?", "score": 12, "replies": [{"body": "Ramping of Model S to 1,000 per week. Those are better margin vehicles.\n\nAnd the continue production scale of the Y as getting up Berlin and Austin at the end of the year.\n\nEDIT: His Q2 gross margin estimate is probably too high.", "score": 15, "replies": [{"body": "None of it applies really to Q2 to that extent", "score": 5, "replies": [{"body": "2020 Q3 Margin was 24%, when S/X production was in full swing. Newer one is much higher ASP. And with the refresh, demand is much higher and s/x production should become a bigger part of the production mix vs in 2020 when it was winding down. I agree with you, tho, I think 30% margin for Q3 is doable, but I am not so sure about Q2. Mayhaps…", "score": 4, "replies": []}, {"body": "He had an interview with Warren. He went into great detail explaining his sheets, but I’m sure he got frustrated as Warren kept interrupting him and going off on tangents. His explanation for the very high gross margin in Q2, is that China made vehicles are so much cheaper, and it’s gonna really bring down costs as they take up a larger percentage of the sales.  Also Q1 had some hits to the gross margin, from retooling the model S&X lines.", "score": 3, "replies": [{"body": "Was that interview on YouTube?", "score": 1, "replies": [{"body": "https://youtu.be/202NJA693sA", "score": 2, "replies": []}]}]}]}]}, {"body": "Some factors that could increase Q2 margins (haven't checked the spreadsheets in the later tweets):\n\n* S deliveries\n* more China Model Ys\n* smaller fraction deferred FSD revenue (if FSD beta happens in Q2)\n* price increases on M3\n* reduced cost with removed radar / lumbar", "score": 5, "replies": []}, {"body": "A lot of China made Model 3s were sold at European and Australian prices this quarter", "score": 3, "replies": [{"body": "There's import tariffs and transport costs to that as well", "score": 1, "replies": []}]}]}, {"body": "Fantastic Work.\nHow can I express gratitude to James? Does anyone knows if he has a Patreon account or similar?", "score": 9, "replies": [{"body": "he's probably been long Tesla before all the cool kids were doing it, so he's probably richer than you or me", "score": 1, "replies": []}]}, {"body": "Lets see that parabolic log function in 2022-23. \n\nEveryone in Europe no longer wants to pay $7.00/gallon. This is going to be startling.", "score": 4, "replies": []}, {"body": "IMO 218 000 deliveries in Q2 is a little bit too high. I am bullish and I still expect something more like 200K. Production and ramp up is not magic, especially during chip and other supply shortages.", "score": 6, "replies": []}, {"body": "Bullish 🔥🔥🔥!", "score": 2, "replies": []}, {"body": "So... What's his price target long term ?", "score": 2, "replies": [{"body": "Over 9000", "score": 2, "replies": []}, {"body": "Lots?", "score": 1, "replies": []}]}, {"body": "Oh cool, but who the fuck is this and why I should I care?\n\nEvery model is wrong, by definition. Be skeptical of people who try to pass themselves off as professionals on Twitter.", "score": -7, "replies": [{"body": "no one cares whether or not you care", "score": 10, "replies": []}]}, {"body": "What does 'Auto.' mean in the last line? Is this referring to the margin in the automotive business of Tesla?  \nIs the gross profit margin for Volkwagen in [this chart](https://ycharts.com/companies/VWAGY/gross_profit_margin) the same metric / can they be compared?", "score": 1, "replies": []}, {"body": "Don’t understand.Where does this graph indicate .5 million cars sold in 2020?", "score": 1, "replies": []}, {"body": "30% Gross margins by years end predicted here! its amazing!", "score": 1, "replies": []}]}
{"title": "Be careful out there", "selftext": "The FED is sending mixed messages, James Bullard has said he expects interest rate hikes to start in 2022, Janet Yellen also said she expected early rate hikes before backtracking a few days later (no doubt after getting her knuckles rapped) if inflation continues on its current track rate hikes will come much sooner than the FED is currently predicting\n\nAll these continued mixed messages lead to one thing - **uncertainty** and that is the very thing that markets do not like\n\nThe early warning signs that a market is about to turn are visible but often subtle and easy to ignore, there are more and more warnings signs appearing that the Bull market maybe coming to an (abrupt?) end\n\n&#x200B;\n\n**Is the market so far in excess that a correction is imminent?**\n\n**Signs of Irrational Exuberance -**\n\nOTC penny stocks traded 80 million shares in Feb 2020 increased to an incredulous level of 1.15 trillion by December and 2 trillion by February 2021\n\nIgnoring the negatives, the price of many stocks are so completely removed from the business fundamentals that it is hard to argue there is any correlation left at all, you can literally throw a dart and you will hit a company that is 10x, 20x 100x its revenue\n\nS&P 500 PE Ratio was at 40 on January 1st this year and is estimated to currently stand around 45 up from an average of around 15, just before the dotcom bust it was 29\n\n[https://www.multpl.com/s-p-500-pe-ratio/table/by-year](https://www.multpl.com/s-p-500-pe-ratio/table/by-year)\n\n&#x200B;\n\n**The Current inflation adjusted Shiller PE Ratio is 37.74 well over double its average of 15.8**\n\n&#x200B;\n\nhttps://preview.redd.it/evxm2rxry0671.jpg?width=947&format=pjpg&auto=webp&s=efac0855ca4f0016c34e6aee7da8361cee25bd04\n\n[https://www.multpl.com/shiller-pe](https://www.multpl.com/shiller-pe)\n\n&#x200B;\n\nThe \"Buffet Indicator\" market cap to GDP is currently 197% - during the dotcom boom it peaked at 140% and in 2007 it peaked at 105% , If you don't think we are in a blow off top situation at the moment just check out the \"Buffet Indicator\" chart below\n\n&#x200B;\n\nhttps://preview.redd.it/frolrw9sw0671.jpg?width=1159&format=pjpg&auto=webp&s=6308a8ea105e8494f24b0f7bab2e43229f610b34\n\n[https://www.longtermtrends.net/market-cap-to-gdp-the-buffett-indicator/](https://www.longtermtrends.net/market-cap-to-gdp-the-buffett-indicator/)\n\n&#x200B;\n\nFortune 500 Company leaders calling themselves \"TecknoKing\" spending their time tweeting about a highly speculative and questionable currency asset class (unmentionable on WSB).\n\nSPAC and Stock mega speculation, make 10x, 20x 100x your money in a week or a month, stonks only go up\n\nIPO upsurge: in 2019 there were 232 IPOs, in 2020 480 IPOs and in the first 5 months of 2021 there have been 512, (at the height of the dotcom boom in 1999 there was a total of 289)\n\nInvestors bullishly positioned for permanent growth many thinking that inflation is transitory despite the massive money printing press which can only lead to a devaluation of the dollar\n\n&#x200B;\n\nThe economy is limping along having never fully recovered from the great recession and further decimated by covid being propped up by unprecedented debt and money printing which is literally off the charts, there has rarely been a period with such disparity between stock prices and company earnings\n\n**All of this is just tinder waiting for the spark**\n\nTD:LR - The main clarion call of the last 18 months has been \"the fed has got our backs\" but even the FED is now signalling that the party might be coming to an end, if inflation continues on its current track rate hikes will come much sooner than the FED is currently predicting\n\nIt might be time at least to start looking at hedging your positions or consider how much risk you are currently exposed to if there was a sudden downturn", "id": "o2p0xv", "created_utc": 1624022674.0, "score": 35, "upvote_ratio": 0.71, "num_comments": 41, "comments": [{"body": "SPY LEAPs then? Got it", "score": 19, "replies": []}, {"body": "VIX is a good hedge", "score": 8, "replies": [{"body": "if you can time it right - I prefer IWO puts (which also happen to be Michael Burrys choice) and QQQ puts", "score": 1, "replies": []}]}, {"body": "Feb 2022 gourd leaps inflation hedge confirmed.", "score": 8, "replies": []}, {"body": "J Pow on our side.  He runs the show. We good til 2023.", "score": 13, "replies": [{"body": "J Powell is already contradicting what he has said previously, If inflation continues to rise hikes will happen much sooner most likely this year imho, \n\nyou don't have to wait for FED meetings, just check your own spending, nearly everything we are buying has gone up in price", "score": 10, "replies": [{"body": "Transitory only. Deflation is the risk IMO.", "score": 0, "replies": [{"body": "\"Transitory\" is the BS the govt is telling you to keep you calm and sedated like a good sheep, there is no way it is transitory with the amount of money they are printing, look at history - printing money has never ended well and if it worked we would already know about it", "score": 10, "replies": [{"body": "What does the Gubment tell us that isn't BS?", "score": 2, "replies": []}]}]}]}, {"body": "powell is out in feb 2022", "score": 1, "replies": []}]}, {"body": "Christian Bale approves of this message.", "score": 4, "replies": [{"body": "Christain Bale has a funny haircut", "score": 2, "replies": []}]}, {"body": "BB 🍇🚀🚀🚀🚀🚀", "score": 9, "replies": []}, {"body": "Back off Burry!", "score": 8, "replies": []}, {"body": "best bet is to play value stonk, I’m in big BTFD CLF", "score": 3, "replies": []}, {"body": "Well we talk about a rate hike but never the rate itself. To get over 1% we would need more than 3 hikes... I personally dont think we are going above 1%. So what would you recommend? Keeping cash which looses around 4% net? Most of the inflation is just caused by state handouts which keeps the workforce at home and supply chain disruptions. Mid term boomers gonna get older and die which should cause lower consumption and demand. People talking for more than a decade about inflation, crashes etc... They will come but before we completely crash the Fed will lower the rates again...In addition we completely forget about the digitalisation of the world which should drive company profits and lower workforce expenses and so prices. I gonna stay invested cuz I don't see much alternatives. Houses and gettin in debt for decades? Keeping cash and loosing? Buying hedges and paying high premiums to time the market? Maybe precious metals and stocks are the only real alternative.", "score": 3, "replies": [{"body": "If you can stomach the paper losses staying invested might be the best course, it depends what you are invested in, personally I don't think it will be the rate hikes themselves that cause the market to roll over, just the uncertainty that it is going to happen, the FED keeps bringing the date forward nearly every meeting - that will make a lot of fund/pension/IB managers anxious and start to look at cashing out and securing their profits (and their bonuses) imho", "score": 1, "replies": []}]}, {"body": "Epoch in market history without real comparable not chartable or understandable by a  🌈🐻\n\nOk maybe the roaring twenties after influenza, that went on more than a few months before 💩", "score": 2, "replies": []}, {"body": "Sunpower", "score": 2, "replies": []}, {"body": "🥱🥱🥱", "score": 2, "replies": []}, {"body": "> uncertainty and that is the very thing that markets do not like\n\n&#x200B;\n\nSounds like FDs to me.", "score": 2, "replies": []}, {"body": "This is the sort of macro bear erotica that gets my shit hard. Unfortunately, it's also how I've blown my account twice so probs gonna stay on track with baba leaps and shares", "score": 2, "replies": [{"body": "Baba is a good long term hold, I have them myself with a 10-20 year view - with regard to your hard shit problems try drinking more water and eat plenty of fiber", "score": 1, "replies": []}]}, {"body": "Anyone with a brain is ignoring these idiots until they actually do hike interest rates.", "score": 1, "replies": [{"body": "you think the banks and billion dollar pensions and hedge funds are going to wait until the last minute to get out, they will creep out hoping not to cause a panic & leave retail to hold the bag", "score": 5, "replies": []}]}, {"body": "STFU 🌈 🐻", "score": 1, "replies": []}, {"body": "Can you tell me why jnug took a shit today?", "score": 0, "replies": []}, {"body": "A lot of the more speculative stocks (clean energy, 3D printing, genomics etc) have fallen ~30-50% from their ath when we were absolutely ripping last year and beginning of this year.  There has been a rotation from speculative tech into value and reopening.  Earnings have been great.  The market seems relatively well behaved and healthy.  Also timing this shit is an exercise in futility.", "score": 0, "replies": [{"body": "They have fallen from unsustainable speculative highs and are still highly over valued, the market doesn't crash all in one day, its like a snowball that gathers pace, the dotcom bust happened over 2 years", "score": 1, "replies": []}]}, {"body": "Can you provide slightly more insight on the IPO point? What does this signal? Due to bullish outlook companies say to themselves ‘ let’s get in on this while the iron is hot’ so to speak?", "score": 1, "replies": [{"body": "He is saying there are just so many possible companies that investors can put their money into and hope for those 10x plays, but realistically, how many of those can and will actually survive and obtain the funding and market share to grow into those 10x plays.", "score": 3, "replies": []}, {"body": "Historically towards the end of a bull run you get a build up of record numbers of IPOs as every startup and half baked idea tries to cash in on the insane valuations, half the IPOs in the dotcom boom didnt make it", "score": 3, "replies": [{"body": "Ok this makes sense, thanks. I guess some will IPO just to make some quick cash and not even have a plan for long term success", "score": 2, "replies": []}]}]}, {"body": "\"Rate hikes won't occur before 2023.\" If that's signaling the party is about to end I better puke, rally, and bump x2  because this shit is about the get CRAZAY!", "score": 1, "replies": [{"body": "There is absolutely zero chance of the FED being able to keep inflation under control until 2023 imho", "score": 1, "replies": [{"body": "They won't have to. The market will control inflation when supply comes back up to meet demand.", "score": 1, "replies": [{"body": "yep ok", "score": 1, "replies": []}]}]}]}]}
{"title": "Rite Aid ( RAD ) Earnings Due Out Next Week - June 24, 2021. Strong results due to COVID-19 vaccinations administered could be a catalyst for the stock price to climb higher.", "selftext": "As we head into next week (week of Jun 21, 2021) with Rite Aid ( $RAD ) set to report fiscal Q1 earnings of Thursday, June 24th, some points to consider:\r  \n\r  \n1) The market cap of the stock is now right around one billion dollars. Does that sound reasonable for a company with $24 billion in annual revenue, positive cash flow, and $8 per share in adjusted EBITDA last year (during a COVID-19 stressed year, no less)?\r  \n\r  \n2) The company provided guidance for the new / current Q1 of their 2022 fiscal year and indicated a break-even result +/- $10 million. This represents a net earnings improvement of $63 to $83 million versus the prior year.\r  \n\r  \n3) RAD management indicated they had administered 2 million doses of COVID-19 vaccine during the first six weeks of the new / current fiscal year. Through the first half of the year, it appears 6 million doses will likely be delivered by Rite Aid. This will result in $210 million in incremental revenue and $2 per share to net earnings. Also, Pfizer's CEO mentioned today (April 15, 2021) that a third booster coronavirus shot will likely be required and that we should expect the COVID-19 vaccine to be administered annually like the flu shot.\r  \n\r  \n4) The short attacks on the stock have ramped up against RAD recently.  Short interest is up to 15.5% of the total outstanding shares.  That represents 8.33 million shares short.  Institutions, mutial funds, and insiders own more than 60% of the total shares outstanding.  That means that 35.8% to 46.3% shares are short excluding ownership by institutions, mutual funds, and insiders.  **Positive earnings on June 24th could be a catalyst for a major squeeze.** \r  \n5) The Bartell Drugs acquisition closed at the start of 2021.  While it is unlikely to contribute materially to net earnings during the current fiscal year, it is expected to do so next year. The acquisition makes Rite Aid the pharmacy leader in the Seattle market.\r  \n\r  \n6) Year-to-Date high share price is $32.48 and there are only 55 millioin shares total outstanding.\r  \n\r  \n7) The company has $3.1 billion in debt, which is being adequately managed (---meaning Rite Aid was able to service the debt, buy Bartell drugs, and still maintain positive cash flow last year). For the new / current fiscal year, it appears likely that Rite Aid is positioned to book positive net earnings and cash flow (improving cash flow even further).\r  \n\r  \n8) Break-up value of the company is estimated to be in the range of $40 - $50 per share.  This despite a current share price of under $21.  \n\n\rDoes this sound like a company that should be trading at less than $21 per share with a market cap of just $1 billion?", "id": "o2ww7t", "created_utc": 1624041202.0, "score": 25, "upvote_ratio": 0.71, "num_comments": 41, "comments": [{"body": "lmao, WSB has come full circle,", "score": 15, "replies": [{"body": "Very true, very true.  Rite Aid was a one-time darling of the WallStreetBets crowd a few years back.\n\nNow it is on the brink of finally returning to profitability this year after several years of struggle.\n\nHedge funds have done their best to short this one into complete bankruptcy, but have failed.\n\nI would love to grab a pint of Rite Aid Thrifty brand ice cream, sit back, and watch this one soar on Thursday if they post strong earnings.  That' would be sweet.", "score": 11, "replies": [{"body": "Got some calls for old time's sake.", "score": 11, "replies": [{"body": "Buying calls seems like wasting money.like every day that passes by, u have to hope the stock goes higher.", "score": 2, "replies": [{"body": "If you buy them after Shorts attack the stock. You can do well. Shorts are constantly attacking RAD to suppress the price. No it's not easy, but they have a pattern. Like buying $23 strike calls after the 9th expiration will likely do well. In fact RAD could be well  into the $30 if earnings do well with good guidance. Shorts will have to cover at some point. For every $10 move up in RAD's price. Shorts lose $160 million. Being in Calls if RAD squeezes could pay very well. So use play money, but it beats a lottery ticket. 10 shares could double your money easily, but 10 contracts could make you 15k.", "score": 6, "replies": [{"body": "Thanks for the info. I was thinking csp or credit spreads. But good idea!", "score": 3, "replies": []}]}]}]}]}]}, {"body": "im sold took a massive hit on BB CPNG, RKT and NIO this week. need some break even with this next week lol. \n\n&#x200B;\n\n100 Contracts at $20.5 Strike EXO 6/25 \n\n&#x200B;\n\nwish us luck", "score": 10, "replies": []}, {"body": "Kinda pricey but you may be onto something, I bought some shit there after each of my shots.", "score": 8, "replies": [{"body": "If you sign up for the Rite Aid app you quickly gain GOLD status and qualify for and automatic 20% off everything that is not already on sale.\n\nThey are always running great specials.  Buy-one-get-one-free, etc.  \n\nI usually walk out with anywhere from 25 - 40% off the listed prices on my entire purchase.", "score": 4, "replies": [{"body": "I meant the SP seems pricey right now, not the shit I bought, lol. It's had a nice run up over the last month or so. I think it can run more though, and I'm in.", "score": 2, "replies": [{"body": "Oh, OK.  \n\nAt $1 billion market cap and $24 billion in revenue, I think the stock is actually priced quite low.  \n\nI haven't been able to find any other companies (with market caps of $1 billion or more)  that have a sales to market cap ratio of 24 to 1.  If anyone knows of such a company, please post.   (I may want to invest in that company!)", "score": 4, "replies": [{"body": "That is way to technical for my retarded brain, I just look at how many 🚀💎✋🌕🦍🍌🖍️and other emojis I see in a post and the responses, then take a quick look at the  📈 before I decide to buy a stonk.", "score": 7, "replies": []}]}]}]}]}, {"body": "Rad was the first stock I bought outright off of DD from a friend. Maybe it's time to get back in it with new knowledge?", "score": 6, "replies": []}, {"body": "Ok I’m in!!", "score": 8, "replies": []}, {"body": "Sounds totally RAD!!!", "score": 5, "replies": []}, {"body": "Bought the Friday dip here. This is conceivably an acquisition target too, no?", "score": 3, "replies": [{"body": "Yes, I believe there are at least three (3) parties who would recognize significant strategic gains from an acquisition of Rite Aid:\n\n\\*\\*\\* Amazon ( $AMZN ) \\*\\*\\*\r  \n\r  \nCFRA Research group recently stated (Thursday, June 3, 2021) in its latest Rite Aid (RAD) analysis report:\r  \n\r  \n\"It would make more sense for AMZN to acquire a regional drug retailer like RAD to quickly establish a physical presence.\"\r  \n\r  \nAlso, it should be noted that there is already a partnership existing between Amazon and Rite Aid since July of 2019. Rite Aid was the first partner that Amazon selected for its retail in-store pick-up program called Amazon Counter. Here is the link for the launch of the program:\r  \n\r  \nhttps://www.reuters.com/article/us-amazon-com-rite-aid/amazon-launches-new-in-store-pickup-option-with-rite-aid-as-first-partner-idUSKCN1TS0RI\r  \n\r  \nSo the companies are already coordinating some business activities to a minor extent.\r  \n\r  \nFinally, with the acquisition of Bartell Drugs, Rite Aid became the #1 retail pharmacy in Seattle, WA. Should Amazon buyout Rite Aid, AMZN itself would be able to cut out the middleman and provide cost effective prescription drug benefits to its 75,000 employees at the Seattle headquarters.\r  \n\r  \n\\*\\*\\* Walmart ( $WMT ) \\*\\*\\*\r  \n\r  \nWalmart is already a leading player in the retail pharmacy / prescription drug segment, and the category is a strategic growth target for the company. However, Walmart has nowhere near the presence in the pharmacy sector of either CVS or Walgreens. In order for Walmart to become competitive in this space, they have to increase their size and scale. If Walmart let's Amazon step up and become the third largest player in retail pharmacy, it's game over. WMT needs to move into this third position and block AMZN from doing so.\r  \n\r  \nA couple of the benefits of Walmart acquiring Rite Aid would be:\r  \n\r  \nWalmart would have double the purchasing power for prescriptions thereby lowering its overall drug cost, improving profitability\r  \n\r  \nAll the goods sold in the front-end of the 2,500+ Rite Aid retail pharmacies are the same products Walmart sells in its own department stores. Once again, when you buy larger quantities you get lower prices. This is a fact of the business world that I know first hand.\r  \n\r  \nBased on the above 2 points, Walmart would improve both its own existing margins and at the same time would improve those of the Rite Aid revenue through such an acquisition.\r  \n\r  \nThe Rite Aid PBM would help Walmart to capture much greater market share in the prescription market, thereby enhaning those gains even further.\r  \n\r  \nIf you look at Walgreens and CVS when they had approximately $25 - $30 billion in revenue, they were earning about $4 - 6 billion per year. Therefore, considering Walmarts expertise in running brick and mortar establishments, one could make the leap of logic that WMT would achieve similar profit levels. So an acquisition of RAD by Walmart essentially provides a 2-3 year payback on the investment.\r  \n\r  \nWhichever company, Walmart or Amazon, utlimately decides to buy Rite Aid, that corporation will instantly become the #3 retail pharmacy in the USA, and will be well-positioned to someday challenge CVS and Walgreens for the #1 or #2 spots.\r  \n\r  \n\\*\\*\\* Walgreens ( $WBA ) \\*\\*\\*\r  \n\r  \nAnother darkhorse in this whole race is Walgreens. This week, Walgreens completed the sale of its Alliance Healthcare businesses to AmerisourceBergen for $6.5 billion (---see link below this paragraph). This windfall gives WBA the needed funds to finally finish the takeover of Rite Aid that it started back in 2015. While that deal was ultimately blocked by the courts, no judge could reasonably claim today that there is insufficent competition to support consumers if the balance of Rite Aid was taken over by Walgreens (NOTE: WBA bought 1,900+ RAD stores in 2018, and RAD currently has 2,500+ stores remaining). With CVS, Walgreens, Walmart, Kroger, and numberous mail order prescription services (including Amazon), there is pleny of competition in the USA.\r  \n\r  \nhttps://www.nasdaq.com/articles/walgreens-completes-divestiture-of-alliance-healthcare-to-amerisourcebergen-for-%246.5b-2021\r  \n\r  \nAn acquisition of Rite Aid by Walgreens would be a highly strategic move accomplishing the following:\r  \n\r  \n\\- Gaining more size and scale, thereby putting WBA in a much more competitive position with CVS\r  \n\r  \n\\- Giving Walgreens a PBM in Rite Aid's Elixir group that would help WBA gain more prescription drug business share compete more successfully in that category\r  \n\r  \n\\- Blocking both Amazon ( $AMZN ) and Walmart ( $WMT ) from acquiring Rite Aid thereby removing the threat of a financially powerful competitor moving into the #3 retail pharmacy spot in the USA.\r  \n\r  \nSo, it may very well be the case, that the race is on to see who will acquire Rite Aid!", "score": 2, "replies": [{"body": "Brilliant write up here. Thank you!", "score": 2, "replies": []}]}]}, {"body": "What's a major squeeze?", "score": 2, "replies": [{"body": "I think a doubling of the stock price is possible to $40+ per share.  Even at that price level, Rite Aid's market cap would still be below $2 billion.  Quite low for a company that did $24 billion in revenue last year representing 9%+ year-over-year growth.", "score": 4, "replies": [{"body": "Hmm...would it a decent notion to buy shares for them as of now?", "score": 2, "replies": [{"body": "It depends.  If your motto is YOLO and you crave high-risk / high-reward, you buy here.\n\nIf you are a boomer who prefers to see which direction the wind blows and capture a few percentage points at the end of the run, you wait.", "score": 5, "replies": [{"body": "I am still very much new to stocks. I'll purchase one share and see where it gets me.", "score": 6, "replies": [{"body": "One share of anything will get you nowhere lol except for maybe berk a 40 years ago volume and concentration is the formula", "score": 1, "replies": [{"body": "Ah yeah....I don't really have much to start off with so I am just using a small amount to test the waters.", "score": 2, "replies": [{"body": "Don’t feel pressure to invest more than you want to obv. One share is fine. On something like robinhood or whatever you can buy fractional. Good luck!", "score": 2, "replies": [{"body": "Thankie", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Institutional owners don't always report at the same time so there is no guarantee that they are being double counted and the total ownership combined is 60%", "score": 2, "replies": [{"body": "May very well be true.  But institutional ownership in RAD typically hovers around 60%.", "score": 4, "replies": []}, {"body": "Institutional ownership according to Fintel shows 74% ownership. Tracking RAD Institutional ownership. In the last 3yr. Ownership has gone from 47% to 74%. A steady increase overtime. BlackRock owns 9% of RAD just on their own. Some other Institution own 10%. That shows a lot of confidence from Fund managers. Not that they know everything.", "score": 2, "replies": []}]}, {"body": "Post history is entirely pumping RAD. \n\nNo thanks gtfo", "score": -2, "replies": [{"body": "Trying to bring attention to a missed placed valuation stock isn't Pumping! RAD is as much as a Naked Shorting victim as AMC and GME, however as an overall company they are 10 times more of a sound investment. RAD has a squeeze potential unmatched except for Game Stop before they released more shares. If you can't see it. It's because you can't add.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I know I do.", "score": 1, "replies": []}]}]}, {"body": "Earnings beat followed by sell off?", "score": 0, "replies": [{"body": "Happens all the time. Look at Oracle last week. I only know this because it nailed me.", "score": 0, "replies": []}]}, {"body": "Watch, it's going to smash expectations but sell off because dipshit hedge funds saying \"well, it didn't beat our expectations by as much as we'd like.\"", "score": -2, "replies": [{"body": "The only way that happens is a coordinated Short Attack. We have seen several. If you do see you, back the truck up. They never last because the price is already ridiculously low. Funds come in and buy right back up. Look at 2yr chart and you will see it. Last earnings they did that very thing, however there's going to come a time when it just takes off and doesn't look back.", "score": 4, "replies": []}]}]}
