{"title": "Buy $AMD hard at open, right?", "selftext": "6.60 is a pretty price to pay for a major company in a booming industry with good news coming out of it's competitor's ER. In today, out tomorrow, I'll let you faggots know how it goes. (hint: to the moon)\n\nedit: got in at 6.35 leggoooo", "id": "4x1s4b", "created_utc": 1470830544.0, "score": 23, "upvote_ratio": 0.82, "num_comments": 33, "comments": [{"body": "hint: retarded", "score": 32, "replies": [{"body": "Replying to myself to confirm your retardation. ", "score": 17, "replies": [{"body": "IN AT 6.35 LIGAF WHAT YOU THOUGHT LMAOOOO", "score": 6, "replies": [{"body": "I'm with you, 4k on AMD at 6.35. No DD or anything, just feelings.", "score": 7, "replies": [{"body": "Hell yeah", "score": 4, "replies": []}]}]}]}]}, {"body": "Also: http://finance.yahoo.com/m/b29af522-fbbf-3326-b7fc-c175d2a3f300/ss_apple-said-to-plan-first-pro.html", "score": 9, "replies": [{"body": "Didn't even see this, should absolutely be up at open, first confident investment I've made in a week", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "4 hours ago is old news?", "score": 4, "replies": [{"body": "It has been fairly common knowledge that the new MacBook Pro would feature an AMD Polaris chip.", "score": 3, "replies": []}]}]}]}, {"body": "All these assholes getting into AMD then flipping the fuck out at the end of the day when it hasn't reach its \"analyst predicted price target\" are idiots. The highs have been getting higher, and the lows have been getting higher, so despite the daily swings, this stock is on its way up. Buy hard, hold through EOY.", "score": 11, "replies": [{"body": "Is it only considered bag-holding if you're in the red?", "score": 3, "replies": [{"body": "That's what I would consider bag holding. ", "score": 5, "replies": []}]}, {"body": "I'm only continuing to add to my position in AMD. I fucked up the first time, bought at $4.80ish and sold at $5.20.\n\nI'm in at $6.64 for just shy about 1k shares. Basically every dip I buy as much as I can. Holding until a minimum of $10.", "score": 2, "replies": [{"body": "Every once in a while if it looks like its taking a hard dive, I'll try to avg down my cost, but I'm holding AMD through the EOY. ", "score": 2, "replies": []}, {"body": "I though to yolo was to actually gamble your money on options.", "score": 2, "replies": []}]}, {"body": "This. ", "score": 1, "replies": []}, {"body": "Agreed.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": []}, {"body": "I would think the news they've released is all they had. \n\n\"we're making the next gpus for consoles again\"", "score": 3, "replies": []}, {"body": "I hope you didn't buy hard at opening.", "score": 3, "replies": [{"body": "I did, 6.35 open", "score": 3, "replies": []}, {"body": "he wins", "score": 1, "replies": []}]}, {"body": "Downgrade this morning?  anyone know>?", "score": 3, "replies": []}, {"body": "Made a nasty snag at $6.34 (-4% on the day) and now we are almost back to even.", "score": 2, "replies": [{"body": "yea it's the fucking institutions closing their puts before tomorrow expiration or buying up/closing shorts before a big pop. AMD unfortunately gets played like this. Was much more common when we were down below 3pps but the writing is on the wall. nearly 6 million shares shorted on the open, followed by solid 200-400k buy blocks for the past hour. Who the fuck do you think has that kind of money?! I just can't wait till we are back on the S&P and they can't play these games anymore.", "score": 2, "replies": [{"body": "And why would AMD be put on the S&P?", "score": 1, "replies": [{"body": "AMD used to be on the S&P 500 for some time. If your unfamiliar the S&P 500 is an ETF investment portfolio with 500 tech companies invested. AMD was dropped in 2013.. But nothing says it can't come back into the fold. If they do WATCH OUT. The stock will rally like crazy as S&P 500 will need to buy up a sh*t ton of stock on the open market to reinitialize it's investment.", "score": 2, "replies": []}]}]}]}, {"body": "WHY IS $AMD DOWN TODAY?", "score": 2, "replies": [{"body": "The movement isn't surprising in the least. Every time AMD has passed it's 50 SMA it's come back to meet it.\n\nWhen it meets it's 50 SMA it takes a huge dip and then slowly makes it way back up. It's been doing this for the last 2 weeks\n\nUnless you're trolling, than I'll promptly gfm", "score": 3, "replies": []}]}, {"body": "I have puts on AMD. Loving this. ", "score": 1, "replies": []}, {"body": "I shoulda bought the god damned dip.", "score": 1, "replies": []}, {"body": "I got in at 6.30 let's win more", "score": 1, "replies": []}]}
{"title": "I bought shares of Adidas on June 30th. I have gained 18% ROI in a little over a month.", "selftext": "Look into Adidas stock faggots.  I only have 25 shares but I am buying more and more shares everytime I get the capital. It's blowing numbers out of the water.  They just announced they are building their first factory in Atlanta (US) because the demand has been so absurd.  In North America their sales grew over 20% and in China I think it's over 24% the past year.  Nike sucks as they're the worst performing stock of 2016 on the DOW.  Adidas just surpassed Under Armour for #2 in sportswear.  \n\nBuy Adidas fags", "id": "4x2loh", "created_utc": 1470842047.0, "score": 9, "upvote_ratio": 0.72, "num_comments": 32, "comments": [{"body": "\"All Day I Dream About Sucking Dicks\" - OP", "score": 39, "replies": []}, {"body": "Yeezy Yeezy just jumped over Jumpman!", "score": 15, "replies": [{"body": "K. Dot & Future also got deals with Reebok.  Adidas owns Reebok.\n\n", "score": 4, "replies": []}]}, {"body": "Who says \"ROI\" here? \n\nYou an MBA student or something?", "score": 10, "replies": []}, {"body": "Literally every stock has been up 18% since June 30th rebounding from Brexit.  Congrats on thinking you picked the only winner out there. ", "score": 5, "replies": []}, {"body": "They more than doubled within a year and are not even close to being cheap now. Jumping in now is just begging to get burned.", "score": 7, "replies": [{"body": "I disagree. Adidas has been shit for years and is on a major wave right now. They're going to be crushing y/y comps for at least 2 more quarters. NKE and UA soared for a solid 2 years up until the end of 2015, ADDYY has more room to work imo.\n\nI mean just look at the people in this thread alone who claim they don't see the trend in their daily lives when the numbers from China, EU, and NA are screaming at them. Still room to run I tell ya, but I'll admit I'm not adding to my position right now.", "score": 2, "replies": []}]}, {"body": "ROI? Thats some r/investing talk right there. Its all about them GAINS!! ", "score": 3, "replies": []}, {"body": "Adidas is on fire. I've been trying to buy the NMD's every time they get released, but they sell out faster than OP's mom", "score": 2, "replies": []}, {"body": "Nah", "score": 2, "replies": []}, {"body": "I don't see anybody wearing ADIDAS nowadays ", "score": 1, "replies": [{"body": "then you have down syndrome & have no idea about sportswear.", "score": 31, "replies": [{"body": "I laughed way too hard at this", "score": 1, "replies": []}]}, {"body": "Then leave the house more often", "score": 7, "replies": []}, {"body": "Addidas makes shoes, shorts/pants, jackets, and socks that all look good tbh. The two white stripes on black fabric and the leaf logo are iconic, I would even say it's just as iconic as the Nike swoosh.", "score": 1, "replies": [{"body": "> The two white stripes\n\nbruh", "score": 15, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Adidas is three stripes", "score": 13, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Damn Daniel!!\n\nYou just got the Payless version. ", "score": 8, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Nah ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Think of all the tracksuits they need to make so that Slavs can squat comfortably!", "score": 1, "replies": []}]}, {"body": "Look at the street wear and sneaker subs. Adidas is def gaining market share. Idk for how much longer, but if you followed that culture the past two years, you could've seen this coming", "score": 1, "replies": []}, {"body": "If you live in the US you aren't wrong. They have half the sales of Nike and they have almost as many sales in the middle east as they do in the US. Middle Eastern dudes love those adidas suits, gold chains and big ass yachts.", "score": -2, "replies": [{"body": "You serious? Boosts, Stan Smiths, Superstars and Yeezys are ubiquitous in schools and college campuses. Adidas is focusing on streetwear and fashion while Nike is content with selling runners to teenagers in the developing world.", "score": 2, "replies": [{"body": "Sounds like a pretty good deal for Nike.  Sell shoes to their workers for 1 years worth of wages.", "score": 1, "replies": []}]}]}]}, {"body": "All legit analysis aside, Adidas is coming up, and i've noticed it over the past couple months. Making tight shoes, growing poularity. Pissed I didn't but when I thought I should, was planning on buying next dip. Good find", "score": 1, "replies": [{"body": "So one thing Americans don't pay a lot of attention to is golf and soccer. NIKE became a bitch in the golf game and just announced their done making golf equipment... Now Adidas will EAT their market. Also Nike doesn't do a damn thing with soccer. Adidas owns that whole market which is arguably the most popular sport in the world. Nike only runs on Jordan brand and basketball and lack diversity. Also under armour seems like they are on shrooms and don't know how to make shoes. Their apparel carries them ", "score": 1, "replies": [{"body": "Plus Nike has been putting out garbage shoes lately. Low quality and very little diversity.", "score": 5, "replies": []}, {"body": "Can confirm. Got the national jerseys for Germany for the past few cups... all Adidas. Clean as fuck. Nicest futbol jerseys I've bought.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Your post has been automatically removed because  https://www.youtube.com/watch?v=P9cObozvAQ0\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "UA just hired some fancy designer so hopefully they'll start making better looking shoes. Asics has Ronnie fieg and those things are always baller, and will go for a couple grand a pop. I could see them doing some special editions like that, or atleast I think they need to. Sneakerhead market is huge. ", "score": 1, "replies": []}]}]}, {"body": "wow 25 whole shares ! wow ! Now that's a Wall St. Bet. You're a crazy man.", "score": 0, "replies": []}]}
