{"title": "Pair of option plays looking for critique", "selftext": "Good evening everyone! Hope everyone is doing well and making smart plays.\n\nAs a newer trader I just wanted to run down some small plays that I thought might be very reasonable as intros, but was looking for some critique or different thoughts on how to go about the play.\n\nSo first up is around BP.  I thought a buy to open vertical call might be a decent play. Currently, they are trading at 39.25, after the steep plummet from 44 to 38. I see March 29th 41 long calls for $.32 and March 29th 43 Short calls for $.04.  The way BP looks, they haven't fallen by more than 6 dollars in in their downturns and were sitting on the upturn of that. Also,  as we move into spring and Summer, the upturn of gas should start to creep up.\n\nSecond up is Fedex.  Now they're at 245, with an ATH of 270 just a month ago. Same play, because I'm new and stupid. Long april 6th 255 Call and a Short April 6th 265 Call. Overall they have had good growth and really only downturned with the market, meaning if we still believe bull market we might think they were headed back to 260 region. \n\nVery curious on some input, I thought these might just be good starting option plays, and learn more about how the contracts move, with a limited and identified risk.", "id": "7zleno", "created_utc": 1519360389.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 17, "comments": [{"body": "Four cents on the short leg isn't worth it, unless you are a market maker. Bid/ask will be at least a penny, commissions might be another penny or two. That leaves you with one or two cents. Not worth it.\n\nIf you want to roll or close early that may be another piece out of you. \n\nMarch 29 isn't much time. Also weeklies tend to have less liquidity than third week expirations. You may have to be very patient getting in. Exit may be difficult. Adjustments impractical.\n\nThese kind of trades might work paper trading, but seem poor choices for a novice.\n\nI suggest buying at the money and perhaps selling the strike you were considering buying. Further out in time and monthlies are preferred so theta doesn't eat your lunch, and liquidity will tend to be better.\n\nBoth underlyings may be poor choices for spreads because of questionable liquidity. If that is the case, single leg trades or just buying the stock will tend to increase the odds of long term profits.", "score": 3, "replies": [{"body": "Yeah given what a commenter below said as well, I dont think a spread would work great, because of that liquidity. Maybe just single leg, ATM calls then would be a better option.", "score": 1, "replies": []}]}, {"body": "Can't speak to your analysis at all but I'm curious why you want to do a vertical on BP when the calls you're looking at are $0.32. Normally you'd do a vertical when you need the premium from the short side to finance the long side on a bull call spread. But unless you really only have $28 to trade, you can skip selling the short call and just buy the call for $32. You get unlimited upside for only $4 more at risk.", "score": 2, "replies": [{"body": "Yeah... I wasnt thinking. Thats a dumb choice to cap the BP. ", "score": 1, "replies": []}]}, {"body": "lol making smart plays", "score": 2, "replies": []}, {"body": "If I have a \"go to\" option play, it's the vertical spread.  With that trade you can be bullish, bearish or bullish.  You can go high or low probability.  You can use it to sell premium or buy stock.\n\nI agree with the others that .04 is too little to collect.   But if you're trading AMZN, you can buy a call for ~45.00 and sell the other for ~42.00.  For 3.00 (x100) you can trade the action of a stock that costs almost 1500.00.", "score": 2, "replies": [{"body": "Hey thanks for your reply.  I was trying to get a good feel for when the short call would be worth it to offset the price of the long. It makes a lot more sense with some of these higher options prices.  Thanks for the thoughts!", "score": 1, "replies": []}]}, {"body": "Why don’t you look at putting on some vertical put credit spreads? I put some on last week for FDX when I felt the news of Amazon getting into delivery was overblown. They are paying off quite nicely. You could also try a deep ITM call with a high Delta if you want to catch an upswing. Just consider the cost of holding overnight might not be worth the loss of theta. Good luck!", "score": 1, "replies": [{"body": "So, here is a probably very dumb question, but here we go; When deciding between an ITM or OTM call what things go into the decision making? is the ITM/ATM call just used as a leverage for potential larger gains on a bullish outlook while not requiring a minimum value to hit?", "score": 1, "replies": [{"body": "I look at a short term OTM call as a lottery ticket. You’re paying premium and you need it to close above your strike. An ITM call, in AMZN for example, could be used to day trade the huge swings in daily price action. If you time it right. ", "score": 1, "replies": []}]}, {"body": "Also, would you be opposed to outlining your FDX put spread so I can visualize it? \n\nThanks!", "score": 1, "replies": [{"body": "I sold the March 23 250Put and bought the March 23 245P. I got a credit of 2.45 ", "score": 1, "replies": [{"body": "Oh I see the difference in doing it as a sold put. It takes a shift in mind set to start considering the put options as a bullish outlook too, I mean, I know it is but it just takes some time to start thinking of that organically.\n\nLemme swing one more idea by you. It's slightly revised, hopefully a better use of the spread I believe.  $4.20 Call spread; Long 260 ($4.90 Debit), short 270 ($2.15 credit). Plenty of time and IV. Thoughts?", "score": 1, "replies": [{"body": "Looks to me like you are going to be paying for that, a debit spread, not collecting premium. I think you are looking at risking $2.70ish with max profit at $7.25ish. If you think it will be trading up about 10% at expiration (the underlying), you will be at max profit. \n\nEdit: looks like a good risk reward to me, if your confident in your assumptions on underlying ", "score": 1, "replies": [{"body": "Right, no premium collected, but like you said earlier, the bought call premium should be slightly offset by the sold call credit, right? There is a run through earnings, which could prove tricky and will probably need a close eye. \n\nSorry if any of the terminology I use has been wrong or confusing  ", "score": 1, "replies": [{"body": "You are correct. And not a bad play with IV relatively low for FDX April options. ", "score": 1, "replies": [{"body": "Cool thanks for all the help and talk through. Hopefully it goes well and I might be able to report back with some learnings during the cycle of the trade. I also picked up a long call for BP, so cheap and at the bottom of their cycle, it's a gamble, but like at 30 dollars *shrug*", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
{"title": "How are you guys playing WMT and UPS?", "selftext": "I am thinking about getting some calls for WMT and UPS, given the huge recent drops in both. What time horizon and strikes should I look at?\n\nEDIT: I ended up selling Apr 18 92.5/90 put spread on $WMT for $1.10 credit. I like the odds of it making me green but we'll see how it goes. ", "id": "7zlukd", "created_utc": 1519364990.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "I sold wide strangles on WMT. I start small and add layers to stay near delta neutral. Selling Mar 85 puts and Mar 105 calls was the initial pilot position when WMT was around 95.", "score": 3, "replies": []}, {"body": "I sold a put spread yesterday. I can’t see it going much lower than 90... but who knowwwwws", "score": 2, "replies": []}, {"body": "I’ll do an apr20 atm put backspread ", "score": 2, "replies": []}, {"body": "WMT Bull Put spread 29 DTE for $1.85\n\nI'm not in UPS since they are impacted by AMZN . . .", "score": 2, "replies": [{"body": "Wal-Mart isn't impacted by Amazon?", "score": 1, "replies": []}, {"body": "Slightly on topic, I'm not sure if youll find the info useful though.  Fedex on their last earning call claimed that Amazon only figured to about 5% of their earnings.  So I'm not sure if Amazon will have as much effect on ups/fedex, food for thought!", "score": 1, "replies": [{"body": "No time to fully explain, but I agree UPS and FDX fears about AMZN are overblown, however it affects their whole business.\n\nWMT did great with brick and motor, but missed online sales, which doesn't affect their whole business.  Everyone knows what they are trying to do and it is my expectation that they will figure it out, and even if they don't, their stores will continue to crank out profits.\n\nIn summary, it is my presumption that WMT will slowly lift back up as time goes along and they work to fix their online business.  There is not much more bad news to report in the near term.\n\nHowever, FDX and UPS stock will likely be hit again and again as whatever AMZN is doing becomes more well known and publicized.  It's been a long time coming, but **AMZN will get into the package delivery business** with considerable impact to FDX and UPS.\n\nMy 2 cents for whatever it is worth.  I could be very wrong of course, just ask my wife as she tells me this all the time.  :)", "score": 2, "replies": []}]}]}, {"body": "UPS will definitely run up at some point but I see it going sideways in the near term.  I've been writing covered calls for shit money, just waiting.  They need to throw blockchain in their name.  ", "score": 1, "replies": [{"body": "Yeah, I'm down on UPS, I am long the stock and bought it a while ago at 110. Been writing covered calls on it for now.\n\nalso long WMT, sold half with the downturn in Jan, still up very nicely on the balance. Sold a put, actually hoping to pick up a few more shares. I like the divy they have. Been very good to me.", "score": 1, "replies": []}]}, {"body": "what goes down must go up?", "score": 1, "replies": []}]}
{"title": "Why did Boeing fall behind today?", "selftext": "Great bill run but BA underperformed. Any particular reason?", "id": "7zrea6", "created_utc": 1519419330.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "Headwinds ", "score": 8, "replies": [{"body": "Tailwinds", "score": 1, "replies": []}]}, {"body": "Stocks go up. Stocks go down. There isn't always news driving things.", "score": 11, "replies": [{"body": "NO THERE HAS TO BE A REASON\n\n-this sub, all the time ", "score": 7, "replies": []}]}, {"body": "Its a blue sky leader. I wouldn't worry about it. It just went up so fast this past year.  Need a breather. I think it stretches up another 7-9 pts next week.", "score": 3, "replies": []}, {"body": "Morgan Stanley didn't up their rating? ", "score": 1, "replies": []}, {"body": "It's overextended, that's why it's not moving so easily upward.", "score": 1, "replies": []}, {"body": "Can’t go up everyday", "score": 1, "replies": []}, {"body": "I suspect its that Airbus has more orders than Boeing after analysts came to the conclusion that orders in the queue are not as numerous as airbus. I didn't read that much into it,  except orders for the 747 variants are down. ", "score": 1, "replies": [{"body": "Well i am lond boeing. It is 50% of portfolio and not going to sell anytime soon. I honestly believe in a 500 stock price by the end of the year. What do you think?", "score": 1, "replies": [{"body": " I'm looking long for it,  but I've purchased a few stocks with the winnings and seem to doing good. \n\nRight now I'm looking at defense related stocks. ", "score": 2, "replies": [{"body": "Yup!", "score": 1, "replies": []}]}]}]}]}
{"title": "If you're investing right now, and want to know the near term outlook there's only 1 number to look at.", "selftext": "I keep seeing people asking what the outlook is for such and such stock, index or the market as a whole. IMO the only number to look at is the 10 year treasury yield. That is the single thing moving markets right now and for the near future.\n\nIf you're a buy and hold for life investor, this should not concern you too much. However if you are sitting there and deciding if you should invest in company x right now, 3 months from now, 6 months from now......the price you will pay will largely be dependent on where that 10 yr bold yield is at (probably more so than the actual fundamentals of that particular stock). \n\nIf the yield goes down or stays flat, the rally likely continues as we saw today. If it jumps up, and especially when it flirts with key levels 3%....3.5%.....expect a market sell-off. \n\nI find it funny when analysts shrug this point off saying that the only reason yields are going up is because the economy is doing well and this is a positive sign....blah...blah.....if that's the case then the market wouldn't be shitting its pants with huge sell-offs every time it goes up a few basis points.\n\nSorry if this was overly simplifying things but it has been something I've been keeping a close eye on and I rarely see it mentioned when people bring up tax cuts, spectacular earnings, etc as reasons for the bull market continuing on course.", "id": "7zs6x5", "created_utc": 1519425791.0, "score": 9, "upvote_ratio": 0.76, "num_comments": 9, "comments": [{"body": "It’s become a hobby of stock investors to newly obsess over 10Y yields... mostly propelled by the media.\n\nNobody speaks about low unemployment, rising wages and a hawkish Fed preparing to raise rates.\n\nIt is a combination of factors.", "score": 6, "replies": [{"body": "This is a nice animation of the yield curve and the S&P 500 back to 1999.  Click on \"animate\".  It would look exactly the same if you went back to 1950 (except the yield curve would be way higher in the late 70s and early 80s).\n\nThe 10 year yield going up just reminds everyone (or let's say a few of the big investment managers) that one of those big down-dips is coming again someday.  [Technically, it is still far, far off in the future but the 10Y yield is a signal it is coming back again someday.  The number is not 3.0%, however, but something closer to 4.0% and a flat or inverted yield curve along with it.  8 of the last 8 recessions had an inverted yield curve at the start].\n\nhttp://stockcharts.com/freecharts/yieldcurve.php\n ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "The tax cut could not have come at a worse time. Trump mistimed it. Who gives the public more money at a time when employment is so high - and cause inevitable inflation.\n\nSome people warned about this and they were dismissed as partisan hacks. ", "score": 2, "replies": [{"body": "Tax cuts couldn't have come at a better time. Several polls now show the majority of Americans now approve of the tax bill, after of course seeing more money in their own pockets and realizing CNN and MSNBC pushing the end of the world coverage is false.\n\n \nhttp://www.businessinsider.com/poll-gop-tax-law-favorability-approval-trump-2018-2", "score": 0, "replies": [{"body": "Majority of the Americans are not too concerned about 10Y yields or bond selloffs. Personally, I am happy to take home more money as well. But populism aside, from an economics discussion standpoint of the effects of giving more money in the hands of spenders - it definitely came at the wrong time in terms of an ageing economic recovery and the fed finally raising rates after years of near bottom.\n\nThis could be the start of sending the economy into a recession. I want to be wrong on this one. Who wants to see the selloff intensify in the coming months??? We all need our stocks to do well. Unfortunately, I have a feeling we just saw the beginning of the beginning.", "score": 1, "replies": []}]}]}]}]}, {"body": "I agree with your point but don’t agree with the theory that a long term investor should ignore the yield .. if the yield stays high in near and long term then the market can and will cut itself in half and that’s a big drop just like 2008-09. \nMy prediction is that any company with high debt will be the first one to fold their hands when the yields starts going up, so watch out for those high debt companies. Second there is no guarantee that any future QE will not cause high inflation or for that reason hyperinflation. If that happened then feds can’t do QE forever to rescue the markets. \nOne should be realistic and change their investment based on market conditions. One can make money in any situation as long as they can figure out the market sentiments before it’s too late. ", "score": 1, "replies": [{"body": "I totally agree with your points. The only reason I said long term investers dont need to worry as much is because there seems to be the silly idea on this sub that buy and hold investers dont need to worry about day to day market conditions because they are holding for several yrs", "score": 1, "replies": []}]}, {"body": "Yields are important. One recent sell off was blamed on the yield reaching a certain level.\n\nThat said, the yield curve might be a more valuable all weather indicator. When the short term yield exceeds the long term, the inversion is a flashing red light for the stock market. An inversion will be all over the business news if and when it happens. So casual participants don't have to monitor it.\n\nAlso watch the tape action. Narrow rallies on low volume, a break down of the moving averages will confirm. Calling market turns tends to be a low percentage game. Don't draw a line in the sand or be stubborn. Listen to the market. Stay humble.", "score": 1, "replies": []}, {"body": "10y at 3%,,,  RUN FOR THE HILLS MOTHERFUCKERS", "score": 1, "replies": []}]}
{"title": "The most boring market sector: Reits", "selftext": "I can't believe i have had my thumb up my ass while not paying attention to the reit sector being rammed up the ass by bears because of increasing bond yields situation unfolding.\n\nAnyone who is short this sector has been making a pretty penny and i am also tempted on jumping on the band wagon. Although, now that i have alerted WSB this downturn trend shall reverse? \n\npersonally, i see the bond bull market over and a multi-year bond bear market in the beginning stages if the federal reserve doesn't begin another decade of quantitative easing. Thought i would see if anyone else is short the reits?\n\njust some Reits: $WPC $GNL, $WPG, $CBL, $OHI", "id": "7zkr8y", "created_utc": 1519354044.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "Can someone ELI5 what happened to reits over the last 2 months? Cause I missed this news somehow, wtf", "score": 7, "replies": [{"body": "REITS along with Utilities are basically brought only for the dividend.  That dividend looks less attractive when bond yields rise.  ", "score": 10, "replies": []}, {"body": "No one likes divis in a raising rate environment, they definitely don’t like interest sensitive divis, and they absolutely positively don’t like you.", "score": 4, "replies": []}, {"body": "Yields are rising, armageddon, bears are fucking bulls. Its crazy out here man.", "score": 3, "replies": []}]}, {"body": "Dumped $WPC back in November. Accidentally timed that well. Dumb luck >", "score": 2, "replies": []}, {"body": "Long REIT leaps to bet on inflation", "score": 2, "replies": []}, {"body": "the only wsb approved reit should be $unit.  15 % yield, with possible high upside.  Why?\n\nUnit's largest renter is windstream, a company that leases fiber optic cables.  some guys bought puts on windstream, and also bought up windstreams debt.  They are now forcibly calling windstream on the debt in an attempt to make them go bankrupt.   windstream sued this company for some reason.  if windstream is successful then unit should double overnight.\n\npersonally i have 5 % of my portfolio in this bitch.\n\nBut who cares.  Today i doubled my mu position at 44.15 and i now have 50 % of my portfolio in MU in both calls and stock.", "score": 2, "replies": []}, {"body": "Many REITs themselves are selling off all of their suburban office assets to focus more on industrial properties and offices in CBDs. \n\nThere are values to be had if you're getting discounts to NAV and willing to wait.", "score": 1, "replies": []}, {"body": "As someone who's lost 20k on REITS recently, the type of REITS matter. Anything retail is getting its ass kicked. Big mall, old stand alone strip shopping is a good short. Medical, college or tech REITS seem to be holding value the best in a group of losers. ", "score": 1, "replies": [{"body": "IRM would like to have a word with you. At this point I’m just waiting for lower prices to average down. ", "score": 1, "replies": []}]}]}
{"title": "Long WMT", "selftext": "They are down about 12% since earnings, all because they had a mediocre quarter online (23% growth). But they beat on revenue, same store sales, and guided for 40% online growth this year. They are still the only retailer that can compete with AMZN on price. And as all the shitty brick and morter retailers go under WMT will gain market share. One mediocre quarter doesn't change shit. Currently holding $95 March 16 calls.\n\nDD: https://imgur.com/a/ekrDu (Perrigo is AMZN's private label brand)", "id": "7zl1h3", "created_utc": 1519356740.0, "score": 38, "upvote_ratio": 0.85, "num_comments": 20, "comments": [{"body": "You're suppose to post a screen cap of your position not one of Advil prices.", "score": 60, "replies": [{"body": "DD: there's a blue light special on ibuprofen", "score": 3, "replies": []}]}, {"body": "Team Bezos ", "score": 29, "replies": []}, {"body": "Its all fun and games until Amazon opens up their own stores everywhere.", "score": 13, "replies": [{"body": "They'd never do this.", "score": 5, "replies": [{"body": "> until Amazon opens up their own stores everywhere\n\nLets face it, even if they started right now it would take them a decade to plan, construct, stock, and start the proper distribution networks and come anywhere CLOSE to what Walmart already has.", "score": 7, "replies": [{"body": "Could fast-track that substantially by buying a few major retailers who are going under because of them.", "score": 2, "replies": [{"body": "Possible but I'm not sure Amazon's MO is buying dying businesses, they want to be on the cutting edge I would think.  Of course there's hardly anything cutting edge about brick and mortar chains so who knows?", "score": 2, "replies": []}]}]}, {"body": "I’ve learned to not put anything past Amazon these days.", "score": 2, "replies": []}]}]}, {"body": "They guided for 40% for this quarter too, why should I believe their future guidance? Anytime management has to talk about a \"return to growth; we're very optimistic\" that's when you know to short. No rumor is true until officially denied.", "score": 8, "replies": []}, {"body": "Went April 20 $90. Low enough to wipe out most intrinsic premium. If it stays stagnant I can cash out without a total loss.", "score": 5, "replies": [{"body": "Picked up the same ones myself. I prefer being ITM. ", "score": 1, "replies": []}]}, {"body": "Agreed on most fronts, I'll start off by saying I'm bullish on WMT. It's important to also look at the entire picture, not just specific points. Just to temper expectations, I'd also like to offer up the following.\n\nWMT Revenue year to year since 2015 is relatively flat. That's not a terrible thing given most other stores are declining (due mostly to Amazon), but this is something the market values extremely highly. Revenue stagnation isn't death, but it's also not a great sign. This is something markets like to see increase by double digits year over year. \n\nCurrent PE ratio: WMT is at the top of the industry average for this valuation currently sitting at 29. Costco is just below 30, Target is at 16. To see WMT take off from here and explode past 30 would signal that the industry sees potential in WMT beyond what other similar stores offer (which is possible given their push for online sales). \n\nAll that being said, I don't expect this to go up another 30-40% this year, but I do see this easily rising back to prior highs given that nothing has drastically changed and they're still a healthy company. \n\nConclusion: I'm a buy but with optimistic price target of $100 in the next 2 or 3 months to reach near former highs. That's still a ~ 8% jump in the near term which a lot to ask for. Let's goooooooo", "score": 5, "replies": []}, {"body": "I went with the $95 April 20 calls, but yes I agree", "score": 5, "replies": [{"body": "Same ", "score": 1, "replies": []}]}, {"body": "april 20 92 calls, show me the money baby", "score": 2, "replies": []}, {"body": "Except you posted this on wsb, so see you at $70.", "score": 1, "replies": []}, {"body": "anyone going in on the may calls", "score": 1, "replies": []}]}
{"title": "Let's talk food delivery", "selftext": "Here at WSB, we're always chasing that next hit secular growth story. Well, the answer to the question you didn't ask is **food delivery.** In 2017, it grew 50% with no signs of slowing down. The more food is delivered, the cheaper delivery becomes, the more people use it, etc. It's the Amazon flywheel all over again. \n\nThe question becomes: How to benefit from this trend? I think this is fantastic for the fast food giants that didn't have delivery before. MCD, YUM, QSR, all of which are primed to pump food out at volume and trade at very reasonable valuations. Delivery was a huge boon to the pizza industry, and it will be an even bigger boon to fast food companies that can grow without doing an ounce of CapEx to build out a delivery network. I think going long these companies is the best play in this space, since there is almost no downside at these valuations, and vast upside. I'm especially bullish on MCD since they have been killing it by every single metric.\n\nThe other compelling play is to long GRUB. These guys have been growing at 30%, just posted monstrously good user growth numbers(77% increase!!), and also signed a deal with YUM, which is obviously a huge deal. I think GRUB is fantastic and going to grow. According to McKinsey, 80% of users who sign up with a delivery app stick with it, and this creates very important winner-take-all effects. UberEats has become a very strong competitor, but it does not appear to be stopping GRUB.", "id": "7zl47p", "created_utc": 1519357471.0, "score": 6, "upvote_ratio": 0.81, "num_comments": 19, "comments": [{"body": "grubhub is literally flying to the moon, wish I bought FDs", "score": 10, "replies": []}, {"body": "Doesn’t Square own Caviar? I’ve used that a couple of times (Chicago) and it’s been really great.", "score": 7, "replies": [{"body": "They do, problem is they pay their drivers more than industry standard and actually train them. So that cuts into profits. They’re growing and opening in new markets though . Later this year square is launching an actual point-of-sale system for restaurants(not just the shitty iPad systems) if they pull it off and can get restaurants to switch from all the archaic legacy POS systems they’ll fucking kill it. Restaurants pay a shit load for these, both initial installs and monthly. It’s a huge market and very low margins IF they do it correctly. ", "score": 5, "replies": []}]}, {"body": "How does that market share compare to UberEats?", "score": 1, "replies": [{"body": "Uber eats is limited to larger cities. Grub hub is basically anywhere a restaurant that wants to use it for delivery is located. I have a huge grubhub selection here in upstate NY. Uber eats isn’t even close. \n\nI order way too much delivery. ", "score": 3, "replies": []}, {"body": "Easy... Uber eats is a piece of shit. As someone who has been on either sides of the transaction. It sucks", "score": 5, "replies": []}, {"body": "I have used both and Eats always has a very limited selection for places - because in most cases they’re driving around w/ food in the cars. Not making a trip to/from the restaurant to get your food.\n\nWith GrubHub you’re getting the restaurant’s full menu and someone brings you the food after it’s made at the restaurant.\n\nSource: am lazy fuck who orders delivery too much \n\nEdit: this reply has nothing to do with market share but I just wanted to say this", "score": 4, "replies": [{"body": "Wait, seriously? They just drive around with food and wait for people to order it? ", "score": 3, "replies": [{"body": "I haven't used it for a while due to the limited menu stuff I mentioned. It may vary by city and restaurant but I'm pretty sure this is what it was back when I used it. Since the menus are still not the full restaurant menus I tend to think it's still true.\n\nPlus if you ever get tendies from them you will notice they are v v soggy so I mean if that doesn't convince WSB nothing will", "score": 2, "replies": [{"body": "According to their website, they pick it up from the restaurant. I think the limited food selection may have to do with them trying to be very fast, so only delivering items that the restaurant will be able to have very quickly. Maybe McDonald's served up stale tendies.", "score": 1, "replies": [{"body": "Which means it is probably sitting there already made at the restaurant, waiting to be picked up.\n\nReally I don't know for certain and I'm sure Uber wouldn't advertise it. I do know that the service started out w/ drivers having an inventory of food in temp controlled containers, so that they could be there faster than other services.\n\nBottom line is I'm a lil bitch when it comes to food and the stuff I've gotten from Eats the times I tried it just seemed like it'd been sitting around for a while.", "score": 2, "replies": [{"body": "Wow. Fuck Uber lol. It's good to hear they are deficient in at least one major way; that makes me feel more comfortable about being long GRUB. Uber is such a dumpster fire of a company anyway that I'm not sure how much longer they'll be around.", "score": 1, "replies": [{"body": "Not like you can buy/short shares in Uber anyways", "score": 2, "replies": []}]}]}]}]}, {"body": "I bet they probably have several food orders in the car. Kinda how pizza delivery drivers have several pizzas in their car at any given time to deliver", "score": 1, "replies": []}]}]}, {"body": "Uber is everywhere; Uber is like in Africa and shit. GRUB is just in the US and UK. I believe that GRUB is larger in the US, but expect Uber to eat that foreign market share; the number of downloads is ridiculous. \n\nHere's a [source](https://www.recode.net/2017/10/3/16384050/food-delivery-service-ubereats-grubhub-doordash-city-takeout) that's not too old indicating that GRUB is larger in the US.\n\nThere are also intra-city network effects that make food delivery a fractured market with local winners.", "score": 1, "replies": [{"body": "Consideration: Uber plans to remove drivers someday. Without drivers, do you think they'll still play in the delivery game? They may try to keep drivers around for that, but I doubt drivers could earn enough if they're competing with autonomous autos for the bulk of their fairs.      \n      \nEdit: I know nothing of either market. So, I'm not trying to pump or dumb. Just tossing out a hypothetical.", "score": 1, "replies": [{"body": "I guess it's an interesting question what happens when self-driving does get rolled out nationwide. If Waymo has a monopoly, then maybe they launch their own service and undercut GRUB. If there are multiple manufacturers of FSD vehicles, then I think GRUB still has a place. Right now those Waymo cars are really expensive and not economical for their purpose. I'm sure they'll get the cost down eventually, but knowing Google they may still manage to screw it up.\n\nAlternately, maybe GRUB is seen as a valuable pool of users and an acquisition target for a company like Google.", "score": 2, "replies": [{"body": "> but knowing Google...     \n     \nKnowing Google, they'll get 90% there, and everyone will love it and want it, and beg Google to take their money. Then, Google will abandon the project -- maintaining it just enough to tease the hopeful. ", "score": 2, "replies": []}]}]}]}]}, {"body": "thanks for reminding me of Entrees On-Trays", "score": 1, "replies": []}]}
{"title": "AMZN getting serious resistance at $1,500", "selftext": "Anyone got balls big enough to short or sell calls at $1,500? I sure don't.", "id": "7zr1re", "created_utc": 1519416636.0, "score": 13, "upvote_ratio": 0.85, "num_comments": 13, "comments": [{"body": "It dropped down a tenth of a percent, now don’t risk my gains by posting here faggot. ", "score": 17, "replies": [{"body": "Then cash out you tool ", "score": -5, "replies": []}]}, {"body": "T  \nR  \nI  \nA S C E N D I N G  \nN  \nG  \nL  \nE", "score": 7, "replies": []}, {"body": "not surprised, such a big round number physiological barrier, but it'll pop through it sooner than later. ", "score": 2, "replies": []}, {"body": "I already am go look at my past post", "score": 1, "replies": []}, {"body": "Probably to fuck with options expiring today", "score": 1, "replies": []}, {"body": "WE DID IT REDDIT", "score": 1, "replies": []}, {"body": "[When AMZN closes at 1,500 exactly](http://orig03.deviantart.net/dc69/f/2017/063/b/6/feels_good_man_by_damaimikaz-db173qk.jpg)", "score": 1, "replies": []}, {"body": "Aren’t u ded from shorting Mu?", "score": 1, "replies": [{"body": "I'm holding bags until Monday ", "score": 1, "replies": [{"body": "Are u ded?", "score": 1, "replies": []}]}]}, {"body": "Put option premiums rose 81% apparently. Might be a bad sign. ", "score": 1, "replies": []}, {"body": "I’m on life support", "score": 1, "replies": []}]}
{"title": "AAPL TO $180", "selftext": "Never bet against big Timmy ", "id": "7zrctj", "created_utc": 1519419002.0, "score": 5, "upvote_ratio": 0.69, "num_comments": 12, "comments": [{"body": "Its almost back to the price i bought it at beginning of February. Heavy bags, but there full of fruits.\n\napples....", "score": 12, "replies": []}, {"body": "Fuck! We were making up ground and you had to post this. Now I'm a little frightened that we've cursed it. ", "score": 5, "replies": []}, {"body": "Crap I sold at $174.50 where's the pullback", "score": 3, "replies": [{"body": "pull back was before earnings.\n\nnow we got papa buffett on our side and we gonna fly ", "score": 15, "replies": [{"body": "Papa Buffet might die soon though ", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "What’s ur gains on that ", "score": 1, "replies": []}]}, {"body": "Holding $160 puts for next week. ", "score": 3, "replies": [{"body": "Thanks for the sacrifice!", "score": 5, "replies": []}]}, {"body": "Holding 4/20 175 calls", "score": 2, "replies": [{"body": "how much you pay for em?", "score": 1, "replies": []}]}, {"body": "Holding 4/20 $165 calls ", "score": 1, "replies": []}, {"body": "I bought them before earning for 6.71 so I’m bag holding. ", "score": 1, "replies": []}]}
{"title": "Long $WMT. DD inside", "selftext": "[Walmart is launching online bedding, cosmetic brands in bid for upscale shoppers](https://www.washingtonpost.com/business/economy/walmart-is-launching-online-bedding-cosmetic-brands-in-bid-for-upscale-shoppers/2018/02/23/015b9382-1750-11e8-92c9-376b4fe57ff7_story.html?utm_term=.29f984fc66fd)", "id": "7zs3ys", "created_utc": 1519425070.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 12, "comments": [{"body": "Nah. Short $WMT. Upscale folks won't even consider going on their shithole website for fear of interacting with the poor. Neither will I.", "score": 15, "replies": [{"body": "It's a separate site, I imagine many going there won't even know they're a part of Walmart, akin to bonobos or something of that sort", "score": 6, "replies": []}, {"body": "Never underestimate the power of poor people spending money they don't have on items they can't afford. ", "score": 4, "replies": [{"body": "Poor people don't shop online though, that's why wally world shit the bed on earnings", "score": 3, "replies": [{"body": "> Poor people don't shop online\n\nSource?", "score": 2, "replies": [{"body": "I am poor but I was raised not poor.  I know poor people. They don’t shop online. They give me cash and ask me to buy stuff for them on Amazon because they don’t have credit cards and usually don’t have bank accounts. And if they do, they are overdrawn. Poor people don’t shop online ", "score": 1, "replies": [{"body": "There's a reason why they're poor. They spend all their time at the liquor store, buying scratch tickets and choking on alcohol. They're too braindead (from alcohol) or lazy to discipline themselves, forget about retaining a good credit score for credit card.\n\nYou can give a million dollars to the faggots in the projects, they'll go back to being broke in no time. But hey, they know how to enjoy themselves in those forms (gambling and drinking). Why work hard for the future when you can enjoy it all now? Especially if the government is paying for it all.", "score": 2, "replies": [{"body": "Ugh you’re an asshole but you’re right ", "score": 1, "replies": []}]}]}, {"body": "[Here](http://stock.walmart.com/investors/events-and-presentations/event-details/2018/FY2018-Q4-Earnings-Release/default.aspx)\n\nI worded that incorrectly though, poor people shop online but they're using Amazon too. Walmart needs to go back to catering to poor mexicants who don't have computers", "score": 1, "replies": []}]}]}]}, {"body": "Lol.  If you're on WSB, there's a good chance you either are poor or will soon be poor.  *You* will eventually shop at Walmart out of necessity. \n\nLong AF WMT", "score": 2, "replies": [{"body": "I'll be poor soon if they don't let Lord Shkreli out, this week in investing is the only reason my portfolio is green overall", "score": 1, "replies": [{"body": "Worst case scenario I'll car pool with you to WMT brah ", "score": 0, "replies": []}]}]}]}]}
{"title": "Why is netflix wallstreet’s sweetheart ?", "selftext": "I dont get it. Something that u can just BT without using their service. Sure its cheap $15 a month, seems like its very overvalued in terms of what it does. Of all the FANGS, i think this one is the weakest but yet time and time it just proves me wrong. I do no DD . Enlighten me so i can all in some calls .", "id": "7zsp5m", "created_utc": 1519430259.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 18, "comments": [{"body": "Subscription model is king", "score": 28, "replies": [{"body": "2012 calling. We want our buzzword back", "score": 17, "replies": [{"body": "Yeah but every company that went to a subscription model in 2012 is printing tendies", "score": 16, "replies": [{"body": "$CTAS", "score": 2, "replies": []}, {"body": "tru", "score": 1, "replies": []}]}, {"body": "The micro-transaction model is for the kidz", "score": 1, "replies": []}]}, {"body": "Long ATVI. \n\nDD: World of Warcraft Classic is going to bring in new subscribers. I'm certainly buying that shit. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "Holy shit, hijacking this comment because of the mega autism floating around this thread:\n\nData, it's all about data. Netflix collects tons of data. Data on what people like and don't like, then tailor shows to take advantage of that.\n\nCase in point: house of cards\n\nBefore Spacey was a child diddler, people loved him, people also liked house of cards, the original, political dramas, etc, etc... So they put all that shit together and made a hit show.\n\nRinse and repeat.\n\nNo one else has the data Netflix has and has been collecting for years.\n\n\nThat said, they are overpriced as fuck", "score": 2, "replies": [{"body": "The ol' AMZN strat. Collecting data since 1999 or some shit. ", "score": 1, "replies": []}]}]}, {"body": "Wallstreet is all about future value, the fact that Netflix is expanding into making TV/Movies has some 90 year old fuck thinking that they're going to replace both cable companies and film studios.\n\nAlso they tout a bunch of stupid diversity bullshit.", "score": 14, "replies": [{"body": "I also really like the core underlying message of their programming. Sounds gay but it’s true ", "score": -9, "replies": [{"body": "Bet you think fat chicks should have rights too faggot", "score": 17, "replies": [{"body": "lol", "score": 2, "replies": []}]}]}]}, {"body": "They're succeeding at something that's really difficult-- getting hundreds of millions of people worldwide to fork over for monthly payments. When you see a company that's succeeding time and again against such established giants, it speaks wonders for management and what they are likely to accomplish in the future. Basically, they're a high-powered momentum company that shows no signs of slowing down.", "score": 4, "replies": []}, {"body": "I dunno either. Usually the super overpriced tech stocks have some sort of behind the scenes thing that is the full brunt of their income or price of the stock. Apple has itunes/apps and not the actual iphone/macbook sales. AMZN has their AWS, and not their actual shopping website. TSLA has government contracts, but I believe most of their worth comes from people valuing SpaceX's worth into TSLAs value. The other over priced tech stocks such as google and facebook, isn't so obvious but it's mostly ad revenue I believe..\n\n\nAs for netflix, I don't know what they have. If they actually have something it's very well hidden. But I do highly doubt the money they get from their subscription services can afford to pay for so many netflix original movies/series so there must be a secondary source of income. It's simply wise business practice to not purely rely on subscription service numbers to keep your business afloat. Perhaps Netflix uses their own studio to produce such things and they're gathering money from people who want to use their service to release entertainment. So they not only get money from the subscribers, but also from the producers? While it's the producers who pick up the scraps of profit?", "score": 4, "replies": []}, {"body": "Have you been on Netflix lately? Huge step up in quality content from just a year ago. I’m curious to see how much not having a new season of House of Cards this year will hurt their earnings. Even if they miss it’s worth keeping.... until Apple and Disney launch their streaming service....", "score": 1, "replies": []}, {"body": "I'm pretty sure Netflix is going to go up strictly due to the fact that too many people bought puts and so the marketmakers are driving it up. \n\nIf Netflix dropped, I would have a yacht.\n\nThey won't let that happen..\n\nI must have like 60 puts on Netflix by now.. I lost count..\n\n\n", "score": 1, "replies": []}, {"body": "Ya, you're not going to get any argument from me. \n\nTheir EPS growth is good, but at a forward p/e of 68 while trading at 11x sales, 35x book, and nearly 2:1 debt equity, the stock price makes absolutely no sense to me. \n\nInvestors don't seem to care about any of this though and continue to look towards one thing: subscriber growth. Last quarter showed good international subscriber growth and is now boasting somewhere around 118 million subs. \n\nThe very first quarter they show a subscriber decline, expect this bubble to burst though. It's hard to say when that is, but it's definitely coming, especially with how competitive the digital streaming industry is becoming. ", "score": 0, "replies": []}]}
