{"title": "GUYS I LOVE MICROSOFT", "selftext": "I knew Bull Gates was gonna pull through for us. I think he purposely threw this curveball so he could separate the autists from everyone else.\n\nEDIT: I’m sorry guys, I think I jinxed it\n\nEDIT 2: OOOOOOOOOF", "id": "f3c60l", "created_utc": 1581610095.0, "score": 855, "upvote_ratio": 0.95, "num_comments": 247, "comments": [{"body": "Will I be able to pay my rent tomorrow? Find out next time on Microsoft call 2/14\n\nUpdate: who's got an open couch", "score": 870, "replies": [{"body": "Your parents charge rent? Cold.", "score": 86, "replies": [{"body": "Feel cold fans remember me", "score": 5, "replies": []}]}, {"body": "being poor must suck, sorry about that.", "score": 155, "replies": [{"body": "Rent? Is that paying to stay some where you don't own? Why pay rent.. when rent can pay you?", "score": 90, "replies": [{"body": "Lmao because real estate costs a lot of up front investment that's why we're buying FDs", "score": 45, "replies": [{"body": "Real estate is gay. Mostly for trust fund babies who are morons.", "score": 5, "replies": []}, {"body": "To be fair I didn’t spend a penny on my house. When buying it.", "score": 4, "replies": [{"body": "Yea but you had to serve in the fucking military or you a gift", "score": 1, "replies": []}]}, {"body": "We? I don't buy FDs. I'm not your typical Millennial YOLOer. I actually have a responsibilities. It doesn't cost that much for real estate, maybe buying a 4plex/8plex/or complex. Not so much for duplex. Just cant be poor. hell you can even be broke and do it", "score": -127, "replies": [{"body": "wtf is this cuck talking about?", "score": 99, "replies": [{"body": "Sounds like Boomer shit", "score": 82, "replies": [{"body": "Well Not a boomer, But not part of the bitch Millennial man bun group either.\n\nDamn I upset the man bunners.", "score": -90, "replies": [{"body": "[deleted]", "score": 57, "replies": [{"body": "Your right, you don't know.", "score": -42, "replies": [{"body": "I at least know the difference between you're and your, boomer", "score": 18, "replies": [{"body": "Got me with the grammar, you little twat.", "score": -11, "replies": [{"body": "You really came to wsb talkin about appreciable assets and wealth vehicles. This is TSLAMSFTSPYCALLSHQ. Take this bullshit back to r/personalfinance", "score": 18, "replies": [{"body": "Friend, I have plently of 3/20 200c. Bought those before WSB did. i have 6/19 250c. and just wait. that shit is gonna moon next month.", "score": -7, "replies": [{"body": "Who gives a fuck faggot", "score": 23, "replies": [{"body": "Hey man, he is back on target with sweet sweet music of YOLO calls.\n\nHe probably is suffering from early onset dementia and that was why he was talking trash about real estate.", "score": 12, "replies": []}]}, {"body": "Imagine thinking 3/20cs are WSB material. Go to a real investing sub, scrub", "score": 8, "replies": [{"body": "So dumb.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "dork", "score": 6, "replies": []}, {"body": "8plex isn’t a thing it becomes a commercial property after 4. It’s just condos/apartments at that point you’re very obviously talking out your ass.\n\nAlso air BnBs have ~3x the margin in most areas so you’re not even lying intelligently", "score": 1, "replies": []}]}]}, {"body": "He's one of the stragglers that didn't enter the paper trading contest, unfortunately.", "score": 13, "replies": []}, {"body": "Step 1 of insurance fraud I guess.", "score": 1, "replies": []}, {"body": "Wealth Vehicles. What the fuck are you even doing here?", "score": -14, "replies": [{"body": "Nah fam, you're the one who is out of place", "score": 29, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Rentals are good for passive income, Markets are good for returns, and Businesses I think may be best. Not a business owner yet though.", "score": -1, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "That is what I've read! granted I know very little about it except it will shelter you from a lot of liability. Man, thanks for reminding me about that!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Goals my friend. You’ve summed up my goals. What businesses if you don’t mind me asking?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That’s awesome. Sounds like a great business to be in. I’ve been stuck between a rock and a hard place lately. Trying to decide what type of path I should take. I can’t define my goals, but don’t necessarily know how to get there. Thinking about going back to school", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I’ve been in sales for most of my working life. Auto sales, then started a used dealership, ran it for a little while before running into licensing issues, and ultimately running out of capital. I’ve most recently managed a team of door to door marketing agents for a window company. I enjoyed building teams, coaching/training, and driving results. I’m good at sales, good at building rapport and connecting with people, have an analytical mind, and would consider myself entrepreneurial. There’s decent sales jobs out there, but so many in my area are 1099 with 100% commission.\n\nI had a typo in my last reply. Meant to say I CAN define my goals. Just unsure of how to get there. \n\nI love real estate and plan to build a portfolio of rentals. My dream is to run a business outside of real estate, and funnel that income toward the rentals. It’s all just very capital intensive, and it’s been difficult to find a job that will pay enough to build up the capital needed.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I don’t know anything about it, but I feel like I pick up on things pretty quick. Those are insane commissions. Do you think someone without a degree would be able to get their foot in the door?", "score": 1, "replies": []}, {"body": "I’d love to know a comparable company to one of the startups. I’ve been in adtech sales for a few years and have had some amazing success and solid payout years over $300k but fuck, $4m??? Time to make a switch.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Lol my apartment in SF is worth $1.4M, there’s a reason people rent", "score": 5, "replies": [{"body": "Fuck that mess, never take my family out there, closest we go is Santa Cruz or Marin headlands(place is beautiful) I'm sure you've been there. I'm from Stockton(fuck this mess too)!", "score": 1, "replies": [{"body": "Yeah I bike in Marin almost every day, I really enjoy it", "score": 4, "replies": []}]}]}, {"body": "BAN!", "score": 5, "replies": [{"body": "You've been here for what 5 days? I can talk how ever I like. If I post Ifollow the rules.", "score": -2, "replies": []}]}]}]}, {"body": "Only fools own the house they live in (unless they leverage it to buy more houses of course)", "score": 21, "replies": [{"body": "Owning is good for me. Buy shitty rundown house, remodel, Rent/sell and Repeat.", "score": 7, "replies": [{"body": "Agreed, but you have to live in it for 2 years to flip tax free... Tradeoffs I guess", "score": 14, "replies": [{"body": "Unless you move for work more than 50 miles away, in that case you can sell tax free or limited taxes.I think that's publication 504 or something.  But when we sell our current house and move far away, I'm making sure we drop down a tax bracket, Just encase.", "score": 5, "replies": []}]}, {"body": "BRRRR", "score": 2, "replies": []}]}, {"body": "Hah. I did that. Leveraged my first house to build a guest house. Lived in it two years to hit the minimum for selling tax free. Then rented that compound and leveraged it to buy another house. I’ll sell the compound at year five to maximize the crazy growth in the market but still in the timeframe of having lived in it for 2 of the past 5 years. Then buy more homes or multi family. Move out of my second home after year two... rinse repeat. My wife is pissed that my game plan makes us move every two to three years, but fuck it, you can’t have a house of cards without getting more cards. That’s like what, a teepee?", "score": 2, "replies": [{"body": "Well said friend. I'm lucky that my partner is down with travelling around while we work this strategy.", "score": 1, "replies": []}]}]}, {"body": "This guy fucks, he's yolo'ing with other people's rent", "score": 6, "replies": [{"body": "Yes, I do fuck. Some times make love, but that shits stupid.", "score": 3, "replies": []}]}, {"body": "[LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY LIQUIDITY](https://www.youtube.com/watch?v=Vhh_GeBPOhs)", "score": 8, "replies": [{"body": "That dude got sweaty", "score": 6, "replies": [{"body": "Tendies are a helluva drug. \n\nAlso so is cocaine.", "score": 3, "replies": []}]}, {"body": "jeezus. I mean.....whoa.", "score": 2, "replies": []}]}, {"body": "theta", "score": 5, "replies": [{"body": "Only thing that scares me... Theta.", "score": 3, "replies": []}]}]}, {"body": "It's his choice for not buying MSFT calls that were not retarded", "score": 6, "replies": []}]}, {"body": "Dont worry bruh, friday is always tendies for microsoft.", "score": 7, "replies": [{"body": "I be praying", "score": 3, "replies": []}]}, {"body": "Better start looking into “alternate housing” buddy.\n\nYou can return any tent you buy from REI btw.", "score": 4, "replies": []}, {"body": "nope", "score": 3, "replies": []}, {"body": "If you bought them in the last 2 weeks, you deserve to lose your home.", "score": 9, "replies": [{"body": "it’s okay, his wife’s boyfriend is gonna catch the rent this month.", "score": 17, "replies": []}, {"body": "180 was a good buy in, they still up from that", "score": 1, "replies": []}]}, {"body": "Looks like you’ll be sucking dicks for a pillow and a blanket on the mean streets of Dicksuckistan.", "score": 2, "replies": []}, {"body": "No open couch but my butthole is pretty fucken wide open atm", "score": 2, "replies": []}, {"body": "I sold my 2/14 calls at a prime time on Monday then bought 3/20 calls cause it was still going up then it went down and I bought 2/21 calls thinking I was buying the dip.. now I just feel retarded", "score": 2, "replies": []}, {"body": "Where you at. I need some advice to inverse", "score": 1, "replies": [{"body": "I pretty much lost my gains but I’m hoping for big things not worried about 3/20 maybe buy more somewhere post March to offset any losses incurred", "score": 2, "replies": []}]}, {"body": "Krillin died again wtf", "score": 1, "replies": [{"body": "That's the nickname for my savings account", "score": 3, "replies": []}]}]}, {"body": "2/21 calls are back in action.... I love this shit. Hoping this thread stays right below the daily discussion so all of the cuck lords who sold while down (down for less than 72 hours) can drip sweat from their fucking tips for lacking balls and brains. lets go kings.", "score": 91, "replies": [{"body": "Got me some 2/21 $220 calls, maybe a bit aggressive but need tendies", "score": 23, "replies": [{"body": "Say goodbye to your money", "score": 66, "replies": [{"body": "doing so now", "score": 20, "replies": [{"body": "Tell it you love it! Be a man 💪", "score": 4, "replies": []}]}]}, {"body": "GUH", "score": 16, "replies": []}, {"body": "So I've been doing research on this as I'm still a newbie, but why would you do a 220call over a 200?", "score": 13, "replies": [{"body": "Mostly because I'm retarded", "score": 33, "replies": []}, {"body": "Cheaper premium.", "score": 9, "replies": [{"body": "This but for real", "score": 10, "replies": []}]}, {"body": "Because tendies", "score": 2, "replies": []}]}, {"body": "And here I am sweating my 2/21 $190.", "score": 9, "replies": [{"body": "Yeah I'm basically mega fucked", "score": 2, "replies": []}, {"body": "Same", "score": 1, "replies": []}]}, {"body": "you thought microsoft, with a market cap of over 1.4T, would rise almost 20% in a week? what the fuck man why", "score": 6, "replies": [{"body": "No I didn't think it would rise that much realistically, but I thought the court case would go the other way and it would rise enough short term so I could take 25% profit and run", "score": 3, "replies": []}, {"body": "We were thinking the same thing before TSLA shot up $500 a share in less than a month.", "score": 2, "replies": [{"body": "What is marker cap", "score": 1, "replies": [{"body": "Goes on top of markers?", "score": 1, "replies": []}]}]}]}, {"body": "“Oof”", "score": 1, "replies": [{"body": "*GUH", "score": 3, "replies": []}]}]}, {"body": "3/20 calls are sounding better and better by the day. 2/21 should be ok, I believe they will report back on 2/20 and if that goes well you should be golden if it’s announced early enough..", "score": 8, "replies": [{"body": "4/20 sounds even better, funding secured..", "score": 3, "replies": [{"body": "I'm sitting with 185c for 7/17. High premium, but I only need a couple of tendies.", "score": 1, "replies": []}]}, {"body": "Loaded up on 3/20s", "score": 2, "replies": []}]}]}, {"body": "MSFT for the last year: Here's steady $6.5 growth per month\n\nMSFT the week WSB puts their 401ks on calls: Check out this $8 dip bitches", "score": 73, "replies": [{"body": "Luckily I bought mine last week and does not expire for a month. Was up about 140% on Tuesday and stupidly did not sell but still up around 60% because I did not buy at the top with a short expiry like all these cry baby autist fucks in hurrr\n\nDo not buy FD's guys. Always, always at least a month out of more.\n\nShit, my $240 Visa calls expiring in September have been fucking printing and because expiry is so far I do not have to check the price every two seconds like on weeklies", "score": 21, "replies": [{"body": "Yeah bought my first call last week for 2/28 expiry, sold on Tuesday for some sweet tendies then stupidly put the gains back into a mid-March call while the share price was still in the 187 range. The FOMO was real and I was weak.\n\nThere's still a good amount of time, but between buying at the peak and rising theta I'll be happy just to break even.", "score": 3, "replies": [{"body": "Same boat here, was up 40% now down 60%  wooo", "score": 3, "replies": []}, {"body": "Hey man, at least you were not stupid like me and took the gains to rebuy with a longer strike. My call is a $190 strike, was ITM on Tuesday and did not fucking sell. I am down like a mother fucker. FIRST time I did not take gains when up over 100% and I got ass fucked. Feel so stupid..\n\nMine is mid march too. Thought for sure it was gonna keep going up, first time I did not panic sell when I saw it drop. Now I am barely above even.\n\nNever being greedy again", "score": 1, "replies": []}]}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "[deleted]", "score": -7, "replies": [{"body": "Your mom does cause she wants upfront payments, bitch.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Shitty plays?Lost all my money? LOL. Bitch, the 5% of my portfolio I play long term options with is probably worth more than 100X your whole net worth\n\nI made some shitty plays in the beginning buying weeklys, have yet to loose money on long term calls.\n\nI fucked up by not selling MSFT for a 140% gain on Tuesday but guess what? I am still above break even with a month to go to expiry\n\nSMD", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I can post screenshots of my two trading accounts but I do not really care if you do not believe me lol. I have done very well for myself. Not trading options, I could have if I was stupid enough to YOLO but I love my money too much to set it on fire. \n\nI am a small player, I admit that. MY gain porn is not worthy at all to be posted. But, I know for a fact I have a much higher net worth than most of the fucking autists I see on here panicking that their one weekly contract they bought for a couple hundred bucks is gonna end up worthless", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Sir, I ordered the extra large tendies, this is just a regular tendies", "score": 140, "replies": [{"body": "haha, hopefully our supersize tendies hit after the announcement today", "score": 28, "replies": [{"body": "HEY WTF HAPPENED TO MY TENDIES?\n\nI WENT TO GET SOME CELEBRATORY COFFEE AND DROPPED 7%", "score": 17, "replies": [{"body": "Asshole. Your fault.", "score": 8, "replies": []}]}]}, {"body": "I'd like a #6 and a large McTendies.", "score": 7, "replies": []}, {"body": "Sir this is a Taco Bell", "score": 10, "replies": [{"body": "Get with the fucking times \n\nhttps://www.thrillist.com/news/nation/taco-bell-crispy-tortilla-chicken-tenders", "score": 17, "replies": []}]}]}, {"body": " **Capitalism**: God's way of determining who is smart and who is poor.", "score": 168, "replies": [{"body": "But all the retards are rich", "score": 75, "replies": [{"body": "That's just the cocaine that made them retarded after the fact.", "score": 46, "replies": [{"body": "The American dream.", "score": 27, "replies": [{"body": "City on the hill", "score": 8, "replies": []}]}, {"body": "when you're too smart so you nerf yourself", "score": 6, "replies": []}]}]}]}, {"body": "This aged well you fucking autist.", "score": 28, "replies": []}, {"body": "It's Satya Nutella busting a nut for Bull Gates to spread open his hole of glory 💦💦🚀😫👌", "score": 37, "replies": [{"body": "This is freaking gay.  I approve.", "score": 19, "replies": []}]}, {"body": "So fucking sick bro. Up like 0.4% today. Massive gains.", "score": 16, "replies": []}, {"body": "Ride or die baby, and daddy gates will have no blood on his hands today", "score": 36, "replies": [{"body": "Another dip is coming and I'll buying bucket loads more.", "score": 11, "replies": [{"body": "Why do you say another dip is coming", "score": 2, "replies": [{"body": "It nearly hit 187 but I'm buying more since it's back at mid 185.", "score": 4, "replies": []}]}]}]}, {"body": "You. Fucking. Retard.", "score": 11, "replies": []}, {"body": "Still need a big jump", "score": 10, "replies": []}, {"body": "fuck off retard look what you did", "score": 10, "replies": []}, {"body": "r/agedlikemilk", "score": 13, "replies": []}, {"body": "Fingers crossed! Got 3 contracts 👌", "score": 10, "replies": [{"body": "Get them tendies boy", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I picked up a few more today. At 7 now", "score": 1, "replies": []}]}]}, {"body": "MSFT ATH tomorrow 👌", "score": 15, "replies": [{"body": "Guh", "score": 5, "replies": [{"body": "MSFT pre market, this is the way", "score": 3, "replies": []}]}]}, {"body": "Wish me luck fellas! 2/14 @ 192.5 call. Currently it’s worthless and I’m down 92%!! Woohooooo\n\nEdit: currently down 95% *Chuckle I’m in danger*", "score": 8, "replies": []}, {"body": "Alright who made the 20,000 3/20 $200 call play... I know it was one of you! \n\n [https://finance.yahoo.com/news/large-options-traders-playing-microsoft-194531548.html](https://finance.yahoo.com/news/large-options-traders-playing-microsoft-194531548.html)", "score": 8, "replies": [{"body": "That article has 0 comments; is it because the readers are more retarded than those on here?", "score": 2, "replies": []}]}, {"body": "Just sold all my spce stock and bought msft calls on this dip... am i autistic", "score": 7, "replies": [{"body": "I kept my SPCE longs and I'm happy.", "score": 2, "replies": []}, {"body": "pt 2. will i get the tendies??", "score": 1, "replies": [{"body": "strike and expiration?", "score": 2, "replies": [{"body": "3/20 200 calls babyyyyyyyyyyy", "score": 2, "replies": [{"body": "Yeet it to believe it", "score": 1, "replies": []}]}]}]}]}, {"body": "why do y’all have such short dated calls. you gotta roll them joints when the expiration date is closing in", "score": 6, "replies": []}, {"body": "Microsoft is the only stock that both autists and institutions can't get enough of. Frankly they made it way too obvious that its ripping, and everyone put their PTs at $200 at the same time. So its as close we have to a sure thing that it'll hit that, and I believe that's why the IV has been so high as well. The only way MMs can make money when everyone is buying calls and going straight up is to make them hella expensive. I don't imagine the block on the JEDI contract was entirely unexpected, nor do I think it'll last, but one never knows. Anyway good luck soldiers. I have 6 figures on both this and facebook, which I think is just as good with much lower IV. Also please stop buying 200s and 220 calls. Just buy right atm 2-3 weeks out. That's how I made my millions. Peace", "score": 5, "replies": [{"body": "Facebook. Very smart, especially if they pull off the banking. Kinda don't want to think about it.", "score": 2, "replies": []}]}, {"body": "My 195 c 2/21 ain’t looking so bad. Bull gates.\n\nEdit: bear gates 😭😭", "score": 18, "replies": [{"body": "[deleted]", "score": 35, "replies": [{"body": "Is 190 fucked tho", "score": 7, "replies": [{"body": "that's a coin flip, if the JEDI verdict is in MSFT favor should be safe for 190.", "score": 3, "replies": [{"body": "Turns out it's not", "score": 3, "replies": []}, {"body": "JEDI verdict won’t lift things but it could sink it to $130", "score": 0, "replies": [{"body": "did you say that cos 130 are the cheapest put you could buy?\n\nBut yea JEDI won't lift it much but we might get a 185 pop", "score": 3, "replies": [{"body": "We’re at 185 today already you autist", "score": 2, "replies": [{"body": "fine 186", "score": 3, "replies": [{"body": "You dreaming big now", "score": 2, "replies": []}]}]}]}, {"body": "Lol 130? This contract is less than 1% of Microsoft’s annual revenue", "score": 2, "replies": [{"body": "In that case all this hype up about Jedi was pretty silly", "score": 1, "replies": []}]}]}]}]}, {"body": "Low key I was regretting not buying further out like 2/28 or 3/06.  But I think 2/21 will do for now.", "score": 4, "replies": [{"body": "Month out minimum for that large of a swing,.", "score": 5, "replies": []}]}, {"body": "3/06 200?", "score": 2, "replies": [{"body": "Start selling against it.\n\nEvery week sell the 200c weekly until you get to expiration week, then go 1 strike over. If it never gets to 200, you just collect sweet premium to offset your purchase. Your delta will always be positive as long as long as you keep both options at the same strike, so you're still bullish. You'll also get your feet wet in theta gang as the weekly's decay faster, you will always have a positive theta", "score": 6, "replies": [{"body": "That just sounds like making no money but with extra steps", "score": 8, "replies": []}, {"body": "I understand what you're saying but how do I get my brain to think this way in the future.", "score": 3, "replies": [{"body": "I do it with just about every position I open. Why would I not let my money work for me?\n\nMsft 200? Probably eventually. Msft 200 by next week? Probably not. Buy 200 in march and sell the next week one. MSFT goes sideways for a week? Do the same thing next week. Msft went up 5% this week? Do the same thing with a strike 5% higher. Just keep following the market. You can sell lower strike than your long dated call if you have the risk tolerance for it.\n\nThe longer dated call will always have a higher delta and the shorter dated call will almost always have a higher theta. Even on sideways days or slightly red days, your bull position will make money", "score": 3, "replies": []}]}]}, {"body": "I'm holding 3/27 200 and 4/17 180", "score": 1, "replies": [{"body": "Guess I meant more am I fucked on 3/06 200 lol. I am sweating.\n\n3/27 200 literally can't go tits up", "score": 2, "replies": [{"body": "Ohh, well you need 3% a week to pull off 3/06 200, so it's possible but better play end of march april for 200 calls", "score": 2, "replies": []}]}]}]}]}, {"body": "I switched to 2/28 from 2/21 yesterday, no regrets.", "score": 2, "replies": []}, {"body": "I’ve got 195 2/28🤞🏻", "score": 2, "replies": [{"body": "This is the way", "score": 1, "replies": []}]}, {"body": "Got the same, when you selling? Down 40% total rn lmao thinking I won’t weather the weekend", "score": 1, "replies": []}, {"body": "Odds of me getting fucked on my 192.5c 2/28?", "score": 1, "replies": []}]}, {"body": "Lmao I held and today i literally lost everything. Go Gates though. Hurray for 2/14 calls", "score": 4, "replies": []}, {"body": "judge blocks the contract\n\n&#x200B;\n\n [https://www.cnbc.com/2020/02/13/amazon-gets-restraining-order-to-block-microsoft-work-on-pentagon-jedi.html](https://www.cnbc.com/2020/02/13/amazon-gets-restraining-order-to-block-microsoft-work-on-pentagon-jedi.html)", "score": 5, "replies": []}, {"body": "JEDI contract on hold, boys and girls. Let us bow our heads and pray this is only a minor setback.\n\n[https://www.cnbc.com/2020/02/13/amazon-gets-restraining-order-to-block-microsoft-work-on-pentagon-jedi.html](https://www.cnbc.com/2020/02/13/amazon-gets-restraining-order-to-block-microsoft-work-on-pentagon-jedi.html)", "score": 5, "replies": [{"body": "idk why anyone would think it would go through. the JUDGE was APPOINTED BY OBAMA. Anyone that looked at her wiki page would know she'd block it.", "score": 2, "replies": [{"body": "I made the dumbass assumption that any judge would hate AMZ, guess fucking not.", "score": 1, "replies": [{"body": "I sided with DoD. I think my 3/20 call is still safe. Not playing with big money. I have a small dick.", "score": 1, "replies": []}]}]}]}, {"body": "good job, asshole", "score": 5, "replies": []}, {"body": "Pour one out for our 2/14 homies. Your wallets died for our sins.", "score": 5, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "I'm beginning to think \"buy MSFT until I am out of money\" was not a good longterm strategy.", "score": 5, "replies": []}, {"body": "6/19 250c. Riding big dick daddy gates to the moon", "score": 4, "replies": []}, {"body": "Where is the court ruling on the whole MSFT JEDI bullsh!t? Happening today?", "score": 3, "replies": [{"body": "Seriously. hurry it tfu.", "score": 5, "replies": []}, {"body": "Well fuck lol", "score": 5, "replies": []}, {"body": "Not out yet", "score": 2, "replies": []}]}, {"body": "I don’t know what I’ve been told \n\nI DONT KNOW WHAT I BEEN TOLD \n\nMsft gang needs to be consoled\n\nMSFT GANG NEEDS TO BE CONSOLED\n\nI don’t know but it’s been said\n\nI DONT KNOW BUT ITS BEEN SAID\n\nSpce gang getting fucking fed \n\nSPCE GANG GETTING FUCKING FED", "score": 5, "replies": [{"body": "You have an awesome username have a great day", "score": 2, "replies": []}]}, {"body": "SPCE is where its at tbh. My gains are starting to get a bit crazy", "score": 6, "replies": []}, {"body": "I bought some calls and immediately on a different tab \"breaking news JEDI contract put on hold by judge\" smh", "score": 3, "replies": []}, {"body": "F for msft call holders rn", "score": 3, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "Aged like ancient milk", "score": 3, "replies": []}, {"body": "Well hopefully I’ll at least get back to 0 on my 4/17 200C", "score": 2, "replies": []}, {"body": "Trying to decide if I wanna average down my 03/20 200s \n\nBought em near the top", "score": 2, "replies": []}, {"body": "😂😂😂😂", "score": 2, "replies": []}, {"body": "So sell all my 3/20 and 3/6 calls?", "score": 2, "replies": [{"body": "Hold strong friend. At least the 3/20s.", "score": 2, "replies": []}]}, {"body": "It's barely a fucking 0.58% drop you fuckgots.", "score": 2, "replies": []}, {"body": "I bought puts at close. All of you guys are going to make bank tomorrow. you welcome", "score": 2, "replies": []}, {"body": "This is just our saviour Bull Chad Gates setting a trap to cull the gay bears of evil. Have faith young one, have faith  🙏🏻", "score": 2, "replies": []}, {"body": "Thank you Nutella. I loaded up on calls far before it was mentioned here. $175s were cheap back then", "score": 2, "replies": []}, {"body": "[https://i.imgflip.com/1oh7h.jpg](https://i.imgflip.com/1oh7h.jpg)", "score": 2, "replies": []}, {"body": "Bezos can't fuck with TRUMP. \n\nhe just made Trump even more wanting msft.", "score": 2, "replies": []}, {"body": "$197.5 3/6 leggo", "score": 3, "replies": [{"body": "Godspeed autist, godspeed.", "score": 4, "replies": []}, {"body": "Same call, right there with you brother.", "score": 1, "replies": []}]}, {"body": "Judge blocked MSFT pentagon deal. SELL SELL SELL", "score": 2, "replies": []}, {"body": "Thank you.", "score": 1, "replies": []}, {"body": "Turn that **$ROPE** upside-down we might just end green lads.", "score": 1, "replies": []}, {"body": "334 puts for tomorrow. Sell EOD. Buy calls EOD. Repeat next week.", "score": 1, "replies": []}, {"body": "Here we go bois.  Next stop tendieville", "score": 1, "replies": []}, {"body": "Trust.", "score": 1, "replies": []}, {"body": "you ded", "score": 1, "replies": []}, {"body": "Why is it going down wtf", "score": 1, "replies": []}, {"body": "I've started noticing the huge amount of edits in this subreddit lol.", "score": 1, "replies": []}, {"body": "Thanks", "score": 1, "replies": []}, {"body": "eek", "score": 1, "replies": []}, {"body": "Well, it seems the Pentagon just decided you were too happy", "score": 1, "replies": []}, {"body": "Soooooo.... about that", "score": 1, "replies": []}, {"body": "Ouch my balls", "score": 1, "replies": []}, {"body": "Theta gang. Thx for buying a bunch of worthless contracts, pussies.", "score": 1, "replies": []}, {"body": "Thank you Satya Microsoft! Very cool!", "score": 1, "replies": []}, {"body": "So you don't like macrohard?", "score": 1, "replies": []}, {"body": "If you love MSFT so much why don't you marry it?", "score": 1, "replies": []}, {"body": "Consider yourself separated, retard.", "score": 1, "replies": []}, {"body": "BULL GATES \n\nJEFF BULLZOS\n\nELONG MUSK", "score": 1, "replies": []}, {"body": "i need to find away to knock myself out so I dont wake up till Saturday. 2/14 is gonna a rough one.", "score": 1, "replies": []}, {"body": "GUH... just.... GUHHHHH!", "score": 1, "replies": []}, {"body": "Is there any update on the stop work ruling??", "score": 1, "replies": [{"body": "Havent seen yet", "score": 2, "replies": []}]}, {"body": "Im at 190 for tomorrow how fucked am i still? Nevertheless never sell stocks can only go up.", "score": 0, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Wait till u hear i first had 187 calls for tomorrow and cancelled them cause i put the wrong bank account 🤷‍♀️", "score": 0, "replies": []}]}]}, {"body": "FUCKING REKT", "score": 0, "replies": []}, {"body": "Any update on JEDI?", "score": -3, "replies": [{"body": "Whats with people constantly asking this? Its annoying. Use your autistic fucking brain and reason that IF they even do it today, AT LEAST one of the no-lifes on this sub would catch wind and make a shitpost on whether MSFT is going to the moon or tanking for another 2 days. So just shut the fuck up and go back to lurking.", "score": 14, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}, {"body": "Judge just blocked the contract", "score": 2, "replies": []}]}]}
{"title": "[DD] AMD is going UP this week.", "selftext": "Why are any of you autists not buying into AMD/talking about it? \n\n**Notable bullet points** \n\n*  Apples putting AMD chips in the new MacBooks. (short intel soon)\n-- https://www.digitaltrends.com/computing/why-apple-should-ditch-intel-for-amd/\n* AMD's chip technology is the current best in the market.\n--https://www.digitaltrends.com/computing/amd-vs-intel/\n* New chips in BOTH the PS5/XBOX X\n* Continuous Growth \n* Intels a boomer company\n* Nvidia HOLDS the market. They love AMD. The CEO of amd is literally the niece of Nividas CEO. Forced Partnership.\n* Analysts Price Target of $66 - Raised Constantly.\n\n \n\"I can't read, please just tell me what to buy!\"\n- \nIt's simple. Squeeze Short, High Cheap Long.\n\n- **02/28 - Calls $62 -** Under. Realistically we can expect the margin to close. There will be some hesitation, trust me. \n-/\n* **03/27 - Calls $60-66** . After hesitation the news will start spreading. People will push to at least close margin. \n* Yearlies if you didn't already make thousands off of the initial calls. \n\n\n**I'll ask again. Do you not want free money?**\n----\nLiterally can't go tits up. Trust me.", "id": "f5egjw", "created_utc": 1581969096.0, "score": 557, "upvote_ratio": 0.96, "num_comments": 248, "comments": [{"body": "Im posting from the small wifi corner of my flooded apartment. I bought 5000 shares of AMD while being a fake tutor for rich people.  My dad is currently trapped in the panic room in the rich person's home. My sister died and my mom and I need AMD to go to the moon.  So that we can buy the house and free my dad. It's his only hope.", "score": 266, "replies": [{"body": "my text to speech translate isn't working what are you saying", "score": 105, "replies": [{"body": "It's a reference to the movie Parasite", "score": 43, "replies": [{"body": "I haven't seen that anime", "score": 44, "replies": [{"body": "Great anime, not sure about the movie.", "score": 14, "replies": [{"body": "Anime is way better", "score": 5, "replies": []}, {"body": "I can't subtitle", "score": 1, "replies": [{"body": "META!!!", "score": 1, "replies": []}]}]}]}]}, {"body": "Thanks for this", "score": 1, "replies": []}]}, {"body": "Should have never threw away that lucky money rock.", "score": 22, "replies": []}, {"body": "Fucking hilarious", "score": 12, "replies": []}, {"body": "Gochu", "score": 5, "replies": [{"body": "Donggumong", "score": 5, "replies": []}]}, {"body": "thoughts and prayers 🙏 autist", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 174, "replies": [{"body": "Buy SPCE calls", "score": 35, "replies": [{"body": "I got 32c 2/21", "score": 18, "replies": [{"body": "You can’t be this idiot.", "score": 16, "replies": [{"body": "It's $30.71 pm right now lol", "score": 9, "replies": []}, {"body": "!RemindMe 1 day", "score": 12, "replies": []}]}, {"body": "How much money you made? I should’ve listened lmao", "score": 3, "replies": []}]}, {"body": "is it too late for me to get into SPCE?", "score": 5, "replies": [{"body": "I’m not sure tbh. See how it is tomorrow the first one hour it opens up and take it from there. I’m going long no matter how it goes down. I’m not selling my long calls I mean", "score": 14, "replies": [{"body": "thank you", "score": 4, "replies": [{"body": "Yea. You could buy when it dips tomorrow. I think\nSPCE might take a beating in the coming weeks but should be fine in the long run. I could be wrong. I hope I am but see how it goes.", "score": 5, "replies": [{"body": "why do u think SPCE takes a beating in the coming weeks?", "score": 1, "replies": [{"body": "My guess is he's assuming they'll drop after earnings Tue Feb 28th.", "score": 3, "replies": [{"body": "yeah it might, I'm debating on buying calls and then selling right before earnings to take advantage of IV but there is the Thurs announcement that could also be a key mover", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Well I got 2/28 $70's. So I hope it just takes the fuck off", "score": 3, "replies": [{"body": "how can someone be this stupid?", "score": 0, "replies": [{"body": "I took profit on it", "score": 1, "replies": []}]}]}, {"body": "Son you're adopted", "score": 3, "replies": []}]}, {"body": "Also that shit is going in the new PS5, and Series X. Market domination!", "score": 97, "replies": [{"body": "From what I recall, the margins on those chips are extremely low - AMD was in the Xbone and PS4 as well", "score": 46, "replies": [{"body": "Margins will be much better using the 7nm process versus the 28nm they used for last generation consoles.", "score": 27, "replies": [{"body": "Based on what? Everything else being equal smaller process = higher yield. But everything else is not equal. This generation will be significantly more complex than last gens chips, which were historically underpowered due to AMD not having a good big core at the time, and 7nm fab space is apparently pretty competitive, which will drive up cost.", "score": 27, "replies": [{"body": "Just my 2 cents. But their more complex architecture design is a larger up front cost that should be subsided over the years selling the new gen consoles. And for the 7nm fab space when Apple moves to 5nm, that should open up capacity for AMD.", "score": 6, "replies": []}, {"body": "is this actual DD?\n\nban", "score": 16, "replies": []}, {"body": "smaller fab process is also fking expensive because yield per wafer gets smaller and smaller because some fuckwads loose skincells fries half the chips", "score": 2, "replies": []}]}]}, {"body": "It was a entirely different set of chips.  The \"Jaguar\" was trash.\n\nDon't tell R/amdstock I said that.", "score": 4, "replies": [{"body": "I think most of amdstock would agree, which is why there's anticipation of higher margins with a proper CPU.", "score": 5, "replies": []}]}]}, {"body": "Amd has been supplying those consoles since the beginning of time.", "score": 13, "replies": [{"body": "My GameCube still has an AMD sticker on it <3", "score": 8, "replies": [{"body": "you mean ATI right? ATI bought the company developing the graphics chip for GC and then the ATI sticker was slapped on it.  \n\n\nyes ATI is now a part of AMD", "score": 9, "replies": [{"body": "Yes you're totally correct! My mistake I tend to consider them one and the same", "score": 3, "replies": []}]}]}]}, {"body": "there's very little money in that, though.  on the hardware side, at least.", "score": 4, "replies": [{"body": "Good thing short-term stock price is driven by news and not something rational like sales numbers. ;)", "score": 3, "replies": []}]}, {"body": "This isn't going to be that big of a difference maker. They have been supplying chips for consoles for a long while now. The biggest area that AMD is going to fuck Intel is in the server space. They are continuing to penetrate those servers with their EYPC offering and Google, Amazon, and Microsoft are taking it with a smile on their face.", "score": 2, "replies": []}, {"body": "Oh shit", "score": 1, "replies": []}]}, {"body": "The Nvidia CEO is not my uncle. I don't know when people will stop saying that.", "score": 64, "replies": [{"body": "Hi Su, u whispered \"AMD to $100 by EOY\" to my ears last night. Is this true? How hard should I yolo?", "score": 18, "replies": []}, {"body": "He can be my uncle.", "score": 4, "replies": []}]}, {"body": "Apple deal is far from a sure thing, just a rumor at this point. Still long AMD though, they're about to leave the boomers over at intel in the dust.", "score": 36, "replies": [{"body": "Buy the rumor..", "score": 11, "replies": [{"body": "Sell the guh", "score": 8, "replies": []}]}]}, {"body": "Disclaimer: free money is for the option writer.", "score": 82, "replies": [{"body": "Don't tell them our secret", "score": 13, "replies": [{"body": "theta kappa gamma", "score": 4, "replies": []}]}]}, {"body": "[removed]", "score": 22, "replies": [{"body": "it would be un-American not to.", "score": 33, "replies": []}, {"body": "hope you didnt do this but if you did you’ve probably already shot your self in your dorm", "score": 2, "replies": []}]}, {"body": "80c 7/17 let’s print these tendies baby", "score": 20, "replies": [{"body": "4/17*", "score": 12, "replies": [{"body": "I'm right there with ya on 4/17", "score": 6, "replies": []}, {"body": "7/17*", "score": -1, "replies": [{"body": "2/17*", "score": 7, "replies": [{"body": "Shittt you exercising those pleighboi?", "score": 9, "replies": []}]}]}]}]}, {"body": "Ya'll are too late, I've been sitting on 4/3 $60 calls for like a week now.", "score": 33, "replies": [{"body": "N I C E", "score": 9, "replies": []}]}, {"body": "Lol if this is the next meme stock, I'm fine with that. About to go plop $25k on this.", "score": 52, "replies": [{"body": "AMD was a meme stock", "score": 36, "replies": [{"body": "It’s still a meme stock.", "score": 36, "replies": [{"body": "Will always be a meme stock.", "score": 10, "replies": [{"body": "The best one", "score": 3, "replies": []}]}]}]}, {"body": "You weren't here 6 weeks ago huh", "score": 66, "replies": [{"body": "You weren't here 104 weeks ago huh", "score": 48, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "What was that penny stock biotech with the goofy video of them piling into a van or something running trials based on cherry picked data for injecting Teflon into your blood that shkreli told everyone was a scam but they all dumped money into it anyway... Good times.", "score": 5, "replies": []}]}]}]}, {"body": "This has been a meme stock since 2017. Many a good man were lost from the $10 -$15 year long chop and the 30 to 17 drop.", "score": 24, "replies": []}, {"body": "It's been an ongoing meme stock for over a year. Will continue to be until the music stops.  \n\nIn Subae we trust.", "score": 15, "replies": [{"body": "It’s been an ongoing meme stock for three years at least.", "score": 10, "replies": [{"body": "Only three? There were guys gambling their allowance on AMD back when the 8350 was their top end.", "score": 6, "replies": [{"body": "People were bullish on AMD in the Bulldozer days? Jesus. They should've at least waited until Jim Keller left AMD after designing Zen for them.", "score": 2, "replies": [{"body": "There were tons of AMD fan boys that were convinced that the next thing would moon AMD. Eventually they were right. It wasn't until the Vulkan stuff and that Battlefield showcase with the FPS improvements that people saw real potential, at least from what my dumb ass remembers.", "score": 3, "replies": []}]}]}]}]}, {"body": "This thing has been on WSB since $2 like 4 years ago", "score": 7, "replies": []}, {"body": "Just let me buy back my sold calls first, then bake it away, toys.", "score": 1, "replies": []}, {"body": "kyute", "score": 1, "replies": []}, {"body": "You mean back to the old meme stocks", "score": 1, "replies": []}]}, {"body": "I smell tendies", "score": 10, "replies": []}, {"body": "I have 60c 3/27", "score": 8, "replies": [{"body": "60c 3/20 for me", "score": 4, "replies": []}]}, {"body": "Those SPCE rockets running on AMD chips powering MSFT software can’t come soon enough!", "score": 8, "replies": []}, {"body": "Su Bae is the way", "score": 5, "replies": []}, {"body": "How is this supposed to print money when ITM is barely 2-3x return?", "score": 6, "replies": [{"body": "take 2-3x ur credit card limit as a loan and buy calls to triple x9 your net worth.", "score": 14, "replies": [{"body": "Instant pay off and a credit bump", "score": 3, "replies": [{"body": "did somebody say bump", "score": 4, "replies": [{"body": "Let's gooooooo! Bust it out", "score": 1, "replies": []}]}]}]}]}, {"body": "This aged well", "score": 6, "replies": []}, {"body": "PRICED IN. \nBut yeah, AMD will hit 100 this year", "score": 13, "replies": []}, {"body": "you son of a bitch, I'm in", "score": 16, "replies": []}, {"body": "Every time I see a hype post like this the stock tanks. See MSFT from last week.", "score": 6, "replies": [{"body": "MSFT went up quite a bit before it tanked. A lot of us made good money off that. And SPCE.", "score": 5, "replies": []}, {"body": "Then buy puts, retard.", "score": 6, "replies": [{"body": "I managed to double my investment with a well timed put on MSFT last week. Nothing major, but doubling is doubling.", "score": 2, "replies": []}]}, {"body": "So you havent seen all the SPCE posts", "score": 1, "replies": []}]}, {"body": "Bruh u really just made me 30%. Have a silver.", "score": 6, "replies": [{"body": "hold steady cowboy we ain’t done yet 🤠", "score": 2, "replies": [{"body": "Yessir", "score": 1, "replies": []}]}]}, {"body": "you’re a legend, i’m already up a grand with just 500 dollars worth of calls.", "score": 6, "replies": [{"body": "you’re smart for listening. enjoy the hookers", "score": 5, "replies": []}]}, {"body": "Gotta read more carefully though:\n\n> All of this is just fantasizing of course. There’s no indication that Apple would make such a move. Yes, Apple has been looking for alternatives to Intel — but the rumor mill has been pointing more toward Apple creating its own ARM-based processors for its MacBook line.\n\nWould be nice if it happens though as I have stock in AMD but they may end up making their own chips.", "score": 11, "replies": [{"body": "https://www.techradar.com/news/apple-macs-could-ditch-intel-cpus-and-switch-to-amd-going-by-clues-in-macos\n\n\"Apple could make Macs with AMD rather than Intel processors in the future, at least if clues spotted in the macOS operating system are anything to go by.\n\nAs highlighted on Twitter by @_rogame, a well-known leaker, the code for the macOS Catalina 10.15.4 beta contains various references to AMD’s APUs (which stands for Advanced Processing Unit – the firm’s name for a CPU with integrated graphics).\"\n\napple doesn't waste dev time.", "score": 25, "replies": [{"body": "Could you imagine? Would be a windfall for the company🎉🎉", "score": 4, "replies": [{"body": "That and the cost-to-performace of Intel vs AMD has leaned toward AMD in recent years. That would make it beneficial to Apple to save their money in production on acquisition of Intel chips, but also they could charge a premium on better performance with AMD chips.\n\nLiterally can't go tits up\n\nedit: am dumb\n\n2nd edit for confirmation of macos catalina code through AMD hardware: https://www.tomshardware.com/news/apple-may-start-selling-macs-with-amd-cpus", "score": 9, "replies": [{"body": ">That and the cost-to-performace of Intel vs AMD has leaned toward AMD in recent years.   \n  \nEnergy efficiency is still really important particularly for mobile, and AMD still lags behind there", "score": 5, "replies": [{"body": "That’s also true, hadn’t thought about that", "score": 5, "replies": []}, {"body": "Asus showed off a bunch of AMD laptops at CES this year. The cost to performance difference is sizeable enough that the power efficiency can be forgiven in a lot of applications.\n\nIdle power draw still sucks fat cock though.", "score": 2, "replies": [{"body": "They are definitely better in the past 3 or 4 years but yeah idle power draw is usually one of the biggest issues in Mobile (where most people are not running power hungry programs off their battery).", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Already bought calls, my fancy TA says $66 also.\nhttps://www.tradingview.com/chart/AMD/M17y6z27-AMD-Breakout-Forecast/", "score": 5, "replies": [{"body": "Wtf is a TA, teachers assistant?", "score": 8, "replies": [{"body": "tight anal", "score": 20, "replies": [{"body": "Tendies ANALyzer", "score": 9, "replies": []}, {"body": "Mmm.", "score": 1, "replies": []}]}]}]}, {"body": "This post did not age well", "score": 6, "replies": [{"body": "I commented trying to get people to pull out 😔", "score": 2, "replies": []}]}, {"body": "Aaaand were going down tomorrow", "score": 4, "replies": []}, {"body": "Sure why not. I’ll throw $1000 on AMD tomorrow morning. Shares? ( jk not gay((jk I am))) which calls?\n\n$500 yolo\n$500 real talk maybe year out.", "score": 10, "replies": [{"body": "Im in $60/c 3/20. Shoulda done higher feels like", "score": 1, "replies": [{"body": "i did $70/c 3/20 this morning right when it opened..highest profit margin peaked was 152% today.", "score": 1, "replies": []}]}]}, {"body": "I got amd calls from last year", "score": 5, "replies": [{"body": "Oh? What position?", "score": 7, "replies": []}]}, {"body": "Linus called this back and february. I bought, but it didn't go anywhere so I sold. Im kicking myself so hard right now.", "score": 3, "replies": [{"body": "I bought and held, almost doubled me money, and it ain't stopping any time soon", "score": 1, "replies": [{"body": "It literally cant go tits up", "score": 1, "replies": [{"body": "Selling puts", "score": 1, "replies": [{"body": "Dont worry, I'll have enough tendies for us both brother", "score": 1, "replies": []}]}]}]}]}, {"body": "Every tech YouTuber is meowling like a cat in heat about AMD chips and how they just totally curb-stomping Intel right now!", "score": 3, "replies": []}, {"body": "Thank goodness my puts are safe, I was concerned until this post.", "score": 3, "replies": []}, {"body": "Ladies and gentlemen, hold your balls and buy those calls ASAP we will be entering low orbit soon", "score": 3, "replies": [{"body": "when do you think we should cash in?", "score": 1, "replies": []}]}, {"body": "Saw this last night. Bought 65c 3/20 this morning. So now I just wait?", "score": 3, "replies": [{"body": "You are fucked, well played.", "score": 1, "replies": [{"body": "Oh I sold that shit a while ago.", "score": 2, "replies": []}]}]}, {"body": "Lol", "score": 3, "replies": [{"body": "to be fair it did and I told people to sell before the dip 😤", "score": 2, "replies": []}]}, {"body": "Got $70 6/19 calls a couple weeks ago.\n\niT cAn OnLy gO uP!", "score": 2, "replies": []}, {"body": "!Remindme 30days", "score": 2, "replies": [{"body": "I will be messaging you in 1 month on [**2020-03-18 21:19:06 UTC**](http://www.wolframalpha.com/input/?i=2020-03-18%2021:19:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/f5egjw/dd_amd_is_going_up_this_week/fhyekvm/?context=3)\n\n[**7 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ff5egjw%2Fdd_amd_is_going_up_this_week%2Ffhyekvm%2F%5D%0A%0ARemindMe%21%202020-03-18%2021%3A19%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20f5egjw)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Ah the good ol times.....", "score": 1, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "Check the discord, amd is talked about constantly", "score": 2, "replies": []}, {"body": "Already in. Loving my Jan 2021 30c I got for about $1k", "score": 2, "replies": []}, {"body": "All of this is old news, why would it move the stock this week?", "score": 2, "replies": []}, {"body": "I think I love you", "score": 2, "replies": []}, {"body": "yes chef", "score": 2, "replies": []}, {"body": "Wsbgodammit now I have to sell my AMD calls.", "score": 2, "replies": []}, {"body": "Ok done", "score": 2, "replies": []}, {"body": "I needed to read something to push me over the edge and this did it. I’m going hard and deep in to AMD stonks", "score": 2, "replies": []}, {"body": "I have $55.5 2/28 calls. I hope you're right", "score": 2, "replies": []}, {"body": "im gonna grab some 3/27's probably 63's", "score": 2, "replies": []}, {"body": "Damn bro, RIP to ur 2/28 calls. 🐻🌈", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "We not moving above 60 this week at least", "score": 2, "replies": [{"body": "I'd rather look at 3/20 or 3/27", "score": 1, "replies": []}]}, {"body": "Shit i went $55", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm too much pussy for that", "score": 1, "replies": []}]}]}]}, {"body": "The real DD here is to go in AAPL calls now", "score": 2, "replies": [{"body": "The day after Apple announced they won't hit production and therefore sales due to Corona. Bold.", "score": 2, "replies": [{"body": "Their game is services now. Everyone stuck in quarantine buying iap.", "score": 1, "replies": []}]}]}, {"body": "Shut up", "score": 1, "replies": []}, {"body": "Don’t AMD also make CPUs for phones?", "score": 1, "replies": [{"body": "No you’re think of ARM", "score": 4, "replies": []}]}, {"body": "Would the Apple guidance dissapointment affect this at all at opening?", "score": 1, "replies": [{"body": "I think it will just make people have more cash available. Should go ^", "score": 1, "replies": [{"body": "Why would it make people have more cash available? Cause theyre panic selling?", "score": 1, "replies": [{"body": "Yes, people want to have their money working as hard as possible wherever they can. If apple is not pulling the same potential returns as something else they will pull out during the dip. They will then invest in something else that will make them more $$$ > AMD.", "score": 1, "replies": []}]}]}]}, {"body": "**02/28 - Calls $62-** is the expectation too high bro?", "score": 1, "replies": [{"body": "are you mentally ill", "score": 9, "replies": [{"body": "If I wasn't, I didn't join this subs", "score": 8, "replies": []}]}, {"body": "Im more of a pussy than you, did 2/28 60c", "score": 1, "replies": [{"body": "Still autistic, don't worry", "score": 1, "replies": []}]}]}, {"body": "Kay. Also why are you saying a short squeeze will happen this week? What is your indicator that this is about to happen? It looks like here you started trading about 6 months ago.", "score": 1, "replies": [{"body": "Nvidia earnings and stronger bullish outlook for this week. Last week if you look at the spy 5 day index you can see some of the corona virus fears fall off. Now compare the amd/nvidia/spy 5 days. People were scared. They didn't want to drop money right away. They are all  experiencing sharp correlated jumps. Also i've traded for a couple years but I follow tech developments pretty religiously.", "score": 3, "replies": []}]}, {"body": "I’m fucking deep on April and may $60 calls. Gonna buy leaps this week on AMD and QQQ", "score": 1, "replies": [{"body": "TQQQ is the way.", "score": 3, "replies": []}]}, {"body": "Nice. Hey guys so I want to spend some tendies on some hooker and blow. What should I be looking at paying? I got the range for the ass but not the yay.", "score": 1, "replies": [{"body": "80-100/g if good", "score": 1, "replies": []}]}, {"body": "According to my profile pic, Intel isn't going anywhere.\n\nEdit: even better...\n\nhttps://www.reddit.com/r/pcmasterrace/comments/bu33h1/for_those_of_you_screaming_about_how_intel_must/?utm_medium=android_app&utm_source=share", "score": 1, "replies": []}, {"body": "They're mobile quite literally shits on Intel everywhere, $1600, AMD ain't a budget brand anymore. \n\nhttps://www.notebookcheck.net/4800H-laptop-pricing-and-release-date-leaked-by-Asus-partner-1600-TUF-Gaming-models-arrive-on-April-3rd.454077.0.html", "score": 1, "replies": []}, {"body": "MU 90c FD, got it . Thx", "score": 1, "replies": []}, {"body": "Invested $20k in AMD a couple weeks ago in a mix of underlying and options. \n\nMy option is up 25 or 30% and my underlying 11-15%. \n\nSomeone remind me to go over to Schwab and convince them to enable level 99 options on my retirement accounts. What risk?", "score": 1, "replies": []}, {"body": "Don't short Intel they're not going anywhere they'll keep boosting their stocks with buy backs", "score": 1, "replies": []}, {"body": "TLDR", "score": 1, "replies": [{"body": "buy all in", "score": 2, "replies": [{"body": "Got it. Maxed out my margins on $IN $69 calls 4/20.", "score": 2, "replies": []}]}]}, {"body": "I'm in for sure, dont have much but it's all on AMD", "score": 1, "replies": []}, {"body": "Caronavirus", "score": 1, "replies": []}, {"body": "AMD doing great things at the wrong time.", "score": 1, "replies": []}, {"body": "!remindme 7 days", "score": 1, "replies": []}, {"body": ">Why are any of you autists not buying into AMD/talking about it? \n\nYes, we are buying in. We aren't talking about it so the r/all normie don't find out.", "score": 1, "replies": []}, {"body": "Buy buy buy buy", "score": 1, "replies": []}, {"body": "This aged well 🐂", "score": 1, "replies": []}, {"body": "Dude, I'm not [🌈](https://emojipedia.org/rainbow/) but I fucking love you", "score": 1, "replies": []}, {"body": "How long are we holding for?", "score": 1, "replies": [{"body": "do you want a honda or a buggati", "score": 2, "replies": []}]}, {"body": "I saw your post yesterday. Just wanted to say thanks\nhttp://imgur.com/gallery/HTaxFKH", "score": 1, "replies": [{"body": "🙂", "score": 2, "replies": []}]}, {"body": "Does this mean to buy calls at those strike prices or????", "score": 1, "replies": []}, {"body": "That huge pop up today really caught my eye. Count me in boss.", "score": 1, "replies": []}, {"body": "So Ive got 59.50c for 2/28. Are we holding through the weekend? Now theres a stupid beer flu article attached to AMD in Robinhood but not sure if that means much.", "score": 1, "replies": [{"body": "I would pull profits. I did personally. I’m highly suggesting $ATVI for this week. Mods are taking forever approving my DD unfortunately.", "score": 3, "replies": [{"body": "2/21 65c worth it still?", "score": 2, "replies": []}, {"body": "Any reason in particular? Let me know what your thinking so I dont miss the tendies train", "score": 1, "replies": []}]}]}, {"body": "Hiw did it go?", "score": 1, "replies": [{"body": "I sold for a couple thousand profit before the drop and swapped positions like a wise man", "score": 1, "replies": [{"body": "Pro gamer move", "score": 1, "replies": []}]}]}, {"body": "If my SPCE puts do not screw me over, I am going all in on AMD. Was watching for a week now.", "score": 1, "replies": [{"body": "$SPCE puts? Grrrrrooooossss", "score": 4, "replies": []}, {"body": "SPCE PUTS?!  LMFAO!", "score": 2, "replies": []}, {"body": "Im sorry", "score": 2, "replies": []}, {"body": "RIP man", "score": 2, "replies": []}]}, {"body": "I have boring 3/27 52c’s 😭", "score": 1, "replies": [{"body": "Boring aka smart money", "score": 4, "replies": []}]}, {"body": "Wonder if AMD sells to china", "score": 1, "replies": []}, {"body": "Already priced in cupcake.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "what a pussy", "score": 8, "replies": []}]}, {"body": "Yeah so I just bought amd calls because I've read it more than once in 10 minutes.\nI'm so retarded, guess even TV commercials could ruin me", "score": -2, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Whoa dont expose him like that", "score": 7, "replies": []}, {"body": "So many people say things like that in this sub. Are they too stupid to realize you can't buy anything if the store is closed?", "score": 8, "replies": []}, {"body": "I don't even know how the market or any of this stuff truly works. I just spend money one something, it's just numbers now. I bough call option warrants, 57/20.03.20. I'm not a US citizen if that matters", "score": 1, "replies": [{"body": "The orders will fill only when market is open, so tomorrow at ~9:30 EST", "score": 1, "replies": []}]}]}]}, {"body": "##AMD $69C YOLO", "score": 0, "replies": [{"body": "Proof or ban", "score": 3, "replies": []}]}, {"body": "This isn’t how you spell corona virus", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Where exp", "score": 1, "replies": []}]}, {"body": "Its priced in.", "score": -5, "replies": []}, {"body": "> • AMD's chip technology is the current best in the market. --https://www.digitaltrends.com/computing/amd-vs-intel/\n\nThis statement is wrong. Your link doesn't even support it.", "score": -2, "replies": []}, {"body": "\"Intel's a boomer company\"\n\nOh idk about this one. Someone's very convincing DD of MSFT included them being reliable because they are a chill boomer company that learned it's lessons in the past.", "score": -1, "replies": [{"body": "Have you seen all school computers since like 2000's are all intel. Shits a mega boomer company, also i was vaccinated.", "score": 2, "replies": []}]}, {"body": "Morning Star values this stonk at $19...", "score": -11, "replies": [{"body": "You listen to those boomers?", "score": 17, "replies": []}, {"body": "Ban", "score": 6, "replies": []}]}]}
{"title": "RAD is the next SPCE", "selftext": "           Listen up you fuckers. Sad you missed out on the SPCE train? Me too, but get off your ass and stop whining. We have another chance to moon: Rite Aid is our next tendie train. Yes, I’m talking about the glorified liquor store that got fucked in the ass after the failed Walgreens merger a few years ago. \n            But things have changes. The old CEO John Standley who was a boomer douchebag that basically actively sabotaged the company and brought it from $180+ per share to penny stock status. But management had been changed with sexy CEO mommy Heyward Donigan two quarters ago and also a new COO. During Heyward’s first quarter, the company was already showing that it was rebuilding strength. It’s EPS improved and beat expected by 47.33%. Last quarter’s ER, they beat the $0.15 expected EPS by 261.47% with $0.54 actual. The stock price surged from $7-8 a share to $23.88 in a week. However, profit-taking, gay bears and short ers took tanked it, but RAD found a new support level at around $12. \n           Listening to the last earnings call, the company has very good guidance. They are planning to expand their digital platforms and other services. From the ER call: “We’ve seen the benefit of Rite Care in our business, in our third quarter results, which reflect growth in ancillary immunization of more than 47%, which is outpacing the competition.” Also, “digital sales have been growing over the past few quarters, with a 69% increase in Q3, driven by digital refills. They’ve also released Rite Aid branded ice cream, which has been huge success.\n           There are going to a couple catalysts coming within the next month and a half. On March 16th, Rite Aid will be hosting an Analyst Day. During the conference call, they’ve repeatedly refused to answer some questions with the reason that they are saving it for Analyst Day. Must be good news. Earnings is on April 9th, which I am expecting to be huge. The sell-off last quarter after the earnings rally was because people were not fully confident that RAD could deliver consistently. But this ER will be bigly for the company. The last few months, the stock was struggling to break the $13 resistance. Last Thursday, it smashed into $15 before falling back to $14. It’s about to smash through $15 again today. RAD to $30 as soon as it gets moving.\n*****Alright here comes the fun part.\nThis stock has a 36% short interest. There is massive potential for a short squeeze. The market cap is fucking tiny, at 743 million. Here is an opportunity for us to pump the fuck out of this company. A market cap thats 5x less than SPCE means 5x more tendies and options are dirt cheap at the moment. Also, coronavirus panic + pharmacy stock = tendies. The daily volume on RAD has been picking up lately. The price spreads on 4/17 calls are enormous. Guess which fucking stock had huge spreads right before it mooned? TESLA. Yes you heard it here first, RAD is the new Tesla.\n\nTLDR: ALL IN ON RAD FOR RADICAL TENDIES. Give it the good ol’ WSB pump, get on the train before it leaves you with only FOMO tendies. 3/20 or 3/27 calls to play Analyst Day on 3/16 and 4/16 calls to play the earnings on 4/9\n\nTo SEC: This post was for entertainment purposes only. In no way am I intending to, or encouraging illegal practices such as market manipulation.\n\nAlso, fuck off automod, stop deleting my shit", "id": "f6k5ot", "created_utc": 1582157588.0, "score": 539, "upvote_ratio": 0.92, "num_comments": 248, "comments": [{"body": "You are out of your dumbass mind if you think I'm reading any of that shit", "score": 824, "replies": [{"body": "I love this sub.", "score": 193, "replies": [{"body": "Yet I read all the comments... Why 🤔", "score": 87, "replies": [{"body": "I really do mean it when I say I love this sub.", "score": 30, "replies": [{"body": "Reminds me of Reddit in 2012. Back when it was good", "score": 26, "replies": [{"body": "Remember when we forced out that bitch CEO lady? But can't remember why?", "score": 9, "replies": [{"body": "Pretty sure that was later.. had something to do with the AMA girl (Victoria) being fired or being forced to quit..\n\nThen the whole FPH thing, which was some snowflake censorship. I'm not saying I agree with FPH or any of the other subs that were  banned, but that was a turning point\n\nAt the rate we're going now... This sub will probably either be banned, or turned so fucking gay and mainstream that we cant stand it... It's already half way there, or more", "score": 9, "replies": []}]}, {"body": "The good ol days of Reddit infancy", "score": 1, "replies": []}]}, {"body": "Gay", "score": 0, "replies": []}]}, {"body": "Because the real DD is in the 4 word comments", "score": 12, "replies": []}]}, {"body": "Me too, it cures depression but fuels mania", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "The most convenient TLDR I've ever read", "score": 0, "replies": []}]}, {"body": "Don’t worry I’ll read it to you", "score": 50, "replies": [{"body": "Paragraphs, need paragraphs.... Just randomly break it up if context doesn't apply", "score": 19, "replies": [{"body": "Added indents my bad bro", "score": 7, "replies": []}]}]}, {"body": "Im with you brother this isn’t a meme stock he’s trying too hard", "score": 6, "replies": []}, {"body": "fucking RITE AID?  thats where my dad gets his pills, i need pills to live so im ALL IN", "score": 3, "replies": []}, {"body": "So good", "score": 2, "replies": []}, {"body": "Bet you still went in tho.", "score": 2, "replies": []}, {"body": "Lmfao", "score": 2, "replies": []}, {"body": "> Listen up you fuckers. Sad you missed out on the SPCE train? Me too, but get off your ass and stop whining. We have another chance to moon: Rite Aid is our next tendie train. Yes, I’m talking about the glorified liquor store that got fucked in the ass after the failed Walgreens merger a few years ago. \n>         But things have changes. The old CEO John Standley who was a boomer douchebag that basically actively sabotaged the company and brought it from $180+ per share to penny stock status. But management had been changed with sexy CEO mommy Heyward Donigan two quarters ago and also a new COO. During Heyward’s first quarter, the company was already showing that it was rebuilding strength. It’s EPS improved and beat expected by 47.33%. Last quarter’s ER, they beat the $0.15 expected EPS by 261.47% with $0.54 actual. The stock price surged from $7-8 a share to $23.88 in a week. However, profit-taking, gay bears and short ers took tanked it, but RAD found a new support level at around $12. \n>        Listening to the last earnings call, the company has very good guidance. They are planning to expand their digital platforms and other services. From the ER call: “We’ve seen the benefit of Rite Care in our business, in our third quarter results, which reflect growth in ancillary immunization of more than 47%, which is outpacing the competition.” Also, “digital sales have been growing over the past few quarters, with a 69% increase in Q3, driven by digital refills. They’ve also released Rite Aid branded ice cream, which has been huge success.\n>        There are going to a couple catalysts coming within the next month and a half. On March 16th, Rite Aid will be hosting an Analyst Day. During the conference call, they’ve repeatedly refused to answer some questions with the reason that they are saving it for Analyst Day. Must be good news. Earnings is on April 9th, which I am expecting to be huge. The sell-off last quarter after the earnings rally was because people were not fully confident that RAD could deliver consistently. But this ER will be bigly for the company. The last few months, the stock was struggling to break the $13 resistance. Last Thursday, it smashed into $15 before falling back to $14. It’s about to smash through $15 again today. RAD to $30 as soon as it gets moving", "score": 1, "replies": []}]}, {"body": "Hmmm gambling on a failed drugstore refusing to answer financial questions until a month out.... \n\nBuying calls now.", "score": 177, "replies": [{"body": "Fucksake why didnt op just say this?", "score": 54, "replies": []}, {"body": "I watched Narcos, trust me there's a lot of money in drugs", "score": 37, "replies": [{"body": "That's good DD", "score": 20, "replies": []}, {"body": "DRUGS = $$ nuf said", "score": 4, "replies": []}]}, {"body": "Yes, but they are in a short squeeze. Literally nothing to do with their business", "score": 1, "replies": [{"body": "I bought the calls, what else do you want from me.", "score": 1, "replies": []}]}]}, {"body": "Today was last chance for SPCE train. Shits opening at $50 tomorrow morning after the presentation at Barclay's.", "score": 126, "replies": [{"body": "$SPCE 69 phaggots", "score": 37, "replies": [{"body": "420.69.", "score": 9, "replies": []}]}, {"body": "Or not", "score": 1, "replies": [{"body": "I'm holding my Mar 20 55s for a few weeks. Going to take a shot from earnings/theta decay but with the volatility in this stock, it could be at $80 by then... or $10. Basically FDs but fuck it", "score": 1, "replies": []}]}]}, {"body": "Sold car to buy calls and pre-ordered my Lambo. Got my ticket to tendies town.", "score": 52, "replies": []}, {"body": "easy on the adderall buddy", "score": 45, "replies": []}, {"body": "\"**sexy CEO mommy Heyward Donigan**\" - This is where I stopped reading. I'm in.", "score": 78, "replies": [{"body": "—-googles Heyward Donigan...holds breath😑", "score": 12, "replies": [{"body": "Would smash. Raw.", "score": 4, "replies": [{"body": "https://s3-prod.crainsnewyork.com/styles/width_375/s3/Heyward%20R.%20Donigan.png", "score": 4, "replies": [{"body": "Stahp, yer getting me all hot", "score": 2, "replies": []}, {"body": "That pic is 90ish....getting my post pubic most masturbated times stirred up.", "score": 1, "replies": []}]}]}]}, {"body": "Real hot", "score": 2, "replies": []}]}, {"body": ">During the conference call, they’ve repeatedly refused to answer some questions with the reason that they are saving it for Analyst Day. Must be good news. \n\nYou cannot be fucking serious", "score": 64, "replies": [{"body": "For reals!  This is the way", "score": 22, "replies": []}, {"body": "Imagine it actually is good news", "score": 5, "replies": [{"body": "This sub has both made me (SPCE) and lost me (AIMT) money in the past. I don’t know how to feel", "score": 7, "replies": [{"body": "Yeah man, AIMT was a real bed shitter", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 92, "replies": [{"body": "New deal struck between Rite-Aid and Elon Musk a success.\nRocket building imminent.", "score": 6, "replies": [{"body": "We need pills on the moon", "score": 2, "replies": [{"body": "We need pills on Mars", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "Didn’t miss out, just got out too early because weak hands 😭😭😭", "score": 32, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I sold 2/21 $22 for $160 and 3/20 $25 for $600 next time I’m just gonna chop my hands off😭😭😭", "score": 11, "replies": [{"body": "I sold the same call for $80 :(", "score": 5, "replies": []}, {"body": "hey man i sold 3/20 $19c for $400", "score": 5, "replies": []}]}]}]}]}, {"body": "Bro no one has time for this litany,just tell me to buy RAD and am on board,no questions asked.", "score": 23, "replies": [{"body": "RAD free tendies, fuck bears, tits no go up", "score": 29, "replies": []}]}, {"body": "Anyone on that ALLY train ?", "score": 43, "replies": [{"body": "> ALLY \n\n2/21 29C is basically free. $30 tomorrow is like 900%", "score": 17, "replies": [{"body": "Hopefully I can buy some when market opens", "score": 3, "replies": [{"body": "Did you collect your 4x tendies yet?", "score": 1, "replies": [{"body": "Bruhhh! Just got out of class and checked let’s go !!! Cashing out yet ?", "score": 1, "replies": [{"body": "Closed at 4x. Probably could have held longer but free is free and not waiting for tomorrow.", "score": 1, "replies": []}]}]}]}]}, {"body": "picked up some 29 and 30 calls for late march.", "score": 11, "replies": []}, {"body": "Picked up 10 min before close. 30 3/20", "score": 7, "replies": []}, {"body": "Why did it crash??", "score": 3, "replies": [{"body": "Crashes bc they acquired another company and boomer investors were salty, itll fix itself and give us tendies", "score": 16, "replies": [{"body": "Sounds like AMC", "score": 1, "replies": []}]}]}, {"body": "Got a little today. If it takes off I’ll scoop up some more", "score": 6, "replies": []}, {"body": "Yes sir", "score": 2, "replies": []}, {"body": "Ally full fucking sending my shit", "score": 2, "replies": []}]}, {"body": "rad tendies meme? son of a bitch, i'm in.", "score": 44, "replies": [{"body": "You* son of a bitch I’m in", "score": 15, "replies": [{"body": "You son of a bitch, I was already in but now I’m doubling down", "score": 15, "replies": [{"body": "You son of a bitch, make that a double dose of doubling down cuz I’m also in", "score": 3, "replies": []}]}]}]}, {"body": "I remember the days when this sub was pumping the fuck out of this stock leading up to the merger. In for the nostalgic trendies.", "score": 20, "replies": []}, {"body": "You’re welcome assholes", "score": 19, "replies": [{"body": "Good ole WSB meme pump", "score": 1, "replies": []}, {"body": "This is some seriously weird shit. I almost FOMO'd and open a Put credit spread on that shit. Jesus christ this sub is fucked. \n\n&#x200B;\n\nAre you out of your position yet?", "score": 1, "replies": []}]}, {"body": "Shit this is some good DD. Bravo your husband should be proud", "score": 34, "replies": []}, {"body": "You son of a bitch I’m all in", "score": 13, "replies": []}, {"body": "Donigan, former CEO of ValueOptions. All in.", "score": 10, "replies": []}, {"body": "You son of a bitch I’m in", "score": 12, "replies": []}, {"body": "I’m in for entertainment purposes only", "score": 11, "replies": []}, {"body": "With a ticker like RAD, I’m in", "score": 13, "replies": []}, {"body": "Just imagine the faces of people who see this dying company get actually revived by one reddit thread", "score": 9, "replies": []}, {"body": "[deleted]", "score": 44, "replies": [{"body": "Their profit is -800 million. Also they got tons of short and long term debt.", "score": 34, "replies": [{"body": "How does that even work", "score": 3, "replies": []}]}, {"body": "This is an extra retarded post.", "score": 15, "replies": []}]}, {"body": "You son of bitch I’m in", "score": 10, "replies": []}, {"body": "Up 82% on my calls so far, thanks dude. Wish I bought more of course", "score": 9, "replies": []}, {"body": "Punch me in the dick for not already being all-in, you glorious fuck. Let's ride.", "score": 7, "replies": []}, {"body": "I’m RAD\n\nI’ll be buying 4/17 15c", "score": 9, "replies": []}, {"body": "Bagholding since 18, so I hope your right. May double down.", "score": 8, "replies": []}, {"body": "Sell ice cream to kids so they can grow up with diabetes and come back for the drugs? That's brilliant! You son of a bitch, I'm in.", "score": 9, "replies": []}, {"body": "Y’all are all fucked.  I just bought a hundred shares. It will be under a dollar by the end of the week.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "There has to be bots monitoring this sub. Wtf is going on.", "score": 3, "replies": []}, {"body": "Hey that’s mean", "score": 4, "replies": []}]}, {"body": "Now, this is a $CHAD post, you son of a bitch I'm in. IV rank is at 9, with 57 days until earnings. The $15 calls are cheap rn, and a long play into earnings week could be the move here.", "score": 14, "replies": [{"body": "$15 calls will be $10 otm by the time earnings roll around", "score": 4, "replies": [{"body": "Doesn’t that mean plentiful tendies tho", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Ughhh...you know Zacks is a counter-indicator right?", "score": 7, "replies": [{"body": "Explain?", "score": 3, "replies": [{"body": "So much I could say!", "score": -1, "replies": [{"body": "and yet you said nothing. win!", "score": 11, "replies": []}]}]}]}, {"body": "When do you think this run to 25 goes? Slowly until earnings?", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "So RAD calls got it", "score": 2, "replies": []}]}]}]}, {"body": "You son of a bitch, I'm in.", "score": 6, "replies": []}, {"body": "[Just tell me strike and expiration daddy](https://giphy.com/gifs/BhonfJKJtq5Dq/html5)", "score": 6, "replies": [{"body": "He did, jackass\n\n2/21 $500", "score": 10, "replies": [{"body": "2/20 $42069", "score": 3, "replies": []}, {"body": "Click the link dingus. I did;t read", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Standley absolutely was sabotaging the numbers. What was his motivation? Was he that pissed we ruined his ABS job?", "score": 1, "replies": []}]}, {"body": "Didn't read, bought anyway. Let's go to the moon, 25$ by 3/20", "score": 7, "replies": []}, {"body": "I don’t doubt your vibe. In for $3k, already up 30%", "score": 7, "replies": []}, {"body": "I’m in", "score": 5, "replies": []}, {"body": "You know what... I'm in.", "score": 5, "replies": []}, {"body": "I don’t think there is a nice rite aid in the whole world, but things there still cost the same as they do at CVS. In", "score": 7, "replies": []}, {"body": "Crazy start. Awesome DD In the middle. Lock and load tomorrow morning!", "score": 4, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I see.", "score": 3, "replies": []}]}, {"body": "WOW RAD for Radical tendies. I will invest just for that wordplay 💦", "score": 7, "replies": []}, {"body": "RAD 2/28 calls up 200% thank you beautiful autist", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "16.5c", "score": 2, "replies": []}]}]}, {"body": "glad I listened this this autist, shit is popping off", "score": 6, "replies": []}, {"body": "How the FUCK am I checking this post half a day late and it’s already 90% buyers???", "score": 7, "replies": []}, {"body": "Gimme that chocolate malted crunch bitch I’m in", "score": 4, "replies": []}, {"body": "Phil Swift here. Im all in", "score": 5, "replies": []}, {"body": "What’s the strike price for 3/20 or 3/27 🌈 boy?", "score": 4, "replies": [{"body": "Anything you can afford boss", "score": 7, "replies": [{"body": "Not sure I get it. What do you expect it to reach?", "score": 3, "replies": [{"body": "Last time RAD rallied, it peaked at around $23. So I think anything under $20 would probably be a good pick.", "score": 6, "replies": []}]}]}]}, {"body": "Why wouldn’t I hop on this too.", "score": 4, "replies": []}, {"body": "This is the way", "score": 5, "replies": []}, {"body": "I’m in, 4/17", "score": 5, "replies": []}, {"body": "I was gunna double down NVDA this works too see you at the moon", "score": 6, "replies": []}, {"body": "Why the hell did you write so much. Need a paragraph break here and there bro", "score": 4, "replies": [{"body": "I had paragraph breaks but my big brain forgot to do indents. I added them in now though thanks", "score": 3, "replies": [{"body": "Yay yay! Good DD", "score": 4, "replies": []}]}]}, {"body": "Stopped reading at Rite-Aid branded ice cream, that's all I need. Shits gonna melt up faster than their ice cream melts down", "score": 6, "replies": []}, {"body": "I’ve already been fucked by RAD in the past it can’t happen twice", "score": 7, "replies": [{"body": "You were robbed bc the old CEO dreamed of merging with Albertson's and taking the CEO job there.  He failed & he's gone.  Shorts are in trouble.", "score": 2, "replies": []}]}, {"body": "I was here for the last RAD disaster. Please don’t hurt me like that again", "score": 5, "replies": []}, {"body": "this sub hasn't steered me wrong yet. I'm in.", "score": 5, "replies": [{"body": "You must be new here", "score": 3, "replies": []}]}, {"body": "You forgot to mention that ice creme was a “meaningful contributor” for their 3rd quarter growth.", "score": 5, "replies": []}, {"body": "In", "score": 4, "replies": []}, {"body": "I just spent all my money on calls and you want me to invest in a hand-me-down drugstore?\n\nThis kind of autism is so insane it works, so I'm in all the fucking way.", "score": 6, "replies": []}, {"body": "Bought it lmao", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": []}, {"body": "Solid DD, long April calls!", "score": 6, "replies": []}, {"body": "Feeling RAD 🤑🤮", "score": 5, "replies": []}, {"body": "Walgreens wins for ONE reason. They are the last pharm that still sells cigarettes. This is enough DD for me to YOLO", "score": 5, "replies": []}, {"body": "$RAD DD brought to you by adderall!", "score": 6, "replies": []}, {"body": "I went in with 25% of my portfolio yesterday. I think it hits 20 again in a few months, but any sign of slowdown during ER is going to rape any calls.\n\nShares only and a relative tight stop loss for me..", "score": 5, "replies": [{"body": "I always leave a portion of my portfolio for meme stonks like SPCE or AMD bc they literally can’t go tits up, and the rest I put into DD picks like this", "score": 16, "replies": [{"body": "How dare you call amd a meme stock, I'm up 400% and not selling anytime soon", "score": 8, "replies": []}, {"body": "6% today so far 🤜🏽 🤛🏽 \n\nI'm thinking I'm going to double down..\nI'm listening to the ER right now and do you realize how many times they referenced record numbers of flu shots that contributed to their bottom line?\n\nAll of that was BEFORE the Corona Virus.\n\nImagine how many people who normally wouldn't bother fucking around with a flu shot that got one recently? A metric shit ton. \n\nGame on son.", "score": 1, "replies": []}]}]}, {"body": "Rite Aid was a fucking tendie disaster last time that's why automod is deleting your shit.\n\nI'd say SPCE is the new RAD but really nothing was as bad as RAD, of all the things that could have happened to it pretty much nothing did and everyone busted on it.", "score": 2, "replies": [{"body": "Every good rocket ends with a big explosion", "score": 7, "replies": []}]}, {"body": "Holy fuckin hott momma milkin titties I shall read no more I’m in!!!!", "score": 4, "replies": []}, {"body": "Just read the title and buying. Fuck that long ass text", "score": 4, "replies": []}, {"body": "it is mooning", "score": 4, "replies": []}, {"body": "My order didn’t fill and I watched it go up 1.50 right before my eyes brb drinking bleach", "score": 4, "replies": [{"body": "Plenty of time to get in, the rocket is just fueling up", "score": 1, "replies": []}]}, {"body": "Gay bears are shitting their pants today 😂😂", "score": 3, "replies": []}, {"body": "It’s the only place I shop during the coronavirus!", "score": 4, "replies": []}, {"body": "Hmm, already bag holding 200 shares.  Minus well buy weeklies.  Literally can't go tits up", "score": 4, "replies": []}, {"body": "Boom", "score": 4, "replies": []}, {"body": "Actually read the entire essay and I’m in! Very detailed and thorough. Will likely increase option holdings...to the moon!!!", "score": 4, "replies": []}, {"body": "Could this be huge if a vaccine like the possible one from MRNA for corona hits mainstream markets and is offered at Rite Aid?", "score": 4, "replies": [{"body": "Possibly. Calls are on sale right now bc of beer virus panic. 🤤🤤🤤", "score": 3, "replies": [{"body": "Unfortunately they weren’t as much when you posted this 😂\nBut still should be a great return.", "score": 3, "replies": [{"body": "Yeah. Unfortunately, I think the virus scare paused the bull run but all the catalysts I mentioned are still in place regardless of the market dip.", "score": 2, "replies": [{"body": "For sure... and it may actually help with the scare once the market further establishes which industries may benefit from the outcome.", "score": 3, "replies": []}, {"body": "Starting to print 😏", "score": 1, "replies": []}]}]}]}, {"body": "What makes Rite Aid a better option than CVS for instance?  is it just all the short squeeze potential here?  Why would RAD be better if they did start offering possible vaccines vs other retail pharmacy type stores?", "score": 1, "replies": []}]}, {"body": "In", "score": 3, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Is it wise to let your balls hang out around these retards?", "score": 1, "replies": []}]}, {"body": "Why bother with the DD when all you’ve got to do to trigger a meme stock is pick some futuristic seeming company and never shut up about it", "score": 3, "replies": []}, {"body": "You had me at 69% increase. I’m in!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "yeah but your grandma NEEDS that hemorrhoid cream.  That's recession-proof right there.  How many years does she have left would you say? Buy calls accordingly.", "score": 3, "replies": []}]}, {"body": "im in", "score": 3, "replies": []}, {"body": "You son of a bitch, I'm in!", "score": 3, "replies": []}, {"body": "It is a low stock and they seem to be re-building there company. Just need some major moves. What sort of long term growth we talking for options. Like a few bucks?", "score": 3, "replies": []}, {"body": "Dude..50 words or less in a post please. Just tell me where to put my money", "score": 3, "replies": []}, {"body": "$15.50 calls exp 3/27 cause yolo", "score": 3, "replies": []}, {"body": "It's confirmed now WBS can move the market.", "score": 3, "replies": []}, {"body": "Fuck off m8 just because you missed out on spce doesn’t mean the rest of us aren’t waiting to cash out 🤫", "score": 6, "replies": [{"body": "You’ll have plenty of time to join after you cash out on spce", "score": 3, "replies": [{"body": "Nobody cashes all the way out", "score": 1, "replies": []}]}]}, {"body": "Too rich for my blood", "score": 2, "replies": []}, {"body": "Bro strike and expire", "score": 2, "replies": []}, {"body": "say no more fam, I'm in", "score": 2, "replies": []}, {"body": "Im fucking in you fucktard.  Bought 1000 calls", "score": 2, "replies": []}, {"body": "5x less?! WTF does that even mean?", "score": 2, "replies": []}, {"body": "Alright, I'm in. Nothing except the stock available to buy in Europe (at least my country), so I did you idiots the favor and bought shares.", "score": 2, "replies": []}, {"body": "!remindme 1 month", "score": 2, "replies": [{"body": "I will be messaging you in 27 days on [**2020-03-20 10:57:41 UTC**](http://www.wolframalpha.com/input/?i=2020-03-20%2010:57:41%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/f6k5ot/rad_is_the_next_spce/fi6ic8z/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ff6k5ot%2Frad_is_the_next_spce%2Ffi6ic8z%2F%5D%0A%0ARemindMe%21%202020-03-20%2010%3A57%3A41%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20f6k5ot)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "How do I take out additional student loans? If I’m unemployed I won’t have to pay them back anyway", "score": 2, "replies": []}, {"body": "Confirmed, RAD to unveil their new spaceships next Q, to be purchased by AMZN for $69,420,969,420.\n\nBest way to play this is to probably buy calls", "score": 2, "replies": []}, {"body": "RAD was a Awesome 80s movie so I am in", "score": 2, "replies": []}, {"body": "I'm just here for any SEC attorney reading this. Hi SEC!", "score": 2, "replies": []}, {"body": "RAD has burned a fuck ton of you in the past. If you hold any shares last yr, it's like 80% down from a pile of garbage to a pile of dog shit.", "score": 4, "replies": [{"body": "I held shares since early-ish last year.  i'm up a shit ton", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Too much fucking text and therefore, I'm out.", "score": 1, "replies": []}, {"body": "RAD fucking sucks, was working out at the first new store they are building in 5 YEARS at Virginia beach and it was a complete shitshow. The building is weak as fuck you can punch a hole through the fake brick they put up and VA beach gets hit with hurricanes...all corporate management personnel seemed to have a different plan than the last. The store manager literally had no teeth and he weighed about 80 pounds their camera system is 10 years old. Managed to pay multiple contractors to do the same work. Also haven't you heard the trend of failing companies hiring a women CEO as they bleed out? Its happened a bunch of times. Short RAD.", "score": 1, "replies": [{"body": "you realize that there are only 52m shares outstanding on a company that does 22b in rev.  If new mgmt can squeeze out 1% in operating margins...", "score": 3, "replies": [{"body": "The won't they are fucking retarded trust me, they can't compete with cvs and walgreens every industry with a huge moat tends to go down to two competitors RAD is obviously the odd man out.", "score": 1, "replies": [{"body": "This is an industry based on geography.  Everyone knows that retail does not live and die by being the lowest cost competitor.  RAD competes by being on convenient street corners where each store is their customers' go-to spot.\n\nThey are growing revenue, they just need to streamline the operation (and integrate the PBM).  This type of stuff was completely ignored by the previous self-serving management, and now they're completely gone (with the exception of 3/9 board members).\n\nThis stock is an absolute gift at this price.  Mark this post.", "score": 4, "replies": []}]}]}]}, {"body": "could you fix that top portion so I can read it lol, ive been in since I saw this suggested last week.  looks promising.\n\n&#x200B;\n\nedit:  \"with a 69% increase in Q3\" is all the DD i need.", "score": 1, "replies": [{"body": "Idk how to fix I’m retard sorry lol", "score": 1, "replies": [{"body": "you still holding?  I just doubled down today, -30%??  lol", "score": 1, "replies": [{"body": "Yeah. Even if analyst day (tomorrow) doesn’t do it, earnings will make it blast. Viral outbreaks + pharmacy = tendies", "score": 1, "replies": [{"body": "today. was good :D 22%!", "score": 1, "replies": [{"body": "Hell yeah! Did you see their guidance? Very good, especially during these times", "score": 2, "replies": []}, {"body": "And we have takeoff", "score": 2, "replies": [{"body": "I’m in love with Mama Donigan!  Made 500% today.  Rolling over!!!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You're 2 L8. Rite Aid is a dumpster fire, the only reason it went up was because of a short squeeze. Fucking icecream to save that pos? GTFO", "score": 1, "replies": [{"body": "Lmao imagine thinking we’re here to play with anything longer than a few months. There’s going to be another short squeeze and we’re gonna be the ones to start it. Be there or be square boomer", "score": 7, "replies": []}]}, {"body": "You are out of your dumbass mind if you think Rite Aid is worth more than $12 total", "score": 1, "replies": []}, {"body": "Fuck RAD, fuck that company big time, dont buy that shitty stock", "score": 1, "replies": []}, {"body": "No. NO! NOT AGAIN", "score": 0, "replies": []}, {"body": "We are not starting with fucking RAD again.", "score": -1, "replies": []}, {"body": "Look, RAD has exactly two exit plans:\n\n1 - they get purchased by Amazon (probably not going to happen as drug prescriptions go telemedicine)\n\n2 - full legalization allows the brand to become a national dispensary \n\nThat's it.  Those are the options.  Do you see either of those happening?\n\nNo.  You do not.", "score": -1, "replies": [{"body": "We’re not here for long time just a good time boomer", "score": 4, "replies": [{"body": "Have fun waiting while theta devours your money.", "score": -2, "replies": []}]}]}, {"body": "SPCE to 100 end of next week.. everyone knows ER will be 0 as they havnt done any flights yet ... I’m adding $10,000 when market opens cus it’s still going to triple in a week .. SPCE is literally the when the moon is", "score": 0, "replies": []}, {"body": "Only one problem, RAD sucks.", "score": 0, "replies": []}, {"body": "RAD doesn’t have space ships", "score": 0, "replies": []}, {"body": "RAD tendies came last year, dipshit. Fuck outta here with your normie horsehockey.", "score": -3, "replies": []}, {"body": "You son of a bitch, fuck no.", "score": -1, "replies": []}, {"body": "So like if you just didn’t post that bit at the end this probably gets to stay because there’s some decent points about why you think they will improve. \n\nBut then you’re telling everyone to work together to pump up the price...", "score": -4, "replies": [{"body": "It was actually a decent analysis lol", "score": 6, "replies": []}, {"body": "That was clearly a joke, right SEC?", "score": 1, "replies": []}, {"body": "Not in.", "score": -6, "replies": []}]}, {"body": "I work in rite aid and I can assure you, you’re trippin b", "score": -2, "replies": []}, {"body": "RAD the next SPCE?\n\nMight as well just say that F is the next TSLA. You're a fucking moron. Next stop RAD $6", "score": -2, "replies": []}, {"body": "STOP PROMOTING YOUR FUCKING COMPANY U BOT. $SPCE is still profitable. Just buy some fucking call options as soon as the market opens, you all saw what it was like with $TSLA, the price will go down a little then shoot up. FREE MONEY", "score": -6, "replies": []}]}
{"title": "$SPCE going higher. See you poor bears at 50+", "selftext": "https://imgur.com/a/9iGtZpi\n\nTLDR long call $SPCE leaps for free money. \n\nLet’s take a stroll down memory lane. Famed fake meat purveyor and beloved meme stonk of 2019, $BYND, experienced massive moves from May through July over two ERs then proceeded to cuck everyone after announcing a secondary. \n\nThis no moat nothingburger ran up to $14 billion market cap on the $1T worldwide meat TAM and a hail marry partnership from $MCD. If this $TSN assassin can pump 14B market cap then truly anything is possible. Buffet like moat. No one got a moat bigger than $SPCE. (Yes, I’m all in SpaceX and Blue Origin whenever they list - but they probably gonna IPO via Wall Street and those bastards will suck up all the tendies.)\n\nEven if you don’t believe in the $SPCE story recognize that $SPCE is the meme stonk of 2020. It doesn’t even matter if you buy the story. By the time Sir BDB is done pumping his first flight we all gonna be eating space ship Cheerios. The noise has not even begun. Branson is the undisputed master showman of his generation. He’s neck deep in aviation and knows exactly how to print money in that industry, not to mention virtually everyone he’s been in. \n\nChamath, who is sitting on a cool $1B in $SPCE tendoids, is about to roll up to a 1 hr free HSN advertisement on CNBC’s Squawk day after earnings. If you think this king maker gonna volunteer to take fire for an hr on live tv while his stonk crashes 20% you’re already in space cause you ain’t living on this planet. He knows the news is gonna be stellar. That’s why he agreed to show up. He’s gonna pump his bottom line another cool billion. I expect an announcement on first flight timeline and opening up reservations including a price hike auction system for first movers. \n\nhttps://twitter.com/chamath/status/1230182805541466113?s=21\n\nInstitutional investors. Take a look at the millions of shares folks like Vanguard are buying up. These people have teams of PhD number monkeys figuring out whether or not they should get into something and put those somethings in their portfolios. Your (and my) baby DD ain’t even in the same airspace. Just follow their money. \n\nWhy 50? Market cap. For those of you who can’t math you take the shares outstanding and multiply by price per share. If you’re like me you think of companies in terms of market cap. If you stick your finger in your mouth and hold it up in the air that feeling you’re feeling is all the negative interest rate free central bank money sloshing around the world looking for a home. Hence 10B market cap for Virgin Galactic easier than your sister on prom night. Ergo 50 per share. \n\nMedia blitz. Just getting warmed up:\n\nhttps://www.instagram.com/tv/B83pn1-F4El/?igshid=wahwj4qsgjg7\n\nAnd finally, $BA needs a win. They already in for $20m which is basically toilet paper money for these aviation monopolists. These guys are chomping at the bit to own commercial space. Expect an announcement where $BA is contracted to builds a fleet of next gen $SPCE ships. \n\nDisclaimer: I’m in for about 5m+ in 2021 and 2022 leaps so my money is where my mouth is. Check my post history.\n\nps. If I’m wrong it’s just money. No $ROPE , all good. \n\npps. I’m not wrong.\n\nppps. My dd for my money and the reasons I used to go long. Use your own dd for your own money and do what you think is right for your personal risk tolerance.", "id": "f7zk4t", "created_utc": 1582408597.0, "score": 263, "upvote_ratio": 0.91, "num_comments": 249, "comments": [{"body": "[deleted]", "score": 44, "replies": [{"body": "You plan on dying the year you retire?", "score": 16, "replies": [{"body": "Dude is likely not from US. $150k goes a looooong way in many countries because they have strong pension systems.", "score": 4, "replies": [{"body": "This guy probably just capped himself. RIP", "score": 1, "replies": []}]}]}]}, {"body": "Ah fuck, you wrote more than a paragraph, guess I’m all in.\n\nShenanigans aside, I’ve been deeper in SPCE than a fat kid in a bucket of McFried chicken wings since pre $20. Shit’s going to pop off this year and there’s no denying it.\n\nGodspeed to those of you missing out.", "score": 218, "replies": [{"body": "I'm in at 17.5. Just trying to decide which plane I want.", "score": 21, "replies": [{"body": "Buy a fuckin rocket you cuck. It's 2020", "score": 17, "replies": []}]}, {"body": "True that", "score": 9, "replies": [{"body": "[removed]", "score": 15, "replies": [{"body": "Solid bear thesis. Respect. No need for name calling. I see things differently and put my own money down. This is my DD for my money and the reasons I used to go long. people are free to do what they want with their own money and their own DD.", "score": 11, "replies": [{"body": "Respect 🤟🏼", "score": 2, "replies": []}, {"body": "F", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Solid dd.", "score": 5, "replies": []}]}, {"body": "Its a stock for an aviation company with a 2 year plus cash runway before they need to raise more, has stated they will be profitable by next year, and has a confirmed clientele. Long term if they dont add additional tech and services, sure it would be a problem, but anyone who expects them to stop advancing for no reason is shilling for something else.\n\nAnd sure, we can focus on the 20 percent \"crash\". I've been in since 10ish, and couldnt really care less about fluctuations in the 30s for a stock I expect to start flirting with 100 on the first successful flight.\n\nI've been steering people towards this for a while, and anyone who listened when I posted would have doubled their money on stock alone. If they listened to you, they lost their asses on puts or even worse on shorting. So maybe you should stop lying about $SPCE.", "score": 7, "replies": [{"body": "Where do you get the 2 years of cash runway?\n\nMaybe I'm looking in the wrong place, but according to Benzinga Pro I have more cash in my checking account than SPCE does.\n\nIs there another entity supplying them with money?", "score": 4, "replies": [{"body": "https://www.undervalued-shares.com/weekly-dispatches/ipo-of-virgin-galactic-5-days-until-lift-off/\n\nEstimated 400 million in reserve from October last year.", "score": 3, "replies": [{"body": "Got it. Thanks", "score": 5, "replies": []}]}]}, {"body": "Or the plane blows up.", "score": 1, "replies": []}]}, {"body": ">Interestingly, one of Virgin Galactic's biggest Wall Street advocates is calling out risks for investors. \"We do struggle to identify significant thesis changing/accelerating events since the time of our initiation in early December of 2019,\" Morgan Stanley analyst Adam Jonas wrote this past Thursday. \"A modest correction is overdue, and frankly, healthy, in our opinion.\"\n\n>The analyst has an Overweight rating and $22 price target for the stock, representing 35% downside from Friday's close at $33.87. His price target assumes Virgin Galactic's space-tourism business will produce nearly $1 billion in revenue by 2030 from nearly none this year, which could be extremely optimistic in itself.\n\n>In an earlier report, Jonas also noted the risk of fatal accidents, regulatory issues, and \"insufficient economics.\" Under those scenarios, the shares could trade down to a $1 stock price.\n\n>The analyst also attributes more than half his valuation target to the company's opportunity in hypersonic [above five times the speed of sound] air travel. He estimates the hypersonic market will generate $800 billion in annual sales by 2040 and Virgin Galactic may be able to capture a 10% share.\n\n>These pie-in-the-sky forecasts for markets that do not currently exist may be overreaching, given that Virgin Galactic has been trying for over a decade to get space tourism off the ground. It will also have to compete against larger, well-capitalized aerospace players if hypersonic travel does take off.\n\n>Investors need to assess Virgin Galactic's risks, given rising competitive threats, high expectations for a space tourism, and a spotty record for meeting deadlines. In time, the current stock price may look pretty irrational.", "score": 2, "replies": []}]}]}, {"body": "Bought 500 shares at about 15 a pop. You best believe I’m riding this bitch out", "score": 8, "replies": [{"body": "Shares? Is this r/investing?", "score": 2, "replies": []}]}, {"body": "Me too got in at 11 after it crashed. Then I was like wtf are these retards doing lol", "score": 1, "replies": []}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 88, "replies": []}, {"body": "that's a lot of big words to say you holding a bag", "score": 72, "replies": [{"body": "Facts", "score": 2, "replies": []}]}, {"body": "Your DD has been pretty solid so far. I’ve been following it for a few weeks now and we spoke about it last week. We did see the pull back at the end of the short squeeze like you said. Still hoping you’re right, I bought $30 calls on Wednesday that break even at 39. Those expire this week on Friday. Still holding the $25 calls I bought weeks ago for next to nothing. Been up in the air about whether to hold through earnings. I watched the interview with Whitesides the other day. Played it back about 15 times and I can swear his eyes light up when he talks about how optimistic they are about generating revenue’s. It’s the interview he did last week on CNBC. Between these two things, I may just hold through earnings and see how it works out. Thanks for the post. I like hearing how your account is doing and your thoughts on SPCE.", "score": 19, "replies": [{"body": "CEO dude ain’t showing up from nasa to deliver a turd er in his first at bat. My money is on a home run. We know they ain’t rolling loot yet. There will be news on the call.", "score": 22, "replies": [{"body": "How can they even have an earnings report without earnings? Is he just gonna talk about the 600 reservations they have? Legit question.", "score": 8, "replies": [{"body": "I'm assuming possible contracts with the federal government/NASA and mention of their Italian Air Force contract.\n\n\nHopefully they have some good surprises up their sleeves", "score": 2, "replies": []}]}, {"body": "I sometimes wonder if they will use their earnings to perform a cashless exercise of their outstanding warrants. The guy going on TV is head of social Capitol who's original shareholders now are entitled to said warrants. VG would benefit by garnering a huge cash infusion by exercising while price is so high and Social Capitol guy goes on TV to keep things calm for the shareholders getting burned. That would cause a massive dilution of the stock and jack the float too. I know it's gay bear talk, but gut feelings :|", "score": 3, "replies": []}, {"body": "Over hyped, no matter the news it can't live up to the current valuation.", "score": 4, "replies": []}, {"body": "Would luv to hear your thoughts given latest price action? Everyone who backed SPCE seem to be deathly quite now.", "score": 1, "replies": [{"body": "Oh it’s very terrible. No doubt. But I’m still in ... cause I’m in leaps so I can hang out through first launch.", "score": 1, "replies": [{"body": "Same here. Mine are Jan 21 exp. so I have some time. But at this point i am not buying in anymore. Virus issue is a bit out of hand", "score": 1, "replies": []}]}]}]}, {"body": "Got a link to the interview?", "score": 4, "replies": [{"body": "I don’t have the link but if you Google CNBC Whitesides, it’s the first  video that comes up. Came out one week ago.The question she asks starts at 3:00 and his eyes light up at 3:28", "score": 8, "replies": []}]}]}, {"body": "Fuck it.\n\nIm in. Shares premarket (Gay right?) and calls at open.", "score": 14, "replies": [{"body": "Order placed for 300 shares @ Monday premarket open.  Thinking 5k in calls. \n\nWhat strike and date are you guys looking at for Monday?", "score": 10, "replies": []}]}, {"body": "This type of post is why I love wallstreetbets and keeps me coming back.  Amazing degenerate-like DD with truth to it.  This post is a gem in sea of shitposting", "score": 41, "replies": [{"body": ">ve been following it for a few weeks now and we spoke about it last week. We did see the pull back at the end of the short squeeze like you said. Still hoping you’re right, I bought $30 calls on Wednesday that break even at 39. Those expire thi\n\nsuch a gem lol, probably caused a lot of autists $rope", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 53, "replies": [{"body": "Stop putting bad thoughts in my head. I dont like it.", "score": 14, "replies": []}, {"body": "Nice DD. I agree not a long term investment but I am going to eat my free tendies from the normie fomo", "score": 7, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Thanks. I like your analysis and I agree with your findings. This stock is a turd and it's unfathomable people actually try to find value in this.", "score": 5, "replies": [{"body": "AND that is why I am buying! Right here folks", "score": 2, "replies": []}]}]}]}, {"body": "RemindMe! 6 months.", "score": 4, "replies": [{"body": "I will be messaging you in 5 months on [**2020-08-23 03:24:00 UTC**](http://www.wolframalpha.com/input/?i=2020-08-23%2003:24:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/f7zk4t/spce_going_higher_see_you_poor_bears_at_50/fiivxg3/?context=3)\n\n[**6 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ff7zk4t%2Fspce_going_higher_see_you_poor_bears_at_50%2Ffiivxg3%2F%5D%0A%0ARemindMe%21%202020-08-23%2003%3A24%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20f7zk4t)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 3, "replies": []}]}, {"body": "Still can't believe people are hyped about point to point travel speculation. You couldn't pay me to let Richard Branson shoot me off the side of a plane in a fucking rocket. I would pay extra for the longer trip in a plane. That's assuming he ever even builds any of that.", "score": 3, "replies": [{"body": "Facts", "score": 1, "replies": []}]}, {"body": "Ceo could not answer because he is in a quiet period.", "score": 6, "replies": []}, {"body": "I am short 3/20 $40 puts", "score": 1, "replies": []}, {"body": "Nice. I love hearing DD where both sides have a stake on it. Its such an honest play.  \n\n\nI think what makes SPCE bets shit right now is that you need massive swings to make profits on the options: they are freaking expensive.", "score": 1, "replies": []}]}, {"body": "This plan is so autistic, it just might fucking work.", "score": 9, "replies": [{"body": "🤓", "score": 6, "replies": []}]}, {"body": "Did you end up selling, or did you ride it down?\n\nYeah I’m not getting fooled by another WSB MEME STOCK", "score": 20, "replies": [{"body": "Peaked at like 6.8m , still all in at about 5m now.", "score": 20, "replies": [{"body": "Congrats man.. i like your story a lot more than the other attention seekers of reddit.... i hope you fair really well - but isn’t $5m life changing money? You went from $250k to to $5m - get out and enjoy life!", "score": 19, "replies": [{"body": "He started at 480k per previous posts, so he is a about 10x his initial position", "score": 15, "replies": [{"body": "480k to 5M?! What were his biggest winners? I'm assuming options trading.", "score": 1, "replies": [{"body": "Only SPCE. He built up to the 480k with other plays though.", "score": 2, "replies": [{"body": "what were the other plays? That's a big factor in evaluating his DD.", "score": 1, "replies": []}]}]}]}, {"body": "Once you enough of it, you realize money doesn't buy yo life", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "dump the SPCE & go into SpaceX, that's the real play", "score": 6, "replies": [{"body": "Except there currently isn’t a SpaceX play for retail.", "score": 2, "replies": [{"body": "1mil+ & you can join", "score": 4, "replies": []}]}]}]}]}, {"body": "Peak", "score": 2, "replies": []}]}, {"body": "I expected rise above 22 but not past 25 before it happened. Then corrected and expected rise above 35 but not past 42, also before it happened. Expected drop to 32 before it happened. Month in, expecting rise to 50. My bull dick is getting bigger by the minute.", "score": 15, "replies": [{"body": "Don’t get in a contest against Bransons log. He knock you out.", "score": 13, "replies": [{"body": "My bull dick shrank and is now bear pussy. SPCE still going to 50 before 2021 tho", "score": 2, "replies": []}]}]}, {"body": "Do you have a source for Chamath going on CNBC post earnings, or is that just speculation? Googled it but didn’t find anything", "score": 8, "replies": [{"body": "https://twitter.com/chamath/status/1230182805541466113?s=21", "score": 7, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}]}, {"body": "I’m long on SPCE but even I sold this last week for 300% gains.\n\nI got in before the surge and wasn’t expecting it to hit $30 until March, let alone $42\n\nI bought puts and will reinvest profits after ER once they announce share dilution and prices come back down to the $20s", "score": 7, "replies": []}, {"body": "2 DA MUUUNN🚀🚀🚀", "score": 6, "replies": []}, {"body": "would you recommend buying before ER or after ER and before CNBC?", "score": 7, "replies": [{"body": "All calls are ridiculously overpriced now because absolutely batshit crazy IV. Wait till after ER, otherwise you’re gonna get IV crushed.", "score": 12, "replies": [{"body": "thanks", "score": 2, "replies": []}, {"body": "Calls were on clearance this Friday. Now buy first thing Monday morning.", "score": 0, "replies": [{"body": "Are you nuts? Calls on SPCE were not on clearance at all! Mar06 $45c were selling for $410 per contract, for example. IV near 200% you’d be nuts to buy calls now. Even if the stock goes up, IV crush will wipe your gains.", "score": 4, "replies": [{"body": "Compare that price of 410 per contract with over 900  per contract two days before. That is  clearance. As far as IV goes, high  IV  is what makes you money and the IV will only go up as we go into earnings.", "score": 0, "replies": [{"body": "You must be selling calls. No way anyone would recommend buying calls at these prices and IV and expect a positive return 2 days before ER.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I own 100+ stock of spce not even counting the $38 calls for 3/20 I bought Friday.  I’m in on spce just on principal of how it’s been good to me.", "score": 6, "replies": []}, {"body": "Roku ceo showed up on tv after earnings and sent it from 8% to -5%.", "score": 7, "replies": [{"body": "Roku has competition.  For the moment, VG does not.", "score": 2, "replies": [{"body": "What about Blue origin and space x?", "score": 2, "replies": []}]}]}, {"body": ">And finally, $BA needs a win. They already in for $20m which is basically toilet paper money for these aviation monopolists. These guys are chomping at the bit to own commercial space. Expect an announcement where $BA is contracted to builds a fleet of next gen $SPCE ships.\n\nWhat the fuck is this retardation? Nobody is contracting a company to build space planes that can't build a jet with tech from the 1950s. Oh and btw they just had a catastrophic failure on their pathetic attempt to compete with space X (which was, as usual, just a sad copy of the Apollo moon module). \n\nIf anybody contracts with BA to do anything, you short the shit out of that company. Just look at spirit aerossytems lmao", "score": 7, "replies": []}, {"body": "I took all my SPCE positions out. A couple of days ago. Re-entering on earnings. Not feeling great about earnings at all.", "score": 15, "replies": [{"body": "Right. I will wait till for the dip after earnings release. But then again, im going to be worried if they make a big announcment and im not in.", "score": 6, "replies": [{"body": "If they make a big announcement I'd just buy a weekly and day trade the option on the day. Easy!", "score": 2, "replies": [{"body": "can you explain what you mean by this? As in buy a call after the big announcement and then sell it later in the day?", "score": 1, "replies": [{"body": "yea", "score": 1, "replies": []}]}]}]}, {"body": "Im with you. I dont think this will be pretty", "score": 2, "replies": []}]}, {"body": "I repeat this until I am sufficiently levereged for my personal risk tolerance\n\nG U H", "score": 5, "replies": []}, {"body": "I'm angry at all of the words you want me to read.  This is bullshit.  I'm going to pick up some puts, cuz fuck all your fancy words, and all that.", "score": 5, "replies": []}, {"body": "to the moon!", "score": 5, "replies": []}, {"body": "But AMRN's CEO showed up on news media after earnings dropped.", "score": 4, "replies": []}, {"body": "You are actual retarded to believe in this stock long term...", "score": 4, "replies": []}, {"body": "If you don’t sell before earnings and buy back in after you’re full retard. Bottom line is the stock will drop post earnings, it was pumped more than my wife was by her new boyfriend.\n\nTL;DR Sell pre earnings buy back post. Don’t hold as the stock will drop and the DD or having someone do an interview “because the news will be stellar” is ducking retarded. How does OP know the news won’t be great and they are trying to save face? They don’t. Long SPCE maybe..", "score": 10, "replies": [{"body": "How the f*** is your TL;DR longer than the actual content?", "score": 46, "replies": [{"body": "THIS", "score": 7, "replies": []}, {"body": "Maybe a warning \"too long, dont read\"", "score": 3, "replies": []}, {"body": "Got'em", "score": 2, "replies": []}]}, {"body": "Don’t Forget: \n\nSpace shuttles had a 40% vehicular failure rate and a flight failure rate of 1.5%.  For a space tourism company they'd have to get those numbers way down.", "score": 4, "replies": []}, {"body": "Nope. Chamath not sitting through a 20% down day on live tv. Don’t buy it.", "score": 7, "replies": [{"body": "What if he's there to do damage control? Keep the price falling further?", "score": 5, "replies": [{"body": "Nobody volunteers for a firing squad.", "score": 8, "replies": [{"body": "I hope this ages well.\n\nEDIT: _Narrator: This, in fact, did not age well_", "score": 8, "replies": []}, {"body": "Plus, not only is he appearing on CNBC, he also tweeted that he will be appearing meaning he wants people to watch.  If it was bad news, why tweet hype for your appearance? That would just bring more people to watch you face difficult questions.", "score": 3, "replies": []}, {"body": "Not everybody has a choice, especially when you have investors to save face with. \nIn any case I hope it all goes well.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Emojis are currently disabled due to ongoing investigation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I only read your first paragraph, but I know a lot more desperate vegans than potential space travelers. Inverse.", "score": 6, "replies": [{"body": "I know a lot more people that fly on airplanes than eat veggie burgers.", "score": 1, "replies": []}]}, {"body": "so buy naked puts on spce? all in", "score": 3, "replies": [{"body": "If you wanna be like me then yes.", "score": 4, "replies": [{"body": "Buy PUTs? WTF?", "score": 2, "replies": []}]}]}, {"body": "50? I thought it was going to 100. X10 like BYND.", "score": 3, "replies": [{"body": "I did add a “+”", "score": 2, "replies": [{"body": "What we buying? what is Strike and Expiration. Tell me so I can make some TENDIESSS", "score": -2, "replies": [{"body": "50 calls Jan 2022", "score": 1, "replies": []}]}]}]}, {"body": "Can you tell us Strike and Expiration please? I am an autist and I can't read shit besides Strike and Expiration", "score": 3, "replies": [{"body": "One word Leaps only", "score": 1, "replies": []}]}, {"body": "Yeah well I need it to rebound and go up before 2/28 so fuck you", "score": 3, "replies": [{"body": "Same, rolled my calls over on Thursday and lost most gains Friday", "score": 1, "replies": []}]}, {"body": "In the words of the creator himself, something something attention span monkeys, more than a paragraph makes it genius DD.", "score": 3, "replies": []}, {"body": "You have some serious balls to continue LEAPing a meme stock and not cash your millions in profit.\n\nWe are near a significant economic correction and all know that meme stocks will get hit the hardest. GL", "score": 3, "replies": []}, {"body": "I was feeling good on spce, after reading about everyone buying calls and shit I think I'm done w/it.", "score": 3, "replies": []}, {"body": "this is aging well lol", "score": 3, "replies": []}, {"body": "This didn’t age well", "score": 3, "replies": [{"body": "F", "score": 2, "replies": []}]}, {"body": "Hmm...CSPs, covered calls, or leaps before earnings 🤔", "score": 2, "replies": [{"body": "i’m in CSPs\n\niv too batshit right now to buy", "score": 3, "replies": [{"body": "That’s what I’m thinking.  Had a couple that expired Friday.", "score": 2, "replies": []}]}]}, {"body": "So what your saying is my weekly SPCE call isnt screwed? 🤔", "score": 2, "replies": [{"body": "No weekly is probably screwed.", "score": 2, "replies": [{"body": "How much is a call on $ROPE then?", "score": 1, "replies": []}]}]}, {"body": "You son of a bitch, I'm in", "score": 2, "replies": []}, {"body": "Are you... God? This must be the second coming!", "score": 2, "replies": []}, {"body": "To type everything that is wrong with this while on my phone would cause me more pain than reading your entire post did.\n\nGood luck.", "score": 2, "replies": []}, {"body": "I need it to go up before 2/28 shit!!!", "score": 2, "replies": []}, {"body": "Oh god there is going to be multiple SPCE rated suicides before the week ends! Invest in funeral homes and bio hazard cleaning operations.", "score": 2, "replies": []}, {"body": "Oh no, end of my buy in was done in mid Jan. Now I’m just sitting on it.", "score": 2, "replies": []}, {"body": "this aged well.. see you at $15..", "score": 2, "replies": [{"body": "Yup. Rekt. Sitting around 2.3m as of Friday 3/6/2020.", "score": 3, "replies": [{"body": "lol good luck tommorrow.", "score": 1, "replies": []}, {"body": "Sub 2MM now? I feel SPCE will turn around. My concern is that they will test the rocket but that news will get buried with all the virus related news taking center stage.", "score": 1, "replies": [{"body": "Oh, ya. Should have sold a few weeks ago. Still in minus 500k I trimmed 2 weeks ago to pay off my mortgage.", "score": 1, "replies": []}]}]}]}, {"body": "Epic fucking blow up. Print and frame this shit!", "score": 2, "replies": []}, {"body": "This aged so badly", "score": 2, "replies": [{"body": "Ya. Fail. I’m still up though. Thinking of declaring defeat and closing position tomorrow.", "score": 2, "replies": [{"body": "Epic failure. Re-Reading your thesis just shows how people think they know it all when going is good and they get ass fucked over night due to extraneous factors. \n\nIf you have held it thus far. Might as well hold for a while longer.", "score": 2, "replies": [{"body": "To be fair it took a black swann event to fuck him and even that at one point he was up 6.8 million and he did withdraw some at the peak so yes although hindsight is 20/20 he stuck to his beliefs and it backfired.You win some you lose some", "score": 2, "replies": [{"body": "I agree with your points. Didn’t mean to sound like asshole taking a dump on him. I guess my point was ego runs ahead before an epic fail like this.", "score": 3, "replies": [{"body": "Na Im just saying I get where you are coming from, I read his DD when he first made it and it made me some good money lol,but to be fair 28 days ago we were at all time highs and look at us now who would’ve seen this coming right?", "score": 2, "replies": [{"body": "Ya, I’ll admit I fucked up massively. Should have sold at the time. Still all that said and done I’m still sitting at a mil and I took 500k out to pay my mortgage and spread some money around the fam. I’m 850k cash and about 300k remaining spce position. \n\nI’ll say it again, I fucked this one up. Crazy thing is someone just commented on a corona post I made 55 days ago that said short airlines and Boeing. Had I sold and done that I would have been up like 20m. I’ve got to live with that. Imagine being the guy who flushed 5m. That’s me. It’s ok, only money. I have my health and my fam. Thank gd. I’ll be fine.", "score": 4, "replies": [{"body": "Don’t sweat it achari profit it profit man and your DD made me and some other dudes some good money when spce mooned,that being said shit happens. Personally Thank you for the DD and I’m sure you’ll get more chances to make more profit in the future besides money just paper it comes and it goes.", "score": 1, "replies": []}, {"body": "Profit is profit! My personal FOMO is on BA. When I saw them drop below 300 I knew it was game on - but my brokerage funds didn't clear until a few days later and I didn't check back. Sigh.", "score": 1, "replies": [{"body": "I literally called puts on ba and airlines 56 days ago. Here on wsb. I didn’t follow my own advice. Check history.", "score": 1, "replies": [{"body": "I feel worse for you then, because you could jump, but didn't. Damn huh. \n\n\n\nCuddle?", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Positions or ban", "score": 3, "replies": [{"body": "Bro look at his post history.", "score": 1, "replies": [{"body": "Got u. I have the same calls", "score": 0, "replies": []}]}]}, {"body": "**FUCK YOU MY CALL EXPIRED YESTERDAY**", "score": 2, "replies": [{"body": "I didn’t tell you to get weeklies or monthlies. I’m in leaps.", "score": 10, "replies": [{"body": "**I AM A POOR RETARD, YOU THINK I CAN AFFORD A LEAP?**", "score": 15, "replies": []}, {"body": "Leaps are yearly right???", "score": -2, "replies": []}]}]}, {"body": "ALLROGHT IM FUCKING AGAIN LETS GO SPCE TO THE MOON BABY ROUND 2", "score": 3, "replies": [{"body": "That’s the spirit", "score": 3, "replies": []}, {"body": "Are you ok?", "score": 1, "replies": [{"body": "no", "score": 1, "replies": [{"body": "Well u r atleast alive. Achari guy probably looking for a place to string up some rope right now!", "score": 1, "replies": [{"body": "Lol yeah. I kinda fucked myself with spce but luckily i made some back with APT", "score": 1, "replies": [{"body": "I still have 2021 Jan calls. Who knows, have some time to let it ride.", "score": 1, "replies": [{"body": "Gl dude", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "SPCE focus is about suborbital space tourism. Virgin Orbit is their satellite launching arm (you aren’t getting that with SPCE’”.) this is a tourism play without in-depth tech built for the future like Blue or SpaceX. She’s coming back to earth. I see a very cool and profitable company (5bil cap max best case all sales targets hit ) that is hitting stratosphere off hype.", "score": 3, "replies": [{"body": "I read another thread and online also thar VIRGIN galactic is acquiring or merging with Virgin orbital.", "score": 5, "replies": [{"body": "I hope this is accurate", "score": 3, "replies": []}, {"body": "I wouldn't count on it; especially if VO is taking over the satellite launch contracts. There's way too much liability in space tourism, one disaster will ruin the company/industry for a long time. No sense in attaching a money making business to it.", "score": 1, "replies": []}]}]}, {"body": "Jesus man just let it go. Pump it over. There's always some dude trying to revive and re make the ridiculously overvalued pumped stock after its peak. \n\nYou are that guy.\n\nThis shyt has gotten out of control forreal", "score": 7, "replies": []}, {"body": "alright fuck it", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "His tweet says it’s Wednesday now? What’s that about?", "score": 1, "replies": [{"body": "Yes, that’s right.", "score": 1, "replies": []}]}, {"body": "Reposting this from @Yahoo comments from a user TIM\n\nhttps://finance.yahoo.com/quote/SPCE/community/\n\nthese are the Types of Contracts or Services that VG is currently registered to Do business with the Fed Govt.\nSource: beta.sam.gov/\n\nCode Description:\n\n336414 Guided Missile and Space Vehicle Manufacturing\n\n336415 Guided Missile and Space Vehicle Propulsion Unit and Propulsion Unit Parts Manufacturing\n\n336419 Other Guided Missile and Space Vehicle Parts and Auxiliary Equipment Manufacturing\n\n481212 Nonscheduled Chartered Freight Air Transportation\n\n927110 Space Research and Technology\n\nWho knows if they announce a contract/award Come Tuesday at Earnings. Best of Luck to all.\n\nI could not cross check this, how can we know? When i searched for those NAICS code on beta.sam.gov could not get any information..", "score": 1, "replies": []}, {"body": "Found this:\n\nhttps://beta.sam.gov/awards/76234372%2BAWARD?naics=336414\n\nFinancial Information\nAmounts\nAmounts\nType of Amount\tCurrent\tTotal\nAction Obligation:\t-$3,055,000.00\t$1,645,000.00\nBase and Exercised Options Value:\t$0.00\t$4,700,000.00\nBase and All Options Value (Total Contract Value):\t$0.00\t$4,700,000.00\nFee Paid for Use of IDV:\t$0.00\tN/A\n\nDescription of Requirement\nIGF::OT::IGF. VCLS IS A FIRM-FIXED PRICE CONTRACT FOR A DEDICATED LAUNCH SERVICE FOR U-CLASS SATELLITES WITH NASA HAVING SOLE RESPONSIBILITY FOR THE PAYLOAD ON THE LAUNCH VEHICLE. NASA LAUNCH SERVICES PROGRAM (LSP) SUPPORTS THE CUBESAT LAUNCH INITIATIVE (CSLI) BY PROVIDING LAUNCH OPPORTUNITIES FOR CUBESATS THAT ARE CURRENTLY ON THE MANIFEST BACK LOG.\n\nMOD 4 - RECOGNIZE VIRGIN ORBIT, LLC AS THE SUCCESSOR IN INTEREST TO CONTRACT NNK15LB20C, VIRGIN GALACTIC,LLC. THIS MOD ALSO DE-OBLIGATES UN-LIQUIDATED FUNDS FROM NNK15LB20C AND TRANSFER TO CONTRACT 80KSC018C0010", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "4/2 CRM 230c's because im retarded.", "score": 1, "replies": []}, {"body": "TLDR", "score": 1, "replies": []}, {"body": "\\*Tips hat off to you\\*", "score": 1, "replies": []}, {"body": "Blaze capital on YouTube covers this chart the best imo. Check out their deep dive video! \n\nWe’re going to space!", "score": 1, "replies": []}, {"body": "I don't think you understand how Vanguard works. \n\nDo some DD on index funds.", "score": 1, "replies": [{"body": "No, I’m pretty sure I do. Or are you telling me all stonks go in all funds? Which index is spce a part of? Take a look at the mutual funds spce were added to.", "score": 4, "replies": []}]}, {"body": "Fuck yes. I have 650 shares ($17/share entry) and a $10.000 worth of JAN15 2021 calls $42 strike price.\n\nLet’s ride this bitch to the moon 🚀", "score": 1, "replies": [{"body": "Damn man. You are gonna be feasting on tendies soon my friend.", "score": 1, "replies": []}]}, {"body": "Can someone make a td:ld?", "score": 1, "replies": []}, {"body": "That was entertaining", "score": 1, "replies": []}, {"body": "Calls for Jan 2021 it is", "score": 1, "replies": []}, {"body": "I wish you luck but this sounds autistic and like far too much emotional investment. Perfect for this subreddit.", "score": 1, "replies": []}, {"body": "Absolutely moronic analysis. I have puts.", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "Futures say that craft is crashing", "score": 1, "replies": []}, {"body": "Comparing BYND to spce is fuckin retarded. \n\nOne is a seemingly practical new food company and the other is a speculative rocketman amusement park in the sky for rich fucks. \n\nI have $10 strike puts for mid year but it’s small dough. I think you’re being greedy and should sell but you do you boo.", "score": 1, "replies": []}, {"body": "Thoughts on the dip? I'm holding LEAPS.", "score": 1, "replies": [{"body": "OP took a header off his “hill side” mansion. On a serious note I think stock is fuck’d for now. The good thing with leaps (even OP is playing this with leaps) we can stay in fight a little longer. As for the weekly players.......RIP", "score": 1, "replies": [{"body": "Going up again. Once the market recovers SPCE can easily reach the 30s", "score": 1, "replies": [{"body": "Reach 30 when?", "score": 1, "replies": [{"body": "Nobody knows that lmao", "score": 1, "replies": []}]}]}]}]}, {"body": "I think this will go back to the teens first. TSLA is getting ass fucked today. SPCE is a nice concept but monetizing this play is iffy. Not that it can’t be done, just that the CEO does not inspire much confidence. Also Chamath is a guy who got lucky being at the right place at the right time with FB and being an early employee. Can’t find anything else he has done that makes him “smart” money. He hyped Elon and TSLA but then almost all the SFers has to do that or risk being called a pariah. \n\nAlso his performance in CNBC was nothing much. Just typical BS hype all these charlatans spew. We work et al. \n\nHe is called King maker by the OP. What did he do to deserve that?? No one knows.", "score": 1, "replies": [{"body": "The dude prints money. For you to say he’s nothing special take a special kind of nerve. He’s right, spce is a long term play and my leaps will be just fine. I’m still in.", "score": 1, "replies": [{"body": "Yeah. You keep saying “Prints” Money. On what has he printed money? If you are talking about the deal he had with Branson, sure he got in at a great prices. But how does that help you make money???", "score": 2, "replies": []}]}]}, {"body": "still holding?", "score": 1, "replies": [{"body": "Ya. Getting rekt though.", "score": 1, "replies": [{"body": "You gonna dump them when it rises a little?", "score": 1, "replies": [{"body": "It’s pretty terrible. Maybe. I trimmed about 500k last week and paid my mortgage.", "score": 1, "replies": [{"body": "Just wondering if you don’t mind answering, what’s your career? And how old r you? I’ve never seen someone invest this much money lol.", "score": 1, "replies": [{"body": "I’m 35-50. Technology, programmer.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Prob not", "score": 1, "replies": []}, {"body": "I intend to double down on SPCE next week.", "score": 1, "replies": []}, {"body": "No tldr fuck off", "score": 0, "replies": [{"body": "Read the header, mouth breather.", "score": 7, "replies": [{"body": "I can’t read I have aids", "score": 11, "replies": [{"body": "This guy fucks... or did!", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Yeah what are you expecting out of this?", "score": 2, "replies": []}, {"body": "That shit is going to zero with a bullet son", "score": 1, "replies": []}]}, {"body": "You clowns pushing this pump and dump amaze me .Valuing this thing at 10B+ when they have about $170M in assets.", "score": 0, "replies": [{"body": "Rude awakening around the corner.", "score": 1, "replies": []}]}]}
{"title": "Which one of you clowns mailed me a dress?", "selftext": "[removed]", "id": "f89v6s", "created_utc": 1582466885.0, "score": 3730, "upvote_ratio": 0.98, "num_comments": 250, "comments": [{"body": "I mailed you a dildo and you didnt complain so obviously you're enjoying it.", "score": 4601, "replies": [{"body": "He's riding it to the moon", "score": 1529, "replies": [{"body": "Jartek TO THE MOON", "score": 270, "replies": [{"body": "$SPCE TO THE MOON? Instructions unclear!", "score": 67, "replies": [{"body": "Little late there brother. I rode that SPCE dildo from 18 to 27. Missed tendies but definitely pounded it good.", "score": 29, "replies": []}]}]}, {"body": "That’s a funny place to take a Bad Dragon", "score": 47, "replies": [{"body": "Nothing funny about taking a Bad Dragon up your ass this is serious business as a wise man used to say stonks only go UP", "score": 33, "replies": []}]}, {"body": "If I had money to give award I would. This shit had me dead. My portfolio sucked cuck on Friday...", "score": 17, "replies": [{"body": "Sucking? Impossible. You must be delusional, we only go up in this sub", "score": 7, "replies": [{"body": "It told me emojis are disabled in this thread the hell (laughing face)", "score": 6, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Emojis are currently disabled due to ongoing investigation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 30, "replies": [{"body": "God damnit", "score": 2, "replies": []}]}]}]}]}, {"body": "sDonks? o.0", "score": 1, "replies": []}, {"body": "Did you find Tommy Lee Jones up there?", "score": 1, "replies": []}]}, {"body": "His position is long on dildo", "score": 16, "replies": [{"body": "Can't short that for the mods.", "score": 3, "replies": []}]}, {"body": "Hopefully you got some use out of it before mailing it to him.", "score": 3, "replies": [{"body": "I bet OP included a self addressed satchel so he could have it mailed back to him afterwards.", "score": 1, "replies": [{"body": "I did, but i asked for him to keep it lubed up as well.", "score": 2, "replies": [{"body": "I presume you're talking about the body's natural lubricant? Not the store bought shit?\n\nPS: I'd use a spew emoji here but the dongus eating fuckstick bot appears to be on a ban spree... so eat my dongus automod.", "score": 1, "replies": [{"body": "Mods are gay, jartek is gayer", "score": 2, "replies": []}]}]}]}, {"body": "I did a number on it.", "score": 1, "replies": []}]}]}, {"body": "Did they get the size right?", "score": 582, "replies": [{"body": "Looks waaaaaay too small", "score": 160, "replies": [{"body": "You calling him fat or thicc?", "score": 17, "replies": []}, {"body": "Happy cake day", "score": 15, "replies": []}, {"body": "That's what she said.", "score": 2, "replies": []}, {"body": "[removed]", "score": 0, "replies": []}, {"body": "Happy cock day", "score": 0, "replies": []}]}, {"body": "I am Spartacus.", "score": -119, "replies": []}]}, {"body": "Pic of you in the dress, for verification.", "score": 3071, "replies": [{"body": "mods gay confirmed", "score": 1072, "replies": [{"body": "[deleted]", "score": 215, "replies": [{"body": "This is the way.", "score": 84, "replies": [{"body": "This is the way.", "score": 40, "replies": [{"body": "This is the way.", "score": 37, "replies": [{"body": "This is the way.", "score": 25, "replies": [{"body": "This is the way.", "score": 18, "replies": [{"body": "This is the way.", "score": 14, "replies": [{"body": "This is the way.", "score": 8, "replies": [{"body": "This is the way.", "score": 3, "replies": []}]}]}, {"body": "that we wash our hands", "score": 0, "replies": []}, {"body": "this is the gay.", "score": -7, "replies": []}]}]}]}]}]}]}, {"body": "I’m gay, can I be modded ?", "score": 1, "replies": [{"body": "no", "score": 1, "replies": []}]}]}, {"body": "Gonna need him to get on his knees and look up at the camera with broken eyes\n\nAlso for verification", "score": 869, "replies": [{"body": "Else perma ban", "score": 207, "replies": []}, {"body": "In a \"Feed me Senpai\" pose..", "score": 33, "replies": []}, {"body": "Mascara running, slightly smeared lipstick and a couple tears. Y'know, for *verification.*", "score": 26, "replies": []}, {"body": "Yessssss", "score": 69, "replies": []}, {"body": "Eyes don't break they *moosh*.\n\nSrc: no comment, uncle was... nm", "score": 15, "replies": []}, {"body": "With the circular light outlining his pupils pls", "score": 10, "replies": []}]}, {"body": "This is the way", "score": 145, "replies": [{"body": "This is the way.", "score": 44, "replies": [{"body": "This is the way.", "score": 42, "replies": [{"body": "This is the way", "score": 35, "replies": [{"body": "This is the way.", "score": 30, "replies": [{"body": "This is the way.", "score": 23, "replies": [{"body": "This is the way.", "score": 20, "replies": [{"body": "This is the way.", "score": 13, "replies": [{"body": "This is the way.", "score": 3, "replies": []}, {"body": "This is the way", "score": -22, "replies": []}, {"body": "This is the way.", "score": -22, "replies": [{"body": "This is the way", "score": -7, "replies": [{"body": "This is the way.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "This is the way", "score": -8, "replies": []}]}, {"body": "Or ban", "score": 30, "replies": []}, {"body": "300iq response", "score": 12, "replies": []}, {"body": "Agreed, or ban him ;)", "score": 1, "replies": []}]}, {"body": "When you figure out who fucked up the return label be sure to include some crayons with the package. The sender might want a snack.", "score": 913, "replies": [{"body": "How did you know the sender is in the Marines?", "score": 232, "replies": [{"body": "[deleted]", "score": 31, "replies": []}]}, {"body": "[https://imgur.com/a/c90mAwS](https://imgur.com/a/c90mAwS)", "score": 6, "replies": []}]}, {"body": "Knew you'd like it. Thanks for signing both sides of my book. ;) Cheers!", "score": 514, "replies": [{"body": "Did you really send it?", "score": 189, "replies": [{"body": "Yep. Hate to say it lol", "score": 217, "replies": [{"body": "Why do you hate to say it? This only confirms mods are gay and that's glorious", "score": 49, "replies": []}]}, {"body": "The word is culprit, not culprate", "score": 42, "replies": [{"body": "Thank you", "score": 35, "replies": [{"body": "Now you better send some photos to show it fits.\n\nI suggest trying the pose in picture 3\n\nhttps://www.amazon.com/Halife-Womens-Summer-Sleeves-Dresses/dp/B0834M3N9T?th=1&utm_source=share&utm_medium=ios_app&utm_name=iossmf#immersive-view_1582495073976", "score": 45, "replies": [{"body": "Do not try the pose in picture 3, k thx", "score": 12, "replies": [{"body": "So many wonderful childhood memories that evoked!! About me and my Hand, with my collection of pantyhose and other women's clothing ads. Sexy pics of Jane Fonda, Joey Heatherton, Ann Margaret, Liberace, Paul Lynde...", "score": 6, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Emojis are currently disabled due to ongoing investigation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 22, "replies": []}]}]}]}]}, {"body": "Name checks out", "score": 6, "replies": []}, {"body": "This is epic and made me piss myself a little.", "score": 2, "replies": []}]}, {"body": "Are you going to do another round of signing, I got distracted planning my gay wedding in an abandoned amusement park and missed the deadline.", "score": 193, "replies": [{"body": "Grats on the wedding. And yes I will. I'll announce it but probably won't be for another couple months (likely April)", "score": 116, "replies": [{"body": "Fucking yes. I missed it due to real life too now everything sucks", "score": 15, "replies": [{"body": "Pro tip: Stop living a real life and everything will stop sucking.", "score": 11, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "Mmm the mods suck so good", "score": 6, "replies": []}]}]}]}]}]}, {"body": ">  I received a package with two books and no return envelope, no name, and no way for me to know who sent\n\nAbsolutely perfect for this sub.", "score": 88, "replies": [{"body": "[deleted]", "score": -11, "replies": [{"body": "What? Yeah you can", "score": 13, "replies": [{"body": "How? Not at USPS and ups and fedex.. so how??", "score": 0, "replies": [{"body": "USPS. Regular snail mail.", "score": 1, "replies": []}]}]}]}]}, {"body": "Book too expensive to buy  :( lost all my money in stonks", "score": 343, "replies": [{"body": "No one loses money in stonks. Stonks only go up. \n\nI think we need to ban this poor soul!", "score": 251, "replies": [{"body": "The man is delirious. Must have been holding bonds - poor wretch. Stonks only go up.", "score": 82, "replies": [{"body": "You didn't see a crash because *it’s not there!*", "score": 30, "replies": [{"body": "It's simply a dip to buy.", "score": 19, "replies": [{"body": "AVERAGE DOWN", "score": 8, "replies": []}]}, {"body": "oƃɐ sʎɐp oʍʇ ǝɔuᴉs dn uǝǝq ǝʌɐɥ sʞuoʇs ʎɯ ǝɹns ɹoℲ", "score": 7, "replies": [{"body": "Somebody translate this. I don't speak Vegemite", "score": 4, "replies": []}, {"body": "Isn’t Cialis a bitch sometimes!", "score": 2, "replies": []}]}, {"body": "This man is in shock; take him to the infirmary.", "score": 5, "replies": [{"body": "Down 3.6%, not great, not terrible.", "score": 3, "replies": []}]}]}]}, {"body": "He must be 🌈🐻 gang and bought puts!", "score": 4, "replies": []}]}, {"body": "GAY BEAR SPOTTED\n\nINITIATING LETHAL FORCE\n\nDO NOT RESIST", "score": 12, "replies": []}, {"body": "You can't lose money in stonks if you don't sell. Did you sell, you pussy?", "score": 7, "replies": []}, {"body": "Imagine losing all your money in this market.", "score": 5, "replies": []}]}, {"body": "It puts the lotion on its skin or else it gets the hose again.", "score": 93, "replies": []}, {"body": "Hahaha I wish I had thought of this\n\nI got my copy a few days ago\n\nIt sits in the lobby of our office now\n\n https://imgur.com/TAJmBDs.jpg", "score": 207, "replies": [{"body": "10/10 cable management.", "score": 182, "replies": [{"body": "Those screens look like one good strong knock on the door will knock them right on the floor.", "score": 22, "replies": [{"body": "Looks like someone already did that to the sound bar", "score": 1, "replies": []}]}]}, {"body": "I like that there's a stock chart on one of the TVs as well", "score": 54, "replies": [{"body": "Haha thanks \n\nWe keep CNBC and ESPN playing most days in the lobby/waiting area on mute and some music playing. \n\nBetween the two, most of our guests will be somewhat interested in at least one. \n\nI avoid politics because it's just way too polarizing and emotional for a workplace.", "score": 58, "replies": [{"body": "Get Cartoon Network and Comedy Central instead. Much more entertaining!", "score": 41, "replies": [{"body": "I have those too\n\nPretty good idea\n\nI have Disney+ so I've been playing some of those marvel cartoons too\n\nThey are really stupid but pretty entertaining as well", "score": 11, "replies": [{"body": "Hey man, 90s spiderman is not stupid. That shit is a work of art", "score": 1, "replies": [{"body": "https://imgur.com/ZADOEQM.jpg", "score": 2, "replies": []}]}]}]}, {"body": "Why not just screencast a browser window of wsb up there?", "score": 2, "replies": [{"body": "Honestly, I should. I could set it to auto refresh.", "score": 2, "replies": []}]}, {"body": "Sounds entirely too similar to my livingroom.", "score": 1, "replies": []}, {"body": "> I avoid politics because it's just way too polarizing and emotional for a workplace.\n\nSmart move tbh.  CNBC sometimes dabbles in the political shit but most of the time they're talking about how shriveled Jim Cramer's dick is.  And ESPN, well, once in a great moon they dive into it but most of the time they're dickriding LeBron.", "score": 1, "replies": [{"body": "Yeah, you're right, I get rid of CNBC when they get too political. It's not too often. The virus news is basically all they talk about now and is getting really boring. There was barely any actual earnings coverage and it was a pretty interesting quarter. \n\nESPN blows but it's the best we have for sports on cable. Sportscenter is all LeBron, Mahomes or Brady lately. Hardly any NHL coverage and hardly any college ball coverage. They had Kobe coverage for 2 weeks straight. I loved watching the guy play too but it was getting depressing. \n\nI get it. They are going by what sells and ratings. But damn, I wish other news sold too.", "score": 1, "replies": [{"body": "At least the virus news is relatively apolitical.  Viruses infect everyone, gaybear or not.\n\nOnce it hits the US I expect some news outlets to say \"coronavirus is affecting minorities the most, here is why white people are bad because of it\" or some dumb shit like that.", "score": 3, "replies": []}]}]}]}, {"body": "The chart shows stonks only going up", "score": 13, "replies": []}, {"body": "$TSLA as well. Stonks", "score": 2, "replies": []}]}, {"body": "Do you work at a hand job parlor?", "score": 44, "replies": [{"body": "How else do you guys get money for options?", "score": 24, "replies": []}]}, {"body": "Dunder Mifflin", "score": 5, "replies": []}, {"body": "Good for research and gambling", "score": 1, "replies": [{"body": "I know you...", "score": 1, "replies": []}]}, {"body": "Go Bucks", "score": 1, "replies": []}, {"body": "Those chairs are the perfect height for anal and breakfast bars.", "score": 1, "replies": []}, {"body": "Lol your ghetto office looks very appropriate for a WSBr", "score": 1, "replies": []}]}, {"body": "Rumor has it that they bought that dress for their Valentine, but after they were given a rain check they decided to mail it to you since the deadline for you to receive the book was the day after Valentine's Day.", "score": 40, "replies": []}, {"body": "At least looks like you’re treating the dress carefully. A velvet blouse hanger to prevent the shoulders from stretching, that’s nice.", "score": 20, "replies": [{"body": "what are you, trans?!", "score": 2, "replies": [{"body": "Lmao u/imactually a woman", "score": 21, "replies": [{"body": "that’s even gayer", "score": 21, "replies": []}, {"body": "There’s women here?", "score": 11, "replies": []}]}, {"body": "he might have a wife you know", "score": 1, "replies": []}]}]}, {"body": "I haven't gotten my book back.. is this expected? On its way? I fucked up the return label?", "score": 33, "replies": [{"body": "The last batch of books was mailed out on Friday, so if you don't receive them by Tuesday or Wednesday you should be worried. I kept pictures of all the return labels and tracking info so let me know by then if you haven't received yet.", "score": 59, "replies": [{"body": "Awesome thanks", "score": 11, "replies": []}, {"body": "Ah, there's no more books? =(", "score": 2, "replies": [{"body": "I'll be signing another round in a couple months. Will let everyone know when I do.", "score": 8, "replies": [{"body": "Awesome.. I feel like an idiot for not getting one already.. Appreciate it!", "score": 3, "replies": []}]}]}, {"body": "Casual WSBer. Wherethefuck does one get this book?", "score": 3, "replies": [{"body": "https://www.amazon.com/dp/B084DFNN2F/qid=1580486418", "score": 2, "replies": [{"body": "Is there a central place for the story behind how this book came about?", "score": 1, "replies": [{"body": "You'd have to elaborate your question and maybe I can answer it. As of now, there isn't much of a central place for the \"behind the scenes\" for the book.", "score": 1, "replies": [{"body": "Guess I meant to ask - how did you come about to write the book / what inspired you", "score": 3, "replies": [{"body": "Oh I'm not prepared to answer that truthfully. I'd say fame and money but I'd be lying.\n\nThat said I've been floating the idea of writing a book ever since I learned of leveraged vix etfs back in 2012. There was a specific kerfuffle with credit suisse (issuer of tvix) that made me wtf at the entire system.\n\nFor what it's worth, it's around that time that I also started wsb.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "you said you were a bottom, what’s the problem?", "score": 12, "replies": []}, {"body": "Where can I shoplift a copy of this book?", "score": 11, "replies": []}, {"body": "lol", "score": 15, "replies": []}, {"body": "[deleted]", "score": 25, "replies": [{"body": "$BCKY", "score": 1, "replies": []}]}, {"body": "Wear the dress", "score": 7, "replies": []}, {"body": "Just received my books back! Thank you for signing them. Really appreciate it.", "score": 6, "replies": [{"body": "You're welcome. Hope you enjoy it", "score": 3, "replies": []}]}, {"body": "What in the ugly ass grandma dress .. Wtf. Go to FashionNova.com and do it fucking right next time. \n\nWe need the titties showing and the booty defined", "score": 11, "replies": []}, {"body": "LOL", "score": 10, "replies": []}, {"body": "You son of bitch, I'm in.  Send me  dress too.", "score": 3, "replies": []}, {"body": "Hey mom, I made it.", "score": 3, "replies": []}, {"body": "it's A nice pattern", "score": 3, "replies": []}, {"body": "Part of the clown suit.", "score": 3, "replies": []}, {"body": "Wear it or ban", "score": 3, "replies": []}, {"body": "My book didn't arrive until it was too late to mail to get it there by the 15th. Finished reading the book though, that was a fun read! Got to know a more about the events I've seen happen throughout my time following WSB.", "score": 3, "replies": [{"body": "I'll be signing another round in April.", "score": 2, "replies": [{"body": "Awesome. Thanks for letting me know.", "score": 1, "replies": []}]}]}, {"body": "Awe come on I cant jerk off to this\n\n\n*Narrator: He did in fact jerk off to this.*", "score": 4, "replies": []}, {"body": "some dumbass made a book?", "score": 8, "replies": [{"body": "Yeah, this dumbass did.", "score": 30, "replies": [{"body": "Bruh lmfao", "score": 7, "replies": []}]}, {"body": "He's trying to monetize the subreddit like all autists do.", "score": 13, "replies": [{"body": "r/agedlikewine", "score": 2, "replies": []}]}]}, {"body": "Dress looks nice. Hopefully it's V cut.", "score": 2, "replies": []}, {"body": "What is this shit?", "score": 2, "replies": []}, {"body": "That’s an old lady dress", "score": 2, "replies": [{"body": "Old ladies need their hair pulled too", "score": 5, "replies": [{"body": "Too real", "score": 1, "replies": []}]}]}, {"body": "Made in china?\n\nHave it checked for Corona virus", "score": 2, "replies": []}, {"body": "But does it fit?", "score": 2, "replies": []}, {"body": "Which one of you retards gave him the bad review, saying we’re racist, misogynists, homophobes?", "score": 2, "replies": []}, {"body": "Cum in it to assert dominance and then mail it back.", "score": 2, "replies": []}, {"body": " And how is this related to WSB? Stocks ? Options ? \n\nBan this post", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Needs more moomoo", "score": 1, "replies": []}, {"body": "Looks nice.", "score": 1, "replies": []}, {"body": "All the bubble wraps quarantined", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Emojis are currently disabled due to ongoing investigation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Is there like a picture of who came\n\nNvm thought this was a face to face", "score": 1, "replies": []}, {"body": "Are u famous", "score": 1, "replies": []}, {"body": "Pic of you in the dress or Ban!!", "score": 1, "replies": []}, {"body": "Ha Life!", "score": 1, "replies": []}, {"body": "This is amazing.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Emojis are currently disabled due to ongoing investigation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Well it’s not a bad looking dress", "score": 1, "replies": []}, {"body": "Is this book going to teach me how to get tendies or complain about boomers?", "score": 1, "replies": []}, {"body": "I think your husband bought that for you to wear tonight", "score": 1, "replies": []}, {"body": "Wear the dress", "score": 1, "replies": []}, {"body": "Self-doxxing is a complicated profession", "score": 1, "replies": []}, {"body": "I mailed you some lulu's with instructions to put them on and PM me some pics of your ass in them! WTF I'm still waiting?", "score": 1, "replies": []}, {"body": "Lol that motherfucker got you a moo moo dress! He wants that easy access to your goods!", "score": 1, "replies": []}, {"body": "What a lovely dress, enjoy", "score": 1, "replies": []}, {"body": "LMAO!", "score": 1, "replies": []}, {"body": "wow much gayyy", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Emojis are currently disabled due to ongoing investigation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Emojis are currently disabled due to ongoing investigation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "Some guys go there whole life without anyone buying them a dress. Have you even tried it on?", "score": 1, "replies": []}, {"body": "Try it on", "score": 1, "replies": []}, {"body": "There's a WSB book?", "score": 1, "replies": []}, {"body": "Thats insulting. They sent u a boomers dress", "score": 1, "replies": []}, {"body": "Someone sent me a dress too. Had my name on the package and everything. Im not gay though. Plus it didnt fit... :/", "score": 1, "replies": []}, {"body": "Going to buy a copy for my dad who used to work in finance, haha. Great work with this place and the book.", "score": 1, "replies": []}, {"body": "Mods are gay. Traps are gay. The rules of life", "score": 1, "replies": []}, {"body": "Have you signed any copies for overseas degenerates? \n\nI’m in Australia and would like to get it signed, possibly upside down in your April round.", "score": 1, "replies": [{"body": "I have but it's expensive. You basically have to by the book in the US and pay like $30 shipping to AU.", "score": 2, "replies": []}]}, {"body": "To be honest, I'd be more disappointed if it didn't happen.", "score": 1, "replies": []}, {"body": "Put it on, bitch.", "score": 1, "replies": []}, {"body": "Does it fit?", "score": 1, "replies": []}, {"body": "Haha", "score": 1, "replies": []}, {"body": "Zhuge Liang?", "score": 1, "replies": []}, {"body": "IS JOKE!", "score": 1, "replies": []}, {"body": "Where’s my copy of the book?", "score": 1, "replies": []}, {"body": "Is there an audio version?", "score": -1, "replies": []}, {"body": "[removed]", "score": -1, "replies": [{"body": "It's on the sidebar", "score": 4, "replies": []}, {"body": "Not just someone. The one, first of the autist.", "score": 2, "replies": []}]}, {"body": "Anything useful in the book? Considering spending me money but I want to be sure :P Now if it were TSLA calls I wouldn't think for a minute.", "score": 0, "replies": []}, {"body": "mods are gay confirmed.", "score": -2, "replies": []}]}
{"title": "Major concerns for global recession", "selftext": "Jerome Powell has already said that the Fed will agressively combat the next recession. There is forward guidance, quantitative easing and lowering interest rates, something he has adamantly opposed, but has probably already reconsidered, as central banks scramble to form and implement strategy to prevent a massive economic crisis.\n\nIt is already looking more and more likely that the Fed will reduce interest rates to zero or near-zero. Increasing repo liquidity would be ineffective given the levels currently already contributed.\n\nDropping interest rates, however, will have a self-fulfilling affect, leading to global recession.\n\nhttps://preview.redd.it/jomtwog5e5j41.jpg?width=2856&format=pjpg&auto=webp&s=0efae6a845af884a188a3f6fabbdd60e292f8620\n\nFull containment or potential cure of the coronavirus will not occur quickly enough, as the numbers of infection and death increase around the world.\n\nWith interest rates throughout most of the world being already near or below zero, a major correction seems unavoidable. The panic selling of the past two days adequately reflects the risk the coronavirus has on a global scale.\n\nCoronavirus is the black swan.", "id": "f9funz", "created_utc": 1582659765.0, "score": 391, "upvote_ratio": 0.95, "num_comments": 250, "comments": [{"body": "CDC just announced (1hr ago) they fully expect the beer to be shipped to the US\n\nTL;DR Puts", "score": 190, "replies": [{"body": "Just don’t open the package", "score": 59, "replies": [{"body": "The plastic bubble wrap is filled with Chinese air.  \nFriends don't let friends pop bubble wrap.", "score": 22, "replies": [{"body": "The virus doesn't live long enough in them", "score": 1, "replies": [{"body": "Sounds like something big virus would say.", "score": 1, "replies": []}]}]}]}, {"body": "East bound and down, loaded up and trucking.", "score": 8, "replies": [{"body": "We gonna call what they say we should put", "score": 9, "replies": []}]}, {"body": "Its already in the us, just not detected yet", "score": 1, "replies": []}]}, {"body": "many boomers ready to retire, im sure they want ti liquidate some stock positions before a recession...", "score": 290, "replies": [{"body": "This is my biggest fear right here.  Boomers, afraid of losing their retirement savings to the next recession, panic sell and cause the next recession.", "score": 279, "replies": [{"body": "Not just boomers, everyone who was invested in the 2008 stock market too.  Their children too.  Watching parents or grandparents lose their homes or 401k causes anxiety today.", "score": 35, "replies": []}, {"body": "If we all just kill a Boomer we could mitigate this effect.", "score": 166, "replies": [{"body": "that's what the virus is for.", "score": 223, "replies": [{"body": "This is the way", "score": 85, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "you don't know what you're talking about... The united states only has about 100,000 ICU beds in the entire country.\n\nOf those only between 2 and 20 in each hospital are capable of being used in quarantine. You can't just put a person with a highly viral contagious pneumonia in the ICU with a bunch of extremely sick people...\n\nLastly we have 0 surge capacity. Our ICU's run at near 100% capacity all the time and they're designed that way, because it would be extremely expensive to have unused ICU beds.\n\n&#x200B;\n\nIt's not about what kind of care we can give, it's a capacity issue when thousands show up all at once with severe pneumonia requiring mechanical breathing and a disease that has an r0 of \\~2-6+ and is airborne.", "score": 52, "replies": [{"body": ">You can't just put a person with a highly viral contagious pneumonia in the ICU with a bunch of extremely sick people\n\n***Technically*** you can.  \nIt's just frowned upon.", "score": 30, "replies": [{"body": "Like masturbating on an airplane", "score": 26, "replies": [{"body": "i too tried this", "score": 8, "replies": []}]}, {"body": "well.... ya i got nothing, you win that one. lol", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Yeah, you guys never go to music festivals, public transportation, airports, busy restaurants, sporting events, county fairs. Only NY and LA are at risk bois", "score": 20, "replies": [{"body": "This. The first case in Croatia is a dude going to a football game in Italy !!", "score": 3, "replies": []}]}, {"body": "Italy says otherwise.. you're hoping, but you're going to be wrong.. just prepare a little bit, no reason to roll the dice. It's the ease of travel that's the biggest problem and the shit can be spread by farts, poops, hangs in the air, surface contacts, etc.. this shit is highly virulant.\n\nreally gives a new meaning to SBD's.", "score": 17, "replies": [{"body": ">really gives a new meaning to SBD's.\n\n\"It was just a little poof, now 3 are dead\" -future headline", "score": 3, "replies": []}, {"body": "> Italy says otherwise\n\nItaly is pretty densely populated.", "score": 1, "replies": []}]}, {"body": "Where do you think most of the money in this country that subsidies the rest of the country is made?\n\nTexas, Flordia, Cali, and the tristate area.\n\nAll with large urban population centers.  NYC is particularly fucked because we often take mass transit.", "score": 1, "replies": []}, {"body": "We’ve found the new head of Trump’s CDC boys! Here he is!", "score": 1, "replies": []}, {"body": "Bro have you been to the Midwest??? Tons of asian immigrants all over and not like the one offs here and there. Large migrant communities in MSP, OKC, Texas, etc.", "score": 0, "replies": []}]}, {"body": "Where did the \\~2-6+ number come from? Just interested in the source.", "score": 1, "replies": [{"body": "Its an estimate really because the numbers are so fabricated in some places or just down right not reporting(florida)... so what we do know is a best guess, but from various reports and such this is what I gather. Some give an r0 of say 4 some 6 some say it could be even higher, we just don't know.. here's a couple sources, but there are a bunch more.\n\nhttps://sph.umich.edu/pursuit/2020posts/how-scientists-quantify-outbreaks.html\n\nhttps://www.youtube.com/channel/UCF9IOB2TExg3QIBupFtBDxg\n\nby mid march we will have a more realistic idea of what to expect based on SK and Italy but right now it's growing exponentially with super spreaders infecting 50+ like the lady from the SK cult church.", "score": 1, "replies": []}]}, {"body": "Once it is everywhere, quarantine is pointless, right??", "score": 1, "replies": [{"body": "i mean, i'm not trying to go out and get it.. i'll be staying home as much as absolutely possible.. You have to take responsibility for yourself, no one is going to tell you to do something, and if they do it's probably to late.\n\ni don't have to leave home to work though so its pretty easy :shrug:", "score": 1, "replies": []}]}]}, {"body": "I work in healthcare I've seen some of these boomers with like 15 medical conditons", "score": 2, "replies": []}]}]}, {"body": "It still gives them enough strength to log into their broker's website and hit the sell button.\n\nWhat I'm suggesting is more... INSTANT.", "score": 3, "replies": []}, {"body": "Shit . That's darker than bat soup", "score": 1, "replies": []}, {"body": "This is the way.  😂", "score": 0, "replies": []}]}, {"body": "Careful. You don't want the SEC to come after you for market manipulation.", "score": 1, "replies": []}, {"body": "You could , but then who would get your sippy cup?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 38, "replies": [{"body": "it's like you've never met boomers", "score": 88, "replies": []}, {"body": "Alright, who want to tell him...", "score": 9, "replies": []}, {"body": "You mean the same geniuses from back in '07 that thought they where going to sell their houses for millions of dollars to fund their retirement because house prices only go up? Or the ones the government has to keep making special exceptions for in the 401k rules because they aren't saving enough?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 37, "replies": [{"body": "One last, fuck you I got mine before they die to the vaccines will be to crash the stock market.", "score": 16, "replies": []}, {"body": "Boomer mentality perfectly summed up", "score": 15, "replies": []}]}, {"body": "It’s the only way left to fuck the millennials before they die.", "score": 10, "replies": []}, {"body": "I'm no boomer but I just switched 75% of my 401k into bonds from stocks. I'll set it back when SPY is 250", "score": 17, "replies": [{"body": "I went 100% to bonds on Monday from 100% equity.", "score": 1, "replies": []}]}, {"body": "Then they all stay in the workforce, so you have 80 year old Karen the supervisor ordering your 30 year old ass around all goddam day.", "score": 6, "replies": []}, {"body": "Come to papa, I'm all cash.", "score": 5, "replies": []}, {"body": "A recession happens when there is a contraction on economic growth over an extended amount of time. A large outflow of money out of the stock market will not impact the economy except for companies with large assets in stocks. Market can go up during a recession and it can go the other way around. Just look at today's environment. The US economy is growing, but at a very slow pace compared to the stock market.", "score": 9, "replies": [{"body": "Over priced companies, a correction", "score": 8, "replies": [{"body": "Besides for a handful of companies, many are overpriced. They're just riding along with the giant tech that are actually making money. Problem with indexing..", "score": 3, "replies": []}]}, {"body": "Yes but the stock market is suffering due to the concerns ON the economy which Coronavirus threatens. \n\nChina is the worlds largest exporter with ~16% of word exports. The fact that they have to lockdown one of their transport hubs, as well as 50,000 Chinese citizens having the virus AND western companies forced to close their factories for quarantine is a huge concern for world economic growth. \n\nIf the same thing occurs in other LEDC/MEDC countries which the west exploits for cheap costs we are not looking good.", "score": 1, "replies": []}]}, {"body": "They should already be 60/40 or thereabouts by the time they reach retirement age.", "score": 1, "replies": []}, {"body": "So puts on the boomer favorite oil/gas? Got it", "score": 1, "replies": []}, {"body": "Buy puts!!!!", "score": 0, "replies": []}, {"body": "Selling stocks don't cause a recession", "score": 0, "replies": []}, {"body": "Boomers are mostly in bonds, moron.", "score": 0, "replies": []}]}, {"body": "I've been calling this event the coming mass exodus.", "score": 5, "replies": []}, {"body": "I’m really liquid, let me know when we hit the bottom so I can get in!", "score": 3, "replies": [{"body": "I'm really liquid too but that's probably from the hot sauce I put on my tacos yesterday.", "score": 1, "replies": []}]}, {"body": "Buy them from your parents at a discount in exchange for cash now.", "score": 1, "replies": []}, {"body": "As you get older you are supposed to shift more and more of your retirement funds toward safer low interest low risk investments. If this advice is being followed than most boomers should already be mostly out of the stock market.", "score": 1, "replies": []}]}, {"body": "NeGatIvE iNtErEsT RaTeS", "score": 46, "replies": [{"body": "Sounds like free money to me, I’m in.", "score": 14, "replies": [{"body": "Ready to take loans for YOLOs", "score": 8, "replies": [{"body": "Now is the best time to double down, even get some margin.\n\n\n\nStonks go up, going down is room to go even more up.", "score": 4, "replies": []}, {"body": "I hope you're a major bank then. Free money for me not for thee.", "score": 3, "replies": []}]}]}, {"body": "👏👏👏", "score": 3, "replies": []}, {"body": "Pay me to Yolo", "score": 1, "replies": []}, {"body": "Honesty they should’ve done this instead of QE lol, at least for everyday consumers.", "score": 1, "replies": []}]}, {"body": "The thing is, you can't fight this by lowering interest rates or printing more money. It makes no difference if more money is flowing into peoples pockets if there is nothing to buy because the global supply network is so fucked up.", "score": 46, "replies": [{"body": "Software-heavy tech companies. Gun companies. Gold.", "score": 12, "replies": [{"body": "I like to cut out the middle man I put my money into ar15's and gold", "score": 15, "replies": [{"body": "The only metals I invest in are brass and lead", "score": 9, "replies": []}]}]}, {"body": "Which means, time to make calls against companies that are doing work to automate supply chains and logistics chains.\n\nI don't know how many people realize this yet, but Corona virus basically is the BIGGEST COCK FACE SLAP in world history against putting all your manufacturing in a single country and then tying that export capacity to human labor, which is the weakest link in the event of an epidemic evolving into a pandemic.\n\nLike no joke. Any new leader coming into office who champions labor for the people will look good to the voters, but to large business owners will go \"oh fuck, god dammit.\"\n\nCOVID-19 is what will force the world to go all in on automation. Especially, if it triggers a global recession.", "score": 32, "replies": [{"body": "Automating trans-ocean flights, large cargo vessels, and fleets of long haul trucks is so fucking far away dude. I also really don't get how automating all that is going to somehow prevent the devastation of the virus. People would still be involved in that chain of exporting/transporting goods.", "score": 1, "replies": [{"body": "Yes, but nowhere near as much as current. The reason why COVID-19 got out of hand is because:\n\n1. China is the manufacturing capital of pretty much the planet for a variety of things that play into development *and* production of *other* products and technologies.\n\n\n2. Chinese labor is cheap, compared to other nations.\n\n\n3. Chinese factories are practically small cities into themselves.\n\n\n4. Chinese labor laws are garbage. This means that people work insane hours, in very large groups, and as a consequence their body health is bad. This makes it easier for the virus to infect and propagate.\n\n\n5. By being small cities, with people crammed together both with in-house and out of factory housing, the probability of virus jumping from beyond factory scope is very high.\n\n\n6. China is an authoritarian state.\n\n\n7. To make matters *insanely worse,* Chinese culture has a *huge* notion of 'face'. It's similar in concept to tribal honor we see in middle eastern areas and other parts of the world where you have similar doctrines. As such, anything that leads to a loss of face is stamped out quickly rather than the problem be addressed. The doctor who first reported it and ultimately died by it, got cracked down hard and suppressed for trying to bring to attention that COVID-19 was **SERIOUS AS FUCK.**\n\n\n8. As a result, quarantine did not go into effect fast enough, and 5 million people left Wuhan before the Chinese military came in and locked down the city.\n\n\n9. One after the other, the dominoes fell, and now half of China is basically in lockdown.\n\n\n10. China on top of that continues to misrepresent the number of infected and dead.\n\n\n11. Anyone who dissents and tries to bring the truth out disappears.\n\n\n12. Western corporate entities have as a result of majority of factors above, tooled their entire supply chains in China. It's the perfect state to have cheap labor, and where the state will basically disappear anyone that complains or tries to expose the dirty truth of how completely fucked up the value of human life is there.\n\n\n13. And now like a Rube Goldberg machine, the rest of the world is starting to see more and more and more cases of the virus.\n\n\n14. The CDC hasn't called it a pandemic yet, but the situation is at Defcon 2 with that.\n\n\n15. It's a literal people problem from top to bottom.\n\n\n16. Automation of the entire chain as much as possible removes majority of the people. Robots don't get sick. Yes, you need people to maintain those robots. But it's *easier* to quarantine a few ten thousand people and prevent them from infecting the entire planet vs a country of over a billion people.\n\n\n17. I could go on, but there's only so many ways to say that this is predominantly the fault of China and the planet putting all it's eggs into one basket and then shitting the bed out of horror as the basket falls and 90% of all the eggs smash and splatter. Automation cushions the basket significantly.", "score": 5, "replies": []}]}]}, {"body": "Which means, time to make calls against companies that are doing work to automate supply chains and logistics chains.\n\nI don't know how many people realize this yet, but Corona virus basically is the BIGGEST COCK FACE SLAP in world history against putting all your manufacturing in a single country and then tying that export capacity to human labor, which is the weakest link in the event of an epidemic evolving into a pandemic.\n\nLike no joke. Any new leader coming into office who champions labor for the people will look good to the voters, but to large business owners will go \"oh fuck, god dammit.\"\n\nCOVID-19 is what will force the world to go all in on automation. Especially, if it triggers a global recession.", "score": 3, "replies": []}]}, {"body": "So, did the inverted yield curves anticipate the corona virus?", "score": 68, "replies": [{"body": "No but my astrologist said sarcasms mean", "score": 41, "replies": []}, {"body": "It was priced in.", "score": 13, "replies": []}, {"body": "A virus can only be the starting pistol to the race to the bottom in the 21st century. There'll be a vaccine in less than a year, and economically productive people will be mostly unharmed.", "score": 6, "replies": [{"body": "Ah yes, the virus only hates those who do not pull themselves up by the bootstraps. Makes sense.", "score": 2, "replies": [{"body": "2019-novelBoomervirus", "score": 3, "replies": []}, {"body": "No, it's a virus that hates boomers", "score": 1, "replies": [{"body": "Woosh.", "score": 0, "replies": []}]}]}]}, {"body": "They combine synergistically.", "score": 2, "replies": []}]}, {"body": "But Trump said yesterday that stocks are looking great?!", "score": 158, "replies": [{"body": "\"to me\"\n\nTo me. \n\nHe's been buying puts all along.", "score": 26, "replies": []}, {"body": "We talking about the guy who cut the CDC and FEMA budgets?", "score": 90, "replies": []}, {"body": "[deleted]", "score": 117, "replies": [{"body": "Trump supporters pikachu face right now.", "score": 71, "replies": []}, {"body": "Are they lies if he's just spouting uninformed nonsense?", "score": 1, "replies": [{"body": "Little bit from column A little bit from column B, but mostly from column A.", "score": 2, "replies": []}]}, {"body": "Do not smear our god emperor like that. Trump will fix quick and keep 🌈🐻 at bay", "score": -41, "replies": [{"body": "[deleted]", "score": 71, "replies": [{"body": "Covfefe virus has been eliminated.", "score": 39, "replies": []}, {"body": "Nationalize the national guard and lock these bears away", "score": 1, "replies": []}, {"body": "🏅", "score": 2, "replies": []}]}, {"body": "Ha ha, good one!", "score": 1, "replies": []}]}]}, {"body": "Maybe what he meant to say is that stocks are *not* looking great.", "score": 3, "replies": []}, {"body": "Well I don't really know stocks well, hardly know them. I saw them that one time, and they looked great!", "score": 1, "replies": []}]}, {"body": "S&P, Dow down 3% a day...that is a crash to me.", "score": 121, "replies": [{"body": "10% is a correction, 20% is a crash, 30% and you’ll start seeing some real shit.", "score": 148, "replies": [{"body": "$ROPE", "score": 54, "replies": [{"body": "war", "score": 12, "replies": [{"body": "What is it good for?", "score": 8, "replies": [{"body": "Killing people the establishment blames for your life being shit apparently.", "score": 3, "replies": []}, {"body": "$LMT, $RTN, $BA", "score": 3, "replies": []}]}]}]}, {"body": "Bro this is just Day 2..", "score": 26, "replies": [{"body": "Day 4 of losses. Day 2 of major losses.", "score": 18, "replies": []}, {"body": "So 26 more days till we get really good?  \nI'm talkin' Danny Boyle not Sandra Bullock.", "score": 3, "replies": []}]}, {"body": "People jumping off of buildings in NYC?\n\nSign me up!", "score": 10, "replies": []}, {"body": "War at 30% doesn't matter with who.", "score": 1, "replies": []}, {"body": "Bring on the real shit", "score": 1, "replies": []}, {"body": "Listen kids, when the S&P drills down 30%, then we will find OIL there. Crank up the military-industrial complex boys. TIME TO LIBERATE SOME BLACK GOLD, PEOPLE!", "score": 1, "replies": []}, {"body": "buckle up.. we're going where we haven't gone since the great depression.. By mid march prepare.", "score": -4, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "i honestly don't give a shit what you believe lul..", "score": -9, "replies": []}]}, {"body": "I’m buying your fear lmao", "score": 4, "replies": []}, {"body": "You had me going until you put a timeline on it \n\n2 weeks? Really bro?", "score": 1, "replies": [{"body": "If we see the cases in the US jump anytime before then, it could happen.", "score": 0, "replies": []}]}]}]}, {"body": "Buckle up, buttercup", "score": 34, "replies": []}, {"body": "What's bad isn't just today, but the fact that it did it 2 days in a row and there was barely any correction. \n\nThere was like a 23% upward move in the S&P overnight before it sank like a stone again.", "score": 11, "replies": [{"body": "23% premarket? Iirc futures were at 3240ish overnight, probably the wrong Humber but I know it was not 23%. Did you mean 2-3%? I'm not sure it was even that much.\n\nI saw the 0.5% or so we opened up, sold all my SPY shares and opened some more bearish positions. +10% today", "score": 7, "replies": [{"body": "I should have been more clear. \n\nI meant the market only gave back about 23% of the initial drop from the previous high. \n\nNormally if there's a \"fake out\" drop, the market quickly regains at least 50% of the drop before crawling higher. This went up less than half that then collapsed.", "score": 12, "replies": []}]}]}, {"body": "Baby shit. A hiccup, burp, tripped on its own toe. It’s only been like 3 days", "score": 1, "replies": []}]}, {"body": "I’m not taking DD from someone who thinks adimately is a word.", "score": 67, "replies": [{"body": "I adimately oppose this comment", "score": 14, "replies": [{"body": "I adamantium support it.", "score": 7, "replies": [{"body": "Snikt", "score": 2, "replies": []}]}]}, {"body": "Adimately", "score": 19, "replies": []}]}, {"body": "I am so sad that quant financial innovation didn't cause this next recession.", "score": 17, "replies": []}, {"body": "I saw someone wearing a mask today at my college campus, and Im in delaware! I already have the nuclear bunker ordered for this “recession”", "score": 15, "replies": []}, {"body": "I think everyone knew the virus was a black swan just couldn’t figure when it would fully blossom", "score": 28, "replies": [{"body": "Efficient market thesis is dumb. Sometimes reaction can be very delayed.", "score": 31, "replies": [{"body": "Reaction is delayed when countries under report the issue (e.g. China).", "score": 14, "replies": [{"body": "China under reporting wasn’t the problem. Every other government should have buckled up and took precautions early.", "score": 11, "replies": []}, {"body": "I mean, they shut down the movement of like half a billion people", "score": 3, "replies": []}]}, {"body": "I bought FXI puts a month ago and got trashed...", "score": 6, "replies": []}, {"body": "I was literally like 2-3 weeks late on my SPY puts, had them for 2/14, I was dumb and should have gave myself some wiggle room. 2/28 or 3/15 would have been PRINTING", "score": 2, "replies": [{"body": "im holding 4/17 QQQ PUTS at 185 do you think i will print?\n\nup 250% so far", "score": 1, "replies": []}]}]}]}, {"body": "Omg bears all over the place", "score": 35, "replies": [{"body": "All the gay clubs are closed because of Coronavirus so they just roam the streets telling us to buy puts.", "score": 20, "replies": []}, {"body": "hello I bull", "score": 7, "replies": []}]}, {"body": "I lost brain cells", "score": 13, "replies": []}, {"body": "if the stock market collapses do i still get paid for my puts", "score": 6, "replies": [{"body": "Yes.", "score": 1, "replies": []}]}, {"body": "This also assumes public appetite favoring the fed buying up debt. I'd go full austerity for a few decades to right that balance ship and reduce the unwashed masses.", "score": 7, "replies": []}, {"body": "What is \"adimately\"?\n\nGay/10", "score": 17, "replies": []}, {"body": "[deleted]", "score": 21, "replies": [{"body": "and fake", "score": 7, "replies": [{"body": "and retarded", "score": 4, "replies": [{"body": "And yeah, what they said", "score": 0, "replies": []}]}]}]}, {"body": "At this point we need to accept reality, we've lost containment and there will be a global pandemic. Tens of millions will die.\n\nThe question is: \n\nDo we want to be little bitches, shut everything down for months, and cause the second Great Depression? \n\nOr do we accept that when it rains you're going to get wet and carry on with some dignity and a functioning economy?", "score": 29, "replies": [{"body": ">At this point we need to accept reality, we've lost containment and there will be a global pandemic. Tens of millions will die.\n\nNah I think you're overestimating the virus.", "score": 32, "replies": [{"body": "you must not be keeping up", "score": 14, "replies": []}, {"body": "its just on steriods 🤷‍♂️", "score": 3, "replies": [{"body": "Ebola is a disease on steroids. The infected hemorrhage blood and shed the virus from their skin and mucus. That has a mortality rate of ~90%. COVID-19 is transmitted the same way as any other mild to moderate flu virus and has a 1% mortality rate. Wash your hands, limit close contact and travel, and you'll be fine.", "score": 3, "replies": [{"body": "Guhhh\n\nThis is such a bad read on what makes an outbreak dangerous.\n\nSome have super high lethality rates. Thing is, their R0 is going to be lower. So yes, more lethality, but less instances of dice rolls. Some outbreaks have super high transmission rates and low mortality rates. Less lethality, way more dice rolls. The disease has an insanely long incubation period. There are probably outbreaks right now that will suddenly appear, and we'll have no idea where they came from. Yes, mortality is low, but it's significantly worse than the flu *at best* and at worst, it's going to be decimating (in the historical sense) retirement homes.\n\nJust because mortality rates are low doesn't mean it isn't a major issue.", "score": 3, "replies": []}, {"body": "The flu has a less than 0.1% mortality rate. The Spanish flu, considered one of the worst epidemics, had an estimated 2% mortality rate.  This is not ebola but definitely not some winter sniffles.", "score": 1, "replies": []}]}]}]}, {"body": "Tens of millions? This isn’t the T virus", "score": 4, "replies": [{"body": "Current stats:\n\nInfected: 80k\n\nDead: 2.7k\n\nAt best, that's a 3.3% mortality rate.\n\nIf we had contained it, that would be fine but we clearly failed.\n\nSo multiply that rate times the population of Europe and you get 25m. The US? 10m. India? 50m. Globally? 260m.\n\nIt's going to be wild but it doesn't have to be an economic catastrophy. We just have to convince people to stay calm and carry on.\n\nIf we start shutting everything down like China then it's GD 2.0....", "score": 12, "replies": [{"body": "You're assuming that literally every single person in the world will contract the virus.", "score": 24, "replies": [{"body": "Most of wsb is safe since we don't leave the house.", "score": 31, "replies": []}, {"body": "Exactly. They will", "score": 6, "replies": []}, {"body": "An epidemiologist estimated 40-70% will be infected worldwide.", "score": 1, "replies": []}]}, {"body": "But there is one bright spot, there are probably a lot more people who got infected and never screened because the illness wasn’t serious enough.", "score": 7, "replies": []}, {"body": "This isn’t plague inc. Not EVERYONE in the world gets infected.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "LOL this guy believes china", "score": 3, "replies": [{"body": "He should buy calls.  Literally can't go tits up right?  😂", "score": 1, "replies": []}, {"body": "It's amazing how many people are taking what the Chinese gov't says about a pandemic they attempted to cover up and was only exposed due to a whistleblower at face value.  You can probably multiply those numbers 4 or 5x to get an accurate count.", "score": 1, "replies": []}]}]}, {"body": "Did you know that 50% of people tested showed no symptoms, and 80% of people tested showed either no symptoms or mild symptoms. The people tested in these situations are people that were tested by association or after contact. If 80% of infected people have the virus in a manner that doesn't warrant a trip to the doctor's office, how many thousands must have the disease and simply beat it at home? I guarantee that the true number of infected is exponentially higher, and the actual kill rate though more deadly than influenza, is far less dangerous than the current estimate. I've had the flu more times than I can remember, not once have I ever gone to the hospital about it, the vast majority of people just stay home.", "score": 1, "replies": []}, {"body": "this virus doesnt do well in hot weather, and spring is around the corner. Also Europe and USA are so different than china. Also hot shower, Whiskey+Honey+blackpepper combo kills it (at least 300ml whiskey and 300g honey), some MJ and go ti bed. It fucks you up, but kills the virus. If you are not well by morning - repeat. Panic is way overblown.", "score": -2, "replies": [{"body": "Omg... did you just come up with the cure?", "score": 11, "replies": [{"body": "I didnt, your body has it, you just gotta pump its temperature up like its spce, give it time to fight off this virus and keep it at bay until it builds up enough immunity. Also shitloads of liquids, pee and poo. Warm yourself up and try to enjoy your body almost killing itself to fuck up that nasty virus. Some will obviously die.", "score": -1, "replies": []}]}, {"body": "Looks like we got a PhD in Immunology over here!", "score": 7, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Why would it not work?", "score": 1, "replies": []}]}, {"body": "Jagermeister > whiskey", "score": 1, "replies": []}]}]}]}]}, {"body": "i bet powell cuts a quarter point for appearances sake and beer virus settles down in late march and all the money comes out from hiding in treasuries and stays to buy the dip", "score": 2, "replies": []}, {"body": "This will be Great Depression 2.0 if this virus doesn’t calm down.", "score": 12, "replies": [{"body": "[deleted]", "score": 8, "replies": []}, {"body": "Lol", "score": 1, "replies": []}]}, {"body": "Shut up nerd", "score": 19, "replies": [{"body": "This guy hates facts. Hahaha", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 27, "replies": [{"body": "Yo what? I've seen your other post your a Benedict Arnold what you say is void", "score": 9, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yo again what? Your saying that I said you don't line up with xyz because your not stating xyz? Because your motives are not xyz?\n\nIs that correct?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Whatttttttt???? I see I might have used the wrong phrase but your other posts suggest a motive to manipulate others into thinking one way that align with your xyz. Trust me I want to get to now i know my abcs to let's combines 🧠 and find a solution to profit", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": ", I wonder who is this other person on the other side, I assume your a intelligent being with insightful feedback again you say no Wuhan but just posted a chart of a alarming statistics, we should really understand how dangerous this Wuhan flu is", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yea if I turned my phone upside down. You can not say \"About\" to drop because\n 1 do you have the antidote in your ass?\nThis is very worrisome", "score": 2, "replies": []}]}]}]}, {"body": "\"Your attack on me proves that.\" Any arguement that states arguing against their stance is wrong is definetly *checks prompter* right! Carry on autists", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yes the fact that the virus is spreading in the middle east and Europe over the last days has nothing to do with this /s", "score": 20, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "There is a really easy way to tell what the market reaction is outside the US; look at the foreign markets.", "score": 3, "replies": []}, {"body": "Bruh Germans are shitting their pants running around with tinfoil hats. 90% mortality rate on their minds. Spanish flu extinction level event.\n\nIf S&P drops 3%, DAX drops at least 4% the following day. Germans are inherently 🌈🐻. Aryan is just a code word for autist.\n\nIt's fake German media in overdrive mode and all the gayness is now proudly on display.", "score": 3, "replies": []}]}]}, {"body": "Yeah it has very little to do with COVID19.\n\nI invested in volatility (HUV cuz I'm canadian) and I've been seeing killer gains. Because my analysis saw an anomaly in the market and that we were DUE for a spike in volatility.\n\nThis current market has next to nothing to do with Wuhan flu. We were due for a spike in volatility. The market doesn't make consistent gains every day for long.", "score": 13, "replies": [{"body": "Do you think the volatility spike will continue? At what point will you sell your long vol positiions?", "score": 6, "replies": [{"body": "My analysis makes me money by identifying the best entry points where a spike for volatility is due. At this point I'm past the entry point so it's not a buy position for me and I'm not someone who tries to predict day to day.\n\nIt could go up for another day or two, I'm not a psychic but based on what analysis I'm using, were inching closer and closer to the exit point. So I do not see volatility for much longer and I'm almost 100% sure it'll drop by the next week. Check in on the post and shame me if it's not correct.\n\nRegardless my method has been backtested 20 years and returned 4000% gains so I trust it to give me relatively good entry and exit points.\nShame that volatility ETFs only return like 1/3rd of the VIXs performance tho.\n\nAnyway, I agreed immensely with the poster I responded to and this is because I saw a spike in volatility being due. My analysis doesn't predict viruses. It predicts times of market volatility. Recession hype on this sub is way overblown and coronavirus effect is being overblown by news media. It's just a time of volatility right now. There doesn't need to be any explanation other than the market is correcting itself.", "score": 9, "replies": [{"body": "Honest question here:\n\nYour analysis doesn't predict viruses, it predicts volatility, but what if your analysis is correctly predicting a volatile moment of correction, which is timed(by random chance) perfectly with the dawn of a global pandemic?\n  \nThat wouldn't make your analysis invalid, quite the contrary. But it could (speculation) mean that both the amount and duration of volatility could be increased by the emergence of a global pandemic. Maybe by orders of magnitude.\n  \nA \"perfect storm\" scenario?\n  \nThoughts?", "score": 5, "replies": [{"body": "One of the things I once heard and always stick by is that markets are never moving due to one and only cause.\n\nSo yes. Coronavirus could be and most certainly is part of the market movement. But there are likely several other factors just as important if not more important such as volatility and other hidden underlying factors. Some of which none but the brightest of us could only explain.", "score": 1, "replies": [{"body": "Apologies for the late reply. I do agree with you that the reasons are manifold. I'm interested to see how this ultimately washes out.\n\nCheers!", "score": 2, "replies": []}]}]}, {"body": "So recession over next week confirmed? I'll cancel my buy order on $ROPE then.", "score": 2, "replies": []}, {"body": "UVXY puts next week?", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": ">Only Americans are childish enough to be manipulated into thinking Wuhan flu (which is literally almost over, cases have flatlined) was causing all this\n\nlol wat???\n\nwhat about the other markets that saw similar losses??? or was it only american traders in those countries that were manipulated and caused the local market to come down? were the native traders telling the american traders \"hey, why are you selling? stop being manipulated! you are tanking our market like your people did back home! go back to american and trade if you wanna be such a manipulated american! as you can see the virus is not affecting our economy at all!\"", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "that doesnt answer the question", "score": 1, "replies": []}]}]}, {"body": "Public perception is a real thing", "score": 1, "replies": []}]}]}]}, {"body": "🌈🐻", "score": 7, "replies": []}, {"body": "lol if this happens it's over for Trump daddy.", "score": 11, "replies": [{"body": "Daddy will be fine, just look at who he’s running against.", "score": 2, "replies": [{"body": "I’m not so sure. Trump is running on the economy, not economic collapse.", "score": 19, "replies": [{"body": "He'll be able to play it off as a black swan event. You don't look so bad when everyone is getting unexpectantly hosed.", "score": 6, "replies": [{"body": "He will just blame it on somebody else and his sack rider cult followers will lap it up. BUTTER EMAILS!", "score": 1, "replies": []}, {"body": "Exactly - it’s not like people are going to blame Trump for the coronavirus.", "score": 1, "replies": [{"body": "They are going to blame him for not doing anything about it.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "the economy and anti war is his thing .If it goes + people start dropping like flies...\\*skyfall-adele\\*", "score": 1, "replies": []}]}]}]}, {"body": "REVERSE BULL GANG", "score": 3, "replies": []}, {"body": "Fucking hell gay bear here and went into gold and got sodomized by an actual gay bear.", "score": 3, "replies": []}, {"body": "[Richard Clarida said the economy is in a good place](https://www.bloomberg.com/markets/fixed-income), and in some interview a few days back, went out of his way to oppose the idea of rate cut any time soon. Maybe one in June, but that is contingent on data they get by that point. It hasn't been a full week of slide, give it time. Anyone claiming to know what is happening doesn't know what is happening. Too early to tell where the rest of the year will go.", "score": 3, "replies": []}, {"body": "I think Zika had more implication than corona virus in its effects, but people are looking at china and saying omg wtf. In about a year fears will die down and people wont care", "score": 8, "replies": [{"body": "i had zika, its nothing, chikunguya is 5x worse, and dengue is 10 times worse", "score": 6, "replies": [{"body": "I could go for some chikun kinda hungry", "score": 8, "replies": []}, {"body": "dude just get aids, ebola and this and you got disease bingo.", "score": 7, "replies": []}]}, {"body": "Are the symptoms similar?", "score": 1, "replies": [{"body": "Zika only effected pregnant women and was transmitted by mosquitos. The amount of fear on the economy was vaguely similar though", "score": 9, "replies": [{"body": "Not even remotely close.", "score": 5, "replies": []}, {"body": "Thanks for answering. \n\nAlso do you see my other comment because there is some manipulation going on with WSB and the comments.\n\nhttps://ibb.co/FgrhCPR\n\nDoes that show for you?\n\nIt appears WSB has an agenda and is hiding and keeping comments from being read on reddit which is the whole point of reddit so do you see this?\n\nhttps://ibb.co/FgrhCPR", "score": 3, "replies": []}]}]}]}, {"body": "So essentially it will go up? Got it", "score": 2, "replies": []}, {"body": "Markets are still up like 15% from a year ago or some shit.", "score": 2, "replies": [{"body": "Good luck trying to appeal to peoples logic and common sense.", "score": 1, "replies": []}]}, {"body": "Best shit I red on this situation that sums it all and it’s time to be a 🌈 🐻 no matter what", "score": 2, "replies": []}, {"body": "So if the boomers are taking all they're money out of stonks, where is it going?", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "What came first? The recession or the interest rate drop", "score": 1, "replies": []}, {"body": "NNT puts are about to save my entire portfolio", "score": 1, "replies": []}, {"body": "Full on gay bear", "score": 1, "replies": []}, {"body": "Puts all the way to the bottom if that happens!", "score": 1, "replies": []}, {"body": "day trade poots", "score": 1, "replies": []}, {"body": "Fuckin Fed better cut these god damn rates", "score": 1, "replies": []}, {"body": "It can't be a black swan if you know what it is.", "score": 1, "replies": []}, {"body": "This one's going to be BAD", "score": 1, "replies": []}, {"body": "Geezus you all are a bunch of pansies. 7% decline and everyone freaks out. I'm down 7k this week but idgaf cuz I'm all cash gang bruh.\n\nFor real tho 7% is nothing to worry about", "score": 1, "replies": []}, {"body": "I'm curious why the FED had so much money to spend in the 1980's compared to now? Wouldn't it stand to reason that this chart should be constantly upward with eventually-correcting dips marking the recessions?", "score": 1, "replies": []}]}
