{"title": "WhAt’S hApPeNiNg???", "selftext": "I see Nvidia shares dipped $5. Is this the end of Nvidia???\n\nif this is you, please stop. We see something like this everyday now. Company is fine", "id": "1b6w4yn", "created_utc": 1709612097.0, "score": 6, "upvote_ratio": 0.56, "num_comments": 20, "comments": [{"body": "This is the post lmfaoooo seeing the same thing everyday ensures me that there are ppl willing to lose money while I’m gaining.", "score": 7, "replies": []}, {"body": "If NVDA drops more than 40 cents, that’s a strong sell sign. If it goes up 30 dollars in one day, that is also a strong sell sign. If it remains flat, oh baby, that’s a strong sell sign.", "score": 6, "replies": []}, {"body": "Go to the SMCI sub for even more laughs. “iTz OnLeE a MaTtUr oF tYmE b4 wE cAtCh NVDA!!!”", "score": 3, "replies": []}, {"body": "down 8 bucks now.  gotta be the end.  time to sell everything.  run for the hills, and start stocking up on canned goods.", "score": 2, "replies": []}, {"body": "Haha my calls expire on Friday and I’m down 1100 but holly hell the degenerate gambler in me is loving it", "score": 2, "replies": []}, {"body": "If you don’t understand a stock, why do you invest in it?  Create a gain vs volatility point plot of top tech stocks and a few funds.  Nvidia you will see is uniquely very high gain and very high volatility whereas most others are lower in each.  That said, if you buy nvidia you must understand what you are going to live with.  There’s no free lunch.  You get volatility.  The declines are a very good thing as well as they establish and test floors which provide confidence for further gains.  If you get frazzled and worried by a little dip, you need to invest in something else.", "score": 2, "replies": []}, {"body": "Before earnings it dropped 10% and people were panicking when it dropped from $742 to around $667.  People need to stomach the volatility and hold.  It’s not like they are going to all of a sudden have a bad quarter where the company is exposed as having cracks.  They can’t supply chips fast enough and are making so much money.  I figure in mid 2025 we may see a slight slowdown or surplus of chips (semiconductor industry is cyclical).  However, NVIDIA is going to be a juggernaut over the next decade.  This company is a monopoly and will change the world.", "score": 1, "replies": []}, {"body": "Winter is coming", "score": 1, "replies": [{"body": "dark winter", "score": 1, "replies": []}]}, {"body": "I remember when this sub had less than 5k members and then the recent run happened and we get those annoying posts daily.\n\nI hope we have better modding going forward", "score": 1, "replies": [{"body": "It's a bunch of kids that have no idea what they are doing. These can't be grown people.", "score": 1, "replies": []}]}, {"body": "lol u worried about 5 its more like 20 get out if u scared im loving the ride", "score": -3, "replies": [{"body": "If it cuts it’s value in half I’d still be in Nvidia. If people get worried about a 5 or 20 dollar dip they shouldn’t be in stocks. It’s a marathon for the longs", "score": 4, "replies": [{"body": "nvdiia is good for 6 months at least  im in at 20 gonna sell some at 1100 do what u think is best", "score": 2, "replies": [{"body": "hoping they call call for a  split then it changes for me", "score": 2, "replies": [{"body": "But a split will bring way way way more volatility. 🙊", "score": 3, "replies": []}, {"body": "A split would be a bad thing now.   Need to cool down irrational expectations and weed out poor quality investors not stimulate them.  Actually a pullback or plateauing for awhile would be a good thing.", "score": 2, "replies": [{"body": "I’d love a stock split, but yea I think it needs to stabilize first", "score": 1, "replies": []}]}]}]}]}]}, {"body": "These kinds of posts are a waste. Go to bed, asshole.", "score": -1, "replies": []}]}
{"title": "Anyone will go to NVDA GTC?", "selftext": "I have had NVDA stocks  for 10 years.  As I am an Engineer, the GTC will be a heaven on the ground for me.  Unfortuntely, I live in the East Coast. We always say to see is to believe.  I am struggling if I should just bite the bullet and fly over there to experience the NVDA technology leading the  Industrial Revolution and see the black jacket man in person. \n", "id": "1b7abua", "created_utc": 1709658102.0, "score": 19, "upvote_ratio": 0.86, "num_comments": 20, "comments": [{"body": "Never go full regard.  \n\nYou can see the entire GTC online from the comfort of your home. I've been attending every single one this way for the past 4 years.  \n\nThe ones attending GTC in person are there for networking and work opportunities.  \n\nThis isn't a Taylor Swift concert and you aren't a groupie.", "score": 30, "replies": [{"body": "A bit more colorful than I would've put it but my sentiment exactly.", "score": 14, "replies": []}, {"body": "It’s a Jensen Swift concert!", "score": 6, "replies": [{"body": "Always good to see another Jensonite!", "score": 1, "replies": []}]}, {"body": "How do you see it online?", "score": 1, "replies": [{"body": "Go to nvidia.com", "score": 2, "replies": []}]}]}, {"body": "What are you going to see there that you can't see online at home? Jensen isn't gonna give you a tour of their lab. Save your money and buy more shares.", "score": 5, "replies": []}, {"body": "Conferences like this are for networking. Whenever I go I don't make any of the sessions and focus on meeting new people.\n\nThis year I got booth duty though :')", "score": 3, "replies": [{"body": "Awesome what booth?  Exhibitor access rules just a badge is enough to talk shop directly. You’ll meet so many that just come to you. Damn good work player.", "score": 1, "replies": [{"body": "Google cloud!", "score": 2, "replies": [{"body": "Ok I’m super jelly.  Let me know if you’d be willing to grab swag I’ll pay or barter whatever. Omg back stage access. You should blog on here I’d follow", "score": 1, "replies": []}]}]}]}, {"body": "Hear you on the in person thing.   Even though I live 30 min from Santa Clara, I've registered for virtual event, that's how they did it over covid and it's fine.  As in sporting events, the small screen (youtube) will give you better coverage.  There will certainly be buzz and excitement only experienced with attendance, for sure.", "score": 1, "replies": []}, {"body": "It's $2495 just to get in, never mind travel, room and board.", "score": 1, "replies": [{"body": "The access is priceless. Best AI conference on the edge of a revolution?  It’s legendary whatever happens there.", "score": 2, "replies": []}, {"body": "So less than 3 shares to get in?  Sign me up!", "score": 1, "replies": [{"body": "Cost you 24k by selling", "score": 2, "replies": []}]}]}, {"body": "It’s streamed. You can attend free. See everything and even network directly with industry. I’m getting good food like a convention and doing all my research on who is presenting. HMU if you want to divide and conquer or chat hang.", "score": 1, "replies": []}, {"body": "You have to take a photo with Jenson and post here", "score": 1, "replies": []}, {"body": "Yeah I’m going in person! Don’t own any shares 😝", "score": 1, "replies": []}]}
{"title": "Subscription option scanner that tells you which option chain is experiencing surge in in/out flows?", "selftext": "Anything you folks recommend?\n\nLike \" Hey AMD $200 Calls for APril 19th are experiencing surge...\" something like that?", "id": "1b6u5z2", "created_utc": 1709606507.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 17, "comments": [{"body": "For 60$ a month I will email you a couple of picks per week", "score": 11, "replies": [{"body": "I'll do it for $50.", "score": 2, "replies": [{"body": "35 each and you get double the picks!", "score": 2, "replies": [{"body": "Deal.", "score": 2, "replies": [{"body": "Send cash to cashapp $Notascammerbro", "score": 3, "replies": []}]}]}]}]}, {"body": "I use OptionStrat, easy to use and simple", "score": 5, "replies": []}, {"body": "scams\n\navoid", "score": 3, "replies": []}, {"body": "What is a surge?", "score": 2, "replies": []}, {"body": "Gives me an idea, i can make something like this in excel, the only flaw is that it'll show the surges at the end of day instead of live, extremely doable and fun project.", "score": 1, "replies": []}, {"body": "Blackboxstocks", "score": 1, "replies": []}, {"body": "Isn't this what Unusual Whales and/or bullflow(.)io do? There must be many. I used Barchart for a year but never really got into the details of the reporting. Also you can't really use their option scanner when the market is closed. I'm looking for something similar.", "score": 1, "replies": []}, {"body": "Some lazy ass people.  When I say this, I mean no ill will against you but.......  I have no problem taking others people money.  There are no friends in this business and when a trader spends the time to find their edge they also realize that the people who want it easy have no value of money.  \n\nPlus I will add.  A \"surge\" doesn't suggest a thing.", "score": 1, "replies": []}, {"body": "I use Unsual Whales and one of my alerts hit last year on Walmart 5 minutes before the end of day on Call Volume, I got in the same call and it Paid for itself several times over.  It is just a tool and how you utilize it will determine its value to you.", "score": 1, "replies": []}, {"body": "Option samari is one option (punn not intended)\n\nhttps://optionsamurai.com/", "score": 0, "replies": [{"body": "Ive not tried it as i didn't know how to use it.  There might he something on youtube", "score": 1, "replies": []}, {"body": "Cost?", "score": 1, "replies": [{"body": "Dude....seriously....do i jave to wipe your fucking ass as well???\n\nCan't you fucking look it up yourself?", "score": 1, "replies": []}]}]}]}
{"title": "These are the stocks on my watchlist (3/5)", "selftext": "No positions in any stocks long-term but Amazon/Mag7/general broad market indices. (unless otherwise noted in these tickers)\n\nTo clarify since I've been asked: I usually make these watchlists premarket, (or from 6:30 to 7 as time permits), but can be delayed if I'm trading the open. These aren't mean to be taken as gospel: they're just my perspective of where a stock could potentially go. Percentages signify what the stock is trading at when I write up the report and are NOT predictions of stock price EOD. Some of the stocks I post are <$500M market cap and are NOT good long-term investments, but are good candidates to day trade.\n\nNews: [NYCB Ballooned Despite Real Estate Warnings in Years Before Fall](https://www.bloomberg.com/news/articles/2024-03-05/nycb-stock-dive-bank-ballooned-despite-real-estate-market-warnings)\n\n**APGE-** Worth watching today. Reported phase 1 data for treatment of Lymphoma, was positive. Up 50% at the open.\n\nhttps://preview.redd.it/4fnw054j3jmc1.png?width=975&format=png&auto=webp&s=3304549c70019458772c9d9ac72718a77d71eae6\n\n**NYCB**\\- Reported “material weaknesses” in how it tracks loan risks, on 2/28. No new news, but still keeping this on my radar.\n\nhttps://preview.redd.it/10o6pe3l3jmc1.png?width=742&format=png&auto=webp&s=bc65c634752aacde193e9ff447eda71cd934223a\n\n**SMCI-** Making another move higher from being included in the SP500- at this point I’m handsoff unless we make another equivalent massive move to the upsdie. Watching $1000 level, if we go below it might be interested in a short.\n\nhttps://preview.redd.it/ewykjuum3jmc1.png?width=975&format=png&auto=webp&s=6e8cbf0475be9b96dbe9561038f18f53a2b78b36\n\n**TSLA**\\- TSLA Gigafactory in Berlin has no power due to being set on fire by German eco-activists.\n\nhttps://preview.redd.it/slho2ywo3jmc1.png?width=975&format=png&auto=webp&s=bcc8bf74aa0527812d74d9df35be403da6a1d711\n\n**SNOW-** Just reached new lows on the 3 month chartafter their earnings with negative guidance and CEO departure. Still watching this for a potential swing trade to the upside.\n\nhttps://preview.redd.it/8lsrvwqq3jmc1.png?width=742&format=png&auto=webp&s=7e7b3d6bfc3a49572787b46c6b092fd5b2172a93\n\n**AAPL-** Recent Bloomberg article released with 24% sales plunge in iPhone sales, stock down 2.5%.\n\nhttps://preview.redd.it/k5duxmis3jmc1.png?width=738&format=png&auto=webp&s=ca343b21736147d32010b37c1b17f536c8e6f96a", "id": "1b7702t", "created_utc": 1709650229.0, "score": 24, "upvote_ratio": 0.79, "num_comments": 17, "comments": [{"body": "What about COST? Its earnings are due in two days. AAPL does seem like a solid buy at these prices, can be a good trade coming the WWDC.", "score": 7, "replies": [{"body": "       🕯️\n  🕯️            🕯️\n\n🕯️                          🕯️\n\n🕯️    💰COSTCO💰     🕯️\n\n🕯️                          🕯️\n\n  🕯️             🕯️\n           🕯️\n\n\nCOSTCO BAG HOLDERS. Join me in the witchcraft prosper circle. Please grab those around you, kids, dogs, wife’s boyfriends whoever and hold hands.", "score": 4, "replies": []}, {"body": "I'll probably post COST day of earnings. This is a daily watchlist so it wouldn't cover COST two days into the future.", "score": 1, "replies": [{"body": "Makes sense. I already bought my CFDs for it tho. What are your expectations?", "score": 0, "replies": [{"body": "No idea, I'm more of a day trader and trade it as it is rather than take a position pre-announcement.", "score": 2, "replies": [{"body": "Do you think NYCB has some upside here? Seems to been a good recovery today?", "score": 1, "replies": [{"body": "Not sure- to me it's a boom or bust scenario (the bank doesn't shut down and goes 200% or it goes to 0), IMO EV in trading this is negative unless we get a crazy catalyst.", "score": 1, "replies": []}, {"body": "Looks like it might be going bust lol", "score": 1, "replies": [{"body": "Yeah, that's because I bought it. LOL Hopefully if they do an equity sale the new owners will bring it back to life.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Do you feel that Apple is going to make a comeback after such losses ? If yes where do you think it will be making its profits in the company?", "score": 1, "replies": [{"body": "Any company that has over $200 billion dollars in savings (not investments) we'll make a comeback.", "score": 3, "replies": []}, {"body": "I would argue yes- they've under-utilized Gen AI compared to the rest of the big tech companies, the way AAPL uses it is a lot more subtle. Most of it is used for image editing/Siri, and there are a ton of possibilities for them.", "score": 1, "replies": []}]}, {"body": "Any thoughts on GFS? Biden admin is going to award them $1.5 billion from the CHIPS act", "score": 1, "replies": [{"body": "I think that the news of the CHIPS act is pretty old by now, so I wouldn't make any investments based on it. (I think it's 2 weeks old by now)", "score": 1, "replies": [{"body": "It is. Just surprised GFS didn’t really do anything in response to the news. It did say it was planned, not done.", "score": 2, "replies": []}]}]}, {"body": "What do you guys think of Amkor (AMKR)?", "score": 1, "replies": []}]}
{"title": "Streaming Services a BUY right now? (WBD & DIS)", "selftext": "Disney+/Hulu, and now HBO(owned by Warner Bros Discovery) have all announced they’re going to be following the same strategy  of cracking down on password sharing to increase subscriber revenue. After Netflix fully implemented their changes in Q4 of 2023 they had a record number of new subscribers  (around 13 million +). NFLX YTD has risen 28% since their Q4 earnings report.HBO and Disney+/HULU plan on fully implementing the same strategy in 2025. \n\nIm not an experienced investor by any means but this makes me think that streaming services may be a smart buy now before they follow suite with Netflix on their subscriber crack down (obviously as long as subscribers don’t revolt and just cancel their service). I’m also aware that just because it worked for NFLX doesn’t mean it will work for WBD or DIS, but the concept worked once, it could work again. \n\nJust curious to hear other people’s opinions on this! Thanks! ", "id": "1b7ivh8", "created_utc": 1709678142.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 16, "comments": [{"body": "I like both WBD and DIS but they’re going through massive upheaval. WBD is looking like a distressed asset at this point but no risk, no return!", "score": 3, "replies": [{"body": "Totally agree about WBD but they’re actively trying to make jumps in revenue as we can see by their move toward removing password sharing. If they can get a large enough spike in capital, they may be able to make some big changes. Disney is, imo, in a good spot all around. They may have had a YoY revenue loss but they had a great year in 2022 which more than made up for 2023 losses. If they can mimic Netflix’s strategy they may have similar growth. I think it would be more likely that Disney has similar results than WBD based on the amount of users DIS and Netflix have compared to WBD.", "score": 1, "replies": []}]}, {"body": "I would avoid buying legacy media. They are getting absolutely destroyed by NETFLIX and Amazon Prime. And by destroyed I meant their ad business.", "score": 3, "replies": [{"body": "Can you explain this further?", "score": 1, "replies": [{"body": "Basically, there will continue to be a shift from cable to streaming. So, legacy media will continue to lose ad revenue/Sport deals to the likes of NETFLIX, Amazon Prime, and Apple TV. They are trying to break into streaming but it's very difficult as the subscriber count doesn't even break even to their cost. Even Disney makes most of their profit from Parks.", "score": 2, "replies": [{"body": "DIS owns much of Sports streaming through ESPN.  \nDIS has a good ad revenue model through Hulu, which would be scaling to larger audience (whole world) on Disney+ service.\n\nI wouldnt even say that DIS is a legacy media. Sure they own large portion in legacy media. The parks is where the money is at while the streaming service is trying to hold its own leg, thus achieving the whole asset of media entertainment industry.", "score": 3, "replies": []}, {"body": "If this strategy (the same strategy that Netflix used with their subscribers) works for the legacy media companies they may have enough capital to make that shift and focus their resources on becoming primarily a streaming platform and transition away from their cable reliant revenue sources, no? And Disney’s largest revenue source is its cable and media platforms, together they make up 43% of the companies total revenue. Not the parks lol", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Can you explain this further?", "score": 1, "replies": [{"body": "HIdden bullish divergences. Triple bottom and rsi increasing while price decreasing.  Descending wedge.  Buy the bottom sell the top. And nothing fancy going on with the actual company.  Nothing goes up forever and vise versa. Just a few of the basic things I look at", "score": 2, "replies": []}]}]}, {"body": "WBD is nice and cheap right now so I’ve bought a bit as well as a few calls for June (after their earnings in may). Fingers crossed.", "score": 2, "replies": [{"body": "Yeah I got some shares as well, didn’t even think about grabbing some calls. Might be a good play, just don’t know when they’re actually going to fully implement the changes. They could always push it back.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -3, "replies": [{"body": "24% up YTD. Terrible advice", "score": 3, "replies": []}, {"body": "YoY Q4 from 2022 - 2023 EITBA for DIS was up by $1b, so they’re not NOT making money. Not sure why you think they should be shorted?", "score": 2, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b7e4wy", "created_utc": 1709667021.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 17, "comments": [{"body": "Lotto tickets.\n\nLow cost = 1USD\n\nhigh risk = 0.00000000000000000000000000000000001% chance of winning\n\nHigh gain = \\~400M after taxes for a 1B jackpot\n\nJust buy 10k of lotto tickets.", "score": 35, "replies": [{"body": "Give me 1 billion and I would pay 600M in taxes gladly...", "score": 3, "replies": []}, {"body": "+1 this is in fact the highest risk/reward ratio one can find", "score": 2, "replies": []}]}, {"body": "If you could predict the price of oil you wouldn’t be on reddit asking for help you’d be on a private island in the Caribbean doing coke off titties.", "score": 9, "replies": [{"body": "lmao “predict the price of oil”. That 100% translates to “I have absolutely no clue what the fuck I am doing”", "score": 2, "replies": []}]}, {"body": "Based on what you've said so far, I'd refer you to that scene in Family Guy where Peter goes to a sports betting outlet and when asked \"did you want to bet on a team?\", he replies \"Nah, just keep it\".\n\nI'd recommend you spend that money on something fun and memorable because I give it a 99.76% chance of disappearing on the market with your level of knowledge and YOLOism.", "score": 4, "replies": []}, {"body": "Options trading and leveraged ETFs.", "score": 3, "replies": []}, {"body": "Roulette.", "score": 2, "replies": []}, {"body": "NVAX", "score": 1, "replies": []}, {"body": "Tqqq", "score": 1, "replies": [{"body": "Or option trade TSM", "score": 1, "replies": []}]}, {"body": "Start investing consistently, it does not matter whether you invest 500 or 500.000 a year. Just get started. \n\nIf you can go for 15% or gross income invested - you earn more you invest more (amount wise).\n\nGo buy yourself a copy of I will teach you to be rich - and get started", "score": 1, "replies": []}, {"body": "Otm 0dte spx options. Buy them at like $30 each if they go in the money its a 10x minimum", "score": 1, "replies": []}, {"body": "Don’t do it to yourself", "score": 1, "replies": []}, {"body": "Know labs. Ticker Knw. \n\nNon invasive continuous blood glucose device and potential blood diagnostic tool. This stock once it gets fda approval will go from its current 50 mm valuation to be. A competitor with dexcom (47bn). \n\nHigh risk. High reward. Under a dollar a share. \n\nCould blow up in my face or be the story I tell my grandkids. Have tens of thousands of shares with a 24 cent entry point.", "score": 1, "replies": []}, {"body": "Sorry -- we removed your message on /r/stocks because you are asking for the type of information we try to address in our wiki: https://www.reddit.com/r/stocks/wiki/index\n\nGeneric posts like \"how do I get started with stocks,\" \"how do I find a broker,\" \"where can I learn more about investing,\" \"I have $XXX to invest, what should I do,\" etc. are removed because they are low-effort and asked on a daily basis in /r/stocks.\n\nThings you can do:\n\n1. Read the wiki which has tons of information, including reputable learning resources, broker information, and links to useful reddit posts (including old posts similar to yours)\n\n2. Search the subreddit history for similar information", "score": 1, "replies": []}]}
{"title": "Disney \"Vote-buying\" in the proxy fight (From Matt Levine's Bloomberg newsletter)", "selftext": "March 5, 2024 \n\nMoney Stuff: Twitter’s Executives Want Their Money\n\n  \nVote-buying  \nThere is a three-way proxy fight going on at Walt Disney Co. Nelson Peltz’s Trian Fund Management LP has nominated two candidates for Disney’s board of directors, Blackwells Capital LLC has nominated three other candidates and Disney opposes all of them. There are competing websites. Blackwells owns about 157,000 shares of Disney stock (about $17.9 million worth), or about 0.0086% of the 1.8 billion shares outstanding. Trian’s group owns about 32.3 million shares ($3.7 billion), or about 1.76% of the stock.\\[4\\]  Disney Chief Executive Officer Robert Iger owns about 205,000 shares ($23 million, 0.011%), plus another 2.2 million shares’ worth of options. The biggest shareholders are the usual “Big Three” index fund firms (Vanguard, BlackRock, State Street).  \nSo lot of votes are up for grabs: This is not a proxy fight between an activist with a big stake and a CEO with a big stake, where each side already owns a lot of shares, but a battle of persuasion where three smallish shareholders will try to get the rest of the shareholders to vote for their platforms.  \nAnd then there’s this:  \n**Mom-and-pop investors are also being courted for their votes on a new marketplace called Shareholder Vote \\[Exchange\\], which runs auctions for shareholders' proxy votes. Disney is unusual because individual investors own more than one-third of Disney's 1.8 billion shares, more than the typical company, per The Wall Street Journal.**  \n**A bidder on Shareholder Vote \\[Exchange\\] is offering as much as $100,000 for 500,000 proxy votes, or 20 cents per vote, the most the site has seen since its launch two years ago, said cofounder and COO Steven Xu.**  \n**Xu said Shareholder Vote \\[Exchange\\] doesn't reveal the names of the bidders but confirmed the bid is from a current shareholder. Trian and Blackwell didn't immediately respond to requests for comment from Business Insider about if they're the bidder in question.**  \n**Here’s the web page for the auction. As of today I see a bid of $100,000 for 500,000 votes, and 12,417 votes listed for sale. So the market is not particularly close to clearing. Also, if you bought 500,000 votes, that would get you 0.027% of the votes, which, I mean, maybe that will make the difference between getting your nominee elected and not?**  \n**Ehh. I don’t see it. We have talked about the Shareholder Vote Exchange a couple of times before. It’s fun! Why not. The idea of being able to sell shareholder votes is clearly icky to some people; I think it is, like, morally fine but mechanically and legally messy. I wrote:**  \n**Surely the real high-dollar case for buying shareholder votes is in contested proxy fights, where some activist investor has millions of dollars on the line and wants to get its own slate of directors elected. (Also in contested takeovers.) And there I just have trouble imagining big activist shareholders buying votes in proxy fights this way, in part because the disclosure and reputational issues seem like they’d be a mess. The distinguishing feature of proxy fights and hostile takeovers is that everyone sues everyone else about everything, and also “bedbugs” them to the US Securities and Exchange Commission, calling up the SEC to say “hey did you notice our opponents doing something illegal?” Can you imagine the hay that some corporate managers would make out of an evil activist hedge fund buying votes?**  \n**And, sure, if you buy 10% of the vote for 20 cents per share (the stock closed yesterday at $113.69), that’s going to go to court. If you bid 20 cents per share for 0.027% of the votes … I think no one will care? This is good publicity for Shareholder Vote Exchange, but I’m not sure it’s anything more than that.**\n\n\\--------------------\n\n&#x200B;\n\nHow the tables have turned. do the activists even have a chance? Their ownership is kind of pathetic. 0.0086% for Blackweels and 1.7% for Trian. Are the activists that desperate? ", "id": "1b7ev22", "created_utc": 1709668733.0, "score": 19, "upvote_ratio": 0.72, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 23, "replies": [{"body": "I’d take Peltz over Iger, but that’s just me…", "score": 1, "replies": [{"body": "Peltz will do to Disney what lampret did to sears .", "score": 2, "replies": [{"body": "Looks like Iger has already done most of the damage", "score": 2, "replies": [{"body": "For real. A few days ago I compared DIS and VOO's performance and it wasn't pretty. DIS under-performed VOO by 84 points over the last 5 years, which is impressively bad.", "score": 2, "replies": [{"body": "And when you factor in how they mismanaged the Indiana Jones and Star Wars franchises, that underperformance starts to look a lot worse…", "score": 1, "replies": []}]}]}]}]}, {"body": "Do you hold those shares with a broker or are you a registered shareholder with the company/transfer agent?", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I thought so, but wanted to make sure. \n\nYou're known as a beneficial owner vs a record holder. Record holders vote. Beneficial owners may vote, may think they vote, but nothing says their vote counts. While you went through some process and clicked some buttons (or even snail mailed it), nothing at the end of the day actually guarantees your vote is counted in any way.\n\nI advocate for people to become record holders so they can be the true legal owner of shares. When they are not the legal owners of shares, opportunity for abuse opens up and one of the clearest examples is around voting rights.", "score": -5, "replies": [{"body": "Sounds nice but you’re making up complications for no reason. Do you have evidence where “beneficial owners “ votes weren’t honored? You want to order paper certificates?", "score": 5, "replies": [{"body": "Here's 2 examples that show nothing guarantees beneficial owners voting rights and that overvoting happens. When overvoting happens, it means beneficial owners do not get one share, one vote honored. \n\nConsequently, there are no specific shares directly owned by either the broker participants of DTC or the underlying beneficial owner. As a result, a beneficial owner's ownership cannot be tracked to specific shares but rather its ownership interest is represented as a securities entitlement at his or her broker-dealer. Each of those beneficial owners don't own the actual shares credited to their account but rather they own a bundle of rights defined by federal and state law and by contract with their broker. Consequently, a beneficial owner may not have the \"right\" to vote the securities credited to his or her account. It depends on what the beneficial owner's contract says. That's news to a lot of people.\n\nSource: [https://www.sec.gov/news/speech/2007/spch101607ers.htm](https://www.sec.gov/news/speech/2007/spch101607ers.htm)\n\nThomas Montrone, chief executive officer of Cranford, New Jersey–based Registrar & Transfer Co., which oversees shareholder elections. “It is an abomination,” Montrone, 58, says. “A lot of the time we have no idea who’s entitled to vote and who isn’t. It’s nothing short of criminal.”\n\n\n\nThe Hazlet, New Jersey–based Securities Transfer Association, a trade group for stock transfer agents, reviewed 341 shareholder votes in corporate contests in 2005. It found evidence of overvoting—the submission of too many ballots—in all 341 cases. As investors press for a bigger voice in corporate governance, more significant proxy fights will be decided by smaller margins, magnifying the potential for illegitimate votes to alter the result, Montrone says.\n\nSource: [https://web.archive.org/web/20060421085925/http://www.rgm.com/articles/FalseProxies.pdf](https://web.archive.org/web/20060421085925/http://www.rgm.com/articles/FalseProxies.pdf)", "score": 0, "replies": [{"body": "That’s many words to not show where shareholder votes were not honored. Sucks missing out on nvda but almost everyone does.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This is the link but it's paywalled because. bloomberg is too expensive when there's free stuff out there. I read the newsletter in my email which is how . i saw it [https://www.bloomberg.com/opinion/articles/2024-03-05/twitter-s-executives-want-their-money?srnd=undefined](https://www.bloomberg.com/opinion/articles/2024-03-05/twitter-s-executives-want-their-money?srnd=undefined)", "score": 2, "replies": [{"body": "Thanks for sharing this.", "score": 1, "replies": []}]}, {"body": "all i care about is ending all this woke crap.", "score": -1, "replies": []}]}
{"title": "Pfizer Inc stock is on a downhill spiral, what to do", "selftext": "[removed]", "id": "1b7j79c", "created_utc": 1709678908.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 17, "comments": [{"body": "Sorry -- we removed your message on /r/stocks because generic posts like \"I have $XXX to invest, what should I do,\" etc. because they are low-effort and asked on a daily basis in /r/stocks. Please do some basic research first and feel free to come back with any specific questions about a stock, company or market environment afterwards.\n\nIf you're just getting started, please check out our New Investor wiki: https://www.reddit.com/r/stocks/wiki/index\n\nThings you can do:\n\n1. Read the wiki which has tons of information, including reputable learning resources, broker information, and links to useful reddit posts (including old posts similar to yours)\n\n2. Search the subreddit history for similar information\n\n3. You can post questions like this as a comment on our [daily discussion stickied thread](https://www.reddit.com/r/stocks/search?q=%22r%2FStocks+Daily+Discussion%22&restrict_sr=on&include_over_18=on&sort=new&t=week)\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Aaaaand it’s gone", "score": 1, "replies": []}]}, {"body": "I got in at 27. It'll be a while until it climbs back up", "score": 3, "replies": []}, {"body": "Don't look at charts, enjoy dividends, no one knows when but it will definitely recover to $40-42", "score": 3, "replies": []}, {"body": "Might be years before PFE gets back to break even. \n\nNext time don't let your loss exceed 8%", "score": 2, "replies": [{"body": "Buy high, sell low. Great strategy", "score": 5, "replies": [{"body": "This is the way. \n\n\nFor 90% of redditors.", "score": 2, "replies": []}, {"body": "So what happens if PFE goes to 12.87 cents? What if it breaks that?", "score": 1, "replies": []}]}]}, {"body": "I disagree with the assessment that they are in a \"death spiral\". Pharmaceuticals are in the dumpster in general, its an industry wide problem. Pfizer was disproportionately affected because of the disappointment of the ongoing sales of their Covid vaccine. Moderna is having the same problem. Anyone with a realistic expectation of how the world works should know that Covid was never going to be a big thing long term. More people die of the flu than Covid. Once the hype and panic wore off, this result was inevitable. \n\nNow, it's on to the next big thing. They are starting to corner the market on next gen chemotherapy that should be very lucrative. I bought more once it hit the $27 range. It may take a bit to bounce back, but the healthy dividend yield makes it worth it in the short term as long as they end up growing their sales figures in the long term. That's my take on it anyway. I'm holding. I think, at this point, DCA down is a better strategy than liquidating. The price *will* eventually recover.", "score": 1, "replies": [{"body": "To be fair, the hype and panic lasted years longer than I ever expected", "score": 2, "replies": [{"body": "I was expecting 6-9 months. Couldn't believe that it lasted years. The state of California keeps threatening to return to a mask mandate too 🤦‍♂️", "score": 1, "replies": []}]}]}, {"body": "I missed the first fall to 26 and just accepted buying at 29\n\nAnd here we are at 26 again", "score": 1, "replies": []}, {"body": "I don’t get this mindset of refusing to sell at a loss. The loss can offset tax on profits you have or may make from other stocks sales. Obviously it’s not turned out the optimal way but it just seems like this mindset is being willfully in denial. The price is what it is. Do you want those tax credits and money to invest in something that else or do you think it’s a good play right now?", "score": 1, "replies": []}, {"body": "Check Josh Brown today, he bought In . As he said, if you are a trader you should be long out. If you are an investor , this is when you pick up", "score": 1, "replies": []}]}
{"title": "Amazon Web Services (AWS) goes all-in on nuclear power. AWS plans massive 960 MW nuclear powered data center campus in Pennsylvania.", "selftext": "", "id": "1b6znm2", "created_utc": 1709624252.0, "score": 56, "upvote_ratio": 0.86, "num_comments": 20, "comments": [{"body": "Nice. We need more nuclear everywhere.", "score": 24, "replies": [{"body": "I love this. We've known for decades that it's commercially viable, but no private company has stepped up to assume the majority of the financial risk. Awesome. Let them take that gamble. It may even pay off for them.", "score": 5, "replies": [{"body": "Wait, now why hasn’t a private company stepped up to assume the financial risk?  Oh right, because it’s not commercially viable to do so.", "score": 3, "replies": []}]}, {"body": "We don’t.  At least not near-term.  It’s far too slow and expensive to build.  It’ll be great on the Moon and Mars, and maybe cheaper versions will be deployed widely on Earth by the end of the century, but for now, solar/wind/battery is how we’ll end our fossil-carbon addiction.", "score": -1, "replies": [{"body": "*in the USA\nSouth Korea has been very successful building nuclear power plants.", "score": 1, "replies": []}, {"body": "All the more reason to get started right now.", "score": -1, "replies": [{"body": "Did you hear the “expensive” part?  We can build 10x the  capacity of solar/wind/battery vs. nuclear for a given amount of money.  And that money will produce results many times sooner as well.", "score": 3, "replies": [{"body": "I’m aware of the costs.  We need to pursue all options simultaneously.", "score": 1, "replies": [{"body": "We can certainly fund research into better nuclear, but in terms of what’s deployable now and in the next few decades, pursuing nuclear hurts the transition overall because you can’t get as much capacity.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is awesome news", "score": 0, "replies": []}]}, {"body": "On the other hand.... Pennsylvania's Three Mile Island Unit 1, rated at 819 MW, was shut down prematurely in 2019 even though it had another 15 years to run on its license.  This was due to it not being able to compete with cheap natural gas from fracking.", "score": 4, "replies": []}, {"body": "My point in posting this news: Data centers in general and specifically data centers for AI are growing massively, Sam Altman talking about 7 trillion in total investment necessary for all related sectors (fabs, electricity production, data center build out etc).\n\nElectricity consumption might be driven by the needs of AI computing in the future, right now data centers and AI data centers specifically are quite a small fraction of all energy consumed, but in the future it might become one of the main drivers.\n\nSome of this power is going to come from nuclear like in the case of the article, but a lot is going to come from renewables like wind and solar. This means grid scale battery demand is going to increase relatively to the general demand increase from data centers.\n\nEdit: there was another tweet with respect to this that I missed initially\n\nhttps://twitter.com/BrianGitt/status/1764845506403184996\n\n>US data center power use expected to TRIPLE by 2030.\n>\n>This is equivalent to providing electricity to 40 million US houses in a year.\n>\n>It's time to build nuclear power plants to enable AI & industrial progress.\n\nhttps://pbs.twimg.com/media/GH346ghbAAAp7nG?format=jpg&name=large\n\nThe article [https://www.datacenterdynamics.com/en/news/aws-acquires-talens-nuclear-data-center-campus-in-pennsylvania/](https://www.datacenterdynamics.com/en/news/aws-acquires-talens-nuclear-data-center-campus-in-pennsylvania/)\n\n>**AWS acquires Talen’s nuclear data center campus in Pennsylvania**  \n>  \n>Cloud company pays $650 million – plans 960MW campus March 04, 2024  \n>  \n>Amazon Web Services (AWS) has acquired Talen Energy’s data center campus at a nuclear power station in Pennsylvania.  \n>  \n>Talen Energy Corporation this week announced it has sold its 960MW Cumulus data center campus in Pennsylvania to a ‘major cloud service provider’ – listed as Amazon in a Talen investor presentation. Amazon is yet to comment on the news.  \n>  \n>Talen Cumulus Nuclear DC.png AWS acquires the Cumulus data center next to the Susquehanna nuclear power station – Talen | Cumulus  \n>  \n>According to the investor presentation, Talen sold the site and assets of Cumulus Data for $650 million. The deal comprises $350 million at close and $300m escrowed, released upon development milestones anticipated in 2024.  \n>  \n>\"We are pleased today to have sold our Cumulus data center campus, unlocking significant value for Talen,\" said Talen president and CEO Mac McFarland. \"This transaction provides an attractive return on Talen's investment and vision in building Cumulus, and creates value through the sale of clean carbon-free power from our top-decile Susquehanna nuclear plant.\"  \n>  \n>First announced by DCD in July 2021, the 1,200-acre campus draws power from Talen Energy’s neighboring 2.5GW nuclear power station in Luzerne County, the Susquehanna Steam Electric Station (SSES). The company broke ground in 2021 and completed the first 48MW, 300,000 square foot (28,870 sqm) hyperscale facility early last year, along with a separate cryptomine facility.  \n>  \n>Talen said AWS aims to develop a 960MW data center campus. The cloud company has minimum contractual power commitments that ramp up in 120MW increments over several years; AWS has a one-time option to cap commitments at 480MW. The cloud provider also has two 10-year extension options, tied to nuclear license renewals  \n>  \n>As part of the deal, Talen will also supply AWS with energy via a 10-year Power Purchase Agreement (PPA) from the Susquehanna site.  \n>  \n>Commissioned in 1983 for energy company PPL, the 2,494MW Susquehanna Steam Electric Station is one of the largest nuclear power plants in the US. Its current owner, Talen Energy, was founded in 2015 after the competitive power generation business of PPL Corporation was spun off and combined with competitive generation businesses owned by private equity firm Riverstone Holdings.  \n>  \n>Talen Energy formed Cumulus Growth in 2020 to ‘invest in opportunities created by the convergence of digital infrastructure and power’ and had two separate businesses; Cumulus Data, focused on hyperscale data centers; and Cumulus Coin, focused on digital currency mining.  \n>  \n>In an ESG report from March 2021, Talen said the company was “well-positioned to capture value” in areas such as data centers and digital coins, saying the two business areas could be a “stable source of income outside of the traditional market.”  \n>  \n>Cryptocurrency firm TeraWulf is working with Talen on the cryptomining side of the project.  \n>  \n>Talen’s Nautilus crypto data center is seemingly not part of the deal with Amazon.", "score": 7, "replies": [{"body": "Ah ok so they’re not building any *new* nuclear capacity for this.", "score": 10, "replies": []}]}, {"body": "What's the cost per KWH gonna be?", "score": 2, "replies": []}, {"body": "Too bad it’s not new nuclear.", "score": 1, "replies": []}, {"body": "This is dumb, but PA has been hardcore pro nukes since early days.  Has Amazon figured out what to do with the Radioactive Waste?", "score": 1, "replies": []}, {"body": "Tech companies can just build nuclear plants 🤔", "score": 1, "replies": [{"body": "Nope.  See the details OP included in a comment here.  This is not new nuclear capacity; just a purchase agreement with an existing plant.", "score": 5, "replies": []}, {"body": "Except not profitably, unfortunately.", "score": 2, "replies": []}, {"body": "Well if the NRC allows them to", "score": 0, "replies": []}]}]}
{"title": "What do you do when there is important economic data or meeting?", "selftext": "Hi I trade credit spread weekly or 2 weekly. I would like to ask what do you guys do when you know there is important economic data or meeting that might cause high volatility in the market? such as CPI data release, FOMC meeting..   \nDo you stop trading and observe first? Or still go ahead if you see nice setup?", "id": "1b78agc", "created_utc": 1709653389.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 22, "comments": [{"body": "Id HIGHLY recommend you dont trade the news unless you plan on using a massively large stop loss", "score": 3, "replies": [{"body": "I am avoiding, but as I do weekly option, I have to avoid for 2 weeks due to CPI data coming next week and FOMC meeting the week after. Meaning no trading for 2 weeks oops", "score": 2, "replies": [{"body": "Came looking for this, there are several good setups rn for me, but I can't play them cause next week inflation rate. I'll see what march 15 plays I can make after the number comes out. Then wait again with cash for interest rates decision", "score": 1, "replies": []}, {"body": "Cpi reports affect options? I come from forex and there fomc etc dont affect the overall move of the day", "score": 0, "replies": []}]}]}, {"body": "observe first", "score": 2, "replies": []}, {"body": "Observe sitting in cash. Usually, I'm better off just avoiding it, though. If you are trading longer term than a week, it's basically just noise and can be ignored. If you are trading shorter term than that, it will overwhelm any other trade you have going on.", "score": 2, "replies": []}, {"body": "My spreads are 30-60 days... I ignore everything except earnings of he underlying.", "score": 2, "replies": [{"body": "And it works out for you? You do the tasty trade model?", "score": 1, "replies": [{"body": "idk what the tasty trade model is, but that timeframe works for me and gets me far enough away to keep premium high. Any profit early I take at 25% but I'm definitely out by 75%.", "score": 1, "replies": [{"body": "What deltas? And any rules on which underlying?", "score": 1, "replies": [{"body": "25 and below... typical multi-strike. I have a core list of 25-30 underlying and pick whatever is trending neutral or bullish. Nothing sophisticated.", "score": 1, "replies": []}]}]}]}]}, {"body": "I open 30-45 dte so data and meetings do not usually impact my positions as much. Having to navigate these events is yet another reason why weekly trading can be less efficient and successful . . .\n\nIf I have a trade about ready to close for the 50% gain, I use, then I may close it early for slightly less profit to avoid having the trade reverse based on the news, but other than this I don't pay a lot of attention to these reports now that the fear of a recession has mostly passed.", "score": 2, "replies": []}, {"body": "Switch to debit with 1/4 risk size, sell credit full size after news.", "score": 1, "replies": [{"body": "Interesting. Could u elaborate further? How do u think about delta / strike selection and expiry for the debit?", "score": 1, "replies": [{"body": "Zoom out to a daily chart and ask the following questions:\n\nWhat is the market trying to do?\n\n>! A: Continue the breakout from last Friday \n\nWhere will the market go if they are successful? What's the easy target? What's the stretch goal?\n\n>! A: New all time highs. 5175 SPX which is the 1x balance extension. 5225-50 SPX, average upper limit for how much the market can move in a given week.\n\nWhere will the market go if they fail? What's the easy target? What's the stretch goal?\n\n>! A: Return to breakout point for a retest (~5105 SPX), fail that and it goes to the balance mid point/another prior breakout point ~5075. 5025-00 as average lower limit for how much the market can move in a week.\n\nThen pick the direction you believe to be most likely and set up a trade that returns 3R+ if you're right, disregard delta, set long leg in front of the easy targets if possible, accept max loss if you picked wrong and make up the difference after event. Time horizon set either as a weekly or event day+1. e.g. SPX 5100/90 PDS @$2 on Monday for Jpow's appearance this week on Wednesday and Thursday.", "score": 1, "replies": [{"body": "Thank you. That’s helpful", "score": 1, "replies": []}]}]}]}, {"body": "Fuck FOMC meetings, you’re much better off buying strangles during those. CPI i like to have no more than 25% BP allocated to credit spreads because the moves can be, but not always, massive", "score": 1, "replies": [{"body": "do you think strangle before FOMC is hit or miss?  even back in 2022-2023, some FOMC causes violent move.  some just stay flat and causes IV contraction", "score": 1, "replies": []}]}, {"body": "Trim down on positions and grab popcorn", "score": 1, "replies": []}, {"body": "Stay away until the data is dropped and initial reactions settle down 🙅‍♂️", "score": 1, "replies": []}, {"body": "Do little to no trades... especially right now.", "score": 1, "replies": []}]}
{"title": "$ROST Tonight", "selftext": "Along with your ANF tees and TGT khakis, ROST got you covered on the Nauticas. ", "id": "1b78zed", "created_utc": 1709654977.0, "score": 35, "upvote_ratio": 0.78, "num_comments": 12, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 36 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Seriously what do you guys think, calls?", "score": 4, "replies": [{"body": "Check out today’s post from [Green Corgi](https://www.reddit.com/r/wallstreetbets/s/0QHWwQX6Zu) as well as the comments.\n\nClothing stores have been on a run since Q4 (holidays). Abercrombie & Fitch and Nordstrom have a good outlook into earnings and I can’t see why that wouldn’t echo here.\n\nAdd in old men, frat boys and old frat men will never stop buying Nautica so they have a solid revenue stream there![img](emote|t5_2th52|4275)", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}]}, {"body": "😂😂😂", "score": 4, "replies": []}, {"body": "https://preview.redd.it/euh0ceezzkmc1.jpeg?width=1591&format=pjpg&auto=webp&s=3750b1b8c6aa4b4de3b17480b3f7527893533b7b\n\n![img](emote|t5_2th52|8883)", "score": 3, "replies": [{"body": "why'd it drop back down", "score": 3, "replies": [{"body": "Waiting on the forecast maybe", "score": 2, "replies": [{"body": "It's over ![img](emote|t5_2th52|4260)", "score": 1, "replies": []}]}]}]}, {"body": "i support world peace", "score": 3, "replies": []}, {"body": "Calls on this guy's sex life", "score": 2, "replies": []}, {"body": "Was that a DBZ tail movement sound effect at the end of that clip😂? lol", "score": 2, "replies": []}]}
