{"title": "Next few months are super bullish for NVDIA.", "selftext": "[removed]", "id": "1br6yvm", "created_utc": 1711766216.0, "score": 46, "upvote_ratio": 0.84, "num_comments": 22, "comments": [{"body": "NVDA hasn’t been that relevant for BTC mining for a while.", "score": 19, "replies": [{"body": "Edit I didn't know that GPU mining has been greatly reduced. My bad", "score": -12, "replies": []}]}, {"body": "Too many good news around NVDA. Only some of them are priced in.", "score": 11, "replies": [{"body": "That's what I meant!", "score": 2, "replies": []}]}, {"body": "$1200 sooner", "score": 7, "replies": [{"body": "I honestly see $640-720", "score": -5, "replies": [{"body": "Can you share your thesis? Interested in contrarian opinions.", "score": 7, "replies": [{"body": "His thesis: it went up too fast and I wasn’t in the stock. Once it hits $600, I will buy heavy and then it will go to $1200", "score": 9, "replies": [{"body": "💯", "score": 5, "replies": []}, {"body": "I’ve been here before, Nvda is not worth 100x earnings", "score": 0, "replies": []}]}, {"body": "Nvidia has done this before, just like the gpu eth mining days we will see about $1000 top out and head back to $640-$720", "score": 1, "replies": []}]}]}]}, {"body": "Mining with GPUs is only efficient for alt coins. it is better now than 12 months ago but I don't think it will be a massive driver\n\nThe Nvidia laptop ARM idea would be great for them if true and one of the only competitors for Apple if they go ahead with it. They have the design chops to pull off a good CPU/GPU for mobile and if they perform well I can see them making a lot out of this.", "score": 6, "replies": [{"body": "It would be pretty cool if they made APUs with very powerful GPU components for mobile gaming handsets like the Deck and VR headsets. Imagine a portable handset or standalone VR headset with desktop gaming level performance!!", "score": 1, "replies": [{"body": "I think the price point they would have to hit for it to be successful wouldn't be worth it for Nvidia. A 3000 dollar laptop on the other hand", "score": 1, "replies": []}]}, {"body": "I didn't know that! My friends bought some 40 series gpus for gaming and mining from which I thought it was a decent driver", "score": -1, "replies": [{"body": "It's not going to be on the scale compared to 2020/2021. Still a good part of their business but the AI/datacenter is the reason for their massive run up. The margin / wafer on the datacenter is 10x what they make on gaming", "score": 2, "replies": [{"body": "On further inspection, gpu mining is no longer feasible. Electricity prices are high and gpus are not efficient enough ( low hashrate compared to asics ).", "score": 2, "replies": []}]}]}]}, {"body": "Cryptotards have no place here or anywhere. Take your shilling elsewhere.", "score": 1, "replies": []}, {"body": "Yeah u don't think these are priced in already? 🙄", "score": -4, "replies": [{"body": "I think they are partially priced in as investors are still waiting to see results. As we see how NVDA performs against these goals they set for themselves over the next few quarters, we will see some wild swings in either direction.", "score": 3, "replies": []}, {"body": "I don't, I am talking about 2025's price prediction. If they are super successful in all of the ventures, surely their price gonna moon.", "score": 5, "replies": []}]}, {"body": "Nvidia lost cryptocurrency mining revenue when Ethereum went POS in 2022.  CPUs don’t make money, ask intel.   Sounds bearish", "score": 0, "replies": []}]}
{"title": "Why 15 Analysts Raised Their Nvidia Stock Price Targets in March", "selftext": "", "id": "1bresze", "created_utc": 1711794911.0, "score": 47, "upvote_ratio": 0.8, "num_comments": 23, "comments": [{"body": "When stock price goes up, they raise price targets . When it goes down they tell you to sell or avoid and cut prices. Very easy job", "score": 70, "replies": []}, {"body": "They all hold NVDA so obviously they want it to go up", "score": 22, "replies": [{"body": "S(h)ame", "score": 0, "replies": []}]}, {"body": "When I see see FIFTEEN analysts recommending anything you know it's a pump to preserve the current stock value.  Same with TSLA and NIO in recent months.", "score": 19, "replies": [{"body": "NIO has been going lower every bloody day", "score": 4, "replies": [{"body": "For six months…. Really, for the past year. I get a tweet from a certain NIO pumper a least once a week.", "score": 3, "replies": []}]}, {"body": "Don’t forget Apple, the stock is a dumpster fire but Cramer and CNBC pushes it non stop as such a great deal cause it’s Apple", "score": 3, "replies": []}, {"body": "What if 60 recommend it?", "score": 1, "replies": []}]}, {"body": "This is the new price target the investment banks want to unload their shares (to retail) at.", "score": 5, "replies": []}, {"body": "I’m damn sure not selling anytime soon.", "score": 3, "replies": [{"body": "HOLD DO NOT SELL. THESE WILL MATCH ANY HIGH PROFORMING ETF. Keep the faith bro’s", "score": 1, "replies": []}]}, {"body": "When you see headlines like this run away", "score": 2, "replies": []}, {"body": "Now this is why I buy", "score": 2, "replies": []}, {"body": "Bag holders for awhile maybe?! Lol", "score": 1, "replies": []}, {"body": "They see a pretty penny.", "score": 1, "replies": []}, {"body": "They probably read the news that MSFT wants to incest 100B in AI computing, but never checked if they actually have the money", "score": -1, "replies": [{"body": "I don’t even wanna know y ur spell check changed it to incest", "score": 5, "replies": [{"body": "My keyboard has a mind of its own", "score": 3, "replies": [{"body": "Ooooookk… 👀", "score": 1, "replies": []}]}]}, {"body": "Gross", "score": 2, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1brhcad", "created_utc": 1711803653.0, "score": 3, "upvote_ratio": 0.59, "num_comments": 15, "comments": [{"body": "This is like asking if people have used a phone or used a search engine. Sure it could be reflective of future trends, but in no way does it dictate the beneficiaries of the future.\n\nMany of us used ChatGPT because our bosses forced us to. And then we never used it again. \n\nThe survey should ask “how often do you use ChatGPT?” That’s the real question.", "score": 2, "replies": []}, {"body": "I'm using it to help me write the first part of code. So fast. It's good at python", "score": 1, "replies": [{"body": "How many Americans write code? I see that software developers and data analysts are only 0.6% of the US workforce.\n\nLet’s see how ChatGPT handles the highly secretive pre-release material. Oh you’re telling me someone can jailbreak it to release training data? Uh oh. \n\nEven internal to the organization, the data is secret and cannot be seen by most members. Anyone who has access to an internal LLM could theoretically discover this data and then make significant insider money off of it. They’d make more in a minute trading that data than in a lifetime. \n\nThe privacy issue and the liability issue will keep “AI” constrained in a significant number of industries long past the date when it might be useful. An AI doctor might be better, but who do you sue if it cuts your eyes out? The AI? The hospital? But you consented to AI doctor and its flaws!\n\nIf my small town doctor wrongly prescribes me a mismanaged medication at overdose levels, and I get hurt, I could claim they have liability. They have incentive to not make a mistake. But an AI doctor???", "score": 0, "replies": []}]}, {"body": "Off topic:  Not bringing up stocks or the stockmarket.\n\nAlmost any post related to stocks and investment is welcome on r/Stocks, including pre IPO news, futures & forex related to stocks, and geopolitical or corporate events indicating risks; outside this is offtopic and can be removed.\n\nPosts & comments that are purely political, religious (dealing with morality), or focusing on other types of investments not related to stocks such as real estate, crypto, designing websites, or even selling sneakers will be removed.  An example of what wouldn't get removed:  Discussing real estate when related to the ETF VNQ or real estate bubble affecting the stock market.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 0, "replies": []}, {"body": "I was never that sure that AI was close to becoming what some people thought it would be, but that changed when Microsoft announced their $115B supercomputer. Companies talking about AI in their earnings reports was mostly a joke to me, but Microsoft is essentially investing 24 Large Hadron Collider's worth into one project in less than half the time. I still don't know much about the potential of AI, but when a guy like Nadella in a company like Microsoft decides to start such a project there has to be more to it than marketing.\n\nI still think ChatGPT is mostly a gimmick even if people at work are using it regularly, even if studies show it increases productivity by, idk what it was, 30% or so in some jobs. But on the other hand ChatGPT is basically  AOL. I'm really excited for the future of AI.\n\nRanty comment, but this felt like a fitting post to get this off my chest lol", "score": -1, "replies": [{"body": "I no math expert but if say 20% of the workforce can improve productivity by 30%. Times that by 100's of billions of economic output. That's a lot of money and time saved.    \n\n\nThis is just the beginning, its only going to get better.", "score": 2, "replies": []}, {"body": "I’ve not seen any number of $115b. The article you’re citing has $100b as the total cost of the entire multi year project. \n\nLet’s not just make up shit", "score": 1, "replies": [{"body": "*Expenses for the plan could exceed $115 billion, more than triple Microsoft's expenditure last year on capital spending for servers, buildings and other equipment, the report stated.*\n\n[https://www.reuters.com/technology/microsoft-openai-planning-100-billion-data-center-project-information-reports-2024-03-29/](https://www.reuters.com/technology/microsoft-openai-planning-100-billion-data-center-project-information-reports-2024-03-29/)\n\nHeadline vs content.", "score": 1, "replies": [{"body": "“The plan” is a 5 phase plan. The “supercomputer” is specifically the 5th phase. Not to be anal, but the whole point is that Microsoft plans to spend that much but hasn’t yet.\n\nIf you bought $115b of hardware between 2024-2027, you’d run into a serious issue if the demand only exists in 2028.", "score": 1, "replies": [{"body": "> but hasn’t yet\n\nThat's why I said \"investing\" and not \"invested\".", "score": 1, "replies": []}]}]}]}, {"body": "You think chatgpt is a gimmick? Wow lol ok", "score": 1, "replies": [{"body": "In comparison to what AI can actually do? Yeah.", "score": 1, "replies": [{"body": "I don't understand what you mean?\n\nChatgpt objectively increases productivity a ton in various domains. It's not a gimmick. It had very strong use cases.", "score": 1, "replies": [{"body": "It is a gimmick. The real value of AI is analyzing x-rays to find tumors, analyzing seismic images to pin point oil and gas deposits that humans can't spot, analyzing supply chains to maximize efficiency, Google discovering, what was it, 300000 or so new crystal structures etc. ChatGPT is a joke in comparison. It's a fun tool, it has its uses, it's helpful sometimes, but it's nothing compared to what AI in general can do.\n\nIt's basically just pimped up Google Search. Until it gets to System 2 thinking it'll likely stay a gimmick.", "score": 1, "replies": [{"body": "It's absolutely not like Google search. \n\nIt can significantly help improve productivity. Cut down costs etc.\n\nIt's a game changer.\n\nI work in a very well known faang company as a senior manager and it has changed complete the way we operate.\n\nWe have 8 people in my team being productive to such an extend that I had to remove my request for  2  additional fte headcounts as we didn't need them any more.\n\nThe cost savings, productivity unlocking etc is HUGE. So much that we altered processes.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1brtftz", "created_utc": 1711835533.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 26, "comments": [{"body": "**Blistering Start for Xiaomi’s SU7 Sedan**\n\nXiaomi, a major Chinese handset maker, has made a splash in the electric vehicle market with the launch of its SU7 sedan. The company announced an impressive 120,000 firm orders in just 36 hours, positioning the SU7 as a direct rival to Tesla’s Model 3.\n\n**Aggressive Pricing and Smart-Car Connectivity**\n\nThe SU7 sedan promises deep smart-car connectivity, fast acceleration, and an aggressive price point. With a starting price of 215,900 yuan ($29,901), Xiaomi aims to attract customers looking for a more affordable alternative to the Tesla Model 3, which starts at 245,900 yuan ($34,056).\n\n&#x200B;\n\nIs this something that should concern us?", "score": 5, "replies": [{"body": ">Xiaomi says the standard will run 435 miles, the Pro 516 miles, and the Max 497 miles. Those estimates are based on China’s CLTC testing cycle but those are extremely strong numbers. Additionally, the standard can be charged from 10- to 80-percent battery capacity in 25 minutes, the Pro in 30 minutes, and the Max just 19 minutes.\n\nYes, I would worry because I will buy BYD or Xiaomi if I am looking for a cheap-priced EV that has a long range. Why buy something more expensive with less range?", "score": 1, "replies": []}, {"body": "Do you enjoy garage fires? I barely trust charging my tesla in my townhome complex built in the 60s.", "score": 1, "replies": []}]}, {"body": "Meizu vs Apple", "score": 2, "replies": []}, {"body": "Tesla will be number 3 in China.", "score": 2, "replies": [{"body": "And #1 in the world.", "score": 1, "replies": []}]}, {"body": "Just more proof that Tesla is getting killed in the biggest EV market in the world.", "score": 2, "replies": []}, {"body": "Good looking car.\n\nThere are many good looking cars. This one more closely competes with Tesla of course because of price and the fact that it's an EV. Until they start to ramp up and scale outside of China I wouldn't worry too much at first. They have a long way to go, I'm hoping the best for them.\n\nBut Tesla stock has performed primarily on the theory that it can bring something new to the market, never for what it is now. For example, a long time ago, Tesla was the only company set out to make cars that were fully electric. If you were around back then, old enough to remember, you would know. No one said it was possible. Many years before, and all years leading up to Tesla's first full scale production car - It was commonly thought that, \"We'll never see electric vehicles, it's just impossible. If they could have done it by now, if it was viable, they would have done it by now.\" It was just how we accepted cars to be back then. No one second guessed it. It wasn't even an opinion if it was possible, it was treated as fact for 99.9% of people. Cars will always be gas powered, never electric. Some bullshit about inefficiency. If it was ever discussed or thought of, that's how the conversation went 100% of the time with 99.9% of the people. And now with the luxury of hindsight, we can realize that 99.9% of people really don't know what the fuck they are talking about - at all.\n\nIt takes that 0.1% to say, no. Challenge what we all think to be true, and dare to try something new.\n\nTesla is that 0.1%. And the very thing that they did to shake the world and prove themselves as a 0.1% company is what they continue to press for. Tesla is not about what 99.9% of the people think. It's not about what Wall Street, investors, and everyone else who doesn't have first hand impact at working at Tesla think. We are the 99.9%, we accept things as they are. Tesla isn't worried about Xiaomi, competing with other cars. Tesla is working on something that those cars will eventually have to invest in themselves. And it has been said over, and over, and over, and over again. And most people still cannot even begin to understand what it is until it comes to fruition. And by then, it will be too late for the 99%.\n\nWill Tesla trade down on this news? Maybe. Is this why investors and the street have been jumping ship months leading up to this reveal? Maybe. Buy the rumor (typically calls, but puts on negative rumor) sell the news (typically puts but bad news so calls?) \n\nbut that is short term to what Tesla's plans are. And if you think that Tesla's plans are just to make EVs and sell EVs to turn profit as their only goal. Then yes you should be worried, and you should sell. And if you're feeling frisky you should short too. Good luck.\n\n If you know what Tesla is really set out to do, then this means absolutely nothing.", "score": 2, "replies": [{"body": "Here's the simple truth. Tesla stock is overvalued. Growth has stalled.\n\nhttps://preview.redd.it/e4zllswhkorc1.jpeg?width=1111&format=pjpg&auto=webp&s=434c24457987a073d7878c635269d9ca4e9d1a78", "score": 3, "replies": [{"body": "Do you say that someone in school learning to become a doctor or lawyer has stagnated while they work part time, too? Or would you say that they have momentum working towards their goal? \n\nYou're measuring Tesla's metrics based on results you see, an output. But they are working very hard at other things with goals that aren't going to be reflected in their current pe.\n\nIt's okay if you think Tesla will fail at their goal, but at least have the balls to say it directly. But of course you don't, bears don't have balls because if they did, they would be bulls.  \n\nInsufferable cunt.", "score": 1, "replies": [{"body": ">Insufferable cunt.\n\nThese are the words of someone far too invested in a car/tech company. Either emotionaly or financially. \n\nPeople have different opinions; get over it.", "score": 1, "replies": [{"body": "Again, wrong.\n\nYou're allowed to have a different opinion, that's grand and I welcome it.\n\nHe was being completely disingenuous and disrespectful towards me with his response, being belittling at worst. Willful and completely ignorant at best. \n\nI gladly returned the favor. Get over it.", "score": 1, "replies": []}, {"body": "Yea. Sad really. Had to say something mean back ofcourse. 😂", "score": 1, "replies": [{"body": "But you are an insufferable cunt, companies last for decades and centuries, but idiot brains just there to point out week long dips. 5 out of the 7 companies dipped worse and bounced back. LOL in less than 12 months", "score": 0, "replies": [{"body": "What kind of mental disease do you have? Do you pray to Musk at night?", "score": 1, "replies": [{"body": "Spends 24/7 defending anything and everything Musk and Tesla related then refuses to acknowledge any facts that differ from their obsession.", "score": 1, "replies": []}, {"body": "Musk, you love him, only on musk related areas of Reddit. Did he sleep with and dump your mother into the trash ? Sickfk", "score": 0, "replies": []}]}]}]}]}, {"body": "Twisted logic. Tesla is burning investor's money based on Musk's whims. Meanwhile Tesla is trading at a P/E of 60-120. \n\nYou are basically saying Tesla's half baked science projects are twice as valueable as the other mag7 businesses. It obviously isn't. It's a matter of time before Tesla's stonky goes down to somewhere below $50. \n\nLittle bitch.", "score": 0, "replies": [{"body": "I've said before that those Tesla science projects are what made it into the monster it is today. I believe they can do it again. I've seen steady progress towards that happening. It takes a lot of time for A.I. and tech to develop. Bears are mad it doesn't happen in 1-2 years after the announcement. But those years have seen improvement since inception. If you don't believe it, you need to look a little harder.\n\nFor me, personally, I've seen tech in every facet of our lives only get better with age and r&d. Every aspect of your smartphone used to need an entirely separate component or device. You couldn't listen to music with a phone. You needed a cd player, a cassette walkman. If you wanted an email, you needed an entire desktop computer with kb&m, etc.\n\nAnd although all of those things gave been combined for over a decade into what is now the modern smartphone, We still haven't reached the apex of smartphone tech, the phone today is still significantly better in many ways than the phone of 5 years ago. This trend will likely continue.\n\nSo, it makes sense that this path will continue with FSD. And FSD hasn't been around nearly as long as the smartphone. It is at its infant levels. The GPUs powering these projects are still getting better every year as well. Seems silly to bet against billions of dollars of investments and brilliant minds setting out every day to achieve what small pinhead haters think is impossible. \n\nStay jealous, insufferable cunt.\n.", "score": 1, "replies": [{"body": "There is such a thing as an economic reality. Tesla is simply not worth the current mkt cap. Simple as that. \n\nEnjoy the ride to $50.", "score": 2, "replies": [{"body": "Yes, their newest technology has not yet brought in any revenue yet. Which is exactly why I'm bullish on it. Because when it does, the company will be worth so much more.\nIf everyone knew in 10 years' time whether or not it would be successful, or if they gave up and said it's impossible, the stock would trade on those merrits now.\n\nPeople are betting against it because they are impatient, I don't mind. It's good for the stock that it slows down a little bit, it did get ahead of itself based on only those merits. \nBut if what they are setting out to do does become a reality, all puts will get flushed out.\nI think it's inevitable. Remember, we didn't have the iphone pro max 15 and samsung ultra 24 in one years' time after the first intial release of the smartphone in 2008.\nIt will get better. And it will integrate into society. That's my belief, however. Just the way I see things", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Who wants to sit around in a Xiomi. It’s shit you buy when you can’t afford anything else. It’s fast food that’ll kill ya and your family. Can’t even call customer service when the thing bonks out", "score": 1, "replies": [{"body": "Tesla has 50,000 unsold cars this quarter and a 20% drop in sales off last quarter. 80,000 below the consesus. Thats huge, huge issue. Time for Elon to go!", "score": 2, "replies": []}]}]}, {"body": "All this car never made it to mass production charging and proper distribution in the USA... Same old same old", "score": 1, "replies": []}, {"body": "Wait by poco version...😁", "score": 0, "replies": []}, {"body": "Looks cool. But can they scale it and is the quality actually good? What about the technology? In theory it could rival the m3 but in reality I doubt it.", "score": 0, "replies": []}]}
