{"title": "DFV's Roaring Kitty Spreadsheets Recreated with Free Data!", "selftext": "I have been working on a project to recreate DFV's Roaring Kitty (RK) spreadsheets that he used to track movements and metrics on thousands of stocks. This latest version tracks top movers, insider buying, industry breakdowns, and calculates multiple value metrics. I would love feedback and recommendations.\n\nThe spreadsheets now track:\n\n* A universe of over 3,000 stocks (and can handle thousands more)\n* The biggest daily movers\n* The biggest weekly movers\n* The stocks with the most insider buying\n* All stocks based on their industry and sub-industry\n* Valuation metrics for stocks that warrant further analysis\n\nYou can [view a working demo of the version v0.6 stock tracker here](https://docs.google.com/spreadsheets/d/1peYe8V-PDQwueKSbgGTgQXT5zFYhQ8niZvMJo3S_YI4/edit#gid=171851922&range=A1:C1). \n\n&#x200B;\n\n[A view of the Weekly Movers](https://preview.redd.it/6qmdznrqoqv71.png?width=1917&format=png&auto=webp&s=75fb079f8779aa5ca6373b59eb26c486dba4ac31)\n\n&#x200B;\n\n[Industry Tab View](https://preview.redd.it/314xiswsoqv71.png?width=1913&format=png&auto=webp&s=a2d1db0eabc359bb01b1c09418302000c310a4ce)\n\n&#x200B;\n\nI started by breaking down [how the RK spreadsheets work together](https://www.reddit.com/r/RKSP/comments/nz32uu/rk_spreadsheets_and_how_theyre_related_link_to/). I got most of it right, but later learned I made a few mistakes.\n\n[How the RK Spreadsheets are connected and work together](https://preview.redd.it/zf3cg8zvoqv71.png?width=2002&format=png&auto=webp&s=1a8975bd30f5d721e41a5c16f7401d3495f1abc8)\n\n&#x200B;\n\nThen I built a working [Stock Universe (v0.5)](https://docs.google.com/spreadsheets/d/1QAKESea8lpez5uTOdDyFJh3URpRNMnodRPAdFsD143Q/edit#gid=284741622&range=A1:C1) that acts as a database tracking over 3,000 US stocks. This was followed by the [Stock Tracker (v0.5)](https://docs.google.com/spreadsheets/d/1Vxn1EcDRrHqCpCnRvkJdeVijD6lYSHZINHdvdglclBA/edit#gid=171851922&range=A1:C1) which tracks daily and weekly movers. You can download the v0.5 version sheets for yourself and put them to use. Just keep in mind they get a little slow during market hours, and sometimes crash (the new v0.6 is much better!). \n\nI highly recommend watching the [Roaring Kitty Tools Part 3 (Spreadsheets)](https://youtu.be/7wjWnMcdnlQ?t=240) video to understand how these sheets work.\n\nThe latest version (v0.6) has much more capability, is much faster, and works really well during market hours, but is still a work in progress. I will make a new post when this version is ready for public use. You can still use the v0.6 tracker at the above link, you just won't be able to edit anything.", "id": "qg51in", "created_utc": 1635250333.0, "score": 1645, "upvote_ratio": 0.97, "num_comments": 157, "comments": [{"body": "A hidden gem right here… wow… thank you, this is absolutely insane", "score": 129, "replies": [{"body": "Thanks. It has been a lot of work but I'm really enjoying this project and I've learned a ton.", "score": 54, "replies": []}, {"body": "Heros all dont wear capes.", "score": 5, "replies": [{"body": "OP might wear a cap. We don’t know yet. Still waiting for the data to come out.", "score": 6, "replies": []}]}]}, {"body": "This is monumental. Thank you, seriously. me and my co worker we’re looking into DFVs spreadsheets and wished something like this would come along. \n\nAlso, It’s been an hour and no one has commented on this post yet? Pretty odd", "score": 98, "replies": [{"body": "It's also odd that I haven't received any alerts about the comments that are now here. Weird.", "score": 46, "replies": [{"body": "Never mind. I'm definitely getting notified now.", "score": 12, "replies": []}]}]}, {"body": "Thank you. I’d give you an award if I hadn’t spent all my money on GME", "score": 56, "replies": [{"body": "You beautiful son of a gun", "score": 4, "replies": []}, {"body": "Same ape brother, same\n\nThis is the way", "score": 5, "replies": []}]}, {"body": "Thanks tremendously, this is huge", "score": 10, "replies": [{"body": "Thanks and no problem. These were inspired by Roaring Kitty so it's only fitting that they be available publicly. I will make new posts when major updates are ready.", "score": 2, "replies": [{"body": "It and you are definitely noticed and appreciated man, really great contribution to the community, no way to know who and how much this helps, but def does!", "score": 1, "replies": []}]}]}, {"body": "uhh I have no idea how markets work, but I know a little about excel spreadsheets/formulas. This might be the perfect bridge study for me to understand finance..! thank you so much for this invaluable effort.", "score": 10, "replies": [{"body": "No problem. I hope you find it helpful!", "score": 6, "replies": []}]}, {"body": "Woah this is incredible. Keep crushing it!", "score": 8, "replies": []}, {"body": "This is seriously huge, I'm gonna dive in. I've seen his spreadsheet videos and the amount of work that went into this I'm sure was significant. Thanks for sharing with us.", "score": 21, "replies": [{"body": "No problem. I hope to have the v0.6 version done in the next week or so and then folks can download their own copies. The v0.5 versions are ok, but much slower.", "score": 13, "replies": []}]}, {"body": "very nice, but how do i get the insider buyer tracker sheet?", "score": 5, "replies": [{"body": "I'm hesitant to make that sheet publicly available until v0.6 is more stable. It may spit out great data, but it's a bit of a disaster on the inside.  \n\n\nThe insider buying tracker sheet is really a temporary patch to keep things running until a custom function gets built. That function is getting worked on now.", "score": 3, "replies": []}, {"body": "I just had an idea about how to get you access to the insider buying tracker without having to download your own version. I think I'll have something for you later today (Wednesday).", "score": 1, "replies": [{"body": "ohhhh ok, great! thanks a to", "score": 2, "replies": [{"body": "If you've downloaded v0.6 then put the below string in cell B11 of the \"start\" tab in the Tracker sheet (where it asks for an Insider Buying tracker link).   \n\n\nYou may have to uncheck the checkbox for a few seconds then check it again.  Please let me know if it works or not.  \n\n\n1yUj8NmGUcm7m602wvqcLZkfL7qCuFlfAIqa9m1XY8qk", "score": 2, "replies": [{"body": ">1yUj8NmGUcm7m602wvqcLZkfL7qCuFlfAIqa9m1XY8qk\n\nThis worked for me.  Awesome.  \nCrowd sourcing this is gonna be really epic.", "score": 2, "replies": [{"body": "Glad to hear it!", "score": 1, "replies": []}]}, {"body": "great!!!", "score": 1, "replies": []}]}]}]}]}, {"body": "Commenting b/c I need this shit thanks op", "score": 12, "replies": []}, {"body": "im dumb, but how do i sort a column by value (percentage it moved up/down) and not by name of the company/stock", "score": 6, "replies": [{"body": "In cell O3 of the daily movers (d), weekly movers (w), and insider buys ($) sheets there is a drop down menu. In the industry sheet it's cell A3. Click that menu and choose the column number you want to sort by.\n\nThere should be a number above all the columns.\n\nAlso watch [this section of DFV's Spreadsheet video](https://youtu.be/7wjWnMcdnlQ?t=5187). Really you can watch the whole video to learn how all of these sheets work.", "score": 4, "replies": []}]}, {"body": "This is awesome! Looking forward to start playing with it.\n\nBtw we might have accidentally broken google docs. I cant open any of the links :/", "score": 5, "replies": [{"body": "Hmm... still working for me, but there may be a limit to how many people can be in one spreadsheet. there are a LOT of people in all of the sheets right now.", "score": 2, "replies": []}]}, {"body": "Awesome job!", "score": 7, "replies": []}, {"body": "I started watching his spreadsheet videos a while ago, I had absolutely no idea what i was doing…now i have no idea what I am doing; so progress.   I love spreadsheets and cannot wait to tackle this.   I need to be able to set it up for myself.", "score": 10, "replies": [{"body": "I tried to make copies of the RK spreadsheets back in November of last year, but I failed miserably. I finally made progress after I took the time to watch more and document how the RK spreadsheets work together.\n\nI didn't know most of the formulas or scripts when I started this project, and I have definitely learned a lot. \n\nYou can setup the v0.5 sheets for yourself right now. The v0.6 sheets need a little more work before they're ready for others to download and setup.", "score": 11, "replies": []}]}, {"body": "I am sure there are many programmers on this sub to help OP or possible work on creating something out of it.\n\n Good work, OP", "score": 3, "replies": []}, {"body": "Thank you sir", "score": 3, "replies": []}, {"body": "Doing God's work. Nice job", "score": 3, "replies": [{"body": "I don't know about that. More like copying other people's work!", "score": 1, "replies": []}]}, {"body": "Your the real MVP.", "score": 3, "replies": []}, {"body": "Awesome work!", "score": 3, "replies": []}, {"body": "Does this maintain itself and scrape updated data when it’s available?", "score": 3, "replies": [{"body": "Yes. Everything is automated, but you need to maintain the universe of stocks by adding new stocks or deleting ones that get delisted.", "score": 2, "replies": []}]}, {"body": "It's very nice of you to share it with all. Keep up the good work! Thank you!", "score": 3, "replies": []}, {"body": "Thanks a lot for your work!", "score": 3, "replies": []}, {"body": "Thank you!", "score": 3, "replies": []}, {"body": "Wow OP this is great. Thanks for your hard work 🙏🏻", "score": 3, "replies": []}, {"body": "This is insane work! Awesome job sir!", "score": 3, "replies": []}, {"body": "This is great!  Thank you!", "score": 3, "replies": []}, {"body": "This is amazing", "score": 3, "replies": []}, {"body": "Great work, gj", "score": 3, "replies": []}, {"body": "thanks for all the work this must have been!", "score": 3, "replies": []}, {"body": "Very cool", "score": 3, "replies": []}, {"body": "Thanks a lot for sharing! Awesome work", "score": 3, "replies": []}, {"body": "Wow thank you", "score": 3, "replies": []}, {"body": ".", "score": 3, "replies": []}, {"body": "Absolutely incredible! Now I just have to figure out what it all means! Thank you for all your time and effort!", "score": 3, "replies": []}, {"body": "Noice, did you follow his spreadsheet tutorials by chance?", "score": 3, "replies": []}, {"body": "Insane AMOUNT of work 🙀", "score": 5, "replies": [{"body": "Yes.", "score": 4, "replies": []}]}, {"body": "Very nice", "score": 4, "replies": []}, {"body": "OP - we do not deserve you:)", "score": 2, "replies": []}, {"body": "Great work mate!!!", "score": 2, "replies": []}, {"body": "This is amazing. Thank you for sharing. Keep up the great work. I bet if you throw a patreon link on here somewhere people would gladly donate to help support and fund a project like this.", "score": 2, "replies": [{"body": "You're probably right, but I'd prefer not to do something like that. This isn't about self-promotion, and r/investing already perm-banned me for posting the sheets there as they considered it self-promotion. 🤷‍♂️", "score": 2, "replies": [{"body": "Wow, really?? I wouldn’t think just sharing them would be considered self-promotion… that’s a bit ridiculous.\n\nBut hey; if you’re enjoying doing what you’re doing, and feel kind enough to share your progress and work with all of us here.. we all thank you very much.", "score": 1, "replies": []}]}]}, {"body": "So good", "score": 2, "replies": []}, {"body": "Thank you kind OP for these Smartsheets", "score": 2, "replies": []}, {"body": "Thank you for taking the time & effort to create this. It looks like an incredible undertaking. My efforts pale in comparison!", "score": 2, "replies": []}, {"body": "thank you is there a tutorial on how to use this?", "score": 2, "replies": [{"body": "Sort of. You can watch the [Roaring Kitty Spreadsheet video](https://youtu.be/7wjWnMcdnlQ) since these sheets are based on those.", "score": 1, "replies": []}]}, {"body": "HODL APES BANANAS COMING 🍌.", "score": 2, "replies": []}, {"body": "Wow!!! Gonna check everything. Thank you ape!!", "score": 2, "replies": []}, {"body": "what is DFV?", "score": 2, "replies": [{"body": "u/DeepFuckingValue aka Roaring Kitty aka Kieth Gill", "score": 2, "replies": []}, {"body": "**The DFV is an internal combustion engine that was originally produced by Cosworth for Formula One motor racing. The name is an abbreviation of Double Four Valve, the engine being a V8 development of the earlier four-cylinder FVA, which had four valves per cylinder.Its development in 1967 for Colin Chapman's Team Lotus was sponsored by Ford.**\n\nMore details here: <https://en.wikipedia.org/wiki/Cosworth_DFV> \n\n\n\n*This comment was left automatically (by a bot). If I don't get this right, don't get mad at me, I'm still learning!*\n\n[^(opt out)](https://www.reddit.com/r/wikipedia_answer_bot/comments/ozztfy/post_for_opting_out/) ^(|) [^(delete)](https://www.reddit.com/r/wikipedia_answer_bot/comments/q79g2t/delete_feature_added/) ^(|) [^(report/suggest)](https://www.reddit.com/r/wikipedia_answer_bot) ^(|) [^(GitHub)](https://github.com/TheBugYouCantFix/wiki-reddit-bot)", "score": -1, "replies": []}]}, {"body": "Noice", "score": 2, "replies": []}, {"body": ". ❤️", "score": 2, "replies": []}, {"body": "This is goddamn beautiful. Happy to help with anything tech related you might need/if yo ever need a helping hand, feel free to DM!", "score": 2, "replies": [{"body": "Thanks! Any chance you have experience with Google Apps script?", "score": 1, "replies": [{"body": "Ah i wish i’ve been meaning to learn java. Might actually be soon, trying to get a way to connect personal excel spreadsheets with discord’s API. Could actually prove useful to some of the things you’re tracking", "score": 1, "replies": []}]}]}, {"body": "Nice work", "score": 2, "replies": [{"body": "Thanks. I'm glad you appreciate it!", "score": 1, "replies": []}]}, {"body": "good work", "score": 2, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "wow.. is this for real?", "score": 2, "replies": [{"body": "I hope so. It has sure taken up a lot of my time. LOL", "score": 2, "replies": []}]}, {"body": "Thanks for the great work you are doing", "score": 2, "replies": []}, {"body": "This is great. I've been looking for some content to keep me busy this winter. I miss the RK streams so much. Really hope they come back when this whole thing dies down.", "score": 2, "replies": []}, {"body": "Mhhh, is it normal that there is no data at all?", "score": 2, "replies": [{"body": "There is no data being imported right now because I needed to free up resources for version 0.7. \n\nHowever, I will turn it in now and let it run for a day.\n\nYou can also make your own copy,  follow the setup instructions, and it will work.", "score": 2, "replies": []}]}, {"body": "God Bless you for all the hard work you put into it .", "score": 2, "replies": []}, {"body": "that's beautiful 💙", "score": 2, "replies": []}, {"body": "Just want to pop in and say thank you.", "score": 2, "replies": []}, {"body": "great stuff", "score": 2, "replies": []}, {"body": "Have built a platform inspired by RC.  Saves having to recreate RCs sheets and automates the data updates - you can actually focus on the analysis!  [Check it out](https://shareselector.com/shareselector) and if your interested [email for a login](https://shareselector.com/pilot/).", "score": 2, "replies": []}, {"body": "Price sheet has an issue. It is so slow that browser does not response and closes it.  Any solution?", "score": 2, "replies": [{"body": "Some folks have success opening the prices sheet with the sheets app on their phone. Then make a copy, link it to your tracker, and close it. You should never have to open it again.", "score": 1, "replies": [{"body": "I tried it.  Having the same problem  Would this be due to tryong to access some private web sites or very frequent web updates? Would it be possible to remove such cell and upload a copy with a different name?\n\nBTW. Thanks for these.  It looks great.  Looking forward to dive in.", "score": 1, "replies": []}]}]}, {"body": "Nice", "score": 4, "replies": []}, {"body": "Is this hooked up to receive live data? What's the delay like?", "score": 3, "replies": [{"body": "The is coming from Google Finance and Yahoo Finance so it's as live as those sources. Google says their quotes can be delayed for up to 20 minutes. I'm not sure what Yahoo says in their disclaimer. \n\nI'm primarily a value investor though and looking for stocks to research. I do most of my research while markets are closed so I'm usually not too worried about the data being a little old.", "score": 15, "replies": [{"body": "Love the work you put into this!", "score": 4, "replies": []}, {"body": "In my experience 20min is more of a disclaimer. Reality is < 1 min 99% of the time.", "score": 7, "replies": [{"body": "How is this getting data so quickly?", "score": 1, "replies": []}]}]}]}, {"body": "You're a saint!", "score": 4, "replies": []}, {"body": "Saving this post", "score": 3, "replies": []}, {"body": "Yup gonna hit that save button on this one....take my upvote you overachiever!\n\nEdited to correct stupid autocorrect crap", "score": 3, "replies": []}, {"body": "awesome tools", "score": 2, "replies": []}, {"body": "Hey - do you have a more recent version than this? I have been looking into building something very similar! I'm so excited to stumble upon this. What an amazing amount of work you're put into this. Wow. Thank you <3", "score": 1, "replies": [{"body": "I found v7! Thanks again. I also joined the discord and hope to be able to get my hands dirty and help build. Cheers!", "score": 1, "replies": []}]}, {"body": "The Yahoo Finance API stops working. Any fix for it? Thanks!", "score": 1, "replies": []}, {"body": "Cheers OP ur the best!", "score": 1, "replies": []}, {"body": "Thanks op!", "score": 1, "replies": []}, {"body": "Whoa", "score": 1, "replies": []}, {"body": "Will check out", "score": 1, "replies": []}, {"body": "Thank you for this", "score": 1, "replies": [{"body": "No problem. I hope you find it useful!", "score": 1, "replies": []}]}, {"body": "Thank you", "score": 1, "replies": []}, {"body": "I don’t have time to look fully, but from what I can see this is pretty damn useful, thanks OP", "score": 1, "replies": []}, {"body": "Holy", "score": 1, "replies": []}, {"body": "Looks great, thanks for making it and sharing it", "score": 1, "replies": []}, {"body": "Just amazing", "score": 1, "replies": []}, {"body": "Amazing! Thanks so much.", "score": 0, "replies": [{"body": "No problem! I hope you find these useful!", "score": 2, "replies": []}]}, {"body": "Can you include data about the recent investment activities of national politicians (e.g. House Representatives and Senators)--similar to what Unusual Whales does?", "score": 1, "replies": [{"body": "Hmmm... maybe. Can you provide a link to a resource? I'll take a look but it may take a while to integrate something like that.", "score": 1, "replies": []}]}, {"body": "Well done!! Thanks so much for sharing!!", "score": 1, "replies": []}, {"body": "Great Sheet!  Is anyone else having a little trouble linking the tracker to the stock universe?", "score": 1, "replies": [{"body": "What's the problem you're having?", "score": 1, "replies": [{"body": "Thanks for the reply!  I'm just having issues linking the tracker to the universe.  I keep getting the \"Universe sheet is linked. However, if you see \"#REF!\" below then this sheet does not have access to the data. Click below cell (B9) to grant access.\"  I've clicked the b9 cell to grant access but can't get it to to pull in the data.", "score": 1, "replies": [{"body": "Check the \"setup\" tab. There should be a checkbox in the far upper left. Make sure that is also checked.", "score": 1, "replies": [{"body": "Thanks!!!!", "score": 1, "replies": []}]}]}]}]}, {"body": "This is really amazing, thanks so much for developing this! I have one question: When I submit a ticker to the db, I see the stock appearing in the db, but there is an error for e.g., the price of this stock. Did you have such an experience? Why can this happen? \n\nThanks a lot!", "score": 1, "replies": [{"body": "There is currently an issue with v10 of the Yahoo Finance API after Yahoo decided to limit access. I've done some work to revert to the older v6, but it will be a while before I have something others can use.", "score": 1, "replies": []}]}, {"body": "Nice", "score": 1, "replies": []}]}
{"title": "TSLA at a 332x P/E ratio.... At what point are these tech valuations ridiculous, does it even matter?", "selftext": "[removed]", "id": "qgblya", "created_utc": 1635269605.0, "score": 233, "upvote_ratio": 0.92, "num_comments": 146, "comments": [{"body": "The PE ratio has been cutting in half almost every quarter. The growth in revenue and profits is so high that looking exclusively at pe is dumb. I made the same mistake wirh Amazon a decade ago thinking their 300 pe was high and then ignoring 50-70% growth rates.", "score": 200, "replies": [{"body": "Yeah, but back then Amazon wasnt worth a trillion dollars like Tesla is today.", "score": 10, "replies": [{"body": "But back then their weren’t any trillion dollar companies either. Times have changed a bit.", "score": 12, "replies": []}]}, {"body": "[removed]", "score": 23, "replies": [{"body": "If the P/E wasn't so high, you'd be creating other \"problems\".  Consider:\n\nSome people seem to think TSLA's P/E should be pegged at ~10. That would mean their share price would have been OTC for ~12 years, then grow 5x-10x per quarter over the last couple of years.  Consider what that would have done to the options market.  Every contract would either be worth $0 or make you a millionaire.\n\nStock markets, however, are forward looking.  We can all see that it won't take too many more \"P/E halvings\" before Tesla is \"normalized\" so we buy it up.", "score": 24, "replies": [{"body": "Its not gonna keep halving the pe tho.", "score": 0, "replies": [{"body": "Tesla produced 499K cars in 2020. They are going to produce 900K this year from the looks of it. That is an 80% increase in vehicles produced and sold, with two more factories going live in a few months. \n\n&#x200B;\n\nThere profit margins are increasing as well. The upcoming 4680 battery is 69% cheaper than the current battery they use, more profit margins\n\nThe P/E can keep going down, it just depends on the stock price. But one thing is for sure, Tesla revenue and profits will keep climbing when you go from 2 factories to 4.", "score": 6, "replies": [{"body": "And who says ppl will keep buying their overpriced shitty cars?", "score": -4, "replies": [{"body": "Jealousy is not a good look my guy 😊", "score": 3, "replies": [{"body": "Ahh, you are a wsb autist. That explains everything, on the blocklist you go", "score": 0, "replies": []}, {"body": "What part of my comment made me look jealous you fucking ape? \n\nI didnt say its expensive. I would buy a car for that price, but not a garbage one like tesla", "score": -1, "replies": []}]}, {"body": "And who says people won't keep buying their cars?\n\nYour personal opinion on if they are overpriced and/or shitty doesn't affect everyone else's opinion of them.\n\nHave you ever thought that your opinion is a minority opinion and that they may sell millions a year?\n\nLook at Kia, I bet you think they are shitty cars but they sell over 2.5 million a year.", "score": 2, "replies": [{"body": "You are a fucking clown, im not gonna bother with you", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Clown", "score": -1, "replies": []}]}]}, {"body": "Can you please lay out the revenue/production/market share projection by which this valuation is not ridiculous?", "score": 1, "replies": []}]}, {"body": "Yes it does. Tesla is trading at 3-5 years of the future of itself. These people think things just go up. Nope earnings have to follow. They will come slowly and stock is up way too much. I would wait for it to go down a bit.", "score": 3, "replies": [{"body": "It's not gonna go down!", "score": -2, "replies": []}, {"body": "Question. I'm a noob at the stock market. So buying into a high p/e ratio stock means that you're betting on the company doing well many years from now? The higher the p/e ratio the more the company's valuation is a projection of where it will be many years from now, and not where it currently is?", "score": 1, "replies": [{"body": "Stock market trades in the future not past. Looking at its history to predict the future is useless.", "score": 1, "replies": [{"body": "Got it. But a high p/e ratio stock will tend to be a more long-term investment to justify buying it?\n\nwhereas if you were to bet on a stock with a p/e ratio of only 20, it's valuation is more grounded in the present and derived from present earnings?", "score": 1, "replies": [{"body": "All stocks trade in future. If Pe is 20 then the earnings will grow modestly maybe 10% or so. Sometimes PE is 2 but earnings are probably on a decline - these are value traps.", "score": 1, "replies": []}]}]}]}]}, {"body": "Look at PEG ratio", "score": 4, "replies": []}, {"body": "Looking at P/E is an indicator but look at the real world.  Elon Musk is not part of the \"evil cabal\" of billionaires. (1)  Breakthrough Energy is buying up all the new energy patents and new energy companies. Hydrogen will take off in aviation and it may also be for cars.  Elon is only invested in one kind of battery, the Lithium battery.  Elon is  risky not just in P/E.\n\n(1)https://www.breakthroughenergy.org/investing-in-innovation/bev-board-and-investors", "score": 1, "replies": []}]}, {"body": "Very high P/E means there is more risk because you are paying for profits that are uncertain because they are so far off in the future.  Even moreso for a company like Tesla that seems to be getting a lot of it's current value from revenues streams that currently do not or barely exist right now, and are not gauranteed to ever return much if anything.\n\nTesla may indeed successfully grow into its valuations and make the risk-taking investors a lot of money,.  Just please be aware that there IS a lot of risk, and so you'd better be getting a potential high level of return for it.", "score": 5, "replies": []}, {"body": "This exactly. Every single time one of these posts comes up about Tesla's current p/e or fwd p/e. Earnings are catching up at an incredible rate. Use longer than current p/e or TTM, the growth is insane.", "score": 2, "replies": []}, {"body": "Cool. But TSLA would have to increase their profits 500% in the near future to justify this P/E. \n\nWhich would be possible if they were a software or service company, (like Amazon) which scale much easier and have high margins.\n\nTSLA makes cars, a low margin business with a long lead time and heavy capex required for manufacturing.\n\nThe only thing that could justify this is full self driving technology, but TSLA is not cracking that any time this decade.", "score": 2, "replies": [{"body": "They have some of the highest margins on vehicles out of any car manufacturer. \n\nAnd they are also a software as a service company as well. Lol", "score": 5, "replies": [{"body": "“Out of any car manufacturer” is the key part of that sentence.", "score": 2, "replies": [{"body": "Is Apple only a cell phone company? \n\nyour post is meaningless", "score": -4, "replies": [{"body": "Make this meaningless analogy again when TSLA has 1/1000th of the features/services/products Apple has.\n\nI’ll be waiting quite some time.\n\nMy post may have been meaningless but that comparison is downright insanely delusional.", "score": 0, "replies": [{"body": "Amazon just sells books too.", "score": 0, "replies": [{"body": "Interesting thought . when AMZN ipoed its stock was $2 a share in 1998.  Imagine someone buying 1000 shares what they'd have now?!", "score": 1, "replies": [{"body": "Imagine how many people said, “oh but people want to buy books and CDs at a Barnes n noble o me Ticketmaster” they have nothing much to offer", "score": 2, "replies": []}]}]}, {"body": "A Tesla is basically a computer on wheels. Anything an iPhone can do, a Tesla can do 10x better.", "score": -2, "replies": [{"body": "I’m not sure if you are ignorant of how Apple makes money, trolling, or just an idiot.", "score": 3, "replies": [{"body": "It sounds like you are the confused one. Let us know when you get your thoughts sorted out.", "score": -3, "replies": [{"body": "Ouch. Don't normally see such spiteful tones in this subreddit. Probably means pe is going up", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "The auto industry is one of the world's most profitable.   It doesn't seem like it today because those profits are split up between unions,  dealers,  suppliers and financing companies.  Tesla averaged 8000 dollars profit per car sold this quarter.   If he increases his numbers to 1 million a quarter,  4x growth but only 6 percent of the auto market,  he'll have higher profits than Apple.", "score": 2, "replies": []}, {"body": "They dont have to justify anything! People worship Musk and are willing to pay up to become rich!", "score": 1, "replies": []}, {"body": "Question. I'm a noob in the stock market. How did you calculate that they need to increase their profits by 500% in order to justify their current valuation?", "score": 1, "replies": [{"body": "To reduce a companies P/E by half. Profit needs to double at the same stock price.\n\nThe standard P/E for a manufacturing/retail company is in the range of 15-20. This number has a legitimate mathematical basis as being considered fair value for a stock.\n\nAt the time of this post TSLA had a P/E of 300(?, iirc)\n\n300 - 150 - 75 - 37 -18\n\n100% - 200% - 300% -400%- 500%", "score": 1, "replies": []}]}]}, {"body": "yeah, but that was amazon purposefully reinvesting for years, making their eps look bad. now tesla has just turned profitable after years of maximizing their profitability, how do these two examples compare at all?", "score": 1, "replies": [{"body": "Tesla has been reinvesting all of their profits also...", "score": 3, "replies": []}]}, {"body": "why is everybody ignoring these growth rates in US cannabis then?", "score": 0, "replies": []}, {"body": "We all made mistakes.", "score": 1, "replies": []}, {"body": "Let's hope you didn't buy in the last 7 months 😬", "score": 1, "replies": [{"body": "Over 5 years ago. Been through many Tesla dips. More worried about the few high growth/ zero profit stocks I own.", "score": 1, "replies": []}]}]}, {"body": "We had these same threads when they had no PE. Then when they had a 2000 PE. Then at 1500PE. Now it’s 332 with a forward PE of 150. \n\nSee the trend?", "score": 70, "replies": [{"body": "P/E is not linear. To get down to a 22 P/E it requires 500% growth in profit. Which is more than the 300% growth it took to drop it from 2000 to 500.\n\nDiminishing returns are thing as well. It’s a hell of a lot easier, especially for a manufacturing company, to grow from no profit to decent profit, than it is to go from decent profit to “holy shit they make how much?!”", "score": 13, "replies": [{"body": "Who cares? As long as the stock goes to $2500 I double my money and then sell 50% or whatever.\n\nSo you put $10k in, make $10k and sell!", "score": -2, "replies": [{"body": "That’s the entire point, it’s not going to 2500 …\n\nWell I know why you are old and poor I guess.", "score": -4, "replies": [{"body": "Wrong! It'll easily go to $2500.  Sit back and watch.  Guess you missed out. You'll have to wait till it crashes to $200 again.  That may be in 100 years maybe.", "score": 0, "replies": [{"body": "Plenty of other places to make money besides gambling on TSLA, I’m doing just fine.", "score": 2, "replies": [{"body": "Me too.  I only have 2.9% in it, but I'll ride the momentum for a while. I'm already up 27% in a couple weeks.\n\nI've got a lot of my portfolio in UNH HD SHW ODFL and other stocks.", "score": -1, "replies": []}]}]}, {"body": "You or I don't know if it'll hit $2500, but guys on CNBC are already mentioning it and sayimg 8t could happen by years end.\n\nI dont care either way. I'm just gonna hold my 2.9% position for at least a year", "score": 0, "replies": []}]}]}]}, {"body": "still high af for a trillion dollar company", "score": -7, "replies": [{"body": "For a typical company, sure. Tesla’s growth projections are very high, though. So we might be seeing a PE of 35 in 6 years.", "score": 1, "replies": []}]}]}, {"body": "Tech companies are all about future project speculation and not past and current sales. This is a fundamental shift in approaching businesses. \n\nGiven the fact the extra liquidity these companies are enjoying due to crypto is a major contributor. \n\nTesla is overvalued definitely, but there has been no significant catalyst produced to provide proof of doubt a out its future projects. They just do very well to keep it under the rug. \n\nJust like FB one would need whistleblowers to correct their overgrowth. This is too much market utilisation for a single energy company.", "score": 17, "replies": [{"body": ">whistleblowers to correct their overgrowth. This is too much market utilisation for a single energy company\n\neven with the whistleblower item out in the open, FB is doing pretty well.", "score": 2, "replies": [{"body": "Give it some time as more information is revealed. Tighter regulations on the inner and outer working of Tech and consumer retail is a need of the hour.", "score": 1, "replies": []}]}]}, {"body": "Everything is overvalued rn", "score": 6, "replies": [{"body": "This was true 6 mo ago.  Not true now.  Unless you mean BEV companies.   Then yeah.  Oh hell yeah.", "score": 1, "replies": []}]}, {"body": "You are trying too hard. Fundamentals haven’t mattered for years.", "score": 34, "replies": [{"body": "Just because you don't understand them doesn't mean they don't matter", "score": 9, "replies": [{"body": "Don’t hate the player, hate the game.", "score": 3, "replies": [{"body": "Lol you're hating the game. The market has rewarded amazon, Google, Microsoft with high valuations. People said the valuations didn't make sense back in 2014. However,, turned out they did make sense. The market predicted perfectly well the strong growth of these companies", "score": 1, "replies": []}]}, {"body": "They dont matter with TSLA! Fomo and momentum matter!", "score": -1, "replies": [{"body": "Tesla is growing into its valuation though", "score": 5, "replies": []}]}]}, {"body": "Right. Who gives a crap as long as you double your money.  Then you sell if the company goes to crap. Easy.", "score": -1, "replies": []}]}, {"body": "Stocks are just the present value of future (subjective) cashflows. \n\nThe terminal value (cash flows further in the future) are still valuable in the present even if current year's earnings are low. This is what causes high PEs.", "score": 4, "replies": []}, {"body": "Tesla had tremendous growth and it's PE has systematically gone down DESPITE the price appreciation.\n\nTesla is a pure growth play. You're not investing in it's current fundamentals, but it's ability to reach those attractive fundamentals through growth while capturing the risk premium of going in before it got there.\n\nOf course, this implies an ability to generate growth. Should tesla fail to do so, investors will be penalized", "score": 11, "replies": []}, {"body": "$TSLA is an Energy play.", "score": 17, "replies": [{"body": "Also a software play. Energy will definitely play a huge role in the company in 2050, however by that time (I believe) fsd will take over which will cause massive margin expansion. tesla is an innovation play - first it was EVs, now FSD, next solar/energy. Companies like Tesla that consistently focus on ways to improve are qualities that keep a company around a long time.", "score": 8, "replies": []}, {"body": "[removed]", "score": 4, "replies": [{"body": "Musk is committed to solving energy storage. I think his people are most likely to do that. Whoever does, whether it’s Tesla or someone else, will see incredible growth and fill that ratio with explosive and sustained earnings.", "score": 15, "replies": [{"body": "Uhmmm Bitcoin?", "score": 2, "replies": [{"body": "Energy storage != arbitrary, inefficient, energy sink, regardless of its utility as a secure public ledger", "score": 1, "replies": []}]}]}]}, {"body": "I thought it was cars, or batteries? or is it tech? or insurance? or FSD licensing? I always forget how TSLA is going to be making it's trillions in revenue soon.", "score": 4, "replies": [{"body": "Don't forget nationwide charging network and autotaxis once they get the FSD fully functioning.\n\nSolarCity for the solar roofs that they backburnered alongside the semi-trucks and cybertruck.\n\nTSLA has a lot going on but most of this is years away from fruition. Price has really gotten ahead of itself.", "score": 3, "replies": [{"body": "Yeah Elon said we would have a fleet of robot taxis jn q4 2020, just waiting on regulatory approval of course.\n\nAh yes, solar city. The bankrupt company belonging to his family member that he help bail out and almost making TSLA bankrupt in the process. Also, has provide 0 returns in value since it’s acquisition", "score": 0, "replies": []}]}]}, {"body": "Also a software play. Energy will definitely play a huge role in the company in 2050, however by that time (I believe) fsd will take over which will cause massive margin expansion. tesla is an innovation play - first it was EVs, now FSD, next solar/energy. Companies like Tesla that consistently focus on ways to improve are qualities that keep a company around a long time.", "score": 1, "replies": []}]}, {"body": "Tesla is growing into their p/e ratio at a good pace.", "score": 7, "replies": []}, {"body": "„These“ tech. Tbh it‘s just Tesla and Tesla writes its own story.", "score": 3, "replies": []}, {"body": "“In the short run, the market is a voting machine but in the long run, it is a weighing machine.” \n\n- Mr. Graham\n\nI wouldn’t even worry about their evaluation… it will either come out as true or it will faultier… just stick to what you know and feel comfortable with and ignore the noise.", "score": 3, "replies": []}, {"body": "I didn’t think PE had any meaning anymore.", "score": 2, "replies": []}, {"body": "I don’t care about PE ratio and all that crap.. just make some money!", "score": 2, "replies": [{"body": "Right!", "score": 1, "replies": []}]}, {"body": "Nobody cares about PE anymore. It’s irrelevant for the big tech giants. It’s such a lazy way of thinking to just draw a line on historic PE’s and say this is where it should be because this is where it’s been in the past. Tech giants have almost limitless growth, they are immune to lots of the analysis and scrutiny we apply to other stocks.", "score": 2, "replies": []}, {"body": "Tesla is the canary in the coal mine. Tesla isn't worth a trillion, or to be included with the likes of Microsoft, Apple and Google. The speculative bubble bursting is probably going to start with Tesla and hit bitcoin and everywhere else people are just punting, and will be triggered by interest rate hikes to combat inflation. All these SPACs, shitcoins and a large part of the tech sector is going to be in trouble when having debt costs money again.", "score": 4, "replies": [{"body": "Wrong!", "score": 2, "replies": []}, {"body": "As long as your company can service the debt, you're paying it back with future dollars worth less due to inflation and keeping/investing/harnessing the difference. \n\nInflate your debt away?", "score": 1, "replies": [{"body": "If interest rates go up and inflation drops accordingly then you can't, but people have said for this reason and the piling national debt the Fed won't hike rates. That will just inflate away everyone's paychecks and lead to a whole bunch of other crises imo, but maybe that's what they'll do.", "score": 1, "replies": []}]}]}, {"body": "Dude it was at 1000 before , its a great gap lol hahha", "score": 2, "replies": []}, {"body": "What’s the thing about P/E ratio?? Do people just blindly follow books or whoever told them to only look at P/E ratio ?", "score": 2, "replies": []}, {"body": "Also take into account the following. Look at what happened to that trump spac.", "score": 1, "replies": []}, {"body": "It will only matter when it comes crashing down.   Every car manufacturer in the world is in the EV game now and they have a far superior production model and experience with actually building cars.    Better options.   Better prices.   Better built.  And it will only get worse for tesla.  \n\nTeslas are sort of ugly to boot tbh.\n\nThere is nothing special or unique about tesla today.  It is not 3 years ago.   If they don't make huge advancements in their battery tech to keep some sort of edge PE will matter quite a lot.   Best of luck to all you bag holders out there.  Get out before the fall is my advice.  Its fall might not be right away but you do not own the next ford.  You can do well in the short run maybe but its not a forever hold.", "score": 0, "replies": [{"body": "Just sold at 900. Will get back in at 700.", "score": 2, "replies": [{"body": "Not gonna happen.  TSLA is at $1030 right now.", "score": -1, "replies": [{"body": "You think like trader. So maybe you cannot wait but I can.", "score": 1, "replies": [{"body": "I'm active yes, but a lot of my stocks are long term.  MSFT GOOGL NVDA AAPL UNH SHW ODFL ASML etc.", "score": 1, "replies": []}]}]}]}]}, {"body": "Look at the comments. These idiots are like a fucking cult with 0 clue about how anything in the world works let alone the stock market", "score": 0, "replies": [{"body": "Does it matter if you made $100k from TSLA and now you're up $100k? No.", "score": 0, "replies": [{"body": "You can money from gambling, its just not smart. Whats your point?", "score": 1, "replies": [{"body": "It's easier with TSLA.  TSLA isn't scratching lottery tickets!", "score": 1, "replies": []}]}]}]}, {"body": "Boomer my ass.\n\nGameStop-esque Meme stocks driven wild by ignorant “muh gainz” and “duh futuuuuurre” speculation supercharged by idiotic policies of current administration and the Fed.\n\nMusk is a visionary but if even he is surprised by these increases then sober people should take notice.", "score": -7, "replies": [{"body": "Monetary policy is not linked to an administration as the Fed is supposed to be independent. But Trump put Powell in office, and then complained the Fed was not easy enough. The previous administration is technically responsible for current Fed policy. \n\nI am not a Biden fan btw", "score": 3, "replies": [{"body": "Agree. Not supposed to be. \n\nI was referring to stimulus payments, taxation, federal spending although I guess persistent near zero fed IR could also be a contributor. Perhaps I used the wrong term.", "score": 0, "replies": []}]}, {"body": "The idea that the surge in GameStop was caused by YOLO millennials with $1,200 stimulus checks is just insane if you look at the math. Maybe instead of calling em “ignorant” you may want to look into how market makers use latency arbitrage to grossly manipulate stock prices and see how that idea may also apply here to Tesla.\n\nIdk, just an ignorant millennial here who watched IEX and the SEC spank Citadel in a hearing over this exact issue yesterday. Dumb money I guess", "score": 3, "replies": [{"body": "Correct me if im wrong, was the SEC paper saying actually retails was a lot responsible for the gamestop price rise?", "score": 2, "replies": [{"body": "I think you’re referencing the SEC report, which did credit “sentiment” with the price surge in late January without really getting into the weeds in terms of the plumbing of the market.\n\nCitadel sued the SEC over IEX’s new order type, for which arguments were made yesterday in DC (which is what I was referencing in my above comment). \n\nI guess my point about millennial YOLO meme stocks is better stated in comparison to 2008: sure, a bunch of people took on mortgages that they most certainly didn’t qualify for and likely didn’t understand the terms of, but are they really to blame for the blow up in mortgage backed securities?", "score": 1, "replies": []}]}, {"body": "I’d rather avoid labeling people altogether and overgeneralizations based on age are foolish but that’s a two way street.", "score": 2, "replies": [{"body": "Couldn’t agree more", "score": 2, "replies": []}]}]}, {"body": "Trump put Jpow in charge and started the current policy trends. Tax cuts didn’t help either. Imagine thinking millennials are driving the market or are even the primary driver of the meme tickers. You just outed yourself as someone who has no idea what’s going on or how things work.", "score": 1, "replies": []}]}, {"body": "ARK sold up a bunch of Tesla across their ETFs last night according to their daily email update. Cathy is bullish on Tesla but even they know the current price is a crazy price", "score": 0, "replies": []}, {"body": "Tesla is an overvalued joke. Musk is an incompetent twat. And I think his one skill beyond bullshitting investors is whipping his employees to “success.” \n\nWith that said I won’t deny the stock does well. So I gonna go for the ride. I don’t invest into a company because I believe in it. I just do it to make money.", "score": -2, "replies": [{"body": "And he's rich! Ahahhaa", "score": 0, "replies": [{"body": "Just like Bezos", "score": 1, "replies": []}]}]}, {"body": "It’s all an illusion boys, don’t take it too seriously", "score": 1, "replies": []}, {"body": "What's the P/E ratio of the stock market?", "score": 1, "replies": []}, {"body": "You shoulda been here a year or two ago, shit was at 1500 PE.", "score": 1, "replies": []}, {"body": "I don't think people truly understand what's happening here. None of it's mattered since they joined the s&p500.", "score": 1, "replies": []}, {"body": "300 p/e only? it used to be 1000+", "score": 1, "replies": []}, {"body": "I hope it drops tomorrow", "score": 1, "replies": []}, {"body": "Shouldve bought it at 2000 PE instead of keep complaining. If it retained that price till now anyone would invest in it because its growing super fast and value at the same time (low risk super high reward).", "score": 1, "replies": []}, {"body": "Shut the fuck and look at the 0% interest rates and ‘not QE’. It’s not that complicated Jesus Christ", "score": 1, "replies": []}, {"body": "PE ratio sounds like gibberish.", "score": 1, "replies": []}, {"body": "Amazon didn’t even make a profit for years.. PE ratios mean nothing in a business like this.", "score": 1, "replies": []}, {"body": "Yes it matters because stock valuation is not arbitrary. It’s based off the value a company can return to shareholders in the future and therefore based on profits.\n\nCould TSLA justify its P/E, sure. But I’m not betting on them owning the vast majority of the car market or cracking self driving vehicles first.", "score": 1, "replies": []}, {"body": "Blackswan who knows & decides. If it is cut in half it still would be over 100x earnings insanity.", "score": 1, "replies": []}, {"body": "The bear argument is that Tesla is a car company and a software company and a remarkably capable hardware company and a solar company and a power utility company.  But I think the big play here is batteries.   Everyone’s got batteries.  Ford, GM, VW, Toyota.  But do they?   Do they have batteries at production scale?   Tesla is producing car size batteries more than 10x faster than anyone else including Nio.   For the next 5 years, at least, the EV wars will be fought and won with batteries.", "score": 1, "replies": []}, {"body": "While PE is always an interesting metric to look at, it can be somewhat irrelevant for growth stocks that are more or less reinvesting all of their revenue and potential profit into, well, growth.  GOOG and AMZN are good examples, although they now have amazing earnings.  I think for big growth tech stocks, it's probably more useful to look at the PS ratio and you can then extrapolate what potential earnings will be based on their industry.  Either way, TSLA is at something like 25 price to sales ratio.  Does it make sense to you that a) you should buy a company at 25 times their current total revenue or b) do you believe their revenue will double, then double, then double, then double once again to bring it in line with the historic averages of the auto industry?", "score": 1, "replies": [{"body": "Auto industry p/s ratios are generally between .5 and 1 meaning that the market cap is less than their annual revenues, as opposed to TSLA being 25x their annual revenue.", "score": 1, "replies": []}]}, {"body": "On the day of the IPO Warby Parker reached a five Billion dollar valuation. Hows that for ridiculous?", "score": 1, "replies": []}, {"body": "Value is what people are willing to pay. Forget pe!", "score": 1, "replies": []}, {"body": "Just buy a Tesla already. Once you do, everything will start to make sense.", "score": 1, "replies": []}, {"body": "Don’t worry. It will go down when you finally give in and buy", "score": 1, "replies": []}, {"body": "Tesla was down in the 600-700 most of the year. Should have bought some son.", "score": 1, "replies": []}, {"body": "Tesla and Bitcoin are currently pyramid schemes.", "score": 1, "replies": []}, {"body": "This is why I think that the day when it will become evident that Tesla is nowhere near this value, the evaporating hundreds of billions may be the next Lehman moment.\n\nIt became too big to burst.", "score": 1, "replies": []}, {"body": "In 10 years it’s still going to be this high. Grow mfer", "score": 1, "replies": []}, {"body": "Lmao I know right - this market is just just truly autistic", "score": 1, "replies": []}, {"body": "PE means nothing when the profits are growing exponentially. It used to be 600. \n\nHeck, Amazon had a 600 PE ratio like 5 years ago, look now", "score": 1, "replies": []}, {"body": "Retail piling into a bubble market, could continue higher but for me the writing is on the wall.\n\nFrom trad fi to crypto it seems like people are just buying memes and things they like with little regard to value or any kind of thesis….gambling basically.\n\nLast time this happened we had about a quarter before the market went to shit, so I’m now preparing to sell a lot of assets to usd", "score": 1, "replies": []}, {"body": "400 PE I will buy put", "score": 1, "replies": []}, {"body": "As others have pointed out, if you only judge companies based on PE ratio, you miss out on a lot of good companies.  \n\n\nP/E is a backwards looking metric. The stock price is typically more forward looking. That doesn't mean the stock price might not be too high. But if TSLA continues to grow its revenue, the stock price will continue to reflect that. Eventually the growth will slow and the stock price will level out.", "score": 1, "replies": []}]}
{"title": "Took my first profit and feel a little bad about it NVDA", "selftext": "Well my NVDA had grown 108% to 6.5% of my portfolio and I woke up debating whether I should trim a little.  \n\nNVDA has been on a great run and I bet in another few months it'll be getting closer to $300, but I felt like I was getting a little greedy and 6.4% was a little much although I love Nvidia and believe its a long term winner.\n\nSo I feel a little bad and a little better now that it's around 5.1% portfolio.  Probably didnt make much of a difference in the long run either way, but to me approaching 7% portfolio seemed a little risky.\n\nThe gains were long so little tax.  I guess we have to take profits once in a while right?\n\nAnyways I feel the market is so stretched right now so I don't feel bad adding to my cash for if we have a correction!\n\nJust wanted to say Nvidia is one of my favorite investments and companies besides MSFT AAPL and stuff.\n\nI'm still officially up 101%.  Should I trim to 4.5% or just leave it be now?\n\nThanks.  Long NVDA!!", "id": "qgaib2", "created_utc": 1635266535.0, "score": 95, "upvote_ratio": 0.83, "num_comments": 184, "comments": [{"body": "NVDA LEAPs are 55% of my self managed portfolio", "score": 90, "replies": [{"body": "That’s about the same for me except I have AMD", "score": 22, "replies": [{"body": "Ooooo green Vs red. Fight fight fight!", "score": 22, "replies": [{"body": "Jokes on y'all I have both.", "score": 5, "replies": []}, {"body": "You wanna throw down? I’ll throw down! \nNah jk, team green kicking serious ass today. I concede", "score": 3, "replies": []}]}]}, {"body": "This guy fuck", "score": 5, "replies": []}]}, {"body": "Nividia is 70% my portfolio. Maybe Im doing it wrong. \n\nOh well I believe in Nividia being here in 10 years. \n\nMy solution is to add more money to diversify, not take away potentially my biggest earner.", "score": 75, "replies": [{"body": "If its a $5k portfolio no.  If it's $100k .... Probably.", "score": 35, "replies": [{"body": "Understandable. I will keep that in mind. Good luck to you :)", "score": 13, "replies": [{"body": "Remember, it's better to hold 1 company you really understand than 10 you just know the basics of. For retail investors, 99% of the risk is in your lack of knowledge, 1% is in the actual companies.", "score": 2, "replies": []}, {"body": "Don't listen to him. Tell Elon Musk who has 75% of his portfolio invested in TSLA what a loser he is...", "score": -28, "replies": []}]}, {"body": "LOL you'll never be a whale thinking like that.", "score": -25, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "There's a lot of basic math that disproves the idea that anything more than 4 stocks \"builds stability\" in your portfolio. \n\nTechnically 2 stocks are all you need to create a systemic risk profile as long as they are typically uncorrected.\n\n4 is ideal.\n\nThe whole 11 sectors and not more than 5% in any one stock of any sector is government regulation to spread the investment wealth to create the stability we all benefit from.\n\nDoesn't mean YOU have to throw your money away doing it.", "score": -8, "replies": []}, {"body": "God fycking damn autotext typo. *UNCORRELATED*", "score": -7, "replies": [{"body": "You know you can edit your original comment right?", "score": 11, "replies": []}]}]}, {"body": "I don't wanna be a whale thanks.", "score": 5, "replies": []}]}]}, {"body": "No, you're not doing it wrong if you're happy with that risk.  I mean, it's been pretty good reward so far.\n\nNVDA is only 4% of my portfolio, I want to add more.\n\nMy highest individual stock is CRWD @ 23%.... but it got there through growth (it was only initially a $10k investment which is now worth $172k).", "score": 7, "replies": [{"body": "Damn nice.  You got into crwd way earlier than me and I thought I was early!", "score": 3, "replies": []}, {"body": "Im okay with the current risk but would like to slowly move to a less risky venture in the future. I've been fairly lucky on my first year of investing with a 250% increase and am worried it will run out. \n\nI played it safe with only investing $2000 (6% of my total savings), as thats all I was willing to lose due to my novice experience AND im a recent college graduate who needs to pay off my loans. \n\nFunny thing is if I did everything I wanted in the last year I'd have over half a mil. Didnt out of fear and dragging my feet. Although, im sure everyone here has a \"what if\" story. On the flipside. I realized I could have lost everything and am happy with the small amount I have made. \n\nIt has a certainly been a fun learning experience.", "score": 1, "replies": []}]}, {"body": "Yes I believe in NVDA also.", "score": -1, "replies": []}]}, {"body": "I bought NVDA at $60 pre split and at $120 pre split I considered selling since it had doubled but I decided not to. I'm still holding and it grew to be more than a third of my portfolio. I'm not selling. Dont sell winners.", "score": 57, "replies": [{"body": "Eh. Eventually you have to sell winners. I see too much runway left to sell NVDA personally, but I don’t blame people that have a different philosophy then I do.", "score": 14, "replies": [{"body": "What runway do you see for Nvidia?", "score": 3, "replies": [{"body": "looks like they're going to be putting chips into cars and self driving etc etc", "score": 1, "replies": [{"body": "Well, earnings is next week. I’m thinking of making a substantial play for that. Should I be wary? Thinking of dropping $1500+ into it.", "score": 1, "replies": [{"body": "I dunno man I am not a cat.... could try dollar cost averaging over a number of days, or half now and half after the announcement. I sold 30% just before the split, and it kept going up... managed to buy back in in a dip just before it shot up at $197. Could easily happen again. Would much rather put money in here than that walking pile of shit that is Facebook. Surely when that crap drops everyone will invest in real companies again.", "score": 1, "replies": []}]}]}]}]}, {"body": "Take profits to reinvest in another potential runner. Don't fall in love with a stock.", "score": 8, "replies": []}, {"body": "~1k post split. Keep riding the train G", "score": 2, "replies": []}, {"body": "I’m not selling either. Bought $8300 worth of the NVDA wayyy back at 32 per.  Now worth 305k", "score": 1, "replies": [{"body": "So no profit taking no nothing? what's your end game? Wait for dividends?", "score": 1, "replies": []}]}]}, {"body": "If I were you I would leave it cause I wouldn’t want any tax despite long term gains and see no real reason to sell.\nThat said, selling it to put it into something more diverse would certainly be prudent.", "score": 13, "replies": [{"body": "I'm holding my cash now for the inevitable correction.  But maybe a 10% correction January .... No one knows 😆", "score": -10, "replies": [{"body": "If you think there’s a correction coming, why not sell everything?", "score": 10, "replies": [{"body": "Because he’s not 100% sure?  All or nothing is rarely a good strategy", "score": 11, "replies": [{"body": "Being 100% invested at all times is optimal for the majority of people", "score": 3, "replies": [{"body": "You just asked why doesn’t he sell everything.", "score": 8, "replies": []}]}, {"body": "Awesome thanks!", "score": 1, "replies": []}]}, {"body": "Cause I'm not a market expert like you sorry.", "score": 1, "replies": []}]}]}]}, {"body": "One of my worst financial decisions was selling nvda as an 8 bagger. If I still held it, it would be a 40 bagger.", "score": 9, "replies": [{"body": "It's not that easy when you don't know the future. It's easy to judge yourself when you have access to data that is now available after you sold.", "score": 8, "replies": [{"body": "This is me after selling about $5k shares of Apple that I bought for $80 when it hit $100 right around the time that the first iPhone came out. In my defense, I’m blame my stupid need to be on Verizon instead of AT&T because I had no iPhone and therefore didn’t grasp just how many of these they were going to sell. 2-4 years later I was just stupid because I was all in on the Android is kicking Apples butt craze because I was only looking at market share % instead of total sales. Sigh, that small investment left alone would be something over $300k right now.\n\nI did buy other stocks and it plus another $5k in my IRA at the time is currently doing quite well. I stay invested and try to only sell when I think I’m worried about a dip continuing and when I want to put money somewhere else instead of it’s up 37%. Taking profits is no longer a reason I use. Putting money somewhere else is what drives my decisions. I don’t usually try to sell to buy the dip because I’m not that good at timing.", "score": 1, "replies": []}]}, {"body": "If your worst financial decision is an 8 bagger... then you must be the god of investing :O", "score": 2, "replies": []}, {"body": "True!", "score": 1, "replies": []}, {"body": "welcome to trading.", "score": 1, "replies": []}, {"body": "Don't beat yourself up. No one ever went poor by taking profits.", "score": 1, "replies": []}]}, {"body": "I have owned Nvidia stock for 6 years. Every time I consider selling, I think about the reason I bought in the first place and if that reason has changed. I bought because they made the best chips in the business, and had plenty of room to grow - they still do and I think it still does!", "score": 8, "replies": [{"body": "What percentage is it of your portfolio?", "score": 1, "replies": [{"body": "Haha it is like 40%. When I was in college I put literally any spare money from my job into NVDA, I think my total cost basis is around $6K and is now worth $50K.", "score": 3, "replies": [{"body": "Awesome! I guess 40% ok as long as the other 60% is diversified.", "score": 1, "replies": []}]}]}]}, {"body": "I have college educationS worth of NVDA in my portfolio. If you believe in the value of what they bring to market long term, why are you letting a percentage number detract from that?", "score": 5, "replies": [{"body": "I don't know.  I like keeping it 5% I guess. We all believe in out stocks but most people like diversity cause you never know.", "score": 2, "replies": []}]}, {"body": "Let your winners run.  This adage applies to NVDA.  IMO.  Lots of upside ahead.  I only trim winners when I’m unsure how long tailwinds will last.  NVDA might face some more hurdles on ARM acquisition but chip demand and being one of main building blocks of the Metaverse tailwinds will keep lifting it for a long long time.", "score": 5, "replies": [{"body": "Thanks. I'm comfortable at 5% now though. MSFT is 10%, but MSFT is a little more stable I feel.  AAPL is 5%.  Between all them it's 20% of my portfolio.  Tech is 50% though!", "score": 2, "replies": [{"body": "Nice picks.  I wouldn’t worry about a few percentage points with those winners.  Let them run and capture long term gains.  Maybe add some TSLA on a 20-30% dip, which does happen with TSLA.  If your non-Tech picks are as good as your Tech picks, you’ll be in great place!", "score": 3, "replies": [{"body": "Non tech UNH SHW HD ODFL TMO ZIM inmd ...\n\nI just added 2.9% TSLA at $830", "score": 3, "replies": [{"body": "Nice picks there too.  Nothing in financial sector FinTech, Credit Cards or Banks.  Just a thought.", "score": 1, "replies": [{"body": "SQ PYPL. No banks yet though. Do I need a bank? What's a good one?", "score": 1, "replies": [{"body": "Personally, I like SQ more than PYPL.  Banks are pretty cheap right now and expected to do well when interest rates rise.  You could put $ in bank ETF , like VF, if don’t want to go all in on specific one.", "score": 1, "replies": [{"body": "Yeah JPM is ok I guess. Financials have never really outperformed the market so thats why I'm hesitant.", "score": 1, "replies": [{"body": "VFH has outperformed the S& P 500 nicely this year and also other times.", "score": 1, "replies": [{"body": "Thats true, but long term maybe I'm just better buying more MSFT AAPL GOOGL and stuff i think.", "score": 1, "replies": []}]}]}]}, {"body": "If you already own SQ, I would rather go with some crypto or a crypto broker like Coinbase, or skip banks altogether. With SQ you're essentially expecting banks to be disrupted. Owning them would just negate part of your gains from SQ if you're right. If you're wrong, the banks aren't necessarily gonna grow and won't make a dent in the losses from SQ. Crypto or especially a crypto broker is a great addition to that, because they're another form of banking disruption.", "score": 1, "replies": [{"body": "I've got $3k between two cryp. Miners. I can't mention their names I guess, but one is now in the sp500 I think and is close to Mary name.  Is cbase a better deal?", "score": 1, "replies": [{"body": "I think miners are also a decent options to be part of the crypto economy without directly owning crypto. Perhaps the advantage of a broker is that they also make money when crypto is doing poorly and Coinbase for example is also joining the whole NFT world soon, but both are probably decent plays. You could watch [this interview](https://www.youtube.com/watch?v=wLI8Ul2-E1g) if you wanna learn a bit more about both. Just don't get distracted by the hair... :P", "score": 1, "replies": [{"body": "Thanks.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "If you believe in Nvidia and think it can continue its growth, why sell? \n\nI mean, you would not get rid of Lionel Messi because he’s too good of a player would you?\n\nI think what I’m trying to say is: if Nvidia grew to such a large position, why not let it grow? Do you need the money right now? Is there anything else you’d like to invest in? Etc..", "score": 9, "replies": [{"body": "I get it but I think in January we may dive and I want some more cash to buy lower I guess. I'm now 20% cash.\n\n\nI also don't really like the idea of being more than 5% in one company unless it's MSFT. MSFT is 10% of my portfolio.", "score": 2, "replies": [{"body": "MSFT is the best", "score": 1, "replies": []}]}]}, {"body": "Never feel bad about taking a profit. I admit it's something that took me a LONG time to do... I did it to pay off my mortgage and don't feel bad about that.", "score": 8, "replies": [{"body": "Yes that was a great idea in your case! We only live once.  I'm conservative by nature!  I just could imagine how bad I feel if I lose 50%!", "score": 1, "replies": []}]}, {"body": "Don’t sell NVDA. Ever. Unless you need the money. This is a buy it for life stock.", "score": 8, "replies": [{"body": "That's what they said about Enron 😆", "score": 6, "replies": []}]}, {"body": "I am selling some nvda today as well, it is good to take some profit sometime.", "score": 5, "replies": [{"body": "Right.  I'm a little sad but I know how things are when we start seeing red and everyone starts panicking again!", "score": 3, "replies": []}]}, {"body": "Nothing wrong with that. I sold half of my NVidia when I reached 125% and same with AMD to recoup initial investment and let the other half run.  They were becoming a bit too heavy in my portfolio (55K each initial investment).  Profit is profit.  Will be doing the same when my TSMC reaches 125% (I'm at around 90% now).", "score": 3, "replies": []}, {"body": "I'm confused as to what ur unhappy about. seems like u planned out ur thought process pretty well and executed. u rebalanced ur portfolio, nothing wrong w that", "score": 4, "replies": [{"body": "Thanks bud!", "score": 2, "replies": []}]}, {"body": "You've just learned a valuable lesson.  Winners keep winning.  Hollllddddd", "score": 7, "replies": [{"body": "I still am ok.  Wasn't a drastic move.", "score": 1, "replies": [{"body": "Don't listen to them. Everyone has their own strategies. I personally thinking selling is a way to ensure profits. I use my ROTH IRA for all my trading. I do day trading in my ROTH and don't pay capital gains. My work pension is all in the total stock market, which allows me to have fun in my ROTH. I primarily invest in companies I believe in long term. NVIDIA is one of those companies. I like to always keep about 10% of my portfolio in circulation. Which means I will buy more of a position than I want to hold long term, just to sell off and profit on the way. I bought into SOFI long-term. When it went down to 14.00 a share I bought twice as much as I actually wanted long term. When it hit $20.00 a share I sold off half of my position, I still believe in it long term but I wanted to take the profits and reinvest. PayPal is now down to $240, I took my SOFI money and placed it into PayPal and doubled my PayPal position. When PayPal hits $300 a share I'll sell half and invest in one of the in other stocks I follow that I believe in, rinse and repeat. Can anyone say this is a bad strategy?", "score": 5, "replies": []}, {"body": "Oh for sure.  You chose a great stock which went up, you're way ahead of a lot of people.", "score": 2, "replies": [{"body": "Thanks bud!", "score": 1, "replies": []}]}]}]}, {"body": "Bad move... NVDA is a winner... I bought a lot in the last dip wishing I bought more", "score": 9, "replies": [{"body": "I am really new to this and just trying to buy a few shares here and there.  Would it be worth it for me to be buy 1 share of NVDA?", "score": 2, "replies": [{"body": "Depends… for short term its expensive right now, i bought at the recent dip around 200 a share… but for long term its a great stock with a lot more upside", "score": 2, "replies": [{"body": "Thanks!  So if I was looking to gain profits in one year then it is probably an expensive buy right now?", "score": 2, "replies": [{"body": "You're not gonna make a lot without a lot of money.  Investing is slow process unless you throw in $100k.  Just buy QQQ etf is better.", "score": 3, "replies": []}]}]}, {"body": "Yes.", "score": 2, "replies": []}]}]}, {"body": "Nvidia is one of the greatest company out there..", "score": 3, "replies": [{"body": "MSFT AAPL? .....", "score": 3, "replies": []}]}, {"body": "I haven’t sold any stocks because I can’t think of any where else to put it, keeping cash is just losing money.", "score": 3, "replies": [{"body": "Not necessarily.  If we get a big dip and I buy in on something and then make 30% on the way back up. If though.", "score": 0, "replies": []}]}, {"body": "I sold a little today too, honestly because it has grown so much I don't like having THAT much of my portfolio allocated to a single stock.\n\nRolled the proceeds into VTI and not looking back.\n\nSure, it could take off after earnings next week...but  no one went broke realizing profits.  It's still my largest single stock holding.", "score": 3, "replies": [{"body": "Cool! NVDA earnings next week?! Awesome!", "score": 1, "replies": []}, {"body": "I love that quote", "score": 1, "replies": []}]}, {"body": "Diversification is for idiots - Mark Cuban", "score": 3, "replies": [{"body": "Thats me!", "score": 3, "replies": []}]}, {"body": "I don't know how large your portfolio is and how close you are to retirement, but if NVDA is one of your highest conviction stocks 6.5% is a very small allocation.\n\nRemember diversification doesn't build wealth, it conserves it. For individual investors 99% of the risk is in your lack of knowledge, only 1% is in the actual company you own. It's less risky to own 1 company you know everything about than 10 you know only the basics of.", "score": 3, "replies": [{"body": "Thanks. I'm 48. Yes, thats why I tend to shy away from VTI, although I have 10% in it.  In 2 years I've brought my portfolio up by 50%.\n\nI'm in and out of cash so I don't know what percentage my returns are and don't really care much.\n\nI'm 50% tech.  15% MSFT AAPL followed by 5% GOOGL, 5.2% NVDA, 5% HD, 6% UNH, 3% ZIM , 3% ASML, PYPL, 2% SQ ODFL, UNP, SHW TMO INMD etc ....\n\nShould I have more in MSFT? I'm 11%. AAPL about 5%.\n\nSo the weight in my portfolio is in CASH (18%) MSFT VTI UNH NVDA HD AAPL . I'd say thats about 42% of my portfolio.  If you add cash that's about 60%.", "score": 1, "replies": [{"body": "I don't really think anyone can advise you on how to adjust your allocations. Ultimately it all comes down to how big your conviction of each stock is. For example, I've set a minimum allocation of 50% of my portfolio to Tesla which many would call crazy, but besides being only 31 and having a decent risk tolerance, I consider it to be the safest thing I can do because I know pretty much everything there is to know about the company. I literally spend at least 30 min a day keeping up with the company, so if any significant risks were to come up I'd know. If I have to choose between putting 10% in 5 different stocks or 50% in Tesla, I know I'm going to have better returns with less risk by putting it in Tesla.\n\nSo the only thing I can say is that I'd ask myself \"How much do I really understand the business and its risks, and how big is the opportunity?\" If you base your allocations on those 3 factors, you should be good. Besides, all of the companies you listed seem likely fairly safe plays. You're a bit tech heavy and might see slightly bigger downside during a crash or increasing interest rates, but ultimately I believe Tech will thrive in the coming decades. So if you believe the same, you're good.", "score": 1, "replies": [{"body": "Yeah when tech got hit in February of this year I lost a little (maybe 10%).  It didn't bother me much. The majority of my tech is MSFT AAPL GOOGL and stuff and I think longer term those stocks are safe.\n\nI also feel safer having some healthcare stuff like UNH. I also have FSMEX which is Fidelity's medical equipment mutual fund that includes TMO DHR BIO ABT, etc and is actively managed for a small fee in my ROTH.I've only got about 3% in it.\n\n HD has been on a good run. Finally my ODFL and SHW are picking up.\n\nI recently added a 2% position in ZIM cause it's a newer IPO and I think shipping will ultimately do pretty well with the back ups.\n\nMy ASML is doing pretty well.\n\nToday I added my first penny stock in my IRA just for a gamble.  I only put $400 in it.  It's IFRX and looks like its at the bottom so I figure ah what the heck. Thats all I'll mess with stuff like that though!", "score": 1, "replies": [{"body": "As someone who lives 15 min from ASML's hometown, good job holding that. They've got the biggest monopoly in the world and a lot of people don't realize it yet.\n\nBut yeah, I think Tech will be fine. No matter what happens in the world, I doubt people will no longer be using Google and YouTube or Microsoft's products in 10 years' time.", "score": 2, "replies": [{"body": "ASML is great! Under the radar tech that most don't know about.  $10k in 2011 is now $260k!", "score": 2, "replies": [{"body": "Yes, insane :P", "score": 1, "replies": [{"body": "I wished I had known about investing in those days, cause instead I had $10k in savings making .05%!", "score": 1, "replies": [{"body": "You and me both mate. And the amount of money I wasted because I didn't have a purpose when saving... Could've been a millionaire at 30 :')", "score": 2, "replies": [{"body": "We cant go back unfortunately....", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "NVDA is 16% of my portfolio and I’ve been happy with it ever since the split", "score": 2, "replies": [{"body": "😎", "score": 0, "replies": []}]}, {"body": "Where are you investing the profits?", "score": 2, "replies": [{"body": "They're waiting in case we crash 20% after the new year.", "score": 1, "replies": []}]}, {"body": "Nothing wrong with 5.1% of a portfolio in a single stock. Over 10% you should probably trim.", "score": 2, "replies": [{"body": "MSFT is a little over 10%, but I see it as the most solid stock out there.", "score": 1, "replies": []}]}, {"body": "No perfect answer. I trim when a stock gets over 10% ever since I let AOL run to 40% around 2000 and lost a lot back. It was a mistake to trim AAPL though, if I never sold a share it would be close to a million. In general, if a stock isn’t as volatile you can hold more without worrying.", "score": 2, "replies": [{"body": "I hold 10% MSFT and 5% AAPL, 5% HD and 5% UNH.  They're pretty stable.  I'm getting more comfortable thinking of NVDA like those stocks.", "score": 1, "replies": [{"body": "Seems reasonable.", "score": 2, "replies": []}]}]}, {"body": "Taking profits is part of the game. Only sell if you have somewhere better to park the money. But also why cut your winners if you think your winners are going to keep winning?", "score": 2, "replies": [{"body": "Because who knows in todays wacky market? I like more having cash to buy stocks when and if we dip 20% maybe after December?", "score": 1, "replies": [{"body": "In that case, why don’t you explore using options such as selling calls against your position?", "score": 1, "replies": [{"body": "I don't understand or really wanna do options.  You can lose big if you are unlucky.", "score": 2, "replies": []}]}]}, {"body": "Just because you THINK that winners keep winning doesn't mean they will.  Even the surest smartest people lose big on investments they thought were good.  Markets can correct and take decades to recover. I'm 48.", "score": 1, "replies": [{"body": "Decades to recover?? Last 100 years there was not such event... Eveb after 1929 it took not even 4 years to break even for someone who bought the day before the crash", "score": 1, "replies": [{"body": "From 2000 to 2010 was the lost decade.  The sp500 took a decade to recover from 1999 peak.", "score": 1, "replies": []}]}]}]}, {"body": "NVDA is that one stock that I kick myself for not buying. I put it on my watch list Mar 2019 when it was $10 a share but I switched brokerage firms and didnt buy it. Now its over 2000% increase from then. Turning my 10k into 200k would have been nice.", "score": 2, "replies": [{"body": "Why not buy a few shares and start now?", "score": 1, "replies": [{"body": "I know most people have that  \"should have trusted my gut and bought this insert stock here\" moments. This just happens to be mine but I am still going to buy some.", "score": 1, "replies": [{"body": "In 2 years it'll be at $350 and you'll say \"I'm glad I bought NVDA!\"", "score": 2, "replies": []}]}]}]}, {"body": "I took my profits on nvda a few weeks ago. I really want to buy a house n one major correction could wipe my gains and set me back ten years (had all my capital for down payment in stocks). I just feel like this isn’t sustainable much longer", "score": 2, "replies": [{"body": "Wow you've got a lot more than me!", "score": 1, "replies": []}]}, {"body": "Sounds like you've justified your decision, but in my opinion you should always let your winners run. Don't sell until your confidence in the company changes, you need the money for something else, or a better opportunity presents itself.\n\nI bought in 2015 and am up over 48x on my initial NVDA investment and wouldn't have close to my returns had I sold at 2x, 3x, or 10x. I've never trimmed a single share (in fact I reinvest dividends) and NVDA now represents the vast majority of my net worth.  I sleep well at night, even if it tanks I'll still end up ahead of where I'd be if I never bought it in the first place.", "score": 2, "replies": [{"body": "What percentage of your portfolio?", "score": 1, "replies": []}]}, {"body": "How you feeling today?", "score": 2, "replies": [{"body": "Great! Up 148% in NVDA thanks!  I did cash out a little. No biggie!", "score": 2, "replies": [{"body": "Today has been insane.", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}]}]}, {"body": "Aged like milk\nThe 300$ was not in a few monthes bro", "score": 2, "replies": [{"body": "I missed out, but I'm still up 148%.", "score": 1, "replies": []}]}, {"body": "Took a lot less than a few months to get close to 300…", "score": 2, "replies": [{"body": "Yep. We'll see if it stays there! I hope it does.  I still got 5.3% portfolio in NVDA. I'm up 140% in a little over a year", "score": 2, "replies": [{"body": "I stupidly decided to sell Jan. 2022 $225 covered calls for $1,000 when it was at 209 so I’m hoping for a quick dip to help justify or correct that costly mistake.", "score": 1, "replies": [{"body": "That's why people on here lose ultimately.  Options aren't what most people should be doing. Just buy and hold good companies.\n\nI don't understand options and dont care to.  Not for me, I am an investor.", "score": 1, "replies": []}]}]}]}, {"body": "I literally only own two stocks", "score": 2, "replies": [{"body": "How large of a portfolio? Under $10k may be ok, over $50k isn't that smart. Unless $50k is nothing to you.  To me $50k is A LOT of money!", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I've got 25% a year so far!  You're young I can tell.  How big is your portfolio?\n\n12% a year is awesome!", "score": 1, "replies": [{"body": "Yeah I see your point. I'm 16 and my portfolio is 3k right now", "score": 0, "replies": [{"body": "That's great!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Try putting 75% of your portfolio into one trade. Everything you said just sounds weak like a jaw with no teeth.", "score": -7, "replies": [{"body": "Ok thanks bro.", "score": 12, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "\n20 stocks is considered adequate for a portfolio.  4000 stocks and you get a 7% return over many years.\n\n3 stocks is just asking for trouble unless you have a sub $10k portfolio.", "score": 3, "replies": []}]}, {"body": "[removed]", "score": -11, "replies": [{"body": "goosefraba, my dude, goosefraba.", "score": 1, "replies": []}]}, {"body": "I like to do 10 or less sticks. Right now I am at 6 and an index. 20% Nvidia, 20% amd. 20% Microsoft. 20% apple. 3% charter, 5% discover, 13% qqq.\n\nI made a mistake earlier and sold half my and and half my Nvidia for amazon. Bad move", "score": 1, "replies": []}, {"body": "I just put in an order today to take some profits from Nvidia myself, part of that is because I need the money to help pay for a car I am looking at getting. Either way, it's not always a bad thing to take some profits away. Yes, you could miss out on some money, but yes it could also tank tomorrow for whatever reason. Sometimes we gotta take some of the profits out for whatever reason. I like to look at occasionally taking profits as a hedge on my investments.", "score": 1, "replies": []}, {"body": "It's about 81% of my self-managed fuck around portfolio (admittedly, it isn't very robust). Nvidia is my favorite, not just because of its performance but because it was basically my first stock that I really got motivated about. I read a lot and did my DD and it just \"felt right\". The feeling is still right and I believe in the company. I don't anticipate selling anything any time soon.", "score": 1, "replies": [{"body": "Put some MSFT in there.", "score": 1, "replies": []}]}, {"body": "20% in the last week.  I’m sorry bud.  That has to be frustrating.  But you went with your gut and you can’t start to second guess your gut.  Happy trading brother!", "score": 1, "replies": [{"body": "It doesnt bother me.  Nobody knows the future.  I'm still 5.2% NVDA and have 148% return in 1 year!\n\nNext week or month the stock may go to $200, then I'd buy a little back in.", "score": 1, "replies": []}]}, {"body": "You picked a good one to go heavy on. No shame in having a portfolio that's heavily weighted towards big winners (and this year NVDA has definitely a big winner). How did you decide to reinvest the profits?", "score": 1, "replies": [{"body": "I don't know yet.  Maybe some more ASML", "score": 1, "replies": [{"body": "Would investing in LAZR with the profits be like doubling down on NVDA? 😄", "score": 1, "replies": []}]}]}]}
{"title": "Microsoft earnings are out – here are the numbers", "selftext": "Microsoft reported earnings after the bell. Here are the results.\n\nEarnings: $2.27 per share .\n\nRevenue: $45.32 billion vs $43.97 billion, according to Refinitiv.\n\nIt is not immediately clear if the reported earnings per share are comparable to analyst estimates.\n\nTotal company revenue climbed 22% year over year, according to a statement. Revenue grew 21% in the previous quarter.\n\nMicrosoft reported $20.5 billion in net income, growing 48%.\n\nMicrosoft’s Azure public cloud revenue growth is expected to be 47%, according to a CNBC survey of 12 analysts, while analysts polled by \n\nStreetAccount are looking for 48% Azure growth. The company said it expected stable growth in constant currency from last quarter, with customers increasingly signing up for long-term contracts. Microsoft does not disclose Azure revenue in dollars.\n\n“Digital technology is a deflationary force in an inflationary economy. Businesses – small and large – can improve productivity and the affordability of their products and services by building tech intensity,” said Satya Nadella, chairman and chief executive officer of Microsoft. “The Microsoft Cloud delivers the end-to-end platforms and tools organizations need to navigate this time of transition and change.”\n\n**Business Highlights**\n\nRevenue in Productivity and Business Processes was $15.0 billion and increased 22% (up 20% in constant currency), with the following business highlights:\n\n·        Office Commercial products and cloud services revenue increased 18% (up 16% in constant currency) driven by Office 365 Commercial revenue growth of 23% (up 21% in constant currency)\n\n·        Office Consumer products and cloud services revenue increased 10% (up 8% in constant currency) and Microsoft 365 Consumer subscribers increased to 54.1 million\n\n·        LinkedIn revenue increased 42% (up 39% in constant currency) driven by Marketing Solutions growth of 61% (up 59% in constant currency)\n\n·        Dynamics products and cloud services revenue increased 31% (up 29% in constant currency) driven by Dynamics 365 revenue growth of 48% (up 45% in constant currency)\n\nRevenue in Intelligent Cloud was $17.0 billion and increased 31% (up 29% in constant currency), with the following business highlights:\n\n·        Server products and cloud services revenue increased 35% (up 33% in constant currency) driven by Azure and other cloud services revenue growth of 50% (up 48% in constant currency)\n\nRevenue in More Personal Computing was $13.3 billion and increased 12% (up 11% in constant currency), with the following business highlights:\n\n·        Windows OEM revenue increased 10%\n\n·        Windows Commercial products and cloud services revenue increased 12% (up 10% in constant currency)\n\n·        Xbox content and services revenue increased 2% (relatively unchanged in constant currency)\n\n·        Search and news advertising revenue excluding traffic acquisition costs increased 40% (up 39% in constant currency)\n\n·        Surface revenue decreased 17% (down 19% in constant currency)\n\nMicrosoft returned $10.9 billion to shareholders in the form of share repurchases and dividends in the first quarter of fiscal year 2022, an increase of 14% compared to the first quarter of fiscal year 2021.\n\n[Source via CNBC](https://www.cnbc.com/2021/10/26/microsoft-msft-earnings-q1-2022.html?__source=iosappshare%7Ccom.apple.UIKit.activity.) [and Microsoft’s investor relations site](https://www.microsoft.com/en-us/investor/earnings/fy-2022-q1/press-release-webcast)", "id": "qgexke", "created_utc": 1635278728.0, "score": 192, "upvote_ratio": 0.95, "num_comments": 101, "comments": [{"body": "[deleted]", "score": 178, "replies": [{"body": "This was now the 4th quarter in a row that the Azure and cloud services segment has achieved 50% YoY growth. Incredible.", "score": 64, "replies": [{"body": "while i am bullish on msft, 50 “%” doesn’t mean much if the base isn’t large enough. if aws grows 20%, that’s more than entire cloud revenue of msft.", "score": -10, "replies": [{"body": "What? Where are you pulling your figures from because that sounds completely made up. AWS are ahead but not by that much.", "score": 10, "replies": []}, {"body": "What? Most of my clients use Azure nowadays, Enterprises rather pay Microsoft since they always did anyway instead of opening a new checking Account for AWS.", "score": 4, "replies": []}]}]}, {"body": "Azure's growth always surprises me.  I'm \"excited\" for the day the stock tanks because Azure only grew 20% yoy /s\n\nTheir other departments are doing well, I don't wanna discount LinkedIn, Office, and Windows.", "score": 26, "replies": []}, {"body": "I like Azure honestly. The UI/UX makes me want to throw up, but outside of that I like it.", "score": 11, "replies": [{"body": "Runs great but is horrible to interact with. I suppose one should be automating everything anyway.", "score": 6, "replies": [{"body": "Exactly, there are plenty of tools that will let you use the UI very minimally, and that's the best practice regardless of how good the UI is anyway.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "A little, but not the same depth as Azure. From the little experience I have with AWS I don't hate it either and would probably use either if I had to choose.", "score": 2, "replies": [{"body": "After having used both a good amount (though prior to the AWS redesign), I absolutely hated AWS. I think Azure is significantly easier to understand and work with, but still messy. I think that represents UI/UX in the cloud space in general though.", "score": 1, "replies": []}]}]}]}, {"body": "Is the server space a zero sum game. i.e. if Microsoft is making these gains does that mean Google and Amazon are not?", "score": 3, "replies": [{"body": "They are too. Microsoft continues to chip away at AWS' market space. Googles GCP is growing well too, perhaps not as high (someone fact check me :)).\n\nIMO more enterprises are going more cloud first now as their overall IT strategy. Given that most of these enterprises already had an established relationship with Microsoft, probably due to procurement/licensing, i.e. windows server, SQL server, windows XP/7/10 etc. Therefore I think the transition to Azure/Microsoft seemed natural. But what do I know.. just a guess.", "score": 6, "replies": [{"body": "The business connection makes sense with regards to Microsoft. That's a good point.\n\nHow about in terms of Amazon vs Google. Google is a slightly more business-facing company (some company use Google Drive, Docs, and Gamail). But Amazon doesn't have as much office-related products.", "score": 1, "replies": [{"body": "Most of my Enterprise clients use Microsoft (office365, Teams, Outlook) for all of that. They just trust Microsoft more than Google or Amazon and they are using Microsoft products since forever. Techies or Start-ups are rather using AWS for ease of use and Feature Set imho. Nobody cares about GCP. Im looking from a european Standpoint.", "score": 3, "replies": []}]}]}, {"body": "Cloud services are nowhere near saturation. Companies that have been “moving to the cloud” for 10 years are still moving (and spending) including mine. No idea where the end of the tunnel is, but I’ll probably be retired.", "score": 4, "replies": []}, {"body": "No. Just think of the regular clouds up in the sky. Sky's the limit for whatever and whichever cloud.", "score": 2, "replies": [{"body": "Sorry one last question if you don't mind. What do you think of Roblox? I fomoed bought in and it's done ok but not great for me. In the long term I just don't understand why people think that's a platform that will get traction.", "score": -2, "replies": []}]}, {"body": "Lots of people are moving to cloud, not switching from Amazon or Google to azure.\n\nSwitching clouds isn't impossible, but it's not trivial either unless you have a very cookie cutter setup.", "score": 3, "replies": []}]}]}, {"body": "Wow it smashed analysts estimate for EPS \n\nI don't know why I shouldn't just sell all my tech stocks and just invest in MSFT. It's literally an ETF by itself.", "score": 94, "replies": [{"body": "[comment removed in response to actions of the admins and overall decline of the platform]", "score": 33, "replies": []}, {"body": "Of all the FAANGM stocks MSFT is easily the strongest and most well diversified of the bunch. I've been dollar cost averaging into it for like 18 months now, I only regret not DCAing in harder and sooner.", "score": 18, "replies": [{"body": "GOOGL is the best", "score": 2, "replies": []}, {"body": "For anyone wondering, out of the FAANG companies, GOOG and FB are the least diversified.", "score": 1, "replies": []}]}, {"body": "MSFT and AAPL and you’re set.", "score": 30, "replies": [{"body": "Not 100% convinced on AAPL personally.", "score": 34, "replies": [{"body": "Why?", "score": 7, "replies": [{"body": "How much more can it grow? It’s already 2T", "score": 0, "replies": [{"body": "That's what people said when it hit 1T. In house chips killing both intel and AMD's offerings. New macbooks are home runs. Apple watch is taking off and Apple car is around the corner.", "score": 46, "replies": [{"body": "Apple car isn't going to be an actual car. It'll be some kind of ecosystem tie and I bet. They run the numbers just like Dyson and know that it's not worth getting into manufacturing complete vehicles.", "score": 16, "replies": []}]}, {"body": " I mean they can pick any market they want and likely dominate it. Very powerful brand.", "score": 11, "replies": [{"body": "True but overall %growth will still have to slow", "score": 3, "replies": [{"body": "At some point yeah. My guess is Apple will have a new product ready for when that happens (car?). Only they know for sure.", "score": 2, "replies": []}]}]}, {"body": "When healthcare is delivered via Apple wearables 10 years from now it's going to be insane. Plus metaverse.", "score": 5, "replies": []}]}]}]}, {"body": "And GOOG", "score": 5, "replies": [{"body": "GOOG or GOOGL?", "score": 6, "replies": [{"body": "I like GOOG because it is fewer letters. My 15 shares aren’t going to make a difference with voting rights.", "score": 17, "replies": []}]}]}, {"body": "I love this sub", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "Any reason you decided against AAPL and AMZN?", "score": 1, "replies": []}]}, {"body": ">It's literally an ETF by itself.\n\nFiguratively. It's figuratively an ETF by itself.", "score": 2, "replies": []}, {"body": "it traded sideways for a while, nbd", "score": 1, "replies": []}]}, {"body": "MSFT did well? Wow I for one am shocked, who could have possibly predicted that? /s\n\n25 shares at $265", "score": 57, "replies": [{"body": "It was my very first investment 27 at 188", "score": 18, "replies": []}, {"body": "70 @ 270. Was in at as low as $60 earlier, but covid scared me into taking profits last year. Feels a little sad now, but hey", "score": 4, "replies": [{"body": "I did the same after holding for many years. I remember the price being stuck around $30 for 6-7 years and almost bailed on it then cloud happened", "score": 1, "replies": []}]}, {"body": "I have 10 240 calls , expiring in Jan 2021..\n\nwhat should I do? Excerised or book the premium?\n\nit's 570% up.", "score": 3, "replies": [{"body": "Hold those boys till expiry", "score": 3, "replies": []}, {"body": "I hope u mean 22", "score": 1, "replies": []}]}, {"body": "Nice. Im at 7 for same price...\n\nNext year Im buying only VTI and MSFT", "score": 7, "replies": []}, {"body": "150 @ $94 and then another 98 shares at different price points. \n\nI’m probably done buying it for now and will actually try that thing called diversifying.", "score": 1, "replies": []}, {"body": "Got my first lot at $55. Looking like a pretty good decision.", "score": 1, "replies": []}]}, {"body": "MSFT is almost 70% of my investment portfolio. I keep thinking I should diversify but it keeps growing at an absurd rate that it's hard to justify selling it. As long as Nutella's head of the ship there, I can't see myself selling it.", "score": 53, "replies": [{"body": "Nutella is overvalued IMO \n\nJust way too much sugar. PB is my top pick...mature taste, great macros and wide applications.", "score": 16, "replies": []}, {"body": "Don't sell but add new money to others.", "score": 3, "replies": []}]}, {"body": "Microsoft is such a wonderful company. Everyone should also remember the $60B share buyback program announced earlier this fall.", "score": 35, "replies": [{"body": "What will that do for the stock price? I have march calls and don't know if it'll be affected", "score": 7, "replies": [{"body": "It makes the share price go up", "score": 14, "replies": [{"body": "It's free real estate.gif", "score": 3, "replies": []}]}, {"body": "Supply and demand…it’s removing 60B worth of supply.", "score": 1, "replies": [{"body": "When is that coming into effect? Or has it already?", "score": 1, "replies": []}]}]}]}, {"body": "Shoulda just bought MsFt instead of those weed stocks LMAO", "score": 34, "replies": [{"body": "Come on TLRY", "score": 7, "replies": []}, {"body": "Maybe we get a German legalisation from the next government", "score": 3, "replies": []}]}, {"body": "One of the safest investments around right now", "score": 20, "replies": [{"body": "Like, u could literally come up with hundreds of safer investments than MSFT right now.\n\nBut okay.\n\nEdit: they hated jesus because he told them the truth", "score": -7, "replies": [{"body": "Let’s hear them", "score": 2, "replies": [{"body": "Here you go:\n\nhttps://www.wsj.com/market-data/bonds/treasuries\n\nHundreds of different treasury bills and notes. All with an objectively lower risk level than MSFT.", "score": -1, "replies": []}]}]}]}, {"body": "My cost-basis for MSFT is $161 because I keep dipping in - but I've had some shares since $40.  Lets go baby!", "score": 15, "replies": [{"body": "Same here. Started my position in February 2015 when it was announced that Windows 10 would be \"free\" and investors ran scared and sold off...not realizing the that Azure was a growing giant.", "score": 3, "replies": [{"body": "Crazy enough I bought in because of Holo Lens….oops.", "score": 1, "replies": [{"body": "HoloLens is a great product as well, I think it's a ways away from fully realizing it's true potential within it's current targeted market (healthcare, industrial and commercial).\n\nBut I'm guessing you were sold on the initial consumer use scenarios shown early on lol.", "score": 4, "replies": [{"body": "Hah yep.  No complaints!", "score": 1, "replies": []}]}]}]}]}, {"body": "if only all stocks i own behaved like msft..\n\nim looking at you, tdoc and pins. stop sucking...", "score": 13, "replies": [{"body": "PINS has been a huge buzzkill. I hope they get their act together", "score": 3, "replies": []}, {"body": "I should have sold my PINS when it spiked to the 60s last week because of the PayPal rumor.  I think it'll go up IF the next earning call is good.", "score": 1, "replies": []}]}, {"body": "Buy and hold forever.", "score": 7, "replies": []}, {"body": "Love me some microsoft. My biggest two positions are microsoft and Apple. Microsoft has already payed off quite well, hoping apples earnings are going to be good.", "score": 7, "replies": []}, {"body": "Nothing new here. Just keep buying and holding.", "score": 6, "replies": []}, {"body": "These were huge beats across the board. Sick numbers. That’s a buy from me, dawg.", "score": 5, "replies": []}, {"body": "Haha. Just bought 2 more at Noon. Only 7 MSFT stocks but Im going to raise them next year probably another 3-5.\n\nKeeping it 10% or more of my non roth", "score": 9, "replies": []}, {"body": "Finally, it didn’t tank after beating expectations.", "score": 5, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "MSFT is heavily diversified and operates predominantly in the sticky B2B segment. Further, it’s the most antitrust proof of all the mega-gap tech stocks.", "score": 6, "replies": [{"body": "> it’s the most antitrust proof of all the mega-gap tech stocks\n\nThis is a huge factor most people don't take in consideration. I fully believe at least one of the big boys will get split up within the next decade.", "score": 1, "replies": []}]}, {"body": "I mean a big chunk of technology sector not having a P/E due to lack of profits and another chunk having P/E’s of 50+ due to expectations of growth (read Square, Shopify, Adobe, Amazon etc.), P/E of 38 doesn’t sound too ridiculous to me.", "score": 1, "replies": []}]}, {"body": "Im curious how much gamepass contributed to the earnings, that 2% from xbox looks odd.  I read that there are currently something like 25-30 million subscribers to game pass last they looked and its growing everyday.", "score": 3, "replies": [{"body": "Think of how much ms is paying game publishers to have their games on GP", "score": 3, "replies": []}]}, {"body": "Good cloud number could mean good numbers for AWS also", "score": 3, "replies": []}, {"body": "Great news", "score": 5, "replies": []}, {"body": "One of my two individual companies , 75 shares bought during March - may 2020", "score": 2, "replies": []}, {"body": "Can someone tell me how Azure compares to Amazon’s and Googles cloud based services?", "score": 2, "replies": [{"body": "Aws is by far the most mature but probably not the most intuitive. I think Googles offering is the easiest to use, and has some best in class services (their kubernetes engine)\n\nAzures web interface feels like a 12 year put it together. Everything works well though. Their documentation has been great as well.\n\nI work in an industry where I see companies moving from on prem to azure and Google. Amazon has the largest market share as they were first to market.\n\nI bought msft despite being a Google fan for one reason, most companies seemed to be moving to azure (which may or may not be true). This was two years ago. I seem to have been correct.\n\nThat said, Googles cloud is gaining traction as well. I would expect them to accelerate in a year or two.\n\nKeep in mind, this is just my opinion fueled by my job. I'm one person at one company and likely my view is bias.", "score": 7, "replies": []}]}, {"body": "The definition of a cash cow. MSFT doesn’t disappoint.", "score": 2, "replies": []}, {"body": "My favorite MF company!!", "score": 2, "replies": []}, {"body": "Bullish 🔥🔥🔥 Now my biggest holding and keeping all my shares.", "score": 2, "replies": []}, {"body": "Beast of a stock. Regret not getting more when it was like 230$ earlier this year.\n\nWill get more if it drops close to 300$.", "score": 2, "replies": []}, {"body": "Contender for GOAT stock", "score": 2, "replies": []}, {"body": "Xbox content flat is interesting. Is this a clue to the worldwide gaming market or just indicative of Xbox (long ago gamer, here).", "score": 2, "replies": []}, {"body": "Hoping AVPT seeing some of this lovin", "score": 2, "replies": []}, {"body": "Good news.  Been holding since 09 $20.06.  Unfortunately this is in my daughters account, she was 6 at the time.", "score": 1, "replies": []}]}
{"title": "AMD Crushes Earnings", "selftext": "AMD results are out. *Revenue increased 54 percent year-over-year*\n\n* Q3 revenue of $4.31B beats a $4.11B consensus. Non-GAAP EPS of $0.73 beats a $0.66 consensus.\n* AMD expects Q4 revenue of $4.5B, +/- $100M. That's above a $4.25B consensus.\n* Full-year revenue growth guidance is hiked to 65% from 60%.\n* Net income was $923 million compared to $390 million a year ago and $710 million in the prior quarter. Non-GAAP net income was $893 million compared to $501 million a year ago and $778 million in the prior quarter.\n* Diluted earnings per share was $0.75 compared to $0.32 a year ago and $0.58 in the prior quarter. Non-GAAP diluted earnings per share was $0.73 compared to $0.41 a year ago and $0.63 in the prior quarter.\n* Cash, cash equivalents and short-term investments were $3.6 billion at the end of the quarter. The Company repurchased more than 7 million shares of common stock for $750 million during the quarter.\n* Cash from operations was $849 million compared to $339 million a year ago and $952 million in the prior quarter. Free cash flow was $764 million compared to $265 million a year ago and $888 million in the prior quarter. Third quarter 2021 cash from operations and free cash flow included strategic investments in long-term supply chain capacity to support future revenue growth.\n\n[AMD Reports Third Quarter 2021 Financial Results (globenewswire.com)](https://www.globenewswire.com/news-release/2021/10/26/2321212/0/en/AMD-Reports-Third-Quarter-2021-Financial-Results.html)", "id": "qgf9pe", "created_utc": 1635279664.0, "score": 388, "upvote_ratio": 0.95, "num_comments": 119, "comments": [{"body": "I love AMD", "score": 209, "replies": [{"body": "AMD loves you too", "score": 32, "replies": []}, {"body": "I am so happy folks are now looking at AMD with such positivity. Back in 2017 when I got 4500 AMD shares for $14 I had tough time convincing friends, relatives.\n\nGlad I held on to AMD. Still holding all shares.", "score": 106, "replies": [{"body": "You diamond handed genius. Have my wife home by 10 please.", "score": 84, "replies": []}, {"body": "When I read stuff like this I’m always baffled. Who the hell tries to convince friends and family to buy any specific investments just because you like it?? Do you want to be responsible if it eats shit? All my family, and all but one friend has ZERO idea about any of my investments.", "score": 20, "replies": []}, {"body": "Congratulations.  I bought $500 of AMD at \\~$6 per share, got impatient and sold it.  Maybe the biggest investing mistake of my life.", "score": 7, "replies": [{"body": "My ex co worker moved his entire 401k into AMD at $11, we’re talking several hundred k… he panic sold at $12……. LOL", "score": 9, "replies": [{"body": "Honestly can you blame him, you really shouldn't put all your cards on the table like that lol", "score": 8, "replies": []}]}]}, {"body": "I am also holding from $14.75", "score": 6, "replies": []}, {"body": "its at 121. were there a stock split between now and 2017, or are you expecting it to recover?", "score": 1, "replies": [{"body": "No split has happened till now, AMD needs to cross $300 before any split.", "score": 2, "replies": [{"body": "oh  shit, i read you bought at $141, lol. my bad. yeah i'd keep holding, outlook is great.", "score": 1, "replies": []}]}]}]}, {"body": "doubled down on my position when it dumped to $100 and don't regret it lol", "score": 36, "replies": [{"body": "Sold at $108 and I regret it…", "score": 30, "replies": [{"body": "I sold last year when it was $55.\n\nLearned my lesson and bought 100 shares at $84 and hooooolding.", "score": 19, "replies": [{"body": "I’m buying the next dip.", "score": 7, "replies": [{"body": "AMD has not dipped for like a year.", "score": 0, "replies": [{"body": "AMD has had two major dumps (-25%) from its then January highs just this year. One in March and one in May.", "score": 5, "replies": [{"body": "AMD consistently dips on good news. Like back in July it hit like $120/share then proceeded to fall to nearly $100 again.", "score": 2, "replies": []}]}]}]}, {"body": "I told my friends brother to buy at 50 and he said no its done its to high\n\nIts just beginning", "score": 4, "replies": [{"body": "AMD HASN'T EVEN BEGUN TO PEAK", "score": 8, "replies": []}]}, {"body": "I must’ve bought your shares", "score": 1, "replies": []}]}, {"body": "thinking about buying back in?", "score": 1, "replies": [{"body": "Definitely, waiting for that super dip. AMD is something you hold on forever.", "score": 1, "replies": []}]}]}, {"body": "Now just don't be tempted to sell CCs against your shares like I did.", "score": 7, "replies": []}]}, {"body": "I love Su Bae", "score": 1, "replies": []}]}, {"body": "I think we now have a clear view that this earnings season is a success. Today Visa, Microsoft, Google, AMD and Enphase have all beaten expectations. Bullish on the stock market in general.", "score": 109, "replies": [{"body": "Yet VISA down in AH trading smh", "score": 9, "replies": [{"body": "Buy calls at open", "score": 3, "replies": []}, {"body": "They have a big risk to BNPL.", "score": 1, "replies": []}]}]}, {"body": "Love AMD! So glad I didn't listen to all those experts on Youtube telling me it's overvalued, buy Intel instead it has a P/E below 20 blablabla.", "score": 75, "replies": [{"body": "https://i.kym-cdn.com/photos/images/original/001/919/430/6d8.png", "score": 22, "replies": []}, {"body": "Winners keep winning and losers keep losing, the internet loves pumping shitty fading companies because they are a “good value” yet they keep going down.", "score": 20, "replies": []}]}, {"body": "[deleted]", "score": 27, "replies": [{"body": "Flashback to pingpong between 74 and 80 for 6 months", "score": 4, "replies": []}]}, {"body": "This sub is in love with AMD.", "score": 53, "replies": [{"body": "[deleted]", "score": 99, "replies": [{"body": "+1 to leadership, which wasn’t something I weighed to heavily in the past.\n\nI think it’s fair to attribute part of AMDs success to Su Bae, whereas other companies building complex things but are run by bean counters (INTC, BA, etc.) have been gashed.", "score": 22, "replies": [{"body": "It’s hard to quantify good leadership", "score": 7, "replies": []}, {"body": "> INTC\n\nPat Gelsinger is an engineer (masters from stanford). Literally developed the Intel 486. Was intel's first CTO in the 2001. Was the leading man behind their key advances of USB, WiFi, Intel Core, and Intel Xeon.\n\nTheir current predicament isbn't because of \"bean counters\" but the previous head of manufacturing who had his head up his ass about reality. The fact Gelsinger is at the helm is a good indicator of the capability of a turnaround that they're currently executing.", "score": 11, "replies": [{"body": "Reddit decided 3 years ago on the narrative and refuses to change it lol. 4th or 5th post i've seen in a month on  here saying Intel is still run by 'bean-counters'", "score": 2, "replies": [{"body": "It’s also funny since the ousted CEO that was responsible for fucking shit up was the head of manufacturing who botched their move to 10nm in 2017 (tsm 7nm equiv) by aiming to not only downsize architecture but increase wafer yields in the same cycle. Again not some random bean counter lol", "score": 2, "replies": []}]}]}]}]}, {"body": "For good reason", "score": 22, "replies": []}, {"body": "I have to say, reddit stocks has actually been a fantastic resource for stock picks. Not nearly as much pumping as places like yahoo,  seeking alpha, etc..", "score": 18, "replies": [{"body": "Exactly! I've actually found a lot of great picks here that aren't clear p&ds like you find on WSB", "score": 8, "replies": [{"body": "Examples?", "score": 2, "replies": []}]}]}, {"body": "We love money and AMD prints with no signs of slowing down.", "score": 7, "replies": []}, {"body": "Yes, why i guess.. \n\nNvidia has more potential.", "score": 1, "replies": []}]}, {"body": "I wish I had kept my AMD stock", "score": 9, "replies": [{"body": "dude....got out when they were at around 10 $. please don't tell anyone", "score": 7, "replies": [{"body": "HE GOT OUT AROUND 10 $\nI got in at 17 and got out at 61 :/", "score": 2, "replies": [{"body": "Got in at 50 Still Holding :D", "score": 1, "replies": []}]}]}, {"body": "Well it's down in pre-market by 1%, might as well pick some up.", "score": 1, "replies": [{"body": "I did🙂", "score": 1, "replies": []}]}]}, {"body": "Lots of line item beats here.  But the bigger story is more qualitative, in that other chip companies like Texas Instruments and Intel report woes and gloom from supply chain, yet AMD has been rolling along.", "score": 19, "replies": [{"body": "This might show that when suppliers have to make a choice, they picked AMD over Intel -- meaning people close inside the industry have picked their winner.", "score": 10, "replies": [{"body": "From memory it's just that amd was quick onto 7nm, and soon 5nm, so could secure a larger manufacturing deal before the rest of the capacity was bought up", "score": 7, "replies": []}]}]}, {"body": "DJ SU Never misses a drop.", "score": 16, "replies": [{"body": "Welcome to this quarters earnings call **AIR HORNS** we are happy to have you", "score": 5, "replies": []}]}, {"body": "I sold this when it reached a dollar,i feel so attacked now.", "score": 10, "replies": []}, {"body": "I’ve held AMD for a while and hasn’t disappointed. Average cost basis of $79", "score": 10, "replies": []}, {"body": "Of course, they don't even need to store product these days, just ship it from the factory.", "score": 14, "replies": []}, {"body": "AMD and NVDA are the best bet for semi right now and future.", "score": 16, "replies": []}, {"body": "CEO Sue Bae - 'AMD to 150'", "score": 20, "replies": [{"body": "AMD at 150 would value it more than Intel. Taking market share is one thing, but i would be surprised if AMD gets 50% market share in next decade for it to be justified to be ‘more valued than intel.", "score": 3, "replies": [{"body": "I don't have any money invested in Intel or AMD. But that said, I think you can make a good argument that AMD deserves to trade higher than Intel. \n\nA lot of the people who are chip experts obsess over how great AMD is and how much Intel sucks. That's going to carry over to people outside that circle overtime. While I'm no chip expert, I've heard so much bad stuff about Intel and their chips over the last few years from several of my co-workers who know a lot about the industry. So I'm definitely going to get a computer with AMD chips and avoid Intel the next time I need to buy a new computer.", "score": 15, "replies": []}, {"body": "The Market is extremely forward looking is it not?", "score": 6, "replies": [{"body": "As of right now, it is already 150B and 190B, so AMD needs to get near 50% anyways.", "score": 2, "replies": [{"body": "Addition of XLNX is your 50B assuming it gets approve which by all accounts it's a done deal.", "score": 2, "replies": []}]}]}, {"body": "AMD’s margin are so much better than intels that it doesn’t need a higher market share to be worth more than intel.", "score": 6, "replies": [{"body": "well yes but no. intel still has higher gross margin %. they are just spending billions of $ to build fabs and transition to EUV that intel profit % is slightly lower. which is somewhat typical of a company which will continue to grow. moreover,  tsmc generates <10% revenue from their best node (which only apple uses), so intel has the potential to disrupt the remaining 90% of tsmc’s foundry business so don’t expect that amd will continue to enjoy low wafer prices from tsmc.", "score": 2, "replies": []}]}, {"body": "When the XLNX merger closes and assuming AMD's stock price stays at this level; it's market cap will exceed Intel.", "score": 3, "replies": [{"body": "Since the merger is already announced, it's already priced in.", "score": -1, "replies": []}]}, {"body": "AMD will 100% hit 150 by this time next year. Wait till talks about the company hit the news. You have to remember the stock market is like 60% emotional investing at this point", "score": 3, "replies": [{"body": "Surprising TSMC isn't rising. Market value of amd relative to intel says amd will be attaining 50% annual market share by next decade (in a scenario semiconductor demand itself is going to double).", "score": 2, "replies": []}]}, {"body": "They also compete with Nvidia which has a 600B market cap", "score": 1, "replies": [{"body": "Intel is also brining out its own GPUs and ASICs for AI.", "score": 0, "replies": []}]}]}]}, {"body": "Daaaamn", "score": 8, "replies": []}, {"body": "Yee haw", "score": 3, "replies": []}, {"body": "My 3 AMD shares will make me rich!", "score": 3, "replies": []}, {"body": "AMD does not pay dividends, I bought hella LEAPS options about a year ago. Feels good man", "score": 3, "replies": []}, {"body": "Ok, so Nvidia will crush earnings in Nov. too probably?", "score": 3, "replies": []}, {"body": "This was my first stock purchase ever. Got in at $11.37 a share.", "score": 3, "replies": []}, {"body": "[removed]", "score": 11, "replies": [{"body": "Proof or ban.", "score": 52, "replies": []}]}, {"body": "Been holding since I bought at $22 a share. sadly only bought 50 shares... but hey its something. I should probably add more shares sometime..", "score": 2, "replies": []}, {"body": "AMD is my best purchase this year (thank you Reddit!) I bought it when it dropped to mid 70 in May. Only 19 shares, but will add more.", "score": 2, "replies": []}, {"body": "I bought AMD ~9 years ago for $3/per at around $1,000 initial investment, sold the whole lot around $6 for college books and beer money. Holy moly I'd have 41k today 😅", "score": 2, "replies": []}, {"body": "crushes earnings yet drops\n\nhuh\n\n>!I've seen this before. Usually like to buy in the next couple of days, but do what you want!<", "score": 4, "replies": []}, {"body": "And as usual it will go down or stay flat.... rendering my calls worthless", "score": 6, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "Exactly. Company has been killing it over the past two years. But and hold like a sensible person. Better yet, buy LEAPS like a champ since AMD does not pay dividends", "score": 2, "replies": []}, {"body": "Yes", "score": 1, "replies": []}]}, {"body": "It will 100% be down tomorrow", "score": -5, "replies": []}, {"body": "rip\n\nactually went down and lost all gains from today in AH. \n\nu smart", "score": 1, "replies": []}]}, {"body": "I love AMD too! No idea why price didn’t go up in after hours. I hope my calls will print.", "score": 4, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "Right?!? I don’t understand why AMD is trading at half the P/E ratio of NVDA. I see the same growth potential in both", "score": 4, "replies": [{"body": "PEG ratio is much better for AMD. They have much more room to grow.", "score": 3, "replies": []}]}]}, {"body": "the earnings is impressive but AH didn't receive it to well.\n\nAMD/NVDA have about 4 more QTRs of steller earnings, before, the semi-conductor issues are resolved. What then? they become a staple ( slower growth) super high EPS - dividend paying company.", "score": 2, "replies": [{"body": "No, because especially Nvidia has expanded it more future markets.", "score": 1, "replies": []}]}, {"body": "I'll be downvoted, but 20+ years ago the adage was (and I'm paraphrasing) \"Intel builds for customers, AMD builds for benchmarks\".\n\nI don't see how anything has changed.", "score": -3, "replies": [{"body": "That's such an incredible and inaccurate take, I don't really know how to respond.  On the surface level, AMD has a semi custom department that makes the unique chips for the PS5, Xbox series, Valve hand held, and special bins for Microsoft surface laptops, so they are certainly building for customers.  On a more macro level, AMD is solidly eating into Intel in the DC and making a dent in the  laptop market beyond their traditional role as bargain bin only tier.  Look at the respective forecasts and tell me which company is delivering better for customers.", "score": 5, "replies": []}, {"body": "A lot has changed in 20 years.", "score": 4, "replies": []}]}, {"body": "Of course, they don’t even need to store products these days, just ship it from the factory.", "score": 0, "replies": []}, {"body": "And yet the stock tanks. Typical", "score": -8, "replies": [{"body": "Are you looking at the wrong ticker? AMD gained 10% during the last 7 days. That's absolutely insane for a company this big.", "score": 15, "replies": [{"body": "I think he meant today. \n\nSome people were probably expecting them to double revenue and pop to $180/share.\n\nHe is looking at the correct ticker. \n\n\\+ 0.57 during trading hours.\n\n\\- 0.95 in AH (so far. when I started typing, it was 0.83)", "score": 5, "replies": []}]}, {"body": "cry more. This clown market will end soon .", "score": 0, "replies": []}]}, {"body": "Would you say it's possible that they created artificial scarcity and does this have anything to do with it?", "score": -1, "replies": []}, {"body": "Question: Would you wait for a dip to try to buy in or would you buy in for the sake of long term holding? \n\nSorry new to this.", "score": 1, "replies": []}, {"body": "Of course they did they can’t even keep their stock on the shelves", "score": 1, "replies": []}, {"body": "Is it still a good time to get in?", "score": 1, "replies": []}]}
{"title": "Down 2,718%, apparently selling FD Tesla calls 10% out the money isn’t the infinite money cheat you lead me to believe", "selftext": "", "id": "qfw45f", "created_utc": 1635213798.0, "score": 431, "upvote_ratio": 0.95, "num_comments": 115, "comments": [{"body": "Jesus 🤦‍♂️", "score": 177, "replies": [{"body": "I tried resetting the app but it keeps loading the same screen.", "score": 225, "replies": [{"body": "Try blowing into the cartridge", "score": 131, "replies": [{"body": "I’ve tried lots of blowing to get out of this trade", "score": 153, "replies": []}, {"body": "So sad that our kids will never appreciate this joke", "score": 44, "replies": [{"body": "Some of us have kept some old Nintendo's around just someone kids can experience the pain/joy of this act.", "score": 14, "replies": []}]}]}, {"body": "Too bad this ain’t Robinhood…resetting and turning your phone off and then on would work.", "score": 19, "replies": [{"body": "It’s just margin so it doesn’t count, right?", "score": 27, "replies": [{"body": "You’re on margin right?", "score": 8, "replies": []}]}]}, {"body": "I think he means try Jesus instead....praying, going to church, etc.", "score": 5, "replies": []}]}, {"body": "How is this possible? How does this work?", "score": 2, "replies": [{"body": "This is what happens when you trade naked", "score": 5, "replies": [{"body": "So the just of what I’m getting is that he wanted the price to be 10% lower? What did it end up doing? How bad could it have been to loose 27x ?", "score": 1, "replies": [{"body": "He sold a call option without owning the underlying shares, aka agreed to buy 100 shares of Tesla he doesn't own at a 1000 strike price.\n\nIf Tesla didn't hit 1000 he would have collected $160 bucks.. lol he watched it continually rip and didn't buy back the option to close. \n\nNow he fuk", "score": 2, "replies": [{"body": "What do u mean buy back? What should he have done?", "score": 1, "replies": [{"body": "He could have bought back the calls he sold short at anytime before he was 18k in the hole", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "First rule of theta gang is you don’t sell calls on TSLA", "score": 79, "replies": [{"body": "I did for the past 6 months CCs and VSPs and was nice and seemed range bound. Not selling a CC for the rest of the year, might do CSP on margin on occasion", "score": 6, "replies": []}]}, {"body": "If you’re covered then great.  Roll these babies out about 30 days.", "score": 54, "replies": []}, {"body": "How are you down on a covered call you sold OTM? Worst you get is assigned for a profit.", "score": 43, "replies": [{"body": "If he gets assigned then he has to sell the 300.  If he bought them years ago then it is probably 90% profit, so if he thinks Tesla will be at $2000/share in a year he can only buy back 200 of those 300 shares after he pay taxes (i.e. \"pay $10k, keep 300 shares, postpone taxes\" vs. \"pay much much more than 10k in capital gains taxes, rebuy 200 shares\"... different people have different comfort levels)", "score": 52, "replies": [{"body": "This guy stonks", "score": 21, "replies": []}]}]}, {"body": "God damm and welcome home you fucking retard.", "score": 76, "replies": [{"body": "I heard there would be cake?", "score": 48, "replies": [{"body": "No, we said KY", "score": 13, "replies": [{"body": "Sandpaper.", "score": 4, "replies": []}]}, {"body": "Be Cake? Nah fam, it's Bukake...", "score": 3, "replies": []}]}]}, {"body": "past performance does not equal future results.  \\*trademarked", "score": 17, "replies": []}, {"body": "Theres plenty of week left for these to go back OTM.", "score": 29, "replies": [{"body": "Or start rolling out, come Friday. Even if it’s the same strike price or you can gap up even a little bit each week for a credit it helps. I’ve had this problem before too and usually can get out of it with some patience. Or at least get to a strike closer to mark I feel good selling at.", "score": 12, "replies": []}, {"body": "it expires this week 10/29.", "score": 3, "replies": [{"body": "Yeah and with a close at 1024 he’s got a good chance of finishing OTM still, if not I’m sure he can rollout to next week even at the same $1000c strike for a credit and extend his time frame. Or see if he can leg up OTM or near ATM for a credit. I’ve even paid a small bit at times to roll out closer ATM as opposed to buying to close because it’s way cheaper and who knows what will happen later you might get an OTM finish if you keep inching up your strike over the course of a month. It’s irritating but it’s not all that uncommon when you sell CCs or CSPs. It’s part of the risk/reward of doing it.", "score": 1, "replies": []}]}]}, {"body": "Eat like a bird, shit like an elephant. Welcome to theta gang", "score": 13, "replies": []}, {"body": "I hope they are covered calls", "score": 23, "replies": [{"body": "They are, but I still got to buy them back. Can’t let anyone steal my Marscoin", "score": 34, "replies": [{"body": "I think you'll be fine.  Sweat it out until Friday; there is a major wall at 1000 on Friday", "score": 19, "replies": [{"body": "There was a major wall last week at 900C.", "score": 18, "replies": [{"body": "There are no major walls with TSLA. ![gif](emote|free_emotes_pack|table_flip)", "score": 9, "replies": [{"body": "After careful consideration I find spez guilty of being a whiny spez. #Save3rdPartyApps", "score": 4, "replies": []}]}, {"body": "Took awhile to break through 900, but once broken, the stock hasn't looked back.  Wish I held some of my calls, but still have some leaps expiring in Jan.", "score": 1, "replies": []}]}, {"body": "🙏", "score": 1, "replies": []}]}, {"body": "#ONLY RETARDS BUYBACK COVERED CALLS", "score": 16, "replies": [{"body": "I rolled mine further OTM but paid a premium to do it. Am I a retard? Not sure lol", "score": 3, "replies": [{"body": "Yes.", "score": 1, "replies": []}]}]}]}]}, {"body": "Covered call so not really an 11k loss...", "score": 9, "replies": []}, {"body": "[deleted]", "score": 9, "replies": []}, {"body": "Yes but you have the Tesla share gains to cover those losses right, I mean you wouldn't sell naked options right ... right...? \n\nOh shit this is r/wallstreetbets not r/invest welcome to the club, your complimentary crayons are in the mail.", "score": 7, "replies": []}, {"body": "Theta.", "score": 6, "replies": []}, {"body": "Only one way to know for sure, try it again tomorrow", "score": 5, "replies": []}, {"body": "[removed]", "score": 5, "replies": [{"body": "Covered", "score": 3, "replies": []}]}, {"body": "Cash secured puts aren’t a bad alternative", "score": 3, "replies": []}, {"body": "Damn man", "score": 3, "replies": []}, {"body": "Covered calls can be dangerous, If you look at TSLA on the daily chart there's a 910-950 gap, could be filled this week or not.", "score": 5, "replies": []}, {"body": "you kept the premium and probably your shares above water. Just wait for the next pullback and wheel back in. This is the way :)", "score": 2, "replies": []}, {"body": "You forgot the \"if you already have the shares\" part, don't go naked kids", "score": 2, "replies": []}, {"body": "Works until it doesn’t", "score": 2, "replies": []}, {"body": "Did you gamma/vega hedge with some far OTM call with the same expiry?", "score": 2, "replies": []}, {"body": "WTF, have I gone completely retarded? -3000 contracts at 39.34 is -118K, not -11.8K. Also, 3000 CC requires 300000 shares, ie 300M buying power. GTFO.", "score": 2, "replies": [{"body": "-3,000 is -$1,138,313. \n\nSo I think blind is the term you’re looking for", "score": 3, "replies": [{"body": "I am not familiar with the UI, but shouldn’t most recent price x contracts = most recent value?", "score": 0, "replies": []}]}]}, {"body": "Close this mess by buying it back with a put credit spread (multiple) of at least equal value, can be for a future expiration but at least you’ll be able to get out of having to sell your shares without buying to close. I had to do this to close the short leg of a NET calendar spread a few weeks ago when it went on it’s bull run from $120 to now $191. Profited from the put credit spreads too when the price reached a point where I could close them. This saved my life and my sanity. HTH", "score": 2, "replies": []}, {"body": "no way you sold naked calls on TSLA, jesus christ", "score": 2, "replies": []}, {"body": "I sold a Feb 2023 $1500 PUT and collected $56,000 premium!!  So yes, the shares can go to $440 before I’m underwater!!", "score": 2, "replies": [{"body": "Free money", "score": 1, "replies": []}]}, {"body": "Capital requirement over 100k, well worth that whole $4.80 in premiums!", "score": 2, "replies": []}, {"body": "Thus is why kids shouldn't invest", "score": 4, "replies": [{"body": "Wdym? There’s literally a hamster that’s making more gains than hedge funds. It’s incredibly easy.", "score": 14, "replies": [{"body": "You need a hamster's level of intelligence to succeed?  Well, everyone on this board is screwed.", "score": 5, "replies": [{"body": "yes not really fair to compare us to that highly intelligent species.", "score": 3, "replies": []}, {"body": "Affirmative", "score": 2, "replies": []}, {"body": "A normal hamster or a crayon-eating hamster?", "score": 2, "replies": []}]}, {"body": "> What?", "score": 3, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 month ago\n**Total Comments**|164|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qfw45f)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qfw45f)", "score": 1, "replies": []}, {"body": "That’s one dumb ape 🦍", "score": 2, "replies": []}, {"body": "Robinhood let you sell naked calls?", "score": 1, "replies": []}, {"body": "Lol @ selling naked calls. Genius move.", "score": -1, "replies": []}, {"body": "How were you even allowed to do this?", "score": -1, "replies": [{"body": "My mom gave me her password", "score": 19, "replies": []}]}, {"body": "Ok, ELI5. You lose out on the gains but got the premium correct? You can punt it out but have to buy it back with hopes that it comes down? Feels Stockholm syndromey.", "score": 0, "replies": []}, {"body": "fuck me how fucking retarded do you have to be", "score": -1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Reddit has a new paid team called **Anti-Evil Operations** which goes around permanently banning accounts for saying bad words. We made automod block them so you don't lose your account for saying a word and getting reported. It's not our rule, it's the entire website now, we're just trying to look out for our people. Sorry.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}, {"body": "This makes me feel better about day trading puts instead of buying calls 😭", "score": 1, "replies": []}, {"body": "I wrote 4 of the same calls last Tuesday not thinking it would go up >17% in 9 days, breaking so hard past ATH and 1,000. But it’s less than 20% of my stonk so I was willing to sell it and just buy it back on a drop. It is what it is, though it could still drop below 1000 by Friday. I only treat writing CC’s like getting paid to set a limit order, and I only do it at ATH because I believe in reversion to the mean. But that’s just me, good luck to you, cheering for 999.99 by Friday close. Roll them forward like others said but that seems expensive and I’m too dumb to figure that out.", "score": 1, "replies": []}, {"body": "Go for DWAC then", "score": 1, "replies": []}, {"body": "No clue how someone can be so retarded but also be alive.", "score": 1, "replies": []}, {"body": "I thought the infinite money glitch is to TSLA puts, not calls….", "score": 1, "replies": []}, {"body": "Why TF would you sell kills?", "score": 1, "replies": []}, {"body": "But you don’t lose money right ? If you sell calls your shares …. Should be in the green.", "score": 1, "replies": []}, {"body": "Wait this sub tries to post gains? From what I see you did above average", "score": 1, "replies": []}, {"body": "I think you'll be fine here.  Option writers are going to take in good premium when TSLA closes at 999.99 on friday", "score": 1, "replies": []}, {"body": "LOL @ Option Sellers", "score": 1, "replies": []}, {"body": "Wondering how this went. What was the total loss", "score": 1, "replies": []}]}
{"title": "Why do stocks always moon right after I sell them?", "selftext": "Sold my 20k position in $WISH back in June, a day later wsb catches onto it and it skyrockets 100%. Sold my otm $AFRM calls a day before its partnership with $AMZN and its up 130% since, calls would have printed $10k easily. Sold my Bakkt shares again a day before it announces some stupid ass partnership and of course its up 500% since, which could have been an easy $20k profit. I should probably announce any positions that I'm selling so you guys can inverse me next time.", "id": "qg158y", "created_utc": 1635233440.0, "score": 919, "upvote_ratio": 0.95, "num_comments": 276, "comments": [{"body": "Yea that's odd...\n\n\nBut ok. What are you holding right now?", "score": 479, "replies": [{"body": "The question is, what is he going to sell next?", "score": 540, "replies": [{"body": "I've got a strategy like that.\n\n\"Do I think this stock is going to crash?\" I buy it.\n\n\"Do I think this stock is going to soar super high in price?\" I sell it.\n\nI'm up about 20% in short trades, and 10% long trades this year.", "score": 139, "replies": [{"body": "You could just buy and hold SPY for the same profit.", "score": 91, "replies": [{"body": "But alot less fun", "score": 59, "replies": []}, {"body": "This. If I’m not beating SPY with my trades then why the fuck do it", "score": 23, "replies": [{"body": "The rush!", "score": 6, "replies": []}, {"body": "How to explain the efficient markets hypothesis to degenerates.", "score": 0, "replies": []}]}, {"body": "Yeah and maybe put some of your money into your bank, some into a Vanguard Virgin index and some in the cookie jar for your trip in Mexico. Are you a fucking boomer or what?", "score": 1, "replies": []}]}, {"body": "some people have no problem holding two completely contradictory views in their head at the same time.\n\nIt's a rare mental condition; cherish it while it lasts.", "score": 2, "replies": []}]}, {"body": "Let us all know so we can buy before the moon", "score": 3, "replies": []}, {"body": "In sympathy with \"you have to play to win\", you have to hold it in order to sell it (discounting short selling, obviously)", "score": 1, "replies": []}, {"body": "Yes, we needs to know!", "score": 1, "replies": []}]}, {"body": "Funniest comment. Bravo.", "score": 0, "replies": []}]}, {"body": "Can you sell BB ?", "score": 165, "replies": [{"body": "It still won’t moon enough to unload your heavy bags.", "score": 25, "replies": [{"body": "If the rocket explodes on the way, at least i'll die among the stars.", "score": 1, "replies": []}]}, {"body": "The real questions right here.", "score": 1, "replies": []}]}, {"body": "Because you have paper hands.\n\nYou need 💎👐", "score": 329, "replies": [{"body": "Yeah hold them suckers just long enough, if you're not feeling the G force then don't fucking sell.", "score": 68, "replies": []}, {"body": "He has a responsibility to the sub to tell us what he's going to sell and when", "score": 35, "replies": []}, {"body": "Hes got 🧻🙌🏻", "score": 1, "replies": []}]}, {"body": "You are only looking at the missed opportunities. Were there any other options of stocks that dipped after you sold them? Or maybe you contemplated buying into them but decided not to which later turned out to be a good decision? Our mind always focuses on the FOMO aspect", "score": 117, "replies": [{"body": "Actual great advice on wsb. Cheers bud", "score": 56, "replies": [{"body": "The most important thing I learned was that the market has unlimited opportunities. There are so many damn different securities and derivatives that there's a money making option beeping out. You job is to educate yourself to catch those opportunities when you see them.\n\nIf you're always picking losers, you are actually picking out a pattern but lack the necessary knowledge to put it together and formulate a strategy.\n\nThis is why spending months and a few hundred $ beats out making multiple bags once following a memestock.\n\nOne provides unlimited knowledge potential, the other was a nice payday.", "score": 8, "replies": []}]}, {"body": "Every one I decide to hold off on, moons. Every one that I decide to go into. Loses.", "score": 7, "replies": []}, {"body": "Yeah it’s a lot easier to lament on (and remember) the several multi baggers you missed out on versus the dozens or likely hundreds that you looked into, took a pass, and made the right decision.", "score": 4, "replies": []}, {"body": "This, your answer right here.", "score": 2, "replies": []}]}, {"body": "He sold? PAMP IT (Bogdanoff)", "score": 64, "replies": [{"body": "I have so many OTM calls on PAMP…", "score": 3, "replies": []}]}, {"body": "You always have the option of holding onto a percentage and not completely closing out your position; that way you may recoupe initial outlay and still catch any further upside?", "score": 43, "replies": [{"body": "This is my best tool against fomo", "score": 19, "replies": []}, {"body": "Thats my go-to. If a stock as made gains and I think its at the peak, I usually just sell 50%.", "score": 2, "replies": [{"body": "If I think it may still have some life left in it and playing with house money, why not let profits ride the way I see it. Trailing stops don't hurt.", "score": 1, "replies": []}]}]}, {"body": "Would you please sell some GME?", "score": 36, "replies": [{"body": "Well this aged well! i wish you some nice profits if GME keeps this up, and if so, fuck you", "score": 1, "replies": []}]}, {"body": "Dw I sold AMD at 92 just before the pump to 120. And the dog coin at 0.01", "score": 12, "replies": [{"body": "Sold AMD after it finally crawled up to $114 over months of holding, then immediately watched it rip to over $120 in under 2 weeks.", "score": 6, "replies": [{"body": "Bought a few hundred shares of AMD during April of 2020 for around $40'ish\n\nBought about 10 to 15 Nvidia shares for $587 last year in the summer.\n\nsold the AMD a few months ago for $88 cause I was thinking it's gonna take a while to hit $100\n\nsold Nvidia as it was hovering around $700 and thought it was gonna tank after the split.\n\nI also sold all my 11 shares of TSLA i bought at $425 last year just a few weeks ago to buy some dividend ETF's because i wanted to be more responsible.\n\nWhy teh fuck does God hate me bruh 😂", "score": 9, "replies": [{"body": "Oof, I feel that pain on TSLA. I had 10 shares at like $400 each after the last split, and it was just hovering around $600. Sold at $612 and put the money into VTSAX, and now here we are...", "score": 4, "replies": [{"body": "/r/investing is proud of you", "score": 2, "replies": []}]}]}]}]}, {"body": "Just HODL. Or let us now when you sell :) \nBut I guess everyone can tell a story like yours. It’s just the way it is sometimes.", "score": 9, "replies": []}, {"body": "This is the universes way of teaching you something. You need more patience and more diversity.", "score": 15, "replies": []}, {"body": "I think I read somewhere a long time ago, Wall Streets employ as many psychologists as mathematicians and developers to design the algorithms, so they know approximately the breaking points and the greed points for average people", "score": 8, "replies": []}, {"body": "It’s called “sod’s law”. You shouldn’t feel bad though - if you’d continued holding the stock it would have traded sideways, so you didn’t miss out on anything", "score": 7, "replies": [{"body": "Makes sense. Thanks senpai", "score": 4, "replies": []}]}, {"body": "Alot of ppl feel like that , i assure you 🤣", "score": 5, "replies": []}, {"body": "I feel like you should’ve learned your lesson after the second time 😂 hold that shit man! 💎🙌🏻", "score": 5, "replies": []}, {"body": "Inverse you retard and you’ll be on the right track", "score": 3, "replies": []}, {"body": "You are proper ape :-) maybe gorilla", "score": 3, "replies": []}, {"body": "It's the law, retail trader get ![img](emote|t5_2th52|4267)", "score": 3, "replies": []}, {"body": "Learn from your mistakes and HOLD next time", "score": 3, "replies": []}, {"body": "Remember, Murphy was an optimist.", "score": 3, "replies": []}, {"body": "Don't go all in on one? Then you can play with your reserves while you wait with a little patience for your gut feeling to come to fruition", "score": 3, "replies": []}, {"body": "Did you just sell Progenity?", "score": 3, "replies": []}, {"body": "this happens to me too so what i ended up doing is just selling a small portion of the stocks to trick the system", "score": 3, "replies": []}, {"body": "You are the market maker", "score": 3, "replies": []}, {"body": "I'm reminded of a certain demotivational poster:\n\nIt could be that the only purpose in your life is to serve as a warning to others.", "score": 3, "replies": []}, {"body": "Same here man! \n\nI sold tsla contracts last week thinking it was gonna go down, right now I would of made 5k easy. \n\nI’m just gonna do the opposite! Stop being a bitch and just hold my position longer", "score": 2, "replies": []}, {"body": "I went along with bullshit permabears this month and sold my October 31 Tesla 900c for £90. Now worth around £5,000.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Correction: £19,000\n\nOhhhh exponential gainz.", "score": 1, "replies": []}]}]}, {"body": "I think the problem is that you keep selling…you should buy more but save money for cocaine and whores…", "score": 2, "replies": [{"body": "Coke'n'hookers baby!", "score": 2, "replies": []}]}, {"body": "I thought I was the only one this happened to....", "score": 2, "replies": []}, {"body": "It's because you're the main character in this show. Oh, shit, i've said too much", "score": 2, "replies": []}, {"body": "I’m impressed by your typing ability with paper hands", "score": 2, "replies": []}, {"body": "I was talking with the guys at Goldman about this and they said they watch for qwlow's orders.", "score": 2, "replies": []}, {"body": "Could you sell some TLRY and help a brother out?", "score": 2, "replies": []}, {"body": "You don't have the MOJO.", "score": 2, "replies": []}, {"body": "Just please inform us whenever you sell something, okay?", "score": 2, "replies": []}, {"body": "Small sample size with confirmation bias", "score": 3, "replies": []}, {"body": "Stop trading this way.  But a stock with solid financials/revenue and hold long term.", "score": 5, "replies": [{"body": "Sorry r/investing is a few blocks further", "score": 16, "replies": []}, {"body": "Shut up boomer", "score": 3, "replies": [{"body": "I'm totally not a boomer.", "score": 2, "replies": [{"body": "Shut up boomer.", "score": 1, "replies": [{"body": "Get off my lawn!", "score": 2, "replies": [{"body": "No its too green", "score": 1, "replies": []}]}]}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|30|**First Seen In WSB**|10 months ago\n**Total Comments**|15|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qg158y)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qg158y)", "score": 1, "replies": []}, {"body": "Sell AMC and GME that shit aint mooning again - youll break your streak", "score": 2, "replies": []}, {"body": "Motha Fuckin BBBY went form 14.30 to 14.80 5 minutes after I sold it yesterday.  So pissed.", "score": 1, "replies": [{"body": "You too?", "score": 2, "replies": []}]}, {"body": "Are you a trader or investor? Traders deal with this regularly.", "score": 0, "replies": []}, {"body": "Happens to me also. I have seen too many stocks I bought go DOWN after I bought them. (If the market is so hot, why do my stocks go down??) So I am happy when I can take a profit.", "score": 0, "replies": []}, {"body": "That’s why you hold your 🥭and $fun positions right now, this ain’t over", "score": 0, "replies": []}, {"body": "Have you tried $ROPE?", "score": 0, "replies": []}, {"body": "Corruption", "score": 1, "replies": []}, {"body": "Hedgies inverses sell orders thats small volume. Means it’s retail selling", "score": 1, "replies": []}, {"body": "What else are you planning on selling? Need to know for research purposes.", "score": 1, "replies": []}, {"body": "Could you kindly inform us your next play?", "score": 1, "replies": []}, {"body": "Definitely tell us what your selling next.", "score": 1, "replies": []}, {"body": "Can you sell TSLA today? I could use another 100+% rally in the near future :)", "score": 1, "replies": []}, {"body": "DM me next time you sell mate", "score": 1, "replies": []}, {"body": "Why do you sell them", "score": 1, "replies": []}, {"body": "I have a much worse problem... right after I buy calls the underlying stonks loose value until my options expire worthless.... I have a good paying job, but cant afford anything...", "score": 1, "replies": []}, {"body": "Ladies and gentlemen, we have portnoy", "score": 1, "replies": []}, {"body": "Haha 📄🙌 go brrr", "score": 1, "replies": []}, {"body": "What are you gonna sell next?", "score": 1, "replies": []}, {"body": "Or why do they rank whenever I buy them?", "score": 1, "replies": []}, {"body": "Soooo what are you selling next... Asking for a concerned friend.", "score": 1, "replies": []}, {"body": "I sold AMC at a loss before the run up to $70. Left 25K in the table. My fucking luck.", "score": 1, "replies": []}, {"body": "More importantly, why aren’t you telling us before hand what your about to sell so we can load up ya wanker????", "score": 1, "replies": []}, {"body": "Bogged by da noff", "score": 1, "replies": []}, {"body": "lets put that theory to test. what’s your next move?", "score": 1, "replies": []}, {"body": "Can you do us all a favor and sell your positions on ALL meme stocks? If you do, I’m sure none of us will have a problem giving you a few thousand each 😉", "score": 1, "replies": []}, {"body": "Please do that", "score": 1, "replies": []}, {"body": "Because you touch yourself at night", "score": 1, "replies": []}, {"body": "Let us all know what and when you sell.", "score": 1, "replies": []}, {"body": "Let me know the next shit you’re about to sell- thanks hombre", "score": 1, "replies": []}, {"body": "My user name is from a nickname I earned from my buddies because of this very same problem, except in reverse. Every stock I bought instantly took a red shit all over my TDA dashboard. Turns out, you're supposed to buy the dip and sell the peak, not the other way around.", "score": 1, "replies": []}, {"body": "Because you touch yourself at night. Pervert.", "score": 1, "replies": []}, {"body": "Did you happen to sell Tesla recently by any chance?", "score": 1, "replies": []}, {"body": "What are you planning on selling next? I want to be rich", "score": 1, "replies": []}, {"body": "What else you gonna sell soon?", "score": 1, "replies": []}, {"body": "next time, better tell us what u plan on selling when, so we can hop on and buy it 🙌🏽", "score": 1, "replies": []}, {"body": "I know right!?", "score": 1, "replies": []}, {"body": "Post what you're selling next", "score": 1, "replies": []}, {"body": "You are the chosen one.\n\nI've got a buddy at work like that. He sold his TSLA last week.", "score": 1, "replies": []}, {"body": "Because you hold them down", "score": 1, "replies": []}, {"body": "Maybe time in the market actually is better than timing the market.....", "score": 1, "replies": []}, {"body": "I sold NVDA at close yesterday so I'm retarded too, if that makes you feel better.", "score": 1, "replies": []}, {"body": "I sold $15,000 of AMC at under $9.00", "score": 1, "replies": []}, {"body": "Inverse yourself bro then you will start making money", "score": 1, "replies": []}, {"body": "Cause you’re being a 📄🙌🐩", "score": 1, "replies": []}, {"body": "How do you “sell” positions?", "score": 1, "replies": []}, {"body": "Stop selling", "score": 1, "replies": []}, {"body": "You lack 💎🙌🏼", "score": 1, "replies": []}, {"body": "Maybe next time sell only 1 share of that particular positions, and the other xxxx shares you own can boom?", "score": 1, "replies": []}, {"body": "Time in the market is better than timing the market.", "score": 1, "replies": []}, {"body": "Youre the catalyst", "score": 1, "replies": []}, {"body": "Cuz your fear and greed", "score": 1, "replies": []}, {"body": "Let me know next time you sell something", "score": 1, "replies": []}, {"body": "Shit happened to me with LEV, DKNG, ETSY, AMD, you name it", "score": 1, "replies": []}, {"body": "it can only mean one thing. you are a premature ejaculator. see a doctor", "score": 1, "replies": []}, {"body": "Paytience", "score": 1, "replies": []}, {"body": "Please do. Any consolation I sold a load of FTM at £1.04 - hit £2.50 yesterday. Was only a few weeks ago.", "score": 1, "replies": []}, {"body": "Because life is rigged. Even the Bible says so.", "score": 1, "replies": []}, {"body": "Cause you’re a paper handed bitch", "score": 1, "replies": []}, {"body": "The market is watching you.", "score": 1, "replies": []}, {"body": "Because you don’t pray to Jesus.", "score": 1, "replies": []}, {"body": "Wojak?", "score": 1, "replies": []}, {"body": "ONE OF US", "score": 1, "replies": []}, {"body": "Can you sell some DWAC please? WSB would appreciate it", "score": 1, "replies": []}, {"body": "If it makes you feel better I sold my Tesla $800 Call 11/1 a month ago for a gain of $200.", "score": 1, "replies": []}, {"body": "Paper hands?", "score": 1, "replies": []}, {"body": "Dude same shit here. I think it’s because they are so heavily shorted that soon as shares become available they are able to close a short position.", "score": 1, "replies": []}, {"body": "Same shit happened to me with Plug Power. I held shares for over a year and after that initial run up to 75 they sat in mid twenties. Day after I sell they run up and have been holding steady in the mid thirties.", "score": 1, "replies": []}, {"body": "No idea, but are you planning on selling anything in the next week or so?\n\nAlso, it’s because you have ![img](emote|t5_2th52|4263)", "score": 1, "replies": []}, {"body": "Yeah, I'm gonna need you to post what you sell . . .", "score": 1, "replies": []}, {"body": "First law of ballodynamics, money always flows from people with tiny balls to people with big balls.", "score": 1, "replies": []}, {"body": "It's ok I was also holding PROG at 0.90, sold it to see it skyrocket the new 5 days... and look at it today. I feel the pain.", "score": 1, "replies": []}, {"body": "At least you didn’t sell everything you had at the lowest point and then watch it go ALL THE WAY UP up to its ATH", "score": 1, "replies": []}, {"body": "I do not know, but you should start to tweet what and when you are selling you I can pick up what your selling.", "score": 1, "replies": []}, {"body": "Only sell 1… see what happens", "score": 1, "replies": []}, {"body": "Please sell some MARK", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Like 2 minutes after", "score": 1, "replies": []}]}, {"body": "Because you don’t have diamond hands?😃", "score": 1, "replies": []}, {"body": "The same reason they drop right after I buy them", "score": 1, "replies": []}, {"body": "You’re not an insider.", "score": 1, "replies": []}, {"body": "If it makes you feel better, I listened to the apes and bought $wish @$12. I may have been late to the party. Still holding.", "score": 1, "replies": []}, {"body": "First stock I ever invested in was 3dfx maker of the voodoo video card.Was leading graphics card manufacturer at that time.  Within a year they went out of business.", "score": 1, "replies": []}, {"body": "I thought I am the only one who posses this super power", "score": 1, "replies": []}, {"body": "Why do my stocks tank when I buy them?", "score": 1, "replies": []}, {"body": "Time in the market beats timing the market on the long run. It is the most difficult thing to plan your exit so I suggest a long only strategy for you or be happy with your exit positions, who knows maybe you could have panic sold somewhere between your exit point and the rise of the course again.", "score": 1, "replies": []}, {"body": "You are the definition of paper-hands. Stop paperhanding.", "score": 1, "replies": []}, {"body": "The psychological game hurts", "score": 1, "replies": []}, {"body": "Murphy’s law", "score": 1, "replies": []}, {"body": "Sell your GME", "score": 1, "replies": []}, {"body": "You’ve been [Bogged](https://youtu.be/61Q6wWu5ziY)", "score": 1, "replies": []}, {"body": "Why do you always sell your stocks before they moon?", "score": 1, "replies": []}, {"body": "Sell your TSLA plz", "score": 1, "replies": []}, {"body": "Now do it for BB", "score": 1, "replies": []}, {"body": "This is why dead people typically have a better ROI.", "score": 1, "replies": []}, {"body": "I sold 5000 shares of GME for 14.02 in December 2020, it still stings.", "score": 1, "replies": []}, {"body": "lol . . . I think I have the same problem!!!", "score": 1, "replies": []}, {"body": "Sounds like you need to learn to hold and be patient lad.", "score": 1, "replies": []}, {"body": "The other side of the trade are experts at market psychology and know exactly how to manipulate you and me.", "score": 1, "replies": []}, {"body": "You have paper hands", "score": 1, "replies": []}, {"body": "\"I made my money by selling too soon.\"\n\n-Bernard Baruch", "score": 1, "replies": []}, {"body": "It could be worse..you could be a WISH bag holder like half of this sub.", "score": 1, "replies": []}, {"body": "Sold NVDA after it dropped from $228 to $200 now it’s $245 a couple of weeks later. Had one Tesla call about to pull the tigger on worth $3k to buy but thought the break even of $940 was too high that would of been 10k in a week. Goddamn it!!!!", "score": 1, "replies": []}, {"body": "Happens to me exactly the same. We should create a youtube channel where we announce our moves, people would make millions. At least we could make ad revenue to offset our losses.", "score": 1, "replies": []}, {"body": "Because science", "score": 1, "replies": []}, {"body": "Someone needs to sell off $wish and $BB again….*sigh*", "score": 1, "replies": []}, {"body": "I just hold and watch my money disappear.", "score": 1, "replies": []}, {"body": "what you selling next...i've got some play money", "score": 1, "replies": []}, {"body": "Keep waiting", "score": 1, "replies": []}, {"body": "Sold $auph @16 just before the run to $20 and. Now $30", "score": 1, "replies": []}, {"body": "Cause god hates you", "score": 1, "replies": []}, {"body": "Please buy and sell $wish again", "score": 1, "replies": []}]}
{"title": "Tesla 4k to 137k in 2 weeks across 20 trades", "selftext": "", "id": "qga8ca", "created_utc": 1635265780.0, "score": 466, "upvote_ratio": 0.95, "num_comments": 131, "comments": [{"body": "Congrats try not to blow it all in one place", "score": 63, "replies": [{"body": "Thanks! I'll be pulling out $10k this week and continue trading with the rest :)", "score": 41, "replies": [{"body": "You should consider doing the opposite, put most of that money into something safe and use the 10k to trade up", "score": 28, "replies": [{"body": "But then I won’t get sweet sweet karma", "score": 16, "replies": [{"body": "Right. So YOLO into NKLA then?", "score": 5, "replies": []}]}]}, {"body": "Smart man I hope you can turn the rest into a million good luck brother", "score": 35, "replies": [{"body": "That's the goal! I'll be pulling out 10% every 50k along the way. Good luck to you with your trading as well!", "score": 26, "replies": [{"body": "Won’t you get stuck at 500k then?", "score": 10, "replies": [{"body": "If I make it to 500k, then I'll switch to 10% every 100k. The plan is to increase the increments between withdrawals as I increase the account size (as long as I don't blow it all up)", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Fuck you and congratulations", "score": 57, "replies": []}, {"body": "Sick I just bought $2 worth of Tesla stock on Robinhood see you on the other side brotha", "score": 48, "replies": []}, {"body": "Show me the ways of imaginary doorways and I’ll give you a %", "score": 11, "replies": [{"body": "Lol that’s okay, no need to give me a cut. \n\nI find bounce/reject levels during premarket based off volume walls and fib levels. Wait for Tesla to move to the general range of the bounce/reject region & buy calls or puts based off that. Sell a few minutes later. Max hold time is like 20 minutes", "score": 36, "replies": [{"body": "So you did this all by day trading? You sir, are my hero. Would you like a celebratory blow job from me and the AMC apes?", "score": 12, "replies": [{"body": "Yeah! 1-2 trades per day, quick 5-20 minute scalps\n\nEdit: I’ll only take the blowie if it’s behind a Wendy’s", "score": 12, "replies": [{"body": "out of curiosity what tools do you use to find volume and other stats during premarket?", "score": 4, "replies": [{"body": "I use the VWAP, AutoFib, Fixed Range Volume Profile, and level 2 data to see order blocks and determine the levels I think the stock will reverse. Then keep an eye on news and wait for market open.", "score": 14, "replies": [{"body": "Very interesting thanks. Out of curiosity your trading account would be larger than 25k for day trade limits right?", "score": 3, "replies": [{"body": "Depends on the type of account and the broker. If your using Robinhood, under 25k no matter what can't do more than 3 day trades in a 5 day period. Most reputable brokers, like TDA and Etrade, allow day trades as long as you don't run out of capital, and only in a cash account under 25k. So if I have 10k in a *margin* account, I'm bound to day trade rules. But since I had a cash account, I was good to go as long as I didn't spend more than my cash balance.", "score": 2, "replies": [{"body": "I see I see. I have a fair bit of learning before day trading but Its a long term goal of mine. Any reading material or channels you could recommend to a beginner? Cheers", "score": 2, "replies": [{"body": "Absolutely! Shoot me a PM, I’ll give you my whole list of things I read", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "> levels during premarket based off v\n\nDo you look at 2 minute charts? Volume during PM is pretty low so I am curious to see how you find those levels", "score": 1, "replies": [{"body": "5 min charts. I use auto VWAP and AutoFib along with fixed range volume profile to find the bounce/reject levels.", "score": 7, "replies": [{"body": ">ed range volume profile to find\n\nThanks, will give it a try too, I really want to be successful at trading tsla and been struggling recently on bad entry and exits... Happy to give you a cut if you can show me the ways haha", "score": 2, "replies": [{"body": "Nah that’s not necessary lol. Shoot me a pm when you’re doing TA, I’ll help where I can :)", "score": 2, "replies": [{"body": "Thanks much! Definitely taking you up on your offer", "score": 2, "replies": []}]}]}, {"body": "What is a bounce/reject level? \n\nI have no clue how to trade, just curious.", "score": 2, "replies": [{"body": "Where a major support or resistance is. Think about throwing a tennis ball on your kitchen floor. It’ll bounce back up once it gets to that floor. Or if you throw hard enough, it breaks the floor and keeps going. Same thing with stocks. I look for those support or resistance levels and trade off of them", "score": 1, "replies": []}]}]}]}]}, {"body": "If you want to do something similar, dedicate yourself to learning the overall patterns and movements of one single stock, then play off that :)", "score": 15, "replies": [{"body": "Got any links for where you learned some of that?", "score": 2, "replies": [{"body": "Investopedia is a great source. The Babypips course is great for learning the basics of overall trading too!", "score": 5, "replies": [{"body": "Crazy that you can teach yourself to see patterns that earn you money like this. Guess I know what I'm reading this week, lol.", "score": 2, "replies": [{"body": "Feel free to reach out if you have any questions, too. I'm happy to help where I can.", "score": 5, "replies": [{"body": "Hey dude, never thought of doing a small tutorial on YouTube about how you trade and some analysis? I would love to watch it, even livestreams!", "score": 2, "replies": []}]}, {"body": "People spends 10s to 100s of thousands of dollars on 4-year degrees to earn in a year what this guy earned in 2 weeks from reading some internet pages.", "score": 2, "replies": []}]}]}]}, {"body": "Could you show us an example using today's graph?", "score": 1, "replies": []}]}]}, {"body": "Congrats OP! I made 2K on TSLA call spreads before earnings. Thought about getting back in again but as usual TSLA can run away pretty fast when it’s got momentum.", "score": 7, "replies": [{"body": "I trade between market open and 10am usually, and I watch it like a hawk. My day job coworkers know not to bother me during that time lol. Keep at it and your account will keep growing!", "score": 11, "replies": [{"body": "Do you order pizza for the crew when you win?", "score": 3, "replies": [{"body": "I should probably start lol. They just know I’m busy, they don’t know what I’m doing or how much I’m making. I bring in baked goods each Saturday though so that makes up for it I think", "score": 5, "replies": [{"body": "Order it anonymously :) always have it delivered to a different person, don't tell them, and leave a special comment on the order saying share with all", "score": 3, "replies": [{"body": "That’s a great idea. Thank you! I’m not in the office on Friday so I’ll do it then :)", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Why can’t this be my account lol", "score": 6, "replies": [{"body": "It just takes time and practice!", "score": 2, "replies": [{"body": "Been “practicing” for 8 years never had that kind of returns", "score": 4, "replies": [{"body": ">8 years \n\nI wonder if volatility is the new black.  I hope so.", "score": 1, "replies": []}]}]}]}, {"body": "Now that’s sexy", "score": 4, "replies": [{"body": "No you’re sexy", "score": 5, "replies": []}]}, {"body": "Looking at getting into trading, what app are you using?", "score": 3, "replies": [{"body": "The app I have in the screenshots is Etrade. I also use Fidelity and TDAmeritrade.", "score": 2, "replies": [{"body": "Why do you use 3 different ones?", "score": 3, "replies": [{"body": "Etrade for options, tdameritrade for swing trading, fidelity for DRIP, long term, and retirement accounts. I don’t like having all my money in one account just in case something happens where the brokerage is hacked. I’d rather have it spread through a few companies", "score": 6, "replies": []}]}]}]}, {"body": "How the fuck did you do this in two weeks? I saw the screenshot but those were two orders of three contracts each lol. You picked the best time to trade TSLA bro. \n\nCongrats and fuck you btw!", "score": 3, "replies": [{"body": "I made a series of 20 trades over the two weeks, not just those few :) I’ve been day trading it every morning\n\nEdit: at $151k now", "score": 2, "replies": [{"body": "That’s epic. I love day trading $TSLA too. \n\nYou did that all without swinging any calls overnight?", "score": 2, "replies": [{"body": "Yup! I don’t like to swing, too much risk lol", "score": 1, "replies": [{"body": "Your current strategy is working and wouldn't change a thing until it quits working...Well done thus far.", "score": 1, "replies": [{"body": "I mean, I’ve already mentally written off my initial investment as a loss. I’ve taken out profits and I’m at $151k after withdrawing. I’m not too worried about my strategy not working. This is all fun money\n\nEdit: Granted: I did jump into trading this way at a very convenient time, but still", "score": 1, "replies": [{"body": "I wouldn't treat it as fun money unless you have $10 mil socked away....treat it as a business because one thing I can guarantee is that ALL your costs are going up - (Housing, Yachts, Cars, Gas, Food, Fun, Taxes, Alcohol, Guns, etc.)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "> I'm not sure why you are congratulating me. I do love that you think I am trading TSLA though.", "score": 1, "replies": []}]}, {"body": "Happy to verify with any mods if necessary.", "score": 3, "replies": []}, {"body": "Seeing AIG gives me nightsweats…. Must get off this post asap 😂", "score": 2, "replies": []}, {"body": "Grab 100.shares and sell weeklies.", "score": 2, "replies": [{"body": "I’ve thought about it!", "score": 1, "replies": []}]}, {"body": "I wanna be Rich too, sad noises", "score": 2, "replies": []}, {"body": "So it seems your trading strategy is to just own tesla.", "score": 2, "replies": [{"body": "No, I’m buying calls and puts. If I had bought Tesla, I would’ve been able to pay for about 5 shares. I would be up about $1000 if I had just bought shares. I do own some tesla shares in my long term portfolio, these gains are entirely from options in the first half hour of the market\n\nEdit: spelling", "score": 5, "replies": [{"body": "Really dumb question, but how does one make money with option selling?  \nDo you buy one cheap, and once the stock rises and the options follow, you sell them immediately?   \nJust started with trading and bought a few hundred calls today for Tesla and the main plan was to just hold it until they expire and hope to profit in a year but what you are doing sounds kinda fun", "score": 1, "replies": [{"body": "I'll be blunt, do some more research before jumping into options. Theyre risky. When an option expires, it expires worthless. You buy it with either the intent to sell higher or the intent to exercise the option and purchase or sell 100 shares at a set price.", "score": 6, "replies": []}]}]}]}, {"body": "when you scalped the options, did you select strikes ITM, ATM or OTM", "score": 2, "replies": [{"body": "Typically atm or otm but close to the money. My goal is to get into the money as fast as possible.", "score": 2, "replies": [{"body": "Right on, im just starting out scalping options.", "score": 3, "replies": [{"body": "Best of luck to you mate! theres lots of money to be made.", "score": 1, "replies": []}]}]}]}, {"body": "I'm hoping it will recover to 1,100 tomorrow..", "score": 2, "replies": [{"body": "Me too! I'm all cash at the moment but I'd love to have a bounce to 1100 for another sweet gain", "score": 2, "replies": []}]}, {"body": "What's your win: loss ratio?", "score": 2, "replies": [{"body": "At this point, I haven't had any losses in this account.", "score": 6, "replies": [{"body": "Possible to get a detailed write-up on the strategy?\n\nI've used fib and auto support/resistance lines but never auto vwap. Auto support and resistance is dynamic so not entirely accurate. \n\nI also understand that you're trying to get as close to the money as possible but what about your time frame? How far out is expiration?", "score": 3, "replies": [{"body": "In addition to the VWAP and the Autofib, I look at order blocks and the fixed range volume profile for premarket and the day before to find major supports and resistance. When it gets to those levels, I buy either calls or puts and wait until I get to the next level to sell. \n\nAs far as expiration goes, it depends on the day. I buy this weeks expiration Monday through Wednesday, and I buy next weeks expiration on Thursday and Friday. Hope that helps!!", "score": 5, "replies": [{"body": "It does help... Sorry for prying so much but this is an interesting strategy.\n\nSo with the fixed range volume profile, you're seeing that there are sell orders at certain prices that outweigh the buy orders or vice versa.  You can also see that volume is increasing/decreasing overall at certain prices.  Do I have this correct?  \n\n\nEdit:  Not exactly sure what you're looking for with the VWAP... Can you explain that please?", "score": 2, "replies": []}]}]}]}]}, {"body": "Are you making 1-2 trades every day, or are you waiting until it hits resistance lines (which could be days apart)?", "score": 2, "replies": [{"body": "I’m making 1-2 trades per day, but I only hold for a max of 20-30 minutes. Usually my trades are 5-15 minutes long. I use the 5 minute chart and look for volume walls based on that, but and sell between them :)", "score": 2, "replies": [{"body": "Thank you! Congrats on the great returns :)", "score": 2, "replies": [{"body": "Of course! Thanks 😁", "score": 1, "replies": []}]}]}]}, {"body": "If only ...", "score": 2, "replies": []}, {"body": "Man I need to get into options….any advice?", "score": 2, "replies": [{"body": "Sure! Shoot me a PM with questions & Ill do my best to answer them :)", "score": 1, "replies": []}]}, {"body": "How much did you start with when you first started day trading?", "score": 2, "replies": [{"body": "I started a few years ago with about $500. I just opened the account in the photo on the 7th of October and the money cleared on the 11th\n\nEdit: I only put $4k into this account", "score": 1, "replies": [{"body": "What's a good amount roughly you think someone when starting to learn to daytrade (full or part time)", "score": 1, "replies": []}]}]}, {"body": "Do you go all in every trade?", "score": 2, "replies": [{"body": "Not all in, but close. I do about 85% of my account each trade. Then if things don’t go my way I can throw the last 15% in", "score": 3, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|9 months ago\n**Total Comments**|32|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=qga8ca)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=qga8ca)", "score": 1, "replies": []}, {"body": "How was this done exactly? I could actually afford a 4k bet lol, but I just don't understand what goes on on this subReddit, I don't get shorting, futures, etc.", "score": 1, "replies": [{"body": "I made a series of 20 trades across 12 days. This wasn't one singular bet. I started with 4k and trading calls and puts until I got to where I'm at", "score": 2, "replies": []}]}, {"body": "Amazing 🤩", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "> I still think GME is a scam. I'm not going to lose my money on it like those other suckers who bought the stock at $7 and didn't sell when they could have made 50x their investment.", "score": 1, "replies": []}]}, {"body": "How many call trades and how many out trades?", "score": 1, "replies": []}]}
