{"title": "Big afternoon for ER today! AMD, MSFT, SKX and a handful of others reporting after the bell!", "selftext": "", "id": "58hnzf", "created_utc": 1476979562.0, "score": 30, "upvote_ratio": 0.95, "num_comments": 10, "comments": [{"body": "It's going to be a big afternoon for ER today!\n\nHere are the companies we are watching:\n\n*(ticker symbols are clickable!)*\n\n* **[$AMD](http://stocktwits.com/symbol/AMD)**\n* **[$MSFT](http://stocktwits.com/symbol/MSFT)**\n* **[$SKX](http://stocktwits.com/symbol/SKX)**\n* **[$PYPL](http://stocktwits.com/symbol/PYPL)**\n* **[$SLB](http://stocktwits.com/symbol/SLB)** \n* **[$ATHN](http://stocktwits.com/symbol/ATHN)** \n* **[$ETFC](http://stocktwits.com/symbol/ETFC)** \n* **[$PFPT](http://stocktwits.com/symbol/PFPT)** \n* **[$SAM](http://stocktwits.com/symbol/SAM)** \n* **[$BRO](http://stocktwits.com/symbol/BRO)** \n* **[$SWN](http://stocktwits.com/symbol/SWN)** \n* **[$CCI](http://stocktwits.com/symbol/CCI)** \n* **[$KLAC](http://stocktwits.com/symbol/KLAC)** \n* **[$MXIM](http://stocktwits.com/symbol/MXIM)** \n* **[$CLS](http://stocktwits.com/symbol/CLS)** \n* **[$SIVB](http://stocktwits.com/symbol/SIVB)** \n* **[$APOL](http://stocktwits.com/symbol/APOL)** \n* **[$KNL](http://stocktwits.com/symbol/KNL)** \n* **[$FCB](http://stocktwits.com/symbol/FCB)**\n\nHere are the consensus estimates for a few of these names:\n\n# **Thursday After-Hours:**\n###### ([CLICK HERE FOR THURSDAY'S AFTER-HOURS ER!](http://i.imgur.com/k4kSW58.png))\n\nAre any of you guys here on r/StockMarket playing earnings? Let's hear 'em! GL to all who are playing any of these names going into their respective ER later today! :)", "score": 2, "replies": []}, {"body": "LMAO amd", "score": 2, "replies": [{"body": "That was a wicked immediate spike down!\n\n> **[CHART](http://i.imgur.com/TSD1ut8.png)**\n\nit is well off of those AH's lows now though...", "score": 1, "replies": [{"body": "everyone on this sub was taking about amd and drinking the kool-aid ", "score": -1, "replies": [{"body": "I drank it :-(", "score": 1, "replies": [{"body": "I sipped a bit at 5$ and sold 2 days ago at 6$. Not holding a hype train but I'm happy to sell you some.", "score": 1, "replies": []}]}]}]}, {"body": "Fuck my shit up", "score": 1, "replies": [{"body": "I bought some at 6.77. Got excited when it almost hit 7. ", "score": 1, "replies": []}]}]}, {"body": "Meanwhile...how about Softie (MSFT) -- that would be an ATH if it opens here tomorrow!\n\n> **[CHART](http://i.imgur.com/xlQwuLr.png)**", "score": 1, "replies": []}, {"body": "lol amd", "score": 0, "replies": []}]}
{"title": "Amd stock - should I be panicing ?", "selftext": "[deleted]", "id": "58k0kw", "created_utc": 1477004843.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 19, "comments": [{"body": "5% is a substantial loss? Wtf. Shouldn't be investing at all if you can't handle 5-10% drop..", "score": 9, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Well if you did your homework and feel that the company is going to be fine long term, then all that's just short term noise/paper losses.  \nUp to you.", "score": 5, "replies": []}, {"body": "It's happened. \n\nRecently even. ", "score": 2, "replies": []}]}]}, {"body": "Going back to $5.00 ", "score": 3, "replies": [{"body": "Yeah ok, and AAPL makes good products. We need more jokes on here.\n", "score": -7, "replies": []}]}, {"body": "Hold them.\n\nSounds like you were greedy, if you really believed AMD would \"surge tomorrow AND Monday\" -- you could have taken a half position before the ER (I don't need to tell you that they can drop the price even after a solid report).  Reaction after the ER can be volatile.  Then taken the other half tomorrow.\n\nThink about this next time.", "score": 3, "replies": []}, {"body": "If you arent knowledgeable on the topic then you shouldn't be day trading on it, either stop risky gambits altogether and invest in ETF or leave all your \"bets\" in long term.  \n\nTaking it out after its fallen and taking it out to preserve wealth are classic rooky mistakes and will ensure you do terribly, the dividends alone will make sure of that.", "score": 5, "replies": []}, {"body": "I'm more or less just wondering how long I need to hold to profit big. Tomorrow might be an amazing buy in opportunity.", "score": 2, "replies": []}, {"body": "So you bought the stock blinding praying for an earnings pop? That sounds like a trade to me. General rule is not to turn trades into investments. Unfortunately things don't always go the way you planned, but you should always stick to the plan. ", "score": 1, "replies": []}, {"body": "IMHO AMD had a bad earnings report but they're still growing in spite of their inability to provide a good timeline on their better processor. It will take months before they're up to the $8 level but once they roll out their game-changer processor they'll be back up to $40/share. That'll take a year or so. As far as $8/share, you may have to hope that traders will be less short-sighted which won't happen. $6 is a good bet for them until they realize revenues from better products. If those products ever come to fruition. I shorted them ahead of earnings and I was hoping for a release like the one they gave. Their annual release isn't going to be any better if they're taking charges on quarterly releases at this point in the year. Expect it to get worse before it gets better, but I honestly believe that it will get better. ", "score": 1, "replies": [{"body": "$40. Ok", "score": 1, "replies": [{"body": "That's why I put IM \"H\" O, replier.", "score": 2, "replies": [{"body": "You better have a GD good reason it's going to $40.", "score": 1, "replies": [{"body": "The buyout", "score": 1, "replies": []}, {"body": "Ahem", "score": 1, "replies": []}]}]}]}]}, {"body": "Look at the chart, don't you think if it popped to $8 then the people who bought at $3.25 might start selling? That's probably what we've got here. \n\n3 cents earnings and a weak YoY 4Q guide, from a momentary perspective yeah not good. ", "score": 1, "replies": []}, {"body": "A better way to play earnings is sell options. You will have the advantage with fear being overestimated. \n\nIf you decide to hold the stocks. I suggest selling call options against your stocks to make some extra cash. Target 45 days to expiration and buy them back when the value drops by 50%. ", "score": 1, "replies": []}, {"body": "Well, did you end up selling low? I need an update..", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "nice. it was a good day. i got in right after dilution and im long.", "score": 1, "replies": []}]}]}]}
{"title": "Looks like TSLA rounded the moon and is headed straight back down", "selftext": "[deleted]", "id": "58get8", "created_utc": 1476964393.0, "score": 12, "upvote_ratio": 0.8, "num_comments": 10, "comments": [{"body": "It's called time to buy, idiots", "score": 5, "replies": []}, {"body": "How come?", "score": 1, "replies": [{"body": "It popped in anticipation of a new announcement from Elon and although the announcement is cool, it definitely didn't warrant that type of pop ", "score": 5, "replies": [{"body": "As I recall he explicitly said 200 by Wednesday and it doesn't stay below 200 for long in general.\n\nWere you going to hold him to TSLA being above 200 for the rest of his life? ", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "> he got all smug and all-mighty with a post saying 'HA! I told you so'\n\nWell good thing your post isn't doing the exact same thing. ", "score": 9, "replies": [{"body": "Where in this post did I talk about predictions I made? ", "score": -5, "replies": [{"body": "You're right. You're getting smug about not making a prediction", "score": 7, "replies": []}]}]}, {"body": "I'm confused. I called it and was right. \n\nI never said it would stay above $200 indefinitely. Turns out you can do this thing called selling.\n\nThat said, though, here we go again: It will be back above $200 by the end of the week, if not by the end of the day, so it's time to buy again, as I did. \n\nWhy? \n\nBecause long-term they're going to have the first fully self-driving car, earnings are coming up, and because you're a faggot.", "score": 3, "replies": []}]}]}]}]}, {"body": "Without no profit there is no moon.", "score": 1, "replies": []}]}
{"title": "$TSLA down 2% pre-market after delivering the future of transportation", "selftext": "Buy. ", "id": "58gjnf", "created_utc": 1476966404.0, "score": 38, "upvote_ratio": 0.83, "num_comments": 19, "comments": [{"body": "I want a bigger dip to go long on", "score": 8, "replies": [{"body": "Hard to sit on them when they're under 200, its easy $ every time", "score": 5, "replies": [{"body": "Free money", "score": 6, "replies": []}]}]}, {"body": "I just watched the video and was blown away. Imagine being able let your car drop you off at the door and return to pick you up when you leave. \n\nTesla does amazing things. ", "score": 20, "replies": [{"body": "I think the self parking is what blew me away. More concerning is where does it know to stop looking. And I don't mean the backing into a spot, I mean the process of looking through a damn parking lot without a driver! That's nuts!", "score": 7, "replies": [{"body": "Yeah, after the initial amazement of the car being able to park itself wore off I too started thinking about such a thing might actually work in the real world.\n\nSeems to me that mall entrances would be really crowded. People are lazy. Plus, it'd be a really cool thing to do. Most everyone with a Tesla will be doing it. ", "score": 5, "replies": []}, {"body": "Musk said it reads the signs as well, and will determine if it's within the rules to park there", "score": 1, "replies": [{"body": "That was for the handicapped spot. I meant like the boundaries of where it would look for signs and parking. Like when does it know when to stop looking for parking because none is available? There's no sign for that", "score": 1, "replies": [{"body": "Maybe it just circles :)", "score": 1, "replies": [{"body": "I want it to drive off, go find a nearby charging station and power up, then go get some hooker and bring her to the nearest giant for some of Perdue's finest - before bringing her and the tendies back to pick me up from work.\n\nBonus points if it comes with Hooker-Analysis-Software that doesn't require internal probing.", "score": 3, "replies": []}]}]}]}]}, {"body": "Wasn't that the stated plan all along?", "score": 2, "replies": []}, {"body": "Yes and it gives it's technology away, elon wants everyone to have it. He says he wants go chage the market aka no patents. So why long a tech company if only has the history of making cars for less then a decade when BMW copy and paste into their car? \n\nLong Toyota \n\nEdit: spelling", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Toyota is already only a few steps behind Tesla on the AI driver side. Got some ways to go before electric car becomes a thing IIRC, but from an engineering standpoint, if Tesla went tits up overnight, Toyota's next in line - especially if they can cannibalize Tesla's data.", "score": 2, "replies": []}]}]}]}, {"body": "Why are TSLA options so illiquid lately? ", "score": 3, "replies": []}, {"body": "This doesn't matter if the government says no", "score": 3, "replies": [{"body": "Love government intervention !", "score": 2, "replies": []}]}, {"body": "I feel like this is the most passive aggressive title ever. \n\nu ok op? ", "score": 1, "replies": [{"body": "😎", "score": 1, "replies": []}]}]}
{"title": "10/20 Thursday Market News & Stock Movers (Earnings Bonanza!)", "selftext": "#Good morning traders of the r/wallstreetbets sub! Happy Thursday! Here are your market movers & news-\n\n*****\n\n#[Frontrunning: October 20](http://www.zerohedge.com/news/2016-10-20/frontrunning-october-20)\n\n* Global stocks nudge higher after final U.S. presidential debate (Reuters)\n* Trump, Clinton Double Down: Final Debate By the Numbers (BBG)\n* Will Trump accept election's outcome? 'I will keep you in suspense' (Reuters)\n* After Sedate Start, Trump Takes the Bait (WSJ)\n* ‘Rigged’ Election Charge Takes Spotlight (WSJ)\n* Debate highlights: Trump calls Clinton a 'nasty woman' (Reuters)\n* Draghi Set to Stay Tight-Lipped as Investors Look for Cues (WSJ)\n* Draghi Seen Keeping Up Suspense on Future of ECB Stimulus Plan (BBG)\n* Philippine President Duterte announces 'separation' from United States (Reuters)\n* Plummeting Newspaper Ad Revenue Sparks New Wave of Changes (WSJ)\n* The Tech Bubble Didn’t Burst This Year. Just Wait (BBG)\n* How ISIS Used Chat Apps to Direct Attacks in West (WSJ)\n* What It Takes to Be the World’s Biggest Crude Producer (BBG)\n* New Front Opened in Battle for Mosul (WSJ)\n* Turkish Lira Advances After Central Bank Holds Interest Rates (BBG)\n* Turkey Central Bank Unexpectedly Holds Rates on Weaker Lira (BBG)\n* It's Better to Buy Than to Rent, and It Probably Always Will Be (BBG)\n* New Caterpillar CEO Faces Tough Decisions as Company Digs Out (WSJ)\n* Broken Indicators Mean It's Growing Harder to Spot Troubles in the Market (BBG)\n* Americans Work 25% More Than Europeans, Study Finds (BBG)\n* ‘Passive’ Investing: A Lot More Active Than You Think (WSJ)\n\n*****\n\n#STOCK FUTURES NOW:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](http://elite.finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET HEAT MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET HEAT MAP!](http://i.imgur.com/QQsk57r.png)**)\n\n*****\n\n#YESTERDAY'S S&P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&P SECTORS CHART!](http://i.imgur.com/I8tOCms.png)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](http://i.imgur.com/wHbdLIh.png)**)\n\n*****\n\n#TODAY'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR TODAY'S EARNINGS CALENDAR!](http://i.imgur.com/LKgBeUE.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING DISCUSSIONS:\n\n* TSLA\n* EBAY\n* VZ\n* MSFT\n* AAL\n* WBA\n* KMI\n* EXPE\n* ALK\n* TRV\n* DHR\n* BK\n* TXT\n* HLX\n* PBYI\n* PHM\n* HZNP\n* WBC\n* AXP\n* ADS\n* WF\n* MBLY\n* CTXS\n* CREE\n* V\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS: TRV, VZ, AAL, WBA, DNKN, ALK, BK, DGX, AXP, TSLA, MAT, EBAY, NFLX, WFC, GOOGL\n\n######(**[source](http://www.stockaholics.net/threads/10-20-thursday-stock-news-movers-trv-vz-aal-wba-dnkn-alk-bk-dgx-axp-tsla-mat-ebay-nflx.2775/)**)\n\n*****\n\n> **Travelers** — The insurer earned an adjusted $2.40 per share for the third quarter, two cents a share above estimates. Revenue also came in above forecasts. Profit did fall from a year earlier, however, due to higher weather-related losses, but premiums did rise to a record high.\n\n#**STOCK SYMBOL:** TRV\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TRV&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TRV)**)\n\n*****\n\n> **Verizon** — Verizon beat estimates by two cents a share, with adjusted quarterly profit of $1.01 per share. Revenue fell slightly shy of analysts' forecasts, however. The company said it is in the midst of transforming itself in a \"challenging environment,\" but noted strong profitability and customer loyalty.\n\n#**STOCK SYMBOL:** VZ\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VZ&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VZ)**)\n\n*****\n\n> **American Airlines Group** — The airline earned $1.76 per share for the third quarter, seven cents a share above estimates. Revenue was slightly above the Street's consensus. CEO Doug Parker noted the success of the company's integration efforts following its merger with US Airways.\n\n#**STOCK SYMBOL:** AAL\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AAL&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAL)**)\n\n*****\n\n> **Walgreens Boots Alliance** — The drugstore operator beat estimates by eight cents a share, with adjusted quarterly profit of $1.07 per share, Revenue fell below forecasts, however. Comparable-store sales rose 3.2 percent compared to a year earlier.\n\n#**STOCK SYMBOL:** WBA\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WBA&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WBA)**)\n\n*****\n\n> **Dunkin' Brands** — The company earned an adjusted 60 cents per share for its latest quarter, one cent a share above estimates. Revenue missed forecasts, however, due to fewer openings and a drop in sales at Baskin-Robbins outlets.\n\n#**STOCK SYMBOL:** DNKN\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DNKN&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DNKN)**)\n\n*****\n\n> **Alaska Air** — The airline came in 11 cents a share above estimates, with adjusted quarterly profit of $2.20 per share. Revenue was essentially in line with forecasts. Overall profit did fall due to costs related to Alaska Air's planned merger with Virgin America.\n\n#**STOCK SYMBOL:** ALK\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ALK&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ALK)**)\n\n*****\n\n> **Bank of New York Mellon** — The bank reported adjusted quarterly profit of 90 cents per share, nine cents a share above estimates. Revenue also beat Street forecasts. Bank of New York Mellon was helped by lower costs and an increase in revenue from a year earlier.\n\n#**STOCK SYMBOL:** BK\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BK&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BK)**)\n\n*****\n\n> **Quest Diagnostics** — The medical lab operator came in two cents a share above estimates, with adjusted quarterly profit of $1.37 per share. Revenue was in line with forecasts. Quest also raised its full-year forecast, crediting its improved performance to expansion of its health system relationships.\n\n#**STOCK SYMBOL:** DGX\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DGX&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DGX)**)\n\n*****\n\n> **American Express** — The financial services company reporting adjusted quarterly profit of $1.24 per share, well above estimates of 97 cents a share. Revenue also beat forecasts. Additionally, Amex raised its earnings outlook for the year on better credit quality and increased emphasis on its platinum card.\n\n#**STOCK SYMBOL:** AXP\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AXP&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AXP)**)\n\n*****\n\n> **Tesla Motors** — Tesla announced that all of its new vehicles will be equipped with hardware that enables fully autonomous driving, with the automaker planning to have a vehicle drive itself from Los Angeles to New York by the end of 2017.\n\n#**STOCK SYMBOL:** TSLA\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TSLA)**)\n\n*****\n\n> **Wells Fargo** — Wells Fargo is the subject of a criminal investigation by California's attorney general, centering on whether the creation of new accounts by the bank's sales staff involved identity theft.\n\n#**STOCK SYMBOL:** WFC\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WFC&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WFC)**)\n\n*****\n\n> **JPMorgan Chase** — JPMorgan is said to be in talks to sell its stake in a Chinese securities joint venture.\n\n#**STOCK SYMBOL:** JPM\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JPM&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JPM)**)\n\n*****\n\n> **Alphabet** — Alphabet's Google unit reportedly reached a deal with CBS to carry the network on a soon to be launched online TV service, according to The Wall Street Journal.\n\n#**STOCK SYMBOL:** GOOGL\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GOOGL&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GOOGL)**)\n\n*****\n\n> **Mattel** — Mattel reported adjusted quarterly profit of 70 cents per share, one cent a share below estimates. Sales came in slightly above forecasts. The toy maker did see a strong rebound in Barbie-related sales as well as improvement in its American Girl business.\n\n#**STOCK SYMBOL:** MAT\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MAT&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MAT)**)\n\n*****\n\n> **EBay** — EBay came in one cent a share above estimates, with quarter profit of 45 cents per share. Revenue was slightly above forecasts, but the online retailer gave a current-quarter forecast that disappointed some investors.\n\n#**STOCK SYMBOL:** EBAY\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EBAY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EBAY)**)\n\n*****\n\n> **Caesars Entertainment** — The casino operator's deal with creditors to bring its operating unit out of bankruptcy protection has been brought under question by a lawyer for the government's bankruptcy watchdog, who said the deal must not violate the law even if all parties agree to it.\n\n#**STOCK SYMBOL:** CZR\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CZR&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CZR)**)\n\n*****\n\n> **Tableau Software** — Tableau remains on watch today after surging Wednesday on reports that it has explored a sale in recent months. The Wall Street Journal reported that the business software company worked on a sale this past summer before the effort failed.\n\n#**STOCK SYMBOL:** DATA\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DATA&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DATA)**)\n\n*****\n\n> **Netflix** — Netflix and 21st Century Fox are in a court battle over alleged employee poaching. Fox accuses Netflix of illegally hiring two employees who were under contract at Fox, but Netflix filed a complaint questioning the legality of those contracts.\n\n#**STOCK SYMBOL:** NFLX\n\n* [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l)\n\n######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NFLX)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat is on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **Hope you all have a great trading day ahead here on this Thursday! :)**", "id": "58gmr0", "created_utc": 1476967629.0, "score": 51, "upvote_ratio": 0.91, "num_comments": 17, "comments": [{"body": "[deleted]", "score": 10, "replies": [{"body": "TURN THE MACHINES BACK ON!", "score": 8, "replies": []}]}, {"body": "Yeah but what do I buy you cuck?", "score": 18, "replies": []}, {"body": "Thanks for your work, fuck all these other faggots hating", "score": 5, "replies": [{"body": "Hey /u/AZK47 thank you so much for that. I really appreciate that man! :)", "score": 2, "replies": []}]}, {"body": "There's like 786784 tickers mentioned here.  If you don't have a position in any of these, what do you own shares of??", "score": 5, "replies": [{"body": "The only winning betS - JNUG and SUNEQ", "score": 7, "replies": []}]}, {"body": "Listening to Mario Drag's speech on Bloomberg, futures just took a shit, what did he say that people are reacting to?", "score": 2, "replies": [{"body": "Inequality comes from unemployed people. I reacted to that", "score": 3, "replies": []}]}, {"body": "I am doing some research on AAL and their stock confuses me.  Their P/E is pathetically low at 3.8x.  When I compare this to LUV at 11x they really seem like a deal and a company that could see multiple expansion.  I know they just came out of bankruptcy a few years ago but the merger with US Air seems to have worked out great.  What am I missing here?  Does you think this is a good long term buy?", "score": 2, "replies": [{"body": "Its been awhile since I've looked into the airlines, but I recall a major reason why AAL performed worse than DAL and LUV was its huge debt. \n\nAs for a long term buy, I personally wouldn't invest in airlines now. AAL's already had a good run since the Brexit, and a lot of its positive earnings are due to low oil prices. DAL reported lower passenger revenue, but still increased earnings solely because of lower oil costs. As oil comes back up, we won't have that tailwind for airlines anymore.", "score": 1, "replies": [{"body": "I know AAL had a no hedging rule in the past, since they got burned once, but I wonder if that changed since oil is so darn cheap right now.  That has been one of LUV's differentiators in the past. ", "score": 1, "replies": [{"body": "I think most of the airlines got burned on that the last few years :P I do remember reading a report that LUV finally eliminated its hedging earlier this year, but I have no idea how that might have changed since February. That being said, we're also not really seeing passenger revenue grow that rapidly either, which is worrying for airlines.", "score": 1, "replies": []}]}]}]}, {"body": "Is this the same guy from r/investing", "score": 2, "replies": []}, {"body": "Post your holdings.", "score": 2, "replies": []}]}
{"title": "Inevitable pullback from SPY in Jan", "selftext": "[deleted]", "id": "58hvay", "created_utc": 1476981762.0, "score": 12, "upvote_ratio": 0.94, "num_comments": 12, "comments": [{"body": "I think a sell off is likely. Past Januarys since 2014 have had huge sell offs. ", "score": 8, "replies": [{"body": "Sample size of 2? good enough for me!", "score": 11, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Fucking thrice. It's thress my friend, thress.\n", "score": 0, "replies": []}]}]}]}, {"body": "Most recent economic data is pretty good for a rate hike in December, but I think it's still a long shot.\n\nWe need a big big spike in core PCE (next announcement is Oct 31) for the Fed to raise rates as soon as December. I think they won't - the FOMC is a very data-oriented group and I think they'll need at least a couple of months of a sustained inflationary trend before they attempt to reign it in. \n\nI'm waiting until PCE data comes out to make any plays on this, but if the number is relatively big and markets rally, I'm thinking of buying in-the-money puts in KBE with Jan expiration in the first week of November. I figure banks will rally on the news because the increased probability of a hike (which helps them) will reprice their stocks but the hike won't happen. If the PCE number disappoints, I'm buying SPY.", "score": 3, "replies": []}, {"body": "!RemindMe 2 months", "score": 2, "replies": [{"body": "I will be messaging you on [**2016-12-20 17:06:25 UTC**](http://www.wolframalpha.com/input/?i=2016-12-20 17:06:25 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/58hvay/inevitable_pullback_from_spy_in_jan/d90jc53)\n\n[**3 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/58hvay/inevitable_pullback_from_spy_in_jan/d90jc53]%0A%0ARemindMe!  2 months) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d90jdhc)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/414blh/yofuckinglo_900_to_55k_in_12_days/", "score": 2, "replies": [{"body": "that's great but what do you want me to see here exactly ?", "score": 1, "replies": [{"body": "That is the legendary YOLO of 2016. I'm guessing he is going to try and recreate that so his mom will take him to see \"the big short\". ", "score": 3, "replies": []}, {"body": "Puts.", "score": 1, "replies": []}]}]}, {"body": ">  do you guys think they will make the same mistake as last year, raise the rates on December and cause a huge dip in January ?\n\nYes, but I wouldn't call that a mistake. The market is expected to drop after interest rates increase. The Fed can't hold off forever on raising rates -- they need to do it in December if they want to keep any credibility. Otherwise, the market will continue to expect them to be all talk and no action, so when they do finally raise rates, the drop will be even worse.\n\n>when you ask retail investors, they actually expect a recession any day now. \nMost retail investors are lemmings who believe everything they hear on CNBC. Retail investors freaking out is great for the rest of us. \n\nI expect a rise near Christmas time, although new ATHs are unlikely. I'm going short in January for the selloff after institutional investors come back from the holidays.", "score": 2, "replies": []}, {"body": "!RemindMe 2 months", "score": 1, "replies": []}]}
{"title": "Free live entertainment", "selftext": "Stocktwats amd feed. It's a nuthouse watching.", "id": "58j34j", "created_utc": 1476994387.0, "score": 10, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "\"shorts manipulating\" haha fucking faggots ", "score": 7, "replies": [{"body": "Exactly why I quit going on stocktwits.  Everytime a stock moves against someone it's because market makers, Janet Yellen or big hedge funds are manipulating the stock.  No, you just made a shitty trade.  ", "score": 1, "replies": []}]}, {"body": "Glad I went with the inverse WSB and grabbed some $7 puts", "score": 3, "replies": [{"body": ">Are you sure about that?\n\n-John Cena", "score": 2, "replies": [{"body": "Not so much anymore ", "score": 2, "replies": []}]}, {"body": "Same, went with $7 and 6.5 puts. It's not doing too bad though AH. Let's hope they shit the bed during the conference call. ", "score": 1, "replies": []}, {"body": "Sold my calls this afternoon for an easy 50% profit. Bought them for cheap as shit on tuesday, now they are pretty much worthless ", "score": 1, "replies": []}]}, {"body": "some of these don't even make sense. like...how? \nhttp://imgur.com/a/Nuiok", "score": 1, "replies": [{"body": "Makes sense to me. The tldr of the posts is that the markets 2spooky4them.", "score": 2, "replies": []}, {"body": "I'm dumber from reading that.", "score": 1, "replies": []}]}]}
