{"title": "Can you trade the VIX directly?", "selftext": "The title says it all.  I'm wondering if you can trade the VIX directly instead of something like the VXX .", "id": "59uh94", "created_utc": 1477662345.0, "score": 6, "upvote_ratio": 0.81, "num_comments": 15, "comments": [{"body": "I buy VIX calls and puts all the time.", "score": 4, "replies": [{"body": "It seems like I can do that on OptionsHouse, but then am I buying options on VIX futures or am I buying options on the VIX itself? ", "score": 3, "replies": [{"body": "VIX itself. \n\n*Effectively. VIX pricing is based on futures, and your contracts are cash-settled.", "score": 3, "replies": [{"body": "It's the futures contracts only. The is no such thing as the VIX \"itself\".  ", "score": 1, "replies": []}, {"body": "So then are they in units of 1000 if it's futures, or are these plain old european options (for all intensive purposes)?", "score": 0, "replies": [{"body": "I guess the easiest way to say it would be that it's 100 virtual units. So your contracts are all still x100 for cost. \n\nI say virtual because there's no actual shares for VIX, it's just an index. \n\nBecause there's no shares, if you're ITM on settlement (Wednesdays), you just get plain old cash in your account.", "score": 1, "replies": []}, {"body": "> for all intents and purposes\n\nFYI", "score": 1, "replies": [{"body": "Now that is education.", "score": 1, "replies": []}]}]}]}, {"body": "They are priced off the futures.", "score": 2, "replies": [{"body": "To clarify for OP's sake, if he bought a VIX contract he'd be paying a price based on  futures, but would refer to the VIX settlement price (link in sidebar - Index Settlement Values) on the day of expiry. So the contracts are for VIX, but price he'd pay is based off futures.", "score": 2, "replies": []}]}]}]}, {"body": "No, there is no underlying to trade.  You can trade VIX futures which settle to the VIX cash index at expiration, but are technically the market's prediction on where the cash index will be on that expiration date.  The two are correlated, but still different and if you have to wait a while, the carrying costs involved with the futures can be quite high.\n\nThe VIX options trade relative to the futures, not the cash index.  These are European style options and since there is no underlying, the only direct hedge is the future hence they can behave differently that what you'd expect from watch the VIX index.", "score": 2, "replies": []}, {"body": "Maybe the futures, but the short answer is no.  Otherwise you could be long volatility forever.\n\n[Here is a clip about it, produced yesterday](https://www.tastytrade.com/tt/shows/the-skinny-on-options-modeling/episodes/understanding-vix-options-and-futures-10-27-2016)\n", "score": 3, "replies": [{"body": "But you can still trade VIX options directly, to answer OPs question.", "score": 0, "replies": [{"body": "Except their underlying is the futures, so the answer is still no.", "score": 2, "replies": []}]}]}, {"body": "Since you seem to be exploring this idea, I'd like to point out that the only money I've lost in options over the past two years has been by speculating on volatility, trading VXX. Maybe I just suck at it, or maybe it's a fool's errand to bet on rising volatility", "score": 1, "replies": []}]}
{"title": "Will AMZN & AAPL Recover?", "selftext": "[deleted]", "id": "59utlc", "created_utc": 1477666368.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 13, "comments": [{"body": "Yes.", "score": 18, "replies": [{"body": "Shortly and truthfully.", "score": 2, "replies": []}]}, {"body": "APPL dropped 3%... and AMZN dropped 5%.. wtf are these dumbass fucking threads. at least WSB is sarcastic when they shit post knowingly...", "score": 14, "replies": [{"body": "Shitting a post sounds painful; I'm not sure you could avoid noticing.", "score": -2, "replies": []}]}, {"body": "Maybe", "score": 11, "replies": []}, {"body": "No", "score": 8, "replies": []}, {"body": "Theres a chance", "score": 3, "replies": []}, {"body": "ITT: Trading in a nutshell", "score": 3, "replies": []}, {"body": "I give it a 50/50 chance.\n", "score": 3, "replies": []}, {"body": "Never. The end is nighyyyyyyyyyyyyy. ", "score": 2, "replies": []}, {"body": "Yes, no, maybe, and never....In other words...we dont know :)", "score": 2, "replies": [{"body": "Fair enough! Just thought I'd see what others thought!", "score": -4, "replies": []}]}, {"body": "If by recover you mean come back to earth I would buy AAPL @ $76 so I'm getting a 3% yield. I would like to own AMZN, even 1 share, but I can't bring myself to pay more than $500 a share for any company. Maybe AMZN will split and have a sub $500 SP afterwards.", "score": -2, "replies": []}]}
{"title": "First WSB moment", "selftext": "I recently found this sub and I fucking love it. I feel obligated to share my first WSB moment. Incoming book...\n\n\nThe second day of 6th grade (1996) the teacher kicked off our first project; the stock market game. 100k to invest as you see fit in three or more stocks... That's it... I knew what the stock market was before this project and I was fucking amped to play. \n\n\nThat first day our task was to choose  our stocks and purchase our shares. As all the kids in class began tearing apart their news papers, I instantly knew what needed to be done. My mom watched the news every morning and by shear fucking luck I caught a glimpse of it that day. We lived just outside of Denver and the city was going batshit crazy (no exaggeration) over Tickle Me Elmo. I knew I wanted to invest everything in the company that made that soft, plushy, giggling, money making toy. \n\n\nI had no clue who manufactured Elmo but the teacher was able to point me to Tyco. We had to have a minimum of three stocks but there was no specification on how much had to be invested in each. Done deal. 98k in Tyco (TYC) and 1k  a piece in two other shit stocks that everyone else was investing in (MSFT, YHOO). If I recall correctly TYC was trading for 9.50 at the time or some where close to that. What I know for sure was I had 10k plus of Tyco shares and was seeing green.\n\n\nThe first couple days were \"the bomb\" and I was living it up. Every couple cents was hundreds in profits with almost no work. Now this was the 90's, we didn't have easy access to the internet and if we did we sure as shit didn't have access to any candle stick charts. Each day, I would rush to the paper to find my stock price. Then it happened... The price dropped. WTF. Tickle Me Elmo is a fucking hit. Why the fuck is the price going down? God damnit! Over the next two weeks I continued to check the news and nothing changed... The world wanted Elmo; hell the world needed Elmo! But the stock made no reflection of it, it just continued dropping a few cents here and there. \n\n\nThe project went on for a couple weeks and the teacher randomly announced one day that the project was finished. It was time to calculate our total profit / loss across all our trades. The task was simple enough. I didn't make a single trade because I was holding TYC the whole damn time. \n\n\n$9.10... That number is burned into my brain forever. After calculating our totals we had to share the results with the other kids near by. The chick next to me gave me shit for buying 98k shares of a single company. After which, everyone else seemed to join in, including the teacher. I was passed off despite my arguments that it \"could  have easily gone the other way!\" and that \"Elmo is a gold mine\". It ended with the class getting a  diversification speech with me as an example. Savage.\n", "id": "59ssdv", "created_utc": 1477631330.0, "score": 43, "upvote_ratio": 0.83, "num_comments": 15, "comments": [{"body": "You expect me to read that long bullshit when there wasn't even money involved?", "score": 44, "replies": []}, {"body": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.", "score": 21, "replies": [{"body": "Playing the long repost game.  Love it.", "score": 1, "replies": []}, {"body": "Found the kid that didn't get Elmo for Christmas.", "score": -2, "replies": [{"body": "You are right, all I got was a priest touching me for christmas.   #Alterboylivesmatter.  ", "score": 2, "replies": []}]}]}, {"body": "Owned kid", "score": 3, "replies": []}, {"body": "If only you knew what earnings reports were in 6th grade.", "score": 1, "replies": [{"body": "And with options he could buy some OTM calls.", "score": 1, "replies": []}]}, {"body": "Great class subject", "score": 1, "replies": []}, {"body": "https://i.imgur.com/GOceg0U.gif", "score": 1, "replies": []}, {"body": "TL;DR", "score": 1, "replies": []}, {"body": "Should've just bought calls on Tickle Me Elmo futures directly instead of investing in Tyco you dumbass. Your only regret should be they didn't have Tickle me Elmo triple ETNs in the 90's.", "score": 1, "replies": []}, {"body": "THIS MOTHERFUCKER. Do your own DD and find TYCO by yourself fucking taint.", "score": 1, "replies": []}]}
{"title": "TFW you lose $18b of market cap in under 5 minute [AMZN]", "selftext": "", "id": "59u2my", "created_utc": 1477656885.0, "score": 165, "upvote_ratio": 0.95, "num_comments": 17, "comments": [{"body": "Bezos doesn't currently and has never cared about the short-term stock price.\n\nDude is a billionaire, and long term the stock is up 2200% over the past few years.", "score": 60, "replies": [{"body": "Yeah I don't think anyone really cares about 10% movements in their company like bezo, musk, gates, cuckerberg, etc.  They have long term goals (ex bill gates, who just fucking chills in Africa cause his wife made him do it)", "score": 27, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "Amazon is a long-term play; as automation in transportation and warehousing increases, they'll be able to cut a shitload of costs and push up profits. ", "score": 3, "replies": [{"body": "> push up profits. \n\n> Amazon\n\nlol\n\nThe bald fuck will find ways to conduct *more* R&D. Drones today, rocket-propelled worldwide delivery tomorrow.", "score": 3, "replies": [{"body": "We say that like its a bad thing. Rocket propelled low orbit delivery would take 18 hour flights and turn them into 2 hour flights.\n\nAmazon prime indeed.", "score": 2, "replies": []}]}]}]}]}, {"body": "Prolly has the best hair of any CEO. Very proportional looking eyes, too.  But GD i love amazon prime. ", "score": 3, "replies": []}]}, {"body": "I'm one of the little shareholder pigs that was marched to slaughter today, please Farmer Bezos, let me live to roll in the mud for another day!", "score": 7, "replies": []}, {"body": "[When you know it's all a fugazzi, and you don't give a fuck](https://www.google.com/search?q=jeff+bezos+laugh&client=safari&hl=en-us&biw=375&bih=559&tbm=isch&prmd=vni&source=lnms&sa=X&ved=0ahUKEwiFy9nl4f3PAhUC7oMKHVSmBtUQ_AUIBygD&dpr=2)", "score": 5, "replies": [{"body": "[removed]", "score": 3, "replies": []}]}, {"body": "Loving today, played amzn, spy to perfection on both sides and opened into mck to finish the day off", "score": 13, "replies": []}, {"body": "TIL Bezos is part turtle", "score": 4, "replies": []}, {"body": "Pigs get fed, Hogs get slaughtered.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Even the teeth fell off lol", "score": 0, "replies": []}]}
{"title": "[Market Discussion Thread] 10/28/2016", "selftext": "Big news for today included:\n\n* GDP rose to 2.9% growth; projections were 2.4% \n* Bond Yields have hit their highest level since Brexit \n* Amazon missed earnings \n* Google beat earnings \n* GE and Baker Hughes in talks (Baker Hughes up 8%)", "id": "59uj0j", "created_utc": 1477662987.0, "score": 19, "upvote_ratio": 0.87, "num_comments": 11, "comments": [{"body": "Aaaaand crude prices are down again. Crud.", "score": 7, "replies": [{"body": "No its spelled c-r-u-d-e", "score": 0, "replies": [{"body": "faggots be like..", "score": 3, "replies": []}]}]}, {"body": "Well this sure makes an exciting Friday", "score": 5, "replies": []}, {"body": "When can I start making yolo Blackline calls? I thought they were IPOing today", "score": 2, "replies": []}, {"body": "Can bio stop getting slammed? Thx ", "score": 1, "replies": []}, {"body": "Fuck me.  CAH, -11%, AMGN, -10%\n\n", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It does favor a rate hike but I'd argue that it was already entirely priced in. Thus dollar down gold up after initial move in premarket. ", "score": 6, "replies": [{"body": "That grinds me gears how they have that priced in. Sure they should have good GDP movement priced in but 3% is well above anything we've seen lately.", "score": 1, "replies": []}]}, {"body": "wrong", "score": 4, "replies": []}, {"body": "Doesn't really affect it either way. The fed cares about PCE, not so much GDP. PCE comes out on Monday at 8:30AM. If it's above 2%, it'll be a good indicator of a rate hike. If it's lower, no hike. Yellen also recently said that she's possibly in favor of overheating the economy for a while, meaning the short-term inflation target could be 3%, not 2%, further reducing the chances of a hike in the immediate term.", "score": 5, "replies": []}]}]}
{"title": "$F looks pretty neat.", "selftext": "I just got out of $BAC yesterday.  I am considering going all in on $SWHC on November 9, 2016 if Hillary wins.  I just looked at the largest market movers today and $F seems to be at a low.  I looked at some charts and $F has lows during the end of the year and then it rebounds during the beginning of the new year.  I wonder if I should go all in on this or if I should wait until November 9, 2016 and go all in on $SWHC.  $F seems like a decent 2 or 3 month play.", "id": "59vw5f", "created_utc": 1477677513.0, "score": 8, "upvote_ratio": 0.76, "num_comments": 14, "comments": [{"body": "ford could post a 200% EPS beat, 20% rev beat and raise guidance and it still would tank\n\nmarket hates ford, it's the GILD of the car industry. stay away from this shit", "score": 13, "replies": [{"body": "its price to earnings ratio is 5.22 lol, its about the same price as it was in 1987 too", "score": 3, "replies": []}, {"body": "Fuck this is so true.", "score": 2, "replies": []}, {"body": "At least it has the dividend...", "score": 2, "replies": []}, {"body": "Truth. Trust me. Its a bullshit stock and the dividends can't be counted on. ", "score": 1, "replies": []}]}, {"body": "If it hits 11.50, I'm going balls deep", "score": 3, "replies": []}, {"body": "ford is never a good play", "score": 3, "replies": [{"body": "When it was $2 it was.", "score": 2, "replies": []}]}, {"body": "Seems like F would be a real long-long term play. Plus who knows what happens to Ford's Wayne factory if President Trump has anything to say about our jerbs.", "score": 3, "replies": [{"body": "It's being retooled to for final-assembly of the more profitable F-150 instead of of the Fusion. It made a nice sound-bite for Trump protectionism but it was a smart move all around for Ford and doesn't negatively impact workers.", "score": 1, "replies": []}]}, {"body": "I may sell some puts, but F is just being continually dragged down. Only thing keeping it from tanking a lot more is the dividend.", "score": 1, "replies": []}, {"body": "I wouldn't touch Ford with your mom's money. Just a bad stock and doesn't not look like it's getting better anytime soon. ", "score": 1, "replies": []}, {"body": "F is low for good reason", "score": 1, "replies": []}, {"body": "GM is better", "score": 1, "replies": []}]}
{"title": "Leveraged BS TVIX", "selftext": "I hate that every time I buy TVIX it drops 3-4% within 10 mins after that even though the actual VIX hasn't. \n\nIt makes me fuckin sad and is all the proof I need that leveraged stuff is worse odds than roulette and trying to follow momentum on something happening in the news is fucking stupid. \n\n/end pouting like a bitch\n\nEdit: Downvoting myself because I hate sounding like I'm whining. (It's moving back up anyway)", "id": "59w3t9", "created_utc": 1477679648.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 15, "comments": [{"body": "??? tvix doesnt track spot vix index you fucking retard", "score": 6, "replies": [{"body": "Oh Hai Dick Face that's the point of my complaining. JFC you retard. ", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm not mad that the world is fucking me. I'm mad that I fucked myself by buying to watch it go down and then naturally looked at .vix and saw it had less volatility and yelled (in my head) \"Leverage I hate you!\" \n\nI know how the fuck it works. \n\nI'm bad at timing. Sucks.... \n\nFuck it, time for happy hour. ", "score": -2, "replies": [{"body": "Obviously, you still don't know how it works.\n\nVIX is not the same as VIX FUTURES.\n\nWhen you look at .vix you are looking at \"spot\" or the actual VIX index at that moment.\n\nTVIX, UVXY, etc track a 30-day constant maturity of VIX FUTURES. Meaning a proportional combination of November and December futures needed to estimate what a future 30 days out would be worth.\n\nFutures move differently than spot. They usually cross around 17. (Meaning VIX futures are usually more than spot under 17, and at spot over 17, futures often start to lag behind spot). Sounds like you bought when VIX spiked up over 17 and futures were like meh, it'll probably come back down so we're not going much higher yet, at least not today.\n\nLeverage is just that it's 2x the move.", "score": 4, "replies": [{"body": "Obviously, you must be a blast at parties. \n\nCan't even be mad at myself without you fucks ruining it with your \"extensive knowledge.\"", "score": 1, "replies": [{"body": "Joke's on you! I DON'T GET INVITED TO PARTIES", "score": 4, "replies": [{"body": "LOLZ! G1", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "TVIX will prob rise over the weekend as the world speculates what just happened.", "score": 1, "replies": [{"body": "I'm cranky AF today. Maybe not enough coffee. \n\nI agree with you, just hate that the mechanics aren't perfect. Jesus, I sound like a Millennial. LOL!", "score": -2, "replies": []}]}, {"body": "Trade VX instead. Better leverage, less decay, market open at night too.", "score": 1, "replies": []}, {"body": "Just buy some bleach already you salty wanker.", "score": 1, "replies": [{"body": "Yeah... salty as fuck today. Heh. :)", "score": 1, "replies": []}]}, {"body": "Literally thousands of shit to trade and you pick that one. Come on now", "score": 1, "replies": []}, {"body": "TVIX is leveraged man, don't you understand?", "score": 0, "replies": [{"body": "Read the title of the post and then stand in front of a mirror and punch yourself in the face. \n\nsmh", "score": -1, "replies": []}]}]}
{"title": "How To Use VIX to Make Money November 9th, 2016", "selftext": "Wall Street loves Hillary Clinton. Hillary has a long relationship with the heads of New York’s banks, from [being paid for speeches](http://money.cnn.com/2016/04/20/news/economy/hillary-clinton-goldman-sachs/) to [receiving millions in donations](https://www.opensecrets.org/politicians/contrib.php?cid=N00000019&cycle=Career) from Goldman Sachs, Citigroup, JP Morgan etc. She is also seen as the more stable candidate, largely keeping the economic policies of Obama. Perhaps this is why there has been [a strong correlation](http://www.cnbc.com/2016/10/06/hillary-clinton-and-donald-trump-poll-numbers-and-the-stock-market-are-joined-at-the-hip.html') between Hillary’s poll numbers, and the stock market.  The more Clinton is seen as the likely winner, the higher the market goes, with the inverse being the better Trump does, the lower the market goes.\n\nNo one ultimately knows who will win the election, and if the market will go up or down. What is more certain is that the market will experience severe **volatility** if Trump wins or is seen as a more likely winner. Volatility is measured by a measurement called the **VIX** or **Volatility/”Fear Index**”. This index tracks volatility by analyzing the premiums people pay for 30 day put options. People use put options as insurance, and they pay more for these options when there is uncertainty in the market. This results in the VIX going up as the market declines.\n\nThe VIX is currently sitting at ~16. The VIX’s average is 20, with a median of 17. This means the market is not experiencing or expecting more volatility than normal. I believe the stock market is severely under-estimating the likelihood of volatility and the possibility of a Trump Presidency.\n\nThe odds of a Clinton presidency are [currently at 80%](http://www.realclearpolitics.com/epolls/writeup/us_presidential_election_live_betting_odds.html). Her poll numbers have her winning easily. The stock market believes these polls, and has steadily risen as Clinton is seen as the more likely candidate. This reminds me too much of how much the mainstream media exaggerated Brexit polls prior to England’s surprise move to leave the European Union June 24, 2016. [The market did not expect this](http://www.reuters.com/article/us-usa-stocks-idUSKCN0Z918E), and the VIX, spiked from 17 to 25 the day after the vote, resulting in a 68% gain for anyone buying volatility before the election. \n\nDo I think Donald Trump will win? Probably not. But I do think the stock market is assigning too high of a probability of a Clinton victory.  Let’s say you agree with me that we are seeing the same mainstream message play out, and you believe Trump winning is not that far-fetched.  Why not make some money off of everyone looking to cover their ass November 9th.Here’s what I plan on doing:\n\nDownload [Robinhood](https://robinhood.com/) if you do not already have a low-cost brokerage somewhere. Deposit an amount of money you are comfortable using for trading. Wait until the results of the election come out Wednesday morning, November 9th. If Donald Trump is announced as the winner, or we find ourselves waiting for a more detailed count ala 2000 in Florida, **buy** the stock [TVIX](https://www.google.com/finance?q=NASDAQ%3ATVIX&ei=J6oTWIHoB4nesAH3waqYDw). TVIX is a 2x’s leveraged ETF that mimics movement in the VIX index we talked about earlier.\n\nIt is imperative that you create a **stop loss sell order** immediately after buying the stock TVIX. A stop loss will automatically sell the stock you own if it drops more than the specified amount. I usually set my stop losses so that I never lose more than 2-5% of the money I am trading with. This severely limits the risk of trading. Here is more about [setting a stop loss order on Robinhood](https://support.robinhood.com/hc/en-us/articles/208650386-Order-Types).\n\nI like to buy 10-20 minutes after the market opens (9:40-9:50am EST). If the news is ugly (remember Trump presidency = ugly to wall street), then volatility usually increases as the West Coast wakes up, and the 24/7 news media starts putting their doom and gloom spin on everything.\n  \nYou should **sell** before the day’s end. **NEVER HOLD ONTO TVIX MORE THAN 1 DAY**. TVIX and the VIX spikes, then quickly reverts to its mean. This means you have to **pre-identify the price where you will sell TVIX before 4:30pm EST November 9th, 2016**. This is often very difficult as your greed will take over, having you believe the stock will never go down. I start looking to sell after a 10-15% gain. Everyone’s risk tolerance is different. Just don’t let your emotions kill your trading gains. Setting limits on your downside and upside losses/gains greatly reduces your risk, and will help you keep more profits.\n\nPlease take everything I have said with a grain of salt. I am not a professional trader. I do not have my Series 7, and am not your financial advisor. Stock tips from friends, family, and strangers on the Internet can be dangerous. Do not trade with more money than you are comfortable losing.  Diversified, long term (10-20years), value investing is the way to build wealth. I do not recommend trading with more than 5-10% of your overall portfolio. \n\nI sent this because I am confident this trade will be successful if Trump elected. I also just really enjoy writing about the stock market. I'd like to hear you ideas on this trade. ", "id": "59wty3", "created_utc": 1477687352.0, "score": 7, "upvote_ratio": 0.64, "num_comments": 18, "comments": [{"body": "> Please take everything I have said with a grain of salt. I am not a professional trader. I do not have my Series 7, and am not your financial advisor. Stock tips from friends, family, and strangers on the Internet can be dangerous. Do not trade with more money than you are comfortable losing. Diversified, long term (10-20years), value investing is the way to build wealth. I do not recommend trading with more than 5-10% of your overall portfolio. \n\nThis alone is banworthy\n", "score": 20, "replies": [{"body": "That part is for my irl non fgt friends.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "This. VIX doesnt jump from 15 to 25 in the minutes after the announcement of Trump winning. It will move gradually as each electoral college reports its results. If there is an early Trump lead, then a move back to Clinton, then a Trump victory, VIX will move back and forth as the states report in.", "score": 2, "replies": []}]}, {"body": "thank you Matt_Shitty", "score": 3, "replies": []}, {"body": "How well do those stops work after hours, eh?  Like when the election results actually come out? Pro tip: they don't. Pro tip #2: you SHORT volatility after a large spike up for max gains.  ", "score": 3, "replies": [{"body": "Plenty of volatility during hours the following day. And yes you're right, you would obviously short volatility the day after.", "score": 1, "replies": []}]}, {"body": "Meh... lot of text.. not enough reasoning. You should ideally put your trading hypothesis first, since that's what everyone is after. And then proceed to give the reason. You yapped from the beginning all to say that vix will spike if trump wins. You are not even suggesting to buy vix on the day before election. \n\nYou surely must have contacts, since the market waits for you to buy vix before it spikes. \n\nTldr for ops post: buy vix if you think trump wins since market is positioned for Clinton victory.", "score": 4, "replies": [{"body": "Too much text! You shud have written your TLDR at the beginning of ur reply. ", "score": 2, "replies": [{"body": "2 much txt", "score": 1, "replies": []}]}]}, {"body": "tl;dr: still don't know how to get my yacht.", "score": 2, "replies": []}, {"body": "How about Vix calls?", "score": 1, "replies": [{"body": "Too expensive. VIX futures (VX) are the correct way to trade volatility on election night.", "score": 2, "replies": []}, {"body": "Might be safer actually. ", "score": 1, "replies": []}]}, {"body": "Keep posting information like this. It's appreciated and you're a solid writer. Thxxxxxx xoxo", "score": 1, "replies": []}, {"body": "Anyone that thinks stop losses limit risk is deluded. In reality, stop losses tend to do the opposite. There is no reason why your stops couldn't be hit multiple times in a row, so they don't really do anything to protect you from drawdowns.", "score": 0, "replies": [{"body": "They have helped me get out, then re enter at a lower price. Or i sometimes just never re enter.", "score": 1, "replies": []}, {"body": "Trailing stop losses can be a great way to automate locking in gains and avoid large crashes.\n\nIf you think of selling soon, set it to be 1% of high, if you want to avoid crash set it to be 3x past day peak to peak volatility.", "score": 1, "replies": []}, {"body": "That's why you set your stops far enough away that should it be triggered, the chance of it being right are high. Don't be a retard and set it 2 points below your entry point.", "score": 1, "replies": []}]}]}
{"title": "Sell off now, Hilary loses. Stock market going to crash. You heard it here first.", "selftext": "[deleted]", "id": "59xoxl", "created_utc": 1477697453.0, "score": 7, "upvote_ratio": 0.62, "num_comments": 19, "comments": [{"body": "Not sure you know what \"first\" means", "score": 14, "replies": [{"body": "That's the 2st time he's heard that ", "score": 1, "replies": []}]}, {"body": "It says it hit 100. Does that mean he won now?", "score": 8, "replies": []}, {"body": "Even if we give Trump Iowa, Ohio, and Florida, Hillary still wins. Sorry man, Virginia is not a battleground state this time around. Plus Florida's going for Hillary by a fairly wide margin. \n\nFinal electoral vote will be 279 to 259. I'll give Trump Florida anyway.", "score": 5, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "What am I supposed to be looking at here? Just because people Google trump win? What's that supposed to prove? ", "score": 4, "replies": []}, {"body": "No way in hell this is gonna upset the election completely, but I'm glad I can pick up some more hillary win shares on predictit for cheap", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Be sure to post pics of you crying in your beer on the 9th.\n", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "you didn't perfectly hedge the fucking election you autist you are going to either win or lose depending on where you put your money.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "you said it would be a win win no matter the outcome of a certain event. the only way that could be true is if you hedged it perfectly. gj \n\n>playing bot sides\n\ntho...\n\nlul\n", "score": 1, "replies": []}]}]}]}]}, {"body": "GL HF", "score": 1, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.9358  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/56435)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.8512  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/76624)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.6878  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/67862)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "just like the pepe market crash :( ", "score": 1, "replies": []}, {"body": "Based Aussies, if only we could lend them our Trump ", "score": 1, "replies": []}, {"body": "That chart looks like a great short. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "That is an astute observation.", "score": 1, "replies": []}]}, {"body": "I'm a huge r/the_donald supporter and this is pretty bias. Look up Hillary win it's the same analytics. ", "score": 0, "replies": []}]}
