{"title": "Do you discuss investments with your SO?", "selftext": "Hi all.  Newly married here, and my husband is seriously into the stock market.  I have more of a science/medical background, so I don't completely grasp or understand how our investments work.  Husband is knowledgeable and works in the finance field.  \nLately, I have been worried about our investments.  All I know is he has short positions on tesla and netflix, and that isn't doing so well right now.  When it has come up with his friend who does this for a living, he jokes about how sketchy and risky my husband is with his positions.  \nHe will not talk to me in detail about it, and I have no idea how much money we have lost, or potentially could lose.  A couple of months ago, he said we lost about 100k, but we made some or most of that back.\nI just feel lost since I am not knowledgeable in this subject. He also covers most of our expenses, so I don't know if it's justified for me to stay out of it. We do well with our salary income, but I still feel like I should know what's going on with our money.\nAnyway, I am asking you all how can I get him to talk to me about our investments, or what kind of questions I can ask to have a more clear gauge on where we are financially. Any tips on how to approach this subject with him, or what works with your marriage of this topic, would be greatly appreciated. ", "id": "7sgkvb", "created_utc": 1516732810.0, "score": 156, "upvote_ratio": 0.93, "num_comments": 276, "comments": [{"body": "Did you find him hanging from the ceiling last night after NFLX earnings?", "score": 486, "replies": [{"body": "Lmfao", "score": 89, "replies": []}, {"body": "And here come the wsbers! Welcome to /r/stockmarket, faggot.", "score": 186, "replies": []}, {"body": "RIP their brokerage account.", "score": 12, "replies": []}, {"body": "You are savage...lol", "score": 10, "replies": []}, {"body": "> hanging from the ceiling last night after NFLX earnin\n\nThis is nothing to joke about. If her husband did a naked short, he might just do that...", "score": 46, "replies": [{"body": "Play stupid games, win stupid prizes", "score": 163, "replies": []}, {"body": "If I had a naked short position on both TSLA and NFLX I would have necked myself a while back. ", "score": 68, "replies": [{"body": "FNGU just launched too. I wonder if he covered.", "score": 6, "replies": []}]}, {"body": "hmmm naked short...didn't know that was a thing....will definitely be asking this..thank you!", "score": 10, "replies": []}, {"body": "lmao mkay", "score": 8, "replies": []}, {"body": "Well if he doesn't his wife is going to kill him so it's really his duty.  \n  \nI wonder if we can correlate how much a man's wife weights with the risk he takes in the market. How many lb do you think \"Short NFLX\" is? 400? 600?", "score": 6, "replies": []}]}, {"body": "Absolute savage.", "score": 6, "replies": []}]}, {"body": "Woman, you are married to the man, you don't need to \"carefully approach the subject\", just ask straight what you wanna know. If he's not the person you can openly talk to, who is?", "score": 345, "replies": [{"body": "Should be careful bringing up the fact that he just lost a shit ton of money today on Netflix. ", "score": 117, "replies": [{"body": "*They* lost a shit ton of money. ", "score": 84, "replies": [{"body": "HE lost a shit ton of THIER money", "score": 120, "replies": [{"body": "He would have been smarter to invest in fucking magic beans. ", "score": 19, "replies": [{"body": "This is good for bitcoin", "score": 18, "replies": [{"body": "It rained earlier today so I’m expecting bitcoin to recover by tonight.", "score": 8, "replies": [{"body": "Can you please take over writing all those bitcoin articles? You got their general point across, with less misinformation and time wasting.\n\nSUBSCRIBE", "score": 2, "replies": []}]}]}, {"body": "Yeah. I take it back. She should just lay into this dumbass.", "score": 7, "replies": [{"body": "This is why I am here instead of some lame relationship threads....I need facts, not some dumb support like, oh sweetie, it'll be okay, love conquers all, blah blah blah", "score": 16, "replies": [{"body": "Love doesn't conquer debt collectors.", "score": 26, "replies": [{"body": "Not with that attitude", "score": 3, "replies": []}, {"body": "Really depends on the collector's taste in woman.. or man.", "score": 1, "replies": []}]}]}]}]}, {"body": "Touché. She shouldn’t have to hold back any questions though. ", "score": 3, "replies": []}]}]}, {"body": "The real questions...", "score": 11, "replies": []}, {"body": "shorting netflix always seemed like a bad idea to me with the consumer market pulling back from traditional TV, and netflix being a big enough name to succeed with or without net neutrality. Either their stream is protected, or they have reduced competiion/increased bar to competition via non-neutral sectioning of traffic. ", "score": 10, "replies": [{"body": "That's one side of the argument. The other is that despite all of their success and appeal, they remain an extremely large and convoluted furnace for torching cash.\n\nBut yeah. Their earnings report could have been a 15 second teaser for season three of Stranger Things plus a photocopy of the CEO's middle finger and the stock still would have gone up 3%.", "score": 19, "replies": []}]}, {"body": "It's not just a lotta money, it's a shit load of money.", "score": 1, "replies": []}]}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.6245  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/28738)", "score": 259, "replies": [{"body": "**I love WSB.**\n\n5 stars: So many like-minded autist crackheads inciting eachother with retarded, half-assed DD. Really great content.", "score": 100, "replies": [{"body": "Thank", "score": 28, "replies": []}, {"body": "I’m confused. Is wsb serious? Don’t get me wrong though. I love it. But I always thought it was a satirical shit post sub.", "score": 13, "replies": [{"body": "It's part satire part serious. Just a bunch of people gambling on the stock market. I would say nobody there is *that* stupid but there definitely are some.", "score": 45, "replies": [{"body": "The current top WSB meme is just SPY. The S and P 500. Index. How can you tell me the most diversified investment vehicle of all time is a bad move.", "score": 10, "replies": [{"body": "Umm not sure if you meant to reply to me. But i was saying I don't think the sub is as dumb as people think. There are a lot of smart decision there. The members are just crazy as fuck lol.", "score": 7, "replies": []}, {"body": "You answered your question right before asking it. When was the last time WSB was right? Greater Depression imminent.", "score": 4, "replies": [{"body": "Truck sales arent down.", "score": 2, "replies": []}]}, {"body": "It's a bad move if you want to make lots of money quickly. It's r/wallstreetbets not r/playitsafewithyourmoney.", "score": 1, "replies": [{"body": "Options my friend", "score": 1, "replies": []}]}]}]}, {"body": "Just memes but people seriously are gambling with the stocks they talk about.", "score": 14, "replies": [{"body": "Raises hand", "score": 9, "replies": []}]}, {"body": "If you can’t tell it was never meant for you tbh", "score": 6, "replies": []}, {"body": "It’s like pcmasterrace. Some are meming, some are being ironic and then some people don’t get that it’s a joke and are serious.\n\nThen there’s some that play along with the joke but secretly have a picture of Martin shkreli in their wallet.", "score": 6, "replies": []}, {"body": "Think of it as a place for catharsis for people who are placing high risk trades. High risk trades yeild high stress, so a cathartic place like r/wallstreetbets exists to let them complain, joke, share knowledge/DD or even just stories, meme themselves to comfort, etc. You'll find the trades discussed are generally high stress because ) they're based on little DD ) they're uncomfortably large for the trader ) they are uncomfortably volatile assets ) the trader is new and has no idea what they're doing (especially true as the sub grows, hence all the memes). Generally any trades outside of the trader's allowable risk/comfort zone. These people need a place to blow steam/congratulate themselves when  things go tits up (or, occasionally, tits down?) Hence r/wallstreetbets rally cry: YOLO!", "score": 6, "replies": [{"body": "I had only recently found the sub and have since gone fully down the rabbit hole of WSB. It has become my favorite subreddit. ", "score": 1, "replies": []}]}, {"body": "Some is serious, most is shitposts/ satire/ comedy. ", "score": 1, "replies": []}]}]}, {"body": "(shhhhhh don't tell her that )", "score": 35, "replies": []}, {"body": "Not even r/wsb is dumb enough to short TSLA ", "score": 96, "replies": [{"body": "No shit, we put 50% LONG TSLA", "score": 67, "replies": []}, {"body": "[deleted]", "score": 60, "replies": [{"body": "Shit was on autopilot though. Pretty cool stuff.\n\nEdit: /s", "score": 20, "replies": [{"body": "If crashing into a firetruck is an acceptable outcome, then technically all cars have autopilot already.", "score": 17, "replies": []}, {"body": "was the firetruck's fault anyway", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Elongated? ", "score": 2, "replies": []}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.3185  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/63724)", "score": 12, "replies": []}, {"body": "We tried that already and lost all our money. Now we're initiating long positions at ATHs", "score": 9, "replies": []}, {"body": "Sounds like a challenge", "score": 6, "replies": [{"body": "Sounds like a challenger", "score": 6, "replies": []}]}, {"body": "I short tesla in spirit but boy never go against daddy Musk. 5 tesla car accidents could be on the news and the stock will still climb. ", "score": 6, "replies": []}, {"body": "He shorted Netflix. He could be one of us", "score": 6, "replies": [{"body": "One of us. One of us. One of us.", "score": 6, "replies": []}]}, {"body": "The hell you say. I will short it. Timing my friend; timing.", "score": -1, "replies": []}]}, {"body": "This guy gets it. Although, if he were in wsb she would have mentioned MU. ", "score": 21, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.9976  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/62525)", "score": 8, "replies": []}]}, {"body": "Bby no stop", "score": 3, "replies": []}, {"body": "If anything we are long TSLA and nflx. We learned our lesson on betting against Musk back when Tesla was at 220. ", "score": 3, "replies": []}, {"body": "Dude shut up. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 93, "replies": [{"body": "Ignore the trolls. This is the best advice.", "score": 19, "replies": [{"body": "OP is the troll ...", "score": -1, "replies": []}]}, {"body": "I REALLY appreciate this post.  Surprised to get so many thought out replies, I'm actually glad I asked, even though some posts are pretty harsh.  \nI definitely want to learn more.  I trust him, but do want to at least have this be a discussion about what is going on with our money, than just me being in the dark, or not understanding.\n\nYou raise a lot of questions I do have.  My main one is, I am okay with him risking a portion of our money, but is that how shorting works?  For example, if he made 100k last year in the market, and lost it this year, I suppose I can live with that.  Can he lose way more than what is just in those investment accounts?  I guess these are questions I need answers to from him.\n\nI don't want him to not talk to me, and I know this stuff seriously stresses him out.  Want to be supportive, but don't want to be supporting something that may be a bad decision for us overall.\n\nI think I will ask if he will see a financial advisor with me.  They can hopefully explain to me what is going on, with all the information that I don't have, or don't readily understand.\n\nThanks for your help", "score": 4, "replies": [{"body": "Don’t mind the trolls, half this subreddit is trolling / shitposting. Maybe you should have gone to /r/investing, but much of the advice you’re seeing here is actually good.\n\nAnyways, trading isn’t terribly complicated. If you have a medical degree you’re plenty smart enough to understand it. Go over to /r/investing and read the stickys for a start. Once you have a basic understanding go ask your husband about his strategies, ask him to explain, don’t just smile and nod. If you liked the guy enough to marry him a hopefully you can forgive a few retarded / risky trades. But in general, he should be doing what is recommended on /r/investing. Make sure he’s only gambling with what he (and you) are willing to lose. If you’re not okay with losing the kind of money he’s playing with, let him know!\n\nI really hope he didn’t short Netflix...\n\n", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "I think you need to stop trusting him. He clearly does not know what he's doing. ", "score": 4, "replies": []}, {"body": "> I think I will ask if he will see a financial advisor with me\n\nNot sure if a financial advisor is what you need at this point. ", "score": 1, "replies": []}]}, {"body": ">Talk to husband about what your own goals are \n\nShorting Netflix sure does sound like an own-goal. ", "score": 1, "replies": []}]}, {"body": "It's really hard to lose money in the current market conditions... If he's hiding information from you, it's probably worst than you expect.\n\nI think you need to sit down with him and have a serious talk about what he's doing with your money. \n\nClaiming you have no finance background is not an excuse. Just look at your monthly statements. Everyone knows how to add or subtract.\n\nAn important thing too is try not to over-react when you learn of his win/losses. Know that your husband is trying his best to make the family rich. He's not intentionally losing money. Approach it in a calm manner and figure out a plan with him and understand he's doing his best. He will greatly appreciate this and come to his senses on his investment holdings.  (Source: told me wife about our losses in 2008/2009. She went ballistic. We're still married.). \n", "score": 28, "replies": [{"body": "It's really easy to lose money in any market conditions, you just have to be stupid enough to take the risks that make it happen.", "score": 12, "replies": [{"body": "all you have to do is buy anything except oil apparently and you are literally printing money", "score": 2, "replies": []}]}, {"body": "Good to know there are monthly statements.  See these are the things I don't even know to ask for. \nI agree completely with your second point.  I want to trust him, and know he is doing this for us, but also want us to be smart about it, even if it means cutting our losses.  Really appreciate this.", "score": 3, "replies": []}]}, {"body": "In the stock market, there’s a bit of a grey area between investing and gambling. Perhaps you should find him a gambling support group? ", "score": 20, "replies": [{"body": "if he likes gambling he should just get into crypto\n", "score": 24, "replies": [{"body": "When you gamble there’s a chance you’ll make money though. ", "score": 9, "replies": [{"body": "\\>bitcoin up 2000% in 12 months\n\nGee how could anybody make money off this? ", "score": 13, "replies": [{"body": "It could be argued bitcoins just a massive pyramid / ponzi scheme. And those will generally   make money for the people that get in early.\n\nThe people that got it at $500 needed to sell at  $10,000 to make 2000%. I doubt the $10,000 buyers are gonna be able to get anywhere close to $2 million.\n\n", "score": -3, "replies": [{"body": "I think you’re referring to BITCONNEEEEEECT!", "score": 5, "replies": []}, {"body": "> It could be argued bitcoins just a massive pyramid  \n  \nI agree that most neoliberals are too stupid to understand technology.", "score": 10, "replies": []}]}]}, {"body": "oh yeah, definitely. the only real key to gambling is only putting up money you can afford to lose.", "score": 2, "replies": [{"body": "Thanks *MOM*", "score": 5, "replies": []}]}, {"body": "Not sure if your serious or not, but you could stand to do some research. Mind you, crypto comes in hundreds of forms, so the stuff that's in the news now is usually not the most interesting tech or ecosystem... ", "score": 1, "replies": []}]}]}, {"body": "Not sure if he's addicted, but I know he has a hard time admitting when he's wrong, sooo may need to convince him to cut his losses, if possible.  thanks.", "score": 2, "replies": [{"body": "that is possible\n\nyou just close the postion, that's it. game over, no more losses, he tried, he was wrong, time to move on", "score": 1, "replies": []}]}]}, {"body": "I have never wanted an update so badly in all my life.", "score": 36, "replies": [{"body": "and here I didn't even think I would get any replies...I will let you know...waiting to talk after this week is over, as he has an interview Friday.", "score": 12, "replies": [{"body": "Tell me he's not being this dumb while also being unemployed or nearly unemployed... then again you did say he was working in finance", "score": 6, "replies": []}]}]}, {"body": "Ask if he sells naked calls, and if he does, get the divorce papers ready. ", "score": 35, "replies": [{"body": "If he’s naked shorting NFLX this week, the damage is already done 😂\n\nI wanna believe \n", "score": 13, "replies": []}, {"body": "good question to ask....no divorce papers, but I do need to know what is going on", "score": 2, "replies": []}]}, {"body": "I'm open about my investments with my wife. She may not understand it all but she knows I'm not risky, won't gamble more than i'm willing to lose and will not do anything to put the family in jeopardy. ", "score": 29, "replies": [{"body": "Would you do anything to put the family on jeopardy? ", "score": 16, "replies": [{"body": "Being poor builds character.", "score": 7, "replies": []}, {"body": "I've always wanted to try out. I'm not half bad at it.", "score": 3, "replies": []}]}, {"body": "Would you be open to her if you were riskier? All in on growth tech stocks and some degenerate shitcoin?", "score": 5, "replies": [{"body": "This is worse, this guy is *short* on growth tech stocks", "score": 16, "replies": []}, {"body": "Haha yes i would. I bought all vanguard etfs so ya... vanguard haha", "score": 1, "replies": []}]}, {"body": "Thanks for sharing....I think I just need him to not be risky, and just understand if this is money we are willing to lose, as he had big gains last year, and could be that money.\n", "score": 2, "replies": []}]}, {"body": "Tell him that \"The market can stay irrational longer than you can stay solvent\" Even if I agree with teslas price being irrational who knows when it will be rational, it might double before then.", "score": 8, "replies": [{"body": "I really like this, thank you!  Basically sums up the point I have been trying to make.", "score": 2, "replies": [{"body": "How big of a % of his portfolio is his short positions on the aforementioned companies?", "score": 1, "replies": []}]}]}, {"body": "First, if the money he's trading is money he brought into the marriage, he may feel, and [be legally accurate](https://www.legalzoom.com/articles/are-premarital-assets-protected-in-divorce) that it is his.\n\nAssuming jointly owned property, build an excel pie chart that shows how much money is in each investment.\n\nIf he's trading options, but its 1% of the portfolio, it's probably not an issue.\n\nIf he has more than 20-30% of money in a stock, long or short, maybe it's an issue.\n\nOnce you have a sense of what he's doing, find someone you trust, or even go online anonymously and ask: how risky is a portfolio comprised of x%, y%, z% etc. ?", "score": 7, "replies": [{"body": "If he's shorting netflix he's going to have a bad time.", "score": 28, "replies": []}, {"body": "Yeah. He is shorting Netflix and Tesla. He is gonna be out of his own money ", "score": 10, "replies": [{"body": "He may already be out of money.\n\nUnless he shorted at the recent peak..", "score": 2, "replies": []}]}]}, {"body": "> All I know is he has short positions on tesla and netflix, and that isn't doing so well right now [....] A couple of months ago, he said we lost about 100k, but we made some or most of that back. \n\nBruh....\n\nDefinitely time for a chat.\nGenerally speaking, shorting stocks is a dangerous game. I see where he's coming from, theyre probably overvalued companies but you don't wanna fight the market. Now that's fucking dangerous. \n\n\"The market can remain irrational longer than you can remain solvent\" words to live by\n\nPlus you gotta feel pretty stupid being down hundreds of thousands in a year where the US market rallied almost 30%.", "score": 7, "replies": [{"body": "This is how I've been feeling about it, but didn't feel confident in my understanding of it all.  He took these positions a year or two ago, I think.", "score": 3, "replies": [{"body": "\n\nReally? Ok that's definitely not fun anymore. \n\nIf what you say is true and he held it all this time, just eyeballing the graph shows price for Netflix pretty much doubled since 2016. \nTesla increased roughly 70%.\n\nSo for example if he put $100k on a short position for each stock, he would have **ZERO** left from Netflix and maybe 30k from Tesla. Blew at least 170k\n\nAnd it gets worse: because you have to 'borrow' stock to short it (it's a bit complicated but the bank handles all the process of lending it to you), it means you get charged a yearly fee for that service. Let's stay conservative and say 5%. That means take out a further $10k from each position (held 2 years).\n\nSo assuming he picked a 'good' entry point for this horrific investment, best case scenario he lost **95%** of the total original sum.\n\nThe worst thing to consider here is that despite being an \"expert\", he cannot recognize when he's wrong. Just buries the head in the sand and says it'll be fine. In this game, that makes you a MORON.\n\nHolding and waiting works out in most cases...if you're betting with the trend. Not against it! And even a monkey can look at a 5 year graph and see that overall those companies are increasing over time.\nNot to mention, when you short stocks you got those yearly fees of 5% chipping away your position so it's rarely convenient to hold for so long even if you're right\n\nThe second mistake was the sum involved. I fucked up too, many times, taking a gamble on the stock market. I at least had the decency to either bet light (like 2-3% of your available budget) and/or put a tight stop loss in place limiting the loss to about 3 days worth of my normal job income \n\nI sincerely hope these are just 2 bad investments in an overall smart and diversified strategy, but I doubt it. Theres so many red flags to lose count. Especially saying he lost 'about' 100k but made back 'some' of it...what the fuck does that even mean!\nHe knows very well how much he lost and fucked up, and I bet you it's more than what he told you. He's minimizing and staying vague just to avoid alarming you.\n\nI would ask for statements from the bank as far back as you can go, and talk to a financial advisor that can explain you exactly how much you lost since he started investing. \n\nIt's incredibly disrespectful to blow away all that money you worked hard for, especially when it's losses so big they could've bought a house. \nOr you could've put it in a simple Vanguard investment fund with minimal fees and today from those 200k you would've head almost 300... not 10 😑 just thinking about it makes me sick\n\n\n", "score": 6, "replies": [{"body": "> talk to a financial advisor\n\nWouldn't an accountant be better for this? They can also tell you how much you can really deduct from your taxes from these losses.", "score": 2, "replies": [{"body": "That's true. \nI thought someone internal to the bank can quickly access documents and give you an overview of your situation ASAP. \n\nHelp you close senseless positions ASAP too, make an assessment of what to keep and devise a strategy to minimize damage from other questionable positions.\n\nAccountant would be a good second step once the capital is safe ", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't have any real advice other than maybe ask him to teach you a bit about what he's doing. What is the underlying strategy behind some of his trades, etc, in order to open a line of dialog that will eventually get you more involved.\n\nThat being said, not sure why he'd want to be swing trading short positions in this kind of market at the moment, seems more like gambling than investing to me.", "score": 13, "replies": [{"body": "I think I will ask to learn more, instead of seeming like I'm berating him.  I think he had these positions last year and has held them since(?)", "score": 2, "replies": [{"body": "if this is true, and he's shorting these stocks like for 10 months\n\nthis is going to be very very ugly", "score": 3, "replies": []}]}]}, {"body": "I'm not married, but in my opinion there should be full transparency on this kind of thing, especially if it is money that you share. Even if it is \"his\" money that he spends, if things go south and he loses a big chunk of cash (e.g. 100k...), do realise that you too will bear the consequences of that. A likely scenario is that he will continue his current lifestyle together with you, but you will foot the bill for that. Also be aware that stock trading can be become an addiction, comparable to a gambling addiction. For sure your husband is very greedy when he shorts Netflix and Tesla. Lastly, please be aware that the possible losses on a short position is are infinite (if the positions are not closed automatically).", "score": 8, "replies": [{"body": "I'm not married either, but I wouldn't share finances with someone without full transparency. That just seems weird. Why on earth would I contribute to a shared financial future with someone if they expect full control of it in secret???", "score": 5, "replies": []}, {"body": "Definitely was looking for that infinite loss piece.  Definitely not something I am okay with, if it's a lot of money at stake.  Guess I will need to ask for actual numbers ", "score": 3, "replies": []}, {"body": "> I'm not married, but in my opinion there should be full transparency on this kind of thing\n\nI disagree. We can't watch a bunch of normies get trawled if they say their a troll in the TL;DR.", "score": 1, "replies": []}, {"body": "Technically there is a limit to the losses that can be sustained from a short position depending on the current market cap. I think some people think they can go into thousands of dollars into debt over night when in reality the losses are only infinitely possible if you hold onto your position for an extended period of time. ", "score": 0, "replies": [{"body": "yep. but he's shorting tesla & netflix, so... :p", "score": 1, "replies": [{"body": "Teslas been pretty volatile so depending where he went in it could be a ok deal. ", "score": 1, "replies": [{"body": "yes, but high risk too! it's very greedy imo", "score": 1, "replies": []}]}]}]}]}, {"body": "You should discuss and understand them. If anything, your own personality will add some diversification to both of your investments. Read a couple books in your down time to learn about the market. Tony Robbins' Money: Master the Game was my introduction to the market and it was REALLY insightful.", "score": 4, "replies": [{"body": "Thank you! I want to learn more, and I feel like this is the only subject I don't have a leg to stand on when discussing.  ", "score": 3, "replies": [{"body": "You could learn every term and method in this game, but a lot of it is a gamble! That's not to say you can't make a smarter decision on an investment. I'm personally still very new to this and it's a lot!", "score": 1, "replies": []}]}]}, {"body": "One of the biggest bull markets in years.... decides to short two of the stocks that make the least sense. ", "score": 5, "replies": []}, {"body": "Wow, entire sub just got trolled hard.", "score": 10, "replies": [{"body": "Yup. As if someone with a background in science would go on the Internet to ask some degenerate gamblers for their opinion.", "score": 6, "replies": []}, {"body": "I can’t believe I had to scroll so far for this.  Soooo fake.", "score": 1, "replies": []}]}, {"body": "Ask for all the broker statements of the last 5 years. \nLook for money in/out sections.\nEvery month at the end of statement it says Profit/Loss on open positions/closed positions. \nSit around the table. \nTalk\nMake sure he stops this madness. \n\nIt's not because he works in finance that he knows what he's doing. Hedge funds blow up every day and traders at the biggest banks in the world are getting kicked out every day because they fuck up.\n", "score": 3, "replies": [{"body": "Thanks for this.  I don't like asking questions that I don't know there can be an answer to, so he can't potentially try to brush me off", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "This sounds like my husband's point of view, which I do kind of understand. We have one joint account, but it has hardly any money in it.  Still kind of operate under the same money arrangement we did when we were dating.  Mostly need to understand if his investment account goes bust, can that start taking from our other accounts.  Guess I'll have to figure that out.", "score": 1, "replies": []}]}, {"body": "I used to tell my wife about every penny I make in detail and in dramatic fashion. She got tired of all that real fast.  I don't have to tell her about my losses now. 😁😣😑", "score": 3, "replies": [{"body": "\"I'M UP $8!\"", "score": 3, "replies": []}]}, {"body": "more of a /r/relationship_advice type of question", "score": 8, "replies": [{"body": "Best advice in the thread.", "score": 2, "replies": []}, {"body": "How are you downvoted?", "score": 0, "replies": []}]}, {"body": "You definitely need to figure this out ASAP imo...I try speaking to my SO about it all the time, though she is rather uninterested. It is definitely important to know the totals you're up/down. Also, shorting opens you to basically unlimited loss, meaning you can easily go bankrupt (and you will if he keeps the NFLX short position)", "score": 5, "replies": [{"body": "Appreciate this!  That was one of my major questions.....if this is a loss that would just take his investment funds to zero potentially, or affect all of our assets/income potentially.  ", "score": 1, "replies": [{"body": "Please let us know what you have done. A follow up would surely help others in a similar situation. It is not okay to potentially ruin your families lives over a gambling addiction. ", "score": 1, "replies": []}]}]}, {"body": "Yea you need to get him to spill the beans. A marriage is a partnership, how can you trust a partner in something if they're not telling you the whole story or asking for your input before making moves with something that you're also invested in.", "score": 2, "replies": []}, {"body": "At this market, simply speaking probabilities, he shouldn't short any stocks. There are shitloads of long opportunities, lower risk higher return stocks. TSLA is a hot potato for me and NFLX- either stay on the sidelines or go long. you should beware of your FAMILY's finance and investmnets as much as your husband is.", "score": 2, "replies": [{"body": "This is what I was thinking, but just wasn't sure.  Nice to hear it from someone who hopefully knows more than me about the topic.", "score": 2, "replies": []}, {"body": "Short snap. That's the only thing I'm confident is likely to drop in the near term. \n\nTo lady, sorry but it sounds like you married a gambler without a good strategy. If you're going to go big with gambles, betting lots on visa or a big bank right now is a much better idea than shorting Tesla or Netflix. Hopefully it's not too late to learn", "score": 1, "replies": []}]}, {"body": "Short on tesla and netflix? Probably the same success chances as investing in lottery tickets. I don’t think this story is true.", "score": 2, "replies": []}, {"body": "You need to address this before he losses everything", "score": 2, "replies": []}, {"body": "He should be willing and able to explain what he’s doing financially with you. If not, your relationship and your financial safety are in danger.", "score": 2, "replies": []}, {"body": "As others have said, just ask him. I would also request logins to all the investment accounts and check the p&l statements or tax documents, because gamblers tend to lie about their finances. \n\nIf he had a short position on Netflix, he lost at lease a couple hundred dollars last night. If he's not being transparent with you about this, I would be concerned he's squandering money. ", "score": 2, "replies": [{"body": "requesting logins sounds like a good idea.  ", "score": 1, "replies": []}]}, {"body": "I am the one in our relationship that deals with finance (since I work at a bank) and have interest in investments.  I would looove if my boyfriend would take some interest in our investments but it’s not really his thing. However, he has full access to our investment holdings as I have added him as a trading authority on my sole owner accounts. ", "score": 2, "replies": [{"body": "Thanks for sharing.  Guess I will ask for access to accounts, just so I can at least see what's going on.", "score": 1, "replies": []}]}, {"body": "In my opinion if he wants to have his own separate account and risk it all more power to him but if he is being that risky on your joint investments is completely irresponsible. You have a right to push him on the issue. If he is not cooperative and you find yourself disagreeing with his strategy then don’t be afraid to insist on your own separate investment account. If you aren’t comfortable investing on your own. There are many firms that have inexpensive managed products which will manage an account for you based on your risk, objective and time horizon. Either way I bet you will do much better than your risky husband lol. Just make sure you don’t let him anywhere near your retirement accounts. ", "score": 2, "replies": [{"body": "So if he is only using money he has made in the stock market, then that's the only money that can be risked with his positions?  I think I am okay with that, but if not, I kind of want to know if it can affect our other assets.  thanks for the insight", "score": 1, "replies": [{"body": "If the money is in a brokerage account that is only in his name then, yes it will only affect his money that he has put into the account. You want to make sure the money he is investing isn’t coming from a joint account that includes your money too. \n\nThe only scenario I could think of that would possibly affect your other assets is if he is borrowing the money to place these risky trades. In that scenario if he looses he might owe the money he borrowed, which may cause him to have to liquidate other assets. ", "score": 1, "replies": []}]}]}, {"body": "He’s right about those short positions, don’t ask for stock market advice on reddit, you’re going to get terrible advice, especially on this subreddit", "score": 2, "replies": []}, {"body": "You are married. He is investing your money too! If you want to know, you are entitled to know. You are definitely capable to understand what a short position is and what his investments are. It’s really not that complicated. In fact, people that tell you it’s too complicated usually just like being in control without being questioned!", "score": 2, "replies": [{"body": "But if he makes 2/3rds the money and bets 1/3 of \"their\" money, technically his since he already put his 1/2 in the pot.", "score": 1, "replies": [{"body": "That’s not how marriage works ", "score": 1, "replies": []}]}, {"body": "This is kind of my feeling on the subject.  I think that's what he's doing....some of what I see on here are questions I have raised myself, or conclusions I have arrived at, but just wasn't sure.  thanks", "score": 1, "replies": []}]}, {"body": "New account. No posts or comments. Probably a troll", "score": 2, "replies": []}, {"body": "Your husband has a gambling problem and you need to open the line of communications ASAP.\n\n", "score": 2, "replies": []}, {"body": "If he admitted losing 100k that means you're down about 225k.  You married a degenerate gambler.  If you want to stay married I suggest coming to grips with the fact that your net worth is now zero and start keeping your money separate from his.  There is no need to discuss investment strategy with him, he has no idea what he is doing.", "score": 5, "replies": [{"body": "Why do you assume he's gambling more than he can afford to lose or that their network is a paltry $200k?", "score": 2, "replies": []}]}, {"body": "Please repost this to r/relationship_advice. You will not find the answers you seek in this sub.", "score": 3, "replies": [{"body": "Just tell her to get a divorce now if you want to take it there", "score": 1, "replies": []}]}, {"body": "As a wife his decisions effect your future too. Debts or profits. You need to be firm that you need to see investments and know why he took those. What if he loses it all? Are you ok working to 90? My wife is science major and it is tiring explaining what I did and why but its super important. You may want to also read some if the sidebar info in investing to give you some basics. Boggle heads, investors have short easy reads too. Also, is this $ for retirements or other? If retirement a good % should be diversified and in funds/etf's. Gl, and don't hesitate to ask questions here, this is important.", "score": 2, "replies": [{"body": "These are the questions I ask....No, I am not willing to work till 90, and am really only ok with him gambling with money he has made in the stock market, and not touching our salaried money.  Not sure if that's even a possibility, but I will talk to him about it.  Definitely will read some of that, I can handle a short read. ", "score": 2, "replies": []}, {"body": "Also, his hesitation and shady behavior sounds like big red flags imo, like down lots $. Hopefully not", "score": 2, "replies": []}]}, {"body": "You’re his wife. That means you’re his partner. It doesn’t matter if the money came from his job or your job, that money doesn’t belong to either of you, it belongs to your marriage. It sounds like he’s in some very risky positions, and the two of you both need to understand any risks he’s taking. Is he investing extra money, or is he risking your retirement nest egg? \nYou need to know what’s happening with your financial future. \nAlso, it sounds like he’s gambling, not investing. If he’s playing with enough money that he’s lost and made 100k in a few months, you should have at least 250k in something stable, like bonds or index funds. ", "score": 2, "replies": [{"body": "Exactly my questions to him....thank you.  I'm fine if he wants to risk money he has made from the stock market, but don't want it to be money I plan to budget our future with, especially when/if we have a family.  He did mention before he had a really good year last year, and made about 600k, but again, I don't know the real starting point and ending point of this up and down with money,", "score": 1, "replies": []}]}, {"body": "Well, you're married, so he has a responsibility to you to be financially responsible. I think you should ask him to break down for you how much money you guys have in the market, how much of it is long, how much of it is short, how much margin (borrowed money), how much of it is in risky positions, how much of it is conservative (e.g. in diversified index funds), whether you're overweight in any sector or exposed to any isolated risk factor, and how well the portfolio has performed (% gain) over the past year.\n\nWhen he lost $100k, what percentage does that reflect? Do you guys have $1million on the stock market? If so, well a brief 10% loss can happen to the best of us. If it's more like $200k, then he's taking waaaay too big, concentrated risks.\n\nShorts have the potential to put people in debt, because you can be on the hook for losses that far exceed your account balance. His bad decisions can fuck you both over. So while it's his field and so you should obviously give him some wiggle room here, definitely not carte blanche.  Shorts, on the other hand, can be useful to reduce market exposure. So if the market crashes, the gains from your short positions can offset your other losses. So they can protect your finances, just as they can ruin them. TSLA recently dropped from $385 to $293 within the span of a couple months -- so he could have potentially made bank if he had timed it well. But TSLA is already back on the up and up and NFLX is also on a tear. Not that many people are good at timing the market. Even if he's good at shorting, in this market I hope he's not more than 25% short. The market has so much bullish momentum that the odds are against you when shorting. If he's really into shorting, hopefully he also made some smart short decisions like GE or Sears.\n\nIf he's (net) losing money in this market then frankly he's really bad at the stock market. *Nobody* is losing money right now. If you guys didn't make at least 20% over the last year from your investments, he needs to take a good look in the mirror and say to himself, *maybe I'm overestimating my capabilities*. It means he's dumber than a passive S&P500 index fund, and significantly dumber than a passive Dow Jones Industrial Average or Nasdaq 100 fund. If he's not beating the indexes, how does he justify that?\n\nBased on what he's shorting it sounds like he might be Aspergers. Sounds like he's only looking at the numbers but not taking into account the context.\n\n", "score": 2, "replies": [{"body": "This is what I need to know, and didn't know how to ask it. Thank you.\nI know he made something like 600k last year in the stock market, but don't fully understand what that means for this year, or even years prior.  \nMy main concern is this affecting our money we earn in our salaries each year.  This definitely gives me some good pointed questions to ask, and know I can get answers to, so thanks.", "score": 1, "replies": [{"body": "Ok making $600k profit in one year is obviously pretty damn good!", "score": 1, "replies": []}, {"body": "Entirely possible that 600k doesn't exist anymore based on what I've read in this thread. Please keep us updated after you talk to him, this is juicy. ", "score": 1, "replies": []}, {"body": "On the flip side, if I were making $600k in the stock market in one year, I definitely would *not* talk to my SO about it. I don't think it's good for anyone to become rich without having to work for it. That can only change people for the worse. Or if you have separate finances, it could only do bad things to the dynamic between you two.", "score": 1, "replies": []}]}]}, {"body": "get in ETFs like VTSMX with vangaurd. Very few managed accounts (by fund managers or people like your husband) ever make more money than the etfs, rarely ever! Plop your money in there to be sure and let him use \"his\" (or some portioned amount) money to trade as he does. It's always a good idea to \"play\" with some portion of your money to learn, but the majority should be with ETFs because they're a more diversified (low risk since you capture different types of investments with varying risk levels (fluctuations of price)) and low-cost (lower trading fees).\n\n I do exactly this and still trade like a retard with WSB strategies with like 25% of my money. $MUUUUUUN\n", "score": 2, "replies": [{"body": "I was messing around with our non-401k money like two years ago, figured investing was better than a savings account. Listened to a podcast with a smart(sounding) guy who said he was all-in on Facebook, Netflix and Amazon, so that's where I put our non-essential cash.\n\nI feel wildly competent despite having no real idea what I'm doing.", "score": 2, "replies": [{"body": "we're in a boom, so you could have put it in most nonstart-up tech stuff and made money. Kind of a win-win thing there. ", "score": 2, "replies": []}]}, {"body": "Good idea.  I would be totally okay with him being stupid and losing agreed play money, but not really sure where the line is on our money at the moment. I think he needs to move more in this direction, as it isn't all just extra money, and just about him anymore, especially if we have kids $$$$", "score": 1, "replies": [{"body": "Good to hear, I hope it works. If he doesn't automatically agree with only using agreed-on money, you should ask to see his total return for 2017. If he didn't beat VTSMX (~23.75% gain), you ought to convince him his time he puts in is of little value if putting money aside with near zero time commitment can make such profits. \n\nIf he has made very little (<9%) during the past year, you've lost out on a significant amount of money and I would honestly push not to let him ever touch your combined investments; if this is his hobby (and you guys divide expenses to include hobbies, i.e. never let him use YOUR money) then definitely stick to the \"play\" money idea. Very few people ever beat the market (ESPECIALLY consecutive years), so don't let him beguile you into thinking he can do. Everyone thinks they're the exception, but damn near always aren't—very often it's sheer luck (e.g., a luck pick on a biostock may result in a 1000% gain or a 100% loss.). \n\nIf you have kids you should put that money in a 529 plan (look it up). ", "score": 1, "replies": [{"body": "Yes, because investing in an index is always going to return 23% every single year. You’re really an expert, what’s the name of your hedge fund? ", "score": 1, "replies": [{"body": "By and large your best bet, for the average person mind you, is to have passively managed investments. I have no idea why you commented something as if I am trying to be an expert, this is general advice recommended by investors like warren buffet...", "score": 1, "replies": [{"body": "Maybe you should use some common sense, market is completely overvalued. Why would you advise someone to put their money in an index at the end of a long term debt cycle? ", "score": 1, "replies": [{"body": "Well, if I'm wrong, please give us better advice. I don't pretend to know what is the best option. And since the future isn't entirely predictable, I don't think you'd be a better source than the next person.", "score": 1, "replies": []}]}]}]}]}, {"body": "Investing in indexes is a huge risk right now. US bond market is imploding, the stock market will soon follow. Don’t be wrong twice. ", "score": 1, "replies": []}]}]}, {"body": "Like others have said, if you want to know you shouldn't feel afraid to ask him. ", "score": 1, "replies": []}, {"body": "Rrrrrrrrriiiiiiiiiipppppp", "score": 1, "replies": []}, {"body": "Is this real?", "score": 1, "replies": [{"body": "yeahhh, like I think this is an elaborate troll attempt.", "score": 1, "replies": [{"body": "I wouldn't go as far as to call it elaborate. Lol", "score": 1, "replies": []}]}, {"body": "sadly, it is.", "score": 1, "replies": []}]}, {"body": "It wouldn't be appropriate since she both, has way more money than me, and isn't interested in it at all. ", "score": 1, "replies": []}, {"body": "F to pay respects", "score": 1, "replies": [{"body": "F", "score": 1, "replies": []}]}, {"body": "This was clearly bait or op is making funeral arrangements. ", "score": 1, "replies": []}, {"body": "So I'm assuming after Netflix earnings, he has moved out. Good luck", "score": 1, "replies": []}, {"body": "This is super embarrassing. ", "score": 1, "replies": []}, {"body": "I think it depends on how you do finance management within your family. If you don’t have a joint account where you both contribute, if your husband pays all the bills and you live primary off his income, then you shouldn’t ask him about HIS money. If you manage finances together, then you should have asked him that long time ago. ", "score": 1, "replies": []}, {"body": "I talk to my wife about my stocks all the time. She doesn’t care to understand stocks or the stock market. I manage her 401k for her too. Her focus is mainly on her hobbies but she still likes to hear me talk about it. She did stop me from selling Netflix 2 weeks ago and I am super glad she did :) it’s good to have someone to bounce ideas off of. I fine it most dangerous when people are quite and doing things secretly. Like a family friend who lost 300k in options.", "score": 1, "replies": [{"body": "I would like to get to that point with my husband.  Maybe I will learn a little more, and try to talk to him about it.  thanks", "score": 1, "replies": []}]}, {"body": "How directly have you asked? If he's only not talking to you about it because you're not that interested in it and/or he knows you don't really understand it, that may not be a big deal. Just tell him you want to hear it anyway.\n\nIf he's actually resistant to answer your questions and give you specifics, that's not healthy behavior and you may need to start looking at this not directly in terms of your investment portfolio but more broadly in terms of him having a gambling problem. The commentary from his friends is not encouraging.", "score": 1, "replies": [{"body": "My main question or concern is this just \"fake\" money (money he just has in the stock market, and not from our salaries) or losing \"real\" money (money we budget and earn from our careers.  I feel like he is just trying to brush me off, and I need real answers.  thanks", "score": 1, "replies": []}]}, {"body": "My SO isn’t very interested in stocks. We’re both in the medical field, and this is my thing on the side.\n\nWe’re engaged and have done the “my money is your money” thing for years now, so I like to keep him in the loop.\n\nBut ultimately, he said he trusts me. So that alone was enough to make sure I don’t make decisions that are too risky.  And if I suffer a loss, I make sure I make up for it.\n\nI’ve also made an excel sheet to keep track of my realized gains and losses, which he has access to. So he can go in and see whenever he wants. \n\nBut yes, I do tell with him from time to time how things are going and sometimes my upcoming plans so he can feel free to give me input because this is his money as much as it is mine.", "score": 1, "replies": [{"body": "This makes sense to me, and I would be perfectly happy if we operated this way.  Maybe I will suggest some of these points.  I just think it's a little worse, since I believe he is super risky with what he does, and is still operating under the the just him state of mind.  thanks for the info", "score": 1, "replies": []}]}, {"body": "How old are you both? What is the ballpark of the capital size you have in savings, just give me a rough number. Although from the sounds of it your husband's strategy sounds risky, and it is, it also sounds like your husband has at the least an above average understanding of how stock markets work. ", "score": 1, "replies": []}, {"body": "If he put a put on Netflix before their earnings call you seriously better considered making sure he isn’t alone. That’s possibly a fucking ton of loss.", "score": 1, "replies": []}, {"body": "Shorting two of the tech community's favored sons? Bold, bold.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I appreciate the info.  He's early 30's, I'm late 20's.  Yea he reaaally did not want to talk about this a few days ago. I just don't know any of the details of his positions.  Waiting to really ask about it until next week, as he has a lot of bs going on at work this week.\nI haven't checked to see if his dick is still in tact, but it sounds like I need to after reading all these replies.", "score": 1, "replies": []}]}, {"body": "Shorting Tesla and Netflix? Wow....get your money away from him.", "score": 1, "replies": []}, {"body": "Educate yourself on stocks. Then start investing on your own. After a year compare return on investments and let theperson with highest be in charge of finances.", "score": 1, "replies": []}, {"body": "Nope ", "score": 1, "replies": []}, {"body": "I think you should reconsider how your finances are managed. You should a least manage your own retirement account. Beyond that I would have a system for splitting extra money into three savings/taxable accounts: a personal account for each of you and a joint savings. He is allowed to gamble with his personal savings but you can review the joint account investments and veto high risk. You can each do whatever you like with your personal savings.\n\nThis kind of system only works if you have enough money to split savings after retirement into three accounts. If you can I think it makes the most sense. You decide on the distribution ratio into the personal accounts, and then there is no haggling over every little thing. You have a definition of joint vs personal expenses and beyond that you do what you want with your personal account without consultation. If he wants to gamble away his personal account thats fine as long you both have good retirement and \"joint\" accounts. What is done with the joint account money must be transparent and agreed upon.", "score": 1, "replies": [{"body": "I would completely happy with this arrangement.  He loves all this crap, and I don't want to tell him what to do with everything, just as I don't want him to tell me what to do with my own spending money.  \nSo if he squanders his own personal account money in a short position, is that as far as that can go?  Or could we have to owe more than what is in that account?  I guess I need to ask him that.  thanks", "score": 1, "replies": [{"body": "> is that as far as that can go\n\nNo... He can borrow money. Since you're married, you're on the hook too.\n", "score": 1, "replies": []}]}]}, {"body": "This is fake\n Brand new account, doesn't feel right\n", "score": 1, "replies": []}, {"body": "Your husband sounds like an idiot. Anyone with that much money in stocks would need to be an idiot to lose it so easily.", "score": 1, "replies": []}, {"body": "> Husband is knowledgeable and works in the finance field\n\n> he has short positions on tesla and netflix\n\nPick one. Shorting Tesla and Netflix sounds like a *fucking horrible* idea. He definitely sounds like a /r/wallstreetbets guy, or OP is just trolling us.\n\nIf you are being genuine, then you should know you won't get much advice here. Go to /r/investing and /r/personalfinance and prepare to get lambasted for your husbands terrible investing habits. ", "score": 1, "replies": []}, {"body": "It's your money too. Demand to know where it's going. Simple.\n\nIf he's shorting tech stocks he's probably been in a world of hurt.", "score": 1, "replies": []}, {"body": "He might know about finances, but it doesn't matter, cause your husband is not investing... He is gambling. ", "score": 1, "replies": []}, {"body": "> I don't completely grasp or understand how our investments work\n\nwhile I would say you desperately need to have this conversation, you need to fix the above before and during said discussion.  if you don't understand it and you fall back to that instead of trying to grow into understanding, it's going to cause division and arguments probably for the remainder of your lives (or your marriage).  if the lack of understanding is solely due to you not trying, you have a lot of work ahead of you.  If it's because he's hiding things or okay with taking an insane amount of risk, that's another problem altogether.  I can understand someone shorting NFLX and TSLA - I have friends who've joked about it on a weekly basis because they look at a few limited factors such as P/E ratio and the phenomenal growth it's had over the past five years or so - but you have to be paying strict attention to the market to make moves like this.  One of the first things I would urge you to do is read up on short selling stock, in general.  Particularly the parts where it refers to \"potentially infinite losses\".  Short sales are supposed to be rare and cautious moves, but there have been changes in regulations in the past decade or so that have made it possible to do it willy-nilly as long as you have liquid cash to back it up.  And I believe your concern is specifically with that liquid cash - your savings and investment accounts.\nHere's an article that was posted on this sub or another stock related one in the past few months that should give you something to chew on.  \nhttps://www.huffingtonpost.com/ellen-brown/short-sellers-investors_b_985701.html\n\nI will add one more thing just to finish this up.  There is a strong correlation between taking extreme risks and doing other things that would pose a serious threat to your marriage.  I became aware of this because of a particularly unpleasant ex-girlfriend.  If there are warnings signs like him going \"out with the boys\" a lot, or working late frequently, you might have another problem on your hands.", "score": 1, "replies": [{"body": "I am interested, and I almost feel like he wants me to think I don't get it as much as I do, just so I can't have a say in what he does.  I know that sounds bad, but whatever.  Definitely do need to learn more about the infinite losses, as that's my main concern.  ", "score": 1, "replies": [{"body": "> Definitely do need to learn more about the infinite losses, as that's my main concern.\n\nOh common, you're being completely unreasonable. Being *concerned* about your husband yoloing you into bankruptcy? You shouldn't even think about it. /s\n\nSeriously though, both your marriage and financial arrangement would have me running for the fucking hills. I strongly suggest you keep your money separate from his and do not let him have access to any of your accounts and also consult with a lawyer about what would happen to assets in your name if your husband ends up owing his brokerage 30 million. On that note, I would also not want the house or cars or really anything in his name. \n\nThis is of course, assuming, that your husband hasn't already eaten a revolver after netflix earnings. Lets just hope he was either straight up short selling with what he could afford to lose or buying puts with expendable money and not *selling* naked calls like a complete and total fucktard. God help you if has portfolio margin and he juiced it selling naked calls. ", "score": 1, "replies": []}]}]}, {"body": "OP should write this topic in r/relationships, not here. This has nothing to do with stock picking. It has to do with communication and division of tasks in OP’s marriage.", "score": 1, "replies": []}, {"body": "Why would you open up a short position on something most humans use every day", "score": 1, "replies": [{"body": "Shorting water and oxygen! YOLO", "score": 1, "replies": []}]}, {"body": ">shorting FAANG\n\nishygddt ", "score": 1, "replies": []}, {"body": "I made my wife go through some investor profile tests to find out what she was comfortable with and after we agreed on her risk level comfort we allocated a determined portion of our portfolio to my stock account and allocated the rest of our portfolio to mutual funds that balanced our risk.  I tell her all the money I make and lose and she doesn't care.  I think she's happier now that I regularly make money but wasn't upset when I used to lose money because I established a very strict routine before I invested more money.  He probably doesn't talk about it with you because he's not being honest with himself about his skill level and could maybe use some more time in the market before playing around with such large sums that could easily be making money in mutual funds.\n\nedit: set your financial goals as a couple and get on track to meet those goals.  If you are already on track to a comfortable retirement then invest however much extra money you want in the stock market but you guys must communicate about it.  Don't make him get defensive when you ask but if you guys share money I think you have a right to know.", "score": 1, "replies": [{"body": "I would be okay if we had an arrangement like you two do.  I'm fine with letting him handle most of this, I just want to know we have a set bar on what we are willing to risk.  appreciate the advice", "score": 1, "replies": []}]}, {"body": ">Husband is knowledgeable and works in the finance field.\n\n>All I know is he has short positions on tesla and netflix\n\nPick one\n", "score": 1, "replies": []}, {"body": "I would...if I had one!", "score": 1, "replies": []}, {"body": "If you want real answers try /r/askwomen", "score": 1, "replies": []}, {"body": "I do all the investing in my marriage.  My husband isn't very interested in it but I tell him what I am buying and selling and keep many spreadsheets to track everything so he can see at a glance what is going on with our finances.  I don't short stock because I think it is gambling.  I go for the long term.  My former husband let me do all the investing as well but I made sure he knew what I was doing and why.  He worked with very rich clients and they kept telling him to invest in an over-the-counter stock (OTC) and that he couldn't lose.  After checking it out I explained to him that the stock was too risky to hold and the company's financials were very shaky. Over-the-counter stocks are very risky and once they fall it is hard for the average holder to get out in time to save themselves.  I even put a couple of hundred dollars into the OTC stock to show him how unstable the stock was. Later that month, when my husband saw one of the guys he worked with ride in on a new Harley motorcycle to the jobsite and the guy said he owed it to the client's stock tip, my ex-husband then, without telling me, dumped all of our investments into that over the counter stock.  A few days later when I came home from work, my husband was a sickly green color.  I asked him what was wrong and he told me he lost everything we had.  The OTC he invested in was what is known as a \"pump and dump\".  From then on everything went downhill and we divorced. What I would do differently, when married him and realizing he was unstable is to keep separate accounts...ones he couldn't touch then at least we would have had something and we maybe wouldn't have divorced. When you have a spouse with different goals, you need to talk and either get on the same page or keep things separate.  Also, learn how to invest even if it is just a 401K or IRA or mutual fund.  There is a ton of good information (see r/personal finance sidebar to start or go to Vanguard's or Fidelity's websites). Learn all you can about investing.  I don't gamble, I invest in long term solid companies and I learned how to do it by reading a ton of stuff.", "score": 1, "replies": []}, {"body": "Christ you're fucking stupid for not talking about this before you got married.", "score": 1, "replies": []}, {"body": "I bet your husband is a mod in /r/wallstreetbets ", "score": 1, "replies": []}, {"body": "Your husband is not investing.  He is gambling and probably addicted.  He won’t stop until you’re broke.", "score": 1, "replies": []}, {"body": "Stop posting on r/StockMarket and go talk to a therapist and sort this out.  Your SO sounds like he has a gambolling addiction and being secretive over shared wealth is a big relationship killer.\n\n", "score": 1, "replies": []}, {"body": "He should be definitely be transparent with you. We have been married for 5 years and although my wife isn't that interested, I let her know what we are investing and how much. I also provider her our net worth on a monthly basis. We are just boring index fund users though, nothing exciting like options.", "score": 1, "replies": []}, {"body": "I am responsible for our family's investments: my retirement, my wife's, our kids education account, and our registered tax-free savings account. My wife doesn't understand the first thing about investing or trading but so the same I wouldn't think of making a move without discussing it with her first.\n\nYou don't need financial advice. You need relationship advice.", "score": 1, "replies": []}, {"body": "I don't tell nobody shit except when my yacht order is in. If people ask I say I'm doing fine regardless of how I am doing, and never tell them specifics. People ask you to manage money when you do well, and they ask you what the secret is. ", "score": 0, "replies": [{"body": "All in $MU", "score": 3, "replies": [{"body": "I am doing fine with this piece of shit stock, thanks.", "score": 1, "replies": []}]}, {"body": "I don't think my husband is poop with jelly, but you sound just like him", "score": 1, "replies": [{"body": "I have to assume not as I am unwed, but I pray he is not of my kin. We are a dangerous people of impulsivity and delusions of grandeur. I pray he is more fiscally, and emotionally stable than I am.", "score": 1, "replies": []}]}]}, {"body": "get a separate account dumbass", "score": 1, "replies": []}, {"body": "I don’t think he’s very knowledgable of how business works if he shorted Tesla and Netflix. What a guy... If he shorted Netflix he may be crying tonight. Go look at what happened... Tesla on the other hand is going to be the leader of the automotive industry in the next 5 years, so I don’t know where his logic came from. Very sad investment. ", "score": 1, "replies": [{"body": "Tesla is a time-bomb ... but the market can stay irrational much longer than you can stay solvent.  \nAll hail Enron Musk.", "score": 2, "replies": []}, {"body": "Shorting Netflix is a gamble, as they have high growth but their debt is increasing substantially and soon they will have to rely entirely on originals. \n\nIt is seriously hilarious that you think that that Tesla of all people will be leader of the automotive industry, they could only produce 2500 model 3s in 2017, “bottlenecks” have caused them to delay the expected 5,000 units per week production rate to “late Q1 2018”. Volkswagen already a 40 billion dollars investment in electric cars that will chew tesla up in a decade, their investments will only increase with EU regulation. That nearly 6 times Tesla's revenue. If you do have investments in Tesla good luck, their market cap is around half that of volkswagen, but their revenue is only 1/38th. ", "score": 2, "replies": [{"body": "You will see and regret your analysis. ", "score": 0, "replies": [{"body": "If you understood my analysis at all you would see why I don't. I could like 100 companies that are a better investment. ", "score": 1, "replies": []}]}]}]}, {"body": "For what its worth, I'd be shorting Netflix right now if I had the money and expirence.", "score": 1, "replies": []}, {"body": "So since you said you aren't very knowledgeable about investing let me add some information. If he is shorting Netflix and Tesla then he essentially gambling. A short is where you borrow shares from a firm and hope that the price decreases over time, at which point he will purchase the shares on the open market and return the borrowed shares. \n\nI'll give you an example which you can also find on the \"short\" page on investopedia\n\nLet's say Tesla is trading at 100 a share and your husband believes that they will go down, so he short sells 100 shares of Tesla. When he borrows the shares he also is paying some interest rate on the value of those shares, let's say 8%.\n\nSo let's say Tesla drops to 75 dollars per share. \n\nSo he now has the short sale proceeds of 10k, the short position of 7.5k and 800 in interest due. \n\nNow he purchased the shares for the market price of 75 dollars and returns the shares to the firm he borrowed them from and his profit looks like this\n\nProfit: 10k - 7.5k - 800 = 1.7k\n\nBut this example assume he makes a good bet, let's say instead Tesla goes up to 125 a share. Your husband after the term that he agreed to borrow the shares for still has to return them and pay the interest on them but since the share price is more then the short sale proceeds he now has to put in more money to cover the shares he owes. So he has to use the 10k short sale proceeds of 10k and an additional 2.5k to buy the shares to cover his short sale as well as the 800 dollars in interest. \n\nLoss: 10k - 12.5k - 800 = -3,300\n\nIf you are not comfortable with this you need to have a serious discussion about it, especially if he is using joint finances. Option trading is gambling, short and simple. ", "score": 1, "replies": [{"body": "Shorting isn't \"essentially\" gambling.    \n\nIf I bought I long position on tesla or Netflix I'd be gambling as well. \n\nThe entire stock market is gambling. You have no idea where it will go tommorow. \n\nSome positions are less risky than others, but saying what he is doing, and only what he is doing, is gambling, is simply misleading.", "score": 4, "replies": [{"body": "Shorting isn't necessarily gambling.  But shorting NFLX and TSLA sure is. These are high-flying stocks with a ton of risk towards the upside.\n\nGambling is when you risk your money based on a material element of chance. Netflix has insane growth figures -- everything is pointing to the price going up. So placing a short on Netflix is betting that there is some yet unknown information that will drive the price down. There's no way he has inside information on Netflix. The odds that the price will go down are against him. So for his short bet to pan out, it would entirely depend on chance to override the odds.\n\nHad he been shorting GE or Sears, I wouldn't have called that gambling.\n", "score": 1, "replies": [{"body": ">  based on a material element of chance\n\nThe entire stock market comes down to chance. You're contradicting yourself. \nNo matter the position, you are BETTING that something will happen, some things have higher chances than others, but you are still betting. That, by definition is gambling. You can have a 98% chance of being right, by definition, you are still gambling. \n\nYou can spin it however you want, but at the end of the day you could have a diversified and all around \"safe\" portfolio and the market can still tank.\n\nHave you looked at the price of Sears puts? pretty high for not being a gamble.. \n\nAll I am trying to say is that /u/dauntless236 is misrepresenting what is happening. Throwing in all the confusion about unlimited losses (that's what margin calls are for) and trying to explain what a short is, and putting fear into op by screaming gambling, is unnecessary.\n\nAll OP needs to know is that her husband is taking a riskier gamble than what she is comfortable with. She is risk adverse, her husband is not. They need to talk about it. \n", "score": 0, "replies": [{"body": "Bets based on skill, talent, or knowledge are generally not considered gambling.\nPoker is often not considered gambling despite the element of chance, while on the other hand roulette is. The more you minimize the element of chance, the less of a gamble it is, the more it becomes an informed (or uninformed) decision. \nThe casino patron is gambling, but the casino isn't. The casino has its house edge -- whether it makes money or not has little to do with chance, though there is of course an element of chance. \nThere is an element of chance in whether you'll survive crossing the road. Crossing roads is not gambling. \nIn the stock market there are informed decisions, tried-and-true strategies, and then there is gambling. A long-term buy-and-hold passive index-fund strategy is not gambling, it's an informed decision. Shorting a fair-valued high growth stock in a raging bull market is gambling, because for the bet to work out it depends entirely on chance, not knowledge or strategy.", "score": 1, "replies": [{"body": "I'll say again, The entire stock market comes down to chance. No matter the position, you are BETTING that something will happen, some things have higher chances than others, but you are still betting. That, by definition is gambling. You can have a 98% chance of being right, by definition, you are still gambling.\n\n>Shorting a fair-valued high growth stock in a raging bull market is gambling, because for the bet to work out it depends entirely on chance, not knowledge or strategy.\n\nWhen Michael Burry spent weeks reading through home loans to make an informed decision back in 2008. Would you call that gambling, or would you call that a knowledgeable, informed decision/strategy because he spend weeks (months?) doing research and understood what nobody else knew? \n\nBecause by your definition, he wasn't gambling, and yet I think that you would argue that case otherwise. \n\nYou can claim that that poker isn't gambling, hell, I've seen roulette addicts claim that it roulette wasn't gambling ether. An index fund isn't gambling, until the next market crash and half of Wallstreet jumps out the window because of the money they LOST.\n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol, then longing is also \"essentially gambling\".  Fuck, it's all \"essentially gambling.\"  Don't leave your house brah, huge gamble.", "score": 2, "replies": []}, {"body": "Wouldn't exactly call options trading \"gambling\". You're aware all of the largest financial institutions trade options as well, right? And Warren Buffet? Is he a gambler? To **you**, options trading may be gambling if you don't know what you're doing, but to those who do they can make high probability trades and leverage their capital. \n", "score": 1, "replies": []}, {"body": "It isn't option trading. Options are the right (but not necessarily the obligation) to buy or sell shares of a stock at certain prices by certain dates. ", "score": 1, "replies": []}, {"body": "This is what I am here for..thank you for the education.  \nI am ok with him having play money that we do not budget for in our day to day, year to year, but it seems like shorting is not structured to definitely not touch, as I would say, \"real money\"", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "They are married so without a prenup it is their money. ", "score": 2, "replies": [{"body": "Fuck that noise", "score": 2, "replies": []}]}]}, {"body": "No.\nI try to talk to her about finances in general but she's oblivious and disinterested. Realistically 100% of our financial well-being is on my shoulders.", "score": 0, "replies": [{"body": "This is a lot like my situation.  I understand he is stressed about that, and it's hard to have an input when he is more knowledgeable than I am in this topic.  He did very well last year, so it's hard to tell him what to do.  Nice that you try to talk about it though", "score": 1, "replies": []}]}, {"body": "if he's the bread winner - will you leave him after he blows through all his money?\n\nAlso, is it your money or his money? I feel like that's a big difference. Like, are you kind of just a trophy wife who doesn't even have a real job and just spread your legs once a week for your rich husband?", "score": 0, "replies": []}, {"body": "Did you make any of the money he is spending?  Are you getting everything you need?\n\nMan makes 100k a year, woman makes 50, pools 150k, \"our money\" (75k is mine) ...sigh*\n\nLet him be.", "score": 0, "replies": [{"body": "Honestly, this is exactly our situation, and what he says to me about it.  I actually understand that logic, I just don't know how far all of that goes.  Could we potentially lose our house, or is this just money he has in some investment account that goes up and down, and that's all we will lose?  I guess that's my main concern.", "score": 1, "replies": [{"body": "If he is trading highly marginable securities like options on futures or options, it is possible that he could lose more than he puts in, but that is actually difficult to do.  This is probably the case, as its the fastest way to lose (and make) money.  If he places stop losses such as stop limits, he may be able to mitigate losses.  Some people let emotions ride when they trade, and this is a problem - they dont place stop losses (stock sells or buys back to cover a short position when a certain stock price is hit) and have the feeling that it will \"bounce back\".\n\nBrokers got screwed in the past and learned NOT to let people lose more than they put in - and its called margin requirements.  You will not lose the house.  The brokers require \"good faith moneys\" to be deposited in the account in order to trade on margin.  Margin is borrowing money against securities already in the account (cash, stock, LEAPS, etc.).  In the case he is on margin and loses a lot of money, he will get a \"margin call\", which requires he deposit more money into the account to keep his positions.  If he does not, they will liquidate his assets in the account and deduct the chunk of money that he was short.\n\nIts frustrating, but its not a total loss.  It won't cost you the house.\n\nThere are very rare scenarios where I can imagine him losing more than the acct value.", "score": 1, "replies": []}]}]}, {"body": "Only someone who doesn't know what they'd doing would short Tesla or Netflix. Not because these are great stocks, but because they're story stocks, meaning their price has little to do with reality and more to do with market sentiment. Your husband is essentially gambling your life savings. Imagine if he went to the casino regularly, except on a much grander scale. \n\nIf it were me, Id worry about my financial future above my marriage. If this guy is going to destroy you financially, he isn't worth being married to. And the fact youre having difficultly talking to him about it leads me to suspect it's a shitty marriage to begin with. ", "score": -1, "replies": []}]}
{"title": "Tesla autopilot mode causes car to crash into firetruck - Expect 12% Gain", "selftext": "", "id": "7sfib2", "created_utc": 1516724397.0, "score": 504, "upvote_ratio": 0.95, "num_comments": 94, "comments": [{"body": "[deleted]", "score": 385, "replies": [{"body": "You don't understand, with Tesla's proprietary body scanning medical block chain diagnostic services, EMS were aggressively contacted before this valuable Tesla customers aneurism was able to burst. Block chain.", "score": 66, "replies": [{"body": "You have to understand", "score": 27, "replies": [{"body": "No not at all madam you have to understand, this is called disintimidation. Disintimidation is nothing but removing the middle man.", "score": 8, "replies": [{"body": "I am a profitable company!", "score": 8, "replies": []}]}]}, {"body": "So do i long express mail service now?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 77, "replies": [{"body": "Yes, this is good for TSLA.", "score": 31, "replies": []}]}, {"body": "[deleted]", "score": 121, "replies": [{"body": "Long NVDA since they will need those cards to build terminators. ", "score": 24, "replies": [{"body": "Jokes on terminators. They can’t afford 1080s with all the miners grabbing the stock", "score": 10, "replies": [{"body": "This is why we need a WSB ICO", "score": 4, "replies": []}]}, {"body": "Insider info suggests they will use NAND memory exclusively from MU in future Tesla vehicles in the model Y - expect a 4% in MU drop followed by 2 months of stagnation\n\nSource: WSB", "score": 4, "replies": []}]}, {"body": "And browse /r/meirl", "score": 6, "replies": []}]}, {"body": "This is good for Tesla.", "score": 45, "replies": [{"body": "Tesla, where the crash test dummies are you!", "score": 10, "replies": [{"body": "This one good", "score": 1, "replies": []}]}]}, {"body": "Please don't be an AMD chip", "score": 41, "replies": [{"body": "If it is, we'll probably be seeing something like TSLA going up and AMD down.", "score": 11, "replies": []}]}, {"body": "Alternate headline:    \n\"Drunk Driver tries to get out of DUI by blaming Autopilot\"   \n     \nFollowed by Tesla press release stating accident would have been avoided autopilot been engaged. ", "score": 32, "replies": []}, {"body": "Long Tesla", "score": 19, "replies": []}, {"body": "If you short tsla you have no love for money.", "score": 17, "replies": []}, {"body": "They say three times in the article the driver claims it was in autopilot mode. When the investigation is complete we'll see if he's full of shit.\n\nWe've seen vids of Teslas detecting potential accidents two cars ahead. Hard to believe it didn't see a fucking red tank directly in front of it.", "score": 60, "replies": [{"body": "Apparently he was intoxicated: https://www.washingtonpost.com/news/innovations/wp/2018/01/23/a-tesla-owners-excuse-for-his-dui-crash-the-car-was-driving/?utm_term=.23559ab02bb2", "score": 39, "replies": [{"body": "> a tenuous relationship with consciousness\n\nThank you /u/washingtonpost", "score": 27, "replies": [{"body": "Cheers!", "score": 22, "replies": [{"body": "Long $WAPO", "score": 7, "replies": [{"body": "Short $DNC ", "score": 0, "replies": []}]}]}]}, {"body": "The car should still have stopped.  I get the whole \"attentive driver required\" thing, but the car is supposed to detect obstructions and stop, whether autopilot is engaged or not.\n  My years old Subaru does that with EyeSight.  EyeSight sensors are shit compared to what Teslas have.", "score": 8, "replies": [{"body": "Agreed. But “the car should’ve stopped on it’s own” doesn’t hold up in court or with the insurance companies ", "score": 7, "replies": [{"body": "True, but I really hope Tesla fixes their shit.  If radar doesn't work well for stationary objects, then they need to find a solution that does.", "score": 2, "replies": []}]}, {"body": "The fucking point is, it wasn't on autopilot, the dipshit was driving drunk and tried to blame autopilot.", "score": 5, "replies": [{"body": "Are you unaware that collision avoidance is still active, whether the car is in autopilot mode or not?", "score": 3, "replies": [{"body": "Tesla makes it clear not to rely on the system though. You can't just put pedal to the metal and expect it to stop you in every situation, you are responsible for the car and it's movement, and autopilot might help out in certain situations, or might not.", "score": 3, "replies": []}]}]}]}, {"body": "Two separate incidents", "score": 1, "replies": []}, {"body": "I know reading is hard, but that was another driver.\n\n>**One driver** had a blood alcohol content nearly double the legal limit and a tenuous relationship with consciousness when authorities found him on the Bay Bridge. **Another** slammed into the back of a parked firetruck on Interstate 405 in Culver City.\n\n", "score": 1, "replies": [{"body": "Somebody replied with that six hours before you did. I know reading is hard.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "But this car had AP1 and not 2.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I noticed it doesn't have the cameras on the silver tesla logo on the side. AP2 have a camera there.", "score": 5, "replies": []}]}]}]}, {"body": "Exactly. People grasp for any excuse or way to make something not their own fault. A car with this kind of tech is like magic to some people and they would be willing to buy this excuse. Except the Tesla has logs that will prove this is a lie and the guy simply rear ended another vehicle. ", "score": 9, "replies": []}, {"body": "The problem is that Radar is not very good at detecting stationary objects.", "score": 2, "replies": []}]}, {"body": "Let’s dispel once and for all with this notion that Elon Musk doesn’t know what he’s doing.\n\nHe knows exactly what he’s doing.\n\nHe is undertaking a systematic operation to dismantle the fundamentals of logic in the stock market in order to personally enrich himself by starting a death cult of tech enthusiasts who will never doubt anything he does.", "score": 37, "replies": [{"body": "Top meme", "score": 12, "replies": []}]}, {"body": "was an orange found on the scene? https://www.youtube.com/watch?v=8R-v8yAElz4", "score": 12, "replies": [{"body": "Very informative, +1", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 59, "replies": [{"body": "because it's not fully autonomous and you aren't supposed to use autopilot without also paying attention. it would be like riding a motorcycle and assuming other drivers can see you - stupid idea.", "score": 77, "replies": [{"body": "[deleted]", "score": 66, "replies": [{"body": "Queue all the Tesla shills claiming that autopilot is not a misleading name for the dumpster fire that is teslas cruise control.", "score": 26, "replies": [{"body": "Autopilot in planes functions the exact same way (takes a lot of work out of your hands but you still have to pay attention) so... How is this misleading?", "score": 11, "replies": [{"body": "when was the last time a plane was threatened by a fire truck in its natural habitat?", "score": 9, "replies": [{"body": "9/11?", "score": 15, "replies": []}]}]}, {"body": "have you tried it?  ", "score": 2, "replies": [{"body": "lol, my dude in the mid 2000s I sat in an s-class that was equipped with lane and distance keeping assistance. Teslas tech, and their competitors, isn't much improved from that level.", "score": 9, "replies": [{"body": "lol couldn't just have said 'no' could you", "score": 5, "replies": []}, {"body": "and? did you think that had no use? ", "score": 1, "replies": [{"body": "I wouldnt have called it autopilot, and wouldn't sell cars with \"self-driving capability\" when they only have a more convenient cruise control, it's misleading. Do you know if teslas own implementation of these features is any good? That latest one I have not tried.", "score": 12, "replies": []}]}]}]}]}, {"body": "I mean TBF actual autopilot doesn't need to be that smart since there are less large stationary objects hanging out in the sky.", "score": 5, "replies": []}, {"body": "\"Mostly pilot\"", "score": 2, "replies": []}, {"body": "They did relabel it", "score": 0, "replies": [{"body": "u sure? https://www.tesla.com/autopilot", "score": 3, "replies": []}]}]}, {"body": "If you listened to Elon though, we were supposed too have full autonomy 3 years ago.  It's really gone backwards since they dropped mobileye.  Stock up 31%", "score": 15, "replies": [{"body": "Just take a peak at r/teslamotors and that's the type of fanboys sucking each other's dicks while taking elons chode in their ass. They think Elon is a God and Tesla will hit 1k", "score": 2, "replies": []}]}]}, {"body": "The driver was also drunk", "score": 16, "replies": [{"body": "And watching Harry potter", "score": 4, "replies": []}]}, {"body": "\"No one was seriously injured\"", "score": 33, "replies": [{"body": "[deleted]", "score": 33, "replies": [{"body": "\"lol\" is my response", "score": 19, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": ">Would you blame the car for rear ending someone because you left cruise control on?\n\nIf the manufacturer advertised that it would stop automatically, then yes I absolutely would blame them", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Would a plane pilot blame the autopilot if they crashed into a mountain? Autopilot on planes also doesn't really change altitude or speed much. It's much like cruise-control. It doesn't steer much or avoid objects. It just continues on set path. ", "score": 2, "replies": []}]}]}]}, {"body": "driver wasnt a shareholder", "score": 3, "replies": []}, {"body": "65-0 vs a fire engine...welp at least head on crashworthiness seems ok.", "score": 2, "replies": []}]}, {"body": "As i recall, that was a white semi trailer on a white sky.\n\nPeople have been known to not notice bigger shit and hit it...", "score": 9, "replies": [{"body": "The sky is blue", "score": 18, "replies": [{"body": "I just looked outside and the sky is clearly black. In fact, most things outside are black. Check your facts.", "score": 10, "replies": []}, {"body": "Not with California smog.", "score": 6, "replies": []}, {"body": "Clouds are white", "score": 8, "replies": [{"body": "Fuuuuuuu", "score": 4, "replies": []}]}]}, {"body": "The autopilot also ended up not being on at the time as well. ", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Elon Musk could shit on his shareholders and they'd praise him for the free fertilizer. ", "score": 2, "replies": []}, {"body": "Came here to say this. My brother rear-ended a Toyota Venza in a 99 civic going about 10mph and it looked about the same as this Tesla. ", "score": 1, "replies": []}]}, {"body": "slammed into a truck at 65 mph and not injured? wow", "score": 2, "replies": []}, {"body": "I don't always crash my Tesla but when I do I crash it full speed at 65mph.", "score": 2, "replies": []}, {"body": "There's also now a 30% tariff on foreign solar panels, making U.S. made ones more attractive.  With this good news, I believe the American made Tesla roof panels will cause an equal 12% drop in TSLA", "score": 2, "replies": []}, {"body": "It's a feature boys!! To the mooonnn.....", "score": 1, "replies": []}, {"body": "Beats ROPE", "score": 1, "replies": []}, {"body": "Sell sell sell!!!!  ", "score": 1, "replies": []}, {"body": "Brb starting a gofundme for more capital", "score": 1, "replies": []}, {"body": "So autopilot does not mean \"drives itself fully automated\" something they forgot to mention.  Dont you love unbiased journalism?", "score": 1, "replies": []}, {"body": "How long till we get some dash cam video of a wanker arguing with his Tesla in front of a cop about who caused the crash?", "score": 1, "replies": []}, {"body": "Late to the party but im a mechanic and telling people for years now cars are not some big mystery they use processors and RAM and ROM and have ribbon connectors and copper or fibre optics for data lines.\n\nOk, 1 interuption to a 1 or 0 could be your life. If it controled itself Were talking about things that drive through rain, snow, sand, animals chew on wiring all the time.\n\nIt's dangerous. Very dangerous. Everyone thinks I'm crazy :/.", "score": 1, "replies": []}, {"body": "Short $CCFD", "score": 1, "replies": []}]}
