{"title": "I manage a small options trading shop. By request, AMA round 2.", "selftext": "Super old, outdated AMA: https://www.reddit.com/r/StockMarket/comments/16yf5b/i_am_a_professional_selfemployed_trader_amaa/\n\nPost I made six months ago about how to easily make excess returns in VIX (outdated and not the system I used, but was the simplest one to explain): https://www.reddit.com/r/options/comments/6nunx7/explaining_an_easy_system_to_make_excess_returns/\n\nI have a small group and we trade commodity options. I've received (and answered) tons of PMs over the last 24 hours since someone made a thread about me and I figured this would be the easiest/best way to answer questions again so everyone can see them.\n\nIf you don't want to look up my old background, I worked for a firm until 2011 and went independent. I traded an arb between VIX/SPX/SPY for the majority of my career until clearing/regulatory shut me down. I met with some traders who left another firm and we started a small shop together about ~2 years ago. It's highly automated and we only trade commodity options.\n\nI'll answer any questions you have (including politics, religion, video games, bodybuilding, volleyball) except uber specific details on our particular models. I'll answer questions intermittently throughout the day. I work until ~1:30 CST and I have a few meetings after the close about adding new products but should be on most of the day.\n\nEDIT: Stayed up too late answering questions. I still have a backlog of PMs to answer. Will continue answering questions tomorrow. I promise I'll answer everything so I apologize if I haven't answered your question yet -- I've had more questions than I expected.\n\nEDIT 2: Have 50 unread messages that I promise I'll get to now.", "id": "7rbtfp", "created_utc": 1516300501.0, "score": 244, "upvote_ratio": 0.98, "num_comments": 328, "comments": [{"body": "Are you a software engineer, as well? How did you learn to automate your work? I'm a software engineer who's been trading options for about a year with mild success but automating trading strategies to me right now is on the same level as getting a rocket to the moon....I wouldn't even know where to start. I just do pretty simple ETF purchases.\n\nAlso, what do you mean by \"stupid flow,\" a term you've used often? Is that \"all the normal people\" just buying stuff?\n\nLastly, with reference to this quote from one of your previous comments~\n\n> My best advice to find edge is to trade options, and short higher volatility options while buying lower vol options. Don't predict movements, and try to stay as neutral as possible\n\nFor those like me who are quite new to options, can you explain at a high level why this works? I've been buying month-to-month calls on things that are trending up long term like QQQ/SPX/IWF/DIA etc and that's been working well for me. The idea of trading based on volatility instead of price direction is unfamiliar to me. Why is it best to short high vol and buy low vol? Do high vol options usually end up going down?\n\nOh, also I have to say, it amazes me how kind you are in responding to all the people who give you shit on here, like saying \"why even do an AMA then\" when you decline to give the exact specifics of your trading strategy, or who call you a fake and a liar. How does it not make you want to just punch them in the face? Your tolerance is astounding.", "score": 31, "replies": [{"body": ">Are you a software engineer, as well? How did you learn to automate your work? I'm a software engineer who's been trading options for about a year with mild success but automating trading strategies to me right now is on the same level as getting a rocket to the moon....I wouldn't even know where to start. I just do pretty simple ETF purchases.\n\nNope. We use Actant, which allows basic programmers to automate all sorts of stuff. It's $2k a month.\n\n>Also, what do you mean by \"stupid flow,\" a term you've used often? Is that \"all the normal people\" just buying stuff?\n\nYes.\n\n>Lastly, with reference to this quote from one of your previous comments~\n>\n>> My best advice to find edge is to trade options, and short higher volatility options while buying lower vol options. Don't predict movements, and try to stay as neutral as possible\n>\n>For those like me who are quite new to options, can you explain at a high level why this works? I've been buying month-to-month calls on things that are trending up long term like QQQ/SPX/IWF/DIA etc and that's been working well for me. The idea of trading based on volatility instead of price direction is unfamiliar to me. Why is it best to short high vol and buy low vol? Do high vol options usually end up going down?\n\nEvery MM uses a spline model to graph option values. Some stuff trades out of wack of these models and you can buy or sell them accordingly. You can find ways to capture this edge like buying similar nodes in other months, using different nodes to hedge, etc. That's the gist of what we do.\n\n>Oh, also I have to say, it amazes me how kind you are in responding to all the people who give you shit on here, like saying \"why even do an AMA then\" when you decline to give the exact specifics of your trading strategy, or who call you a fake and a liar. How does it not make you want to just punch them in the face? Your tolerance is astounding.\n\nI'm pretty chill. Always have been. I just like to help others and the negativity never really bothers me as long as I can help others people.", "score": 40, "replies": [{"body": "But how do you find the stuff that \"trades out of wack\"? Do you model hundreds of ETFs/stocks/futures yourself and then compare your model to what's on the market to see what's out of wack, with the assumption that your model is similar to the MMs' models, and therefore if it differs from yours then it also differs from theirs ? And then trade assuming it's going to normalize towards where the model predicts?\n\nAlso I really don't know what a node is in this context. What do you mean by that?", "score": 12, "replies": [{"body": "You don't have to model tons of things. You can do it in individual stocks/futures.\n\nHere's a basic option spline: https://i2.wp.com/www.marketcalls.in/wp-content/uploads/2010/08/Volatility-Smile.jpg\n\nYou can see there's a bit of a 'kink' in between the $5500 and $6000. I would sell that line/area and probably buy the one below it. It's a good, beginner way to scalp vol. It should average out over time to be a winner. Do this all day long and you make money. It's that simple.\n\nAnd nodes would be the dots in this chart. Some people model on SDs, Deltas, or other metrics but it's all more or less the same.\n\nFor a real life example, you could probably sell the Soybean Oil March 1 to 5 delta call node right now.", "score": 28, "replies": [{"body": "    I would sell that line/area and probably buy the one below it\nIs my understanding right? - You meant sell the 'kink' node and buy the node below it, but on the same line? ie, if you sell a put then you buy another put node around the node you sold.\n\n~~Or do you actually mean sell any node around the 'kink' on blue line, which is Put and buy the red line, which is Call?~~\n\nEdit: I read one of the response below and think my first point is correct, crossing my 2nd point.", "score": 6, "replies": [{"body": "You buy different option strikes. You buy the lower vol one and sell the higher vol one. The nodes just represent different things -- either SD or delta space, for example. Over time, these should normalize, and you capture the vol spread between them.", "score": 8, "replies": [{"body": "Now I properly understand, after this comment.\n\nOne thing remains unclear: where do you find these volatility vs price charts though? Is it just something that your software either provides or doesn't provde? I just use ETRADE and I'm not aware of any way to see this chart for a security through that platform.", "score": 8, "replies": [{"body": "We built a model to do this. Some front ends offer a basic spline but it won't be as good as ours. It's a large part of what we do.", "score": 9, "replies": [{"body": "Man, you've given so much great information in this AMA, and yet sitting here now I still have no idea how I would trade anything on volatility instead of price direction tomorrow morning. I understand what you're saying about expecting the numbers to move into alignment with the spline's prediction, but then you've elaborated that creating those splines is done via your proprietary custom model which not just any trader can design. Which leaves me wondering how you started trading volatility originally, years ago, before you had the resources you have now. I get the basic idea but I can't see how I would apply it as an individual without developers at my disposal.\n\nI *really* appreciate all the answers you're giving, by the way. I did order a copy of the book you suggested.", "score": 9, "replies": [{"body": "Correct me if I'm wrong, but he's basically finding mispriced volatility systematically, and if it's too cheap, he buys it, if it's too expensive he sells it. He then hedges away delta, theta and ga,mma to remain as neutral as possible.\n\nHe has a proprietary algorithm, etc. in order to price volatility more efficiently than the market does.", "score": 11, "replies": [{"body": "That's how I understand it too. But I can't even imagine how you find mispriced volatility. Sure I can see it on that spline chart he shared, but he *created* that spline chart (maybe not that specific one, but in general the ones he would be working with)....so I have no idea how to find mispriced volatility.", "score": 2, "replies": [{"body": "It's not easy, you probably would have to develop your own model, after all, that's what gives you an edge.", "score": 2, "replies": []}]}]}, {"body": "The book is free online if you want to check it out. It's super boring, so I'd read it a bit online and see how you do.\n\nI was taught all this stuff at a firm in my first month. That's what all the firms do. It's not really knowledge you can gain online nor could I really teach it to you over the internet. ", "score": 10, "replies": [{"body": "So basically you're saying you either have to be clever enough to single-handedly reinvent a communal repository of knowledge that was built up over years, *or* you have to get a job at a firm and learn it directly from those who already know it?\n\nThis makes it sound awfully hard to succeed at this. To be fair you have said repeatedly that it is indeed really hard.\n\nSide note, do you think it matters if one reads the original edition from '94 versus the 2nd edition from 2014?", "score": 5, "replies": [{"body": "Correct, but I basically did the former. I created my own system over ~6 months or so and it was the most money I ever made.\n\nI have no idea what the differences are. Since so much has changed, my guess is you want the newer version. It's only going to teach the basics though. There's so much more to learn that you can't really find in books.", "score": 5, "replies": [{"body": "Clearly. Sigh! Didn't you ever have any self-doubt about this whole process? Like right now I'm thinking \"there's no way I'm going to be able to do that.\" Or did you pretty much just leap into it? I mean making hundreds of thousands your first year can't possibly be \"routine,\" I would imagine.\n\nI'm not really looking for parental reassurance that I'm special too, but rather I'm just wondering to what extent you're outside the norm in what you've done, for the sake of realistic expectations of what I can do, since I believe myself to be much closer to \"the norm\" with regards to financial analytical abilities.", "score": 3, "replies": [{"body": "I've been blessed my whole life so while I was nervous the first month or so, I quickly got over it and didn't really think much about it. Hundreds of thousands quickly wasn't enough for me and quickly became routine. I think I made my first million at 24 and that was exciting.", "score": 4, "replies": [{"body": "Okay I think we can safely conclude that you are very much the exception and not the rule. Thank you again for all these answers and I applaud your success.", "score": 6, "replies": []}]}]}]}, {"body": "You're talking about Natenberg right?", "score": 1, "replies": [{"body": "yes", "score": 1, "replies": []}]}]}, {"body": "What is the name of the book again i saw you mention it earlier?", "score": 2, "replies": [{"body": "Option Volatility and Pricing by Natenberg.", "score": 1, "replies": [{"body": "Nvm found it", "score": 1, "replies": []}]}]}, {"body": "What’s the book called ?", "score": 1, "replies": []}]}]}]}]}, {"body": "Thanks for the response. I thought the nodes represent strikes or I'm not reading the graph correctly? Do you mean the SD of vol?", "score": 3, "replies": [{"body": "Nodes usually represent standard deviations from the ATM or Delta ranges or something along those lines. Usually there are many strikes that are tied to these nodes.", "score": 3, "replies": [{"body": "~~Thanks, but I'm still not fully understanding the nodes, this is totally new to me.~~\n\nWhere can I read more about the \"spline\" model? Is this in the natenberg book? \n\nEdit: Re-read your response and I understood what you meant. I think we just use slightly different terms for those things, I usually like to refer those by their probability, which should be what you meant by the \"delta ranges\".", "score": 5, "replies": [{"body": "Is this type of trading realistic for a retail trader? As in, one with a day job that takes some time during the day to put on trades?\n\nWhat would you say is the minimum capital requirement to do something like this?", "score": 5, "replies": [{"body": "It's doable, but obviously difficult. Plenty of front ends will derive a spline for you.\n\nYou can do it with small amounts of capital in futures. It requires a lot more in equity options.", "score": 2, "replies": [{"body": "Recommendations on a front end for splines? And how about a front end for tracking options flow? ", "score": 2, "replies": [{"body": "Actant for spline stuff. We just watch for flow so I'm not sure but I'm sure there are services out there for this stuff.", "score": 2, "replies": [{"body": "do you actively hedge your deltas, i:e gamma scalping type stuff?\nAny advice on best bang for your buck front end? ", "score": 1, "replies": [{"body": "Yes.\n\nWe like Actant but it will be overkill for anyone starting out. ", "score": 2, "replies": [{"body": "Any advice getting a job at a buy side shop for someone coming from a non feeder school but who really knows their shit ? \n\nAre your pricing models based on black scholes and you add components like vol stick etc? ", "score": 1, "replies": [{"body": "He likes keeping his pricing models close to the vest, we'd all love to know the answer to this.", "score": 3, "replies": [{"body": "True. I'm just curious if they reinvented the wheel or if they are improving upon  b/s", "score": 1, "replies": []}]}, {"body": "You have to have a portfolio of stuff you've done then to have a shop. Write some algos, come up with some analysis, etc... not even important if it worked or not, but rather that it shows initiative.\n\nWe don't use Black-Scholes. We use Trinomial and a ton of different inputs.", "score": 3, "replies": [{"body": "Awesome. That should not be a problem at all. Thank you so much for your advice. ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "https://en.wikipedia.org/wiki/Spline_(mathematics)\n\nThis is what it is. We use a cubic spline which we feed tons of different inputs.", "score": 2, "replies": [{"body": "Thanks for the info! Will look into this.", "score": 2, "replies": []}, {"body": "**Spline (mathematics)**\n\nIn mathematics, a spline is a special function defined piecewise by polynomials. In interpolating problems, spline interpolation is often preferred to polynomial interpolation because it yields similar results, even when using low degree polynomials, while avoiding Runge's phenomenon for higher degrees.\n\nIn the computer science subfields of computer-aided design and computer graphics, the term spline more frequently refers to a piecewise polynomial parametric curve. Splines are popular curves in these subfields because of the simplicity of their construction, their ease and accuracy of evaluation, and their capacity to approximate complex shapes through curve fitting and interactive curve design.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/options/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot) ^| [^Donate](https://www.reddit.com/r/WikiTextBot/wiki/donate)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 1, "replies": []}]}]}, {"body": "Accidentally posted this below as well -\n\n\nIs this type of trading realistic for a retail trader? As in, one with a day job that takes some time during the day to put on trades?\n\nWhat would you say is the minimum capital requirement to do something like this?\n\n\nThanks", "score": 2, "replies": [{"body": "Answered you elsewhere.", "score": 1, "replies": []}]}, {"body": "Could I say that the spline model is a 2D representation of a large, large, multi-dimensional (strikes, probabilities, ranges) space?", "score": 2, "replies": [{"body": "Yes, you could say that.", "score": 2, "replies": []}]}]}]}, {"body": "Sorry, re-reading this and thinking about it--- you said \"you buy different option strikes\", but the kinks in the spline you linked to appear at the same place on the X-axis, which is to say the kinks are at the same strike price. So I'm misunderstanding you because that seems contradictory. Wouldn't you be entering at the same option strike for both, around $5600/5700 ?\n\nAlso, won't changes from delta drown out changes from vega? Does this type of strategy have to be done via minute-to-minute high speed trading to work?", "score": 3, "replies": [{"body": "You'd be buying the 5600 strike and selling the 5700 strike. That's a super easy example since the strikes are so close and in the same month where they'll add little Vega/gamma/Delta risk. It gets more difficult when you have to hedge with more of those risks involved or using different months.", "score": 3, "replies": [{"body": "And what %return can you expect for such a trade?", "score": 2, "replies": [{"body": "Small. Just over 50 percent, maybe up to 60. It's not huge edge, but if you do it enough, it pays off.", "score": 1, "replies": [{"body": "Not sure what you’re measure is but 50-60% ROI on one trade seems pretty high. What timeframe are we talking here ?\n\nedit: i missed the word 'edge' in your response so i suspect you're referring to winning trades. that makes more sense than 50% ROI on a trade :)\n\nand that edge allows you to generate 400% annual ROI? (based on your 2017 numbers i think)\n\nif you can keep up that performance consistently then why not turn it into a bigger fund something with say $100 million or more?", "score": 1, "replies": [{"body": ">Not sure what you’re measure is but 50-60% ROI on one trade seems pretty high. What timeframe are we talking here ?\n\nDepends heavily. Longer time frame, we require higher ROI.\n\n>edit: i missed the word 'edge' in your response so i suspect you're referring to winning trades. that makes more sense than 50% ROI on a trade :)\n>\n>and that edge allows you to generate 400% annual ROI? (based on your 2017 numbers i think)\n\nYep. If you do enough volume, it's not hard.\n\nThat said, my old system was way more efficient. Probably closer to like 75 percent win rate.\n\n>if you can keep up that performance consistently then why not turn it into a bigger fund something with say $100 million or more?\n\nI addressed this before, but volume is really hard to scale. People figure out what you're doing, retreat, etc. My old strategy only scaled to like 1 million in margin. Right now, we don't even scale that high. More like 750k in margin to return a few hundred percent.", "score": 1, "replies": [{"body": "Oh wow that’s tiny. I’ll go back to your earlier answers as it sounds quite interesting what you’re doing. ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "> Soybean Oil March 1 to 5 delta\n/u/Fletch71011 Not sure if you are still answering questions on this AMA. I would like to thank you for all of this.\nWhat did you mean exactly by term 'march 1 to 5 delta' ? Can you please elaborate?\n\n", "score": 3, "replies": [{"body": "Lower Delta calls. Think the 36 calls. They're at very high Vols right now due to paper flow. They're a great sale.", "score": 5, "replies": [{"body": "Thank you.", "score": 3, "replies": []}]}]}, {"body": "Does this still work?", "score": 2, "replies": [{"body": "I mentioned this in the post, but they patched it in April of last year. That's why I released how to do it. I keep things like that in my back pocket in case I need to find new ways to make money.", "score": 1, "replies": [{"body": "I just realized you were pairs-trading the volatility spline spread :)", "score": 1, "replies": []}]}]}, {"body": "How common is it for these pennies to be left lying ", "score": 2, "replies": [{"body": "Obviously happens millions of times a day, but they don't last long given the competition.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "* what video games are you playing?\n\n* what commodities are you trading?\n\n* what do you think are the most difficult options/vol related issues to model? either product-specific or general", "score": 19, "replies": [{"body": ">what video games are you playing?\n\nRight now, I am playing Fortnite with my friends and just beat Mario Galaxy. I still play Warcraft 3 when I can as well. I played CoD WWII for a while but only really played it with my buddies. The game wasn't that great.\n\n>what commodities are you trading?\n\nThink grains and soybeans. We are going to add the rest of them as well. CME products generally.\n\n>what do you think are the most difficult options/vol related issues to model? either product-specific or general\n\nStrike fitting is really annoying for me. Sometimes a particular trade looks great until they bust through a five thousand lot of one strike and other MMs start marking that price accordingly in order to get out. You can't really hedge those unfortunately... This isn't a huge deal in cash-settled markets but really sucks for physical settle.", "score": 17, "replies": [{"body": "yeaah strike and inventory based modeling is kinda taking over at such low vols. Have you tried PUBG?", "score": 12, "replies": [{"body": "I marked almost $3k out of one strike today. It's insane.\n\nI've heard Fortnite is better but haven't tried PUBG yet.", "score": 9, "replies": []}]}, {"body": ">  I still play Warcraft 3 when I can as well.\n\nMe too. When do you want to play? https://i.imgur.com/jmsNBR0.png\n\nSo I've been selling naked puts and calls 1-2 contracts at a time for some small gains. About 15% in a month from a relatively small account. Not sure what the next step is, other than possibly scaling up and taking on more risk. What do you think?", "score": 3, "replies": [{"body": "You>>  I still play Warcraft 3 when I can as well.\n>\n>Me too. When do you want to play? https://i.imgur.com/jmsNBR0.png\n\nAdd me. My handle is the same. I'll probably play Sunday night if the overnight market is slow.\n\n>So I've been selling naked puts and calls 1-2 contracts at a time for some small gains. About 15% in a month from a relatively small account. Not sure what the next step is, other than possibly scaling up and taking on more risk. What do you think?\n\nThat's really good!\n\nIssue with scaling was always liquidity for me. It's easy to great great fills with small size and get out easily so just don't double your size overnight. Maybe add 25 percent at a time.", "score": 5, "replies": [{"body": "USWest or USEast? What do you like to play on Wc3? Dota1? Random 3s?\n\nThank you for your response. I've added about 12.5% to the account to make it an even number. Makes it easier to keep track of gains.\n\nWhat are your thoughts on the government shutdown, and how do you plan on playing it? Do you think tech stocks will take a hit?", "score": 3, "replies": [{"body": ">USWest or USEast? What do you like to play on Wc3? Dota1? Random 3s?\n\nUS East. Only Random 4s since that seems to be the most popular outside 1v1.\n\n>Thank you for your response. I've added about 12.5% to the account to make it an even number. Makes it easier to keep track of gains.\n>\n>What are your thoughts on the government shutdown, and how do you plan on playing it? Do you think tech stocks will take a hit?\n\nLast time this happened when I was trading ended up being a great time to sell vol. It won't affect anything I'm trading though so I don't really know.", "score": 4, "replies": [{"body": "Ahh, glad that 4s are still going. Last time I tried it took forever to match so I went to 3s. You playing soon?\n\n> Last time this happened when I was trading ended up being a great time to sell vol. It won't affect anything I'm trading though so I don't really know.\n\nBy selling the volatility, were you selling naked calls and/or bear call spreads on the VIX? Might give it a shot tomorrow. Should I play with UVXY, or can the index itself be traded?", "score": 3, "replies": [{"body": "We usually play around 130 or 2 PM CST once a week.\n\n>By selling the volatility, were you selling naked calls and/or bear call spreads on the VIX? Might give it a shot tomorrow. Should I play with UVXY, or can the index itself be traded?\n\nI usually buy the one leg in 1x2s. I'd just trade the index unless you know a ton about the ETFs. They're different beasts.", "score": 3, "replies": [{"body": "> We usually play around 130 or 2 PM CST once a week.\n\nDarn, looks like we'll have to catch each other another time for wc3.\n\n> I usually buy the one leg in 1x2s. I'd just trade the index unless you know a ton about the ETFs. They're different beasts.\n\nBy 1x2, do you mean a ratio spread of buying one and selling two so that you're short one naked option? Are you doing this at a credit on the call side?\n\nWhat were your plays today? I sold some NVDA calls, but not quite close to the ATH unfortunately. Was gonna play some volatility but chickened out since I'm still new to it.", "score": 2, "replies": [{"body": "What a *darn* shame..\n***\n^^Darn ^^Counter: ^^11904", "score": 1, "replies": []}, {"body": "Yes, always for credits.\n\nI don't trade equities so no plays or anything. Traded soybean complex today. Nothing terribly interesting.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Did you play ww2 on PC? I play ww2 pretty regularly and played a ton of BO3", "score": 2, "replies": [{"body": "Ps4 only. Think I'm done with it though. Sprint out times suck and they don't plan on fixing them.", "score": 1, "replies": []}]}]}]}, {"body": "What are good skills for someone looking to get hired at a MM firm?  Do you need to be a software engineer with hardcore math skills?", "score": 16, "replies": [{"body": "Math and programming is all you'll need. I did Project Euler for practice (first 100 problems in Python). You should google common interview brainteasers as well and be ready to answer those. You should know general options Greeks as well. I think it would help to talk about any programming projects you've done (like I've built games and stuff). They just want very logical people at the end of the day.", "score": 23, "replies": [{"body": "Does it help if you're already using python algos to trade programmatically with an Interactive Brokers account?", "score": 6, "replies": [{"body": "I have a buddy that does that with them but he trades stocks. I just think it's too risky to use them for options as they are super conservative and don't really understand the real risks.", "score": 8, "replies": [{"body": "> it's too risky to use them for options\n\nFletch, any chance you could expand on that? In which ways you think it's too risky to use IB, rather than another broker?\n\nThanks!", "score": 6, "replies": [{"body": "Sure!\n\nThey have a program scanning every account for 'risk' going over your account size and will automatically liquidate you if you cross that threshold. This would be fine but they don't tell you these 'requirements'! They had a trade I was in liquidate because market-makers pulled some quotes and the program went nuts and paid well beyond what my position was worth to get out. They will fuck you over to cover their own asses. They're probably the worst broker but a lot of people use them since they have access to almost everything out there.", "score": 11, "replies": [{"body": "Why are they the worst broker? I’ve heard better things about GS/MS/JPM but for most people in here IB is probably the best. ", "score": 3, "replies": [{"body": "GS/Merrill suck unless you have lots of money (minimum $5 million). They're all really damn bad now for a variety of reasons. Honestly, there aren't many I'd even recommend now. IB just doesn't properly understand risk and that can really hurt you.", "score": 7, "replies": [{"body": "Yeah they are generally only target mid 8 figure accounts and up. While IB is fairly risk averse with their margin, they are fine for a blend of equities and options. I honestly wouldn’t recommend \nanyone else for retail accounts. ", "score": 3, "replies": []}]}]}]}]}, {"body": "wait what you are saying IB doesn't understand the real risks of options trading? \n\n", "score": 6, "replies": [{"body": "Yes. This is true of almost every BD or clearing house though. It's not exactly rare. Unfortunately IB overestimates the risk which is terrible for the trader.", "score": 8, "replies": []}, {"body": "Can confirm: I own some risk free spreads in IB that take up margin. Not sure if it's their fault or has to do w equity margin rules", "score": 6, "replies": [{"body": "I just closed an HSI short position that had eroded down to $600 of premium from $14k. It was eating up $430k of margin a day ahead of expiry. I checked it half a dozen times and even called IB to double check. They told me that it was what it was. The position delta was less than 1. Holy cow.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Logic and reason. Basic calculus and probability are a must as well as quick mental math skills (the latter becoming less important).\n\nI learned from classes. It's easy to become decent at programming (few months tops) but very difficult at the top level. I know enough to get by.", "score": 11, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yes.\n\nC++ and Java would be the primary ones for the big shops although a lot of them are in Python now.", "score": 4, "replies": []}]}]}]}, {"body": "So let's say someone already has that kind of experience and is looking to work at a place where those skills are in demand. Where do you recommend? Where do you recommend against?", "score": 2, "replies": [{"body": "IMC, DRW, Optiver, Akuna, Wolverine, SIG, and Citadel off the top of my head are the best shops.", "score": 6, "replies": []}]}]}]}, {"body": " Can someone that is from a different background also do this? What would that entail if possible? Obligatory what do you earn from this? (if you don't mind). Thank you in advance for your time and for doing this.", "score": 14, "replies": [{"body": "Absolutely. There were plenty of different types of people at my old firm. We even had some English majors! If you're good at math/logic, you can probably trade. Programming obviously helps a ton as well.\n\nI will probably earn low 7 figures for a few more years and then retire. I probably make more than most but I'm certainly not elite or anything.", "score": 20, "replies": [{"body": "Retire as in wind down your full time trading status? Or quit trading altogether?", "score": 17, "replies": [{"body": "I'll probably be done altogether and maybe volunteer. I need to give back. This isn't exactly a fulfilling job and I do it purely out of greed.", "score": 33, "replies": [{"body": "Don't you enjoy trading? I personally want to major in finance, because I find it fascinating how economic, or geopolitical events influence market prices.", "score": 8, "replies": [{"body": "I used to. I'm pretty apathetic these days now that I made a lot of money. I get more joy from helping my traders get rich these days.", "score": 22, "replies": [{"body": "> I get more joy from helping my traders get rich these days.\n\nWhen are you gonna write a book? ", "score": 10, "replies": [{"body": "When I learn how to write!", "score": 22, "replies": [{"body": "In my very humble opinion you should do an online course like on udemy, or just set up your own website for it. Could just have a freelancer or two do most of the editing and web work.\n\nWilling to bet you're not terribly interested in that, but damn I can fantasize.", "score": 5, "replies": [{"body": "I swear no one believes me, but I have a very difficult time with public speaking. That's why trading fits me really well -- it allows me to be a recluse. I'm a terrible teacher but somehow better at coaching. I can only really teach by showing in person.", "score": 8, "replies": [{"body": "Have you ever considered doing a walk through video? Approaching them from the mindset of \"nobody is going to watch this\" really helps make it almost therapeutic. While also being able to take on a more coaching oriented feel to what you are doing.", "score": 3, "replies": [{"body": "Maybe when I retire. It's still not that easy though -- our model took 6 months to build and it's not something I can explain in a day.", "score": 3, "replies": [{"body": "Thanks for the reply, I definitely understand the issue with compressing a topic into a video, though I was more focusing on the comfort that producing a video offers especially in its reduction of any form of public interaction.\n\nAlso,  what trading platform are you\n using?", "score": 3, "replies": [{"body": "I've done interviews with two redditors and they never even published them. I don't come off great on camera. Writing allows me to be a little more clear but is obviously limited as well.\n\nWe use Actant.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Are you able to be happy with what you achieved, or do you always want more? I'd find it hard to stop. \n\nAlso, I assume you have your own house. I am just curious what you paid for it and how. Did you take out a loan, because you knew that you can get a higher return with your money?\n\nWhat were your long-term dreams and goals when you attended university?\n\nSorry for asking so much haha ", "score": 5, "replies": [{"body": ">Are you able to be happy with what you achieved, or do you always want more? I'd find it hard to stop. \n\nI realized there's no number I'd ever be happy with so it's kind of pointless.\n\n>Also, I assume you have your own house. I am just curious what you paid for it and how. Did you take out a loan, because you knew that you can get a higher return with your money?\n\nI own a $500k condo and paid cash. They wouldn't give me a mortgage because of my job even though my credit score is 800.\n\n>What were your long-term dreams and goals when you attended university?\n>\n>Sorry for asking so much haha \n\nAll I cared about was making money and I did that.", "score": 8, "replies": [{"body": "What do you do with your millions, other than live a comfortable life with the condo etc? What do you use it for that other people would not be able to easily afford? Just out of curiosity I guess.", "score": 5, "replies": [{"body": "Nothing really. I just play games. I don't have expensive tastes and I'm very cheap.", "score": 6, "replies": [{"body": "You don't even travel?? You could see anywhere, tomorrow!", "score": 3, "replies": [{"body": "I'm a home body and I've never taken a day off of work.", "score": 2, "replies": []}]}]}]}, {"body": "I often tell people that I want to be rich or at least well off if they ask. Ever since I was a child, I've wanted this. Was this similar for you? \n\n\n\nI also think it's strange how people react when I tell them. They act like it's unnatural  and that people should want happiness, health etc. and not money. But I can want all of these", "score": 1, "replies": [{"body": ">I often tell people that I want to be rich or at least well off if they ask. Ever since I was a child, I've wanted this. Was this similar for you? \n\nAbsolutely\n\n>\n>I also think it's strange how people react when I tell them. They act like it's unnatural  and that people should want happiness, health etc. and not money. But I can want all of these\n\nI've had girls in the past tell me my thirst for money is pretty sickening. I don't really care as much these days thankfully though.", "score": 4, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Higher risk, higher reward. You *should* make more money programming for an HFT but the hours might be worse and the stress will be worse. ", "score": 1, "replies": []}]}]}]}, {"body": "If you volunteer, you should volunteer by teaching others what you know. It would be a waste for someone with your skills to be in a soup kitchen or anything like that. Practical knowledge like yours is hard to come by, even if you're willing to pay for it.\n\nYou clearly have really powerful analytical abilities and it seems you're pretty good with people, too, at least through a screen. If you're going to leave trading but want to stay busy, you should consider seeking out a new line of work that you can enjoy and which puts your abilities to good use, where you can make a positive impact in a way you enjoy.", "score": 7, "replies": [{"body": "I mean, that's part of the reason I answer questions here. I'm willing to answer just about anything. That's really the only way I can teach. I meet with people here all the time and get tons of calls and PMs daily. That's kind of my way of giving back. I know a few people here that I helped crack into the industry and that makes me feel a bit better.", "score": 15, "replies": [{"body": "You answer almost every question, which is very nice.", "score": 6, "replies": [{"body": "I'll get to every one. We had a busy day today so I'm behind right now.", "score": 1, "replies": []}]}]}]}, {"body": "I'd be happy to \"help\" you volunteer to teach me how to make \"low 7 figures\". Fuck, that's awesome.", "score": 6, "replies": []}]}]}, {"body": "Since you mentioned SPY. If you had to guess, do you think SPY has hit its top at $280 and will sink from here? What is your general outlook on the ETF through this earnings season?\n\nThanks", "score": 7, "replies": [{"body": "I trade volatility, not underlying direction. My philosophy is that futures/stock prices are always more or less reflecting everything that is currently known and are thus at a fair price. The VIX is probably the one exception to this rule but that's because it tracks volatility.\n\nI'm of the opinion that you shouldn't trade options directionally at all and only make plays on volatility but I know other people feel differently. Personally, I'd rather make money no matter what the market does.", "score": 16, "replies": [{"body": "> The VIX is probably the one exception to this rule but that's because it tracks volatility.\n> \n> I'm of the opinion that you shouldn't trade options directionally at all and only make plays on volatility but I know other people feel differently. Personally, I'd rather make money no matter what the market does.\n\nHow do you make money on VIX without trading directionally? Are you talking about short straddles & similar?", "score": 7, "replies": [{"body": "The VIX has to trend down over time. You're better off leaning short for that reason. The issue is up moves can really hurt. If I had to pick a random strategy to trade VIX, I'd probably sell 1x2s, but that's not how I traded it. I ran a book with tens of thousands or more options on at any given time.", "score": 8, "replies": [{"body": "By 1x2 I’m assuming you mean a backratio with calls? If so, how are you deciding your strikes? Net credit and hope for massive vol spike?", "score": 5, "replies": [{"body": "Nothing to do with credits and everything to do with the IV of the calls. VIX has a huge call skew and flow that is directed towards buying cheaper options so they're really easy to sell at great prices. People generally sell the ATMs and they have lower vol to begin with, so it's easy to put that stuff on.", "score": 10, "replies": []}]}]}, {"body": "I sell high points on the vol curve and buy low points on the curve. Usually this leads to getting long ats and selling wings given the flow.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "What are some books you would recommend for someone hoping to learn more about options, trading, and automating. What are some courses or lectures you'd recommend as well?\n\nWhat is your opinion of bodybuilding? Is it a priority? Do you always make the time of day for it and do you think it has had any effect on your career success?", "score": 12, "replies": [{"body": ">What are some books you would recommend for someone hoping to learn more about options, trading, and automating. What are some courses or lectures you'd recommend as well?\n\nOption Volatility and Pricing by Natenberg is the only book I've ever read on options. Super boring, but will explain everything.\n\nI took MIT's, Harvard's, and Rice's classes on programming. Those were the best ones that I found. The basics of programming are very simple and once you get the basics down, lots of stuff opens up.\n\n>What is your opinion of bodybuilding? Is it a priority? Do you always make the time of day for it and do you think it has had any effect on your career success?\n\nI casually follow it. Steroids scare me too much so I'll never compete. I work out a few hours a day for 5 days a week or more. I think the discipline it requires helps a ton. I needed a serious hobby away from trading because it became my life and weightlifting seemed like a healthy alternative until I started dealing with injuries at least.", "score": 16, "replies": [{"body": "So where does the rest of your knowledge come from. Sure some of it is experience but how do you inform yourself on what trades to make. Where do you get your information/news. What have you taught yourself that other haven't and therefor don't have the competitive edge you do? ", "score": 4, "replies": [{"body": ">So where does the rest of your knowledge come from. Sure some of it is experience but how do you inform yourself on what trades to make. Where do you get your information/news. What have you taught yourself that other haven't and therefor don't have the competitive edge you do? \n\nI don't use any news. I trade on math only. I worked at a firm for two years which was invaluable. When I was there, I came up with a lot of strategies using basic pattern recognition. It's really as simple as observing and back-testing but not everyone sees it that way.", "score": 9, "replies": [{"body": "On the technical side, does execution speed of your algos matter? Like, do you need colocated servers, program in C++ etc?", "score": 7, "replies": [{"body": "Yes and no. It matters so much if you're at the top level (think IMC, Optiver, etc.). For us, not really -- the 'best' trades that everyone's model will shoot for are all going to be taken down by the fastest group which is one of the big firms every time. We're still colocated and everything but we're not and never will be at the level of the big guys. We have to model better than them to compete.", "score": 5, "replies": [{"body": "Cool, I think what you're doing here is great, thanks a lot!", "score": 5, "replies": []}]}]}, {"body": "Could you elaborate the \"math only\" part and eli5 if you dont mind. You're just looking for any opportunity in the entire market? Are you using technical analysis or a combo of?", "score": 3, "replies": [{"body": "We'll buy or sell nearly anything our model tells us to do. We adjust our model all day long to keep our positions small. It's all technical analysis.", "score": 6, "replies": [{"body": "What would you say your model is based on? You did mention it is too complex for a reddit post. Maybe you can ELI20 that?", "score": 1, "replies": [{"body": "Lots of different inputs. We have specific edge requirements for anything you can think of. Delta risk, Vega risk, a metric that looks to flatten our overall vol, a metric that leans into option trades to flatten deltas, multipliers for every node of our spline... That's the easy stuff. It would be hard to explain the complicated stuff in person even and that's what I would get in trouble for any way.", "score": 2, "replies": [{"body": "Thanks for taking the time to respond.\n\nDo you consider finding that edge a very difficult thing to do these days with the perspective of a retail trader? Is it impossible for the average retail trader to compete with the bigger firms? Do you consider options being the best method to possibly succeed in finding some edge due to being able to exploit volatility?\n\n", "score": 2, "replies": [{"body": "> Do you consider finding that edge a very difficult thing to do these days with the perspective of a retail trader? \n\nIt's very hard now, yes.\n\n>Is it impossible for the average retail trader to compete with the bigger firms?\n\nNot impossible, just hard.\n\n> Do you consider options being the best method to possibly succeed in finding some edge due to being able to exploit volatility?\n\nYes, it's way easier than outrights.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Are you hiring?", "score": 11, "replies": [{"body": "Yes actually. We just hired a Dev and will probably hire someone who trades ISE products next.", "score": 8, "replies": [{"body": "Well it definitely sounds like you have a great firm. Where are yall based? And what level of experience are you looking for? I have a finance degree and some experience but I am in my early 20’s and many positions require more years under your belt in the industry", "score": 7, "replies": [{"body": "We're at the Board of Trade in Chicago.\n\nYou should apply for entry level at one of the big firms. We can't afford the training involved (no small shop can). You will learn more in the first few months at a big firm than any degree will ever give you. I have a finance degree from the top undergrad program and learned more in my first month  at my old firm than I did my entire time at college.", "score": 13, "replies": [{"body": "What firms would you recommend have the best training? ", "score": 7, "replies": [{"body": "You'll do fine at any of the big shops. I always hear DRW and IMC thrown around for that but it's hard for me to tell without going through it myself.", "score": 5, "replies": [{"body": "what are the requirements for these jobs, they require finance degrees?", "score": 4, "replies": [{"body": "They'll take anyone if you give a promising interview.", "score": 5, "replies": [{"body": "I would take this interview, if only to interview the interviewer.... (⌐■_■)\n\nI will walk away either humiliated or on a high horse with an offer, but it would've been a cool experience.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They want degrees from top universities, yes.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Thanks for doing this!\n\n1. How many hours a week do you work?\n1. What kinds of returns are you seeing?\n1. Why did you get shut down by clearing/regulatory?\n1. Are you still trading VIX? You mentioned volatility trades are super crowded.\n1. I'm interested in running my own fund in the not-distant future. Right now I trade two accounts of my own and a few for friends/family with an Interactive Brokers Friends and Family account. What's the next logical step for someone like me to run my own fund?", "score": 10, "replies": [{"body": ">How many hours a week do you work?\n\n30ish maybe? I'm more or less retired and consider this part-time. I probably work a lot less than that considering I don't do much during the day.\n\n>What kinds of returns are you seeing?\n\nFirst year with this group we returned 400%.\n\n>Why did you get shut down by clearing/regulatory?\n\nAll the clearing firms moved margin requirements in indices to insane levels. This was a result of a new measure passed by the OCC. I basically can't be short any units which makes it really hard to trade. All the big firms don't have these rules so it's a really unfair playing ground. As such, I moved over to futures where everyone has the same rules more or less (well, big firms still have an advantage, but not as much).\n\n>Are you still trading VIX? You mentioned volatility trades are super crowded.\n\nHaven't traded VIX since August 2015. It's way too crowded.\n\n>I'm interested in running my own fund in the not-distant future. Right now I trade two accounts of my own and a few for friends/family with an Interactive Brokers Friends and Family account. What's the next logical step for someone like me to run my own fund?\n\nWhat's your capital situation looking like? I'd need that information before I could give advice.", "score": 14, "replies": [{"body": "Total across all accounts is about $120k, about half of which is my own. I might add that I've got 10 years of professional experience as a software engineer. I've built my own dashboard and some rudimentary backtesting tools and plan to do a lot more.", "score": 6, "replies": [{"body": "You're going to need more capital. Minimum for PM outside of IB is $250k if I recall correctly and IBs margin system is a total joke -- they liquidate your positions automatically if your requirements cross some threshold that they won't even show you. They scalped me on a ton of money once because some quotes dropped out of market (think like $30k). As such, I'd never trust them with any serious account unless you have enough to get a prime brokerage setup.\n\nEDIT: Lightspeed allows you to only need a minimum of $175k for PM now via clearing with Wedbush. This is new to me -- it was $250k-$300k shortly after I started and required clearing via Apex.", "score": 11, "replies": [{"body": "Good to know. So what brokerage would you recommend to someone like me, now and in the future when I do have upwards of $250k? And what kind of fund/structure should I set up once I do reach that point (I know next to nothing there at this point)?", "score": 7, "replies": [{"body": "I am probably not the best person to answer this but I know there's a guy at Lightspeed that I would use if I went back to equities. He's one of the few people I've met at a broker dealer that knows as much (more if you include regulatory) as me or other traders. I actually called him this week just to catch up and ask about the equity space despite no interest on my part in getting back into the space.\n\nEDIT: Forgot to answer the second part. All you need is an LLC. A lot of my friends do Nevada or Delaware for this.", "score": 11, "replies": [{"body": "Thanks again u/Fletch71011. This is a great AMA.", "score": 8, "replies": [{"body": "Always happy to help, just wish I could provide some more equity experience since that's what most people trade here.", "score": 4, "replies": [{"body": "Any nuggets/pointers/\"you should look up these things/read this\" regarding options on futures?\n\nI'm getting more and more hesitant to trade equity options because of the correlation to 1 thing during times of panic/stress.\n\nIt seems like futures provides much more diversification.\n\nEdit: sorry, super late question, I was just reviewing your thread and thought of it.", "score": 3, "replies": [{"body": "Honestly they're not terrible different besides the skew structure. There's not much of a learning curve if you get options on equities other than the multipliers being different.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "$125-150K is a standard. I don't see how PM helps with Futures and FO, those use SPAN margining, though.", "score": 2, "replies": [{"body": "VIX options and SPX fall under OCC margin since they're CBOE. You're correct about the rest though.", "score": 5, "replies": [{"body": "Got it, the discussion context seems to be switching between VIX and Futures options :)", "score": 4, "replies": [{"body": "The fact that the futures and options were on different exchanges always drove me nuts. You couldn't easily cross-margin them for that reason. Such a pain in the ass.", "score": 4, "replies": [{"body": "Yeah, I hear ya. RUT and DJX margin even with PM is ridiculous. I gotta use those as no FO available for /RTY and /YM really. Every time I glance over the margin held there, a part of me dies, and other part wants to run for the hills. At least /ES and /NQ options are still there.", "score": 4, "replies": [{"body": "I'm hearing more people are trading RUT now. When I was at a firm, that had almost no volume. I used to trade OEX alongside SPX.", "score": 4, "replies": [{"body": "RUT circa end of 2016 was like /NQ end of 2017 - wild. Luckily they dropped the 5c step and it trades in penny increments. It's not bad and has seen 2-side action.", "score": 4, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Hey! Thanks for doing this.\n\n* Some hedge funds [are plunging hard](https://www.bloomberg.com/news/articles/2018-01-15/hedge-funds-fatten-returns-with-exotic-bets-on-cheese-and-maize) in the most exotic corners of the commodities markets. Any thoughts on the possible consequences of this behavior? \n\n* How important is classical fundamental analysis in your current options-futures trading system? e.g. /CL vs. events like OPEC meetings, seasonal consumption patterns, etc.\n\n* If I remember correctly, you mentioned that your old VIX trading system had found its scalability ceiling and that it was relatively low (a few millions, I believe). Do you see something similar happening with commodity futures/options? \n\n* Are you interested in non-commodity futures/options, e.g. FX, interest rates, etc.? \n\n* How much do you squat, bench, deadlift? :-)\n\n", "score": 10, "replies": [{"body": "> Some hedge funds are plunging hard in the most exotic corners of the commodities markets. Any thoughts on the possible consequences of this behavior?\n\nI just read that article and I'll just say we might be looking into those markets that they mentioned. It will be good in the long-term though. More players means more price discovery and fairer prices for everyone. We've done this to illiquid products before and 'fixed' the pricing -- we make money, and everyone else gets better prices. It's win/win.\n\n> How important is classical fundamental analysis in your current options-futures trading system? e.g. /CL vs. events like OPEC meetings, seasonal consumption patterns, etc.\n\nIrrelevant more or less. We look at historical vols and such and obviously get short vol usually before events, but we aren't going to compete on that stuff so we don't even bother.\n> \n> If I remember correctly, you mentioned that your old VIX trading system had found its scalability ceiling and that it was relatively low (a few millions, I believe). Do you see something similar happening with commodity futures/options?\n\nAbsolutely. We are capped already for the most part.\n> \n> Are you interested in non-commodity futures/options, e.g. FX, interest rates, etc.?\n\nThose are very crowded fields. I'd rather not fight over pennies.\n\n> How much do you squat, bench, deadlift? :-)\n\nBefore I broke my back, about 450, 350, 500. I doubt I could reach those numbers now though.", "score": 8, "replies": [{"body": "Thanks for the awesome answers. \n\nGreat lifts. I used to move 315SQ/225BP/365DL, but had to deal with two injuries not related to lifting (torn ACL and an impaled hand) that put me out of the gym for more than a year.\n\nBack injuries suck. One of my buddies herniated L4/L5 and it was total hell for him. Hope you're doing better!", "score": 3, "replies": [{"body": "My L5-S1 ruptured and I ended up with a spinal fusion. Both of my hips are broken as well. My body is a mess.", "score": 5, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Honestly probably from volleyball/lifting, but hard to say. I have a few genetic issues that definitely contributed (mostly severely pronated legs).", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Why would anyone with experience join your shop? To commingle private capital? Or to have trade buddies and talk stuff?\n\nNothing personal, I just find that once one traded long enough and has her own meaningful capital, there's only a social aspect left. Thanks!", "score": 8, "replies": [{"body": "Our tech/systems are much better than nearly every individual or small shop around us and we can cover/trade each other's stuff if needed. We do add value to individual traders but only if they can benefit from our model/systems. It's definitely not a fit for everyone and honestly I don't get the social stuff -- I actually preferred trading alone, but this setup is better for making money.", "score": 11, "replies": [{"body": "Cool, thanks. Sounds like a fun place, but Chicago weather would kill me twice over, I'm heading more south ;)", "score": 2, "replies": []}]}]}, {"body": "What and where do you think a retail traders focus/time is best spent on?", "score": 6, "replies": [{"body": "I wish I had a good answer for this. I don't know how to make money as a 'retail' investor. It requires constant management from me. Some people can put on positions and leave it, but I always need to defend. Hell, I'm getting ready for the night session at 7 PM CST right now to defend something.", "score": 6, "replies": [{"body": "Going to an extremist (or actually maybe not depending on your opinion) point of view, would you then say that retail is better served by not trading options?", "score": 4, "replies": [{"body": "Most of the time, yes. I take money from retail all the time although my old style of trading was mostly against paper. You don't want to give money to assholes like me.", "score": 4, "replies": []}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "These days, don't care. I'll do anything for the right price. I used to sell a lot more than I bought but now that I've made money, I like lower risk.\n\nEquities have terrible rules now. Futures are much easier.", "score": 8, "replies": [{"body": "What rules are so terrible? Just curious!", "score": 6, "replies": [{"body": "Margin requirements are super shitty. They look at stuff like 50% down in S&P500 despite the index moving less than a percent a day. It's insane.", "score": 9, "replies": [{"body": "Ah, definitely can see that.\n\nThanks for this post btw, lots of great stuff...especially your lifts lol. I’d kill to have a 400lb squat lol", "score": 7, "replies": []}]}]}, {"body": "> I'll do anything for the right price.\n\n*anythiiiiing?*", "score": 3, "replies": [{"body": "I'm definitely for sale.", "score": 7, "replies": [{"body": "Oh?? And what does it cost to have lunch with you and learn more about trading on volatility?", "score": 4, "replies": [{"body": "Lol, I wouldn't charge anyone to have lunch with me. I've met plenty of people from Reddit. It's no big deal.", "score": 7, "replies": [{"body": "Wow, that's really cool. I would love to do that the next time I come to Chicago. Thanks for being open to it!", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "What's your opinion on the two following common trades on this sub?\n\n1. Strictly selling vol, but expressing 'creativity' by doing it through strangles vs straddles vs ICs vs flies, and also by \"managing\" the position at certain stop-loss/take-profit levels on different underlyings?\n\n2. Using options to express directional views? i.e. a lot of people here like to use options purely for the delta exposure b/c they like the leverage", "score": 6, "replies": [{"body": ">What's your opinion on the two following common trades on this sub?\n>\n>1. Strictly selling vol, but expressing 'creativity' by doing it through strangles vs straddles vs ICs vs flies, and also by \"managing\" the position at certain stop-loss/take-profit levels on different underlyings?\n\nStupid. Doesn't take account vol levels or any real analysis.\n\n>2. Using options to express directional views? i.e. a lot of people here like to use options purely for the delta exposure b/c they like the leverage\n\nEven worse. I don't think anyone should trade options directionally.", "score": 9, "replies": []}]}, {"body": "What’s the best way for someone coming from a financial analyst role in real estate to break into an entry trader role?\nI know most real prop shops are gone now. \nI’ve traded options/futures independently for 4-5 years now and would like to move my career that way.  ", "score": 5, "replies": [{"body": "You have no edge here unfortunately in getting hired. You're going to have a very tough time. The firms like younger guys that they can mold. Your best bet is to know options inside and out and give a killer interview and show your track record. Still, it's going to be a long shot. Wish I had better news for you.", "score": 6, "replies": [{"body": "No worries - that is the answer I expected honestly. I am fortunate to have a good job as it. ", "score": 3, "replies": []}]}]}, {"body": "What do you mean the VIX trades are too crowded? Wouldn't the influx add more volume or you mean they take your trades before you? It seems a lot of people are still making money shorting VIX while hedged.", "score": 5, "replies": [{"body": "There are a lot of people trying to do the same thing. When that happens, edge gets reduced. To me, it's not really worth the risk now. It's still a good trade and will make, I'm just not interested given how much I used to make with it before everyone else figured it out.", "score": 5, "replies": []}]}, {"body": "* honest thoughts on tastytrade and their methods?\n* you mentioned some nights you weren't able to sleep from trading. does this still apply today? \n* at this point is trading \"boring\" to you or do still have the \"passion\"?\n* do you still trade other products (daytrade, stocks, futures, etc) just for the sake of it?\n\nthanks a lot!", "score": 6, "replies": [{"body": ">* honest thoughts on tastytrade and their methods?\n\nI don't like them. I'm almost always a straddle buyer and executing some of the spreads they like are really stupid.\n\n>* you mentioned some nights you weren't able to sleep from trading. does this still apply today? \n\nYes. Rarer though since we trade with such little risk. The SPAN requirements for the products I trade right now are $20k whereas I was in the millions regularly in indices. We run a flat book these days but shit can happen.\n\n>* at this point is trading \"boring\" to you or do still have the \"passion\"?\n\nIt's boring since I don't need the money.\n\n>* do you still trade other products (daytrade, stocks, futures, etc) just for the sake of it?\n\nNope. I consider that gambling and I don't gamble.", "score": 8, "replies": [{"body": "If it’s boring and you don’t need the money why would you do it?", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "What the hell are you doing in /r/options?! You're not supposed to leave the fitness subs.", "score": 7, "replies": []}]}, {"body": "Legendary AMA Fletch, thanks for doing this!", "score": 4, "replies": []}, {"body": "For someone who's a mod of like 5 finance subreddits and obviously an extremely intelligent person who's made millions(?) off the market, why do you spend so much time in /r/fatlogic? Is it really worth your time?\n\nI agree with the general philosophy of the sub, that people come up with ridiculous excuses to stay fat, etc, but it seems repetitive and unrewarding to spend huge amounts of time there. What do you get out of it?", "score": 11, "replies": [{"body": "Love this question.\n\nI talk about this story on that sub often but my parents both got very sick in 2012 (quad bypass for dad, mom was in hospital for ~6 months, thought both were going to die). I started stress eating a ton and got super fat and broke my spine! I was making a ton of excuses for my weight until I found that sub and faced my shitty logic and got my ass in gear. Now I spend time there because I love seeing the stories of other people going through similar experiences to me. It's absolutely the most life-changing sub I've found on this site. I also need the constant reminder to never get fat again -- it really sucks. I'd recommend that sub to anyone trying to lose weight. It's so damn helpful.", "score": 49, "replies": [{"body": "That's an unexpected answer! Thanks!", "score": 6, "replies": []}]}]}, {"body": "Do you see commodities options being less correlated? Many commodities options markets display wide spreads ... Which ones do you favor to work with? Thanks", "score": 5, "replies": [{"body": "Wide spreads do not mean that they don't trade tight. Almost everything trades between the quotes now. All options are fairly correlated now, but there's still some minor edge. We work with primarily CME and CBOT products.", "score": 5, "replies": [{"body": "The correlation I was asking about is between asset classes. Like grain would move independently from financials, decreasing overall portfolio volatility?", "score": 2, "replies": [{"body": "I'm sure there's a small correlation between the two but grains aren't an investment like financials are. You shouldn't be long grain futures expecting to make money.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": ">AFC/NFC championship prediction and who do you want to win the Superbowl? \n\nヽ༼ຈل͜ຈ༽ﾉ Raise Your Bortles ヽ༼ຈل͜ຈ༽ﾉ\n\nSeriously though, I only follow ND football since I went to school there. I don't follow any pro teams in any sports. I read about them though for social reasons -- it always gives you something to talk to other males about and this business is nearly all men. Purely a networking move on my part.\n\n>What are your lifts (bench/squat/dead lift) and height-weight? What are some of your favorite shoulder exercises?\n\nBefore I broke my back, probably 350/450/500. I'm not allowed to squat or dead lift but I bang out 40 reps at 225 on the bench pretty easily... I'm just not allowed to lift heavy any more. I'm 6'2\", 183 pounds. This was a year ago, but this is generally what I look like at this size: https://imgur.com/a/GGS0X\n\nI usually do shoulder press barbell, shoulder press dumbbell, and behind the neck barbell press and alternate. I do tons of pull ups and chins as well. My shoulders look way stronger than they actually are though.\n\n>What's your plan once you step away from trading?\n\nVolunteer as a coach somewhere. I need to give back. I feel like a piece of shit doing what I do.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "$150K in NYC based on what you are doing seems to be low, honestly. However, don't recklessly abandon your career and just trade. You need something else in life besides it. Look to progress in your career, run through a few early stage startups - this helps with building your own capital (because, let's be honest, nobody became a millionaire starting with a $2K account). Bonus points if you get into a trade shop, do what you love and can trade/learn.\n\nGood luck!", "score": 6, "replies": [{"body": "Thanks a lot!", "score": 1, "replies": []}]}, {"body": ">  What is your job title?\n\nManaging partner I guess? I don't know. I don't really care.\n\n>And I know you said you work in Chicago, but I live in NYC I imagine there are firms here but I wouldn't know where to start if I wanted a place to work for 1-2 years.\n\nChicago is better for options. I don't know the popular/good New York firms though unfortunately.\n\n>The job is low to moderate amounts of stress, 9-5, and pays around 150k. The guys I graduated with are split between wall street and data science, but the wall street guys are more like quants. I'm really more interested in trading options. I'm 30. Do you think it would be stupid for me to switch into a career like yours?\n\nYou'd certainly make more money. They might work you harder though. I doubt you'd be making less than $250k starting and honestly it should be a lot more than that. If I were you, I'd work for a firm for 1-2 years, make a good amount of money, then go solo and make millions if you know what you're doing. It's tough if you're expecting kids though. I'm not tied down so I had the freedom to do all this stuff. It's tough though -- it's really hard to say how successful you'll be in trading until you try it.", "score": 6, "replies": [{"body": "> I doubt you'd be making less than $250k starting and honestly it should be a lot more than that.\n\nHoly fuck, what exactly are you envisioning? I mean, I'm not clear what job this person would be doing. Working as a trader like you? Or implementing software at the direction of traders?", "score": 3, "replies": [{"body": "I made a few hundred thousand my first year in 2009 and that was just for trading. If he's willing to do quant work and has a PhD, he will easily top that, especially in NY.", "score": 4, "replies": []}]}, {"body": "Thanks", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": ">Low volatility is different than cheap volatility. Realized volatility—what has actually happened in the market—is the lowest it has been in 50 years, but the market price of volatility, which is to say the expectation of volatility in the future, is much higher than most people realize.\n\nThey know what they're talking about.", "score": 7, "replies": []}]}, {"body": "Hopefully I’m not too late to ask questions. I am just now learning about options and have just opened a tastyworks account. I deposited a small amount of money and am ready to go. I like math and am a Civil Engineer so numbers and percentages are not something I’m afraid of. My goal is to average 20% returns per year. Is this too high? What kind of general advice would you have for someone like me? Is there a resource for information that you think I should definitely look at? Any help is appreciated and I’m glad to see that you’re planning on “giving back” once you’re done trading. Good luck! ", "score": 4, "replies": [{"body": "20% would be bottom of the barrel for any active trader. That's not too high, but obviously you need to know what you're doing.\n\nIt's really hard to figure out systems to make excess money now. Options definitely make it easier, but it's still very hard and gets more difficult by the day. You have to find a system that works for you and a way to manage positions. I can't really tell you how to make money unfortunately though outside general advice about buying/selling vol at proper levels.", "score": 4, "replies": [{"body": "I feel like starting out at 20% is realistic until I get enough experience to push higher. What general advice would you give regarding trading vol at proper levels? I’m guessing you mean not overextending. I appreciate you taking time to respond. I realize you don’t need to help anyone so thanks for the advice. ", "score": 2, "replies": [{"body": "It's probably incredibly hard to trade volatility properly without a ton of automated systems + pricing models ready to go.\n\nIf you trade it by hand, even with an edge, your positions will expose you to a lot of risk as it's very unlikely that you would be able to hedge away the risks associated with trading these kind of products.", "score": 1, "replies": []}]}]}]}, {"body": "Curious, but I think I know the answer.\n\nWhen you worked for a firm, were you not allowed to trade? They seem to make it seem like a mandatory ban, but apparently it's often companies overreaching.", "score": 5, "replies": [{"body": "What do you mean? I worked at a trading firm. I was trading within a month of starting. If you're talking about non-compete, they aren't enforceable in Illinois and I went independent any way -- they would only really enforce it if I tried to go to another firm.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Oh okay. Ya, I never did that. I only traded as an independent after I left.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": ">Thanks for sharing! Your last thread about excess returns really made me think a bit more out of the box and I have identified a great edge in my home market.\n>\n>* Are you making markets or just hitting bids and asks?\n\nBoth.\n\n>* Do you only put on spread trades in the complex order book?\n\nWe quote everything in the COB. Sometimes we do stuff on the screen using outright though.\n\n>* I guess your pricing model is your edge.. but do you have any recommendation on good research papers wrt volatility, order flow or micro structure/order book models?\n\nI wish I did, sorry. I've only learned this through my own experience. There isn't a lot of good info on this stuff in academia.", "score": 2, "replies": []}]}, {"body": "Why commodity options specifically? And which ones? Do you trade oil, nat gas, gold, or is it the ag futures like corn/wheat/soy/coffee/etc?\n\nDo you trade any option strategies on eurodollar futures /GE ?", "score": 5, "replies": [{"body": ">Why commodity options specifically? And which ones? Do you trade oil, nat gas, gold, or is it the ag futures like corn/wheat/soy/coffee/etc?\n>\nSingle listed exchange makes it easy. Ags but looking to add more.\n\n>Do you trade any option strategies on eurodollar futures /GE ?\n\nNope.", "score": 2, "replies": []}]}, {"body": "In your shop, do you prefer single or double breasted? ", "score": 7, "replies": [{"body": "We only wear sweatpants and t-shirts at my shop. One day last summer, I came in on the boys programming something and neither of them were wearing shirts at all. Trading is pretty chill like that.", "score": 24, "replies": [{"body": "Oh I bet they were programming hard when you came in on them. ", "score": 32, "replies": [{"body": "Just gettin sweaty with the boys ", "score": 10, "replies": []}]}]}]}, {"body": "How do you handle clearing?  Are you guys speed sensitive / collocated and if so how does that interact w/ broker relationships?\n\nI have a bunch of professional options algo-trading experience in other markets and just like you went independent (though much more recently, about a year and a half ago) and have found that brokerage / clearing relationships in markets I haven't traded in the past are a headache.  The semi-pro options are so-so and as a result I haven't spent much time seriously exploring the US futures / future options markets.  Any suggestions where I should look?  The capital involved would be six digits, possibly the low sevens if needed.", "score": 3, "replies": [{"body": "We use Dowd-Westcott and EDF. Nirvana Technology Solutions handlers our tech hosting and such and they are beyond incredible. We honestly wouldn't be in business without them. We are colocated and have a pit presence. No issues with that.\n\nWhat are you trading now or looking to trade? I'd reach out to Nirvana if you have any tech/clearing issues. They were way better than anyone else we found. They handle a lot of accounts around your size.", "score": 4, "replies": []}]}, {"body": "The obvious:\n\n* how much did you (personally) make in 2017?\n* how big is your working capital?\n* working capital sources? Your own? Borrowing it? Do you have investors?\n* ROI for 2017?", "score": 3, "replies": [{"body": "The answer to 1 and 2 would be very low 7 figures.\n\nJust my own money these days.\n\n400%.", "score": 6, "replies": []}]}, {"body": "What’s your opinion on negative interest rates? Do you think they have an impact on implied volatility? How do you properly value options when the risk free rate is negative? ", "score": 3, "replies": [{"body": "They matter more for clearing than for us. They don't affect pricing all that much unless you're trading ITM options. Models should handle negative risk free rates just fine -- they're not going to go negative to the point where they're going to drastically affect prices of the OTMs any way.", "score": 3, "replies": []}]}, {"body": "Hey thanks for doing this!  What are your thought on buying LEAPS on companies/commodities that have recently exhibited low volatility or have a major known upcoming event that will drastically affect the price? \nDo you think there may be mispricings in the long-term options as longer-term options assume a normal distribution of returns when in fact there may be abnormal distributions over the options longer life?", "score": 3, "replies": [{"body": "We do fairly well in long-dated options. I am a bigger fan of buying them, but they work a little differently in futures than in equities. I've never traded LEAPS on equities so I don't know if I am the correct person to answer your question here. I do know the spreads are super wide though so you must be really damn confident in your pricing if you want to cross markets.", "score": 4, "replies": [{"body": "Interesting.  Thanks for the answer.  What is your typical holding time for LEAPS?", "score": 2, "replies": [{"body": "We trade illiquid products, so a long fucking time unfortunately. We end up holding a decent chunk of LEAPS for months at a time. It sucks, but we only take really good stuff back there.", "score": 1, "replies": []}]}]}]}, {"body": "Hi,\n\nTaking an investments class this semester on options, etc. I'm majoring in finance and economics, but would I still be able to join a firm without any degree in math or programming? I find investment banking to be too pretentious and I want to get into trading eventually. ", "score": 3, "replies": [{"body": "Absolutely, they'll take anyone if you can ace the interview. That's the hard part of course! You'll also need a very high GPA from a top school to get a foot in the door.", "score": 2, "replies": [{"body": "What about a PhD in Statistics (from a state school)? Is a math based grad degree still highly sought out or am I relegated to the same status as someone with a bachelors in business?", "score": 3, "replies": [{"body": "You'd be a top applicant with a PhD in math.", "score": 1, "replies": [{"body": "And a PhD in Statistics? I have a Bachelors in Math", "score": 2, "replies": [{"body": "That will work just fine.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I could help you test some reinforcement machine learning models if you are interested. ", "score": 3, "replies": []}, {"body": "Do you know of a good free/cheap tool that doesn't require extensive coding (some basics are okay) that allows for viewing surface diagrams based on different criteria (e.g your normal payout diagram with a third dimension, like IV, or even custom axes like IV/Theta)?", "score": 3, "replies": [{"body": "Actant will give you a demo and shows all that stuff.", "score": 2, "replies": [{"body": "You should ask for an ad revenue cut from them, lolz", "score": 2, "replies": [{"body": "They've given us a lot of breaks. We bother their CEO every week as well and he always answers. They're good people. I don't mind giving them recommendations.\n\nPeople like IB that suck on the other hand...", "score": 3, "replies": []}]}]}]}, {"body": "When you open a shop like this, how much of your own money do you put in? What was your total AUM for the 400% year?", "score": 3, "replies": [{"body": "Answer to both is low 7 figures.", "score": 1, "replies": []}]}, {"body": "thanks for doing this.", "score": 3, "replies": []}, {"body": "How old are you?q", "score": 3, "replies": [{"body": "31", "score": 1, "replies": []}]}, {"body": "Are you on twitter?", "score": 3, "replies": [{"body": "Reddit only.", "score": 1, "replies": []}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/quantresearch] [Fletch doing an AMA](https://www.reddit.com/r/quantresearch/comments/7rjfzk/fletch_doing_an_ama/)\n\n- [/r/stockmarket] [I manage a small options trading shop. By request, AMA round 2. • r\\/options](https://www.reddit.com/r/StockMarket/comments/7rbtmq/i_manage_a_small_options_trading_shop_by_request/)\n\n- [/r/wallstreetbets] [Someone that actually makes money unlike you autists, but I doubt any of you will learn anything](https://www.reddit.com/r/wallstreetbets/comments/7rikxt/someone_that_actually_makes_money_unlike_you/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 6, "replies": []}, {"body": "It seems like you are mostly finding arbitrage opportunities, so how often do you lose money on specific trades?", "score": 2, "replies": [{"body": "Probably 40 percent of trades.", "score": 3, "replies": []}]}, {"body": "How big is the rift between sell-side and buy-side? I always heard sell-side was good preparation for anything, but you seem to be saying that shops want someone that's committed buy-side from the start.", "score": 2, "replies": [{"body": "I don't have any experience with true banks or anything like that. I've always traded and never dealt with clients or their money so I can't really speak for this. Trading for a trading firm is much different than trading for a bank which is what I think you're asking about.", "score": 1, "replies": []}]}, {"body": "What's the best way to get options data to start backtesting and making models?  Buy symbol by symbol and then roll your own backtester? (it's pretty expensive)\n\nOr is there an off-the-shelf version like Tradestation where you can have access to their data and run your own models on it?", "score": 2, "replies": [{"body": "We are going over this right now actually. I can't find a good answer outside paying the exchanges for it.", "score": 3, "replies": [{"body": "Gotcha, thanks for the insight", "score": 2, "replies": []}]}]}, {"body": "What form did you use to get started? Would you recommend working for a firm to learn strategies? How much capital is typically required to get started? ", "score": 2, "replies": [{"body": ">What form did you use to get started?\n Would you recommend working for a firm to learn strategies? How much capital is typically required to get started? \n\nThe firm I used went out of business. Absolutely. Depends -- futures requires next to nothing while equities can be hundreds of thousands or millions.", "score": 1, "replies": []}]}, {"body": "Sorry if this question is a bit out of place or elementary relative to your level of expertise. I just opened an investor's TFSA as for years I've let it sit accruing low interest in a standard TFSA. At the same time I'm unemployed and have been spending hours each day attempting to educate myself as much as I can learning up on the basic fundamentals like reading balance sheet/10-K reading, chart analysis, reading analyst reports, trying to identify trends and market movement based on global economic, social, and political. Most recently I started looking at options trading as it seems like a great way to mitigate loss with the potential for good gains in a highly inflated market. What I'm finding is that with this flurry of information I'm reading day in and day out by market open I'm completely overwhelmed and can't make a calculated decision on what to do. Could you please offer a little bit of advice into what info or \"noise\" I should block out to become more effective in the early stages of self-directed investing and possibly offer a little insight into the core fundamentals you believe go the longest way when first starting? I've considered ETFs but the management fees are a bit unappealing. Thanks a bunch in advance and so sorry for the ridiculously long-winded backstory. ", "score": 2, "replies": [{"body": "You need to understand the Vols each option trades at. Without a model that tells you IV of each option, options trading will be impossible. Most front ends should have this. I'd follow IVs for a while and learn how a smile works and then you'll be able to better figure out good opportunities for options trades.", "score": 3, "replies": [{"body": "Thanks for taking the time to respond with some great advice, definitely a solid push in the right direction. I think I was over-simplifying the entire thing specifically how each option price is calculated and not taking into account how IV affects whether or not the option is OTM, ATM, or ITM. I really appreciate the encouragement though and will definitely follow IVs and read into volatility smiles. Thanks! :)", "score": 2, "replies": []}]}]}, {"body": "You know anything about buying bonds at an institutional level? Or how an individual can buy specific bonds? ", "score": 2, "replies": [{"body": "Don't know the first thing about this. Sorry.", "score": 1, "replies": []}, {"body": "A 4 year later reply:\nEtrade seems to have a pretty good looking bond trading platform. Have to trade in large size though.\n\nAlso nice username.", "score": 1, "replies": []}]}, {"body": "Late question, you talk often about \"paper flow\" and \"flow\" can you elaborate a little? ELI5?", "score": 2, "replies": [{"body": "Paper is what we consider the big time players. They have orders that move the market. They're the people that buy thousand lots or more. You generally don't want a lot of these trades.", "score": 2, "replies": []}]}, {"body": "You down for some Fortnite squads?", "score": 2, "replies": [{"body": "Sure. Add me. Fletch71011 is also my PSN.", "score": 2, "replies": []}]}, {"body": "What was your typical tranche size in ags?", "score": 2, "replies": [{"body": "Depends on the product but we will quote 10 up ATM and scale to about 75 lots. 5 to 25 volume percent in each product.", "score": 4, "replies": []}]}, {"body": "How can I get to where you are? Still a fourth year student in finance. Currently pursuing cfa and a data analysis course..", "score": 2, "replies": [{"body": "Work for a firm for 2 years and you'll be fine. There are tons of them in Chicago.", "score": 1, "replies": [{"body": "That's kind of optimistic, right? It isn't like everyone who takes a job at a trading firm makes millions in their 20s, is it?", "score": 1, "replies": [{"body": "Well yes. Less than half of people probably make it as traders at those firms* and obviously even fewer go independent (which I don't really understand).", "score": 1, "replies": [{"body": "I think in terms of mm firms, they'll keep the IP/modeling decisions silo'd off from traders. The traders just learn to trade off of levels and keeping things \"in line\". when it comes to deciding how the lines should move and how you calculate real risk, I think traders know less about the intricacies. Personally, social aspect is important. plus now that I'm on the modeling side, it's easier for me to implement my ideas in a firm that's already trading (and earn a small portion of those profits) than to start my own operation from the ground up. Setting up all the tech and staking out on my own also seems a little more stressful too. ", "score": 3, "replies": []}]}]}]}]}, {"body": "Thanks for doing this awesome AMA.\n\nWhat is your typical overall leverage ratio at your shop?  I'm sure that it varies, but are you typically levered 5 to 1, 10 to 1, 20 to 1?\n\nThanks Again!", "score": 2, "replies": [{"body": "We have a margin account so it's not as straightforward as 5 to 1 leverage. Usually we use about 25 percent of our capital at any given time.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": ">This is almost a month old but I'll give it a shot. Would you consider what you do a solid career path for someone who is about to graduate in a year with a management and finance degree? How common is it for option traders to open up their own boutique like you did, I'm an entrepreneur at heart and while I don't mind working under someone i'd much rather bust my balls as a ceo or partner for my own shop. \n\nIt won't last much longer. It's common, but can get pretty difficult given the tech needed these days.", "score": 2, "replies": []}]}, {"body": "Do you dabble in crypto by any chance?", "score": 2, "replies": [{"body": "Not yet.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": ">Hey, hope you don't mind me following up here with a lengthier post.\n>\n>I'm 30 and I work in tech. I'm on a slow path to become a junior developer; slow by design because I have a lot of crucial non-development responsibilities and I'd prefer a slow easing into a new career anyway. I've always wanted to work in algorithmic trading in some fashion, but I first wanted to focus on becoming a full-fledged developer, rather than merely being someone who \"knows how to code\" (I code now but it's not my main job responsibility, it's more of an ad-hoc thing).\n>\n>Anyway, this, coupled with the fact that I've been making easy money in crypto (in 2017 it didn't require talent nor luck to make money), has prevented me from switching to a trading career, which is fine! I'm really happy where I am now and I'm making money easily with my day job and my crypto moonlighting. \n>\n>However, sometime in the next 3 years (assuming an inevitable recession isn't too disastrous) I would like to move into your field. I have a few questions:\n>\n>1) I saw earlier that to break it into this field, you just need to be a programmer who's good at math. Well, it's been a while since I've done calc/probability and quite honestly I've forgotten it all. Can I simply build up my foundation (speedrun from prealgebra to calc, basically) and take self-tests in calc/probability? As an employer, how would you determine someone's goodness in math?\n\nYes, you should do some brushing up. A lot of the firms will give you mental math exams that will be on a strict time limit. They'll also ask you math/probability questions during interviews.\n\n>2) Would I be too old to join one of the large options trading firms in Chicago? I saw earlier that you recommended joining one of them and getting trained because their training was exception. I would want to do this around the ages of 31-34. For what it's worth, I have boyish good looks that make me look 24-26 (XD) and an unending desire to learn and better myself. Surely that'll help fight the perception that I'm too old a dog for learning new tricks. \n\nThey almost always want kids directly out of college. They want someone they can mold. It's going to be tough at your age.\n\n>3) Is there anything I should maybe focus on in my pre-hypothetical-trading career from a programming standpoint? \n\nC++, Java, and Python seem to be the most important but it doesn't really matter. Understanding things at a hardware level would be a huge bonus as well as networking. I don't understand that stuff but I know it helps a lot.\n\n>4) Do you happen to know if there are any options firms in NYC that compare to the ones in Chitown?\n\nNot really, sorry\n\n>Thanks a lot for all of this.\n\nAll good.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Both of those answers involve low-latency trading. If you want to get into programming for HFTs, you'll need an understanding of both.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "I don't do subscription stuff nor do I want to sell anything, sorry. ", "score": 1, "replies": []}, {"body": "Removed the personal info. You are always welcome to use the PM for sharing those.", "score": 1, "replies": []}]}, {"body": "You still hiring?", "score": 2, "replies": []}, {"body": "Beach or indoor?", "score": 2, "replies": [{"body": "Definitely more of an indoor player. I love the strategy involved and there's nothing like bouncing a ball into the rafters. I play like a total asshole on the beach though.", "score": 5, "replies": [{"body": "2 man or 6 man?", "score": 3, "replies": [{"body": "6 all day.", "score": 3, "replies": []}]}]}]}, {"body": "You mentioned you were using Actant, but which product? ExStream? How are the commissions with them?\n\nI get what you say about commodities, but e.g. /ZC is too small to bother due to commissions on FO. Did I miss anything?", "score": 4, "replies": [{"body": "Yes. We pay $2k an instance. We have modified it so much at this point though that it isn't really Actant at this point. It's way cheaper than other similar front ends and more flexible. It does have a lot of quirks though.", "score": 2, "replies": []}]}, {"body": "Can you hire me?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I don't have experience with the APIs of any of the brokers, sorry. I have always used a dedicated front end. The cheapest one I used was Sterling and while it was a piece of shit, it got the job done. All front ends you pay for are a million times better than the ones the brokers provide.", "score": 4, "replies": []}, {"body": "Seems to be a pretty weak broker overall but Tradier's API is really easy to use and decent. Getting access is super easy.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, I have a bare minimum account there just so I can have API access. Nothing else about it is that good, just so-so", "score": 1, "replies": []}]}]}]}, {"body": "I love your posts man. I'm a statistics Ph.D. student, but all I want to do is trade. I'm interested in selling puts on small caps with IV >= 100%, especially ones with reasonable balance sheet. It seems like there must be some be some way to exploit the skew given that price can only go as low as $0.", "score": 1, "replies": []}, {"body": "How are your returns? \nAny books/sites you’d recommend for options trading? ", "score": 1, "replies": [{"body": "Look at his previous AMA for this, both questions answered repeatedly", "score": 6, "replies": [{"body": "Alright, thank you!", "score": 3, "replies": []}]}, {"body": "We made 400% last year. Really depends.\n\nOption Volatility and Pricing by Natenberg is the only book I've ever read on options pricing. It's super boring. Reading other books about gambling/betting/casinos helped as well.", "score": 6, "replies": [{"body": "What's your favorite strategy? Selling volatility or buying volatility, and what duration? ", "score": 2, "replies": [{"body": "I'm definitely a heavy skew seller in front months but honestly this depends on the product.", "score": 2, "replies": [{"body": "What is the front month, 30 days out or weeklys? I typically sell puts on index futures (capturing the negative skew) ", "score": 3, "replies": [{"body": "I love selling weeklies in indices. I actually used to spread them against the front month. It was a great trade. People usually overestimate vol in the short-term in my experience.", "score": 6, "replies": [{"body": "Yes and No regarding weekly vol over estimation. It can be a great strategy if you do a 10-15 delta, but you can be caught with your pants down aka Gamma Risk with an index gap up/down. I'd rather play it safe and give myself time to adjust with 30+ duration. \nEx. I have an ES 2550 uncovered put I sold for March31, 9 delta. This gives me time to stop loss or adjust should it gap down. ", "score": 3, "replies": [{"body": "Things might have changed significantly since I started trading index options. I was trading when they were first launched and the prices people would pay for them were beyond stupid. It was a great sale for a long time.", "score": 4, "replies": [{"body": "Yeah, well last year IV was at historic lows. (Maybe ever). So the premium suck was a difficult haul last year. That's why I somewhat caution to go out 30 days", "score": 3, "replies": []}]}, {"body": "Loaded up a few /ES put ratios today on a mini sell-off, all the way down to 'tail risk' deltas. Still good premium to keep if nothing happens, better than a put alone. If it crashes, my wide kicker will welcome it. If we crash big time, god helps us all :)", "score": 1, "replies": [{"body": "Do you buy and sell in the same expiration? Can u give me example of the strikes you used and was it 2:1 ratio? ", "score": 1, "replies": [{"body": "Laddered in multiple expirations. Can be 10-30 point wide, as long as you are still getting the credit. My current favorite is 2x5, but with futures options the markets are deep and 1x3 or 2x3 works, depending on the width/breakeven.\n\nBasically, look at a strike you'd like to sell a put at (e.g. 10-20 delta), then play with strikes and contract count to cover it with profit zone and still collect good premium (which you keep if it moves up). If the price is within your 'straddle kicker', manage when your short leg price approaches 50% (it's not a pure straddle, your ITM longs contribute).\n\nNow, multiply the ratio by the number of tranches, and we're in the game.", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m pretty sure he means the standard expiration front months. Not the added weeklies some products will have as most just don’t have the liquidity. ", "score": 4, "replies": []}]}]}]}]}]}, {"body": "did my other question get skipped? it was the first question in the thread but the only one that didn't get answered so far :(\n\nsorry to prod, just an exciting ama to me", "score": 1, "replies": [{"body": "I'll answer every question to the best of my ability, some of the longer ones like your first question just required me to get a laptop to answer. A lot of these I'm answering from my phone. Had some unforeseen meetings this afternoon.", "score": 2, "replies": [{"body": "Gotcha. Thank you!", "score": 2, "replies": []}]}]}, {"body": "24 hours?", "score": 1, "replies": [{"body": "What?", "score": 1, "replies": [{"body": "Sorry wrong post.", "score": 2, "replies": []}]}]}, {"body": "I'm in a group. It's full of alot of smart guys. Full time trades, Wall Street Guys1,, part time traders, software Engineers...\r  \n\r  \n\r  \n\r  \nSo far alot of trades have been really profitable over the last month. We hit Gen 5x-10x baggers on puts on friday & Tesla 5x-7x baggers 2 weeks ago.\r  \n\r  \nIt's free too! We're always looking for smart people. Links in my bio", "score": 1, "replies": []}]}
{"title": "I've been in the market this entire bull run but I'm sensing some fatigue. Any ideas or strategies if things start dropping quick?", "selftext": "[deleted]", "id": "7r71k2", "created_utc": 1516247964.0, "score": 63, "upvote_ratio": 0.84, "num_comments": 123, "comments": [{"body": "Where is the sense of fatigue coming from?", "score": 41, "replies": [{"body": "[deleted]", "score": 88, "replies": [{"body": "They should IPO imo", "score": 2, "replies": []}]}, {"body": "Usually from repeated loads that exceed nominal stress value of the material.", "score": 21, "replies": [{"body": "Found the Engineer! ", "score": 8, "replies": [{"body": "[deleted]", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Wasn't the total market up yesterday?", "score": 9, "replies": [{"body": "Yes", "score": 6, "replies": []}, {"body": "The fact that this is in question shows some bearish signals. OP's concern isn't as baseless as you guys are making it out to be. ", "score": 2, "replies": []}]}]}, {"body": "I get how these “inevitable correction” posts are annoying, but what’s even more annoying are the comments like this asking for evidence. You don’t need to be a fucking genius to tell that the massive pullback-less run will come spiraling down in the near future ", "score": 1, "replies": [{"body": "I’m not asking for “evidence” I just want to know what makes him post this now rather than a month ago rather than 2 months ago or any other time during this past decade’s bull run. \n\nMore importantly I think it’s annoying to hear people talk as if they’re gonna call the top. And it’s even more annoying hearing people try to defend those who think they can because apparently it’s common sense. Yes it may be common sense that a pullback or crash is coming but that’s regardless of market run up in any time period.", "score": 25, "replies": [{"body": "you are going to get slaughtered with that attitude bru. ", "score": -11, "replies": []}]}, {"body": "What if the market had been underperforming and the run *is* the correction?", "score": 20, "replies": [{"body": "this guy stocks", "score": 4, "replies": []}]}, {"body": "\"I get how these “inevitable correction” posts are annoying. You don’t need to be a fucking genius to tell that the massive pullback-less run will come spiraling down in the near future.\"\n\nr/investing has been basically these posts nearly every day (often multiple times a day) for a few years now. The \"reasoning\" (if you can call it that) given by OP nearly every time is, \"I feel like the market is up too much.\"  I've read about a thousand times now on that sub over the last 3 years about \"IMMINENT MARKET CRASH!\"es and they've all been this: https://www.youtube.com/watch?v=V3y3QoFnqZc.  \n\nMarket proceeds to ramp a thousand+ points in January so far and do the people predicting crashes on r/investing go, \"Maybe I should re-examine my reasoning and learn where I went wrong?\" No, more \"DAE THINK CRASH?\" threads. I'm not super bullish by any means, but the macro environment is actually reasonably good. The market is technically absolutely overbought, but that may mean a correction or consolidation, I don't see why there's so much of this predicting a crash on Reddit. Too many people who watched \"The Big Short\" and think they can call the top or something.\n\nIt is useful and appreciated for people to actually give reasoning, especially reasoning beyond, \"I think the market is up too much'. Reasoning can lead to informative discussion.\n\n", "score": 10, "replies": [{"body": "The fact everyone thinks the market is going to crash tells me it's not going to. My minimum DOW target is 35K and maximum is 45K given the likelihood of a meltup. \n\nWhat people don't realize is there is a TON of cash sitting on the sidelines because so many retail investors were haunted by 2008-2009 and are sitting on 3% bonds or 2% CDs. These people will join in the frenzy soon enough once they realize equities are the ONLY meaningful alternative and aren't speculative like cryptos.\n\nI'm not a Trumpoid by any stretch of the imagination but anyone can see the economy is picking up steam. The only concerns you should have are widespread default in the Eurozone (cough Italy) and a massive financial debt bubble in China that could spill over to US markets.\n\nOld man Warren himself bought Apple stock a couple months ago.", "score": 10, "replies": [{"body": "\"but anyone can see the economy is picking up steam. \"\n\nThis is the issue that I have with all the posts on r/investing. I'm not a cheerleader for the markets and I do think that the market is technically overbought short-term, but the macro environment is good. People on that sub have basically gone on every day about \"THE MARKET IS UP TOO MUCH, DAE THINK CRASH?\" \n\nI'm not super bullish, but I don't see reasons for concern in the broader economy and I'm not going to twist logic/stretch to find them.\n\n\"so many retail investors were haunted by 2008-2009\"\n\nI do think part of the reason why there have been so many crash threads on r/investing are the younger people who started post-2008 and seem to have this belief that every cycle turn is a global financial crisis when that's just not the case.\n\n\"The fact everyone thinks the market is going to crash tells me it's not going to. \"\n\nI've said for years now that all of the \"DAE THINK CRASH?\" posts on r/investing have been a terrific contrary indicator (and they really have been.)\n\n\n", "score": 7, "replies": [{"body": "I don't blame them. Contrarian muppets like Jim Rogers, Peter Schiff, etc. have been preying on investor fears since 2007. First it was all about the sky falling and crushing everyone (partly true), then it was QE causing hyperinflation and \"the end of the US dollar\" (ROFL), and since their last failed predictions in 2013 they've been crying wolf every week about a crash in one last feeble attempt to vindicate their prejudices.\n\nI'm betting these clowns are wrong again and the market will go parabolic soon, like 1998-1999. \n\nHonestly it'd be a fucking joke if not for all the retail suckers conned out of their money because they didn't listen to actually successful investors like Buffett and Bogle, who would encourage those who don't know how to pick stocks to simply buy ETFs.\n\nReally absurd tbh.", "score": 2, "replies": []}]}, {"body": " It's a good idea to be prepared with an emergency plan while the sailing is still smooth. If you wait until the shit hits the fan you're much more likely to make costly panicked decisions/mistakes. Discussions like these are valuable. ", "score": 2, "replies": []}, {"body": ">The fact everyone thinks the market is going to crash tells me it's not going to\n\nI would not measure these forums against the larger public in general. The general population thinks the market is going to go up forever. ", "score": 2, "replies": []}, {"body": "There’s just as many people saying it’ll keep going up......", "score": 1, "replies": []}]}, {"body": "Most of the fund managers that have been interviewing on Bloomberg recently are talking about the same thing: correction / crash. Ex. Paul Singer, Jachim Fels. By the way George Soros mistakingly called a top in Q4 2017. When these guys start to get worried - don't you think it has some type of credence? Im sick of these Bull Headed redditers thinking that this isn't going to be another 2008-2009 slaughterhouse. As for the Macro environment. Rates are going up to cool things down. The Fed and the Bank of Canada are worried about inflation in the coming 18 months. There are bubbles forming and they will pop. Also, why do you reddit people always talk about \"the big short\". There are many people on this subreddit that are educated in investing either formally or self educated. Why do you think its right to undermine their views by referencing \"the big short\" as the premise for them wanting to short a stock or market? Someone replied to my comment last week about this. I have an honours BBA degree with focus on economics, I own businesses, and currently applying to LSE for MSC Finance. So how are my opinions or others who want to talk about a market correction not valid?", "score": 0, "replies": [{"body": "Many of those same fund managers failed to see 2007-2009 coming until it was literally at their doorsteps. \n\nThe fact is you're going to get 4-6 different opinions if you ask 15 guys well versed in finance, and at this point many people including myself don't give a hoot about what the \"experts\" think.\n\nIf you think the market is going to tank then buy puts/short the market. Let us lowly mortals stay long. ", "score": 4, "replies": [{"body": "There is nothing wrong with being long - I am personally not short right now. The point I’m making is that there is a lot of money going to be made by a good shorting strategy for when the bubble burst. There are many people on this subreddit who look at bearish views in discuss. If an investor doesn’t time the market they will never beat the market by that much . It doesn’t mean that your going to get the timing perfect - but if an investor can spot the trends in the general moving direction of a market they will protect their large gains from losses and possibly make money on the crash. If people in the subreddit were more open to discussing this maybe we could all figure out the trend and find a way to make $ on shorting strategies. ", "score": 2, "replies": [{"body": "Agreed, but it's stressful as hell to \"time your puts\" or go in a 3x inverse leveraged ETF like SQQQ due to decay. I'd rather hold bonds + gold and wait out a correction to not lose sleep and sit on 3-5% gains.\n\nIf the market dives 40% and you gain 3-5%, you're already ahead by at least 1 yr. ", "score": 3, "replies": [{"body": "You know what that is a really great way of looking at that. What do you suggest for bonds? I know basically nothing about bond market other than it may be approach a bear market. Do you know of any 2x or 3x inverse ETF that reset monthly? This may be a better way not to worry day-to-day if the market does move in a general direction over e time of 1 year. ", "score": 1, "replies": [{"body": "I did find a monthly 2x bear mutual fund from Direxion.\n\nhttp://www.direxioninvestments.com/products/direxion-monthly-sp-500-bull-2x-fund", "score": 1, "replies": []}, {"body": "If I were to make a play on bonds, I would need to see some momentum in the right direction. Currently the yield on long term bonds (TLT) is going up, which is bad for bond prices. TBT is for inversing bonds. \n\nThe real problem is asset prices for both stocks and bonds are expensive - bonds are (at least for now) not a good hedge for a market downturn. Puts and inverse ETFs are, and I already explained my position on those.", "score": 1, "replies": [{"body": "What is TBT? Why is yield going up on long term bonds? ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "\"By the way George Soros mistakingly called a top in Q4 2017\"\n\nGeorge Soros was buying S & P puts in 2013 and everyone went nuts. \"OMG SOROS IS BUYING PUTS!\" at the time. http://www.businessinsider.com/george-soros-bought-puts-on-the-sp-500-2013-8. Headline from the 2013 Article: \"It Appears George Soros Has Made A Huge Bearish Bet\".\n\nIcahn was hugely bearish in 2015 and in 2016 had significant net short exposure in his hedge fund and by extension Icahn Enterprises. From May of 2016: \"Carl Icahn Is Betting on a Stock Market Crash\" (http://fortune.com/2016/05/10/carl-icahn-crash-stock/). That didn't go very well.\n\nThe list goes on and on. Einhorn's \"bubble basket\" shorts for ages now. People talking about how Druckenmiller said something negative and then I'd look at his portfolio and it's GOOGL and FB and etc.\n\n\" When these guys start to get worried - don't you think it has some type of credence? \"\n\nNo, because I've heard this for *years* now. They aren't *starting* to get worried, many of them have talked about worries for ages. I have respect for these investors, but panicking because \"SOME BIG INVESTOR SAID THEY WERE NEGATIVE\" isn't something I'd do or recommend people do.\n\n\"Also, why do you reddit people always talk about \"the big short\". \"\n\nBecause after that movie there were a million posts about it and people thinking that everything was a bubble because \"the big short was cool\" and a thousand posts about the end credits and how do I invest in that? I wish people would have read the book instead.\n\n\" So how are my opinions or others who want to talk about a market correction not valid?\"\n\nNo one's saying that you are not entitled to your opinion. I'm just saying as someone who has posted in r/investing for a few years now, when someone posts at a rate of nearly every day, \"I think that the market is going to crash\" and then you ask them why and their sole reason is that \"I think the market is up too much\"; that's not only of no use (If I just said to you \"I think the market is going to crash because it's up too much\", how is that advice that you can use?), but is unbelievably repetitive. The desire to seek bubbles in every corner of everywhere on r/investing didn't start en masse until that movie. If you think the next downturn is 2008 again because of raising rates, you can have that opinion and are welcome to it. \n\nI'm not super bullish by any means. However, the market crash calling has gone on for years with investors both large and small, it's not new.\n\nGood luck to you and your business/application to LSE.\n\n\n\n\n", "score": 1, "replies": [{"body": "I really enjoy talking with you I think we should private message and exchange ideas.", "score": 1, "replies": []}]}]}]}, {"body": "But people said near future this time last year yet here we are up 20%", "score": 2, "replies": []}, {"body": "Let the rest of the world party and cover yourself, there’s no helping those who don’t listen lmao", "score": 1, "replies": []}, {"body": "The \"near\" is where you are wrong though. In the future yes the market will almost certainly take a large plunge, but there's no reason it has to be soon. People were saying there's a \"correction coming soon\" in 2017, and in 2016, also in 2015, 2014, etc. And we're still going without a significant correction or recession. I'm not saying it won't correct soon, hell maybe tomorrow is a 3% drop followed by a year long 40% correction, but I'm just saying that it is not an inevitability.", "score": 1, "replies": [{"body": "We didn’t have massive consecutive upticks without a pull back in those years", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "This is the only real advice. The only people that had realized losses in 2008 crash were nearing retirement. Because of opportunity cost with retiring. Some 30 year old with 50k in the market, could have just held, and would be up so big right now. ", "score": 4, "replies": []}]}, {"body": "I am short on tesla. Nervously holding it because it is a cult stock and though Supreme spiritual leader Elon and his company are the auto version of Vaporware, they have a history of destroying shorts. Nonetheless 2018 could catch up with his empty promises.\n\nAgree with the strategy someone mentioned above. Now is the time to buy gold and silver, esp miners who are beaten down - I am long EGO and AUY. DOW at 26K is a joke and may evaporate in the coming years. It went too high too fast.", "score": 23, "replies": [{"body": "On Marketplace someone theorized that Apple might buy Tesla with its repatriated $$$", "score": 3, "replies": [{"body": "tesla would be a horrible buy for any company, except apple might be able to afford it.\n\nthe bonds and debt they have are asinine and would more than double the real cost of purchasing it", "score": 0, "replies": []}]}, {"body": "All the big autos are projecting 2021 as the time frame for their EV products hitting the market. \n\nI would suspect the demise of tesla in that time frame. ", "score": 5, "replies": [{"body": "It's going to come down to the success of his gigafactory. If he can make it as fishing or more efficient, the brand will help carry him. But he has to deliver on the numbers he's promising.", "score": 3, "replies": []}]}, {"body": "It's all about timing. If and when the market corrects, Tesla will drop like a rock. I will probably wait until I see some panic, like multiple 400 plus drops before buying some puts though. ", "score": 1, "replies": [{"body": "At that point with the volatility will have spiked and the puts will be expensive compared with going out a few months with some cheap out of the money puts and rolling them over as needed.  What was your timing like on the bank puts?  Do you remember the details of the trade? ", "score": 2, "replies": [{"body": "I don't remember exact details other than I bought puts on wamu, wells Fargo and citibank, all of which tanked. I waited until I was convinced financials were going to collapse so I definitely wasn't one of the first to jump on those trades. I'd rather pay the volatility premium than buying too early.", "score": 2, "replies": []}]}, {"body": "i am exploring this idea much like you and getting a lot of negative feedback from reddit community. The face is the market is going to correct. Have a look at some leverage inverse ETF. Like SDS or SPXU. What are you thoughts on these? Im trying to find a product that balances monthly and not daily also. ", "score": 1, "replies": [{"body": "I've looked at those 3x inverse funds too. I am waiting to see some more panic before I pull the trigger though. This market has some long legs and I want to wait until it starts collapsing at the risk of starting too early. I will prob buy puts and some bear etfs once that happens though. ", "score": 2, "replies": []}]}]}, {"body": "Any advice on whether/where to pick up gold/silver certs?", "score": 1, "replies": []}, {"body": "Why short instead of options, JW?", "score": 1, "replies": []}, {"body": "How have the shorts been this week?", "score": 1, "replies": []}, {"body": "automobile industry trims hard on electrcity as an energy source.\n\nTesla is future my friend ", "score": 0, "replies": []}]}, {"body": "Buy gold when stock are super high and vice versa.", "score": 13, "replies": [{"body": "I have a position in GDX because I think gold will outperform on the next correction, but gold did tank with the rest of the market in the last recession.", "score": 8, "replies": []}, {"body": "Why is this a good idea? Just curious.", "score": 1, "replies": [{"body": "I'm guessing he thinks there is an inverse correlation between the two.\nhttps://www.marketwatch.com/story/inverse-relationship-between-gold-stocks-has-never-been-this-extreme-2016-08-23", "score": 4, "replies": []}, {"body": "Because if both stocks and bonds crash, gold will likely go up.", "score": 2, "replies": []}, {"body": "Bonds are expected to be heading into a bear market due expected \"hyper\" inflation (a relative term) from the extent of recent monetary expansion (QE).  \n\nAs bonds retreat, liquidity for businesses may tighten, alongside inflationary disincentive to hold bonds (in a diminishing value environment), as well as Federal Discount Rate rising (to combat the inflation), and lastly the additional increase in bond issuing from the Fed. Res., & the US admin. and less buying from China and maybe others, means more supply with less buyers, all feeding into ever more rising rates.\n\nUntil the \"unwind\" is complete and/or the inflation is tamed (assuming it hyper-inflates), precious metals and commodities may be the primary (not options/shorting) hedges and/or flight to safety plays.\n\nThere is a theory that hyper-inflation may not show due to supply-side glut from the monetary expansion (which I don't entirely understand), but Milton Friedman was pretty certain when he said inflation always occurs following monetary expansion.  And it initially looks like an economic boom as businesses see it on their income side first.  Then it evens out onto their output side and everyone is raising prices.", "score": 1, "replies": [{"body": "Thanks for that well thought out response this makes more sense to me now. ", "score": 1, "replies": [{"body": "Np.  I'd love to hear insight on what's happening on a macro level that would describe the current environment that's not this, but I haven't yet (might be my own biases).\n\nThat said, I'm very novice and just trying to take a step back to see where the tides are ebbing and flowing.  The charts across the board are taking off, that's typically indicative of market euphoria.  There are indicators of the \"dumb\" money moving in to the markets (half the blue collars at work are getting into the markets).  And there has been discussion of absurdities in bonds (strangely low yields) as well as unsustainabilities in Muni's and High Yield bonds.  Not sure what the extended low volatility means, ...calm before the storm?\n\nGood luck out there.  Make sure you bring a life jacket so you'll be around for the next rise in tides. 😉", "score": 1, "replies": []}]}]}]}, {"body": "What are you thoughts on buying actual physical gold?", "score": 1, "replies": [{"body": "That’s the only thing you should get gold related.", "score": 2, "replies": [{"body": "How do you/where do you go about buying it? How do you know if youre getting \"real\" gold. What are the fees like when buying and selling?\n\nEdit: I would assume that I do not just go down to the jewellery store?", "score": 1, "replies": [{"body": "You could go online I wouldn’t because having a record of the purchase might hurt you.  So I would buy from a local coin dealer.  \n\nhttps://www.moneymetals.com/precious-metals-buying-guides/how-to-test-gold-and-silver-at-home", "score": 1, "replies": []}, {"body": "apmex and jmbuillion are good places\n\ni prefer a local coin store though. get to see and hold the items before i buy them, and the owner is a cool dude", "score": 1, "replies": []}]}]}]}]}, {"body": "There are a few viable strategies.  \n\nOne is to stay invested.  If the big fall never comes, you win big.  If the inevitable collapse hits, you lose big.\n\nOne is to sell everything and sit out this phase of the market.  If the big fall is delayed, you will go bat crazy wishing you were invested.  If the big fall is tomorrow, you will count your blessings, but you won't make any money.  I personally lean toward this option because it is low risk.  I moved 1/3 of my investment money onto the sideline yesterday.\n\nA different strategy is to buy counter-cyclicals such as precious metals.  Unfortunately, many of these companies have a lot of downside potential so may still incur loss.  If it works, your investments are protected and may increase a bit.\n\nAnother strategy is to short the market.  This can be done by targeting a high flyer such as Tesla with put options.  Virtually any company out there today has downside potential of at least 30%.  A few companies have downside potential of 60% or more.  These are the companies to target.", "score": 5, "replies": [{"body": "Depending on what you're holing too, buying decently far OTM put LEAPS on your holdings is probably the easiest way to hedge with the least downside. ", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 23, "replies": []}, {"body": "lol fatigue. Yeah the Dow up well over a thousand points since 1/2 is really showing market exhaustion.\n\nThe market *is* absolutely technically overbought. However, that can work itself out with a correction or sideways consolidation.", "score": 11, "replies": [{"body": "\"The market can stay irrational longer than you can stay solvent\"", "score": 9, "replies": [{"body": "And \"don't bet against a winning horse\" until it starts losing.", "score": 1, "replies": []}]}]}, {"body": "Europe, Asia and Emerging markets ", "score": 7, "replies": [{"body": "The safest answer on this thread.", "score": 2, "replies": []}, {"body": "Already there with 90% of my invested portfolio. With a weakening dollar and an already high stock market in the US it seemed the logical choice. But let's be real for a moment.. The US market is UP 2-3% in January alone. Who the hell is talking about fatigue?", "score": 1, "replies": [{"body": "I'm only 25% migrated but I'm on the way. Gotta buy up the good grazing property before the herd arrives", "score": 2, "replies": [{"body": "Good man. And you can always invest in emerging markets in EUR if you like. Best of luck!", "score": 1, "replies": [{"body": "Emerging Europe. You've planted an idea. How are you investing there. Mostly I see things that are a mix of E-Europe + Middle East + Africa. I'm curious about eastern europe...political stability. The other etf I found EUROX is mostly Russia withsome Turkey on the side.    My Googles literally bring me Russia, Russia, Russia and that seems Symbol\nName\nPrice\nIntraday Change\nNet Assets (in MM)\nYTD\nIIRFX\tVoya Russia I\t$32.48\t0.56%\t$89\t8.70%\nIWRFX\tVoya Russia W\t$32.42\t0.56%\t$89\t8.72%\nLETRX\tVoya Russia A\t$32.38\t0.56%\t$89\t8.69% \n\n\n\nSymbol\nName\nPrice\nIntraday Change\nNet Assets (in MM)\nYTD\nIIRFX\tVoya Russia I\t$32.48\t0.56%\t$89\t8.70%\nIWRFX\tVoya Russia W\t$32.42\t0.56%\t$89\t8.72%\nLETRX\tVoya Russia A\t$32.38\t0.56%\t$89\t8.69%", "score": 1, "replies": []}]}]}]}, {"body": "I'm not great with historic macro-economics, but wouldn't the world economy take a hit if America was to have a correction? Just because the world is so reliant on America right?", "score": 1, "replies": [{"body": "Yep, you can see it roll thru thur markets and if Asia takes a hit we have a bad day in the US but only at first. And the US economy isn't going to take a hit just a market pullback. China drives as much as we do now. European P/E ratios are much better than ours", "score": 1, "replies": []}]}]}, {"body": "Look into buying some puts for protection. Either on the S&P or a financials index.  About is a right to sell at a certain price. This will allow you to make money on the puts if the market goes down, without having to sell your stocks. Obviously, if the market does not go down, the puts may expire worthless, so it’s like an insurance policy. \n\nIt’s not too complex, but read up on it so you understand it well before you make any trades!", "score": 3, "replies": []}, {"body": "Amazon is not as \"vulnerable\" as you would think", "score": 10, "replies": []}, {"body": "Find the ES futures shorting button :D \n\nHaving said that, imo there isn't enough bear momentum to blindly go short right now.", "score": 2, "replies": [{"body": "I would agree. Not yet anyway.... ", "score": 1, "replies": [{"body": "You could always sell SPY iron condors. Gives you a bit of downside protection while not completely betting against the trend. I'm not sure how confident I would be with condors over put credit spreads, but if you are weary they may be the right play for you. ", "score": 1, "replies": []}]}]}, {"body": "I try to hold things that I'd never sell even if they went down 25-30%. IVV, APPL/FB/GOOG/DIS/DAL/VHT. I *should* put more stops in but I only do that if I want to sell something", "score": 2, "replies": []}, {"body": "If you're looking to buy puts on tech, Tesla/NFLX are both pretty expensive to insure because of the vol. You could go with the FNG ETF which basically consists of what you want with cheaper options. They're not super long dated though, so you may have to roll 2 or 3 times before they pay off.\n\nFYI, you gotta expect the downvotes, you're post a bearish sentiment during what might be one of the most frothy times people still alive have ever seen in the market by almost any metric. I personally agree with your caution, but you're definitely going to get shit from /r/stocks and you'd be downvoted into oblivion on /r/investing. Luckily, the number of downvotes you get on bearish views is probably directly correlated with how cheap you can get put options :)", "score": 2, "replies": [{"body": "Yeah I assumed as much although I haven't spent much time on this sub. Anytime you mention caution today, people think you are insane...which just reinforces my opinion most investors don't have a clue. anyone who thinks they KNOW what the market will do, is always wrong. ", "score": 2, "replies": []}]}, {"body": "Inverse 3x Dow ETF :)  I think it’s SDOW?  Not sure if ticker.", "score": 3, "replies": []}, {"body": "Sure is a lot of bears coming out of woods work in this thread.\n\nTime to buy more calls!", "score": 3, "replies": []}, {"body": "If you've been in stocks, you know that the \"market correction\" warning came about since 2012 as far I remember. 5 years later the market still never crashed.", "score": 4, "replies": []}, {"body": "I think hitting the 200 day SMA would be a 10% correction about.  Maybe you should just buy more once the DJIA hits the 200 day SMA.", "score": 1, "replies": []}, {"body": "You could sell some to realize gains. Pay down a mortgage or buy a rental house.  ", "score": 1, "replies": []}, {"body": "Cash out buy a rental property. ", "score": 1, "replies": []}, {"body": "If you have been in the entire bull market run, you're probably up 100%+. The market won't drop 100% overnight. To my knowledge, all my major corrections didn't appear out of thin air. The market was already in a downtrend. As long as the market is trending upwards, don't try to guess tops.", "score": 1, "replies": [{"body": "Only needs 50% drop to wipe out 100% gains. ", "score": 1, "replies": [{"body": "The probability of a 50% drop overnight is near 0. A crash will see about a 20% drop over the entire month. Any downtrend will be a prolonged drip culminating with a big drop. There's no prolonged drop at the moment.", "score": 1, "replies": [{"body": "XLF lost nearly 50% in one month during the 2008 crash. From peak to trough lost more than 80%. QQQ lost 80% during the dotcom bubble. Hit $63 intraday within a couple weeks of its $120 high, so that's also a nearly 50% drop well within a month.\n\nAnyways, I don't know where you get the idea that you can predict the severity and characteristics of the next crash. It *could* behave like previous crashes, but more likely it'll be something new -- a new cause with new consequences.", "score": 1, "replies": [{"body": "The most XLF and QQQ lost during a single month was about 30% during their crashes. And this is during the time where there was little algorithmic trading so volatility was still high. Using basic trend following, you would have been out of QQQ at the beginning of April around $90. Assuming you buy at the absolute top and sell at the absolute bottom, you can lose a large amount. But again, that would require you ignoring the trend. Like I said, markets don't completely collapse overnight. They don't go from an uptrend to a downtrend abruptly. It's a prolonged drip then a crash. And QQQ didn't hit $63 intraday until November after hitting it's $120 high in March. Looks like you're using non-adjusted price for the high and adjusted prices for the low.", "score": 1, "replies": []}]}]}]}]}, {"body": "Also look into SPXS, 3x Bear S&P ETF.  Just buy in after things start falling, not while it’s still rising.", "score": 1, "replies": []}, {"body": "BUY MORE.\n\nYou got lucky in 2008/2009.  No one can time the market consistently ", "score": 1, "replies": []}, {"body": "I would invest in gold. They've done studies, you know. 60% of the time, it works every time.", "score": 1, "replies": []}, {"body": "If anyone had an answer to this, we'd all be doing it. ", "score": 1, "replies": []}, {"body": "What is everyone s take on using robo investor to ride out the storm? They are usually high diversified and you can set equity, bond break out percentage ", "score": 1, "replies": []}, {"body": "You are fools to believes severe correction isn’t coming.", "score": 2, "replies": [{"body": "Ok please tell us fools when the correction is coming. I'll timestamp your comment and we'll check back in on it at the appropriate time", "score": 3, "replies": [{"body": "I’ll do you one better show me a market that has never experienced a correction?  ", "score": 2, "replies": [{"body": "I never claimed that. You claimed that a severe correction is coming... When is it coming?", "score": 4, "replies": [{"body": "When has anyone predicted a market correction correctly?  You can take different variables and indicators and can say “I believe a correction or crash is going to come”.  But you can’t say when.  Fact of the matter is, unless the US government gives credibility to the currency, this is all for naught.  Now I believe in block chain technology.  I believe the better bet is to follow the companies proposing crypto currencies to the USG.  Whoever wins the contract to make that currency will be the winner.  \nI for one invest in IOTA due to the fact that Microsoft, Fujitsu and a couple other corporations are workin with the IOTA developers.  ", "score": -1, "replies": [{"body": "Obviously a downturn is coming.  And after that another uptick.  And then a downturn.  \n\nIts so obvious most people dont even say it.  Calling people fools because they dont constantly state the obvious doesnt really add anything to a discussion, and makes you look like a jerk.", "score": 1, "replies": []}]}]}]}]}, {"body": "Any day it can happen realistically ", "score": 1, "replies": []}]}, {"body": "This is the strongest market ever and goes straight up everyday. Who are you trying to fool and why?", "score": 0, "replies": [{"body": "There is a doomsayer at least once a day in all the stock subs. We're rolling up on like day 36,500 of them being wrong. ", "score": 1, "replies": []}]}, {"body": "BTFD", "score": 1, "replies": []}, {"body": "$TVIX - 2x VIX ETF :)", "score": 1, "replies": []}, {"body": "What kind of fatigue are you talking about exactly? The fact that the S&P is up 5% in the last 12 trading days? More than 10% in the last 3 months?\n\nIf this is a fatigued market to you, then I have no idea how you're going to react when the S&P stays flat for one month, lol", "score": 1, "replies": [{"body": "Summer child reaction when market is -0.3% after 4% week: market is \"gasping for air.\"", "score": 2, "replies": [{"body": "Lol exactly. Man I feel bad for these kids once the market actually does shift. They're going to lose their effing minds", "score": 1, "replies": []}]}]}, {"body": "You are asking here radnom strangers for financial advice.", "score": -8, "replies": [{"body": "Radnom. Well, at least he's not axing for speling advice.", "score": 8, "replies": [{"body": "At least i know more than one language.", "score": -7, "replies": [{"body": "Jafar with this balls shaved.", "score": 0, "replies": [{"body": "Was ist Jafar?", "score": -5, "replies": [{"body": "The guy with his balls shaved.", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "What was your worst trade of 2017?", "selftext": "Looking through my ~~trades~~ losses for the upcoming tax season and figured we could see who sucks more.  [I'll start with being retarded on AMD](https://imgur.com/a/E7zaW) -$2500 by going balls to the wall on $15 calls", "id": "7rc8dh", "created_utc": 1516303805.0, "score": 25, "upvote_ratio": 0.97, "num_comments": 104, "comments": [{"body": "Lost 30k playing earnings on NVDA. I had done well playing earnings before then, including AAPL so I said fuck it. It took me 8 mos to build my account to that size and to lose it all on something so dumb hurt me profoundly.\n\nThe emotions I felt after were dark to say the least. ", "score": 34, "replies": [{"body": "Went to the well one too many times", "score": 9, "replies": [{"body": "I’m a thirst! ", "score": 3, "replies": []}]}, {"body": "Were you able to rebuild your account to before that play? That sucks man sorry to hear it ", "score": 3, "replies": [{"body": "Yeah, and in a shorter amount of time too. You live and you learn. ", "score": 1, "replies": []}]}, {"body": "I know this feeling..... but if you're smart you'll figure out what to do next and get it back.... I was once in this situation.... got it all back and I think soundly more then where i started, just stay SMART\n", "score": 2, "replies": [{"body": "Yes he should go to the closest 7 11 and Rob them and run to wall street and buy shares for cash that way it can't be tracked ", "score": 1, "replies": []}, {"body": "Yup, same. It’s hard to not think of how much further you would be though but that’s the lesson. I’ve learned to check my ego and my emotions. ", "score": 1, "replies": []}]}]}, {"body": "RAD. Was up thousands, and then down many more thousands.", "score": 34, "replies": [{"body": "I rode that as well, but didn't fuck up as badly ", "score": 5, "replies": []}, {"body": "Yup. I’d been trading for like a month and made the same mistake. \n\nI owned 69 shares and almost sold at $4.20 the day before the crash but I was a faggot for only a moment and believed that that piece of shit company could pull through. ", "score": 2, "replies": [{"body": "we were all faggots that day", "score": 1, "replies": []}]}, {"body": "Same", "score": 1, "replies": []}]}, {"body": "Bought 1000 shares of Blue Apron when it first went public. Fuck that piece of shit company. ", "score": 26, "replies": []}, {"body": "AAOI", "score": 19, "replies": [{"body": "Are you interested in making it your worst trade of 2018 as well? It's currently in a dip, buy it. Pussy. ", "score": 2, "replies": [{"body": "Still bag holding some dawg. Going down with the ship. Sold most at a loss but gotta suffer some more", "score": 2, "replies": [{"body": "man i am thinking about buying in if it dips to 30 or below. any reason as to why i shouldn't?", "score": 1, "replies": [{"body": "I can't give advice about this stock anymore. Ride or die (probably die)", "score": 1, "replies": []}]}]}]}]}, {"body": "This guy might win\n\nhttps://i.imgur.com/kTgkPNl.jpg\n\nPress F Boys.", "score": 14, "replies": [{"body": "F", "score": 4, "replies": [{"body": "A", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "g", "score": 3, "replies": [{"body": "O", "score": 1, "replies": [{"body": "T", "score": 7, "replies": [{"body": "Goodbye ", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I bought a decent chunk of VERI at ~$65 a share or something.\n\nThat one hurt, but taught valuable lessons.", "score": 12, "replies": [{"body": "what was the lesson besides buy high sell low", "score": 6, "replies": [{"body": "Trying to 'ride the coattails' of any momentum is a high risk, low reward play.\n\nIn the case of VERI, I looked at a possible ~15% upside and a >70% downside and still concluded it was worth the risk. Today I am a bit more measured in my decision making.\n\nSo that's lesson one.\n\nLesson two was: \"Wow. That bald dude running Limoncello Research has more Twitter clout/cred than I could have ever imagined!\"", "score": 6, "replies": []}]}]}, {"body": "Transentrix horrible pump and dump", "score": 10, "replies": [{"body": "Why must you remind me?", "score": 1, "replies": []}]}, {"body": "Mu atm calls at 48", "score": 9, "replies": [{"body": "I had atm SQ calls at 48 :,)", "score": 1, "replies": []}]}, {"body": "AMZN options. never again. ", "score": 8, "replies": [{"body": "I sold a call before their earnings, my worst trade as well.", "score": 3, "replies": [{"body": "trying to hold a rocket ship down with s fishing net", "score": 3, "replies": []}]}, {"body": "How could you lose money on amazon in 2017?  It went up more than 50%. ", "score": 2, "replies": [{"body": "bought some shitty options when it was testing the $1k area, bought at the top then it dropped. ", "score": 2, "replies": []}]}]}, {"body": "Selling 80% of my BAC-b @ .80 for a little profit. Now my remaining warrants are sitting at +402%. So many tendies I missed out on. ", "score": 7, "replies": []}, {"body": "UAA, Kevin Plank is a homo", "score": 6, "replies": []}, {"body": "Fintec penny stock. ", "score": 6, "replies": [{"body": "Of all the penny stocks out there, this sector was probably the least shitty to gamble on tbh", "score": 6, "replies": []}]}, {"body": "BSTI", "score": 4, "replies": [{"body": "I second that.", "score": 1, "replies": [{"body": "such a pointless piece of shit stock, leave it to me to buy Chinese RAD", "score": 1, "replies": []}]}]}, {"body": "Bought MOMO at 37 ", "score": 3, "replies": [{"body": "I bought way ITM options on it then that will expire worthless tomorrow.  Fuck momo", "score": 2, "replies": []}, {"body": "Same. Got pretty fucked by that ER. ", "score": 2, "replies": []}]}, {"body": "RAD", "score": 4, "replies": []}, {"body": "Surprised it wasn't said before. Definitly Jay-NUG for me. Lost almost 20% of my portfolio in a day. Luckily I still ended the year with +30%. Also swore to myself to never trade stupid 3x etfs again.", "score": 4, "replies": [{"body": "I said the same thing, then I held $soxl and started printing money", "score": 4, "replies": []}, {"body": "God damn how deep were you ", "score": 1, "replies": [{"body": "I was very stupid and naive and learned it the hard way. 50% of my portfolio was jay NUG that day. Thanks to the massive bull year I was able to climb out of it pretty fast.", "score": 1, "replies": [{"body": "Wow, glad you were able to make it back ", "score": 1, "replies": [{"body": "I put me quite in the negatives, spend everything I had in blue chips long term options and rode the Nvidia wave. Those were some nice days.", "score": 1, "replies": [{"body": "More people need to hop on the blue chip megacap leaps train, many tendies ahead ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "too many too count prob LULU+AAOI earnings ", "score": 3, "replies": [{"body": "How did you miss on LULU. I made like 8% twice trading LULU", "score": 1, "replies": [{"body": "some stupid shit like weekly OOM puts and the stock went soaring , i dont wanna rmb ", "score": 1, "replies": []}]}]}, {"body": "$once at 75", "score": 3, "replies": []}, {"body": "Sold SPY and bought MU and AMD in December ", "score": 3, "replies": []}, {"body": "Nothing really. I bag-held a couple of losers till they were back in -5% territory and then cut them.", "score": 2, "replies": []}, {"body": "ORCL earnings put a hurting on me at the end of last year", "score": 2, "replies": []}, {"body": "Trying to play a bounce on PANW when it went from 140 to 116.", "score": 2, "replies": []}, {"body": "Not taking profits in MU. I didn’t have bad trades, just traded that lost lots of money. Like buying KTOS at peak. Ok that was bad. ", "score": 2, "replies": []}, {"body": "All of it", "score": 2, "replies": []}, {"body": "CMG and ULTA.  Bought high sold low.  At least -20k on both of them.", "score": 2, "replies": [{"body": "DSFDSAFASDF", "score": 3, "replies": [{"body": "Think it's a bit more serious than that bud. ", "score": 2, "replies": [{"body": "sdfafsafdsa", "score": 2, "replies": []}]}]}]}, {"body": "KTOS them diluting their stock killed me.", "score": 2, "replies": []}, {"body": "Gambled and lost on OLED faggy Ds for their ER. Little did I know had I just bought LEAPS I would have made a fortune...", "score": 2, "replies": []}, {"body": "amd at 12.6", "score": 2, "replies": []}, {"body": "Getting fed up with MU and setting a stop loss... [at $29.10](https://i.imgur.com/8Z9sHE6.png)\n\nEdit: close second, [selling BAC+B at $0.7251](https://i.imgur.com/BO5oJuA.jpg). Would have been +340% right now.", "score": 1, "replies": []}, {"body": "Bought KHC (Kraft Heinz) at $92.50. Watched it sit at $78-80 until I eventually said fuck it and sold at a loss (first and only time ever doing that). I put the money in SPY calls and AAPL calls and made it back within a month.", "score": 1, "replies": []}, {"body": "Bad directional options plays. Covered calls on $V that got way ITM and never recovered. AMD weeklies. Def learned a lot though.", "score": 1, "replies": []}, {"body": "Bought amd at ~$13 in April with about half my buying power and panic sold at the bottom of the drop after earnings near $9, only to violate the wash sale rule and rebuy back in (for another small loss) a week later.", "score": 1, "replies": []}, {"body": "IWM weekly calls just before and adding after tax overhaul passed. *sell the news is real*", "score": 1, "replies": []}, {"body": "SNAP long for ~200 shares. Hopping out with 25% loss", "score": 1, "replies": [{"body": "same. what a shit buy", "score": 1, "replies": []}]}, {"body": "Held AMD through earnings.", "score": 1, "replies": []}, {"body": "Holding biotechs through catalysts. Was down 30% at one point. ", "score": 1, "replies": []}, {"body": "Panic selling AMD on the dip only have to have it rebound way passed by 11.40 average", "score": 1, "replies": []}, {"body": "Buying SPY Puts.....", "score": 1, "replies": []}, {"body": "Timing issues with shorting TSLA or bullish on GOOGL", "score": 1, "replies": []}, {"body": "Buying (and holding) UA ... So what if they're running out of money, they'll rebound", "score": 1, "replies": []}, {"body": "Shorting EFX, by far was stupid. I learned something never short anything owed by primarily institutional investors.", "score": 1, "replies": []}, {"body": "lost over 1k on myomo pump and dump. expensive lesson LEARNED though haha", "score": 1, "replies": []}, {"body": "I lost like $40000 when amzn etc dropped in summer. I kept buying in more and more anticipating a rebound.... they went on a run the week after my options expired. ", "score": 1, "replies": []}, {"body": "Bought $OLED calls for $13, sold them for $2 following the great tech crash of December 2017, now they're trading at $20", "score": 1, "replies": []}, {"body": "Selling AMZN at $851.72 and selling TTWO at $57.33 and selling BRK.B at $173.99.\n\nEdit: Sold the last of my NBEV yesterday for 3.27.", "score": 1, "replies": []}, {"body": "Received an alert for nflx at 195 while drunk. Wanted to buy 50 shares but clicked sell instead. It dipped to 191 and I thought it was a genius mistake and decided to hold till 190 but it went to 200 real quick. That was my worst trade. I have anxiety now when looking at the sell buy buttons. ", "score": 1, "replies": []}, {"body": "The day before the big drop in November I was granted access to the $6k RH gold tier. Bought FB APPL NFLX and PPYL. Though SQ was 50% of my portfolio. Over the next two weeks I lost 90% of my gains from the past 2 months.", "score": 1, "replies": []}, {"body": "hahahaha,.... anything this sub and faggot delight SPY calls ! bahaha.... so stupid SMH", "score": 0, "replies": []}]}
