{"title": "Floor for DIS?", "selftext": "With all the trouble ESPN has been going through as well as some product recalls, DIS has been on a steady downward spiral (with some slight recovery over the last week).\n\nDo you think it's going to continue downward?  How low are you expecting it to go?", "id": "42m4h7", "created_utc": 1453738396.0, "score": 9, "upvote_ratio": 0.99, "num_comments": 20, "comments": [{"body": "Just an opninion... But ESPN is in serious trouble. They will never be where they were 5 years ago.\n\nWhat does that mean for DIS? I'm not sure. It will probably recover long term, but I think the floor has yet to come. I personally, would stay away.\n\n", "score": 4, "replies": []}, {"body": "We have Shanghai Disneyland opening as well as partnerships with Alibaba to release products and a streaming service in China. I think they have some new things that could work out quite well... I feel like we could see a bounce for this quarter (due to merchandising) but it all depends on how badly ESPN has suffered. I do think Star Wars will destroy all expectations with the quarterly report, however.", "score": 2, "replies": []}, {"body": "Nobody knows when the it'll hit the floor. Dont try to catch a falling knife. Disney is down and if you think it'll bounce back up then now is probably a good time to invest. If your unsure then wait for market confirmation", "score": 1, "replies": [{"body": "“Do not anticipate and move without market confirmation—being a little late in your trade is your insurance that you are right or wrong.” -Jesse Livermore", "score": 2, "replies": [{"body": "Heh, I think I disagree.  Where Disney has been going is really only useful as context.  Whether to buy, hold, sell, or short is about where you think they're going, not where they've been.  If you think Disney is a good buy right now, then buy it.  Knowing it's trending down means you're on the contrarian side of this.  The fact that you're in the minority may be a warning flag, but it's not a stop flag.  ", "score": 1, "replies": []}]}]}, {"body": "ive been looking at their annual reports. Total earnings have still increased year on year for the past three at least. This combined with steady dividends and a great brand shows there isn't really a massive problem with disneys business, only the price it was trading at. ESPN subscribers are forcast to drop again by another 1-2% next year but it would still be very profitable. This doesn't really account for the huge drop in price. I think it was mostly overbought for star wars and hopes of continued steady growth. Now star wars is in, ESPN spooked the speculators and now its dropping back until a level that more investment minded people might be able to weigh in on, until that price it should continue to drop. As far as I can tell we haven't reached that point anywhere near yet. It's currently still trading at over 6 times its book value. That means that the brand Disney and its growth potential is valued （by the market) as worth five times the current value of total assets minus total liabilities. That's obviously crazy。Disney needs to figure out how to get into the direct to consumer market and how to cut prices on ESPN. Theme parks right seem to be the main focus of their growth and account for a huge share of the budget.\n\n\nI would say, instead of asking yourself wheres the bottom, ask yourself at what price youd be willing to buy it for and buy at that price if it gets there. Me personally, pending further investigation and assuming no big news, bearing in mind also that Iger is scheduled to leave this year, wouldn't be comfortable paying over 65$ per share. If the market nevere reaches that price then I'll stay out. Better to be safe than sorry. If you buy too much above the book value + goodwill component then you really are gambling, if instead, you buy for a more reasonable price, then you will feel fine holding it even if it continues to drop. Also considering the general bearish outlook for the market in general it maybe better to just bide your time for now.", "score": 1, "replies": [{"body": "Your second paragraph seems applicable to most large caps these days.", "score": 1, "replies": []}]}, {"body": "I'm not expecting ESPN to hurt them more than Star Wars is helping. \n\nDisclosure: Own 1 share", "score": 1, "replies": [{"body": "ESPN is much more significant portion of business", "score": 6, "replies": [{"body": "25% of revenues", "score": 1, "replies": []}]}, {"body": "I read somewhere that ESPN lost 7 million subscribers in the last 2 years.  ESPN gets roughly $6 per month from each subscriber.  That means that DIS is missing out on $500 million every year because of not having those 7 million subscribers.  And I'm sure the cord cutting continues so the losses grow each year.  \n\nBottom line: how many Star Wars movies will it take to recover the lost revenue from cord cutters?  I used to think they, as kings of content, could surely find a way to distribute profitably without cable, but that's a huge hole to dig out of.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don't think the trend will stop any time soon.  The actual rate of decrease may fluctuate but the cordcutting phenomenon is only in its infancy.  With smaller bundles and more and more streaming options, the trend is undoubtedly moving towards a la carte pricing.  Cable companies can only try to slow the trend but the writing is on the wall.\n\nHow many out of their current 92 million subscribers do you think actually would decide to continue paying for ESPN if it wasn't bundled and therefore subsidized by other people who'd rather not pay for it?  I think DIS owns the most valuable content in the world but it's an extremely uphill battle to make up for the lost revenue that bundling has provided them.\n\n", "score": 1, "replies": []}]}]}, {"body": "Star wars helped?? HAHAHAH shittttt i saw no positive movement after the movie came out. actually it continued to decline until these two big crashes in January where it dropped EVEN lower. \n\nDisclosure: 5 shares. 5 bullshit shares. ", "score": 1, "replies": []}]}, {"body": "LOL all these months people coming here saying how great the Disney company is.  I always asked how Disney was supposed to manage all their companies (amusement parks & restaurants, expensive movies, TV sports).\n\nNow I see people coming here talking about ESPN troubles.  Yes, the biggest issue at Disney is sports.  It's like, when did Disney become a sports company?  Sounds like they spread themselves too thin to me, but that's none of my business.\n\nThe movie business will also get into trouble in the future, as the business dichotomizes between blockbusters and flops.  Let's see how much a genius Bob Iger is when the economy goes south, (more) people get tired of superhero movies, and he has to deal with innovating in amusement parks & restaurants, expensive movies, and TV sports.  Hard to innovate in just one of those businesses... Which one do you guys think would get the most attention then?", "score": 0, "replies": [{"body": "Do you think Google, Apple and Amazon are also spread too thin because of all the companies they own?", "score": 2, "replies": [{"body": "Serious investors have been staying away from DIS.\n\nPutting a bet on DIS is gambling that an amusement park company can solve the cord cutting/sports problems by making movies.\n\nMore specifically, by note-for-note remaking movies more than 30 years old.\n\nBut I wish you luck with that strategy for the next few years.", "score": 1, "replies": [{"body": "I have no horse in this race, was just curious as your OP made it sound as though their diversity was a liability. \n\nAmusement park company? Dis was producing movies long before they had amusement parks. ", "score": 1, "replies": []}]}]}, {"body": "Not that I disagree with everything you said, but the trend in the past is that when the economy goes south, movie sales increase due to the fact that people want a 2-3 hour distraction from their problems so they don't need to think about unemployment, paying all the bills, getting kids Christmas presents. \n\nI just wanted to talk about that one point. When the economy goes south they will take big hits, on all the other aspects of their company though. ", "score": 1, "replies": []}, {"body": "Spreading themselves too thin would be owning Jiffy Peanut Butter, not owning a TV network...", "score": 1, "replies": []}, {"body": "They have a long history to entertainment television. ESPN is just a different flavor of that.", "score": 1, "replies": []}]}]}
{"title": "Have we Entered a Recession?", "selftext": "with the summation of Dovas being Blockchain talk and the Trusted Middlemen have lost control of monetary policy due to the nature of Fiat how will the worl re-evaluate what a Stock may cost? How do you short \"The System\" without receiving fiat in return?  \n\nI watched the Big Short this weekend and I really feel like the new housing crisis is the current Currency Wars that are causing Yuan devaluations and a crazy strong dollar.", "id": "42n8tj", "created_utc": 1453750642.0, "score": 3, "upvote_ratio": 0.62, "num_comments": 22, "comments": [{"body": "We have not entered a recession. A recession is 2 consecutive quarters of negative GDP growth. Everyone in this thread needs to chill. The stock market is not the economy. Unemployment data last I checked was better than expectations despite job losses in US shale. China accounts for less than 1% of US exports. Fuel costs are going down providing a lot more opportunities for non energy US producers. We'll have to see how much a China slowdown will affect the global economy, but in the 90s during Japan's slowdown shows the US experienced one of the largest peacetime expansions in its history.", "score": 15, "replies": [{"body": "Somehow people are conflating the idea of a bear market with an economic recession.", "score": 7, "replies": [{"body": "You had my upvote at \"conflating\", brother.", "score": 5, "replies": []}]}, {"body": "so you see this as a buying opportunity?", "score": -1, "replies": [{"body": "Start buying when the downtrend reverses and is confirmed to be moving upwards. The small % you'll lose out by not correctly guessing the bottom is well worth the risk you take by guessing where the bottom is and subsequently watching it fall even more.", "score": 7, "replies": [{"body": "“Do not anticipate and move without market confirmation—being a little late in your trade is your insurance that you are right or wrong.” -Jesse Livermore", "score": 3, "replies": [{"body": "Amen brother. The first stock book I ever read was Livermore - he's my Jesus.", "score": 3, "replies": []}, {"body": ">  I really feel like the new housing crisis is the current Currency Wars that are causing Yuan devaluations and a crazy strong dollar.\n\nWhat type of Market Confirmation would be necessary to verify the bottom has been reached?", "score": 1, "replies": [{"body": "See this comment for more details: https://www.reddit.com/r/stocks/comments/42n8tj/have_we_entered_a_recession/czbp944", "score": 1, "replies": []}]}]}, {"body": "so after we retest 1820 SP if you will and we see a spike up? or would it need to be lower and with a crazy chunk over sold into the market?", "score": 1, "replies": []}]}]}]}, {"body": "No. Sure seems to be a lot of scared people claiming we are though.", "score": 4, "replies": []}, {"body": "No, the economy is still growing. What we have entered, arguably, is a bear market.", "score": 1, "replies": [{"body": "Isn't China though cooking their GDP? Also Gold and Silver have been climbing and so has many Crypto currencies too in wake of this \"Currency War\"", "score": 1, "replies": []}]}, {"body": "Well, we been in a recession already for a long time, look at oil price and metals and grains. Lagging indicators but it's inevitable. We are already in recession in my book. http://finviz.com/futures.ashx", "score": -8, "replies": [{"body": "I feel ya there. I think looking into the future will increase the recession as we see new tech replace humans at the helm of all kinds of vehicles too.", "score": -5, "replies": [{"body": "It's not just that, the FED created a huge bubble by cutting rates hike to ZERO. Now they have to bring them back ON but the market fail to adapt to it. An other Quantum Easing on his way. QE4", "score": -2, "replies": [{"body": "So they print money when they can't get it back? Do they give to the bad loans again?", "score": -1, "replies": [{"body": "Yeah, print and print, lol. Zimbabwe 2.0 in a world scale.", "score": -2, "replies": [{"body": "isn't that obvious to the rest of the world then that the USA is bankrupt?", "score": -3, "replies": [{"body": "The whole world is contaminated with fiat currency. You won't find a country with a money backup with gold anymore.", "score": -2, "replies": [{"body": "What about Bitcoin though instead of gold? Wouldn't that be a good reserve since it is just a Public Distributed Ledger and would provide a deflationary currency that is NOT controlled by centralized banking and fiat. Could that be a solution?", "score": -3, "replies": []}]}]}]}]}]}]}]}]}
{"title": "Apple is going to the moon in 2016, if you don't think so, yuh-gone!", "selftext": "So guys, who is playing apple earnings, and what do we think? There is a real amount of bearish sentiment regarding apple not introducing new products to the market, and or not increasing market share, but I am personally bullish on the QT's earnings. ", "id": "42m2hm", "created_utc": 1453737733.0, "score": 10, "upvote_ratio": 0.75, "num_comments": 21, "comments": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Lol sounds like me", "score": 3, "replies": []}]}, {"body": "Earnings haven't seemed to matter much this year despite any beats. \n\nGuidance is what's going to count the most. ", "score": 8, "replies": [{"body": "I think they'll just barely squeak by positive for this earnings, but because of the $20 drop in price, I expect it to shoot up at least 5% if they beat.", "score": 4, "replies": []}]}, {"body": "2017 $150 calls. \n\n\n\n", "score": 7, "replies": [{"body": "that seems safe, hopefully we don't have a global market collapse tho", "score": 1, "replies": []}]}, {"body": "Tough to move the needle on this juggernaut.  \"Law of big numbers\" in full effect.", "score": 6, "replies": []}, {"body": "I think you are four years too late for the moonshot.", "score": 7, "replies": []}, {"body": "I think they'll meet or beat but the forecast won't be in line. ", "score": 3, "replies": []}, {"body": "Going off of memory, Apple always seems to destroy on earnings and disappoint on guidance ", "score": 3, "replies": []}, {"body": "I forgot I did your flair a few months ago. Still extremely relevant. ", "score": 6, "replies": [{"body": "I lose it everytime I read his flair.Thank You.", "score": 3, "replies": []}]}, {"body": "The reason I love making money short is it is the black and white proof of the failure of bullshit marketing.\n\nA set top box that cost more than the ones people like already?  A payment service that offers nothing but fees for Apple?  Virtual Reality, what is this fucking Lawnmower Man?", "score": 2, "replies": []}, {"body": "What new products have they introduced in the past 5 years? ", "score": 2, "replies": [{"body": "who cares when china is buying every gold iphone and iwatch they shit out tbh", "score": 7, "replies": [{"body": "this isnt even true", "score": 1, "replies": []}, {"body": "^ this tbh fam :v", "score": 0, "replies": []}]}]}, {"body": "Not a chance in hell. They are shuttering their ad business essentially and refuse to monetize. Now its going to be some weird self-service play. I know that selling phones and tablets are huge but if you can't even figure out how to monetize your own traffic, you're stuck in a fucking hard spot. ", "score": 3, "replies": []}, {"body": "apple is fucked. all its suppliers have reported cuts in orders and weakness in the smart phone area. you have to basically hail Mary at this point and just pray for something unannounced to save them. the safe bet is continue downtrend", "score": 1, "replies": [{"body": "Actually there was a report somewhere that AAPL was expecting higher sales than ever and wanted to have enough suppliers for that reason. They cut them when they reached what they were getting, they were just being careful that they had enough supply incase there was a boom in demand. \n\nI sold my AAPL puts today for gains. Bought AAPL calls at the lows today. I see it in the 110$ range after earnings, AAPL hasn't been this cheap in 2 years. It's oversold and I expect it to gain a lot more than usual. Shorts covering will help also. If my calls are green by a decent amount tomorrow, I will probably sell half my position. \n\nP.S. This year the sale of the new iPhone started in one quarter, last year the sale began at the end of the previous quarter by 2 weekends. This quarters volatility is huge. ", "score": 7, "replies": [{"body": "I'm with this guy. $105 weekly calls.\n\nThey'll slightly beat estimates, sell more iPhones than analysts predicted, everyone will realize \"peak iPhone\" is not going to be a thing, guidance will be high because of March product releases, investors will go long and shorts will be covering to secure their huge profits.\n\nWorst case? They don't beat iPhone #s, and their guidance is lowered. Don't see that happening with the incredible numbers they are posting in other aspects of their business (app store, Apple music, etc...) but it's always a possibility. At that point you wait for $90, maybe even $80s and go long because everyone and their mother and their grandmother is waiting for the iPhone 7.", "score": 3, "replies": [{"body": "My mother isn't. What could possibly make it worthwhile over the 6 for average user? Plus without 2 year plans, she'd probably only upgrade when it breaks. The phone treadmill is over for a vast majority of americans. This is what will kill apple unless they can do something new.", "score": 2, "replies": []}]}]}]}]}
