{"title": "The only thing GPRO is good for is so you can strap it to your head and make porno.....", "selftext": "with altoids mom. (or if you are on my level a \"sex tape\")\n\n1. Fuck GPRO.\n2. I have nothing for the educational section today so if any of you have questions let me know. I am giving up all vix questions to michaeljulian as he knows more about that shit than i do.\n3. I am playing the NKE expected move in the straddle for oct which I will hopefully close out tomm. (fuck you nke, don't move at all.)", "id": "2hfsdu", "created_utc": 1411659592.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 84, "comments": [{"body": "I am bullish on NKE, especially with todays down move. NKE might beat earnings and surprise everyone, then THE BS RALLY AGAIN. I am giving up short but I am long /vX\n\nJust did a sunny side down in GPRO, no upside risk :D\n\nUpon closer examination, I sold a strangle....83/76 praying", "score": 2, "replies": [{"body": "I bought some NKE Oct 18 '14 $80 Calls today. I really like the Lunarglides. They're super comfy. ", "score": 2, "replies": []}, {"body": "Re: sunny side down.. FEYE comes to mind :-) got killed on both the way up and the way down because I thought it'd be safe to sell a naked put really low", "score": 1, "replies": []}]}, {"body": "[NKE](http://iruntheinternet.com/01708)", "score": 2, "replies": [{"body": "oh yeah I am aware. i still have 21 days and rolled up puts before they crushed vol.", "score": -1, "replies": []}]}, {"body": "I really really want to buy some $80 puts for November, but they are ridiculously expensive.", "score": 1, "replies": [{"body": "sell a lower put against it", "score": 2, "replies": [{"body": "Too dangerous.", "score": -4, "replies": [{"body": "When he says sell the lower put, he's talking about creating a vertical put spread. (against the one you're long)\n\nIt's less dangerous than just buying the put, because when you sell the lower put you collect money against your initial investment.  You also neutralize some Theta and Vega.  If you were to get assigned on the lower short put, you own a higher strike put you could exercise.  So you're covered.  No extra margin tied up.\n\nThe downside is that your max profit is capped, but for my style, I'll cap some upside to lower some downside every time. ", "score": 3, "replies": [{"body": "Well said. He might not have the permissions from his broker to do this though.", "score": 1, "replies": [{"body": "No margin.", "score": 1, "replies": []}]}, {"body": "Yes I know, but then I don't have an unlimited profit potential and I can really only sell two contracts right now, not worth it for me. That'd lock up my whole account. Zero margin.", "score": 1, "replies": []}]}, {"body": "How is that dangerous?", "score": 2, "replies": [{"body": "Locks up my capital and I don't want to be stuck holding GPRO if it has a significant correction.", "score": 1, "replies": [{"body": "Just manage the spread; 1:1 ratio. If I had margin right now (poor), I'd buy 1 Jan 15 $80 (or maybe something further out), and sell 1 $70 Oct put (or maybe a weekly) to cut the cost. If GPRO goes down, as it gets down to $70, I'd roll that put I sold out to a lower strike and a further out month, all the while keeping the long term $80.  \n\nSo, theoretically, you cut your initial costs, and can trade vol on the way down, right? Or is this a completely asinine strategy?", "score": 1, "replies": [{"body": "So what you are proposing to do is selling into weakness. This only works if the stock keeps tanking, moreover, I think the spreads on the option markets will eat your profits. I'd just stick with one put debit spread.\n\nBy the way: lockup expiry is end of this year, so if this stock is ever going to go down, it should have happened by Jan 2015. The prices on those put debit spreads seem to be reflecting the high probability of that happening :-)\n\nAre you a functional programmer?", "score": 1, "replies": [{"body": "Yea you're probably right, after I posted I was thinking about it and executing this kind of strategy seems a bit complicated in terms of maximizing profits and probably is not worth the effort.  \n\nAlso, I'm a functional programmer (scala), though not in career; right now I'm an unemployed sys admin :)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I just sold some ITM call spreads for Nov. Good fill if you're patient", "score": 1, "replies": [{"body": "Details?", "score": 1, "replies": []}]}, {"body": "Yawn.   You've got a problem. \n\nJust so people know, OP [posted a comment in another thread](http://www.reddit.com/r/movies/comments/2h9h0z/what_are_movies_that_by_the_majority_is/cksfxdg?context=3) so that he can alert me that he made a post here insulting my mother.\n\nOP is that kid in grade school who would carry grudges and act like a fag because he refused to let anyone get the better of him.  Even though he was pretty much a fag and everyone knew it.  ", "score": 1, "replies": [{"body": "Or I am Irish and am genetically predisposed to holding grudges. ", "score": -2, "replies": [{"body": "Doubtful.  You're just a bit of a basket case.", "score": 1, "replies": [{"body": "Doubtful that I am Irish?", "score": -1, "replies": [{"body": "That it's the root of your predisposition.  ", "score": 1, "replies": [{"body": "Well half tard, it is; fucking common knowledge. ", "score": -2, "replies": [{"body": "I just realized I never replied to this.  Like the fuck I'm going to give you the last word.  \n\n[anyhow](https://www.youtube.com/watch?v=zyu2jAD6sdo)", "score": 1, "replies": [{"body": "Shocker.... a black kid learning how to play the race card already. ", "score": -1, "replies": [{"body": "And when did you learn to play the race card?", "score": 1, "replies": [{"body": "Do you have to work at being this stupid? ", "score": -1, "replies": [{"body": "You're a fucking racist.  You're a god-damned self-hating little irish leprechaun.  You want to blame your temper and being an asshole because  you're Irish.  What a fucking bullshit cop-out excuse.  I bet you also think black people are lazy and dumb, and jews are a bunch of shysters.   \n\nGo away racist  ", "score": 0, "replies": [{"body": "Dumb as fuck chief, dumb as fuck. ", "score": -1, "replies": [{"body": "<something here to not give you the last word>", "score": 1, "replies": [{"body": "suck my fucking cock (something more creative than your previous message)", "score": 0, "replies": [{"body": "That kinda thing turns you on? Guys sucking your cock?", "score": 1, "replies": [{"body": "If my cock was in your mouth I wouldn't have to hear you so yes, It would turn me on.", "score": 0, "replies": [{"body": "You say that as if you believe you're cock is large enough to stop someone from speaking", "score": 1, "replies": [{"body": "this reminds me of something that would happen to you:\n\nhttp://i.imgur.com/VK5xzYD.png\n\nhaha enjoy the laugh asshole.", "score": 0, "replies": [{"body": "too retarded; didn't read", "score": 1, "replies": [{"body": "it's fucking Shakespeare you asshole", "score": 0, "replies": [{"body": "Green text b-tard shit is never Shakespeare.  You're lucky if it even rises to the level of Friedberg and Seltzer.  ", "score": 1, "replies": [{"body": "enjoy your cookie asshole.", "score": 0, "replies": [{"body": "Is that what you call your dick? Cookie? Is that because it's Bozo's sidekick?", "score": 1, "replies": [{"body": "Bozo's side kick was cooky you fucking half tard. Your shit talking is God awful. And even if your reference was correct - no. Enjoy your cookie was in reference with the semen infused cookie in the linked story. ", "score": 0, "replies": [{"body": "In case you haven't figured it out yet, I didn't read the story.  \n\nToo retarded; didn't read.", "score": 1, "replies": [{"body": "> Green text b-tard shit is never Shakespeare\n\nbut you opened it.... common sense dictates that if you opened it you, at the very least, were interested enough to read some of it; did you get to the part where the guy jizzes in the cookie dough and then makes (you) eat the baked cookie while your girlfriend laughs hysterically at (you)?\n\n", "score": 0, "replies": [{"body": "> but you opened it.... common sense dictates that if you opened it you, at the very least, were interested enough to read some of it;\n\nI read the first sentence.  Clearly b-tard text.  I went back to let you know TR;DR", "score": 1, "replies": [{"body": "TLDR: Dude's GF cheats on him, She beats the cuckold off into a waiting bowl of cookie dough which she then makes, he feeds the cookie to the whiny little bitch (you).", "score": 0, "replies": [{"body": "So my assessment was correct.  A retarded story that's about as true as a Twilight Zone episode.  But at least those aren't retarded.", "score": 1, "replies": [{"body": "TLDR - check your cookie for jizz. Also you made my newest post: \n\nhttp://www.reddit.com/r/options/comments/2ht2au/gpro_options_strategy/ckvt7ul?context=3\n\nOne last thing:\n\nhttp://i.imgur.com/MVSX7ST.gif", "score": 0, "replies": [{"body": "Hah, your post was deleted at /r/afinil.  Guessing they can't stand you either.\n\nAnyhow, yeah.  I have sleep disturbances.\n\nThat wasn't always the case.  I used to get a good night sleep most nights.  I was fucking this nice petite red-head.  She had tight firm tits and the cutest eyes.  I'd start with fucking her in the pussy and then flip her over for a little anal, going in nice and slow to be sure and get my cock filled with her greasy shit before heading north to give her a dirty sanchez as she cleans her shit off my cock with her tongue and finishes off with a nice solid blow job.  God damned best fuck I ever had.  \n\nBut yeah, ever since your mother ran away with that midget circus freak and had a kid, I've been having a hard time sleeping.", "score": 1, "replies": [{"body": "Well Mom was in a sorority and we've already determined that sorority birds don't fuck the likes of you. Also, she isn't a redhead, Dad isn't a circus freak so it seems that your story is shot to shit. Better luck next time shooter. \n\nAnd I deleted the anfil post.... they all think you suck as well ", "score": 0, "replies": [{"body": "> Well Mom was in a sorority and we've already determined that sorority birds don't fuck the likes of you. Also, she isn't a redhead, Dad isn't a circus freak so it seems that your story is shot to shit. Better luck next time shooter.\n\nYou sure spent a lot of time defending that zinger.  Musta stung", "score": 1, "replies": [{"body": "Don't flatter yourself chief; it took a second and a half. ", "score": 0, "replies": [{"body": "But you felt the need to do so.  You actually felt the need to tell me your mother was in a sorority.  Really?  LOL.  \n\nWas she a typical sorority whore?", "score": 1, "replies": [{"body": "And you feel the need to continue to prove that you are at least a half tard. http://i.imgur.com/MVSX7ST.gif", "score": 0, "replies": [{"body": "I've got to admit that is pretty impressive.  Did you take that picture or did your mom film it for you?", "score": 0, "replies": [{"body": "Try to be a bit more creative in your \"your mom jokes\" here is an example:\n\nIt was the 80s, the time of Reagan; American excess when 1 out of 3 yuppies were using your mothers asshole as a coke spoon. Good times. I first saw your mom outside the mall - hair in a sideways pony tail, leggings - but not the bulky ones, you could tell she had a nice pair of stems. I didn't see her face right away as I was wearing an opaque pair of risky business ray bans but it may or may not have been beautiful. I invited her to the bathroom for a tootsie she agreed but it was evident she wanted the D. I told her id fuck her but only if your aunt would pay 100 to watch. She agreed. I used the $100 bill do to some blow off your moms clit - she now has no feeling in her clit as a result of the coke frying the nerve endings - this is probably why your dad doesn't feel like a man. I then told your aunt to do some blow outside off your moms asshole. This was the first time but soon her coke habit led her to be the house fluffer at studio 54. ", "score": 0, "replies": [{"body": "My goal here isn't to outshine you in creativity.  It's to outlast you in replying to comments.  If you want to waste your time, effort, and creativity with composing clever replies, then be my guest.  I'll probably follow it up with a TL;DR\n\nHell, if this keeps up I may just write a bot.", "score": 0, "replies": [{"body": "You will not win. ", "score": 0, "replies": [{"body": "Sure I will", "score": 0, "replies": [{"body": "I'll tell you what. I'll let you win if you post something that adds value to this board. ", "score": 0, "replies": [{"body": "Naaa, I'd rather win by endurance.  I am really tempted to write a bot to just reply to you though.  It'll be fun to watch you reply to cleverbot for the next six weeks.", "score": 0, "replies": [{"body": "So you would write a bot to win by endurance? How is that winning?", "score": 0, "replies": [{"body": "By using technology to make my job easier.  Also, watching you talk back and forth to a bot would be epic.\n\n", "score": 0, "replies": [{"body": "What job? You've added nothing.", "score": 0, "replies": [{"body": "That's not my job.  Just because I go to Ceres doesn't mean I'm on the CBOT", "score": 0, "replies": [{"body": "Other than being a nonsensical asshat what is your job? Do you work at the potbellies in the insurance exchange. ", "score": 0, "replies": [{"body": "Yes, I sit up on the little stage above the drink coolers and play my guitar singing folk music.", "score": 1, "replies": [{"body": "jennie died of aids. that isn't funny.", "score": -1, "replies": [{"body": "You don't like hearing me sing when on Thursday afternoons while eating your PB&J Sub?  You can get some goodies from the Amish who came into town selling there wares next to the CVS instead.", "score": 0, "replies": [{"body": "I am more of a turkey guy myself.", "score": -1, "replies": [{"body": "I figured you'd like the PB&J because hearing BJ wants you to put something big and long in your mouth", "score": 0, "replies": [{"body": "now that is clever. well played. I would have also added hot (they toast the pbj right) and sticky.", "score": -1, "replies": [{"body": "> they toast the pbj right\n\nI don't know, because when I hear B & J, I wanna whip out my cock and get ready for it to be sucked - and I don't want to go to jail.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Oh man...", "score": 1, "replies": []}, {"body": "Fuck GPRO. ", "score": 1, "replies": [{"body": "we should start a group", "score": 0, "replies": [{"body": "i would fuck GRPO", "score": 2, "replies": [{"body": "And strap another one to my head so can record that POV action. ", "score": 2, "replies": []}]}]}]}, {"body": "apparently gpro is worth over 10 billion. i keep rolling up puts for this weeks ex.\n\nI googled \"fuck go pro\" and this came up: http://fuckyourgopro.tumblr.com/\n\ndude gets it.", "score": 0, "replies": [{"body": "Clearly GPRO is the next TSLA, we'll be at $100 by the end of the month. /s", "score": 2, "replies": [{"body": "Needs to be at 20", "score": 0, "replies": [{"body": "Will be at 40", "score": 1, "replies": []}]}]}]}, {"body": "gpro's theme song:\n\nhttps://www.youtube.com/watch?v=sgFcMFY4bkU\n\nand i hate it because i love the stones'", "score": -1, "replies": []}]}
