{"title": "[deleted by user]", "selftext": "[removed]", "id": "3uh6z6", "created_utc": 1448640387.0, "score": 14, "upvote_ratio": 0.94, "num_comments": 21, "comments": [{"body": "I'm too busy riding TLOG out :D :D :D", "score": 10, "replies": [{"body": "A toast to your gains.  ", "score": 4, "replies": []}]}, {"body": "double down on that shit. Star wars is gonna be the first trillion dollar movie. Fuck ESPN\n", "score": 14, "replies": [{"body": "LOL\n\nESPN > 40% of DIS revs", "score": 15, "replies": [{"body": "Exactly. DIS makes a huge amount of its revenue from TV channels. Way more than movies and even more than their parks and merch. ESPN losing 7 million viewers is a big deal.", "score": 5, "replies": []}, {"body": "Not anymore.  Looking at the breakdown ESPN is 28.5% worth of Disney stock.  Still a large chunk, but their main revenue is Parks & Resorts at 31%.", "score": 1, "replies": [{"body": "Is that because ESPN revenues are declining or because other business lines are growing more aggressively? Let's go look\n\nLooks like ESPN is where you say it is, but it also generates much more margin than parks.  ", "score": 1, "replies": []}]}]}, {"body": "Fuck em indeed.  \n\nAnd I already did.  Yolo.", "score": 3, "replies": []}]}, {"body": "CASH SECURED PUTS if your bullish on the company.  take advantage of that sweet premium", "score": 2, "replies": []}, {"body": "I hope it's an overreaction and profit-taking for the holidays. Dug into Apr 125 calls. ESPN decline is concerning, but not unexpected since subscription loss is an industry-wide issue with a lot of people just cutting the cable cord in favor of streaming services. \n\nTheir movie lineup is rock solid. I really don't see Afleck's Batman stealing the show from RDJ's Iron Man. DC is so far behind on developing a Justice League to compete with the Avengers it's not even funny. Marvel already laid out the map through 2018.\n\nAlso, March 2016 will see the opening of the new Shanghai park.\n\nI'm sitting on Apr calls because last February's earnings absolutely knocked it out of the park. Here's hoping for a mega Star Wars release and continued demand for Frozen merchandise. We also have the College Playoffs and a couple MNF and Playoff games to get through before this quarter is over.", "score": 2, "replies": [{"body": "I think the main reason I'm still long is that everyone is saying the espn subscription has been dropping the last couple of years, but they fail to mention that revenue and profits are still going up in total, right? Seems to me like they are adjusting to cable cutting. And the Shanghai park and Star Wars merch is gonna fucking send this to the moon, I'm sure of it. ", "score": 1, "replies": []}]}, {"body": "I'll buy them off you whats your expiration date", "score": 1, "replies": [{"body": "I'm holding and leaning onto my friend johnnie walker for support.  Dec and Jan calls.", "score": 1, "replies": [{"body": "GL. You might want to buy that 55 gallon of lube on amazon. It'll ease the pounding DIS is giving you. ", "score": 6, "replies": []}]}]}, {"body": "Ouch, that hindsight trading though....\n\nStar Wars all round will give it a boost. $1 Billion within the first 9 days. No problem.", "score": 1, "replies": []}, {"body": "I am ready for a yolo on Monday if it goes below 112. ", "score": 1, "replies": [{"body": "Fuck you/congrats if it does.", "score": 1, "replies": []}]}, {"body": "Good idea to buy in now?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "So I should simultaneously buy and sell.  Got it.  ", "score": 6, "replies": []}]}]}
