{"title": "The sound of the bear market", "selftext": "[removed]", "id": "3ulybk", "created_utc": 1448733986.0, "score": 12, "upvote_ratio": 0.81, "num_comments": 24, "comments": [{"body": "MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT MARKETS CAN REMAIN IRRATIONAL LONGER THAN YOU CAN REMAIN SOLVENT", "score": 24, "replies": [{"body": "Buy puts, got it. ", "score": 9, "replies": []}]}, {"body": "Do you fuckers not know how to short things ?", "score": 5, "replies": [{"body": "I shorted cakes once but they kept rising and lost all my dough.", "score": 10, "replies": []}, {"body": "KBIO makes me never want to short things.\n\n....dont even dare comment on stops", "score": 1, "replies": [{"body": "yes but it is easier for a stock to go down so it evens out as long as you can tolerate the potential for unlimited loss.", "score": 3, "replies": [{"body": "Well, brokers will often liquidate your account if it goes into too much debt, even though it is likely to go back down. ", "score": 2, "replies": [{"body": "of course but typically you have 24 hours to buy more margin...", "score": 2, "replies": []}]}]}, {"body": "Such a ridiculous statement. Someone was once killed from masturbating..yet that hasn't stopped you from treating your body like an amusement park. ", "score": 0, "replies": [{"body": "That would be a sin and I'm glad they died.", "score": 7, "replies": []}]}]}]}, {"body": "K well this started with the sound of silence and then you just slaughtered it with so many syllables.", "score": 3, "replies": []}, {"body": "Can't wait for things to go on sale :)", "score": 3, "replies": [{"body": "I've been waiting for two years :( I have been the definition of \"scared money, don't make no money\"", "score": 1, "replies": []}, {"body": ">value investing\n\n>/r/wallstreetbets\n\nAre you that same asshole who keeps making TSLA threads over in /r/investing?", "score": 3, "replies": []}]}, {"body": "You're late to the party", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "i dont even care if this is sarcasm, but why would oil be a good hold if the market was to go down?", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "What if... what if it did... http://2.bp.blogspot.com/-ze5-XzyMZqY/TZPTbiuDa4I/AAAAAAAAAG0/e6t526R6ZAE/s1600/exploding_head_.jpg", "score": 2, "replies": []}]}]}, {"body": "You are doing it wrong! It's supposed to be 1000% split between wmt options, oil futures and x3 financial etfs, 100% cash for margin. If you don't have enough cash to trade on margin you can just get a loan and use that.", "score": 1, "replies": []}]}]}, {"body": "Year end rally here we come", "score": 2, "replies": []}, {"body": "Wtf did I miss? ", "score": 2, "replies": [{"body": "these pussy's castration sessions", "score": 3, "replies": [{"body": "I'm short on the SPY right now, was there anything specific that happened or just not breaking new highs on a holiday week...?", "score": 1, "replies": []}]}]}]}
