{"title": "My Bullish Case for Apple and why I think they will beat estimates", "selftext": "So I am going to try and make this short and sweet because it’s late, but this is my bullish case for Apple despite all of the criticism is has gotten lately.\n\n&nbsp;\n\n\nWe all know that Apple revenues rely heavily on iPhone sales with the sales making up approximately 68% of its total revenue (see website at bottom for confirmation).  We also know that the average selling price for the iPhones was raised in 1Q15 to $687 because of the company offering more options and dropping the lower memory phones.  There is some speculation that the new iPhone plan that Apple is offering will ultimately raise the ASP, but that is something to be explored later on down the road.  I have not found a document that would tell me exactly how many iPhones were sold in China, but we can make an educated guess using the website at the bottom again.  We know that China made up approximately 21.6% of the total revenue for 1Q15.  So this is the part where I take a little creative leap in my reasoning, but I assume that the China sales also closely correspond to the larger picture in that the China sales are skewed towards one product or another.  So if we take 68% of the Chinese revenue for 1Q15 that will give us approximately $10, 977.92 (in millions) revenue from iPhones sold in China. With an ASP of $687 that would mean approximately 15.98 million iPhones were sold in China during this quarter, which would be 21.47% of total iPhones sold.\n\n&nbsp;\n\nFrom 1Q14 to 1Q15 revenue from China grew by 70%, can we expect the same kind of growth over this past year? I think that is highly unlikely as Apple broke into the market and then expanding rapidly across the major cities during this time. I do think it’s reasonable for Apple to see a 30% growth over this past year in 2015.  What would this mean for Apple’s flagship product?  Well a 30% growth of iPhones sold in this market would mean approximately 20.77 iPhones sold in China.  This would be just less than 5 million units sold the previous and would mean that without any growth in any other region that Apple would sell 79.4 million iPhones in 1Q16.  \n\n&nbsp;\n\nI think it is unlikely that Apple would experience no growth anywhere else though.  Across the four other regions that Apple tracks; Americas, Europe, Japan, and the rest of Asia, they had an average YoY growth of 21%.  So if this growth holds steady and they experience the same YoY growth then we can expect the rest of the world to sell approximately 70.69 iPhones.  Which combined with the sales in China would be a total of 91.45 million iPhones sold in 1Q16, a 22.92% YoY growth in iPhone sales.  While this may seem an incredible amount let’s not forget that from 1Q14 to 1Q15 iPhone sales went from 51.02 million units to 74.4. million units, a 45% YoY increase.  So I believe that this number made be conservative.  But if we want to low ball growth and assume that the strength of the dollar, slow growth across the world, and other macro factors are weighing on the growth potential, then we can assume that China only grows by 25% and the rest of the world by 10% YoY. This would still give us approximately 19.98 million units sold in China and 64.26 million units sold in the rest of the world, giving us a total of 84.24 million units sold in 1Q16.\n\n&nbsp;\n\nSo this is my prediction for when Apple reports after the close of the market next Tuesday, they will have sold between 84.24 and 91.45 million iPhones for 1Q16.  With an ASP of $670, because of comps this will equal approximately 56,440 and 61,271 (in millions) in revenue.  If past ratios with revenue hold true from other products and the past then we can expect a total of 77,709 and 82,580 (in millions) which would equate to an EPS range of 3.17 to 3.37 diluted.  This is assuming that the net profit margin remains at a constant 24% which can be seen here:\n\n&nbsp;\n\n https://www.apple.com/pr/library/2015/01/27Apple-Reports-Record-First-Quarter-Results.html\n\n&nbsp;\n\nThe current analyst estimates are 3.24 EPS with revenue of 76,473.  This is right in the middle of my prediction, but despite all the negative news I believe that sales in China are going to be better than expected and that if there is a slow down or even negative YoY growth in iPhone sales then it won’t come about until 2Q16, in March.\n\n&nbsp;\n\nWebsite mentioned earlier:\n\nhttps://www.apple.com/pr/pdf/q1fy15datasum.pdf\n\n\nEdit: Formatting so it wasn't a wall of text.\n", "id": "41ysih", "created_utc": 1453359238.0, "score": 25, "upvote_ratio": 0.93, "num_comments": 78, "comments": [{"body": "I personally don't think earnings mean anything right now and its a crap shoot going into earnings.. what happened to NFLX today is proof enough of that but very nice DD. Thank you for the write up.", "score": 25, "replies": [{"body": "I don't think that's a fair comparison. AAPL trades at like 10x earnings whereas NFLX is at about 300. An earnings beat at 300 P/E doesn't mean much. An earnings beat at 10 P/E? That's a big deal. Enough to get some bigger players buying.", "score": 12, "replies": [{"body": "Using my own logic against me... I like it.. haha.. I completely forgot they had a nominal PE you know what... i change my position.. AAPL may not be a bad choice... I still think think theres a lot of fear but I would agree there isnt nearly as much down side risk on AAPL as as other stocks.", "score": 4, "replies": [{"body": "nominal PE huh and 10 P/E vs 300 P/E huh", "score": 2, "replies": []}]}]}, {"body": "Agreed", "score": 3, "replies": [{"body": "I bought some 1/29 100 Calls, as long as the market doesn't turn into a shit storm I think they will ride up at least until earnings. I'm prob gonna sell before then though.", "score": 2, "replies": []}]}]}, {"body": "Apple will beat estimates, shit I will even go so far as to claim they will beat their own guidance again as they've done the last 8 straight quarters.\n\nWall Street just doesn't understand Apple.\n\nThe one problem I have with your analysis though is your EPS is too low, as you likely assumed that Apple didn't buy back any shares this quarter. My guess is Apple actually bought back an increased number of shares this quarter, probably $15B or more again.", "score": 12, "replies": [{"body": "Right now Apple is riding the share buyback train harder than anyone is riding the Cher Bareback train.\n\nAt sub $100? They know what they're doing.", "score": 6, "replies": [{"body": "Share buy back is for companies that are running out of innovation or growth so they want to bulk up their stock prices..... Just ask IBM. They are notorious for this.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "IBM has spent close to if not just as much on share buybacks and dividends over the past decade. The reason APPL has that much cash is because it hasn't given it back to shareholders or spent it on innovation or mergers. Having cash doesn't mean you're growing...it just means you have cash. That's all. You can see this sentiment reflected in AAPL's stock prices and IBM's.", "score": 1, "replies": [{"body": "Wrong, dead wrong actually. IBM has spent less than $100B on capital return in the last 10 years.\n\nI'd say the problem with IBM is more that they've had 15 straight quarters of declining revenue.", "score": 1, "replies": [{"body": "Actually no...i'm right:\n\nhttp://www.reuters.com/investigates/special-report/usa-buybacks-cannibalized/\n\nIBM has spent 125B on buybacks, 32B on dividents, and 111B in R&D.  Apply has not spent this much and they are guilty of hoarding cash, which it does have to the right to do whatever it wants. Apple is not immune to big scale stagnation. They're not innovating or spending cash to innovate/do deals; that's why you have a big cash pile. It says nothing of their growth.", "score": 2, "replies": []}]}]}]}, {"body": "Or companies that are misvalued by the market... hard.\n\nHowever I do like what you said, because it means that Google has run out of innovation and growth.", "score": 3, "replies": []}, {"body": "True.. But its caital budgeting. Evaluating their future projects. Find which project can get that special ROI, and they'll go with that project. \n\nIf they can get a better return by buying back shares, they might just do it. \n\nI also would prefer if apple didn't pay a dividend. Just keep that shit.", "score": 1, "replies": [{"body": "Why? Thats just going to cause more shit they have to deal with, specially from Icahn. ", "score": 1, "replies": []}]}, {"body": "Share buy back is for companies who's valuation is irrationally low because Wall Street can't get over the fact that they were wrong on Apple for so long. Just wait until you're using a MacBook with an a10x processor and tell me Apple isn't innovating. That argument is so tired. ", "score": 1, "replies": [{"body": "Apple doesn't really innovate in terms of hardware so much. They know how to polish. People only like useful when its shiny and sexy.", "score": 0, "replies": []}, {"body": "How is wall street wrong on AAPL? the stock is worth what people are paying for it. Your logic makes no sense.  Wall street is always right on any stock price at any particular time. Share buybacks are to give shareholders back the money but at the cost of R&D and growth because capital is not being used for those areas.", "score": -1, "replies": [{"body": "Was Wall Street right when AAPL went from 700 to 400 in 2011 months after Steve passed despite no technical, theoretical, or market driven cause for the drop other than speculative commentary? I bought at 400 on the day it breached.", "score": 3, "replies": [{"body": "who cares when you bought it...it has no bearing on the facts. wall street was right when it went from 700 to 400 because of the issues at the time and when it proved to not be an issue it went back up. Now, that AAPL prices has stagnate, we can point to the facts that AAPL isn't growing because wallstreet is not paying to invest in it. Stock prices reflect consensus. I agree with the consensus this time...and if you don't then that's just a variance on opinion. To me, your argument is centered more on fanboyism and loyalty than anything else and I'm not here to convince anyone that their faith is wrong.", "score": -1, "replies": [{"body": "Every AAPL argument eventually devolves into an accusation of fanboyism when the con party runs out of ideas. In this case it happened embarrassingly fast. Your point is that Wall Street perceived that there were issues with AAPL in the time that I outlined, and when they were proven false, the stock returned to its previous haunting ground. You literally made my point for me. Wall Street got scared for no concrete reason, I knew this and bought 2x more at 400 and watched it go to 700. You literally said \"the issues at the time and when it proved to not be an issue it went back up\"\n\nApple is adding over 15 billion in straight cash every 90 days. Let's analyze - AAPL is adding more free cash flow every 90 days than 99% of companies could ever hope to be worth. That is continued and sustained growth.\n\nStock prices do reflect consensus, but consensus can and is at times wrong. \n\nThe only risk here is the old saying \"Wall Street can be irrational longer than you can be rational.\"", "score": 1, "replies": [{"body": "no one cares for your opinion or what you think. just put your money where your mouth is. I don't care how you invest. I'm just telling you that the way Appl's stock price has acted, investors are not convinced Apple is growing. Cash on hand just means the company is hoarding it...which Tim Cook has been accused of doing by shareholders many times before.\n\nhttp://www.bloomberg.com/news/articles/2015-02-10/apple-ceo-cook-says-company-doesn-t-want-to-hoard-cash\n\nThis has been a major issue for Apple and for Apple's largest investors, such as Carl Icahn. You're a nobody on reddit...i don't care for your opinion. It doesn't affect me whether you own apple or not or whether you think it's undervalued. The current price says otherwise. I just wanted to tell you that just because a company has cash does not mean it's growing. Microsoft was like that, IBM is like that, Cisco, etc; Apple is not immuned to this trend, especially when it's really just a 1 trick pony.", "score": 1, "replies": [{"body": "I choose to not dignify this rant with a topical response and will file this under willful disengagement with ignorant troll. Way to further the intellectual discussion, lol.", "score": 1, "replies": [{"body": "You had something intellectual? It was all numble jumbke cult worship. Leave that for your brothers.", "score": 1, "replies": []}]}]}]}, {"body": ">wall street was right when it went from 700 to 400 because of the issues at the time and when it proved to not be an issue it went back up.\n\nThis is about as far as I've ever seen someone push efficient markets..", "score": 1, "replies": [{"body": "yea? you should go read a book then", "score": 1, "replies": [{"body": "And you should buy an index fund..", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Maybe its another way of bringing back money into the country. They release another dividend to keep their vested employees happy, reduce the amount of dividend payments they make.", "score": 1, "replies": [{"body": "could be...not discounting any of that...just that most companies do this to shore up their stock prices", "score": 1, "replies": [{"body": "That too. But Icahn is pushing this hardcore on that share buyback.\n", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Good to know. Always appreciate someone adding some knowledge.", "score": 1, "replies": []}, {"body": "Touché", "score": 1, "replies": []}, {"body": "Yeah what about the rest of the quarter outside the last 5 weeks?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Or you are seeing pre earnings manipulation like always around this time of their earnings cycle by the Street to lower their basis. Apple for whatever reason really falls victim to the talking head bullshit.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Nice analysis man, this is the kind of posting I love to read", "score": 3, "replies": [{"body": "Thanks. After getting jazzed up from doing a few lines I thought there would be nothing better to do than bust out the calculator and put my thoughts down. But please feel free to sharp shoot my analysis. I'm always trying to learn and see things from different angles.", "score": 2, "replies": []}]}, {"body": "Apple has almost always beats earning but always disappoints on guidance.", "score": 2, "replies": [{"body": "\"Yo nigga. We sold a few bil iphones last quarter. Next quarter we prolly sell another bil. You mad?\". -Tim Cook ", "score": 5, "replies": [{"body": "you must be new", "score": 3, "replies": []}]}]}, {"body": "Wtf is this /r/investing? We don't need logic here.\n\nAlso you do realize that even when they do beat estimates historically stock does fall. Its happens a lot to AAPL.\n\n\n#PAGING /u/shortAAPL", "score": 1, "replies": [{"body": "Yeah sorry guess I'll just let the plebs run amok with their shitposts. Just trying to bring back some DD to this subreddit. And yeah I realize that the share price always gets shit on. If they are in the upper end of my projections though its primed for a bounce considering how beat down they are.", "score": 2, "replies": [{"body": "Also please note the decline in iPad sales YoY is not helping their case for being diversified.\n\nUnless they do something revolutionary, I'm gonna be neutral on the company. Smartphone industry is commoditized. Only thing thing keeping iPhones alfoat is iOS. Not their outdated LCD 720P screens with 16 gigs of space that's ment for 4k recoding (lulz)\n\nBut literally apple will go up or down is good as a coin flip.", "score": 1, "replies": [{"body": "Yeah I accounted for the fact that over their other product lines they have an average -9% growth, and I still came up with the revenue/ EPS figures that I did.", "score": 1, "replies": [{"body": "Good shit and good luck.\n\nI believe Amazon will overtake apple by the end of the decade IMO as the largest american company (fuck you Saudi Aramco) but that's an unrelated note", "score": 1, "replies": [{"body": "I agree with you too. I'll be interested to see what Apple's next big product is after the smart phone. You know they have one in the making. I would love to see an actual TV set that is Siri integrated that could also serve as the hub for everything else automated in your house. Imagine having your TV control speakers, lights, thermostat, fans, give you notifications when your laundry is done, etc. And it could all be Siri activated to get rid of the need for a remote.", "score": 1, "replies": [{"body": "Probably not TV's this market is heavily saturated with will known players + a computer on a stick makes any tv smart. OLED technology has changed the industry standard and apple was not leading this. \n\n>Imagine having your TV control speakers, lights, thermostat, fans, give you notifications when your laundry is done, etc.\n\nWhy not a universal remote with notifications? Or Perhaps using your existing smartphone. \n\nWhere I see the next revolution is smart watches.  When technology gets better, there will be seamless integration of smarts into mechanical watches.\n\nAn example. A normal looking rolex, but double tap the window (the glass on a watch) and it comes to life because its a screen. Giving you full smart watch features but still remaining the classless style of a wrist watch.  These clear smart windows already exist (https://www.youtube.com/watch?v=m5rlTrdF5Cs). Its just matter of battery technology advancements.\n\n\nI can hope apple delivers first to set the bar high. \n\nBut that's my 2 cents!", "score": 0, "replies": []}]}]}]}, {"body": "The 16GB of space is shit no doubt, but there are far more important things to the screen than resolution... 720p for the size is already at the verge of diminishing/no returns as far as can be perceived by most people's visual acuity... but lower rez improves battery life... and they also have the best screen coatings in the business (improves contrast and visibility in strong light), best screen calibration, high contrast, etc.", "score": 1, "replies": [{"body": "You fail to realize that phones are pretty dank for being used for VR (next gen) as the screen because its cheaper and more intuitive. \n\nPutting a 1080p screen with a VR headset causes magnification of the screen thus pixelation.\n\nApple hasn't even considered vr tech and I'm here playing dank games on my VR headset.\n\nAlso 720p is ideal if you keep your screen the ideal distant away from your face. Many people who have current iPhones and compare them to S6 for example (at least my friends) do notice the text and images are bit more sharper because they don't keep their phone away from their face the recommend distance.  High resolution covers all distances, not just ideal distances set forth by apple. Hell if I kept a 480p screen away at 1 foot it would qualify as retina display.\n\nAnd on the battery, well older iPhones have been power hungry, so I guess keeping the resolution low makes sense for them.  \n\nSource: Have an iPhone 6s for work and s6 edge for personal use.", "score": 1, "replies": [{"body": "Indeed, I haven't considered VR. I wonder though how niche of a market that is.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Look at their last several quarters. Smashing earnings,  shit still drops, just buy puts. Or don't play it", "score": 1, "replies": []}, {"body": "Apple can only make so many thinner and larger ipads and iphones.", "score": 1, "replies": [{"body": "Dance puppets dance. \n\nPeople will always have their iPhone in one hand, and Starbucks in the other. If the iPhone 7 *looks* different than the iPhone 6. It will break records lol. People need the new iPhone because its hip... ANs most only have to pay $299 for it.  ", "score": 2, "replies": [{"body": "Isn't that what people said about Blackberry not so long ago?  \nOH SNAP !", "score": 1, "replies": []}]}]}, {"body": "On your China analysis it's really important to note that Apple are losing share to local manufacturers (I live in Shanghai). Companies like Huawei have really stepped up their smartphone game and this will hurt apple's growth outlook in the region.", "score": 1, "replies": [{"body": "There's no evidence at this time that Apple has lost any share to Huawei or Xiaomi:\nhttp://www.macnn.com/articles/16/01/15/apple.again.wins.benchmarking.test.among.latest.smartphones.132058/\n\nIf anything their share is expanding against those brands.", "score": 2, "replies": [{"body": "\"A new report from a Hong Kong brokerage firm says that despite a somewhat-softer market for smartphones in China in recent quarters, Apple's iPhone has \"a loyal following\" and that half of all users intending to buy a new smartphone said they would by an iPhone in a recent survey.\"\n\nDo you want to know why this is true? It's because Iphones are cheaper in Hong Kong by about 10-15% when compared to the mainland. People actually travel to HK to buy iphones that they then use back in mainland China so ofcourse the HK market is going to look rosey.", "score": 6, "replies": [{"body": "Yeah the Chinese like the iphone simply because it's a status symbol. They think Pabst Blue Ribbon is baller because it gets sold at a high price on the mainland. ", "score": 1, "replies": []}]}, {"body": "looks like a non bias source ", "score": 0, "replies": []}]}, {"body": "Other manufacturers make nice phones, but they're competing for samsung's market share.", "score": 1, "replies": []}]}, {"body": "I didn't read your post but I think Apple is fucked. Apple had its run but now is facing the overproduction issue. Apple has made tons of phones and the market is flooded with them. Newer models are starting to have more and more diminishing returns. Apple saw success over the past decade since it marked an entire population switching onto smartphones. Now that everyone has a smartphone and that older refurbished models are dirt cheap Apple will suffer.", "score": -4, "replies": [{"body": "I don't think that Apple is fucked. The smartphone market is mature and you are right about that. I doubt that we see a truly innovative smart phone for quite some time. That being said Apple is quite well positioned for the future.\n\n* Apple Tv. As the cordcutting movement continues to grow, Apple has positioned itself as a middle man that will allow any TV to instantly become App friendly, that can also integrate a user's iTunes. The App store and iTunes is a $50 billion revenue a year creator for Apple. This will only strengthen that position.\n\n* The future Apple TV. Foxconn has offered to buy out Sharp Electronics in Japan. Everyone knows that Foxconn is Apple's smartphone builder. So if Apple were to start production on an actual TV and not just a box this would make good sense for Foxconn, probably cheaper to buy them than it would be to build a new factory and train new employees on building a TV.\n\nhttp://www.marketwatch.com/story/iphone-maker-foxconn-offers-53-billion-to-buy-sharp-2016-01-20\n\n* Apple Pay. This will be the way that we pay for products in the future with mass integration within the next 5-7 years. Even the CEO of MasterCard doesn't think in 20 years anyone will have a physical card. Apple is set up and well positioned to take advantage of this.\n\n* Car project. Everyone thinks they're building their own electric car. Could be true, IDK. If it isn't then more than likely they are building a car interface system that would be compatible with most cars out there. Again setting themselves up for the future.\n\nThese are just a few items. The honorable mentions would be wearables, healthkit, their movement into the business sector, etc. So yeah Apple isn't fucked, and they will move away from the smartphone market into something else.", "score": 6, "replies": [{"body": "Fucked def wasn't the right word. If you posted your DD on /r/investing it would be fine. But since this is wsb I was under the assumption that you are trying to suggest to use Apple for short term gain...which I disagree with. I think it can hit 90 and stay like that if the market continues to be shit. Going a handful of years and then some on Apple is solid, but I need my cocaine/stripper money now.", "score": 6, "replies": []}, {"body": "no way the tv market saves apple. they have been trying for a decade. no chance. apple pay is nothing. big credit card companies will prevent them from making sizable gains. cars are low margin and they are late to the game. not likely to best the established players. building cars is fucking hard.\n", "score": 1, "replies": []}, {"body": "Apple Pay isn't there yet. Not even close. Car project is still a cost center... it will be many more quarters until that will play a part. Apple TV is having problems scoring partners. Maybe you should hold off a year or four before jumping on if your time horizon is so long.\n\nI do believe that Apple has a decent future. I hold a position in them. I think they built a nice eco system and is vertically integrated unlike many of its competitors. Not sure why they dumped iAd but oh well. I would also like them to expand wearables and iHome or even integrate them.\n\nI think if they focus more on content and publishing, that could be more of a growth for them. As the economy grows and their content providers get enriched, so would apple. ", "score": 1, "replies": []}]}]}, {"body": "apple is fucked. 700 DOLLAR phone is stupid. there is no more subsidizing stupid expensive phone plans so this will hurt sales. there's no innovation left on iphone. they already milked the big screen angle. China is in the toilet. noone can afford it.\n\nleave you with an antedote. friend came on vacation from brasil. ready to upgrade his iphone 4. went to apple store and got sticker shock with exchange rate. noped the fuck out. bought an Android phone. he was pretty die hard apple but his loyalty was tested because money and he chose money.", "score": -4, "replies": [{"body": "Fun Fact:\n\nThe only segment of the population that will consistently keep paying high prices for iPads and iPhones are pilots, because the app that we all buy to get maps on is iOS only.  It's actually a bargain compared to other services or, god forbid, paper maps.\n\nSo don't worry, we'll keep the numbers rolling for Apple, those of us with a pilot's license are a whopping 1% of the worldwide population.", "score": 2, "replies": [{"body": "so you think there's ~ 74 million pilots in the world?\n\nMan, apple is sure going to crush it this quarter then!", "score": 5, "replies": [{"body": "The only thing declining faster than Apple's share price is the number of licensed pilots, sadly.\n\n", "score": 2, "replies": []}]}, {"body": "already priced you guys into my sweet DD ;)", "score": 2, "replies": []}, {"body": "That's not true at all. Lots of airlines use Microsoft Surface Tab as their EFB, this includes Delta, one of the biggest carriers in the U.S.  ", "score": 1, "replies": [{"body": "https://books.google.com/books?id=kIe_BgAAQBAJ&pg=PA52&lpg=PA52&dq=ios+efbs&source=bl&ots=ciwywa3JTl&sig=_5YqTTwg_LTXJ-k7z60gAcnFc-s&hl=en&sa=X&ved=0ahUKEwju1Z610LzKAhXMOyYKHfy5CXoQ6AEINTAF#v=onepage&q=ios%20efbs&f=false\n\niPad was 85% in 2013, if you look at the numbers what it basically boils down to is 10 new airlines started using surface in 2014, while iOS still grew beyond their number of customers from 2013.\n\nJeppesen is the surface provider, and their app is iOS as well, so there are no surface exclusive solutions afaik.", "score": 1, "replies": []}]}]}, {"body": "Apple has been historically expensive. The original iPod was $400 or something. The iPod helped Apple become what it is today. ", "score": 1, "replies": [{"body": "the times they are a changing. the difference? The competition has caught up. Android is mature and pretty slick. The hardware is very nice. There isn't much differentiation anymore. Now it's all about brand and although important, Apple brand won't be enough to demand such high markups. stagnate innovation isn't helping here either.\n\nEdit: also, media and music have dethrones itunes. Now it's spotify and netflix. other streaming services are chipping away. ", "score": 1, "replies": [{"body": "I have both Andriod and iOS and I have to say Android has a long way to go still.\n\nHardware for all phones is fairly the same. They copy each other when they can. Apple does have that force touch thing which could be useful someday.\n\n\nAs for innovation, money doesn't always solve that problem. Maybe thats why they are investing so much in that new spaceship building. Innovation comes from a passion and culture so maybe thats what they will try to cultivate there. Who knows.\n\n\nAnd for price. Apple historically asked for high prices. They won't change that. Value and price is not always the same.", "score": 2, "replies": []}]}]}]}, {"body": "FB will beat estimates on the upcoming earnings release next week, you watch. Come here and upvote me afterwards if correct.", "score": -5, "replies": [{"body": "Wrong thread for this post", "score": 1, "replies": []}]}]}
