{"title": "How do I properly read stock stats like this?", "selftext": "I use Yahoo Finance app on my phone when I'm not near a computer. I'm trying to learn more about the stock market.\n\nIf I see a market cap listed as 180M, I assume that that is 180 million dollars?\n\nI  see Volume as 40.86K. Is that 40,000 shares of total volume making up the whole company or what?  But then that doesn't make sense because right after that is the \"Avg Vol (3m)\" field, which I presume to be average volume over 3  months(?) is 60.90K.  Why is it presented like that? How do I read it and can someone please explain the meaning of them in more detailed terms?", "id": "dnm2fh", "created_utc": 1572135278.0, "score": 46, "upvote_ratio": 0.81, "num_comments": 13, "comments": [{"body": "180m when talking about Market Cap means the company is with 180 million dollars. 18B means 18 Billion dollars. \n\nVolume means how many shares of that stock were traded so far that day. 40k means there was 40 thousand shares traded.\n\nAverage volume(3m)  is the average daily volume over the last 3 months. 60k means that on average there are 60 thousand shares traded each day. \n\nHope that helps", "score": 114, "replies": [{"body": "Helped me!", "score": 12, "replies": []}, {"body": "What if the company is not in the US is the market cap still in $?", "score": 1, "replies": [{"body": "It depends on the listed price it is quoted in. If the price currency is unclear on the ticker, then look for exchange. The exchange country's local currency is it will be listed in. I know of no exchange that lists in multiple currencies.", "score": 1, "replies": []}]}]}, {"body": "https://www.investopedia.com/financial-term-dictionary-4769738\n\nInvestopedia has great articles on basic (and less basic) investing jargon.", "score": 4, "replies": []}, {"body": "That’s the daily traded volume. You can look up total issued shares.", "score": 6, "replies": []}, {"body": "The volume tells you how many exchanges of that stock has happened during a given time, usually the day. If $XY is showing 40k that means 40,000 shares of that stock have been bought or sold that day. If you buy 5,000 and I sell 5,000 in the same day then we add that to the volume shown on the charts and it is now 45k. \n\n(I think)", "score": 3, "replies": [{"body": "Unless he is buying your shares, its 40k + 10k = 50k total volume.", "score": 3, "replies": []}]}, {"body": "Read books", "score": 1, "replies": []}, {"body": "A market cap isn’t so much a cap as a visor- it’s one of those old timey green banker’s visors.\n\nThe 18B or 28M or whatever is the office number of the CEO or their hotel room when they’ve hired a prostitute- have to dig into their SEC filings to see which. Either way that’s where they spend most of their time.\n\nAnd volume is something that we used to adjust on a television when we watched DVDs. Not sure what it’s called on an iPhone now- sound level maybe?", "score": -12, "replies": [{"body": "What did you just mumble?", "score": 1, "replies": []}, {"body": "I had a good laugh, hence an upvote from me.", "score": 1, "replies": []}]}]}
{"title": "Starbucks will be increasing their dividend payout next week, effect on stock price?", "selftext": "So news has been released that Starbucks has almost guaranteed it will be increasing their dividend payout next week\n\nThe firm predicts that Starbucks (SBUX) will boost its quarterly payout by 14% to 41 cents a share, up from 36 cents currently.\n\n“We remain committed to returning $25 billion of shareholder capital by the end of fiscal ‘20 and expect to reach nearly $21 billion by the end of fiscal ‘19,” the company’s chief financial officer, Patrick Grismer, said during an earnings call in July.\n\nWhat does this mean for shareholders and stock price? will we see an increase in the value of equity or potentially some sort of dilution?\n\nI'd love to see some answers on potential short term effects, and if this might relate to anything potentially coming up in earnings.", "id": "dnvykm", "created_utc": 1572194597.0, "score": 23, "upvote_ratio": 0.93, "num_comments": 16, "comments": [{"body": "Raising or lowering dividend has a decent effect on stock price.  An example of this is GE cutting their dividend and the stock plummetting.  In my opinion dividend increase shows confidence and is a good sign for the long term.  Short term, dividend increase has probably already been priced in and won't have a specific impact next week.", "score": 13, "replies": [{"body": ">An example of this is GE cutting their dividend and the stock plummetting.\n\nRaising and lowering dividends are very different signals and the effects can very well be quite different. \n\nLowering a dividend is a company's admission that things aren't going well, so it can't pay what it used to pay. So, lowering the dividend is a very negative signal. So much so that some companies borrow money so they can keep paying the same dividend, hoping for better times in the future. That's one of the reasons reading the financial statements is important. You can notice when the company is paying more than it is making and start thinking about what that means concerning your position.\n\nRaising a dividend is sometimes simply what's expected. If that's the case, then the price should not be affected much since that was probably already priced in. If, however, 6 months ago analysts were saying a company was doing poorly and now the company is doing well enough to raise the dividends, this may surprise people enough to noticeably change the price of a stock.", "score": 7, "replies": []}, {"body": "Any expectations for the earnings report?", "score": 1, "replies": []}]}, {"body": "They could also be planning on returning capital to shareholders by buying back stock.", "score": 3, "replies": [{"body": "Let's hope not. The stock is valued very richly.", "score": 0, "replies": []}]}, {"body": "Dividend announcements, or any announcement for that matter,  will have an effect if it's unexpected.", "score": 2, "replies": []}, {"body": "Dividend increases tend to coincide with upwards trends in the stock price.", "score": 1, "replies": [{"body": "Starbucks stock is already up quite a bit this year, though it's started to come more down to earth lately.", "score": 1, "replies": [{"body": "Yeah, when it hit about $90 I thought it was was over priced. I bought at $60", "score": 1, "replies": []}]}]}, {"body": "At this point it is priced in.\n\nA stronger increase than expected or a buyback program may lift the share price.", "score": 1, "replies": []}, {"body": "Good stock to invest in, millenials will only buy more Starbucks coffee. As they complain how they can't afford anything else.", "score": -6, "replies": [{"body": "Right. Coffee is the problem. Certainly not the fact that minimum wage hasnt followed the cost of life.", "score": 8, "replies": [{"body": "Don’t forget avocado toast. Not the pace of the living wage.", "score": 6, "replies": []}, {"body": "Minimum wage is one thing, median wage growing almost just as slowly is more concerning, imho.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Right. It's the employees fault if the guy that owns the company wants more money in his pockets rather than offering decent living wages. Gotcha.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Personal responsability is a 2 way street. You can't blame your employees for wanting more if you are exactly doing the same thing by giving them less.\n\nAnd if you are going to blame the poor for their living conditions, don't forget to blame the riches for theirs.\n\nIt's not all about how hard you work or how big the risk you're willing to take. The environment in which you grow up, live and work as a lot to say about how you're going to end up.", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "Will Tesla Energy and Storage Prevent Future Outages Next Time? (Credit BBC)", "selftext": "[deleted]", "id": "dnmpg9", "created_utc": 1572138744.0, "score": 55, "upvote_ratio": 0.97, "num_comments": 12, "comments": [{"body": "People don’t realize the degree of poverty in the rural regions of California. We overtook Mississippi as the state with the highest poverty rate last year. Even if solar glass was 100% the most economical roof, most of the regions effected by the outages couldn’t afford the upfront capital necessary to instal solar roofs, much less the power wall needed to disconnect from the grid. 20% of the state is in poverty and 20% is in near poverty. While a good number of these people are in the urban sprawl of LA and the bay, the standard of living in our rural areas is extremely low. The solar glass is in no way shape or form available to the fire prone regions of the state.", "score": 6, "replies": [{"body": "If governments started investing in battery and storage programs it would have an impact. It isn’t just roofs. Tesla is in Zimbabwe with this stuff even. [Zimbabwe Power Project](https://qz.com/africa/1708846/teslas-powerwall-batteries-keeps-zimbabwes-mobile-money-on/) \n\nTesla quietly mention in their Q3 letter that the 3MWh Megapack installations start this quarter for context 477 MWh were deployed in Q3 via smaller packs.  People fear innovation and what they can’t envision.", "score": 3, "replies": [{"body": "Why are you saying it has anything to do with fear? It’s expensive.", "score": 1, "replies": [{"body": "The fear I’m referencing is with the naysayers who don’t see the transformation in front of them while it’s happening. Expensive yes, not for long. Actually Tesla and several others are already installed where this outage is happening.", "score": 1, "replies": []}]}]}, {"body": "Doesn't Tesla offer solar leases to anyone?  That should be especially enticing to people in poverty in power insecure areas.", "score": 1, "replies": [{"body": "But do they include a powerwall leasing option on that? If not, it’s probably still too expensive for people without some capital available.  And without a powerwall, your solar won’t do anything if your inverter is not getting any power from the grid.", "score": 1, "replies": []}]}]}, {"body": "I don't think it would make that much of a difference here. They shut the power off to prevent this kind of stuff because power lines go down. Switching to using storage would help slightly but the real issue is power lines getting knocked from heavy winds, global warming asside. \n\nHaving more battery packs would mean more local storage so maybe less places affected by outages, but it wouldn't affect the power lines.\n\nAlso it would take insane amounts of battery packs to provide for these cities so we wouldn't see that kind of change for years to come.", "score": 4, "replies": [{"body": "I think you should see it as no more cable all around ever. Every single house/building is self sustainable. No need to centralize anything and no need to have cable anywhere. \nSo, no more risk of having fire because of malfunction...\nIt’s definitely semi-realistic, because it’s quite expensive for average people I guess. \n\nI think this is what Elon was referring to, and it’s an awesome future!", "score": 6, "replies": [{"body": "That is the idea, but power distribution can be very advantageous for many reasons. The distribution provides redundancy in times of low energy and in times of high energy the surplus is free energy.", "score": 2, "replies": [{"body": "Having the option of a disconnect when the grid is down is the benefit though.", "score": 1, "replies": []}]}, {"body": "There would still be cables, but a neighbourhood would essentially be a microgrid. Not every house would need solar and battery, they could have neither, both or one. \n\nThe utility company may have its own solar/battery as part of that microgrid, charging from distribution. \n\nDoing this simplifies transmission, reduces the amount of electricity over said line, reducing the cost and allow for maintance without distrupting everything downstream.", "score": 1, "replies": []}]}]}, {"body": "For a day, at best.", "score": 1, "replies": []}]}
{"title": "A director at Tesla made a chart showing the effect of Elon's tweets on stock price and presented it to Elon. Go to 4:36.", "selftext": "", "id": "dnnaa8", "created_utc": 1572141910.0, "score": 12, "upvote_ratio": 0.74, "num_comments": 12, "comments": [{"body": "4:36? Didn't see anything relevant there, edit: nevermind, Ron says it fairly quietly a little after", "score": 5, "replies": []}, {"body": "And?", "score": 3, "replies": [{"body": "I presume this is the reason that the character of his tweets have changed.  It suggests a perminant change, which is an important bit of information when considering how the stock will behave in the future.", "score": 8, "replies": [{"body": "I.e. Robyn Denholm brought up this example to demonstrate how Elon changed his tweeting behavior based on feedback and data.\n\nThis is consistent with decades of anecdotes from ex SpaceX and Tesla employees (with no axe to grind): Elon can be super stubborn when he thinks he is right, but he ***will*** change his mind when confronted with contrary data and logic, and he *will* re-orient the company in the blink of an eye.\n\nRecent prominent examples were how Starship was moved from a carbon fiber design to a stainless steel design, or how Elon's Tesla \"online only\" sales and service experience decision in early 2019 was largely reversed by Jerome Guillen.\n\nBTW., I love how Robyn Denholm handled this hostile interview where CNBC anchors tried to ambush her into saying something undiplomatic: unfazed matriarchal passive-aggressive responses to jerk questions FTW. She should get more airtime.", "score": 12, "replies": [{"body": "Agree with all, except I think it was Ron Barron who gave the example in the video.  I was honestly a bit disappointed with Robyn's answer, which was to say that the way Elon runs the company is phenomenal, \"in all aspects\".  For me this answer was too political; not genuine.", "score": 3, "replies": [{"body": "> I was honestly a bit disappointed with Robyn's answer, which was to say that the way Elon runs the company is phenomenal, \"in all aspects\". \n\nSorry, but I think that was the only correct answer, given the hostile audience, plus she might also have meant it.\n\nI do actually share her opinion - but then again I'm a Tesla fanboy. 🤠", "score": 1, "replies": [{"body": "Fair enough  : )", "score": 2, "replies": []}]}]}, {"body": "That bit about Jerome being the catalyst or champion for the online sales reversal is very interesting. Where did you get that?", "score": 1, "replies": []}]}]}]}, {"body": "It would be nice to see the chart", "score": 2, "replies": [{"body": "Agreed.  I was thinking about making such a chart myself at one point.  Must have been quite a bit of work.", "score": 1, "replies": []}]}, {"body": "I believe in the unsworth court documents Elon references not wanting to apologize just because the stock went down. I am fairly certain he considers and is sensitive to the stock price and his behavior.\n\nUs mere mortals sometimes wonder just how different celebrities are, and the truth is they aren't much different.", "score": 2, "replies": []}]}
{"title": "Will China be first in allowing robotaxi service for Tesla?", "selftext": "Who thinks when we have FSD China cuts through red tape and green lights Tesla to launch robotaxis before US states? \n\nMy take is that once FSD is at a place where Tesla is about to hit the “don’t have to pay attention” phase China will approve regulations very very quickly. While the first US states may face some backlash and bureaucracy that would make the US robotaxi roll out months behind China.", "id": "dnurm9", "created_utc": 1572189684.0, "score": 8, "upvote_ratio": 0.79, "num_comments": 10, "comments": [{"body": "Have you driven in China before? Road rules are optional which doesn't make for the easiest autonomous driving environment. I feel like certain states in USA will be first, followed by China and SE Asia and lastly EU because they are hopelessly lagging in regulatory framework.", "score": 8, "replies": [{"body": "CA first, followed by AZ :D .", "score": 1, "replies": []}]}, {"body": "The regulation is currently in place in Florida. It could someday get overruled by the US Govt., but for now the only thing stopping it in Florida is the tech.\n\nFor those not overly familiar with the USA, Florida by itself is the size of about three smaller European countries (in population).", "score": 6, "replies": [{"body": "I wish you used the international units in USA instead of “inches”, “feet”, “cups”, “stones”, “small European country” etc. /s\n\nThe Florida population is 21M.", "score": 2, "replies": [{"body": "Hah. In Texas, they joke about measuring the size of ranches in “Rhode Islands”. (1,212 square miles or about 1/10 the size of Belgium)\n\nEdit: woah, just learned that Luxembourg is actually smaller than RI...I would have guessed a little bit bigger.", "score": 2, "replies": []}]}]}, {"body": "Federal approval is harder. State is much easier. Having said that, it's possible china beat it to the punch. They do seem to have more appetite for this.", "score": 1, "replies": []}, {"body": "They are welcome to roll it out in many states today. In fact waymo is already doing driverless robotaxi rides, with no safety driver, in limited geographic areas Arizona and California.", "score": 0, "replies": [{"body": "> with no safety driver\n\nHas this been confirmed by any actual people? Like has anyone ordered a waymo and there was no driver in the car?", "score": 4, "replies": [{"body": "If they have it would be all over the internet and the video would be pretty easy to find. People would be all \"OMFG Holy shit, no driver! Need to post this on the internets!!\"\n\nTyping in \"Waymo no driver\" into Google just brings up a bunch of videos from Waymo, the Verge etc. No legit videos on the first page so I'm gonna call bullshit.", "score": 1, "replies": []}]}, {"body": "I see Waymo driving people around in SF with an safety driver behind the wheel too. I look forward to Tesla’s approach and I hope the AI learns quickly. Then they can catch up to city street driving and pass the competitors.", "score": 1, "replies": []}]}]}
{"title": "Vincent: First batch of the Made in China Tesla Model 3 from Shanghai Gigafactory GF3 Oct 27th 2019", "selftext": "", "id": "dnvi0p", "created_utc": 1572192682.0, "score": 63, "upvote_ratio": 0.96, "num_comments": 13, "comments": [{"body": "With all the drones out there, I hope someone keeps a running total of 'production'. It's about time retail investors had anywhere near the resources of hedge funds.", "score": 16, "replies": [{"body": "If it makes you feel any better it doesn’t really matter.\n\nLast quarter Tesla missed its projections but it’s profits were far higher than expected.\n\nTry not to ruminate over it.", "score": 11, "replies": []}]}, {"body": "What are these car wracks doing in this muddy field? \n\nobligatory /s", "score": 7, "replies": [{"body": "They appear to be Model 3s gathering dust in a parking lot very far away from Fremont.\n\nEdit: I guess I have to add /s. For those unaware, TESLAQ had some people claiming to be tracking Model 3s “visibly gathering dust” in remote parking lots hidden away from the public because there was no demand for them and Tesla was fraudulently claiming to be selling them.\n\nSane people pointed out the parking lots were distribution holding lots and the cars did not stay there long. Hence, this is a joke poking fun at TESLAQ, which I know we are not supposed to do, really. But I was replying to someone making a TESLAQ muddy field reference...", "score": 2, "replies": [{"body": "Gathering dust? They are one day old! 💚", "score": 1, "replies": [{"body": "You are not aware of TESLAQ’s old claims, are you? The length of time they have been there is part of the joke.", "score": 2, "replies": [{"body": "Pwned!", "score": 2, "replies": []}]}]}]}]}, {"body": "You'd think they could at least sell a dozen cars. No demand. /s", "score": 3, "replies": []}, {"body": "Are they currently making the battery packs in China, or are they shipping those in from the US for the trial production vehicles?", "score": 2, "replies": [{"body": "Probably shipped in unless they have somehow (on-site or at one of the battery supplier facilities) created a local setup for small volume. Musk on the earnings call mentioned the Phase 2 building that is under construction will be for battery and module production. I have assumed he left off the battery pack when talking about the new building, but it is possible that they are shipping in modules and there is pack assembly inside Phase 1. \n\nRemember, volume production at Gig3 is a few months away. (As stated in earnings call, anyway.)", "score": 5, "replies": []}]}, {"body": "Since then have lots of space and are making new buildings, why leave the new cars outside.", "score": 1, "replies": [{"body": "They probably test drive them and stuff", "score": 2, "replies": []}, {"body": "They fear the batteries could start fire 🔥 /s", "score": 2, "replies": []}]}]}
{"title": "Confused rn", "selftext": "[deleted]", "id": "dnodtg", "created_utc": 1572148404.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "Dude options are simple.\n\nIf your balance goes up, tendies for lyfe \n\nIf it goes down, long $ROPE", "score": 15, "replies": []}, {"body": "Buddy, this isn’t the place for you to be asking these questions. Go to any investing or options page.", "score": 15, "replies": []}, {"body": "Nobody tell him", "score": 12, "replies": []}, {"body": "Sir, this is a wallstreetbets. r/options is that way.", "score": 5, "replies": []}, {"body": "Yes.", "score": 4, "replies": []}, {"body": "Of course", "score": 4, "replies": []}, {"body": "Optionsprofitcalculator.com", "score": 1, "replies": []}, {"body": "Dude, most people on this sub cant’t do elementary math, let alone read. We only post pictures of gain or loss charts we can’t understand. Unfortunately I too can’t read. Try r/gambling", "score": 1, "replies": []}, {"body": "Dear god, I won't ever get the time I spent reading this back. You're not selling to open, assignment is not possible when you're buying to open.", "score": 1, "replies": []}, {"body": "I had the same questions as you 3 months ago, but this is not really the place to get answers. Even if somebody does explain it it's much better to use something like investopedia to research, so you can really understand how this stuff works\n\nTo answer your main question, you just buy and sell the contract as if it were a stock. Option goes up in price, you sell and profit, and that's the last you have to worry about that specific contract. You don't have to worry about it being exercised or anything, that's for the big dogs to worry about. Robinhood will never let you buy something that'll make you risk more than you have. If the option is about to expire ITM Robinhood will sell it for you", "score": -1, "replies": [{"body": "well there was the case of u/1ronyman ......", "score": 3, "replies": []}]}]}
{"title": "Kohl’s is Amazon with", "selftext": "Kohl’s is accepting Amazon returns and it’s getting younger customers in store. Hedge funds are noticing. Won’t show in earnings for a while since it was implemented this spring but apparently it’s working.\n\nAnyone following them? CEO is sharp, P/E and P/B suggest it’s a value buy.", "id": "dnoy6l", "created_utc": 1572151980.0, "score": 4, "upvote_ratio": 0.59, "num_comments": 18, "comments": [{"body": "Dude they have been doing this. And puts on last ER made money.", "score": 4, "replies": [{"body": "Yep they have been doing the Amazon returns for at least a year or two now", "score": 3, "replies": []}, {"body": "I don’t have any money in yet- what’s your logic for being short?", "score": 2, "replies": [{"body": "It's retail poor guidance.", "score": 1, "replies": []}]}, {"body": "I mean buy calls so my puts do better", "score": 1, "replies": []}]}, {"body": "Kohl's is pretty desperate if their business model is to handle another company's trash.\n\nThat said I've been watching this also, they are changing their business model.\n\n$JCP is on my watch list, they are at a point where strong corporate boot in the ass is in order and seem to be shaking up the leadership strategy.\n\nRetail in general is taking a beating from Amazon. Advertising/showcasing revenue is becoming more profitable than sales. With higher competition in online market, it will take a marginal listing rate cut from Amazon to send retail plummeting. Cheap shit that's more expensive to ship than its worth and groceries are about the only things that are sustainable profits in this market.\n\n\nEdit: I am not long or short on $JCP it's just on my watchlist pending corporate action. I invest in displacement, not direction. Personally I think they are fucked in 2 years max because leadership has no balls literally... but I dont let personal views influence my financial positions at least not consciously", "score": 4, "replies": [{"body": "Fair take. I haven’t taken a position on Kohl’s, and agreed per the desperation and cheap shit- that’s why I was long DG until their P/B hit correction warranted levels.\n\nRegardless, Kohl’s books are decent. Part of me wants to gamble since stock is on an upswing and next ER is in a few days, so we could see a pop in the stock price. But also could see a drop, I’ll probably hold off and put more money in CENT.", "score": 1, "replies": [{"body": "'Statistically' it pays to play earnings. Especially if a pretty picture with a storyline can be painted in .pptx", "score": 1, "replies": []}]}]}, {"body": "Whats dumb IMO is the return counter, at least in 2 Kohls near me, are right up front at entrance.  At least make people walk through store like when I need milk at grocery store.", "score": 2, "replies": [{"body": "Some are in back, but yeah, agreed", "score": 1, "replies": []}, {"body": "The Kohl's near me, moved the return counter from the back to the front, just this past month.  Obviously Kohl's isn't thinking/caring about this.", "score": 1, "replies": []}]}, {"body": "also Kohl's said it would lease out space to Planet Fitness next to 10 of its stores in 2019. If the experiment takes off, Kohl's could expand the partnership to more locations.", "score": 1, "replies": [{"body": "So they’ll make more As a REIT!", "score": 1, "replies": []}]}, {"body": "I had the same idea. I actually went to my local Kohl’s to return an Amazon item and talking to the workers they claim to get a lot of foot traffic just from the returns. Thanks for posting. I was starting to believe I was crazy for thinking this was a good trade. I’m buying some calls for after their holiday season ER", "score": 1, "replies": [{"body": "It’s a great idea. I’ve been returning my amazon purchases to lots of stores for years, now I can do it legally.", "score": 6, "replies": []}, {"body": "Did this myself yesterday.   Witnessed myself and the other 6 people in the returns line exit immediately as well.  That Hilfiger polo and Hagger slacks almost pulled me back in though.  It’s like a shitty Nordstrom Rack.", "score": 1, "replies": []}]}, {"body": "So Kohl’s is going down with amazon’s ship? Will Bezos ever stop dragging down fruitful companies?", "score": -4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Maybe Space X can build rockets that run on burning clothing.", "score": 1, "replies": []}]}]}]}
{"title": "TSLA DD", "selftext": "Trashed currently. My buddy invited me to hang out with 2 strippers but their friend coupled with our extra chromosomes cockblocked us so we’re hanging out alone in the parking lot with no ubers in area. There are 2 Tesla’s in the parking lot of the line dancing bar in the middle of nowhere we ended up at. Now this could be a coincidence, but all of the ashtrays at the bar are also red. There are 2 ashtrays outside, and two Tesla’s. Both symbols of the company. Now if we multiply these by 100 we get 400. Could it be that Elon is sending me a message that TSLA will hit 400 by 11/1? All in calls. Take it to expiration.", "id": "dnpfvo", "created_utc": 1572155375.0, "score": 40, "upvote_ratio": 0.69, "num_comments": 17, "comments": [{"body": "Go to bed", "score": 58, "replies": [{"body": "No dad", "score": 11, "replies": []}]}, {"body": "I honestly wanted to see this as good drunk DD, but this is just some dumb ass try hard bullshit.", "score": 33, "replies": []}, {"body": "340 end of week also production in china started and truck reveal very soon", "score": 10, "replies": [{"body": "Is it too late to FOMO into this bitch?  Think there will be a dip before the march up?", "score": 3, "replies": [{"body": "FOMO away. Just buy more if it dips.", "score": 2, "replies": []}]}, {"body": "Also solar roofs", "score": 1, "replies": []}]}, {"body": "Fuck, I was so bullish $TSLA going into next week, but the current sentiment of WSB is bringing me down.", "score": 6, "replies": []}, {"body": "Not 420 so inversing", "score": 4, "replies": []}, {"body": "This makes about as much sense as most Telsa price movements.", "score": 3, "replies": []}, {"body": "I opened up pornhub, and I saw a video of a dude and a girl doing it while Tesla was on auto pilot and it had couple million views. TESLA $690 inc", "score": 3, "replies": []}, {"body": "I think this post is going to be well received by the community", "score": 9, "replies": []}, {"body": "69% upvoted rn", "score": 2, "replies": []}, {"body": "If the ashtrays are red, shouldn't we be buying puts?", "score": 2, "replies": []}, {"body": "solid DD work here", "score": 2, "replies": []}, {"body": "There should be a flair for shitfaced post", "score": 1, "replies": []}, {"body": "I don’t see a pull back happening anytime soon. I sold my 300p 11/1 already. Losses happen.", "score": 0, "replies": []}]}
{"title": "BYND... I know, beating the dead horse on this topic", "selftext": "Can anyone tell me when MCD and other companies completely divested from CMG after lockup expiry? I'm trying to figure our how badly companies tank when lockups expire for additional BYND put play. Trying to figure out why CMG tanked in 12/2007...\n\nLooks like Privateer Holding controlled \\~77% of TLRY share before lockup expired. Privateer released shares SLOWLY overtime to get to our current IPO price point of TLRY. It looks like there was maybe a 25% drop in the stock price after lockup expiry, but this took approximately 3 months.\n\nI am using GPRO as an example of an overvalued company... similar to BYND IMHO. People say BYND is a disruptor like TSLA, but I think that is completely BS. I think when companies like Tyson start getting serious, the BYND market will be cornered to those who hate big corporations and want 100% plant based burger (companies like Tyson are using eggs as one of their ingredients so this will scare away the vegans).  Furtheremore, large companies will have the infrastucture to make product a lot cheaper. Unlike the TSLA consumer base, my guess is that the number of BYND consumer base (corporate haters and vegans) are far less.\n\n&#x200B;\n\nI feel like I am trying to reason myself to buying more long puts, which probably means I shouldn't.......\n\nSomeone please argue against me! Also, answer my MCD question.", "id": "dnrrss", "created_utc": 1572173666.0, "score": 8, "upvote_ratio": 0.75, "num_comments": 16, "comments": [{"body": "I think that BYND puts are so obvious, that Mr. market is gonna fuck you all real good", "score": 14, "replies": [{"body": "Samesies 😕\n\nI think they will announce PLT went well, and moar partnerships 🍀🥩🤝🤡🌮\n\nAnd didn’t they actually turn profit last ER or mention they are on the precipice❔", "score": 4, "replies": []}, {"body": "I think so too. If not a major pump, a dreadfully slow decline which will not hit the breakeven point for a lot of people. Theta creeps in good on top of this.", "score": 3, "replies": [{"body": "I would have gone with a bearish play if it weren’t for them moving the lockup period. They moved the lockup period right up to earnings, so I’m guessing they could pump it, and lockup’s could jump out a higher price. Bringing the decline from the end of lockout periods to a break even point from prior to earnings.", "score": 2, "replies": []}]}, {"body": "Think they’re gonna be good but I’m not touching them until after earnings", "score": 1, "replies": []}]}, {"body": "I'm ordering calls Monday.", "score": 4, "replies": [{"body": " Hi ordering, I'm Dad!", "score": 3, "replies": []}]}, {"body": "The easy tank in Beyond Meat already happened. There will be an orchestrated squeeze unless the ER is absolutely awful, allowing insiders and anyone else holding this overpriced vegetable to sell into strength. It's lost 40%+ in a month. It'll be propped up at the very least to let every large institutional holder out and then they will pull the rug and the slow bleed will commence.\n\nNow, if the earnings are good then really watch out.", "score": 3, "replies": []}, {"body": "Thinking about buying Nov 1 125 c. Might push it out a week depending on conditions Monday. Just a bet against all the obvious put hype", "score": 2, "replies": []}, {"body": "Options are insanely expensive for this stock its not even worth playing it", "score": 2, "replies": []}, {"body": "So.... you know how large fast food companies employ \"food scientists\" to come up with new \"food ideas\" in a never ending cycle of stage-phased offerings?\n\nWhat you're really looking at is a cross of when returns seeking finally runs into the wall of fake-meat novelty product offering exhaustion as entertained by the fast food sector.\n\nI mean, they could be the Tesla of meat, but I'm just not seeing long term viability.  More probably, they're going to be subject to long-tail \"plastic straw outrage\" fade-out.", "score": 2, "replies": [{"body": "Try to find anyone who buys this shit a second time after \"I wanted to see what it was like\" and then they realize literally everything else on the menu is substantially better. My GF and I have tried this bullshit at 3 different places and now we don't  waste our money. If I wanted super salty but lacking any other seasoning bullshit patties with the consistency of cat food under a heat lamp for 12 hours I will just diarrhea in my own mouth for free.", "score": 2, "replies": []}]}, {"body": "I believe Mcd was completely divested from cmg by 2006. Let us know what you find.", "score": 1, "replies": []}, {"body": "CAlls.. all the way.", "score": 1, "replies": []}, {"body": "How about straddle atm expires in Jan? Good idea or bad move", "score": 1, "replies": [{"body": "This shit is too volatile... Pretty much a gamble.", "score": 1, "replies": []}]}]}
{"title": "$AMD strangle play", "selftext": "$AMD has been known to be very volatile following earnings report, especially with the whole JEDI contract adding to the confusion. Could a strangle play be the move? I’m thinking OTM calls and puts at $33.5 and $32 respectively. Thoughts?\n\nThe last post was some wack live shit. This is revised.", "id": "dnz1fh", "created_utc": 1572209173.0, "score": 15, "upvote_ratio": 0.86, "num_comments": 18, "comments": [{"body": "Buy calls. To do anything else would be to commit heresy against Mama Su.", "score": 22, "replies": [{"body": "In Su we trust 🙏", "score": 8, "replies": []}]}, {"body": "Buying calls. 10% movement up. Get money", "score": 9, "replies": [{"body": "You think there's a chance it goes down though?", "score": 2, "replies": [{"body": "I mean there is always a chance. Imo they have set themselves up for a good earnings beat. I bought some 32$ calls last week expiring Friday. Tomorrow I'll gobble up some 34$ calls and sell after the earnings report on market open. Just think there is a better chance of up than down.", "score": 5, "replies": []}]}, {"body": "Holding calls for earning?", "score": 2, "replies": []}]}, {"body": "AMD 420 call Nov 1", "score": 5, "replies": []}, {"body": "Listen to me as I'm autistic too:\nSo AWS (Amazon) uses shit Intel servers, MSFT news surface laptop uses AMD but only uses Intel for Enterprise, so MSFT could be using AMD but could be using old Intel but AMD cheaper honestly you're autistic and retarded by using a non-directional strategy just hearing that you're not all in on calls is disgusting thinking stonks could go down in this rally, trust me I sell calls alot of times and stonks only go up!! F me thank me for my sacrifice thank you bear gang for bend me over good time for good price!", "score": 8, "replies": []}, {"body": "Joe Mama", "score": 4, "replies": []}, {"body": "I went with a 36 call and a 29.5 put just to play it safe", "score": 2, "replies": []}, {"body": "That is what I am thinking as well. I am going to buy them farther out around the end of November. This thing will go nuts. btw buy your calls early tuesday for the earning run up then buy the puts at the eod.", "score": 1, "replies": [{"body": "Why would you buy early Tuesday vs early Monday? IV is only going to go up Monday vs Tuesday", "score": 1, "replies": []}]}, {"body": "Hard to say.  Both sides carry a hefty premium at this point and earnings expectations are high.", "score": 1, "replies": []}, {"body": "Gonna get IV crushed", "score": 1, "replies": []}, {"body": "Maybe it works, but look at past earnings weeks. IV dropped between 10-25 points the day after reporting so you’ll need a big move to offset that. It’s an exciting play but not a smart play", "score": 1, "replies": []}, {"body": "Ouch", "score": 1, "replies": []}, {"body": "I have a 32.50 put and a 33.00 call.  I'm just gonna try and go positive on both of em sometime this week and load up on calls the day before earnings", "score": 1, "replies": []}, {"body": "That's a 87.28% chance of failure by expiration. Go to the casino instead", "score": 0, "replies": []}]}
