{"title": "QQQ to 195 by December?", "selftext": "Lots of headwinds such as\n\nRecession in Europe\n\nHotter than expected cpi report in September which will cause the fed to raise rates by 250 bps by year end\n\nQT which will drain liquidity \n\nHorrible earnings in October \n\nHousing slowing down significantly \n\nWeaker consumer\n\nLook at how horrible of a sell off it was on Friday, don’t think that was the end, it’s just the beginning of the carnage to come\n\n195 puts are right now $105 a contract\n\nI’m buying $6000 worth", "id": "wzldn6", "created_utc": 1661657438.0, "score": 91, "upvote_ratio": 0.75, "num_comments": 124, "comments": [{"body": "You are, cumulatively, losing $141 dollars a day off theta decay\n\nYou have <1% probability of profit. \n\nYou are shorting 178 shares of QQQ, theoretically, but your making 3 cents off the dollar per contract.\n\nNot to mention, you are gambling that all your reasons happen. Most of those are binary events that are out of everyone’s control.\n\nI swear Friday gave all these people bear hysteria where they all think we are going to free fall to new lows over Jerome Powell saying there could be more pain. \n\n\nYou could have bought an ITM put in December at 366 strike for 6k. \n\nYou would only lose a dollar and some change a day off theta. \n\nHave a 54% POP\n\nShorting theoretically 95 shares and make 95 cents off a dollar move\n\nYou bought the 100 billion lotto ticket instead. Nothing but good luck to you lol", "score": 240, "replies": [{"body": "Exactly… I’ll sell OP these options!", "score": 40, "replies": [{"body": "No, me!", "score": 6, "replies": []}]}, {"body": "if he's right the implied volatility will change to bear market mode pretty much, making up for theta.", "score": 20, "replies": [{"body": "Briefly, IV could go up more but we will bounce off resistance levels on the way down and that can crush this position.", "score": 8, "replies": [{"body": "i agree, but this goes for any put position. \n\nor you need to go into deep itm territory, but he will not be able to reach the delta multiplier he's looking for. At least not with 6k.", "score": 3, "replies": [{"body": "It does but it’s far worse with super low deltas like this.\n\n\n\n\nThese wiii be worth $30 in no time, a 6000$ bet into SQQQ next week could do far better.", "score": 5, "replies": [{"body": "oh its a risky bet for sure. \n\nbut these puts went up 44% on friday, honestly that surprised me a lil bit. Thought they would have moved slower.", "score": 1, "replies": [{"body": "OTM moves big on big moves, the lower the contract value the more % it can realistically move. \n\nI played the long dated 200q puts a while back on the last Q dip - first leg or second down they peaked, despite qqq going much lower. \n\nI’d only touch those options if they were below $50 a contract now, personally.", "score": 3, "replies": [{"body": "Is this OP? https://twitter.com/joshuajammes/status/1563623347652534272?s=21&t=h-psMLqw2Aw4ZaHRLpNeiw", "score": 1, "replies": [{"body": "So he conviently ignores their calls or perhaps they don't have any calls at all lol", "score": 1, "replies": [{"body": "Either way it’s big money", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You won't see a crazy increase in IV on an index product, unless there is another standard deviation move downwards. At this point, he probably will be laughing at us to the bank.\n\nIf it was to increase, so would the theta, as there is more extrinsic value on the contract. There would be an increase in his theta loss.\n\nThe IV expansion wouldn't dent his theta decay. Directionally correct will though", "score": 4, "replies": [{"body": "If volatility is to increase, yes there would be an increase in theta loss, AFTER it has gained value. Simply because a larger part of the option's value consists of expectation. But does that matter? He will be up on the position still, with months to go. \n\nYour statement is a bit contradictory.", "score": 2, "replies": [{"body": "The value is insignificant. He is getting 3 cents off the dollar, especially since he is most likely intending to hold it for awhile. If the NQ drops 1.5% - 2% on Monday. He might go to a .04 delta and make a profit. He bought this because of the lists above. He's convinced it will does those things which are weeks to a month out. \n\nIV doesn't move far OTM options more than your ATM options as much as you think they do. Top of that, he paid for for a 47% IV on his option versus the IV range of December of 32%.", "score": 2, "replies": []}]}]}, {"body": "Yeah wait till the vix goes above 45 after how bad earnings come in the end of october", "score": -13, "replies": [{"body": "!RemindMe 2 months", "score": 14, "replies": []}, {"body": "i don't think were gonna make it until earnings season.\n\ntoo much geopolitical stuff going on.\n\nadd the current and upcoming fed policies. balance sheet reduction, increasing hikes.\n\ni mean Powell quoted Volcker of all people... do we need any more obvious signs?", "score": -4, "replies": []}]}]}, {"body": "What do you use to calculate probability of profit? Genuine question.", "score": 2, "replies": [{"body": "Some platforms have this built in.  Example from Tastyworks:\n\n[https://support.tastyworks.com/support/solutions/articles/43000530527-probability-of-profit-pop-epop](https://support.tastyworks.com/support/solutions/articles/43000530527-probability-of-profit-pop-epop)\n\nThinkorswim also has \"Probability Analysis\" in the Analyze tab.  You could use your breakeven value for this - it shows a 1.26% of being below 193.95 (195 - 1.05) on December 16th.  \n\nNote that these are estimates based on a platform's selected volatility model.  Not a guarantee.", "score": 4, "replies": [{"body": "Thank you!!", "score": 1, "replies": []}]}]}, {"body": "This guy options", "score": 2, "replies": []}, {"body": "Lol you’ve taken a proper shit on op with these accurate points!", "score": 1, "replies": []}, {"body": "Fuck his luck lol, I’m balls deep in TQQQ", "score": 1, "replies": []}]}, {"body": "Instead of doing this with your broker, I'll take the other side of the trade and we can skip the commissions", "score": 43, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Wouldn’t it make more sense to just bet on Vix increasing since this scenario would call for vix 30+?", "score": 3, "replies": []}]}, {"body": "Unlikely event, and I’m bearish too. \n\nYou’ll start to see iv crush as soon as q meets resistance on the way down. These contracts can easily be down 30% next week. \n\nThe only way to play far otm like this is to sell on the way up. If you see these contacts at 2x it’d be smart to sell half of them and ride the trade for free. \n\nHolding to expiration is dead money or a gamble on a black swan which may not be bad enoug for 195. Not simply a bear market. All those things you mentioned - everybody knows. The market too. We’re not going to crash because of a recession it’ll be a long slow sell off.\n\nSay qqq it breaks 200, it doesn’t have that much downside left. Buyers will come back out not long after that. Your 195s could still get crushed. \n\nBetter to pick an otm strike near resistance like 270 if you think it’ll break and then you can really be green.", "score": 17, "replies": []}, {"body": "You’re a retard. I will gladly sell you the puts.", "score": 46, "replies": [{"body": "You could probably sell all you want for between 1.00 and 1.04.  I would suggest there are better opportunities than about 0.5% return on risk for a 3.5 months hold time.  Granted, I still wouldn't buy them...", "score": 3, "replies": [{"body": "0.5% return on risk is so low because the chance of profit is so high. So they’re definitely not worth buying either unless you were hedging for doomsday basically", "score": 2, "replies": [{"body": "Yes I know- that's why I said I wouldn't buy them 😀", "score": 2, "replies": []}]}]}, {"body": "How many are you short? U don't need OP involved if it's such a good bet just sell them to anyone", "score": 1, "replies": [{"body": "/u/2664647 was joking to make their point. No one trading standardized CBOE options can trade with a specific person. Everyone trades with the Options Clearing Corporation, which matches writes to purchases, acting as a central counterparty. The only way to know your counterparty is to negotiate an options contract over the counter with a banker.", "score": 3, "replies": []}]}]}, {"body": "Dude just threw away 6 grand", "score": 9, "replies": []}, {"body": "Goodness", "score": 27, "replies": [{"body": "They're bold, I'll give them that....\n\nQQQ is down 24% currently YTD. To hit 195 would require another 36% decline from current levels LOL. OP Please tell me you don't expect those options to be ITM at any point.\n\nI suppose if you buy the puts far enough out you might make some money if you sell them in the next month or so (assuming the market continues down).", "score": 28, "replies": [{"body": "I think he’s prob wanting to sell the increased contract price due to increased volatility, not so much it going ITM", "score": 7, "replies": [{"body": "yeah for sure. people who hold til exp have a lot of discipline. \n\n\n\ni love buying otm puts for IV expansions plays at least. this is too far otm for me but like even something like spy 300 monthlies can get you a good 40% in a couple days", "score": 1, "replies": []}]}, {"body": "60% total drop by December? Not. Chance...", "score": 1, "replies": []}]}]}, {"body": "I seriously doubt a .03 delta strike is going to go in the money. What's your exit plan?", "score": 18, "replies": [{"body": "it doesn't have to be in the money to make money.", "score": 2, "replies": []}, {"body": "I will cut if my thesis changes, right now I cannot find any reason why the market should go higher, the only way is DOWN", "score": -16, "replies": [{"body": "I agree with the thesis. I'm selling credit spreads or just cash secured puts. Going long is kind of a crap shoot, especially far otm.", "score": 7, "replies": [{"body": "Just go look at back when NQ rallied to nearly 15000 to then drop to 11000 , and now it rallied to 13750 and if history rhymes then a drop to 9000 is coming", "score": 0, "replies": [{"body": "So are you going for 100% profit or what number is your goal? Curious to follow this :)", "score": 2, "replies": [{"body": "I would say 50% profit is good enough, but I know I will sell early at around 25% since my fingers get trigger happy to press the sell button", "score": 7, "replies": [{"body": "As someone whos been averaging down on the 200p's since late June - this will get ugly if the market doesn't keep dropping hard.  Even on flat days my contracts drop 5 bucks with all the bullish sentiment.  I'm at a $200/contract average and Friday was nice!  Not gonna lie I'm probably going to sell Monday even at a small loss and roll this out and up.  Your thesis is not wrong but these markets are and can stay irrational for years.", "score": 6, "replies": []}, {"body": "Smart.", "score": 3, "replies": []}, {"body": "only a 50% profit on options?\n\nfor options thats aiming low.\n\njust ride it out.", "score": -4, "replies": []}]}]}]}]}, {"body": "Your thesis doesn’t explain why you’re buying 195s? That’s a good way to lose all your money even when the market does go down.", "score": 3, "replies": []}]}]}, {"body": "I don't disagree with your thesis about headwinds, but you overestimate how quickly we'll see fresh bottoms in the market and underestimate how quickly theta will kill your position. VIX at elevated levels makes being long any option more expensive. \n\nIf you think the market will tank by Dec, buy a put spread closer ITM so you have a higher chance of hitting; and a spread so you offset some of the upfront cost. Long 280p; short 250p. Something like that.", "score": 11, "replies": [{"body": "I mean think about it, the 2nd half of the year is actually looking more worse than the 1st half\n\nEurope is in full on recession, Ukraine vs Russia is not going to end anytime soon\n\nChina economy is coming to a collapse\n\nReal QT is going to begin, and powell is going to go volcker style\n\nI just don’t know how anyone can be long? Plus most companies have bad or no guidance going further \n\nThis is bad all around, and also emerging countries are collapsing due to the rise of a strong dollar, so they have to debase their currencies even more to stay competitive resulting in a possible global stagflation", "score": -8, "replies": [{"body": "These are all valid points.. but have you considered counter-points to your stance? I'm a bit lazy to list them, but plenty of people explained away why all the bad stuff you listed is already priced in or is not as impactful, justifying the recent bull run. Just give it some honest thought, at the very least, it should make you doubt your stance a bit.\n\nMarkets went full bear due to FED speech. Before that, markets seemed pretty optimistic. Everything you listed was still out there, but had a way milder impact than the FED's not even that super surprising rate hike threats. So unless the FED's agressive rate hikes are somehow gonna blow up the markets, I think we are in for a mild downswing at worst.\n\nTime will tell. You're betting on the apocalypse basically, which is definitely in the cards, but it's priced at a 1% chance for a reason.", "score": 14, "replies": []}, {"body": "The market doesn’t care about your outlook.  We going back to ATH end of year", "score": 6, "replies": []}, {"body": "It’s very possible. But you’re basically buying a lotto ticket at $195 puts.", "score": 1, "replies": []}, {"body": "I’ll happily sell you those 195s", "score": 1, "replies": []}]}]}, {"body": "My greatest losses from option were a result of letting my sentiment lead me to take ridiculously low-probability positions such as the one you present. And I have a high tolerance for risk in equities. \n\nI'm very bearish now, too, but I closed all of my highly leveraged short portions prior to close Friday while up $30k for the day. These contracts had a lot of room to run being weeks to months from expiration, but I anticipate QQQ whipsawing, including brief rallies on the way down. It's not all about the delta.\n\nI'm holding SQQQ and other -3X ETFs and selling covered calls until the September Fed rate announcement.", "score": 6, "replies": [{"body": "Whats the benefit of sqqq over puts? Honest question", "score": 2, "replies": [{"body": "No expiration, intrinsic value, and because of the way leveraged and inverse etfs work, the change in price will be much different than options. I would consider looking into the way daily rebalancing/pricing works versus the underlying. If QQQ goes down 10% in a month that does not equate to SQQQ going up 30% over the same time, could be more or less.\n\nMy understanding, though, is that if rallies on the way down are expected, SQQQ would do worse than puts, so the primary benefit is lack of expiration and intrinsic value paid up front.", "score": 1, "replies": []}]}]}, {"body": "If you look at the 20y chart. QQQ is considered undervalued at 280. Idk how anyone could time a dip below 280 without insider knowledge.", "score": 14, "replies": [{"body": "How are you arriving at that? Linear regression line, 200 week average, something else? Just curious.", "score": 7, "replies": []}, {"body": "We were below 280 a month ago, if you consider inflation to damage a companies margin along with rising rates, then qqq is overvalued at even 280", "score": 5, "replies": [{"body": "Look what happened after it went undervalued, the fucking thing quickly went back up. Id suggest 280 gets retested before saying 195P are gonna print in December.", "score": 9, "replies": []}]}]}, {"body": "Buying long dated SUUUUUPER far out-of-the-money puts a day after one of the largest pops in volatility we've had all year. The next green day will absolutely demolish those puts, they will get instantly crushed.", "score": 9, "replies": []}, {"body": "The fed doesn't change rates based on CPI. The fact that you don't know this means the rest of it is a bad idea. They prefer PCE. They have for a while. On Friday it came in softer on all counts.", "score": 4, "replies": [{"body": "Then why did the markets celebrate .6% drop in the cpi report last month which then led to a huge rally? \n\nIf the pce came in softer, then why the huge sell off on Friday? Obviously this sell off is a signal that something really bad is going to happen, and a lot of traders are refusing to acknowledge that", "score": 1, "replies": [{"body": "The markets don't like various things like the loan forgiveness, which won't help inflation. Bear markets always have the largest bull rallies. You hit on some others but the fed uses PCE. They have explicity said as much. Core PCE is their main inflation measure that they use for rate adjustment.", "score": 3, "replies": []}]}]}, {"body": "I kinda respect that you're posting your positions and putting up actual money instead of other bears here. Having said that there are much much better ways of going short. When you think that your underlying is going to reach a X amount by Y date, you shouldn't be buying ours at X strike at Y expiration. You might make a lot, a lot of money of this trade, and I'll definitely be checking back this time next month. But it'll be equivalent to a winning lottery ticket. \n\nBut like I said, respect for posting positions", "score": 7, "replies": []}, {"body": "Some flaws in your assumptions. Fed target is 3.4% by EOY according to Philly Fed governor Patrick Harker, so 50-75 bps in Sept and maybe 50 in Dec. Where they go from there depends on data. But nowhere close to 250 bps by EOY.\n\nThat being said, agree that Fed will slow down money flow resulting in pain. Wall Street is positioned for a leg down in equities and for oil to rise. Inflation will be a tough nut to crack, so this could take a while.\n\nCurrently own SQQQ and FAZ and long @GC and @US. Looking for an entry into OILU or @CL. Friday was a very, very good day!", "score": 3, "replies": [{"body": "Imagine if the cpi report in September comes out to 9%+, you then have peak inflation narrative thrown to the trash and fed will break the economy with huge 125 BPS rate hikes\n\nOuch", "score": 0, "replies": [{"body": "Oh, I doubt they’d make that big of an unanticipated jump. Instead they’d signal that they will ramp longer than they had hoped, which would also cause a big drop but not at the seismic level of a sudden 125 bps jump.\n\nBut if they did…! Fun to think about. :)", "score": 7, "replies": [{"body": "0.75 will be the biggest, but depends if it 1 or 2 max. rate hikes", "score": 2, "replies": []}]}, {"body": "I'm not an expert, but did some googl-fu. The CPI is weighted around 30%-40% percent to the price of homes and cars (and associated costs). Both of those are trending down. Also another major culprit of high CPI is gas prices, which are also trending down. \n\nCPI is a lagging indicator, so it is a reflection/summary of the month prior. \n\nI don't expect CPI to increase, because of the above trends.\n\nCPI breakdown: https://www.bls.gov/cpi/tables/relative-importance/2021.htm", "score": 6, "replies": [{"body": "This, cpi will be below 9% and anything less than 8.5% will set up another mini bull rally", "score": 2, "replies": []}]}, {"body": "There is something called the bull whip effect. Inflation drops before spiking up again. Kind of interesting to research.", "score": 1, "replies": []}]}]}, {"body": "Cpi report in Sept is probably going to be good again, why on earth would you just assume it's guaranteed bad", "score": 3, "replies": []}, {"body": "Lol wsb worthy", "score": 3, "replies": []}, {"body": "Please first google and learn basic statistics concepts such as expected value, PD (probability distribution), etc. and when you‘re done read this book, twice:\n\nOption Pricing & Volatility by Sheldon Natenberg\n\nAlso get the exercise book and do them as well. \n\nWhen done, come back and see if you still wanna buy that deep OTM put you were planning to.", "score": 5, "replies": []}, {"body": "You greedy homie. I bearish too but I buy itm, why not go for a solid big win that's doable instead of trying to 10x your money? At the very least I hope you put at least 6,000 on in the money December puts to hedge your crazy bet...", "score": 2, "replies": []}, {"body": "QQQ doesn't have to get anywhere near 195 for you to profit on those puts, but in any case I hope your forecast is super wrong. For the sake of my long QQQ shares I bought years ago.", "score": 2, "replies": []}, {"body": "Yes, another 250 bps into year-end is **definitely happening**. Why don't you just buy QQQ $69Ps, since at another 250, there will be hardly anything left standing.", "score": 2, "replies": []}, {"body": "This is the worst play I've seen in recent memory.  If you think this is going to happen you should load up on puts on aark-like stocks, anything spec that doesn't make money really... It would pay out so much more.  If anything I'd sell the QQQ puts to hedge that and I'd want to be assigned at those levels for sure.\n\nEdit: actually, on second thought buying puts on \"safe\" stocks might pay out even better in this scenario, as their premiums are so cheap.  Everything would get obliterated in your scenario, so wherever the cheapest premiums are.", "score": 2, "replies": []}, {"body": "Why is August CPI expected to be hotter. Gas prices used cars and housing dropped this month significantly ?\n\nI think your speculation is dead wrong.", "score": 2, "replies": []}, {"body": "For a trade like this you better get creative or just go short futures. Which imo would be the much smarter move", "score": 2, "replies": []}, {"body": "I'll sell ypu those options at open", "score": 2, "replies": []}, {"body": "What if Putin is assassinated, then bears R fck", "score": 2, "replies": []}, {"body": "Those contracts are going to print...for whoever sold them.", "score": 2, "replies": []}, {"body": "195? Ooooof that's a bet I'd be willing to take with ya. $6k worth? I'll jump in with $4k. $2k puts on SPY. I see 350 by December easily.", "score": 3, "replies": [{"body": "Yeah if you start the position on Monday, even a dip to 3800 will make you money", "score": 1, "replies": []}]}, {"body": "Don’t fomo now. Wait for a bounce you know how the market is. It will find a way to rally, think logically don’t let greed cloud your judgment.", "score": 3, "replies": [{"body": "We just had a major bounce? \n\nWe went up straight for weeks", "score": 5, "replies": [{"body": "Yeah I know.", "score": 1, "replies": []}, {"body": "We sold off a lot to in return", "score": 1, "replies": []}]}]}, {"body": "I disagree with your thesis but...\n\nBuying puts that far otm doesn't make sense even if you expect the market to go down a lot. Theta will kill those if we don't have an absolute market crash and even if we do go down you likely won't catch a lot of the premium potential you could have with something more reasonable.", "score": 2, "replies": []}, {"body": "I follow more the Spy, however I see this playing out, especially as the momentum of the downward trend really gets going with end of year as peak bottom", "score": 2, "replies": []}, {"body": "QQQ to 600. Fuck your puts.", "score": 2, "replies": []}, {"body": "Looking at the chart... ichimoku and VWAPs... yeah. Short of a world-ending plague there isn't enough time to get there. QQQ is in a long term downtrend, yes, but there isn't enough gas (time) in the tank to get there. Not even close. I wouldn't want to be on anything lower than $270 by December/January. Do you know how much money would need to be wiped off the markets to get there? Insane. You might as well go to Vegas and enjoy yourself.", "score": 1, "replies": []}, {"body": "Let's see if $QQQ holds the 50 day simple moving average at 303.50 before we discuss lower levels. That's a major support zone and the algo's will likely have buy programs in place to trade the bounce when it's hit. Could see a dip on Monday to this zone then Turnaround Tuesday. We'll see 👀", "score": 0, "replies": []}, {"body": "Just recall that stocks on most holiday weekends tend to rise up toward that weekend, and we have one coming up next week. It might be a good play after that if you are very confident in those headwinds mentioned. I believe they are valid points, but the market also tends to have marketmakers setup plays for us retail traders to get into, and then they slam the door on us later. But if you are trading with the trend, long-term, then you at least have those odds in your favor. I either need really good info to trade long-term, or I’m just selling covered calls to hedge my position, and then I’m OK letting those get called away if it does go beyond the strike. Those are about the only long-term options I like to do though.", "score": 0, "replies": []}, {"body": "Nonono. Its not gonna go that low. Bottom at 270. Maybe higher.", "score": 0, "replies": []}, {"body": "/\nQQQ to 195 by December?\n\nLots of headwinds such as\n\nRecession in Europe\n\nHotter than expected cpi report in September which will cause the fed to raise rates by 250 bps by year end\n\nQT which will drain liquidity \n\nHorrible earnings in October \n\nHousing slowing down significantly \n\nWeaker consumer\n\nLook at how horrible of a sell off it was on Friday, don’t think that was the end, it’s just the beginning of the carnage to come\n/\nNot wrong - just early\nRemindMe! 1 month", "score": -1, "replies": [{"body": "I will be messaging you in 1 month on [**2022-09-28 06:11:41 UTC**](http://www.wolframalpha.com/input/?i=2022-09-28%2006:11:41%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/options/comments/wzldn6/qqq_to_195_by_december/im3jiui/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Fwzldn6%2Fqqq_to_195_by_december%2Fim3jiui%2F%5D%0A%0ARemindMe%21%202022-09-28%2006%3A11%3A41%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20wzldn6)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "We will see below $270 again for earnings in October because of financials will show margins getting crushed by inflation. This is now 9 months of Biden inflation averaging 7-8%. These earnings will show even less revenues and less profits because people are spending less. Buckle the fuck up 📉 Monday and Tuesday will be selling off 🩸", "score": -1, "replies": []}, {"body": "I would agree with you, personally looking at Jan Puts, again. I got in at at SPY 420, and closed most. If we bounce next week I will load up on puts again. Sell the rip for now.", "score": 1, "replies": []}, {"body": "I see all your points, and the ones on the opposite side in the comments, and I have no idea how you guys can have such a confidence in your opinions on where the stock market might or might not go in the future.", "score": 1, "replies": []}, {"body": "The weekly chart is showing a down trend. 200ma is a support. Last time it bounced at $267. I see it on a down trend.  Might buy  puts at $280.", "score": 1, "replies": []}, {"body": "As rates rise into next year. This will be really tough to pull off, if not mathematically impossible", "score": 1, "replies": []}, {"body": "Monday green day confirmed.", "score": 1, "replies": []}, {"body": "better off with put debit spreads, on spy", "score": 1, "replies": []}, {"body": "Do a flip!", "score": 1, "replies": []}, {"body": "You have higher probability if you buy weekly puts", "score": 1, "replies": []}, {"body": "If you're smart enough to preserve capital and take profits if it goes your way. All you need is the market to trend your direction and you should get chances to sell off bits to reclaim your cost and then let some ride. If you hold these actually expecting them to go itm then don't bother.", "score": 1, "replies": []}, {"body": "You do you, but idk about that strike selection. We bears are going to feast this week - try not to let thetagang steal your salmon.", "score": 1, "replies": []}, {"body": "215 December puts right here", "score": 1, "replies": []}, {"body": "You know you can do more than just buy options right?\n\n\nYes people make tons of money from gamma ramp on short date otm options... But if you actually use strategies over time you won't have to rely on luck.", "score": 1, "replies": []}, {"body": "Have you taken into consideration that the market can consolidate in a more or less lateral move for months resulting in a decay of your position ?\nYou are getting overly exited after just a big red day.\nAlso you are overestimating the problems in Europe and the inflation damage in general. Yes the situation is bad but…not that bad yet.\nWhy not play this step by step ? Wait for pullbacks then buy puts.", "score": 1, "replies": []}, {"body": "There is no qt", "score": 1, "replies": []}, {"body": "195 put by December ? I say how and why not in the same breath  - I think 250 BPTS additional by year end is heavy - dick Powell might ring in a 100 BPT in Sept , something he should have done a year ago   However I don’t see another 125 in back of that by December \n\nYou are definitely sniffing in the right pile - maybe use 2000 for October , roll original plus profits to end of October adding another 2000 to position , roll to end of November plus 2000  into December - by then you should be able to take all your seed money and 50% of the profit out , play with the rest through year and out", "score": 1, "replies": []}, {"body": "195? Unlikely, 250 is possible", "score": 1, "replies": []}, {"body": "To loose on decline of upset of the fed tools\n\nCould be better in arbitrage strategy thou", "score": 1, "replies": []}, {"body": "Wait till the election than decide how the year is gonna end.  We are not going down in a straight line from here to December and during an election year you should consider how a run up through November is possible. The powers that be want to keep it that way, if the spx is at 3600 come Election Day no democratics are not winning anything.", "score": 1, "replies": []}, {"body": "Looking at past volume there may not be $6000 worth available to buy.", "score": 1, "replies": [{"body": "Buying is ez (just set a decent price and algos will fill you). It's selling that's not so simple (no market/liquidity)\n\nNew?", "score": 1, "replies": [{"body": "No not new. Just doubted the $6000 would be spent at the price specified.  Algos are looking at all the strikes.\n\nAlthough in this situation any one on this thread could bet against this.", "score": 1, "replies": []}]}]}]}
{"title": "How much to charge your Tesla in different countries with this insane power prices? Impact on automotive stocks?", "selftext": "", "id": "wzprlp", "created_utc": 1661672849.0, "score": 564, "upvote_ratio": 0.94, "num_comments": 230, "comments": [{"body": "Poland is building nuclear reactors, I am willing to bet that they will export electricity", "score": 66, "replies": [{"body": "Liberal legislators here in the US won't support nuclear. Despite being 1000% better for the environment than electric cars will ever be 😆😆\n\nStupid schmucks. \n\nThe gen pop dont understand the system. So called \"green\" companies earn their politicians far more money than nuclear ever will. Therefore, they are not an option. 🤷‍♂️", "score": 47, "replies": [{"body": "Yeah, big oil really has the liberals in their pockets, don't they? dolt", "score": 0, "replies": []}, {"body": "just that pesky left over, the radioactive pools, the spent rods, the inherent danger to people within a 1000 miles, etc.  BS.  Nuclear isn't a solution in the current form. Its outdated and primitive use of a really dangerous stuff. \n\nA combination of solar, hydro, wind, geothermal, gas, nuclear and then a country can sit back and enjoy the success.  Solar is so untapped, along with wind and hydroelectric in many countries.  At least none of these are deadly in case on an accident.", "score": -21, "replies": [{"body": "Modern 3rd and 4th generation nuclear reactor designs are so safe, that I would welcome a fridge sized nuclear reactor in my backyard.\n\nSome of the designs do not require water for cooling. They are designed to automatically shutdown in the case of a potential meltdown, releasing no radiation in the process.\n\nThey can also recycle existing nuclear waste into new fuel for these reactors and continue to reprocess the material until it is functionally inert.", "score": 12, "replies": [{"body": "Yes, there is a better design on the new ones, but an accident is an accident. No power plant is safe. The Oakridge storage facility repurposes spent rods and has been for decades. I understand the huge steps they made in safety. My concern is the likes of Fukushima for example. Things we do not think of. \n\nA hydroelectric plant is not totally safe either, the danger is still localized and containable. \n\nI think nuclear will become - backyard sized - when we turn into fusion technology. That is I believe the future. Have a nuclear fusion generator on the back of the house and power it for 15-20 years and then have it recycled and install a new generation. That is for sure the future but we are not there yet. \n\nThat will also trickle down to cars - the nuclear fusion reactor will power our electric cars. \n\nElectric cars are the future regardless of what way we will create the neutrons for it. They are better for the driving 99.99% humans do and cleaner and easier to repair/service/manufacture and will last much longer then an average ice counterpart. \n\nThat much is clear. But until then the synthetic fuel can be an alternatives on certain vehicles - race cars, trucks, etc. \n\nOnce we have a fusion energy reactors running in the cars, we will no longer need refueling for years :-)", "score": -6, "replies": [{"body": "Fukushima is NOT a Generation III or Gen IV plant. That’s why it’s failure was so catastrophic. \n\nYou should read up on the thorium salt reactor designs. They are incredibly safe by their base design, if a reaction goes critical, it causes the core to fall out and into a dispersement chamber that spreads and contains the material, killing the reaction, rendering it safe in a time measured in hours.", "score": 5, "replies": [{"body": "There have been no deaths or cases of radiation sickness from the nuclear accident, but over 100,000 people were evacuated from their homes as a preventative measure. Government nervousness has delayed the return of many.", "score": 3, "replies": []}, {"body": "Its relatively safer until something isn't safe is happening.  Most reactors aren't \n\nMolten-Salt reactors could solve some issues but they have their own melting issues. \n\nThe Irradiated Thorium is more dangerously radioactive in the short term.  \nThe Th-U cycle invariably produces some U-232, which decays to Tl-208,   \nwhich has a 2.6 MeV gamma ray decay mode. Bi-212 also causes problems.   \nThese gamma rays are very hard to shield, requiring more expensive spent  \nfuel handling and/or reprocessing.\n\nNeither is a fool-proof but as I said nor any of the other power generators. However a wind generator's leak is air, a hydroelectric reactors leak is water, neither will cause harm a thousand miles away. But will decimate anything within range. \n\nRecently visited the Niagara Falls. Amazing how many power plants operates on that ONE river.", "score": 1, "replies": []}]}]}]}, {"body": "Just wait 10 years when we have billions of pounds of chemical waste from solar and electric vehicle byproducts. Solar is not even close to an answer. Just a bandaid to make people feel better about their existence. \n\nAnd when those products become inefficient  we will have junk yard after junk yard of batteries rotting a hole in the earth.\n\nOnly current thing humanity can do is promote an anti pregnancy movement.", "score": 12, "replies": [{"body": "We have used oil depositories, old acid battery storage facilities that we recycle in some form but look at the process.  The cars regardless of electric, gas, diesel will pose an issue for recycling and getting rid of the stuff. \n\nThe old car batteries are already 97% recycled. The electric cars on average contain 40% less parts. No dirty air filter, no dirty oil filters, no spark plugs which needed to be discarded and thrown into a landfill.  \n\nYou compare an electric car to a cardboard regatta and pretend that current cars are clean and absolutely recyclable. I'm in a car parts business and see a lot of junk yards. You might want to take a look at their operations before ditching the electric cars and their - waste. \n\nYes, anything we make will be obsolete at one point and it will start piling up in landfills. \n\nAre you a horse rider ?  Well guess what ? Horse fart contains methane which is # pollutants.  The horse shiite is an absolute hazard as flies , bugs that spread diseases routinely have lunches on them... so even a horse causes issues. Lets not be pretentious and say that we lived in total harmony with nature with the ice engines. \n\nJust to add one thing - transporting fuel on pipeline and running refineries and dumping waste oil crud is a huge environmental issue currently, in case you say an electric powerplant is a dirty business and the diesel/gasoline cars gets their clean fuel from a pump. BS.", "score": 2, "replies": [{"body": "Lithium batteries are not recyclable in any way(atleast yet) and each EV has up to 900lbs of them. Meanwhile, a gas vehicle battery is about 30lbs of which like you say is 97% recyclable.", "score": 0, "replies": [{"body": "Lithium batteries ARE recyclable.", "score": 1, "replies": [{"body": "Less than 1% of lithium batteries are being recycled. 94% of them is said to be dumped in landfills currently. \n\nThink that will change in time for the huge EV dump in the next 10 +/-  years? I dont. I dont think any of it will. All those billions of pounds of lithium will either be sent to space with Space X or dumped in one of Elons abandoned California warehouses.", "score": 1, "replies": []}]}]}]}]}, {"body": "Solar is also highly inefficient, you need thousands of acres of panels to even make a recognizable dent in energy consumption", "score": 0, "replies": []}]}, {"body": "Just a thought - would you move within 40 miles of a nuclear power plant ?  That is the safety zone they require.  I know I would not !", "score": -6, "replies": [{"body": "The entire city of Phoenix,AZ is within 50 miles of a nuclear power plant. (That's where I live)", "score": 8, "replies": [{"body": "May the force (nuclear) be with you...", "score": 2, "replies": [{"body": "Nuclear power is completely safe. Accidents like Chernobyl was due to the insane amounts of corruption within the Russian government and technology as long since improved since the last disaster of any kind that makes anymore exponentially less likely", "score": 5, "replies": []}]}]}, {"body": "Philly is 30 miles from one", "score": 4, "replies": [{"body": "Go nuclear birds. \n\nFor real. I’m super pro nuclear and it’s my favorite topic.", "score": 2, "replies": []}]}, {"body": "I would if it's landlocked and not on a fault line.", "score": 3, "replies": []}, {"body": "I live in Minneapolis and we all have a nuclear reactor within that radius. No one gives af.", "score": 2, "replies": []}]}, {"body": "Ask France how well their nuclear plants are working right now.\n\nEdit: [Paris Faces an Even Colder, Darker Winter Than Berlin](https://www.washingtonpost.com/business/energy/paris-faces-an-evencolder-darker-winter-than-berlin/2022/07/29/6d2fe282-0efb-11ed-88e8-c58dc3dbaee2_story.html)\n\nCope pro-nuclear activists.", "score": -15, "replies": [{"body": "Pretty damn well", "score": 8, "replies": [{"body": "No. They’re not working at all. France is currently paying for energy from Germany.", "score": -11, "replies": [{"body": "See what happens in winter\n\nSaying a drought is somehow a legitimate indictment of nuclear power is like saying climate change isn't real because it still shows every year", "score": 3, "replies": []}]}]}, {"body": "No water to keep cool?", "score": 2, "replies": [{"body": "> As winter approaches, the outlook in France is increasingly dire. Electricite de France SA, the state-owned utility, is running only 26 of its 57 reactors, with more than half of its chain undergoing emergency maintenance after the discovery of cracked pipes. With atomic reactors generating the lowest share of the country’s power in 30 years, France faces an electricity ‘Waterloo.’\n\n>The slump in nuclear availability is forcing France to rely more than ever on gas-fired plants, intermittent wind and hydro as well as imports. That’s pushing up the cost of electricity in the wholesale market for the whole of Europe, with French forward prices surging to almost 1,000% more than their decade-long average through 2020.", "score": 0, "replies": []}]}, {"body": "because of one-off pre-emptive maintenance? once in like what, 50 years?\n\nhow's that even relevant for its long-term feasability?", "score": 2, "replies": []}]}]}, {"body": "So does Hungary. By 2030 they will have extra electricity for anybody who wants to buy it.", "score": 3, "replies": []}, {"body": "You know the reason German/French energy prices are so high right is the French reliance on nuclear reactors?", "score": -46, "replies": [{"body": "That makes no sense bro", "score": 19, "replies": [{"body": "If youre uninformed, I guess it doesnt. France shutdown over half of their nuclear reactors(32 out of 56) because of droughts and is now massively importing electricity. Do you understand how that could effect the prices in Germany even if German production stays the same?", "score": -13, "replies": [{"body": "France is usually a net exporter of electricity, but at peak times it has to import electricity, usually via the high-priced international spot market.\n\nIn addition, electricity prices in France continue to remain below the European average, as can be seen at Electricity Prices in France (and Europe) 2020. However, many French households pay more in electricity than consumers elsewhere in Europe due to the poor level of insulation in many homes.", "score": 7, "replies": []}, {"body": "So its not the \"reliance on nuclear reactors\".\n\nIts literally the shutting of perfectly good energy plants - probably by politicians, eh?", "score": 6, "replies": [{"body": "one-off temporary maintenance that is irrelevant in the long-term", "score": 1, "replies": []}]}]}]}, {"body": "Why is this getting downvoted?", "score": -12, "replies": [{"body": "Why is this idiot commenting", "score": 15, "replies": []}]}]}]}, {"body": "Calls on solar panels on top of your house", "score": 140, "replies": [{"body": "I got solaredge👍", "score": 28, "replies": [{"body": "Puts on Germany then.", "score": 30, "replies": [{"body": "Winter is coming in Europe", "score": 24, "replies": [{"body": "Seems like you know the plan then? Care to share?", "score": 1, "replies": [{"body": "Energy prices go up.  Northern hemisphere is in for a rough winter", "score": 7, "replies": [{"body": "I also think it's going to be an absolutely brutal winter at that", "score": 3, "replies": []}]}, {"body": "No to retarded for anything else than losing money in the the stock market. I try to stick with DCA and Indexes🙈 gambled with BBBY and lost money💩", "score": 5, "replies": [{"body": "Trading BBBY. Good ape", "score": 8, "replies": [{"body": "“Trading”", "score": 1, "replies": []}]}]}]}]}, {"body": "It is a short-term side effect resulting from the combination of war and the Merkel government's failed energy policy. The new government is very proactive in breaking down Germany's unilateral dependencies, making better use of its own resources and diversifying sources. 1 to 2 winters at most will be financially uncomfortable, after which the price will stabilise again. What goes up must come down", "score": 0, "replies": []}]}]}, {"body": "Calls in CHPT and SIRC?", "score": 3, "replies": [{"body": "I have many calls on CHPT for this week's earnings.", "score": 0, "replies": []}]}, {"body": "They should just put solar panels on top of the car", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "You can charge your Tesla with solar panels lol, idk what you mean by it doesn’t do much for electric cars. Do you not have a battery pack the solar energy is going to?", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "ruthless berserk nose cobweb paltry cooing cause butter heavy snow\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": [{"body": "[deleted]", "score": 9, "replies": []}]}]}]}, {"body": "They need to make the cars [square](https://www.completecar.ie/img/galleries/5867/square_cars_9.jpg) and just slap on a panel on top so it never stops charging.", "score": -4, "replies": [{"body": "There are cars with solar panels on the roof. it really doesn't add much range, and generally not worth the added cost.  \n\nThe optional solar roof on the Hyundai IONIQ 5, for example adds about 3 miles of range per day through its solar roof", "score": 13, "replies": [{"body": "Wow that sounds worthless.", "score": 6, "replies": [{"body": "Unless you only drive once a week to the grocery store", "score": 2, "replies": []}]}]}, {"body": "Italy makes one right now 250k perhaps in 20 years tech will be there for roof top solar", "score": -3, "replies": []}]}]}, {"body": "That depends on regulation. Some states or counties in the U.S. for example won't let you put solar panels on because it literally takes away the business of local suppliers.", "score": 3, "replies": [{"body": "lmao", "score": 0, "replies": []}]}, {"body": "I wonder if it's possible to rig some solar panels on top of your tesla and/or any other electric car and just run off of that?", "score": 1, "replies": [{"body": "Solar panels aren't very efficient. You might get an extra mile added to your battery every hour or two if it's really sunny", "score": 1, "replies": []}]}]}, {"body": "Electricity prices where i am now is around 60 cents pr kw, but gas prices are like $2,2 for 1 liter so it’s absolutely insane and still much cheaper to own an EV.", "score": 54, "replies": [{"body": "I dont know what country you live but most dont charge EVs for maintaining the roads, even though they are much heavier than an ICE car. They are subsidized heavily. (Polution is still bad).", "score": 22, "replies": []}, {"body": "Buying an ev is more expensive.", "score": 15, "replies": [{"body": "They have little maintenance and if you chose to live at a place you can charge you save time every day. Avoiding break changes and oil changes because time is money. They also last way longer. Some EV cars actually gained value since purchase unlike gas cars which lose instantly upon purchase and never regained. \n\nI'm not saying you're technically incorrect just giving you some insight as to why most of us will never go back to ICE when it actually saves us money; not the other way around. But yes... they are more expensive but your ICE car costs you more. Moreover if I want to factor in your safety as they are also safer to drive.", "score": -1, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Genuine question why do you own a Tesla if you're so down on them? I'm undecided never owned ev but been looking at options", "score": 6, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "If the product that Tesla pushes was produced by any other company besides them, they’d be unable to get it out of the door. I honestly don’t know how they’ve been able to keep up their lax standards for so long.\n\nEdit: spelling", "score": 2, "replies": []}]}]}, {"body": "Sounds like you don’t actually have an EV. I had my model 3 for 5 years and it has run more reliably and with less maintenance than any other car I’ve owned. Battery degradation is less than 2%.", "score": 12, "replies": [{"body": "You had it for 5 years? Lmao, what did you drive before man? \n\nMy first beater back in highschool was a 2001 with 103,000 miles at purchase, and it lasted 7 years and 70,000 miles on nothing but oil changes, brakes, and one windshield replacement when a tree branch fell on it.", "score": 1, "replies": [{"body": "He’s full of shit. Never stepped foot in a Tesla, will never afford one in his life", "score": 0, "replies": []}]}]}, {"body": "Tesla cars are literally ranked last on build quality, or at least as far as I remember, which could be out of date. I’m not surprised. Try a better dealership.", "score": 8, "replies": [{"body": "Last on build quality ????. Watch Sandy Munro on YouTube tear down the Ford Mach e. There’s literally 20 cables running through the engine with zip cord ties. He had no idea what half of them do & he was a former engineer at Ford. He tore down the Model Y & found everything to be flawless & was impressed with everything. You’re full of shit", "score": 6, "replies": [{"body": "Don’t be so fucking aggressive so fast holy shit. I went back and looked for the study and it’s https://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwi31-ic3_H5AhWSRsAKHUClDq0QFnoECAcQAQ&url=https%3A%2F%2Felectrek.co%2F2020%2F06%2F24%2Ftesla-ranks-lowest-on-j-d-power-2020-quality-study%2F&usg=AOvVaw2JcKobZNZEH79Amnk794IH this one. It’s not out of electric vehicles though, just large car manufacturers. So yeah, that makes sense. And in fact Tesla cars have even improved in recent studies. I’m not surprised other EV cars are worst now.\n\nHow about instead of calling me full of shit for something I already acknowledged was based on an old memory, and probably out of date, you just don’t act like an idiot on the internet?", "score": 1, "replies": []}]}]}, {"body": "Please… do people actually pay attention to you in conversations?", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Ha! You “work in investments”… good one. Lord- maybe take a Reddit break and find a better excuse for being a dilettante with nothing worth saying. Oh- what could the rest of us learn from a dad who calls people “tard” and “works in investments?!” Please… judging from your full-time job sharing half-baked, uninformed opinions on social media- how do you find an excuse to pay yourself or ask for money for working at all? Perhaps your world-class investment mind has amassed so much capital that you can waste other people’s time now and call that a dividend of externalized lost productivity. Either way? Enjoy serving a steady diet of mediocre opinions to the hungry people who don’t “work in investments.” You are trash. I am embarrassed for you… (Respectfully of course)", "score": 0, "replies": []}]}]}, {"body": "Please provide proof of 5x breaking down on your personal Tesla. I'll wait. Then I'll smash all the rest of your points into pieces lol.", "score": 0, "replies": [{"body": "That guy spends every waking second on reddit posting junk.\n\nAgree that he is unlikely to own a tesla.", "score": 7, "replies": []}, {"body": "Errr, I will never post anything that reveals anything personal. You new to Reddit or something or a dumbass? \n\nGod, why are people so fucking idiotic these days in this sub. Worse than r/wsb.", "score": -8, "replies": [{"body": "I'd figure you'd run. People like you will make up anything.", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I can’t speak to your Tesla, but our Nissan Leaf has been by far the cheapest car we’ve owned in upkeep and TOC. We replaced my Prius, which was obviously great, but besides the tires there’s just barely any yearly or mileage based maintenance.", "score": 5, "replies": []}]}]}]}]}, {"body": "Sounds like you have a lemon. My model y has had no issues.", "score": 1, "replies": []}, {"body": "Tesla doesn't know how to make cars.", "score": -3, "replies": []}, {"body": "Crazy that a subreddit like this one would use anecdotes rather than actual data...\n\nhttps://www.kbb.com/new-cars/total-cost-of-ownership/\n\nhttps://www.aaa.com/autorepair/articles/average-annual-cost-of-new-vehicle-ownership\n\nhttps://caredge.com/ranks/maintenance/luxury/10-year/best", "score": 0, "replies": []}]}, {"body": "I love mine- year 7 for my S, zero maintenance except brakes and wheels. Worth more than I paid for it… my Audi A5 is fun too but gets 14 mpg and has been a maintenance nightmare. Still- a convertible is pretty great. Solar takes care of the Tesla and the whole unlimited charging (got in under that wire).", "score": 2, "replies": []}, {"body": "They inherently cannot gain value over time, maybe in short term because of manufacturing issues. Battery efficiency is getting (maybe) exponentially better year by year, both in terms of cost and battery life. Owning an ev is the equivalent of owning a laptop in 93 right now... they'll be obsolete in a few years", "score": 3, "replies": [{"body": "Yeah this is more accurate. Thanks. I did say some evs for that reason. Better than guaranteed loss on ICE", "score": 3, "replies": []}]}, {"body": "\"Choose to live at a place you can charge\". \n\n90% of America can't do that. Apartment / city infrustructure does not support it. Also, if you are in the 10% and you want one in your private residence, must fork over $2-3k for installation alone (source: uncle is a TSLA pleb). \n\n\nPublic charging? 100,000:1 demand ratio in most cities if EV has widespread adoption, because again, infustructure can not support. \n\nSave time? Lmao - for the other 90% of people, good luck sitting at a charge station for 6 hours, or an hour for a top-off after a trip home from work. Unless, of course, you want to pay $18-$30 a day for a supercharge station. \"Saving money\". I have a damn Gas Toyota Camry that I drive 40 miles round trip daily to the office, costs me about $120 a month on average. \n\n\nUh oh, your battery went bad? That'll be $20,000-$30,000, please - the cost of a new hybrid vehicle.", "score": 0, "replies": [{"body": "My ev already paid for itself im not sure what you're on about.  I mostly fast charge now adays and it definitely doesn't take 6 hours, your info is bad... I'll have to stop there as its clear from just that, that its above your head.  Most companies are offering 8 year battery warrantees too. I'm sure you don't actually care though as your uncle is the one that owns it. Enjoy your ICE and the box of sand your head resides.", "score": 2, "replies": []}]}]}]}, {"body": "USA $0.20 kwh v. gasoline 1.17 1 liter / ($4.10/gal) \n\n>it’s absolutely insane and still much cheaper to own an EV.\n\nYou can thank Putin and OPEC (collusion)", "score": 0, "replies": []}, {"body": "Lmao, where do you live to have such high prices? Don't forget that €1 is now worth less than $1.", "score": -10, "replies": [{"body": "I live in Norway. We don’t use €", "score": 5, "replies": [{"body": "Isn't the government currently paying 80% of your electricity bill past like 10c / KWh?", "score": 3, "replies": [{"body": "Yeah something like that. Still more expensive than it was a year ago", "score": 1, "replies": [{"body": "Well yeah, you historically had some of the lowest energy prices. Now you're paying normal prices so that the rest of Europe doesn't literally run out of energy.", "score": 2, "replies": []}]}]}, {"body": "Wow, Norway is a major oil producer how can you pay such price?", "score": 1, "replies": [{"body": "We pay high taxes on gas. Government wants us to switch to EV, which is pretty convenient at this point", "score": 2, "replies": [{"body": "Isn't the weather too cold to drive an EV? \n\nEvery Tesla owner I know is complaining about reduced autonomy during Dutch winter.", "score": 1, "replies": [{"body": "In winter time it can get cold in Oslo, maybe around -10*C, but it hasn’t in a while. It does affect range somewhat, but most EVs now have 500km range and it doesn’t really matter that much. There are charging stations at pretty much every gas station if you don’t have a charger at home", "score": 1, "replies": []}]}]}]}]}, {"body": "Not much less at all. The fuel prices sound like Germany", "score": 2, "replies": [{"body": "I haven't been to Germany for a while, but considering it's back below €2 per liter in the Netherlands, I wouldn't have expected it.", "score": 1, "replies": [{"body": "Eh it seems i haven't been there in a while, it's almost as in the Netherlands as well apparently. I thought the Rhine running low increased them", "score": 1, "replies": []}]}]}]}]}, {"body": "Back in July it cost around $20 to charge your electric car overnight. Just to put things in perspective, and keep in mind these numbers are two months old and got them when I was in England early July. Anyways, I pay $.12/kWh here in Illinois. In Metro London they were paying $.48/kWh.", "score": 9, "replies": []}, {"body": "Thought my glucose level was through the roof.  lol", "score": 3, "replies": []}, {"body": "Nobody seems to realize that everything gets done with energy and that this will send a shockwave through the markets, regardless if it holds this high price. \n\nImpact on automotive stocks won't be much as those doesn't make sense to me to begin with.", "score": 3, "replies": []}, {"body": "The electricity prices probably wont stay high, even in Estonia where i live they are planning to add a lot of renewables, 100% by 2040.\n\nDoubt they will though", "score": 21, "replies": [{"body": "In the near future they will. I work as a power trader and in France alone, the OTC market is trading at ~1000€/mwh in Q1. \n\nAlso, renewables are great but we still need gas, coal, and oil to this day as we can’t rely solely on them. Also, pump (pumping water up a mountain etc.) isn’t that reliable a method. It can’t store enough power to meet consumption", "score": 17, "replies": []}, {"body": "How much to charge/fuel your car there?", "score": 3, "replies": [{"body": "Around the same as electricity prices,  gas costs 2.3€/l", "score": 4, "replies": [{"body": "So a fuel load with gaz/diesel or electricity is about the same amount of money?", "score": 3, "replies": [{"body": "Oops, i meant same electricity prices as germany :D", "score": 2, "replies": [{"body": "So about 30 Euros currently…", "score": 1, "replies": []}]}]}]}]}, {"body": "You know paying for the infrastructure is gonna be expensive…. \n\nThey aren’t going to give you free power because the source is renewable", "score": 3, "replies": [{"body": "You know what else is expensive? Paying 70% of your salary on electricity currently\n\nIt is literally unlivable for some people here, imagine taking a loan because you took warm showers, boiled some water and wanted your 1 bedroom apartement to stay above freezing temperature\n\nI got lucky with a fixed rate so my electricity bills went from 10€ to 20€ but i know people whos bills went from 30€ to 700€ and from 50€ to 350€\n\nThis is in Estonia where the average wage is 1700€ pretax. A friend of mine had to sell his laptop to pay for his electricity\n\nNobody is asking for free power, they just want to afford food", "score": 11, "replies": []}]}, {"body": "Renewable great when it’s windy or sunny, when it’s not everything shuts down lol", "score": 1, "replies": []}, {"body": "Renewables wont help. They are costly and you cant store energy. What would help is calm down situation with Russia which seems impossible right now. Even if situation calm down, I think Russia have no intention to sell gas&oil in the same qty to Europe.", "score": -15, "replies": [{"body": "Last year people earning 1k€ a month were getting 700€+ electricity bills. Renewables would be the only thing we Estonians could do tbh, besides rely on others", "score": 12, "replies": [{"body": "To all people who downvoted me, you listen too much Greta screaming and don’t listen to engineers. This is why we ended in such situation.", "score": -3, "replies": []}, {"body": "How you store renewable energy? Do you have any idea how electric network is working?", "score": -11, "replies": [{"body": "You sell it to other countries and then buy it back from different ones\n\nWe dont have other options, what do you suggest? We keep paying 70% of our salaries for electricity? Die of starvation? Move to caves?", "score": 5, "replies": [{"body": "Who would buy if you they don’t need the energy? How do you store energy that you cant spend right now?", "score": 4, "replies": [{"body": "Even then we can produce our own during the day and buy in at night, all our peak prices happen during the day because we buy in from Nordpool\n\nLast week there was a day when prices were so high that our refigerators cost us 1€ an hour, add a PC, water heater, cooking food and you would spend 30€ a day on electricity living in a 40m2 apartement just using a refigerator,PC and water heater", "score": 3, "replies": [{"body": "You are talking nonsense, there is plenty of energy being able to produced in the nights, like wind. Peak energy consumptions are usually evenings. But this is also irrelevant as your system needs to react literally in minutes/ seconds.  This is why you need to keep around 25% of capacity in reserve in stand by, which cost billions of usd each year. It is well known problem and you are discovering hot water right now.", "score": 3, "replies": [{"body": "Of course im talking nonsense, i only said what my country is planning to do, go 100% clean energy. You think im an actual engineer arguing with strangers on the internet? Its not my problem how they do it, we are in Nordpool so its a connected system, if we are 100% renewable we are still connected to a system which gets its power from varied sources, we dont need to store anything. All i said is Estonia does not have any other options to create electricity\n\nIf we are 100% green and lets say Finland is not then the system is powered 24/7", "score": 2, "replies": [{"body": "about the energy storage problem you can see here:\n\nhttps://www.youtube.com/watch?v=Q8xsg9iK5yo&ab\\_channel=SabineHossenfelder\n\nEurope will have problems in years to come due to bad decision-making, at the moment primary for war with Russia, other than that, is closing nuclear plants, and politicians are making energy policies instead of engineers.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You pump water up a mountain/into a lake or elevated storage with solar energy during the day. At nighttime the demand goes up. You release the water through pipes and get hydroelectric energy.", "score": 2, "replies": [{"body": "This is indeed still the best way to store energy, way better than batteries, but you can do only so much and you need decades to develop artificial water accumulations. Also, if you solve storage of the energy problem, you will be more wealthy than Elon Musk.", "score": 2, "replies": []}, {"body": "And how would you do that immediately?", "score": -2, "replies": [{"body": "Immediately? Because they have 100% renewables right now? Or where they talking about 2040?", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "In America at 5 dollar a gallon a 20 mpg car costs 25 cents per mile.   Electricity would have to be 1 dollar a MW to be the same cost per mile.   Currently it's 10 to 20 cents, so a 5x or 10x increase for parity.", "score": 7, "replies": [{"body": "I think you mean kWh, no MW.", "score": 10, "replies": [{"body": "Yep", "score": 4, "replies": []}]}]}, {"body": "I’ll give my two cents. \n\nI think it’s gonna get dark for a while, quite literally. We’re expecting blackouts in large parts of Europe this winther, and OTC market for Q1 next year in Europe is trading crazy high. Power prices will undoubtely increase a lot which will affect the demand for electric vehicles (imo). \n\nOn the other hand, oil prices will most likely still be high by next year and EVs will surely still be vastly cheaper to own than traditional cars with combustion engines. \n\nPersonally though, I expect entire markets to go down as a result of a huge imbalance in production of power relative to demand. I’m no expert at all but I work as a power trader with people who are way smarter than me, so I’m basing my comment off of their statements", "score": 5, "replies": [{"body": "Any suggestions where we will land woth the financial markets?", "score": 1, "replies": [{"body": "Because of your question, I’m actually doing research right now on how to position myself for a short in DAX or FTSE. It’s more of a hedge but I think it’s gonna come down. I still need to actually analyze before I can give a proper statement but I just don’t see how it’s gonna recover as it is right now. Gas storages will run dry this winther and as of right now, it’s not possible to fill them up in time. I might just buy a couple of puts but I’m not too sure yet", "score": 2, "replies": [{"body": "Sounds like a feasible play in this environment! Should habe bought a put before Powells speach.", "score": 1, "replies": []}, {"body": "Have to say, I'm hesitant about equities. Even European power because no way will governments let shareholders take a profit amid electricity rations. Can you let us know what you come up with? I'm curious about how others are positioning. I am spending the next week to research", "score": 1, "replies": [{"body": "Well, it’s not like it’s all power will be cut for days. It’ll most likely just be for a couple of minutes but with prices going through the roof next year, I believe equities would drop quite a bit. \n\nAnd I will! I’ll ask around the office tomorrow and after try to do some research myself", "score": 1, "replies": []}]}]}]}]}, {"body": "I am\nGoing to do\nMy first charge today on my model 3", "score": 5, "replies": []}, {"body": "So I’m not seeing anything in this post other than a vague graph of average prices for new energy contracts in Germany.\n\nIn my city the current price is 35 cents per kilowatt. A Model S needs 100kw to fully charge.\n\nSo it’s 35 euros to fully charge a Model S. I think based on this data it would be 25.\n\nThis is still much cheaper than gas. People likely won’t be buying Teslas due to loss of purchasing power in other areas, though.", "score": 12, "replies": [{"body": "Probably a bumpy ride in the future in either way😬", "score": 0, "replies": [{"body": "Why are you assuming gas/oil prices will remain the same over the same time period? Weve already seen extreme volatility in those prices many many times in the past.", "score": 3, "replies": [{"body": "I suppose humanity will find a way - like always. But energy ressources and installation take a long time to install and getting into the market. Russia wont come back into the equation for a long time. So where to get „green“ and sustainable energy in the short term? not possible…", "score": 2, "replies": [{"body": "I mean dude you're so close in your own words here.\n\nEnergy sources. Buy companies that have or make those.", "score": 2, "replies": [{"body": "any suggestion?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "My 10 year old piece of shit car is now cheaper to drive than a Tesla, it’s hilarious. Not to mention it’s way way cheaper in every other regard", "score": 7, "replies": []}, {"body": "Once the transition to electric vehicles is complete electricity will skyrocket everywhere.", "score": 4, "replies": []}, {"body": "I support EV's but what I've never understood is in many places we struggle to supply enough power AS IT IS... now add ALL of our vehicles just plugging into that same power grid that gets overloaded when I turn my AC on?", "score": 2, "replies": [{"body": "Don't worry, they'll happily start up some coal and gas power plants so people can charge their \"EV\".", "score": 1, "replies": []}]}, {"body": "But seriously, how bout the toll on electric infrastructure let alone the insane amount of power that will be needed. Here in the states they have had to force rolling blackouts in different states as well as cities. I do not think some states are ready. Let alone California, the pioneer in “All Electric sales/vehicles only by 2035” good luck with that. Maybe they should figure out where their energy and water is coming from for all their fancy shmancy ideas. I’m from WA however I know California gets their “needs” from every other state within 2-3 around them. I do believe in going electric/green, however it needs to be done responsibly. Don’t start with solar either, while I agree CA gets a lot of sun, CO gets more sunny days than any other state. All I’m saying is, slow down, get it right, so we can all get behind it.", "score": 2, "replies": [{"body": "Did I call it or what? California is asking that people stop charging their electric vehicles. I called this, the day this post was created. The 29th, 4 days ago.", "score": 1, "replies": []}]}, {"body": "Take a look at energy futures. They're at ~€950/mwh", "score": 2, "replies": []}, {"body": "Self inflicted wound, puts on Germany for the last 2 decades.", "score": 3, "replies": []}, {"body": "I pay 90 Euros for my diesel car per load…so Electro car still much cheaper", "score": 3, "replies": []}, {"body": "UK 900 pound to drive 10km ...but hey the environment is better..right 😎", "score": 2, "replies": [{"body": "Not really good for environment as much as you think, it matters how electricity is produced, if it comes from coal not really good for environment.", "score": 3, "replies": [{"body": "It's a joke, coal fired power stations arnt exactly great or nuke powered 😉", "score": 4, "replies": [{"body": "And this is exactly what eu is doing right now, buying coal around the globe to substitute for Russian gas and nuclear plants they closed.", "score": 5, "replies": [{"body": "Yes price of coal will fly up..", "score": 2, "replies": [{"body": "Check this\n\nhttps://youtu.be/_6Oa6fqnGTA", "score": 2, "replies": []}]}]}]}]}, {"body": "😂 and not much sun in UK either", "score": -1, "replies": [{"body": "They had I think one hot day this summer,  the Brits started dropping like flies...", "score": 2, "replies": []}]}]}, {"body": "The substitute good for an electric car is a gas powered car.\n\nYou'd have to compare the cost of electricity alongside the cost of gas to reach any meaningful conclusion here.", "score": 1, "replies": []}, {"body": "And just like that, people stopped buying EV’s. Solarpanels seems like the coming bet.", "score": 1, "replies": []}, {"body": "euro is going to zero", "score": 1, "replies": []}, {"body": "Oh how the turns table", "score": 1, "replies": []}, {"body": "\"climate change tho!\" \"Putin tho!\"  \n\nNovember elections going to be LIT!!!!!!!", "score": 1, "replies": []}, {"body": "Not that expensive, it’s 0.081$ per kWh", "score": 0, "replies": []}, {"body": "How does this compare to gas prices?", "score": 1, "replies": []}, {"body": "Solar panel on your Tesla?", "score": 1, "replies": []}, {"body": "They gotta get there money one way or the other. If you didn’t see this coming I feel bad for you", "score": 1, "replies": []}, {"body": "Cali is ran by 85% fossil fuels 😆😆\n\nLet's go Brandon!\n\n\nInvest in lithium 🤷‍♂️", "score": 1, "replies": []}, {"body": "If I were a solar provider I would be flocking to the region.", "score": 1, "replies": []}, {"body": "250? Prices are closer to 600-800 now. Going to 1k soon.", "score": 1, "replies": []}, {"body": "EVs will be like that for everyone. It'll be some reason or another, but eventually they will jack the prices up on people.", "score": 1, "replies": []}, {"body": "I'm manufacturing Fred Flintstone Cars for California. Available in 2035", "score": 1, "replies": []}, {"body": "Well… given that these high power prices are due to an unwise dependency on fossil fuels…", "score": 1, "replies": []}, {"body": "Solar…", "score": 1, "replies": []}, {"body": "My yearly energy usage in USA North East is like 6MWh x $200 = $1200 isn't  too bad. I don't have EV. But doubt it would cause my electric usage to spike much. Maybe extra 150kWh per month. I don't think this is going to cause people to run away from EV.", "score": 1, "replies": []}, {"body": "My country gasoline is cheaper than electricity and most of the electricity is produced by coal.\n\nSo an electric car would do more bad than good", "score": 1, "replies": []}]}
{"title": "Why interest rate is mentioned in terms of points instead of %", "selftext": "Recently Fed Powell mentioned interest rate hike of 75 basis points. It is easy for me to hear .75% increase.\nSame language is used while explaining Dow Jones daily increase or decrease by reporters. Any idea why?", "id": "wzivm7", "created_utc": 1661649585.0, "score": 681, "upvote_ratio": 0.91, "num_comments": 141, "comments": [{"body": "If I understand it correctly, increasing by .75% suggests you’re increasing the current rate by .75% such that an interest rate of 2% would be 2.015%.  Increasing 2% by 75 basis points would be 2.75%. \n\nEdited to remove ‘.’ to prevent confusion.", "score": 1316, "replies": [{"body": "Yes. Basis points and points of percentage are used when it’s to be read as an additive increase/decrease (i.e the new value is previous value +75 bps), while % is for multiplicative increases/decreases (i.e the new value is (1+75bps)*previous value).\n\nYou’ll get used to this stuff going through investor presentations and similar materials.", "score": 362, "replies": [{"body": "But they only ever do .25, .50, .75 etc right?\n\nThey never do a .05 rate hike or a .10, so isn't it irrelevant to use bps vs % if there can only be one interpretation?", "score": 25, "replies": [{"body": "Yes, but this convention applies to any change in anything that is measured in percentages.\n\nIf a bank increases its capital ratio from 10% to 11% you'll say it increased 100bps, or one percentage point. You could also say they have increased their capital ratio by 10%.", "score": 102, "replies": [{"body": "Perhaps I’m misunderstanding then too. Is not an increase from 10% to 11% an increase of 10 basis points, not 100?", "score": 7, "replies": [{"body": "It's an increase of 100 basis points. 0.01% = 1 basis point", "score": 40, "replies": [{"body": "Actually, .01 is 1% and .0001 is 1bp.  A basis point is one one-hundredth of one percent.  So .0312 would be the same as 3.12% or 312bps.", "score": -12, "replies": [{"body": "I'm not sure why you got downvoted and called a dumbass when you're correct lol, sorry my guy. Added a % sign to correct", "score": 1, "replies": [{"body": "Because you edited and didn’t add that you edited until after so their comment makes them look like a jerk", "score": 2, "replies": []}]}]}]}, {"body": "10 bips is .10%. 100 bps is 1%.", "score": 20, "replies": []}, {"body": "Love how you get downvotes for simply asking for clarification on a somewhat complicated detail. It's such a Reddit thing to do. what a shitty platform.", "score": -21, "replies": [{"body": "Well I mean the person said something wrong, and the only options are up, down or move past it. I wouldn’t expect many people to upvote something they know is wrong.", "score": 20, "replies": [{"body": "[deleted]", "score": -11, "replies": [{"body": "I agree passing it is the more polite option which most people did.", "score": 5, "replies": []}]}, {"body": "The person asked a question and even qualified it with \"perhaps I'm misunderstanding\" and you downvoted him.  Your attempt to reframe that as passing off false information is either disingenuous or moronic.", "score": -11, "replies": [{"body": "1. I did not downvote him. 2 that’s not what I said at all. I was explaining why the three options available would result in a small amount of downvotes.", "score": 2, "replies": [{"body": ">  not what I said at all.\n\n> Well I mean the person said something wrong, \n\nThat's literally what you said. Literally.", "score": 1, "replies": [{"body": "I said he said something that is wrong. I did not try to reframe him as passing off false information.", "score": 1, "replies": [{"body": "He asked a question. What is wrong about that?", "score": 1, "replies": []}]}]}]}, {"body": "Reddit must have bots to downvote any criticism of it as a platform 😂", "score": -5, "replies": []}]}]}, {"body": "Shitty but it's the best we got. So it's pretty good, or would you like to have these discussions on tik tok?", "score": 3, "replies": []}, {"body": "If I see something heavily downvoted, I just downvote to help society", "score": 1, "replies": []}]}]}]}, {"body": "The 25 basis pts rate change is a relatively new phenomena. It wasn't that long ago that the Fed and its counterparts in other countries would jack up or drop rates by 5 percent/500 pts to juice or cool down an economy. Fed chairman Greenspan completely changed the strategy for balancing employment vs inflation with constant small adjustments. He later introduced transparency to the Fed's actions - announcing future intentions.", "score": 36, "replies": [{"body": "Imagine the damage if rates went from 0 to 5% in one hike.", "score": 19, "replies": [{"body": "They never really went even close to zero until recently.. Japan was stuck in the stagflation rut for decades. Look at what Paul Volker did to rates in the 70s. People need a longer perspective instead of saying the world is ending at a 75 pt raise.", "score": 19, "replies": [{"body": "While I agree that you are factually correct - the context of what “recently” means in human terms is important. “Recently” means basically the entire adult life of anyone under 40, and the majority of time anyone alive has been investing, with the exception of people like Warren Buffet. \n\nMost people have no concept of how to survive in this type of economic conditions. \n\nIt’s comparable to saying that “most humans were farmers for the majority of human history, so everyone should be growing food now since food prices are becoming so expensive.” Most don’t have the skills. Many live in conditions where that’s impossible (ie: apartments).", "score": 3, "replies": []}, {"body": "“Until recently” — they went close to 0 after the 2000 bubble and basically 0 after 2008. \n\nDo you mean they hadn’t been close to zero prior to the last 2 decades?", "score": 4, "replies": [{"body": "https://tradingeconomics.com/united-states/interest-rate\nSort for all time. Rates dropped to near zero after the Bush economic collapse in 2008. 14 years ago in historical time is recently. History didn't start with your lifetime. Read a book.", "score": 3, "replies": [{"body": "2003 1.16% average, .86% as the low. That’s close to 0 IMO. My only point is that it happened in the early 2000’s as well. \n\nBut if you want to talk about history, it was .13% in 1961 and 1958, for example. \n\nYes I know the history. You don’t need to be such a snarky ass. \n\n[table of rates](https://www.macrotrends.net/2015/fed-funds-rate-historical-chart)", "score": 2, "replies": []}, {"body": "Should we call this one the Biden economic collapse?", "score": -8, "replies": [{"body": "And the Dot com collapse will now be known as the Clinton Collapse", "score": 5, "replies": [{"body": "Sounds reasonable", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "> But they only ever do .25, .50, .75 etc right?  \n\nThey do, but some years back they dropped the rates to 'near zero' - so technically the rate never hit zero.  And we don't know exactly what it is; it still trades in a range of 0.25%.  I wish they'd just settle on a rate, not a range.  \n\n*grammatical edit", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I don't remember it ever happening before; I think the rate has always officially been a fixed rate.  And what was the reason it wasn't technically 0% ?  Was is so we could say some day, \"Yep, things were bad, but not bad enough for the rates to go to zero - that didn't happen on my watch!\".  \nI think I remember some news article about a country cutting their rates to 0, and it was the 1st time in 500 years or something like that.  The US rates were always \"near zero\"", "score": 2, "replies": []}]}]}, {"body": "It is also useful to use bps because it makes thing easy when you get across the 0% line. It is not the case usually for interest rates, of course. \n\nExample. if you are at -2.75% and you go to 3.25%, it's controversial to explain the differences using percentages, as it could mean different things. But if I say, went up 600bps, you immediately understand correctly. -275bps +600bps = 325 bps", "score": 0, "replies": []}]}]}, {"body": ">Increasing 2% by .75 basis points would be 2.75%\n\nnot .75bps, but 75bps.", "score": 26, "replies": [{"body": "You’re right. I shouldn’t have put in a ‘.’", "score": 3, "replies": []}]}, {"body": "This is correct.", "score": 19, "replies": []}, {"body": "Clearly the intended audience are not path of exile gamers. More multipliers vs increase multipliers man.", "score": 3, "replies": []}, {"body": "Makes total sense", "score": 6, "replies": []}, {"body": "This is correct. FWIW, this same confusion exists when talking about elections and sentiment polling. People constantly get confused about things like percent change vs percentage point difference in polls.  E.g, a 5% increase in approval rating from the prior week is not the same thing as a 5 *percentage point* increase in approval rating from the prior week.", "score": 3, "replies": []}, {"body": "[That's a bingo](https://www.youtube.com/watch?v=q5pESPQpXxE)", "score": 5, "replies": [{"body": "Gorlami.", "score": 2, "replies": []}]}, {"body": "Great explanation.  As a guy working in finance for the last 5 years, I couldn’t put it any better", "score": 2, "replies": []}, {"body": "That's the right answer.", "score": 2, "replies": []}, {"body": "You can use the term percentage points and still not have a 10,000 divisor.", "score": 1, "replies": [{"body": "I think it’s intended to put some linguistic distance from “percent increase” for the sake of absolute clarity.", "score": 2, "replies": []}]}, {"body": "> increasing by .75% suggests you’re increasing the current rate by .75% such that an interest rate of 2% would be 2.015%.\n\n2 x 1.75 = 3.5  \n2 x 1.075 = 2.15  \n2 x 1.0075 = 2.015\n\nIf I heard \"increasing by 0.75\" I would think 2.75 and not any of the above options!", "score": 0, "replies": []}, {"body": "That explains basis points vs percentage, but why are basis points .01% instead of 1%?", "score": 0, "replies": [{"body": "Just because it's a more useful unit size. When talking about changes in a value that can only ever range from 0 to 100 (and often in practice a much smaller range) having smaller units simplifies things slightly.", "score": 2, "replies": []}]}, {"body": "This, there could be the misconception when someone says raising it by a % it is by the % of the overall product. BPs are easier to understand without misconceptions", "score": 1, "replies": []}]}, {"body": "Because it’s a “percent point increase”. Not a “percentage increase”. Your average person that hasn’t done enough algebra gets confused on that very easily so they just speak in terms of raw numbers that can easily translate to a “percentage point increase”\n\nEditing my comment to explain better:\n\nIf you start with the value 1%. A “percentage point increase” of 0.75% equals 1.75% (this is the fed math)\n\nStarting with a value of 1% again: A “percent increase” of 0.75% equals 1.0075%", "score": 88, "replies": [{"body": "Honestly they get confused anyway. Most people (myself included) generally have no idea.", "score": 14, "replies": [{"body": "Yea I won’t lie I occasionally get confused, but I think that has more to do with people using the wrong language when describing percentage changes", "score": 6, "replies": []}, {"body": "Here, let me help you. There are 100 basis points in 1% of interest. \n\nIf the cheapest available car loan financing increases from 3.49% to 3.79%, it has increased by 30 basis points.", "score": 5, "replies": []}]}, {"body": "Yeah, points mean add, percent means divide and subtract 1", "score": 2, "replies": []}]}, {"body": ">*It is easy for me to hear* ***.75% increase****.*\n\nThis leaves ambiguity. This could mean going from 1% interest rate to 1.75% or 1% to  1.0075%.", "score": 174, "replies": [{"body": "This is why they use basis points - it’s a standardized measure that removes ambiguity. All\nAmbiguity. \n\nWhich shows how accurate this information needs to be because it has global impacts. \n\nCould you imagine global nations trying to interpret then% increases from the usa?", "score": 22, "replies": []}, {"body": "The fed would never rates 7.5% or bother with .075%.. maybe a confusion could be 1% or 0.1%.", "score": -48, "replies": [{"body": "There's just no point in being ambiguous when its so easy to describe the change this way. Any time rates are measured in %s the issue of additive vs multiplicative is present, and it has massive consequences for mixing it up.", "score": 2, "replies": []}]}, {"body": "Instead they should just say the previous rate was X , new rate will be Y. But they wanna keep it as ambiguous as possible.", "score": -4, "replies": []}, {"body": "No it doesn’t. Everyone already knows what it is.", "score": -101, "replies": [{"body": "You're right. Let's just get rid of units, because everyone already knows.\n\nWhat could go wrong.\n\n>(CNN) -- NASA lost a $125 million Mars orbiter because a Lockheed Martin engineering team used English units of measurement while the agency's team used the more conventional metric system for a key spacecraft operation, according to a review finding released Thursday.\n\n>The units mismatch prevented navigation information from transferring between the Mars Climate Orbiter spacecraft team in at Lockheed Martin in Denver and the flight team at NASA's Jet Propulsion Laboratory in Pasadena, California.\n\nhttp://www.cnn.com/TECH/space/9909/30/mars.metric.02/", "score": 72, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Everyone is on the same page about the unit we’re discussing. Inflation is always described in terms of percentage points.", "score": -26, "replies": []}]}, {"body": "Which one is it then?", "score": 2, "replies": []}, {"body": "[my guy probably finds nothing wrong with this comic](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQB5eBDP70MZrTRmaWcdNAJbv-CXpv4Vk1ZDQ&usqp=CAU)", "score": 2, "replies": [{"body": "What?  That’s not relevant.", "score": 0, "replies": []}]}]}]}, {"body": "25 Bps (pronounced bips) is so much easier to say over and over and over all day long every day than “one quarter of one percent”\n\nWhen it’s your full time job, acronyms happen\n\nIt also tells you how to apply the information. \n\nBase rate of 2.00% increased by .50% is 2.01%. \nBase rate of 2.00% increased by 50 bps is 2.5%", "score": 75, "replies": [{"body": ">25 Bps (pronounced bips) is so much easier to say over and over and over all day long every day than “one quarter of one percent”\n\nI know you guys love fractions, but wouldn't it be easier to say \"0 comma 25 percent\"? Or I guess you would say \"dot\" (?) instead of comma. It doesn't require you to mentally divide the fraction.", "score": 1, "replies": [{"body": "It would be said like this: “ Point two five percent”. No comma or dot.", "score": 4, "replies": []}, {"body": "When talking with clients, yes. I’ll say “point two five percent” or “a quarter of a percent” but talking with my team I’ll say “25bps”. It’s easier and it tells them how to do the math", "score": 1, "replies": []}]}, {"body": "Who says bips? Lol", "score": -2, "replies": [{"body": "Everyone in the mortgage industry", "score": 4, "replies": []}]}]}, {"body": "Because it is a commonly used term in the world of finance:\n\nhttps://www.investopedia.com/terms/b/basispoint.asp\n\nReading through the education section of investopedia should introduce you to a lot of the common terminology used in finance/investing.", "score": 45, "replies": [{"body": "This answer should be higher.\n\nLook, when the Docter prescribes me 250 mg of aspirin, I also don't ask why he doesn't just say a quarter of a gram.\n\nFinance is a complex field of study and the basispoint convention is a very useful convention (as the other replies have indicated).\n\nPeople who want to invest and are confused about terminology would do well to spend a weekend learning the basics.", "score": 8, "replies": [{"body": "> People who want to invest and are confused about terminology would do well to spend a weekend learning the basics.\n\nOne semester of Finance 101 at the local community college would do a whole lot of good for most of this sub.", "score": 3, "replies": []}]}]}, {"body": "75 basis points or 3 Quarter of a percent is better understood and clear than saying they increased rates by 0.75% which some could interpret as they increased the rate by 0.75%\n\n&#x200B;\n\n2.00% + 75 basis points = 2.75%\n\n2.00% + 0.75% = 2.015% or 2.75% who knows.", "score": 8, "replies": [{"body": "This is not on topic but you're an expert on bonds right?\n\nAny idea why it's bear steepening so much and if it will continue?", "score": 1, "replies": [{"body": "Student loan forgiveness unknown impact on inflation. We will have more info on the 21st of this month after CPI next week.", "score": 1, "replies": []}]}]}, {"body": "In finance professionals use 100 pts =1%", "score": 29, "replies": []}, {"body": "Increasing a percentage by a percentage is not the same as increasing the base value of the percentage. \n\n1 point = an increase of .01 on the current value. \n\nEasier example. \n\nIf the starting value is 50% and I increase it 1000 points it becomes 60%. \n\nYou're equating that 1000 points to be the same as 10%. It isn't. \n\nIf you increase 50% by 10% you get 55% (10% of 50 is 5).", "score": 3, "replies": []}, {"body": "Percents of percents get difficult to follow.  I think points standardize changes so everyone knows a one point increase is always a one point increase instead of a .75% increase after a .5% of some starting point.", "score": 7, "replies": []}, {"body": "The exact reason for this is to avoid confusion. The phrase “basis points” is to imply points 1-100. So if the fed says raise the interest rate by 10 people would freak out and think 10% but obviously that was 0.10% . It originated as a way for the FED to define precise interest rates and avoid confusion. However seems like the opposite was achieved 😆", "score": 2, "replies": []}, {"body": "It's confusing because it makes you think they'll multiple by .75% rather then add that percentage", "score": 3, "replies": []}, {"body": "Similar to how you’d normally say 75 cents instead of three quarters of a dollar. Basis points are cents and percentage points are dollars.", "score": 4, "replies": []}, {"body": "If interest rates are 1% and you increase to 1.5%, that's a .5 \"percentage point\" increase, a 50 \"basis point\" increase or a 50% increase.", "score": 4, "replies": []}, {"body": "I was told today by a banker that when the fed raises rates, it really doesn't kick in until the next quarter.  True?", "score": 2, "replies": [{"body": "But things like mortgages may increase even sooner in anticipation.", "score": 6, "replies": []}, {"body": "Correct, and it's basically a target range as well.  The rates still fluctuate but close to the Fed target.", "score": 3, "replies": []}]}, {"body": "Dude, basic math. Where have you been in school?", "score": 1, "replies": []}, {"body": "I always assumed it's easier to say. 0.75% is both longer to say and there's a potential for error and people thinking you said \"75%\".\n\nI mean, if you're a microbiologist you probably put all your measurements for bacteria and stuff in micrometres. If you're in car sales you'd refer to mileage as \"100k\" vs. \"100,000 miles\".", "score": 2, "replies": [{"body": "Not really. It’s because an increase of 0.75% and an increase of 75 basis points are two totally different things .", "score": 8, "replies": []}]}, {"body": "Looks like I created a huge discussion within a day", "score": 1, "replies": []}, {"body": "Cause it is basic financial terms. Get use to it.", "score": 1, "replies": []}, {"body": "They have that jargon because for them it actually have a use case when describing things. \n\nNot sure why they need it however I just know it’s useful for them in some capacity", "score": -12, "replies": []}, {"body": "To keep the plebs confused. If they said the truth, like, we are stealing everything, people would be pissed.", "score": -20, "replies": []}, {"body": "really shows how clueless redditors are.. basis points is used everywhere in finance/accounting.", "score": -5, "replies": []}, {"body": "I have never heard any financial reporter refer to DJIA “basis points”.\n\nWhen referring to the value of equities in US), it’s common to use the term “points” rather than “dollars”. This is not the same as “basis points”", "score": -1, "replies": []}, {"body": "everything in finance and banking is made obscure and confusing on purpose, so the plebs don't understand it and can continue being helpless sheep to get robbed by the elites", "score": -2, "replies": [{"body": "Yeah, nah. All of this information is freely available, and is taught in basic finance classes. There is no conspiracy to keep the term \"basis points\" shrouded in secrecy.", "score": 0, "replies": []}]}, {"body": "Because most people are dumb as shit. Saying 75 bips means that less people will be publicly flogging themselves and torching places of worship over the thought of a 75% increase.", "score": -10, "replies": []}, {"body": "It’s so it looks bigger.  People who do this are used to that kind of compensation.", "score": -12, "replies": []}, {"body": "Basis points in interest rates are not the same as points on the Dow.", "score": 1, "replies": []}, {"body": "When im presenting to the leadership of my work the One Time Delivery, if it was 75% previous month and increased to 77% current month I said it increased by 2 points. It’s not correct to say it increased by 2% because is you look for the % between 77 and 75 it is 2.6%\n\nIt is more clear that the Feds use the 25 basis points.", "score": 1, "replies": []}, {"body": "I get the difference between a basis point and percentage, but what in the hell is the difference between a chicken and a hen?", "score": 1, "replies": [{"body": "A chicken is male or female a hen is female.", "score": 1, "replies": []}]}, {"body": "Points is %. When they say “up by 2 points.” They mean 2% from the previous number.", "score": 1, "replies": []}, {"body": "This whole thread reminds me of when I had to take a test", "score": 1, "replies": []}, {"body": "Probably done to confuse the man on the street, introduce some mystique.", "score": 1, "replies": []}, {"body": "Thanks for asking that, I learned something new today", "score": 1, "replies": []}, {"body": " stock analysts do this too. Its easy to grasp and I bet has something to do with the 1900's how they talked in general.", "score": 1, "replies": []}, {"body": "Let's say the interest rate was 1% and you decide as chair you're going to increase it to a 2% rate.  How much of an increase is it?  Well... it's 100%.  You have doubled it.  That means at the end of the day your average borrower's interest costs are also going to double.  But if you said news like that it'd be very scary to the general public who believe that a 1% to 2% increase is just a 1% increase.\n\nTo avoid sounding like idiots among the Wall Street types while also giving news that \"common folk\" can understand they use basis points as their language.", "score": 1, "replies": []}, {"body": "I feel like it’s hard to find a concise record of the recent hikes. One page: date, basis points up or down, total current rate. Can anyone please point me to that?", "score": 1, "replies": []}, {"body": "It’s more attention grabbing to use “points”. Turn on cable news and if they say the stock market is down .19% no one gives a darn. But use points and wholly shit u gotta sit thru the next commercial to see why it’s down so many points!", "score": 1, "replies": []}, {"body": "They are all one big crooked entity working together and sticking to one story remember people these are well paid actors they and the status quotes big corporations are all in this together remember we the people that voted for the greedy power hungry radical sick racist fools for politicians in office to bring in corrupt sick corporations to harm and steal the American peoples financial freedom and democracy.", "score": 1, "replies": []}, {"body": "Because it gets confusing and ambiguous if you said you raised interest rates \"by 0.75%\".  Normally that would mean multiplying the current rate (say 2.0%) by 1 plus the increase.  If you calculated that, you would get a new final rate of 2.15% which is wrong.\n\nSaying \"75 Basis Points\" (the full correct term) means literally raising by \"75 points of the basis rate\" or in the same units as the base rate, so you're adding 75 points that are of the same units as the basis rate, or 2.0, and you get to the correct answer of 2.75%.", "score": 1, "replies": []}, {"body": "Free at the point of use, pay for the maintenance, the labour for the maintenance, investment to spread profit to other sectors.", "score": 1, "replies": []}, {"body": "Can't speak for the interest rate hikes but I've always suspected that reporters use points when describing the Down Jones daily increase/decrease because it sounds more impressive. It sounds a lot more 'impressive' to say that the Dow has dropped 1,000 points than to say it's dropped 3%. \n\nMaybe I'm just being cynical though. I can't think of any other reason why the point drop would be more relevant than the % drop.", "score": 1, "replies": []}, {"body": "Because it’s a game to them", "score": 1, "replies": []}, {"body": "Because market people have their own jargon. I don’t get it either but I’ve learned it", "score": 1, "replies": []}, {"body": "I think the terminology is there to avoid confusion.\n\nYou could say an \"increase of 0.75%\", but does that mean an increase by adding 0.75% to the current interest rate, or does it mean an increase by 0.75%?  To me its pretty clear that an \"increase by 0.75%\" would be (new-old)/old = 0.0075, but it may not be clear to everybody.", "score": 1, "replies": []}, {"body": "A basis point is 1/100 of a %.\n\nThat's like asking why someone quotes something in feet instead of yards, although exchange rate is obviously different.", "score": 1, "replies": []}, {"body": "That’s easy. More concise and less ambiguous. It means exactly one thing on an absolute scale.", "score": 1, "replies": []}, {"body": "It makes them sound smarter, so you are tricked into thinking that they actually know what they are doing.", "score": 1, "replies": []}, {"body": "The answer is: when expressing changes in a % value, you use basis points (bps) to reflect the change. This is all part of standard financial writing.\n\nE.g. the change in “this metric went from 9% to 12% (+300 bps YoY).” \n\nNow imagine you wanted to reflect the same change in %, e.g. “this metric went from 9% to 12% (+33% YoY). Logically it works, but practically expressing changes in % in percentages is confusing and one of the basic rules of financial writing is to NOT be confusing and be as dry and clear cut as possible.\n\nSource: Finance Manager with a FAANG and we always write financial, operational, and planning documents like this. Have over 10 years under my belt and this is all standard by the book.", "score": 1, "replies": []}, {"body": "It sounds smarter", "score": 1, "replies": []}, {"body": "Basis points or points out of 100….", "score": 1, "replies": []}, {"body": "If you say \"the interest rate was raised by 0.75%\" are you saying it went from 2% to 2.75% or that it is now 0.75% higher than 2%, which would be 2.015%. \n\nSaying it \"was raised by 75 basis points\" makes it clear it's the former. Basis points are the units differences in percentages come in.", "score": 1, "replies": []}, {"body": "Basis points are more useful sonce you cant accidently misplace a decimal. Like corn being in cents per bushel", "score": 1, "replies": []}, {"body": "Who cares", "score": 1, "replies": []}, {"body": "To deceive regular people who aren't aware of non-basic financial terms. It would be simpler to say \"interest rates increased to 2.75% from 2%\".", "score": 1, "replies": []}]}
{"title": "Peloton fundamental analysis and valuation - The market is irrational!", "selftext": "Peloton has been a public company for less than 3 years and its share price has been all over the place. It is now down over 90% since its all-time high back at the end of December 2022 and the volatility has been crazy.\n\nThe goal of this post is to analyze the company's fundamentals, lay down some assumptions about the future, and value the company as a whole.\n\nFeedback is always welcomed!\n\n&#x200B;\n\n**What is Peloton?**\n\nIn a nutshell, it is a company that's making money by offering:\n\n\\- Connected fitness products - Exercise equipment (bikes, treads, and soon rowing machines)\n\n\\- Subscriptions - Media content related to fitness (pilates, strength training, stretching, yoga, meditation)\n\n\\- Fitness apparel (insignificant in terms of revenue at this very moment)\n\n&#x200B;\n\n**The hype**\n\nAs we all know, the pandemic caused this company's share price to go through the roof. The demand for their products skyrocketed thanks to the lockdown and the media coverage of their products.\n\n***Connected fitness products***\n\nThe revenue of their connected fitness products grew from $734m in 2019 to $1,5b in 2020 (99% growth) to $3,2b in 2021 (115% growth).\n\n*\\*Note - Their fiscal year ends 30 June, hence, 2021 is the year starting July 1st, 2020 to June 30th, 2021.*\n\nHowever, these products are generally considered more premium/luxury. For the same amount of money, one can subscribe to a budget-level gym for roughly 10 years and have access to a lot more equipment.\n\nDuring this period, the gross margin that they had on these products was around 40%, which is quite high for a company in this industry, but the increased demand did its job well.\n\nUntil 2022 started and the growth was nowhere to be found. The revenue declined to $2,2b (-31%) and the decline was over 50% if the last quarter was to be compared year over year.\n\nNot only that, but the gross margin was -11%. No, it is not a typo, they lost money on the sale of these products.\n\nWhen there's a huge decline in the level of demand, it has a huge impact on the prices (Economics 101). Of course, the tough part was to estimate the level of demand for the coming period with all the uncertainty.\n\nIn 2022, the management put a lot of capital into inventory to meet the demand, which wasn't as high as before. So, at the end of 2022 (As of June 30th), there's roughly $1.1b in inventory. That's roughly 50% of all the sales they made in the entire last year. As the prices decline, they had to take impairment for some of these products.\n\n***Subscriptions***\n\nThis, in my opinion, is their cash cow segment. It has been growing from $181m in 2019 to $364m in 2020 (101%) to $872m in 2021 (140%) to $1,4b in 2022 (60%).\n\nThe gross margin improved from 43% to 68% during the same period.\n\nIt seems that the company is more focused on selling connected fitness products as a way to reach out to its target customers and actually make money on the subscriptions.\n\n&#x200B;\n\n**The other operating costs**\n\nIf we combine both revenue sources together, the total revenue for the last 12 months was $3,6b with a thin gross margin of 19% (gross margin of close to $700m).\n\nEvery young company is known for incurring losses due to heavy spending on Research & Development and Sales & Marketing that would allow them to grow fast. In that respect, Peloton is no different.\n\nIn 2022, the spendings were as follows:\n\n1. Sales & Marketing - $1b\n2. General & Administrative - $1b\n3. Research & Development - $360m\n\nIt is quite clear that the gross profit of $700m is not sufficient to cover these main operating expenses. Peloton lost over $1.6b from its operations (-46% operating margin). This is not that surprising as the majority of the high-growth companies are losing money due to the higher than average spending on Sales & Marketing and Research & Development. However, when the growth is no longer there, that's when it becomes ugly. In addition, I was not impressed by the level of R&D spending as Peloton's long-term success is highly dependent on its innovation.\n\n&#x200B;\n\nBut that's not all. They had 3 \"one-time expenses\" during the year:\n\n1. Impairments - $562m - Mainly related to goodwill, part as mentioned above to inventories\n2. Supplier settlements - $338m - Based on the information available, it relates to the settlement of litigation with iFIT\n3. Restructuring - $181m - As the demand falls, the number of employees is reduced\n\nIt could be argued that these are one-time expenses (as they were non-existent in the past), however, as the demand is falling and their inventory levels are high, it would not be surprising if there are further impairments, further restructuring, and who knows whether there will be further supplier settlements. If we take all of this into account, the operating loss of the company was -2,7b (-76% operating margin).\n\n&#x200B;\n\n**The balance sheet**\n\nOn the balance sheet, apart from the high inventory levels mentioned above, there's around $1.3b in cash. Although on its own is a big number, it doesn't seem so big when we take into account the last year's losses company had. If the margins don't improve dramatically, they will be raising capital during the next 6-12 months.\n\nThey already have a debt of $2,4b (for comparison purposes, their market cap is $3,6b) so they're in a tough position.\n\n&#x200B;\n\n**Striking deal with Amazon**\n\nIn the last 7 days, there were 2 huge headlines. The first one was the deal that Peloton announced that part of their products will be available for purchase in Amazon US stores.\n\nThe share price went up around 20%.\n\nOnly a few days later, they shared the 2022 earnings and the share price returned to the same levels.\n\nThis is a great example of how short-sighted the market can be at times. The deal with Amazon could be a great way to dispose of a large portion of the inventory that's just sitting there, but Amazon will take its share. That means Peloton's margins are not going to be as high (let's not forget, they're already losing money on their connected fitness products).\n\nThe more important question is, is there going to be increased demand for their products, regardless of whether they're being sold through Amazon or direct to the final consumer?\n\n&#x200B;\n\n**The key assumptions about the future & valuation**\n\nIf we take a look at the analysts' expectations regarding next year's revenue, it ranges from $2,29b for the entire year (-36% compared to 2022) to $5,82b (+63% compared to 2022). This huge expectations gap shows the uncertainty around the company.\n\nMy personal views are that the Amazon deal will help their connected fitness products to not have a significant revenue decline, while the subscription revenue is still growing strong. However, I don't expect their operating margin to improve significantly in the next year.\n\nHence, my assumptions are as follows:\n\n&#x200B;\n\n||2023|2024 to 2027|2028 to 2032|\n|:-|:-|:-|:-|\n|Revenue|\\-5% decline|5% growth / year|3% growth / year|\n|Operating margin|\\-20%|slowly improve to 5%|slowly improve to 15%|\n\nMy expectations are that the company has to focus more on cost-cutting and less on significantly growing revenue (other than their subscription revenue)\n\nDiscount rate: 8% today, increasing to 8.8% in 10 years\n\nBased on those assumptions, the fair value of the company is close to $1,2b (**$3.48/share)**\n\nThe current market cap is $3,58b ($10,61/share)\n\n*Note: I have taken into account the cash, debt, and deferred taxes on their balance sheet as well as the outstanding equity options.*\n\n**What if my assumptions are significantly wrong?**\n\nBased on the assumptions above, the revenue will grow by 39% in 10 years and the operating margin will be 15%.\n\nI am aware that my assumptions could be significantly wrong. So, let's take a look at how the value of the company (per share) will change based on different assumptions regarding the revenue 10 years from now and the operating margin:\n\n&#x200B;\n\n|Revenue / Op. margin|10%|15%|20%|\n|:-|:-|:-|:-|\n|24% ($4,4b)|\\-$1.9|$2.7|$7.2|\n|39% ($5,0)|\\-$1.6|$3.5|$8.5|\n|192% ($10,5b)|$1.3|$11.3|$21.4|\n|300% ($14,3b)|$3.2|$16.7|$30.3|\n\n&#x200B;\n\nThis table illustrates well how important it is for Peloton to cut costs and improve margin. In some cases, the fair value of the company is even negative, meaning it's not worth anything! Of course, one can argue that those assumptions are too pessimistic, but there is a chance that it plays out.\n\nOf course, if they manage to grow 300% in the next 10 years (which is the assumption of the most optimistic analyst) and on top they improve the operating margin to 20%, there's 3x upside.\n\nHowever, that means Peloton will need to bring $14,3b in revenue in 10 years. Just for comparison purposes, the total gym revenue in the US is $32b/year. This is a mature market, so growth is not expected.\n\nLet's not forget that the share price at the peak of the hype was over $160/share. If that seems crazy, it is only because it was crazy! To justify a price of $160/share, Peloton needs to bring in 2x the revenue of all US gyms combined and have a higher operating margin than 25%.\n\n&#x200B;\n\nWhat are your thoughts on Peloton as a company?\n\nAlso, feel free to provide feedback regarding the analysis, that is always appreciated!", "id": "wzxsdz", "created_utc": 1661699507.0, "score": 153, "upvote_ratio": 0.85, "num_comments": 106, "comments": [{"body": "I think your assumptions were, if anything, generous.  And the company is still overvalued 3x.  I think a significant possibility here, too, is that the nature of this sort of exercise is faddish.  As such, Peloton will decrease in popularity and won't hit your revenue projections.  I'm skeptical of continued high growth in their subscriber business, but that's probably because I'm biased against the company.", "score": 80, "replies": [{"body": "dead product\n\nselling on amazon is the nail in coffin.\n\namazon is where shit goes to die, or get discounted heavily.\n\n&#x200B;\n\nWhen most of america is made up of fatasses who don't give a shit about fitness, that doesn't give me much faith in an exercise bike stock.", "score": 29, "replies": [{"body": "I agree. I've had a peloton for two years and I still use it regularly... but I was also someone who was already in the habit of regular at-home workouts. Clearly plenty of people enjoy peloton bikes and treadmills and continue to use them. \n\nBut everyone and their mom bought a peloton during covid, so I don't see a *ton* of room for growth at this point. How many people in the US are active exercisers? How many of those are interested in at-home spin classes? And how many of those people *don't already own a peloton*? I dunno, it can't be a huge number of people.", "score": 6, "replies": [{"body": "How many people will sell those pelotons collecting dust? The used market will compete with new purchases.", "score": 3, "replies": [{"body": "In order to use one you buy used you need to pay the insanely expensive subscription.", "score": 4, "replies": [{"body": "The \"you will own nothing\" business model.  Just get a real bike.", "score": 4, "replies": [{"body": "Yeah, it’s crazy how much the subscription is on top of an incredibly expensive bike. \n\nBut they get people in because of the videos and ecosystem. \n\nPersonally I use a regular bike on a smart trainer with Zwift. But I would appreciate a service that had workout videos that linked with my trainer. It’s a missing area in the market.", "score": 1, "replies": []}]}, {"body": "Interesting.  Good to know.", "score": 1, "replies": []}]}]}]}, {"body": "iphones sell on amazon?", "score": 0, "replies": []}]}, {"body": "Thank you for sharing your view, much appreciated :)", "score": 18, "replies": [{"body": "Did you run a DCF?", "score": 2, "replies": [{"body": "Yes, indeed.", "score": 3, "replies": []}]}]}, {"body": "Agree with you. Another thing is that they need to grow their per subscriber value. They are adding the lite version of their app subscribers to their total subscriber base. This subscriber value is 1/3 that of the full membership version.", "score": 1, "replies": [{"body": "My wife subscribes to Peloton lite for something like $15/mo, and she uses a smart TV in front of a great bike that was less than half the price of a Peloton.", "score": 1, "replies": []}]}, {"body": "That's a bingo from me.  Jan 2024 debit put spreads $10 / 7.50 opening tomorrow in the rollover IRA account", "score": 1, "replies": []}]}, {"body": "It seems likely that they will just be bought out eventually as their subscriber count is their largest MOAT considering people really do enjoy their instructors, classes, and how engaging they are.\n\nSubscriber count is what matters most to Peloton. It's now bringing in more revenue than their actual equipment. I believe the Amazon deal makes a ton of sense for Peloton as it opens up the market for users. People are confident when they shop at Amazon because the customer experience is more secure. \n\nTheir new CEO is the former CFO of Netflix and Spotify. He's all about subscriber count and that's honestly where they need to be focused on.", "score": 45, "replies": []}, {"body": "I generally agree with everything here. To be fair though, we just went through a once-in-a-generation pandemic with an unprecedented lockdown. There was a very reasonable hypothesis that this period, along with normalized fully-remote work, was going to rapidly accelerate adoption of thing like e-commerce, at-home fitness, etc. that would persist after lockdowns ended. Total US gym revenue is a bit of a red-herring because something like 10% of the population has a recurring gym membership and the vast majority of that is made up of inconvenient, budget fitness providers around medium-to-large population centers. I don’t think anyone is crazy for thinking there a massive opportunity for disruption that could blow the lid off the current market size.\n\nA lot of people and businesses bet on this both in the market and in business models. It turned out to be mostly wrong, but I don’t think it was totally irrational.\n\nETA: Most major breakthrough investments looked completely irrational before they were breakthroughs. There was a time when the thought of a text-based web search being worth $1T would have been insane", "score": 17, "replies": [{"body": "I for one will never be stepping into a gym again after learning how well you can work out at home.", "score": 2, "replies": []}]}, {"body": "I didn't see any mention of legal fees and the deaths that occurred. Didn't a few kids die from these machines.  Optics like this are to measure but sure can play a role.", "score": 44, "replies": [{"body": "Thank you for the addition. There have been a few scandals around the company, the worst one involves a death of a child that is being investigated. Based on the latest information Peloton disclosed the following:\n\n\"At this time, we are unable to predict the eventual scope, duration, or outcome of the investigations\". \n\nApart from that, there's the famous advertisement that didn't go in their favor.", "score": 11, "replies": [{"body": "Yeah, a new FITNESS company, down 90% selling overpriced bikes and subscriptions, operating on a loss, while having their products accounted for several deaths including a kid?..... yeahhhhhhhhhhh good luck with this one. \n\nSeems like you're trying to do DD to talk yourself into buying this stock because even you know it's a bad idea", "score": -36, "replies": [{"body": "OP said the company is worth 30% of what it's trading for.  Do you always comment on DD posts without actually reading them?", "score": 40, "replies": [{"body": "Once in a while, there are comments like this. So far, I've understood that the best way to deal with them is to completely ignore them...", "score": 37, "replies": [{"body": "I don't know, I enjoy when someone is confidently incorrect and then is corrected in a humorous and slightly rude manner. It's honestly one of the best parts of reddit tbh, cause like, can't do that to people on the job all too often and if you're in a store some people are liable to fight over shit like that.\n\nSeeing dumbasses get theirs online brings me joy.", "score": 4, "replies": []}]}]}, {"body": "Read the fucking post, man.", "score": 15, "replies": []}, {"body": "Reading isn't your strong suit is it", "score": 12, "replies": []}, {"body": "Helps to read the post before making dumb ass comments..", "score": 9, "replies": []}, {"body": " More like a DD to try and talk other people into buying it... bag holders are predictable.", "score": -21, "replies": [{"body": "Lmfao", "score": 4, "replies": []}]}]}]}]}, {"body": "Ok that is what DD is supposed to look like.", "score": 48, "replies": [{"body": "Thank you, I am glad you enjoyed the post!", "score": 17, "replies": []}]}, {"body": "opinion?  I am not a fan.\n\nIts gym equipment - a life optional item - and heading into a recession.\n\nThey have zero moat and are swimming in a sea of other gym services and gym equipment providers.\n\nLots of bag holders on this company - I'd stay far, far away.", "score": 9, "replies": [{"body": "The moat is their subscriber base. I don’t care what you’re doing, accumulating that many paying subscribers isn’t easy. \n\nWhere they failed is trying to double down on capital intensive projects and inventory. Unfortunately the founder was a raging idiot who thought this was going to be a trillion dollar company after the pandemic juiced up the company’s numbers.", "score": 2, "replies": [{"body": "only thing about subscribers is during recessions people trim back - see other services like netflix etc.\n\nTaht said, Peloton users are kinda wealthy AF, but i do foresee their biz slowing down even more.", "score": 1, "replies": []}]}]}, {"body": "I saw this and thought oh my god someone trying to pimp a shit company then read the dd and thank you for restoring my faith in someone being honest.\n\nThanks!", "score": 15, "replies": [{"body": "Thank you for your kind words! This is something that I do for fun, so why not share my analysis with the rest:)", "score": 3, "replies": []}]}, {"body": "It’s a stationary bike with an iPad taped to it. This company is shit no need to waste with fundamentals", "score": 58, "replies": [{"body": "the company has no moat and people have a million different options to exercise. Peloton is also expensive as hell in a time of great economic uncertainty. I just don't see why anyone would want to bet on this.", "score": 14, "replies": [{"body": "The only moats they have are their music licensing deals and their instructors. If the instructors have good vesting schedules and solid non-competes then they’re good. Having non-generic music and a variety of instructors for each subset of their users is key. \n\nThat being said they’d be a better fit if Apple bought them and rolled them into their services revenue. Peloton is weakest in their tech/app experience imo and could use tech backing to make the experience better.", "score": 1, "replies": [{"body": "> music licensing deals and their instructors.\n\nthat's not a moat. anyone can start a company, get music licensing deals, and find instructors.", "score": 0, "replies": []}]}]}, {"body": "This type of reductionism is how you lose money and miss opportunities. Not saying peloton is it, but this is a bad investor mindset. It’s one of the classic “mindsets to watch out for”.\n\nJust FYI if you care. :)", "score": 14, "replies": []}, {"body": "It's also corrupt and degenerate af", "score": 1, "replies": [{"body": "Why is that?", "score": 1, "replies": [{"body": "Imagine paying to own your own workout equipment that locks itself when you can't pay for the subscription services it offers... Like they're trying to rent you an item you own", "score": 4, "replies": [{"body": "It's not a new idea but it is fucked.", "score": 4, "replies": []}]}]}]}, {"body": "No wireless. Less space than a Nomad. Lame.", "score": 1, "replies": []}]}, {"body": "Here’s my DD. \n\nI bought one. \n\nI loved it. \n\nUsed the shit out of it for 3 months.  \n\nGot bored. \n\nGyms opened. I like humans. \n\nPeloton going on Craigs list next weekend. \n\nI’m not alone.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Thank you for sharing your insights as a user of the product :)", "score": 1, "replies": []}]}, {"body": "Supply chain disruptions, seasonally weak demand, higher parts, labour, raw materials, freight costs.\n\nThey had lower than expected subscription revenue.\n\nInterest expenses rose to 16.5mm from 9.1mm as the share outstanding also rose to 338mm from 299mm.\n\nIn may of 2021 They agreed to recall all their treadmills after over a dozen incidents and 1 death of an infant.  After they first refused the recall the treadmills they are now faces multiple lawsuits and higher costs to recall the treadmills.\n\nInsiders have been selling shares.\n\nPeople are returning to gyms and spin studios.  \n\nMembers have very slightly started to decrease q3 7mm, q4 6.9mm. Loss of 2%.  Connected fitness subscriptions also went down q/q.  I personally believe the numbers were initially inflated at the beginning of the year with free trails.  \n\nFrom august report “we expect the market for connected fitness to remain challenging for the foreseeable future in FY23.\n\nTheir primary concern right now is preserving capital- not growing the business. \n\nThey have done a terrible job at anticipating consumer preferences and anticipating appropriate pricing levels.\n\nActual operating margin is (-47.47%). Ouch!  EPS this quarter was (-2.68). Yearly it is (-8.33).  Analysts anticipate that peloton will not be profitable for at least 3 years.  There is no moat.  \n\nPositives they have improved their free cash flow q/q.  I like their new business model of (FAAS) fitness as a service.  Where you can rent the bikes. They are first movers in this space. They just joined amazon for first gen bikes and fitness accessories.  There subscription revenue has increased.  They say in their latest earnings report that they are focusing on getting a handle on costs, shipping and materials.  They have an experienced board.\n\nPersonally I love a good come back story.  However I would not buy shares of this company at this time.  I’d like to see one more quarter to see if the ship will respond (CEO’s analogy at the end of his quarterly report).", "score": 3, "replies": []}, {"body": "Holy shit just saw it was 95% down since it’s COVID peak. Did they sell shares or did something fundamentally change?", "score": 2, "replies": [{"body": "No fundamental change. Don't forget, it went up 550% because of the pandemic and the media coverage, so the hype around the company went to a level that made no sense. So, this decline is a kind of a bubble burst for their share price.", "score": 1, "replies": []}, {"body": "No fundamental shares, just a bad company that got hyped up\n\nNo one’s gonna pay stationary bike subscription", "score": 1, "replies": []}]}, {"body": "Where's the TLDR?", "score": 2, "replies": []}, {"body": "I love the product hate the stock.  I’d bet it’s bankrupt within 2 years.", "score": 2, "replies": []}, {"body": "Nice analysis. It's a bit too much for me to dissect on a Sunday, but I just want to say thanks for posting 👍", "score": 1, "replies": []}, {"body": "No one will be using this in ten years. Company is ass.", "score": 1, "replies": []}, {"body": "\"the market is irrational\"... no shit?", "score": 0, "replies": []}, {"body": "I like Nautilus", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Did you read the DD? It kind of goes in that direction :)", "score": 2, "replies": []}]}, {"body": "Trash. Only way it goes up is if someone acquires it. I wish I had the balls to short thing", "score": -3, "replies": []}, {"body": "Yeah huge waste of time looking at fundamentals.", "score": -2, "replies": []}, {"body": "As a cyclist: peloton is a no from me. Zwift es the way to go", "score": -1, "replies": []}, {"body": "BAGHOLDER DETECTED BEEP BOOP", "score": -1, "replies": [{"body": "Disclosure, I do not own any Peloton shares :) Also, did you read the DD? Why would I own shares in a company I don't believe is undervalued? :)", "score": 2, "replies": [{"body": "I'll be honest I didn't. My lizard brain got bored after the first sentence. Tldr?", "score": -1, "replies": [{"body": "Peloton is down over 90% since the all-time high of $10.6/share. Based on my assumptions, it's worth less than $4.", "score": 3, "replies": []}]}]}]}, {"body": "They just lost a $1.2B in one quarter.  In a once in a lifetime event that was tailored made for a premium at home fitness company they couldn’t make money, what hope do they have in the future.", "score": 1, "replies": []}, {"body": "Well, the whole Covid time was nuts for stocks.  Nothing was rational.  This is sort of the correction, and we're just barely starting to settle.\n\nPeloton came in at a hot time in the market.  They had massive growth due to good marketing and a lot of people at home.  They did not handle the growth very well and had problems with manufacturing.\n\nThere's not really anything majorly wrong with the company, but how well they do depends on what steps they take.  They were a 200 million company before the pandemic and than rapidly rose to 6x that in like a year.  The company has to be really well managed to take that on smartly.  And then this whole last year has been massive supply chain issues and huge increases in steel costs, shipping costs, transport delays, and a whole host of messes that extremely hindered lots of companies.  It has been so bad that if you managed to survive it, you did pretty good.\n\nThe biggest question right now is what is Peloton's stable revenue point?  What is their actual normal market share?  And at this point, how profitable are they?  That's the problem right now.  They need to actually get to an equilibrium, stop bleeding money, and become profitable right now.  And for most manufacturers, the method to get here in the Covid affected market place is to raise prices...a LOT.  Materials cost a lot more.  Shipping costs a lot more.  A company doesn't survive without transferring this cost to the customer.  The customer HAS to pay 40%, 60%, or 80% more per product in order for companies to survive.  No buying means a dead company.  And the company simply can't eat that cost for several years trying to wait for the market to rebalance.  It might take 5 years to get the market to be near normal again. Looking at Pelotons price increases for their products, they are WAY under pricing them for the huge increase in costs they're incurring in this market space.  A 20% bump won't cut it.  They're just going to eat losses until they die.  And yeah, it's shit to dump like an 80% price bump to customers, customers who do NOT understand why things got so expensive.  Most folks just think companies are price gouging.  Nope.  They're just trying to survive in a market where the cost of things like steel went up 3x, 4x, or higher, and your product is made out of that steel.  Even right now when prices have gone back down some, steel is still 2x what it should be, and it's only 2x if you buy in bulk which ties up a pile of your capital in inventory for months.  Materials are just really expensive, period.  And Peloton just needs to ask for the dollar amount they need in order to be functional, or they're going to bleed themselves out.\n\nThe problem right now is they're doing as bad as they ever have, and they currently are not doing what they need to to change course.  They need price increases, big price increases.  They also have to understand that their competitors are in the same exact boat as them and taking the same cost hit as them.  Everyone's in the same boat.  All you can do is run the business correctly to stay alive.  Want to be in an advantageous place versus your competitors?  Optimize the product for the market.  Beyond that, there's not much you can do.  Make a good product and run the business smartly.", "score": 1, "replies": []}, {"body": "Acquired has a decent episode about peloton", "score": 1, "replies": [{"body": "What is that", "score": 1, "replies": [{"body": "A podcast. Very good stuff. Lots of sponsors tho, that’s the annoying part", "score": 1, "replies": []}]}]}, {"body": "When they open their ecosystem to 3rd part like Netflix, Amazon, HBO, etc it will be more valuable for a time.", "score": 1, "replies": []}, {"body": "I was in the mall, busiest I've ever seen it. The pelaton store was a ghost town.\n\nNobody wants to spend multiple thousands with recurring monthy charges on a stationary bike. And if they do, they already did.", "score": 1, "replies": []}, {"body": "Good analysis. Unsure about some of the turn around assumptions.  It seems to be waiting for a buyer. Do you see Amazon or Etsy is waiting for a more realistic price to sell ?", "score": 1, "replies": []}, {"body": "You made a mistake in the first sentence, ‘peloton is a company making money by’, they don’t make any money, they just burn it. Also their bikes have a -98% gross margin. Garbage company that is going bankrupt in a few years unless someone buys it", "score": 1, "replies": [{"body": "They make money by selling certain products and services and they spend money in certain ways. Overall, as they're not profitable, they are losing money, you are correct.", "score": 1, "replies": []}]}, {"body": "How much is a company that isn't on track to making money worth?", "score": 1, "replies": [{"body": "It's more complex than that. That's why I tried to explain it a bit better with the last table at the end. It all depends on the revenue they bring and the margins.", "score": 2, "replies": []}]}, {"body": "Lovely work! I am new to DD and have a question. Are you assuming any terminal value for this business in calculation of NPV?", "score": 1, "replies": [{"body": "Of course, almost the entire value of the business comes from the terminal value as the PV of the free cash flows until year 10 is very limited. I project negative free cash flows in the next 4 years.", "score": 2, "replies": [{"body": "Thanks! Then that makes this business even higher risk. Does it mean we need to increase the discount rate?", "score": 1, "replies": [{"body": "There are many ways to adjust for higher risk, either by expected revenue, reducing expected margin or applying a margin of safety on the final valuation. I am normally using a combination of all three.", "score": 2, "replies": []}]}]}]}, {"body": "I bought and sold my peloton bike. It’s a solid product but very expensive.  Their classes and social aspects are severely lacking.  I think it’s a slow bleed company as competitors eat their lunch", "score": 1, "replies": []}, {"body": "What’s their business reason for not selling apps instead? Since they are losing on equipment and making on subs?", "score": 1, "replies": [{"body": "They are selling apps, that's part of the subscription revenue.", "score": 2, "replies": [{"body": "Oh wow… then this company is screwed. I thought they have one more rabbit to pull out of the pants\n\nEdit: I thought the subs and apps were only for their bikes owner", "score": 1, "replies": []}]}]}, {"body": "I just don't see a future for a company that tries to charge $1500-$2500 for a stationary bike and nearly $4000 for a treadmill....I paid $300 for mine and I actually work out all the time.", "score": 1, "replies": []}, {"body": "As a peloton subscriber with a bike, there’s a ton of opportunity in this space if they can harness it quickly enough. \n\nThe end goal should be: offer a suite of connected home gym products that require a subscription to use effectively. They’ve announced the rower is coming. If they could buy Tonal or release a similar product, you’re basically 90% there IMO. How many well-off people would love to have a fully connected home gym? Probably a lot. \n\nYou’re right for this comparison - nobody is buying a peloton who actually wants to pay for 10 years of 24/7 fitness. They want it for the convenience and maybe even a little bit of the status. On the flip side, people who say it’s “just a fad” or “pandemic is over; people want to run outside” don’t understand it either. Frankly anyone saying those things just come off as ignorant. \n\nI’d like a tonal for my next product, but if Peloton came out with their own version, I’d buy it in a heartbeat. I’m not an investor and never really was but I think there’s opportunity. Current management team makes me hopeful but I can’t tell yet.", "score": 1, "replies": []}, {"body": "Anyone else remember seeing videos of their treadmills “eating” kids alive. Then peloton sat on their thumbs for weeks if not months.", "score": 1, "replies": []}, {"body": "Peloton should open up shop in the middle east. Lots of fat people there. Too hot/socially unacceptable to go outside to exercise. Oil money. They just need some arabic speakers. 🤔", "score": 1, "replies": []}, {"body": "If they were smart, they could have invested in gyms, other exercise machines that are affordable and selling health products. Now that their cash has dwindled due to gambling on a subscription service and these exercise bikes, they are pretty screwed. They have a buttload of bikes they can't even give away (Exaggeration ofcourse) because they gambled. They would need an injection of cash and really good guidance to invest in other avenues. Proform and a handful of others already own the residential fitness market. They tried and they blew it.", "score": 1, "replies": []}, {"body": "I hate Peloton as a company because of the locked features/subby shit on the treadmill.   \nI like the treadmill, it's a pure innocent soul.", "score": 1, "replies": []}, {"body": "I am wondering about the Amazon deal actually is an early test of the product for AMZ to buy Peleton for its subscriber base, and for its health / fitness analytics. Given amazons push in to health devices and health services generally this would be a cheap way for them to own a solid chunk of a market. \n\nI don’t know what that means for the price of Peleton shares though. \n\nAny thoughts on this?", "score": 1, "replies": [{"body": "It could be :) Acquisitions are very difficult to forecast, but I would not be surprised if they're acquired. However, my expectations would be at a lower price than where the company is at today.", "score": 1, "replies": []}]}, {"body": "I read your post in the value sub, unfortunately it was deleted when i was going to post my answer. First thanks for sharing and taking the time.\nI dont precisely follow this company and not from the US so never had contact with the products/ services it serves.\nI am just basing my comments on your analysis.\n\n- Try to check why they had imparments on the products, given that they are carried at cost and this is not the fashion industry I personally find it odd, so a double click there might deliver further insight.\n- I dont get why these guys delivered negative gross margin in the machines bsuiness… they are still selling more than prepandemic levels, where gross margins negative prevously as well? Otherwise I can see why on an inflationary enviroment they would drop their machines prices that much for it to be negative. I could see a margin contraction but from 40 to -11 seems too much, double check that.\n- Regarding the disc rate, how do you get to the 8%? How much is the Kd? Are you using fcff or fcfe?\n- Regarding the assumptions which are difficult to asses, you need to understand where the focus is going to be. If they manage to shrink the product business, and grow the service protion, the revenues might not grow, but the margins could expand significantly and so would the roic. Try to hear the earnings calls maybe there you can get a grasp of where they are heading.\n- One last issue to watch out for is the debt schedule and its maturities, if they need to roll debt, they will probably do so at a much higher rate given the bs deterioration and the higher rates, so watch out for lower cash flow below the operating line.", "score": 1, "replies": [{"body": "Hey there, thank you for the comment.\n\n* Yes, you are absolutely right, they do have impairments on their products, I've mentioned that in the post above. The problem is that they only have released the earnings, but not yet the 10k, so not much can be extracted other than they had impairment on intangible assets & their products.\n* I am using the FCFF, Cost of debt around 4% (pre-tax).\n* I fully agree, it really depends where the focus would be. Based on their current situation, my thoughts are that they should really focus on improving the margins as that's business critical. The management doesn't provide any long-term guidance due to the uncertainty\n* I fully agree on the debt schedule, same issue as the first point, more info will be available once they publish the 10k.", "score": 2, "replies": []}]}, {"body": "I have like $60 in Peloton purely because of how amazing their subsidiary Precor's products are. Their gym equipment makes Life Fitness look like absolute trash and it is widely recognized at my gym; the Precor equipment is always taken and Life Fitness is vacant. Never been on a Peloton bike. That could be $60 I never see again but I *had* to try to invest in Precor.", "score": 1, "replies": [{"body": "Fair enough :)", "score": 1, "replies": []}]}, {"body": "Look up Saris as the canary in the coal mine for at home fitness. I also think Peloton has lost it's allure.", "score": 1, "replies": []}, {"body": "Great analysis.\n\nI was sniffy about the whole thing for many years seeing it as a toy for the rich. I had gone to traditional spin classes twice a week.  Doctor advised me to get one as a way for me to get my heart in shape.\n\nI did the math and after 6 months, the bike and subscription has more than paid for itself.  I use it everyday, and the data I get from it, my doctor loves as it shows him where I need to focus.\n\nThe subscription each month is not that high, it is the price of a medium gym.  There is more than just the bike, you have a whole host of activities to do. Also a subscription can cover upto 16 people.\n\nThe thing that puts most people off is the high startup price.  That is the hard pill to swallow.\n\nTo the business\n\n- It's a lifestyle product, no magic pill to make people fit. It like everything else requires the user to put in effort. Huge porblem.\n\n- It has a large captive audience during sessions infront of a beautiful large interactive screen. I believe this is the real platform. I can see this being opened up to 3rd parties to offer content and experiences.  The screen can be rotated for other activities.  We can also include adding netflix (other media) to the sessions. Do not under estimate this opportunity IMHO. \n\n- subscriptions should be offered at a discount, say 12months for 10months cost, upfront. This will ease the perceived high cost.\n\nI am bullish on the company and I believe the right ceo is in place now, to take over as more of a subscription based business. The previous ceo was the right one to get the company to where it is, but wasn't the right one to truly monetize the platform.", "score": 1, "replies": []}, {"body": "I shorted it at the top of the last ( 20% pump) before earnings. Happy on my earnings. Crap overvalued stock", "score": 1, "replies": []}, {"body": "I would be worried that they have to much reliance on the instructors. Think about it, if they really like their instructor they probably follow them on Instagram Facebook etc. Now let’s say that instructor wants to go into it solo/self-employed. They quit peloton and of course can’t advertise their own business through that platform but what they can do is post and all the social media platforms that they have a large following on about their new venture. I think you can see where this is going.…", "score": 1, "replies": []}]}
{"title": "I Am Shorting Africa (All of it)", "selftext": "\n\nYes you read that correctly. Africa is an improvised country. Think about it, TSLA isn’t based in Africa, BBBY isn’t based in Africa, GME isn’t, AMC, frankly any of the stocks that make you people splooge in your undies. The countries fundamentals are pretty bad. The only thing I remember about Africa is that one warlord Joseph Koney or something. Personally I don’t think warlords are good for a nation. \n\nI also don’t think Africa has a Wendy’s. That is something that would be bad for the market. If anyone wants to buy puts on this country they should hop in now before the FED drops some bad news about Africa. (HINT HINT: ITS BAD NEWS THINK BLOOD DIAMONDS) \n\nTLDR: Africa puts = Africa Gains", "id": "wzmw5x", "created_utc": 1661662328.0, "score": 9, "upvote_ratio": 0.55, "num_comments": 107, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|19|**First Seen In WSB**|1 year ago\n**Total Comments**|731|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wzmw5x)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wzmw5x)\n    \nHey /u/IamCluLess, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Yes you do that. While you're at it, have you heard about the highly regarded Nigerian prince and his charity works?", "score": 23, "replies": [{"body": "No. I didn’t know Africa was a monarchy. However, I do admit I don’t know everything about everything. I may try to convince him to buy puts also. (HINT HINT NOT INSIDER TRADING)", "score": 6, "replies": []}]}, {"body": "But Elon is an African American", "score": 14, "replies": [{"body": "How Is he from two countries at once?", "score": 6, "replies": [{"body": "The middle passage", "score": 2, "replies": []}]}]}, {"body": "Wakanda forever!", "score": 9, "replies": [{"body": "Calls on wakanda", "score": 6, "replies": []}]}, {"body": "Well, there's only one answer for this GODtier like DD: you son of a bitch, I'm in!", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|4886)", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 2, "replies": []}]}]}, {"body": "I saw several African companies have four consecutive quarters of $0.01 profit.\n\nOh wait, never mind, that was India.", "score": 9, "replies": [{"body": "This guy gets it. Puts on Africa", "score": 8, "replies": [{"body": "Going to downvote Toto right now", "score": 4, "replies": [{"body": "Toto is the dog from Wizard Of Ox.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "No, Totoro is the capital of Canada. You’re thinking of typhoid", "score": 7, "replies": [{"body": "No, Typhoid is a Warhammer 30k character. You're thinking Tungsten", "score": 3, "replies": []}]}, {"body": "My neighbor?", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I blessed the gains down in Africa! Or is it missed the gains? I hope not…", "score": 5, "replies": [{"body": "Winning comment right there ⬆️\n\nHave my useless shitty free award you beautiful bastard", "score": 2, "replies": []}]}, {"body": "Hate to rain on your parade here but puts would be priced in. The whole place is a shithole where some countries have incredible statistics like 1 of 5 children die before making it to age 5.\n\nThey got diamonds and precious metal or some shit though. For better or worse, everywhere else has precious metal and diamonds can be made in labs. \n\nIf this wasn’t the case, Africa wouldn’t be be a war torn shit hole chock full of human rights violations and other countries would jump in for the spoils under the guise of “lol we helpin tho”\n\nAfrica’s sole redeeming feature is lions, and what I’m getting at is Africa has nothing of value that can’t be found somewhere else and of higher quality. Suitable drinking water being a good example.", "score": 8, "replies": [{"body": "Israel controls their diamond mines, and China isnt far behind controlling other metals", "score": 5, "replies": []}, {"body": "China would disagree", "score": 1, "replies": []}]}, {"body": "I short you - all of you", "score": 6, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 2, "replies": []}]}, {"body": "Can confirm, Africa is the worst place on Earth. They are busy being colonized by China at the moment.", "score": 7, "replies": [{"body": "Idk if I’d say worst place on earth. That would probably be in cramers pants", "score": 5, "replies": [{"body": "No, I'd rather be in Cramer's pants.", "score": 3, "replies": []}]}]}, {"body": "Africa is not a country but a continent of 54 countries. Learn world 🌎 history.", "score": 3, "replies": []}, {"body": "[ Removed by Reddit ]", "score": 7, "replies": [{"body": "No, I’m saying Africa is an improvised country. think big picture. Who is retarded now? (HINT HINT NOT ME)", "score": 1, "replies": [{"body": "That is the impressive (honestly) I thought you meant impoverished country so you'd have fucked up two parts", "score": 1, "replies": [{"body": "Idk what impoverished means. I have no formal education past WSB", "score": 3, "replies": [{"body": "Is this not formal education? ![img](emote|t5_2th52|4886)", "score": 4, "replies": []}]}]}, {"body": "Africa is a continent...", "score": 1, "replies": []}]}]}, {"body": "All I hear is blah blah blah Africa \nInverse wsb \nBet big on Affffffrica!!!", "score": 2, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Buying puts on Africa is like beating a dead horse. Buy call  leaps on JMIA instead . Not a financial advice", "score": 2, "replies": [{"body": "Never beat off to a dead horse.", "score": 2, "replies": []}, {"body": "Isn’t JMIA close to bankruptcy?", "score": 2, "replies": []}]}, {"body": "OP is such so Mericang, burgers land forever!", "score": 2, "replies": []}, {"body": "What an idiot. It’s not a country you moron", "score": 1, "replies": [{"body": "Don't waste your time.  He's a full of shit coward that can't back anything up.  At first, I thought that Africa the country was part of his poor attempt to be funny.  It's now obvious, he REALLY doesn't know.  \n\nThis is what society gets when we social promote students.  Grade inflation is greater than monetary inflation, apparently.", "score": 1, "replies": []}]}, {"body": "Africa is a continent.", "score": 1, "replies": [{"body": "No, no.  He's entitled to his own reality.  This is just another example of my point.  He talks shit, without knowing what the fuck he's blabbing about.", "score": 1, "replies": []}]}, {"body": "Africa is not a country, it’s a continent retard!", "score": -2, "replies": [{"body": "Save your bs for r/conspiracy, punk!", "score": 4, "replies": [{"body": "Yeah that’s right. You tell him!", "score": 1, "replies": []}, {"body": "https://www.google.com/url?sa=t&source=web&cd=&ved=2ahUKEwjO9KvF6-n5AhVtkIkEHXmXC7MQFnoECAoQAQ&url=https%3A%2F%2Fwww.heifer.org%2Fblog%2Fafrica-is-not-a-country-and-other-things-you-need-to-know-about-the-continent.html&usg=AOvVaw2vcd0i8mCVYHynTjOmtLqo", "score": 1, "replies": []}]}]}, {"body": "Africa is not a country.", "score": 0, "replies": [{"body": "I was waiting for this.  Don't bother.  He's really that stupid.", "score": 1, "replies": []}]}, {"body": "You're just a really, really big dick.", "score": -2, "replies": [{"body": "Swinging\n\nYou missed swinging", "score": 2, "replies": [{"body": "Thanks.  He's all dick, no balls.  He has a meeting on Sunday.", "score": 1, "replies": []}]}, {"body": "For some reason I have decided to respond to your comment in a semi-serious manner. If you do not possess the intellectual capability to realize this is immense satire, you most likely do not possess the intellectual capability required to make logical decisions and analysis for investing.", "score": 0, "replies": [{"body": "Yeah, sure.  I think you're the one missing the satire.  Think about it, long and hard.  You might get enough blood flow to your brain to figure it out.  I'm calling satire on your satire.  \n\nNext you're going to ask me to compare portfolios and dicks?  You'll lose twice.  You're the low IQ cohort that's infiltrated what was once a bunch of smart dudes acting stupid.  Now it's a bunch of you, pretending to have a clue.", "score": -3, "replies": [{"body": "If you want a dick measuring contest I’ll blow you out of the water. If you weren’t capable of understanding my comment was also satire. Boy oh boy do I have news for you. However, if you really want to compare portfolios I guarantee you, you will shit your pants. In regard to IQ, I guarantee you I would blow you out of the water. If you’re buying blue apron I’m further convinced your IQ is below 16.", "score": -1, "replies": [{"body": "Ok...maybe you can divert some of that blood to your minuscule brain.\n\nYou truly are clueless.  This we can agree on.\n\nYou make a lot of guarantees without and substantiation.  That's probably why you are you, an epic failure. Your intended satire isn't even funny.  \n\nBut, I'll bite, maybe your penis.  How big is it?  Be careful, I'm going to make you substantiate this to a community of 12.5MM.  This is your opportunity to quietly shut the fuck up.", "score": -1, "replies": [{"body": "Dm me info. We will call. I’m in a meeting until 3:00 PDT. Also big boy if you understood what a CLU is you would understood the word play in my name. See you in the call don’t pussy out.", "score": -1, "replies": [{"body": "What call?  You do meetings on Sundays?  Sounds like a shitty life.  I asked you a very simple question based on a \"guarantee\" that YOU proposed.  What is the size of your penis?  Surely, you know this since you were prepared to guarantee this.  I will then make you substantiate this.  \n\nSomething tells me that you're not smart enough to realize there's only one way for you to save face here.\n\nBut, do your meeting.  You need to answer the question first.", "score": 1, "replies": [{"body": "He's working at wendys on a Sunday. Be nice to the poor boy", "score": 2, "replies": [{"body": "Doing a double shift apparently.  Damn, I'm not asking for a lot.  Just back up what you say.", "score": 1, "replies": []}]}]}, {"body": "Sir, is your Sunday meeting over?  Surely, YOU'RE not one of these know-it-all blabber fucks are you? You know, all talk, no backing it up.", "score": 1, "replies": [{"body": "As I said previously, DM me. We will call and I will share with you. Anyone can have a pissing contest without backing it up.", "score": 0, "replies": [{"body": "Why do I need to DM you while you're doing your double shift at Wendy's?  I want this publicly seen by all 12.5M on WSB.  You failed to even answer the question about your penis size.  You made a guarantee, and you've failed to back it up.  I sure as hell don't want this in my private messages.  \n\nCome on, we'll give you one more chance...", "score": 0, "replies": [{"body": "I’ll show you my portfolio on call. Stop being a bitch. I bet you’re some 17 year old loser living in mommy and daddy’s basement", "score": 0, "replies": [{"body": "Why are you do afraid to back up your claim?  You made a guarantee.  We all saw it. Just tell us how large your penis is.  Are you used to getting embarrassed by 17 year olds who live in their mother's basements?", "score": 0, "replies": []}, {"body": "Sir,\n   It's nearly midnight and you've failed to back up anything you've said.  All of WSB eagerly awaits you to declare your penis size.  Why is this so hard (or soft) for you?  You made a guarantee.  Are you not a man of your word?\n\nYou seem to have many words, none of any value, however.  \n\nI have to get to bed soon.  You've already outed me as a 17 year old living in mama's basement, and school starts tomorrow.  \n\nSir, I don't want all the fine men and women of WSB to think you're afraid of a 17 year old.  Surely, you can shut me up by backing up what you say, no?", "score": 0, "replies": [{"body": "Thinking about me all day long I see. Fortunately,  WSB is not my life. I also said a dick measuring contest. If you understood what this means colloquially and weren’t some backwater pseudo-intellectual you would understand that it was implied I was referencing measuring portfolios. Have a good night, hope sleeping in your car is comfortable.", "score": 1, "replies": [{"body": "That's not a good \"guarantee\".", "score": 0, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "\"Not really, but that's alright. Next caller!\" - Jimmy Shill\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "\"Not really, but that's alright. Next caller!\" - Jimmy Shill\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "So, what you're saying is you can't back it up?  Where's the \"guarantee\"?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Africa ain't a country...wtf regard", "score": -1, "replies": [{"body": "Not after I short it", "score": 6, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "The amount of actually autistic people in this thread scares me.", "score": 0, "replies": [{"body": "It amuses me.", "score": 1, "replies": []}]}, {"body": "Sir, all of WSB eagerly awaits the size of your pp.  You have no meeting today?  Please provide what you promised us.\n\nThanks!", "score": 0, "replies": [{"body": "Again, you obviously have some form of psychological abnormality. Out of sheer boredom, I wanted to see what other stuff you were commenting and what not. \n\n1. You’ve replied to a vast majority of individuals on this thread claiming that I truly believe Africa is a country. If you have been here at WSB for any amount of time, you understand Shitposts are allowed on the weekend and should subsequently ignore a lot of “DD” that comes out then. The fact you’re commenting to other people negates your original claim that you were also displaying “satire” \n\n2. Your lack of comprehension that the dick measuring contest was a reference to portfolio measuring further substantiates my belief that you actually are mentally slow. Likely some sort of communicative or social psychological abnormality I.e. Aspergers, autism, etc. This would also explain your odd obsession and compulsion with me. \n\n3. You have until 2:00 Pacific time to DM me to set up a call where I will provide proof of my portfolio. After this period, I will stop responding.", "score": 1, "replies": [{"body": "My, you are trying VERY, VERY hard to get out of your obligation of your guarantee.  Everyone saw it.  You don't get to pick and choose the terms after.  You're being called out, son.  Defend your word, your honor.  You were VERY explicit in your statement.  Now you're reneging.  Shame.\n\nYou're type more of excuses than actually just following through.  You're being schooled by a 17 year old who lives in his mom's basement accordingly to you.\n\nSir.  What is the size of your pp?\n\nI'm not asking anything else.\n\nWhat you're not smart enough to know is that there's a broader lesson at play.  You just might be \"unteachable\".", "score": 0, "replies": [{"body": "Your lack of ability to possess basic reading comprehension is absurd. What can I expect from someone who’s best friend is a dog? An ugly one at that.\n\nAlso, it’s ‘according’ not “accordingly.”", "score": 0, "replies": [{"body": "Oh, no.  It's abundantly clear to everyone here.  You stated you would \"blow me out of the water\" on two conditions.  You were even trying to get me to DM you.  So, clearly it was not irony.  \n\nWhy are you so afraid now?  You could easily just shut me up. Where's is you confidence after your bluff has been called? \n\nYou're embarrassing all of mankind.\n\nThat dog kicks ass. She follows through on her commands.  You, son, are dumber than a dog that only want to play ball and shit all day.\n\nKeep trying to muddy the waters.  I'm still not letting you off the hook.  Please provide your penis size.  Thanks.", "score": 0, "replies": [{"body": "Once again, I was referencing portfolio size. You’re attempting to take the “funny route” by talking about penis sizes because you’re a broke  bitch who talks shit and cant back it up. Anyway, this will be my final response to you. I’ve wasted enough time on someone who has a very low level of education. Enjoy your day with your “best friend.” Your stock picks and choice of dog are very indicative of your poor choices in life. Goodbye.", "score": 0, "replies": [{"body": "I think you were explicitly clear on penis size first.  I'm not interested in your portfolio at this time.  Sir, what's the size of your pp?", "score": 0, "replies": []}, {"body": "See, the real lesson here is about knowledge, experience, and information to make advantageous and strategic decisions.  The fact you quit before fulfilling your obligation means you lost.  This is once again indicative of your inability to comprehend things.  Why would you make bold assertions that you can't back up?  It's no different than following crock \"DD\".  This is bigger (or smaller in your case) than a shitpost, son.  One more chance: what is the size of your penis? This is about YOUR inability to back anything up.\n\nCase in point: you make reference to my financial status but you know nothing about me or my portfolio, except that I enjoy the company of a puppy that shits a lot.\n\nCome on, we didn't even get to the portfolio question because you failed at the first question.\n\nIf it were me being schooled and embarrassed by a 17 year old living in his mom's basement, I'd just log off and never return.  Something tells me you're not smart enough to know that you should be embarrassed, almost like you're used to it.", "score": 0, "replies": []}, {"body": "Sir, I'm starting to believe you're afraid of me or afraid of the truth.  You're not an online bully that's really a coward when confronted, are you?\n\nI thought of you when my dog was shitting.  I just want you to know.\n\nCan you please just end this by telling us your penis size?  You promised.", "score": 0, "replies": [{"body": "Maybe iamcluless is female.?", "score": 1, "replies": [{"body": "Acts like one PMSing.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "As somebody living in the CONTINENT of Africa (Africa, the continent, has 54 countries), I find this post very offensive. Don’t talk about things that you know NOTHING about.", "score": -8, "replies": [{"body": "I don’t know what you mean", "score": 3, "replies": []}, {"body": ">I find this post very offensive\n\nI think you forgot where you are at. Nobody cares about your feelings here.", "score": 3, "replies": []}, {"body": "laughs in 1 carjacking per hour in Johannesburg  ![img](emote|t5_2th52|4271)", "score": 2, "replies": [{"body": "This made me fucking laugh out loud. OH SHIT THERE GOES MY CAR!", "score": 1, "replies": []}]}]}, {"body": "TIA", "score": 1, "replies": []}, {"body": "positions ?", "score": 1, "replies": []}, {"body": "Old mate tried to do this during COVID and the ship got stuck. He would have been 100% right", "score": 1, "replies": []}, {"body": "This looks familiar", "score": 1, "replies": []}, {"body": "Buy calls on 🇿🇦  private security companies ![img](emote|t5_2th52|8883)", "score": 1, "replies": []}, {"body": "Where are  you from OP. Where will you be if your  govt doesn't constantly bail you out from poverty every time, 08, 2020, college loans, fuel poverty etc etc?", "score": 1, "replies": []}, {"body": "I've seen JMIA shilled here on and off for the past couple years.", "score": 1, "replies": []}, {"body": "Thank goodness they’re improvising instead of impoverished.  The distinction clearly reflects the value of your highly regarded DD", "score": 1, "replies": []}, {"body": "God damn dude, I'd tell ya not to quit your day job but we all know you don't have one posting some dumb ass shit like this. \n\nPositions or ban", "score": 1, "replies": []}, {"body": "I concur", "score": 1, "replies": []}, {"body": "Sir, we are still waiting.  You seem like you're afraid of me?  Why?  I'm just a 17 year old living in my mamas basement.  How's the Lambo? Wen Hyundai?", "score": 1, "replies": []}]}
{"title": "Beware regards", "selftext": "There is too much posts about luxury cars with WSB plates on them. They popped out after JPOW speech butchered markets. Most probably this downtrend will continue but these posts specially designed to make you yolo. Don't. It is not a good time to invest/trade.\n\nDont try to protect yourself against inflation either. At least for a month. One month of buying power loss due to inflation is nothing compared to losing all your life savings. There will be good yolos to bet everything on but not today. Not this month.\n\nI enjoy loss porn as much as any of you but having lost a lot in the past let me tell you my experience. It sucks. Sharing it here only somewhat makes you feel relieved and its temporary. You'll be mad/sad for a long time if not worse.\n\nProtect your capital for the next month. After that there will be another bull/ape market. And we\"ll yolo like true regards\n\nPs: sry for bad england", "id": "wzyyba", "created_utc": 1661702538.0, "score": 142, "upvote_ratio": 0.75, "num_comments": 116, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|47|**First Seen In WSB**|1 year ago\n**Total Comments**|174|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=wzyyba)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=wzyyba)", "score": 1, "replies": []}, {"body": "Your just trying to keep me poor", "score": 125, "replies": [{"body": "The bad grammar only confirms the green dildos that will be appearing! ![img](emote|t5_2th52|4276)", "score": 22, "replies": []}, {"body": "Exactly.", "score": 1, "replies": []}, {"body": "It's ![img](emote|t5_2th52|4886) himself, OP see you on tv  or by the dumpster tomorrow", "score": 1, "replies": []}, {"body": "You're", "score": 1, "replies": [{"body": "I’m a regard, I can’t spell", "score": 1, "replies": []}]}]}, {"body": "Dump more into bbby?", "score": 159, "replies": [{"body": "dingdingding", "score": 33, "replies": []}, {"body": "Exactly", "score": 7, "replies": []}]}, {"body": "SQQQ is my new license plate", "score": 34, "replies": [{"body": "So interesting that there are funds like this", "score": 7, "replies": [{"body": "And better than buying puts. Up 12% on Friday is nuts. QQQ chart looks god awful. It’ll bounce this week at some point but it looks like it’ll hit the 50 in a hurry.", "score": 2, "replies": [{"body": "Just tried to place an order for some, fucking chase doesn’t let me trade shorting ETF’s", "score": 1, "replies": [{"body": "It’s not a 24 hour ETF. SH is though. 1:1 short SPX. Did you get a specific error? Odd, since it’s just an ETF.", "score": 2, "replies": [{"body": " Just gave me this error code: R01828A…\n\nThere was a Reddit thread where someone said chase doesn’t let you trade these kinds of things. I’ll try again during market hours. It let me  to buy the SPY ETF rn but with a limit order. (Not touching that shit until this correction is over)", "score": 1, "replies": []}]}]}]}]}, {"body": "We mooning tomorrow? Hoping for anything past 45", "score": 1, "replies": []}]}, {"body": "That's why you yolo in the one stock j Powell can't touch.  Bbby. 😆", "score": 106, "replies": [{"body": "I only have position in BBBY sold everything else prior to the speech. Not gonna invest more but not selling before moon either(which is probably Jan 23)", "score": 36, "replies": [{"body": "I will be bald by then.  Shit is stressful 😆", "score": 15, "replies": [{"body": "1st stop after the moon will be to Turkey for hair implants and a kebab then 😂", "score": 11, "replies": []}, {"body": "If you have a job or some steady income and your BBBY play wont lose you money, you are gonna outperform the market by a lot so dont worry", "score": 5, "replies": []}]}, {"body": "Why is BBBY going to moon after jan 23?", "score": 4, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "Thought he sold everything?", "score": 6, "replies": []}, {"body": "Not anymore", "score": 2, "replies": []}, {"body": "Expiring Jan 23rd?", "score": 0, "replies": [{"body": "Lmao so they think calls are like a bet for one specific day in the future?", "score": 5, "replies": []}]}]}]}, {"body": "Why didn’t you lead with that?\n\nFuck yeah bbby stay green market stay red LFG \n\n🚀🚀🚀", "score": 2, "replies": []}, {"body": "I wouldn't bet the farm on that date. RC bought the calls well before a lot of the current situation developed and he was just trying to secure the time-line. He has also sold those calls. In my opinion if this doesn't moon in the next couple weeks it won't moon at all. Between the RegSho count down, the 8K announcement, and market liquidation it has to happen soon. Catalysts are here now.", "score": 1, "replies": [{"body": "Maybe, maybe not. If it’s a merger or acquisition it might not moon until a forced closure of shorts. Those things take time to final.", "score": 2, "replies": []}]}]}, {"body": "Can’t touch this. Duh nuh nuh nuh. Duh nuh. Duh nuh.", "score": 7, "replies": [{"body": "Can somebody PLEASE make a meme video with that?", "score": 6, "replies": [{"body": "Perfect would be to put this music over the new Britney spears and Elton John video, can someone do this, seriously? Might even build in RC, Jim Crimey, and J Pow", "score": 3, "replies": []}]}]}, {"body": "Can't touch a company heading for $0, no need to kill that which is already dying. Might as well invest in monkeypox..", "score": -7, "replies": [{"body": "Ah, to feign death so well that even the fed leaves you alone.  My respect for BBBY is strengthened even further.  My thanks!  Doubling down on Monday!", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Vertigo?  Already?  The prices have yet to climb!", "score": 0, "replies": []}]}]}, {"body": "If I'm regarded, and you're regarded... and we both disagree, who do I inverse?", "score": 16, "replies": [{"body": "I thought the laws of inverse dynamics defaulted to Cramer to maintain a state of homie stays with your sis", "score": 9, "replies": [{"body": "Reddit is fucking undefeated😭", "score": 6, "replies": []}]}, {"body": "Cramer", "score": 2, "replies": []}]}, {"body": "Bad England", "score": 13, "replies": [{"body": "Bad England isn’t OP’s fault", "score": 5, "replies": [{"body": "I feel that", "score": 3, "replies": []}]}]}, {"body": "this guy exposes the matrix ![img](emote|t5_2th52|8881)", "score": 9, "replies": [{"body": "He took the red pill ?", "score": 3, "replies": [{"body": "no, he took the regards pill", "score": 4, "replies": [{"body": "Yeah…he seems dumb but …at least he has good intentions", "score": 1, "replies": [{"body": "I'm in support of his action. we need more people like him.![img](emote|t5_2th52|8881)![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "No he doesn’t.", "score": 1, "replies": []}]}, {"body": "He took both pills", "score": 1, "replies": []}]}]}]}, {"body": "Does that mean yolo on bbby?", "score": 9, "replies": [{"body": "Does it?👀", "score": 1, "replies": []}]}, {"body": "TL;DR - Buy BBBY", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Why not both?", "score": 6, "replies": []}, {"body": "Puts on calls", "score": 5, "replies": []}]}, {"body": "Overall, US bond inversions are an economic warning.\n\nAnd the basic 2Y/10Y has been inverted for months…but, this isn’t a rare event.\n\nWe now have a very funky 6M/30Y inversion.\n\nIve been searching online…and asking legendary finance folks on twitter…\n\nWTF is going on with the 6M/30Y bond inversion?\n=\n\nI’ve done some research and don’t think this has ever happened before.\n\nThis seems like a CODE RED economic warning.\n=", "score": 4, "replies": [{"body": "Wait, there is a 6m/30y inversion 👀", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}]}]}, {"body": "saying now is not the right time to invest when the market is down is singlehandedly the most regarded advice you can give, buy shares and hold them folks, don't buy the top buy near the bottom", "score": 4, "replies": []}, {"body": "BBBY only play left for me, after that one gonna wait it out and wait for nice discounts", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 2, "replies": []}]}, {"body": "Yeah, you better be sorry for bad England. They are terrible, no good, very bad England.\n\n/s", "score": 3, "replies": []}, {"body": "Imma yolo into Bbby", "score": 3, "replies": []}, {"body": "Don’t know about bad England but Bad English was somewhat decent in the late 80s but IMO had much better potential given who the band members are.", "score": 6, "replies": []}, {"body": "got it YOLO in QQQ puts for 1 month out", "score": 2, "replies": []}, {"body": "Fauq it yolo 5k on BBBY tomorrow thanks for the input.", "score": 2, "replies": []}, {"body": "But haven't you heard, it's imposdible to photoshop, \"thanks WSB\" onto a shot of a pricey car. Impossible I tell you!", "score": 2, "replies": []}, {"body": "Eating peanut butter sandwiches and ramen for three months straight gets old.", "score": 2, "replies": [{"body": "Who the fuck can afford peanut butter?!?!?!?!", "score": 5, "replies": [{"body": "Peanut futures my man, I have an insider in Dothan, AL for me.", "score": 1, "replies": [{"body": "![img](emote|t5_2th52|8881)\n\nThis guy is truths peanut capital of the world been there seems it", "score": 1, "replies": []}]}]}]}, {"body": "Tsla puts are free money", "score": 3, "replies": [{"body": "Funny I have TSLA calls and QQQ puts", "score": 1, "replies": [{"body": "And you identify as an ape… cringe", "score": 0, "replies": []}]}]}, {"body": "Just buy shares, don’t be the guy who dumped his life savings into calls because regards on the internet said that we’re not going into a recession, and then blame it on Reddit once they expire worthless.", "score": 2, "replies": [{"body": "Back to r/investing please, this is r/wallstreetbets", "score": 5, "replies": []}, {"body": "Dont buy shares now either. I know people bought $TSLA @1100 still holding bags", "score": 2, "replies": [{"body": "Buying shares at $11 is not even close to the top of BBBY....plus we have actual possible big news coming Wednesday...", "score": 4, "replies": []}]}]}, {"body": "Thank you regard\nHopefully others proceed with caution", "score": 4, "replies": []}, {"body": "Those are rentals", "score": 1, "replies": []}, {"body": "UUP to the moon", "score": 1, "replies": []}, {"body": "You just made me want to do it", "score": 1, "replies": []}, {"body": "Not sure if RC or JPOW 🤔", "score": 1, "replies": [{"body": "Did someone call the Rugging Champion?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Get off ![img](emote|t5_2th52|12787)", "score": 1, "replies": []}]}]}, {"body": "I’m gonna buy more bbby just because of this post hedgie_", "score": 1, "replies": []}, {"body": "So puts?  You know you can yolo puts as well right?", "score": 1, "replies": [{"body": "Idk if markets gonna go down. Just pointing unusual amount of lambos with wsb plates. After nasdaq fell 4% in a day. Kinda sus dont you think", "score": 1, "replies": [{"body": "Maybe.   I've seen and heard so many conspiracy type theories over the last few years (many being true) I kinda just ignore them now.  Ya gotta remember people make bank on 4% red days just the same as 4% green days.", "score": 1, "replies": []}, {"body": "Your english is bad but you use “sus” pretty fluently", "score": 1, "replies": []}, {"body": "Understanding human behavior is not a conspiracy theory, so you don’t have to feel like you’re being unreasonable.\n\nCalling out behavior like this doesn’t mean these people gather and deliberately plot.  It means that people will independently migrate to choices/strategies that “win the game”.  In this case, winning means manipulating the market, so they can take advantage.\n\nThis is basic game theory, and it is an example of why we create laws as guard rails against the human tendency to want to win regardless of who gets harmed.", "score": 1, "replies": []}]}]}, {"body": "Easy Mel Gibson, they were like me and had this entire shit show shorted since July….profits, I take profits…", "score": 1, "replies": []}, {"body": "Going to be a lot longer then a month my dude.", "score": 1, "replies": [{"body": "Not if you're a stampede of dumb bulls pumping the market during a recession.", "score": 1, "replies": []}]}, {"body": "Good thing I’m buying bbby Monday", "score": 1, "replies": []}, {"body": "\"I'm gonna invest in bbby Even Harder.\" - Michael Scott", "score": 1, "replies": []}, {"body": "Instructions unclear. Dick stuck in a blender", "score": 1, "replies": []}, {"body": "This dude has had the account for two years and the vast majority of his posts (99%) have been in the past 3 weeks or so and all about bbby. I think kramer bought this account", "score": 1, "replies": []}, {"body": "I’m not here to “invest” or “trade”, I’m here to roll on 18 black with everything I’ve got", "score": 1, "replies": []}, {"body": "This guy tries to light his farts by blowing on the lighter.", "score": 1, "replies": []}, {"body": "You had profits and didn’t take them. Now you cry", "score": 1, "replies": []}, {"body": "You know you can bet on things going down to not just up", "score": 1, "replies": []}, {"body": "Sir this is a casino.", "score": 1, "replies": []}, {"body": "this is literally a gambling sub you troglodyte", "score": 1, "replies": []}, {"body": "There is always something to yolo into. That’s why Warren buffet invents puts", "score": 1, "replies": []}, {"body": "So YOLO Monday morning? Got it.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4263)", "score": 1, "replies": []}, {"body": "How many tin foil hats do you own???", "score": 1, "replies": []}, {"body": "Sir.   This is a casino and Wendy's is just around the corner", "score": 1, "replies": []}, {"body": "I don't understand the luxury car posts. Why would i want to own something that will drain money quickly on a monthly basis ?   \n\nthe cost of gas/registration/insurance/maintenance...", "score": 1, "replies": []}, {"body": "WSB is the perfect warm body for maggots to infest, because you already shut down anyone that goes against your rhetoric of buying and never selling, so I'm incredibly surprised to see this post.", "score": 1, "replies": []}, {"body": "Seems like someone saying don’t come to the market today. Lol wonder why", "score": 1, "replies": []}, {"body": "Bbby up 30% the following day", "score": 1, "replies": []}]}
