{"title": "Interested in investing in Stocks, but complete newb", "selftext": "[removed]", "id": "1atbyy", "created_utc": 1363977985.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 10, "comments": [{"body": "I'm pretty new myself, but I'll give you the advice that I've been given and see handed out the most around here.\n\nThe absolute first thing you should buy with any money you have is a few books to read such as The Intelligent Investor, How to Make Money in Stocks: A Winning System in Good Times and Bad, or The Excellent Investor.  It helps a tremendous amount to actually know what you're looking at when you see all the numbers and graphs on your screen, as well as to know what to look for when deciding whether to purchase stock or not.\n\nInvestopedia.com and TD Ameritrade both have some nice resources online that can help you learn as much as possible.\n\nAlso, Optionshouse.com only charges $3.99 Commission.", "score": 1, "replies": [{"body": "I think for the most part I understand the logistics of it and all the numbers, but I can definitely improve on that. Those books are in my cart and I will grab them soon :) Thank you!", "score": 1, "replies": []}]}, {"body": "I would use Tradeking, they have a lot lower commission fees. (4.95)\n\nAlso I wouldn't start with stocks, I would invest in an ETF like Vanguard fund at first and watch the markets.\n\nLastly, depending on what you want to do strategy wise I would read a beginner's guide to day trading by Toni Turner (even if you're not planing on day trading, it's great for understanding tech analysis)\n \nThe trend is your friend! ", "score": 1, "replies": [{"body": "I'll probably stick to eTrade, mostly because my company uses it and have lots of stuff for its employees in it. \n\nI looked up an ETF really quick, and that looks way more complicated than dividend stocks. Maybe it has an icon I can look up or do I have to sign up to get it or is it simply something I can purchase from eTrade? ", "score": 1, "replies": [{"body": "with an EFT your risk is diversified so you \"don't have all your eggs in the same basket\". VXF is the vanguard symbol if you want to take a looksy.\n\nAlso I **highly** advise you watch the market for at *least* a few months and take take down notes of where you would enter and where you would exit your positions and document it and learn from what works, and what happens with the indicators and oscillators, monitoring trends and ect ect.", "score": 1, "replies": [{"body": "Ok I just looked up VXF, seems to make sense, but ya as you said I'll look into that a bit more. So basically, I would just continually buy VXF stocks and let it handle the diversifying? That seems to provide a much more consistent stream of income, and the risk is pretty low if any. ", "score": 1, "replies": [{"body": "In my opinion since you're young you could do a strategy similar to mine. (I know I'll probably get down voted for this) \n\nSince your young you can take higher risks. What I do is have 20% in EFT (eg VXF) 10% cash for some quick liquidity and 70% in stocks of that 25% being my dividend gainers and \"solid\" companies and the remainder I swing trade through Tech analysis \n\nBut at your knowledge level *currently* I would have the majority in an ETF or two ~70% and the rest as cash for liquidity, and make monthly deposits into your account from your paychecks maybe 10%+ if you can afford to. then as you get more comfortable choose your own strategy that alines with your financial goals. \n\nbtw what are you financial goals? \n\n ", "score": 2, "replies": [{"body": "My goals are just to create another source of funds for later in life. Currently I have a 401k with my work matching 100% and 125% on years we exceed expectations. I also have 10% of my checks going to ESPP which they buy at a 20% discount after 6 months. I've been using that money to just store up for when I can invest and now I'm at a point where I can do that. Maybe around retirement I can hopefully use my investments as income source, but I'm not looking that far yet for investment besides 401k. \n\nI need to read more on the ETFs but they seem solid. My concern I guess it doesn't seem to pay out much? As I said I only have about 1100$ to start out with and that would give me about 18 shares and the dividend was low but maybe I'm not understanding it. Is it a quarterly dividend for those type of funds? I can definitely start putting cash into my account but it'll prob be on a 6 month basis for a year or two until I get all my loans paid off. I'll be able to have some cash though so that is a good goal. \n\nI guess my original question still needs to be answered of how much cash is a good amount to start off with? Should I stockpile more cash before I jump into investing? I just don't know a good baseline and don't wanna jump in with too little ", "score": 1, "replies": [{"body": "that's a good enough amount to start with, but I would advise that you buy and hold because at $10 commissions fee your margins will get eaten alive.\nhere's some info https://personal.vanguard.com/us/funds/snapshot?FundId=0057&FundIntExt=INT\n\nfeel free to pm me about any questions bud.", "score": 2, "replies": [{"body": "Awesome thanks, lots of reading to do! It's been so hard finding info cause none of my friends do any sort of investing themselves and I wanna get a head start! I'll def stick to larger purchases so thanks again :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
