{"title": "Is there any reason to worry about Nokia?", "selftext": "[deleted]", "id": "1abysb", "created_utc": 1363320883.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 19, "comments": [{"body": "I have no idea why a stock's price relates to its lucrativeness. NOK was operating at a loss for most of 2012, it's downsized and shed so many jobs and capability--it even sold its HQ recently. A sad story, and definitely not a sound investment.", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "It's not how many shares you own that matters, but how many there are total.", "score": 3, "replies": []}, {"body": "\"Well considering I could buy ~425 shares of it for the price of one share of samsung I would say that is lucrative.\"\n\nHAHAHAHAHAHAHAHAHAHA", "score": 3, "replies": [{"body": "Samsung is overvalued right now. Having a lot of shares of a stock while certainly riskier also carries greater gains. If 400 shares of nokia went up 50 cents it would require that one share of Samsung to go up ~200 dollars to equal the same gain. Now the opposite is certainly true as well, which is why I asked about Nokia. Good god man be less of a dick.", "score": 0, "replies": [{"body": "Instead of getting so upset, think about this: you do not understand the stock market.\n\nIt isn't about me being less of a dick but about you being less arrogant.", "score": 2, "replies": [{"body": "It's not being arrogant, it's about understanding that the successful practical application of graphene will likely be our generations equivalent to the discovery of the transistor by bell labs. It's not just about understanding the market itself, but the consumers upon which it is built. Look at companies like Google, Apple, Amazon, Netflix. Do you think there wouldn't be any consumer demand for a product that is incredibly resilient, cheap to produce and could replace batteries as we know them?", "score": -1, "replies": [{"body": "You're moving the goalposts and avoiding the topic of this thread to save face. You don't understand equity valuation. I'd recommend not investing until you learn this very crucial aspect of investing.", "score": 2, "replies": [{"body": "The original post was essentially asking if there is reason to believe they will go belly up in the span of about 2 years. It is sound to reason if they survive longer than that they will be in a very unique position within the tech world.", "score": -1, "replies": [{"body": "Yes, but your nonsense about stock price demonstrates a profound ignorance about how stocks work. We're trying to help you and you're bitching about it. Ungrateful, stubborn--like a child.", "score": 2, "replies": []}]}]}, {"body": "http://i.imgur.com/bF6Cp.jpg", "score": 2, "replies": [{"body": "/r/circlejerk is that way.\n", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "Im going long on this one. For Graphene, and other reasons. I also think that Nokia has a good brand name that could bring it up", "score": 3, "replies": [{"body": "It's a good brand name in the developing world, but AAPL and Samsung have stronger brand recognition there, so don't you think as they get richer and smartphones get cheaper they'll shift to what they see all the Hollywood stars using, just as they've done with every other fashion since the developing world started to develop?", "score": 2, "replies": [{"body": "While I do agree with this, I think Nokias are the missing link before they buy the recognized Hollywood phones a year or two from now. Phones like the [Asha 300](http://smartphones.venturebeat.com/l/213/NOKIA-Asha-300) are dirt cheap for those on the margin of buying a smartphone, and I think phones such as these Nokias (that are $11 with a two year contract) are ideal for such markets. ", "score": 1, "replies": [{"body": "That just tells me they're a value pit with short-term efficiencies and long-term structural problems. Maybe as a near-term play.", "score": 1, "replies": [{"body": "I see the long-term value in their graphene R&D and in the windows phone market for pre teens and the elderly (because of the easy interface and lower prices, hard to get more intuitive and obvious than those tiles). However, if you don't think those are sufficient reasons for a higher long term valuation, then that's a pretty valid diagnosis. ", "score": 3, "replies": []}]}]}, {"body": "Indeed, thats why I hedge with AAPL. From what I can tell though, they target different markets. With AAPL's new phone releases, that might change. I still think that the graphene research is key. ", "score": 1, "replies": []}]}, {"body": "I'm probably going in soon as well (will likely wait for a dip to 3.25). The graphene research coupled with the market potential of cheaper Nokia smartphones in emerging markets (I envision an extensive impact in Africa and Latin America) is extremely promising, I definitely think NOK deserves a higher valuation\n", "score": 1, "replies": []}]}, {"body": "i bought at 4.10.\n\nim upset they almost ruined their chances of taking the chinese market. but i think this is a stock i will have to sit on for years.\n\nit will go down before it goes up", "score": 2, "replies": []}]}
