{"title": "Short NFLX because subscribers go away or long NFLX because new revenue stream?", "selftext": "", "id": "98221l", "created_utc": 1534510786.0, "score": 123, "upvote_ratio": 0.94, "num_comments": 91, "comments": [{"body": "The real question is, Netflix has Rick and Morty?", "score": 102, "replies": [{"body": "Pretty sure they don’t. Hulu does ", "score": 65, "replies": [{"body": "And Hulu has ads. This dumbass might’ve been high and forgot which program he was using ", "score": 92, "replies": [{"body": "And it's like $4/mo more for the Hulu without ads.  Fuckin' plebs.", "score": 23, "replies": [{"body": "Anything cloud recorded as live will still have ads. Certain channels (FX is the worst) force you to watch network ads even with the no ad package.\n\nStill a great service though. ", "score": 5, "replies": [{"body": "I'm pretty sure even then only a select few shows have forced ads. When I signed up, I remember it warning me about only like New Girl and just a couple other shows would have ads still.\n\nEdit: This is also back about 6 months ago so maybe things change and I never noticed.", "score": 1, "replies": []}, {"body": "That's good to know, and I will keep an eye out for it.  Thanks!\n\nSo far I've noticed a few seconds of previews for the upcoming season of the show I'm watching, like Archer or It's Always Sunny in Philadelphia.  Hmm, both FX/FXX.  I'm OK with that, as long as it is relevant to the show I am watching.", "score": 1, "replies": []}]}]}]}, {"body": "Netflix Europe has Rick and Morty", "score": 28, "replies": [{"body": "Do they also have adds? I almost strictly watch Netflix and the closest thing to an add like this is after a series they will play a trailer of some random show, but you can always back out and most the time its a good trailer.", "score": 1, "replies": [{"body": "Never seen that happen to me in germany. using netflix for one and a half year now. ", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "No one cares eurotrash.", "score": -2, "replies": []}]}, {"body": "Taiwan has it on netflix", "score": 3, "replies": []}, {"body": "Internationally both are Netflix originals. One of the few advantages to being European , we need that in murica", "score": 2, "replies": [{"body": "Get a VPN", "score": 1, "replies": [{"body": "I've tried, they won't let u use Netflix at all with it", "score": 1, "replies": [{"body": "Netflix plays cat and mouse with VPNs.\n\nThey detect a server used to circumvent their geo-blocks, they block that. VPN service gets new servers\n\nSometimes they'll even block out entire IP ranges that are known to be used by VPN services.\n\nThis means you'll need to find a decent VPN service that keeps getting new servers.\n\nYou just gotta look around for a good VPN service that allows you to watch Netflix", "score": 2, "replies": []}]}]}]}, {"body": "They do have in France (at least last time I checked it was there)", "score": 1, "replies": []}, {"body": "They do in Australia ye. But if Netflix is putting up ads I’m not fucking using them anymore they can suck a fat one", "score": 1, "replies": []}]}, {"body": "I've never seen an ad on my Netflix...  What's this shit?", "score": 33, "replies": [{"body": "Dumbass doesn’t know the difference between Hulu and Netflix lol", "score": 59, "replies": [{"body": "Dumbass doesn't realize Netflix has Rick and Morty. Amirite, dumbass?", "score": -7, "replies": [{"body": "IDK why I am being down voted. Rick and Morty IS on Netflix. Better call Saul is NOT on Hulu. People have been reporting ads on Netflix", "score": 9, "replies": [{"body": "For being a Eurotard. Rick and Morty is not on Netflix at all in Freedomland and we have to wait an entire year for Saul", "score": 7, "replies": []}, {"body": "For acting like what you’re saying is a fact  when it’s not. \n\nMost of reddit is American. Rick and Morty is only on Hulu here. Takes 2 seconds to type that into google and figure that out.\n\nEuropeans....", "score": 2, "replies": [{"body": ">Most of reddit is American\n\nAckshually [about 40% of reddit is American](https://www.statista.com/statistics/325144/reddit-global-active-user-distribution/). Kinda helps to explain some of the commie faggotry. ", "score": 2, "replies": [{"body": "> explains some of the commie faggotry. ", "score": 0, "replies": []}]}, {"body": "I live in Texas. Just because it is not on your netflix does not make you right. It is on Netflix.  Takes 2 seconds to type that into Google and figure that out\n\n...autistic ", "score": 2, "replies": [{"body": "Shit for brains ", "score": 4, "replies": [{"body": "At least I have Rick and Morty on Netflix. wubba lubba dub dub", "score": 0, "replies": [{"body": "cringe", "score": 2, "replies": []}]}]}, {"body": "Then you are either using a VPN or you are autistic and didn’t realize you were on hulu. Either way, I’m done with this conversation.\n\nSources:\n\nhttps://decider.com/show/rick-and-morty/\n\nhttps://www.google.com/amp/s/amp.dailydot.com/parsec/watch-rick-and-morty-online/", "score": 3, "replies": []}, {"body": "Here in Nuevo Mexico, which yes, is part of freedomland, we have no Rick and Morty on Netflix.", "score": 1, "replies": [{"body": "The thing is it is not about whether you or I have it. OP is talking about Netflix and I was stating that yes he is indeed talking about Netflix.\n\nIf someone is going to call him a dumbass because they don't have their facts right then they in turn should be called the same", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I get them sometimes but it is always for shows on Netflix, mostly Netflix originals.", "score": 1, "replies": [{"body": "Like as you are scrolling and it highlights a show and plays a clip? I've never had an ad like YouTube or something. ", "score": 1, "replies": [{"body": "Actually I haven't seen them before. I was thinking of Amazon Prime Video. They have been doing it for a while.", "score": 2, "replies": []}]}]}]}, {"body": "Not enough people will boycott Netflix for ads. Netflix is too convenient.\n\n+1 consumerism.", "score": 18, "replies": []}, {"body": "Anyone who doesn't think that advertising is part of Netflix's future is delusional. grab 'em and ad 'em. ", "score": 29, "replies": []}, {"body": "Better Call Saul is a great show though.", "score": 20, "replies": [{"body": "Second this.\n\nFor anyone who has not watched it. Season 1 is a super fucking slow burn. But it's worth it and necessary.  ", "score": 3, "replies": []}]}, {"body": "Personally, I feel that owning Netflix for a month out of the year is enough. I run out of stuff on there super quickly. I would never subscribe a whole year.", "score": 6, "replies": [{"body": "The usual then, buy high and sell low?", "score": 7, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I have a whole bunch of tv shows that i watch, but i dont want to wait a year till they finally show on netflix. That just leaves me with a few movies and netflix exclusives. ", "score": 1, "replies": []}]}]}, {"body": "Disney is primed to gut punch them hard next year. Removing their content from NFLX, acquiring Fox, taking a bigger stake in Hulu... wait til they announce a $7/month fee and murder the market share.\n\nI think Netflix fucked up by going the route of self-produced content. It's mostly trash and boring (mostly). This is Disney's turf. The past 5 years have been Netflix excelling at what they do (streaming), and everyone else playing catch-up. Well, the tables are turning. Streaming platforms are old hat, and its back to quality of content. Netflix is flailing in all directions trying to desperately pump out cheap productions to keep up the illusion of content variety.\n\nhttps://www.usatoday.com/story/money/media/2018/07/27/disney-gets-ok-acquire-fox-movie-and-tv-studios-and-stake-hulu/841721002/\n\nSeriously, Disney's repertoire of movies and shows is absolutely ridiculous now, and they have full control over all new content moving forward. Netflix is going to crash hard with that bloated ass P/E and imminent regression. I'm mostly bored of their shit myself and would cut out on them for Disney's service.", "score": 8, "replies": [{"body": "They should just make hulu less shit since they own 66% of it", "score": 7, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Yep, the other day I torrented a show for the first time I years. Netflix made my life easier, but this dilution of content is making my life harder than just searching up a torrent.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I don't know, we aren't really privy on the business details or Netflix management itself. Speaking from a stock basis though this looks like the peak for Netflix for a while.\n\nIt could end up that Netflix creates a closer relationship with Disney's production rivals and we end up with the classic 2-company oligopoly in streaming. For the next 2 years though I'm banking on $DIS to pump up their numbers.", "score": 2, "replies": []}]}, {"body": "This makes too much sense. Fucking dark ages coming for us.", "score": 2, "replies": []}, {"body": "Disneyflix is going to focus mainly on family friendly content. Most families, if they can only choose 1 streaming service, especially for their kid on iPad, are gonna go for disneyflix. At the same time, do families even watch movies and shows in the same room anymore?", "score": 1, "replies": []}]}, {"body": "i hate that they removed reviews and their excuse was it wasn't being used very much. yes well if you hide the review function then of course fewer people will use it.", "score": 2, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "There are about 300M people in the US who don’t know how to do that. ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nope, someone was just born. ", "score": 1, "replies": []}]}]}, {"body": "Ubsure why you sre being downvoted", "score": 4, "replies": [{"body": "It could be because Netflix is 12 bucks a month.", "score": 7, "replies": [{"body": "[removed]", "score": 9, "replies": [{"body": "Robinhood said I'm not allowed to buy anymore. ", "score": 7, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I can torrent movies in 2160p. Netflix will only play 4k content through their windows 10 app, not their torrent client. That 2160p movie I torrented is on my hard drive forever.", "score": 2, "replies": [{"body": "It streams 4K just fine to my 4K TV", "score": 1, "replies": [{"body": "Yeah on TV if you're using their app it works fine, I'm trying to watch it on chrome on my 4K monitor, and it doesn't work.", "score": 1, "replies": [{"body": "Yeah, [you’re right](https://help.netflix.com/en/node/23742) . I don’t really watch anything on my computer so I didn’t know. \n\nTorrenting is cool and it’s even better if you have a lot of storage for a large library, but I don’t pay for Netflix so it makes no difference to me. ", "score": 0, "replies": []}]}]}]}]}, {"body": "Why do ppl pay for things when they can just steal them", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}, {"body": "FR... with a anonymous vpn you can download anything and nobody is gonna catch you... ", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "doesnt matter what you do if you anonimize appropriately", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "PIA on a separate dedicated machine (it never goes online without vpn and never does any \"real\" browsing) ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Short because the business is unprofitable and doomed.", "score": 1, "replies": []}, {"body": "Both at the same time", "score": 1, "replies": []}, {"body": "Long", "score": 1, "replies": []}, {"body": "I haven't seen any ads yet.  \nPeople ain't going to leave if they do start up. Long", "score": 1, "replies": []}, {"body": "If Netflix really is doing that then it’s long. I would be willing to bet the 5% they might lose will pale in comparison to the 95 remaining percent watching ads.", "score": 1, "replies": []}, {"body": "Why not both? ¯\\\\\\_(ツ)_/¯", "score": 0, "replies": [{"body": "You dropped this \\ \n *** \n^^&#32;To&#32;prevent&#32;anymore&#32;lost&#32;limbs&#32;throughout&#32;Reddit,&#32;correctly&#32;escape&#32;the&#32;arms&#32;and&#32;shoulders&#32;by&#32;typing&#32;the&#32;shrug&#32;as&#32;`¯\\\\\\_(ツ)_/¯`&#32;or&#32;`¯\\\\\\_(ツ)\\_/¯`\n\n [^^Click&#32;here&#32;to&#32;see&#32;why&#32;this&#32;is&#32;necessary](https://np.reddit.com/r/OutOfTheLoop/comments/3fbrg3/is_there_a_reason_why_the_arm_is_always_missing/ctn5gbf/)", "score": 9, "replies": [{"body": "Good bot", "score": 2, "replies": []}]}]}, {"body": "Worse yet who the fuck picks better call Saul...low quality movies I’m sure people who have had Netflix for a while have seen everything. Do they have any new content anymore ", "score": -10, "replies": [{"body": "That's a good show", "score": 7, "replies": []}, {"body": "Literally fight me", "score": 6, "replies": [{"body": "I am apologize", "score": 1, "replies": []}]}, {"body": "That show is amazing ", "score": 2, "replies": [{"body": "Ok sorry I didn’t realize WSB was gay for it, my apologies ", "score": 1, "replies": [{"body": "Lmfao", "score": 1, "replies": []}, {"body": "coward", "score": 1, "replies": []}]}]}]}]}
