{"title": "Insiders keep selling Apple stocks and no one buying this year. Thoughts?", "selftext": "Deirdre O'Brien, Senior Vice President of Apple, sold 15,419 shares of the company. He has sold a total of 243,393 shares.\n\nSo far, 16 insider sells and no insider buys Apple over the past year. This could be an indication of the insiders' perception of the company's future performance.\n\nSource: [https://finance.yahoo.com/news/senior-vice-president-deirdre-obrien-170123076.html?.tsrc=rss](https://finance.yahoo.com/news/senior-vice-president-deirdre-obrien-170123076.html?.tsrc=rss)\n\nA single person selling is ok but 16 this year makes it seems like even internal executives think the AAPL price is high.\n\nWill MR headset save Apple?", "id": "15mwwsd", "created_utc": 1691627754.0, "score": 255, "upvote_ratio": 0.83, "num_comments": 134, "comments": [{"body": "How many shares does SHE still have? I don’t think it means anything. She’s been with apple since 1988. You gotta cash out out some shares every now and then to pay the bills or buy a boat", "score": 480, "replies": [{"body": "Exactly. When a stock is up so much it isn't a concern that insiders are cashing their stock. I know I would.", "score": 73, "replies": [{"body": "I don't know, it's also kind of a signal...they need money? Don't forget those shares bring with them insane dividends, especially when they have so many.\n\nIt's still concerning that mega wealthy need to cash out some.\n\nBezos hasn't sold a share in a while e.g.", "score": -14, "replies": [{"body": "> I don't know, it's also kind of a signal...they need money?\n\nShe's been with the company since the late 80s. I sort of think that she still has upside exposure to Apple, despite selling 15k shares....", "score": 3, "replies": [{"body": "Depends on what % the sale of shares take up her totals for $APPL?  if it represents less than 1% then it’s a non-sequitar.", "score": 0, "replies": [{"body": "Welp, turns out /u/Ancient_Chaco is a literal moron (or just took Yahoo Finance at their word than actually getting of his / her ass and read the source filling that this very wrong article is based on...)\n\nDeirdre O'Brien didn't sell 15,419 shares -- [15,419 RSU's vested](https://www.sec.gov/Archives/edgar/data/1767094/000197314123000171/xsl144X01/primary_doc.xml), which required her to file a Form 4 with the SEC", "score": 3, "replies": []}]}]}, {"body": "Not that mega I guess, and shouldn’t they get more shares as part of the compensation anyway?", "score": 1, "replies": []}]}]}, {"body": "They also went well past ATH. Always good to shave some profits.", "score": 83, "replies": []}, {"body": "Especially when the stock should be sub 150 a share and it trades over 190", "score": 5, "replies": [{"body": ">stock should be sub 150 a share\n\nClearly everyone else don't think so.", "score": 47, "replies": [{"body": "Because consensus opinion in markets is never wrong...", "score": 0, "replies": [{"body": "You and the other guy should at least clarify why it should be below 150 at the very least.", "score": 10, "replies": []}]}, {"body": "Cause they’re not very smart, and everyone is dumping their bags on retail and 401k investors. Gotta look at the money flow", "score": -27, "replies": [{"body": "You'll find the truth will frequently get you down votes on Reddit lol.", "score": -9, "replies": [{"body": "Down voting for accuracy", "score": 12, "replies": []}]}]}]}, {"body": "OK post a copy of your model math backing into that sub-$150 / share price", "score": 3, "replies": []}]}, {"body": "But you only cash out at valuations you think are expensive. Investing 101", "score": -5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "True... If you don't want to be really rich some day, buy a target date fund", "score": 1, "replies": []}]}]}]}, {"body": "Companies that grant stock to employees tend not to have insider buys.", "score": 237, "replies": [{"body": "Notable exception: GME (Though they've definitely had quite the change in leadership recently)", "score": 60, "replies": [{"body": "You aren’t wrong.", "score": 30, "replies": []}, {"body": "Just goes to show you that insider buying can be a very overrated metric", "score": 1, "replies": [{"body": "Can you elaborate on this? Personally, insiders buying and holding their own company says a lot. While selling on the otherhand doesn’t necessarily make it a bad company to invest in.", "score": 6, "replies": [{"body": "If a shitload of your compensation comes in the form of company stonk you probably aren't in a hurry to also go out and buy more of the same.  Its too much risk tied into one company.", "score": 1, "replies": [{"body": "That’s true but still consistent with what I said. My question was about how insider buying is a very overrated metric.", "score": 3, "replies": []}]}, {"body": "Well for one thing the stock has been consistently dropping so people who followed the GME execs into the trade lost money. For another, the buys they made were small which leads me to believe that they only bought in order to mitigate the impact on the stock price of a bad earnings report. This actually worked briefly, as the stock price soared higher than the pre-earnings price when it was announced that Cohen made a small buy. But it’s been downhill since then.", "score": -5, "replies": [{"body": "Genuine question, how is $765 million dollars worth of stock small?\n\nhttps://www.gurufocus.com/insider/170417/ryan-cohen#:~:text=Ryan%20Cohen%20currently%20owns%20a,and%20a%20weighting%20of%2099.91%25.\n\nAnd a recent purchase of $10 million worth of stock?\n\nhttps://www.reuters.com/technology/ryan-cohen-scoops-up-gamestop-stock-worth-10-mln-shares-rise-2023-06-13/\n\n\nIf you value day by day trades GME is not a good stock due to volatility but if you want long term valuation\n\n “Where is the report on that guy who studied insider trading for like 30+ years? He basically came to the conclusion \"insiders can sell for any reason, but they only buy for one\"", "score": 4, "replies": [{"body": "I’m calling the recent $10M purchase minuscule, not the entirety of his investment. \n\nIf you want to base your investments entirely on what Ryan Cohen does then be my guest. Any thorough analysis of GME as an investment makes it clear that it is absurdly overvalued, however.\n\nAnd the Peter Lynch quote you’re referring to is certainly a famous one, but this is an extremely niche situation that wouldn’t have even existed when he originally said that. Re-read the comment you’re replying to in order to understand why. Cohen knew that buying a relatively small number of shares would help pump his very large overall investment in the face of a terrible earnings report.", "score": 0, "replies": [{"body": "I’m placing basis in a very large market that I happen to be involved in I understand where gaming is going in the future and this company has a very strong position in that falling into place. My purchases are based on long term fundamentals and fundamentals alone. Along with a massive short position. If a CEO didn’t believe in their company why would they buy the stock? Are you apart of the individuals who think Ryan is attempting to rug pull? One should know through “thorough analysis” know that the BBBY incident occurred due to mismanagement at a executive level just as many other stocks on our massively overvalued market. You are certainly right this is an extremely niche situation where regulators and party got caught with their pants down.", "score": -1, "replies": [{"body": "You understand where gaming is going in the future? Then you understand that most of the growth is going toward mobile games, and that physical video games are being phased out right? GameStop is horribly positioned right now.\n\nIf you would just read my comments, you would understand that Ryan Cohen knows that the stock price will go up every time he buys because of the fanaticism around the stock. Buying 10,000 shares was a small investment that made his large investment (the rest of the shares he owns) grow substantially in the short term and prevent an earnings slide. But the meme craze is dying out so the impact of his buy orders are weakening over time. Maybe Ryan Cohen believes in the company and maybe he’s just trying to keep the price inflated for as long as possible. All I know is that you better sure as hell trust this guy because GameStop is overvalued to shit just by looking at growth and profitability metrics.", "score": 1, "replies": [{"body": "Guys a billionaire off one company on understanding on upholding customer satisfaction. Much more to that he beat Amazon?  I trust him pretty hard you are much more then I trust you. obviously your an old head and don’t understand the video game industry, nor do you care to understand the framework that they are setting up with major players, such as apple. (your mobile game industry) everything about GameStop is the future you just have yet to see it or understand the blitzkrieg that is coming into effect. Look up how much money is made in cosmetic item purchases each year in video games. When an individual can buy a skin on Fortnite, or modern warfare then sell it, you will have people who can generate income off of earning items. then selling those to people with currency who don’t want to spend that time or just want that cosmetic. This creates a whole economy, thus when cronyism fails decentralization will persist. Wether it’s barter and trade due to inflated currency or digital commodities people use to value our world. We are rapidly changing, be ready for that.", "score": -1, "replies": [{"body": "Yes he had immense success with Chewy which was a startup that relied entirely on online deliveries. GameStop is a very old company that has completely failed to generate any online sales; hence the firing of Furlong, the closing of the Kentucky distribution center, and the refusal to even mention online sales on earnings reports. Just because he succeeded in one venture doesn’t mean that he will succeed in everything he does.\n\nThe NFT stuff you’re referring to is not going to save GameStop. What incentive does any video game company have to allow GameStop to sell their skins on the dying marketplace that is essentially just a buggy knockoff of OpenSea. Just give me a single reason. One.", "score": 2, "replies": [{"body": "I just said a platform and place to sell things. ease of use is all people want the moment things are simple enough for them to be emulsified they will be. have you not seen the sales with Zelda and let alone consoles? The time is now old man people have not forgotten GameStop. \nAnd because they all already have a long lasting partnership. Listen man I know what’s being talked about in the industry and I know what the consumer wants. you sound like your getting real worked up. Take a stroll or smoke a joint life’s too short to stress take care.", "score": 0, "replies": [{"body": "There is literally nothing easy about creating a crypto wallet, navigating through GameStop’s clunky marketplace, buying a skin, and then importing it into a game. Have you ever bought a skin before? It’s easy as fuck. You are trying to create a solution to a problem that doesn’t exist.\n\nNo one is getting worked up lmao you must not be used to people calling you out on your bullshit. I promise you will get over losing an internet argument. And just as an FYI when you resort to insults over something this banal you’re just making yourself look weak.", "score": 2, "replies": [{"body": "You win my friend my notes on your passive aggressiveness were clearly an insult. My apologies.", "score": 0, "replies": [{"body": "I was never passive aggressive. Maybe you’re just sensitive?", "score": 2, "replies": [{"body": "The five worst passive-aggressive phrases in English are:\n\n“You’re too sensitive.”\n“Why are you getting so upset?”\n“No offense, but…”\n“Whatever—”\n“If that’s what you want to do…”\n\nhttps://preply.com/en/blog/most-passive-aggressive-phrases/\n\nget a life stop responding to other people about how they choose to spend the money they work for", "score": 0, "replies": [{"body": "You responded to me first lmao. Enjoy losing money and hanging out with your alien friends", "score": 1, "replies": [{"body": "Booootlickerrrrrrr watch your reality shatter before your eyes like magic ❤️\nLove ya bud still will be here when your feeble mind crumbles from the weight of reality", "score": 0, "replies": [{"body": "Yea you’re definitely fighting against the evil hedge funds by buying shares of a failing game store owned by a billionaire who treats his employees like dog shit. Ever heard the expression ‘tilting at windmills’?", "score": 1, "replies": [{"body": "Ever heard the expression Ligma?", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "The cult is in full force today, jfc...", "score": 2, "replies": []}]}]}]}, {"body": "Where is the report on that guy who studied insider trading for like 30+ years? He basically came to the conclusion \"insiders can sell for any reason, but they only buy for one\"\n\nSee: Charles Schwab executives all making 40%+ in \\~3 months earlier this year", "score": 144, "replies": [{"body": "Is there a way to find companies where insiders are buying?", "score": 32, "replies": [{"body": "OpenInsider.com", "score": 44, "replies": [{"body": "Do you know how to tell the difference between grants and options being vested rather than an outright purchase?  Or is it all jumbled and that’s the difficult part?", "score": 6, "replies": [{"body": "You can filter purchases, sales, grants and other things yes. Not to sure on the vested options part however.", "score": 8, "replies": []}, {"body": "Not sure there’s a way to tell. Simplywall.st has pretty good analysis, including insider buying and selling information. (I’m not connected with them, I’m just a subscriber.)", "score": 2, "replies": [{"body": "Will the Free account let me do thst?", "score": 1, "replies": []}]}, {"body": "Does the company submit this to sec for scheduled stock sales/ grant?", "score": 2, "replies": []}]}]}, {"body": "https://www.sec.gov/edgar/searchedgar/companysearch.html", "score": 2, "replies": []}]}, {"body": "Or Noto and SOFI. Glad I followed.", "score": 16, "replies": [{"body": "Lol, I really feel bad for Noto sometimes, he’s doing an exceptional job, buying a fuck ton of shares, and people find the most nit noid risk to hammer him on and apply completely different standards to his company after 3 goddamned years of them being public.", "score": 11, "replies": []}]}, {"body": "https://www.nasdaq.com/market-activity/stocks/schw/insider-activity \n\nNot really, but probably will eventually get 40%. Most bought around 55–58. Still good to pay attention to when multiple ppl at the company are buying with Direct purchases and adding significant amounts compared to their current holdings", "score": 3, "replies": []}, {"body": "He studied for 30 years and that was his take-a-way? I mean I could tell you that in 3 seconds of common sense", "score": 6, "replies": [{"body": "It means he had all sorts of evidence to back up his claim. Although 30 years would be a huge waste of time, or maybe it was 30 years of data sample.", "score": 4, "replies": []}, {"body": "Science often proves things we “already know”. Idk about that guy studying and if it was scientific per se, but we have to confirm things scientifically that we may already assume to be correct.", "score": 2, "replies": []}]}, {"body": "Is there a way to tell if their purchase is actually just part of a pre specified compensation plan?", "score": 1, "replies": []}]}, {"body": "Is one never supposed to sell shares earned as compensation?", "score": 23, "replies": [{"body": "No you are never allowed to sell shares. Since stocks only go up you must keep buying until you die. It doesn't matter if you have no money for food, keep buying shares.", "score": 16, "replies": [{"body": "Definitely not the case here. Fwiw if you're in a strong mag 7 then you have a probability to beat the S&P over time if you're willing to take a risk", "score": 1, "replies": []}]}]}, {"body": "Man, AAPL really shouldn’t be judged by normal standards, insiders selling stock is not something that even comes up on my radar because it’s freaking Apple man.", "score": 12, "replies": []}, {"body": "Im buying apple i don’t take the insider selling for much tbh they all have blackout periods to abide by and can sell their stock if they want to", "score": 53, "replies": [{"body": "This post is so stupid anyways. Apple hits an ATH and some people sell. SHOCKER", "score": 23, "replies": [{"body": "Some are new to the game though 🤷", "score": 5, "replies": []}]}, {"body": "Ah I'm starting to get into investing, you saying it's ok to buy some apple stock now?", "score": -4, "replies": [{"body": "Plz don’t listen to me lol it just sold off a bit so I’m starting to trickle into it", "score": 6, "replies": []}, {"body": "Having Apple stock is better then having your money in a savings account at a bank.", "score": 10, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Almost 3 trillion. Flop? That’s laughable. Ask the Oracle of Omaha what he thinks.", "score": 1, "replies": []}]}]}, {"body": "Here's the best investing advice you'll ever hear if you're just starting out: Don't ever -- ***EVER*** -- go to reddit for stock advice and then follow it. \n\nOtherwise, you will have a very very very bad time.", "score": 2, "replies": []}, {"body": "Yes, it is always okay to buy apple stock man", "score": 4, "replies": []}, {"body": "Man, please if you are starting to get into investing, go away. This is not the right place to learn.\n\nOr maybe, if you haven't already understood this, it is because you belong here.", "score": 4, "replies": []}, {"body": "No one can predict where it will go the next few months, but long term tou should be fine.", "score": 1, "replies": []}]}]}, {"body": "A buy at 180 seems like a good deal to me.", "score": 4, "replies": [{"body": "Lol", "score": 2, "replies": []}]}, {"body": "ATH. Apple don’t hire dumb people. Buy low sell high. \n\nI know it sounds weird to you guys, but that’s what smart people do.", "score": 5, "replies": []}, {"body": "I have learnt over the years not to bet against some companies. Apple is at the top of that list.", "score": 12, "replies": []}, {"body": "There are a million reasons to sell but only one to buy", "score": 13, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "make money", "score": 10, "replies": []}, {"body": "🚀", "score": 3, "replies": []}]}]}, {"body": "It’s call cashing out their salary, this is not an indicator of company performance", "score": 9, "replies": []}, {"body": "I think it could also have something to do with overall economic outlook.", "score": 4, "replies": []}, {"body": "That’s part of their compensation. This is minuscule compared to shares outstanding.", "score": 8, "replies": []}, {"body": "It’s is the largest company in the world. Nothing else is valued above it.\n\nIt’s market cap is like 15% of US annual GDP.\n\nIt is near ATHs.\n\nThey got on another earnings call and signaled lower forward sales than last year.\n\nExecutives are all given shares as part of their compensation package.\n\nNot a statement on apple as a business. Certainly not saying short it. But what incentive do executives have to buy stock here?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I have Apple puts. Conclusion: apple stays flat forever 😁", "score": 5, "replies": [{"body": "It’s funny because you think it does until you buy shares and then you’re like “fuck I guess it went up quite a bit unbeknownst to me…”", "score": 1, "replies": []}, {"body": "Did you have them before earnings? I closed my $185s out in the mid $170s, but only due to duration and a hope to buy more cheaper vs. rolling at full price.", "score": 1, "replies": [{"body": "Got 4 before earnings, sold 2. keeping 2 for now.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "It’s very hard to sell with blackouts and such. If it’s <20% if their holdings don’t read much into it. These executives are getting more and more via grants all the time. Regular selling us just about keeping your investments in balance. A 20% sale might only be a net drawdown of 5-10% because of ESPP and RSU grants.", "score": 4, "replies": []}, {"body": "Insider sales have been shown to have almost no correlation to future performance. Insider buys… well there are very few reasons to buy more unless you think it’s going to go up. I still wouldn’t read much into the lack of insider buying. Guys are more of a positive signal than lack of buys is a negative signal.", "score": 2, "replies": []}, {"body": "I like how the negative sentiment for Apple Inc comes around like a cyclical/commodity.  Every year the Apple Bears come around and It's always \"overpriced; P/E is out of orbit; can't grow anymore; only a company of iPhones; not diversified.\"  Yadda, Yadda, Yadda.\n\nHopefully, the pullback continues because I'm buying;)", "score": 2, "replies": []}, {"body": "the stock is over priced and ran up hard so you sell. its pretty simple", "score": 5, "replies": [{"body": "They just can't randomly decide to sell, they have to schedule it months in advance...", "score": 2, "replies": []}]}, {"body": "Deirdre is she/her FYI.", "score": 3, "replies": [{"body": "I was just about to comment before I saw this one! \n\nOriginator assuming an SVP at Apple was male really rubbed me the wrong way.", "score": 2, "replies": []}]}, {"body": "I think some people are reading too much into this. They have blackout periods and a recent blackout just ended for apple. So people will want to take out their money since it iS a good time to buy a house in some parts of the US. And minimum down payments for house loans are up to 20% now in california, so it makes sense they'd need more cash on hand.\n\nFor bigger houses like those that the execs might buy, the down payment requirements are insanely huge right now.", "score": 2, "replies": []}, {"body": "\"Save Apple,\" lol", "score": 1, "replies": []}, {"body": "Can't sell if noone is buying", "score": 1, "replies": []}, {"body": "Apple fair price 150$", "score": 0, "replies": []}, {"body": "Apple has sat on their mountain of money, rather than investing in innovation.  Out of ideas?   \nIt has happened before, and seems to be again. \nTime to cash out of $AAPL.", "score": 0, "replies": []}, {"body": "I called Apple a $90 stock when it was at $130. Still sticking with my Prediction at $190 or $170. Doesn't matter. Way overvalued for nothing IMHO!", "score": -7, "replies": [{"body": "Keep waiting, if it goes 90, apple would be buying 10-20% of a company as buyback.", "score": 3, "replies": [{"body": "We shall see", "score": 0, "replies": []}, {"body": "Then buy as much as you can at $91.", "score": 1, "replies": []}]}]}, {"body": "They are no better then dell just another hardware company.", "score": -10, "replies": []}, {"body": "China may cut off Iphone after these chip sanctions.", "score": 1, "replies": []}, {"body": "These are almost always timed sales and don't mean anything.", "score": 1, "replies": []}, {"body": "Apple will be fine long term.", "score": 1, "replies": []}, {"body": "Why would you think insiders would ever buy Apple stock? Wouldn't make a whole lot of sense if you thought about it...\n\nThey are being paid stock so they have to sell some just to pay taxes effectively meaning that not selling = buying from their perspective...", "score": 1, "replies": []}, {"body": "Apple is a cross road of innovation. Not much you can do with their hardware side. It’s fully tapped. Their services can only do so much.", "score": 1, "replies": []}, {"body": "Insiders sell for many reasons, insiders buy for only one reason - they think the share price will increase", "score": 1, "replies": []}, {"body": "Are we really speculating Apples future? I promise you institutions are laughing at retail right now", "score": 1, "replies": []}, {"body": "Inside selling don’t matter there is trillions reason to sell.\n\nInside buying from upper management does not matter too, because they are expected to buy shit to show commitment.\n\nInside buying from normal employees is great sign.", "score": 1, "replies": []}, {"body": "ive also sold all of my 6 shares at the ath", "score": 1, "replies": []}, {"body": "Dudes, go look up Peter Zeihan on China. He has laid it out and things are bleak as fuck for China.\n\nHe literally predicted the current Ukraine war and we can expect one soon between Saudi Arabia and Iran.\n\nApple is leaving China at least two years too late.\n\nIt's going to take several years to rebuild that logistics network. Apple will bleed cash until they can come out with a new iphone. That's a few years down the road.\n\nOf course they are selling. Of course they aren't talking about why or else everyone will dump \n\nChina will be lucky to be a single country by 2030. The labor costs there have gone up 12 good in 20 years. They are not competitive anymore. They retain industry thanks to sunk costs.\n\nMexico is the new China and it's right next to the largest market on the planet. Even many choices bese companies are reshoring to Mexico. They've spent billions doing it.", "score": 1, "replies": []}, {"body": "I don’t worry at all about insiders selling a stock like Apple when it’s basically at its all-time high price. \n\n\n\nInsiders presumably receive stock as part of their compensation and if they just hold it all as Apple stock then they are concentrating too much of their personal wealth in one area. So it makes sense for them to sell some of their shares from time to time, so they can diversify their assets. The perfect time to do that is when the stock has been on a strong run so they get a good price. \n\n\nIf a bunch of insiders start selling after the stock has been on a long down streak, that might be worth paying attention to. But this is nothing to worry about IMHO.", "score": 1, "replies": []}, {"body": "People sell when they’re up big and have been holding a lot time and want to take advantage of the market.\n\nNews at 7.", "score": 1, "replies": []}, {"body": "They know apple is overvalued", "score": 1, "replies": []}]}
{"title": "Anyone else think Google has a lot of growth left ?", "selftext": "Google has a 1.64 trillion market cap. It’s the 4th biggest in the world. A part of me seems to believe that once you’re on top, there’s nowhere to go but down. But I also feel like there are many ways Google could increase their revenues. \r  \n\r  \nYouTube still has untapped potential. Google could make it so users can directly buy the products they see in videos without leaving YouTube, which would make the life of content creators a lot easier and could be a huge cash cow. \r  \n\r  \nA lot of their apps (Docs, Sheets, Maps, etc.) are still free while competitors like Microsoft charge a lot for similar products. \r  \n\r  \nGoogle Search still has 88% of the search engine market share and I believe the integration of generative AI (which should come soon) will increase their revenues.\r  \n\r  \nMany of their other apps seem promising as well.\r  \n\r  \nI think Google has a lot of upside, but I’m afraid my bias (I like the company) is clouding my judgment. Should I look to invest in a smaller cap company or does Google still have significant room to grow ? \r\n\n&#x200B;", "id": "15no0dd", "created_utc": 1691700628.0, "score": 309, "upvote_ratio": 0.85, "num_comments": 285, "comments": [{"body": "lunchroom concerned prick yoke dirty wise cooing dinosaurs provide toy ` this message was mass deleted/edited with redact.dev `", "score": 382, "replies": [{"body": "I own a decent amount of GOOGL and I agree with your opinion. That said, history has demonstrated time and time again, today's leaders poised to capitalize on a trend may not be tomorrow's winners. \nNokia, MySpace, Yahoo, Kodak are great examples. \n\nI'm holding for now.", "score": 135, "replies": [{"body": "It's a bit different on this one. \n\nThese guys have, in fact, stayed relevant and monetized their products in tons of different ways. \n\nAlso, the very fact that they havent monetized every bit of their business seems to be working out for them in courts now. It's been a real struggle for the governments around the world to show how Google is harming customers simply due to how much \"free\" stuff they provide. \n\nIs this the smartest move? I have no idea. I am holding Google too and picked up a good number when they dipped below 90. I intend to hold for now.", "score": 73, "replies": [{"body": "Looks like they won automated driving instead of Tesla.", "score": 7, "replies": []}, {"body": "Great points! Im in it, because i see companies spend on cloud. Google has underperformed compared to Microsoft &  Amazon this year. But im holding all 3 through the upcoming dip.", "score": 3, "replies": []}, {"body": "It's not different this time.", "score": -4, "replies": [{"body": "Deep", "score": 10, "replies": [{"body": "I wasn't attempting to be. It's not different this time, but it's funny how people keep getting duped into thinking it is.", "score": -1, "replies": []}]}]}]}, {"body": "Microsoft was flat for 10 years under Balmer.", "score": 17, "replies": []}, {"body": "I think today’s leaders will stay leaders for longer than people may expect. The nature of our monetary system has made it conducive for money and power to centralize and grow. I don’t think we’ll see the fall of the biggest companies anytime soon (at least not in the next 10 years), but there’s no way to know. It is fun to think about, though.", "score": 6, "replies": [{"body": "Nothing has changed. People are still in charge. People are humans. Humans are greedy, shortsighted, and arrogant. They will fuck up like they always do.", "score": 3, "replies": []}]}, {"body": "I agree. Same.", "score": 2, "replies": []}, {"body": "Difference between yahoo etc and Google is Google has its roots far and wide. \n\nMissing out here and there won't take it out.", "score": 1, "replies": []}]}, {"body": "And yet they struggle to operationalize and monetize so much of their capacity. Definitely a poorly run juggernaut, but nonetheless the opportunity is boundless and deserves a valuation", "score": 58, "replies": [{"body": "If they monetise google search too aggressively they risk letting some other search engine take over. Once that happens it is hard to return to this monopoly.\n\nPeople are only loyal to Google search bc it works and is free. So they can only profit from ads, they can not directly ask money from the userbase.", "score": 49, "replies": [{"body": "Google Search is perfected. \n\nGoogles growth is from Cloud and YouTube.", "score": 27, "replies": [{"body": "Waymo, AI, robotics, Google Fiber, Google Pixel, quantum computing.", "score": 9, "replies": []}, {"body": "IDK why you all think Youtube has much growth left. Youtube is in fact stalling quite hard over past few years. It is saturated with ads and YT premium is quite pricey. Not to mention they lost some traffic to short videos on Tiktok/Reels. \n\nOverall, it is pretty much over for YT in terms of revenue growth", "score": 13, "replies": [{"body": "Yeah I don't know what people who are saying YouTube has anywhere more to grow are smoking. There's already a huge amount of negative sentiment in the general population against YouTube, not to mention the content creators themselves. Ads are getting so egregious, if they ramp up even more it feels like there will be riots.\n\nEveryone is only staying on the platform because there is no realistic alternative at the moment, but the minute one appears people will be gone. Reminds me of the situation Netflix was in - they had everything, all the content, but the moment they started losing content and all the other streaming services showed up, they started bleeding hard.", "score": 1, "replies": [{"body": "The only thing Youtube growths in is streaming.", "score": 1, "replies": []}, {"body": "Ads in general are at their lowest average value in 5 years, going back to 2018. Even lower than during Covid. \n\nMost analysts expect the Ad market to turn around and begin rising in price, once corporate fears of recession shift. We are actually seeing Ad prices bottom out in Q2 earnings for Meta/Snap/Google.", "score": 1, "replies": []}]}]}, {"body": "From the it-sec side, we don't use Google anymore. It's mostly Startpage now which get their results from Google with privacy on top.", "score": 1, "replies": []}]}]}, {"body": "cagey scary marble wise insurance thumb escape late hunt upbeat ` this message was mass deleted/edited with redact.dev `", "score": 13, "replies": [{"body": "Everything successful was created a while ago. They can't deliver anymore.", "score": -7, "replies": [{"body": "They don't have to deliver to grow. They can do the Microsoft and grow through acquisitions and anti competitive behaviors.", "score": 3, "replies": []}, {"body": "YouTube TV is already the top OTT in the US.  That is not that old.  Google Photo is another example.  \n\nK12 use to be owned by Microsoft and Apple.   Now Google has over 90% share of K12 in the US.", "score": 4, "replies": [{"body": "> K12 use to be owned by Microsoft and Apple. Now Google has over 90% share of K12 in the US\n\nDo you have a stat for this handy?\nI keep reading this but I'm not sure how much revenue or profit K12 is driving for them really...", "score": 1, "replies": [{"body": "I don't have a link.  But last number I saw was 90%.   Probably higher now.\n\nK12 is strategic.  It gets the government to fund training on the Google eccosystem 6+ hours a day.\n\nBTW, there was a time that Microsoft and Apple owned this space.  But Google knocked both of them out of the space.", "score": 3, "replies": []}]}]}]}, {"body": "Yet how much money do those make? They are mostly free services with little profit for Google aimed to getting people to use their search, or to prevent competitors from being a threat to search.", "score": 1, "replies": []}]}, {"body": "I haven't gotten to analyzing Google's management team, it's on my to-do list. But something about Sundar turns me off. When I hear guys like Nadella talk, it seems obvious they are smart. I have yet to experience that with Sundar.\n\nI'm probably completly wrong, you don't get to be CEO of Google without an impressive resume, but I haven't fallen in love with him yet.", "score": 5, "replies": [{"body": "You're radar is working.\n\nhttps://tfipost.com/2022/06/google-is-the-epicentre-of-brahminism-under-sundar-pichai/", "score": 2, "replies": []}, {"body": "It’s called your unconscious biases", "score": 2, "replies": []}]}, {"body": "Poorly run juggernaut lol.  Their return on invested capital says otherwise", "score": 7, "replies": []}, {"body": "Well said", "score": 3, "replies": []}]}, {"body": "Just don't forget they are first and foremost an ad company.  They are almost totally reliant on advertiser dollars", "score": 5, "replies": [{"body": "What’s wrong with that? Ad business is a good high margin business.", "score": 4, "replies": [{"body": "Sure, but they have almost no products, and one major shift in how people access information could destroy their business model. \n\nFor example, if advertisers decide to shift to a more sponsorship model with \"influencers,\" or could spell a huge loss in profits for them. \n\nOr if they make some off-hand political statement, they could quickly go the way of Yahoo.", "score": 1, "replies": []}]}]}, {"body": "True, but somehow they keep making their search worse and worse. The other day, I searched for \"holdings\" (in quotes), and they were also showing holders. That is the complete opposite of what I was searching for.", "score": 5, "replies": [{"body": "crawl slimy sulky frighten chubby swim paltry murky bike hunt ` this message was mass deleted/edited with redact.dev `", "score": 2, "replies": [{"body": "It is still so much better, but they do keep getting worse and worse. Often even what I put search terms in quotes, they show results for the antonyms. That is the opposite of what I'm searching for!", "score": 3, "replies": []}]}]}, {"body": "Also 170k employees who are some of the smartest people in the world no doubt that could take advantage of said data", "score": 1, "replies": []}, {"body": "They could probably make a library to recreate all Lahaina history. At least that is my hope.", "score": 1, "replies": [{"body": "upbeat handle yam tease saw naughty chief soft fretful nine ` this message was mass deleted/edited with redact.dev `", "score": 1, "replies": [{"body": "Really? Google stores much of the worlds information and they are building the largest cloud drive and most proficient search engine in the world. That would be an amazing community project and showcase of how digital storage could rebuild lost history like this. I’m just thinking if applications for their resources. They are now in language translation. \nWhat do I know…\n\nStonks.", "score": 1, "replies": []}]}]}, {"body": "The problem with the Google AI concept is that AI is going to be trained for *specific* tasks before it is trained for *general* tasks.\n\nGoogles information about the internet is deep but can they monetize that via AI? I’m not convinced.\n\nGoogle has been building AI for dozens of years. They where even on par with GPT before it was released. But their management realized AI would pilfer their own customer base in a way was harder to monetize then they already are.", "score": -3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You do know Bing Chat is free ChatGPT4? right? Right?", "score": 1, "replies": [{"body": "Bing chat is garbage and no one is using it", "score": 1, "replies": []}]}, {"body": "I think you guys are saying the same thing. AbstractLogic is saying that google management never went into generative AI search before openai because they knew that gen AI search wouldn't change their monetization. Partly because most of the queries that make money are people just searching to buy products. Why would you ever want to use a gen ai product to serve people results for chairs? Doesn't make sense because people just want to be taken to the products.", "score": 1, "replies": []}]}, {"body": "Totally agree, although Google has plenty of data on you, it doesn't mean anything if they can't USE that data to build a model for some product. For example, all of that data on you isn't going to improve their search engine. Why? Because you are already telling the search engine what you want. The only place where this data is necessary is for targeting you with advertisements or recommending content. But Google doesn't really have many products that do that, except youtube, which has actually been trending down lately.", "score": 1, "replies": []}]}, {"body": "True but management can be really effective and burning a company down and who knows what happens in 5 years", "score": 1, "replies": []}]}, {"body": "They have search, Chrome, Android, Maps, Google Fiber, Youtube etc. They have a lot of things. However, the vast majority of their revenue comes from search, and that dominance is their largest risk. If a government ever says, \"You have a monopoly on search.\" it would be like AT&T breakup back in 84. It would be monumental. \n\n> A lot of their apps (Docs, Sheets, Maps, etc.) are still free while competitors like Microsoft charge a lot for similar products.\n\nNothing is free. If you think it's free, then YOU are the product. Other businesses DO NOT want to be Google's product. Microsoft Office will continue to dominate the corporate arena. \n\nAdvantages. Google has a moat on Maps, Search, Youtube, Chrome, Android, Apps, and Google One. 72% of the world has an Android computer in their pocket. Youtube has 2.2 billion active users.", "score": 76, "replies": [{"body": "Yes, however, shareholders would get shares in all the broken up companoes as well. Which might even be decent for those broken up stocks due to being more specialised with a more focused goal", "score": 16, "replies": []}, {"body": "Google Cloud turned a profit for the first time this year. They will take market share from AMZN and MSFT because they can offer their own in-house TPUs at a fraction of the cost of the other cloud providers offering NVDA A100 chips. \n\nSo I'd definitely count on Google growing additional revenue sources, at which point valuation multiple should expand.", "score": 30, "replies": [{"body": "There is no indication that what you say is true according to the data. Let's keep this fact based.\nhttps://www.statista.com/statistics/967365/worldwide-cloud-infrastructure-services-market-share-vendor/\n\nAWS has maintained the same dominant share of cloud since 2017. Google, Microsoft, and Oracle have all grown their share, but it's been at the expense of the small players. AWS hasn't lost anything. \n\n> They will take market share from AMZN and MSFT because they can offer their own in-house TPUs at a fraction of the cost of the other cloud providers offering NVDA A100 chips.\n\nGoogle, Microsoft, and Oracle are deploying Ampere chips and offering them commercially. AWS has largely deployed their Graviton chips. Google, Microsoft, and Oracle have been playing catchup to these smaller and more efficient containerized Graviton chips and Ampere fits the bill. \n\n> So I'd definitely count on Google growing additional revenue sources, at which point valuation multiple should expand.\n\nI predict next years revenue will look much like this years....just more of it. Search and Youtube will have the best margins and the highest revenue share. Cloud revenue will be higher, but margins will continue to erode.", "score": 23, "replies": []}, {"body": "Pure bullshit and fantasy. They have no special competitive advantage over Amazon or Microsoft.", "score": -1, "replies": []}, {"body": "Google Cloud is quite different from Azure and AWS. It's the tippy-top of high performance cloud computing, and its very expensive as a result. Google's not trying to compete with Microsoft or Amazon for their core \"microservice\" style customers.", "score": -3, "replies": []}]}, {"body": ">would be like AT&T breakup back in 84.\n\nAnd that would be a DAMN good thing for investors.  \n\nFor example \n\n\"On Jan. 1, 1984, more than 3 million AT&T shareholders were given new stock: For every 10 shares of Ma Bell they owned, they received one share in each of seven new regional phone companies, or “Baby Bells.”\n\nIf they haven’t sold any of it since, their investment has grown more than 600 percent. Those who reinvested their quarterly dividends in additional shares did even better, getting compounded growth as much as 900 percent\"\n\nhttps://www.spokesman.com/stories/1996/may/25/att-rewards-steady-investors-shares-held-since/", "score": 7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Look at the article date home boy.\n\nAt the time, dividends reinvested, youd outperform the S&P by over 4% for over a decade.\n\nThis article is from 1996\n\n\"If you took all your dividends in cash, your total market return has been 608 percent - or about 16 percent compounded annually. By comparison, the Standard & Poor’s 500 index, a widely used benchmark for stock-market returns, has grown 14.5 percent per year.\n\nIf you reinvested all the dividends - a practice the Bell companies encouraged for years by offering a 5 percent discount on shares purchased that way - the returns have been really spectacular: a portfolio today worth more than $50,000, and compound annual growth of around 18.5 percent, according to telecommunications stock analyst Dave Otto.\"", "score": 12, "replies": [{"body": "[deleted]", "score": -11, "replies": [{"body": "[removed]", "score": 6, "replies": [{"body": "[deleted]", "score": -9, "replies": [{"body": "How dense can you be?  Im not saying anyone should hold on to any stock forever.  I am making the point that antitrust legislation typicallt works out well for investors when it takes place.\n\nAs with any stock youd evaluate how long you plan on holding the individual parts.", "score": 9, "replies": [{"body": "Look at his posts and it would seem he hates google for some reason and loves apple", "score": 2, "replies": []}]}]}]}, {"body": "Because the reply was directly aimed at replying whether keeping the mamaATT stock after split would outperform sp500 in the period, which is relevant. \n\nYour point is akin to \"buying att stock in 2008 would have worse yield than buying sp500 at that time\" which, even though it's true, is irrelevant.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Discussion was about whether a split would impact shareholder value negatively.\n\nYou seem to misunderstand on purpose, pointless to discuss with you further", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Honestly they could make a one in all app. Like what Musk is trying to do but they actually have the foundation for it. They just need to figure out how to make a cohesive ecosystem, like what Apple does.", "score": 2, "replies": []}, {"body": "Not to mention sheets is no where near as good as excel. Period.", "score": 1, "replies": []}]}, {"body": "Google Cloud is also growing fast\n\nAnd TPU v4 is looking quite capable of handling generative AI LLMs, making it cheaper for Google than say Microsoft to run AI queries.", "score": 29, "replies": [{"body": "Google cloud is going to absolutely kill it with TPUv5\n\nAllegedly they are making millions of them, if they play this right they might capture a lot of the AI spend overhang in the next few years.", "score": 6, "replies": [{"body": "They should. Nvidia's success should motivate Google to accelerate TPU growth.", "score": 4, "replies": []}]}]}, {"body": "Does Google have an unbreachable moat on search? If yes it grows. If no it don't. \n\nNone of their other projects can make up the difference if their search moat fails. Because that's most of their money.", "score": 41, "replies": [{"body": "Many have tried to breach that moat all have failed and not even come close. Even bing with its chat gpt integration showed slowing growth after its initial spurt as people reverted back to google after trying it out.", "score": 8, "replies": [{"body": "Yeah idk why Google search still feels intuitively nicer to use. Can’t exactly explain why.", "score": 1, "replies": []}]}, {"body": "IMO, no it doesn't. Definitely feels like Google search is getting worse, with searches being full of ads and AI generated affiliate link listicles. Data Google collects on you also increasingly influences search results, which (IME) makes them less valuable. DuckDuckGo feels closer to what Google used to feel like.", "score": 23, "replies": [{"body": "people have been talking about DDG like that for years, get real", "score": 16, "replies": [{"body": "DDG is literally bing lol", "score": 2, "replies": []}, {"body": "I wouldn't know. I just switched a month ago after getting fed up with Google.", "score": 1, "replies": []}]}, {"body": "And their idiot CEO claims that is what the average person wants. Maybe, but it isn’t what they need.", "score": 1, "replies": []}]}, {"body": "Search as we know it will change.  I suspect we no longer go to google.com and search for something, but rather ask questions as we work.  \n\nGenerative AI can understand the context of the work and provide the relevant result.  \n\nTo that end, I see either googl or MSft winning the fight.  I invested in googl and aapl back in the 2000's assuming one would win the phone race.   Now I'm doing the same with googl and msft.", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I think the way we search changes.   Search will just become something we do in parallel to workin/using the internet.   \n\nI think the first version of google glasses was trying to do this.  Fully integrated internet.", "score": 2, "replies": [{"body": "yea i mean. i understand trying to envision a radically different internet\n\nthat worked more in the 90s when the internet was new though. like the internet won - everyone spends all their time on it now. critical mass is there\n\nits hard to imagine a radically different thing when people arent even nibbling on a hint of the new version.  (meaning no ones really using bing chat or SGE)\n\ni like, actually tried. i turned on SGE. you can too. https://blog.google/products/search/generative-ai-search/ ; honestly it just sucks though. i disabled it\n\nthe UI is just the opposite of what people use search for\n\ni want to type in one word, have it konw what im talking about, and get the answer immediately. not read a bunch of verbose stuff thats maybe wrong\n\ni have the feeling 99.9999% of searches are like that. [close to 2/3s already dont involve clickthru](https://www.semrush.com/news/242672-zero-click-searches-are-on-the-rise-but-marketers-shouldnt-be-scared)", "score": 1, "replies": []}, {"body": "So how do we interact with search then?\n\nI ask questions as I work now, to Google, and the results hang out on a browser tab that I can go back and forth to as I traverse the results. How will this change?", "score": 1, "replies": []}]}]}, {"body": "Smart. If you don't mind me asking, what's your total return % on those 2 stocks ?", "score": 2, "replies": [{"body": "Eh...not a fair comparison since it was the decade for tech.   But I started buying my first shares of aapl around 2007 when iPhone was launched.   I've sold some over the years, but still hold most of them for something like 4000% gain, googl was like 1000% gain.   \n\nThe strategy was still the same.  Don't try and pick a winner, but rather pick the top contenders.", "score": 2, "replies": []}]}]}, {"body": "AI is going to disrupt the search market. And we dont know the extend and user acceptance yet.\n\nMoat for tech is different to other industries. It can seem unbeatable and then suddenly be replaced. A lot of people meming about Bing and other search engine have come to admit that they are actually decent.\n\nFor now AI are too unreliable to rely on for online researches. But having tried it, it is already really useful in many cases and quicker than search engines.", "score": 10, "replies": [{"body": "But like, people aren't always searching for information. Chatgpt is chat bot.  Most search is done to go to websites, see videos, pictures of products, play videogames or whatever. AI can't replace that (at least any time soon).\n\nAlso, nor many people use chatbpts as you may expect. We are young and interested in tech, many are not", "score": 3, "replies": [{"body": "AI are giving the sources they used. And you can directly ask for websites too.\n\nIts way easier for elderlies to ask for a website then search for a website and having a bunch of text to filter. Elderlies dont have best vision and are confused by lots of text on display.\n\nAn AI would simply post the most appropriate link. Like Googles \"lucky button\"\n\nAsking for the official Trailer or other things are easily handled by AI.", "score": 1, "replies": []}]}, {"body": "I don't think AI is going to grab a foothold on search...  Plenty of business facing operations yes, but I just don't think you need a brain and added computation time for 99.9% of the searches people are making.", "score": 6, "replies": [{"body": "At work I've stopped googling Excel questions, I just ask our licensed version of ChatGPT how to do it. Traditional Google search may very well go away.", "score": 0, "replies": []}, {"body": "I disagree, it depends on the subject you're searching for. \n\nFor a lot of computer tech support issues for example I find Bing Chat to often be better than any search engine at helping me identify a solution. Sure AI chatbots don't reply instantly to your questions, but it takes me time to click on the links and read through them to determine if the answers are even relevant or not (and they often aren't).\n\nOvertime I think they're only going to get better and become a better replacement for Search in more cases where you aren't just trying to find the link to a site you already know exists.", "score": 1, "replies": []}]}, {"body": "> A lot of people meming about Bing and other search engine have come to admit that they are actually decent.\n\nIt is not nearly as good as Google lol", "score": 5, "replies": [{"body": "I’ve tried giving it a shot so many times because it has so many neat features but every time I just realise how much better Google is", "score": 7, "replies": []}, {"body": "Once they ask for money, they stop caring and just use what is good enough. Google cant ask for money from users", "score": 1, "replies": []}]}]}, {"body": "I feel like Bing can easily overtake Google if they make a few tweaks to their search engine. They have already indexed the entire web too, like Google, all they need is some smart engineers to make their algorithm better.\n\nImagine Bing pays some $$$ to a few Google Search engineers and hires them (non-competes are illegal in USA as far as I can tell).\n\nNot saying this is happening now, but better lots of money on GOOG and praying that it won't might be risky.", "score": 1, "replies": [{"body": "Bing has been trying for almost 15 years now. It's not going to happen I think. Even with the ChatGPT hype, they didn't manage to make a dent. At this point, they either need to pay Apple a massive sum of money to become the default search engine there, or Apple needs to create their own search engine. I feel that is the only way to have a real Google competitor.\n\nOr governments need to come in and say: this is a monopoly, it is impacting the worlds access to information and you are pushing your own products there in an anticompetitive way, so we are going to force you break up [Google.com](https://Google.com) the domain and Google Search the tech behind it in 2 companies, where [Google.com](https://Google.com) needs to pay Google Search for use and other companies can also license it.", "score": 6, "replies": []}]}, {"body": "I disagree with your assessment.\n\nGoogle Search has the problem that it's so big that it basically can't grow unless the market itself grows. And IMO the search market is going to shrink overtime as AI Chatbots like Bard, Bing Chat, and ChatGPT slowly take over. \n\nAnd the worst part for Google is that chatbots are likely to be far less profitable, unless you can get people to buy a subscription. They require more then 60 times the CPU power per query than a Google Search. And unlike searches you can't really stuff ads into chatbots without ruining the product (and causing people to go to another chatbot for their queries).", "score": 1, "replies": []}]}, {"body": "I keep seeing comments about how investing in Google, Apple or Microsoft in the long term is like investing in GE or IBM 30 years ago, as if we've seen this all before. The mega-cap companies of the 1900s were each the first to dominate their industries and faded as those industries matured. There will never be another GM because the car industry is mature. There will never be another AT&T because phone industry is mature. IBM (despite being a software/services company now) was a leader in the now ancient industry of office machinery.  \n\nWhat are Google, Apple and Microsoft?   What industry are we watching mature? They control how my lights turn on. I watch soccer on Apple hardware using an Apple service. When I want to know just about anything, I ask Google. If I want it explained, I ask GPTChat. Do people really think the information age has peaked? really?", "score": 36, "replies": [{"body": "Google, AAPL, and MSFT have diverse revenue streams, theyre more like holding companies (compare the size and rate of acquisitions).", "score": 17, "replies": [{"body": "Strongly disagree with you on Google and Apple.\n\n60% of Google's profits come from Google Search ads, and a significant portion of the remaining 40% come from other ads. That's not diversified at all. If the ad market tanks then Google will tank.\n\nThe vast majority of Apple's revenue meanwhile depends on selling people iPhones and getting them to use it/buy services for it. If Apple's iPhone market share ever collapses (similar to Nokia) then Apple is basically finished as a company. They might not go bankrupt, but they wouldn't be worth anything close to what they are today.\n\nMicrosoft is the only big tech stock that's not very heavily dependent on just one product for the vast majority of their revenue.", "score": 2, "replies": []}]}, {"body": "I don't think the auto age has peaked (we are entering an exciting new era in fact) but GM has not capitalized on that the same way that Tesla has.  In fact, you give an example of the problem—how is ChatGPT the leader in the LLM space when Google, Apple, and Microsoft have so much money to throw around?", "score": 4, "replies": [{"body": "I’m a huge fan of Tesla, but still disagree about the auto industry. I like Tesla because they’re disrupting that industry - a minor reset that will put them in charge of an (eventually) low margin industry. But they’re also doing interesting things in computing, robotics, solar, battery, etc. \n\nI think small companies doing big things like chatgpt will ultimately be bought or permanently partnered with the giants. The ecosystem just matters more than a single small product.", "score": 6, "replies": []}, {"body": "Well one of the reasons ChatGPT is the leader in LLM is the money (and infrastructure use) that Microsoft has been throwing at it.\n\nThat said you also have to give credit to their excellent leaders and developers for making the first breakthrough LLM that earned all the investment.", "score": 1, "replies": []}]}]}, {"body": "Don't forget WAYMO. Already doing well in San Fran, Phoenix and soon to be Austin & LA. Sleeping giant with a partnership with Uber already.", "score": 23, "replies": [{"body": "Which will save a ton of lives\n\nhttps://youtu.be/yLFjGqwNQEw?t=1273", "score": 0, "replies": []}]}, {"body": "Your bias is indeed clouding your judgment. Your thesis is completely valid BUT it applies to a company that is more of a mid-level startup. Google is NOT a mid-level startup - it is a very mature established stable company.\n\nAll the stuff you mentioned is pure speculation and hypothetical. For a company like Google, if they actually wanted to do half the things you've posted, they would have already done it. So exactly WHY should we think that Google will start doing these things now?\n\nBecause they're slowing down? They've run out of different ways to milk their cash cow? They see new emerging threats like ChatGPT?? If that's the case, then that's actually a negative for Google because they've been very comfortable in their monopoly position with zero competition.\n\nThey already charge for various things and have already moved beyond the free model they started with. Heck, I pay a lot of money to Google for youtube premium. But the uncomfortable truth is that they only make a tiny fraction of the money they make from AdWords. Even their cloud business has been only a middling partial success.", "score": 3, "replies": []}, {"body": "Will be 5 trillion in 3 years", "score": 42, "replies": [{"body": "That's a full on 45% rise every year for the next 3 years. That sounds insane to me honestly", "score": 68, "replies": [{"body": "Or a 50% crash two years in a row, followed by a 600% gain.", "score": 57, "replies": []}, {"body": "Apple is 243% in last 5 years almost 3 trillion.", "score": 9, "replies": []}]}, {"body": "Ha", "score": 5, "replies": []}, {"body": "Maybe in 5 years yes but definitely not in 3 years", "score": 3, "replies": []}]}, {"body": "Google is leading the ai charge. I believe it's miles ahead of anything else (yes even chat gpt) google deep mind is amazing!", "score": 34, "replies": [{"body": "Google deep mind is a different thing conceptually", "score": 15, "replies": [{"body": "Different from?", "score": 1, "replies": [{"body": "Chatgpt and other llms", "score": 6, "replies": [{"body": "Oh yes, i didn't mean to compare the two in that sense.", "score": 1, "replies": []}]}]}]}, {"body": "How do u know this stuff? I for example have even started to distance myself from google toward chatgpt actually. It just sometimes gives me irrelevant search results which chatgpt doesn't.", "score": 3, "replies": [{"body": "I read a lot of scientific papers on ai. Chat gpt is a nice products and it's blowing away consumers with it's abilities. But google deep mind is what will eventually replace doctors, engineers, project managers, drivers, etc etc etc.\n\nIt's one of those things where for consumers, chat gpt opens a world of abilities. But google deep mind is what impresses professionals in their field. \n\nDeep mind beat humans at go, deep mind is diagnosing cancer, deep mind is discovering new medicine. Deep mind can learn from instruction videos, deep mind can program industrial robots. Deep mind can navigate cities without a map. Deep analyses how proteins fold, and deep mind discovered a solution for a mathmatical problem we had no solution for yet.", "score": 21, "replies": [{"body": "If it could help make doctors less cocky…", "score": 8, "replies": [{"body": "itll probably eventually even replace  doctors.", "score": -2, "replies": [{"body": "LOL maybe in 100 years. In any reasonable timeframe, the best it will do is help doctors, which is great.", "score": 2, "replies": [{"body": "Doesn't matter IF the doctors will rely on google-provided AI, and pay pretty money to Google to use it.\n\nYes, you will still have your human doctor, but if a lot of his cashflow will be going to google, that will be the most important piece regarding shareholder value. No one will care who's the cashing frontdesk.", "score": 2, "replies": []}, {"body": "I'll say 20 years. Maybe 30.", "score": 1, "replies": []}]}]}]}, {"body": "IBM watsons had this a decade and longer ago. They used it to help analyse patients and see patterns humans might miss. Its nothing new but Google might have more data and capital to bring it to a new level.", "score": 5, "replies": [{"body": "Watson Health was a financial and technical failure though.", "score": 2, "replies": [{"body": "Indeed! And google has it up and running in hospitals already!", "score": 2, "replies": []}, {"body": "The people that got the help and survived might not care about the financials. IBM notoriously sucks at knowing how to profit from its inventions. IBM researches and every direction and has the tech to do all sorts of things even other big tech cannot. But oftentimes with no way to make it profitable", "score": 1, "replies": []}]}]}, {"body": "That’s interesting stuff thanks for sharing", "score": 3, "replies": []}, {"body": "With any luck it will be illegal. That's an existential threat.", "score": 2, "replies": [{"body": "It will transform our society", "score": 2, "replies": []}]}]}]}, {"body": "They are no leading anything. They are being dragged tied to the back of a truck.", "score": 1, "replies": []}, {"body": "Google is not in the lead. Google states they are not in the lead and they basically had to start from scratch after Meta released LLaMA. \n\n“The uncomfortable truth is, we aren’t positioned to win this arms race and neither is OpenAI. While we’ve been squabbling, a third faction has been quietly eating our lunch,” a Google engineer wrote.\n\nI'm not counting Google out this early, but Meta is clearly in the lead and Microsoft has incorporated LLaMA nto Azure.", "score": -7, "replies": [{"body": "youre comparing transformers... deep mind is not a transformer. and the real progress in ai wont come from transformers.", "score": 5, "replies": [{"body": "> The uncomfortable truth is, we aren’t positioned to win this arms race and neither is OpenAI. While we’ve been squabbling, a third faction has been quietly eating our lunch\n\nThat quote is from a Google engineer. Google has just had their asses handed to them in AI. They went from quadrupling revenue from DeepMind, to flat...to 'oh we aren't talking about DeepMind revenues.\" \n\nChatGPT has killed Google's Sparrow and Bard. LLaMA-65B has killed DeepMind’s Chinchilla70B and Google’s PaLM 540B. It outperforms and it's half the price. Google is essentially starting the race over from scratch.", "score": -4, "replies": [{"body": "\"a\" Google engineer doesn't have much credibility. There tens of thousands of them. How likely is it that this one has deep knowledge of everything Google does in the AI space? It might be a random webdev that has no more knowledge than the average redditor.", "score": 1, "replies": []}, {"body": "You're comparing transformers (bard and chat gpt are transformers). I'm not talking about transformers. Transformers are a fun toy compared to what google deep mind can do.", "score": 1, "replies": []}]}, {"body": "But what is deep mind? Why is it gonna be a game changer? Do you have any proof?", "score": 1, "replies": [{"body": "Well deepmind did solve protein folding. \n\n[https://www.newscientist.com/article/2330866-deepminds-protein-folding-ai-cracks-biologys-biggest-problem/](https://www.nature.com/articles/d41586-020-03348-4)\n\nThe thing is, DeepMind isn't an LLM. AI is kind of a vague term, but a lot of people think Google has been caught off guard with the LLM's, which they have. However, they do have great AI, just different use cases.", "score": 4, "replies": [{"body": "Okay well I'm not paying to access that but do they just say \"trust us we solved protein folding and definitely didn't fudge the numbers\"? Data science papers are fraught with a lot of bullshit, especially ones with a commercial agenda.", "score": 1, "replies": [{"body": "i literally used their alphafold software on ncbi for a class to look up protein structures associated with human taster genes. They made it free for researchers and anyone else interested. its not \"trust us\" if its already being used in scientific applications and research used to make vaccines. It has become developed over the years that now it has a high probability of the simulated structure being what the proteins actually look like in real life.", "score": 5, "replies": [{"body": "I misunderstood, it sounded like deep mind was some generalizable ai. Who cares if they solved a protein folding problem, google isn't a medtech company. Investors want generalizable ai.", "score": 1, "replies": [{"body": "Google is a Meditech company. They have deep mind up and running in hospitals already...", "score": 1, "replies": [{"body": "What is deep mind? Is it different than alphafold?", "score": 1, "replies": [{"body": "Deep mind is the organisation and engine. Alphafold is that engine specifically adapted to protein folding. Alphago is also deep mind, specifically adapted to the game go.", "score": 2, "replies": []}]}]}]}, {"body": "Ye, this thread is obviously exploding with people who think they know what ai is or does because they've seen chat gpt.", "score": 1, "replies": []}]}, {"body": "https://en.m.wikipedia.org/wiki/AlphaFold\n\n> AlphaFold 2 scoring more than 90 in CASP's global distance test (GDT) is considered a significant achievement in computational biology[5] and great progress towards a decades-old grand challenge of biology.[7] Nobel Prize winner and structural biologist Venki Ramakrishnan called the result \"a stunning advance on the protein folding problem\",[5] adding that \"It has occurred decades before many people in the field would have predicted. It will be exciting to see the many ways in which it will fundamentally change biological research.\"[15]\n\nThis isn’t like a bullshit paper, they solved an actual problem. Again, deep mind is just a different type of AI.", "score": 4, "replies": [{"body": "Wait wtf are we even talking about here. Who cares if they built an AI that predict protein structures. Investors want generalizable ai.\n\nDeep mind isn't an AI model... It's a Google team that solved a fairly constrained science problem.", "score": -3, "replies": [{"body": "It has different use case. \n\nhttps://www.forbes.com/sites/robtoews/2021/10/03/alphafold-is-the-most-important-achievement-in-ai-ever/?sh=347b6b6e6e0a\n\nDeepmind isn’t for LLMs. Not sure what else to tell you. I’ve offered multiple links with why it’s important lol. Best of of luck man.", "score": 4, "replies": []}]}]}, {"body": "They broadcasted the event where it beats the world champion at go. The game of go is much more complex than chess. Go has 250^150 (10^360) possible moves. Where chess only has 10^123 possible moves. It's a game we didn't think computers would be able to master for atleast 20 more years.", "score": 1, "replies": []}]}, {"body": "Google invented the LLM they just never turned it into a useful product. Chat gpt is getting a lot of press mostly because it opened up to consumers and they're being blown away by what chat gpt can do. \n\nBut anyone on the ai field had already seen these abilities 1000x over.", "score": 1, "replies": []}]}]}, {"body": "I could google I guess (lol) but is a transformer just a ml that turns content into different content? Where as deep mind actually constructs new concepts from old content?", "score": 1, "replies": [{"body": "Transformers are a type of artificial neural network originally conceived by google engineers in their famous paper “All you need is Attention”. https://arxiv.org/abs/1706.03762", "score": 3, "replies": []}, {"body": "Indeed, chat gpt, bard, meta's llama2 they're all transformers. Transformers are basically just big neural networks that reorder words based on statistics. they're getting a lot of press nowadays. But they have enherent problems, they hallucinate, lie and constantly say \"I'm sorry i can't do that, Dave\". They're fun, but that's about it, i don't think they're the future. They're a fun toy to assist us in writing texts. \n\nLook at the list of achievements google deep mind has and be amazed:\n- it aced a Japanese university entry exam, surpassing 90% of human applicants.\n- it beat the world champion at go (you should check out the segment)\n- it has discovered new forms of cancer\n- it can learn from looking at videos, and then reproduce tasks.", "score": 1, "replies": []}]}]}, {"body": "I think it's a longer game than the 8 months we've seen so far.  These companies have immense resources to play with, but to be fair that can be a double-edged sword (see META).", "score": 1, "replies": []}]}, {"body": "AI is absolute garbage. Stupid trendy word.", "score": -6, "replies": [{"body": "Naive... Another trendy word!", "score": 0, "replies": [{"body": "AI has been around since the 2000s. There’s nothing new here.", "score": 0, "replies": [{"body": "Ai has been around since the 1980ies actually. The only \"new\" thing is that processing power, datasets have reached a point and scale where ai is actually becoming useful. The models used have also changed...", "score": 0, "replies": [{"body": "🥱", "score": 0, "replies": [{"body": "Why do you bother responding to a thread if you're woefully uninformed and to lazy to actually do research?", "score": 1, "replies": [{"body": "That’s your assumption. 😂", "score": 0, "replies": [{"body": "Your comments speak for themselves.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Bard has nothing on ChatGPT4", "score": 1, "replies": [{"body": "i agree. But transformers aren't the future anyhow...", "score": 1, "replies": []}]}, {"body": "> Google is leading the ai charge. I believe it's miles ahead of anything else (yes even chat gpt) google deep mind is amazing!\n\n\nYesterday Paul Graham, one of the most well-connected figures in Silicon Valley, tweeted that he has multiple bits of evidence that google's AI projects \"are not going well\" and maybe more concerning was his comment about \"the number of programmers that are trying to leave.\" A lot of google's top AI talent has left in the last few months.", "score": 1, "replies": [{"body": "Right, heresay...", "score": 1, "replies": [{"body": "I am a bit skeptical. He did get pushback in a tweet from a prominent deep mind engineer.", "score": 1, "replies": []}]}]}]}, {"body": "Google definitely has an amazing amount of growth potential with AI in their Google search coming soon, their cloud business, as well as with the impressive growth and pricing power of YouTube TV - just to name a few growth catalysts of Google/Alphabet.\n\nThat being said, the greatest RISK of Google/Alphabet’s growth is the potential government regulatory issues.  Don’t be surprised to see the government start up an antitrust litigation battle with Google, and try to break it up…..although if this did happen, it would potentially be a good thing, as, from a historical perspective, the sum of the parts always seems to be worth more than the whole…", "score": 9, "replies": [{"body": "Confession/Disclaimer: I like Alphabet/Google so much as an investment that I own and continue to buy the 1.5x leveraged ETF GGLL, and it has been very good to me so far….", "score": 2, "replies": [{"body": ">GGLL\n\nSo that's better than owning GOOGL?", "score": 2, "replies": [{"body": "I obviously cannot speak or decide for you my friend, but I personally am comfortable with the risk/reward profile of GGLL.  It maybe something you may want to learn more about…", "score": 2, "replies": [{"body": "I do indeed, which is why I asked. I like the low barrier of entry and I'm a Google user, so LFG.", "score": 3, "replies": []}, {"body": "Man, now I see they have the same for Apple, Amazon, Tesla... I'm wondering if I shouldn't just buy these instead of the actual company if I'm bullish on all four (including Google)...", "score": 2, "replies": [{"body": "Here was my original post thread regarding this exact same topic.  A lot of folks in the Reddit peanut gallery poo-poo’d this investment strategy.  Glad I didn’t let the critics and naysayers sway me…\n\nhttps://www.reddit.com/r/LETFs/comments/zn47cf/thoughts_on_this_aggressive_letf_portfolio/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1", "score": 3, "replies": [{"body": "I left crypto to get into stocks again and my two \"wait until the BTC halving in April 2024\" stocks are LTCN and BCHG.\n\nThat said, I think I'm gonna sell the AAPL I just bought and spread out the money across AAPU, GGLL, TSLL and AMZU for a starter position in each. Then DCA for the next few years. I can handle a little risk for a great potential reward.", "score": 1, "replies": [{"body": "NVDL has been amazing as well….but what may be an easier way to “play the field” is going with FNGO or FNGG….", "score": 1, "replies": [{"body": "I just saw Direxion Daily Travel & Vacation Bull 2X Shares (OOTO)...\n\nThat looks promising.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Something tells me the company that knows everything about everyone and what they want to buy will continue to grow", "score": 3, "replies": []}, {"body": "Google has had the most underwhelming growth among the big tech companies in the last decade. I would bet on that trend continuing.", "score": 10, "replies": [{"body": "> Google has had the most underwhelming growth \n\nWhat company has had the growth of Google over the last decade?\n\n2012 - $46 billion\n\n2022 - $282 billion.\n\nUnderwhelming growth?  What are you smoking?\n\nhttps://www.macrotrends.net/stocks/charts/GOOG/alphabet/revenue", "score": -4, "replies": [{"body": "Maybe you haven’t heard of these companies, but Apple, Microsoft, Amazon they’re all up 10x at the minimum in the last decade. Google is up 6.5x.", "score": 8, "replies": [{"body": "Has Apple, Microsoft or Amazon have the growth that Google has in the last decade?", "score": -15, "replies": [{"body": "Bro he JUST answered your question. What are you struggling with here?", "score": 11, "replies": []}, {"body": "I want what YOU are smoking. Until google stops pouring money into moonshots, and then canceling them, I’ll be counting my bills with my MSFT stock (which has paid a growing dividend!!).", "score": 2, "replies": [{"body": "Google revenue in the last ten years has from from $46 billion to $282 billion.  Microsoft the last ten years has gone from $70 billion to $168 billon.\n\nSo Google grown has exceeded Microsoft.\n\nI am long both but clearly Google has had the better growth and would expect that to continue.\n\nI own Microsoft for Azure   Microsoft has completely missed mobile.  They spent billions but failed to be able to compete against Google and Apple.\n\nhttps://www.macrotrends.net/stocks/charts/MSFT/microsoft/revenue\n\nPlus Google has taken a number of things away from Microsoft and not aware of anything Microsoft has taken from Google?  Do you?\n\nSome examples.  Microsoft had over 90% of browsers before Google got into the market.  Today Microsoft has given up and just using Google for their browser and they have 5% share.\n\nMicrosoft actually had a large chunk of Search before Google launched.  Now has less than 3% and Google has over 90%.\n\nK12 in the US was dominated by Microsoft and Apple before Google.  Now Google has 90% share of K12.\n\nMicrosoft did have a chunk of mobile.  That was before Google and Apple hit the scene and now they have 0.  Even after they spent billions trying.", "score": 1, "replies": [{"body": "MSFTs dividend has allowed me to DRIP 100 additional shares so far and kickstart compound growth. Why doesn’t google pay a dividend? Comes down to that for me. Throw me a bone google! Even if it’s minuscule like Apple or nvidia.", "score": 1, "replies": [{"body": "Dividends are nice but I much prefer buybacks.  They are far more tax efficient.\n\nPlus you get to then time the tax event which you can't do with dividends.  Which really, really sucks.\n\nI wish if you decided to have dividend buy shares and instead of a cash payout would not cause a taxable event.   That would really help a lot but even then you can't time the buy.\n\n\"If you reinvest your dividends, you still pay taxes as though you received the cash. \"\n\nhttps://www.investopedia.com/ask/answers/011215/if-i-reinvest-my-dividends-are-they-still-taxable.asp\n\nThe difference in tax rate is significant.  Never could figure out people that wanted a dividend instead of buybacks.  That makes zero sense.\n\nCan you explain?", "score": 1, "replies": [{"body": "That’s very true. I guess I’m in it for dividend income later in life. To each their own. You make a great argument, I’m curious to see how it all plays out!\n\nEdit: you edited your comment after I replied m8! Loser.", "score": 1, "replies": [{"body": "I am retired and have been for well over a decade.   If a company buys back or offers a dividend is no difference except you will pay a far lower tax rate from buybacks.\n\nBut what is more important is that you can then time the taxable event which you can't do with dividends.  This can save you a ton of money.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "As long as you beat the returns of the S&P 500, it doesn't matter if you're up 10x or 6.5x and google has done just that since January 1st 2013", "score": 1, "replies": [{"body": "It’s only moot if you’re an asset manager against a benchmark like the S&P. Returns are returns.", "score": 1, "replies": []}]}]}]}]}, {"body": "I am wondering the same. I think about opening a position and buy some stocks. I can imagine that Google still has a lot of upside left.", "score": 2, "replies": [{"body": "Then just buy AIQ", "score": 1, "replies": []}]}, {"body": "I wish they would pay a dividend!!!", "score": 2, "replies": []}, {"body": "Google is an amazing company and could absolutely grow in the future, they have many avenues as you stated. \n\nHowever there are a couple major risks. \n\n1. Generative AI: Google is an ads business, people search a term and click an ad to get their information. If generative AI becomes a real option consumers desire they need to pivot their massive ads model. Think about cable, cash cow, people change their preferences .. so long cash cow. \n\n2. They have grown soo big that the quality of their core product is compromised. Google search is almost all ads now. They can’t really go backwards because they need to grow, at what point does the product hit a point where it is not longer usable? \n\nRemember all the other businesses aside .. google is a definitively a search company .. it’s where almost all the profit comes from. \n\nThere are a ton of ways to grow, but there are risks.", "score": 2, "replies": []}, {"body": "I think Google will see $100 before $150.", "score": 6, "replies": [{"body": "Then so will the rest of the market", "score": 5, "replies": [{"body": "I think PayPal will make a big comeback in the future, Mr. Market disagrees.", "score": 2, "replies": [{"body": "PayPal has a 50/50 chance of even making profit in 2030. \n\nGoogle has a 99% chance. \n\nHence different valuations", "score": 1, "replies": [{"body": "Why will paypal stop making money? Genuine question", "score": 1, "replies": [{"body": "Competition. & No real moat", "score": 1, "replies": []}, {"body": "Because he doesn't know what he is talking about", "score": 1, "replies": []}]}]}]}]}, {"body": "I believe so, too. Already purchased $90 calls for 2/24", "score": 1, "replies": [{"body": "Yikes. Didn't age well.", "score": 1, "replies": []}]}]}, {"body": "Passed a google street view car yesterday, haven’t seen one in years.", "score": 3, "replies": []}, {"body": "How will Gen AI help with search? Search doesn't rely on creating content", "score": 2, "replies": [{"body": "But SEO is going to have fun generating orders of magnitude more crap for Google to index.", "score": 2, "replies": []}, {"body": "It’s not that gen AI will help you search, it is that it will replace the need for some searches and thus decrease demand for traditional search products. I’ve definitely started going to ChatGPT pretty quickly for certain technical questions and find it is normally quicker than browsing through stackoverflow posts. That’s an example of how gen AI will replace or complement traditional search.", "score": 1, "replies": []}]}, {"body": "No… The stock price has already factored in all the things you mentioned", "score": 4, "replies": []}, {"body": "Since most of the general responses have been positive, I'm going to be contrarian for the sake of it. \n\nGoogle is too big. \n\nThey're running in too many directions. Spent a LOT of money for TV streaming rights at a time when people are generally going away from linear TV.\n\nSpent a LOT for NFL Sunday Ticket.   \n\nMaybe it'll lead to more revenue? \n\nTheir antidote to losing market share for YouTube Music was to combine it with YouTube Premium, and double the price, adding more complexity.\n\nLook at Shorts - or rather, try NOT to look at Shorts.  They're being shoved in my face. \n\nThis isn't the well cared for user experience of Web 2.0.\n\nThis is big behemoth, minimal feature enhancement, squeeze for profit and gobble competitors until???", "score": 3, "replies": []}, {"body": "Absolutely. They are one of a few companies with a quantum-computer, that quantum-physics use. Now combine AI, quantum- computers, and quantum physics.", "score": 2, "replies": []}, {"body": "Google has been on top for years and they continue to grow. They have no real competition in their core business yet they're driven to stay on top and grow through innovation and domination.\n\nI don't see them charging for Google Docs. Microsoft Office is the defacto solution for businesses & many consumers. \n\nIMO, Unless they fail to execute internally or do something epically stupid, they won't  go down until a company comes along having build a better wheel.", "score": 2, "replies": []}, {"body": "Most definitely.   I think Google has barely even got started.  So many different things.  But the one I am most excited about for Alphabet is.\n\nhttps://www.youtube.com/watch?v=avdpprICvNI\n\nThis is why.   Here Waymo saved a very serious accident if not saved a life.   Human would have crashed as the car was obscured because humans only have their eyes.  Where the Waymo has so many other sensors and was able to \"sense\" the danger and save the very serious accident.\n\nhttps://youtu.be/yLFjGqwNQEw?t=1273", "score": 1, "replies": []}, {"body": "No. Google is at its top. \nFrom here it’s nothing but down. \n\nBefore google was a large friendly company. \n\nNow they sell devices that aren’t advertised to have a monthly fee that is required to work. They’re breaking laws left right and centre out of sheer incompetence, and they’re alienating their base of users.\n\nGoogle is as large of a break-up target as Amazon is. This company will be split in two, or four.", "score": 1, "replies": [{"body": "What a load of BS.", "score": 3, "replies": []}]}, {"body": "I see Google becoming another Yahoo. Incompetent leadership plus years of lowering the quality of their teams with offshore workers. This company lost its soul and its edge.", "score": 1, "replies": []}, {"body": "RemindMe!", "score": 0, "replies": []}, {"body": "How is YouTube potential when it's been completely replaced with tictok and Instagram videos...\n\nThose are instant videos which are getting longer with every new upgrade\n\nYouTube is 30+ second adverts. I'll actually leave YouTube if I get a 30 second advert.\n\nThe AI integration is too little too late. Think of AI like crypto currency. There are millions of different ones but the original is still the most valuable. I actually know people that use chatgpt over Google organically. They are not computer nerds they find it easier to use it instead of fishing through Google search results\n\nThey have free office tools but no professional business is picking anything other than Microsoft", "score": 0, "replies": [{"body": "YouTube shorts is an excellent product, and it pays content creators much more than TikTok. Shorts is also blowing up in popularity with plenty of fresh new content.\nSome twitch streamers are even moving to YouTube because they pay better.\n\nAlso, how many people really use ChatGPT over Google search? Google has more than 90% of the Search engine market share. I just don't see people making the switch, and if anything, Google can integrate AI into its own search engine, and people would use a trusted product they are familiar with, boosted by AI.\n\nI agree Microsoft Office is the standard, but I must say, I remember having great experiences using Google docs for school group projects. Being able to have multiple people type simultaneously was something I had never experienced before, and it was super useful. I think Google Docs has room to grow more.\n\nTheir major downside is relying so much on ad-revenue, but that revenue will never stop as long as people keep using Google search, which they will. Their products are really excellent. \nAndroid is a great OS and Google Play has a massive selection of apps. I think it's better than iOS with the App Store. \nChrome is by far the most trusted and popular browser. No one will use Bing or Edge (except once to install Chrome), and Windows Phone-we all know how that went. (I don't see Google getting anywhere with PCs beyond Chromebooks anytime soon though)\nAnd YouTube is such a great service, it is honestly too good to be free. And it's thriving with new content. It's completely irreplaceable.\n\nSo which of the major tech companies will dominate the AI market? It *could* actually be Google, but it is still relatively unclear. I'm going to buy Microsoft shares soon if it dips. However, no matter what, Google will never die, and I think its stock price will at worst stay the same.", "score": 2, "replies": []}]}, {"body": "I do! 🙋🏼‍♂️", "score": -1, "replies": []}, {"body": "im pretty much all in on google rn, no reason to hold anything else besides risk management", "score": -1, "replies": []}, {"body": "Feel like things get divisive with google market shares. Many years ago we always relied on google now we have Chatgpt. To be honest I ask chapgpt before I google the stuff. \n\nWhy ? Google have too many fake news. I rather trust chatgpt for my answer..", "score": -4, "replies": [{"body": "You are unusual.   The biggest reason you will not see ChatGPT take share from Google search is because of speed.\n\nIt is just way too slow.   Google has over 92% share of search and that it rock solid.   But also really important is Google has over 95% on mobile.\n\nhttps://gs.statcounter.com/search-engine-market-share/mobile/worldwide\n\nAfter Google the next highest is Yandex with 1%.   Then Baidu with 1%.   Then Yahoo with 1/2%.   \n\nGoogle has basically zero competition and hard to imagine that is going to change.   I am posting this from Bangkok.  Here Google owns the city.   Every taxi, Grab, food delivery, etc all run on Google Maps.   \n\nWhat separates Google from the competition is their reach.  It is unmatched.    They now have 16 different service with over half a billion DAU.   They have nine with over a billion.  They have the most popular web site ever but then the second most popular ever.  The most popular operating system with Android.  The most popular navigation with Maps.  The most popular browser with Chome.  So many other things.", "score": 5, "replies": []}, {"body": "That is you though, most of the people I ask are scared to use chatGPT or used it once and never again.", "score": 1, "replies": []}]}, {"body": "I still believe they have growth. That or they will start paying a divi. Either way I'm cool with holding it.", "score": 1, "replies": []}, {"body": "I don't think Google has many double digit growth years left but I could see 7-10% growth over the next decade.", "score": 1, "replies": []}, {"body": "I said the same about apple in 2011. Big mistake. Also any company that reaches that size got there by growing much faster than the market for a long period of time. Who’s to say they’ll stop now? Just my two cents", "score": 1, "replies": []}, {"body": "Hmmm… it does but that ceo has made google a scammy ad ridden seo nightmare where absolutely every search result is a product or service. \n\nThen came chatgpt and oh boy did that ceo freaked out.  \n\nI think we will start seeing a slow decline of google search once more apps and ai search gets better. I also don’t think bling is good btw. \n\nTo me google does everything sort of half ass and only have their two main revenue sources be about the same as it was when he came in. He has failed in so many biz ventures.\n\nI do think there’s potential with google just not w that ceo.", "score": 1, "replies": []}, {"body": "I definitely think Google has a lot of room for growth. I think Google will come out on top of the AI race. Microsoft has initial advantage because of their partnership with open ai. But Google has every means to far exceed open AI, and Bard is already a better tool, just less exposure at the time. The question is how to monetize B2C AI interactions.", "score": 1, "replies": []}, {"body": "The future isn't here yet. I'd say yes.", "score": 1, "replies": []}, {"body": "It’s not going away. Just DCA into it. Definitely a staple in my IRA", "score": 1, "replies": []}, {"body": "They are one of the few large tech companies with good developers.  Their neckbeard ratio is extremely high, neckbeards using VIM and a tiling window manager to code, so yes.\n\nIf you had a football team composed of 8 feet tall human gorillas I'd say your shots of doing well are pretty high as well.", "score": 1, "replies": []}, {"body": "If you care about nominal price, none of this matters when everything is overvalued.", "score": 1, "replies": []}, {"body": "Nah homie", "score": 1, "replies": []}, {"body": "Personally think the UI and AI is leaps ahead of apple on the new pixel series phones\n\nI think you will begin to see google take a huge chunk out of the phone market sooner than most would think, I honestly would hate if I was forced back to a galaxy or apple phone", "score": 1, "replies": []}, {"body": "Yes, Google is one of my biggest holdings and my only current big tech holding: Amazing data in a world where it's necessary for AI, 2 most trafficked sites on the internet, control the biggest browser and largest cell phone OS, great growth in cloud, and some promising longshot bets which actually leverage their strengths. Everyone is worried that AI is going to disrupt search, but I think it's going to complement it. I still think Google has one of the best moats in history. I also think they still have some of the best talent in the industry even if the company has become a bit bloated. Finally, it's trading at an extremely reasonable valuation compared to the rest of tech.", "score": 1, "replies": []}, {"body": "Google has done pilots of shopping on YouTube. They didn’t do very well. Shopping is a crazy low margin business. There are companies that focused entirely on influencer based shopping and they went tits up pretty hard.\n\nGenerative AI has less opportunities for ads.\n\nIt’s an uncertain future.\n\nWhat Google does have is a world class shared infrastructure for their entire company, and a lot of talent.", "score": 1, "replies": []}, {"body": "I worked with many search engines. Some older ones are still used by institutions.  Baidu is actually a better product. It seems to have lost focus on business hope it is not going to be another Yahoo.   Because it has two stocks Goog, and Googl most major index like QQQ, SPX and even Brk.b count both separately. If Google has a bad day market indices actually sees it. Its translation service, headset, Google phone certainly are not doing well. As advice to add?  No. Hold yes. My cost basis is $50s but it is not something that will grow like eV stocks. Very mature industry.", "score": 1, "replies": []}, {"body": "They’ve pretty much failed at everything they’ve tried in the enterprise. Those yellow search boxes they tried to sell ended up straight to eBay. There was a time many years ago when I saw some companies/municipalities dabble in the google business suite but most didn’t like it and went to O365. Microsoft are their lunch.", "score": 1, "replies": []}, {"body": "This thread was certainly timely. San Fran just approved driverless taxi's with no restrictions. GOOG/L stands to reap massive benefits via Waymo.", "score": 1, "replies": []}, {"body": "I disagree with you guys extremely here. I can write paragraphs on this, but will list some quick points here to why I disagree with this. Starting with the first point, YT. Yes, youtube is definitely valuable, but one of the issues with youtube is that a lot of the revenue goes to the creators. So it's not really as profitable as something like search, or meta's social media network where you don't have to pay anyone for anything. The margin is definitely lower, so even if YT grows, it's not going to be as big of an impact when compared to google's search business. Additionally, short form media has definitely taken some share from youtube, even though youtube has been trying to fight back with Shorts. In the past quarter, YT revenue has been declining, but their yt subscriptions has been increasing. I find the idea you brought about users directly buying products from youtube interesting, but I don't agree that is going to set YT apart from competitors. What is stopping tiktok, snapchat, meta, etc. from doing the same thing (they are indeed doing the same thing btw.). So even if YT does the same thing, other platforms will also do that, which does not mean YT will improve relative to competition. Google definitely has some other product potential, like workspace, cloud, but the problem is that they account for a very small pie of the revenue at Google. What I really do want to focus on is search, but I have a problem with search. You mentioned that they will get more revenue from using generative ai search. That is a problem actually, because one of the things with generative ai search is that the infrastructure costs are much greater, since you need extremely fast data-center gpus to enable inference for these large language models. This will certainly make google's costs greater, which will cut at their margins. Not only this, but think about what queries google actually makes money from. They are typically simple queries where people are trying to buy something. Would you really ask a gen ai model if you want to buy something? That would take forever, and you really don't need to read what it has to say. People tend to just want to be taken to the product, and google search is still the best way for that. So I don't think it makes sense for google to use gen ai in their search, and even if they did, I doubt it would make a big monetary impact since most of the queries they make money off of don't need to be through gen ai search. Don't even get me started on how Google will grow search, let me just tell you that things don't look good there either. Right now, Google is making an effort to grow monetization on search by better understanding queries with the intent to buy. They are going from traditional keyword targeting ads (like \"chair\" or \"tshirt\") to intent-based targeting using AI. This is definitely an avenue of growth, but on the whole it is definitely much smaller compared to something like what Meta has to do. Why is the growth smaller? Because people are already telling google what they want to buy. Google already knows and the problem is much easier, but it means that there's less room to improve. In contrast, places like Meta have to predict what you want to buy using AI, so it's a much harder problem for them, but more room for growth.", "score": 1, "replies": []}, {"body": ">there’s nowhere to go but down\n\ni remember also thinking that when google was like 350 per share about 12 years ago. \n\nNo\n\nwhere \n\nto \n\ngo \n\nbut \n\n\ndown\n\n\nA single 350 or so share from then is worth over 5k now.", "score": 1, "replies": []}, {"body": "Significant room to grow. Internet as we know it is really evolving from what it was in the early 2000s. The Internet isn't dead or dying and Google is well positioned to continue to increase market share in emerging markets. As well, there is untapped and untold potential within existing markets. 20yrs after the phone went mainstream those companies that where at the top continued to grow and grow.", "score": 1, "replies": []}, {"body": "Maybe. But they might face breaking up their ad business in the long term due to investigations into it being anticompetitive.\n\nI also still don't see how AI will increase their search revenue which is by far the largest part of their business.\n\nThey can not really charge for things like Google Docs. The reason to use it is because it's free. Otherwise might as well use Office.\n\nAs for YouTube, they were recently caught pretty much misleading advertisers on it and those are not happy. Might have impact there.\n\nBiggest issue their massive reliance on search still. Everything is built around getting people to their search engine. If the US or EU ever demand changes there, or if Apple is ever going to do something in that area themselves, that is a massive threat to Google. Whether that has a realistic change of happening is hard to tell.", "score": 1, "replies": []}, {"body": "Yes, I think so. Think of Cloud services, think of Waymo.", "score": 1, "replies": []}, {"body": "Also Google Cloud", "score": 1, "replies": []}, {"body": "Counterpoint: google’s revenue is still highly dependent on search, and generative AI results are meh.  Combine the (massive) real estate they give it with the real estate they carve out for paid ads, and you’re left with a long scroll to find the higher quality natural results, and just a big mess visually, with everything else they throw in. They won their market share via simplicity.  That’s gone.  It won’t be easy for a competitor to come take share, but for the first time in a long time, the opportunity is there.", "score": 1, "replies": []}, {"body": "Is that not the same with every company?\n\nThe question I have with Google is whether their leadership can realize that growth?\n\nGoogle is known for being very bureaucratic and canceling products that others can make prosper..", "score": 1, "replies": []}, {"body": "FWIW I have switched completely to DuckDuckGo. I feel I get more relevant results with DDG as compared to Google and its ads.", "score": 1, "replies": []}, {"body": "Google is gonna be THE Artifical Intelligence company, and there is definitely a lot of growth left for the long-term.", "score": 1, "replies": []}, {"body": "Nah, not really. They are like the gulf states - purely by luck they hit oil. They keep putting their oil money into other ventures - without much ever coming from it. \n\nCloud services - no. 3\nAd Services - sure they have a lot of data. But it is a hotly contested space. \n\nThe rest? Basically junk or free/ad-based services people will abandon if they are not free anymore.", "score": 1, "replies": []}, {"body": "Yes, the markets and it's reflected in Google's already very strong PE and PS.", "score": 1, "replies": []}, {"body": "It's a good company and makes loads of money.\n\nThey are doing the typical tech strategy of trying to buy the winners.  They no longer seem capable of innovation (natural for a company this size).\n\nShame they missed out on openai, but they do have deepmind.\n\nI can see continued growth (albeit small due to already massive size).", "score": 1, "replies": []}, {"body": "People always say this about big tech but big tech are in a position to join any industry. First it was just the internet and computers, then smartphones, then tablets, then services. Apple runs a tv platform now. They sell watches. Google does internet search, but they also do driverless cars. \n\nGoogle still gets a lot of money from one place, ads and their position as the search engine helps with that. The thing is tomorrow they could say they're going to start making planes. Entirely new market, with new revenue stream. They still have search, but now they have planes as well.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "PE of 27 - many people apparently think it has growth left", "score": 1, "replies": []}, {"body": "I think what you are talking about is the fed printing a bunch of money that ends up driving the nominal price of google stock up.", "score": 1, "replies": []}, {"body": "I think Google the core business has growth left. Google developing other businesses I don't have a ton of faith in - they shut down so many of their projects that I think that's a key reason people didn't buy Stadia - which they eventually shut down (and basically refunded everyone.) I don't particularly like Google management - the Berkshire-ization promised with Alphabet never really happened and would have potentially resulted in some welcome diversification. So things they build in-house are often shut down eventually and they can't buy something significant w/o antitrust issues. So while I think there are growth opportunities with the core business, wish there was different management and would still rather MSFT.", "score": 1, "replies": []}, {"body": "I think online advertising isn't going away and will keep growing for a long time. Also Google cloud has a huge runway and is expected to grow substantially in the next few years. Considering what they are doing with AI it will only strengthen these segments and add to their competitive advantage.", "score": 1, "replies": []}, {"body": "I'm not seeing them doing something disruptive soon", "score": 1, "replies": []}, {"body": "Google is big enough to not fade away\n\nBut growth may come from areas untapped imo", "score": 1, "replies": []}, {"body": "The negative side of Google is that it's purely an advertising company. 80%++ of their revenues come from advertising. 50% from Google search, 10% from YT adds. They started diversifying a bit, cloud, AI, hardware, but they still make 80% of revenue from publicity. \n\nBefore Google there was Altavista which is now gone. If there's a new way, better or just more popular, to search the web, Google will quickly go down. With AI, it's not a farfetched idea that a competitor comes on top with a better, or just more popular search engine. Or maybe the way we navigate the web will totally change and we won't use general search engine as much. Technology changes quickly and that's why it's the most volatile sector.", "score": 1, "replies": []}, {"body": "I think Google has a few more good decades to go. As long they are generating good profits and margins stay intact.", "score": 1, "replies": []}, {"body": "Google has a lot of products, they do have an ecosystem. It''s just not as cohesive as a whole. If they can figure out how to make it all work smoothly and frictionless together they can change the game.\n\nThey have Andriod and as an extension Google Play, YouTube which includes YouTube Music,  their G-Suite which includes Doc, Sheets etc. Google Cloud. Not to mention Waymo. I am probably missing more but that's just the top of my head.", "score": 1, "replies": []}, {"body": "I bougth more GOOGL at 93$ a share last year", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "The entire market does. That's why I invest in all of it.", "score": 1, "replies": []}, {"body": "Gemini is king of AI", "score": 1, "replies": []}, {"body": "the ceo is real shit other than that I am happy with my investment", "score": 1, "replies": []}, {"body": "I believe in Waymos. I think it's gonna take 20 years, but the shit I've seen from them over the past couple years says that industry is gonna be a game changer. They will save millions of lives.", "score": 1, "replies": []}, {"body": "They own youtube. Youtube has the largest video discography in the world. Imagine training LLM's with that data. They are about to change the game, for sure.", "score": 1, "replies": []}, {"body": "People sleeps on YouTube. It’s now undervalued and in the future when user data is extra valuable they are seated on a gold mine.", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Thread - August 10, 2023", "selftext": "Fun chat. No comments constitute financial or investment advice.  ⚡", "id": "15mzqff", "created_utc": 1691635209.0, "score": 35, "upvote_ratio": 0.97, "num_comments": 426, "comments": [{"body": "Linda is an absolute boss. This spaces is very good and should put to rest a lot of advertiser worry. This interviewer is absolutely inflammatory and yet Linda is handling it. Recommend listening to it.\n\nEDIT: \"CocaCola/Visa/Statefarm coming back and revenue growth going well.\"\n\nEDIT 2: \"I've been here for 8 weeks, we're very close to breakeven, we are now hiring. I get to shift from the cost discipline approach to growth.\"\n\nEDIT 3: Very politely eviscerated Threads... Basically said they're dead but X will never take their eye off them.\n\nEDIT 4: \"We'll see if cage match happens, I will say I've had a front row to Musk training and I know Zuck is excited, but what a GREAT marketing opportunity\"\n\n&#x200B;\n\nOkay I GTG but this interviewer is done, dunno if it will continue.", "score": 20, "replies": [{"body": "Thanks for the write up!", "score": 5, "replies": []}, {"body": "CNBS headline says X CEO has autonomy under Elon. I hope thats true. Am doubt", "score": 2, "replies": [{"body": "She was very clear in the power divide. Either she's an extremely talented liar or it's true.", "score": 9, "replies": []}]}, {"body": "I’ve read enough, can we hire her for Tesla CEO 🤣", "score": 2, "replies": []}, {"body": "Brand safety concern not gonna be solved with cto continuing  to troll woke and trans", "score": 2, "replies": [{"body": "This was asked, Linda said Elon isn't exempt from speech not reach, \"lawful & awful\" shadow banning. This does not mean his opinions will be censored. It's a needle that needs threading but opinions on woke aren't so taboo anymore. Also, advertisers are already returning, \"woke go broke\" really having an effect on disney/anheiserbusch/etc. Dylan Mulvaney kek.", "score": 6, "replies": [{"body": "She can try but she won't be able to talk it away. The woke to broke lesson is a lesson on mixing politics with business left or right", "score": 2, "replies": [{"body": "This is a moot point going forward. You can't have Twitter without people discussing politics and certainly can't censor Elon's opinions. Any and all returning brands will have to get over that sooner and later. Money always wins in the end.", "score": 4, "replies": [{"body": "X will indeed have to live with woke troll owner, whatever the consequences", "score": 3, "replies": []}]}, {"body": "The woke master always wins", "score": 2, "replies": []}]}]}]}]}, {"body": "Something that a lot of people forget when talking about the automotive [death spiral](https://www.youtube.com/watch?v=m7odqDJmobo) is that Tesla was in a similar position when they first started. As soon as Tesla went from a niche maker of hand built sports cars to making a 'real' car with the Model S there were concerns about long term reliability and warranties and what would happen if the company went bankrupt.\n\nOf course this \"concern\" was spread by lots of competitors and shorts that were trying to create a lack of confidence in the new competitor with a compelling product. And that kind of attack had worked with pretty much every new car company in the last 100 years, as soon as there's any sign that they might not survive, then some people are hesitant to buy, which lowers sales and hurts their future prospect even more. It's one of the many reasons that breaking in to the auto market is so hard.\n\nBut Tesla did something interesting, they guarenteed the resale value after 3 years. So if you bought a Model S, and after 3 years wanted to sell it, but couldn't get a good price (for example, if everyone was afraid that Tesla was about to go bankrupt at that point), then the company would buy back the car for a fair price. They even made the deal really good, it was originally benchmarked to the S Class resale values, but they then changed it to a [better resale value than any sedan from BMW, Audi, Mercedes, Lexus or Jaguar](https://www.forbes.com/sites/hannahelliott/2013/05/03/elon-musk-ups-resale-value-of-the-tesla-model-s-we-decided-we-were-wrong/?sh=392d502960f8). Which is an amazing vote of confidence from the company.\n\nAnd what if the company was bankrupt in 3 years? Well, Musk also [personally guarenteed](https://www.usatoday.com/story/money/cars/2013/04/02/elon-musk-tesla-lease/2047863/) that he would fund the buy back promise from his own money, if Tesla couldn't. Which I think is just about the boldest move to guarantee a product from a founder that I've ever heard of?\n\nIt meant that you could buy the flashy new EV from the cool california startup and not worry that it would end up being a huge financial mistake. You were guarenteed that you could sell it in three years and get a better deal than any of your neighbors that had bought a Lexus or BMW or whatever. That move by Tesla and Musk completely undercut the argument about \"what if they're bankrupt\" and let Tesla sell enough cars and generate enough revenue that no one really worried about them going bankrupt anymore (at least not anyone with any sense). \n\nAnd now companies like Lucid, Rivian, even Ford and GM are in similar situations. And I don't think any of them are willing or able to make the same kind of guarantee?", "score": 13, "replies": [{"body": "*bailouts entered the chat*", "score": 3, "replies": [{"body": "I really think that a lot of automakers looked at the costs of getting established in EVs, and decided they would rather be bailed out eventually than try and compete.\n\nThe auto industry is an important part of the industrial base and a big employer in many countries, and it seems like a lot of automakers just assume they'd get bailed out because it would be inconceivable that their government would let *them* go bankrupt. \n\nSo instead of trying to compete now and losing money now in exchange for future growth, they build some token EVs and then try and squeeze as much profits out of the legacy petrol business as possible. And then when the auto market hits the tipping point and legacy sales collapse and EVs are the only way to survive, they all assume they'll get bailed out and can spend the government money to catch up.\n\nThat might work for a few of them, but I bet there's going to be a lot of bankruptcies because they all assume they're the only ones following this smart/sneaky strategy. In reality most of them are, and when things collapse, it's going to hit all of them very hard. There's no way the developed countries of the world are going to be able to afford, or have the stomach, to bail out every legacy automaker. They're going to force structured bankruptcies and mergers and let a few just burn to make a point about fiscal responsibility.\n\nAnd it doesn't seem like they're catching up to Tesla, if anything, they might be getting further behind? So the longer they wait for the bailout, the harder it will be to catch up, and the more hopeless their situation will be. I think companies like Rivian will actually be OK because they don't have a legacy business dragging them down. And even Lucid might be OK if they can get their cash burn under control to be around whenever the petrol market colipases.", "score": 3, "replies": []}, {"body": "Yeah I feel like this is what a lot of people are missing.  Governments aren't likely to just let some of their biggest companies fail so abruptly.  Money will flow into subsidies/tax breaks for these companies until they have adapted to electrification.  \n\nRight or wrong, the \"free market\" will not be allowed to dictate survival of the fittest.", "score": 2, "replies": []}]}, {"body": "Lucid and Rivian have decent electric vehicle technology. However, I'm thinking they are at a decent risk of their cash flow burn rate leading to bankruptcy in a couple of years if they don't get some serious inflows of cash. That being said Lucid being backed by Saudi Arabia and Rivian being backed by Amazon I'm not thinking that's a huge concern. The shareholders of those companies though in the short term will probably not be super happy with dilution.\n\n\nFord and GM have not yet made decent electric vehicle technology and for the most part are using their existing internal combustion engine platform and bolting on electric vehicle parts which isn't very efficient. They aren't selling many electric vehicles due to this and are losing billions of dollars. However, they have constant cash inflows from their currently cash flow positive internal combustion engine business. My long-term concern for Ford and GM is that as other companies ramp up their electric vehicle businesses their internal combustion engine business will stop being cash flow positive eventually and that their electric vehicle business will not have been ramped successfully. If I were to wager a guess Ford will do better than GM, and if they don't go bankrupt they will have a much much smaller market share than they currently have.", "score": 2, "replies": []}]}, {"body": "+9 🪑", "score": 15, "replies": []}, {"body": "Fewer v11 updates is bullish for v12", "score": 14, "replies": [{"body": "yeah and i suspect v12 will be first HW4 fsd build, but who knows 🤷‍♂️", "score": 9, "replies": [{"body": "Yeah no reason to waste energy making it run a soon to be inferior version", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "Yah they gave up on it.  Local Max can't change lanes ahead of time. Praying for neural net v12", "score": 4, "replies": [{"body": "We've got 4.5 months", "score": 3, "replies": []}]}]}, {"body": " https://twitter.com/xtrends/status/1689548784655577088?s=20  ...\n\n$15 for TSLA? LOL... $48 billion market cap while Tesla will have like $30 billion cash on hand .. Even GOJO doesnt have such low target.. just about when more and more ppl are warming up to FSD.", "score": 12, "replies": [{"body": "busted ass-analyst", "score": 4, "replies": []}, {"body": "that's after the 30-to-1 split   /s", "score": 3, "replies": []}, {"body": "One of the more historically accurate traders I've seen out there, but somehow he's gone completely rogue/deep Q on TSLA... a pity\n\nGJ was in a similar position as an analyst before he started his Tesla \"coverage\". He actually used to be one of the highest ranked analysts\n\nFor argument/entertainment's sake, let's say we actually get a massive recession and Elon's prediction of selling cars at a slight loss becomes reality. $15 is still an unrealistic target under this scenario, Tesla is not gonna eat through 20 billion of cash in 1-2 years", "score": 1, "replies": []}]}, {"body": "https://twitter.com/serobinsonjr/status/1689726430328848385?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nIt is a megapack world and everybody else is paying rent.", "score": 12, "replies": []}, {"body": "A MYP at 6% int rate now has a $40 higher monthly payment compared to when I bought it for 6k more at 1.25%", "score": 13, "replies": [{"body": "Good example of how much rates are impacting affordability", "score": 8, "replies": [{"body": "erect six foolish fear cow husky shaggy punch engine dinner -- mass edited with redact.dev", "score": 1, "replies": []}]}, {"body": "Not terrible", "score": 5, "replies": []}]}, {"body": "Work on GF Mexico has begun 😊\n\nhttps://twitter.com/tslachan/status/1689576236354547713?s=46&t=iTDUw3NMfp6QuhXGIjDQ9Q", "score": 12, "replies": [{"body": "A guy on YT went past the site 6 days ago to try to capture some pre groundbreaking activity, it's worth keeping an eye on the channel as he might be doing further videos and updates [https://www.youtube.com/watch?v=u\\_3rwqk020E](https://www.youtube.com/watch?v=u_3rwqk020E).\n\nIt also answers this question [https://www.reddit.com/r/TSLALounge/comments/15hmzhx/comment/juqpy45/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/TSLALounge/comments/15hmzhx/comment/juqpy45/?utm_source=share&utm_medium=web2x&context=3) that yes, activity will be visible before a ceremony", "score": 4, "replies": [{"body": "Great find! This guy also tried 2 months ago and was questioned by private security and the police 😅\n\nAlso said they think that security is using drones to guard the site 😳", "score": 2, "replies": []}, {"body": "Follow up: chatted with him, he said that he is planning another visit to the site in 2-3 weeks. If we get a date of the groundbreaking ceremony he will go specially on that date!", "score": 2, "replies": [{"body": "Sounds good!", "score": 1, "replies": []}]}]}, {"body": "😎", "score": 3, "replies": []}, {"body": "Now, what finishes first? GigaMexico, or Ford's new plant?", "score": 2, "replies": []}, {"body": "I think we should scrap all factory construction and spend our billions on stock buybacks to keep troyhouse happy. Then we can just borrow billions at high rates to build our factories.![img](emote|t5_37kf9c|4978)", "score": 1, "replies": []}]}, {"body": "Correct me if I'm wrong as I'm not typically the most financially knowledgeable person. But isn't this a typical down swing Tesla normally experiences? I've been around for a bit and there is always a down stock price, then it goes back up. Is there something different that makes this down trend worse I should be worried about? I'm on a long term hold position btw.", "score": 12, "replies": [{"body": "TSLA should be higher in 5-10 years as long as Tesla continues to execute and increase revenue/earnings through ev and energy growth. How fast they’re able to grow their earnings will determine the “fair” multiple. \n\nBetween now and then is uncertain since there’s always a lot of factors at play. Including the non zero chance they can’t profit significantly off their cars.\n\nThen FSD/ai is essentially a free call option with unlimited potential as it gets worked out. Some people value that more than others. \n\nIn the short term the stock market is a voting machine. Can go unreasonably high and low as sentiment/multiples fluctuate. In the end it’s a weighing machine and about how much a company makes now and the future.", "score": 11, "replies": [{"body": "This sounds incredibly bearish on the future.", "score": -1, "replies": [{"body": "Whenever I try and predict what the share price will do, I try to remain as neutral as possible since no one knows what's going to happen with TSLA or macro.\n\nI do believe in Tesla long term and that's why I still have shares and the majority of my assets. I'm just realistic in what price/multiple I'm willing to pay now and the near future and learned that I need to be protective to prevent another 2022 from happening again. I'm more than ok giving up the 2021 feels to avoid the 2022 feels lol.", "score": 4, "replies": [{"body": "I'm more than ok giving up the 2021 feels to avoid the 2022 feels. \n\n1,000%", "score": 2, "replies": []}]}]}]}, {"body": "I’ve been holding since 2017, and yes, experiencing these fluctuations is normal. I’ve lost count of how many times TSLA and my net worth have dipped by 40% or more. One of the earlier dips prompted my Dad to advise selling, but I ended up buying more. While he meant well, he’s not really into stocks.", "score": 10, "replies": []}, {"body": "It is normal yes. I think there's simply people who held on to their leverage who are pissed off", "score": 9, "replies": []}, {"body": "Will recover once macro recovers.", "score": 4, "replies": []}, {"body": "It's merely a blip at the moment, but that's how all huge downturns start!", "score": 4, "replies": []}, {"body": "this one is personal 😈", "score": 1, "replies": []}, {"body": "Ive been holding since Aug 12, 2020. $TSLA has crashed 50% at least 3-5 times since then. Companies on good financial footing don't do that* \n\n*Usually  TSLA loves to. Its been 3 years. I still don't get it. Some day I'll be rich again", "score": 1, "replies": [{"body": "Only one -50%+ crash since Aug 2020, that was the 2021 top to 2022 bottom: -75% (or 2x -50% if you count till May 2022 as separate)\n\nIt's a different story if your portfolio is crashing over -50% because of leverage\n\nBut yeah, TSLA is a different animal when it comes to volatility. I attributed this mainly to 1. Elon, 2. a single stock being the largest options casino in the market", "score": 4, "replies": [{"body": "Yeah, I didn't guite do the math. We've had a bunch of big drawdowns of 30% - 50% several times", "score": 2, "replies": []}]}, {"body": ">Companies on good financial footing don't do that\n\nHas nothing to do with financial footing. Tesla is in fantastic shape.\n\nThe issue is that a huge part of the TSLA market valuation is due to it's projected growth. In bear markets the growth premium reduces and in addition all kinds of macro fluctuations have a disproportionate effect on growth projections.\n\nIn other words, as soon as the market decides that it is time for a bull market then I expect the stock to take off.", "score": 5, "replies": [{"body": "You basically reiterated my point", "score": 1, "replies": []}]}, {"body": "https://www.fool.com/investing/general/2016/02/09/the-agony-of-high-returns.aspx", "score": 2, "replies": [{"body": "Guess I was wrong about volitity. \n\nTries to ignore the fact he bought a few shares of Biogen before going to college when they were like $25", "score": 1, "replies": []}]}]}]}, {"body": "Took this picture of an octopus in curacao today. Remember to live life and buy shares when you can!\n\nhttps://preview.redd.it/upiw3x52bahb1.jpeg?width=2160&format=pjpg&auto=webp&s=3341950f744d9d4ba0abd5f13f8a1ec109c877ba", "score": 11, "replies": [{"body": "What depth and camera?", "score": 5, "replies": [{"body": "Roughly 30' with just the gopro hero 10. I'm looking to get an actual camera rated for more depth here shortly (Tsla willing), but it does the trick for now.", "score": 4, "replies": [{"body": "That’s amazingly good for a general purpose camera. This was just with the plastic housing or are these now diveable in raw form?", "score": 3, "replies": [{"body": "I was surprised as well. Funny enough, I think they only recommend 33 feet for the raw form/ no housing, but I wasn't going to let that octopus get away lol. Housing for it is fairly cheap and comes with antifog inserts.", "score": 2, "replies": []}]}]}]}, {"body": "Snorkeling and diving is an amazing experience. This is reminding me to go do it again after a decade since the last time.", "score": 4, "replies": [{"body": "Couldn't agree more. Reefs and sea creatures are my favorite thing about this planet.", "score": 3, "replies": []}]}, {"body": "Wow! Gorgeous and agree with you", "score": 2, "replies": []}]}, {"body": "Giga berlin is gigantic holy shit. Most parking spots for employees have a 11kw wall connector with the pedestal, pretty cool. Battery factory seems almost complete? Noticed that most employees going in/out were young. Also the v4 super chargers look sick and much more elegant/polished imo.\n\nhttps://preview.redd.it/sqif3yfaachb1.jpeg?width=4032&format=pjpg&auto=webp&s=d1800cfcd08fad0db5133c06a2d920f2727350ad", "score": 12, "replies": []}, {"body": "more like LMAOK-99", "score": 11, "replies": [{"body": "JK-99", "score": 6, "replies": []}]}, {"body": "UAW want $150 an hour, which would add $40B+ to legacy auto cost structure", "score": 11, "replies": [{"body": "I support these unions demands.  GM and Ford should give them everything they are asking for.\n\nSustainable bankruptcy no matter the bailout size!", "score": 7, "replies": [{"body": "I jus want the economics that blast us to the fooking moon. Burn the rest 😈", "score": 4, "replies": []}]}, {"body": "$150 an hour, holy stinky", "score": 6, "replies": []}, {"body": "\"I'm a union guy\" -Biden", "score": 4, "replies": [{"body": "I'm an onion guy - Bidet", "score": 4, "replies": [{"body": "Im an onion guy, especially breaded and deep fried", "score": 3, "replies": []}]}]}]}, {"body": "Oohhhh first!\n\n(This was an early thread 👀)\n\nMay the CPI Gods 🙏🏻 macro 😎", "score": 10, "replies": []}, {"body": "Elon genius move with Linda. Very good outreach and at par with Shotwell.", "score": 11, "replies": [{"body": "Did you see how she handled that cage match question?", "score": 4, "replies": []}, {"body": "Let's see how she fits in an X that's a financial company first and a advertising company second. Doubt she will be in charge then", "score": 0, "replies": [{"body": "CEO is an operations position, not marketing position. As there is no CMO, she’s doing that job. She’ll delegate once ad revenue is good and focus on finance. Just my thots, I am no CEO.", "score": 4, "replies": []}]}]}, {"body": "Dillon Loomis’ parasite being gone is the bull signal we needed. Upward from here!", "score": 10, "replies": [{"body": "Rob gonna hang out w Gali 🤗🤗", "score": 5, "replies": []}]}, {"body": "Lol I am afraid of Linda just listening to her.\n\nI think she might fire me from my current job.", "score": 15, "replies": [{"body": "🤣", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "What city?\n\nE: Nice to see a data point outside of San Fran.", "score": 3, "replies": []}]}, {"body": "Haven't checked in lately.. been working in the heat and am exhausted. Cmon Tesla, do something. *pokes tsla with stick.\n\nHope everyone is doing well and enjoying life and family.", "score": 13, "replies": []}, {"body": "There is unlimited desire to own TSLA but affordability is the problem. We will fix it. - Elon", "score": 6, "replies": [{"body": "We should do stock splits on cars to make them more affordable.", "score": 2, "replies": [{"body": "In effect, you are kinda talking about selling smaller and cheaper models.", "score": 1, "replies": []}]}]}, {"body": "(45) 275Cs making my mouth water", "score": 7, "replies": [{"body": "Damn, that's crazy, godspeed!", "score": 7, "replies": []}, {"body": "Someday were gonna rip and youre gonna get rich as shit. And Im gonna be happy for you", "score": 3, "replies": []}]}, {"body": "Up 3%! Woohoo.\n\nAlso, Minotaur guy it seems that lk99 is dead in the water, those tests they did which showed 0 ohms was due to a phase transition in the copper matrix so a false positive. \n\nIt felt a bit fishy to me when that main researcher stated that it must be a sc because it can't be anything else. But it was something else, dude.", "score": 7, "replies": [{"body": "And how many of us we called \"downers\" because we remained skeptical awaiting further confirmation/information?  This is the danger with hype and exuberance - It doesn't necessarily lead to real data and these things can't just be willed into existence.\n\nIf nothing else I hope this whole ordeal puts more emphasis and money into researching superconductors in general.  The implications of such a material are so profound, it would be world changing for sure.", "score": 9, "replies": [{"body": "to be fair, we *are* aliens put here to slow earths technological development until the armada arrives\n\nbut we shouldn’t get blamed for this one", "score": 4, "replies": []}]}, {"body": "it was pretty sus from beginning and hearing him talk made it super sus. sounded like he barely knew was a sc is", "score": 5, "replies": []}, {"body": "Nobody gonna remember lk22 soon", "score": 3, "replies": [{"body": "Twitter scientist shook", "score": 2, "replies": []}]}]}, {"body": "![gif](giphy|af34tVk53Li4E)", "score": 8, "replies": []}, {"body": "Wow, F and GM took a spanking today", "score": 6, "replies": []}, {"body": "Doing another sailing trip, this time from Portugal to the Netherlands.\n\nSaw some dolphins, bullish.\n\nDon't forget to enjoy life out there.\n\nPeace out 🥰🥰🥰", "score": 13, "replies": [{"body": "What kind of boat, and how long is it going to take you?", "score": 1, "replies": []}, {"body": "🐬", "score": 1, "replies": []}]}, {"body": "silky slap chief deserve dependent run resolute decide continue bake -- mass edited with redact.dev", "score": 5, "replies": [{"body": "Sentiment seemed to be that there will be an uptick because of energy, so inline with so muted reaction is relatively bearish. It seems that market is pricing in 2-2.5% by EOY.\n\nOf course better gauge in an hour", "score": 1, "replies": [{"body": "Yeah the gas and electricity is interesting to me. I guess the recent uptick will be captured more in next month's data.\n\nGas was only up 0.2% and electricity was -0.7% for July.", "score": 2, "replies": [{"body": "Hard to tell what's real and what's cooked anymore with practically every single month some \"revisions\" coming out (especially for NFP, those have been just a sham recently). This month will probably be the same\\~", "score": 2, "replies": []}]}]}]}, {"body": "Called mom about something, talked for nearly an hour. $TSLA hopping on open. \n\nCPI - good news?\n\nAlso:  2008 was like 5 years ago. How is my nephew already in high school?", "score": 5, "replies": [{"body": "You should call your mom more often.", "score": 5, "replies": [{"body": "Because it correlates with Tesla popping? Good idea!", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Mom hates social media, she gets on Facebook for like 10 minutes a year", "score": 2, "replies": []}]}]}]}]}, {"body": "Back to Monday/Tuesday levels. Next week back to Friday's 260?", "score": 7, "replies": [{"body": "With CPI basically in line and not as bad as some feared, next week is opex with a lot of options expiring. Max pain 255, lots of open 260P/260C so definitely possible to pin around there.", "score": 4, "replies": []}]}, {"body": "Hold the gains!!", "score": 5, "replies": []}, {"body": "I wonder what max-pain is this week.\n\noh yeah, it is 250.", "score": 6, "replies": [{"body": "it was 255 a day or two ago, then we dumped", "score": 2, "replies": []}]}, {"body": "Wow! Did you all see the new Escalade EV?!\n\nSorry loungers, gonna sell my shares, GM is looking prime for a run! 🔥🔥🔥🚀🚀🚀🔥🔥🔥", "score": 6, "replies": [{"body": "Lmaoo, I rented an ESV with supercruise and it was terrible", "score": 4, "replies": [{"body": "Yeah but did it cruise superly? Then it's better than FSD", "score": 3, "replies": []}]}, {"body": "I think it looks good. I dont want one but it does look good", "score": 3, "replies": [{"body": "Fair, I wanna see the efficiency numbers. Thing looks like it drives like a brick.", "score": 3, "replies": [{"body": "Its a ginormous box on wheels of course it drives like a brick", "score": 3, "replies": []}]}]}, {"body": "![gif](giphy|xTiN0yjTq9bziRQk00|downsized)", "score": 2, "replies": [{"body": "You just don't understand the technology! Have you seen the massive frunk?! 🔥🔥🔥", "score": 2, "replies": []}]}]}, {"body": "Looks like what happened was todays auction for treasuries was poorly subscribed, and that what spiked rates and cucked us. \n\nhttps://twitter.com/LiveSquawk/status/1689683847393288210?t=04G-QQ9nNxQj9X7oQV7VGA&s=19", "score": 6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "yup, rotation to CASH", "score": 4, "replies": [{"body": "Cash rotating into equities?", "score": 2, "replies": [{"body": "Not yet", "score": 2, "replies": []}]}]}]}, {"body": "But I was told the US can borrow endless sums with no consequences.", "score": 7, "replies": []}, {"body": "I’m just glad trump gave two trillion in tax income back to the ultra rich\n\ntotally didn’t hose the economy\n\npraise trickle down economics", "score": 3, "replies": []}]}, {"body": "Governments should not resemble salads.", "score": 6, "replies": []}, {"body": "Dead cat bounce this", "score": 5, "replies": [{"body": "👀 that would mean a temporary rise followed by a much larger decline 🙈", "score": 5, "replies": []}]}, {"body": "BREAKING: U.S. CPI:  3.2% YEAR-OVER-YEAR (EST.  3.3%)\nU.S. CORE CPI:  4.7% YEAR-OVER-YEAR (EST.  4.8%)", "score": 6, "replies": []}, {"body": "Some light in the darkness", "score": 5, "replies": []}, {"body": "![gif](giphy|yr7n0u3qzO9nG)", "score": 5, "replies": [{"body": "![gif](giphy|xT0xeMA62E1XIlup68|downsized)", "score": 5, "replies": [{"body": "the fact that Cookie Monster has to sing “cookies are a sometimes food” and promotes a balanced diet now is some bullshit", "score": 2, "replies": [{"body": "They ruined Cookie Monster now?", "score": 2, "replies": [{"body": "yeah [ages ago](https://youtu.be/PaHkwE7TaNg)", "score": 3, "replies": [{"body": "Wow disgusting", "score": 2, "replies": []}]}]}, {"body": "While I agree in theory, as a father to two young kids who love Sesame Street, I appreciate that I don’t have to explain why they can’t eat endless cookies like Cookie Monster", "score": 2, "replies": [{"body": "you’re the real monster", "score": 3, "replies": []}]}]}]}]}, {"body": "![gif](giphy|asHT7eh4AwG9G)", "score": 4, "replies": []}, {"body": "Mary C. Daly is a stupid bitch who should have been forcibly silenced years ago", "score": 4, "replies": [{"body": "Markets fault for letting fed clowns talk up the rates and down the indices", "score": 4, "replies": []}]}, {"body": "Classic fade, market very pedo for now", "score": 4, "replies": [{"body": "Fed back on their fear roadshow", "score": 4, "replies": []}]}, {"body": "Can anyone see the sell walls at our current point?", "score": 5, "replies": [{"body": "![gif](giphy|3o6Ztg4tunIB5chzUc|downsized)", "score": 1, "replies": []}]}, {"body": "It feels like a red day but it’s still green. Indexes still green too (well more flat than anything) but I keep thinking spx and qqq are red. 10yr bonds down quite significantly so is that money just now sitting on sidelines?", "score": 5, "replies": [{"body": "Good question", "score": 3, "replies": []}]}, {"body": "So is the main market fear now recession?", "score": 5, "replies": []}, {"body": "Can the other non-Tesla shit EVs precondition their cars before hitting the Tesla supercharger? Going to have to charge next to these retards in 143 days", "score": 5, "replies": [{"body": "They wont be able to use V2 superchargers.", "score": 3, "replies": []}]}, {"body": "lunchroom angle lip fuzzy person sugar humorous subtract wild serious -- mass edited with redact.dev", "score": 10, "replies": [{"body": "I'll do you one better: stock completely flat from his start of presidency in 1999 to 2011, went up for just 3 years  during the greatest bull run of our lives where everything else went up in 2011-2014, then now again, flat for the last 9 years from 2014-2023. \n\nThe guy has been flat for 21 of 24 years.", "score": 3, "replies": []}, {"body": "He wasn't in charge during the shit show", "score": 1, "replies": []}]}, {"body": "Cramer said:\n\nIt’s not a soft or hard landing.\n\nIt’s a Glide.\n\n\nLounge everywhere.", "score": 9, "replies": []}, {"body": "4 more months at least to the next Elon sale. I remember in 2021 and 2022 when people used to cope by stating that Elon likes a lower share price so that his employees can buy shares at lower prices. He cAReS aBoUt ThEm!  🤡", "score": 11, "replies": [{"body": "I hope he sells it all asap, just get it over with. Now that would be a dip to buy", "score": 2, "replies": [{"body": "the more he dumps the price the less value he gets out of his shares. I assume 2022 to be a twitter addicted one time year of idiocy and that future sales will be more sane.", "score": 2, "replies": [{"body": "![gif](giphy|t9vDJ3sOCcGtwyv0ks|downsized)", "score": 2, "replies": []}, {"body": "Not if he needs to keep X afloat", "score": 2, "replies": [{"body": "Keeping x afloat doesn't cost 50b a year", "score": 2, "replies": []}]}]}]}]}, {"body": "Save us, sandwiches", "score": 8, "replies": []}, {"body": "https://truflation.com/blog/truflation-us-inflation-update-july-2023\n\nTruflation forecasting inflation to go up from here", "score": 8, "replies": [{"body": "Do not like", "score": 6, "replies": [{"body": "Do u want inflation or do u want recession", "score": 5, "replies": [{"body": "I want Database to have large numbers and Prices to be Costco hotdog. \n\nWhat? You asked.", "score": 4, "replies": []}, {"body": "What’s better for tsla?", "score": 2, "replies": [{"body": "Hm probably mildly high inflation", "score": 5, "replies": [{"body": "Unlimited demand 65k Model Y!", "score": 2, "replies": []}]}]}]}]}, {"body": "https://preview.redd.it/d8i36nyhrchb1.jpeg?width=1081&format=pjpg&auto=webp&s=40c494a20ce4d26d5777b1aca68700f1a6d9a769\n\nThis will not be good for market if true 🤦🏻‍♂️", "score": 3, "replies": [{"body": "That would also likely indicate the economy is holding up. Who knows what markets will do in short run and who knows how accurate Truflation will ultimately be", "score": 3, "replies": []}]}]}, {"body": "Visiting giga berlin today (from outside).", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Traveling from south of Europe to middle of norway for work, managed to fit the Berlin visit in my travel schedule! Ideally would like to charge on the new v4 chargers but I’m thinking they’re not done with the work just yet", "score": 3, "replies": []}]}]}, {"body": "CPI soon 🔜", "score": 4, "replies": [{"body": "When does this deadly number come out? Is it PM or during?", "score": 1, "replies": [{"body": "An hour before market opens", "score": 2, "replies": []}, {"body": "830 est", "score": 2, "replies": []}]}]}, {"body": "People putting too much emphasis on CPI/PPI data and comments.  Easing of rates likely isn't happening till next year and the market knows this.  These false market pops are predictable and end up fizzling out.\n\nIt's really not as consequential as it was when there was uncertainty over the magnitude of rate hikes.", "score": 3, "replies": [{"body": "It’ll be data dependent. Combo of CPI/PPI, PCE, unemployment, etc. No one knows exactly how it’ll all play out or timing", "score": 3, "replies": [{"body": "Yup. Always comes down to actual numbers but my point is that inflation coming down is no longer a question. That’s why people waiting all month for CPI/PPI numbers are putting too much emphasis on it. Barring some massive quantitative spike, the markets will shrug off numbers that are in line with expectations.", "score": 3, "replies": [{"body": "Unless there are surprises. Like if Core MoM flipped deflationary or unemployment spikes. \n\nThe shelter data is misleading and being propped up by Fed policy. There are a lot of moving pieces and complexity and it’s impossible to know exactly how this will play out. Maybe we get more banking issues out of nowhere or something unexpected happens. 🤷‍♂️", "score": 3, "replies": [{"body": "Agreed - that’s what I meant by a “quantitative spike”", "score": 3, "replies": [{"body": "For sure. I wish I knew what will happen next. It’s fun to guess but typically when I do I’m wrong and there’s a variable I didn’t consider that comes out of nowhere", "score": 2, "replies": []}]}]}]}]}, {"body": "Easing of rates can be good or bad for stocks, depending on economy.", "score": 3, "replies": []}]}, {"body": "https://twitter.com/carlquintanilla/status/1689657703390392320?s=46&t=mG-wx8ewMg03AyZIsmD4-g\n\nCarl says housing goes down further", "score": 4, "replies": []}, {"body": "just fyi california $2k clean vehicle rebate can only be used once ☹️", "score": 4, "replies": [{"body": "A year or a lifetime?", "score": 2, "replies": [{"body": "https://cleanvehiclerebate.org/en/eligibility-guidelines\n\n*Individual and business applicants are not eligible to receive more than one CVRP rebate either via direct purchase and/or lease as of December 3, 2019. Applicants who have not already met their rebate limit prior to December 3, 2019, will be eligible for one additional rebate. Those that have already met their two-rebate limit will remain ineligible for an additional rebate. Individuals or businesses that have met the rebate limit with non-fuel cell vehicles may apply for one additional rebate for an eligible fuel cell vehicle. This fuel cell vehicle exception does not apply to Rebate Now applications. Traditional rental and car share fleets are subject to limits of 20 rebates per calendar year. Public fleets are limited to 30 rebates per calendar year.*", "score": 2, "replies": []}]}]}, {"body": "Market ded\n\n![gif](giphy|godMk62fXqpgY|downsized)", "score": 4, "replies": []}, {"body": "dime sophisticated possessive hunt scale knee dependent plants icky fly -- mass edited with redact.dev", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Amazing performance", "score": 2, "replies": []}]}]}, {"body": "Cathie sold TSLA at this price and not $300? Wow", "score": 4, "replies": [{"body": "it says more about arkk than tesla. arkk been getting rolled on this last 8 trading days. And when shit stocks die, its time to sell tesla to buy more", "score": 8, "replies": []}]}, {"body": "Getting a + 1% from tsla now is like blood from a turnip", "score": 6, "replies": []}, {"body": "Gonna fix the cnbc headlines\n\nDow fades after soft inflation data, Disney shares trash", "score": 7, "replies": []}, {"body": "https://twitter.com/teslaboomermama/status/1689657722994876416?s=46&t=fGVL0206fdWMIjq9C1_Fgg\n\n“Conservative” price target", "score": 6, "replies": [{"body": "whatever it takes to get an elon baby. Expect elf ears in some capacity on her soon", "score": 9, "replies": [{"body": "Boomer papa gonna be pissed", "score": 2, "replies": []}]}, {"body": "warren now got access to boomermama account?", "score": 7, "replies": [{"body": "😂", "score": 3, "replies": []}]}, {"body": "Lmao. Pamp it boomer mama", "score": 5, "replies": []}, {"body": "I ran across a few of TBP’s post and immediately followed him.", "score": 2, "replies": [{"body": "[Papa on X](https://twitter.com/teslaboomerpapa/status/1689717362210336768?s=61&t=tXqsVXPn5Oln9LEyWbDKkg)", "score": 2, "replies": []}]}]}, {"body": "Y'all are the best.", "score": 7, "replies": []}, {"body": "U.S. Weekly Initial Jobless Claims: 248K, [Est. 230K, Prev. 227K]\nU.S. Jul. Core CPI (MoM): 0.2%, [Est. 0.2%, Prev. 0.2%]\nU.S. Jul. Core CPI (YoY): 4.7%, [Est. 4.8%, Prev. 4.8%]\nU.S. Jul. CPI (MoM): 0.2%, [Est. 0.2%, Prev. 0.2%]\nU.S. Jul. CPI (YoY): 3.2%, [Est. 3.3%, Prev. 3.0%]", "score": 3, "replies": []}, {"body": "Aaaaaand it's gone", "score": 3, "replies": [{"body": "Red soon.", "score": -1, "replies": []}]}, {"body": "What date was the first split? I remember something around Aug 12, 2020 but Im not sure if that was the announcement date, effective date, or if my date is off slightly.", "score": 3, "replies": []}, {"body": "Operational run rate near break even sounds like debt serving not inside lol.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah, it's fine I guess", "score": 3, "replies": []}]}, {"body": "dont worry i know why the market didnt go up today even though CPI was perfect. 3 day rule.", "score": 3, "replies": []}, {"body": "Market is pedo as shit right now, I do expect we will go red within 5 seconds of open.", "score": 7, "replies": [{"body": "3 seconds", "score": 2, "replies": []}]}, {"body": "Hypothetical situation: say Tesla knows v12 is robotaxi capable and the full solution, think they'd do buybacks before releasing? \n\nIt'd be the obvious thing to do but I wouldn't put it past them", "score": 5, "replies": [{"body": "Unless I need more coffee: wouldn't that be good for us holding Tesla shares. They buy back shares reducing shares outstanding, when peole try go buy and catch the rocket - demand for 💺 outstrips supply,  price of our chairs and networth go 🚀", "score": 3, "replies": [{"body": "Yep would be obvious thing to do", "score": 4, "replies": []}]}, {"body": "But management doesn't care about the stock price.  Even Elon said he doesn't care.  It could be 5 a share and he doesn't care", "score": 1, "replies": [{"body": "Tesla has less incentive to care about the stock price now, because they don't need to raise more $ through secondary offerings of stock.  The company now generates more than enough cash flow to finance factory expansions.", "score": 6, "replies": []}, {"body": "Yeah lol. Complete speculation but I almost wonder if stuff like this caused disagreement between Elon and Zach and partially led to his departure. Not entirely fulfilling fiduciary duties but who knows.\n\nEdit: possible advertising disagreements I think is a better example, this is more speculative", "score": 2, "replies": [{"body": "Elon is focused on posting about how he is a Republican and things like having a wrestling match with the Facebook ceo.  Maybe he should focus on running tesla.  It's very possible for even big companies to fail. It's not likely of course but my point is it seems like Elon doesn't care about the tesla company anymore.   Perhaps it's time to get a ceo that actually gives a fuck\n\nMaybe alienating half the country isn't such a great idea.", "score": 1, "replies": [{"body": "He definitely cares just doesn't give af about short term but the thing is it's always short term, long term never comes", "score": 3, "replies": [{"body": "He  has stated many times he doesn't care at all about the stock price.", "score": 1, "replies": []}]}]}]}, {"body": "🍼", "score": 2, "replies": []}]}, {"body": "Mental gymnastics to rationalize lack of fsdbeta progress and releases. \n\nThey are doing it for our own good, so we can buy low, save humanity, employees can buy cheap in espp and so on.", "score": -1, "replies": []}, {"body": "Nobody knows when and if robotaxis will be viable", "score": 0, "replies": [{"body": "I think the hypothetical is more around if moving to a neural net end to end approach with v12 is a major step change and Tesla sees this, wouldn’t the logical move be to buy back shares? \n\nIf they’re going to jump to v12 they may want to confirm progress with compute scaling before they make a decision on buybacks. Definitely not a lot of appetite for taking much risk given macro conditions.", "score": 4, "replies": [{"body": "Logical move if robotaxi imminent is to use cash to build out own robotaxi network", "score": 3, "replies": [{"body": "True but then take out loans to keep funding manufacturing of cars and eventually sell off those cash flows to get more loans to build more cars or is it easier to just let network operators take a small cut from the start and also deal with cleaning and maintaining cars and let them compete with each other while Tesla just controls fsd subscription price", "score": 3, "replies": []}, {"body": "Yeah that’s a good point", "score": 2, "replies": []}]}]}, {"body": "Nobody knows? I’d like to speak with this nobody and show them some graphs.", "score": 4, "replies": []}]}]}, {"body": "245, not great not terrible", "score": 5, "replies": [{"body": "I just want 266 to hold and tsla just can't deliver the boobs", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "man Drake is a dweeb", "score": 4, "replies": [{"body": "he did name himself after a 🦆", "score": 3, "replies": [{"body": "Re-living his childhood dreams of duck tales", "score": 3, "replies": []}]}]}, {"body": "Huh?  Nah - he at twitter giving it his full attention.", "score": 3, "replies": []}]}, {"body": "got pretty high which is kinda rare and my neighbor just asked me to play croquet. whew this is probably going to be my most intense croquet game ever\n\nI let other people win the last 4 games I played because I was winning too much. I’m something of a professional", "score": 7, "replies": []}, {"body": "Old fashioned donuts", "score": 3, "replies": [{"body": "![gif](giphy|0S8HOtgHcndMHo2Qvu|downsized)", "score": 0, "replies": [{"body": "![gif](giphy|a054JEXePsNbvVLBzP)", "score": 0, "replies": [{"body": "Is the hummer EV in the barbie movie???", "score": 1, "replies": [{"body": "yea 🤣", "score": 1, "replies": []}]}]}, {"body": "I hope u lost sleep over this bread boy muahahaha", "score": 1, "replies": [{"body": "over what", "score": 1, "replies": [{"body": "this", "score": 1, "replies": []}]}]}]}]}, {"body": "FSD almost solved, so excited. How many days left?", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "![gif](giphy|CyoQdbc7FHqqTpkSPI|downsized)", "score": 5, "replies": []}]}, {"body": "![gif](giphy|dmB5vD2t2gR8Y|downsized)\n\nYou believe the liar ceo?", "score": 1, "replies": [{"body": "🍼", "score": 1, "replies": []}]}]}, {"body": "We are back!", "score": 5, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "remind me 2 months", "score": 2, "replies": []}]}, {"body": "lol @ F and GM 😂", "score": 4, "replies": [{"body": "Too many good paying union jobs", "score": 1, "replies": []}]}, {"body": "Got a 1 day ban from r/politics because I called someone a doofus. They told me I was wrong, then wrote a 3 paragraph essay explaining why I was wrong and every point agreed with me\n\nI questioned the ban and got permanently suspended by a mod sucking reddits dick for free.\n\n When does Reddit IPO again?", "score": 5, "replies": [{"body": "First mistake is visiting r/politics", "score": 10, "replies": []}, {"body": "reddit isnt real, only the lounge exists", "score": 8, "replies": []}, {"body": "That place is a liberal cesspool anyways.", "score": 7, "replies": [{"body": "Dont you have anything positive to say about, well anything?", "score": -3, "replies": [{"body": "In this case it is warranted.", "score": 5, "replies": [{"body": "Broken clocks are right occasionally", "score": 1, "replies": []}]}]}]}, {"body": "No personal attacks is their 1st rule of commenting.  If you apologized and edited out the name calling you probably would have been fine.  That's one sub that is probably a pita to mod", "score": 1, "replies": [{"body": "Would help if the mods didnt have skin so thin it was one sided", "score": 4, "replies": []}]}]}, {"body": "https://reddit.com/r/LUCID/s/75gLoLURd0\n\nCopium.gif", "score": 2, "replies": [{"body": "LOL I saw a Nio for the first time yesterday and thought it was a Lucid. I wouldn't be surprised if Apple chooses Chinese production, just like their phones.", "score": 2, "replies": []}, {"body": "from the article:\n\n> Lucid has inked an agreement with Saudi Arabia’s Ministry of Finance to  supply up to 100,000 Lucid vehicles over the next decade. The company’s  public plans indicate the intention to ship 1,000 to 2,000 vehicles  annually for the Saudi Arabian government, with a target to increase  this to 4,000 to 7,000 units by 2025. \n\nStrong Nikola vibes from the Trevor Milton era here.", "score": 1, "replies": []}]}, {"body": "What happens to nvda, sudden drop", "score": 2, "replies": [{"body": "CFO resigns", "score": 1, "replies": []}, {"body": "Just getting started.", "score": 0, "replies": []}]}, {"body": "What happened?", "score": 2, "replies": [{"body": "Market was doing good but then ten year rate started mooning, so tsla went down. Then ten year pulled back but vix started mooning so tsla went down more. Since we have a lot of trading left hopefully we close at least better than -3%", "score": 4, "replies": [{"body": "Basically nothing matters tsla will go down", "score": 3, "replies": []}, {"body": "I checked the indexes and they were down so I figured it was something Macro", "score": 2, "replies": [{"body": "Yah rates and vix are macro", "score": 3, "replies": []}]}]}, {"body": "bow salt late offbeat reach spectacular absorbed hungry crush melodic -- mass edited with redact.dev", "score": 2, "replies": []}]}, {"body": "Does heat pump when cooling function fundamentally different than an AC?", "score": 2, "replies": [{"body": "No, they are not. \n\nAC is a heat pump where heat transfer only works in one direction.\n\nA heat pump has a reversing valve, allowing it to transfer heat in any direction thus can heat and cool, depending upon the configuration of the reversing valve.", "score": 4, "replies": []}, {"body": "If you have water-water heatpump you can use passive cooling so it is free except for the circulation pump.", "score": 3, "replies": []}, {"body": "AC is always just an uni-directional heat pump\n\nbeing able to use the same system in reverse and other configurations  is the impressive part", "score": 4, "replies": [{"body": "AC is uni-directional\\*", "score": 2, "replies": [{"body": "oops that’s what I meant to type hah", "score": 2, "replies": []}]}]}, {"body": "No, exactly the same.", "score": 2, "replies": [{"body": "Hm that's still quite energy intensive", "score": 1, "replies": [{"body": "depends on the load, my minisplit is pretty efficient", "score": 3, "replies": []}, {"body": "Heat pumps are quite efficient, unless you have very expensive electricity. Much better than gas or resistive heating.", "score": 2, "replies": [{"body": "Cost dose not change efficiency.", "score": 1, "replies": []}]}, {"body": "? not sure what you mean.\n\nBut consider this, in cooling mode all waste heat ist lost (EER) in Heatpump mode the watse heat is usesd (COP).\n\nEfficency depends on the machine and on how far the high and low temperature of the system you want to get are apart. For example, using a heat pump for floor heating with 30°C is way more efficient than heating a radiator with 60°C (given the same outside temperature).", "score": 1, "replies": []}]}]}]}, {"body": "Hm Cathie selling more nvda and tsla. Are we reaching another top? Or she just needs money", "score": 2, "replies": [{"body": "Cathie selling is a bullish signal.", "score": 11, "replies": []}]}, {"body": "Spent time today at the gym under an assuming horizontal bar chasing that elusive ‘hypertrophy’.\n\nMy back is jacked as fuuu…", "score": 6, "replies": []}, {"body": "🚀", "score": 3, "replies": [{"body": "Our rocket is struggle to get to actual space 🥹", "score": 2, "replies": []}]}, {"body": "Everyone selling who’s buying?", "score": 4, "replies": [{"body": "Every share sold has a buyer", "score": 8, "replies": [{"body": "Unlimited demand", "score": 6, "replies": [{"body": "We can sell every car we make at the right price", "score": 4, "replies": [{"body": "We can sell every share at the right price", "score": 7, "replies": [{"body": "Sell every car at any price and we can  have shares at lower prices. 4D chess.", "score": 4, "replies": [{"body": "Price: donation of any amount please", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "BOOM we gucci baby", "score": 3, "replies": [{"body": "that didnt feel like a boom lol", "score": 1, "replies": [{"body": "Boom for ants", "score": 1, "replies": []}]}]}, {"body": "This is gonna be red EOD just watch", "score": 4, "replies": [{"body": "reverse jynxing, noice!\n\n![gif](giphy|yJFeycRK2DB4c)", "score": 6, "replies": [{"body": "I've watched this for like 10 seconds, I can't see his lips say noice lol", "score": 5, "replies": [{"body": "It looks to me like he's saying \"right\"", "score": 3, "replies": []}]}]}, {"body": "Stock is infected with woke virus", "score": 5, "replies": []}]}, {"body": "[https://bid.hgpauction.com/auctions/8660/herita10216](https://bid.hgpauction.com/auctions/8660/herita10216)\n\nPlease support Elon! In all honesty I might bid on some cool chairs", "score": 3, "replies": [{"body": "Selling off old office furniture.  Nothing weird about that.", "score": 2, "replies": [{"body": "He fired like 80% of Twitter employees, this is only logical to liquidate all the crap the freeloaders used to occupy their time.", "score": 6, "replies": []}]}]}, {"body": "https://preview.redd.it/it6np8kscahb1.jpeg?width=378&format=pjpg&auto=webp&s=a4703e941881ec4fb03be44d945711fba9101e29", "score": 3, "replies": [{"body": "the eyes follow you like a spooky painting", "score": 4, "replies": []}, {"body": "nail deserted full middle zealous squeeze aloof sense wrench long -- mass edited with redact.dev", "score": 5, "replies": []}, {"body": "Jeremy the star", "score": 2, "replies": []}, {"body": "https://preview.redd.it/q7mwct5pfahb1.jpeg?width=551&format=pjpg&auto=webp&s=c14a77e151d4059121d2d497af9e318effaff986", "score": 1, "replies": []}]}, {"body": "hehehe", "score": 3, "replies": []}, {"body": "crowd cake support chunky smell disarm ask jellyfish makeshift quickest -- mass edited with redact.dev", "score": 3, "replies": [{"body": "There are a few negative nancies who seem to be training for this possibility lol", "score": 2, "replies": [{"body": "worthless fade attempt tender placid melodic plants deserted quiet money -- mass edited with redact.dev", "score": 2, "replies": []}]}, {"body": "maybe if we all simped for the ambassador of earf", "score": 1, "replies": [{"body": "chief file money vase scarce bedroom jeans berserk seemly work -- mass edited with redact.dev", "score": 3, "replies": [{"body": "what do you think twitter is", "score": 2, "replies": [{"body": "hard-to-find plate plough fear possessive voracious hungry snatch smart shy -- mass edited with redact.dev", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "If we got enough attention the simps would bank roll us.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Fasbeta 13 will save us. \n\nElon: Pre Pre alpha build is so good that this might be the one. \n\nI am driving every day and Zero intervention from onsite boxable to starbase.", "score": 3, "replies": [{"body": "Just waiting for that sweet ASS (actually smart summon) update", "score": 4, "replies": [{"body": "I remember on FSD day one of the engineers was confident it was coming out that month!", "score": 3, "replies": [{"body": "If someone overrides him and announces a feature , then elon will do everything to delay/suppress it.", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I smoke every day but goddamn this 420 thing is getting really tired", "score": 7, "replies": [{"body": "Have you heard about '69'?", "score": 3, "replies": [{"body": "In World War One, they called it shell shock. Second time around, they called it battle fatigue. After 'Nam, it was post-traumatic stress disorder.\nJAN KARON", "score": 3, "replies": [{"body": "Now it's just called Post Traumatic Stress.", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I don't trust anti semites 😂😂", "score": 1, "replies": []}]}]}, {"body": "![gif](giphy|Iu9rM6jqEozoPqbfxn)", "score": 2, "replies": []}]}]}, {"body": "troyhouse unblocked me? Or the app is glitching? Is the world coming to an end?", "score": 3, "replies": [{"body": "Nobody wants to miss out on the next superconductor news.", "score": 9, "replies": []}]}, {"body": "shit the woke mind virus got me", "score": 3, "replies": [{"body": "Time to cut off your d", "score": 6, "replies": [{"body": "![gif](giphy|H5C8CevNMbpBqNqFjl)", "score": 2, "replies": [{"body": "What pronouns ru on", "score": 3, "replies": [{"body": "https://youtu.be/bMDlFn-NGKk", "score": 3, "replies": [{"body": "![gif](giphy|Jye2V32PdElu4cThqZ)", "score": 2, "replies": []}]}]}]}]}, {"body": "Fooked", "score": 3, "replies": [{"body": "fr", "score": 2, "replies": [{"body": "The ambassador of earth will save you", "score": 2, "replies": []}]}]}, {"body": "Pansexual", "score": 2, "replies": []}, {"body": "Are you a birthing person yet?", "score": 1, "replies": []}]}, {"body": "When was the last stable fsdbeta release? Looks like no one is even talking about it. \n\nAnd it will be done by year end.", "score": 2, "replies": [{"body": "143 days left, we jus checked", "score": 3, "replies": [{"body": "And minimum 60/90 days since last stable release. They keep rolling back. No one seems to be interested anymore, certainly not Elon.", "score": 0, "replies": []}]}, {"body": "![gif](giphy|xUA7aM09ByyR1w5YWc)\n\nYou believe Elon?", "score": 3, "replies": [{"body": "![gif](giphy|daPCSjwus6UR2JxRX1|downsized)", "score": 1, "replies": []}]}, {"body": "He told u it would be two steps fwd and four steps back", "score": 1, "replies": []}]}, {"body": "I don’t block anyone. I just don’t care about their posts or replies.", "score": 3, "replies": [{"body": "Are we friends again? 🥹", "score": 4, "replies": [{"body": "I want my superconductor.", "score": 6, "replies": [{"body": "Superconductor experience a brief period of it’s so over at the moment. To substitute we have now TSLA-99.", "score": 6, "replies": [{"body": "Maybe Wagner Group will open a superconductor research arm.", "score": 3, "replies": [{"body": "Or a submarineconductor", "score": 2, "replies": []}]}]}]}, {"body": "![gif](giphy|vsh3k3WCKX6ne)", "score": 5, "replies": []}]}]}, {"body": "![gif](giphy|xT8qBeEqnpdMbIbtVS)", "score": 2, "replies": []}, {"body": "PM probably F&G, been hurt too often to believe", "score": 1, "replies": [{"body": "who hurt you whiskey, open up to the lounge", "score": 6, "replies": [{"body": "I touched his no-no spot", "score": 6, "replies": [{"body": "show me where on this musk body pillow\n\nhttps://preview.redd.it/svbnb76heahb1.jpeg?width=640&format=pjpg&auto=webp&s=6c72f8ffd6977610681d82096e78b519c0691d36", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "![gif](giphy|K1YAcmDvKNj0IJF7pF)\n\nFound the getaway car after the violation", "score": 3, "replies": []}]}, {"body": "Bruh 😂🤣☠️", "score": 2, "replies": []}, {"body": "You know where", "score": 1, "replies": []}]}]}]}]}, {"body": "240-242 important area to hold, from there not much stopping points till 210s", "score": 1, "replies": [{"body": "Then it's an easy drop to 180 155 112 95 60 30 and zero. Yikes.", "score": 6, "replies": [{"body": "Can’t wait to buy at zero. I’ll buy the whole company", "score": 3, "replies": []}]}]}, {"body": "https://preview.redd.it/uczqnag64bhb1.jpeg?width=551&format=pjpg&auto=webp&s=6aa7bf1b9e0763140479b24e4152912835d5c57c", "score": 2, "replies": [{"body": "is that LK-99?", "score": 3, "replies": [{"body": "Yes… is not floating", "score": 3, "replies": []}]}]}, {"body": "A little relieve rally on the way", "score": 3, "replies": []}, {"body": "On the bright side, my GM puts (expiring in a week) finally went super green", "score": 2, "replies": []}, {"body": "Midday recovery was fake. Nasdaq wants red and us with it.", "score": 1, "replies": []}, {"body": "Once there was a boy, so keen and sly,\nWho claimed his car could drive, oh my!\nBut as he spoke of this futuristic feat,\nNo one believed him, they thought it a deceit.\n\nHe cried, \"Full self-driving, it's true, I swear!\"\nBut his friends rolled their eyes, they didn't care.\nFor autonomous cars seemed like a dream,\nA concept too far-fetched, or so it seemed.\n\nYet the boy persisted, his faith unwavering,\nIn a world where cars would be self-navigating.\nHe spoke of safety and convenience untold,\nA future where driving would be a story of old.\n\nAnd as time passed by, his words came true,\nFull self-driving cars became something to pursue.\nThe boy's vision became a reality,\nA testament to his unwavering mentality.\n\nSo remember, my friend, to dream with might,\nFor even the wildest dreams can take flight.\nBelieve in the possibilities yet unseen,\nAnd who knows what wonders the future may bring? 🚗✨", "score": 2, "replies": [{"body": "KanyeWest & Elon\n\n![gif](giphy|36VgLcuQu4dkQ)", "score": 2, "replies": [{"body": "![gif](giphy|vNU5PyxaM8bBu|downsized)", "score": 3, "replies": []}]}, {"body": "![gif](giphy|LyJ6KPlrFdKnK)", "score": 1, "replies": []}, {"body": "![gif](giphy|3o6nUWL35pYPDMXwPu)", "score": 1, "replies": []}, {"body": "pretty good effort", "score": 1, "replies": []}]}, {"body": "Eloncession\n\nhttps://preview.redd.it/eej5vt1pabhb1.jpeg?width=1125&format=pjpg&auto=webp&s=6f7d3b7fa88c4830c78d0b4047f990368ea6703c\n\nElon agrees.", "score": 2, "replies": [{"body": "https://twitter.com/elonmusk/status/1689253628274520066?t=4H5haX7bMON6QT3EiAysog&s=19", "score": 2, "replies": []}]}, {"body": "https://twitter.com/antifaoperative/status/1689330935169159172?s=42&t=dfw-r9DcxT8IJ4HkPLoGIw", "score": 0, "replies": [{"body": "I don't see how any person can take Republicans seriously anymore", "score": 4, "replies": [{"body": "When someone says he’s a “big tent Republican,” historically that means “I don’t actually have principles, I just want to suck up to politicians and gain power.”\n\nAnd I say this as someone who wishes that our political parties were more open to compromise.", "score": 2, "replies": [{"body": "\"big tent republican\" is just the name of the organization.\n\nRepublicans aren't a big tent party.\n\nThe real story here is the kiddy diddling.  Not a 'bothsides' things.\n\nAnd the compromise also isn't a bothsides thing. Shutdown/defaults are never a thing when it is a Republican president and Dem congress.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Prime time for dogging", "score": 1, "replies": []}]}, {"body": "I’ve seen this movie before. It ends with crawl.gif.", "score": 1, "replies": []}, {"body": "things started going bad when reddit wrecked my first post exploit with api changes\n\nnot sure we’re gonna recover from this. game over man", "score": 1, "replies": [{"body": "You weren't this first, nor the last, to gain control of first post. But to think that it was yours... is the peak of naivety", "score": 3, "replies": []}]}, {"body": "CPI days are the ultimate coin toss on market reaction. Especially now, with market trying to make up its mind is it \"low inflation, good Fed stops jerking up the economy\" or \"low inflation, are we heading into deflation and recession\"\n\nDon't try to make too much sense of daily moves", "score": 1, "replies": [{"body": "Yup sometimes all news is good news and sometimes all news is bad news. Depends on market psychology", "score": 3, "replies": []}]}, {"body": "Lmao a little pump then the dump", "score": 1, "replies": [{"body": "Hi Elon", "score": 2, "replies": []}]}, {"body": "Good face saving interview by Linda, buys her sometime. Didn’t answer how can she can stop Elon from being maga conspiracy theorist and alienating other side of aisle.\n\nMaybe she can also start doing tesla earning calls. Much better then what we have today.", "score": -2, "replies": [{"body": "😢👶", "score": 5, "replies": []}, {"body": "Petition for Linda to be Tesla CEO", "score": 2, "replies": []}, {"body": "Any day now Linda will post to her linkedin page \"This morning X has announced that I've stepped down from my role as CEO.....\"", "score": 2, "replies": [{"body": "\"X has decided that I should step back and spend more time with my family\"", "score": 4, "replies": [{"body": "\"Elon has decided that I should bear children and will be assuming my duties at X\"", "score": 5, "replies": []}]}]}, {"body": "Nothing can stop that", "score": 0, "replies": []}]}, {"body": "Tesla shares pares earlier gains after X CEO interview on cnbc. Linda did not provide details on how she is planning to handle Elon shenanigans on the platform.", "score": 0, "replies": [{"body": "![gif](giphy|LSQtUxNHaupcd0a9d8)", "score": 3, "replies": []}, {"body": "meta shares pares early gains after X CEO interview on cnbc suggesting threads is struggling to take users away from the platform", "score": 2, "replies": []}]}, {"body": "![gif](giphy|nhtx46VNV5z5aBExl2)", "score": -1, "replies": []}, {"body": "Seems today morning is related to china and semiconductors 🙄", "score": 0, "replies": []}, {"body": "Any woman who must say I am the ceo, is no true ceo.", "score": -12, "replies": []}, {"body": "🤡🤡🤡", "score": 0, "replies": []}, {"body": "Chicken was right", "score": -6, "replies": [{"body": "eh\n\nhe shorted from ~$300 down to ~$250, and then re-entered ~$140, and then changed his mind.  He completely missed $105 to $295.", "score": 1, "replies": []}, {"body": "True", "score": 1, "replies": []}]}, {"body": "Eloncession\n\n![gif](giphy|GJNHQcSkxLq48)", "score": -8, "replies": [{"body": "High Interest Rates = High Car Payments\n\nHigh Car Payments = Either Lower Prices of Cars or Sell Less Cars\n\nAdditionally, Macro sentiment is a big factor.\n\nAlso volatility + options manipulate the price.\n\nElon has little to do with current stock price movements 🤷🏻‍♂️", "score": 8, "replies": [{"body": "You forgot “i don’t care”", "score": 1, "replies": []}]}, {"body": "If you keep blaming Elon every time stock goes down, no one will listen when he is really causing stock to go down. There's a story about this, it's called the boy who cried fsd.", "score": 12, "replies": [{"body": "EOY", "score": 1, "replies": []}]}, {"body": "Alt 🥱", "score": 5, "replies": []}]}, {"body": "![gif](giphy|Yavo0SXhZYhSo)\n\nPM real", "score": 1, "replies": []}, {"body": "https://www.cnbc.com/quotes/US2Y", "score": 1, "replies": [{"body": "What does it mean?", "score": 1, "replies": [{"body": "People selling and moving to cash.", "score": 1, "replies": []}]}]}]}
{"title": "How is UPS not crashing right now?", "selftext": "Let me get these numbers right, \n\nUPS is investing $30b into employee salary and benefits over 5 years. \n\nUPS has $9b cash on hand. \n\nScratching my head on this one. How is UPS affording these raises? They are going to have to take on extra debt or sell shares. They make $10b/year profit. They are going to have to spend $6b/year just for the employees. **They just cut their profit by 60%**. Am I missing something? And these costs will go up after 5 years, you'll have a much higher percentage of employees sitting at 5+ years and higher percentage of full time employees (that's what happens when you offer $170k for a job that requires no education). \n\nSeems to me like UPS deserves a 50% correction. Am I wrong?\n\nEDIT: to all you dumb regards saying \"HAHA YOU BOUGHT PUTS AMIRITE????\" stfu. I literally don't have **any** positions in the market, and I am broke AF and won't be investing any time in the near future. You know when can have a negative outlook on a company without buying risky investments at the same time right?\n\n> Seems to me like UPS deserves a 50% correction. Am I wrong?\n\nThis is an open ended question and the post is tagged as 'discussion'. Some of you need to grow the fuck up and learn to read.\n\nAnd stop treating this like some DD. It's not. I saw a few numbers, had a few thoughts, and threw them down, and asked a question. This post reflects my initial thoughts on the matter. That's it. $30b over 5 years seemed like a fuck ton, but as pointed out to me, UPS already spends $44b/year on employees, so if that's the case then $30b over 5 years isn't that much. Done. My question answered. I asked, \"Am I wrong?\" answer is yes because I was missing some context. HOLY SHIT I WAS WRONG? idgaf. This was a question I posted out of curiosity. I'm not even in the fucking market.\n\nEDIT 2: as some have pointed out, $170k is including benefits, and at 60 hours/week. Totally different than what I assumed, which is what my entire question was based on.\n\n**LAST EDIT** No need to comment on this anymore you regards. $170k figure was wrong. It's $120k + benefits, and that's at 60 hours a week. Totally different story. I think that's reasonable and maybe only 5-10% higher than I would have thought. UPS will be fine. Calm down.", "id": "15n09cn", "created_utc": 1691636637.0, "score": 32, "upvote_ratio": 0.55, "num_comments": 280, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|2 years ago\n**Total Comments**|1058|**Previous Best DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "UPS already was spending $48B a year in employee compensation by 2022. And they had $13.3B in profits that year. So they won't need any additional financing. Their profits should cover this and then some. \n\nThat $30B in additional costs is *cumulative* over those 5 years. So that only amounts to about a 4% increase per year. Part time workers will go from $20/hr to $23/hr in 5 years time, an increase of 15% in that time (about 2.9% annualized) while the highest paid full time workers will get a $7.50 increase to $49/hr, an increase of 18% in that time (about 3.4% annualized).  \n\nAre you for some reason assuming that revenues won't increase too? If revenues also increase ~ 4% annually, profits could also continue to increase for shareholders.", "score": 195, "replies": [{"body": "You can't just do math on sub dedicated to finance... and making money.\n\nMath makes large things look smaller or small things look larger. And frankly that messes with our per-contrived notions. \n\nAnd good sir that won't stand because it proves that we're wrong on many things that we spent very little time thinking up in the first place... and no substantive evidence to back it up!! \n\nSomeone get the SHAME BELL!\n\nWITCH CRAFT I SAY!!", "score": 13, "replies": [{"body": "Math is how they get you", "score": 4, "replies": []}]}, {"body": "> UPS already was spending $48B a year in employee compensation by 2022\n\nSo they are increasing that to $54b. By that metric, you're right it doesn't seem like a lot.", "score": 29, "replies": [{"body": "anyway if they are making 10b profit a year\n\nand they commit to 30b spend over 5 years \n\nthats 6b a year. they can accommodate that from their profit.\n\nwhy did u think they would have to raise capital or get a loan? curious\n\ndid u think it was 30b a year for the next 5 years?", "score": 23, "replies": [{"body": "In reality… the OP doesn’t understand math lol", "score": 46, "replies": []}, {"body": "Also, that $30b isn't spread evenly through the contract.  A large portion of it is up front, but that is really not as much as it seems.  A lot of those up front raises will not matter, as there are a lot of workers who already make more than the contract rates.  Then raises are small until the last year, where another large portion comes from.\n\nSo that $30b isn't going to be a real issue until 2028.", "score": 1, "replies": []}]}, {"body": "Yes. In reality, I expect it will likely be more like $51B in the first year, but $58B by 2027. But you will have inflation every year too.", "score": 4, "replies": []}]}, {"body": "Idk how much of UPS profit came from amazon but i think that will shrink.", "score": 2, "replies": []}, {"body": "It's not really $30B either adjusted for inflation and the deal being bottom heavy towards the later portion it's most likely structured so that it represents about $15-$20 billion in current capital value.", "score": 2, "replies": []}, {"body": "Are you assuming OP has the brain cells to read, let alone understand, what you just said?  You’re dealing with a true regard here.  Gotta talk to them like they are 2.", "score": 12, "replies": [{"body": "Little PP energy right here", "score": -21, "replies": []}]}]}, {"body": "I feel like OP couldn't get hired at UPS, so he is trying to get his revenge on WSB", "score": 86, "replies": [{"body": "OP it's mad that somebody with no education makes three times what he does sitting on his ass at the house.", "score": 21, "replies": [{"body": "3 x 0 is still 0", "score": 9, "replies": []}]}, {"body": "I make plenty working off my ass at home thank you very much.", "score": -61, "replies": [{"body": "On one hand you have no skin in the game because you are broke and on the other you make plenty 🥸", "score": 55, "replies": [{"body": "We all lie to ourselves…", "score": 10, "replies": [{"body": "all is cope 😐", "score": 3, "replies": []}]}, {"body": "I like how people think it is unfathomable to have high income but high expenses and a small bank account. None of these things contradict each other. \n\nRent + child support is over $4k/month. I'm also paying off a lot of debt. Get bent.", "score": -11, "replies": [{"body": "You suck eggs", "score": 1, "replies": [{"body": "No I just bite them but ok.", "score": -1, "replies": []}]}]}]}, {"body": "You literally said in your edit that you’re broke AF….\n\nWhich is it?", "score": 3, "replies": [{"body": "I am broke but have good income. Not complicated. My bank account is small but weekly income is high. Paying off a lot of debt.", "score": -12, "replies": [{"body": "Lol", "score": 3, "replies": [{"body": "Nice user name", "score": -2, "replies": []}]}, {"body": "Why do you have so much debt if you work from home and have good income? Actually curious\n\nYou don’t have a 401k?", "score": 2, "replies": [{"body": "> You don’t have a 401k?\n\ndivorce was expensive, opened a business I thought had potential but it never took off and accumulated debt during that time and went back to my profession but the business I tried to start cost me a lot more than I thought it would, still kind of paying for those mistakes. Paid off like $30k in debt this year.", "score": 4, "replies": [{"body": "Now I’m really curious. What was the business?", "score": 1, "replies": [{"body": "it was online retail. It was doing well for a while. I was making about 30-40% less than I would have if I had gone back to being a developer, but I thought the business had potential. Turns out I am far too disorganized to run a real business, and need a shit load more capital and time and better employees to make it work. I also was doing pre-orders on some large ticket items that became almost impossible to fulfill (way too custom). It also made me think I was making more than I was because I was only paying for some parts when I would get an order. Basically I took 2 years off of work but it should have been 1 year max. That second year really put me in a bind and I had to borrow some money etc to make ends meet. I dragged ass going back to full time position and I'm paying for it now. I'm very happy that I learned a niche programming language like Scala because it pays really well, unfortunately it's going to be another year before I get to the point where I can actually start saving up some money.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "But don't have enough to have investments? Better get back to work ![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "Obviously not or you wouldnt be broke af and not in the market any time soon because of it. Your words, paraphrased", "score": 1, "replies": [{"body": "income =/= wealth you regard", "score": 1, "replies": []}]}]}, {"body": "👍", "score": 1, "replies": []}]}, {"body": "They avoided a long drawn out strike which would have been bad for the stock.\n\nIf they can't raise rates enough to cover their higher expenses or lose market share to fedex /DHL then their earnings will suck in 2 quarters - then you will see a drop in their stock.", "score": 16, "replies": [{"body": "correct, as of now the market is rewarding stability", "score": 7, "replies": []}, {"body": "the stock didn't even really sell during negotiations tho\n\nmarket is just completely ignoring the fact that UPS has major headwinds. Market ignores shit all the time blah blah irrational longer than u can stay solvent", "score": 3, "replies": []}]}, {"body": "someone bought puts", "score": 103, "replies": [{"body": "A lot of regards bought puts lol. They think UPS will crash the entire US economy with it.", "score": 23, "replies": []}, {"body": "![img](emote|t5_2th52|4258)", "score": 9, "replies": []}, {"body": "😂 agitating bastard.  Bravo", "score": 1, "replies": []}, {"body": "I have no skin in the game\n\nedit: there a reason I'm being downvoted for saying that I don't have a position in the market? I don't have **any** position in the market. Doesn't mean I'm not curious about it or that I don't follow. Wtf is wrong with you people?", "score": -36, "replies": [{"body": "No.  You have no skin, and you have no game.", "score": 26, "replies": []}, {"body": "The rule was always positions or ban. If you aren’t holding, you don’t get to talk shit. Fuck off with your meaningless FUD.", "score": 9, "replies": [{"body": "Rule is positions or ban. \n\nI have no positions. \n\nThere is no rule that you cannot post fucking **DISCUSSION** posts without a position. Go home you gatekeeping douchebag.", "score": -7, "replies": []}]}]}]}, {"body": "They are going to raise rates across the board 10% minimum and FedEx will follow. There is a monopoly and nobody has a choice you have to ship with the big 3 . They all raise and lower prices in unison", "score": 43, "replies": [{"body": "Good point", "score": 4, "replies": []}, {"body": "Amazon will as well.", "score": 2, "replies": []}]}, {"body": "Good for the employees", "score": 36, "replies": [{"body": "didn't say it wasn't", "score": -16, "replies": []}]}, {"body": "This is the dumbest \"fundamental\" analysis I have ever read.", "score": 37, "replies": [{"body": "I'm asking an open ended question and making some very basic assumptions. This isn't a comprehensive fundamental analysis.", "score": 8, "replies": []}, {"body": "Top 5 all time for sure.", "score": 0, "replies": []}]}, {"body": "Obviously they aren’t going to keep their prices static. USPS is already drastically reducing air freight which ups stands to gain from. They’ll be pretty okay, unfortunately this is what keeps the inflation train in motion.", "score": 20, "replies": [{"body": "UPS raises their rates annually.", "score": 3, "replies": []}]}, {"body": "Number skills good enough to land you a job UPS route dispatching.  The $30b is the total value of the new contract.  It is not $30b in new expenses.  For instance as a driver I’m going from $145,000 pay and benefits to $170,00 pay and benefits.  Your numbers make it look like I’m getting a $170,000 raise.", "score": 20, "replies": [{"body": "145k pay and benefits is still a lot! Where do I sign up?", "score": 2, "replies": [{"body": "At UPS", "score": 2, "replies": []}, {"body": "That numbers based on a 60 hour week though.", "score": 1, "replies": []}]}, {"body": "> Your numbers make it look like I’m getting a $170,000 raise.\n\nno that's just you not understanding numbers. They are investing an additional $30b into their employees, on top of whatever they were going to spend. employees after 5 years will be making $170k + benefits.", "score": -1, "replies": [{"body": "Well, apparently I’m wrong and shouldn’t make snarky comments late at night,  but the $170k is including benefits.", "score": 8, "replies": [{"body": "It’s not including benefits. Do the math. 49x60x52.", "score": 1, "replies": [{"body": "By the time you are hitting the top rate a 60hr week is an outlier 40-50 is more like it.  Maybe you could read like every article out there that quotes the CEO during the earnings call where she explicitly stated that it was $170,000 in pay and benefits.  Could you hit $170,000 working 60hrs a week, sure but most if not nearly all drivers will not.", "score": 1, "replies": [{"body": "If you want 60 hours you can get 60 hours", "score": 1, "replies": [{"body": "I can’t get 60 hours.  A lot of the drivers at my center aren’t even working five days a week and they get to be the first ones to pick up a Saturday shift.", "score": 1, "replies": []}]}]}]}]}, {"body": "No the benefits are included. 49$ an hour is 100k a year.", "score": 2, "replies": [{"body": "I could be wrong and need to re-read, but I understand that as current salary, not salary in 5 years.", "score": -1, "replies": []}, {"body": "We work 60 hrs a week", "score": 1, "replies": [{"body": "We?", "score": 1, "replies": [{"body": "Yes bud", "score": 1, "replies": [{"body": "I dont", "score": 1, "replies": [{"body": "You seem a bit fucking daft.", "score": 1, "replies": [{"body": "You need to file", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I thought this was satire at first.  It is not.  OP is dumb.  Wow.", "score": 15, "replies": []}, {"body": "So you came to a casino Reddit to complain that a company was giving people with \"no education\" a high salary then you're getting, which you were so convinced was unimaginable that it would have shattered their share price.\nLooks like you're the one with no education here.", "score": 11, "replies": [{"body": "> you were so convinced\n\nStop projecting your previous giant losses onto a stranger on the internet. I read news, had some thoughts, and asked a question. Everything else is some made up narrative that you find entertaining. I saw news, saw a few numbers, looked at the stock and saw it didn't crash, and was puzzled. You want to give me shit for that, that's fine. But that's the story. Sorry it doesn't involve me losing thousands on options or my wife's boyfriend.", "score": -2, "replies": []}]}, {"body": "Their employees are the business?  This ain't no party.  This ain't no disco.  This ain't no foolin around.", "score": 21, "replies": [{"body": "> Their employees are the business?\n\n? What? The business is delivery. You can do that with any people. Their employees are the people they are using to accomplish their business.", "score": -5, "replies": [{"body": "Take a closer look at their management team, their supervisors, their leads, their drivers.\n\nCompare with FedEx, which like Amazon is a package company that outsources end delivery to contractors.\n\nUPS is not a package company.  It is a delivery company.", "score": 10, "replies": [{"body": "Yes it is a delivery company. Employees are a means to an end. One day they'll be mostly robots. The employees are not the business by any stretch of imagination. You can only say something like that in maybe the film industry, or in sports, where the employees (actors/athletes) are literally the centerpiece of the business.", "score": 0, "replies": [{"body": "Wow really stupid comment right here. Workplace culture is incredibly important for every business, and that’s cultivated by the employees. Almost every business is it’s employees and the fact you think differently confirms you’re incredibly regarded.", "score": 1, "replies": [{"body": "I don't know if OP's comment is stupid, but UPS has a very specific business model and OP has not researched it.", "score": 1, "replies": [{"body": "You don’t know if employees are important in more than the sports industry? You wanna jump on that idiot train? Lmfao ok", "score": 1, "replies": [{"body": "I guess I just meant that there are some industries in which the workers are replaceable or disposable.  FedEx and Amazon for example typically use contractors to make the deliveries.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 25, "replies": [{"body": "I don't buy shit I'm broke.", "score": 2, "replies": [{"body": ">I make plenty working off my ass at home thank you very much.\n\n*...and then...*\n\n>I don't buy shit I'm broke.\n\nWould you care to reconcile these statements?", "score": 16, "replies": [{"body": "Yeah it's called paying off debt and being divorced. I make a good salary in the six figures, doesn't mean my net cashflow is good. \n\nBut why am I justifying myself to some wsb regard who thinks he's a detective?", "score": 6, "replies": [{"body": "Your poverty sounds distressing, no wonder you are so bitter regarding the pay and benefit packages of others.  It's not a good look.", "score": 14, "replies": []}]}]}, {"body": "Robinhood is free…", "score": 1, "replies": [{"body": "Buying stocks isn't... what a stupid comment.", "score": 0, "replies": [{"body": "Fractional shares stupid… find some soda cans, turn them in. Trade a paper clip “up to” a house. You’re only poor because you’re stupid. And you’re stupid because you’re poor.", "score": 2, "replies": [{"body": "What's a 30% gain on a fractional share? \n\nPlease.", "score": 0, "replies": []}]}]}]}]}]}, {"body": ">You are correct that UPS will have to take on extra debt or sell shares in order to finance the employee raises. However, they are still profitable and should be able to afford the additional costs. It is possible that their stock price could drop by 50% if investors become concerned about their ability to continue being profitable, but I do not think this is likely.", "score": 24, "replies": [{"body": "Shutup", "score": -67, "replies": [{"body": "How dare you talk to the visual mod like that! 🐻", "score": 36, "replies": [{"body": "No u", "score": -11, "replies": []}]}]}]}, {"body": "You're cherry picking your facts\n\nHigher wages doesn't necessarily mean lower margins.\n\nIt's a well managed well ran company. They make fed ex look like a shit show because it's so much better ran and they gave actually employees not just sub contractors like fed ex. Employee retention will be better and they'll continue to take market share. Yellow just went bankrupt and they provided a lot of LTL trucking service which is UPS bread and butter.\n\nThey'll probably automate more in their distribution centers.\n\nOnline purchasing will only expand for a while\n\nBasically you fucked up buying puts on one of the best companies in the world that's pivotal to how retail gets sold.", "score": 15, "replies": [{"body": "> Basically you fucked up buying puts\n\noh shut the fuck up. My goodness. The amount of people who see someone say something positive or negative about a company and then follow it up with \"HAHAH YOU BOUGHT PUTS/CALLS!\". Stupid, and not original. And I don't have any invested, and at this point I'm not dumb enough to throw my money away on options. \n\nBy the way, in their own guidance, they said they would be making less profits. \n\nAnd I asked a fucking question. This post is tagged as discussion. This wasn't a well researched DD by someone trying to pump puts/calls. Grow up.", "score": 3, "replies": [{"body": "Look it's okay if your a gay bear a lot of people on this sub just like you bought puts , especially on UPS, being the gay bear they are and now are giving out handies behind the Wendy's dumpster because they are too regarded enough to realize the market is forward looking.\n\nYour puts you bought didn't take into account the fact that AI is going to get rid of a lot of the roles they are paying employees for and now they also avoided a strike which is bullish . They are also gonna increase the prices . And the 30 billion increase is over 5 years not one year. So that's 6 billion a year and they can just keep issuing more debt like the rest of the companies and keep increasing prices faster cause only 2 companies do like 90% of the mail.\n\nTL:DR- Don't be a gay bear and buy puts. Buy calls on UPS cause they now have improved their monopoly and will increase prices more , thus getting more profits", "score": 12, "replies": [{"body": "> Look it's okay if your a gay bear\n\nyou're*\n\n> just like you bought puts\n\nI asked a question about a stock. I didn't buy puts on this stock, or any other stock. Only thing I've bought in the past year are calls on TSLA. \n\n> AI is going to get rid of a lot of the roles they are paying employees for and now\n\nAI can't carry a package\n\n> They are also gonna increase the prices\n\nFair point as others have made. \n\n> 30 billion increase is over 5 years not one year\n\nI never said it was over one year. I don't know why people feel like they need to point this out. \n\n> your a gay bear \n\nYou're projecting.", "score": -1, "replies": [{"body": "lol no wonder your wife fucks tyrone in your bed. You make dumb investments and lie to everyone. Why don't you fix your life before you post on here. Or are you a cuck that likes it when tyrone fucks your wife hard?", "score": 8, "replies": []}, {"body": "Your this mad because your wife boyfriend who sold you those worthless puts is chilling \n\nSecondly all they gotta do is say AI and it'll go up. UPS said in their earnings call their gonna automate the fuck out of everything and then after dropping 5% they said AI and automation and it popped up 6% after that.\n\nAlso Ai can carry packages . Self driving cars can deliver packages with programmable robots that deliver the package to your hand . For example after your massive UPS loss you had the Robot can hand deliver lube and a dildo for the massive reckoning that would come from your wife boyfriend . This is an example of how Ai can change the game", "score": 3, "replies": [{"body": "> Your this mad because \n\nyou're*\n\n> who sold you those worthless puts is chilling\n\nI'm not in the market\n\n> with programmable robots\n\nWe are 5-10 years from that. Not even part of the equation now. \n\n> For example after your massive UPS loss you had the Robot can hand deliver lube and a dildo for the massive reckoning that would come from your wife boyfriend \n\nThe whole sexual joke wife's boyfriend thing is so fucking old at this point. Tell me you have no creativity without telling me you have no creativity.", "score": 0, "replies": []}]}]}]}, {"body": ">I'm not dumb enough to throw my money away on options.\n\nThen why are you here?\n\nr/investing is 👉", "score": 3, "replies": []}, {"body": "Bro the company invests in their employees. Not many companies do that these days. Why would you bet against them?", "score": 1, "replies": [{"body": "Invest in robots", "score": 1, "replies": []}]}]}]}, {"body": "If you are broke AF seems like you can make $170k easily by applying to UPS, also short it that way you can make double income. ![img](emote|t5_2th52|18630)", "score": 5, "replies": [{"body": "That would take 5 years of manual labor to get there. I'll be making far more in my own profession by then. And no profession is safe long term anyway, given AI / robots. \n\nBut if I had a job making $60k, I would definitely consider it.", "score": 1, "replies": []}]}, {"body": "Because the investors realize that paying labor adequately is a legitimate cost of doing business and the stock price reflects that?", "score": 21, "replies": [{"body": "$170k for a delivery driver is well beyond adequate. That's 5th year software engineer level pay. If I was an investor, I'd be pissed AF that they just threw this kind of money at employees that are not particularly difficult to train and do not require difficult training or expertise/degree. I understand paying well for retention and so employees will do a better job, but this seems like overpayment by at least 50%", "score": -27, "replies": [{"body": "Man Software engineers sure do think a lot of themselves", "score": 37, "replies": [{"body": "i cant wait until AI displaces the vast majority of them. most of them dont do all that much but act like they are gods gift to mankind.", "score": 6, "replies": []}, {"body": "As do side walk cleaners and power washers on YouTube.", "score": 6, "replies": []}]}, {"body": "You realize it's not the mental difficulty of the job that's the problem right? It's actual backbreaking work where you start early, get home late, and work ALL holidays. You lift hundreds of packages that can weigh a 100+ pounds each driving around in metal box trucks with no AC in 105 degree weather. You try to do it and say you don't deserve good compensation for it.", "score": 24, "replies": [{"body": "$80k would be VERY good compensation for something like that. Most jobs that are physically demanding but require no degree or real training pay around that much. Even jobs that are physically demanding and have higher rates of injury and death don't pay anywhere near $170k. \n\nThat's fine. UPS jobs will now be the most coveted jobs in the country, hands down. No other manual labor job will compare.", "score": 0, "replies": [{"body": "You seem bitter. Also; who cares what you believe to be fair compensation?  UPS, Labour and Mr. Market have each come to the conclusion that this new package is fine.", "score": 8, "replies": []}]}]}, {"body": "I’d love to see this guy be a driver.", "score": 12, "replies": [{"body": "Yeah me too I could have skipped college and my entire professional career.", "score": 3, "replies": [{"body": ">I don't buy shit I'm broke.\n\nDoesn't sound like your career paid off.", "score": 13, "replies": []}]}]}, {"body": "You need to learn more about this. It's not like $170K is the starting salary, and it's not as if many (or even any) of the drivers will actually make that figure. Try educating yourself a bit more. And dump those puts. Don't be a long-term bag holder.", "score": 28, "replies": [{"body": "This is the way ^ there is a minimum years worked to even be considered for this level of compensation. Also probably assumes OT + benefits (which are not cheap) in the total figure", "score": 8, "replies": [{"body": "That total figure includes benefits such as healthcare and pension.", "score": 1, "replies": []}]}, {"body": "> It's not like $170K is the starting salary\n\nit's the salary after 5 years", "score": 0, "replies": []}]}, {"body": "Ahhhh, he’s an entitled tech bro who is jealous.  And he’s also a moron.  Now this all makes sense.", "score": 16, "replies": [{"body": "It's just a waste, you can get high loyalty good quality employees at the $80-$100k range. You forget the type of person who wants to work full time for UPS delivering is not someone with a degree. That's all I'm saying.", "score": -2, "replies": [{"body": "Let me guess, you got a 4-year degree in chemical engineering that you don’t use when you code for AirBNB and hearing this news makes your entitled and unworthy butthole sore?", "score": 13, "replies": [{"body": "CS degree buddy and I will work from home for the next 10 years thank you very much\n\nedit: looking at your comment history and wow you're grade-A troll douchebag and your only posts are on ALPP lol. You're a loser trolling people and not adding a damn thing to this sub. I put myself out there and open up a discussion, you're just an ass. Blocked.", "score": 5, "replies": [{"body": "Maybe UPS will deliver you your unemployment checks in 10 years.", "score": 14, "replies": []}]}]}, {"body": "You should tell UPS management, im sure they haven't done much research on this, but you seem to have it figured out!", "score": 4, "replies": []}, {"body": "Block Warning", "score": 4, "replies": [{"body": "?", "score": 2, "replies": []}]}]}]}, {"body": "Don't forget that a lot of these guys are working 12-14 hours a day every single day.", "score": 9, "replies": []}, {"body": "Stfu bear", "score": 10, "replies": [{"body": "Blocked for your stupid comment. I'm allowed to believe a stock will go down you asshat.", "score": 3, "replies": []}]}, {"body": "Jesus Christ just how bitter and entitled can a person be.", "score": 2, "replies": []}]}, {"body": "The top 3 investors don't care about profit, though.  They care more about ESG\n\n[https://www.investopedia.com/articles/insights/060816/top-4-ups-shareholders-ups.asp](https://www.investopedia.com/articles/insights/060816/top-4-ups-shareholders-ups.asp)\n\nIf you idiots REALLY want to know which companies will do well, track the companies owned by these guys, and bet high on the ones with the highest ESG scores.", "score": -2, "replies": [{"body": "ESG scores are a scam and if I would follow your advice I'd be broke end of year. Don't listen to this guy. He has a history of making bad investments and deleting his posts. PLTR 19$ amiright? He also thinks Soros boy runs the world. Look at his profile and his R/conspiracy posts.", "score": 4, "replies": []}]}]}, {"body": "I knew something must be in the works. Last week, they actually dropped one of my packages at my actual address. The training investment is already paying off! Who knows, maybe next week I won't have to call some cross-town rando to let them know their package was left at my house. Again.", "score": 7, "replies": [{"body": "The training investment is just a dozen safety messages that annoy the hell out of drivers each day. It's a waste of time and no actual money being spent.", "score": 1, "replies": []}, {"body": "Had a tire mark across it though?", "score": 1, "replies": []}]}, {"body": "You guys are so regarded. How many times should we tell you? You bought puts? They will not dump eet until all your puts expire worthless.", "score": 3, "replies": [{"body": "I don't have any money I'm not buying jack shit right now.", "score": 0, "replies": [{"body": "Tell the rest of your friends to stop shorting boomer stocks. There’s plenty of crap like UPST, all SaaS stocks and most of semi stocks that are suited for gap downs in the next 2 weeks. Ya’ll need to stop playing with boomer plays.", "score": 3, "replies": [{"body": "Stop projecting. I'm not buying options.", "score": 1, "replies": []}]}]}]}, {"body": "Wow. This kind of mentality is precisely why the middle and lower classes are being decimated. You don't want people to get fair compensation for their labor because your sTonKs wiLL Go down? Pathetic. This is great for the workers and I'm happy for them. UPS makes money hand over fist off the backs of their drivers and distribution center employees.", "score": 13, "replies": [{"body": "A few years back, the media smugly declared that coal miners should learn to code. In 2023, the unemployed coders should learn to deliver packages.", "score": 12, "replies": [{"body": ">  In 2023, the unemployed coders should learn to deliver packages.\n\nLol... good thing is that it doesn't take much to learn how to deliver a package.", "score": 1, "replies": [{"body": "Yeah,  but do you even lift, bro?", "score": 8, "replies": []}]}]}, {"body": ">  fair compensation for their labor\n\n$170k/year is well beyond fair compensation for a job that does not require significant training or a degree.", "score": 2, "replies": [{"body": "Keep in mind\n\n* A lot of goods in those trucks - don't pay drivers enough and those goods have a funny way of not making their way to their destination\n* Physically demanding - significant chance of acute and/or chronic injuries\n* Driving those big UPS trucks is not a trivial matter, especially given the aforementioned physical nature of the job\n* They have to excel at efficiency - they aren't just taking leisurely drives around the neighborhood\n* They often contend with the elements using trucks with little or no features to mitigate heat for example\n* High pay usually translates to less turnover. Tenured employees are typically going to be much more efficient than newbies\n* There's no dubious value proposition to their work. They are literally essential to the operations\n\nIs 170k including benefits beyond fair compensation? Perhaps, but this is a marketplace and when demand is high, wages go higher. Not to mention that this is something of a mea culpa for the deplorable position they took where they said that installing climate controls on their vehicles was not feasible.\n\nIf anyone is going to get overpaid I'd rather see delivery drivers getting it rather than some greasy underperforming CEO or SM Influencer", "score": 9, "replies": [{"body": "When I say it is well beyond fair, it seems to me that after a certain price, you have diminishing returns. Your turnover rate is likely not going to change much when going from $120k -> $170k. A UPS driver with a few years experience is not going to be qualified to leave for a job that pays more than $120k. Likely they won't even be able to replace that salary. I would argue this also applies to quality of work. \n\n> There's no dubious value proposition to their work. They are literally essential to the operations\n\nYou do not get paid for 'value'. You get paid based on how difficulty of replacement. Cashiers are literally critical to business operations of a grocery chain. They don't get paid $150k because they can be easily replaced. \n\n> Is 170k including benefits beyond fair compensation? Perhaps, but this is a marketplace and when demand is high, wages go higher.\n\nIt's pretty obvious the salary is a reflection of good negotiating tactics. Strike would tank the stock and screw economy. It's a bit of a hostage negotiation situation, hence why high salaries were agreed to. \n\n> the deplorable position they took where they said that installing climate controls on their vehicles was not feasible\n\nYeah I'm scratching my head on that one.", "score": 0, "replies": [{"body": "The impression I had was the 170k was including all benefits and included a ton of OT like working 60-80 hour weeks, and was also for the more senior and experienced drivers. Like that was the top range, not the 40 hour a week average.", "score": 3, "replies": [{"body": "From the way I read it, this is how much you'll get paid if you hang around for 5 years, and does not include benefits. I could be wrong, which again, is the whole reason I made this post. To find out if I'm missing something or wrong about my assumptions...", "score": 0, "replies": [{"body": "The 170,000 number is a 60 hour workweek including benefits in 5 years. Currently are paid around 41 a hour and will be at 49 in 5 years", "score": 1, "replies": [{"body": "Yeah this is the answer. 170k @ 60 hours and that's including benefits is completely different than $170k + benefits @ 40 hours. This makes a lot more sense.", "score": 2, "replies": []}]}]}, {"body": "170k before benefits but 60 hrs a week", "score": 1, "replies": []}]}, {"body": "That is not how this works", "score": 1, "replies": []}, {"body": "The difference between a UPS driver and a cashier is one is unionized and the other isnt.", "score": 1, "replies": []}]}]}, {"body": "Being a UPS driver is a hard job and it has a huge line of people waiting to do it. That’s why they are high paid.", "score": 1, "replies": []}]}]}, {"body": "What you deserve is a fat dildo UPS ya ass buddy", "score": 5, "replies": []}, {"body": "The cost will be passed onto consumers over the coming years.", "score": 4, "replies": [{"body": "This has been brought up a bunch, but it doesn’t negate the point.\n\nEven with a perfect duopoly (two firms), they would both increase wages perfectly to offset this cost (other firm would undercut and gain market share). But shipping isn’t in fact a duopoly. You’ve got the USPS, which puts a price ceiling on what you can charge in some markets, meaning UPS would lose some FCF.\n\nDid I miss something?", "score": 2, "replies": [{"body": "No, they will pass the cost onto the retailers and the retailers will pass the cost onto the consumer. They will still offer “free shipping” however input costs are baked into the merchandise price.", "score": 1, "replies": [{"body": "Said so matter of factly. My point is that even in a monopoly this isn’t a true statement. In no world does: my cost goes up by X (and not my competitors) so your cost also goes up by X", "score": 1, "replies": [{"body": "The cost is going from $145k to $170k per driver over the next 5yrs. Competitions will follow suit and level the playing field. Market share gained or lost will be margin. I understand what you’re saying but it’s just not how the free markets operate.", "score": 1, "replies": []}]}]}]}, {"body": "yeah I think this is one of the main points I didn't consider when I scribbled this post together", "score": 0, "replies": []}]}, {"body": "Because it’s balls smell like cheese", "score": 2, "replies": []}, {"body": "Because getting my single order of natural berry shampoo in two days is of vital importance 🤣", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Key words are \"over 5 years\" fucking duh", "score": 2, "replies": [{"body": "$30b is like 3 full years of profits is my point...", "score": 1, "replies": [{"body": "lol you have no clue", "score": 3, "replies": []}, {"body": "You are far too highly regarded to be having this conversation.", "score": 2, "replies": []}]}]}, {"body": "Making 6 figures and sitting on thier ass and broke. Must be only fans.", "score": 2, "replies": [{"body": "Fact majority of people attempting to make a career on OF make very little money.", "score": 2, "replies": []}]}, {"body": "Math not a strong subject for you? Get ready for alot more as the working middle class in this country has been left behind by corporations that have enjoyed bigger profits and bloated executive compensation. People complain about being able to survive and own a home today. Well this is how that gets turned around a good wage for a job well done. And UPS is a profitable company BECAUSE of their employees. Blue collar will be the new economic powerhouse in our country again. And watch the same people who complain about immigrants coming to our country will be begging for their cheap labor in 5 years.", "score": 2, "replies": [{"body": "> Math not a strong subject for you? Get ready for alot more\n\nFollows up by providing zero math\n\n>  UPS is a profitable company BECAUSE of their employees. Blue collar will be the new economic powerhouse in our country again\n\nWill be replaced by robots within 20 years but ok.", "score": 0, "replies": []}]}, {"body": "UPS driver here.  170k is the total compensation at contract ending 2028. It's around 110k salary Cadillac medical ( nothing deducted from salary, no deductible full medical ride for the entire family)  and our pension.  35 years driving is around 4500 a month fully funded by UPS. No 401k match because of pension.  \n\nYou say we are over compensated for having no education. Our weight limit is 150 pounds and deliver to 3rd floor Apts. We do 200 stops a day 12+ hour days . Routes can exceed 400 packages delivered and 400 packages picked up all in extreme conditions.  115 heat index or sub Temps and frozen roads. Conditions so extreme death is a possibility if your not careful not including the risk of driving all day and at risk of accidents on the road. Drivers have committed suicide under the pressure the company puts on them. It is in no way shape or form an easy job or walk in the park", "score": 2, "replies": [{"body": "> UPS driver here. 170k is the total compensation at contract ending 2028. It's around 110k salary Cadillac medical ( nothing deducted from salary, no deductible full medical ride for the entire family) and our pension\n\nSo unlike most comments here, you're actually answering my question and I appreciate that. So basically I was wrong because $170k \n\n1. Includes benefits, which is not what I thought\n2. Is for a 60 hour work week\n\nTo me that completely changes everything. \n\n> You say we are over compensated for having no education. Our weight limit is 150 pounds and deliver to 3rd floor Apts. We do 200 stops a day 12+ hour days . Routes can exceed 400 packages delivered and 400 packages picked up all in extreme conditions. 115 heat index or sub Temps and frozen roads. Conditions so extreme death is a possibility if your not careful not including the risk of driving all day and at risk of accidents on the road. Drivers have committed suicide under the pressure the company puts on them. It is in no way shape or form an easy job or walk in the park\n\nYou're basically describing any job where you are essentially getting paid because the manual labor involved is quite demanding and many people don't want to do it, and has higher rate of injury. I think it fair to compensate extra for that. My real issue only stems from the $170k figure, which I assumed incorrectly was 40 hours the salary without benefits. \n\nThanks for pointing out the numbers and not being a complete ass like other people in this comment section.", "score": 3, "replies": []}]}, {"body": "You’re a highly regarded bag holder, and even more so for demanding an educated explanation from another group of highly regarded bag holders that thought AMC and BBBY were amazing buys.", "score": 4, "replies": [{"body": "> You’re a highly regarded bag holder\n\nI have zero bags fuck off", "score": 3, "replies": [{"body": "Lol. Sure, buddy.", "score": 2, "replies": [{"body": "projecting much? Must be really hard for you to comprehend someone would not buy options every time a thought pops into their head.", "score": 0, "replies": [{"body": "Do you also go to the Special Olympics to get coaching advice? Because you know this place is the Special Olympics of investing, right? ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}]}]}]}, {"body": "Saying and doing are two different things.", "score": 1, "replies": [{"body": "It's the teamsters, they got this contract by hard bargaining", "score": 2, "replies": [{"body": "'hard bargaining' I think you mean threatening to hold the country's economy hostage.", "score": -2, "replies": [{"body": "Do you think people have an obligation to work out of some patriotic duty?", "score": 5, "replies": [{"body": "I don't know what you're babbling about.", "score": 0, "replies": []}]}, {"body": "A whole country? Which one?", "score": 2, "replies": [{"body": "Which one do you think dumbass?", "score": 1, "replies": [{"body": "Yourmomistan?", "score": 0, "replies": []}]}]}]}]}, {"body": "It's a contract you regarded moron", "score": 0, "replies": []}]}, {"body": "its just a publicity stunt relax, aint no one paying ups drivers 170k a year.", "score": -6, "replies": [{"body": "Literally in the contract that was negotiated.", "score": 1, "replies": []}]}, {"body": "I thought everyone knew not to ever vote against UPS .. they will always be successful….", "score": 1, "replies": []}, {"body": "Because debt means nothing. Only time debt would be a factor is the inevitable crash. \n\nUPS like most stock market companies are running a tight rope with no safety net when it comes to there debt. Basically one fuck up in supply chain or a smaller company going bankrupt will cause the domino effect of mass bankruptcy across the board. \n\nThat being said, there's nothing really pointing to companies going on a random bankruptcy spree. Inflation has been handled well, and the market and I think we're out of the woods of a crash. \n\nNews of avoiding the strike probably outweighed all of the debt concern. \n\nDon't bank on this debt bringing it down.", "score": 1, "replies": []}, {"body": "I believe they are going to raise rates..I could be wrong", "score": 1, "replies": [{"body": "You're probably right.", "score": 1, "replies": []}]}, {"body": "I’m telling you right now usps just made ground shipping cheaper than UPS. I haven’t had a single ups package the last two weeks. So maybe they will have less revenue thanks to usps", "score": 1, "replies": []}, {"body": "I’m just glad the Wendy’s dumpster got a mention*", "score": 1, "replies": []}, {"body": "Transportation industry is taking a hit. Those inefficient companies will fail.  Yellow trucking has already declared bankruptcy and couldn’t afford to negotiate with it’s Teamsters Union.  30,000 layoffs there. I’m sure UPS will follow suit in time.  I don’t see how customers are going to pay these increased delivery costs.  Theres always Fed Ex and USPS among other competitors.", "score": 1, "replies": []}, {"body": "Ups knows they can increase prices to absorb the costs.  They can also find efficiencies/redundancies.  Couple that with absorbing the remaining yellow business, they’ll be fine.", "score": 1, "replies": []}, {"body": "Cash on hand isn’t how they pay for expenses. They pay for expenses with revenue. Cash on hand is “savings account”. A company with 9b in a savings account is very rich. So rich that a buyback is maybe in their plans. \n\nTheir revenue is insane and they will still have 15b in profit. You think companies profit shrinks when expenses rise? Nope. They find a way to become more efficient and our raise revenue through increased sales and/or increased prices. \n\nBasic economics here my friend. Basic basic.", "score": 1, "replies": [{"body": "> They pay for expenses with revenue\n\nAn increase in expenses will come from the leftover profit. They could have $1T in revenue but if their expenses are currently $.99T, they'd be fucked. \n\nBy the way I never claimed they won't still make a profit. Just less. By the way, UPS themselves they will be making less in their recent quarterly report...", "score": 2, "replies": [{"body": "They had around 14% revenue increase YoY every year with the exception of 2021 to 2022 when it was around 3%. Companies owned by shareholders, at least good ones, constantly increase performance. With revenue around 100b, a modest 3% increase is a ton. Getting back to the 10% range, they have no issues. \n\nBottom line- UPS is healthy, profitable, and thus there will not be a big pullback because of the recent labor agreement.", "score": 1, "replies": []}]}]}, {"body": "UPS changes every day. They adapt to new environments, and won't lose money. All these new raises coming, are going to be used to justify \"robotic\" workers. It's already happening. Most part time workers will be displaced or made obsolete. The drivers will be the only ones making real money, most of the inside employees are going away. UPS knows what they are doing.", "score": 1, "replies": [{"body": "> and won't lose money\n\nPeople seem to not read. I didn't say they'd **lose money**. I said they might be overvalued and their profits will be cut in half. \n\nMy numbers were off so the point is moot", "score": 1, "replies": [{"body": "I read it. I think the stock is overvalued too, but people have confidence in UPS. That's all I'm saying. \n\nTheir dividend went up 50% last year, that's why everyone is holding it.", "score": 1, "replies": []}, {"body": "Profits cut in half doesn’t mean lose money?", "score": 1, "replies": [{"body": "I didn't say they would lose money. That's exactly my point...\n\nI literally just said that. What's wrong with you?", "score": 1, "replies": []}]}]}]}, {"body": "If UPS happens to offer the equivalent of ‘forever stamps’ then you need to buy those.", "score": 1, "replies": []}, {"body": "They’re also going to raise prices like everyone else, and the additional revenue will offset much (if not all) additional costs.", "score": 1, "replies": [{"body": "Yeah others have mentioned this and you're probably right.", "score": 1, "replies": []}]}, {"body": "Buy and sell on feelings not fundamentals.![img](emote|t5_2th52|4640)![img](emote|t5_2th52|31249)", "score": 1, "replies": []}, {"body": "It’s because I just paid $17.80 to have my plates shipped to the dmv that was less than 3 miles away.", "score": 1, "replies": []}, {"body": "It’s simple, the company’s money printer go brrrrr", "score": 1, "replies": []}, {"body": "haha shipping prices go brrr", "score": 1, "replies": []}, {"body": "They could probably get more out of employees as well since they can be more selective.", "score": 1, "replies": []}, {"body": "They will pass costs down to their customers.  They will be okay.  Fedex and competitors will probably have to make similar concessions when their contracts come up for renewal.  No leg up for anyone.  Loser is consumer", "score": 1, "replies": [{"body": "What contract?", "score": 1, "replies": [{"body": "The collective bargaining agreements FedEx has with the labor unions.  They will want to be paid too like their UPS bretheren", "score": 1, "replies": [{"body": "There is no such thing. That is why UPS is head and shoulders above the competition when it comes to wages.", "score": 1, "replies": []}]}]}]}, {"body": "I mean online shopping is the future. Anecdotally all of the shopping malls I see are dying. And, the cost of everything is going up. UPS is one of those companies that is highly dependent on their people, they can't function without human beings doing physical labor. \n\nAlso, they weren't getting out of this spending *nothing.* They couldn't lower wages, you knew they had to pay something. The way you want to think about it is in terms of what the baseline concession might be on UPS part to the union. If the acceptable range for negotiations was between 25bn and 45bn over 5 years, this is an overall positive development. \n\nSo you have to think about it like that. Something was getting spent, the question is if 30bn is better than the alternatives, and, it probably is. Especially with inflation, 30bn over 5 years is cheaper than 30bn now.", "score": 1, "replies": [{"body": "> UPS is one of those companies that is highly dependent on their people, they can't function without human beings doing physical labor.\n\n1. Today\n2. Nothing particularly special about that labor. It's not a skilled trade\n\nThey spend $44b a year on employees so yeah $6b/year is not that much.", "score": 1, "replies": [{"body": "Actually there is a lot special about that labor. \n\nUPS has incredibly high standards for their delivery drivers, and you can't just wave a magic wand and become one. You have to start out in their warehouses and work up to it. And, they truly do demand excellence from their drivers, they have ridiculous quotas to meet and also, need to be something like 99% accurate, which is higher than anyone else. \n\nAdditionally they deliver a lot of heavy, heavy stuff. If you're thinking that drones can deliver everything, or that self-driving trucks will replace the drivers, with some kind of robot that kicks packages out... IDK what to tell you, that just isn't reality. \n\nJust because it's not a \"smart guy\" job doesn't mean it isn't a \"difficult job.\" You can't just hire someone off the street to do it at the level that is required. And they don't do that. Those success metrics are a direct result of the way they do business and is a big part of *why* they're in business.", "score": 1, "replies": [{"body": "> Just because it's not a \"smart guy\" job doesn't mean it isn't a \"difficult job.\"\n\n'difficult job' =/= job that only some people are capable of. \n\nIf a magical sickness went around and killed off 75% of UPS staff - it will not be difficult to replace them. It will take time yes, and some training, but I'm sorry it's not like you need two years of training before you can become a driver. I would say the most important factor is simply being willing to do the job. \n\n> You have to start out in their warehouses and work up to it\n\nThat true or are you just saying that? That might be true if they don't have many vacancies so they would rather promote internally since someone will already be familiar with UPS package protocol. \n\nBut if you had to hire a lot of people from outside the company, you don't need people with degrees. That alone makes your pool of labor larger, and should be cheaper as well. As long as someone can drive and isn't a fat fuck, they're qualified for the position.", "score": 0, "replies": [{"body": "Everyone is replaceable with time in any job. That analogy isn't rooted in any realistic scenario. \n\nAnd not everyone can do that job, because not everyone can lift heavy packages. You literally have to be able to repeatedly lift heavy weight to do the work. There's a reason the vast majority of these people are male. You're filtering out a LOT of people by the fact that it's physically demanding. \n\nAnd you're also missing the point that turnover is bad for business when your business is predictably highly accurate service. If their delivery metrics drop by 5% that's a huge fucking deal. It gives them a competitive advantage to have less disruption in their workforce. \n\nAnyway, I think this has been thoroughly explained to you at this point by myself and about 100 other people.", "score": 1, "replies": [{"body": "> Everyone is replaceable with time in any job\n\nWhat a useless statement. \n\nEven a cashier takes 'time' to be replaced. The question is how long. How difficult is it to take a person off the street trained for the job? What percentage of the population is eligible for the position?", "score": 0, "replies": [{"body": "Dude you came up with a totally unrealistic scenario. If they lost 75% of their work force? Their stock would TANK overnight. Deliveries would be missed, their promises around delivery time, tracking, would crash and burn, their warehouses and storage facilities would bloat, they'd lose tons of money, and it would all be passed along to the shareholders in the form of a massive decrease. Why don't YOU outline a plan for UPS to break with the Union and hire a new work force? If you think that it's overall less expensive than paying the union its raise, *fucking prove it.*   \n\n\nThe question is how long, exactly, but it's not just the time to hire, it's the time to train, it's the time to background check, are they legal to work, do they have a felony history, etc, the whole hiring process. Are you 15 years old? Do you think you can just round people up off the street and give them the keys to a truck full of packages? I'd like you to outline how to expedite the hiring process such that you could lose 75% of the work force and be up and running to full capacity within any reasonable time frame. \n\nWhy are you asking what percentage of the population can do the job? The vast majority of the population can do any job, if we separate quality from the equation. Obviously the bare minimum of being able to lift what, 75 pounds is going to rule a lot of people out, but it's not like you can drop off Jane from HR into a truck and say \"lift these boxes day after day for 10 years without destroying your body permanently\" and expect that not to happen.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "look what the teamsters did to Yellow (albeit Yellow did have completely inept management for years, too). \n \nthese guys get paid mileage AND hourly when they aren’t driving. unsustainable process and raise schedule", "score": 1, "replies": [{"body": "This is one reason why I'm so bullish on Tesla :) GM/Ford about to get fucked", "score": 1, "replies": [{"body": "union companies can’t compete long term. and largely aren’t necessary these days.", "score": 0, "replies": []}]}]}, {"body": "OP is completely regarded.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "> Why is everyone hating on OP? He just asked a question because he was curious about the stock. He never said they don’t deserve the raise or he’s a financial analyst\n\nfucking thank you. I don't know what's wrong with people. It's like everyone is projecting some wsb regard who HATES the stock and bought lots of puts and is pretending to be a financial analyst. \n\nWhen I put up a DD (although it was a bit tongue in cheek) on Tesla, then I think that's fair game.", "score": 2, "replies": []}]}, {"body": "UPS is brrrrr backed", "score": 1, "replies": []}, {"body": "Most think they will raise prices anyway", "score": 1, "replies": []}, {"body": "The key mistake in your understanding is the difference between revenue and profits. The 30bn package has an unknown effect on the profit. Revenues are going up to offset the change in the employee comp - that’s the number that needs to go up. If they’re able to increase margins or charge more than employee costs then profit goes up (or down). The company’s current cash balances aren’t relevant here, what you want to focus on is the working capital changes.", "score": 1, "replies": []}, {"body": "Did you say you are broke AF? \nThe answer is staring you in the face.  Get a job!!!!\nAt UPS", "score": 1, "replies": [{"body": "income =/= wealth. I have good income, but no wealth. I would make less at UPS, also my entire question is irrelevant because I thought $170k meant $170k + benefits @ 40 hours/week, but $170k includes benefits and is 60 hours a week. That's much worse than what I make now, and that would take 5x years to get to.", "score": 1, "replies": []}]}, {"body": "They will raise prices, same thing every company does when they need to pay their employees more due to whatever circumstance.  Even if they are still turning a profit, shareholders aren’t happy when profit goes down.", "score": 1, "replies": []}, {"body": "It’s not 60 hours a week\nAt the end of this contract they will be at 49 per hour, they are at 41.65 now.  Do the math.  At end of contract working 9 hour days, they make $121,000 in salary and $50,000 in benefits.", "score": 1, "replies": [{"body": "Bro 40 hours a week at $49/hr is $101k per year. You can't make $120k/year unless you working more than 40 hours.", "score": 1, "replies": [{"body": "9 hours a day as stated above, that’s 45 per week, that’s an average day", "score": 1, "replies": [{"body": "Still short. That's $114k.", "score": 1, "replies": [{"body": "No those last 5 hours per week are at OT, so they make $73.50 for hours 40-45", "score": 1, "replies": [{"body": "ah ok so $120k for 45 hours. Still a lot different from my initial assumption which was $170k for 40 hours.", "score": 1, "replies": [{"body": "Yeah the $50,000 in benefits added to that makes it seem much higher.  Still great for 45 hours a week.  Don’t pay any premiums for health insurance and have a great pension.", "score": 1, "replies": []}]}]}]}]}]}]}]}
