{"title": "Short NVDA and suffer", "selftext": "", "id": "5myet5", "created_utc": 1483977393.0, "score": 48, "upvote_ratio": 0.84, "num_comments": 60, "comments": [{"body": "I haven't made enough sweet gainz to get past this paywall article.\n\nTLDR it for us poor piece of shit please", "score": 22, "replies": [{"body": "TLDR; Short NVDA and suffer", "score": 20, "replies": []}, {"body": "Investors lost a collective 4.4 billion dollars shorting NVDA last year.  Shorts are up ~100% so far this year LOL.", "score": 4, "replies": []}, {"body": "TLDR; Short NVDA and suffer", "score": 1, "replies": []}]}, {"body": "Sounds about right.  Was listening to the left-ist socialist propaganda on NRP this morning reporting from CES.  They were reporting that every single car company's main focus is automated driving.  Looking for the right time to re-enter NVDA, which may have been last week, but w/e.  ", "score": 10, "replies": [{"body": "I'm selling puts on NVDA. Someone said it belongs around 90, so I've been selling 90/95 verticals", "score": 6, "replies": [{"body": "Was it that Citron guy? NVDA seems to have a strong base at around 101, I'm sure forward guidance on their smartcar technology and Nintendo partnership will solidify that base. That's probably a good play call there.", "score": 5, "replies": [{"body": "Don't be distracted by their consumer products. NVDA GPU arrays will be the hardware foundation of AI development over the next 10 years. That's where the real money is at. We're talking world-changing, humanity-changing technology.", "score": 3, "replies": [{"body": "Most of their AI projects have been funded by their consumer products though. If the Nintendo switch is a success, they could pull in an additional 250 mill a year at least. As long as they don't go overboard with side projects ", "score": 1, "replies": [{"body": "Yes, but Apple also funded the creation of the iPhone from the success of the Mac and iPod. Now the iPhone makes up the majority of their revenue and nearly all their profits.\n\nNVDA has plenty of money now. It's why they're finishing up a new $300m campus in the valley right now. They're not struggling to fund AI development right now. They're comfortably past that stage.", "score": 1, "replies": [{"body": "Yeah, but that's years in the future. We're talking about selling short term puts and short term support/resistance levels. ", "score": 1, "replies": [{"body": "I know its not this sub's thing, but a long position on NVDA is going to yield some pretty gnarly gains over the next 5 years. You're going to see it hit 220 by the end of 2017 and 500-750 by 2020.", "score": 0, "replies": [{"body": "You're preaching to the choir: http://imgur.com/hhTMYp8\n\nSeriously, I need to average up to maintain 100% gains. ", "score": 4, "replies": [{"body": "NICE.", "score": 1, "replies": []}, {"body": "Keep riding the train, my friend. It will go far.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I am with you on selling puts on this. I went with the $100 Feb 10 contracts. Like u/zipykido said, there seems to be some solid support at $101; very briefly dipping below $100 this last big dip. I went with Feb 10 contracts to avoid earning. There is so much hype that a reasonable earnings could still be negative. Just my 2 cents.\n\n[proof](https://i.imgur.com/Vz6W3y9.png)", "score": 3, "replies": [{"body": "They're gonna absolutely murder earnings. I think the whole Citron to $90 short was a quick play to get some cheaper shares before earnings.\n\nAgain, I repeat, NVDA will destroy earnings. So many fucking little brats got 1080 and 1070 GeForces for Xmas. Fucking little shits.", "score": 1, "replies": [{"body": "I also think they will have good earnings. I just like to avoid binary events as much as possible. Selling puts is my preferred start to a bull strategy. If I am right, I keep the premium; if I am wrong, I get assigned stock at a cheaper price than buying them now and still get to keep the premium. If assigned, I would hold NVDA while selling covered calls. It is a good long term play. There are plenty of ways to make money in the market, you just have to find the one that fits your risk tolerance. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Quite possibly, yes.  They still get the majority of their revenue from gaming, but just how big the automated driving industry gets is unknown, but as far as I can tell, there isn't a company better positioned to benefit from it more than NVDA", "score": 1, "replies": [{"body": "> just how big the automated driving industry gets is unknown\n\nWhat isn't unknown is how many other companies will drive Nvidia's margins into the dust. You guys act like Nvidia is the only game in town, completely ignoring that specialized FPGAs will probably do it better and Intel just wrote a $250m check to prove it.", "score": 2, "replies": []}]}]}]}, {"body": "*total n00b post*\n\nDid my first option trade today...call at 110 2/17 for NVDA (2 contracts is so ballar)! When do I start looking for yachts?", "score": 3, "replies": [{"body": "Day after I won big, opened up the yacht page, traded more options with the confidence of a mediocre white man, went completely negative.  Now I burn yacht catalogs for heat.", "score": 4, "replies": [{"body": "At least you don't have pesky heat expenses to worry about now", "score": 3, "replies": [{"body": "Fuck dgaz lol", "score": 3, "replies": [{"body": "DGAZ has no options.", "score": 1, "replies": [{"body": "Just joking about natural gas and heat and stuff, is that an option?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Shorting is not for the faint at heart.", "score": 2, "replies": []}, {"body": "yep i'm one of those", "score": 2, "replies": []}, {"body": "Alternate link for non-subscribers (might only work for mobile) https://www.google.com/amp/www.wsj.com/amp/articles/BL-MBB-56875", "score": 2, "replies": []}, {"body": "I'll never understand people who go in for random shorts...", "score": 2, "replies": []}, {"body": "Hey, how's that \"not hype\" AMD doing for you the last two days? That's what I thought...", "score": 1, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "I went through significant effort to log in just to laugh at you.", "score": 10, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "The entire market is on the rise...", "score": 0, "replies": []}, {"body": "Does Bulldozer mean anything to you?", "score": -2, "replies": [{"body": "A mistake? Stay butthurt, you can scrub the decks on my yacht.", "score": 4, "replies": [{"body": "How's that Yacht coming along?", "score": 1, "replies": [{"body": "Pretty good man, going with a 132ft cruiser ", "score": 1, "replies": [{"body": "You couldn't even afford this 1:40 scale model yacht: http://www.liveyachting.com/140-scale-model-of-terranova-t85\n\nSell now, or forever be a bag holder.", "score": 1, "replies": [{"body": ">forever be a bag holder\n\nYup", "score": 1, "replies": []}]}]}]}, {"body": "Ah yes, the \"mistake\" that AMD hyped through the roof and even went so far as to manipulate benchmarks. \n\nNothing like Vega & Ryzen. Thankfully they've both been proven... Wait...", "score": -1, "replies": [{"body": "Are you talking out your ass? We've seen it running DOOM at 4k60fps on ULTRA! Better get really friendly with a mop and bucket, 'cause you're about to be swabbing!", "score": 2, "replies": [{"body": "Nope, I know what I'm talking about. But you're a raging fanboi and it's clear you don't. The Doom demo was running Vulkan, not OpenGL and was \"optimized\" via shaders specifically for the AMD card. So far, the \"tests\" have been heavily skewed. I'm very interested to see real-life bench marks. \n\nNot to mention AMD's benchmarks are meeting not exceeding Nvidia and Intel's CURRENT GPUs/CPUs that have been released for well over 6 months.", "score": 1, "replies": [{"body": "Making low risk bets on established company is how you get a small sailboat in thirty years not a MEGA YACHT!", "score": 2, "replies": [{"body": "AMD, recently established May 1, 1969.\n\nIn 2015, AMD posted a whopping $660 million net loss, its fourth annual net loss in a row.\n\nTo the moon!\n", "score": 1, "replies": [{"body": "If it makes sense it doesn't make money", "score": 1, "replies": [{"body": "... you're not making money... down -13% in two days...", "score": 1, "replies": []}]}]}, {"body": "Pfft pleb, get a Yotta Yacht.", "score": 1, "replies": []}]}]}]}, {"body": "Lies.  AMD didn't manipulate benchmarks.  They made a bad bet on multithreading too early, and they've shown us core-for-core tests of Ryzen", "score": 0, "replies": [{"body": "https://www.extremetech.com/computing/99545-amd-fx-bulldozer-desktop-cpu-released-slower-than-cheaper-core-i5-competition\n\nOn mobile, there is plenty of support for the manipulation. You're correct that they put too much emphasis on multi-threading.\n\nYour username alone demonstrates your blind bias. Nothing I or anyone else says could change your mind. \n\nRyzen has shown literally nothing factual. Right now is all still complete hype. I used them way back when they were ATI, and welcome more competition, but we haven't been shown anything real yet.\n\n", "score": 0, "replies": [{"body": "I assume you mean my flair, since my username is \"user\" and some random digits and means exactly nothing.  Flair is assigned by admins on this sub, but I wear mine with pride, because I made a lot of money for anyone who listened to me while I earned it.\n\nReleasing multithreaded benchmarks that show their multi-core design in the best light isn't \"manipulating\" benchmarks.  Rewriting the most commonly used compiler so that it negatively affects your competition's performance in benchmarks is.  Intel did that, not AMD.\n\nWe know everything that we need to know (and more) in order to state unequivocally that Ryzen is competitive with or better than Broadwell-E.\n\nAnd AMD was never ATi.  They bought ATi.\n\nI don't care what hole you want to stick your head into, but AMD didn't lie about Bulldozer and isn't lying about Zen.", "score": 0, "replies": [{"body": "https://www.google.com/amp/s/scalibq.wordpress.com/2011/07/23/amd-agrees-john-fruehe-is-a-liar/amp/\n\nYou're a tool. \n\nI'm not claiming Ryzens flop, only that it absolutely isn't proven. We're at the same place as Bulldozer, hype.", "score": 0, "replies": [{"body": "No, you're a tool.  Where's the manipulated benchmark, you lying scumbag?  That post was also out *before* Bulldozer released and the CEO of AMD is the one they cite saying 35%.  Saying something will be \"up to 50% faster (at specific calculations, no less)\" because it has 50% more FPU units (on an untested platform) might be wrong, but it isn't a lie.\n\nThis post actually puts the lie to your bullshit.  Because people who understood the architectures could find these problems.  Please go find me anyone credible saying the same shit about Zen.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I agree but the market can stay irrational longer than you can stay liquid.  \nYou'd have to use a doubling scheme buying puts to grab the drop when it happens.  \n  \n$NVDA FMV is ~$70.", "score": 2, "replies": []}, {"body": "Well they replaced MobilEye as TSLA's GPU for autonomous driving, and more recently partnered with Mercedes i believe to play a bigger role in their autonomous offering.", "score": 2, "replies": [{"body": "Their principle market is still consumer graphics cards which is an ever more difficult field for them.", "score": 1, "replies": []}]}, {"body": "You're right. Totally. But I want you to look up \"CUDA\". This is the reason, along with bullshit mindshare and marketshare gained from years of shady bullshit, that NVDA ain't going nowhere.\n\nFuck em, I agree, but they're making money.", "score": 1, "replies": [{"body": "Yes.  Please look up CUDA.  Then look up ROCm/HIP.  CUDA runs on faster, cheaper AMD hardware.  RIP Pascal.", "score": 2, "replies": [{"body": "k\n\nFor the record I'm a AMD fanboy and own shares in both companies, although about 75% of my portfolio is AMD, and the other 25% is NVDA. I know, # diversification. But they've treated me well, and I invest in what I know.\n\nAnyways, NVDA's lead is in software and ecosystem and mindshare. And a little bit hardware too. Kind of like Intel's lead was their superior fab process, for YEARS. That took YEARS to chip away at and get to parity. This will be similar. The HPC, research, and educational communities aren't going to just drop CUDA overnight and go open source. You need to understand this. NVDA will be dominant for a while longer, AMD is just getting into the field.\n\nPeople love to pit this as AMD vs NVDA or AMD vs Intel. Y'all need to understand there is room for all three, and more, to make money. Computing hardware is becoming more and more specialized, and powerful, but at the same time, there is also a growing demand for simple, low-power chips.\n\nMy fucking toaster has a computer chip in it. But it doesn't need to be Intel. Get what I'm saying?\n\nMy top 3 reasons for investing in AMD:\n\n1. Jim Keller / Zen\n2. Lisa Su\n3. Radeon graphics IP / Spinoff value\n\nThere's room for both AMD and NVDA to kill it going forward. Which they will. I'm long both and killing it since last year. Enjoy.", "score": 1, "replies": [{"body": "> The HPC, research, and educational communities aren't going to just drop CUDA overnight and go open source. \n\nLike I said ... Go look up ROCm/HIP.  It's not an either-or prospect.  You don't \"drop CUDA\", you just use HIP instead, which *is still CUDA* with the advantage of not being vendor locked.  And the portability is mostly automated (AMD ported CAFFE in 4 days, with 99.6% of the port automated and zero performance impact).\n\nI agree Nvidia is well-entrenched, but scientists and businesses aren't fanboys.  If you can get 3 Petaflop Vega racks from AMD that run your workloads faster, using less power, and cost less to purchase ... It will gut DGX-1 sales.\n\nNvidia will continue to make profits for a while, sure.  They are still pulling in the bulk of their money from gamers and that's not going away.  But their shares are trading at ridiculous levels compared to revenue and the automated car boom everyone is buying into isn't going to have real products shipping until 2020 (according to Nvidia).  So if you're expecting the stock to double again this year, well ... Good luck.", "score": 1, "replies": []}]}]}]}]}]}
