{"title": "2022 Trading results. Yes, you can make money in a bear market.", "selftext": "", "id": "104xrwt", "created_utc": 1673020880.0, "score": 92, "upvote_ratio": 0.87, "num_comments": 77, "comments": [{"body": "Nice. What are your typical positions on SPX? And how many DTE?", "score": 16, "replies": [{"body": "Weeklies, very low delta, 50-70% BP, shorting massive moves in either direction, occasionally legging out of spreads, avoiding binary events, and  keeping a close eye on macro data.", "score": 17, "replies": [{"body": "Exhibiting patience and letting theta burn👍", "score": 8, "replies": [{"body": "You got it. I don’t close early unless it happens suspiciously quick (like 50% profit in two days). I won’t roll unless one of the shorts is ATM.", "score": 2, "replies": [{"body": "Could you please share more info on rolling when short leg is ATM. Do you roll out or roll down, by how much? Do you ever consider closing positions?", "score": 1, "replies": []}]}]}, {"body": "Can you be more specific? I can let it run through the OptionOmega backtester to see what the strategy is capable of.", "score": 2, "replies": []}, {"body": "Shorting massing moves is opposite of avoiding binary events, wouldn’t work in 2020. And how do you avoid binary events that never happened this year? If they happened then you could test your skill at avoiding them :)\nOtherwise nice results, congrats.", "score": 2, "replies": [{"body": "CPI prints and FOMC meetings have been the big mover “binary events”, so I don’t hold through them. Apple earnings and jobs reports to a lesser extent. Euphoric, idiotic pumps on bad news or data were easy pay days last year. Big dumps are harder to read since they can go on for several days/weeks, so I am more careful about positioning those.", "score": 8, "replies": []}, {"body": "Perhaps OP means not holding or betting on the direction of fed events + earnings, but then after some big move bet on a mean reversion?", "score": 4, "replies": [{"body": "Maybe, but big moves also happen for a reason and with inflation and interest rates having big impact. But volatility/VIX was mild this year, so long vol lost and short vol won, otherwise could’ve been the opposite.", "score": 2, "replies": []}]}, {"body": "I think he is saying he shorts after an event happens.  ie, sell calls after big move up after good earnings", "score": 1, "replies": []}]}]}]}, {"body": "I spent about 1100$ in commissions and fees. 95% of profits from SPX. This is meant as an antidote to the bitterness and doom all too frequent on this sub.", "score": 29, "replies": [{"body": "Lol I am up 100% on my account at Tasty but unfortunately 95% of my profits went on Trade Commissions and Fees", "score": 5, "replies": [{"body": "Me too. This year I’m trying to do less trades lol", "score": 2, "replies": [{"body": "Yeah last year I could've bought a nice car with the commission trying low DTE stuff. Now I'm just gonna sell 45+ and sit back and wait and scale up", "score": 3, "replies": []}]}, {"body": "How many trades are you doing every week?", "score": 2, "replies": [{"body": "Very small amount. I had two bad trades (yes only two bad trades) and sent my account back to starting point. At that point I had +300% P/L. Looked at why my total P/L was saying 100% Profit when I was at my starting point  and surprise surprise….commissions and fees was my biggest problem", "score": 3, "replies": [{"body": "Think you just might have to save some more before trading again, if that's your strategy. It's really hard to trade with a small account because the commission fees really hurt.", "score": 2, "replies": [{"body": "Yeah true. I started small because wanted to get a feel of the platform so decided to put some money into it and play.", "score": 2, "replies": [{"body": "You are smarter than me, my friend. I lost a bit of money before I learned to make consistent profit. Looking back, I probably should've just traded with paper money first.", "score": 2, "replies": []}]}]}, {"body": "Are you basing your open/close points on trade price (i.e. w/o commissions/fees) instead of cost (i.e. w/ commissions/fees)?", "score": 1, "replies": [{"body": "With", "score": 1, "replies": []}]}]}]}]}, {"body": "Nice! Could you tell us what strategies worked well for you in SPX?", "score": 3, "replies": [{"body": "Weeklies, low delta, legging in and out of condors, shorting massive movements, avoid binary events.", "score": 8, "replies": [{"body": "What's legging in and out of iron condors??", "score": 5, "replies": [{"body": "Instead of submitting your IC, or any other option strategy, as a batch job for a net whatever, you manually buy and sell each leg to catch better price swings for each of them. You can squeeze a better return doing this but there is a bit of risk of getting caught with only part of your strategy in place.", "score": 3, "replies": []}]}, {"body": "Man I just don’t have the time to commit trade management with that strategy. Good job though sir", "score": 2, "replies": []}, {"body": "Thanks for sharing!", "score": 1, "replies": []}, {"body": "How low is a low enough delta for ya? I usually go with 20, but if I see a really good opportunity, I would go with 30.", "score": 1, "replies": [{"body": "5-10", "score": 3, "replies": []}]}]}]}, {"body": "I paid 10x that in fees lol", "score": 1, "replies": [{"body": "Yeah same last year I could've bought a nice car with the commission trying low DTE spreads and stuff. Now I'm just gonna sell 45+ and sit back and wait and scale up. I do futures only", "score": 2, "replies": []}]}, {"body": "If this sub is too doom and gloom for you why are you here? I don’t see the bitterness and doom and gloom at all. I see people adding some realism to the conversation. For example, telling you that you got lucky doubling your money and that it is not skill probably will seem like doom and gloom, but for those of us who have been involved in markets for decades we just know how it ends…. ALWAYS! And it isn’t because we are bitter- it is because we have been there done that. But hey… feel free to learn the hard way just like I did.", "score": -11, "replies": [{"body": "It’s doom and gloom when talking about any other strats than the stupid wheel or the 45dte 30d csps...these people didn’t make any money last year but they want to teach others how to make money….lol.", "score": 1, "replies": [{"body": "Yeah I think this is a great example of exactly what I am talking about. OP doubles their money (which anyone with any experience knows was either one outsized bet, or consistently over leveraging trades for an extended period of time and just getting lucky that double zeros didn’t hit… yet. OP posts it with no context, no positions etc. and someone like me points out what is incredibly obvious (again to anyone with more than 3 years of experience) and I get down voted into oblivion…. Because it is doom and gloom?", "score": 1, "replies": [{"body": "Anyone with experience knows that there are many flavors of ice cream. You saying shit like this just proves that you are yourself new to this. There are many strats that have high returns like this and if properly backtested and hedged it can work well for someone that is disciplined. The main problem most people aren’t disciplined and get complacent when they gain big and find ways to mess things up. You also have to understand what makes a strat work…just like the standard 45dte d30 csp was a loser last year some of the weekly and 0dte strats may work in low volatility or high volatility so one needs to adapt to the existing environment.", "score": 1, "replies": [{"body": "Ok.. best of luck to you. Sincerely wish you nothing but peace and prosperity. For what it is worth my trading account was up 30% last year and I deploy many strategies- long/ short, naked and covered calls/ puts both on long and short positions, and reversion to the mean strategies on earnings and news events, but hey…. You know what my experience is… or perhaps you only hear and see what you want to hear?", "score": 1, "replies": [{"body": "Nice job, man! Hopefully that 30% is on your NAV not just the realized stuff. So why exactly you think your strats are the only ones that work?", "score": 1, "replies": [{"body": "You really just aren’t getting what I am saying. Sincerely good luck to you, but I don’t have the time or energy to continue this conversation.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I assume you are doing ICs to rack up so much fees. Might be worth checking out other brokers.", "score": 1, "replies": [{"body": "Any suggestions? Tasty has commission free closing and great fills which drew me in", "score": 1, "replies": [{"body": "What other brokers have you already tried and were not happy with?", "score": 1, "replies": [{"body": "Robinhood, Schwab. Garbage for options trading but good for investing", "score": 1, "replies": [{"body": "What is wrong with Robinhood option trading?", "score": 3, "replies": [{"body": "Everyone has their own opinion on RH, but with regards to OP, he wouldn't be able to do his strategy on RH because they don't offer options trading on indexes.", "score": 1, "replies": [{"body": "Yes, that I heard. Most opinions seem to be misplaced and be around the GME squeeze fiasco so they don’t count to me. I’m curious if anyone actually compared their execution to IBRK for example. Was debating to open an account for short dte strats because commissions are a killer on IBRK if you day trade.", "score": 2, "replies": []}]}]}]}]}, {"body": "Tasty fees are decent, I guess you just trade a lot. I use IBKR tiered plan.", "score": 1, "replies": []}]}]}, {"body": "I made money too. Not like this, tho. Good job!", "score": 1, "replies": []}]}, {"body": "Cool now show us your other account 😆\n\nEdit: btw OP those are your actual account numbers you posted there on the left. Not sure you are aware...", "score": 5, "replies": [{"body": "I can’t post multiple screenshots. It’s my Roth and it was up 5k for the year", "score": 3, "replies": [{"body": "Congrats. I traded options in my Roth and blew it up. Please be careful, cuz now I cannot contribute to a Roth (income limit) and fully regret doing this. I recommend moving it into safer stuff (buy & hold for the long run).", "score": 0, "replies": [{"body": "What blew you up?", "score": 1, "replies": [{"body": "A series of bad/dumb trades. Not sticking to a strategy. Getting desperate as the losses piled up. Don't be me.\n\nBlowing up your Roth is especially bad because you cannot deduct the losses on your taxes either 🫠", "score": 2, "replies": [{"body": "Do you have a taxable account as well? It’s really helpful, for me anyway, to separate the funds because I take pretty dramatically different approaches to the way I invest in my Roth and the way I trade in my taxable account.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Bear market doesn’t mean you lose money.\nIt’s the trend of overall market direction. If you play right you make either way.\n\nGood luck.", "score": 6, "replies": [{"body": "Bear markets are usually very volatile making making money trading more difficult", "score": 1, "replies": []}]}, {"body": "positions or ban", "score": 10, "replies": [{"body": "Maybe if this sub let me post multiple screenshots", "score": 6, "replies": []}]}, {"body": "[I very much agree](https://imgur.com/a/tNyGFTB)\n\nthough ... IB is the only one getting rich. the best strategy is to open a brokerage lol\n\npositions in SPX, VIX, VXX, VIXY, DWAC, duration from 0dte - 45dte", "score": 2, "replies": [{"body": "Nice! Did you keep track which made the most…short or long duration? I didn’t check my statement yet…i don’t want to see how much i paid in fees…lol.", "score": 1, "replies": [{"body": "here's the PnL from about half of the book, calculated by margin allocation, by individual strategy: https://imgur.com/gallery/FWvYlyL\n\nAnd here's the PnL from the whole portfolio, divided amongst the symbols: https://imgur.com/a/jGiymb5", "score": 2, "replies": []}, {"body": "they have their ups and downs. even if one side lost money, it doesn't mean that it wasn't good EV, or a good hedge. Out of the whole year, there must have been like a good $100k of short VIX puts. They've probably lost $100k cumulatively. But it's ok because they enable the short VIX calls, and other strategies that are floating around\n\nsame with the short term and mid term. Yes, a short term strategy might make $3k today, but it might lose $2k tomorrow and I'm cool with it. The long term strategy might pump out $200 a day, but it rarely looks back. And what if the long strategy gets in trouble and loses money and needs to scale up? Ok, we'll put 100k margin into it and steal some margin from the short term strat, which has to scale down for a week or two.\n\nSo they're all intertwined. Best to take the year and stick it in a monte carlo to see the alternative possibilities for the year", "score": 1, "replies": [{"body": "What do you usually do with SPX?", "score": 1, "replies": [{"body": "you can see in the other picture -- there's about 6 different strategies running at any given time. I target them to be either mutually exclusive or negatively correlated with each other during the times that they're live.\n\nThey tend to be pretty short term bets. they are not based on technical indicators, but instead on specific times or durations when where theta decay is strong relative to gamma.\n\nOne or more of the strategies is a vega-based strategy on identifying times of outsized iv and trading that back to complacency.\n\nthey're run pretty much on full-auto via algorithm, but frequent tweaks and monitoring of the algos is necessary at all times.", "score": 2, "replies": [{"body": "Man, you reminded me i have to finish writing my auto algo code for my vix futures trade…it’s just that i have trust issues and i have a hard time leaving everything to the robots.   \nI remember we talked maybe a year ago and you were doing vix futures spreads…you still do these?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yes, you can make money in a bear market, but I didn't LoL.  No doom and gloom, just didn't have a good year.  The key is to learn from your mistakes.  Since I have never traded a bear market since I started full time trading, I'll be satisfied that I didn't go broke.", "score": 1, "replies": []}, {"body": "This is theta we're talking about. Of course you can make money in a bear market.", "score": 1, "replies": []}, {"body": "Nice. What platform is this?", "score": 1, "replies": [{"body": "Tastyworks", "score": 1, "replies": []}]}, {"body": "I shorted massive moves on the 0DTE basis if SPX hit the  1stdev and kinda got killed. I'm assuming massive 1sd on the weekly basis reverts back to the mean more often?", "score": 1, "replies": [{"body": "You got killed for shorting momentum….do the opposite and go with the trend.", "score": 1, "replies": [{"body": "Yup, luckily it was small, but I learned the hard way \"rubber band\" contrarian trading doesn't work at that time frame for sure. Now I'm trying to figure out \"at what point does the rubber band snap and keeps going?\"", "score": 1, "replies": [{"body": "It’s a hard trade but possible to make…i do it often but you have to scale in and go either with shares or leaps.", "score": 1, "replies": []}]}]}]}, {"body": "Well, you can make money in any market. Now, I only understand the basic concept of thetagang. But, I would think that profits would be more predictable in a bear market.", "score": 1, "replies": []}, {"body": "The only way I'm staying afloat in this bear market is through passive income. ORE/ETH pair and staking ATOM on kepkr.", "score": 1, "replies": []}]}
