{"title": "Tesla Q4 and full year 2022 Financial Results and Q&A Webcast", "selftext": "", "id": "10l6zby", "created_utc": 1674674245.0, "score": 91, "upvote_ratio": 0.96, "num_comments": 75, "comments": [{"body": "BILLIONS OF PROFIT.\n\nThat's really all we need.\n\nonly 1200 companies the world can make $1b in profit in a year. Tesla is close to $15-$18B in profit.  And its more than last year. And the year before that.", "score": 49, "replies": [{"body": "It will be billions in profits 👍 even if wallstreet thinks it’s bad.", "score": 19, "replies": [{"body": "Wall St \"thinking\" is entirely contingent upon Fed policy at the point.\n\nIn between this monster quarter (so long the no demand/no margin fud) and Fed pausing on further rate increases, we are looking at TSLA at $2T mc before year end, quite possibly $3T.", "score": 4, "replies": [{"body": "🤞I sure hope so but $650 is my PT in this environment. \n\nAt 1k I can retire early 🙏 so please for the love of everything.", "score": 3, "replies": [{"body": "At $650 I'm buying a house in Austin so I can keep closer eyes on Elon:). Maybe I will bump into him at Fonda San Miguel from time to time jaja.\n\n\nWould be a very nice addition to my RE portfolio anyway, which I have build up over the last few years with my TSLA cap gains. At this point I can retire just off rental income from those properties. \n\n\nYou can do the same!", "score": 2, "replies": []}]}]}]}, {"body": "And they haven't even started yet.", "score": 15, "replies": []}, {"body": "$14.1b in net income (non-GAAP) which would make Tesla the most profitable automaker in the U.S FY2022. They will be the most profitable automaker by the end of this year.", "score": 4, "replies": []}, {"body": "I mean, given those numbers — how many companies in the entire world make more than $10bn in profit per year?  Do I need to take off my shoes to count them?", "score": 2, "replies": [{"body": "https://www.cbinsights.com/research-unicorn-companies\n\nHere is a list of the Unicorn Companies.", "score": 1, "replies": []}]}]}, {"body": "**Tesla has released their Q4 earnings, beating analyst expectations:**\n\n• EPS (non-GAAP): $1.19 vs. $1.10 est.\n\n• EPS (GAAP): $1.07 vs. $0.98 est.\n\n• Revenue: $24.318B vs. $23.6B est.\n\n• Automotive Gross Margin: 25.9% (vs 26.4% est.)\n\n• $3.687 GAAP net income\n\nIn the last quarter, we achieved the highest-ever quarterly revenue, operating income and net income in our history. In 2022, total revenue grew 51% YoY to $81.5B and net income (GAAP) more than doubled  YoY to $12.6B.\n\n&#x200B;\n\n![gif](giphy|AUFy95qylyj7n3dlht|downsized)", "score": 35, "replies": [{"body": "Surprisingly, COGS went up. Not sure if the 4680 ramp had some huge costs or something this quarter.", "score": 9, "replies": [{"body": "My guess is continued factory expansion and product lines.  There was a time giga factory costs was under RnD but after its selling cars, the costs shifted to a different bucket.", "score": 8, "replies": []}, {"body": "Did it? I'm not seeing that.", "score": 0, "replies": []}, {"body": "Material cost inflation", "score": 1, "replies": []}]}]}, {"body": "Elon said “orders of magnitude” everyone take a drink!", "score": 15, "replies": [{"body": "He did it again! 🍻", "score": 4, "replies": [{"body": "Christ tomorrow morning is gonna suck at this rate. 🥃", "score": 6, "replies": []}]}]}, {"body": "Maybe I was overly prepared for bad news but this seems pretty good", "score": 14, "replies": []}, {"body": "1 of 4 4680 lines operational at Austin is the biggest news so far.", "score": 13, "replies": []}, {"body": "$324M FSD revenue recognized due to wide release. Says they have almost $1B left to recognize, pending future updates.\n\nInteresting to see them quantify financially how far they are with FSD.\n\nCan't be bothered to look back through all the old shareholder decks, but wonder what the revenue % and milestones looked like over time. I don't think they've really publicly stated their major milestones for long-term FSD revenue realization.", "score": 9, "replies": [{"body": "No I don't think we've ever seen it spelled out. I wish. Definitely I bought FSD and they haven't delivered it to me but the details matter. I wonder what pulling the word BETA off city streets would do. That's not parking lots or REVERSE but it's damn near everything surely", "score": 3, "replies": []}, {"body": ">have almost $1B left to recognize, pending future updates.\n\nAnecdotally many of the Tesla drivers I spoke to are waiting on v11 wide release before signing on.", "score": 1, "replies": []}]}, {"body": "Betweeen the lines I heard Cybervan, and that Nevada's 500 annual GWh were going to go to Megapack + dedicated robotaxi.", "score": 6, "replies": [{"body": "I hope cybervan for consumers happens haha", "score": 2, "replies": [{"body": "It makes complete sense in the context of the mission. After consumer vehicles, then semi trucks, delivery/last-mile vehicles are the next biggest chunk of greenhouse gas emissions in the transportation industry.", "score": 2, "replies": [{"body": "I meant a minivan for my family haha", "score": 1, "replies": [{"body": "Id totally buy the Tesla MiniVan.", "score": 3, "replies": []}, {"body": "Yeah van does not equal minivan. Think Mercedes Sprinter.", "score": 2, "replies": [{"body": "I'll allow it", "score": 2, "replies": []}]}]}]}]}, {"body": "Where do you get 500GWh out of Nevada? \nThey announced 100GWh and have ~42GWh of 2170 Panasonic already. \n\nAlso if cyber van is a thing I’d bet it’ll be out of Austin where the cybertooling exists.\n\nIf anything I interpreted $25k car packs supplied out of Nevada.", "score": 1, "replies": [{"body": "Total expected capacity, not existing. But I think you're right, they specifically referred to the 100 GWh existing.", "score": 2, "replies": [{"body": "There isn’t 100GWh existing capacity at Nevada.\n\nThere is around 40GWh of existing 2170 supply and they’re adding a new 100GWh 4680 plant. \n\nGo read the [blog](https://www.tesla.com/blog/continuing-our-investment-nevada) and watch the [presentation](https://youtu.be/OLdIPmE4dCs).", "score": 1, "replies": [{"body": "In the presentation he did say 4680 production at Nevada might scale to 500GWh.", "score": 1, "replies": [{"body": "He did. In future. Or “long term” I believe were the exact words. Still not anytime soon. Given this is phase 2 of potentially 3/4 phases in Nevada. \n\nIt does however throw in to question the internal targets they’ve spoken of elsewhere of 3TW total production and 1TW of that Tesla made. \n\nIf Nevada are doing 500GWh then that’d be more than 50% of output which doesn’t make any sense, so that suggests they expect to make more than previously guided.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "![gif](giphy|LoCDk7fecj2dwCtSB3)", "score": 7, "replies": []}, {"body": "1.5hr to go", "score": 3, "replies": []}, {"body": "Ooh. +0.45% AH. You'd barely know there was an earnings report at all.", "score": 6, "replies": [{"body": "Should probably take a second look at it :)", "score": 5, "replies": [{"body": "Yup! Saw that. :)", "score": 4, "replies": []}]}, {"body": "Up 5.5% at close of AH so not too bad.  If that can hold through the open I will be pretty happy about it.", "score": 3, "replies": []}, {"body": "I’ve seen Tesla drop -2.0% during after hours, open low and then close the day positive after earnings. \n\nThe premarket and after hours aren’t always predictors, but glad to see it’s on the positive side", "score": 4, "replies": [{"body": "That's what I'm saying. It's usually wildly and immediately up or down in AH once earnings are released. What it'll do after market open is anybody's guess, too. This time, though, it just kind of stayed mellow at first.", "score": 1, "replies": [{"body": "Yeah, absolutely. I’m thinking as long as there’s no macro impact tomorrow we may be very green tomorrow.", "score": 1, "replies": []}]}]}]}, {"body": "I have never invested in Tesla before, would $144 be a good entry point? Considering the great earnings report I assume yes!", "score": 3, "replies": [{"body": "It is common to go down after earnings, not always but common. Be careful with that.", "score": 3, "replies": [{"body": "Cheers bro! Good to know", "score": 2, "replies": []}]}]}, {"body": "Please, tell me more about this demand problem…\n\n![gif](giphy|pDn1909dT6nUQ)", "score": 2, "replies": []}, {"body": "OMG...\n\nElon sounds exhausted and terrible... He needs to get off Twitter, call it a loss, and move on.\n\nEdit - Tesla seems to be doing great!", "score": -4, "replies": [{"body": "He sounded fine in the presser at Nevada Gigafactory the other day. Did you watch it?", "score": 7, "replies": [{"body": "Do you mean the Semi event?\n\nIf something else, not sure what you mean.", "score": 3, "replies": [{"body": "I thought it was more about Nevada expansion in general than Semi. Here's the link if you haven't seen it: https://www.youtube.com/watch?v=OLdIPmE4dCs", "score": 3, "replies": [{"body": "Oh, did not see that one. The semi event was a few weeks back.", "score": 1, "replies": []}]}]}]}, {"body": "Safety statistics", "score": 3, "replies": []}, {"body": "Yes, he sounds terrible. Does he usually stutter that much? He sounded really nervous, for no apparent reason.", "score": -3, "replies": [{"body": ">Does he usually stutter that much?\n\nYes", "score": 16, "replies": []}, {"body": "> Does he usually stutter that much?\n\nAlways has.\n\n> He sounded really nervous, for no apparent reason.\n\nThis is always how he sounds. Sounds bored if anything.", "score": 12, "replies": [{"body": "Lol u know the shorts are drowning and grasping at straws when they resort to questioning Elon speech pattern.\n\nWe are looking at the greatest short squeeze in human history this year once the Fed comes around.", "score": 3, "replies": [{"body": "> We are looking at the greatest short squeeze in human history this year once the Fed comes around.\n\nElon made agood point at the end of the Q&A though about how the Fed rate is approaching the long term earnings rate of the S&P 500. That could cause a lot of problems as people start evacuating money from companies into T-bills.", "score": 2, "replies": [{"body": ">long term earnings rate of the S&P 500\n\nWhich is in any case below/barely keeping up with inflation. \n\nAlso earnings rate of Tesla is way above SP average. Institutions sitting on trillions of dollars are under increasing pressure to generate alpha.", "score": 1, "replies": []}]}]}, {"body": "Yeah. Sounded like he was trying not to be too Elon and stay on message. Still immediately ripped up the 1.8m conservative guidance tho…\n\n![gif](giphy|onFrNdtFAb5uw)", "score": 1, "replies": []}]}, {"body": "Yeah, go watch the Cyber Rodeo video.", "score": 3, "replies": []}, {"body": "He's spent the last few days in court and twitter is a disaster", "score": 1, "replies": [{"body": "Can we talk about this [court sketch](https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fac56663e-9cdb-11ed-b81d-ce538d806950.jpg?crop=1597%2C898%2C0%2C83&resize=1500) of Elon please? I have questions.", "score": 2, "replies": []}]}, {"body": "Obviously I think usually not this bad.", "score": 1, "replies": []}]}]}, {"body": "Did anyone on the call ask about Elon's leadership at Tesla and lack of focus with the twitter crap going on?", "score": 0, "replies": [{"body": "Yes. \n\nThough given they have record demand at double production and just delivered a record quarter on almost all measures, criticism of his “leadership” based on being butthurt is water off a ducks back at this point. \n\nMartin Viecha:\n>Thank you. Let's go to the next investor question. Since Elon started political influencing, polls from Morning Consult and YouGov show Tesla brand…  \n*<Elon interrupts, laughing>*”YouGov. You can trust them with your life.”  \n[Editors note: YouGov is a British polling company started by politician Nadhim Zahawi who is the current chairman of the UK Conservative Party and was recently fined £1m for tax evasion by HMRC (the UK equivalent of the IRS) as part of a larger almost £5m tax settlement which occurred while he held the office of Chancellor of the Exchequer (finance minister) related to a transfer of shares in YouGov to his father]  \n*<Martin continues>* …show Tesla brand favorability declining in 2022 and division among partisan lines. Such brand damage can impact demand. Does Tesla track favorability? And how will any brand image be mitigated?\n\nElon Musk\n>Well, let me check my Twitter account. OK, so I've got 127 million followers. It continues to grow very rapidly. That suggests that I'm reasonably popular.  \nIt might not be popular with some people, but for the vast majority of people, my follower count speaks for itself. I have the most interactive account, social media account, I think, maybe in the world, certainly on Twitter, and that actually predated the Twitter acquisition. So I think Twitter is actually an incredibly powerful tool for driving demand for Tesla. And I would really encourage companies out there of all kinds, automotive or otherwise, to make more use of Twitter and to use their Twitter accounts in ways that are interesting and informative, entertaining, and it will help them drive sales just as it has with Tesla.  \nSo the net value of Twitter, apart from a few people are complaining, is gigantic, obviously.", "score": 1, "replies": [{"body": "Thanks for the info! Sucks he blew the question off.", "score": 2, "replies": [{"body": "Not really. \n\nThere’s nothing wrong with his leadership. Tesla continues to hit its own goals, outperform competitors, deliver record quarter after record quarter and demand remains off the charts. \n\nIf that changes he might have a question to answer, until then it really doesn’t matter that some people are offended by the opinion of someone else they’ll never likely meet, that’s on them to get a thicker skin. Most people know nothing about the CEO of the company they buy their car from and it doesn’t influence buying habits at all, Henry Ford supported the Nazis for christs sake.", "score": 0, "replies": [{"body": "I can understand some of your points I do. However being an investor in tesla forever at this point I can say their product development schedule has slowed dramatically, their interesting novel approach to problems seems to be slowing. Elon's thing always seemed to be a hard noised results driven leader that appeared to care about issues and I think that attracted lots of talent to Tesla. As things go a bit off the rails with Twitter it feels like that Tesla magic has faded. Coupled with the fact the stock was down 75% in the last 6 months doesnt help my feelings about this.", "score": 0, "replies": [{"body": "Respectfully, that’s bullshit. \n\n- Roadster 2005\n- Model S 2012 (development started 2007) \n- Supercharging 2012\n- Powerpack 2012\n- Destination charging 2014\n- Model X 2015\n- Powerwall 2015\n- Solar 2015\n- Telsa Energy 2015\n- Giga Nevada opens 2015\n- Model 3 2016\n- <production hell>\n- Megapack 2019\n- Model Y 2019\n- Shanghai factory opens 2019\n- Change to permanent magnet motor design 2019\n- Model S passes 400 mile range 2019\n- <pandemic> \n- Kato Road pilot battery factory opens 2020\n- Model S/X plaid refresh, with corner castings for underbody 2021\n- Tesla Solar Inverter 2021\n- July 2021 Virtual Power Plant for Powerwall customers 2021\n- Berlin and Austin factories open 2021\n- Dedicated Lathrop, CA Megapack factory opens 2022\n- Megapack XL (LFP version) 2022\n- Semi 2022 \n- Austin 4680 production starts 2022\n\nThen we know that they’re currently working on: \n- Cybertruck 2023\n- Robotaxi ???\n- Roadster ???\n- 25k vehicle ???\n- Model 3 “highland” refresh ??? (2023/4 judging by leaks)\n- Nevada expansion 2023\n- Berlin battery factory 2023\n- Berlin factory buildings 2/3 2024?\n- Rumours of cybervan ???\n- 360GWh of announced 4680 production (with 210GWh capacity already installed/commissioning)\n- Hardware 4/5 ???\n- Bot\n- Dojo\n- FSD v11\n- other products they’re alluded to but made no detailed comment on. \n\nNothing shows they’re slowing down, quite the opposite. There is a lot of emotion and media fuelled negative sentiment that investors need to ignore.", "score": 2, "replies": [{"body": "Model S / X plaid refresh was iterative not revolutionary. The feeling I get watching this is that the ideas stopped around 2017 / 2018 and we are just now starting to see the products 5 years later. The larger the company gets the more this is expected I suppose. Increasing production is awesome and 100% needed but the product space seems to be lagging.", "score": -1, "replies": [{"body": "They got criticised for announcing stuff and not shipping it and now they’re being criticised for not announcing things too early.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Let’s hope the AH action sticks unlike the fucking Microsoft bullshit from yesterday that cost me thousands of dollars", "score": -1, "replies": []}, {"body": "Starting.", "score": 1, "replies": []}, {"body": "Now, the only downside I can imagine after this results is that Q1 2023 is going to look bad: prices have been cut, so next margins and revenue should be lower (and, again, bears are going to yell \"WE TOLD YA!\")", "score": 1, "replies": []}]}
