{"title": "$TSLA Daily Investor Discussion - June 20, 2021", "selftext": "# This is the daily fun thread/chat. 🥳🚀\n\nAll topics are permitted in this thread.\n\nSee our Monthly thread for more in-depth discussions about news/thoughts/opinions about Tesla.\n\n^((This thread should not be construed as investment advice or guidance.))", "id": "o3y0p5", "created_utc": 1624165218.0, "score": 24, "upvote_ratio": 0.91, "num_comments": 87, "comments": [{"body": "Happy Father’s Day to all the dads!  Have a great day!", "score": 27, "replies": [{"body": "Thank you. This year is particularly special as I just got word of our first son!", "score": 6, "replies": [{"body": "Congratulations 🥳🎊🎉!  Life will never be the same ....or more meaningful....", "score": 6, "replies": []}]}]}, {"body": "Autopilot and FSD are newly listed under the subscription tab in the tesla app\n\nSource: twitter @RyanZohoury\n\nhttps://twitter.com/RyanZohoury/status/1406651843258851335?s=19", "score": 26, "replies": [{"body": "“You have all the available upgrades”\n\n“You have all the available subscriptions”\n\nDamn right I do.", "score": 11, "replies": []}, {"body": "Not seeing it. Edit: Now I'm seeing it.", "score": 8, "replies": [{"body": "Not seeing it. Everything is up to date as well. (Late 2018 M3P).", "score": 1, "replies": [{"body": "Go upgrades > subscribe > manage upgrades at the bottom on screen.", "score": 3, "replies": [{"body": "I’m not seeing it, Model 3 SR+ with no autopilot. I’d love to be able to subscribe to autopilot to see if I actually want to buy it as I start commuting back to work next month.", "score": 1, "replies": [{"body": "Subscribing to ap/FSD isn't yet enabled. What's new is that some of the ui aspects are now in the app. In the app under upgrades do you have buy/subscribe sections and a small Manage button at the bottom? That's what's new afaik.", "score": 2, "replies": [{"body": "Yeah I’ve had that stuff for a bit, but yeah nothing else in there.", "score": 1, "replies": []}]}]}, {"body": "Huh there's no subscribe option at all for me in the app. If I want premium connectivity I have to sign up for that on the website. What a missed opportunity by Tesla tbh", "score": 1, "replies": []}]}]}, {"body": "Good news. If someone is seeing it, it will eventually hit everyone. This is called gradual software rollout.", "score": 1, "replies": []}]}, {"body": "Not on mine...", "score": 4, "replies": []}, {"body": "All that definitely has me curious.", "score": 3, "replies": []}, {"body": "Seems it’s coming up under ‘manage my subscriptions’ for those who have bought it but no new price out. Here’s hoping for something less than 2 weeks!", "score": 1, "replies": []}]}, {"body": "$1000", "score": 25, "replies": [{"body": "Before or after the next split?", "score": 7, "replies": [{"body": "Yes.", "score": 13, "replies": []}, {"body": "both", "score": 1, "replies": []}]}, {"body": "You were supposed to say “First”!", "score": 7, "replies": []}, {"body": "🤪", "score": 3, "replies": []}, {"body": "$1001", "score": 1, "replies": []}, {"body": "How can I add \"500 shares\" after my nick?", "score": 1, "replies": [{"body": "go on desktop, on the far right.\n\nfeel free to add \"5000 shares\" if you want though", "score": 1, "replies": [{"body": "I have only 500... btw, what's the menù entry? I modified what seemed to be the right option but nothing changed", "score": 1, "replies": [{"body": "ah okay, not sure what's going on then, maybe msg a mod. it isn't showing up for me yet either", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "Probably Kaplan \n\nI see multiple of their black Xs at the Linq supercharger.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "GM CEO announces that their EVs will take over the world…while still producing Combustion Engine vehicles. LOL it’s too late.", "score": 20, "replies": [{"body": "The legacy auto makers are piling millions into advertising to push the narrative that they are all in on EVs while in reality they are making incremental changes. So when folks who are hyped up to buy an EV from Ford or GM find out that availability is limited or that the specs really aren’t as good as Tesla’s then all this will do is drive more folks to Tesla.", "score": 16, "replies": []}, {"body": "GM tried to collude with Nikola & Lordstown Motors and both poops-that's how serious GM is.", "score": 15, "replies": [{"body": "Think gm is looking for the easy way into ev but they keep on making stupid mistakes. I mean I thought they had it when they released the bolt. Looked into it and thought... Nope they don't.", "score": 5, "replies": [{"body": "I'm still waiting for GM to fix the battery recall on my 2017 Bolt-but GM seems to be side tracking a lot.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla setting up nicely in Singapore! 🚀", "score": 12, "replies": [{"body": "they are hiring people to do the delivery in singapore.", "score": 7, "replies": []}]}, {"body": "Entering another V9 beta week. Will it be delayed on time?", "score": 12, "replies": [{"body": "Two weeks away!", "score": 15, "replies": []}]}, {"body": "For those of you that regularly sell\nCovered Calls, how far out of the money are you typically selling?", "score": 3, "replies": [{"body": "This is the dream. Working my way towards 100 shares", "score": 2, "replies": []}, {"body": "Don’t tell the guys but I’ve been selling pretty low (5%) cause the stock has been flat as hell. But 20% is my go to on bull runs and only ever sell weeklies. If I’m ever wrong I just buy back for a loss and open another one a week later for small profit and majority of the time it’s successful.", "score": 1, "replies": []}]}, {"body": "I was just thinking about the FSD subscription and all that and since that’s an in app purchase, doesn’t that mean Tesla has to pay Apple 15-30% of all that revenue? Are they giving Apple a huge chunk of that $10,000 when people buy FSD in app? Seems like it would be best to have those options available only on their website if that’s the case. \n\nAnd if that is the case, all of us shareholders should make sure to subscribe on their website so they get all the money and don’t have to pay Apple.", "score": 4, "replies": [{"body": "No.\n\n30% Apple royalty fees are only for app purchases. Tesla is app is free so no money to apple.", "score": 2, "replies": [{"body": "The Spotify app is also free, so I don’t think that’s the case.", "score": 1, "replies": []}]}, {"body": "I’m pretty sure if that’s the case, initiating the transaction would open safari to complete the purchase!", "score": 1, "replies": [{"body": "I don’t think Apple allows that kind of stuff.", "score": 1, "replies": []}]}, {"body": "I haven't thought about that...\n\n... time for Tesla to make it's on mobile OS.", "score": 1, "replies": []}]}, {"body": "Was walking down the street yesterday in Seattle and came across this bad boy. Tesla #79 Roadster potentially? Wish I had bumped into the owner too!\n\nhttps://imgur.com/a/PiQMrXb", "score": 5, "replies": [{"body": "Man those things are tiny and so rare. Good find.", "score": 3, "replies": []}]}, {"body": "Looking at Thomas Pesquet outside the ISS … I wish I could be there in the space … 🥰✨", "score": 4, "replies": []}, {"body": "The French Hydrogen lobby is going all-in in paid news segment on TV news. What's the consensus here about how fuel cell would coexist or compete with battery powered EV ?", "score": 3, "replies": [{"body": "They won't. The \"fuel cell\" tech & infrastructure won't ever be created - because it cannot beat electricity. There's no \"co-existence\" - fossil fuel industry will go down in a spectacular fashion once they lose their policy supremacy.\n\nThe paid PR is all a shell game to pretend the fossil fuel industry has a future & has viable \"net zero carbon\" targets, preferably out to 2050, with some magic fuel cell tech enabling it.\n\nThe most important part is to avoid carbon taxes and the be allowed to sell oil, gas and coal right now, without paying for the costs of the pollution and planet heating their products inflict on the rest of us. The rest are bullshit promises & posturing.\n\nBy the time the fool cell scam unravels it will be years in the future, with fossil fuel execs billions richer.", "score": 33, "replies": [{"body": "Good to see you back “T”", "score": 8, "replies": []}, {"body": "Well said. Wish I could award you something but I’m too new. They may even delete my post like a majority of my attempts.", "score": 7, "replies": []}]}, {"body": "Maybe for airplanes. Like hydrogen has pretty bad energy density at 2.8 kWh/L compared to gasoline at 10 kWh/L, however it's still better than Li-ion at around 0.5 kWh/L.\n\nIf 2.8 kWh/L is enough but 0.5 kWh/L isn't enough for commercial airplanes, it might be a somewhat niche thing in the 2030, but the technology doesn't really exist today. Li-ion is just far more mature than hydrogen fuel cells, just storing hydrogen is a mess.", "score": 5, "replies": [{"body": "Hydrogen fool cells have too little power for their weight, planes won't take off without batteries.", "score": 3, "replies": [{"body": "I didn't really consider the power requirements, just the energy densities. Like if the energy density isn't good enough, why even bother in the first place?\n\n2.8 kWh/L on it's own is good enough I think, but you're right that this doesn't even cover the fuel cells which is needed to extract that energy. The batteries come with that included. If you look at the Model S it's battery is around 540 kg and that's enough to supply 1000 hp to the engines in the plaid. That's 1.4 kW/kg.\n\nThe weight of the engines themselves is not that important for this comparison because both fuel cells and batteries can use the same electric engines.\n\nIn this article they say fuel cell specific power is 1.6 kW/kg.\n\n[https://www.frontiersin.org/articles/10.3389/fenrg.2019.00035/full](https://www.frontiersin.org/articles/10.3389/fenrg.2019.00035/full)\n\nThey also talk about a theoretical 8 kW/kg (because 1.6 kW/kg was probably not good enough). It's weird how Wikipedia lists 0.34 kW/kg for batteries, but it's a source from 10 years ago and 1.4 kW/kg batteries you can buy right now in a Model S Plaid. There's large scale manufacturing and it's mature technology.\n\nI don't even know if you can find 1.6 kW/kg fuel cells, they said that's \"state-of-the-art\" but can you manufacturer enough to make an airplane out of it? The fact that they don't even mention the PRICE of these technologies. Like this is for a commercial product and if you can't even get a price for your product, it's a long way away.\n\nDigging through their sources they list this website for that 1.6 kW/kg figure, but they don't show prices,  [https://www.intelligent-energy.com/our-products/](https://www.intelligent-energy.com/our-products/uavs/)\n\n[https://www.intelligent-energy.com/uploads/product\\_docs/IE-Soar\\_2.4kW\\_new.pdf](https://www.intelligent-energy.com/uploads/product_docs/IE-Soar_2.4kW_new.pdf)\n\nThis one is actually pretty decent at 8000W peak power at 4.4 kg fuel cell.\n\nHere's something that at least somewhat comparable with a price shown, [https://www.fuelcellstore.com/fuel-cell-stacks/uav-fuel-cell-stacks/g-hfcs-2kw25v-1kw-hydrogen-fuel-cell-power-generator](https://www.fuelcellstore.com/fuel-cell-stacks/uav-fuel-cell-stacks/g-hfcs-2kw25v-1kw-hydrogen-fuel-cell-power-generator)\n\n$11.5k for 2 kW (at 5.8 kg).\n\nMeanwhile doing some conversion for batteries with $100/kWh, 0.25 kWh/kg, 1.4 kW/kg it becomes $18/kW. That number is actually totally feasible even though it's a very rough estimate.\n\n[https://www.amazon.com/TATTU-1800mAh-Battery-Racing-Drones/dp/B013I9SAHO/](https://www.amazon.com/TATTU-1800mAh-Battery-Racing-Drones/dp/B013I9SAHO/)\n\n11.1V, 1800 mAh, 45C rated that's 899 W and the battery costs $21 off Amazon, pretty damn close to $18/kW. That initial paper mentions 27.6 MW is the required power for current aircafts. In batteries that would cost $500,000 while for fuel cells it's $159 million. The entire aircraft is supposed to cost less than $100 million.\n\nFuel cells are just not technically ready, while batteries clearly are. The energy density isn't technically ready for batteries either, but at $5800/kW fuel cells aren't technology ready for anything really.", "score": 1, "replies": [{"body": "What is often forgotten is that the tanks and fool cells also add a lot of weight to the system, not to mention that the volumetric density is not great either when all stuffed together. The system as a whole actually weighs quite a lot, almost comparable to batteries, and it takes up a lot of space. Then on top of that because the fool cell is far from 100% efficient, it's more like 60%, it generates tons and tons of heat.\n\nLet's say you wanted to use fool cells for a plane. Normally the engine operates at extremely high temperatures and it's basically air cooled plus some evaporation cooling in the fan blades. If you were to have electric motors the maximum temperature you're able to operate at is maybe 90 degrees C before the motors give up. If you have 95% efficient motors you might be able to cool most of it with the cold air going through the fan and some of it you can divert and use the wings as a heat sink, but if you have another 8x heating power to get rid off things just break down.", "score": 2, "replies": []}, {"body": "540.0 kg is 1189.43 lbs", "score": 1, "replies": []}]}]}, {"body": "The example shown were bike and leisure boat ( like coastal line fishing boat ). I was wondering if could compete the Tesla Semi for exemple.", "score": 2, "replies": [{"body": "Hydrogen is just absurd. No, it will not be competitive for a very long time. The problem is just basic physics and reality. \n\nThey’re incredibly inefficient and require tanks at insane pressure turning them into mini-Hindenburgs. The fuel still needs to be shipped all around or made through electrolysis on site and stored in large expensive tanks using expensive power hungry pumps. All of that takes energy which is a big part of the inefficiency. Not to mention the cost and complexity of the fuel cells themselves. This further ads to the inefficiency.\n\nI could see it having something of a revolution in 20-30 years when power becomes basically free and the tech has improved. \n\nOil companies like the idea of hydrogen because they can make it with their crackers from crude or natural gas and distribute it just like oil, but with more difficulty and danger.", "score": 6, "replies": []}]}]}, {"body": "> What's the consensus here about how fuel cell would coexist or compete with battery powered EV ?\n\nAbout 22:73\n\nOr \"throw away more than 2/3 of the energy\".\n\nhttps://aws1.discourse-cdn.com/lesnumeriques/original/3X/3/4/3476599c2c2ee5bff049313df6c803494a524706.jpeg", "score": 5, "replies": [{"body": "France has fortunately a lot of dam so making hydrogen as byproduct of extra energy wouldn't be so dum. But the energy sector is as crooked as anywhere else, so we totally could see some wierd/non efficient way  to produce hydrogen.\n\nWe've bulldozed forest to build a solar panel plant. So anything's possible.", "score": 2, "replies": [{"body": "It could be that once there is enough renewable energy anything that stores it is free basically.", "score": 2, "replies": [{"body": "yeah but you only do that if there is nothing productive to do with the energy, like charging a battery electric car ? because you do get 3 times the driving range than with a hydrogen fuel cell vehicle..\n\nbetter use liquid air storage if you need energy storage ( 25%-70% efficient in the worst case scenario) better than hydrogen, and way easier to handle, by the way, it is possible to carbon capture with this process as byproduct ... so you can CCS if you want to without additional energy usage....", "score": 3, "replies": []}]}]}]}]}, {"body": "Thinking of selling a covered call 1200c 2023 and then buying a 600c 2023. Any downsides?\n\nHave 1 600c 2023 and 135 shares. Would shares some shares for another leap", "score": 2, "replies": [{"body": ">Thinking of selling a covered call 1200c 2023 and then buying a 600c 2023. Any downsides?\n\nSo.. considering the subreddit we're on.. I take it that you have full faith on TSLA going up over the long term, and so you're not concerned with the downside of TSLA falling over the years.\n\nTherefore, the only other downside is that your covered/short 2023 1200c inflates from $87.90 to $800.00 by expiration.. effectively (opportunity) costing you about $71,000 that would otherwise be profit.. all the while you were still taking on a lot of risk with the LEAPS call or 100 shares that 'covered' that short. Not a good trade off imo. It could be that TSLA stays below $1200 by 2023 (I find that very unlikely), and you will have made \\~$8800 in profit, but I personally would never take that chance.\n\nIf anything I would prefer to \\*buy\\* the June 2023 $1200c (along with all your other longs) as opposed to short it 😁 but that's just my opinion", "score": 6, "replies": []}, {"body": "You'll be paying a big premium for the 600, and not getting nearly as much selling the 1200. It's capping your gains for not too much benefit.\n\nI think I'd just buy a $830 call or something like that. Unless you're very confident Tesla will be in the $750-1000 range in 2023 and not any higher or lower.", "score": 3, "replies": [{"body": "Thank you to both of you. Will be adding something in 750 to 1000 call for June 2023.", "score": 2, "replies": [{"body": "i own a bunch of 650c 6/2023 and sell weekly calls.", "score": 2, "replies": [{"body": "How are you adjusting yours weekly CC strategy (if at all) given expectations of FSD subscription/(other?) catalysts being imminent?", "score": 1, "replies": [{"body": "that has been imminent for a while ? and still? and what makes you think people are buying the stock because a risky human AI experiment is released via subscription? 14 weeks running collecting $2500 a week now. when uptrend begins i close out a loss or roll forward; totally fine with me.", "score": 1, "replies": [{"body": "Indeed they have :-). Thanks for the reply and perspective. What % otm do you typically aim for? I was doing 20-25% based on historical probability and it being super safe, but of course that means minimally profitable lol.", "score": 1, "replies": [{"body": "that’s really far otm, risk reward is not good. idk. i do 8-10% otm on green days. usually open on monday or the previous friday, for the following friday. but takes risk tolerance to do that; and eventually you are wrong and have to take the loss of roll forward and hope it doesn’t moon for a month straight, but eventually the stock drops.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Is anyone worried about the S&P500 and Nasdaq tanking over the next few weeks? A lot of buzz about a looming correction. These are big holdings for me and I’m considering exiting and re-entering later.\n\nS&P broke the 16 month support line Friday", "score": 0, "replies": [{"body": "I would be more worried about not being invested in Tesla when a major catalyst like 4680's or FSD occurs. Also, Tesla is way off its high of about $900, so perhaps without any significant catalyst you miss out a climb back there. Maybe the SP500 crashes and TSLA falls from $950 to $600, which selling now accomplishes nothing.", "score": 9, "replies": []}, {"body": "and what if it does? Lol. you gonna sell and time the sell and subsequent buy perfectly??… when it happens it happens. this is why covered calls are important and also keeping 5% cash minimum.", "score": 6, "replies": [{"body": "Not looking to perfectly time, but if you can save yourself a 7-15% loss and dollar cost average back in it wouldn’t hurt. I understand your strategy of weathering the storm tho.", "score": 1, "replies": [{"body": "You can also miss a random 20% up day. Just like this last early March. I learned my lesion early in investing you can’t find the market.", "score": 3, "replies": [{"body": "20% up day? I’m referring to S&P and Nasdaq…", "score": 1, "replies": [{"body": "That makes even less sense then. One variable stock I can see why you think you can time it.  500 stocks?! Good luck! It’s not a taxable account right? If so be sure to factor that in to your level of confidence.", "score": 1, "replies": []}]}]}]}]}, {"body": "Haven’t we been stuck in a correction since February?", "score": 5, "replies": []}, {"body": "We have been hearing this since May last year.", "score": 3, "replies": []}, {"body": "No.", "score": 2, "replies": []}, {"body": "No, I'm not worried. I would hold through any corrections, and I would add to my positions throughout the drop too.", "score": 2, "replies": []}, {"body": "nothing to correct when it is already corrected", "score": 1, "replies": []}, {"body": "Tesla is still down significantly since Jan/Feb, many would argue that the correction has already occurred", "score": 1, "replies": []}]}]}
{"title": "An update from a crazy mostly-options trader", "selftext": "This is an update to [my post](https://www.reddit.com/r/wallstreetbets/comments/b7qz14/ok_wsb_heres_some_gain_and_loss_porn_for_you_all/?utm_source=share&utm_medium=web2x&context=3) from a couple of years ago in which I lost over $50k and then, at the time of posting, had almost made it all back.  What has happened since then?  All kinds of crazy shit.  (So it goes with options.)\n\nSimilarly to back then, I now have an impressive 1 month chart and not-so-impressive all-time chart, so I thought it was a fitting time to give an update.\n\n&#x200B;\n\n[1 month chart](https://preview.redd.it/4wrwsgcnbh671.jpg?width=1440&format=pjpg&auto=webp&s=e5efada36b1d7ce9648acad0590a85431efbe3d8)\n\n&#x200B;\n\n[All-time chart](https://preview.redd.it/zmhx543rbh671.jpg?width=1440&format=pjpg&auto=webp&s=8877a8cdc96cdac0e6203f5b52b57eeb18c33d6f)\n\nAfter I made my post, my account shot up to nearly +$90k.  I actually think it went over $90k, but Robinhood's all-time chart isn't very exact on the numbers.  (Side note: one thing I want to mention about these charts is that the percentages are not accurate according to my account value at the time because I have been depositing over the years... For example, when I was +$90k here, that was actually around a 200% gain at the time, not a 92% gain.)\n\n&#x200B;\n\n[My all-time high](https://preview.redd.it/hoqqy1ptbh671.jpg?width=1440&format=pjpg&auto=webp&s=36b8115cbe938a2d0fa2ec3b66aa7812dc296e76)\n\nHow did I get so many gains?  Well, this was a long time ago, and I make hundreds of trades per year, so I will just focus on some of the highlights in this post and hopefully that'll be good enough for the mods.  My biggest gains during this time were $AMZN calls prior to the 2020 crash and $INO calls and $SPY puts during the crash.\n\nHere's a screenshot I took of one of my $AMZN positions:\n\n&#x200B;\n\n[AMZN gain 1\\/31\\/2020](https://preview.redd.it/q2aqy7ixbh671.jpg?width=1439&format=pjpg&auto=webp&s=b413b81186cca063745a7c9f6c21c6025addb1fb)\n\nHere's a $10k $INO gain:\n\n&#x200B;\n\n[INO gain 3\\/3\\/2020](https://preview.redd.it/4iih5wwybh671.jpg?width=1440&format=pjpg&auto=webp&s=7108da399df140c2677500a49fb5365c41ccff56)\n\nWell, I'm sure you saw that my gains didn't last, and I imagine you're thinking I lost them all during the 2020 crash.  Yes and no.  As I mentioned, I made a lot of money on SPY puts during the crash (I likely didn't screenshot these because it was a bunch of small, quick trades).  I actually only made money during the initial crash and completely dodged that bullet.  So what did happen?  Well, after the stock market rebounded significantly from the bottom, I bet heavily that it would go back down.  And well, as you know, it didn't.  So I lost all of my massive gains to $TSLA and $SPY puts after the rebound only kept going up.  I managed to find a screenshot of some of those losses:\n\n&#x200B;\n\n[Some SPY put losses 4\\/8\\/2020](https://preview.redd.it/q6xvm1hdch671.jpg?width=1426&format=pjpg&auto=webp&s=db354d6bb5cea7b9dd4b081ee2abc9bf57d6da45)\n\nOnce I lost all of my gains, I just sold everything and took a break from risky trading.  You can see the chart is mostly sideways for 6 months before it plummets again.  This plummet I lost over $60k, even more than my old losses that I crawled back from.\n\n&#x200B;\n\n[New all-time low](https://preview.redd.it/3d30zf4vdh671.jpg?width=1440&format=pjpg&auto=webp&s=2da69f1e157782c71906ab00e39a701006ccf2c3)\n\nSo how did I get those massive losses again?  Well, in late 2020/early 2021 I lost to $TSLA puts and $GME calls.  Both of these were good buys, I just sold them too soon.  My TSLA puts were bought when TSLA was over $800, but I got impatient and sold a few weeks before it would've made me money.  GME... Well, I don't want to talk about GME.  I sold just before it went crazy.  My position would have made me a millionaire.  I took a screenshot of my position before I sold because I had a feeling I would regret it.\n\n&#x200B;\n\n[GME position 12\\/9\\/2020](https://preview.redd.it/zknq2bklch671.jpg?width=1440&format=pjpg&auto=webp&s=e6ac53d8bbc8970c5c322b4ae27d68ede8ea613d)\n\nI bought in on the GME squeeze thesis posted here in WSB, and I still believed in it at the time I sold.  But I had commented here that I was in on it, and I started to worry about the legality of it and decided it wasn't worth it.  What an idiotic decision.\n\nThe TSLA puts and GME calls weren't actually the majority of my losses, though.  That honor goes to my next position, $PFE calls.  This was actually another well-timed buy that went wrong because I sold too soon.   I bought PFE almost exactly at the bottom in late Feb stock-wise, but as the stock kept rising, my options kept deteriorating.  Eventually, I couldn't handle watching my options and account fall to near zero while the stock kept rising, and I gave up and sold.  Had I held on another week, I would have made all of my money back.  Another 2 weeks, and I would have had big gains.  I didn't screenshot this disaster and would have to dig through my history for details, but I feel like no one would care to have these details.  Suffice to say it was about 1,000 call options the decayed despite upward stock movement.\n\nAnd thankfully, I made back all of my losses anyway, as you can see from my all-time chart.  After all of my disasters, I decided I was done with short-term trading and was just going to invest via LEAPs in some high growth companies.  So I did some DD and bought LEAPs on companies I thought were undervalued, most notably $SPCE, $XPEV, and $WISH.  I bought these planning to hold long term and didn't expect these would rocket higher immediately after I bought them.\n\nI didn't screenshot full positions, but here are some of the trades in my history if you feel you need proof for the recent gains.\n\n&#x200B;\n\n[SPCE buys](https://preview.redd.it/fr4u3i62dh671.png?width=716&format=png&auto=webp&s=9019221417f56ce97cb827ae25540d2c18820cd8)\n\n&#x200B;\n\n[SPCE sells](https://preview.redd.it/7fb30dt3dh671.png?width=712&format=png&auto=webp&s=8bd46e160981d9bea69e7be2199acc6fda5f5ba3)\n\n&#x200B;\n\n[XPEV buys](https://preview.redd.it/6vhafze8dh671.png?width=714&format=png&auto=webp&s=bc543ee9d002978c3ba8e75bff0c7ff682fbf5e1)\n\n&#x200B;\n\n[XPEV sells](https://preview.redd.it/pco0yzy9dh671.png?width=727&format=png&auto=webp&s=fb209ac22850b9a5f3fab10029ca2eea2347a5a3)\n\n&#x200B;\n\n[WISH gains](https://preview.redd.it/doe68wjgdh671.jpg?width=1440&format=pjpg&auto=webp&s=826e8870c8389a81aa95ee2dab83ce5df38e864c)\n\n(I made more money than is shown in these screenshots; again, they're not the full positions.)\n\nI also liked someone's DD here of $CLOV, and decided to take a small position in CLOV as well.  This screenshot is just before selling, so luckily I held onto these gains:\n\n&#x200B;\n\n[$4.5k into $31k.  Nuts.](https://preview.redd.it/dm35dtkldh671.jpg?width=1437&format=pjpg&auto=webp&s=c3593cc7ecb91f46b4455ff8fa8655f4ef8652d7)\n\nI closed most of these positions.  So where am I now?\n\nActually, I'm back heavily in $WISH.  Here's my current WISH position:\n\n&#x200B;\n\n[WISH current position](https://preview.redd.it/g0hywmp2eh671.jpg?width=1440&format=pjpg&auto=webp&s=4a08b1cf153dae3812d85292e5e7b06e9045a4f4)\n\n(These screenshots are from Thursday but they're close to the same value now).  I could go into detail telling you why I like WISH so much right now, but there are plenty of DD posts to be found.  What it boils down to is that this thing is still at less than half of its IPO value, and I think it's severely oversold for a growing e-commerce site, regardless of what some people might think of the products.  You think the quality of products is too cheap to be successful, I'll just kindly point you in the direction of $DG and its chart.  Note I bought a lot of WISH shares here even though I don't usually buy shares.  The premium on WISH options is a bit high, and I'm trying to chill out a bit after my massive unexpected gains this last month.\n\nI also have smaller positions in $ACAD, $AYX, $QS, and $RUN.  I like a lot of other stocks right now, but I just have my money tied up currently.  For example, I want to start new positions in $PLTR, $OPEN, $SNOW, $F, $AEVA, and $VIEW when I get a chance.  I also want to get back in $SPCE and $XPEV if I get a dip, as well as hoping for a dip in some others like $DIS and $DDD, and a ton of other companies whose stocks are just too expensive for me at the current moment.  I also don't think you'd be wrong to be into metals, especially nickel.  Hopefully I haven't mentioned any banned tickers here.  There are a lot of multibagger opportunities out there right now, imo, assuming hyperinflation and rising interest rates + QT don't cause a massive bear market, of course.\n\nAlthough I feel like I'm decent at this, I also felt like I was decent at it before I lost $150k in 2020 and 2021 from high to low.  To be fair to myself, the measures the government and Fed took to prop up the market/economy were unprecedented when I bought those SPY puts, and most of the recent losses on TSLA and PFE were good buys but bad sells (i.e, sold too early).  But that doesn't change that I ultimately made a bad trade.  Anyway, you can ask me for options or trading advice and I'll try to answer, but honestly right now I'm still not feeling the most qualified.\n\nOne last thing, a lot of people down $50k (which was like 90% of my account at the time) or my recent $65k losses would have thrown in the towel on options completely.  I'm proof you can turn it around... I've done it twice now.  That said, I'm also proof that you can lose it all quickly in the options world.  I wouldn't advise most people to do this.  I have separate retirement funds, college funds for my children, and make a decent living with a relatively secure job.  I would be okay if I lost it all.  This is just me trying to win a ticket to early retirement.  But don't do it if you can't afford to lose it.", "id": "o4ejeg", "created_utc": 1624221602.0, "score": 416, "upvote_ratio": 0.89, "num_comments": 97, "comments": [{"body": "Great look into the trades and results. Appreciate the transparency. \n\nAnd, hey; green is green. Congrats and fuck you.", "score": 125, "replies": [{"body": "Oh yeah nicely done 👏🏻 \nFuck you and congrats.", "score": 25, "replies": []}]}, {"body": "i know this is wallstreetBETS and all, but that last sentence is the absolute key", "score": 78, "replies": []}, {"body": "I hope to turn it around like you did. I made the best call option trade of my investing career with BB. I bought 40 LEAPS for 2k in March. Sold them about 3 weeks ago for 24k. Then just last week my dumb ass got greedy and brave. I bought 900 calls of CLNE. And for some dumb reason I picked the 6/18 expiration. Idk why I didn’t do leaps like I’ve always done before. To make a long story short, all those BB gains vanished in the blink of an eye. I’ll get back on track and back in the green side of options. Congrats and thanks for the pick me up.", "score": 42, "replies": [{"body": "Early on when I first started trading, I took shots on weeklies and monthlies.  It almost never worked out, and the money disappeared fast.  I generally try to stick to LEAPs myself now, and part of the reason I sold too early on the TSLA puts and PFE calls was because I broke that personal rule and started to feel the pressure of theta and IV decay, ultimately causing me to chicken out and sell.\n\nI'm back to trying to stick to LEAPs, but for my WISH position, when I initially bought in at least, Jan. 2022 was the furthest available so I was forced to break the rule again to take the position.  I could roll them out now, since I think Dec. 2022 is available now, but I'm feeling a little too confident about the play, and I always feel like I lose to the spread when I roll options out....  Hopefully I'm not about to head back down for breaking my own rules again.\n\nGood luck man.  It sounds like you just lost the gains and not the main account, so you hopefully still have a good launching point.", "score": 11, "replies": [{"body": "My buddy made a joke and said I needed to tattoo a frog somewhere on me to remember to do leaps only lol. Maybe you need one also haha. But yeah it was only my most recent gains. I had plans to put it all into MVIS leaps but saw all the CLNE talk and dove in. But I also had a selling too early screw up in the GME saga. I had a 60$ call option I bought for $2k. I panic sold when it went from $115 to 65$. I made $900 still. But that same call was worth $27k two days later lol. I was like you’ve got to be kidding me. I was upset, but it was green and I didn’t lose anything. Are you buying OTM Leaps or ITM leaps for WISH?", "score": 3, "replies": [{"body": "Haha, yeah, the tattoo might not be a bad idea.  If I lose my money a third time... Might consider it as punishment, lol.\n\nI've got 20 x $10 calls and 60 x $15 for WISH.  I almost always buy slightly OTM and plan to sell those $10 calls on a good spike (10-15%) and just hold the $15 for a while.", "score": 6, "replies": [{"body": "Smart play. I do a couple ITM like that and the rest I go far OTM. Usually the farthest out. I chose $40 leaps for BB and they went from $52 each to $600+. These WISH leaps I planned on getting anyway I may do a few ITM some barely OTM then the rest far OTM. I wish you well and hope you strike an early retirement this year or the next. Thanks again for the confidence booster.", "score": 8, "replies": [{"body": "Thanks man.  A word of caution on the far OTM options... I used to do that, too, until I started having problems in low volume/low liquidity stocks with selling them.  Don't recommend it unless you're in a highly liquid stock... And even then, if the stock moves the wrong way, you could end up with no one to sell them to.\n\nThat said, if the stock moves the right way, you can make millions.\n\nGood luck!", "score": 6, "replies": [{"body": "Very true. Yeah I don’t think I’ve done leaps far OTM on a stock that hasn’t been plastered everywhere yet. But definitely a thought to keep in mind if I find what I believe to be a hidden gem.", "score": 2, "replies": []}]}]}, {"body": "What’s your expiry date? Reading all this made me realize i keep wanting these short term gains cuz i’m impatient. Currently have 4 calls for WISH expiring 7/16 and i’m pretty red on them. Kinda scared it won’t go back up. After this i’m sticking to LEAPS or just shares lol", "score": 1, "replies": [{"body": "Yeah, I bought out as far as I could when I first entered WISH, which was Jan. 2022.  I kept with that expiry for now, although Dec. 2022 is now available and normally I would go with that.", "score": 1, "replies": []}]}]}]}, {"body": "I’m happy for your comeback. But I’m a little confused. Are you back to what you started with? Or still down? Congrats on the comeback.", "score": 2, "replies": [{"body": "The all time chart that is +$16,800 is accurate, although that was from Thursday and the small gain from WISH on Friday has me up another $1,000.  My account is so volatile, a $1k difference is practically meaningless to me, though.  Futures don't look great, so if Wish follows the market, I could lose something like $10k tomorrow, lol.\n\nThanks for the congrats.", "score": 3, "replies": []}]}, {"body": "What is LEAP?", "score": 1, "replies": [{"body": "It's just what they call options that expire at least a year out.\n\nLong-term Equity AnticiPation Securities (LEAPS)", "score": 1, "replies": [{"body": "Got it, thank you 🙏🏻 Are puts and shorts the same?", "score": 0, "replies": [{"body": "Please [read through the FAQ](https://www.reddit.com/r/wallstreetbets/wiki/faq) if you have to ask these questions.\n\nEdit: Although puts are mentioned in the FAQ, I actually didn't see shorting, so I'll be nice and answer your question.  However, I do want to mention WSB isn't intended as a place for new investors and asking questions like this has been historically frowned upon.\n\nNo, puts and shorts are not the same, although both are bets that a stock will go down.  Shorting involves shares... think of it as the opposite of going long shares.  Puts are contracts, think of them as the opposite of calls.", "score": 4, "replies": []}]}]}, {"body": "Usually leaps are in the money calls too. Low break even price and high delta. But...more expensive to buy", "score": 1, "replies": []}]}, {"body": "Can I ask, how do you decide how far out to go with LEAPs? I know the best thing to do would be to buy like 1.5-2+ years out, but I don't know if it's that more capital efficient than, say, buying 2 9-12 month LEAPs rather than a single 1.5-2+ years LEAP.", "score": 1, "replies": [{"body": "I try to get as close to 1 year as I can.  To be honest, if my account grows, I will probably buy shorter dated options more regularly... I'm a little more carefree with my profit money, although my experience tells me never to go less than 6 months unless I just feel like gambling / buying a lotto ticket.\n\nIf my stock isn't moving up faster than theta is decaying within a few months, it's time to re-evaluate, and roll out my contracts if I still like the story, or sell 'em and move on if I'm having doubts.\n\nI haven't done the math on capital efficiency, but I imagine that's largely dependent on how good you are at picking a good stock at the right time.  If you're terrible at it, you probably want longer dated options. If you're great at it, go for the shorter dates.  If you think it's all just a coin flip... buy stock instead of options; it's honestly not worth the stress if you don't think there's any skill involved, unless you're just in it for the fun.", "score": 3, "replies": []}]}]}]}, {"body": "Dear diary:\n\nI have a 0% profit since 2018.", "score": 18, "replies": [{"body": "More like a net loss.  Think of all the stress, sleepless nights.. missed opportunities for trips to Cancun & Ibiza to get pussy.. fat rolls accumulated on stomach, bad skin..  \n  \n**This is not a gain post my fellow retards.**\n-----------", "score": 9, "replies": []}]}, {"body": "Some of these charts look more wild than my last ECG", "score": 15, "replies": [{"body": "Whoa, are you like okay?", "score": 6, "replies": []}]}, {"body": "God damn what a roller coaster.  Impressive losses and gaines", "score": 7, "replies": []}, {"body": "Thanks for the brutal honesty and the porn!  Good luck in the future.", "score": 9, "replies": [{"body": "Thanks, you too", "score": 2, "replies": [{"body": "Bro i feel you on gme, sold around the same time you did.\n\nThat shit hurts man\n\nCouldn't look at Reddit front page for like three weeks", "score": 2, "replies": [{"body": "Sorry bro... I hope the stock gods will make it up to us and bless us with some retirement-level gains in the not so distant future.", "score": 2, "replies": []}]}]}]}, {"body": "What are the most important things you consider before entering a position whether it be calls or puts", "score": 7, "replies": []}, {"body": "What’s the biggest lesson you’ve learned in your years of trading?", "score": 5, "replies": [{"body": "That's a tough one because there have been a lot of lessons.  But I would say: to not be afraid of the gains you might miss out on by selling or by not taking a bigger position.  There are always other opportunities, and you shouldn't become personally attached to a stock or afraid of being wrong.  In fact, better to assume you are wrong and have a plan in place for when it comes true.\n\nI don't know if that was one lesson or several, but it all boils down to not becoming stuck or attached to a particular stock/company.", "score": 15, "replies": [{"body": "> not be afraid of the gains you might miss out on\n\nyep this right here, as the old saying goes \"country clubs are full of people who took profit early\"", "score": 8, "replies": [{"body": ">Long-term Equity AnticiPation Securities\n\nYou learn this lesson playing Poker at lot faster.", "score": 1, "replies": []}]}, {"body": "Good advice, thanks! I’ve only been trading/investing for about 6-7 months, so am constantly trying to learn. \n\nYou’re back into Wish you said too? Can I ask for your thought process on that one? \n\nSeems like high reward/risk ratio at these price levels, so I like that, but the service feels worthless to me. The company won’t be profitable for another 1-2 years, even if their MAU keeps increasing, which I feel will stagnate sooner rather than later. Plus they spend 75% of their revenue on marketing currently.  Is there a demographic component of this I’m missing? \n\nI would like to take a chance here because the sentiment is so high. Looking for any reason to give it a shot. I’m currently in $WKHS as my momentum/squeeze play.", "score": 3, "replies": [{"body": "I can't really vouch for the long-term sustainability of WISH.  That's going to depend on whether management can execute.  So far, they have executed pretty well, but I tend to agree with others that the platform seems terrible.  It's not for me, at least.  There are certainly demographics that like cheap products and their revenue has been growing, but I do believe they'll have to improve it to survive long term.\n\nThat sort of long term sustainability doesn't really concern me, though.  I'm in it for a trade, not an investment.  My thesis is that it's currently severely undervalued *based on current available information* and also that the current hype, short covering, and bullish analyst sentiment should drive the price significantly higher before the next ER as long as no more bad material information comes out. Additionally, IV should continue to grow as ER approaches.\n\nThere is a good chance I sell all of my options before ER, win or lose.  Whether or not I keep the shares will depend on the current price and any new material information that might have come out before then.", "score": 4, "replies": []}]}]}]}, {"body": "Congrats and thank you for the exposition and screens.\nI working too hard at climbing back up out of an idiot hole I dug myself last year. I know how you feel. Cheers and good luck! Should be a good 2nd half of this year.", "score": 5, "replies": [{"body": "Cheers and good luck to you as well!", "score": 1, "replies": []}]}, {"body": "Good shit", "score": 6, "replies": []}, {"body": "You are trading options on RH? They give the absolute worst fills, I'd rather pay commission to a real broker and get better fills", "score": 4, "replies": [{"body": "Who do you reccomemd?", "score": 2, "replies": [{"body": "TDA, fidelity, tastyworks", "score": 3, "replies": []}]}, {"body": "Problem is the supposed savings I'd get from another broker on fills are intangible and unquantifiable.  Maybe if I had some hard data to go off of, I'd make the switch, but right now all I have is anecdotal evidence.  And because I'm placing limit orders within the bid-ask spread and can see the volume and most recent fills, I tend to believe switching brokers wouldn't make an appreciable difference on my options fills.\n\nHowever, that 0.65 I save per contract on RH is quantifiable and appreciable.  I trade thousands of contracts per year (my PFE position was 2,000 contracts alone), so I know that I am saving thousands of dollars by trading options on RH.", "score": 1, "replies": [{"body": "It's not supposed savings. RH literally makes money selling order flow and you don't get best execution. Let's use your example, bid/ask is 0.10/0.15, and you bid market price. You bet on RH you will get filled at 0.15. On fidelity you might get filled at 0.12, that is a $3 savings per contract, well worth the $0.35 you would pay for commission. \n\nI have used multiple brokers, you would save much more than 0.65 per contract based on fills alone. If you don't believe me, open an account at any other legit broker, trade a small position on both accounts and tell me you don't get better fills. The savings are VERY obvious on large bid/ask spreads.", "score": 3, "replies": [{"body": "I'm on the fence about it... Maybe I will run an experiment, like you said, and order the same contracts on two different platforms and see what happens.", "score": 2, "replies": [{"body": "Webull as far as I know doesn't do pfof", "score": 1, "replies": [{"body": "Did some searching and it looks like they do pfof as well.", "score": 1, "replies": [{"body": "Call it anecdotal, but the fills do seem better", "score": 2, "replies": []}]}]}]}, {"body": "He just said he puts in limit orders so the market price argument is irrelevant for him", "score": 2, "replies": [{"body": "You have a much better chance of being filled at your limit price on a legit broker. I have run orders on both RH and another broker before at limit price, and get filled instantly on the legit broker but never filled on RH. \n\nOn a legit broker, they will also fill below the limit price sometimes for best execution. On fidelity and TDA, I have put in limit orders at the midpoint between bid/ask and got filled below my limit. You will never see that with RH.", "score": 6, "replies": [{"body": "To be fair, I only used TDA (ToS), my RH accounts is collecting dust but I did get their $200 bonus for holding some cash there temporarily.", "score": 1, "replies": []}]}]}]}, {"body": "Dam I never thought PFE would have a lot of options trading activity given it's price fluctuations the past year. Doesn't really move up or down that much", "score": 2, "replies": []}]}]}, {"body": "All that work and your only up 17% on the all time.", "score": 3, "replies": [{"body": "Yep, I would have made significantly more money in an S&P 500 mutual fund at this point.\n\nI'm trying to chalk it up to learning important trading lessons that will benefit me in the future, but that might prove to just be wishful thinking, lol.", "score": 10, "replies": [{"body": "Options are often more work than their worth. I'm trying to move to share trading but it'll be a long time before I recoup all my option losses.", "score": 3, "replies": []}]}]}, {"body": "Your a crazy son of a bitch", "score": 3, "replies": []}, {"body": "Sir, say it with me, I’m a degenerate gambler & love this 🎰 casino. \n\nCongrats, if you got $ in play ur still in game.  All options are about timing & it requires losing ur ass to learn.", "score": 3, "replies": []}, {"body": "Great post!!!!! I had some losses as well for selling too soon and also not taking profit before others did.", "score": 3, "replies": []}, {"body": "Thanks for the post! Enjoyed reading it 👍 I too have been on quite the gain / loss journey over the past year or so also. Decided to follow to see where your next trades take you I also agree wish seems way oversold even without everyone here trying to pump it.Good luck!", "score": 2, "replies": [{"body": "Thanks, you too.  I'm sure I'll do another update eventually... Hopefully one of them will eventually be \"Well, WSB, I've just retired...\"", "score": 3, "replies": []}]}, {"body": "Great job on the comeback! Truly inspiring and motivational! \n\nTrading has its share of ups and downs! Its never straight up as all of us hope 😅", "score": 2, "replies": []}, {"body": "Pour one out for that GME. I did the same thing as you but with a lot less to gain (woulda made about 12k) so yours made me feel better. Thank you.", "score": 2, "replies": []}, {"body": "Have you avoided doing AMC options?  I'm new to options, but I am also in Wish like yourself, if AMC goes down or up I jump in on the options, made quite a bit doing that, one of my favorites is buying options on Friday, usually bumps a little on Mondays.", "score": 2, "replies": [{"body": "Yeah, I haven't been involved in AMC at all.  To be honest, I tend to avoid WSB when I have huge losses because all of the gains posts depress me when my account is deep red.  So I think I missed most of the hype with AMC, as I had massive PFE losses at the time, and I never really read the DD on it.  I did know it was a thing, but I guess I assumed hedge funds wouldn't make the same mistakes as GME and never looked into the details.  I still haven't really read the DD, to be honest; I've just been assuming I missed the boat already.  I definitely could be wrong on that, but I don't plan on jumping in at this point.", "score": 2, "replies": [{"body": "I hear you, I don't think there is any DD for me on AMC I just watch the volume, I am new to options but when I see that volume go up way high I know a stock like AMC can make a little 10%-15% run, so I've been riding those runs up, selling calls, buying puts and riding it down.  AMC has dried up a little now, but oh boy Wish", "score": 1, "replies": []}]}]}, {"body": "Nice blog! Subscribed! 👍", "score": 2, "replies": []}, {"body": "I also would've been a millionaire off GME but fucked up.  \nThen I went to options, and wound up writing sideways calls on AMC b/c Fidelity says you need experience to get options. So I missed out on getting at least $100,000.  \nAnd now I have gone back to RobinHood, which I initially passed on b/c it's impossible to set up on PC... though thankfully it finally works on PC if you set it up via ipad.  \n\n\nSo much fucking money I've missed out on, but at least I've stayed sideways. Wakeup call to be more careful was wondering if I could get my IRA account to trade options... then I remembered that's my fucking *retirement* account, not goddamn play money, so I've backed off and missed out on nothing since. Trying to reduce my overall investments and figure out how much I can *really* afford to lose/play with versus the YOLO I got into with $40k savings.  \n\n\nThis sub both inspired me into trading, brings me joy, and leaves me thankful I haven't gone and tanked like some posts have, while also giving me hope that I can take a smaller, safer sum, and make something of it.", "score": 2, "replies": [{"body": "Sorry to hear man.  I'd say at least we aren't alone in our misery, but I'd really rather we just both be millionaires.\n\nI've done the wondering about options in my IRA thing, too, but luckily, I'd have to get approved for it first, and I ultimately decided to intentionally never apply for options so I'm not tempted.  I did decide to start picking stocks for it, though, rather than put it in a mutual fund... Even that makes me a little nervous since it's meant to be my retirement.\n\nGood luck man.", "score": 1, "replies": []}]}, {"body": "Oh look it’s my portfolio. Even leaps can screw you over if you bet on the wrong stock and refuse to sell", "score": 2, "replies": []}, {"body": "TLDR: ME NOT 💎👐🦍. ME 💎👐🦍 NOW.", "score": 2, "replies": []}, {"body": "The 1st rule of investing is dont lose money, the 2nd rule is don't forget rule no1", "score": 2, "replies": []}, {"body": "I am pretty sure you will be at around 200k by end of this year with your current position. Well done.\nLast but not least, congrats and $WISH you 🚀🚀🚀🚀", "score": 5, "replies": []}, {"body": "bought something off $wish to test er out \n\nhttps://www.reddit.com/r/wallstreetbets/comments/o4jnl9/well\\_i\\_had\\_to\\_see\\_what\\_all\\_the\\_wish\\_hype\\_was\\_about/?utm\\_source=share&utm\\_medium=web2x&context=3", "score": 2, "replies": []}, {"body": "great job, one of the few that made it. \n\njust dont turn around there are 9 million people behind you with -99% accounts :)", "score": 1, "replies": [{"body": "Oh man, I hope it's not that many who hit bottom.  I see all these gains posts on here and often wonder how misrepresented the gains are.\n\nI could have posted just my gains over the last month without the complete 3 year picture, but just think how misrepresented reality would have been if I did that.", "score": 2, "replies": [{"body": "only around 1% are profitable while 99% are not. These are real stats based on studies. Very few make money", "score": 6, "replies": [{"body": "There's a reason the MMs are so profitable. Most options expire worthless regardless of how many times they change hands before expiration.", "score": 2, "replies": []}]}]}]}, {"body": "Im up 79k in the last 20 days. From 2.4k to currently 75k withdrawn 6kish. When do the losses come? \n\nI know the heater ends eventually. BB,CLOV, WOOF were the big winners and currently 26k deep into NNDM.", "score": 1, "replies": [{"body": "You did all calls from 2.4k to over 50k? that's a nice ass chart man", "score": 2, "replies": [{"body": "Yea to 80k technically!", "score": 1, "replies": []}]}]}, {"body": "I don’t knew why I don’t see TSLA anymore", "score": 1, "replies": []}, {"body": "I remember losing 80k in one day. I even went to my day job that day in my day off without noticing. My mind needed a break.", "score": 1, "replies": [{"body": "Damn.  I hope those were profits or that you made it back eventually.  Sorry to hear.", "score": 1, "replies": []}]}, {"body": "If you had just $1k today what would you put it in?", "score": 1, "replies": [{"body": "That depends on the goal... Short term gains or long term gains?  I assume options.\n\nI had some money today, and I put it in $INO LEAPS as a long term moonshot.  But I have a bigger long term bet on $QS already in place, which is where my money would've gone first if I didn't already have that position.\n\nFor a shorter term potential large gain / gamble, I still like $WISH.  I think it's getting ready for a move up to the $16 area.\n\nThis is for options.  I like these as stock buys, too, but there are a ton more I like as stock buys, and I would spread my money across at least 25 stocks I really like.\n\nTo be honest, although I like a lot of stocks right now, they're all rallying right now, too, and that makes me nervous we might be in the midst of a blow off top.  Tread carefully.\n\nNot financial advice :)", "score": 1, "replies": []}]}, {"body": "What are your thoughts on some far out LEAPS on PSFE right now seeing the over reaction to their last earnings. Also SPCE has dropped quite a bit from its highs earlier in the year. 🤑🤑🤑🤑", "score": 1, "replies": [{"body": "I've been eyeballing both of those.  I honestly think they're great plays, but I haven't taken a position myself, mostly because I'm worried it could be a very long time before they recover.\n\nTo be fair, though, I have LEAPS on OPEN, and I think it could be a very long time for that one, too.\n\nBut with enough patience, I think those are both great plays.", "score": 2, "replies": []}]}]}
