{"title": "Nike Stock jumps 12% after-hours. Earnings smash estimates, and China sales up despite boycott.", "selftext": "[deleted]", "id": "o7akj8", "created_utc": 1624574177.0, "score": 474, "upvote_ratio": 0.91, "num_comments": 100, "comments": [{"body": "Lol nothing to do with earnings smash. It's going up because I sold all my Nike shares right before earnings, that's all.", "score": 204, "replies": [{"body": "Thank you for your sacrifice. Did you buy FedEx before earnings? Is that why the stock is dropping?", "score": 46, "replies": [{"body": "Did not buy the stock, bought calls instead.", "score": 31, "replies": [{"body": "Could you let me know what other stocks/calls you're holding?", "score": 4, "replies": []}]}]}, {"body": "This is why I never pull out", "score": 9, "replies": [{"body": "u/DillaVibes has many children", "score": 3, "replies": []}]}, {"body": "Either that or someone just discovered selling covered calls.   That'll usually do it too.   Lol", "score": 3, "replies": []}, {"body": "lmao. It happens all the time to me too", "score": 2, "replies": []}, {"body": "Yep, I dumped all I had yesterday to make you all money", "score": 2, "replies": []}, {"body": "Earnings is always a coin toss. I believe Nike also beat earnings last quarter, but it went down afterward.", "score": 1, "replies": [{"body": "Not true they missed revenue by 6 percent last earnings", "score": 2, "replies": [{"body": "Yeah, revenue missed estimates last quarter, but the earnings beat.", "score": 4, "replies": []}]}]}, {"body": "😂😂😂😂😂😂😂😂😂 ding dong over here thinks he made a big brain move.", "score": 0, "replies": []}, {"body": "Thanks. Next time I'm in China I buy some fake Nikes and give them to you.", "score": 1, "replies": []}, {"body": "☝️", "score": 1, "replies": []}]}, {"body": "If sales are up in china, it wasn't a real boycott....", "score": 47, "replies": [{"body": "China never succeed in any kind of boycott against big brands.\nAlmost every time it is the official CCP and extreme nationalists who initiate the boycott but the population just don't care unless CCP is serious and start banning the brand.", "score": 24, "replies": [{"body": "When are people gonna stop treating China as if it's some single entity? \"China\" boycotting is no different than:\n\n* Reddit boycotting Tiktok\n\n* Nike boycott after the kneeling incident\n\n* people boycotting NBA after LeBron's remarks regarding CCP\n\n* Americans boycotting Chinese made goods\n\n* People boycotting Facebook/Amazon/big tech\n\nThese \"boycotts\" have all done nothing, just like the \"Chinese Nike boycott\". The reality is that the \"boycott\" is portrayed by the media as something significant but in reality it's rather minor. \n\nThere's 1.5B Chinese people. A few million that decides to boycott Nike on Weibo (Chinese Twitter) doesn't mean shit. But of course people will gobble it up after Western news reports \"China boycotts Nike.\"", "score": 40, "replies": [{"body": "Because they don't have a better alternative.\n\nThere's nothing better than NBA if you want spectator basketball.  There's nothing better than Nike for their sneakers.\n\nIf there is something potentially better on the horizon, the Chinese boycott does and can hurt companies and even nations. \n\nSuch as Australian coal and iron ore, wheat, livestock and even wine. Australia is feeling the brunt of the boycott.\n\nI believe Tesla are in a precarious position being in China and sharing their trade secrets to competitors like Nio.  It's only a matter of time before those decisions turn around and bite them in the ass..\n\nChina is not to be messed with.", "score": 1, "replies": [{"body": "> Such as Australian coal and iron ore, wheat, livestock and even wine. Australia is feeling the brunt of the boycott.\n\nI disagree with this being a \"boycott.\" This is actually the Chinese government taking actions against Australia with a trade embargo. These actually do work. This is the same as a Trump tarrif on China. As far as I know, there's no official CCP stance regarding any form of embargo against Nike.\n\n>I believe Tesla are in a precarious position being in China and sharing their trade secrets to competitors like Nio. It's only a matter of time before those decisions turn around and bite them in the ass..\n\nPossibly but as long Biden and future admin block Chinese EVs into America, I think Tesla (and F, GM, etc) can still strive. Next step would be to form a collation with EU to block the sales of Chinese EVs. But I think that might be too late because I believe NIO will be deliverying to Norway this year.", "score": 1, "replies": []}]}, {"body": "Silent majority hide behind the loud minority.", "score": 1, "replies": []}, {"body": "And the latest Korean boycott Japanese.", "score": 1, "replies": []}]}, {"body": "My alibaba stock says otherwise 😂😂", "score": -1, "replies": [{"body": "You think Chinese stopped using Alibaba Taobao? \nThe stock tanks because CCP doesn't like what Jack Ma said. It's not like chinese population care. There never was a boycott to alibaba.", "score": 17, "replies": [{"body": "I agree I just want baba to go up.... wondering if it will hit 175 or 200 first", "score": -5, "replies": [{"body": "Maybe 270 first instead?", "score": 2, "replies": []}]}, {"body": "Exactly. I’ve been adding baba every other month. PE ratio of 25 for a business almost similar to AMZN feels like a no brainer", "score": 1, "replies": []}]}]}]}, {"body": "You can’t boycott in China, it’s not allowed /s. Look at Hong Kong….", "score": 1, "replies": [{"body": "Yeah, it just keeps proving over and over that it is the worst country on the planet. It just doesn't get as much recognition as America for some reason", "score": 2, "replies": [{"body": "The government is what’s hindering the country’s economy. Just look at Jack Ma for an example with his Alibaba, who’s stock and and capital is being effected/restricted. Why innovate in an environment without freedom to do so?", "score": 0, "replies": []}, {"body": "Lol worst country on the planet? Really? Pretty sure that’s factually false", "score": 0, "replies": []}]}]}]}, {"body": "very expensive stock. Very strong brand but you can’t justify their valuation", "score": 91, "replies": [{"body": "Yea I don’t really understand their valuation even when you factor in their brand name but that’s just me.", "score": 25, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Nike and Tesla are neither the same industry or have the same potential", "score": 15, "replies": []}, {"body": "You're correct. One company has the potential to change the world and arguably has already. The other makes shoes using cheap labor and marks them up to make profit.", "score": 7, "replies": []}]}]}, {"body": "Tuff to justify many stocks valuations in this current market", "score": 20, "replies": [{"body": "but Nike isn’t even a growth stock but trades like one", "score": 37, "replies": [{"body": "This is true for a lot of consumer goods companies. It's honestly baffling to me. \n\nRelatively speaking, in terms of other segments, mega-cap tech companies look cheaper now than almost anytime I can remember in the least 5 years.", "score": 22, "replies": [{"body": "100% 401k in blue chip growth and over 50% of my Roth is in AMZN/Goog/APPL/MSFT so I agree", "score": 6, "replies": []}, {"body": "Some academics say that the recent outperformance of the us largely is due to pe expansion and international and emerging is due for outperformance", "score": 3, "replies": [{"body": "I always hear this and I don’t necessarily disagree but I feel like I’ve been hearing this for a few years now lol", "score": 10, "replies": [{"body": "Yeah same actually, i guess it’ll eventually come true lol.", "score": 3, "replies": [{"body": "This is why I just periodically rebalance to maintain a certain percentage of my portfolio in VFWAX.", "score": 1, "replies": []}]}]}]}]}, {"body": "I agree.... got your eye on anything in the next few weeks?", "score": 2, "replies": []}]}]}, {"body": "As if stocks are actually priced based on valuation lol\n\nThey’re not. It’s all bullshit. It’s all based on sentiment.", "score": 12, "replies": [{"body": "short term, sentiment\n\nlong term, fundamentals\n\npeople will disagree how to value the fundamentals of a company, or what is overpriced etc\n\nbut companies that grow revenue and earnings year over year tend to have stock prices that go up and to the right over the long run", "score": 8, "replies": [{"body": "Idk who downvoted this but it’s 100% correct. Companies with growing revenues, profits, free cash flows trading at a low valuation relative to those numbers outperform the market over the long term. Short term nothing is guaranteed.", "score": 1, "replies": []}]}]}, {"body": "OK GUYS\n\nNike dumps at market open?\n\nor goes up to $155?\n\ni have my sell order for 155, bought at 133", "score": 5, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "throws money at tesla", "score": 1, "replies": []}]}, {"body": "Nike has a very strong online presence - seamless buying, returns, customer service etc. also when you don’t have the opportunity to shop brick and mortar you go with the brand you already know.", "score": 12, "replies": []}, {"body": "Love my Nike stock", "score": 17, "replies": [{"body": "Love my Nike socks", "score": 11, "replies": [{"body": "Love my Nike shirts", "score": 2, "replies": []}]}]}, {"body": "I’ve made some bad stock decisions in the past 16 months but it feels damn good when you hit on one and have been sitting on it for months as it hits an all time high.", "score": 7, "replies": []}, {"body": "What a monster of a quarter Nike had. And y’all were panicking a couple months ago because a gymnast decided to leave Nike.", "score": 27, "replies": [{"body": "Haha I remember that... everyone goes to Nike to buy women’s gymnastics clothes 😂😂😂", "score": 22, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Who cares so do most company’s.... I’m trying to make money", "score": 20, "replies": [{"body": "[deleted]", "score": -9, "replies": [{"body": "What are your moral belief company’s?", "score": 4, "replies": [{"body": "[deleted]", "score": -13, "replies": [{"body": "No one brought up morals until your comment", "score": 10, "replies": []}]}]}, {"body": "🤦‍♂️😂😂😂", "score": -7, "replies": []}]}]}, {"body": "and how many people REALLY care? They have a fanatic cult following - people that buy their shoes just to put them on display and look at. You think THOSE people care? The thing is that even the people that DO care have to wear athletic clothing / shoes, and I don't know if any other brand is really that much better than Nike when it comes to the stuff you're talking about.", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I gotcha.", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s not a gymnast. It’s Simone biles. One of the greatest gymnasts ever.  It’s like saying a Tennis player left Nike after Roger Federer left.", "score": 10, "replies": [{"body": "Actually this emphasizes my bigger point. There are no athletes or rappers that can cause nike to decline by leaving. Maybe except for michael jordan. \n\n\n\nNike will find a way to succeed from a marketing perspective. The most important people to Nike’s success are in the marketing department.", "score": 15, "replies": []}, {"body": "It’s women’s gymnastics that is semi relevant every 4 years.... Nike will be ok", "score": 10, "replies": []}, {"body": "Man fwiw how incredibly shitty are her new commercials lol.    She's not doing herself any favours on the merchandising side of things.\n\nThing is she can start a gym and probably retire on her name alone.    Thousands of stupid parents will send their kids to have their bodies mangled in hope of following in her footsteps.", "score": 1, "replies": []}]}]}, {"body": "Give them stimmy checks and what do they spend it on?  Overpriced sneakers.\n\nNo... no, you do not need a special pair of athletic shoes for that new Peloton.", "score": 36, "replies": [{"body": "Better than losing their money on a dog coin", "score": 33, "replies": [{"body": "im sure some are doing both fine!", "score": 0, "replies": []}]}, {"body": "Racist who are they", "score": -39, "replies": [{"body": "People who spend stimulus money on Nike and Peloton \n\nWho did you assume he was talking about?", "score": 21, "replies": [{"body": "Lol I’m just messing around", "score": -19, "replies": []}]}, {"body": "How so", "score": 3, "replies": [{"body": "its a joke dude", "score": -6, "replies": []}]}]}, {"body": ">Give them stimmy checks\n\nMost of the country got stimmy checks.", "score": 1, "replies": [{"body": "*exactly*", "score": 0, "replies": []}]}]}, {"body": "Remember when Republicans were gonna boycott Nike because it had those Colin Kaepernick ads? Guess that sort of fizzled out lol", "score": 4, "replies": []}, {"body": "I sold all I had yesterday to free up capital\n\nSo.......", "score": 5, "replies": []}, {"body": "I rather buy lulu next nike in the making with a premium in margins 👍", "score": 7, "replies": []}, {"body": "Jesus that's huge. Been trading sideways for the last few months so this is very welcomed.", "score": 2, "replies": []}, {"body": "What makes me bust up is when any “movement” tried to boycott Nike - they always grew. Just like when trump supporters were going through their phase of boycotting companies for like 2 months… all they did was add fuel to the fire of the companies they hated.", "score": 2, "replies": []}, {"body": "Do you think LEVI could have the same pattern? \n\nNext earning is 6. July. \n\nYour opinion?", "score": 2, "replies": []}, {"body": "I would still never invest in this company on an ethics basis alone.", "score": 2, "replies": [{"body": "I feel the same. There are ways to make money without supporting companies like Nike.", "score": 2, "replies": []}]}, {"body": "I thought Yeezy jumped over the jumpman", "score": 1, "replies": []}, {"body": "No wonder LeBron is a hypocrite", "score": 1, "replies": []}, {"body": "I’ll never buy their shit again. Fuck Nike!", "score": -5, "replies": [{"body": "I’ll buy double to make up for you... great product", "score": 7, "replies": []}]}, {"body": "This day couldn’t have gone any better. I placed no bad trades, and now a long-term-hold stock I have smashes earnings and its price soars 😎\n\nNow let’s see if NKE can hold these higher prices or if it falls.", "score": -1, "replies": []}, {"body": "Completely unethical. There's no need to support Nike.", "score": -5, "replies": []}, {"body": "What do you mean by it \"jumps 12%\" the stock price hasn't moved in the last month.", "score": -12, "replies": [{"body": "After hours", "score": 14, "replies": []}]}, {"body": "Thank God. I’ve been accumulating for months", "score": 1, "replies": []}, {"body": "Congrats Joseph Carlson", "score": 1, "replies": []}, {"body": "Tried to play with the FUD after it dropped and it dropped even more.\n\nI though stock was overvalued but saw short term opportunity. Need to be more careful with these kind of trades.", "score": 1, "replies": []}, {"body": "Bought Nike during the China scandal, happy to see it's finally rocketing", "score": 1, "replies": []}]}
