{"title": "Are we in a stock market bubble? Or are these reasonable prices based on rising inflation?", "selftext": "The official CPI year-over-year inflation rate is 5%, but annualizing the last 3 months of data puts inflation at 8%.  Worse yet, if we use the traditional CPI components, not the misleading ones used in recent years, then inflation is over 12%.", "id": "o18dmp", "created_utc": 1623859583.0, "score": 63, "upvote_ratio": 0.77, "num_comments": 88, "comments": [{"body": "We are definitely in bubble territory but that just means you have to be more careful with what you buy.    Idk if prices are reasonable but the behavior of investors is certainly not so it will end bad at some point but it could and probably is years off. The smarter investors seem to think if rates stay this low than these prices are kinda cheap but with inflation can rates afford to stay this low? But can America afford if rates go higher? Gonna get weird", "score": 57, "replies": [{"body": "Chronically low inflation from aging population probably mitigates the risk of higher rates", "score": 2, "replies": []}, {"body": "The US has an oil pipeline on reserve. I'm all for the green new deal, but presently, the supply chain is heavily dependent on oil. Keeping Keystone shut down adds value to the US dollar which counters any sort of inflation. If we can make it out of current economic uncertainty without flipping that on, we'll be the strongest economy in the world yet again for x amount of time until the supply chain goes renewable. That is, if it can be prevented from being hacked. Thats my take. I'm no expert in any field.", "score": 5, "replies": []}]}, {"body": "**TL;DR Follow your strategy or HODL. (not financial advice)**\r  \n\r  \nNo one knows if we're in a bubble or not, as shown by the comments here and on many subreddits. Trying to predict the market is nearly impossible, and trying to time that prediction even more so. It takes time to see returns and we all want to see a 100% return in a year like if we had bought in March of 2020. But that isn't going to happen.\r  \n\r  \nSo what to do about it knowing you're very unlikely to predict or time it correctly? Stick with your strategy or adjust your strategy and stick with it.\r  \n\r  \nThink the bubble is going to pop and the market drops 30-60%? Sell it all and wait for that drop.\r  \n\r  \nThink inflation is going to make everything drop 30-60%? Sell it all and buy inflation hedges like gold, commodities, and that banned \"other currency\", etc. DYOR on inflation hedges because I really am just guessing from what I've read.\r  \n\r  \nThink inflation is a threat but probably wont drop the market 30-60%? Continue investing and keep \\~20% in cash to buy dips.\r  \n\r  \nMy strategy right now is to build my savings back up and occasionally buy dips. I had a nice savings but invested a lot of it recently so I'm rebuilding that rainy day fund and letting my current investments ride. I want to replace my roof as well so saving for that. And I'll likely buy more S&P ETF stock and \"other currency\" once I'm back where I want to be savings wise. But this is a long term outlook, \\~5-10 years. Look at yearly charts. Sure there's drops if you look at it weekly, but yearly candles are almost always green other than huge crises (2008).\r  \n\r  \nWorst case, with inflation, stocks trade \\~flat for a few years IMO. From my research, stocks certainly don't perform as well during high inflation, but they don't drop 30-60% like a bubble or crisis. And once inflation settles down there's more money available to start going back into stocks. Long term it all levels out so just stick with a strategy and don't worry about it.", "score": 17, "replies": [{"body": "Why do you spell it: hodl?", "score": 0, "replies": [{"body": "Etymologically, the history of this is actually interesting. I don't own the currency it refers to, but during its last run-up in 2018 or so, someone got drunk after trying to time the swings down and up.\n\nI think many of us have seen a stock go up and down when we just started investing and thought: \"hey, what if I just keep buying this when it goes down and selling when it goes up?\" Most of us, I assume, know how easy this looks, but how difficult it is to do profitably.  \n\n\nSo this person, who tried to swing the currency, wrote a post on reddit that it's impossible to time these swings, and the title was JUST HODL. His drunk typo turned into a very commonly used word.  \n\n\nEdit formatting.", "score": 11, "replies": [{"body": "Interesting lol thanks for sharing that!", "score": 2, "replies": []}]}, {"body": "Too much time in degenerate subreddits lol. Basically just means hold, but may also be an abbreviation for \"Hold On for Dear Life\".", "score": 19, "replies": []}, {"body": "If you don’t know, you better learn son", "score": -2, "replies": []}]}]}, {"body": "[deleted]", "score": 76, "replies": [{"body": "As long as there is enough BUY THE DIP cash sitting on the sidelines, the market will keep rebounding.", "score": 26, "replies": []}, {"body": "They say it's transitory because of struggles of reopening an economy and all of its related issues with labour and health and safety concerns. Unless you think that post covid, people will not want to work or will be wary about health for a long period of time, I don't see how inflation will be long lasting", "score": 12, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "What you said definitely makes alot of sense and I didn't think about it in that aspect. I hope inflation is not going to be that big but I see where you are coming from", "score": 2, "replies": []}]}]}, {"body": "How will inflation affect the market? Wouldn’t people just put more money in stocks to battle inflation? Or is it the other way around.", "score": 3, "replies": [{"body": "Inflation is way better for the market than increased interest rates", "score": 0, "replies": [{"body": "how so? with the rise of interest rate, people are draw toward Tbills which cause shifts in the fund from the market.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This is expected. Some inflation is normal for the economy. However, what will happen when inflation shoots up suddenly like in the april and may. It seem it hasn't peak just yet. What is to be expected if it continues to increase in the following months?", "score": 1, "replies": []}]}]}, {"body": "Coming?", "score": 1, "replies": []}, {"body": "I mean I did put my life savings into the crash of 2020 but wouldn’t call myself “rich”. 130% gains after a year isn’t bad though!", "score": 1, "replies": []}, {"body": "> So there will be no bubble.\n\nThat conclusion is not supported by the first part of your comment. These are exactly the conditions that lead to bubbles. In fact the bubble has been inflating since 2016.", "score": 1, "replies": []}, {"body": "Agreed. What are people going to do with all their inflated money, put it in a savings account?", "score": 1, "replies": []}]}, {"body": "My buddy has been in cash since 2010. \n\nHe's waiting for the big one.", "score": 21, "replies": [{"body": "Wtf was he smoking in March of last year?", "score": 29, "replies": []}, {"body": "Your buddy’s an asshat", "score": 8, "replies": []}, {"body": "He done missed it son.", "score": 7, "replies": []}]}, {"body": "It is extremely complex interaction of events.  The reason prices are going up is do to supply shocks to the global supply.  Then you have large un targeted relief funds.  Even though the majority need the money or paid down debt it did cause a shift in demand for things like luxury goods, game consoles, etc.  Manufacturers also cut production on goods because they thought there was going to be a massive drop in demand.  This led to a chip shortage for things like cars.  Then you also had a shift in demand for work for home products which again shifted demand.  Then you have mines shutdown, lumber mills, etc due to Covid and some who did not shutdown again thought demand would drop.  The opposite happen with lumber with people stuck at home caused people to do home improvements.  The will likely lead to a decrease in lumber buying at some point even with lower prices since people decided to do the home improvements early.  If you want to see the effects of this lookup cash for clunkers which was done after 2008.  New investors using the stock market as entertainment in casinos and sports had shutdown. There is nothing wrong with the that but is just one of the interesting unforeseen side affects that happened do to everything shutting down.\n\nWe are in the end stage of debt bubble started in 1980.  It blew up in 2008 but the politicians decided to bailout the banks and stock market.  Now we are at the point where people think the government can backstop everything and it’s starting to fail.  Investors and funds see the stock market value, bond prices, etc are to high so they are now searching for returns in real estate and commodities.  These markets are much smaller and can’t handle to influx of capital searching for a return.  Something similar happened in 2008.  So yes we are in a bubble driven by easy money and massive amounts of fraud.  I suspect the level of fraud is likely worse than the 2000 to 2008 era since the vast majority got away with it.\n\nSo basically globalism of the supply chain is collapsing, market is near the top, investors are swarming to anything they think they can get a return,  other second order effects, etc.", "score": 33, "replies": [{"body": "Gonna be a great movie", "score": 3, "replies": []}]}, {"body": "I think we are. Housing prices are so sky high right now, couple with our increasing debt ceiling ( has nothing to do with politics comments). People building right now are completely insane, they’re going to be 30 percent upside down on houses once lumber comes down. I’m scared in a way and holding cash slightly, but I’m still taking advantage of this stupid bull market we’re in. Currently can’t miss out on these record ath and stocks currently 4x over value.", "score": 6, "replies": [{"body": "Lumber futures have nothing to do with the real spot market where lumber actually changes hands. Lumber is up but barely 15% at major retailers compared to a few years ago. But major builders dont actually buy from retailers. They go straight to the source. Lumber mills have already stated that their prices have not changed much, if at all, the last year.\n\nThere is no shortage of lumber nor is there any major influx of building happening which is the crux of the problem with real estate... we have had a shortage of building for well over a decade. There hasnt been a major real estate building boom since early 2000s. Before that it was the early 90s. Why? Because builders got hit hard in the financial crisis and have been playing it safe since then. They are growing, but slow and steady which has not met demand in the least. Couple that with stupid interest rates and you have what we have now. It will take years and years of building to reverse the housing inflation. Its not going to just crash this time. Even if interest goes up, people are not going to give up the homes they bought. Investors might, if rent doesnt go up, but otherwise, they probably wont either.\n\nStocks are indeed inflated. No doubt about it but its definitely selective. Its absolutely not market wide. Its almost entirely due to highly speculative plays of which, we have record amounts of new speculative companies with insane PE's and promises of being the next 1%er and fools are lapping it up... not realizing only 1 out of 100 of these companies will actually be the 10 bagger. 50 will likely bankrupt and about 30 will be around average. But they are gambling anyway.", "score": 0, "replies": [{"body": "I knew there wasn’t a shortage, didn’t know that contractors were buying wholesale. Had seen some figure that was showing the prices being inflated from the supply chain, guess it was incorrect. Hoping that nothing pops because even into this year I’ve been having quite a good run.", "score": 1, "replies": [{"body": "Bigger companies absolutely have their own supply chain and deal directly with mills. Smaller ones might go through retail but even then they are very discerning.\n\nNow there is a rise in costs, but its not the lumber specifically, its actually the freight. Transportation costs are up. Its not gas either, its wages and its supply and demand. \n\nThe bottom line is internet shopping is still growing. It has not plateaued and the delivery infrastructure hasn't grown with it. Our roads are not growing as fast demand has grown and we simply dont have enough drivers. To make matters worse, as traffic increases, commutes increase, exasperating the problem. Commute times are a huge huge HUGE problem. Traffic is a absolute supply cost killer. We had no problems during covid but now that we are all going back and since people have become even more addicted to home delivery... well... you cant depend on uber drivers for long range freight...", "score": 2, "replies": [{"body": "Jesus man, really opened my eyes lol. Thanks for all the insight. Definitely a good way of looking at things.", "score": 1, "replies": []}]}]}]}]}, {"body": "Am I doing this right, buying dips, buying dips, 🥴🥴🥴", "score": 6, "replies": []}, {"body": "No one knows. I'm betting the ride isn't over yet and that it will be more of a whimper than a pop when it goes.", "score": 4, "replies": []}, {"body": "[removed]", "score": 16, "replies": []}, {"body": "IMO the main bubble is with unprofitable growth companies trading at 50x revenues like Roblox, Crowdstrike, etc. Great companies, but with even a 4% discount rate and very optimistic projections about growth, they are overvalued.", "score": 8, "replies": [{"body": "Bingo. Its definitely not market wide. If you look at blue chips and such, they are not much higher than historic levels.\n\nWhat we are seeing is unprecedented levels of gambling on highly risky speculative plays. People who missed the boat on whatever stock (like Tesla), are now hoping to catch the next 10 bagger. That they dont realize is the odds are about 1% they hit a home run... and they are completely ignoring stocks that generate consistent singles.", "score": 1, "replies": []}]}, {"body": "Nothing is reasonable in today's stock market. Not a bear, but it seems like the market is way out of whack.", "score": 3, "replies": []}, {"body": "We're in new territory cuz of the pandemic.  Higher prices fix higher prices.  Inflation will subside and the markets will advance.  Think long term.", "score": 3, "replies": []}, {"body": "Burry says we’re in two bubbles. Buckle up buttercup", "score": 21, "replies": [{"body": "Can someone explain what that is supposed to mean?", "score": 15, "replies": [{"body": "It means he’s spreading vauge bearishness because nobody actually has any clue what’s going to happen and he’s scared, too", "score": 62, "replies": [{"body": "I bet he looked at the numbers", "score": 12, "replies": [{"body": "The best horror story in decades is looking at the USD M1 money supply. It's *terrifying*.", "score": 6, "replies": []}]}, {"body": "True", "score": 7, "replies": []}]}, {"body": "Micheal burry the man who called the 2008 crash think we are in a big ass bubble that no one have seen before.", "score": 12, "replies": [{"body": "I should have been more clear. I know who he is. I know the whole story of 2008 from the documentary Inside Job and The Big short. What does he mean by **two** bubbles? How can we be in two bubbles?", "score": 13, "replies": [{"body": "Liquidity and housing bubbles", "score": 24, "replies": [{"body": "Thank you. It now makes sense.", "score": 7, "replies": []}]}, {"body": "as in its a biiiiiiig bubble.", "score": 1, "replies": []}]}]}, {"body": "It means \"Get ready because its going to be a crazy ride\"", "score": -3, "replies": [{"body": "That doesn’t help any, but thanks.", "score": 23, "replies": [{"body": "That $1 soda after work that the store is making (random number) $0.50 profit, deduct 12% from that profit.  And file that earnings with SEC.\n\nWhen company profit goes down, and cost of business goes up, the stock price drops.   Anything you're long on is going to have a strong possibility of bleeding out.   And it's going to cost more to \"buy the dip\".  Until inflation settles.   Would be sooner if the government would stop sending out stimulus checks, and biden quits his fucken spending.", "score": -4, "replies": []}]}]}]}, {"body": "The perma bear has a bearish view?!!?", "score": 4, "replies": []}, {"body": "That guy is not normal. Definitely on the spectrum.", "score": -6, "replies": [{"body": "The smartest people seem to be", "score": 12, "replies": [{"body": "But that doesn't mean he's right about the market.", "score": -3, "replies": [{"body": "Doesn’t mean he’s wrong. What’re you saying my man?", "score": 12, "replies": []}]}]}]}]}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Lol at everyone saying inflation is coming. Inflation is not coming. \n\nNo we are not in a bubble. Stock prices are reasonable given the current environment of trillion dollar stimulus after trillion dollar stimulus and 0% interest rates. As soon as those change stocks will reflect the new information and come down.", "score": 2, "replies": []}, {"body": "Buy silver Boss", "score": 2, "replies": []}, {"body": "As the CEO of Blackrock said:\n\n“ ...Market looking real frothy right now...”", "score": 2, "replies": []}, {"body": "Yup.  Starting tomorrow the market will crash 80%.", "score": 2, "replies": [{"body": "Nice prediction Nostra-dumbass", "score": 13, "replies": [{"body": "😆", "score": 1, "replies": []}]}]}, {"body": "Bubble? Just 3 weeks ago we exited a horrific bear market downturn....", "score": 1, "replies": [{"body": "You appear to be a new investor, so you are still learning.  Minor price fluctuations happening a couple weeks ago are not a \"bear market\".\n\nA \"bear market\" is a protracted period, often lasting years, when the market goes down significantly and stays down.  The last true bear market was from 2008 to 2012, triggered by the sub-prime mortgage crisis.  The Dow dropped from around 12,000 to 7,000.  The Dow did not recover to 12,000 until 2012.\n\nThe 2020 COVID market drop and rapid recovery are more of a \"panic\"  than a \"bear market\".  The cause of a panic is transitory and does not reflect underlying problems with stock valuation or market mechanisms.  The Panic of 1907 was the most famous until COVID.", "score": 3, "replies": [{"body": "Bruh....", "score": 0, "replies": []}]}]}, {"body": "The bubble will pop, when the Fed switches from buying bonds, to selling them.", "score": 0, "replies": []}, {"body": "Depends on your view on intrinsic value and where real rates are going in the near term", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "What do you think of Clov?  Why did it go down so much?", "score": 1, "replies": []}]}
{"title": "Is Blackberry QNX a ROTARY PHONE?", "selftext": "That's exactly what the shorts and wallstreet hedge funds and main stream media are saying and advertising to their viewers. So far they haven't recognized Blackberry QNX (software) leadership in ALL CARS PRODUCED today! Blackberry is required in all cars due to their ASIL D safety & security certification that **Linux, Android, IOS, and Windows can't achieve because inherently they are flawed.** \n\nImagine one day you're **traveling at 70 Mph on highway and your car gets locked and controls taken over by a hacker demanding** you pay immediately or they crash the car. This can happen to thousands of cars at the same time across the US and globe. **That's exactly what would happen if the car was running on Android or Linux or IoS!!**! DO NOT WORRY! Blackberry QNX runs majority of the software on **every connected car produced**. To secure it from ransomware and other threats Blackberry recently integrated its **most ADVANCED Cylance ai engine** into it!!! Meaning the ai is running inside the CAR BB QNX operating system protecting against Ransomware and other threats! [here is the proof](https://www.techrepublic.com/article/blackberry-announces-qnx-integration-with-cylance-security-systems-at-ces-2020/)\n\nThe Blackberry QNX also has Blackberry Persona built into the software. It's basically a digital avatar of the user....meaning it can detect and identify the driver without any finger print or password. No need for car key or anything once deployed by car OEM. The car knows your settings and everything!!! \n\n[Blackberry Persona Proof](https://www.blackberry.com/us/en/products/unified-endpoint-security/blackberry-persona)\n\n&#x200B;\n\n(2019 list) List of companies running Blackberry QNX. Most of the design wins (>200 design wins) have been in recent last 2 years. Meaning the r**evenue is going to jump in few quarters** because it takes time to design the product and production. Minimum 18 months. **So each car produced will generate $25 minimum...50 million cars with QNX(includes recent china lead) is about 1.2billion pure revenue a year. The Ivy will generate about $10 per car a year...deployed across 175 million cars is about $1.75billion annually and growing.** \n\ncar list. \n\n[Car partnership from 2018](https://preview.redd.it/cs9nsmepfj571.png?width=743&format=png&auto=webp&s=99f8d985b4b377946668f353156c6482b29de46c)\n\n&#x200B;\n\nThey are leader in EV industry: Once Tesla joins, which they will, due to regulation requiring running ISO certified Operating system (Blackberry QNX) they will own 99% of EV industry:\n\n \n\nhttps://preview.redd.it/xh1ukbkoij571.png?width=679&format=png&auto=webp&s=3278e659ada19702038b0ced20b9e0b727d96deb\n\n&#x200B;\n\nThe Wallstreet has been shorting blackberry to frustrate the retailers that have found a diamond. This company based on peer valuation i provided in previous article should be about **$140 per share TODAY!!**\n\n&#x200B;\n\n**Not a financial advice...just an ape that wants other apes to make $$$$ Money!! The key to win against wallstreet is to HOOOOOLLLLLD!!!**", "id": "o0v1qa", "created_utc": 1623812035.0, "score": 435, "upvote_ratio": 0.83, "num_comments": 87, "comments": [{"body": "I really wish BB would just stop making f-ing phones altogether, all it does is feed cynical stories about the company.  \"Oooh look, BB trying to make phones again like its 2009\" (disclosure, in for 1000 shares)", "score": 116, "replies": [{"body": "Fellow BB autist checking in! I have been buying the dip since February.  I have been able to average down from over $17 per share to 12.97💎👐\n\nTotal shares 5422 💎👐. Buy the dip while you still can! Average down you degenerate 🦍\n\nMahalo,\n🌴💎👐🦧🦍 \n\nBB to the moon 🌝💥🚀🚀🚀🚀🚀🚀🚀🚀", "score": 74, "replies": [{"body": "I’m a true retard used all my money to buy at 17 , didn’t have left for any dips", "score": 51, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I needed this advice thank you.", "score": 2, "replies": []}]}, {"body": "All mine at 18 😂", "score": 3, "replies": []}]}]}, {"body": "BlackBerry does not make phones haven't for many years .", "score": 30, "replies": [{"body": "They OEM them, licensing the BB name.", "score": 23, "replies": [{"body": "Yes . Sorry you said you wish they would stop making phones . So I thought,  you thought they made phones , I for one look forward to the BlackBerry phones . Just love it when someone looks at my phone and is like . Is that a BlackBerry.  Lol I just like the phone .", "score": 14, "replies": [{"body": "Disclosure, I still use my Z30.", "score": 10, "replies": [{"body": "Nice , I still have Storm, bold 9900 , z10, q5, q10, passport,  passport SE, keyone and a keytwo . I use my passport SE for my music and radio on my home stereo system.  Looks beautiful and it's a nice conversation peice :)", "score": 8, "replies": [{"body": "9320, q10, Classic, Key1&2. Still use the Classic as my home phone. Key1 is my media device and key2 is my driver. They're tools, not toys. I love them all.", "score": 3, "replies": [{"body": "Yes I forgot about my classic love that phone right up there with 9900", "score": 3, "replies": []}]}]}]}, {"body": "Yup. Bought a Key2 and the students ask wtf kinda phone is that? I tell them to gather around for a great history lesson.", "score": 3, "replies": []}, {"body": "Same.. I'm typing this on my KeyOne while my Key2 is charging. 🚀", "score": 2, "replies": [{"body": "Lol I'm typing this on my keyone as well, my keytwo is still in the box never needed to use it . This one still works just fine . Looking forward to onward mobility BlackBerry this year though:).", "score": 5, "replies": []}]}]}]}, {"body": "I will buy 1 with my BB profits", "score": 8, "replies": []}]}, {"body": "Agree that they should stop with the phone nonsense. It just clouds the whole story.", "score": 5, "replies": []}, {"body": "They only license the phone patents, and even then they are in the process of selling those patents. It's been repeated in multiple DDs on this board for many months\n \nEdit: guess I'm wrong about that", "score": 5, "replies": [{"body": "Not talking patents, talking licensing the BB name to third party manufactures, like TCL and the Keyone.  It just distracts from where they are going.", "score": 12, "replies": [{"body": "Ah damn, I guess I wasn't aware of that. Yeah they should really stop licensing the name, imo a big part of what holds BB back is the legacy issues of being thought of as a \"has-been phone manufacturer\"", "score": 4, "replies": []}]}]}, {"body": "You and I have vastly different strategies. I love the FUD; it allows me to buy cheap. I guess your in the buy high sell low crowd", "score": 0, "replies": []}]}, {"body": "BB to the 🌕🌕🌕🌕🌕🚀🚀🚀🚀🚀💎💎🙌 just a matter of time.", "score": 91, "replies": []}, {"body": "So many people are sleeping on BB as just another pump and dump… gonna moon one of these days", "score": 43, "replies": []}, {"body": "Love it!", "score": 41, "replies": []}, {"body": "I dont know man but I loved my BB phone. Holding bb to the moon!", "score": 34, "replies": []}, {"body": "I keep holding my 500 shares till I see big money 🚀🚀🚀", "score": 33, "replies": []}, {"body": "BB needs to rocket please!", "score": 30, "replies": []}, {"body": "I love BB for its mid-long term prospects, any price in teens is a gift.", "score": 29, "replies": []}, {"body": "BB TARGETS $30", "score": 22, "replies": []}, {"body": "💎🙌🏻", "score": 17, "replies": []}, {"body": "BB is a literal 💎🚀💎🚀🚀", "score": 44, "replies": []}, {"body": "can't hack my bicycle maaaaan but yeah holding BB since Jan - to the moon bitches", "score": 29, "replies": []}, {"body": "Should I sell calls on my 1300 shares", "score": 11, "replies": []}, {"body": "Thank you once again for your dd and research u/ModernBuddha1 . GO BB!!", "score": 12, "replies": []}, {"body": "I read all about BB yesterday and its a prevent company not a re active which you explained is incredible safer. And if Colonial had BB QNX then they wouldnt of got hacked and then the meat company etc. Its due time till BB gets recognized again. \n399 shares at 16.32 and holding", "score": 11, "replies": []}, {"body": "Yes. Out of all the meme stocks, I think BB and NOK are smartest, because they actually have long-term potential. AMC may be fun for now, but honestly, with Netflix/HBO/Amazon/Hulu/etc all taking a bite out of cinema $$, how much potential for growth do movie theaters have? But BB and NOK have real innovation happening that is integral to their future growth. I have put what I can (I am poor writer) into BB and Nokia, because I see what their plans are. Nokia has Bell Labs: [https://www.bell-labs.com/](https://www.bell-labs.com/), an inventor incubator: [https://inventwithnokia.nokia.com](https://inventwithnokia.nokia.com/?_ga=2.237932809.881848506.1623853710-1041330497.1620437923),  a business development branch: [https://open-ecosystem.org/](https://open-ecosystem.org/). They are heavily invested in 5G. So I don't look at these two companies as meme stocks at all, but as companies that are poised to rebound BIG in the next few years.", "score": 11, "replies": []}, {"body": "Holding BB, pick me up at $18 boys\nUntil then I'll do some bicep curls with the bag I'm holding \n💪", "score": 14, "replies": []}, {"body": "I’m in rdy", "score": 8, "replies": []}, {"body": "Love my Volkswagen Jetta with QNX software in it. User friendly! 👍", "score": 7, "replies": []}, {"body": "Naughty Naughty. BB to da MOON", "score": 13, "replies": []}, {"body": "So you’re saying I should buy more….Got it. Only thing you forgot in your DD was 🚀’s", "score": 13, "replies": []}, {"body": "I HOPE TO GET THE NEW BLACKBERRY COMING OUT THIS YEAR! HAIL THE KEY THREE!", "score": 14, "replies": []}, {"body": "They need to rebrand their entire company and the valuation will change immediately.", "score": 4, "replies": []}, {"body": "I know BB doesn't bother with phones much these days but I feel the need for a smartphone with a physical keyboard. My monke brain loves clicking things and these touchscreen phones just don't cut it. In on BB for 888 shares.", "score": 4, "replies": []}, {"body": "I got 243 shares and I ain't selling. I plan to add more as it keeps dipping. BB is a long I take my shares to the grave kind of play.", "score": 3, "replies": []}, {"body": "Well um.... Don't want to ruin the party, but you forget to mention:  \n\n\n1. that these Car partnerships are also consisting of evaluation projects, PoC's and Pilot projects. What actually goes into production is yet to  be seen.   \n\n2. Nivida and their platform is a another large player who is chosen as partner and actually into production of Tesla today, and most likely in some other OEM's in near Autonomous drive future for Level 3-4 AD cars.   \n\n\nJust to clarify I'm not against BB ( I actually own some stocks myself ) ,but I thinks it's good to know what we're up against.  \n\n\nanyways, HOLD!!! BB will be infused in future cars also.   \nXOXO your Ape friend", "score": 7, "replies": []}, {"body": "[I don't know about rotary phones, but I know a little bit about rotary engines, here's the information all you need](https://en.m.wikipedia.org/wiki/Rotary_engine)", "score": 6, "replies": []}, {"body": "BB has the highest potential", "score": 3, "replies": []}, {"body": "Where did you take your 25$ minimum per vehicle built and 10$ for Ivy per year???  I love this stock but I have a big doubt about your numbers. \n\nI have 2000 shares and no plan to sell within years.", "score": 3, "replies": []}, {"body": "WOW TONY ROBBINS THAT'S AMAZING \n\n#🤡", "score": 5, "replies": []}, {"body": "QNX is closed source, so there's likely holes in the OS which are exploited by governments and kept quiet.\n\nAnd it's in no way superior to any Linux system, it's simply optimized for embedded systems. Tell me again which properly protected Linux system had a ransomware attack? You can't.", "score": -3, "replies": [{"body": "I’m lost in your logic. If qnx is closed door how is gov finding hole? If it’s closed door no one has the source!!! And no! That’s not why it’s secure, it’s secure because every piece of code is written and thoroughly tested by blackberry. \n\nLinux has been compromised for 10 years. \n\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-report-examines-decade-long-compromise-of-linux-servers-by-chinese-apts", "score": 11, "replies": [{"body": "All software has vulnerabilities, the only perfect code is that which hasn't been written yet. Government backed hackers tend to be well resourced (think money, skills and tools), because of those resources they tend to find more exploitable holes in highly secured software than your average hackers. No amount of testing is going to find everything, although I agree testing and secure coding do work well in hardening it against attackers.\n\nResearch the solarwinds hack if you want to see a novel, real world, example of just how effective some of these groups are. If they want in bad enough, sooner or later they will get in.", "score": 0, "replies": [{"body": "Yea and solarwind hack didn’t penetrate blackberry customers. Why do u think US military switched to using blackberry spark? You haven’t been following blackberry seems like.", "score": 3, "replies": [{"body": "You're missing my point but good luck to you regardless!", "score": 0, "replies": [{"body": "I didn’t miss your point! There’s research out there that shows qnx has the least amount of Vulnerability compared to other os, much much less. With cylance ai integrated it will be the go to for any iot developer since ransomeware is the future.", "score": 3, "replies": [{"body": "My point is least amount of vulns != no vulns, that's all. I'm not disputing the other data about the OS.", "score": 1, "replies": []}, {"body": "QNX has least discovered vulnerabilities because it's used far less. Linux and Windows power billions of computers. QNX is in the 10s of millions.\n\nOh, and when they use \"AI\" here, that's just marketing. They're using machine learning to study malware patterns, nothing revolutionary.", "score": 1, "replies": [{"body": "Qnx is in 500 million endpoints from cars to phone to medical devices. There has been hundreds of paper on why it’s secure and why all car oem signed up with it. \n\nAi is machine learning…No company has true ai. Not even google. But blackberry has the most ai patents in cyber security and the best ai/machine learning model in cyber security.", "score": 1, "replies": [{"body": "AI is a marketing term. The fact that they call it AI shows that they're full of hot air. And patents mean very little. The best ML algorithms are not patented at all.\n\nHundred of papers you say? How can they deem it secure when it's closed source? \n\n500million cars is close to nothing compared to Linux or Windows. They are not nearly the largest even for the RTOS market, VxWorks is far larger.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Are you joking? Windows is closed source and it has far more holes than any Linux distro. You don't need the source to find holes. It's actually better to have closed source stuff so the hole is likely never discovered by anyone else.\n\nWhat do you think open source is? You think code is just added without testing? Talk about subjects you know, you know nothing about operating systems and software engineering.\n\nWhy do you think banks and other high security networks use Linux and widely use open source instead of closed source?\n\nAll the upvotes for you, ouch. First time computer users it seems.", "score": 1, "replies": []}]}]}, {"body": "Bb phones suck more dick than your mom. there s no possible argument against this.", "score": -10, "replies": [{"body": "Lol good thing BB is no longer in the phone business retard", "score": 11, "replies": [{"body": "Not much gets by you.", "score": -7, "replies": [{"body": "Oh nevermind I thought you were being serious", "score": 10, "replies": [{"body": "Who knows at this point. I am a retard", "score": 8, "replies": [{"body": "Haha same, guess that's why we're here", "score": 7, "replies": []}]}]}]}]}]}, {"body": "priced in af", "score": -15, "replies": [{"body": "Not even close hombre.", "score": 13, "replies": []}, {"body": "3 billion dollar annual software revenue per a single product (bb qnx) out of 10 other products priced in??? The 10 other products are playing in $84 billion TAM!  They just won’t best security award so that market is going to bb.", "score": 16, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "The figure is based on design wins and number of ecu modules in cars. The goal is $25 per car (50mil car a year) and recurring $10 per car(175 mil car) through ivy. Ivy will run on pretty much every car since it’s software agnostic so not just limited to 175mil cars it can expand to like 500mil cars.", "score": 3, "replies": []}]}]}]}, {"body": "🚀🚀🚀", "score": 1, "replies": []}]}
{"title": "$LEV: King of the Jungle DD part. 2 - Pure Growth and Value", "selftext": "**\\*\\*EDIT\\*\\*:** I have no clue how this already got so many awards. Like mentioned, invest safe: **analyze the DD and make your own judgment before investing**. **Do not FOMO or follow the herd blindly\\***\n\n**\\*\\*EDIT #2: Looks like the subreddit could be having bots awarding DDs. Don't invest for a quick buck trying to chase hype. Minimize you risk.  Dont buy options unless you are ready to lose the money. I still have all my positions. YOU SHOULDNT invest in this if you are trying to catch hype. This is only my opinion and information.**\n\n# 1. Intro\n\nSome of you may already be familiar with the [part 1 of my DD done on Sunday](https://www.reddit.com/r/wallstreetbets/comments/nzbdz8/lev_lion_electric_the_new_king_of_the_jungle/). If you aren't I invite you to take a look to learn about the company.\n\nStock price has fallen since my DD. I did add more to my position yesterday, now with $40K+ in warrants. I believe that it's an irrational selloff and that we will continue our journey to the top.\n\nThere has been an **investor's presentation update** and some news in QC, so I'm making a second DD with all the missing info.\n\n&#x200B;\n\n**Little background:**\n\nI'm from Quebec, Canada. I have invested in Lion since December when the merger was announced and have been following ever single detail + news on this company. I did not sell on the pump to 35$ because I think that 50$ PT is not out of reach in a year. Sadly the market died and took down LEV with it as well for now. But good stocks will bounce back, LEV will bounce hard.\n\n**I've visited the manufacturing site in Quebec (exclusive picture proof):**\n\nhttps://preview.redd.it/f30bxk024o571.png?width=1057&format=png&auto=webp&s=d950ae8d6ca392e90225e8706b1c04f5f470d216\n\nI also see LionC buses in Quebec very often now. It's like seeing the first few Teslas on the road.\n\nWe are still early in the adoption of the buses but it's only a matter of time before they all become EV (see part 4)\n\n**Again, personal pic taken:**\n\nhttps://preview.redd.it/1mxwadey3o571.png?width=387&format=png&auto=webp&s=e73a3254c3204b76f7e8245f43f1fd6c287ecb99\n\n# \n\n# 2. Potential in the short term\n\n**ARVL started running yesterday** on the news that it's being **shorted with about 20% of the float** and a **big cost to borrow shares (about 130-270%, although Etrade says 120%**). This is indeed a huge borrow rate and a good short interest for such small cap and float company.\n\nWell, as mentioned already on Sunday:\n\n**Lion is also shorted for 20%+ of the Float** with a cost to borrow **also around the 130% mark** according to ORTEX and my broker.\n\nhttps://preview.redd.it/uwpqpv7x3o571.png?width=1041&format=png&auto=webp&s=12b3b076a58ff00ce45aca29882ab89d6739eb66\n\n**Short volume has also been 30-65%** in the past few days\n\nhttps://preview.redd.it/udzwxxwxdo571.png?width=1535&format=png&auto=webp&s=a4f2f18e95c6e811d76007fa838f523739160152\n\n**I'm giving you this info but I'm not here for the short interest play. All this indicates is that the price is heavily forced down because the company is being put in the same batch of the SPAC EV disaster. Current share holders are in for the long run, shares are hard to borrow because of that. Any good catalyst could make this stock fly because of that.**\n\n# 3. Valuation: My Golden Goose\n\n**LEV is currently sitting at about 3.4B market cap**. Lets compare this to other EV startups:\n\n**ARVL: 13B** market cap\n\n* No revenues until 2022, still working on their prototypes for the UPS contract.\n* Good company and niche technology but valued at **almost 4x LEV** with a lot of risk ahead (their revenue projections for 2024 are insane and most likely not sustainable)\n\n**NKLA: 6.2B** market cap\n\n* Almost **2x higher than Lion** (LEV would be 33$ for the same Market cap)\n* Company was a big scam led by Trevor Milton who had to resign\n* Still trying to work on their prototypes\n\n**RIDE: 1.8B** market cap\n\n* Recently announced that they lack the funds to continue their project\n* Orderbook might have been fake\n* [CEO and CFO resigned on these news](https://www.streetinsider.com/Board+Changes/Lordstown+Motors+%28RIDE%29+CEO+and+CFO+Resign/18553949.html).\n* Again, seems like it will either be a failure or very big dilution ahead to get the $$$\n\n**CANO: 2.3B**\n\n* Merger hits and the company announces that they lost their Hyundai partnership\n* Redesigned their hole company and now being [under investigation by SEC](https://www.bloomberg.com/news/articles/2021-05-17/electric-vehicle-startup-canoo-s-ceo-discloses-sec-investigation)\n\n**RMO: 1.1B**\n\n* An other scam by management, once merger was done, they cut their 2021 guidance from 140M to 18-40M (LOL)\n* [Currently being sued for the con](https://ca.movies.yahoo.com/rmo-investor-deadline-tomorrow-hagens-133500662.html)\n\n**Most EV SPACs were a scam or failure. Lion is the the Golden Goose that has been announcing deals after deals (IKEA, AMAZON, USA + QC Schools, Pride...) and continuing growth.**\n\nhttps://preview.redd.it/7orv2k3r3o571.png?width=852&format=png&auto=webp&s=2bf413d45dc1e13675d1935af107159f8fe020b0\n\n**Amazon has the possibility to gain 15.8% ownership of the company. They currently can exercise 2.7% of it according to the last SEC form filed by lion.**\n\nhttps://preview.redd.it/548uc3mv3o571.png?width=1685&format=png&auto=webp&s=3b1661a2e6e663beb76b9121127cb128dc0ae5f2\n\n**The Operations Manager at Amazon** recently shared the truck on LinkedIn and the reactions were all positive. Stated \"**GREAT ADDITTION** and **MANY MORE TO COME**\"\n\nhttps://preview.redd.it/jv8gt2gg3o571.png?width=781&format=png&auto=webp&s=67a6632397248ce7a5b37273c7e65678e5a2c995\n\n**They are executing their plan perfectly and putting the SPAC money (490M available) to good use:**\n\n* Announcement of USA factory ready by H2 2022\n* Battery factory able to supply 14000 trucks/buses, ready also in H2 2022 - 100M funded by\n\n&#x200B;\n\nhttps://preview.redd.it/2vpphr1t3o571.png?width=1733&format=png&auto=webp&s=ad29cce232fcdfd90887dcf0c8ed9df4dc5e3e2f\n\n# 4. The New Favorite Child of Quebec\n\nQuebec announced a few months ago that they are [injecting $250M to electrify 2600 school buses in the next 3 years](https://globalnews.ca/news/7784257/quebec-electric-school-buses-2030/), with a long term goal of reaching 65% in 2030 and 100% in 2035 (10 000 buses)\n\nMore specifically they are looking at **800 buses in 2021** (this year), **1013 buses in 2022** and **779 buses in 2023** for now. ([French link)](https://www.lapresse.ca/affaires/2021-04-23/quebec-veut-electrifier-les-autobus-scolaires.php)\n\nHere is the fun part for investors; Lion is the only \"Made in Canada\" EV bus manufacturer, hence they will be **getting almost 80% of the sales.**\n\nThe other bus companies are currently boiling and calling this a \"**Monopoly created for Lion**\".\n\nIn August, the purchase of EV Buses must start and Lion is being spoon fed by the government who stated that [they will not change the policies of the deal.](https://www.journaldequebec.com/2021/06/15/drummondville-deplore-le-monopole-au-benefice-de-lion?fbclid=IwAR3V5j1HnGS_qa2_saGn3paOHhZO4AxnJLDviofoB93FJtv0_NpLRVPEIK8)\n\nRemember when I said today is like the early Tesla stages where you see 1 or 2 cars on the street?  With new policies its only a matter of time that this changes.\n\n# 5. The right place at the right time\n\nPolicies are changing, and they are changing fast. **TAM of $110B**\n\nEV buses and trucks are going to be the norm and LEV is perfectly placed, **ready to take orders and deliver their products.**\n\nCali is allowing the **accumulation of credits in 2021** (free revenue once gain)\n\nHere are a few policies mentioned in the new investor's program:\n\nhttps://preview.redd.it/w7v1twwo2o571.png?width=1753&format=png&auto=webp&s=2af6b0ec2c48c727cb1a6c12dfc3436fa70b0ace\n\n**Analysts have the same opinion on the matter:**\n\n&#x200B;\n\nhttps://preview.redd.it/u63wn3kk2o571.png?width=592&format=png&auto=webp&s=4f10620b1d0d9c7cf019d635fa02ca1d9d8a34d1\n\nCurrently Lion has **650 employees** and growing exponentially.\n\n**They are now recruiting 100 NIGHT SHIFT employees** = this is the ultimate sign that they need to keep up with skyrocketing demands.\n\nhttps://preview.redd.it/um0do65u0o571.png?width=401&format=png&auto=webp&s=0d92b1e0e6edd204f97d786c6a1c772b243ebea2\n\n**Risks and downsides:**\n\n* Scaling is the biggest risk imo, we never know what will happen down the line when a new company ramps up to the production of 20 000+ vehicles\n* Deals falling through with big businesses (amazon, ikea, etc)\n* Market crash as a whole with rising inflation and what not\n\n**TLDR**:\n\n* The **Golden Goose of the EV companies** (Ex: can get to 30$ before being valued like NKLA)\n* Real leader in the industry in a hot EV market\n* Supported by Canadian and USA government with funds and tax abatement\n* Skyrocketing demand and growth\n* Total Addressable market **(TAM):  $110B**\n* Key customers (Amazon, IKEA, Pride, CN...): possibility for Amazon to but 2500+ trucks (big catalyst if it does happen)\n* About 20% of float shorted with high cost to borrow (\\~130%)\n\n&#x200B;\n\n**Play ideas:**\n\n* **I recommend being safe with shares**\n* If you want options look for **October contracts (20C):** I think this is the best time to profit from all the catalysts and orders to come\n* Risky play: July calls can print if there's a quick bounce and shorts needing to cover\n\n**Disclaimer**: Not financial advise, I'm just sharing with you what I know about a company that I believe will be a gamechanger in the industry.\n\nPositions; 8400 warrants  + 20C for July\n\n**\\*\\*EDIT\\*\\*:** I have no clue how this already got so many awards. Like mentioned, invest safe: **analyze the DD and make your own judgment before investing**. **Do not FOMO or follow the herd blindly\\***\n\n**\\*\\*EDIT #2: Looks like the subreddit could be having bots awarding DDs. Don't invest for a quick buck trying to chase hype. Minimize you risk.  Dont buy options unless you are ready to lose the money. I still have all my positions. YOU SHOULDNT invest in this if you are trying to catch hype. This is only my opinion and information.**\n\n&#x200B;", "id": "o1cs51", "created_utc": 1623870651.0, "score": 138, "upvote_ratio": 0.78, "num_comments": 95, "comments": [{"body": "5k shares, let's go!", "score": 11, "replies": []}, {"body": "[deleted]", "score": 12, "replies": []}, {"body": "In for 1000 lfgooo", "score": 22, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "I bought avrl yesterday calls and 4x. I'm gonna be damned if I don't do the same here. Watch the pump ah", "score": 9, "replies": []}, {"body": "Lots of words and scrolling? In for 1.5k LEGGOOO", "score": 14, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "He called it pretty [early](https://www.markovchained.com/profiles/view/reddit:MaxJones123)", "score": 2, "replies": [{"body": "Im in since December as mentioned", "score": 3, "replies": []}]}]}, {"body": "I'm in papa!", "score": 13, "replies": []}, {"body": "One of the few decent EV SPACs out there. Quite surprised that it is at these price levels tbh.", "score": 14, "replies": [{"body": "Ah we have an expert. There are a LOT of EV SPACS with real promise. Many of them are attempting to succeed from different angles.\n\nNikola and Lordstown are the only ones imo with serious imminent red flags.\n\nSpeaking strictly outside of China\\*\n\nJust to add Canoo's ticker is GOEV not whatever this OP wrote. And it has been speculated that they walked away from hyundai deal due to not wanting their IP taken. They switched their business model to also allow purchase of vehicles not just subscriptions which again imo seems quite smart.\n\n&#x200B;\n\nIf you couldnt tell I hold a position in GOEV...", "score": 0, "replies": [{"body": "Dude, I used to have a large position in GOEV. I still hold a position but it will be hard for Tony to turn that ship around.", "score": 3, "replies": []}]}]}, {"body": "The big catalyst here is that school districts everywhere are dabbling in EVs right now.  Local governments have budgeted replacement of busses and many of those are being replaced with EVs.  In addition, you have federal aid flowing into these local governments throughout the country and this is one way that money is being spent.  I like it.  🚀", "score": 11, "replies": [{"body": "Matter of time before EV is the norm and first mover advantage is #1 priority. Lion is taking all the right steps towards that", "score": 7, "replies": []}]}, {"body": "Solid company not selling short term like a pusC", "score": 16, "replies": []}, {"body": "Great DD.", "score": 8, "replies": []}, {"body": "15 mins after posting dude already has gold platinum and a shit ton of awards yeah thats organic lol", "score": 8, "replies": []}, {"body": "In at 500 x $19.03", "score": 7, "replies": []}, {"body": "[The effect of a good DD post is impressive](https://i.imgur.com/LSIqsWT.png). Up 7%.", "score": 6, "replies": [{"body": "Watch it come back down before close", "score": 3, "replies": []}, {"body": "This is the effect of literally any new DD today. Check GOGO’s chart to see where this ends up by market close.", "score": 3, "replies": [{"body": "Fair. I'm still new around here and only noticed recently the instant effect on the market. I'm guessing bots?", "score": 6, "replies": [{"body": "Not sure exactly what it is, but it’s a pattern that I saw yesterday with TTCF too.", "score": 7, "replies": []}]}]}]}, {"body": "This is the third EV company that's gotten a long DD post, coated in awards, followed immediately by a price surge that we've seen in 24 hours.  \n\nThe **exact same** happened with ARVL and GOEV yesterday.", "score": 9, "replies": [{"body": "Added an EDIT part. I have no clue what is happening really with the awards. I always post DDs from time to to time on Lion. You can check all my post history.\n\nTo everyone: don't follow blindly, analyze the information and make your own decision before investing.", "score": 8, "replies": [{"body": "Pretty sure this sub has been infiltrated hard core by institutions looking to make a buck off retards yoloing on a single post. The more spikes we have immediately following DD the further it reinforces that you have to get in and out quick. It’s a serious problem that’s only recently started but I see it getting out of hand very quickly.", "score": 1, "replies": [{"body": "Yea this does seem bad... I'm not going to be posting on WSB anymore because this potentially hurts people more than anything... which is the opposite of what a DD should be doing", "score": 3, "replies": [{"body": "Exactly. I’ve seen good DD on companies with actual value rocket the price in a pump and dump leaving price stagnant for the next two weeks. It’s ridiculous and I had looked into this company prior but will have to wait for things to cool off now. You know any private servers where DD is posted without millions of prying eyes?", "score": 3, "replies": [{"body": "Yea i'd recommend waiting and not jumping on hype. I only mostly follow the SPAC subreddit so im not sure what is best really for good DDs.", "score": 1, "replies": []}]}]}]}, {"body": "I think it pumped just because of the time you posted.  People rushed in to beat the close.", "score": 1, "replies": []}]}, {"body": "Do the mods get a free look before they clear the post to show on WSB? isn’t this like a fast pass to a pump?", "score": 4, "replies": []}, {"body": "I posted about GOEV 10 hours before the price action happened, 2 hours before the market opened. Also had no calls and am still red on my shares since we didn't reach my breakeven point. Someone else did post 2x about GOEV though about an hour before that huge volume increase and linked parts of my post in their submission.", "score": 2, "replies": []}, {"body": "Manipulation \n\nWSB is getting played this is the shit thats gunna bring the SEC down on this sub and fuck everyone", "score": 1, "replies": [{"body": "OP at least looks like a legit redditor and investor.  \n\nAll three of these surges have begun literally minutes within the posting of the DD, though.  I'm not sure what to think of it.  \n\nAre there algo's skimming the sub for DD tags on a set of tickers and/or of a certain length?  Are enough apes really just yolo-ing headlong into any DD that looks half serious?\n\nI have no idea, it just really stretches credulity for it to happen the same way on three EV tickers in 24 hours.  Sus af, I think the kids say.", "score": 7, "replies": [{"body": "Institutions, algo traders scraping.\n\nMomentum traders FOMOing.\n\nIt's like how the stocks pumped just when mentioned on the news. We're the news now", "score": 3, "replies": []}, {"body": "Idk man maybe accounts for sale? Definitely agree tho shit is sketchy as fuck", "score": 3, "replies": [{"body": "There are 10.5 million people watching with substantial buying power who are trying to get in early before the “next GameStop”. Couple that with some algo traders probably buying in based on sentiment scans. That’s what’s happening. I don’t think OP or a lot of the people are doing anything bad. I do think some of the posts (like the STEM one) are doing shady stuff with awards though.", "score": 2, "replies": [{"body": "they create fake hype for a 15 minute pump that allows them to sell with 100%-200% profits for every DD and anyone who isn't out quick enough gets fucked just as fast. \n\nThis post had 15 awards gold and platinum within 15 minutes. Im sure they have sockpuppets or bots commenting the same shit in every thread too. \n\nLEV BGS GOEV GOGO WOOF ITUB LESL just a few i remember. They all follow the same format with key things bolded. Probably a team of people pumping up different tickers everyday and cashing out. \n\nIf you don't think the SEC would come down on this for some bullshit reason like \"protecting retail investors from these pump and dumps and losing all their money\" well thats the only thing the SEC does is make rules for retail that fucks us over", "score": 4, "replies": []}]}]}]}]}]}, {"body": "1500 sharess in. I am on this boat.", "score": 7, "replies": []}, {"body": "Same boilerplate DD setup as all the other pump and dumps \n\nOP is gunna make 100% on his calls and the late comers are gunna get fucked", "score": 5, "replies": [{"body": "This is the one I should have scalped, the pump lasted longer than GOGO.", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I would have been out by now, but I sat this one out after my colossal fuck up with GOGO earlier today", "score": 2, "replies": []}]}]}, {"body": "Lol a post with 100 likes will move a 3.1b stock ?", "score": 2, "replies": []}]}, {"body": "This looks like a great play. I’m in at 50 shares 19.02", "score": 5, "replies": []}, {"body": "In for 1000 shares 30 options let’s get it", "score": 3, "replies": []}, {"body": "So, I'm a little skeptical because it appears to me that Lion isn't as far ahead of its competitors in the states as I thought. The factory in Illinois I think will open up a lot of US opportunity for them, but many of the big names in the room haven't been sleeping on electric like the passenger car industry. Just look at the EM2, I mean, thats an electric version of arguably the most recognizable box truck in North America. And freightliner's parent company has been working on increasing charging capability by working with local power companies to see just how that could get done. We talking 1MW chargers for these bad boys.\n\nSo, I'm in Lion, 115 shares, but I don't know just how big they are going to get as these bigger better established names come out with competing class 6 and 8 trucks at the same time. I think Lion has a lot less of a first mover advantage than I originally thought. But it'll be fun to watch!", "score": 2, "replies": [{"body": "EM2 seems to be coming out in 2022. Lion is already selling the trucks to big companies. That does seem like a movers advantage to me. They were working with companies in 2019 and its only now that they are starting to scale up the sale. \n\nHowever, it's definitely not a risk-free investment. 100% agree", "score": 3, "replies": []}, {"body": "Forget class 8 when it comes to EVs.  Batteries don’t have near enough energy density required to get decent range without severely limiting the payload of the truck.  In the EV space, smaller regional vehicles are going to be the play for the foreseeable future.", "score": 1, "replies": [{"body": "You can use class 8s for regional distribution. It's not normally what you think of,  but it does happen.", "score": 1, "replies": [{"body": "Oh I don’t disagree.  I was just stating that class 8 isn’t a high priority market for a lot of these EV companies.  Personally, I think the municipal market is the ticket in the near term because so many towns/cities have set sustainability goals.  My little town has a couple busses already as a pilot program.  If it goes well, then plan to phase-out diesel.  This is a school district with under 1,000 students in CO.", "score": 1, "replies": []}]}]}]}, {"body": "The real king of the EV sector will be LUCID", "score": 2, "replies": []}, {"body": "Search DD on LEV.  There are prior posts with more analysis.  I like the stock because it has been under the radar and I think the play on busses is clutch because of all of the government spending.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I’m buying those calls tm", "score": 1, "replies": [{"body": "For the right price, I'll sell you mine ;-)", "score": 1, "replies": []}]}]}, {"body": "Bought options", "score": 1, "replies": []}, {"body": "Great write-up. I got in a few days ago for a paltry 60 shares at 22.81 CAD.", "score": 1, "replies": []}, {"body": "yuck no more pump and dump please\n\nthis spiked a few minutes before the DD was even posted", "score": -2, "replies": [{"body": "Wheres the dump stupid bitch?", "score": 0, "replies": [{"body": "in a few minutes by you and friends who should be banned from wsb, or ideally, arrested", "score": 0, "replies": [{"body": "He posted the same nonsense message after every new DD today.\n\nI’m surprised this hasn’t been labeled a P&D in the same way GOGO was earlier today.", "score": 2, "replies": []}, {"body": "Calling every due diligence a “pump and dump” just because people read it and buy is ridiculous. There are 10.5 million people here who can make their own decisions and collectively have substantial buying power. OP provided a well thought out DD. This wasn’t just “30% short float!! Buy!!!”", "score": 1, "replies": [{"body": "They’re are turning into pump and dumps even if that isn’t the intent.", "score": 2, "replies": []}, {"body": "I said it was PND since the stock was already pumped prior to the DD, so obviously the pump and dump group (which is criminal btw) had set up this one", "score": 1, "replies": [{"body": "I don’t think you know what a pump and dump is. Pump and dumps use misinformation to inflate an asset price so the OP can dump. What did he say that’s false or misleading?  Anybody can choose to buy or not. Just because people buy in and some people sell doesn’t mean it’s a pump and dump. And the amount of buying is a sign of the quality of his DD.  Not really any different than a new analyst report or price target update...", "score": -1, "replies": [{"body": "the misinformation and illegal act is conspiracy with a group to collectively pretend they were convinced by the DD when they in fact already bought up the shares and options just prior to posting", "score": 1, "replies": [{"body": "He disclosed he’s a share owner. Tell me: what did he do that’s different than a standard analyst report?  It doesn’t matter if a group owns shares before as long as it’s disclosed. It’s literally what analysts in investment banks do: release bullish reports on investments and why they own them. And unless he “pumped” the price with false or misleading information then he did nothing wrong.", "score": 0, "replies": [{"body": "the analyst doesn't work with a team to pretend that the report was amazing and that they're immediately buying shares when they already loaded up on them, this OP conspired with his or her group to spread that false information", "score": 1, "replies": [{"body": "Yes. They actually do work in teams. And they do own the asset when they publish the reports.  I agree that bots and shit like that can be illegal but merely owning a stock and releasing a report for why you own it (even if it moved the market) isn’t illegal.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Exactly!", "score": 0, "replies": []}]}]}]}]}, {"body": "missed the pump :(", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "meh bought 10 shares for a yolo", "score": 2, "replies": []}]}]}, {"body": "Avg price is 23 price target 40 🚀", "score": 0, "replies": []}, {"body": "Cramer said he liked the stock back in Feb.", "score": 0, "replies": []}, {"body": "Lol this is the worst post ive ever seen. No research just shitting on any company that isnt Lion Electric.\n\nNot against LEV - just stating this post is extremely misleading and inaccurate on a lot of accounts...", "score": -3, "replies": [{"body": "If this is the worst post you have ever seen, then you clearly missed the DD on aliens.", "score": 1, "replies": []}]}, {"body": "514-50 dans mon réseau", "score": 1, "replies": []}, {"body": "What do you think about the secondary offering on May 28th where shareholders can sell up to 155 millions shares anytime? Amazon currently owns 18.8%", "score": 1, "replies": []}, {"body": "I like this Stonk roar !!🚀🚀🦍💎🖐🏼", "score": 1, "replies": []}, {"body": "Great DD. Would be interested to hear your thoughts on Proterra ($PTRA). They trade at similar valuations but Proterra has a smaller lineup of vehicles and seems to be focussing on buses and coaches. It’s also interesting to me that neither of them named each other in their investor decks.", "score": 1, "replies": [{"body": "I think Proterra is a nice company that will also benefit from the EV movement but trucking and school buses are much big sectors than coaches and school buses. Lion has a better growth potential imo but also more risks involved. You choose what you like", "score": 2, "replies": []}]}]}
{"title": "Is Tesla's Former Number 2 Going to Be Lordstown Motors New Number 1?", "selftext": "&#x200B;\n\n[Jerome Guillen Was Second In Command at Tesla and Left unexpectedly Last Week](https://preview.redd.it/yzmo64vrzo571.png?width=1841&format=png&auto=webp&s=6abe7f5e0a4e8b3dbb08635a42c142165d804436)\n\nTLDR - **Tesla number 2 guy stepped down days before RIDE CEO Quit - Is he Coming to the Start Up?**\n\nCurrent Position - **I own 100 long on $10 Oct strike calls and 2 common shares of stock** \n\nLast week, Jerome Guillen shocked the auto world by announcing his depature from Tesla. He was the second in command at the auto giant starting there in 2010 and his current role was the head of their truck division. While that took place, behind the scenes at Lordstown Motors another shakeup was underway and the company dropped a bomb that CEO and founder Steve Burns would be stepping down from his position along with CFO Julio Rodriguez. Guillen was the Tesla Model S Program Director and most likely had day to day interaction with Lordstown Motors President Rich Schmidt who was in charge of production and tooling for that project.\n\nDid our partner GM persuade Guillen that this an oppertunity too good to pass up. With the Endurance trucks coming off the line in just a few months now and a shiny brand new battery plant being complete in the coming months from LG and GM partnership the time would be now to get in. His experiene with ramping up the gigafactory probably has GM salivating at his exeprtise helping to help with input on how to maximize the potential there. And you may wonder why Tesla would open for him to jump to a competitor which is reasonable but they probably want to be friendly to GM who will be helping their own supply line with the battery plant coming online.\n\nWith productiion so close, I would think that LMC fills this posistion and the timing of Guillen's departure from Tesla and Burns resigination at LMC I think there is a good chance we have some Tesla blood coming to Northeast Ohio which would send shockwaves throughout the auto world.", "id": "o1fjkq", "created_utc": 1623877633.0, "score": 54, "upvote_ratio": 0.71, "num_comments": 98, "comments": [{"body": "Let me stop you right there, Jerome Guillen was not the Assistant Manager, he was the Assistant to the Manager.", "score": 28, "replies": [{"body": "Does that position come with a pay raise?", "score": 6, "replies": [{"body": "I'm theory yes, but we can't tell anyone and you won't see it on your paycheck", "score": 9, "replies": []}]}, {"body": "Haha!! Love it! RIDE and WKHS 🚀🚀", "score": 5, "replies": []}]}, {"body": "Looks like a RIDE to the MOON!!!!  The stars are aligning!!! Last chance before $20 / Share to load up!!!", "score": 11, "replies": []}, {"body": "That's actually really interesting! Will have to look into that", "score": 8, "replies": [{"body": "If it plays out the FOMO will be INSANE", "score": 6, "replies": []}]}, {"body": "He'll go either to RIDE or LEV", "score": 6, "replies": [{"body": "GM has bigger pockets and this is the ground floor for RIDE imo.... but interesting observation. I didnt know Lion was in the market. \n\nI actually see GM combining Workhorse when its all said and done too....", "score": 4, "replies": [{"body": "Why do you keep talkikg about gm overseeing this?\n\nGM doesn't need lordstown nor workhorse", "score": 8, "replies": [{"body": "GM does need RIDE for carbon credits and probably will be cutting them a nice deal on a loan soon.", "score": 4, "replies": []}, {"body": "GM owns a big piece of Lordstown Motors already.", "score": 1, "replies": []}]}, {"body": "Amazon is backing LEV, But I posted Jerome Guillem coming to LMC immediately after Burns resigned. Because the timing lines up", "score": 0, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "Thanks for reading... Where there is smoke there is fire and thats a lot of smoke IMO", "score": 1, "replies": [{"body": "Never bet against 🇺🇸", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Primary c-suite compensation is stock options. Given enough he could make more with higher growth potential and full control. In total it looks like his net worth is 54 million.", "score": 6, "replies": []}, {"body": "Alot of these guys like a challenge, hes already rich", "score": 5, "replies": []}, {"body": "Wouldn’t be less pay if he’s paid in company stock that raises in value dramatically over a year or two", "score": 5, "replies": []}, {"body": "Start ups are where the money is to be made. How do you think we got Rich Schmidt who oversaw the initial ramp up at Tesla getting Fremont up and running.", "score": 3, "replies": []}]}, {"body": "Jerome Guillen explained that Elon Musk would push them outside their comfort zone and they accomplished things that way. Without a visionary leader like Elon Musk, one has to wonder whether a guy like Guillen will be as creative or accomplish as much. If you listen to Straubel and Everhard who founded TSLA they say much the same. They both like Tesla and a are investors in it and are rooting for its success still. While they were there their experience with Elon was him pushing you beyond your comfort zone. Elon sees things others don't and  pushes and takes risks to get there that others will not.\n\nBasically, all these guys are great, but without an Elon Musk driving them to achieve great things they will not accomplish the same. This is no different than working at Apple was under Steve Jobs. You might be the gun, but he was the one who pointed you in the right direction.", "score": 5, "replies": [{"body": "Once a guy \"levels up\" he's leveled up.", "score": 2, "replies": []}]}, {"body": "Ride or wkhs", "score": 4, "replies": [{"body": "Yeah, I have both.... Honestly I think the two may become one sometime the line. They both have their selling points.", "score": 3, "replies": []}, {"body": "Why not both ?", "score": 4, "replies": []}]}, {"body": "\"Our partner GM\"  oh how you wish that were true. There wouldn't be a money shortage if that was the case  investor does not equal patner.", "score": 2, "replies": [{"body": "They are their partner. Invested in the PIPE. Millions of in kind investments. Sold the factory and kept it tooled for pennies on the dollar. Use their supply chain. I'm thinking they buy WKHS out of their stake soon in some way so Workhorse can ramp up or buy them out all together and put both under Brightdrop.", "score": 3, "replies": [{"body": " RIDE has nothing left to offer. GMs initial \"investment \" was essentially buying their way out of Youngstown, and a plant that couldn't be sold to anyone.  Nothing from the Cruise tooling is usable to RIDE. RIDE has nothing left to offer big daddy GM. GM already owns 3 years of rights to their future EV credits.  If they succeed. Brightdrop,should be a clear indicator  to you. That GM doesn't give a rats ass about WKHS. And certainly won't be buying them out. Not that it would help RIDE in any way if that happened anyway. WKHS and RIDE are separate entities.", "score": 2, "replies": [{"body": "You and are clearly reading things differntly and I think as soon as 4 days from now it will be clear that I am correct and you are mistaken. \n\nGM wants to cut the middleman out of sales (the dealership) and RIDE is the perfect entitiy to do so. That was the only reason they nearly got into bed with the scag NKLA and then realized she had HIV. LMC is legit and the big funds pulled off that FUD to load cheap.", "score": 3, "replies": [{"body": "Your clearly mistaken. GM is not trying to get away from dealerships. And have never given any indication anywhere ever that they were. GMs dealer network. Is the backbone of the company.  And if for some reason they did.  It would make zero sense in any way shape or form to use RIDE as a means to do so. Jesus Christ you guys just make shit up as you go.  If GM wanted to go dealer less. They can't by the way.  You know, pesky contractual obligations and state laws and all. But if they did. And could. They would just throw a few billion at the problem and do it in house.", "score": 4, "replies": []}]}]}]}, {"body": "Nobody said equal partner, but they are much more than an investor they allow LMC to use all of their “non consumer facing parts” like airbags and interior switches and things.  They also have a vested interest in them succeeding as part of the deal allows them the right to purchase LMC’s carbon offset credits for a few years at 75% of their retail value. \n\nDo your homework.", "score": 2, "replies": [{"body": "GM will allow any car maker on the planet to purchase any parts they want. Its not unique to RIDE. GM drive trains and interior parts have been gracing boutique car manufacturers products my entire life. Probably longer.", "score": 3, "replies": []}]}, {"body": "My exact thoughts 😂", "score": -1, "replies": []}]}, {"body": "Unless he’s taking a trip to...china ;)", "score": 1, "replies": [{"body": "U think? I’m close to going in with nio but kinda scared", "score": 0, "replies": [{"body": "I don't trust being in a China stock for a long time.  For a short day-trade maybe is fine.  I just don't trust them.", "score": 2, "replies": []}, {"body": "I have no idea. Its all speculation at this point. But it makes more sense career wise to join another winning team than try to right a severely leaky ship IMO", "score": 0, "replies": [{"body": "Lordstown you are getting on the ground floor right before production in a 6 million square feet factory. That isn't a leaky ship. That is a money printer.", "score": 5, "replies": [{"body": "How many vehicles per year is the factory capacity? How many vehicles on the road currently? What are their battery ranges? How fast do they charge? How many vehicles orders do they have? Do they have Battery swap capabilities as well as a lifestyle brand that promises diversified streams of revenue? Are they government backed to the point of receiving bailout money when they need it? These are all things that NIO surpasses RIDE/ just flat out has it and RIDE doesnt", "score": 2, "replies": [{"body": ">How many vehicles per year is the factory capacity? How many vehicles on the road currently? What are their battery ranges? How fast do they charge? How many vehicles orders do they have? Do they have Battery swap capabilities as well as a lifestyle brand that promises diversified streams of revenue? Are they government backed to the point of receiving bailout money when they need it? These are all things that NIO surpasses RIDE/ just flat out has it and RIDE doesnt\n\nThey are at a current capacity of 60k vehicles per year and presales are now sold out and are booked solid through 2022. They have 30k sales lined up that are termed as \"solid\" and that equates to $1.6 billion in forward revenue so this is trading for dirt cheap right now with tons of room to grow. I believe the battery range is 250 miles and they are conculding the Beta builds and have achieved 5 star crash test ratings on all tests thus far and will come to market as the safest pick up truck ever made. First orders will shipped in Jan 2022. They are awaiting news on a DOE Loan which would be the first one given out in over a decade the last being to Tesla and by all reports will be granted the money.", "score": 5, "replies": [{"body": "How many vehicles on the road sir", "score": 2, "replies": [{"body": "As stated they are ending the Beta builds now and awaiting on the final tests from the federal gov't of safety. Either you want to play a great American story or you want to play a Chinese company with a current valuation of more than 40x that of the start up. My money is the Americans and the first ever EV pickup and soon to be announced RV.", "score": 7, "replies": []}]}]}]}, {"body": "Thats what you call a SMACK down sir", "score": 0, "replies": []}]}, {"body": "Is nio legit or what? I see nothing but good things, but after what I’ve seen lately I realize those “articles” that appear on my google usually have ultrerior motives! I bought 10 shares a few weeks ago at 38 and they’re up a lot since them. Kinda wish I had bought 10,000 shares!", "score": 2, "replies": [{"body": "NIO is delivering 10s of thousands of cars a quarter in China. Outside of Tesla, they are as legit as it gets for an EV maker.", "score": 3, "replies": [{"body": "I’m sketched out by the Chinese gov though I feel like at any time they could drop the hammer lol I don’t know much about them though", "score": 1, "replies": [{"body": "The government is a problem. But NIO is the crown jewel of EV manufacturing in China. They will be coddled and protected.  China wants NIO around the world, sensors listening and mapping.", "score": 7, "replies": [{"body": "Jack ma entered the chat", "score": 3, "replies": [{"body": "Jack Ma may dissappear now and then. Company still rolling tho.", "score": 2, "replies": []}]}, {"body": "I believe that. It’s crazy how they do that too, but whole other topic. Btw I had a thought that Chinese money could be behind all the negative articles on literally every American EV company and that could be why those same articles that shows up on my google are all super positive about nio. Just a thought.", "score": 0, "replies": [{"body": "That definitely happens. But NIO is a real company, with real sales, and real customers. FsKR,  Lucid,  RIDe, NKlA are all just wannabes. All have been shady, misleading, or outright failed already once. Just a bunch of maybes competing in an industry where Musk is the only successful startup in 100 years.", "score": 3, "replies": [{"body": "Musk is a one of a kind.", "score": 1, "replies": [{"body": "And thats the thing. All these other EV companies don't have. Elon Musks vision or  timing. He came in as the only player. Now its a crowded field of startups", "score": 1, "replies": [{"body": "But the people in power want EV to happen. Can’t forget that aspect. They’re open to it. And Lordstown has the plant. They’ve been retooling. They have a step up above the other startups with that. They passed crash tests, they’re so close. I’m just waiting for them to drop some crazy out of left field bad news on me like “oh we have the money to proceed but didn’t get the clearance” or some other bullshit, that’s how it’s been for the last few months! But on the other hand I think they easily could hire a big name ceo and get a bump in SP, go into Lordstown week and announce they passed ALL the other crash tests, announce an investor or that they got the gov loan, and get some footage of people test driving the trucks out there and we could see a nice bump. I could see either scenario happening. Plus the short interest is high so there’s only so much float out there. This stock has shown that even with a little bit of buy pressure it moves up fast. Excited to see what happens", "score": 1, "replies": [{"body": "EV is happening,  with or without Lordstown. Rivian starts delivery next month. F GM and Tesla will be out next year. RIDE has enormous volume propping up the price. People want to get in early and get rich. Doesnt mean the company will make it. Just speculative investors. Trying to make a buck.", "score": 3, "replies": [{"body": "Yes true but I’m just saying, it’s a unique time. At least one of these companies will make it. Hopefully", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "What do you do it the U.S. -based stock exchanges de-list NIO, XPEV or LI?", "score": 1, "replies": [{"body": "No idea. Never heard of a legitimate company being delisted. But my market experience is limited. Since both Blackrock and the California pension fund have positions in NIO im personally quite fine with them as a company. There is no going back from the global economy unless WW3 haopens.", "score": 2, "replies": [{"body": "It can happen.  There was this article about it a few months ago.  \nhttps://www.msn.com/en-us/money/savingandinvesting/could-nio-stock-really-get-delisted/ar-BB1bLfNt", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You just casually have ~400k laying around? But instead, decided to buy 10 shares?! Ha ha ha…", "score": 1, "replies": [{"body": "No lol I’m just saying I WISH I had that kind of money!", "score": 1, "replies": [{"body": "So, “I wish I was in a position to where I could buy 10,000 shares” lol…", "score": 0, "replies": [{"body": "Yea I guess to me it’s blatantly obvious what I meant because I could barely afford the 10! But I see the wording is hard to understand! Lol", "score": 1, "replies": [{"body": "Just giving you shit. Everyone has to start somewhere! You just see so many clowns fronting on Reddit about owning a bullshit amount of shares in every ticker knowing they are holding like 1.3 shares in a single ticker.", "score": 2, "replies": [{"body": "Haha I agree! And whatever happened to “proof or ban”? Never see it anymore but it’s a good way to cut through the BS", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think they are . Its just tough cus its a chinese stock. If that company was American it would be 80 -100 per share by now. Honestly the only thing that has gotten in our way was the chip shortage . Which is probably gonna be over by end of june or july. The CEO has a unique vision for an auto company, always under promises and over delivers and maintains level headed communication with shareholders constantly. Idk what more you could ask from a company. \n\nHOWEVER\n\nThe valuation is certainly high for where they are. If you cant handle volatility mixed with long periods of static movement in a stock then i wouldnt get more involved. It is my most successful and fun investment to date...that being said i bought at 4 all the way up to 30 so . Yeah. Ive done very well so far\n\nI would say the real risk now is continued performance and the race to profitability, along with the fact that MARKET wide correction can still take place across tech. They are ALL trading high multiples. But the risk of them going bankrupt is gone, they are state backed, and currently expanding to Europe. It’s certainly a less risky investment than most of the stuff being pushed on this forum. You just have to stomach the valuation and the stigma of china.", "score": 1, "replies": [{"body": "Haha I’m long in RIDE, I can handle volatility! It’s been wild so far but it’s been fun! I need to diversify a little bit I may grab some more. I just wish they were still 4$! I’m still working my way up in the world I’m not quite there yet with the capital where I can buy the amount of 45$ shares I need to then a sweet profit…someday I’ll get there.", "score": 0, "replies": [{"body": "Eh i would say thats the wrong way to look at it...price per share doesnt matter...prospective growth and share price appreciation is what matters. My first investment was tesla @ 450 ish range presplit. I only put in 3k. It outperformed everyother investment that ive made thus far.", "score": 3, "replies": [{"body": "Oh I would say buying a hundred shares is probably the minimum I want to try to do in an investment. But I agree with what you said, something is better than jothing", "score": 0, "replies": [{"body": "Number of shares doesnt matter. Get that idea out of your smooth brain my dude", "score": 3, "replies": [{"body": "Lol damn that’s harsh but ok, got ya. It’s all about percentages. I guess to word it different would be if you aren’t investing a few grand your percentage in return won’t be too high? But point taken. And it’s a fair point. If I only have 500 to invest I want to put it some where that I will make the best return, regardless of share prices", "score": 2, "replies": [{"body": "Im harshly honest. Best way to be IMO . Percentage ROI (return on investment) doesnt change based on number of shares or price of share. It is simply your return! :) 😅🙃😖🥵😱", "score": 1, "replies": []}, {"body": "The percentage of increase is what matters.", "score": 1, "replies": []}]}]}]}, {"body": "Good point. I guess I’m just looking at, if the stock price goes up $10, the more shares you earn the better that return will be. If I can only afford to buy 10 shares, it would take a huge change in share price to actually make a difference.", "score": -1, "replies": [{"body": "And i dont agree wjth your logic. Your return is based on the PERCENTAGE return on investment. If you only have 2k to invest you want to find the company with the best chance of HIGH PERCENTAGE growth. Doesnt matter your share count . 2k is 2k whether you own 200 shares or 1 million", "score": 3, "replies": []}, {"body": "Right but thats what you’re looking for. If you take a longer term approach to investing this will become more apparent. You are looking for undervalued stocks OR a company that you believe is undervalued compared to where it will be (hopefully) long term. I dont know your history with investing but i think the APE mentality may have corrupted your interpretation of stock PRICE versus Market CAP . Another thing that helps me with investing is the importance of investing in a management team just as much as a “company”. For instance. Yes RIDE or WKHS or NIKOLA could turn the ship around but there was a serious flaw in Management there. When you start investing in people as much as a stock price i think it increases your chance of success. Nio’s CEO is dope. Never been happier with another ceo ive investment money with", "score": 2, "replies": [{"body": "Wow that all makes a lot of sense. And Inhavent been sucked in to the ape mentality RIDE is my first investment. I also have 100 shares of ccl. And I have a Roth IRA with only VOO. I just started all this in february after I paid off all my credit card debt. Originally was only going to do vanguard but wanted to try some other things too since I have a long way until I retire! It’s been a learning experience so far", "score": 2, "replies": [{"body": "You’re on the right track", "score": 1, "replies": []}]}]}]}, {"body": "Btw that’s one hell of a first investment!", "score": 1, "replies": []}]}, {"body": "Doesnt matter what price per share it is...only matters where you think it can go. If a 450 dollar stock goes to 4,000 would it have been a better decision to put your money in a 5 dollar stock that goes to 15 in twice the time? The answer is no", "score": 3, "replies": [{"body": "I’m just getting to all these responses in reverse order lol but I get it. Loud and clear. It’s all a percentage game", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Ive had a position in nio since 4 per share. I Like the stock. Not gonna pump it to ya but lets just say i didnt sell at 67 for a reason", "score": 1, "replies": [{"body": "Wow that would have been a nice gain", "score": 1, "replies": []}, {"body": "I’m not asking to pump I’m genuinely curious. Have been for a few weeks now ever since my buddy mentioned it to me. Like to hear other people’s opinion", "score": 1, "replies": []}]}]}, {"body": "Why go lateral? William Li is a boss and all, I really respect him as a CEO but what's the upside for Jerome?", "score": 1, "replies": [{"body": "Because not everyone is a ceo man. Being a manager or assistant manager of a division at a company is a very different game", "score": 1, "replies": []}]}]}, {"body": "Don’t like it", "score": 0, "replies": []}, {"body": "It's backed by the President of the America...bitch", "score": -5, "replies": [{"body": "I do believe Biden was just driving around in the Lightning", "score": 2, "replies": []}, {"body": "Biden?", "score": 1, "replies": []}]}, {"body": "We'd all be filthy rich if we got Jerome and funding from GM's 32B EV budget 🚀🤑", "score": 1, "replies": []}]}
