{"title": "Am I The Only Person That Thinks The Sell Off Has Started?", "selftext": "[deleted]", "id": "o3n2m7", "created_utc": 1624128631.0, "score": 48, "upvote_ratio": 0.75, "num_comments": 97, "comments": [{"body": "Doesn’t sound like gtfo, sounds like wait and gtfi", "score": 104, "replies": [{"body": "This guy invests", "score": 39, "replies": []}, {"body": "Yes, opportunity is just down the street", "score": 24, "replies": []}, {"body": "💯", "score": 7, "replies": []}, {"body": "Buy the motherf*cking dip, my dudes.", "score": 3, "replies": []}, {"body": "Nah. It’s get out, wait until everything implodes and THEN get in. I’ve already pulled 90% of my portfolio out. The last thing I have is AMC because that’s a meme stock that doesn’t seem to depend on actual market conditions. Lol It’s about to get dicey, IMO.", "score": -5, "replies": [{"body": "AMC is a pump and dump by Citadel. Cashing in to stave off margin call on GME. You're in the wrong stock. Not financial advice. Just follow the money.", "score": 16, "replies": [{"body": "Hey could you elaborate a little on that please? Everywhere I look the so called “ape nation” keeps talking about AMC going to the moon and what not", "score": 2, "replies": [{"body": "https://www.reddit.com/r/Superstonk/comments/nmszni/since_january_it_was_known_please_i_beg_you_apes/?utm_medium=android_app&utm_source=share\n\nOne of many posts going into how AMC is diluting 100% of their shares. Have much lower short interest  on much higher share count. The fact that mainstream media is pushing it should be warning enough.", "score": 1, "replies": []}]}]}, {"body": "I’ve been thinking I need to switch my retirement accounts till this blows over. Where should I move the money to?", "score": 1, "replies": [{"body": "T-bonds? Don’t bonds move inverse of the rest of the market?", "score": 1, "replies": [{"body": "Yeah they’re supposed to. Bonds, precious metals, and crypto are supposed to move inverse of stocks.", "score": 1, "replies": [{"body": "Speaking of gold, supposedly after June 28th no longer paper traded?", "score": 1, "replies": []}]}]}]}]}, {"body": "Stocks only go up right?", "score": -3, "replies": [{"body": "?", "score": 0, "replies": []}]}, {"body": "This is the way", "score": 0, "replies": []}]}, {"body": "over a year ago people were saying to gtfo.", "score": 35, "replies": [{"body": "Always people say this. The big one is always around the corner. If you can't weather storms, don't invest.\n\nAs for the  inevitable fall, it could happen. Trying to time it just seems like a fool's errand.", "score": 5, "replies": [{"body": "Think Burry is wrong? For how long was he going on about the 2008 bubble? This ain’t that, I get it but he clearly saw that reality pass the smell test and he smells something funky again more than piques my interest", "score": 3, "replies": [{"body": "Burry is a big short, he’s probably right but he also may be benefiting by letting that tweet out specifically just before quadruple witching", "score": 2, "replies": [{"body": "The witching was new to me. Hell everything is new to me since becoming more serious than investor level", "score": 2, "replies": []}]}, {"body": "I dunno if he's wrong, but I would listen. There are plenty of smart People who are wrong about  markets e.g. \n\nhttps://erictyson.com/articles/20081024_1#.YM-IheROIWN\n\nThese people tend to always have the next apocalypse around the corner. And they can be correct because we know markets have a tendency to do this. But they also make wrong predictions. \n\nSo it's not that I don't hear someone like Burry when they sound the alarm, I just think that if it doesn't happen in the next year, he'll just kick the can down the road until it happens and proclaim he was right all along. These guys never admit to having it wrong.", "score": 1, "replies": [{"body": "The funny thing about that article was that the economist was predicting crude at $40 sometime later in that year (2009). Crude absolutely tanked in 2010 to $40 - I remember (not timeline) when it hit negative... I don’t even know how that worked. Would the futures pay investors to acquire crude when that happens? \n\nAnd I think Burry’s prediction started in 2004-‘05\n\nIt would seem, and I am no expert, that the market can ride through these predictions- until it can’t. Like there’s an input lag because a ton of different factors like how long it takes to foreclose, or how much available crude supply there is (or of anything for that matter) and then that supply takes a massive dump and whoosh.", "score": 1, "replies": []}]}]}]}, {"body": "Over a year ago, before the pandemic? Lol. Then they were right. You gtfo, then you gtfi when it starts recovering.", "score": 1, "replies": []}, {"body": "I don't think these people thought governments would print unlimited money.", "score": 1, "replies": []}]}, {"body": "Hot discounts across the board coming up in the next few weeks", "score": 26, "replies": []}, {"body": "food is already very very expensive", "score": 26, "replies": [{"body": "I own two restaurants… food is going up insanely fast…", "score": 15, "replies": []}, {"body": "Shoot. I tried to buy a small amount of fish the other day. It was soooo expensive. I didn’t know I should have been stock piling meat products.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "And packaging (napkins, plastic forks, throwaway plates, etc.) are going up even faster…", "score": 1, "replies": []}]}, {"body": "We are seeing a sell off but not a crash. By Wednesday or Thursday everything will bottom and money will move to high growth stocks. You need cash on the sidelines for this. \n\nThe FED is saying one thing but doing another. They will not take their foot off the accelerator until the see better employment data. They will let inflation run hot for the rest of this year. This means you stay invested.", "score": 19, "replies": [{"body": "It is mostly supply chain issues. The fed is sticking with its original statements and plans. As we see the supply side issues getting fixed post covid we are seeing those assets deflating.\n\nFrom pokemon cards, to lumber, to graphics cards prices are actually declining as products slowly meet demand. Graphics cards and other chip related items will need more time. Used car prices are also inflated due to low supply. \n\nWe don't invest based on inflation right at this moment, we invest on the future. In the future we will see the supply side fix itself, we will see less stimulus and a slow final job recovery (leading to less consumer spending), tapering in the bond buying, and rate hikes in 1 1/2 to 2 years. These will all massively fight off any massive inflation people are worrying about.\n\nThe run up the market has had after the covid crash was the play on the inflation we see right now. Now we look to the future, and its all anti-inflationary measures. \n\nMy prediction is other world currencies aren't as protected as the US dollar (even though I think poorly of it). They will see much more inflation, leading to the buying of dollars as a safe haven, which would strengthen the dollar.", "score": 1, "replies": [{"body": "> they will see much more inflation, leading to the buying of dollars as a safe haven \n\nOr maybe crypto? If US exports bulk up, the dollar will strengthen but people may be buying gold and crypto instead. New rules in Europe make banks holding gold a safe asset so that may rise.", "score": 1, "replies": []}, {"body": "But don‘t forget, that other currencies are not the USD. Some currencies are adapted to inflation. Other currencies have not enough inflation although pushing QE for more than a decade by now. Dunno man. It seems the US is the most sensitive currency when it comes to inflation.", "score": 1, "replies": []}]}, {"body": "Or you get liquid and buy resources to naviagate through a failed currency/down economy. I think the dollar is going, which is why the FED doesn't care. They already milked that cow.", "score": 1, "replies": []}]}, {"body": "reverse repos jumped from 550billion to 755 billion in 1 night", "score": 18, "replies": [{"body": "And the quarter ends soon, which always sees RRP spikes. High probability of crossing $1T and may touch $2T. Guess we will see.\n\nWould go calls on RRP numbers though lol", "score": 3, "replies": []}]}, {"body": "I'll keep my life savings in FAANGs and NVDA.", "score": 22, "replies": [{"body": "Signed, old, retired guy, who lives off his life savings.", "score": 16, "replies": [{"body": "That’s ok. I’m young accumulating guy and I have the same portfolio. I just have some crypto in there to catch the big upside.", "score": 7, "replies": []}, {"body": "but i have no Netflix", "score": 6, "replies": []}]}, {"body": "What he meant was vti", "score": 1, "replies": []}]}, {"body": "The Fed is just blowing hot air.  They won’t be raising rates anytime soon, even though they should.  Their number one goal is to keep Wall Street and the banks happy.  They don’t care about consequences for the little guy.", "score": 21, "replies": [{"body": "Banks want higher rates, they have been getting clapped on low interest. They literally profit on lending rates.\n\nBig business with little debt want higher rates too.\n\nIt's businesses with a lot of debt, or that need to borrow a lot that hate high rates.\n\nAlso this supply side inflation is causing less consumer spending as people post stimulus aren't making more money. Businesses do not want consumers costs to start vastly exceeding income even more than it already is.", "score": 4, "replies": []}]}, {"body": "You could be right, but people were also saying similar things when the market had that dip last month and in other instances. Personally, I'm not going to liquidate positions but I do have cash waiting to buy in which is the same thing I did during the Covid crash.", "score": 5, "replies": []}, {"body": "Ya but I think the fed keeps a big backstop and kicks the can down the road and Congress will come back to the table also… albeit painful to see them work it out", "score": 5, "replies": []}, {"body": "I'm really not that worried.", "score": 4, "replies": []}, {"body": "notice how we hadn't heard a peep from Cassandra for awhile until right before friday? he really wants to see the world burn.", "score": 4, "replies": []}, {"body": "The market can stay irrational longer than you can stay solvent", "score": 12, "replies": [{"body": "One of my favorite market quotes I go back to every time I make a play that seems right, is right, but timed poorly lol.", "score": 3, "replies": []}]}, {"body": "Annoying TA voodoo guy here, but on Friday close SPY broke below the daily ascending wedge it has followed since the Covid crash last Feb/Mar. Daily RSI has been decreasing since April 2021. The only comforting sign is the 50D EMA appears to be holding as support for now, but Monday will tell if we get a bounce back into the wedge, or continue dropping.\n\nI don't know if this is the start of a crash or small correction, but I am personally all cash right now.", "score": 9, "replies": [{"body": "Over the past 5 years SPY has a 0%win rate on the 26th week of the year. So should be lots of red this week.", "score": 2, "replies": []}, {"body": "Just had a look myself, and wow, I'm pretty bearish now.", "score": 2, "replies": []}]}, {"body": "I hope we see another plunge.", "score": 5, "replies": []}, {"body": "Interesting and you may be right.", "score": 2, "replies": []}, {"body": "Not to mention banks stocks are taking a nosedive.", "score": 2, "replies": []}, {"body": "Friday on the SPY looked like controlled selling all day. As soon as the price dropped too far  the volume fell and the price was allowed to recover some ground before being pushed  down again. My guess is slow but steady downward pressure again next week without fireworks until the big institutions have reduced their exposure to stocks. After that it'll be a dog show. The clue is in the huge flight to treasuries on Thursdsy and Friday. And the crash in precious metals. Have a look at some historical charts. It's uncanny how often a PM crash has been a harbinger of a larger move down stocks.", "score": 2, "replies": []}, {"body": "Thanks for writing this. I have been trying to connect the dots. June 8 last year, Stocks moving to the Russell microcaps, Crypto pump. All June 28. Also Friday before close Nasdaq, Dow, S&P all move nearly in sync all day. Even at the end when they all drop. Take a look at the last 5min top gainers of the day. Not typical for random penny stock to blast off in the last 5mins before close on Friday. Can't find a reason for any of the ones I looked into to go up. They are like stale bread. Some kind of market correction? Some kind of book clearing? Who? What? Or Why?", "score": 2, "replies": []}, {"body": "Im already setting up shorts on real estate and the dow, I think the bubble is starting to pop.", "score": 3, "replies": [{"body": "I did the same.", "score": 2, "replies": []}]}, {"body": "Start going to cash...after the big sell-off make some great buys.", "score": 3, "replies": []}, {"body": "The market is currently near an all-time high. Aside from the thousand red flags, we are due for a major correction anyway.  Look into Elliott waves. We're in a wave 5 within a wave 5.  Residential and commercial loans are fucked. The big funds have been cooking the books and the regulations are changing. The first domino isn't far off.", "score": 2, "replies": []}, {"body": "As soon as I seen he's from California I all understood why he thinks the world is ending.. because California is ending", "score": 1, "replies": [{"body": "I am in Washington, DC", "score": 2, "replies": [{"body": "Even worse", "score": 0, "replies": []}]}, {"body": "It's running in a surplus and they can't build enough homes to meet demand. \n\nIt's the US hub for tech, agriculture, and imports and exports. If California is dying, 90% of the rest of the states have been dead for years comparatively.", "score": 1, "replies": [{"body": "They have, basically. Most of the midwest and all of the south is dead. Mountain states pretty dead too. The northeast and the west coast have been keeping the rest of the country alive for a long time now", "score": 1, "replies": []}]}, {"body": "If we can just get a bunch more Californians to move to other states, I think we'll be ok.", "score": -7, "replies": [{"body": "No, don’t. We are really boring in the south. Terribly boring. Stay in Cali. Things are rough down here. *sips mimosa*", "score": 6, "replies": [{"body": "I mean things are kind of fine in California if you have grounded yourself there. My dad is just a forklift driver for a warehouse his entire life. He was able to purchase 2 homes over the years working shit tons of OT. \n\nThis year alone each house went up 150-200k.\n\nEven in the last 10 years if you bought an average home in southern california or in the bay area you may be up 300-600k depending on the area. \n\nNow they can sell and move to the south, or most other states in general... pay off a nicer home, have hundreds of thousands in the bank, and retire much earlier and not have to worry about money.\n\nIf someone purchased a home in the south or most other states, they still be paying it off, with an increase in value that wouldn't compare to that of those in California.\n\nTLDR: Capitalism allows Californians to have more money and assets to move to the south to live like Kings because of higher income and higher asset appreciation. They aren't leaving because it sucks, they are leaving because it makes life easier for them after successful investments.\n\nBonus: We still have a home shortage in California causing prices to skyrocket. Further incentivizing people to leave if they are priced out.", "score": 1, "replies": [{"body": "That's why California is still the best state to live in. People bitch about politics and cost of living, but when you retire your house alone is worth over a mil and you can go anywhere you want. I wish I could live in California but I'm too old to make it work long term now.", "score": 1, "replies": []}]}]}, {"body": "As long as they don't vote democrat wherever they go I agree..", "score": -5, "replies": []}, {"body": "That already happened", "score": 1, "replies": []}]}]}, {"body": "Sometimes it's just better to get out early. The dollar index is blowing up.", "score": 1, "replies": []}, {"body": "Yes.  Probably in for a garden variety 2-3% correction.  Perhaps as much as 5% but I would be shocked if we see more then a 10% sell off.", "score": 1, "replies": []}, {"body": "Wait ?! I have to work now to get money ?!", "score": 1, "replies": []}, {"body": "Feels like somethings brewing for sure.", "score": 1, "replies": []}, {"body": "I am closing all my high risk positions.", "score": 0, "replies": []}, {"body": "I life in ohio and i can tell you right now in the midwest and the south is poppin", "score": 0, "replies": []}, {"body": "Bring Trump back stat!!!", "score": -4, "replies": [{"body": "what we are seeing is an end result of decades of mismanagement, to my eyes. Every administration from the current one back to Nixon have had a hand in this. I would ask you to consider whether there is actually a red/blue issue, or whether we all basically want the same thing but get stirred up and distracted so we dont notice the system become less private and more manipulated. I think bringing politics into this is a distraction, and the foreclosure, eviction, mortgage, and student loan looming disaster is the result of policy put in place more than a year ago. Nobody is helping the little guy.", "score": 5, "replies": [{"body": "Trump was def not a politician. The current administration is all about politics. I understand your point however regarding past administrations and it is valid.", "score": -3, "replies": []}]}]}, {"body": "It’s going to shift over to big tech and growth. And the selloff will continue with value, industrials and reopening stocks. Banks will bounce back. Just my opinion", "score": -2, "replies": []}, {"body": "There will be a crash but it will be a flash crash. I wouldn’t worry.", "score": -2, "replies": []}, {"body": ">post runaway inflation numbers\n\nNot surprising since the US economy was shut down for pretty much all of 2020. \n\nBasic supply and demand is all it is. Low supply and high demand? Higher prices.", "score": 1, "replies": []}, {"body": "Shortage of T bills. Eventual feds have to either raise rates or just print more money \nThe latter will cause inflation to hit 20% crashing the economy. Realistically inflation is like 6-8 %\nRaising rates will cause a huge dip but not as bad as ladder", "score": 1, "replies": []}, {"body": "Are u saying that the chairman of the fed is speaking again this week? Because I cannot find any info that confirms this. He spoke last week. Nothing scheduled for this week so far as I can tell.", "score": 1, "replies": []}, {"body": "!remindme 6 months", "score": 1, "replies": [{"body": "I will be messaging you in 6 months on [**2021-12-20 09:42:16 UTC**](http://www.wolframalpha.com/input/?i=2021-12-20%2009:42:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/o3n2m7/am_i_the_only_person_that_thinks_the_sell_off_has/h2evyev/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fo3n2m7%2Fam_i_the_only_person_that_thinks_the_sell_off_has%2Fh2evyev%2F%5D%0A%0ARemindMe%21%202021-12-20%2009%3A42%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20o3n2m7)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Looks like a summer sale!!", "score": 1, "replies": []}, {"body": "If the market is a bought to make a large movement then there is money to be made. And you can HF we be making loads of it. I'm going to say that they need some to pay debts maybe?", "score": 1, "replies": []}, {"body": "Just a buy opportunity. You can read around, oil and energy stocks are getting pushed. It doesn't look like prices will be coming down any time soon. Full market recovery expected next year. \n\nThat said, a crash may still happen, but it won't kill your portfolio forever...", "score": 1, "replies": []}, {"body": "!remindme 3 months", "score": 1, "replies": []}, {"body": "There should be a sell off for Growth stocks again IMO. The last 2 days after fed meeting seemed like a hint to sell than to buy. Interest rate hikes were added for 2023. DocuSign, Twilio, zoom, all of those should dip some this week.", "score": 1, "replies": []}, {"body": "A correction is more likely than a crash IMO. Let’s see how soon the dust settle next week. Usually market crashes occur when least expected.", "score": 1, "replies": []}, {"body": "Its not about timing the market, but time in the market. Chill your shit dude if you cant handle the inevitable rough ride ahead then you got no business in the market.", "score": 1, "replies": []}, {"body": "I’ve gone to cash like 4 times since 2019 cuz they’ve been talking crash since then. Wrong every time (Cept COVID). And went back in slowly each time. I missed a lot of opportunities I could have had if I just stayed in. Timing the market is a fool’s errand.", "score": 1, "replies": []}]}
{"title": "Invest in high debt companies to short the dollar", "selftext": "Title.\n\nThe US govt. is deeply in debt, their best way out is to decrease the value of currency. This will be a boon to any entity that is both in debt in dollars AND able to raise prices to track inflation.\n\nWhich is what happened to HTZ. The value of a car increased while the value of a dollar decreased, which took them from insolvent to solvent. I'm looking for the next HTZ. One I've got my eye on is VIAC, whose major bear case is their debt load.\n\nThoughts?", "id": "o36yfk", "created_utc": 1624072774.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 74, "comments": [{"body": "Your plan is buy shares of companies overburdened with debt to make an inflation play? All right. Im gonna pass tho", "score": 12, "replies": [{"body": "It'll be fun though to see people that are holding AMC come site this as the justification for continuing to hold AMC.", "score": 5, "replies": [{"body": "You should have used “cite” not “site” and I take that as evidence to buy more AMC.", "score": 0, "replies": [{"body": "Good. I'll need someone to sell my shares to =-)", "score": 1, "replies": [{"body": "❤️", "score": 1, "replies": []}]}]}]}]}, {"body": "That’s not how it works…", "score": 31, "replies": [{"body": "That's not how any of this work...", "score": 26, "replies": [{"body": "Nobody knows how it works, but it’s provocative. It gets the people going.", "score": 48, "replies": [{"body": "We skate to one song and one song only", "score": 16, "replies": [{"body": "Lady humps by the black eyed peas", "score": 8, "replies": []}, {"body": "Ball so hard m’fers wanna find me.", "score": 5, "replies": [{"body": "That shit cray", "score": 2, "replies": []}]}]}, {"body": "Excellent work", "score": 1, "replies": []}]}]}, {"body": "Well why not, it worked for HTZ.   \n\n\nI'm looking for a company that borrowed heavily & spent it before 2020, while a dollar still had strong purchasing power, and will be able to delay repayment until the value of a dollar sinks.", "score": 2, "replies": [{"body": "Fuck it then. Go with Luckin Coffee. Cannot go tits up", "score": 13, "replies": [{"body": "You may want to stick to US companies on this full autist play.", "score": 6, "replies": []}, {"body": "My dad would not stop talking about Luckin, but fuck me if there wasn't a chance or two to print some money.", "score": 2, "replies": []}]}, {"body": "Learn some macro economics, or not. we'll enjoy your loss porn.", "score": 3, "replies": [{"body": ">macro economics\n\nUS is in debt & cant afford to pay. If not debase the currency, then what?", "score": 1, "replies": [{"body": "Are you in debt when you borrow money from yourself?\n\nOnce again, take a few macro economics classes and revisit this thread.", "score": 2, "replies": [{"body": "I believe you literally dont know anything.", "score": 1, "replies": []}]}]}]}]}, {"body": "To be fair, nothings how it works anymore.", "score": 2, "replies": []}]}, {"body": "Every morning for the past month or so I open up my portfolio and look at my VIAC 50c dec contracts and the only words that come out of my mouth is FUCK YOU VIAC. Don’t be me, stay away from VIAC", "score": 3, "replies": []}, {"body": "Didnt  read but no emoji if u decide to short the dollar feds eat your head js I just like movies and am a poor ape", "score": 6, "replies": []}, {"body": "You do know that this is what Micheal Burry is doing with the 3X inverse short bond ETFS. He is shorting these Treasury bonds as a play on the currency devaluation and upsizing the leverage three times as well as purchasing call options (to increase his leverage).\n\nIt's playing the dollar destruction using steroids. So...don't break the law just the rules.\n\nNice.", "score": 3, "replies": [{"body": "Hi. Can you explain the call options part? What kind of calls and how does this increase leverage in purchasing levered ETFS? Thanks 🙏", "score": 1, "replies": [{"body": "He is purchasing calls on an inverse triple leveraged bond ETF.\n\nMicheal is betting that bond prices will drop in the ETF  which means the shares of the ETF will go up because it is the inverse, or opposite of what the bonds actual move.\n\nSo he gets 3x times his money plus he has purchased call options on these shares which means he is leveraging these shares with options. \n\nIt's a tongue twister. You really have to sit down and think about this for a second.  Micheal is packing on the leverage.", "score": 1, "replies": []}]}, {"body": "OP is betting against The Fed. Burry is not.", "score": 1, "replies": [{"body": "Micheal is so betting against the Federal Reserve. Think about it.", "score": 2, "replies": []}]}]}, {"body": "Valuations are based on future revenue/EBITDA , so they will need even more growth when inflation hits.", "score": 2, "replies": [{"body": "If they are able to track product prices to inflation, their revenue will increase without any business growth.\n\nbut that is an IF; price increases will not be negotiated uniformly", "score": 1, "replies": []}]}, {"body": "Dude the us greenback has been traveling down since jts high of 1.4750 usd/cad - unless the feds and other central banks agree to devalue further its not profitable to go much lower.... hog farmers can't make much bacon when canaduh is paying less for hogs!!! And as stocks and commodities sell off which is started already by chiner and the big money's flipping to start closing longs and making shorts in the money the usd will gain strength as conversions into greenback are required to buy bonds! \n\nSmfh \n\nGo ahead go long on stocks and short usd ..... c'ya", "score": 2, "replies": [{"body": ">Go ahead go long on stocks and short usd ..... c'ya\n\nthats called margin", "score": 2, "replies": [{"body": "Hehehe margarine call", "score": 2, "replies": []}]}]}, {"body": "AT&T? They are the most debted company in the world. I imagine most of that debt has gone into infrastructure. Contracts are no more than 24 months so it’s super easy for them to raise prices.", "score": 2, "replies": []}, {"body": "Maybe buy a house with a gov subsidized 30y fixed, and then you have somewhere to live", "score": 2, "replies": []}, {"body": "Find a US Marine shipper. They're all have a price to book under $1, shitloads of debt, and in a once every 15 years super cycle where the rates they charge are through the roof. \n\nI'm onboard. Let me know when you find the one.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I’ve never been more convinced someone is a fraud. If not, fucking hell you’re bad at PR.", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "I don’t believe you for a second lol.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Jesus I hope I’m never like you. I would rather be broke than unironically say “I’m the real deal” lol. \n\nCongrats on being the real deal. I wouldn’t be you for a billion dollars bro.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bahhhh you fucking got me. This is legendary trolling good work sir.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "🎉", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Jesus youre a fucking douche. No one cares how much fucking money you manage. Youre so fucking woke on stocks because you do it for a living yet shit around on WSB? 2 month old account bruh go away.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol. !remindme 26 days.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "He runs a passive fund.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}]}]}]}]}]}, {"body": "inflation? what is that, some kind of weird fetish?\n\n\\-you, probably", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Dude you could be so much nicer in your replies. You don’t have to belittle everyone for their ideas.", "score": 3, "replies": [{"body": "Hes just salty; the bond market isnt going so well lately.", "score": 2, "replies": []}, {"body": "Take a look at his history, this dude must be super fun at parties if he acts like this IRL", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Yes, like most functional adults with decent relationships. What would you be if you were to suddenly lose your job? Would anyone even bother to help you?", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Oh man must've really hit a nerve with this one, must be real sad knowing you aren't getting invited to anything in your adult life. Have a nice day 👍", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Wut? I never said any of that, nor did I agree with OP. I just pointed out that inflation exists which you seemed to not know. Sorry if I made it sound rude, I was just joking around", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I never agreed with OP at all. In fact, I disagree with them completely. Stop acting like a child please. I was only pointing out to you that inflation exists, and you took it as a challenge. I don’t want to argue with you. I’m sure you *are* smarter than me. But you are NOT more mature. Please take a look at yourself and realize that acting this way benefits no one.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "1. I didn’t know you were a bond trader, obviously\n2. I don’t care, you were still acting stupid\n3. You clearly have some sort of self esteem issue if you constantly have to tell people you’re a professional. Normal people don’t act like that. Or, maybe you’re just lying. Either way, I don’t care.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Good. I’m glad that you’re doing well in life. You’re clearly better at this than me. So why act like this? Why put others down?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Maybe if you didn’t act like this all the time, they wouldn’t do that...", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yum", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "You’re not a professional in anything and you know it you cuck", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "You know how I know you’re a pissant child? You expect me to click on your link. Didn’t click on it. Try again fagguette", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Is this you’re first time on the internet? Has your daddy finally allowed you to use the internet? Why do you write like we’re sitting in a CoD lobby? \n\nThe only type of people that even gives a shit about a how they look on the internet is a child. You would know that if you weren’t a child. Yet here you are. Maybe you’re just mentally childish? Maybe you come from a non-English speaking culture? Maybe you’re North Korean? Or how about South Korean, Seoul? Maybe Singapore?\n\nKeep acting a fool and you can kiss your job “managing billions” bye bye. Sooner or later your juvenile behavior will come back to bite you on the ass, and you’ll be found out. \n\nAt the end of the day, you don’t do shit because it’s not your money, you cum sucking paper pusher. And you know this. You work for people like me because we tell you to manage our money. \n\nNow fuck off, get bent and eat a dick and get back to work, fagguette", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "To short citadel invest in gme 😃", "score": 1, "replies": []}, {"body": "The basic fundamental of currency is the more you have the less it’s worth.\n\nThe less it’s worth, the more something costs.  This is called inflation.\n\nRaising costs to combat inflation does not correlate directly to profit.  Most times the more something costs, the less it’s bought.\n\nYou’re better off investing in low debt companies with higher amounts of liquidity.\n\nIn short, don’t follow the position(s) above.", "score": 1, "replies": [{"body": "I think you people are really underestimating the story with HTZ. This IS what happened; their assets went up in value while their debts went down. I'm looking for another company with a similar story; assets or inelastic goods that can track inflation.\n\n&#x200B;\n\nTake housing as an example. A lot of individuals are making a boon due to inflation. The price of real estate rises to meet it, while their debts remain fixed.", "score": 1, "replies": [{"body": "They declared bankruptcy.\n\nI think that speaks for itself, besides the fact that they are a rental car company with depreciating assets.", "score": 1, "replies": [{"body": "[https://www.google.com/search?q=HTZ+stock&oq=HTZ+stock&aqs=chrome..69i57j35i39i285j0i67i433j0i433j0l3j0i67j0l2.1232j0j7&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=HTZ+stock&oq=HTZ+stock&aqs=chrome..69i57j35i39i285j0i67i433j0i433j0l3j0i67j0l2.1232j0j7&sourceid=chrome&ie=UTF-8)\n\n&#x200B;\n\nThis is a story thats being slept on. HTZ was a 10bagger, and it wasn't an accident or 'memeing'. The fundamentals changed & the price now reflects that", "score": 1, "replies": [{"body": "I mean it’s your money, feel free to take the gamble.\n\nThey’ve sold a substantial amount of what assets they had to offset debt.  I’d be skeptical of any balance sheets reporting income because of these sales.  Which also means to make up the difference in debt will probably be in the form of stock offerings.\n\nSure they may have some bounce back as the economy improves, but historically the average valuation from here isn’t much higher.", "score": 1, "replies": []}]}]}]}]}, {"body": "https://www.wsj.com/articles/comcasts-ceo-built-a-cable-giant-can-he-build-a-streaming-giant-11624473722", "score": 1, "replies": []}]}
