{"title": "DON'T CLOSE UR $TSLA CALLS AT OPEN.", "selftext": "[deleted]", "id": "93w3sp", "created_utc": 1533183287.0, "score": 86, "upvote_ratio": 0.92, "num_comments": 73, "comments": [{"body": "Greedy fuck. I like it ", "score": 101, "replies": [{"body": "[deleted]", "score": 56, "replies": [{"body": "I fucking love you.  Homo.", "score": 21, "replies": []}]}]}, {"body": "This is WSB.  They will close their calls at open because they've lived through the Chinese pump and dump.  Then, tesla to 400.  Not before theres some more puts that get thrown into the bonfire tho, lol.", "score": 53, "replies": [{"body": "You forgot the part where they buy Tesla again at 400 cause they don't wanna miss out.", "score": 40, "replies": [{"body": "Don’t forget the loss of compounded gains that were obviously reinvested in calls ", "score": 10, "replies": []}, {"body": "My bad", "score": 4, "replies": []}]}, {"body": "I'd much rather leave profit on the table than watch it disappear before my eyes.", "score": 2, "replies": []}]}, {"body": "*Glances at Shanghei Index: -3.4%*\n\nIt's ok TSLA's got this in the bag.\n\n*Glances at futures, red across the board*\n\nTSLA is a profitable company in Q3\n\n*Sweating intensifies*\n\nFuck man my hands are feeling real fuckin weak rn", "score": 38, "replies": [{"body": "If you've got profit, take it. If not, you can always kill yourself (don't, but you could. But don't. But it's an option).", "score": 4, "replies": [{"body": "And we sure do love options here at /r/wallstreetbets!", "score": 3, "replies": []}]}]}, {"body": "\"There is 99.99999% chance Tesla is going higher simply due to insane number of short covering and change in investor sentiment. If you want to close your FD's today, do it when $TSLA hits $350.\"\n\nLITERALLY THIS.\nI'VE BEEN TELLING PPL THIS ON TWITTER ALL AFTERNOON.\nDO NOT CLOSE UR CALLS. LET THE SHORTS BURN, THEM COVERING WILL CAUSE US TO GO UP.", "score": 29, "replies": [{"body": "the fact this is now the consensus on WSB makes puts kinda tempting ", "score": 55, "replies": [{"body": "Yes. The oy reason I bought calls in first place was wsb telling me to buy puts. Now tables have turned. ", "score": 17, "replies": [{"body": "Same dude, same.", "score": 6, "replies": []}]}, {"body": "i'm gonna get whiplash on tsla sentiment", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Man I hate sounding dumb right now but can you explain pls", "score": 5, "replies": [{"body": "when the market opens the shorts will be like \"o fuk shit fuk shit ass titty cunt fuck muhh puts\", they will then proceed to cover their positions which results in buy volume which drives the stock price even FURTHER up, which results in more puts being covered, and up and up we go for a little bit (the short squeeze).", "score": 7, "replies": [{"body": "why didn't this happen after Microsoft or apple earnings then? also after a decent earnings from AMZN it's gone down...", "score": 2, "replies": [{"body": "Because this is the most shorted stock ever. Much of WSB was short tesla, huge hedgefunds have massive short positions in tesla, while there wasn't nearly as much short interest on Microsoft or Apple earnings.", "score": 9, "replies": [{"body": "kk sounds legit, guess I'll wake up early and do a little day trading 2morro", "score": 3, "replies": [{"body": "Yet this did not happen last time, when Tesla shot up like a rocket a little while ago. Short interest barely decreased. This is tame by comparison. ", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "540 you mean", "score": 1, "replies": []}, {"body": "I think shorts are going to double down while longs are nervous they will lose their gains. So the total opposite of what you said is going to happen \n\nEdit fuck me I was wrong ", "score": 1, "replies": []}]}, {"body": "Holding shares \n\nSo you kids do what you want and wake me at 3pm", "score": 13, "replies": [{"body": "Bought mine at 4:05 and just watched my modest 7% gain for literally doing nothing. Gotta take the safe way with some ", "score": 6, "replies": []}]}, {"body": "Who is to say that it doesn't even hold to the morning bell?", "score": 7, "replies": []}, {"body": "400 incoming. ", "score": 7, "replies": []}, {"body": "So don't immediately sell my $340 8/3 calls on open?", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "What about my $435 8/17 calls? 🤔", "score": 13, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Fr", "score": 3, "replies": []}, {"body": "So I should hold?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I'm skeptical the mods let this stay up. I'm selling market open now.", "score": 7, "replies": []}, {"body": "shhhh. delete dis", "score": 7, "replies": []}, {"body": "When somebody hands me money, I take it. I don't wait for them to change their mind", "score": 10, "replies": []}, {"body": "I have September 400s what do", "score": 6, "replies": [{"body": "Close", "score": 2, "replies": [{"body": "Inversed WSB and held. It was a good call.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Been struggling all day with what exactly you were trying to get across here", "score": 1, "replies": []}]}]}]}, {"body": "Fuck you, you just jinxed it.", "score": 5, "replies": []}, {"body": "Would this fabled short squeeze have happened after hours/premarket tomorrow?  I’m not too familiar with how quickly these things happen.\n\nI assume as the shorts get to the price they shorted at or a reasonable stop loss they cover their position? ", "score": 4, "replies": [{"body": "It takes months for it to occur, at least the rise in 2016 from 189 to 383 took 6 months, this is because the big short holders aren't buying faggy puts, they are selling shares short, they don't take a loss until they sell, and they have more time and money then these WSB put buyers", "score": 8, "replies": [{"body": "the second whoever they borrowed shares from decides to take profits they need to cover, doesn't matter how much money they have when tons of new buyers show up and 30% of float is shorted shit's about to hit the fan", "score": 9, "replies": [{"body": "Is that how it works? I swear, shorting gets more weird and convoluted every day. ", "score": 3, "replies": []}]}, {"body": "But they do pay a premium to borrow shares.  Its technically not a loss until they cover but it's still a bleed.", "score": 5, "replies": []}, {"body": "Okay that makes sense.  I had assumed they were shorting shares but I wasn’t exactly sure how it works.  So in theory they’ll just hold unless they see it staying above a certain number in which case they take the loss/small profit by buying which drives the price up further?", "score": 1, "replies": [{"body": "Yea, it will assumed be a loss though, and when price goes up so much that their brokerage tells them they have to cover (if they are shorting shares on margin) covering means they have to buy more shares as collateral to appease their broker, which causes the price to rise, which causes the next short holder to reach their margin call. who causes the next short seller to reach margin call.. etc", "score": 3, "replies": []}]}]}]}, {"body": "What about IV?", "score": 4, "replies": []}, {"body": "I sold $340 Sep calls so you can bet I'll be buying them back at open. Although I also sold $250 Sep puts too.", "score": 4, "replies": [{"body": "What's the total return on that been?", "score": 1, "replies": [{"body": "At the moment, I sold the package for $3.97 and it is marking at $4.73, so down about $0.80 per share. But I haven't closed them yet.", "score": 1, "replies": []}]}]}, {"body": "AMD was a wild run after ER, and like you I sold my calls the next day at $18.15 and $18.30.  \n\nBut last quarter for MU I held 6 calls through ER and sold 3 of them profitably the next morning.  I'm still bagholding the other three and have a ~$1500 loss on them.  They're all Jan 2019 or longer so I still have lots of time, but generally when you're making an earnings play, you should treat that separately from your other moves.  It's a fundamentally different type of trade and you need to have different logic and signals.\n\nYou're basically telling people to go long TSLA after it just popped 9%.  There were tons of people saying this same thing when Musk hit the model 3 production target and TSLA popped to $360 at the next open.  It went straight down from there, but your same logic should have applied.  Be careful out there.", "score": 5, "replies": []}, {"body": "Closed out a short 350C for an actual gain as it came down early, and closed out a 340C for $3, I see we are right about the 340 mark! Gonna save rest for later", "score": 4, "replies": [{"body": " BOT +2 TSLA 100 (Weeklys) 3 AUG 18 340 CALL @.80 BATSLAST=290.34 BID=290.22 ASK=290.46 MARK=290.34   \n\n SOLD -1 TSLA 100 (Weeklys) 3 AUG 18 340 CALL @2.59 NYSELAST=334.98 BID=334.83 ASK=334.99 MARK=334.98  \n\n SOLD -1 TSLA 100 (Weeklys) 3 AUG 18 340 CALL @7.50 BATSLAST=345.24 BID=345.19 ASK=345.30 MARK=345.24  \n\n SOLD -1 TSLA 100 (Weeklys) 3 AUG 18 350 CALL @.55LAST=296.46 BID=296.42 ASK=296.54 MARK=296.46  \n\n BOT +1 TSLA 100 (Weeklys) 3 AUG 18 350 CALL @.45 NYSELAST=329.1099 BID=329.00 ASK=329.21 MARK=329.1099\n\nOnto YOLOing some options on BGS! Wanted to hold out through Friday.  ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "I hope you are right and think you may be off by 9 so $359 target by 1030am\n\nSitting on 12 Aug 10th 325 calls and really want a solid 10x win and not a boring 2x or 3x\n\nIt will take balls for me to hold but I have a solid week left before expiration and 330 seems to be able to hold, break even would suck.", "score": 3, "replies": []}, {"body": "Market may likely box out 8/3.  Should probably just aim to sell with IV at its highest.  If you're further out, then yeah.", "score": 3, "replies": []}, {"body": "I have 100 shares already queued a sell in RH.", "score": 5, "replies": []}, {"body": "Ban this mofo if it drops", "score": 4, "replies": []}, {"body": "How long do people typically take to cover their shorts? ", "score": 2, "replies": [{"body": "Tesla is at 3.5 days to cover right now according to Nasdaq", "score": 4, "replies": [{"body": "ELI5 ", "score": 1, "replies": []}]}, {"body": "Usually most volume is done in first hour ", "score": 1, "replies": []}]}, {"body": "you can bet your ass I'm closing my calls at open... ", "score": 2, "replies": []}, {"body": "Nice try RH", "score": 2, "replies": []}, {"body": "Your don’t think they covered in pre market?", "score": 1, "replies": []}, {"body": "China's ready to retaliate in the trade war. I expect TSLA to be neutralized by the overall downward movement. ", "score": 1, "replies": []}, {"body": "Are you really comparing Musky boi to Su Bae? I would ban you if I could.\n\nSu Bae would never apologize to analysts on a call. She'd call them boring bonehead pedo faggots because that's what they are. \n\nThat's exactly what they are.", "score": 1, "replies": []}, {"body": "lmaooooo", "score": 1, "replies": []}, {"body": "Took your advice. Held and added more in the morning. Muchos Gracias", "score": 1, "replies": []}, {"body": "You are so full of shit", "score": 1, "replies": []}]}
