{"title": "[deleted by user]", "selftext": "[removed]", "id": "97451s", "created_utc": 1534209905.0, "score": 464, "upvote_ratio": 0.97, "num_comments": 84, "comments": [{"body": "TSLA to $5000\n\nARAMCO/TESLA merger confirmed ", "score": 186, "replies": [{"body": "So this is how it goes\n\nSaudi realize their biggest threat is Electric cars/renewable energy sources\n\nTesla is the biggest car and battery player today.\n\nSaudi give assurance to Muskhead that he will get his funding, and they will help him make it private\n\nMuskhead gets overexcited. And starts partying on his jet back to the US and smoke the good CA ganja- hence the $420, and now is running around explaining shit to everyone.\n\nSaudi gives the money\n\nThen tesla is Private\n\nAnd then saudi is like “ Ha-HA!” Fooled you fucker. Tesla is shut down\n\nSaudi then win the gasoline war\n\nOil is up to $150 a barrel. Saudi rich again.\n\nThe end.\n\n( yeah its a bit late at night- but the story was fresh in my mind, had to get it out man) ", "score": 73, "replies": [{"body": "How could Tesla be shut down?", "score": 6, "replies": [{"body": "Did you try pressing the power button?", "score": 20, "replies": []}, {"body": "If you have money, you have power. Board seats are about to get very interesting in the next year.", "score": 4, "replies": []}, {"body": "Same way it'll be shut down in the real world.  It runs out of money.", "score": 3, "replies": []}]}, {"body": "They don't necessarily need to shut it down. But they certainly want to have a seat at the table if Tesla does revolutionize automobiles. The more control they have have over Tesla the better for them. It's win win whether Tesla succeed or fail.", "score": 1, "replies": []}]}, {"body": "Guess tan Tesla's will be a thing now. ", "score": -2, "replies": []}]}, {"body": "V12 engines or bust", "score": 88, "replies": [{"body": "I'm sure plenty of them have been Persian Conversion-ing their Model Ss into V12s already.", "score": 20, "replies": []}, {"body": "Guess tan Tesla's will be a thing now.", "score": -5, "replies": [{"body": "Sand g-wagon is a top three color with black and that dark blue", "score": 1, "replies": []}]}]}, {"body": "Gasoline engines are good for Tesla. Reliable technology ", "score": 48, "replies": [{"body": "No waiting around for your battery to recharge like a SCHMUCK.", "score": 8, "replies": []}, {"body": "A 5 gallon gas tank and a quiet 5 HP generator would improve the quality of the car in terms of mileage because if I'm on a long road trip and I don't want to stop for 45 minutes to sit around at a supercharger, I can just fuel up in 2.5 minutes and be back on the road.  To sustain a 60MPH cruise on a flat road, you only need 5HP to sustain.  For the hills you just rely on battery.", "score": 6, "replies": [{"body": "*20 minutes at a supercharger, which were built typically in a parking lot that has restaurants & coffee edit: shops, malls, etc. so you can eat shit and piss in your seat. \n\n", "score": 14, "replies": []}, {"body": "There's no way you only need 5hp to sustain 60mph. But even a 5hp generator and fuel tank adds a lot of weight and volume to the chassis for only a minor improvement. Is that really worth saving like 40 min at a charging station once or twice a year?", "score": 4, "replies": [{"body": "I've been waiting for the trailer-motor concept since electrics first came out. When they started talking about an everyman model3 I thought we were heading for a cost competitive car, under 20K, hook up a trailer with a motor for a special trip if I want to. The motor could be completely separate, an add on, be extra simple, easy to service and have all kinds of aspects to it that you couldn't do with a normal car, since it'd be turning a generator. With that system the car doesn't change while I change out this trailer for something more exotic, like a natural gas fired turbine. Possibilities are huge, since you could rent trailer generators for trips too.  \n  \nI would love if the saudis pushed tesla to do this. They won't tho.", "score": 2, "replies": [{"body": "The critical flaw could be as simple as, \"people don't like pulling trailers with their car.\" I mean, if you're going to do a trailer-motor, why not just a trailer-battery? Just switch out the trailer for a recharged one for long trips?", "score": 2, "replies": []}]}]}]}]}, {"body": "I grew up in Saudi. My dad worked there for Boeing back in the day. My mom drove once and the guards freaked out. I like other Arab countries, I don’t like saudis. ", "score": 89, "replies": [{"body": "It is pretty weird that the craziest fuckers in the Middle East are US allies.", "score": 57, "replies": [{"body": "money talks", "score": 72, "replies": [{"body": "> ton of oil talks\n>\nFify. That’s only reason we are “allies” even though they sponsor terrorism and are one of the most oppressive regimes out there", "score": 21, "replies": [{"body": "If America and Saudi Arabia were lovers, the relationship status would be: \"complicated\".   America's relationship with Saudi Arabia is Frankenstein in nature.  \n\nThe ISIS: \"Islamic State of Iraq and Syria\" are just Jihadi soldiers of Saudi Arabia and neighboring territories who heard the call of Allah to defend the oil rich territories that fuels their empire, in exchange for salary, good will from Allah and Prophet Mohammad.  Wahhabism is just a return to Quaranic fundamentalist literal readings of the Quaran.  ISIS is just the Islamic faith in \"gtfo of our territories\" mode. \n\nCalling ISIS something unique from Saudi Arabia is like calling \"Russian Soldiers\" invading another country something different than the Country of Russia who sent them.  Saudi Arabia denies using ISIS for their purposes to defend their income, and America indulges them by saying ISIS is a common Enemy to Saudis and we need to have them all killed so we can take the oil and sell it on the open market to our benefit, not Saudis.\n\nThe funny thing is, the government and general public on both sides know exactly what's going on here, and yet \"the grand deception\" continues.  ", "score": 8, "replies": [{"body": "In the end whoever funded IS might have helped the world. ISIS is defeated so hard, humiliated. IS lured in extremists all over the world, promising them victory, slaves and martyrdrom, all to be concentrated in Iraq and Syria, only to be defeated, killed and humiliated. Now the rest of the world has fewer extremists, (exceptions exist).\n\nOn top of that, Iraq became more of a nation, having defeated their common enemy together, this time without being ruled by some evil dictator. The army is stronger now, better relations with the west and the economy will continue to grow.\n\nThey'll open up more to global markets, buying Tesla cars, putting solarpanels all over their desert country and the world will improve!\n\nWho cares about Syria though.\n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Maybe not completely defeated. But they lost 95% of their territory and most of their members.\n\nAnd the only reason they accidently armed ISIS was to weaken Shia and Syrian government", "score": 2, "replies": []}]}]}]}, {"body": "Americans taught Saudis how to sponsor terrorism during Soviet-Afghan War. Pre-1980’s Saudi was pretty secular — like Iran... Then  Iran also began its Islamic Revolution (insert huge footnote re: USA involvement) and all of a sudden each began duking it out over who would be supreme Muslim leader of the world", "score": 0, "replies": []}]}]}, {"body": "It's basically like if you let the Gambino family run America.\n\nThey don't even have laws or courts or shit. Whatever the don says goes.  [They just started writing fucking laws down for the first time in January.](https://en.wikipedia.org/wiki/Legal_system_of_Saudi_Arabia)", "score": 19, "replies": [{"body": "[deleted]", "score": -13, "replies": [{"body": "1. You're a fucking idiot.\n\n2. There are 1.8 billion Muslims in the world. A minority of them are hardliners, a minority of hardliners think the US is evil, and a minority of hardliners that think the US is evil would consider actually doing something about it.\n\n3. You're a fucking idiot.\n\n4. Christians have bombed abortion clinics, assassinated doctors, bombed federal buildings, etc. Christian terrorists are a similar minority as Muslim terrorists.\n\n5. You're, like... really fucking stupid.\n\n6. Kill yourself.", "score": 9, "replies": []}]}]}, {"body": "Maybe they're all just crazy?", "score": 3, "replies": []}, {"body": "Oil secured.", "score": 2, "replies": []}, {"body": "Why would that be weird? ", "score": 1, "replies": [{"body": "Mainly because they fund terrorist organisations that openly oppose US interests... I’m aware of the reasons but it still kind of surprises me seeing each new US President bending the knee to the Gucci Taliban.", "score": 1, "replies": [{"body": "Who’s to say that those terrorist organizations are truly opposing US interests?", "score": 1, "replies": []}]}]}]}, {"body": "This one time at band camp...", "score": 21, "replies": [{"body": "...my mom almost got murdered for thinking she was an actual human being.", "score": 23, "replies": [{"body": "Did she learn?", "score": 2, "replies": []}]}]}, {"body": "pretty sure women can drop be in SA now, tho", "score": 2, "replies": [{"body": "Now but it took them what 70 so years to catch up to what is basically a human right in America", "score": 13, "replies": [{"body": "Take a step back and examine their history. Until a few Californians came searching for oil in the thirties, Saudi Arabia was almost a completely nomadic country. Their economy was bartering dates for water and food for fucks sake amongst other Arabs. \n\nFrom 1930-2000 the country basically fast forwarded from feudal technology to modernity in about 50 years. They didn’t have centuries to develop property rights and suffrage — such developments which are usually foundational to reach a point where wealth can be genuinely created. Are you getting me? They didn’t have to make any improvements to their culture and were rewarded with worldly sums of money without it. I can’t think of any other development case in the world like the Saudis. \n\nCould you imagine if there was a special natural resource in tribal Amazon and we started giving them hundreds of billions of dollars. Do you think that society would develop organically and match first world countries around the world??", "score": 2, "replies": []}, {"body": "And yet y’all Make these comparisons but criticize the gun lobby In The US -.- ", "score": 1, "replies": []}, {"body": "I'm just saying they're a step past much of the Islamic world. definitely still shit for human rights, but we should encourage the shit they (finally) get right. ", "score": -5, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "That’s caz ksa has more oil than  than Iran and lebanon ", "score": 4, "replies": []}, {"body": "Pretty sure a Saudi is the chairman of the UN’s human rights council. If that doesn’t tell you it’s a big farce.....", "score": 4, "replies": []}, {"body": "Lebanon maybe. I don't know anyone outside of the AIPAC lobby who actually hates Iran, it's just that nobody wants them to have nuclear weapons and they can't seem to stop trying to build them.", "score": 3, "replies": []}, {"body": "Tryin' to get that oil, son!", "score": 1, "replies": []}]}, {"body": "Lol no. They arrested the women rights activists and when CA called them out. They just boycotted maple syrup ", "score": 5, "replies": [{"body": "Edit: I'm retarded. Your \"Lol no\" was probably referring to giving them credit for finally progressing. If you want to shit on them for failing in other aspects of human right, that's cool with me, too. Idrc. Cheers.       \n           \nDo you tards even know how to Google? Jfc.     \n     \nSaudi Arabia started issuing women driver's licenses in June: https://www.bbc.com/news/world-middle-east-44367981     \n     \nBut, yeah, that Canada tweet shitshow was funny. ", "score": -2, "replies": []}]}]}]}]}, {"body": "Neat", "score": 1, "replies": []}, {"body": "You like countries where women are treated like shit?", "score": 0, "replies": []}, {"body": "This story reads like a 5 year old wrote it.", "score": -2, "replies": [{"body": "I try", "score": 6, "replies": []}]}]}, {"body": "Psst, Insider info: Saudis want Tesla to be exclusively electric, they just need Tesla to put built-in gasoline generator in the cars as only way to recharge. Win win.", "score": 11, "replies": [{"body": "Isn't part of the appeal of Tesla that you never have to buy another gallon of gasoline? I only know 1 Tesla owner because I live in the middle of nowhere but he said that's a big part of why he got it.", "score": 1, "replies": [{"body": "What's a joke", "score": 3, "replies": []}]}]}, {"body": "Bin laden 2.0", "score": 8, "replies": []}, {"body": "I know this sub is for memes only... but I don't think it's infeasible that, in an attempt to diversify, the Saudi Wealth Fund decides investing in electric vehicles is a wise choice. If they own a significant portion of the future of transportation they'll continue to grow their existing wealth without being so prone to funding conflict or the fluctuation of oil reserves...", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "That would be the sensible, reserved, logical move... Not sure how well those words align with Saudi Oil Princes, especially when it comes to throwing $$$ around.", "score": 5, "replies": []}, {"body": "Lol what makes you sure Saudis are modeling after Norwegians??????? Saudis built their whole country up on ONE single company. This is not new to them. ", "score": 2, "replies": [{"body": "Norway as well.", "score": 1, "replies": []}]}]}, {"body": "Saudi Arabia has the most indomitable access to sun and hardly any has been harvested. ", "score": 1, "replies": []}, {"body": ">I don't think it's infeasible that, in an attempt to diversify, the Saudi Wealth Fund decides investing in electric vehicles is a wise choice\n\nI don't think they decide that investing in a company that is bleeding money and will forever bleed money is a wise choice.", "score": 1, "replies": []}]}, {"body": "Profits will be huge. Just think Tesla owners can support the cars built by kids and criminals.. it’ll be ok. It’ll be a private company. ", "score": 19, "replies": [{"body": "Do you think it would be profitable to build cars that run on gasoline instead of electricity?", "score": -8, "replies": [{"body": "Do you think every other automaker on earth isn’t profitable?", "score": 18, "replies": [{"body": "They are profitable companies", "score": 6, "replies": [{"body": "You have to understand ", "score": 11, "replies": []}]}]}]}]}, {"body": "Tesla / Elon fan boys would still back to company till bankruptcy ", "score": 3, "replies": []}, {"body": "That's the future ", "score": 1, "replies": []}, {"body": "Saudi Arabia is the kinda place that try’s to change the name of Persian Gulf to Arabian Gulf. Lol ok, Abdul. ", "score": 1, "replies": []}, {"body": "Saudi to Tha mewn with SpaceX confirmed. ", "score": -3, "replies": []}, {"body": "It is kind of contradictory for Saudis to fund Tesla as Tesla undermines the Saudis chief source of income.", "score": -18, "replies": [{"body": "LOL I love you retards.", "score": 36, "replies": []}, {"body": "This guy doesn't hedge", "score": 30, "replies": [{"body": "I'll eat my words when the deal closes.", "score": -2, "replies": [{"body": "Ban if not true, must eat words REEEEEEEEEEEEEEEEEEEEEE", "score": 5, "replies": [{"body": "I'll show myself out when Saudi money buys Tesla at $420 a share. Not a penny less.", "score": 1, "replies": []}]}]}]}, {"body": "Saudis are not dumb, they are playing the long game for a while now.  They know oil will run out and have been building to be a economic powerhouse with investments everywhere.  Oil will keep going up over the long term.  Just need to be ready for when the pipes go dry. ", "score": 3, "replies": [{"body": "When the pipes go dry we're going to have much larger concerns than Tesla's viability as a profitable company.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": ">he fell for the peak oil meme", "score": -2, "replies": [{"body": "Oil isn't magical ground juice. It won't run out but it will get prohibitively expensive to get out of the ground.", "score": 4, "replies": []}]}]}, {"body": "You're not too bright, are you", "score": 2, "replies": []}]}]}
