{"title": "$TSLA target cut to $195 from $308 at @jpmorgan via Ryan Brinkman", "selftext": "", "id": "98sw52", "created_utc": 1534765615.0, "score": 278, "upvote_ratio": 0.96, "num_comments": 85, "comments": [{"body": "Nice.\nShe definitely secured my funding.", "score": 268, "replies": [{"body": "mountainous friendly cable afterthought depend hungry sheet smart dull history", "score": 43, "replies": []}, {"body": "I’d go All In", "score": 98, "replies": [{"body": "I'd Call then Put it in her MuMu. ", "score": 31, "replies": []}, {"body": "Someone hand me my Pfizer stock!", "score": 7, "replies": []}]}, {"body": "she hawt ", "score": 17, "replies": []}, {"body": "Definitely better investment than Grimes", "score": 16, "replies": [{"body": "Anything is a better investment than Grimes.", "score": 14, "replies": [{"body": "Honestly, goth chicks give some really sloppy head plus they tend to be pretty open minded in the bedroom. I'm going to have to say that grimes would be a better investment. ", "score": 3, "replies": []}]}]}, {"body": "PROSPERITY ENSURED", "score": 8, "replies": [{"body": "PROGENY\\*", "score": 3, "replies": []}]}]}, {"body": "Really should've sold those $420 calls when they worth money.", "score": 88, "replies": [{"body": "they still worth money. just a lot less now", "score": 70, "replies": [{"body": "https://tenor.com/ZPvX.gif", "score": 6, "replies": []}]}]}, {"body": ">Our interpretation of subsequent events leads us to believe that funding was not secured for a going private transaction, nor was there any formal proposal.\n\nhttps://i.imgur.com/Yixr3jv.gif", "score": 57, "replies": []}, {"body": "BREAKING: Rite Aid and Tesla in merger talks. ", "score": 60, "replies": [{"body": "BREAKING: Tesla in merger talks with Carr fire", "score": 15, "replies": []}]}, {"body": "This is good for $TSLA", "score": 40, "replies": [{"body": "I'm overall bullish on TSLA, but this is the first time I feel like Elon made a genuinely stupid mistake. Like on a fundamental level. Not just being testy with people with the usual rants on Twitter.", "score": 19, "replies": [{"body": "The FIRST time? Are you mad son?", "score": 1, "replies": [{"body": "Yeah I never minded his other Twitter rants and generally stand by the guy.", "score": 1, "replies": [{"body": "Look, I also found it funny, when he called that cave diver a pedo, but you can't honestly say it wasn't a mistake?", "score": 1, "replies": [{"body": "Mistake, but not a serious business one, in my opinion. Just excusable stupidity, similar to Donald Trump or Mark Cuban-style ranting.", "score": 1, "replies": []}]}]}]}, {"body": "Did he? He probably short the shit out of his stock before doing this. ", "score": -3, "replies": [{"body": "Shorting is the same as selling stocks you don't own.  \n\nHe owns like 25% of TSLA.  \n\nThe price going down does not benefit him. Even if he shorted an amount of stocks equal to like 10% of TSLA, he'd still effectively own 15% of TSLA since stocks are fungible.  \n\nThis makes no sense.", "score": 11, "replies": []}]}]}]}, {"body": "Still over valued by $195.", "score": 50, "replies": [{"body": "[deleted]", "score": -50, "replies": [{"body": "[deleted]", "score": 130, "replies": [{"body": "Or an alcoholic that couldn't control even during pregnancy", "score": 34, "replies": [{"body": "hey, my mom always tells me they didn't find out about fetal alcohol syndrome until after i was born. it isn't her fault, she says. ", "score": 2, "replies": []}]}, {"body": "3.9 billion/170 million=22\n\nFord sells about 22 times as many cars as Tesla so I agree with that guy", "score": 16, "replies": []}]}, {"body": "This post gave me autism", "score": 9, "replies": [{"body": "Is it catching?", "score": 1, "replies": []}]}]}]}, {"body": "https://i.imgur.com/4sv0cgH.jpg", "score": 12, "replies": []}, {"body": "is this good for $MU?", "score": 45, "replies": [{"body": "Didn't u see the flowchart? This is bad for $MU", "score": 69, "replies": [{"body": "I dont know why people ask anymore.... we provided an educational flowchart", "score": 15, "replies": []}]}, {"body": "Everything is bad for MU.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Try a straddle. ", "score": 3, "replies": []}]}]}, {"body": "This is purely anecdotal Barron's type bull, but below is the most recent interview Musk has done. When asked if, and if so when, they could produce a car for $25k Musk said if they worked \"really really hard\" they might be able to do it in 3 years. This dude has no idea wtf he's doing - sounds like he's coaching a high school football team.\n\n[https://www.youtube.com/watch?v=MevKTPN4ozw](https://www.youtube.com/watch?v=MevKTPN4ozw)", "score": 36, "replies": [{"body": "I facepalmed when I heard him pull that out of his ass.  They can't even produce the $35k package at a profit.  What in the fuck is he going on about with a $25K option.  Elon the Bullshit Artist strikes again.", "score": 19, "replies": [{"body": "I thought someone analysed the Model 3 and found that it had 30% profit margins? ", "score": 6, "replies": [{"body": "Well that depends- are they talking about the base $35k Model 3 that can no longer be ordered, or the more expensive kitted-out versions?", "score": 9, "replies": []}, {"body": "Munro and yes. ", "score": 4, "replies": []}, {"body": "\"Someone\" probably did.  That \"someone\" was probably also either a dumbass or on the take.", "score": 2, "replies": []}, {"body": "thought it was 19%. ill see if I can find the article.", "score": 1, "replies": []}, {"body": "They said it would generate a 30% profit assuming Telsa's production line is at least as good as the most efficient car manufacturers.", "score": 1, "replies": []}]}, {"body": "Where did the unprofitable base model meme come from? It has no evidence.", "score": -16, "replies": [{"body": "Maybe from the fact that it's unprofitable?", "score": 26, "replies": [{"body": "You might be onto something", "score": 8, "replies": []}, {"body": "https://www.reuters.com/article/us-autos-tesla-study/tesla-model-3-is-most-profitable-electric-car-consultant-idUSKBN1K71VV\n\nOr are you so stupid that you expect a growth stock to maintain cash reserves?", "score": 0, "replies": []}]}, {"body": "From Musk's mouth actually. He is not a very credible source though.", "score": 9, "replies": [{"body": "It obviously wasn't going to be instantly proffitable, find anything recent that says that.\n\nhttps://www.reuters.com/article/us-autos-tesla-study/tesla-model-3-is-most-profitable-electric-car-consultant-idUSKBN1K71VV", "score": 1, "replies": []}]}, {"body": "If it were profitable they'd be building and selling those instead of letting $50K Model 3s bake under the California sun in dusty lots.", "score": 0, "replies": [{"body": "They would still make the most expensive ones first since those are more profitable.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Relevant user name", "score": 2, "replies": []}]}]}, {"body": "And we're back at $305 lmfao", "score": 15, "replies": []}, {"body": "They set the target at $308 because they would've looked dumb setting it at a reasonable number. They still look dumb for attempting reason on Tesla stock.", "score": 5, "replies": []}, {"body": "JUST IN: Tesla to merge with the Catholic Church. Elon Musk will assume the role of Pope in place of Francis. ", "score": 4, "replies": []}, {"body": "TSLA stock was always overpriced due to hype and too much money sloshing around the financial world.  The delays in the model 3 are to be expected from a company that has never been a big manufacturer before and has only just started scaling up.  So long as Elon can actually deliver the model 3, Tesla is a buy in the medium term; but a sell in the short term.", "score": 8, "replies": []}, {"body": "Damn thats a big cut", "score": 3, "replies": []}, {"body": "solid DD", "score": 2, "replies": []}, {"body": "Okay so those huge volume spikes on TSLA at 2:33 and 2:59 PM respectively, is that how you spot insider trading or am I just being a dumbass?  Also I bought a call but to hell if I'm holding after the open. ", "score": 2, "replies": []}, {"body": "Oh no it closed up on the day", "score": 2, "replies": [{"body": "that 300 support is strong man", "score": 1, "replies": []}]}, {"body": "I always thought 250...but 195 I would buy in. ", "score": 4, "replies": [{"body": "Yup that way you can still lose 195 which isn’t as bad as losing 250. ", "score": 11, "replies": [{"body": "Movie pass logic except it was a good buy at 10. Made like 20 bucks after seeing three movies last month", "score": 1, "replies": []}]}]}, {"body": "These analysts are cognitively impaired. I understand that TSLA is overvalued and all, but how is PT of a 50-billion dollar company slashed by 33% on some bullshit SEC investigation into CEO's tweets? At worst Musk will be slapped with a fine, end of story, nothing has changed about the company. Bears will be bearish, I get it, but lowering PT by >$15 billon based on recent events is delusional.", "score": 1, "replies": [{"body": "They had it at $180 initially and bumped it up because of the possibility that the $420 deal might be legit. Now that it’s looking more and more bullshit, they’re just going back to their original valuation.\n\nIt’s not really about the SEC investigation, it’s that they raised it off a deal that wasn’t there.", "score": 39, "replies": [{"body": "Ohh ok thx, my bad.", "score": 11, "replies": []}, {"body": "And if they were investing their own money they've been a loser at every point. So why would you care what they think?", "score": 2, "replies": [{"body": "I really don’t, I think Wall Street price points are bullshit more often than not. \n\nBut if you’re going to criticize anyone, you should be doing it for the right reasons.", "score": 3, "replies": [{"body": "Their original valuation was, and continues to be, 33% wrong.\n\nIf not for the recent Musk own goal, it would have been a lot more wrong than that (prob would be $350 still). $20 of the pop from $350 could be attributed to his tweet and (currently) $50 of the fall - but the investment thesis shouldn't have changed so much. \n\nI'm sick of people who blahblah on twitter about Tesla's unsustainability when they have been calling short since 2 years ago and have got their face ripped off the entire time. If they had been acting on their own advice they'd have been fired and we wouldn't be hearing from them.", "score": 1, "replies": []}]}]}]}]}, {"body": "fuk this bs i sold my tesla call at a loss at this news then tesla decides to spike up afterward.", "score": 1, "replies": [{"body": "Rookie mistake. TSLA never drops when banks lower their targets.", "score": 1, "replies": []}]}, {"body": "All the upper class selling their Tesla cause plebs can own one for 35k. ", "score": 1, "replies": []}, {"body": "I'd love to give her the definition of shorting (͡•_ ͡• )", "score": 1, "replies": []}, {"body": "I guess naked puts at $190-195 are free money all day long then.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You are fucked then", "score": 8, "replies": []}]}, {"body": "Imo the upgrade was bullshit in the first place, \"lets just choose something between 0 and 420 and make that the price target.\"", "score": 0, "replies": []}, {"body": "Food for thought, hear me out.\n\nElon did it on purpose, all he needs is one Saudi guy to confirm the deal, sec is off his back. Original deal is scrapped, new one comes along to take it private at the tanked price.", "score": -7, "replies": [{"body": "He did it on purpose to fuck over the shorts for a few days.", "score": 11, "replies": []}, {"body": "isn't that kind of illegal?", "score": 7, "replies": [{"body": "It's literally market manipulation, so yes. ", "score": 13, "replies": []}]}]}]}
