{"title": "If there is a crash do you just hold your index funds?", "selftext": "The market will will go through a bear period eventually. When it does should you hold onto your index funds or just ride it out and keep buying?", "id": "95qsil", "created_utc": 1533767565.0, "score": 28, "upvote_ratio": 0.79, "num_comments": 84, "comments": [{"body": "Hold everything and keep buying. If only we had the...option...to protect our long positions in a bear market.", "score": 46, "replies": [{"body": "Buy puts?", "score": 13, "replies": [{"body": "That’s supposed to be a secret...you didn’t hear it from me", "score": 29, "replies": []}, {"body": "This. Both the February and the June slides were preceded by the market looking toppy plus downward pivots on all the major indices at the same time, and confirmed by beginnings of downtrends. Then came the slide. They didn’t just crash out of nowhere.\n\nThat kind of thing starts happening, buy insurance (puts). Worst case scenario it was a false signal and you can close your put for a loss, instead of your long position getting raped or you selling out on a false signal. Then you can laugh and buy back in with a much lower cost basis while everyone is pulling their hair out.", "score": 2, "replies": []}, {"body": "In this case how to you judge the expiration of the puts ? Do you buy them with a 6 month/1 year expiry ?", "score": 1, "replies": []}]}, {"body": "So don’t even sell?", "score": 5, "replies": [{"body": "Don’t sell out of fear of losing money. Sell if you need the cash for something important.", "score": 22, "replies": [{"body": "I guess what I was thinking is like craps. Take my profits off the table. Hold and then get back into index funds when I think the table (market) is getting hot again. I know with index funds it’s buy and hold. But I feel you can use profits and cash to move into more shares. ", "score": 3, "replies": [{"body": "everyone thinks they can time the market. You’re gonna end up sitting on cash for months and months watching everything go up and up and feel like shit. If you happen to get lucky and everything goes down after you sell, by the time everything gets “hot” again, you’ve potentially missed some incredible gains", "score": 19, "replies": [{"body": "Time in the market > timing the market ", "score": 11, "replies": []}, {"body": "Yes. Everyone has been saying something similar to this. Thanks for the advice. Figure I’ll just keep buying through the market. ", "score": 2, "replies": [{"body": "Historically, people who held through have done much much better on average than people attempting to time the sell and then buy in afterwards.\n\nEven better if you buy the discounted prices. ", "score": 7, "replies": []}, {"body": "Everyone with a low IQ says this", "score": -4, "replies": []}]}]}, {"body": "The reason folks are not a proponent of this is you can miss out on big gains.  What if you take your funds out right now and within the next year there is a 10%+ upswing?  No one knows exactly when it will finally start happening.\n\nWhat I have done is slightly decrease my investments, saving more for cash.  I am still investing, but more slowly than I had been previously.  Once we start to see some corrections, you can start feeding your cash into it.", "score": 3, "replies": [{"body": "I got you. This makes total sense. Thank you. ", "score": 2, "replies": []}]}]}, {"body": "Why not take profit, take all that money and buy the dip?", "score": -2, "replies": [{"body": "what dip? You’re relying on the price dropping below your sell price but often it doesn’t do this and you end up buying into some future dip that is higher than your sell price. ", "score": 8, "replies": [{"body": "Well right now im 4% up. Just got in a few weeks ago. A market crash will send it maybe 20-30 % down. So in my case, sell now. Then buy in when it starts to recover after a year or something", "score": -7, "replies": [{"body": "you’re assuming the market will crash soon. The whole point of this thread is that you can’t predict it. ", "score": 8, "replies": [{"body": "No the longer thw better ofc. Soon as someone says market crash i sell.", "score": -1, "replies": [{"body": "Someone says market crash on every bad day", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "No if it comes i cash out, if not i stay", "score": -2, "replies": []}]}]}]}]}]}, {"body": "Sell when you are dead.", "score": 3, "replies": [{"body": "Haha ", "score": 1, "replies": []}]}, {"body": "He’s saying to buy some puts whenever you feel disaster coming. OTM puts can be a cheap hedge if you feel short term disaster coming or whatever", "score": 1, "replies": []}, {"body": "go read tony robbins book unshakable, it costs like $30 and will make you far more than $30", "score": 1, "replies": [{"body": "I’ll look into that. Been gobbling up knowledge ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That is this book", "score": 1, "replies": [{"body": "I thought it was called something else? My bad.", "score": 1, "replies": [{"body": "It’s a shorter version of a different book he wrote previously so it’s easy to get confused, I only knew it because it is sitting within eyesight on the shelf after I read it last summer ", "score": 1, "replies": [{"body": "Isn't Tony Robbins a money scamming machine? Why would u recommend him? ", "score": 3, "replies": [{"body": "Why would you say that? Honest question I’ve never heard that but I don’t talk about the guy ever. This book is mostly just about how you can’t time the market and how to calm your nerves when watching your portfolio lose 40% of its value in a recession and not sell everything ", "score": 0, "replies": [{"body": "I think he is thinking of [Tony Little](https://www.google.com/search?q=tony+little&rlz=1CDGOYI_enUS748US748&hl=en-US&prmd=ivn&source=lnms&tbm=isch&sa=X&ved=0ahUKEwit8JyEkeHcAhWInoMKHUbWBiUQ_AUIESgB&biw=375&bih=591#imgrc=xITkElyA8J6NiM:) ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "But what if the option expires before the bear market comes? Then aren't you paying the premium for essentially waiting for it to expire?", "score": 1, "replies": [{"body": "yeah but you are profiting overall so it’s obviously better than selling everything ", "score": 1, "replies": []}]}]}, {"body": "Both. Hold on to your seat, and scrounge up money to plow into investments. Easier said than done. 50% drops are terrifying, and when it's happening, no one knows how far it'll drop. That said - if you have the gumption and a long investing horizon, you can make Time your best friend and investing partner.", "score": 14, "replies": [{"body": "So don’t even sell?", "score": 7, "replies": [{"body": "Nope. Why would you lock in losses when you can just wait it out? Keep in mind if you're DRIPing, those dividends are buying discounted shares that will turbocharge your future returns.", "score": 4, "replies": [{"body": "Yes I am DRIPing. And yeah this seems to be the reoccurring advice. Hold hold and buy buy ", "score": 4, "replies": [{"body": "It's the standard advice for net accumulators. The sticky part is that most people don't do it, for mostly psychological reasons. Investor behavior tends to deviate from the model, with negative consequences. I think I read that model real returns are in the 7% range while actual investor real returns are in the 1-2% range with the difference almost entirely explained by subpar behavior.", "score": 3, "replies": [{"body": "Hard to fight nature. Just preparing myself for the Bear when it shows up. ", "score": 0, "replies": [{"body": "Buy low sell high. Not the other way around, ever.", "score": 1, "replies": []}]}]}, {"body": ">Yes I am DRIPing. And yeah this seems to be the reoccurring advice. Hold hold and buy buy\n\nwhat is  DRIPing?", "score": 2, "replies": [{"body": "Dividend Reinvestment Plan\n\nhttps://www.google.com/amp/s/www.fool.com/amp/retirement/2018/05/21/your-complete-guide-to-drip-investing.aspx", "score": 2, "replies": []}]}]}]}, {"body": "I'm 24. Everything I buy has a 40-50 year expectation. Here's how I see it. If anybody wants to chime in, please do.\n\nI wouldn't sell for a few reasons:\n\n1) I would have no way to predict or life experience otherwise that would give me an instinct in trying to time the nadir of the crash to reinvest everything reclaimed by liquidating.\n\n2) By liquidating your portfolio, you'd be denying yourself the dividends associated with whatever you are invested in. \n\n3) By holding, even as the equity of your positions drop, you're still going to get dividends that are paid out in liquid money. With this and whatever other contributions you can make by saving money elsewhere to bolster your portfolio with when the market seems to finally be reversing - even if setting aside in cash each paycheck a bit during the recession/depression - you can invest once again once recovery sets in and in a morbid sense potentially get a great amount of great stocks at clearance aisle prices.\n\nReason why I would sell:\n1) Company totally implodes and has no chance of survival.\n\nThis is all related to time though. If you have enough time before retirement to safely wait out both a crash and its recovery until it returns to post-crash levels, then you will come out just as well as if it never happened.", "score": 5, "replies": [{"body": "I wish I had your insight when I was 24. But yes. Everything you’re saying seems right from what everyone is saying. ", "score": 2, "replies": [{"body": "Let our squiggly money lines ascend into the heavens, my friend", "score": 5, "replies": []}]}]}]}]}, {"body": "Go back in the past 100 years of the market. Pick any one spot. Then look at the value of the same index a year later. Then 5 years later. Then 10. 20. 50.\n\nThe one thing that the market will guarantee eventually is that it will always go up. It might spike. It might crash. But in the long run, it will always go up.\n\nSo then how do people lose money in the market if the market always goes up? They sell when it gets rough. \n\nAnother way too look at it is not the monetary value of what you have, but by shares. If you have 100 shares of a index fund and it loses half its value, you still have a hundred shares. \n\nA good book to read on this is The Simple Path to Wealth.", "score": 11, "replies": [{"body": "Thanks. I’ll definitely look into the book!", "score": 1, "replies": []}]}, {"body": "Look at it this way- the SP500 has to go up eventually. If it doesn't it basically means the US econonmy is fucked and we'll all have bigger problems than our brokerage accounts getting smaller. So think long term babyboi!", "score": 7, "replies": [{"body": "Ha. Yes. I understand the last point entirely. ", "score": 1, "replies": []}]}, {"body": "Yep. I've been through a bunch of crashes and bear markets, starting with the dotcom bubble burst where I lost 50% of my retirement savings.\n\nNot only did I keep holding on, I kept contributing to my 401k and IRAs. It worked out really well for me. I've seen enough crashes that I actually look forward to them because it means I can buy more shares at a cheaper price.\n\nThe only time I sell is when I need the cash for something. I don't sell because of market conditions and I don't sell when I get scared. That's a shit reason to sell.", "score": 10, "replies": [{"body": "Yes. That’s what I am hoping for. I won’t stop investing. Thank you. ", "score": 1, "replies": []}]}, {"body": "A lot of this depends on your strategy. Are you looking to use this money in 5 days or 50 years? If your doing 5 days obviously you don’t want hold through a 50% drop. But if your holding for 50 years you should want the price to drop so you can average down with a couple orders a week or month to grab a low price. ", "score": 3, "replies": [{"body": "Hadn’t thought about this way. And even within the strategy I guess I can treat each company as either a 5 or 50 year investment. Thanks. ", "score": 1, "replies": [{"body": "Just have a plan before you do anything and stick to it. If your investing in something for years to come make sure you won’t need that money for a long time so you don’t have to sell at the bottom and then watch the stock soar for the next couple years. ", "score": 1, "replies": [{"body": "Hadn’t even thought about this. I didn’t start investing until I had a home and had m expenses under control.  One big reason I want to start a HSA also.  ", "score": 1, "replies": []}]}]}]}, {"body": "Here are two charts of the VTI share price:\n\n[July 1st 2006 to July 1st 2008](https://finance.yahoo.com/quote/VTI/chart?p=VTI#eyJpbnRlcnZhbCI6IndlZWsiLCJwZXJpb2RpY2l0eSI6MSwidGltZVVuaXQiOm51bGwsImNhbmRsZVdpZHRoIjoxMS4wOTUyMzgwOTUyMzgwOTUsInZvbHVtZVVuZGVybGF5Ijp0cnVlLCJhZGoiOnRydWUsImNyb3NzaGFpciI6dHJ1ZSwiY2hhcnRUeXBlIjoibGluZSIsImV4dGVuZGVkIjpmYWxzZSwibWFya2V0U2Vzc2lvbnMiOnt9LCJhZ2dyZWdhdGlvblR5cGUiOiJvaGxjIiwiY2hhcnRTY2FsZSI6ImxpbmVhciIsInN0dWRpZXMiOnsidm9sIHVuZHIiOnsidHlwZSI6InZvbCB1bmRyIiwiaW5wdXRzIjp7ImlkIjoidm9sIHVuZHIiLCJkaXNwbGF5Ijoidm9sIHVuZHIifSwib3V0cHV0cyI6eyJVcCBWb2x1bWUiOiIjMDBiMDYxIiwiRG93biBWb2x1bWUiOiIjRkYzMzNBIn0sInBhbmVsIjoiY2hhcnQiLCJwYXJhbWV0ZXJzIjp7IndpZHRoRmFjdG9yIjowLjQ1LCJjaGFydE5hbWUiOiJjaGFydCJ9fX0sInBhbmVscyI6eyJjaGFydCI6eyJwZXJjZW50IjoxLCJkaXNwbGF5IjoiVlRJIiwiY2hhcnROYW1lIjoiY2hhcnQiLCJ0b3AiOjB9fSwibGluZVdpZHRoIjoyLCJzdHJpcGVkQmFja2dyb3VkIjp0cnVlLCJldmVudHMiOnRydWUsImNvbG9yIjoiIzAwODFmMiIsImN1c3RvbVJhbmdlIjp7InN0YXJ0IjoxMTUxODg0ODAwMDAwLCJlbmQiOjEyMTQ3ODQwMDAwMDB9LCJzeW1ib2xzIjpbeyJzeW1ib2wiOiJWVEkiLCJzeW1ib2xPYmplY3QiOnsic3ltYm9sIjoiVlRJIn0sInBlcmlvZGljaXR5IjoxLCJpbnRlcnZhbCI6IndlZWsiLCJ0aW1lVW5pdCI6bnVsbH1dLCJyYW5nZSI6eyJwZXJpb2RpY2l0eSI6eyJpbnRlcnZhbCI6IndlZWsiLCJwZXJpb2QiOjF9LCJkdExlZnQiOiIyMDA2LTA3LTAzVDAwOjAwOjAwLjAwMFoiLCJkdFJpZ2h0IjoiMjAwOC0wNi0zMFQwMDowMDowMC4wMDBaIiwicGFkZGluZyI6MH19)  \n[February 1st 2014 to February 1st 2016](https://finance.yahoo.com/quote/VTI/chart?p=VTI#eyJpbnRlcnZhbCI6IndlZWsiLCJwZXJpb2RpY2l0eSI6MSwiY2FuZGxlV2lkdGgiOjExLjA5NTIzODA5NTIzODA5NSwidm9sdW1lVW5kZXJsYXkiOnRydWUsImFkaiI6dHJ1ZSwiY3Jvc3NoYWlyIjp0cnVlLCJjaGFydFR5cGUiOiJsaW5lIiwiZXh0ZW5kZWQiOmZhbHNlLCJtYXJrZXRTZXNzaW9ucyI6e30sImFnZ3JlZ2F0aW9uVHlwZSI6Im9obGMiLCJjaGFydFNjYWxlIjoibGluZWFyIiwic3R1ZGllcyI6eyJ2b2wgdW5kciI6eyJ0eXBlIjoidm9sIHVuZHIiLCJpbnB1dHMiOnsiaWQiOiJ2b2wgdW5kciIsImRpc3BsYXkiOiJ2b2wgdW5kciJ9LCJvdXRwdXRzIjp7IlVwIFZvbHVtZSI6IiMwMGIwNjEiLCJEb3duIFZvbHVtZSI6IiNGRjMzM0EifSwicGFuZWwiOiJjaGFydCIsInBhcmFtZXRlcnMiOnsid2lkdGhGYWN0b3IiOjAuNDUsImNoYXJ0TmFtZSI6ImNoYXJ0In19fSwicGFuZWxzIjp7ImNoYXJ0Ijp7InBlcmNlbnQiOjEsImRpc3BsYXkiOiJWVEkiLCJjaGFydE5hbWUiOiJjaGFydCIsInRvcCI6MH19LCJsaW5lV2lkdGgiOjIsInN0cmlwZWRCYWNrZ3JvdWQiOnRydWUsImV2ZW50cyI6dHJ1ZSwiY29sb3IiOiIjMDA4MWYyIiwiY3VzdG9tUmFuZ2UiOnsic3RhcnQiOjEzOTEzODU2MDAwMDAsImVuZCI6MTQ1NDI4NDgwMDAwMH0sInN5bWJvbHMiOlt7InN5bWJvbCI6IlZUSSIsInN5bWJvbE9iamVjdCI6eyJzeW1ib2wiOiJWVEkifSwicGVyaW9kaWNpdHkiOjEsImludGVydmFsIjoid2VlayJ9XSwicmFuZ2UiOnsiZHRMZWZ0IjoiMjAxNC0wMi0wMVQwMDowMDowMC4wMDBaIiwiZHRSaWdodCI6IjIwMTYtMDItMDFUMDA6MDA6MDAuMDAwWiIsInBlcmlvZGljaXR5Ijp7ImludGVydmFsIjoid2VlayIsInBlcmlvZCI6MX0sInBhZGRpbmciOjB9fQ%3D%3D)\n\nThese two charts are eerily similar. VTI grows for the first 1-1.5 years, then drops like a rock to where it started. They even both have false recoveries halfway through the drop. I'm sure someone happened to compare the two in the beginning of 2016 and had his heart drop through his pants. But scroll forward and you'll see that while in 2008 it just kept dropping until bottoming out at half of the all time high, in 2016 it recovered and beat the all time high 9 months later, and is still kicking ass more than two years later. That guy in the beginning of 2016 might have felt reasonably confident that that the crash was coming, and might have bailed out, loosing out on the market upswing last couple of years.\n\nPoint is a crash isn't a black or white situation. Pullbacks/crashes can happen to any degree. You don't know if a drop yesterday, last week or last month is a sign of continuing drop or if the market is swinging up again. It's pointless to try to predict something that just can't be predicted. That being said it's probably not too disadvantageous to keep part of your portfolio in a bond fund to capitalize on pullbacks.", "score": 3, "replies": [{"body": "Thank you. You’re right. Just impossible to predict the market. ", "score": 1, "replies": []}]}, {"body": "I've survived three major crashes, and the same strategy worked for me on all three.  \n\nHold until the bleeding stops and the market begins to recover.  Sell your sector and etf funds with the smallest losses and load up on those that fell the hardest (e.g. tech, real estate, financials).  \n\nOver the next few years, the gains you will make from your new allocation will put your portfolio well above pre-crash value.", "score": 3, "replies": []}, {"body": "There is a guy who is rich on SeekingAlpha and he’s a multimillionaire.\n\nHis name is ‘BuyAndHold’\n\nHe doesn’t sell stocks. Ever. NEVER SELLS. \n\nDon’t sell your stocks ", "score": 4, "replies": [{"body": "Ha. Thanks ", "score": 3, "replies": []}, {"body": "How did he make his millions?", "score": 2, "replies": [{"body": "Buying and holding ", "score": 1, "replies": [{"body": "If he never sells, he has no money.", "score": 2, "replies": []}]}]}]}, {"body": "You need an emergency fund and very managable debt to not be forced to sell, but if you have that and a stable job buy as much as possible.\n\nIn crises many riches get to rags but also a few rags get to riches.", "score": 2, "replies": []}, {"body": "I highly recommend you read A Random Walk Down Wall Street", "score": 2, "replies": [{"body": "I will check it out. Thanks! ", "score": 1, "replies": []}]}, {"body": "Dollar cost average. Stop trying to time the market. ", "score": 2, "replies": []}, {"body": "I do not just hold in a crash, I buy more", "score": 2, "replies": []}, {"body": "You can, it's safe in the long term. \n\nHowever, if you want some shelter, move into gold or some other value holder. ", "score": 1, "replies": [{"body": "Gold has storage costs and doesn't generate cash. Better to be in T-Bills if you're scared. Gold pushers tend to ramp up marketing and rake in cash from worried investors when the economy gets ugly. Been there, done that, advise strongly against it.", "score": 2, "replies": []}]}, {"body": "Tax loss harvest if you can. Try to buy at the \"bottom.\"", "score": 1, "replies": []}, {"body": "Hold everything, buy more...\n\nBuy low sell high aka buy red sell green", "score": 1, "replies": []}, {"body": "Depends on your age. If you're young, you hold through and add to your position even as it falls. No reason to try to call the bottom. Assuming the US economy doesn't crash or enter a long period of stagnation, the market will recover. It always does", "score": 1, "replies": []}, {"body": "Moon soon.", "score": 1, "replies": []}, {"body": "This depends on your age, savings, and financial goals. If you’re young, generally you just want to ride out the bear market. Look at it as a buying opportunity for discounted stocks.\n\nIf you’re nearing retirement then this could hurt you, but even then I’m not sure if you sell. The closer you get to retirement the lower risk your portfolio should be anyway. You should have more bonds and other sources of stable income.\n\nIf you think that you’re going to need the money in the short term (car, house, kid, etc.) then I would question why you have the money in the market in the first place, but that aside then it might be a situation to sell.\n\nThere isn’t a broadly correct answer here, although platitudes like “don’t sell at a loss” or “buy and hold” are easy enough to throw out. This is really dependent on your specific financial situation.", "score": 1, "replies": [{"body": "thank you for your practical advice. I try to keep some money on hand for “life.” I’m young enough to ride it out. Just want to start thinking for when the market takes a turn. ", "score": 1, "replies": [{"body": "I believe the recommendation is:\n\n1. Cap employer retirement contributions\n2. Have a few months living expenses in something liquid and safe. Savings works.\n3. Cap yearly ROTH IRA contributions\n4. Money left over? Self directed investing or call a financial advisor because you're doing well.", "score": 1, "replies": []}]}]}, {"body": "The idea is to put  \n25% in Cash,  \n25% in Gold,  \n25% in Index funds,  \n25% in bonds.  \n\nAnother simple version is 75% in stocks, 25% in bonds. \n\nThen every month you rebalance to maintain these ratios. If your stocks go up you sell a bit to bring the bonds back to 25%. \n\nIf the stocks crash you sell some bonds and buy stocks to rebalance. \n\nThis way you always sell high, buy low and have money available to reinvest at the bottom. ", "score": 1, "replies": [{"body": "I never understood why people are so heavy in bonds... I own a little of a total bond index fund but I mean, doesn't the bond market crash with stocks usually? \n\n Also- I don't own any gold. What's the easiest way to invest in it through a brokerage account in your opinion?  ", "score": 2, "replies": [{"body": "There is a company called Goldmoney.com - You can buy with them at spot price, they store it and then when you want to sell you can sell it back to them for spot price less 1% fee. The gold is physical and stored with a number of different third parties like Brinks and the Canadian Mint in your name. They have $2b stored for people and Shiff Gold (of Peter Shiff fame) is a subsidary that ships physical bars and coins if you want them. \n\nYou can also buy SPDR Gold Shares (NYSEARCA: GLD) which has $32B under storage, but thats an IOU. Goldmoney is for people who don't trust IOU's in a time when the fiat Ponsi scheme collapses (As they see it) under the weight of $22T in national debt causing Venezuela style inflation. ", "score": 0, "replies": [{"body": "Interesting... I kinda like the idea of having physical gold bars just cause I think it's cool... and also for the investment obviously.  There is no shortage of people willing to buy physical gold. I may look into that although it's probably a lot easier to just buy the fund... Thanks I def want a fund that has actual gold in your name rather than ETFs with shares of gold mines and things of that nature. \n", "score": 1, "replies": [{"body": "Problem with Bars and coins is that while there are plenty of people who buy them at spot there are not so many who will by them off you in particular. They want to go to a vendor with a reputation so you end up getting Spot less a good few percent. I like the idea too, but i also know i have Gold chains sitting in my drawer for the last 10 years, useless. It's not very liquid. \n\nYou can get a solid gold debit card though for about $2k at spot price i think which I really do like the idea of. Better than an amex platinum", "score": 1, "replies": []}]}]}]}]}]}
