{"title": "Ring, which Amazon just bought for $1 billion, was once rejected by ‘Shark Tank’", "selftext": "Sometimes a shark doesn’t know a good thing.\n\nRing, the video-doorbell company that Amazon.com Inc. AMZN, +0.38%   bought Tuesday for more than $1 billion, was rejected by a panel of investors on ABC’s “Shark Tank” in 2013.\n\nJamie Siminoff, the founder and chief executive of Ring — then called DoorBot — went on the show seeking investors for his nascent business. Pitching it as “caller ID for your door,” Siminoff was seeking $700,000 for a 10% stake in the company — a $7 million valuation.\n\nNo one bit, except for investor Kevin O’Leary, who offered a $700,000 loan, 10% of all sales until the loan was paid off, 7% royalties on all future sales and a 5% stake in the company.\n\nThose terms didn’t work for Siminoff, who walked away from the offer.\n\n“I remember after that ‘Shark Tank’ episode literally being in tears,” Siminoff told CNBC last year. “I needed the money, we were out of money at the time.”\n\nBut sales picked up after the show aired, and four years and a new name later, Ring had 1,300 employees, was sold in 16,000 stores and had a billion-dollar valuation.\n\nOne prominent investor did latch on early, however — Virgin Group billionaire Richard Branson, who participated in a $28 million funding round in 2015.\n\n“I couldn’t quite work out why the sharks turned him down, it just seemed to be a wonderful idea,” Branson later said during a guest appearance on “Shark Tank.”\n\nPublished by MarketWatch.com\nLink (Source):https://www.marketwatch.com/story/ring-which-amazon-just-bought-for-1-billion-was-once-rejected-by-shark-tank-2018-02-27\n\nNote: Great one Amazon! [Also happy for the founder of Ring]", "id": "80vkeb", "created_utc": 1519820010.0, "score": 511, "upvote_ratio": 0.96, "num_comments": 80, "comments": [{"body": "Sometimes all it takes is the publicity. Such a good story and I'm happy for them.", "score": 167, "replies": [{"body": "You bet there are companies who go on the show for publicity.", "score": 36, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "Mark Cuban called someone out on doing just that", "score": 23, "replies": [{"body": "Several times. He’s definitely willing to call people out if he feels they’re negotiating in bad faith. ", "score": 8, "replies": []}, {"body": "Every shark except Barbara has called people out for that. ", "score": 4, "replies": []}]}]}, {"body": "It would behoove ones self to do such a thing. ", "score": 3, "replies": []}, {"body": "Dumb question but do you have to pay to go on the show?", "score": 1, "replies": [{"body": "I think you either have to give up equity or a royalty in perpetuity to the show in order to get a spot on the show. (not totally sure but too lazy to Google)", "score": 0, "replies": [{"body": "This is not how it works at all...\n\nShark tank needs entrepreneurs, especially interesting ones, to keep the show running. It’s like any audition program. You have to pitch your business to show producers and they decide whether or not you are on the show. Investments, equity, and royalties are all discussed as “negotiations” during the show. Who would ever go on the show if they had to give up equity or a royalty before getting an investment? ", "score": 0, "replies": [{"body": "People would do it for the chance to appear on TV in front of millions of consumers. Anyways it looks like I was partially correct as it used to be a requirement in the past but Mark Cuban had it removed a few years ago. \nhttps://www.inc.com/will-yakowicz/mark-cuban-forces-shark-tank-to-remove-equity-clause.html", "score": 2, "replies": []}]}]}]}]}, {"body": "These doorbells are awesome, I can go unscrew one from the porch and resell it on eBay for $200 before even entering the house!!", "score": 19, "replies": [{"body": "If they are anything like Nest, they would be unusable if stolen.", "score": 3, "replies": [{"body": "I don't care if I'm selling that shit on Kijiji", "score": 2, "replies": []}]}]}, {"body": "I read somewhere (can't find-on mobile) that the sharks split something like 5% of every company pitched on the show if they don't invest. So the companies are theoretically paying for the publicity anyway", "score": 8, "replies": [{"body": "They stopped doing that after season 1 after Mark Cuban told them to remove the equity clause. The 5% was going to Finnmax which is the production company.. ", "score": 13, "replies": []}]}]}, {"body": "He's richer than all the Sharks except Mark Cuban. \n\nWhat an achievement", "score": 165, "replies": [{"body": "How do you know this? He doesn’t get $1b", "score": 6, "replies": []}, {"body": "He's less of douche than Mark Cuban\n\nI'd say that's an achievement but 99% population has already obtained that.", "score": 44, "replies": [{"body": "Lmao what do you have against Cuban?", "score": 34, "replies": [{"body": "I love Cuban but let's not pretend he's not an asshole more often than not.", "score": 23, "replies": [{"body": "He isn't a toxic asshole tho. Just kinda an asshole.", "score": 10, "replies": [{"body": "who said he was toxic? ", "score": 2, "replies": []}, {"body": "Have you read the recent SI report? He may not be the most toxic, but he had an employee who was dating and domestically abusing other employees, and when the dude was arrested he never read the police reports or fired him (until the SI story came out) - the guy just had to sign a contract saying  he wouldn't fraternize one-on-one with female coworkers", "score": 2, "replies": []}]}]}, {"body": "Cuban is a punk.", "score": 1, "replies": []}]}, {"body": "99% of the population would turn into douches too if they went from living on an apartment living room floor to becoming a billionaire ", "score": 13, "replies": []}]}]}, {"body": "I remember that show.. Kevin must be thinking how did he let this business slip...", "score": 33, "replies": [{"body": "It's dead to him!", "score": 28, "replies": [{"body": "Indeed, a wonderful investment opportunity passed by Mr. Wonderful ", "score": 2, "replies": []}]}]}, {"body": "They've passed up on a lot of good opportunities", "score": 27, "replies": []}, {"body": "Branson was a shark this season too. RIP an investment opportunity to flip $700k to $100M, shark or not that sucks", "score": 20, "replies": []}, {"body": "Own a ring, Great move.  Sharks missed out.", "score": 12, "replies": []}, {"body": "Doesnt the network take a certain percentage even if you dont make a deal? If so, how does that work in regards to Amazon purchasing it?", "score": 9, "replies": [{"body": "I believe they used to, but then stopped after the first few seasons due to pressure from Mark Cuban to end it because he thought it would prevent good companies from coming on the show. Not sure exactly when it ended though, so it is possible Shark Tank owned a piece. ", "score": 28, "replies": [{"body": "I'm glad that Mark Cuban did that.", "score": 16, "replies": []}, {"body": "Cuban also said that they reversed it for the earlier companies.", "score": 11, "replies": []}, {"body": "HEe gets so much hate but little love for when he does things right.", "score": 9, "replies": []}]}]}, {"body": "The sharks make it too personal and have their egos to protect. They pass on a lot of good business because of little things. ", "score": 9, "replies": [{"body": "Your comment took longer than 5 seconds to read, I’m out. ", "score": 21, "replies": [{"body": "You read other comments, for that reason I’m out. ", "score": 3, "replies": []}, {"body": "I had pancakes instead of waffles for breakfast this morning, and for that reason, I’m out ", "score": 1, "replies": []}]}]}, {"body": "But boy do they all go nuts and go on bidding wars over a 4th grader's jewelry business \"they started all by themselves\".", "score": 5, "replies": []}, {"body": "I love my Ring...I use the battery option and the thing is so efficient I only have to charge the battery every 8 weeks or so.  Congrats to all involved!", "score": 7, "replies": []}, {"body": "Amazon just bought Blink for $90M and they have \"Amazon's Cloud Cam\". I'm thinking they try to enter markets first and if unsuccessful, buy someone that is. Makes sense and will be interesting to watch their other ventures grocery, delivery (like FedEx). The RiteAid buyout, that heavy load logistics buyout was smart moves by their competitors. I wonder if Target is still in their sites?\n\nhttp://www.businessinsider.com/amazon-blink-camera-maker-acquisition-2018-2\n", "score": 5, "replies": [{"body": "I would think they would go for Kohl's before Target. There's a very good reason to have physical stores for primarily clothing and footwear: people like to try things on. Amazon already sells pretty much everything Target does, and they already have Whole Foods now for food. Plus, they already have an agreement with Kohl's where you can return Amazon products to their stores.", "score": 2, "replies": []}]}, {"body": "https://youtu.be/zcEDiOwv6Ro\n\nHere is Mr. Wonderfuls toughts on missing the deal.", "score": 4, "replies": []}, {"body": "Kinda remember watching it , guy was arrogant. Did not want make a deal. Many issues with pricing now I've seen it and some even filing lawsuits against Ring ..", "score": 2, "replies": [{"body": "Sounds like he knew what he had was special and didn’t give away his company for pennies.", "score": 3, "replies": []}]}, {"body": "[Here's the episode, if anyone's curious.](https://www.youtube.com/watch?v=YqQblsZgF8M)", "score": 2, "replies": []}, {"body": "Most of the sharks are looking for full business with good number not desperate people. They'll usually only invest if returns are guaranteed. Plus let's be honest DoorBot is a really dumb name.", "score": 5, "replies": []}, {"body": "I remember this episode, good for them. ", "score": 1, "replies": []}, {"body": "Shark is focused more on harassing ", "score": 1, "replies": []}, {"body": "If he had taken Kevin's 50 year royalty deal, he would've sold it for $2 billion!", "score": 1, "replies": []}, {"body": "So what happens to Ring stock now? Does it disappear and become Amazon?", "score": 1, "replies": []}, {"body": "Love the product and their service. Hopefully amazon doesn’t up the cost of service.", "score": 1, "replies": []}, {"body": "Looks at stock portfolio and sees AMZN listed:  grins.  ", "score": 1, "replies": []}, {"body": "Sharks lol-- more like sardines! Why do people keep listening to these overinflated egos' opinions on that TV show?", "score": -1, "replies": []}, {"body": "Just further evidence that investing is not easy and no one knows anything. ", "score": 0, "replies": []}, {"body": "Lol stupid broke ass sharks", "score": 0, "replies": []}, {"body": "Shark tank and the programming in general on cnbc is for fools.  Startups barely get their money even if they come to an agreement on the show.\n\nedit: [it is on cnbc](https://www.cnbc.com/shark-tank/)", "score": -13, "replies": [{"body": "It's not on CNBC... It's on ABC.", "score": 16, "replies": [{"body": "My mistake.  ABC is a much better source for financial news.\n\nedit: Shark tank is on cnbc on weeknights at 7pm according to the cnbc website, you reality tv aficionado.", "score": -11, "replies": [{"body": "New episodes run Sundays* on ABC. Reruns go to CNBC. ", "score": 8, "replies": [{"body": "Sundays at 7", "score": 1, "replies": []}, {"body": "You're right I guess that makes it not on cnbc", "score": -2, "replies": []}]}, {"body": "Oh weird. Both of them I guess.", "score": 3, "replies": []}, {"body": "Oh weird. You dropped your attitude; may want to pick that back up!", "score": 3, "replies": []}]}]}]}, {"body": "Not really stock related discussion. It's also not really worth 1B imo.", "score": -20, "replies": [{"body": "The technology is worth 1B to Amazon. Amazon has resources to put into more R&D to crank out home security products that will allow package deliveries to be secured to prevent porch theft.\n", "score": 5, "replies": [{"body": "Ah makes more sense than allow access to the house but what if thiefs just wear a mask?", "score": 2, "replies": [{"body": "Think outside the box (aka literally..like a secure box that can attach to your porch or outside your house and open via code/app). \n\nRing *Secure Safe* ^TM", "score": 2, "replies": []}, {"body": "They’ll probably just have it connect to Alexa cause there’s versions of Alexa that has a screen now", "score": 1, "replies": []}]}]}, {"body": "There has to be a larger play.  You are probably right about the $1B valuation, but I am excited to see what Amazon does with it.  \n\nEdit: I am just an idiot and saved it by accident ", "score": 6, "replies": [{"body": "Wonder how many customers they have. Is it that hard to build a similar product for 50m?", "score": 6, "replies": []}, {"body": "I wonder if the larger play is to get customers to allow access to their house for deliveries when they are away. ", "score": 5, "replies": []}, {"body": "They're going to integrate it with Alexa. It'll just be another step in the completely automatic/smart house.", "score": 2, "replies": []}, {"body": "I think it's going to be part of their Alexa/home automation play with a monthly sub. Security cameras are a big industry (adt) and millenials are all over Amazon and apps. This is just  another industry disruption with a prime or monthly sub potential and AWS expansion IMO. Think the Apple ecosystem... but for amzn.", "score": 1, "replies": []}]}, {"body": "Comment Deleted -- mass edited with redact.dev", "score": 3, "replies": []}]}]}
