{"title": "What are your long term plays for the rise of AI", "selftext": "[deleted]", "id": "lopzjp", "created_utc": 1613885498.0, "score": 62, "upvote_ratio": 0.91, "num_comments": 96, "comments": [{"body": "1000 of SKYNT and puts on HMNTY", "score": 165, "replies": [{"body": "Can we hedge humanity somewhat? Maybe a short squeeze 🤣", "score": 11, "replies": []}, {"body": "Lmao underrated comment", "score": 8, "replies": [{"body": "I’ll be back....", "score": 3, "replies": []}]}]}, {"body": "Just AITX thus far", "score": 26, "replies": [{"body": "Can you elaborate on this one? It seems they provide AI security services but I can’t find anything else.", "score": 5, "replies": []}, {"body": "Liking this one, thanks", "score": 2, "replies": []}]}, {"body": "Letting cathie handle it.", "score": 21, "replies": []}, {"body": "NVDA", "score": 10, "replies": [{"body": "Has to be NVDA . Those tensor cores available for consumers should be able to do so much more . DLSS is one of the first AI upscaling magic out there", "score": 3, "replies": []}]}, {"body": "Palantir is the AI play.", "score": 16, "replies": [{"body": "Is it really? I’ve read a lot of posts and articles about them and still have no clue what they do.", "score": 2, "replies": [{"body": "They develop software that allows for the presentation of massive amounts of data to humans is my understanding. This is an area that will become more important as things like A.I. and quantum computing arise. \n\nHelp dumb monkey understand huge amounts of data easily to make decisions.", "score": 2, "replies": []}, {"body": "Watch their demo video.", "score": 1, "replies": []}, {"body": "There are loads of articles on it just because Cathie Wood purchased some shares as part of ARK funds. It’s now a meme stock territory.", "score": 1, "replies": []}]}]}, {"body": "VUZI. It's kinda AI because it's augmented reality but they're going to be giants in AR", "score": 9, "replies": [{"body": "Paul Meade was just promoted to VP of Hardware innovation, looking after Smart Glasses at $AAPL.  I am not sure how c. $VUZI compete against $AAPL ? Just a thought,, apparently, $VUZI went through the roof and I like the company too. \n\nIf $APPL is ready to buy $VUZI, then, it’s different story. But, $APPL normally wants technology grown inside the house with patent for themselves while outsource manufacturing.", "score": 2, "replies": [{"body": "I think Apple will dominate the consumer part of future AR glasses. Potientially leaves the industrial market available for companies like Vuzix?", "score": 1, "replies": [{"body": "Very possible, TAM for consumers should be much bigger than commercial , I think.", "score": 1, "replies": []}]}]}]}, {"body": "AITX", "score": 5, "replies": []}, {"body": "ASML ASML ASML", "score": 7, "replies": [{"body": "Good company. But don't think this is AI", "score": 6, "replies": [{"body": "AI needs computer chips, it’s all tied together in one way or another.", "score": 1, "replies": []}]}, {"body": "Does anyone know why so many stocks like this are not supported on robinhood?", "score": -2, "replies": [{"body": "Cause Robin Hood is a horrible platform for trading.", "score": 3, "replies": []}]}, {"body": "holy shit that is expensive as fuck", "score": 1, "replies": [{"body": "They did 20 years of research into Extreme Ultraviolet Lithography and now hold a monopoly. Every time you read about TSMC or Samsung reaching smaller nodes with EUV it's because of ASMLs Scanners. They're booked out for the next 5 or so years already.\n\nThat's some of the reasons for the premium.", "score": 13, "replies": []}, {"body": "Wasn’t when I bought it. ASML controls 65-75% of the worlds microchip market and is one of the only companies that makes photo-lithography machines for making micro chips. This is the company that sells chip making machines to  intel, Samsung, Toshiba, etc.", "score": 5, "replies": [{"body": "KLAC holds a 70% market share death grip on their segment of the semiconductor process. They inspect just about everything ASML creates. That stock printed money the past few years.", "score": 2, "replies": [{"body": "Thanks for the insight!  I’ll have to look into them.", "score": 2, "replies": []}]}]}]}]}, {"body": "Tenstorro. Hopefully it’s goes public.", "score": 5, "replies": []}, {"body": "LRNZ\n\nAI and deep learning ETF", "score": 6, "replies": []}, {"body": "Is palantir ai?", "score": 8, "replies": [{"body": "Yes Palantir uses A.I.\n\nA.I. as we know it right now is just force feeding computers/computer programs incredibly large amounts of data (big data) via machine learning to the point where the machine (the computer/program) has seen and remembered such an extensive amount of “scenarios” in regards to whatever you’re teaching it that it can function and make decisions on its own. Because these are computers, they can also find and see patterns where humans can’t, or simply would never get to because of just how many different permutations exist between variables in even relatively simple systems i.e. data analytics which is what Palantir offers on the civilian side of things in regards to their supply chain management software.\n\nThe software is quite literally making random or previously unnoticed connections and relationships out of the thousands of variables that exist in a companies incredibly complex supply chain network. This is why it’s been mentioned that average Joe employees with access to Palantir’s software can in some ways become as valuable to a company as a hired PhD. Because before this software existed it would usually only be PhD’s/engineers discovering these connections that lead to efficiency improvements in a network but obviously at a much slower pace compared to an “A.I. Trained computer”. This software also makes it possible to track terrorists, serial killers, improve the efficiency of airlines by more efficiently allocating planes, pilots, cargo, etc. because it can keep track of far more variables, make random connections and relationships that would go unnoticed to the human eye, and alert a human to look into those connections/relationships. Serial killers have tons of patterns, it’s a key part of their very nature, but when local police departments only have small pieces of the puzzle they’ll never come close to solving the case because the case is occurring on a statewide, or maybe even national level.\n\nAs for the military side of things, you can train satellites to be able to recognize certain shapes or patterns from 120 miles up via machine learning and voila instead of having entire teams of people sifting through endless amounts of grainy photographs for missile silos, missing a lot of what they’re looking for, and taking a long time to do it, you have a program that spits it out instantaneously. \n\nFighting a war? Why not log and record every move your opponent makes, so much so that you begin to know them better than they know themselves. The computer watches and logs every move they make to the point where once they get enough data points they’re able to accurately predict with great success rates what their opponents next move is going to be maybe before they even know it themselves. We are creatures of habit after all, we just do a horrible job of noticing it. The same concepts would apply to fighter jets or drones without pilots. This technology will decide who is the dominant force in the world for the next century and that is why I believe in Palantir. Because if we are to beat the Chinese it will be because of companies like Palantir and men like Alexander Karp.", "score": 17, "replies": [{"body": "Your name horrifies me", "score": 13, "replies": [{"body": "It sounds rather exciting. Disclosure: 1000 shares of AOC long", "score": 5, "replies": []}]}, {"body": "120 miles is 193.12 km", "score": 5, "replies": [{"body": "Good bot", "score": 3, "replies": []}, {"body": "Well, now I’ve learned something today.", "score": 1, "replies": []}]}]}, {"body": "Well its a data analytics company. Data analytics does come under AI umbrella.", "score": 0, "replies": [{"body": "I disagree, data analysis is not really ai", "score": 2, "replies": [{"body": "If I'm not wrong, [c3.AI](https://c3.AI) is also a data analytics company, their ticker is literally AI. Assuming its arguable whether data analytics should be considered a part of AI or not, it still directly benefits from the advances in AI.", "score": 1, "replies": [{"body": ">Assuming its arguable whether data analytics should be considered a part of AI or not\n\nYou're phrasing this very poorly. AI and data analytics are two separate domains. AI can be used for data analytics, but there's many ways to analyze data that don't require AI, and there's many applications of AI beyond data analysis. It's become almost comical how many companies throw massive deep learning algorithms at problems that could likely be solved with some basic statistical analysis and some better data hygiene", "score": 7, "replies": []}, {"body": "I'm not disagreeing with you I like data analytics, but ai is something more like Google assistant or Boston dynamics something like that", "score": -3, "replies": [{"body": "No, AI is not just limited to that. Even an algorithm that only analysis images to detect objects is an AI. A much better example: the algorithm in google maps that uses historic data to try to predict traffic on roads is AI.", "score": 2, "replies": [{"body": "I disagree I think data analytics is a different category than ai, i think the distinction is important since ai like Google assistant or Boston dynamics is not being used widespread yet, while data analytics is fairly popular at the moment and very applicable already while ai is way more future.", "score": -2, "replies": [{"body": "There is no AI without data analytics", "score": 3, "replies": [{"body": "That's like saying there are no evs without fossil fuels, yea of course they need each other, but if you want to get in on ai going the data analytics route is not the right choice in my opinion", "score": 2, "replies": [{"body": "Deep learning data analysis is considered AI. Its because deep learning is a bunch of \"neurons\" connected to each other that simulates human brain functionality. Those neurons process the data.\n\nLook up deep learning on YouTube for more info", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "AI is currently an extremely broad field with many extremely deep sun fields. Data analysis can be AI depending how the data is analyzed and processed. In fact most AI requires a huge amount of data analysis.", "score": 1, "replies": [{"body": "I  categorize this as \"data processors\" as a software engineer and investor. Of course you can get into the differences between Splunk, Palantir, and Elastic but I find that categorizing by intent is helpful.", "score": 1, "replies": []}]}]}]}]}, {"body": "boston dynamics is kinda small but if they were to go big and public i would love them\n\ntheres probably a dozen companies in tokyo making fuck dolls that can talk and the other robots that can dance", "score": 3, "replies": [{"body": "Hyundai bought Boston dynamic", "score": 4, "replies": []}, {"body": "Boston dynamics has amazingly agile robots but I am not sure how well they have monetized their R&D. The army rejected their robots a few years back because they were too noisy back then. Plus they have at least one good competitor in the space they are in.", "score": 3, "replies": []}, {"body": "I want in on the fuckdoll train. That is one industry that will never fail", "score": 4, "replies": []}]}, {"body": "Chipmachine producers like ASML and ASMI. The data revolution is starting so a huge demand of chips is coming", "score": 3, "replies": []}, {"body": "BOTZ", "score": 3, "replies": []}, {"body": " I think BB may be one of the companies that develop AI technology and is associated with monsters of the technology industry such as Microsoft, Amazon, Bidu, etc. Its developments are mostly in AI and security software and its qnx system is applied to cars of the future", "score": 5, "replies": []}, {"body": "Don't forget Tesla.", "score": 6, "replies": []}, {"body": " Nice analysis! I am bulling too on $PLTR", "score": 2, "replies": []}, {"body": "TSM", "score": 2, "replies": []}, {"body": "Looking at AIEQ is the closest I come to investment in AI.", "score": 2, "replies": []}, {"body": "QUBT for the long term quantum computing pick. Its OTC but my buy and hold stock.", "score": 2, "replies": [{"body": "I’ve been eyeing this up also. I like it for the long term gains.", "score": 1, "replies": []}]}, {"body": "BABA", "score": 2, "replies": []}, {"body": "MARK - have received a lot of contracts due to covid", "score": 2, "replies": []}, {"body": "I'm investing heavily in water MREs and ammo", "score": 2, "replies": []}, {"body": "Stpk", "score": 4, "replies": [{"body": "This", "score": 0, "replies": []}]}, {"body": "PLTR and semiconductors makers (both AMD and NVDA) for the AI and computing play long term.", "score": 2, "replies": []}, {"body": "PLTR", "score": 3, "replies": []}, {"body": "Copper play. Tesla invested in Indonesia miners.", "score": 1, "replies": []}, {"body": "Building an underground city with the best defense we can afford and finding their One to fight them in their simulation.", "score": 1, "replies": []}, {"body": "IAMRBT and TRMNTR", "score": 1, "replies": []}, {"body": "IRBO", "score": 1, "replies": []}, {"body": "Do you consider RPA as being AI? If so, what are your thoughts around the potential IPO of UiPath?", "score": 1, "replies": []}, {"body": "Underground bunker with a faraday cage built into it.", "score": 1, "replies": []}, {"body": "My long term plan for the rise of AI is beans and rice along with some mountain property.", "score": 1, "replies": []}, {"body": "NEBC aka Rover provides an extremely good risk to reward scenario no matter if you’re a long term or short term investor.", "score": 1, "replies": []}, {"body": "I'm invested in $VERI, $PLTR and $TCEHY for AI exposure. I also came across the following that are in this space on the Canadian Venture exchange: $MTRX.V, $PAI.V/ $INOTF (OTC), $VQS.TO. For Quantum Computing you could go with $QUBT. You will find several companies that apply AI or use AI in their technology e.g. $LSPN, $AEYE.", "score": 1, "replies": []}, {"body": "ABB is my play. I'm not going to do a full DD yet, might soon, but here's their press releases: https://global.abb/group/en", "score": 1, "replies": []}, {"body": "PLTR", "score": 1, "replies": []}, {"body": "S&P500 - even boring companies are leveraging AI", "score": 1, "replies": []}, {"body": "Right now I’m following ticker AI. \n\nBut also the big cloud service providers are also considered an AI play because they are putting a lot of investment toward AI.  In particular they are building up patent portfolios and other intellectual property to block out other companies.  Watch the AI industry conferences for details on who is doing what.", "score": 1, "replies": []}, {"body": "Palantir and IBM", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "lp8vg3", "created_utc": 1613948107.0, "score": 457, "upvote_ratio": 0.95, "num_comments": 92, "comments": [{"body": "[deleted]", "score": 125, "replies": [{"body": "Stfu dont spoil my super secret strategy of buying the dip!", "score": 19, "replies": []}, {"body": "With flight numbers down, there's also plenty of stock to rotate around and still fly routes, service impacts will be minimal, but maybe they'll have to fly slightly less efficient planes.", "score": 27, "replies": []}, {"body": "When will the sell off end so that I can jump in?", "score": 2, "replies": [{"body": "It'll wait until you jump in to start", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You mean they shouldn't have moved headquarters to Chicago to spite the unions and then handed control over to the executives who don't know what the fuck they're doing?  Huh.  Well at least only 700 people have died so far.  It'll probably get much worse.", "score": 6, "replies": [{"body": "When Boeing was bought using McDonnell Douglas money, the management of MD is what took over.  Until all that MD smooth brain management is retired, moved on or dead, Boeing is going to suffer.", "score": 5, "replies": [{"body": "Sad.", "score": 3, "replies": []}]}]}, {"body": "You have done an excellent job at wasting my time.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "Delta has already announced retirement of the 777 and neither they nor American, Southwest (All 737) or any other non-United US carrier fly this airframe/engine combo.  This affects one engine choice with a specific (hollow) fanblade design.  Given the capacity available of grounded airplanes, it won't affect...anything in the long run.  Thus, if you're so inclined to buy Boeing, Raytheon, any of the airlines, hell even GE on any dip, any news on this particular incident is just noise to provide you an entry point.", "score": 28, "replies": [{"body": "This is absolutely spot on.  The airlines ran out of space to park planes in the desert during Covid.  If they need to increase capacity they can do it with existing equipment a lot faster than Boeing can produce planes.\n\nPratt & Whitney builds a lot of engines beyond this one.  They'll sort it out.  If you like the stock then by all means by the dip.  Pratt makes a significant amount of the military aircraft engines so they aren't likely going anywhere.", "score": 8, "replies": []}, {"body": "There is only 24 of these engines and plane combos all at united", "score": 1, "replies": []}]}, {"body": "Puts on BA, sell eod", "score": 14, "replies": [{"body": "A play so obvious and sensical, it’s bound to fail.", "score": 14, "replies": []}, {"body": "Raytheon owns Prath and Whitney so Rtx puts would be a better play than Ba. Hell even Ual puts. Ba might dip pre but I wouldn't expect much by eod.", "score": 3, "replies": []}]}, {"body": "buy RYCEY...", "score": 7, "replies": [{"body": "You think rycey is a good play, my problem is the crazy dilution they did", "score": 2, "replies": []}, {"body": "Said this the other day, got deleted", "score": 1, "replies": []}]}, {"body": "RYCEY calls.", "score": 28, "replies": [{"body": "Please I hope so. Bag holding 1000 shares @ £1.15.", "score": 17, "replies": []}, {"body": "Lol no such thing", "score": 7, "replies": [{"body": "I own 5000 shares and forgot you can't by calls. Sorry I'm retarded.", "score": 4, "replies": [{"body": "No worries, friend. We're ALL redarted down here. \n\nTake a load off. Have a few 🖍🖍🖍. We're saving the paste for DFV redemption, but that seems to be at hand.", "score": 2, "replies": []}]}]}]}, {"body": "Short boeing pre market?", "score": 25, "replies": [{"body": "Raytheon owns Pratt & Whitney", "score": 29, "replies": [{"body": "They’re positioned really well too...might drop shares $.20. Any more and it’ll be for a blink of an eye. I wouldn’t mind a $3.00 drop to buy some more, but I don’t see that happening with all they sell the military. This engine issue is gonna get traced back to a mechanic...watch", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "A fellow aviation guy! You got PW4000 stands? We should talk", "score": 8, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks I will. I actually own a stand company on the side you see", "score": 3, "replies": []}]}]}, {"body": "Every time I fly I accept death before stepping into the plane. No fear of flying that way, had a good life anyway.\n\nTo know that I might have flown on an aircraft that had used engines peddled by a wsbtard makes that attitude all the more appropriate.\n\nGood business is good business, hope you get those parts and help us get those affordable flights to sunny beaches", "score": 4, "replies": []}]}, {"body": "Sir, this is a casino", "score": 14, "replies": [{"body": "Shut the fuck up", "score": -15, "replies": [{"body": "What's wrong with reminding people where they are?  It's quite obvious plenty of people here forgot.", "score": 4, "replies": [{"body": "I thought I was somewhere else", "score": -5, "replies": [{"body": "Now go apologize to the nice man who helped you figure out where you really were.", "score": 7, "replies": [{"body": "I'm so sorry I hurt your fefes", "score": -11, "replies": []}]}, {"body": "I too forget where I am on weekend binge drinking reddit sessions.... should definitely have the sub your in at the top when you're commenting in case you forget...\n\n\nExample:\n\"Reply to comment.              Post\nWallstreetbets--\nZoopydoopboop •1hr\"", "score": 1, "replies": []}]}]}]}]}]}, {"body": "CHEAP PUTS EVERYONE!!!", "score": 12, "replies": []}, {"body": "Hoping to get more RTX under $70.", "score": 5, "replies": []}, {"body": "Negative articles are starting to appear over the weekend on the Boeing 777 due to engine problems. Puts on the menu baby.", "score": 10, "replies": [{"body": "I’m a 777 Captain...over 1000 made hands down one of the safest aircraft ever made.  The RollsRoyce, PW, or GE90’s are all awesome engines.  Nothing wrong with the jet...it’s been around 25 years+", "score": 29, "replies": [{"body": "This guy pilots. Zero chance there’s anything significant to come from this. The plane was successfully landed after an engine failure and shroud / housing disintegration - if anything, it’s a testament to how incredibly safe the plane is.", "score": 21, "replies": [{"body": "Lol that's what I told my family. literally an explosion occured on the wing and it landed unscathed minus the nacelle. \n\nAs someone who worked on this engine and many like it in manufacturing of the investment castings, these parts are checked and rechecked for defects at every process. In total, a single blade could be inspected for dimensional and material integrity over 10+ times. \n\nIn comparison, automotive is inspected in batches (ie one or several pieces every 10000+ or so), whereas engine components of a jet engine, every single piece is inspected and inspected multiple times.", "score": 8, "replies": [{"body": "In plastics if the part is not completely burned and cracking off to shipment they go...\n\nOfcourse once in a blue moon the quality inspector will dim the lights and squint her one remaining eye to see if the color of the product resembles somewhat what the customer ordered", "score": 1, "replies": [{"body": "Lmao sounds about right. Looks good, send it.", "score": 2, "replies": []}]}]}, {"body": "Yup. People on the ground were in more danger that people in the plane.\n\nOn top of that we know that particular plane was first flown in 1994. I don't know if/when engines were replaces or even if there was some maintenance prior to flight but I don't think this will be a big problem for PW or BA.", "score": 2, "replies": []}]}, {"body": "Name checks out", "score": 2, "replies": []}]}]}, {"body": "In my opinion the ba earnings report a few weeks ago was the top 5 worst earnings reports that I have ever read in 26 years....be very careful....a titanic drop in sales and losses of 16 a share... absolutely horrific", "score": 9, "replies": []}, {"body": "Hmmmmm, I wonder if UAL is gonna take a hit on this as well. Dem puts are a lot cheaper of a gamble.", "score": 3, "replies": []}, {"body": "The plane was 26 years old Jesus Christ, average life span of a commercial aircraft is 30 years", "score": 4, "replies": []}, {"body": "Does this mean buy rycey? (Boeing’s other engine provider)", "score": 7, "replies": [{"body": "Ummm...  Rolls produces a tiny fraction of engines used in Boeing airliners. GE would be the company if you want to make this play. Pratt & Whitney made the engine that failed.", "score": 11, "replies": [{"body": "0.o\n\n&#x200B;\n\nWhy you find out GE's shares only cost $11, while Chipotle, yes the fast casual TexMex place, share price is over $1,500.", "score": -14, "replies": [{"body": "entertain price fact insurance cause reply possessive automatic capable lock", "score": 21, "replies": [{"body": "But...I like money", "score": -10, "replies": [{"body": "you're supposed to look at market capital.  How much the company is valued at overall.  How much dividends return.  It's why GME isn't a $500 stock still.  Because they don't produce $500 x 66 million worth of value.", "score": 1, "replies": []}, {"body": "Easier to make and keep when you use your brain for more than keeping your ears warm.", "score": 1, "replies": []}]}]}, {"body": "How many shares exist changes the price my dude. Always look at market cap if you want to see the current valuation of a company.", "score": 2, "replies": []}, {"body": "Maybe GE should make Burritos (something everybody needs, & often)  instead Jet Engines (something people rarely need, and don't use often) to get that share price up.  \n\nHave you thought of applying for a CEO type job?", "score": 0, "replies": []}]}]}]}, {"body": "   hopefully it is limited to the  777s...  [767s 300s also have the  PW4000](https://en.wikipedia.org/wiki/Boeing_767).", "score": 2, "replies": [{"body": "Well, Japan has ordered all planes with PW4000 series engines grounded, that also includes few Airbus models.", "score": 2, "replies": []}]}, {"body": "BREAKING: Japan’s aviation regulator has ordered Japan Airlines and All Nippon Airways to cease flying 777s with Pratt &amp; Whitney PW4000s, the same type involved in \\#UAL328 on Saturday, according to an advisory on its website and confirmed by an industry source. \n\n***\n\nposted by [@jonostrower](https://twitter.com/jonostrower)\n\nPhotos in tweet |  [Photo 1](http://pbs.twimg.com/media/EuyPAgSUUAIBiwa.jpg) \n\n^[(Github)](https://github.com/username) ^| ^[(What's new)](https://github.com/username)", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "But how many planes is it total?", "score": 1, "replies": [{"body": "32 \n\n[https://asia.nikkei.com/Business/Transportation/Japan-grounds-32-JAL-and-ANA-jets-after-Boeing-engine-fire](https://asia.nikkei.com/Business/Transportation/Japan-grounds-32-JAL-and-ANA-jets-after-Boeing-engine-fire)", "score": 1, "replies": []}, {"body": "Overall max total I believe would be 86, assuming all 30 Korean 777-200ER/300 use the PW4000 and are actually flying right now.", "score": 1, "replies": []}]}]}, {"body": "Priced in.", "score": 0, "replies": [{"body": "How is something that happened Sunday already priced in?", "score": 8, "replies": [{"body": "Those that do the pricing are just that good.\n\nBut in reality, Boeing is already in a slump, and it was Saturday news.  Any early morning selloff will be gone by the afternoon.  Affected airlines might take a little more of a beating, but I wouldn't expect much play there either.", "score": 2, "replies": []}]}]}, {"body": "It blows my mind Boeing is allowed to make planes lol.", "score": -10, "replies": [{"body": "Ah yes, a single engine (made by Pratt and Whitney) failure where the plane landed safely under control with ease is the fault of the airframe manufacturer.", "score": 6, "replies": [{"body": "I'm happy you agree with me. I don't know why everyone is downvoting my comment.", "score": -8, "replies": [{"body": "Maybe I was missing the /s.", "score": 1, "replies": []}]}]}, {"body": "why", "score": 1, "replies": [{"body": "shitty American made planes.", "score": -10, "replies": [{"body": "The 777 (a shitty plane according to you even tho it has one of the best records) was able to land safely even after Pratt and Whitney engines exploded. Sign of good engineering,", "score": 4, "replies": [{"body": "Is that why American made planes fall out of the sky, due to good engineering?\n\n[https://en.wikipedia.org/wiki/List\\_of\\_accidents\\_and\\_incidents\\_involving\\_the\\_Boeing\\_737](https://en.wikipedia.org/wiki/List_of_accidents_and_incidents_involving_the_Boeing_737)\n\n[https://en.wikipedia.org/wiki/Boeing\\_737\\_MAX\\_groundings](https://en.wikipedia.org/wiki/Boeing_737_MAX_groundings)", "score": 0, "replies": [{"body": "This European plane also fell out of sky due to good engineering\nhttps://en.wikipedia.org/wiki/Qantas_Flight_72\nHeres some more european plane accidents\nhttps://en.wikipedia.org/wiki/List_of_accidents_and_incidents_involving_the_Airbus_A320_family\nPlus like I said before, Thank Boeing for building plane good enough to land safely after engine explosion.", "score": 3, "replies": [{"body": "Careful. That logical thinking may get you in trouble.", "score": 4, "replies": []}]}, {"body": "You're  comparing the 737- a plane which, at any single given moment pre-COVID,  had at least 1,000 planes in the sky all across the world- to the 777.  The 777 has one of the best safety records of any airliner in use today,  one of the best off all time in terms of its production numbers, and is  commonly lauded for its incredible reputation.\n\nThe 737 is one of the most highly produced passenger planes ever, so forget even saying \"at this moment\". Even with the ***TWO***  very unfortunate crashes of the MAX (which also holds blame on the  airlines for not properly training their 737 pilots coming from the  legacy 737s built over 40 years ago and then assuming this new version  would be the same, despite the glass cockpit and lack of steam gauges),  the 737 has a remarkable track record for reliability and safety. Only a  genuine moron would actually think to equate the two on any level. But  by all means, please feel free to skip all flights you're on which are  flown with a Boeing. Not only will you not be able to get anywhere, but  there's one less asshole to deal with at the airport and on the plane.\n\n1", "score": 2, "replies": [{"body": "IF YOU'RE GOING TO FILIBUSTER, YOU SHOULD RUN FOR SENATE!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "Hang in there.", "score": 1, "replies": [{"body": "I am not a cat.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "IF YOU'RE GOING TO FILIBUSTER, YOU SHOULD RUN FOR SENATE!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "I see good short play on BA down back to 200.", "score": -4, "replies": []}, {"body": "Sell sell", "score": 1, "replies": []}, {"body": "Puts that shit early am trading", "score": 1, "replies": []}, {"body": "Glad I sold my position in BA weeks ago, though this might be a good opportunity to buy back in on the cheap.", "score": 1, "replies": []}, {"body": "Lol Pratt & Whitney's Instagram handle is dependable engines https://www.instagram.com/dependableengines", "score": 1, "replies": []}, {"body": "Imma buy the dip on GE and BA. When do you think the sell off will end?", "score": 1, "replies": []}, {"body": "No wonder GE is going up this morning. An uncontained engine failure is no joke. From the pictures it looked like a possible fan blade failure, but who knows. I used to work for GE's aviation division until COVID hit (still have shares, because why not?). Everyone in P&W's engine group is sweating bullets right now for sure. They likely were all working late into the night to find every last scrap of documentation on that engine. You have 24 hours from the FAA requesting records after an incident to provide it. So that's probably about now. Should be an interesting investigation to follow.", "score": 1, "replies": []}, {"body": "Good news for RYCEY. Lol maybe they can sell some engines!", "score": 1, "replies": []}]}
