{"title": "Please don't downvote this. I feel that people really need to read & understand this for the future. TL;DR $GME was up over 5,000% and while everyone was waiting for the moon, you all ignored the fact that it was all the way to Mars.", "selftext": "[deleted]", "id": "ld6i76", "created_utc": 1612529524.0, "score": 151, "upvote_ratio": 0.62, "num_comments": 93, "comments": [{"body": "Because many of them jumped on at $200-$400 and wanted to see their money increase 10x like the early investors", "score": 72, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It certainly didn’t help.", "score": 2, "replies": []}]}]}, {"body": "10000% from last year low so yeah", "score": 29, "replies": []}, {"body": "Well if they didn't block the trades im pretty sure it would've hit atleast 1000$, but when they blocked the trades the rocket exploded", "score": 114, "replies": [{"body": "Lot of paperhanded astronauts perished in the explosion. Diamond hands astronauts getting ready to board Space X for the next launch.", "score": 23, "replies": [{"body": "My paper hands sold two days ago and now could buy 4 times the amount I had if I want to buy back in. There is nothing wrong with selling and getting back in at a better position. This hold no matter what shit is just stupid.", "score": 13, "replies": [{"body": "I agree with that.  I bought more yesterday as well. Those who sold at a loss and just stepped away may end up regretting it though.", "score": 2, "replies": [{"body": "I doubt it", "score": 3, "replies": []}]}]}, {"body": "Those you call paperhands are the smart ones who played you and made you think you were all in it together and sold at the peak", "score": 19, "replies": [{"body": "Personally I'm fine sitting at an average of $62.90. If they got out I hope they did it at the top and not at a loss.  If I did get out at the top though I'd definitely be buying back in for the mission to mars now that the test launch is over.", "score": 6, "replies": [{"body": "Idk if you’re serious, but it’s over man, look around you, look at ANY other sub discussing WSB/GME, this sub is Seen as a cult filled with people in denial", "score": -8, "replies": [{"body": "I do not think it's over at all. And if it is my loss will be far less than reward for 👐💎.", "score": -1, "replies": [{"body": "But if you leave this echo chamber of misinformation and denial for 15 minutes and do your research anywhere else, you’ll realize you’re screwed", "score": 6, "replies": [{"body": "sort cagey afterthought bright trees fall dinosaurs practice intelligent lavish", "score": -1, "replies": [{"body": "Buddy the only migraine Wall Street felt from this was the aching hangover from a weekend bender after making $700mill on GME shorts. This didn’t touch Wall Street.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "The problem with GME and why so many people are in red right now is because the following happened, in order:\n\n1. The stock had the momentum to hit $1,000/share\n2. The momentum was killed by brokers restricting buys of GME on Thursday last week\n3. Hypebois were still convinced that it would reach $1,000/share even though the momentum had been killed, they didn't adjust their position or adapt to the situation that had changed.\n\nTwo lessons to learn:\n\nYou were all right about GME, and got fucked by the brokers.\n\nand\n\nBe ready to pull the plug and sell at any time if the situation changes. $1,000/share wasn't guaranteed, nothing is in the markets, so just have sensible risk tolerances.\n\nBonus lessons: Don't trade with money you can't afford to lose, and don't jump into a volatile rally halfway through.", "score": 17, "replies": [{"body": "I think your post is spot on. In retrospect should of sold the second the rules went to hell. Life is easy in retrospect though. To be fair, I don’t think it’s ever happened like that in history so I for one was thinking surely the SEC is going to put a halt to this and we could continue the upswing. Wow, very wrong. Luckily I mostly got out even but did miss a lot of potential gains. Lesson learnt.", "score": 10, "replies": [{"body": "Thats the right attitude. It is a lesson learned. Use it next time and you'll make more money.\n\nEveryone in the markets still has something to learn, it doesn't matter if you've been trading for 3 decades or 3 days, there's always something new around the corner.\n\nI got out with some decent gains this time, but still learnt some important lessons, could have made more but happy with the choices I made.", "score": 3, "replies": []}]}]}, {"body": "I was arguing with a guy in a comment thread about the exact thing. I don’t get the logic to encourage everyone to buy more to push the price up and pretend everyone’s going to make money from short sellers. There is always going to be someone from here who bought at the peak who will lose a lot of money, whatever becomes the peak. It’s a matter of who got lucky with the timing.", "score": 7, "replies": []}, {"body": "Why settle for the Moon when they think this shit is going to Andromeda?", "score": 42, "replies": []}, {"body": "\"Have an exit strategy\" that's heresy speaking 🤣", "score": 23, "replies": [{"body": "omg, what's an exit strategy? 🙄🙄", "score": 15, "replies": [{"body": "Uh we can leave?", "score": 10, "replies": [{"body": "My wife says I’m not allowed to leave", "score": 5, "replies": []}]}]}]}, {"body": "But apes strong together. 1bil to 500bil to 1bil. This is the one true way of WSB", "score": 14, "replies": [{"body": "It’s never been the way of wsb", "score": 1, "replies": []}]}, {"body": " if the shorts keep doubling down, average up and drove the price down, then the squeeze has not been squoze", "score": 10, "replies": []}, {"body": "very well said, and accurate. I'm amazed at the juvenile party atmosphere here from people who don't have a single clue about financial markets. huge tuitions are being paid here, but I'm not sure most will get the lessons from their education.", "score": 14, "replies": [{"body": "This post is not accurate. It was never about a PT until SI started decreasing. \n\nAll was going well, and then one day it wasn't, after markets closed.  On Monday, staying in became more about if you trusted S3 and how much faith you had in market momentum. Fuck these bitch ass hindsight 20/20 posts tbh", "score": 1, "replies": []}]}, {"body": "Sounds like shill talk to me\n\n\n/s", "score": 5, "replies": []}, {"body": "[deleted]", "score": 18, "replies": [{"body": "I mean a 5000% increase IS a short squeeze. The fuck were you expecting? 5000000%?", "score": 15, "replies": [{"body": "The amount of increase isnt what indicates a short squeeze. What makes it a short squeeze is whether they covered their shorts during that time. And alot ot ths remaining data indicates they didnt cover it all. They made progress but a short squeeze is still very possible. The first spike was a gamma squeeze bolstered by multi media hopping on the hype train", "score": 1, "replies": [{"body": "This. I don't get why it's so hard for people to understand this. Then they go and make these bullshit self-righteous posts like this one. It was about watching SI as best we could, and shit got fucked up. For the people playing the technical side, this became very very difficult if not impossible.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I guess the undereducated make money while the educated run Gofundme campaigns to cover their GME losses", "score": 2, "replies": []}]}]}, {"body": "Yeah, for all the bear posts and comments lately, I have yet to see a single one actually address HOW the shorts could've possibly covered their positions since Thursday's fiasco. Somehow we're expected to believe that the shorts covered \\~70% of their positions in less than a week, half of which were low volume days, *while* the price was in free fall? Does no one understand that shorts covering en masse means that price would go up, not down? Nothing but baseless FUD with no reasonable evidence cited as support.", "score": 2, "replies": []}]}, {"body": "you must be new here.", "score": 7, "replies": []}, {"body": "Carebear post, please remove", "score": 7, "replies": []}, {"body": "Even though you said please, I still had to downvote it", "score": 4, "replies": []}, {"body": "dude; it's not a company in dying industry, hence why it is restructuring.  The only true thing you posted was that it has already squeezed.", "score": 6, "replies": [{"body": "They've tried to diversify for years. They adopted a store credit card through Comenity, opened up mobile trades so they could ship them overseas for a profit, brought in merch sales and eventually bought Thinkgeek, struck a deal with Microsoft for a portion of Xbox digital sales made in GameStop stores, and even started doing mobile phone service activation.\n\nThey haven't done a bad job at branching out to make up for the decrease in sales they've been experiencing as a result of the increase in digital game sales, but they've completely gutted the morale of their team members incessantly for years, basically neutered their rewards programs, and pissed away any good will they've garnered with the general public.\n\nThat doesn't mean they can't re-establish a niche in the retail market, but if they continue on the course they've been on, they're definitely tying their wagon to a dying market.\n\nAs someone who used to run a store for them, I'd love to see them turn things around, especially if they fix their relationship with their store employees and stop treating them as expendable, but they haven't done anything in my opinion that earns that trust.", "score": 6, "replies": []}]}, {"body": "You obviously don't understand the short game. What's obvious is that it wasn't expected for the hedge funds to manipulate it the market the way that they have. That's the true lesson here and knowing the sec can get bought off...and knowing the wsb sub we love can get bought off. Essentially that everyone can get bought off. Its just good business....", "score": 5, "replies": [{"body": "yea. i should’ve pulled as soon as the rules changed mid game. good lesson though.", "score": 11, "replies": []}, {"body": "Let’s say none of that happened and it kept mooning, what’s the exit strategy?", "score": 0, "replies": [{"body": "That is up to each individual to decide. I'm not here to give financial advice so fuck you for bating me. My exit strategy, is not to exit when the fucking hedgies are still purposefully driving the price of the stock down. Use common sense man...", "score": 0, "replies": [{"body": "I’m not asking advice for me asshole. I’m asking what’s your exit strategy in this awesome plan you have where everything goes fine to Mars.", "score": 1, "replies": [{"body": "I'm an asshole shitting all over you. There is no fine plan you turd. Never said there was, if you had one brain cell you'd under stand what shorting a stock is with literally the tsunami of information that's been spread in the past few days.", "score": 0, "replies": [{"body": "The problem with your stubborn ass plan is that there’s always going to be someone who bought at the peak following your rhetoric who will lose. No matter how fair hedge funds play. These threads will project it to go 5000 if it hits 1000. And those who lost timing it bad are going to whine how rigged the market is. The hedge funds may have disrupted your mooning, but no matter how big it moons there were going to be bag holders.", "score": 1, "replies": [{"body": "What plan are you talking about you crazy nut sack? Fuck atta here...", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Nice try hedge funds", "score": 3, "replies": []}, {"body": "We talked about exit strategy multiple times smooth brain. Check the history.", "score": 1, "replies": [{"body": "Oh I'm sorry, which GME 1000 meme was that?", "score": 5, "replies": [{"body": "If you only read memes that’s on you. Exit strategies were posted many times. You’re not some genius for coming up with the idea after it’s over.", "score": 1, "replies": [{"body": "lol if only my comments weren't buried under downvotes. Maybe someone would have seen them. Echo chambers gonna echo chamber.", "score": 2, "replies": [{"body": "Lmaoo buried under down votes 😅 stop acting so tragic", "score": 0, "replies": []}]}]}]}]}, {"body": "Mars? We only settle for andromeda galaxy", "score": 1, "replies": [{"body": "Ah. Messier 31. When you look at it through a telescope your brain damn near melts with how small you are.", "score": 1, "replies": [{"body": "We are just a pale blue dot", "score": 2, "replies": []}]}]}, {"body": "Mania/Euphoria", "score": 1, "replies": []}, {"body": "But I love the stock!", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Lmao y’all are delusional. \n\nVW started from a higher base and had an institution putting the screws to a hedge. \n\nAdjusted for percent and not raw price the GME squeeze was massive by comparison. Y’all just missed the orbital exit window and came crashing back through the atmosphere.", "score": 5, "replies": []}]}, {"body": "You had me until \"dying future\"", "score": -2, "replies": []}, {"body": "[deleted]", "score": -14, "replies": [{"body": "Irony", "score": 5, "replies": []}]}, {"body": "Retards don’t need no stinking logic.    Moon.", "score": -4, "replies": []}, {"body": "The moon was relative to SI. Look what Pharma Bro did with KBIO. You are feeling yourself with this post, but you actually aren't thinking about it the right way.", "score": 1, "replies": []}, {"body": "Got in at 39 left at 339, not an ounce of regret. Never understood that mentality", "score": 1, "replies": []}]}
