{"title": "Why I think $NIO will be on the moon. Due Diligence", "selftext": "**Summary**\n\n*NIO* is a chinese electric vehicle company founded in Nov 2014 had its 1.8 Billion dollar IPO in the U.S. on September 12, 2018. NIO is traded as an ADR (american depository receipt), which is a negotiable security representing an investment in a foreign company, has only been around for 7 years, starting at $9 during its IPO and rising to $56.67 as of 2/5/2021.\n\nIt is currently the **fifth largest car company by market cap** under Tesla and Toyota, beating the likes of GM, BMW and Daimler. This is incredible considering they have only been trading in the US for 3 years, and the troubles they have gone through since then.\n\nPros:\n\n* Low short interest, per yahoo finance.\n* Incredibly quarterly sales growth, since having a down quarter in Mar 2020 (Q1). Since then, they have increased 166% and 24.69% QoQ from Q2 to Q3 2020.\n* Strong Dec 2020 sales, and deliveries of EV cars increasing 121% YoY.\n* Beating analyst estimates in Q3 2020 showing a positive turnaround and forward outlook for the company.\n* Unique approach to batteries, all their products use the same battery type and have invested into BaaS.\n* New records high quarterly deliveries in 2020 Q3, representing 100% You growth.\n* Launch of the 100kWh battery pack, and a focus on providing users with a a choice of purchasing the pack or renting one for a monthly fee.\n* Back to back positive cash flow, with vehicle margins increased to 14.5%.\n* Battery swap stations are faster than charging stations.\n* Delivered 12k ES8/ES6/ES6s/Ec6s in Q3 2020, with 16-17k more expected in Q4 2020.\n\nCons:\n\n* \\-12.1% gross margin in 2019 Q3, rising to 12.9% in 2020 Q3.\n* 10/6/2 Buy/Sell/Hold ratings and overweight consensus, per WSJ.\n* EPS has been decreasing, while net income was flat for Q3 2020.\n* State owned rivals such as Li, Xpeng, and Tesla could pose serious risks.\n* They needed a US $1 billion bailout in 2020 because they couldn’t sell their vehicles and even missed payroll in Feb 2020, almost going bankrupt.\n* High capital investment industry, with low room for error.\n* Overvalued, as investors chase the ‘next Tesla’.\n\nConclusion\n\nNio is currently being described as the ‘next Tesla’, though it is 1/10 of Tesla’s market cap. Though Tesla is considered as over-valued by analysts, I believe that Nio has not been profitable long enough to match the level of enthusiasm that investors feel for Tesla. [Nio has had a rocky start, and a recent dip (as of 2/5/2021) as some investors have chosen to cash in on their investments. ](https://investorplace.com/2021/01/december-figures-keep-both-sides-nio-stock-case/)\n\nTake a look at the vehicle margins in Q3 2020 (14.5%) which is a huge turn around from almost going bankrupt in 2020, and not being able to pay for payroll in Feb 2020. They have had an incredible gain in gross profit as well, seeing positive growth from the cash injection they had in 2020. They are also projecting higher estimates for 2020 Q4 (expected in Mar 9, 2021) for vehicle deliveries, while providing unique services that decouple the user from having to go to a charge station.\n\nTesla had toyed with the idea of swappable battery packs as well, but have never actually deployed them as they re-invested in their supercharger network. Nio has already established a network of swappable battery stations in China, and is actually able to lower the prices of its EV lineup by offering customers the option of renting a battery pack via a subscription model.\n\nThis is a turning point, and a make or break moment for Nio. Today I heard they announced the intention to sell vehicles in the U.S. I think they could be huge if they can continue to deliver on vehicles, and I am extremely bullish on it.\n\n**Supporting Data and References**\n\n[**Nio 2020 Q1 Report**](https://ir.nio.com/static-files/af7a4884-5a0d-4e38-ae37-69a0170bffd5)\n\n[**Nio 2020 Q2 Report**](https://ir.nio.com/static-files/39d3112f-3cb4-4ed5-aade-b040b368719a)\n\n[**Nio Financials Snapshot** ](https://www.wsj.com/market-data/quotes/NIO/financials/annual/income-statement)**(WSJ)**\n\nEdit 1: Formatting\n\n**References**\n\n1. [https://fortune.com/2020/11/13/nio-electric-vehicle-china-stock-shares-value-gm/](https://fortune.com/2020/11/13/nio-electric-vehicle-china-stock-shares-value-gm/)\n2. [https://companiesmarketcap.com/automakers/largest-automakers-by-market-cap/](https://companiesmarketcap.com/automakers/largest-automakers-by-market-cap/)\n3. [https://www.wsj.com/market-data/quotes/NIO](https://www.wsj.com/market-data/quotes/NIO)\n4. [https://ir.nio.com/financials/quarterly-results](https://ir.nio.com/financials/quarterly-results)", "id": "lgeejm", "created_utc": 1612907325.0, "score": 181, "upvote_ratio": 0.87, "num_comments": 92, "comments": [{"body": "I don’t think they should be going near the US yet, they can’t even meet the demand in china. \nAnother thing to add to the pros is the extreme support from the Chinese government and their goal to make all cars electric// their willingness to allow self driving cars. \nNice DD", "score": 123, "replies": [{"body": "They’ve already started looking for employees in the US", "score": 23, "replies": [{"body": "Incorrect, they started looking for talent to help develop expansion plan, not for executing operations. The first doesn't translate to second.", "score": 18, "replies": [{"body": "Correct, they are. *", "score": 5, "replies": []}, {"body": "They’ve started buying factories in the US, they haven’t shared it publicly but a big factory in CA was just bought by them. \n\nThey’re looking for workers and promising better wages than Tesla. I think they’re going to be very legit, lots of people in CA talk about them and being the #1 competitor to Tesla rn.", "score": 3, "replies": [{"body": "Where did you find about the factory?", "score": 2, "replies": []}]}]}, {"body": "that doesn't mean they're going to start today....... a business strategy and plan for entering the US could easily take a year to develop and refine. Even more than that if the EV landscape changes as new tech is always being developed", "score": 2, "replies": []}]}, {"body": "Can you imagine what would happen if NIO decided to build/set-up a U.S. NIO EV plant/factory to satisfy the U.S., as well as Central and South America customers. \n\nThis is not unfeasible; for instance, NIO has approximately $6.5 billion dollars in its war-chest; building a plant in the U.S. will bring a huge amount of publicity and applause, since they'll be creating 'jobs' in the U.S., as well as satisfying their global expansion plans. \n\nNIO is just getting started; their long term investors will be very happy indeed!", "score": 18, "replies": [{"body": "If they create an actual truck, it could be pretty amazing way to target US market. They already have the power trains, interior designs and manufacturing etc. designed, its matter of expansion.", "score": 5, "replies": []}, {"body": "As much as I would like to see Nio in the US, I imagine that federal safety standards would be too big or too expensive an obstacle for them to enter the US market.", "score": 3, "replies": [{"body": "They are looking for workers for a new CA plant by my house LOL paying better than Tesla too", "score": 3, "replies": [{"body": "Unlikely they're actually producing anything in the States though. It's probably just R&D talent, which is consistent with the broader trend of Chinese firms opening up locations in US tech hubs.", "score": 2, "replies": []}]}]}]}, {"body": "I have NIO since it was $5...but I would like to share my half penny.\nMy Chinese colleagues told me that the average/rich person buys mercedes or bmw and talking about ev...guess what, Tesla.\nEveryone wants to be different, I guess, so unless the Chinese government is ‘forcing’ people...or they clone Tesla chips, it will be a long run for NIO before catching up :)", "score": 11, "replies": [{"body": "That's like saying samsung can't be successful as a company because everybody wants an apple.... like what????", "score": 13, "replies": [{"body": "Almost everyone can buy a phone, so it is just a preference, and I understood that is more a status symbol", "score": 2, "replies": []}]}, {"body": "Ye the problem is, once again demand. Not everyone can have a tesla. China has a pretty damn bug population so there’s definitely enough room for both", "score": 7, "replies": []}]}, {"body": "Would NIO's battery swap model work well in America?", "score": 3, "replies": [{"body": "It would in congested cities; it probably wouldn't be necessary in less congested areas.\n\nRemember u/soulstonedomg that battery swapping is only ONE way to charge a NIO EV; they also have super charging; home charging; mobile charging, and swapping too. \n\nThink of swapping as an EXTRA feature that NIO has; too many people think NIO ONLY offers swapping, when in reality they have all the other types of charging PLUS swapping, too.", "score": 4, "replies": [{"body": "Was reading about there battery swapping and newer to old backwards compatibility as well. The solid state battery has potential especially with the 150kwh one in development still.\n\nThey have potential with there plans, especially with power swap 2.0.", "score": 1, "replies": [{"body": "Thats probably one of the biggest draws of owning a NIO- you don't worry about battery depreciation or wear and tear damage. Plus NIO will upgrade your battery to the latest one available for free i think", "score": 2, "replies": []}]}]}]}, {"body": "Thanks man, great point. It's definitely a big IF and they are having trouble with chinese demand alone.. but I'm also thinking about how quickly things can ramp especially considering how fast Tesla rose. \n\nMaybe its apples to oranges, however, I LIKE DA STOCK", "score": 4, "replies": [{"body": "not sure how you can compare tesla and nio..tesla has been around for a min..nio is still a baby and will grow tremendously over the years..xpeng/li don't have what nio has which is prestige ..I personally think chinese nationalism will make nio succeed in the biggest EV market", "score": 5, "replies": []}, {"body": "[removed]", "score": 5, "replies": [{"body": "I like apple juice, and I like orange juice. I like orange juice more. Comparison made. DD complete.", "score": 2, "replies": []}]}, {"body": "I certainly like it too", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 82, "replies": [{"body": "Among the 25% people who owns a car have really cheap cars(mostly around 8k-15k USD). They would rather than buy something cheap than something expensive", "score": 19, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "It’s super hard for NIO to drop their price. The CEO has too much “integrity” that he thinks dropping price will hurt the people who bought their cars earlier. With all these global expansion, do you think he really knows how to run a company? The only reason I still buy NIO and stay bullish is that the government basically forces the Chinese to buy EV cars and give these companies infinite money to burn.  Plus they aren’t selling enough cars to give them the room to drop the price lower.", "score": 9, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "They can for sure. But don’t forget the major players just started to get in the games now. They can scale up super quickly and produce cheap quality Evs", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes and no. It's not a lottery system in some cities like Shanghai. It's more of a bidding system. The price of an ICE vehicle plate is around $12K+ usd and in some cities like Beijing they limit who can drive on the road by the last number on your plate. Many people own an odd number plate and even number plate. Nowadays, if you purchase a hybrid or electric vehicle you can basically drive any day any time. Also you need to understand that the traffic situation in China's major cities are very reliant on elevated highways. There are regulations where if your plate is out of city/state you can't get on the elevated highways during rush hours or even get on at all in some cities like Shanghai but EV vehicles can easily get an in-state plate and people are rushing for them. Also consider that Tesla is really dropping their M3 prices in Shanghai. The market is super competitive.", "score": 3, "replies": []}]}, {"body": "Hasn't it already reached the moon this year?\n\n\nIt's already at market cap of 90 billion plus, not sure how much high it can go", "score": 30, "replies": [{"body": "Exactly", "score": 5, "replies": []}]}, {"body": "What is important to remember is that the US market is relatively small compared to the ROW. It's easy to forget that because the US does have just about the deepest capital markets. From a sheer numbers perspective, the US has something like 4ish % of the global population but about15% of GDP. The per capital GDP may be high but the ROW aggregate GDP is way, way higher - and that is what buys all those cars.", "score": 9, "replies": []}, {"body": "I read Chinese websites I think this company may not do well.\n\n1. Thier sales are very low. Almost all online review are paid advertising without real users.\n\n2. Chinese car bands never able to success, people still prefer foreign cars especially for those who can afford higher price.\n\n3. Most EV cars band in china had huge batteries problem, all ended terrible. \n\nI feel like the current price already high than what it should be... But of course if people keep throwing money it can still go up. It is a stock on my put list if the market start going down....", "score": 12, "replies": [{"body": "Whoa don't say that here.  NIO is a trendy stock and the herd ere on reddit will be upset at you.", "score": 6, "replies": []}]}, {"body": "yeah, a 1 year old account that became “suddenly active” in the last 15 days, and post exclusively on stock trading subs, that’s gonna be no from me dawg on whatever you have to say", "score": 40, "replies": [{"body": "haha okay. you got me bro, I'm a lurker pretending to be an elitist 3 yr old account who filters his world views based on the age of a reddit account. \n\nThat being said, if you have actual feedback lmk I want to what I might have missed.", "score": 26, "replies": []}, {"body": "Lol glad I didn’t have to write it out", "score": 10, "replies": []}, {"body": "I bought the stock last year for about $3.70 a share. I'm a firm believer it will continue to go up.", "score": 6, "replies": []}, {"body": "Plus NIO already \"mooned\" back in the Fall.", "score": 2, "replies": [{"body": "They used to say the same about Tesla.", "score": 11, "replies": []}]}]}, {"body": "Bought at 55 sold at 65. What are your projects 6/8/12/24 months from now?", "score": 3, "replies": [{"body": "I think 85 easily by the end of the year. Sold around 7500 units in January and we can expect them to ramp that up, maybe 100k vehicles sold EOY. Tesla hit 300k sales in the US and NIO is on track for 1/3 of that. \n\n\nNIO had 4.5 billion in revenue last quarter\n\n\nTESLA had 8.77 billion, which is about 2x NIO's, while their market cap is 9x as high as NIO.", "score": 5, "replies": [{"body": "Nio only made 4.5 billion rmb not usd. So more fair comparison is 700 million usd(nio) to 8.77 billion usd (tesla) \n\n11x difference in revenue, so actually nio is overvalued compared to tesla.\n\nDoes anyone else think its a problem that they don’t make their own cars and contract JAC motors to make it? It feels wrong to me, but I’m not sure if this pretty normal.", "score": 3, "replies": [{"body": "Nope, not too worried that they don't have their own plant. I'm sure it'll come along in two years or so anyways. Having your own plant doesn't guarantee that your product will be higher quality- it theoretically would, but to be honest it could also be just one more thing that NIO management has to micro manage. Tesla has always had some quality problems with their product even with their in home manufacturing.", "score": 1, "replies": []}]}]}, {"body": "higher than it is now. i don't see a lot of reason they will stop growing unless people just stop buying their cars which i doubt", "score": 2, "replies": []}, {"body": "Going to be a lot higher if they continue to dominate in the Chinese market at similar or even better growth rates. China will have the biggest EV market in the world so it just shows the potential NIO can add. Plus with so much government support the chances are in their favor.", "score": 1, "replies": []}]}, {"body": "Bought NIO at 3.68 and bought more on the way up but I don’t think it will ever touch Tesla’s numbers. Also have Li and Xpeng and I think Xpeng is actually selling more vehicles. Although they did have a recall couple weeks ago which for some reason did nothing to the stock", "score": 3, "replies": []}, {"body": "It is one of the three stocks that I am planning to Hold for a few years 3-5. They have a great vision for the future, it will be more like apple then Tesla with all the things they have going on for them - Nio Houses, Nio life, baas etc. Chinese people are crazy loyal to this brand.", "score": 9, "replies": [{"body": "That's what I like about their vision...their ecosystem. But on the flip side, building out and maintaining said ecosystem is going to be costly. Specifically the houses and swap stations since they're offered as \"included perks\", but it could go either way....but I'm a believer and in it for the long haul.", "score": 2, "replies": [{"body": "I agree completely. The high cap investment is a huge obstacle to tackle, and they don't have a lot of opportunities before they burn through their cash. \n\nBut I think of it as high risk high reward, and with how well they turned things around I feel like it has room to jump further in the short term. Honestly, seeing how they delivered record YoY vehicles from not even having enough sales made me a believer. \n\nWhereas before I felt I was too late, or it was overhyped.", "score": 2, "replies": []}]}, {"body": "What's the other two", "score": 1, "replies": [{"body": "I’m holding NIO and GOEV at the moment two stocks I really believe in.", "score": 0, "replies": []}]}]}, {"body": "A DD with pros AND cons? I love to see it", "score": 2, "replies": []}, {"body": "I am not a fan of NIO.\n\nNIO has two advantages over its rivals:\n\n- BaaS (imo their best business decision): it makes EV more affordable for the customer. It also dissipates any consumer fears of buying a new car and having to replace the battery a few years later (for a lot of money). But other manufacturers can copy that strategy. In fact, Renault has done it before NIO. Changing from normal car sales to BaaS is a pure business decision, there is no need to change anything on the technical side. Hence, competition could switch quite fast. It is also a very capital intensive strategy, because NIO has to own those batteries.\n\n- Changing batteries instead of charging: This might be useful in the US, but in Europe and China, the biggest EV markets, you usually don't travel long distances. You use your car to commute to work and charge overnight. It is, again, very capital intensive to run those battery swapping stations, as there is no compatibility with other manufacturers. Even if you currently see battery swapping as an advantage, the charging speed of batteries has hugely improved over the last couple of years and will continue to do so. If you can charge your battery to 60% in 2 minutes, why bother changing it? So I don't see it as a long-term advantage.\n\nFrom what I have read, and I am open to getting updated information on this, NIO doesn't produce its own cars. JAC does it for them and JAC is owned to 75% by Volkswagen, a competitor of NIO that is valued at a comparable price.\nTo sum up, I see NIO as a hype. I don't see their advantage over other EV stocks, especially now that the old guard has woken up and is entering the market.\n\nEdit: Source on JAC: https://www.theverge.com/2019/3/5/18252244/nio-ev-startup-factory-shanghai-cancelled-jac-motors", "score": 4, "replies": [{"body": "On changing batteries you’ve got that the way wrong way round. Changing is useful in China because people live in apartments. In the US people have houses to charge.", "score": 3, "replies": [{"body": "My main point was that the average distance covered daily is greater in the US. As long as parking sports, either at home or at work, have charging capabilities, my point stands.\n\nLet's say you are right and I am not - it doesn't change my mind. It is a technology that takes years to build a network for. By the time they are finished, charging capabilities will have progressed far enough to be superior and their network will be virtually worthless.\nThe only strategy that might work is focusing their sales on certain geographic locations and providing infrastructure in those places.", "score": -1, "replies": []}]}, {"body": "Ohhh the last point on JAC is something I'll look into. \n\nBut I think that customers will be happy buying a Nio car with the battery as well. That is still going to be an option and it takes 10min to charge for 100km. I think having the option extend to customers is key here, and it provides similar at home charging times between the NIO and Tesla (I think Nio may be a bit faster). It also works with both US and Chinese markets in terms of locations/desirability by the user. \n\nI also believe that scaling supercharger stations will be much more costly than battery swap stations, which if they caught on could provide a lesser barrier of entry than Tesla had when they tried to do both - eventually deprecating battery swaps - let alone building a network of superchargers. \n\nA final note is that they have the ability to learn from Tesla's mistakes - so whether this BaaS play is a failure, only time will tell. But I am bullish on their turnaround, and confident they can go higher in the short term.", "score": 1, "replies": [{"body": "> I also believe that scaling supercharger stations will be much more costly than battery swap stations\n\nOn what do you base this believe? Battery charging stations will be shared by users of all manufacturers, just like petrol stations nowadays. There are still a couple of different plugs (see article below), but it shouldn't be a problem to install all of them in one charging station. Therefore there shouldn't be additional costs for the car manufacturers. Tesla built their own network at the time, not because they wanted, but out of necessity - without it nobody would have bought their EVs. \nSome manufacturers might want to enter that market anyways, but they won't have to.\n\nhttps://get-green-now.com/electric-car-plugs-and-chargers/\n\n> But I am bullish on their turnaround, and confident they can go higher in the short term.\n\nHigher than the 37k cars they delivered in 2020? Sure, but that's not hard. Does that justify their current valuation? Not even close. Just look at how traditional manufacturers are increasing their EV sales. Take VW group as an example and compare their numbers with NIO. You don't even know if NIO has actually ever produced a car by themselves or just bought them from JAC. How will they be able to ramp up production?\n\nI don't want to be too negative here, just be careful where you put your money. NIO is very popular in the US, that's where most investors are, and people buy what they know. But don't forget what is happening in the ROW, where most of the actual EV are sold. You are valuing NIO at the best-case scenario, disregarding most of the risks. Nevertheless, I hope it works out for you.", "score": 2, "replies": []}]}]}, {"body": "Did you in your \"due diligence\" see that NIO is a very small car manufacturer in China.  The largest car manufacturers in China are also investing in EV.  Did you also find that NIO has over 400 competitors in China?\n\nFact is that NIO is a very risky stock just by those factors alone.  Then there is also the matter where it is a Chinese stock which means that the Chinese government can very easily do as they please with NIO.  There have been plenty of Chinese stocks here in the past that were supposed to be the next big thing and ended up going nowhere.", "score": 3, "replies": []}, {"body": "Put it this way nio has what Tesla’s market cap should be.", "score": 2, "replies": []}, {"body": "teeny jobless somber unite wild disgusted unused provide heavy fine\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -2, "replies": [{"body": "Don’t be a pussy", "score": 4, "replies": []}, {"body": "Tell that to Fidelity, Vanguard and BlackRock.", "score": 1, "replies": [{"body": "Got em’", "score": 1, "replies": []}]}]}, {"body": "That’s the NIO Richard Hammond drove in grand tour.", "score": 1, "replies": [{"body": "nio EP9. fastest production electric car around the 'ring. should note that is not street legal though.\n\n&#x200B;\n\nNio also won a formula E championship", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[he also drove the nio ep9](https://youtu.be/ilEG53Cl3LE)", "score": 1, "replies": []}]}]}, {"body": "My DD, goes up 10-15 bucks after every major event/earnings than goes back down 5-10. Why? No idea. You can dig up a ton of financials that support why it should do that and also a ton of financials that says its crazy the company is nowhere near worth that much. Welcome to the EV space.\n\nPositions: 30C 01/22", "score": 0, "replies": []}, {"body": "You know the main reason? It's cheaper to buy a Tesla in China than a NIO car. According to simple laws of economics why would you pay more for a inferior product?", "score": 0, "replies": []}, {"body": "Have you taken a look at Byton?  I saw one of those cars 2 years ago at CES 2020.  Wow what a car.  They have had some issues finding financing and shutting down with Covid and whatever.  But they make a very nice vehicle.", "score": -1, "replies": [{"body": "I have not but I’ll check it out!", "score": 1, "replies": []}]}, {"body": "A company that needed a bailout because no one wanted their vehicles, yet somehow being the 5th biggest car manufacturer in the world, doesn't sit well with me imo.", "score": -1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I had heard of it but just watched the whole cnbc documentary and got goosebumps. \n\nRawlins [HAS SO MANY PATENTS](https://patents.justia.com/inventor/peter-dore-rawlinson), dear god. \n\nGuess I have another company to buy into - just gonna hold off on Churchill until the merger is finalized.", "score": 1, "replies": []}]}, {"body": "Shouldn’t the overweight consensus be a pro, not a con?", "score": 1, "replies": []}, {"body": "I only regret not buying more of them. And I took my profits the first time at 16$ dumb afterwards", "score": 1, "replies": [{"body": "Haha a gain is always better than a loss. I still see a lot of potential in Nio and bought another call option today.", "score": 1, "replies": []}]}]}
