{"title": "Journey to $1 Million Upcoming Week of February 22nd (possible hedge play)", "selftext": "Last week we experienced a small dip and a decent bounce back on Friday. Many people on the news and online are fear mongering about a crash soon to come. I personally feel that we are I the late stage of a bull cycle now that so many retailer investors are coming out to play, although with corona it could be different. I estimate a major pull back in 2022-2023. After discussing the new picks and notable mentions, I'd like to go over a basic hedging strategy for anyone that is nervous.  \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\n**Adding to Watchlist:** \n\n$**NIO**\\- In case you have been living under a rock, NIO is a Chinese electric car company. They have the lead as far as Chinese electric luxury vehicles are concerned in China. Take it from someone that lives in Shanghai - they are everywhere. Personally, I like the interiors of these cars better than Tesla and I think this is easily an $85-$100 stock. Start buying into long positions now and the next EV push should pay you nicely. Deep ITM LEAPS?\n\n* Target Price: $85\n* Entry: <$55\n* Risk: 4\n* Timeframe: 5-8 months\n\nhttps://preview.redd.it/ztjbbbm5wxi61.png?width=1018&format=png&auto=webp&s=40b15526a2778f139d906a13e8a2c6b6f9a633bb\n\n \n\n$**OZON**\\- Ozon.ru is an ecommerce giant of Russia, like Amazon is to the US. Ecommerce will continually growing in Russia, and in my opinion we jump on this before it blows up more like Amazon or Jumia did. $OZON is trading in a parallel channel, and if it fills a gap at around $57 I will be entering then. \n\n* Target Price: $75\n* Entry: <$57\n* Risk: 4\n* Timeframe: 2-5 months\n\nhttps://preview.redd.it/k57dg9a7wxi61.png?width=1018&format=png&auto=webp&s=41e31ebaeee595b58f2c18e1ee39d1a36713fab9\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n$**PLTR**\\- Not only has Ark Invest been buying up Palantir during the dip last week, so have I. I will continue dollar cost averaging into my call option positions (Aug 21, $30 Strike). I'll be keeping my entry and target the same.  \n\nhttps://preview.redd.it/1m5zok39wxi61.png?width=1018&format=png&auto=webp&s=4519f21afa07c5f40f49e0fbbd0d30752856cf40\n\n$**WKHS**\\- Workhorse Group is an EV manufacturer currently focused on manufacturing electrically powered delivery and utility vehicles. Recently $WKHS has dipped into and is near my 'Buy Zone'. With the Biden administration waiting to electrify all of the vehicles in the federal fleet, this company could be in a good situation to get a contract for USPS let's say. If that were to happen, there would be a buying frenzy. Since it is near my support, I'd like to be getting some mid - long term call options. I'll keep my target and entry the same on this one for now.  \n\nhttps://preview.redd.it/4bg27tkawxi61.png?width=1018&format=png&auto=webp&s=ff2fc712a3071b3ac5f8a309dbd345a56b63abea\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nHedge: \n\n**$DIA:** Let's look at far OTM Puts on Dow Jones ETF. For me, this is more of an 'insurance policy' than it is an actual hedge, but it is so cheap that its hard to not consider. At Jan 22 expiration, the $95 put is only $30 right now. Spending a couple hundred, or a thousand, dollars on these could make you a lot of money if the market did crash. The question is when will it have a significant correction. If it is before Jan 22, these premiums will skyrocket. In 2008, the Dow lost half of its value. If something like this happens again based on increased IV and the strike not as far OTM, I estimate these would 20-50x.  \n\nhttps://preview.redd.it/493ja88dwxi61.png?width=1018&format=png&auto=webp&s=81adc4079e1ff2cba082b7db4f95f49c9f34d343\n\nFor arguments sake, let's say the same thing happened this year as in 2008 and the Dow lost 50% of its value so $DIA dropped to $150. That puts our $95/$100 strike about $50 out of the money. Currently, $50 OTM is going for $1000. That is about 33x even with low IV of 25%. Assuming the IV would skyrocket if the markets were crashing and these puts would be in much higher demand, this could be higher. \n\nhttps://preview.redd.it/qqo15jmewxi61.png?width=1018&format=png&auto=webp&s=e94e703933f35435f0a1b59763fe88ae0a116a1c\n\n \n\nIf the market doesn't crash by Jan 22, you'll lose the money (some or all), but that is pretty much how 'insurance' works. \n\nLet me know if you agree or disagree with my cheap hedge. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nNote: Risk (1 out of 5) is my opinion of how risky the stock and these plays are; 1 being the lowest and 5 is the highest. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\nDisclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.", "id": "lpcvro", "created_utc": 1613960822.0, "score": 628, "upvote_ratio": 0.94, "num_comments": 96, "comments": [{"body": "I like your hedge. \n\nMy only question is why hedge with DIA puts? It's my opinion that in the case of a correction, the DJIA wouldn't drop nearly as much as something like SPY or QQQ.\n\nAs the Dow Jones is price weighted and contains mostly (if not all) value stocks, while the S&P 500 and Nasdaq are market cap-weighted and contain more growth stocks.\n\nThe frothiness of this market haves me thinking that if there is a correction, the market cap-weighted ETFs containing more growth stocks will take a bigger hit (SPY and QQQ), with DIA receiving some flight-to-safety from sold equities in the former.\n\nWould love to hear your thoughts on this!", "score": 84, "replies": [{"body": "My thinking is that DIA is the cheapest, therefore you could buy more contracts. But that’s just one example I used. In practice I’d buy this hedge with QQQ, DIA, SPY, XLK, and SMH. \n\nAlso can consider buying calls far OTM for their inverses.", "score": 43, "replies": [{"body": "Ahh ok, makes sense.. yeah I'm looking at some SPY contracts for the same time frame and they look a lot more expensive.\n\nThink I'll take a look into some prices for TQQQ and SQQQ since I really like the idea.. thanks for the post!", "score": 11, "replies": [{"body": "No problem! Just my general thought process was during a market crash everything will go down. For sure some more than the other, but might as well pick up the cheapest one.", "score": 11, "replies": [{"body": "Quality names will go down least spec names will go down most. Dow will drop least and Russell will drop most", "score": 10, "replies": []}]}]}]}]}, {"body": "Big fan of the pltr play. Looks like that’s paying off already. I’d agree with some of the other comments on market correction plays. I think it’s very unlikely we see a major correction until 2022 with hopium, vaccines, and stims otw. Will probably wait to buy QQQ put leaps later this year", "score": 35, "replies": [{"body": "My thoughts exactly", "score": 13, "replies": []}, {"body": "I’m majorly bullish on Palantir, doesn’t get much better than big data and juicy government contracts. \n\nI could see them getting to TLSA level P/E ratios as the ceiling is essentially endless \n\nPositions \n\n20 Mar 12 32 call\n20 April 1 34 call\n35 Jan 20 22 call (picked these up at 10/share 🚀)\n15 Jan 23 45 calls", "score": 7, "replies": []}]}, {"body": "Figured I'd post this here since you got me looking into it.\n\nQQQ April 300 puts currently have 60.8k open interest, with 1.2k volume (and 29.7% IVx).\n\nA 10% drop in Nasdaq within the next 54 days would be required for these puts to be ITM. Their current mid price is 5.07, and the current mid price for ITM contracts is 13.53.\n\nThis would be a 266% ROI with no change in IV. \n\n54 days isn't a huge window, and the ROI numbers are even better for March contracts (albeit a smaller window of 26 days).. but this looks interesting, and I'll definitely be looking into it more tomorrow.\n\n**Disclaimer: I am not a financial advisor. This is not investment advice. This is chicken-scratch math I did running on almost no sleep. This is meant to provoke discussion on similar hedging positions.**", "score": 26, "replies": [{"body": "You've convinced me. I'm all in. \n\n&#x200B;\n\n**Disclaimer: j/k**", "score": 8, "replies": [{"body": "lol..of course I woke up late and missed some gains on this trade- but my puts are currently up $200 with todays move", "score": 1, "replies": []}]}]}, {"body": "following your journey, keep up the posts", "score": 20, "replies": []}, {"body": "I am planning on nio leaps!!", "score": 9, "replies": [{"body": "How far and what strikes you looking at?", "score": 4, "replies": [{"body": "Dec 2021 $85 / Jan 2022 $100\n\nAny thoughts or inputs?", "score": 10, "replies": [{"body": "Technically those aren’t leaps", "score": 1, "replies": []}]}]}]}, {"body": "Solid plays on PLTR and Nio. I don’t think WKHS will get the contract though", "score": 8, "replies": [{"body": "workhorse is american based, and supposedly Biden is shooting for that", "score": 3, "replies": [{"body": "To be fair, any government vehicle purchase is going to be American-made, Biden or no.  That’s why the government drives around in Fords and Chevys for the most part.  \n\nDoesn’t change the fact that this bodes well for WKHS, but it’s not like the government was ever going to buy a fleet from NIO.", "score": 1, "replies": [{"body": "Forgive my ignorance. Are Fords/Chevy actually assembled in US?", "score": 1, "replies": []}]}]}, {"body": "Why not?", "score": 1, "replies": [{"body": "maybe they think Ford is gonna beat WKHS out. But WKHS vehicles are produced in Ohio", "score": 1, "replies": [{"body": "WKHS are just pump and dumping  with this mock \"contract days\" IMO\n\nMy gut doesn't like it..\n\nI'm probably going to be wrong and they're going to sign, but fuck WKHS regardless", "score": 1, "replies": []}]}]}]}, {"body": "Dude this is insane. I’m a big fan of this!! Keep it up!!!", "score": 7, "replies": []}, {"body": "I like your hedge. I thought the same thing last night.", "score": 5, "replies": []}, {"body": "Sold a $55 CSP on NIO last week and kind of hoping I get assigned. Already have 30 shares with a cost basis of $36. I’d like to have 100 so I can sell way OTM CC’s.", "score": 5, "replies": [{"body": "Funny -- a couple of weeks ago, I sold a March 19th $55 NIO put for $4.05. Now it's ATM and the premium is $5.95. Oh well. I'll be happy if I get signed at expiry.", "score": 1, "replies": []}]}, {"body": "Your math on the discord puts doesn’t work out exactly. 50 dollars down both ways is a misleading way to look at it since 50 dollars is a higher percentage of 150 than 330. This means the Dow would lose more value per dollar as a percentage of total  in the 100-150 range than the 300 range. Still seems extremely profitable and I will consider picking some up, but I’m not seeing a big market crash for a couple years. Way overdue for another September correction though", "score": 9, "replies": [{"body": "I’m also not seeing a big market crash any one soon too. But even a small dip these could 5x. \n\nFor sure it’s not as simple as my math was showing, but just to show the basic idea and let people start their own DD process 🍻", "score": 13, "replies": []}]}, {"body": "If the Dow is below 9500 in a year we are well and truly fucked and a few puts aren't going to save us. \n\nAppreciate the frequent updates though!", "score": 15, "replies": [{"body": "The hedge seems more like an IV/gamma play on big underlying movement, no? \n\nI don't think OP actually expects DIA will go below 95 (I could be wrong).", "score": 31, "replies": [{"body": "That’s what I’m reading.", "score": 8, "replies": [{"body": "So who is buying these things? Big boys as an insurance?\n\nEDIT - when you want to offload", "score": 2, "replies": []}]}]}]}, {"body": "That Dow put is an excellent idea. Thanks for that. I might go with the Nasdaq myself since it ran up more than everything else the last year. Or do a mix of both.", "score": 3, "replies": []}, {"body": "Great post as always, pleasure to read.\nHow do you calculate the potential profit (or protection) on that hedge?\nI can understand the calculation of the cost, but how do did you forecast the outcome of possible 20x-50x?", "score": 3, "replies": [{"body": "Just a fast and general way to do it would be to calculate what the current going rates are for how far out of the money that you think you will be once it crashes. So if it crashed to $150/DIA that is $50 OTM from your strike, so what is $50 OTM currently selling for.", "score": 9, "replies": [{"body": "But this doesn’t take into account the time decay when say a crash happens in Sep 2021 for instance (ie 4 months left to expiry)? For eg Jun 2021 puts (also 4 months left to expiry from present) for the $50 OTM is selling for about 400. So returns is only 13x (still good) instead of 33x without taking into account IV spike?", "score": 1, "replies": [{"body": "> (still good) \n\nYea you are absolutely right. This is more like a poor mans hedge gamma play.", "score": 1, "replies": []}]}]}]}, {"body": "I don’t like the hedge. The Dow is probably the least overvalued out of all the averages. And if we finally get the infrastructure push we expect to get from this administration, I see another 30% increase in the industrials.  That calculus has even better odds if interest rates start to climb back up, as they likely will, giving the banks more fuel. If you want a hedge play, why not buy puts on the QQQ?", "score": 3, "replies": [{"body": "I agree with you on DIA being the least overvalued.. but like the train of thought OP has directed me towards.\n\nI'm looking at QQQ now..specifically I'm looking at either puts on QQQ/TQQQ or calls on SQQQ.\n\nUnfortunately TQQQ options chains look pretty illiquid. \n\nSQQQ calls look better as far as OI, volume, and price, but the risk:reward is so similar to equivalent QQQ puts that I'd probably do something in QQQ since it has much better liquidity (not to mention you'd be long IV instead of short it).", "score": 7, "replies": []}, {"body": "DIA was just an example. In practice I would do this across every sector and index in my portfolio", "score": 5, "replies": []}]}, {"body": "Ozon and Palantir are the two i got in on 😤", "score": 2, "replies": []}, {"body": "I agree with NIO.\nHad them on my watchlist a year and a half ago.. with a value of around 1,50-2€. But unfortunately too long on my watch list and not in my stock. 😒\nMissed the chance.. invested at 28€/34$. But still see a big potential in NIO.", "score": 2, "replies": []}, {"body": "Nice job! Well planed and laid out. I’m with you on the pltr aug calls and I have wkhs csp expiring Friday @30. I thought 30$ was a good long term entry point so we will see how the week goes on that play.", "score": 2, "replies": []}, {"body": "Always enjoy reading these, thank you!", "score": 2, "replies": []}, {"body": "why not just use vix calls to hedge? way cheaper and way more volatile", "score": 2, "replies": []}, {"body": "Awesome man.  Thank you, I enjoy reading these. \n\nYour goal right now is loftier than mine.  I am trying to get to a messily $25k.  Figured since I am learning options, I should aim a bit lower.  Lol", "score": 2, "replies": [{"body": "I'm the same boat as you.  I've set my goal at about the same as your for the end of this year.", "score": 1, "replies": []}]}, {"body": "I agree with hiddenmoney I’d love your thoughts.", "score": 1, "replies": []}, {"body": "Is your primary goal to get better at options, or make money?", "score": 1, "replies": []}, {"body": "SAVE - SHORT SQUEEZE HAPPENING!!! Jump in", "score": 1, "replies": []}, {"body": "Curious if you have a take on XPEV vs NIO? XPEV looks to have more potential for growth", "score": 0, "replies": [{"body": "I'm more bullish on XPEV because of the autonomous tech. Thanks for asking!", "score": 2, "replies": [{"body": "Got it, thanks! Just picked up some XPEV calls", "score": 1, "replies": []}]}]}, {"body": "I may be retarded, but I bought (or will at market open) 5 208 dollar puts at 1 dollar each. At worst I loss 5 bucks, but if it somehow ends up in the money I'll be happy\n\n(March 31st, btw)", "score": -2, "replies": [{"body": "QQQ or?", "score": 2, "replies": [{"body": "Sorry DIA", "score": 1, "replies": []}]}, {"body": "each contract is for 100 shares, so if you bought 5 contracts at $1 you'd be out $500 at most", "score": 1, "replies": [{"body": "I probably should've been more clear, but the contract was $0.01 per share. However the order never went through and the last price I saw was $0.07 per share", "score": 0, "replies": []}]}]}, {"body": "Lies lies lies this thing don’t even move to $10 not even $7 please lies lies lies !!!!!!!!!!", "score": -2, "replies": []}, {"body": "I'm dumping cash into SESN call options myself. The stock is under valued and the company behind it will be approved by the FDA this year for a cancer fighting drug. The stock is rated as buy and I could see it hitting $10 by the years end.", "score": -25, "replies": [{"body": "New account randomly posting about rando shit-stock. \n\nSEC this guy right here.", "score": 12, "replies": []}]}, {"body": "Shit lol do some DD. Hit me back in August and I'll show you the cash I've made.", "score": -22, "replies": []}, {"body": "What do you think about using an inverse ETF or potentially even a leveraged inverse ETF as a hedge? I haven’t checked to see if these are optionalable or if they are affordable. I just wanted to see your thoughts on the theory.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What the Twitter @m", "score": 1, "replies": []}]}, {"body": "Sqqq holding up  so are sdow and spxu options. Holding long calls", "score": 1, "replies": []}, {"body": "Thanks a ton for your insight into NIO. As a typically near-sighted American, I would have equated NIO more with one of the EV SPAC memes rather than TSLA - just out of ignorance.\n\nBest of luck on your journey!", "score": 1, "replies": []}, {"body": "Terrific post.  Thank you.", "score": 1, "replies": []}, {"body": "Man, I've got close to 20k in two ARK ETFs and REALLY want to dump one of them and spend the 10k on PLTR LEAPS! What are your thoughts?", "score": 1, "replies": []}, {"body": "RVs are going electric too...... \n\nOn Feb. 17 Robert W. Baird analyst [Craig Kennison](https://www.tipranks.com/analysts/craig-kennison) raised the price target on the stock to $44 (19% upside potential) from $38 and reiterated a Hold rating.\n\n“RV industry demand surged 38% in 4Q and comments from key executives suggest confidence in results to be reported on Feb. 25. The RV market remains hot as consumers pursue the outdoors and Camping World appears to be capturing more than its fair share,” Kennison wrote in a note to investors.", "score": 1, "replies": []}, {"body": "Remind me! 1 day", "score": 1, "replies": [{"body": "I will be messaging you in 1 day on [**2021-02-23 18:15:12 UTC**](http://www.wolframalpha.com/input/?i=2021-02-23%2018:15:12%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/options/comments/lpcvro/journey_to_1_million_upcoming_week_of_february/god6p40/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Flpcvro%2Fjourney_to_1_million_upcoming_week_of_february%2Fgod6p40%2F%5D%0A%0ARemindMe%21%202021-02-23%2018%3A15%3A12%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20lpcvro)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "good work! 👍👍", "score": 1, "replies": []}, {"body": "Just waiting for JAGX, nakd and T to pop up..", "score": 1, "replies": []}, {"body": "average price of 11.28 on my NIO shares. HOLD!!!", "score": 1, "replies": []}, {"body": "how are you currently feeling about $NNDM as they continue to dip are you still bullish on your position and price target?", "score": 1, "replies": []}, {"body": "Blue Lagoon President & CEO Rana Vig Adds 1 Millon Shares To His Personal Position\n\nMon, February 22, 2021, 3:10 AM·\n\nBLAGF $BLLG\n\n+24.49% so far today", "score": 1, "replies": []}, {"body": "What is the green support line on your upper charts?   Thanks", "score": 1, "replies": [{"body": "super trend", "score": 1, "replies": []}]}, {"body": "Thats hot..", "score": 1, "replies": []}, {"body": "Opened NIO diagonals for earnings run up on Friday. Super low IV.", "score": 1, "replies": [{"body": "What are your thoughts on the EV market as a whole? Read an article saying tesla and other EV companies heading into a bear market", "score": 1, "replies": []}]}, {"body": "OP are you beta weighting your portfolio to calculate your hedge or just buying puts and hoping they offset? \n\nIf not you should definitely look into beta weighting, it will give you a much more accurate sizing of the hedge required.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I wouldn't just hedge with DOW. I just used that one as an example for a 'cheap' hedge.", "score": 1, "replies": []}]}, {"body": "I’m with you on NIO, I’ve always loved their design and it’s pretty obvious that they’re the Tesla of China.", "score": 1, "replies": []}, {"body": "Nice analysis man. I added small amounts to pltr and nio today, although disappointing to see nio crash below its 50 DMA today.\n\nI opened a 55/60 dec vertical debit spread on NIO today as well, I'm hoping it'll be atleast $60 by eoy and I can collect 50k off the spread. Its not guarantee though its trading almost a double to tesla's EV/S, so it's very over valued. Just hoping the sales growth can keep justifying the lofty valuations atleast through the end of the year. \n\nOh my hedge is vixy calls dated July ish I believe. Pros to that are they can pop like crazy but the con is that they are expensive AF. I think your hedge is a little better. I thought of selling some puts at $10 to offset the cost, but the prems were so low.", "score": 1, "replies": [{"body": "How many contracts did you buy for Dec to make 50k?", "score": 1, "replies": [{"body": "Lol a lot 150  Either I’ll be really happy or really sad later on this year. The profit loss ratio on nio spreads is favorable which is why I decided to go for it, total cost of the spread was around 20k. I’ll monitor it and if it looks like it won’t hit I’ll roll. It’ll eat into the margins, but the cushion is decent so I have some room there where I won’t make as much money but hopefully can still walk away with some profit.", "score": 1, "replies": [{"body": "That sound very interesting. I running bull put spreads on Roku with that 380/370 every week but will look into nio. Are you on discord or Twitter...would be cool to bounce ideas back and forth", "score": 1, "replies": []}]}]}]}, {"body": "Don't know if you played your hedge... I put on something similar in QQQs and it really worked nicely.. has me up $1300 when everything else is blood red.", "score": 1, "replies": [{"body": "What play did you go with in qqq?", "score": 1, "replies": [{"body": "I bought 4 300 strike April QQQ puts yesterday for 5.64 each.. sold them at different levels today for an average of 8.99 each.\n\n Left some money on the table but managed to sell my final puts at the bottom of QQQ today. Trade length from open to close was less than 2 days, with a 59% ROI.", "score": 2, "replies": []}]}]}, {"body": "Thats excellent.", "score": 1, "replies": []}, {"body": "Sorry, noob here .... I didn’t understand $PLTR buy option.... if had to buy today ...what price range should I plan for to buy for in Aug and how much bid should I pick ?", "score": 1, "replies": []}, {"body": "how do you make money on the hedge if there is a flash crash ? Will someone buy it from you will there be demand ?", "score": 1, "replies": []}]}
{"title": "I'm down 15% in the last week! What should I do?", "selftext": "It's been one month since Biden was inaugurated, I thought that clean energy stocks and EV stocks it supposed to go up, but it happened exactly the opposite. Enphase -17%, SunPower -26%, Sunrun -22%, First Solar -17%, Tesla -11% and more in the last month + Chinese EV stocks NIO -15%, XPENG -30%, LiAuto -16%. I'm not that confident anymore!\nWhat should I do? Sell everything or just wait?", "id": "lpst2l", "created_utc": 1614011552.0, "score": 9, "upvote_ratio": 0.59, "num_comments": 92, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22Rate+My+Portfolio%22+-+r%2FStocks+Quarterly+Thread&restrict_sr=on&include_over_18=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Probably wait", "score": 83, "replies": [{"body": "And diversify. Like, kinda a lot.", "score": 32, "replies": []}]}, {"body": "Smh this is the issue. One bad month and you want to jump ship. Most of the green/EV run-up was priced in after Biden was elected in Nov. These have always been long term plays. You invested in these companies for a reason, right? No sense in locking in your loss by selling. Just hold.", "score": 48, "replies": [{"body": "Look, I’m probably going to get downvoted to hell and back, but I’m not sure companies like Tesla are really going back up to 800, I mean it’s way overvalued, and much of Tesla’s retail investor market has kind of shifted their interests toward Bitcoin since they are much more the younger generation trying to be more risky. Furthermore, for the time being there’s no major news for tesla, and lots of other car companies are starting to invest in EVs, increasing the overall competition, but that’s just my take", "score": 6, "replies": [{"body": "I have no idea what Tesla will do in the next day, next month, or even next year. But I can pretty confidently say that they will be a much larger company in 2030 than they are today.", "score": 1, "replies": [{"body": "I think so too, but that doesn't mean their market capitalisation will be higher. It is already priced like THE EV winner and big in markets that do not yet exist.", "score": 1, "replies": []}, {"body": "I don’t disagree that Tesla will be a fucking amazing company in the future, I myself am interested in buying one, I just don’t see the tsla stock having much growth room, all things considered, \nHere’s the numbers as of Jan 15 (a bit outdated but this is the best I can find) \n\nMarket cap of largest car companies:\n\n1: Tesla 800 billion $\n2: Toyota 200 billion $\n3: Volkswagen 96 billion $\n\nBut Tesla only profited 721 million in 2020, while Toyota is expected to profit 18 billion\n\nI don’t think Tesla is a bad company, I just think it’s way overvalued and even in 10 years it’ll prob not be able to match its current PE ratio, and I honestly wouldn’t be surprised if in 10 years it’s still worth less than 800 a share.\n\nI got out of tesla a few days ago after making 550% gains over a year, not trying to push anyone else out of the stock if you like it, by all means keep it, just letting you know this might be a tad bit bias because I am no longer invested in it", "score": 1, "replies": []}]}]}]}, {"body": "Biden enthusiasm was priced in. The companies had inflated value due to this. They are long haul stocks that need to grow into their evaluation then continue growth. They are not a short term play. Id say hold and one day they will make returns.", "score": 33, "replies": [{"body": "So you have to price, before they price in?", "score": 1, "replies": [{"body": "Many stocks have their price based on potential earnings, not its actual current or previous earnings. These stocks have skyrocketed in price without actually performing any better than usual. Is more you have to spot them early before they become cool.", "score": 1, "replies": []}]}]}, {"body": "Damn son... Just wait at this point", "score": 49, "replies": []}, {"body": "Do you actually believe in the companies you put money into?", "score": 23, "replies": []}, {"body": "Why don’t you look at the 6-12 month price history of the stocks you named...then ask yourself if a run up of 200-1000%+ was pricing in the Biden presidency.", "score": 35, "replies": []}, {"body": "Sell now and buy back in after it's back up.", "score": 87, "replies": [{"body": "This is the way", "score": 19, "replies": []}]}, {"body": "Yeah I'm holding", "score": 9, "replies": []}, {"body": "Sue Biden. I’m sure you have a case.", "score": 29, "replies": []}, {"body": "wait, but maybe also diversify by adding positions in non-renewable ETFs/securities.", "score": 6, "replies": []}, {"body": "Hold them my guy. They will bounce back at somepoint. Especially if Biden gets some of the laws he wants pushed thru congress.", "score": 6, "replies": [{"body": "oh yeah, when i think waimarian left economics i think flourishing stock market", "score": 2, "replies": [{"body": "Biden is pushing for clean energy what do you think will happen to those stock prices if he gets those laws in place? They're not gonna go down.", "score": 4, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Not yet. I'd say in another 20ish years it will be viable", "score": 1, "replies": []}]}]}]}]}, {"body": "Serious questions:\n\nWere you expecting to sell very quickly for a large profit? Do you really believe in clean energy being the future?\n\nI'm not a financial advisor and know jack shit about stocks. I just would like to say there are many more factors involved other than the presidency. Yes it has a large influence on it but...those seem to me as long term investments. We are killing our planet and many people understand that we can't keep on the way we are now if we expected humanity to survive and be able to live on Earth.  I personally believe in clean renewable energy. I believe it is a giant part of our future.  I think you should tuck those away for a long time and forget about them. 10-15 years from now we will likely see advances and changes that will largely influence those stocks and numbers. Again i wouldn't even call myself an amateur with stocks so for all I know sell that shit now while it's down and buy back later when it's expensive. Best of luck", "score": 6, "replies": []}, {"body": "Did you think renewable energy was going to be made into the primary source of global energy in a week's time?", "score": 6, "replies": []}, {"body": "Like others are saying it was already priced in. Now there is a correction happening. This ev/green stocks will go back up just got to be patient. Especially since all Biden has done to be green is rejoin Paris. Got to wait until more of his plans come out then they will go up huge. \n\nI just got myself some ENPH with this pullback and holding long", "score": 4, "replies": []}, {"body": "Wait it out. That stuff is still going to go up, just maybe not as fast as you were expecting or hoping. Clean energy is our future, because if it isnt, we dont have a future.", "score": 8, "replies": []}, {"body": "Investors like to buy rumors (prior to Biden) and sold the news  when he actually became president.", "score": 3, "replies": []}, {"body": "You've got to lead the trend,  not follow it.  It's a hard lesson to learn and one that I'm still working on.  If the value is superficial and easy to identify, it's likely already been priced in.", "score": 3, "replies": []}, {"body": "SELL IT ALL!!!! oh wait, this is the stock market. its what happens.", "score": 4, "replies": []}, {"body": "Just hold, the market was priced in for a biden win for a a few months before the election in my opinion so now things are bing shuffled around a bit. When the next green bill comes out it'll bounce back up.", "score": 2, "replies": []}, {"body": "It frustrating when you just get in a stock and it's down. Yes. Just look at the long run, ignore your lost it happened. Always look forwards, you can sell now for sure, but what you think your assets will do on long run? That the big question.", "score": 2, "replies": []}, {"body": "How about you do analysis to determine what the actual value of those stocks are and what is just hype.\n\nMarket is currently pricing in inflation and rotating away from tech.  More losses in the near term is likely", "score": 2, "replies": []}, {"body": "If you like the stock, you should hold.\n\nYou probably bought at the peak though, at least for now.", "score": 2, "replies": []}, {"body": "3 months is a very short term to evaluate stocks. All stocks you bought had amazing growth in the last 12 months. most people will get their profits from these stocks. Your best bet is to wait, they are all good stocks, none of them are pump and dumps. \n\nMy two cents as a stock investor of 20 years is that, I'm bagholding too. I have LMT that I bought at 370's, Edit I bought at high around 60, Niu I bought around 44. \nSo you are not alone and experience alone wont prevent this. My diversity is better, majority of my stocks are a, tmo, jnj and a few smaller biotek companies, I also keep significant part of my portfolio with etfs some broad market etfs, combined with, icln, mj, arkk, prnt, cibr etc. \n\nPatience is the key here. Just wait it, maybe a few weeks or years, that nobody knows. Good luck. If you want to invest more, please start from broad market etfs and narrow it down to specialty etfs then go for high growth stocks then to penny stocks.", "score": 2, "replies": [{"body": "This is the 2020-2021 mindset. \"I've held this stock for 30 days and it hasn't gone up, WHAT'S GOING ON?\"", "score": 5, "replies": []}, {"body": "Bought Edit at 67. It was 90 at the beginning of the year. Do you think will go back. Also CRSP I bought it very high 178 (it was 210). When we are going to see those high prices again?", "score": -3, "replies": [{"body": "I work in biotech and in a related company, my instincts tell me that, they will succeed in commercialization but who the big winner will be is debatable. I see them climbing on good news. When they will catch up nobody knows.", "score": 2, "replies": []}]}]}, {"body": "Maybe diversify next time in some index funds or different sectors rather then concentrate your holdings in hype of green energy and EV", "score": 2, "replies": []}, {"body": "Biden manipulating stocks now 😂", "score": 2, "replies": []}, {"body": "Focus on your current job and check back in 1 year", "score": 2, "replies": [{"body": "**TheDiscomfort** , KMINDER 1 year on [**22-Feb-2022 21:29Z**](https://www.reminddit.com/time?dt=2022-02-22 21:29:13&reminder_id=d7d34b2bb42849ae82a514466ad2a06a&subreddit=stocks)\n\n> [**stocks/Im_down_15_in_the_last_week_what_should_i_do**](/r/stocks/comments/lpst2l/im_down_15_in_the_last_week_what_should_i_do/godx3gx/?context=3)\n\n> Focus on your current job and\n\n[**CLICK HERE**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202022-02-22T21%3A29%3A13%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fstocks%2Fcomments%2Flpst2l%2Fim_down_15_in_the_last_week_what_should_i_do%2Fgodx3gx%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Update message, Update remind time, and more here**)](https://www.reminddit.com/time?dt=2022-02-22 21:29:13&reminder_id=d7d34b2bb42849ae82a514466ad2a06a&subreddit=stocks)\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Fuel Me](https://paypal.me/reminddit)", "score": 1, "replies": []}]}, {"body": "This is why you diversify", "score": 2, "replies": []}, {"body": "I think we're heading for a correction. Smart money is going big into the DOW", "score": 4, "replies": [{"body": "Tech and growth is dead.  Commodities and energy is in", "score": 5, "replies": [{"body": "Ya. That's what I'm gonna be buying. Bear market here we come", "score": 2, "replies": []}, {"body": "How do you feel about LUMN", "score": 0, "replies": [{"body": "I'm in that too.  Utilities are good during inflationary periods as well", "score": 2, "replies": [{"body": "Yes. Everyone needs electricity and water and gas and food. Plus most of them pay dividends", "score": 1, "replies": []}]}]}]}]}, {"body": "COVID COVID COVID, ain’t nothing big regarding clean tech and climate issues gonna get done till we nip the emergency we have now.", "score": 2, "replies": []}, {"body": "Well for Nio definitely hold cos earnings are coming up", "score": 2, "replies": [{"body": "I believe in NIO, even it is at the same price like in November, I'm still green on them", "score": 0, "replies": []}]}, {"body": "Jesus Christ. What you should do is delete this stupid shit", "score": 0, "replies": []}, {"body": "Practice the ways of the diamond handed you papyrus trading tard", "score": 1, "replies": [{"body": "💎🙌 for the win", "score": 0, "replies": []}]}, {"body": "Buy lithium miners", "score": 1, "replies": [{"body": "This and semiconductors", "score": 2, "replies": []}]}, {"body": "Put in more money and buy the dip", "score": 1, "replies": []}, {"body": "Smh man look stocks go up then they go down I’m guessing you bought them right before the election so guess what you were right they went up now they are going down just hold if you did your dd and they are good companies you should be fine not to mention most of those have been up 200+ percent in the past 5 months so I mean 15% really isn’t anything", "score": 1, "replies": []}, {"body": "Either hold or average down by buying more. This is just short term noise", "score": 1, "replies": []}, {"body": "It's been one month drive I started investing in a massive bull run and I'm down, please help.  Lol... Wait", "score": 0, "replies": []}, {"body": "Sell all that garbage! Quickly.   None of these will be back to the price now, likely ever.  Look at the PEG.  How many decades would it take to grow into their current valuation?  Even if you were right about the political push for green energy,  why would you expect residential solar to win vs utility scale? These are small companies doing well in small markets,  even if you're right about green energy AND you're right about residential,  why would you expect these companies to grow big enough to supply it?  Seems like a major like GE could quickly scale and undercut their price.   OBTW, the major companies that can quickly scale also have ways to talk directly to the government people.   I only did a very quick look,  but I didn't see any moat, no pattent or IP that protects them from competition.   Even then, is it wide enough that someone else doesn't find an unprotected way to do the same thing?   I say you should eat your losses now instead of bigger losses later.", "score": 0, "replies": []}, {"body": "You showed up to the party late and now you're annoyed everyone is leaving already.\n\nHere's the important question: did you go to the party because you really like the hosts and wanted to spend some time with them, or did you go just because other people were going?  Follow the metaphor?", "score": -2, "replies": [{"body": "It's a shitty metaphor. If the party is over, he should leave irrespective of why he went there.", "score": -1, "replies": [{"body": "It isn't perfect but it's hardly shitty.  But let me be more direct:\n\nDid you buy these stock just because everyone else was, or did you buy them because you believe in their long term prospects?", "score": 0, "replies": [{"body": "I don't need a response and this wasn't the metaphor. Party is short term.", "score": -1, "replies": [{"body": "Well you're a barrel of fun.", "score": 0, "replies": []}]}]}, {"body": "he could stay and get into the secret after party though! although it might be the feds", "score": 1, "replies": []}]}]}, {"body": "Buy coal and steel - how did you think all these windmills and batteries were going to be made?", "score": -6, "replies": [{"body": "Not with coal or steel.", "score": 0, "replies": [{"body": "Ahhhhh.....yes!  We are mining lithium with plastic spoons run off solar power, and erecting plastic turbine engines!", "score": -2, "replies": [{"body": "I see you stay true to your username. Good luck in life.", "score": 1, "replies": [{"body": "At least I am not lying to myself - good luck building high speed rail out of tofu and playdough!", "score": -1, "replies": []}]}]}]}]}, {"body": "Sell, so we can buy cheap.  :))", "score": -1, "replies": []}, {"body": "Tell us who else you're long on so we can inverse", "score": -1, "replies": []}, {"body": "Renewable energy and many more are taking a big hit right now. Don’t panic sell, hold and it will eventually go back up.", "score": 1, "replies": []}, {"body": "Are you confident they'll go back up? If so hold. If you think they will go down its better to sell. Its as easy as that!", "score": 1, "replies": []}, {"body": "A good rule of thumb when you dont know what to do, is to simply do nothing.", "score": 1, "replies": []}, {"body": "everyone thought they would go up and the buying started in november. if you waited until january, you bought into inflated values after the run up.\n\nbasically you have 2 choices\n\n1. sell at a loss because you think the gains aren't going to happen\n2. hold/add because you think the gains will still come and it's just not something that happens overnight but will take some time.", "score": 1, "replies": []}, {"body": "Sell everything.", "score": 1, "replies": []}, {"body": "Has the fundamentals of the companies changed? If not, then buy the dip. If their fundamentals have changed to the point where you no longer feel bullish on the company then sell and reallocate. \n\nPerhaps do better research next time too.", "score": 1, "replies": []}, {"body": "If you’re contemplating selling just because of a bad week you should probably invest in companies you have more faith in.", "score": 1, "replies": []}, {"body": "If you are down a lot just wait. Nothing good comes from taking a loss. I am in similar situation, but I guess most are. And I am in no hurry to lose my hard earned money because most people decided in February take a profit. I also invested in companies where I dont need to watch each day will they raise or not.", "score": 1, "replies": []}, {"body": "Sell.", "score": 1, "replies": []}, {"body": "I’ve lost $9000 since January 14 on the same stocks.", "score": 1, "replies": []}]}
{"title": "Today is the day to do your job with PLTR", "selftext": "I’ve been on this thread nonstop lately, advocating (don’t sue me ;)) y’all to get into this bad boy. The fundamentals are all there: a cutting edge tech unicorn with robust sales, earnings on deck, and unparalleled potential.\n\nThe ownership from institutions is otw as well. We all know Cathie Wood has tripled down in the last week, and recently, big banks like JP Morgan are confirming previous stakes in PLTR.\n\nThis is FB/GOOG in the waiting, but I believe it will soar like Tesla. Indeed, the monetary policy conditions right now are extremely conducive to mega cap tech companies getting grounded EXTREMELY FAST, see this provoking WSJ graphic on the topic \n\n(https://www.wsj.com/articles/how-tesla-made-it-to-the-winners-circle-11613739634?st=pkrws73wwocvyo8&reflink=article_imessage_share)\n\nI think PLTR’s days in the $20 range are numbered. One can hem about valuations all day, but tell me why obsolete Snowflake is trading at 80X sales, and we can have an intelligent discussion.\n\nIf we (the market not WSB) believe Tesla, Snowflake, and Shopify are not a joke, than PLTR is grossly UNDERVALUED. I have to imagine smart money isn’t too far behind my thinking.", "id": "lpr7bi", "created_utc": 1614008261.0, "score": 244, "upvote_ratio": 0.84, "num_comments": 97, "comments": [{"body": "Here's the funny thing. Folks always wanting to buy the dip, but when the dip comes they almost always chicken out. Well, dip is here. Will you buy or will you chicken out again? \n\nBuy 30%. If it dips again, buy 30% again. If it dips all the way to 25, enter with both fists. That's how you make money. \n\nNot financial advice. I'm just 🦍 in a forum. 💎✋", "score": 133, "replies": [{"body": "The problem is buying the dip when you already bought it a few times. Especially if you're dumb and the dip you bought expires.", "score": 24, "replies": [{"body": "I’ll ducking do it again", "score": 12, "replies": [{"body": "I’m with you. 30 contracts 35$ 3/19 and 5 c 35$ 2023", "score": 7, "replies": []}]}, {"body": "I've been buying dips for months, and it just keeps dipping.", "score": 4, "replies": [{"body": "Until the dip doesn’t dip anymore", "score": 3, "replies": []}]}]}, {"body": "Cowabunga it is\n\nPLTR 69$ 02/29", "score": 9, "replies": []}, {"body": "Got 100 more shares coming (a retarded CSP)", "score": 4, "replies": []}, {"body": "D.C.A. \n\nWhen you aren’t playing options or short term investing, down days are an opportunity", "score": 3, "replies": [{"body": "I just bought options. Just give yourself enough time for the run up. Not weeklies for sure unless you have 💎 balls.", "score": 3, "replies": [{"body": "Is one month sufficient?", "score": 1, "replies": []}]}]}, {"body": "Because those folks don’t believe in the fundamentals of the company, so I don’t blame them. I will average down because I do. Now average entry is around $27", "score": 1, "replies": []}, {"body": "I'm debating on if I should add to the $40 April calls that are currently getting raped.", "score": 1, "replies": [{"body": "April is kind of too short DTE. I think minimum May and ideally Sep or leaps.", "score": 1, "replies": []}]}]}, {"body": "Underrated, go for PLTR!", "score": 66, "replies": []}, {"body": "You retards are getting in t 27.80.  I'm waiting for 27.75.", "score": 46, "replies": [{"body": "Ha keep waiting", "score": 11, "replies": [{"body": "The casino keeps rolling", "score": 2, "replies": []}]}, {"body": "Retard checking in here. Bought 925 @ $27.27 after hours.", "score": 3, "replies": [{"body": "Could have waited another 12 hours, and cheaper for all.  They announced a bigger deal with 3M and still down.  Damn,", "score": 1, "replies": [{"body": "I know man, that's a tactical error on my part! One day I'll time the market right for once! Ahhh well, maybe next time!", "score": 3, "replies": []}]}]}, {"body": "![gif](emote|free_emotes_pack|facepalm) and ya 'coulda had 'em for $25 this AM", "score": 1, "replies": [{"body": "Stock Trading 101: Shoulda, coulda, woulda.  Just have your exit plan and stick to it.  Don't regret profits you could've had if you still get profits.", "score": 1, "replies": []}]}]}, {"body": "every other stock or option i have that dips i start second guessing myself. I don't bat an eye when PLTR dips, I have full faith in this baby. Karp take the wheel.", "score": 11, "replies": []}, {"body": "[deleted]", "score": 16, "replies": []}, {"body": "No, we believe snowflake is a joke.", "score": 27, "replies": [{"body": "Yeah teradata is way better", "score": 0, "replies": []}]}, {"body": "It is truly undervalued, people don't realize it yet.  21Jan 2022 $35c", "score": 7, "replies": []}, {"body": "I’m a believer. I averaged up with another 20k shares today. Long hold on 60k @ 26.37.  Roll tide and space nuggets 🚀🪐🤑✌️😎✌️", "score": 5, "replies": []}, {"body": "I bought the dip on PLTR because they finally delivered the free swag from that coupon code snafu they pulled a few months back. I felt like I owed it to them.\n\nEdit: just doubled up again.", "score": 7, "replies": []}, {"body": "Each day it’s under $30, I’m loading up. Using my wife’s boyfriend’s money. My child’s college fund. Skipping my dogs vet medication payments. Debated selling my car. The returns for this PLTR investment will be 10 fold, if not more.", "score": 6, "replies": [{"body": "Dude is your dog’s vet okay?", "score": 1, "replies": []}]}, {"body": "🛸pltr🛸", "score": 5, "replies": []}, {"body": "The Market is red relax and turn off your phone.", "score": 17, "replies": [{"body": "Turn off the phone? More like buy more.", "score": 34, "replies": []}, {"body": "Turn off the phone? I need it to ask my grandmother to take a loan out on her home cuz we’re going to the fucking moon 🚀", "score": 13, "replies": []}]}, {"body": "In 400 starter stonk pack", "score": 2, "replies": []}, {"body": "It will be that stock in 10 years you regret not buying", "score": 5, "replies": []}, {"body": "I am new to trading and do not know much about the DD of PLTR but I do know a lot about Eric Weinstein and he is a phenomenal thinker and mathematician. He works for Peter Thiel and have listen to them talk on Eric's podcast the Portal. The conversations are great so anything that they are involved in will win 100%. Will the stock blow up?  I am buying the in on the leadership. I am purchased a small position today 20 shares. Not a great trader but a full fucking retard BTW!", "score": 12, "replies": []}, {"body": "I am all in🚀🚀🚀🚀", "score": 3, "replies": []}, {"body": "Just grabbed 100 shares", "score": 3, "replies": []}, {"body": "Positions or ban.", "score": 8, "replies": []}, {"body": "Positions: (Calls) 4 contracts 2/26 $34 and 3 contracts 3/12 $48.50", "score": 2, "replies": [{"body": "Oof", "score": 3, "replies": []}, {"body": "I feel like that’s gonna hurt. Good luck to you.", "score": 3, "replies": [{"body": "Yes... yes it will", "score": 1, "replies": []}]}]}, {"body": "I transferred more money this morning to ride with the uranium gang but I think I'll just end up adding to my PLTR position", "score": 2, "replies": []}, {"body": "I totally agree. Also want to add to those saying \"it already had an insane run up since september!\", my argument is that they were priced at $7.50 and ended first trading day at $10. What we don't know is that their latest pre-dpo investment round valued them at like $11-15. So what we should recognize is that this stock was \\*under-hyped\\* upon going public. So $30 would've been the initial price if the stock went through an IPO. Thiel and Karp gave us the glorious chance for retail to get rich off of their company and yet we pussy out. Anything under $30 is a sale at \\*current\\* outlook. After couple years, or even quarters, of constant yoy growth and new contracts, we will wish we bought this under $30 like we wish we bought the stock under $20 couple months ago.", "score": 2, "replies": []}, {"body": "No disclaimers?  You’re advocating?  Are you a Financial Advisor w a Fiduciary Responsibility to your clients?  Think he’d about how you frame your posts", "score": 2, "replies": [{"body": "Dick move, but u right ig", "score": 3, "replies": [{"body": "He’s not right... its a board.  CNBC wouldn’t exist if he was lol... try identifying you for action.", "score": 7, "replies": []}]}]}, {"body": "Positions?", "score": 2, "replies": []}, {"body": "Lol!  How many times has the WSB crowd been burned by PLTR, and yet you go back?!?  Yall got some serious battered wife syndrome.", "score": -17, "replies": [{"body": "Its been publicly traded for like 4 months and is up 190%. The only people who have been burned are idiots. If you think this isn’t a good year long play, you are an idiot.", "score": 51, "replies": [{"body": "Exactly.\n\nCount on a future with MORE data mining and not on a future with less of it.  PLTR does some of the intense data mining and scraping that Google does, but then gives it over to government agencies.  You can definitely count on a future with more government overreach and not less.  PLTR for the long dystopian haul.", "score": 24, "replies": [{"body": "After a successful but stressful year trading while at work, I’ve taken my winnings and shoved them into a 100k plus pltr position. Trying to go pretty hands off for 2021 to save me from myself. Hopefully riding a company that i believe in... but kinda hate... to early retirement. Luckily it’s volatile enough to still get my gambling dick hard.", "score": 9, "replies": [{"body": "Anybody who knows/works in/works with the Fed or within the intelligence community would think it wise to buy up as much PLTR as possible. I bought a huge position at the IPO. It’s going to pay off.\n\nThe difference between PLTR and these other meme-stocks is that PLTR has a product that is actively used widely and developed continuously. It’s not going anywhere but up. That’s not an opinion. That’s a fact. Anybody who understands government/defense industry/intel community knows this.", "score": 6, "replies": []}, {"body": "Have fun zooming past Jupiter, my friend.", "score": 4, "replies": []}]}, {"body": "Palantir does not collect data itself. They sell software that consolidated and structures data their clients already possess.", "score": 2, "replies": []}, {"body": "To invest in a company totally devoted to evil (selling public information to the government) or not....\n\nNot saying anything on its profitability or long term outlook, just commenting on what it is this business is in the business of.", "score": 1, "replies": []}]}]}, {"body": "You're only burned if you bought at the top or played short term options. Most people haven't gotten burned at all.", "score": 15, "replies": []}, {"body": "You can say the same about Tesla at $60", "score": 15, "replies": []}, {"body": "You can just say “I got emotional and sold way to soon”", "score": 3, "replies": []}, {"body": "This sub got burned on Micron about 4 years ago and now it’s up because of chip shortage due to COVID19.", "score": 1, "replies": []}, {"body": "I'm up 40% on shares alone", "score": 1, "replies": []}]}, {"body": "PLTR is great on its own. But yesterday when I saw a post saying some rapper degenerate “lil food stamps” or whatever was “in it with us” I knew it was going to get killed at market open. I sold my gains and left the table. I’ll rebuy when it gets low enough. TY to the summer child who bought my options that are now worth half 🤣😂", "score": -14, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Yea I think it was $T not pltr lol", "score": 4, "replies": []}, {"body": "That post and the comments convinced me. I want to thank the OP.", "score": -16, "replies": []}]}, {"body": "It was $T not pltr, pltr was just a meme", "score": 6, "replies": [{"body": "The sentiment in the comments didn’t reflect it, when I read those it scared me straight. It gave me the much needed reminder that whatever tickets the GME and AMC cultists touch, they kill.", "score": -15, "replies": [{"body": "Both of those stocks are doing better now than they were before the \"GME and AMC cultists\" touched them.", "score": 2, "replies": []}]}]}, {"body": "“Lil food stamps” dude you’re a clown. Not even good at trolling. Stfu", "score": 2, "replies": []}, {"body": "He's worth more than you ever will be, and apparently he's smarter than you ever will be, since it wasn't even about PLTR. \n\nMaybe you should listen to his music more and wsb less.", "score": 5, "replies": [{"body": "Woah, easy there cupcake. You seem to be suffering from some unreturned male on male attraction to this guy. You are a special little donut to go full homo in public like that.", "score": -7, "replies": [{"body": "Ok, painfully single boomer.", "score": 4, "replies": [{"body": "Have you told your family yet about your attraction to hairy male buttholes?", "score": -4, "replies": [{"body": "Yikes", "score": 5, "replies": []}]}]}]}]}, {"body": "DV for ‘rapper degenerate’ lol", "score": 1, "replies": []}]}, {"body": "I'll buy more at 23. I think we have more downside. I bought more today and 29 but should have waited. I was foolish.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Perhaps you mean enable war crimes? Even that’s not  true but software doesn’t commit war crimes, your government/Military does. You should be mad at them if anything. It’s like getting mad at the quantum physicists because the government dropped nuclear bombs. Pretty ridiculous.", "score": 4, "replies": [{"body": "You could also argue that Palantir tech helps get only the bad guys so you are actually greatly reducing the “carpet bombing” if you know exactly where the one dude you want is.", "score": 4, "replies": [{"body": "I mean it’s also used domestically but whatever. I’m in.", "score": 2, "replies": []}]}, {"body": "Thank you so much! It’s because of the skill, not how it’s being applied. No need to denegrate/scapegoat talent, creativity, and innovation.", "score": 2, "replies": []}]}]}, {"body": "Pltr is trash", "score": -6, "replies": [{"body": "Lol. Told you Palantir was trash.", "score": 1, "replies": []}]}, {"body": "Yolo'd what I had left from my GME losses into buying my first option got 29.50 call 3/05 wish me luck.", "score": 1, "replies": []}, {"body": "buy shares or LEAPs and you're just about guaranteed to exceed the market", "score": 1, "replies": []}, {"body": "bought in @ $36, doubled down at this morning @ $25", "score": 1, "replies": []}]}
