{"title": "AMC, GME, BB and some others - It’s NO COINCIDENCE that the stock that were trending since GME explosion are being manipulated since last week. DO NOT FEAR! HOLD AND BUY!", "selftext": "Everyone,\n\nDo not fear and panic sell. If you pay attention to most stocks trending on WSB, they were moving up and down simultaneously. When GME was down like 100 points AMC was down 10 points and BB 7 points. When GME moved up a little bit AMC, BB would also move up. Wall Street is trying to get you to Sell after a big dip and a little recovery. Psychologically they WANT TO. Scare you\n\nsince last week being manipulated by Wall Street. \n\nWith the restriction of how much you can buy is restricting your gains and causing you manipulated losses. YOU ONLY LOSE IF YOU SELL!\n\nTIME is the enemy for Wall Street because they can continue restricting purchase and manipulating the price down but they still have to cover and pay interest \n\nWith the restrictions of how much you can purchase, I would load up on GME first and then AMC. Or whatever you can get your hands on\n\nJUST HOLD AND BUY! We are going to 🚀🚀🚀🚀🚀🚀🚀🌕", "id": "la6i4t", "created_utc": 1612195328.0, "score": 847, "upvote_ratio": 0.99, "num_comments": 93, "comments": [{"body": "Hold that shit $BB is about to take the fuck off I’ll buy more I’m making a statement against the short selling fucks bc I’m a retard w/a plan", "score": 113, "replies": [{"body": "Same", "score": 26, "replies": []}, {"body": "Bought 50 more shares at the dip, bb to the moon.", "score": 23, "replies": [{"body": "Also bought more!  What a sale for BB!", "score": 16, "replies": []}]}]}, {"body": "GME for the moneybag players in this and BB for the less fiscally gifted...Especially if you're using a platform that is restricting fractional share purchases. \n\n&#x200B;\n\nI'm going full speed into BB while it's still low!", "score": 55, "replies": [{"body": "[deleted]", "score": 26, "replies": [{"body": "Math? Don't force your witchcraft on others, please lol", "score": 16, "replies": [{"body": "[deleted]", "score": 12, "replies": []}]}]}]}, {"body": "BB is taking off catch it while you can 🚀🚀🚀🚀🚀🚀🚀", "score": 35, "replies": [{"body": "Got my tickets for 16CAD each.", "score": 8, "replies": []}, {"body": "60 shares @ 15$", "score": 3, "replies": []}]}, {"body": "Are there tweets I can fav and RT to get more people in?", "score": 11, "replies": []}, {"body": "Holdddddd", "score": 12, "replies": []}, {"body": "I bought AMC this morning and it's dying 😭\n\nHope theres some spare GME 🚀 fuel for AMC soon!", "score": 13, "replies": [{"body": "It's not dying! Did you buy in at 17 or something?", "score": 14, "replies": [{"body": "Yeah, bought on market open and all downhill from there 😭", "score": 9, "replies": [{"body": "2017 they were over 30...   just hold!  Even if they don't take off this week they're still a good company and the movie markets are going to go crazy once more people are vaccinated this year because we're all desperate to get out.", "score": 5, "replies": [{"body": "I bought Into Star Citizen, so I know how to wait.\n\nLol.", "score": 1, "replies": []}]}]}]}]}, {"body": "If anyone is worried go look at Volkswagen short squeeze on Google pictures. MASSIVE dip right before squeeze", "score": 6, "replies": []}, {"body": "HOLD THRU THE DIP!", "score": 7, "replies": []}, {"body": "I think it’s the hedge funds and big cats trying to trigger a sell off. They probably care carrying puts thinking no way we can hold.", "score": 4, "replies": []}, {"body": "BB is going of rn🚀🚀🚀", "score": 8, "replies": [{"body": "It was a beautiful sight to see. Then once it hit 15.3 the hedge funds realized and started messing around with the price again.", "score": 3, "replies": []}]}, {"body": "Once everyone is done with GME, BB is next 🚀🚀🚀🚀🚀🚀🚀 $100 PT", "score": 12, "replies": []}, {"body": "Have $2K in AMC and not fucking selling!", "score": 2, "replies": [{"body": "whoever does now, is completely retardet, amc has great squeeze potential", "score": 2, "replies": []}]}, {"body": "🐍 ain’t shit \n💎🙌🏼 gang", "score": 2, "replies": []}, {"body": "Consider focusing only on GME. Don't let the collective buying power get spread to thin with alternative stocks\n\nWhile there is a high short interest in both GameStop and AMC, it's way more plausible that GameStop is the one going into a short squeeze. The AMC short interest isn't quite on the levels needed for that. Sure, it follows the GameStop chart as of now. But when the squeeze happens and GameStop goes to the moon, it will leave AMC somewhere along   stratosphere.\n\nIt is hurting the cause if we have this kind of civil war regarding GameStop and AMC.\n\nLet's focus our efforts on GameStop only, making the end goal so much more realistic.", "score": -14, "replies": [{"body": "Couldn't afford GS. Put a little in AMC stop trying to make me miss the moon.", "score": 20, "replies": [{"body": "I heard there’s a job opportunity behind Wendy’s for GME share money", "score": 3, "replies": []}]}, {"body": "I’m broke so I buy AMC", "score": 8, "replies": []}, {"body": "With the restriction of how much you can purchase we are not dividing. If you are only allowed to buy 5 shares of GME and still have money. Why would you just sit and wait. The game is since Wall Street is playing dirty, then make them bleed. \nI’m purchasing GME and AMC because I’m being restricted how much I can get.", "score": 8, "replies": []}, {"body": "The problem with that is GME is so high now that the little guys (like me) can't afford to help.  But we can snag some AMC and hold.  Its not much, but we want to help!", "score": 6, "replies": []}, {"body": "Everyone wanted the squeeze and got it. Now are content to ride the stock into the ground rather than take profits and hammer the next one. Even if they guild forever I’ll quintuple their profits by moving on. Good luck. Money is more important than upvotes", "score": 0, "replies": []}]}, {"body": "I think I’m in love with these stocks. Hold and buy", "score": 1, "replies": []}, {"body": "How fucked are my end of week 19 dollar calls", "score": 1, "replies": [{"body": "Hard to tell. With these illegal manipulation. Of wallstreet it’s better to buy stock. You can also look up the class action and submit your losses.", "score": 3, "replies": []}]}]}
{"title": "I think that the Silver hate is actually what they are looking for. Here me out before you nuke me.", "selftext": "Preface: BUY GME DONT SELL HOLD AND FUCK CITADEL.\n\nI am not preaching for people to buy into paper silver stocks. The criticism that the market is too big to be influenced is correct. There are way more paper silver shares in circulation than there is physical silver to back it up.   \n\n\nI hope you all realize that the Hedgies understand that this sub will have an adverse reaction to anything they do to try and move people off of GME. They understand that promoting silver will get the reaction that it currently is: people saying that silver is a trick and to forget about it. \n\nPaper silver shares are not the move, obviously, but Silver still has the potential to be the next big move if we approach it correctly. EMPHASIS ON NEXT\\* DO NOT SELL GME OR MOVE INTO THIS POSITION UNTIL THIS WAR IS OVER.\n\nIf people start buying physical silver and demanding delivery of their paper shares, it will result in devastation for the Hedgies and Big Banks. This is why they are pushing paper shares so hard to get WSBs to call off the dogs on silver all together. Don't underestimate your enemy, they understand what reactions their actions will get.   \n\n\nSilver can be the bullet that pops the everything bubble, but it needs to be done in a specific way. If the tutes that are trading all these paper shares that represent far more silver than actually physically exists, then demanding delivery will force them to pay any price to get the material. If the retail market is buying up that physical stock before that happens, they are fucked,   \n\n\nThis is still the long play imo, but I have been in this space for many many years. It is a solid investment regardless of what the outcome is in terms of damage to the tutes. It could be the best next move in this war, but we will see. I am long silver, but I am a physical collector. I think the anti silver hype that has gained traction here is exactly what they are after.   \n\n\nMy suggestion is that we just ignore silver all together for now, but don't forget about it when the GME stage finally resolves. That is what they want. Let's win this GME short squeeze before we promote any other moves, but be extra vigilant of any moves they are making through their media cronies. They are learning what their actions result in, and they will use that to manipulate you away from the things they don't want you focusing on. I truly believe this is a fake out, and we are giving them the reaction they desire by killing any and all moves into the PM space.   \n\n\nThats just my opinion though. Do as you see fit. GME to Pluto. GG NO RE", "id": "la74lm", "created_utc": 1612196813.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 87, "comments": [{"body": "You can tell silver is BS because there's like 5 major stations reporting that everyone on reddit is moving to silver when literally noone on reddit is talking about silver. Like where are these reports coming from? lol", "score": 118, "replies": [{"body": "There are 2 sources/posts the news keeps using, one of them was from 4 days ago that got a lot of action and one I don’t remember when that is deleted now.", "score": 14, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "We're speaking the language of the gods 🚀", "score": 2, "replies": []}]}, {"body": "Last week when people were posting the DD on silver. Shit looked good and there was interest. Theres so many idiots on here preaching every stock, thinking pump and dump is just a normal thing, and the papers are grabbing anything that will catch people's attention. Honestly, yeah I got into silver, I got a return already. \n\nThere are other stocks in the world other than the BANG gang", "score": 8, "replies": [{"body": "Silver might be good but not squeezable. Boomer good in other words. But anything boomer good can come after GME. HOLD", "score": 1, "replies": []}]}]}, {"body": "Guys its possible that physical silver is a good play AND they are shilling silver and SLV right now to distract us. \n\nThey can both be true.", "score": 20, "replies": [{"body": "Exactly. I think people are underestimating the enemy right now. They know what we are watching, and understand what our reactions will be. We need to 6-D chess this or we will be divided and lose.", "score": 10, "replies": [{"body": "Agreed. They probably are trying to capitalize on all the actual silver DD out there, telling everyone that SLV will do the squeeze and cause the change and give the tendies. Hoping we just toss into it without actually understanding whats going on, then it turns into a pump and dump, and they make SLV bank.\n\nWould be the height of irony though if after gme, apes actually crashed the silver market because of this.", "score": 3, "replies": []}]}, {"body": "Thiiiiiis. \n\nSilver/SLV/Miners are a good play. Infinite QE is good for metals pricing.\n\nAnyone who's paying attention has seen the $40 silver rounds on eBay. The paper will follow, it always does.\n\nEdit: It's a LEAP play though. No fucking FDs on SLV you morons.", "score": 0, "replies": []}]}, {"body": "I think the key with silver is to actually but physical silver and not the paper hedgies are holding. But I'm just a retard.", "score": 27, "replies": []}, {"body": "doesn't citadel have huge stakes in silver", "score": 22, "replies": [{"body": "Yes, paper shares. That is what I am saying. Im not saying to get into paper shares. I am saying that physical silver still has the potential to be a big move AFTER the GME stuff resolves.", "score": 12, "replies": []}]}, {"body": "just saying, there was NO search interest for Silver until AFTER all the MSM news started reporting about it, its a totally planted non-story:\n\nhttps://trends.google.com/trends/explore?date=now%207-d&geo=US&q=gamestop%20stock,amc%20stock,gme%20stock,apple%20stock,silver\n\nso do what you will, but realize we're only talking about it at all because THEY wanted us to. big distraction.", "score": 28, "replies": [{"body": "Right, the boomers are probably why. They get their news from msm.   \n\n\nI am not saying to buy paper shares. I am saying that physical still has potential to be a good next move. I think that the MSM attention being manufactured is specifically to get this community out of both the paper and physical PM space.", "score": 5, "replies": []}]}, {"body": "I'm convinced they are hawking silver cause if avg person googles \"Reddit\" \"silver\" they will be flooded with hits making people think \"Silver\" is the next Reddit meme.\n\nThey picked something theres already a reddit meme on and are calling it the next memestonk.\n\nIts actually rather clever subterfuge.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 40, "replies": [{"body": "Do you want the hedgies to lose money or lose everything? This is a war us retards need to open our eyes to what we’ve unleashed", "score": 7, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "You literally explained what I mean, this is an unprecedented time in wall street and the economy. Regulations haven’t caught up with the times", "score": 4, "replies": [{"body": "The White House just said they support congress on regulations. Where the hell else did I explain ‘exactly’ what you mean? The bit where I said we all go to jail?", "score": 1, "replies": []}]}]}]}, {"body": "I like GME too. I also like Physical silver. It is still a good move IMO, and the hate on WSB is being purposely manufactured by these big boy hedgies specifically to throw people off that path.   \n\n\nAgain, I am not pushing people to buy slv or other paper silver shares. I think that is dumb.", "score": 2, "replies": [{"body": "I’ve owned silver physical and paper for years. Definitely a good bet for risky future markets.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "\"Silver is held by some of the most powerful institutions\" this is why you should buy silver. Monkey see monkey do.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}, {"body": "Physical silver could easily be a bigger bag than GME if it ever is allowed to adjust to its fair value. It hit $50 in 2011 and 1980. Adjusted for inflation it should be around $580 right now. \n\nIt is the most heavily suppressed asset on earth for a reason. If it is allowed to balloon up to it's true value, it will crash the global market. This will happen one day regardless, but this retail swell could be the oppertunity for people to force it now and come out the other side with some actual wealth. \n\nAgain, who the hell knows. I am long physical silver and have been for years. I just think this anti-silver movement in the sub is exactly what they were trying to do.\n\nThey make a killing short term by pumping up the paper silver stocks like SLV, but also drive people away from the metal all together, keeping their bubble inflated and the wealth in the pockets of the billionaire hedgies.", "score": 1, "replies": []}]}]}, {"body": "Sounds like something a short seller would say....", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Hey we all gotta start somewhere right? Don’t be so sensitive! It was just for the lolz\n\nEdit: wow this comment got reported for violating rules on vote manipulation. You really are sensitive af. Lmao", "score": 1, "replies": []}]}]}]}, {"body": "Not a financial advisor. For real.", "score": 4, "replies": []}, {"body": "“Here me out”. Lol you got the big dumb!", "score": 11, "replies": [{"body": "Here me in then bb.   \n\n\nIm r-worded. Do you expect me to type goodly 100% of the time?", "score": 3, "replies": []}]}, {"body": "Silver hate?\n\nSilverlake Capital!", "score": 2, "replies": []}, {"body": "Yeah silver is actually a good play but not right now when we trying to squeeze GameStop for everythjng it’s worth.", "score": 6, "replies": []}, {"body": "Im trying to sell my physical silver to buy more GME of The dip. Im retarder. Entertained only. Be like me. Retard.\n\nNot a broker and not advice. Only simple monke", "score": 1, "replies": [{"body": "I think if you hold your physical, you'll be able to buy more GME. It is legit undervalued.", "score": 3, "replies": []}]}, {"body": "OP first started commenting with his/her Reddit account five days ago, around the time we all first heard “Silver is the next big thing”\n\nI don’t have positions in this war, but don’t be fooled by accounts like these y’all.", "score": -1, "replies": [{"body": "I've been on WSB for years idiot. My account is years old, and I have other that have been subbed before we had 1mil subs. My last posts were that long ago because I was banned for talking about BNGO when it was a penny.\n\nI made 1000% gains on BNGO btw, so I stand by my position on it.\n\n&#x200B;\n\ni have been actively posting on this account for years. I'm not a bot or a shill. You are getting paranoid and that is exactly what they are after", "score": 7, "replies": [{"body": "You must be logged into the wrong account then because this one has a post history that ends five days ago and it’s only a two year old account.", "score": -1, "replies": [{"body": "Maybe you can only see 5 days of activity, but i have been using this account daily for months. \n\nHead over to the BNGO subreddit and everyone in the lounge will confirm that. \n\nI was posting in the daily discussion multiple times a day in WSB well over a month ago.\n\nIf you can't see that far back, I have no idea why. I assure you though, I have been on this sub for nearly a decade across multiple accounts. This is just the one that I have been using the past couple years. \n\nNot shilling, not suggesting moves. Just pointing out that this reaction might be exactly what they are after, and that we should be smarter in our criticisms of things they are pushing considering they know that is exactly what will happen when they push something.", "score": 3, "replies": []}]}]}]}, {"body": "2/26 SLV 27.5 Put", "score": 0, "replies": []}, {"body": "YOU CANNOT SHORT SILVER", "score": -1, "replies": []}, {"body": "20lbs in my basement come fuckin get it hedges. I got a 5.7 for ya too.", "score": 1, "replies": []}]}
{"title": "What’s happening to GME?", "selftext": "Credit to: u/that-possible-2402\n\nWhat’s Happened the Past Few Days?: The Anatomy of a Short Ladder Attack\n\nPublished courtesy of Citizens for Securities Reform, at http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html\n\nAbusive shorting are not random acts of a renegade hedge funds, but rather a coordinated business plan that is carried out by a collusive consortium of hedge funds and prime brokers, with help from their friends at the DTC and major clearinghouses. Potential target companies are identified, analyzed and prioritized. The attack is planned to its most minute detail.\n\nThe plan consists of taking a large short position, then crushing the stock price, and, if possible, putting the company into bankruptcy. Bankrupting the company is a short homerun because they never have to buy real shares to cover and they don't pay taxes on the ill-gotten gain.\n\nWhen it is time to drive the stock price down, a blitzkrieg is unleashed against the company by a cabal of short hedge funds and prime brokers. The playbook is very similar from attack to attack, and the participating prime brokers and lead shorts are fairly consistent as well.\n\n\nTypical tactics include the following:\n\nFlooding the offer side of the board - Ultimately the price of a stock is found at the balance point where supply (offer) and demand (bid) for the shares find equilibrium. This equation happens every day for every stock traded. On days when more people want to buy than want to sell, the price goes up, and, conversely, when shares offered for sale exceed the demand, the price goes down.\n\nThe shorts manipulate the laws of supply and demand by flooding the offer side with counterfeit shares. They will do what has been called a short down ladder. It works as follows: Short A will sell a counterfeit share at $10. Short B will purchase that counterfeit share covering a previously open position. Short B will then offer a short (counterfeit) share at $9. Short A will hit that offer, or short B will come down and hit Short A's $9 bid. Short A buys the share for $9, covering his open $10 short and booking a $1 profit.\n\nBy repeating this process the shorts can put the stock price in a downward spiral. If there happens to be significant long buying, then the shorts draw from their reserve of \"strategic fails-to-deliver\" and flood the market with an avalanche of counterfeit shares that overwhelm the buy side demand. Attack days routinely see eighty percent or more of the shares offered for sale as counterfeit. Company news days are frequently attack days since the news will \"mask\" the extraordinary high volume. It doesn't matter whether it is good news or bad news.\n\nFlooding the market with shares requires foot soldiers to swamp the market with counterfeit shares. An off-shore hedge fund devised a remarkably effective incentive program to motivate the traders at certain broker dealers. Each trader was given a debit card to a bank account that only he could access. The trader's performance was tallied, and, based upon the number of shares moved and the other \"success\" parameters; the hedge fund would wire money into the bank account daily. At the end of each day, the traders went to an ATM and drew out their bribe. Instant gratification.\n\nGlobal Links Corporation is an example of how wholesale counterfeiting of shares will decimate a company's stock price. Global Links is a company that provides computer services to the real estate industry. By early 2005, their stock price had dropped to a fraction of a cent. At that point, an investor, Robert Simpson, purchased 100%+ of Global Links' 1,158,064 issued and outstanding shares. He immediately took delivery of his shares and filed the appropriate forms with the SEC, disclosing he owned all of the company's stock. His total investment was $5205. The share price was $.00434. The day after he acquired all of the company's shares, the volume on the over-the-counter market was 37 million shares. The following day saw 22 million shares change hands - all without Simpson trading a single share. It is possible that the SEC has been conducting a secret investigation, but that would be difficult without the company's involvement. It is more likely the SEC has not done anything about this fraud.\n\n\nMassive counterfeiting can drive the stock price down in a matter of hours on extremely high volume. This is called \"crashing\" the stock and a successful \"crash\" is a one-day drop of twenty-percent or a thirty-five percent drop in a week. In order to make the crash \"stick\" or make it more effective, it is done concurrently with all or most of the following:\n\nMedia Assault -\n\nThe shorts, in order to realize their profit, must ultimately put the victim into bankruptcy or obtain shares at a price much cheaper than what they shorted at. These shares come from the investing public who panics and sells into the manipulation. Panic is induced with assistance from the financial media.\n\nThe shorts have \"friendly\" reporters with the Dow Jones News Agency, the Wall Street Journal, Barrons, the New York Times, Gannett Publications (USA Today and the Arizona Republic), CNBC and others. The common thread: A number of the \"friendly\" reporters worked for The Street.com, an Internet advisory service that short hedge-fund managers David Rocker and Jim Cramer owned. This alumni association supported the short attack by producing slanted, libelous, innuendo laden stories that disparaged the company, as it was being crashed.\n\nOne of the more outrageous stories was a front-page story in USA Today during a short crash of TASER's stock price in June 2005. The story was almost a full page and the reporter concluded that TASER's electrical jolt was the same as an electric chair - proof positive that TASERs did indeed kill innocent people. To reach that conclusion the reporter over estimated the TASER's amperage by a factor of one million times. This \"mistake\" was made despite a detailed technical briefing by TASER to seven USA Today editors two weeks prior to the story. The explanation \"Due to a mathematical error\" appeared three days later - after the damage was done to the stock price.\n\nJim Cramer, in a video-taped interview with The Street.com, best described the media function:\n\nWhen (shorting) ... The hedge fund mode is to not do anything remotely truthful, because the truth is so against your view, (so the hedge funds) create a new 'truth' that is development of the fiction... you hit the brokerage houses with a series of orders (a short down ladder that pushes the price down), then we go to the press. You have a vicious cycle down - it's a pretty good game.\n\nThis interview, which is more like a confession, was never supposed to get on the air; however, it somehow ended up on YouTube. Cramer and The Street.com have made repeated efforts, with some success, to get it taken off of YouTube.\n\n\nAnalyst Reports -\n\nSome alleged independent analysts were actually paid by the shorts to write slanted negative ratings reports. The reports, which were represented as being independent, were ghost written by the shorts and disseminated to coincide with a short attack. There is congressional testimony in the matter of Gradiant Analytic and Rocker Partners that expands upon this. These libelous reports would then become a story in the aforementioned \"friendly\" media. All were designed to panic small investors into selling their stock into the manipulation.\n\nPlanting moles in target companies -\n\nThe shorts plant \"moles\" inside target companies. The moles can be as high as directors or as low as janitors. They steal confidential information, which is fed to the shorts who may feed it to the friendly media. The information may not be true, may be out of context, or the stolen documents may be altered. Things that are supposed to be confidential, like SEC preliminary inquiries, end up as front-page news with the short-friendly media.\n\nFrivolous SEC investigations -\n\nThe shorts \"leak\" tips to the SEC about \"corporate malfeasance\" by the target company. The SEC, which can take months processing Freedom of Information Act requests, swoops in as the supposed \"confidential inquiry\" is leaked to the short media.\n\nThe plethora of corporate rules means the SEC may ultimately find minor transgressions or there may be no findings. Occasionally they do uncover an Enron, but the initial leak can be counted on to drive the stock price down by twenty-five percent. The announcement of no or little findings comes months later, but by then the damage that has been done to the stock price is irreversible. The San Francisco office of the SEC appears to be particularly close to the short community.\n\nClass Action lawsuits -\n\nBased upon leaked stories of SEC investigations or other media exposes, a handful of law firms immediately file class-action shareholder suits. Milberg Weiss, before they were disbanded as a result of a Justice Department investigation, could be counted on to file a class-action suit against a company that was under short attack. Allegations of accounting improprieties that were made in the complaint would be reported as being the truth by the short friendly media, again causing panic among small investors.\n\nInterfering with target company's customers, financings, etc. -\n\nIf the shorts became aware of clients, customers or financings that the target company was working on, they would call and tell lies or otherwise attempt to persuade the customer to abandon the transaction. Allegedly the shorts have gone so far as to bribe public officials to dissuade them from using a company's product.\n\n\nPulling margin from long customers -\n\nThe clearinghouses and broker dealers who finance margin accounts will suddenly pull all long margin availability, citing very transparent reasons for the abrupt change in lending policy. This causes a flood of margin selling, which further drives the stock price down and gets the shorts the cheap long shares that they need to cover. (Click here for more on Pulling Margin).\n\nPaid bashers -\n\nThe shorts will hire paid bashers who \"invade\" the message boards of the company. The bashers disguise themselves as legitimate investors and try to persuade or panic small investors into selling into the manipulation. (Click here for Confessions Of A Paid Stock Basher).\n\nThis is not every trick the shorts use when they are crashing the stock. Almost every victim company experiences most or all of these tactics.\n\nHow Pervasive Is This?\n\nAt any given point in time more than 100 emerging companies are under attack as described above. This is not to be confused with the day-to-day shorting that occurs in virtually every stock, which is purportedly about thirty percent of the daily volume.\n\nThe success rate for short attacks is over ninety percent-a success being defined as putting the company into bankruptcy or driving the stock price to pennies. It is estimated that 1000 small companies have been put out of business by the shorts. Admittedly, not every small company deserves to succeed, but they do deserve a level playing field.\n\nThe secrecy that surrounds the shorts, the prime brokers, the DTC and the regulatory agencies makes it impossible to accurately estimate how much money has been stolen from the investing public by these predators, but the total is measured in billions of dollars. The problem is also international in scope", "id": "lagzcz", "created_utc": 1612220704.0, "score": 345, "upvote_ratio": 0.95, "num_comments": 89, "comments": [{"body": "TL;DR fuck the shorts", "score": 110, "replies": []}, {"body": "So basically, they are trying to perform an ultimate attack on us. Combined with all weapons they have to push this below their entry so they can cover, right?\n\nAaaand... The better question of all, I know the answer to already yes, why does nobody fucking do anything about it? Money.\n\nGod I hate the world sometimes lol", "score": 47, "replies": []}, {"body": "So its basically saying these short ladder attacks have a 90% success rate, well these hands have a 100% chance of holding fucking diamonds and touching the moon baby 🚀🚀🚀🌝", "score": 43, "replies": []}, {"body": "$10,000 NOT A MEME", "score": 72, "replies": []}, {"body": "Dang... what a dip! 🤑🤑🤑", "score": 71, "replies": []}, {"body": "Yeah💎👐🚀🚀🚀🌑", "score": 25, "replies": []}, {"body": "Instructions unclear, dick stuck in 💎✋🚀🪐", "score": 45, "replies": []}, {"body": "Good god. You probably got carpel tunnel from writing all that you retard.", "score": 54, "replies": []}, {"body": "[deleted]", "score": 38, "replies": [{"body": "y’all gon leave wsb too?", "score": -1, "replies": [{"body": "No", "score": 1, "replies": []}]}]}, {"body": "I’ve got 2 shares of GME at an average of 294.50.  The stonk can go up or down. I don’t care. It’s mine. I bought it. Money well spent. How do you go about getting a physical certificate?", "score": 11, "replies": []}, {"body": "To the moons of alpha centauri 🖐💎🖐💎", "score": 11, "replies": []}, {"body": "Looks its this simple. Billionairs tears + reddit pressure  = 💎 ✋ 🚀 🌙", "score": 20, "replies": []}, {"body": "Unlike hedge funds who can't let their investors go broke, I and only I own GME. Bring it on, I am not blinking here", "score": 9, "replies": []}, {"body": "Can someone confirm if HF's need to buy shares tomorrow for the contracts expiring ITM on Friday? I've heard they likely hedged most of their positions but were maybe not expecting to have to cover the 300-325 options that expired ITM within the last 15 minutes of trading.", "score": 14, "replies": [{"body": "Following", "score": 2, "replies": []}]}, {"body": "Nice summary.\n\nToo bad it's not long enough.", "score": 13, "replies": [{"body": "GME TO THE MOON🚀\n\nThats as long as it needs to beeeee", "score": 10, "replies": []}]}, {"body": "Way to go my 🦍 friends!\n\nGreat synopsis of this situation. \n\nGME 🚀🚀🚀\n\ndiamond  fucking hands!!! 💎👋💎👋💎👋\n\nDO NOT SELL..... EVER", "score": 5, "replies": []}, {"body": "the squeeze is being squoze", "score": 21, "replies": []}, {"body": "So what do we do?\n\nHolding without buying lets the price freefall.  Retail buyers are going to run out of money and new people aren't going to come on board if the media constantly lies to them. Other long hedgefunds don't want to get into a protracted battle when there is easier money to move made elsewhere.\n\nYeah they are paying interest the longer it takes them to unwind, buy I imagine at this point they'd be happy to take a painful but manageable loss over one that'll bankrupt them. Why wouldn't they keep pushing the price down, covering a percent of shares, then push it down again and repeat? Are the rates they are paying really that high?", "score": 5, "replies": []}, {"body": "GME IS NOT LIKE THE OTHERS", "score": 3, "replies": []}, {"body": "Here’s the thing. They did -140% once. Will they just do -infinite and fuck us all so hard we wish we never tried?", "score": 3, "replies": []}, {"body": "Sir this is a cuckold fetish forum", "score": 3, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Fucking read them.", "score": 15, "replies": []}]}, {"body": "Brain no understand. Will my overdraft fees be covered? Moon and gem hands etc", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}, {"body": "Short interest is 39% of shares.", "score": -15, "replies": [{"body": "Short interest is about to eat a bag of tendies w some hedge fund blood soon", "score": 10, "replies": []}, {"body": "VW was lower during its squeeze", "score": 2, "replies": [{"body": "Never said it wasn’t!  Why am I being downvoted for saying facts?", "score": 2, "replies": [{"body": "Idk I think a lot of people don’t realize 30% and more is still a lot", "score": 2, "replies": [{"body": "It’s huge. Just gotta keep a close eye on it. There’s a flurry of 800c for Friday and 3/19. There’s a reason for that.", "score": 3, "replies": []}]}]}]}]}]}
