{"title": "Why such a sudden hate for ARKK?", "selftext": "I got to know about ARK ETFs through this sub few months ago when everyone had only good things to say about ARKs. Since this dip started, I'm seeing more people talking about getting out of ARK or buying stocks that ARK funds hold instead of buying the ETF itself.\nDid something happen recently that I missed? \nI'm asking this because I got in ARKK few days ago at $150 and right after that I saw all the post and comments about how ARKK is a \"Tesla ETF\" and not to trust Cathie Wood.\n\nI'd love to know your thoughts on it.\n\nEdit: Plan to hold and keep buying atleast 4 years", "id": "lrpim1", "created_utc": 1614207331.0, "score": 66, "upvote_ratio": 0.89, "num_comments": 91, "comments": [{"body": "No one hates the ark funds. \n\nThere is a strategy to buy/sell whatever Cathy does that you like and avoid the expense ratio that way, however the benefit of having the entire etf is less volatility.  \n\nThis pullback is healthy considering how far and fast the upside moves have been. If you hold the arks and are in for the long run, just relax and/or buy more.  \n\nUntil she and her crew do something to justify skepticism I see no reason to be worried.", "score": 79, "replies": [{"body": "That's a shit strategy, by the time you hear about it the price is going to be far higher.", "score": -21, "replies": [{"body": "They show their daily buys and sells, you don't miss much if you're quick to the info. \n\nI'm not saying its a good or bad strategy,  there's an argument to both sides", "score": 13, "replies": []}]}]}, {"body": "Because reddit is full of a bunch of emotional children that don't actually know shit and just follow trends. \n\nSome have an issue with her religion.. grow the fuck up if someone else's religion bothers you. \n\nSome have an issue because price dropped.. these aren't the people you want to take advice from. Those are the same people that praised her and said she was amazing because of great success last year. Markets fluctuate, chill the hell out. \n\nIf you would invest in companies ARKK is invested in, it's a good ETF for you because you don't have to manage it. If you think the weighting if certain stocks are to high, then invest in something else.", "score": 103, "replies": [{"body": "ARKK had 150% last year. I love the etf but if expected those returns every year I quit my job. If she can pull off 50% this year I’ll be more then happy", "score": 17, "replies": [{"body": "Or 20% . Set your expectations a little lower and you won't be disappointed.  15 to 20% returns are great returns!  The kids today are spoiled.  No wonder we're in a bubble!!", "score": 16, "replies": [{"body": "That’s true, I just think it’s gonna be another bull year. But yes I’d take 15% returns and be happy. But in a bull market, in a high risk etf I’d like more.", "score": 5, "replies": [{"body": "Yep but we taketh what the market giveth.", "score": 2, "replies": []}]}]}]}, {"body": "Emotional child checking in. ARK is by design tech heavy and we saw a large pull back in the tech sector at the beginning of the week. Some would argue ARK is tesla heavy and TESLA took a big hit and received some negative press. It should be expected that a tech ETF will mirror market moves in the tech sector. You also need to consider that ARK is young in the ETF game and so Cathy hasn't built up that long term trust with the ETF investment crowd just yet. Do your research, read the literature, examine the holdings and make your own decision. If you get hungry try the red crayon.\n\nEdit for spelling", "score": 7, "replies": []}, {"body": "I have an issue with the religion (seen it do a lot of harm)... but none at all with that being her religion. It’s irrelevant anyways. People can believe in whatever they want. And the ARK funds are great.", "score": 3, "replies": []}, {"body": "> Some have an issue with her religion.. grow the fuck up if someone else's religion bothers you.\n\nIt also has little bearing on her ability to perform professionally. A passing student of economic history would know that some of the most wildly successful industrialists and financiers in the past were *very* devout Christians. So much so that there are theories (debatable theories, but at least serious ones) out there [about the connection between the two.](https://en.wikipedia.org/wiki/The_Protestant_Ethic_and_the_Spirit_of_Capitalism)", "score": 2, "replies": []}, {"body": "It’s hard to trust someone who believes in what many believe is bullshit to make smart decisions with their money. Also she’s a huge hypocrite for being a Christian and saying the ARK funds are her purpose from god and focusing on gene editing and AI, which is basically humans “playing god”. So you’re devoutly Christian and love focusing on making as much money as possible, gene editing, and AI? I mean the money one doesn’t surprise me, but its still hypocritical as hell", "score": -22, "replies": [{"body": "I personally know multiple religious folk who work in biosciences. I know religious folk in tech.My mind can't comprehend the disconnect between logical professions and faith. But, these people are good at their jobs. Until Kathie storms the Capitol, she's alright by me.", "score": 17, "replies": [{"body": "I can understand. There’s smart Christians and Christian scientists even though it makes zero sense. For me, i’ve made my mind up i don’t think it’s a big enough deal for me to change sentiment about her and the funds", "score": 1, "replies": [{"body": "I don’t look at the people who have done a 180 on her just because she’s religious any differently than religious bigots. They’re doing the exact same thing. This weird interpretation that people seem to be spreading of what she said that God is giving her the stocks to pick is the comprehension of an edge lord teen. It’s so easy to just look up her presentation for their Big Ideas 2021 report and it’s obvious that she and her firm are doing tons of research. Reddit is crazy sometimes.", "score": 9, "replies": []}]}, {"body": "I'm just generally less trusting and have less faith in people who believe wildly irrational claims with no evidence. I don't think there is anything wrong with looking out for your own interests and not wishing to tie yourself to a ship that you consider to be unstable.", "score": 1, "replies": []}]}]}]}, {"body": "Some people started hating (they \"want to\" get out of ark) once found out she's religious and made a podcast in some religious channel. To me that doesn't matter. She's not selling and buying all on her own, she has a team to do this together. I highly doubt these people got out.\nShe also sells and buys strategically to lower her cost average in some stocks, tbh it's doing better than most people's portfolio.\nSo don't worry.", "score": 39, "replies": []}, {"body": "I’m buying", "score": 15, "replies": [{"body": "Same", "score": 2, "replies": []}]}, {"body": "I don't think hate so much as pushback against this sub thinking that a niche high risk/high volatility strategy should be the backbone of every portfolio.", "score": 8, "replies": []}, {"body": "Many people here started investing after March 20, for them consecutive 1%+ green days are the normal. Right now they don't get these results so the ETF must suck.\n\nBroad indices like S&P500,DAX or even MSCI World achieve yesrly averages around 5-8%. The tech Holdings in these indices might achieve around 8-12% with high volatility. If ARKK just achieves 20% this year it would be fucking amazing, but many people believe now that they will get 100%+ all the time...", "score": 4, "replies": [{"body": "Good point with facts. Thank you!", "score": 2, "replies": []}]}, {"body": "People seeing arkk in the red and panicking. Ignoring that almost everything is down.", "score": 6, "replies": []}, {"body": "There is a huge reddit population of mental midgets who get their confidence from repeating New York Times and CNN talking points. Anyone religious = republican and a Trump voter = stupid. Making money with Jesus and Kathie is so much more satisfying knowing that they hate all three.", "score": 28, "replies": [{"body": "Facts", "score": 3, "replies": []}, {"body": "Lol, as if. Anyone who read the Bible would be unable to vote republican since they go against Jesus basic teachings. Funnily enough same applies to Kaithe since she's making bank on companies exploiting people, and not giving said profits to the poor (as Jesus said people should). Satanism on the other hand fits her perfectly, and most Republicans, since they say \"focus on you, get rich and enjoy life. Don't care about others\". Remember Jesus warning of false prophets? Loudly proclaiming their faith on the streets? Yeah...basically that", "score": -9, "replies": []}]}, {"body": "people are idiots\n\nshocking", "score": 11, "replies": [{"body": "But why doesn’t my stock go up every day? What’s wrong?", "score": 5, "replies": [{"body": "gotta go call cathie and demand her resignation real quick", "score": 4, "replies": []}]}]}, {"body": "i think it’s just panic selling since tech is down", "score": 6, "replies": []}, {"body": "Because it had a few days of red and many Redditors actually believe that stocks only go up.", "score": 3, "replies": []}, {"body": "Ark etfs should be part of a balanced portfolio.\nIf your overall portfolio is down say 10% on a day the Nasdaq is down only 2% then your portfolio management is shit.\nArk type stocks should be 20% of your portfolio at most. Get some fucking disney in there! 😉", "score": 3, "replies": [{"body": "5% in my portfolio.  That's why I'm not worried!", "score": 1, "replies": []}]}, {"body": "Just look at the daily posts, people chase and tout what’s running in the moment rather than actually finding things they believe in. I don’t own, nor would I buy ARK right now, but nothing has changed other than it has finally seen some red after an incredible run.", "score": 4, "replies": []}, {"body": "It's like those idiots who hated Tim Cook because he's gay but they badly want those easy gains", "score": 5, "replies": []}, {"body": "I changed my mind on ARK and Cathie after she bought $WKHS following their loss of the USPS contract. She’s propping up trash.", "score": 3, "replies": [{"body": "Do you really think WKHS is trash? I have a small position & obviously I'm disappointed they missed out on the USPS contract, but they still seem to be on target to build & sell just under 2,000 vans this year, last I read. I might buy more on this dip, depending on how the rest of the week plays out.", "score": 3, "replies": [{"body": "Yes. There's better due diligence on reddit than I can type up. Just do a search for $WKHS and look at some of the recent ones that predicted they wouldn't get the contract.", "score": 1, "replies": [{"body": "OK, I'm going to disagree with you. There's room for more than one manufacturer in the last-mile electric delivery vehicle space, and with the size of the USPS Oshkosh contract, I would be surprised if they can sell any vans to anyone other than USPS.", "score": 1, "replies": [{"body": "though the WKHS debt load is a real problem now", "score": 1, "replies": []}]}]}]}]}, {"body": "bought some at 147 and also plan to hold for 5 years", "score": 2, "replies": []}, {"body": "Lotta hate on Reddit, but also from the likes of Cramer. I understand the Reddit crowd...but the Cramer talk pisses me off. I know he’s somewhat of a clown...but it’s become clear to me that he has a lack of respect for women. The issue with Nancy Pelosi and now Cathie Wood...all while bowing down to Dave Portnoy. If you don’t believe me go check out Cramer’s Twitter feed the past few day...the man has become unhinged or is on something.", "score": 3, "replies": [{"body": "He called her a genius on Twitter. And like the past three episodes he’s been saying she’s the best stock picker around right now lol. He disagrees with the safety of ark but he definitely respects her. He also LOVES Lisa Su", "score": 3, "replies": [{"body": "Yeah the classic walk back on his show after getting roasted on Twitter for being an asshole all day. He needs to lay off the pain meds and put the phone down.", "score": 1, "replies": []}]}]}, {"body": "I think its more about her out of context quote that makes it sounds like she is a very right wing Christian.", "score": 2, "replies": []}, {"body": "There's the revelation that she's extremely religious, which has put off several people. Also, several people have made significant profits with her ETFs, and are putting those profits into more diverse investments.", "score": 1, "replies": [{"body": "Yeah she said ark was “fulfilling the will of god”. Makes you think she has some screws loose.\n\nShe also keeps dumping money into overvalued Tesla.", "score": -12, "replies": [{"body": "It doesn't make me think that at all.  There's nothing wrong with someone thinking they found their purpose in life.", "score": 5, "replies": [{"body": "Cool, that’s you.", "score": -11, "replies": []}]}]}]}, {"body": "It is unprofessional to mix your hobbies with your clients money.\n\nPractice your faith stuffs in private, do not say publicly that your hobbies are a portion of how you guide your clients assets.\n\nUnfortunate.", "score": 1, "replies": []}, {"body": "[removed]", "score": -4, "replies": [{"body": "And?", "score": 5, "replies": [{"body": "Because religious nuts tend to “donate” to politicians to put religion into legislation.", "score": -8, "replies": [{"body": "You think she’s any better than any other money makers? Who cares. She’s a religious nut. The next one will throw you under a bus if they need to.", "score": 1, "replies": [{"body": "What you said makes no sense in regards to my comment", "score": -2, "replies": [{"body": "Yea it does. She’s a religious nut. So what? Not sure why that would make people mad.", "score": 2, "replies": [{"body": "Once again, you didn’t read or understand my comment. \n\nRespond when you engage that point.", "score": -2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Don’t be rude, I was giving a reason why I thought people would pull investments. \n\nTry to use actual arguments instead of logical fallacies like ad hominem.", "score": -1, "replies": [{"body": "Your opening argument was \"she's a religious nut\", get off your high horse buddy", "score": 2, "replies": [{"body": "Wow, lots of upset religious people in here.", "score": 1, "replies": [{"body": "I'm literally not religious at all, I just hate reddit's hive mind, condescending intolerance of it", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol. Religious nuts donate to politicians to put religion into legislation to throw you under the bud. Lordy. Ok. And? \n\nNon religious nuts who have great wealth donate to politicians to hurt the little guy too. Do you have a problem with them? You best not buy into any ETF as those in charge of them don’t do any thing good for the little guy...religious zealot or not.", "score": 1, "replies": [{"body": "I was giving my reason for why I think people would pull out of ARK.\n\nI don’t know what tangent you are arguing.", "score": 1, "replies": [{"body": "You said she was a religious nut. Then you said your opinion why that is a problem for you and not others...you said it’s because she would donate to causes that put religion in legislation. Clearly that’s your problem with it. \n\nYour initial response when you said because she is a religious nut...was your reasoning why other people would pull out.\n\nI responded and called you out that if you use that as a reason boy maybe you shouldn’t invest in anything.", "score": 1, "replies": [{"body": "I explained why I thought some people have a problem with it. \n\nClearly, you have a problem with that.\n\nI honestly don’t know why you are so defensive.", "score": 0, "replies": [{"body": "Bruh. I’m not defensive. You said my response had nothing to do with what you said lol. It did. \n\nAnd it’s clearly your problem with her lol", "score": 1, "replies": [{"body": "I stated why I thought some people may have a problem with her. \n\nYou don’t know what I’m thinking so stop assuming I am. \n\nYou clearly are religious and are upset I called someone religious a nut. \n\nSee? I can do that too.", "score": 1, "replies": [{"body": "Lol. I don’t care if you called her a religious nut. Because she is. But it doesn’t matter if she is or not in terms of us being able to make money buying investing with ARkK. You’re the one bothered that she is a religious nut which is weird because what difference does it make? Nothing.", "score": 1, "replies": [{"body": "See, you are obviously defensive because you are religious and I have a reason why people would leave because of that. \n\nI don’t know why you keep coming at me with fallacies and irrelevant points.\n\nBut I really don’t care because you’ve said the same thing over and over. \n\nStay mad.", "score": 1, "replies": [{"body": "Lol. I said she is a religious nut. We all know that now. For some reason that bothers you that she is. Doesn’t bother me. And doesn’t bother most people. But you have this fear she will try to encourage religious legislation. Clearly your triggered and based on the downvotes you’re getting also easily seen through.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Yes.", "score": 2, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "https://amp.reddit.com/r/stocks/comments/lqu1gs/cathie_wood_reveals_starting_ark_was_fulfilling/", "score": -1, "replies": []}]}, {"body": "she is a godess you mean", "score": -1, "replies": []}]}]}]}, {"body": "1. Lady is kinda weird. 2. I think she came out as a Christian.", "score": -2, "replies": []}, {"body": "I am honestly concerned on the recent events revolving Cathy and her religion. I don't care about anyone's faith personally, but when I'm handing my own hard-earned money to someone who claims they started a fund because a voice in the sky told them too... yea I'm going to start being skeptical.", "score": -9, "replies": [{"body": "From what I can tell, her investing approach has nothing to do with any sort of religious values. I think her only concern with child labor, or any other human rights violations, is potential regulatory pushback impacting stock price. \n\nIf she wants evangelical money thrown at her, being guided by God is a great thing to say.", "score": 4, "replies": []}, {"body": "Recent...as in she said whatever you learned yesterday about her religion back in August 2020 and she's managed those funds the same way she always has all this time. So now what?", "score": 2, "replies": [{"body": "I wasn't invested in ARK back then. And I'm not criticizing her past performance.", "score": -2, "replies": []}]}]}, {"body": "This\n\nEDIT: It's really everyone that never got to make any profits out of it waiting at the sideline to jump on it as soon as it dipped. GME had a similar type of crowd bashing it as soon as it came down.\n\nThere are always going to be haters, but generally super-successful people tend to stay super-successful for a long time (just how human-centered systems work) and sticking around and supporting them usually benefits you too. I don't see any reason to jump boat. Underlying assets are excellent and still growth-oriented.", "score": 1, "replies": []}, {"body": "I've been buying, bought today, I also bought AVUV.", "score": 1, "replies": []}, {"body": "Some people believe Cathie was underperforming the SP500 until she started buying hype stocks.", "score": 1, "replies": [{"body": "Cause she was", "score": 0, "replies": [{"body": "If you were DCAing during that time, I think you'd be sitting pretty right now. Definitely much better than DCAing in the SP500.\n\nSeems like a silly reason to hate on Cathie and ARK funds.", "score": 1, "replies": []}]}]}, {"body": "You're trying to find like minded people in a forum that recently got swamped with a buncha randos. Trust your DD, trust Fairy God Mother Cathie.", "score": 1, "replies": []}, {"body": "Only put 5% of your portfolio in it and you have nothing to worry about. Don't worry, be happy.", "score": 1, "replies": []}, {"body": "I'm all in on Arkk and know that stuff goes up and down. It's a good fund, I'm not worried.", "score": 1, "replies": []}, {"body": "Because most are new in the market and panic when it goes down.", "score": 1, "replies": []}, {"body": "Been alot of red in general lately, ARK stocks haven't escaped that, people hate red.  Red makes them feel bad, having money in an ETF gives them plausible deniability to blame someone else.  Give them any sort of reason, even a stretch like a woman on faith doing an interview to a faith based source, and that's all you need for a fire.", "score": 1, "replies": []}, {"body": "I am really curious what must be going on in someone's head to buy this at $150 when it was $40 less than a year ago...\n\nhttps://i.imgur.com/gacMfFi.png", "score": 1, "replies": []}]}
