{"title": "Dow plunges 10% amid coronavirus fears for its worst day since the 1987 market crash", "selftext": "https://www.cnbc.com/2020/03/11/futures-are-steady-wednesday-night-after-dow-closes-in-bear-market-traders-await-trump.html\n\nThe Dow Jones Industrial Average closed 2,352.60 points lower, or 10%, at 21,200.62. The index had its worst drop since the 1987 Black Monday market crash, when it collapsed by more than 22%.The S&P 500 plummeted 9.5% to 2,480.64, joining the Dow in a bear market. The S&P 500 also hat its worst day since 1987. The Nasdaq Composite closed 9.4% lower at 7,201.80.\n\n“The coronavirus is scary and people don’t know what to expect,” said Kathy Entwistle, senior vice president of wealth management at UBS. “It’s like the tsunami is coming. We know it’s going to hit any day and nobody knows what the outcome is going to be.”", "id": "fhmpjq", "created_utc": 1584043921.0, "score": 240, "upvote_ratio": 0.97, "num_comments": 49, "comments": [{"body": "Not supposed to touch ur face bro", "score": 119, "replies": [{"body": "Who's gonna move our stocks if wallstreet is infected?!", "score": 14, "replies": [{"body": "Wallstreetbets", "score": 25, "replies": []}]}]}, {"body": "Ok people, let's get some numbers here to try and evaluate the recent market downturn.\n\nFirst:\n\n>Historically, stocks have averaged a PE ratio **between 15 and 20** and if you look at a large database of companies you’ll find that most stocks sit within this range. The stock market as a whole (measured by the S&P 500) has had an average PE ratio (throughout it’s history) of 15.54.\n\n[https://decodingmarkets.com/historical-pe-ratios/](https://decodingmarkets.com/historical-pe-ratios/)\n\nWhich means historically,  investors pay 15 to 20 times earnings for a stock.\n\n&#x200B;\n\n2nd, per this chart the average P/E ratio of the S&P 500 is as today 18.66, So it seems we are currently in the middle of the historic range of stocks p/e ratios.\n\n[https://www.multpl.com/s-p-500-pe-ratio](https://www.multpl.com/s-p-500-pe-ratio)\n\nThe historical mean is 15.78.   Which if my math is right, that's another 15% down.\n\n&#x200B;\n\nMy question for the esteemed members of this sub are:  How much will this virus-scare affect corporate earnings this year?  How much can we expect p/e ratios to go down?  Or is the downturn in future earning already baked in now?  Are there other factors also at play?\n\nI work in real estate and a loan officer I like to work with said mortgage rates jumped 1% from yesterday to today.  If that lasts it will cool the housing bubble.   The price of oil is cut in half, which is good for consumers, but bad for the US oil industry.  Employment is good now, but if this starts a chain of bad earnings, leading to layoffs, this may take a while to recover from.\n\nThoughts?", "score": 11, "replies": [{"body": "Thank you for the actually thoughtful answer. I hope someone more knowledgeable than me answers you.", "score": 7, "replies": [{"body": "You’re welcome.   \n\nCold hard data is really the only way to make sense of the situation.", "score": 1, "replies": []}]}, {"body": "I believe PE is flawed because you are missing long term debt and much more in that equation. You are just looking at one small factor in an ocean of information. Current corporate debt is at historical high. The real question should be can companies survive this wave of supply and demand disruptions and still pay back their debt?\n\nCan FED cut rates to save industries while interest is already super low. If we cut it any lower, bond yield might go negative like many European nations.\n\nWe are being hit on multiple fronts. When airline cut flights, your goods travel time increased. Most people think supplies comes from cargo planes but what they didn’t realize is most planes store cargo below passenger seats. So if you reduced number of flights and restrict travel, supply is simply gone. Then there is city lockdowns and how it will effect manufacturing.\n\nShell oil is also impacted negatively. They need around 50 dollars a barrel to make profit. With current price falling below 40, we should expect hundreds of companies go bankrupt. Low oil prices also effects renewables as they are competitors.\n\nWe had such a long QE at low interest rates enticing more borrowing at corporate level that we can’t really point to a historical anchor in time to properly compare. So the future is very uncertain.", "score": 4, "replies": []}, {"body": "PE has been a less meaningful in the last decade with ultra low rates and lackluster inflation. PE ratios are higher today in because rates are on a large downtrend for the past couple of decades. Because rates are low, the hunt for higher yielded assets pushes people into equities. i.e. Low interest rates will result in higher PE multiples.\n\nTherefore I think that referring to the long term average is not useful. The benchmark has shifted higher.", "score": 1, "replies": []}, {"body": "We are at 18.66 PE right now, but there are a couple of things that would most probably reduce companies EPS. \n1. The economy is going to shrink big time. A lot of countries are in a halt and a lot of companies are forced to close facilities, lose revenue and more. \n2. Share buybacks will stop. Companies have been throwing big money on buybacks that was increasing their EPS year after year. Now they would be forced to stop and maybe even issue shares to try and mitigate the crisis. \n3. Corporate debt is crazy high. I believe we are at historic highs in terms of corporate debt. A lot of companies would not be able to pay their obligations with diminishing cashflows. Also most of them have no cash reserves, which might push a lot of companies to bankruptcy.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "How is that even legal??", "score": 49, "replies": [{"body": "It's not.", "score": 22, "replies": [{"body": "Ya wait what??", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": -8, "replies": [{"body": "That’s fucking stupid and probably illegal. You realize he just sold your stock securities after a 25% drop in value, meaning you just actualized that loss.\n\nIf the market levels off and rebounds starting tomorrow, you will not recover any of your losses. The other outrageous part is that it sounds like he just did it without consulting you.", "score": 28, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "It’s not unless they signed a document giving him the right to, like a LPOA. Even then idk if it’s legal.", "score": 9, "replies": []}]}, {"body": "Hey, in case the other people are telling you too politely, your boss is fucking retarded and panic selling not only his portfolio, but yours as well.", "score": 4, "replies": []}]}]}, {"body": "You need to get more info because from what you said that’s not fucking legal", "score": 9, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Oh gotcha lol. Well that’s still lame to do it without you knowing", "score": 2, "replies": []}]}]}, {"body": "That is absolutely illegal.  He can’t move it either.", "score": 5, "replies": []}, {"body": "You should find someone else to work with, this is a shitty boss.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "It could mean not-cash. I moved mine last week to John Hancock's \"Conservative\" fund (not cash) and didn't lose anything this week.", "score": 1, "replies": [{"body": "is it possible that you could explain this?  please  :  )", "score": 1, "replies": [{"body": "He means move it from more stock investments in your portfolio to safer ones. ie from broad market etfs to bonds which are not as volatile", "score": 1, "replies": []}]}, {"body": "I pulled half of mine out last December and moved it to bonds and such, the second this virus is under control I am dumping it back into blue chips", "score": 1, "replies": []}]}, {"body": "Sorry for the confusion didnt pull out just moved it to a safer location", "score": 1, "replies": [{"body": "That's also illegal", "score": 2, "replies": []}]}]}, {"body": "Bro that’s not legal. You need r/legaladvice and a lawyer. I use to work with 401ks. If this guy changed your investments that’s a big no no and could have severely fucked you hard with what is upcoming.", "score": 2, "replies": []}]}, {"body": "For those of us that don't understand how much money is lost when the market plunges like this, can someone please explain the math of how much money has been lost? Say you had 1 million invested in S&P, how much less money do you have now? And where did that money go?", "score": 8, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I see, thank you all for the helpful explanations", "score": 5, "replies": []}]}, {"body": "If your tracking one of the indexes 1M is now 0.9M, which is 100k. 1B is now 0.9B or loss of 100M. If you had $10 you have $9 now.", "score": 10, "replies": [{"body": "Actually, as of the close today the S & P is down 27% from the high reached on February 19.  So wouldn't the 1M now be worth 0.73M?  And to make it worse IWM, which is the ETF for the Russell 200, is down around 35% from its recent high.", "score": 13, "replies": [{"body": "Yes that's right and the 1m in Russell would be .65m.", "score": 3, "replies": []}]}]}, {"body": "Whoever you bought shares from has the money. Now you cannot sell the shares for the same amount, so you have a potential loss of 10 percent since yesterday.", "score": 1, "replies": []}, {"body": "It's like a house. If the market value of the house dropped 10%, that money doesn't \"go\" anywhere. It's just gone. \n\nToday, the market dropped by about 10%. That money is gone. The market is basically saying it expects the corporations to collectively be 10% less valuable because they will not be able to sell as many goods until the market recovers.\n\nWhen this blows over, the market will swing back and that 10% in value will come back, plus a lot more, for all the companies that can survive this.", "score": 1, "replies": []}]}, {"body": "Hahaa! He said as he kept on buying...", "score": 6, "replies": []}, {"body": "SHAMBLES", "score": 3, "replies": []}, {"body": "\\#Winning", "score": 4, "replies": [{"body": "#YOLO", "score": 1, "replies": []}]}, {"body": "I’m no expert, but I don’t see the market recovering for years. There’s still another 30-40% that it could fall in the next month or two.\n\nI think most countries decided that it would be better to have a high curve with the coronavirus instead of a flat one so it’ll be over in a month or two once it starts community spread.", "score": 1, "replies": []}, {"body": "But what about investing in anti corona virus products like sanitizer and cleaning materials? As well as survival essentials like water bottles, canned foods, toilet paper or other hot products right now?", "score": 1, "replies": []}, {"body": "How do we know this plunge is caused by coronavirus fear/ panic. It seems that something like that would have a lag effect and take some time to actually manifest in the stock market or does speculation/ fear work that quickly? Anyone know how the repo markets play into this and the health of the stock market?", "score": 1, "replies": []}, {"body": "DOW UP almost 10% on Friday closing as trump declares state of emergency.", "score": 1, "replies": []}, {"body": "But the MAGA economy????", "score": 0, "replies": [{"body": "There is no Trump or Obama economy there is only the American economy.", "score": 1, "replies": [{"body": "that was my point", "score": 1, "replies": []}]}]}, {"body": "Why don't they shut the market down for a week.", "score": -2, "replies": [{"body": "If that was announced, it would be even worse as everyone would try to sell before getting “trapped” in falling equities...", "score": 8, "replies": []}, {"body": "Don’t downvote somebody for asking a genuine question.", "score": 1, "replies": []}]}, {"body": "Tesla surpasses Boeing.  Even at the onset of a recession.  “Demand issues”...Suck it haters.", "score": -1, "replies": []}]}
{"title": "Recession (or close to it) incoming", "selftext": "I have a firm belief that we are no where near the bottom. \n\nSchools are closing\nJobs are going online\nSociety is panicking \nVirus is spreading \nBans are happening\nSubsidies are beginning \n\nI am never the one to be a Debbie downer and say the worst is yet to come, the world is ending blah blah blah. Just like other natural disasters and spreads of illnesses I never thought it would turn out as bad as people say it would (which was true) but for some odd reason I have a gut feeling this virus has yet to do its damage.\n\nWhat are your thoughts?", "id": "fh9hll", "created_utc": 1583981296.0, "score": 8, "upvote_ratio": 0.62, "num_comments": 58, "comments": [{"body": "It’ll be painful for awhile, but we will be fine. People can work, shop, and be entertained at home and that will help keep us afloat. \n\nAlso, look at the source. It’s been about 2-3 months since China problems really started. They are now seeing fewer cases, going back to work, lifting travel restrictions, etc. \n\nBut yes, this is scary and seems unprecedented.", "score": 27, "replies": [{"body": "China’s delay in manufacturing will hurt US companies that depend on them. Given we are behind, we are just starting to feel it", "score": 8, "replies": [{"body": "Absolutely. I’m just saying it seems that the virus can be contained after awhile. There will for sure be pain. Temporary.", "score": 5, "replies": [{"body": "I have family in China and from what I heard, it’s not getting better, yet. Prices are still up and their economy is slowing", "score": 6, "replies": [{"body": "And that would make sense. They still have a lot of cases and are still being pretty cautious I would imagine. If they are starting to put people back to work that we’re previously quarantined, that should be a good sign.", "score": 4, "replies": []}]}]}, {"body": "Or the other side of it is China delay in manufacturing hurts US companies but demand is weaker because consumers can’t go out. So win win win.\nPlanned it out", "score": 2, "replies": []}]}, {"body": "When you no longer can see the blue sky in China again, that’s how you know things are back to normal.", "score": 5, "replies": []}, {"body": "That’s if you believe reporting from China.", "score": 2, "replies": []}, {"body": "they're seeing fewer cases BECAUSE they've been quarantined/staying at home. Now that they are all going back to work there will definitely be an up tick in cases.", "score": 1, "replies": [{"body": "And how long will that uptick last?", "score": 1, "replies": [{"body": "however long it i'll last in other countries.", "score": 1, "replies": []}]}]}]}, {"body": "This is far less frightening than the liquidity crisis in 2008.\n\nWe will be fine.", "score": 26, "replies": [{"body": "2008 was pretty scary and far worse for the stability of basic economic foundations.\n\n...But I could still buy toilet paper/bottled water from Costco and downtown was not a ghost town back then. It's interesting how extreme the reaction has been to this crisis.", "score": 8, "replies": []}, {"body": "I’d both love and hate to have been on a trading floor, or to really understand the extent of how fucked everything was, when it happened. I feel like it’d really give me perspective on this.", "score": 4, "replies": []}, {"body": "Here’s the diff: death. Dramatic yes, but real yes.\n\nLet it sink in for a minute.  People are rational but irrational at the same time. \n\nPlace your bets on Schrödinger's cat.", "score": 5, "replies": [{"body": " CAT is down big from this crisis\nSDGR seems to be holding to its range", "score": 1, "replies": []}]}, {"body": "Exactly this is just consumer suspended spending. Not a complete banking fuck up. I agree with you. We’re just I. The beginning so a lot of lows to come for sure.", "score": 2, "replies": []}, {"body": "The level of panic seems unprecedented....\n\nPeople are cancelling life over a few thousand cases of a bad disease", "score": 1, "replies": []}]}, {"body": "As people have said, so far the 2008 crisis was much spookier due to the underlying foundations of our economy crumbling at our feet.  \n  \nThis pandemic is a big deal, but we’ll manage. Even if things continue the current course, it doesn’t seem like we’ll see bank bankruptcies or tanking housing prices, the latter which is still rising.", "score": 7, "replies": [{"body": "The pandemic is not nearly as scary as the reaction\n\nWe will recover of the pandemic, but the reaction will wipe companies and maybe industries off of the map", "score": 1, "replies": []}]}, {"body": "I said it yesterday and will say it again. Nothing shows this coming to an end. It will, it might be in a few weeks or maybe a few months. But it will take days to weeks to realize this. \n\nTrump's speech did not help as well. Not saying he does not need to take drastic measures. He needed to do something earlier. But nothing he said will help the market. \n\nI think we still have some tumbling to do. But hopefully this is a blip in the radar, not an actual out right recession. Though damage will be done.", "score": 4, "replies": []}, {"body": "And oil war will kill big oil companies. My Halliburton stock was over $70 in 2014 now 7.8.....  Pump and dump stocks do better than this", "score": 3, "replies": []}, {"body": "Imo this is going to get worse and worse. I know it's bad but I think the dow will drop 2000 points again tommorrow", "score": 3, "replies": []}, {"body": "I think we will bottom in about a months time and then it will stay fairly flat for another month or two, and then by July or so it will start getting better", "score": 3, "replies": []}, {"body": "Do you actually know someone who is scared?  I don’t know a soul that has changed their daily routine.  The only people I see scared are politicians and companies, one fears paying a price politically and the other fears getting sued for actually having people come to work/school.", "score": 3, "replies": [{"body": "Not sure about your local grocery stores but mine are sold out of nearly all toiletry supplies. Also all Florida universities are closing and going online. NBA is also cancelled. What do you mean people are not scared? Lol", "score": 9, "replies": [{"body": "Not true at all.  My daughter attends a fl university not only are they going to class but they are still playing sports.  I live in Florida I have seen no change.  My son is in high school no change to their sports schedule or class schedule either.  There is no shortage here of anything.  You must live somewhere other than north Florida.", "score": -2, "replies": [{"body": "All over Florida they are going to online-only classes. Been on the news for past few hours.  UF, FSU, USF, UCF, FIU, UT among others have announced this already,", "score": 5, "replies": [{"body": "Mine goes to a private Florida university, no change for the healthy students.", "score": 1, "replies": []}]}, {"body": "Come back here later this week.", "score": 2, "replies": [{"body": "I’ll be here.  Big weekend of games coming up and then everyone to the beach for spring break except we have a big week of games as well.  Not a mask in sight at today’s double header.", "score": 2, "replies": [{"body": "Honestly in all of DC and the VA area around it, no one is even acting like something is going on lmaoo. We had a few cases announced today and people are carrying on like normal. I actually have been seeing more people out and about lately now that its gotten warmer. I travel between DC and DE constantly and I notice no panic/difference.  \nAlso, I have been to about 5 different grocery stores within this time and everything is fully stocked.", "score": 3, "replies": [{"body": "Yeah that’s the case in N fl, as well as s ga and the atlanta and Jacksonville areas I’ve been in those places the last week.  No change, no fear.", "score": 2, "replies": [{"body": "Welp I got 2 big weddings next month so we will see how bad it gets lol. Doubt anyone is gonna avoid the wedding though regardless.", "score": 1, "replies": []}]}]}]}, {"body": "!remindme later this week", "score": 1, "replies": [{"body": "There is a 2 hour delay fetching comments.\n\nI will be messaging you in 1 day on [**2020-03-13 17:00:00 UTC**](http://www.wolframalpha.com/input/?i=2020-03-13%2017:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/fh9hll/recession_or_close_to_it_incoming/fk9xwd4/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Ffh9hll%2Frecession_or_close_to_it_incoming%2Ffk9xwd4%2F%5D%0A%0ARemindMe%21%202020-03-13%2017%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fh9hll)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "> Not true at all. My daughter attends a fl university not only are they going to class but they are still playing sports. \n\n[The Board of Governors for the State University System called for schools to offer remote, online teaching while keeping campuses open and operations normal for students who don’t have the option to relocate. Dorms, dining halls and health centers will remain available to students, said system spokeswoman Renee Fargason.](https://www.tampabay.com/news/health/2020/03/11/floridas-state-universities-to-move-classes-online/)", "score": 1, "replies": [{"body": "There ya go, just as I knew they aren’t shutting them down.  Clearly I know what’s up.  My daughter doesn’t go to a state school.  She goes to a private one.", "score": 0, "replies": [{"body": "> Clearly I know what’s up.\n\nSort of. All state schools are going virtual classes 100%. \n\nPrivate schools will follow suit soon enough.", "score": 3, "replies": [{"body": "We shall see.  I didn’t say they wouldn’t I said they hadn’t.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well when politicians prevent travel and consumer aggregation, it doesn't matter if anyone is scared, it's still going to kill the economy", "score": 3, "replies": [{"body": "It has created the greatest buying opportunity in 10+ years.  What a great time to pad your retirement.", "score": 0, "replies": [{"body": "The market was way over bought anyway.  It should have corrected 30% a year ago, but went up 30% instead", "score": 3, "replies": [{"body": "I agree that’s why I’m sitting in about 15 months worth of cash as well as some gold and I bought some real estate in the last year and a half.", "score": 1, "replies": []}]}]}]}, {"body": "You obviously don’t live in Washington", "score": 2, "replies": [{"body": "I certainly do not, nor would I.", "score": -1, "replies": [{"body": "Obviously hahaha. Don’t know anyone that’s scared?? Is the market not an indication of the country being fearful??? They are banning large group gatherings, NBA cancelled season, Europe travel is closed, oil war, 😂😂😂", "score": 6, "replies": [{"body": "No friend of mine has sold, many have been buying.  I’m haven’t bought yet but I’ve been piling cash for about 15 months and will buy in short order.  If someone is scared of this small correction in the market they need to open a savings account and keep their money there.", "score": 1, "replies": []}]}]}]}, {"body": ">  I don’t know a soul that has changed their daily routine. \n\nNBA games done indefinitely. All major sports teams will do the same. \n\nSchools across the country will close. Seattle has already done it, a ton of colleges doing the same. \n\nI know multiple people working at home now. My brother's employer just said they are closing their office for 30-days on Friday and buying him a computer. \n\nTravel restrictions to EU. \n\nHotels are empty. \n\nHow are people not seeing this. I think this will be short term but man major changes are coming to people's lives. Not being stuck in their home like in China change, but change for the next 2-4 weeks.", "score": 1, "replies": [{"body": "I don’t know anyone that plays in the nba, hell I don’t know anyone that watches the nba.  I don’t know anyone that travels to the eu regularly.  Hotels are not empty, I work on the road and the hotels are 100% not empty.", "score": -1, "replies": [{"body": "I’m glad I don’t live near you considering you are on the road all the time but clearly can’t see past your own nose.", "score": 3, "replies": [{"body": "Nobody lives too close to me, by design but I. The last week I’ve been to atlanta, Jacksonville and the surrounding areas and I have noticed no change.", "score": 1, "replies": [{"body": "That's great man. I can just tell you the company that I work for has shut down all travel (international and domestic) and I've had to cancel hotel reservations that I had for work. I work with people that travel to the EU regularly to do due diligence on companies to invest in. I was watching an NBA game when the announcement was made that the season was going to be suspended. Anecdotal evidence works both ways and just because you haven't seen it doesn't mean that it does/can not happen.", "score": 1, "replies": [{"body": "Oh I never said it wouldn’t happen, I said it hasn’t and that nobody I knew had changed routine or was scared.    It clearly could happen and might.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well my country, Denmark, just closed all schools and Universities, send everyone not necessary who works for the government home, closed all libraries, fitness centres etc. So now I can't go to school, I can't go to my side work, I can't workout. Yeah it's affecting me big time", "score": 1, "replies": [{"body": "That does suck for sure o hope that it does t get to that here.", "score": 1, "replies": []}]}]}, {"body": "Yeah youre right stocks will keep going down but this is not 2008. Recovery will be relatively swift. We will probably have forgot all about it by 2021.", "score": 1, "replies": []}]}
{"title": "I told myself that I would buy a share of TSLA if it ever dropped below $500.", "selftext": "Still pretty set on doing this, but now the only reason this is happening is because the whole economy is in a downtown. Should I reconsider?", "id": "fhmefb", "created_utc": 1584042808.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 53, "comments": [{"body": "It is easy to look at 900 snd say you would buy at 600. Now if 600 comes everyone chickens out. Rinse and repeat. Happens every damn swing.", "score": 20, "replies": []}, {"body": "Wait a bit dude, this is gonna be a long one.", "score": 18, "replies": []}, {"body": "This sounds like a really good reason to buy at a low price.\nIf the price was going down because the cars are not selling, they did something really stupid, or any reason related to the company performance I would reconsider it.\nNow if you are reconsidering the price, that is a completely different question.", "score": 11, "replies": [{"body": "Do you not think supply chain will be hit? Giga germany is already on halt, because Tesla send the workers home.\n\n If China goes back to work and it starts spreading again, what then?\n\nThe entire world might go on lock down. Companies are highly over leveraged and many of them might go bankrupt. This will have a huge impact on the economy and much more. This will also have an impact on Tesla. Demand isn't infinite.\n\nAlso, if Tesla starts sending workers home their pace of innovation will slow down. Tesla's valuation is based on their pace of innovation.", "score": 2, "replies": [{"body": "From Elon recent tweets, I don't think so, I believe supply chains are getting back to levels they were before in China.\n\nThe possibility of a global economy recession is possible, but I believe Tesla is well positioned to survive and thrive in a recession scenario. Their demand is still much higher than production, so they have that going for them.\n\nI wouldn't have considered the possibility of Tesla production stopping in the USA until recently, but looking at Europe, it may be a possibility. But if it's something like China it will be a small set back, something that may not matter at the end of 2020.\n\nMy look at Tesla has always been focused on the future, so if you are worried about the short term, my view may not prove much useful.", "score": 5, "replies": [{"body": "A global recession might play out for a year or two. We will see. I sold my Tesla position and am looking to buy back at some point. You raise some good points.", "score": 2, "replies": []}]}]}]}, {"body": "1. Don't invest more than you can afford to lose\n2. Be prepared to be patient. I don't think this will reverse course quickly.", "score": 19, "replies": [{"body": "He said 1 share...", "score": 4, "replies": [{"body": "If they are living paycheck-to-paycheck than one share is still a big risk.", "score": 9, "replies": [{"body": "Shares ain't cheap, even after this huge hit.", "score": 2, "replies": []}]}]}]}, {"body": "I bought some over the past few days. Nothing crazy. \n\nI'm going to keep adding but probably not until next week. Also plan to but a far out call shortly,  like I did with the SPY.", "score": 3, "replies": []}, {"body": "Today is your day!", "score": 3, "replies": []}, {"body": "If you believe in the long term and are planning on holding then it is an opportunity.\nDo your research and decide based on the information you trust", "score": 4, "replies": [{"body": "This would be for the long term. I think TSLA has tons of upside for a long time", "score": 5, "replies": [{"body": "Just have to decide on your buy in price.\nI bought last week and am looking at more at the moment.\nIf you buy at the moment be prepared for a rollercoaster!", "score": 2, "replies": []}]}]}, {"body": "Ask yourself why you set that price target, and if that reasoning is still valid. Instead of an empty post like this lazily fishing for information, share your reasoning so we can have proper discussions...", "score": 2, "replies": [{"body": "I’ve pretty recently started to dive into researching EV and obviously Tesla’s are the best. I also think that Tesla is well suited for the future and has so much upside with the roof and the supercharging network and that they make such a good product and eventually can be the tipping point in being a better option that ICE cars. I don’t have that much spare cash and so when the price was around 700 I decided to myself wishfully that is the price went below 500 than j would buy. Didn’t ever really think that would happen and since the market is dropping like crazy I’m curious to see what people were thinking. J know that Tesla has their giga factory in China and that maybe has some problems with the virus so I was curious what people in this sub were thinking in regards to the stock price", "score": 1, "replies": [{"body": "Nice, I looked at it from the earnings perspective too. So the average EPS of  Q3 and Q4 was $2 (non GAAP). If we extrapolate that, perhaps we can assume the non GAAP EPS for the year to be $7? That makes for a PE of about 85 at $600. Let's say the hype goes down in 2 years and PE falls to 50 (like AMZN levels), then for price to be $1000 we would need a EPS of $20 to support it. Can Tesla triple it's earnings? I think so, even in the face of hiccups, it will only be a matter of time with Solar Roof, battery farms, model Y, cybertruck etc. So there's only upside on the long run. Whether short term fluctuations will bring it down to 400 nobody knows.. (Personally I've been buying, I can't imagine missing the opportunity of a life time just because I was trying to save a couple bucks)", "score": 1, "replies": []}]}]}, {"body": "Yea I’m just going to say the most basic thing because anything anyone else says is just a pure guess.\n\nTesla EPS was $2.5 last quarter, undiluted (so actually negative). Let’s assume that as a baseline that they keep this up. So $10 EPS per year. At $500 per share that’s a 50x PE ratio. The S&P500 PE is about 20. Of course we are all betting Tesla can grow EPS significantly, and I hope they do, but if they don’t get better/worse that’s where share prices are at (overvalued). Remember Tesla hasn’t even seen a full year of earnings. \n\nIf you think Tesla can grow EPS by 2.5x over the next 5-10 years then $500 is a fair price. Finally remember EPS is not growing revenue (selling more cars), they need to make 2.5x more in profit margin (e.g. from economies of scale, efficiency improvements, or new tech that can charge more vs competitors).\n\nDisclosure: I own Tesla stock and will continue to buy more using DCA.", "score": 2, "replies": []}, {"body": "This is an unpopular sentiment and similar ones get downvoted but sub $400 is highly likely.\n\nI sold put options below that price point because I like those entry points. The premiums that I’m getting are very high and if the stock never touches those levels I’m still happy to collect.", "score": 2, "replies": []}, {"body": "Invest when you are comfortable. Nobody know where bottom is. This stock swings wild in both directions. We all know where itll be eventually. It's not money for you till you sell it. Lots of people are waiting to get back on this train. If its money you are investing long term, buy on a red day and dont check the stock till coronavirus is over. You'll lose more possibly in the short term, but you'll gain sooooo much more long term.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Should I sell and rebuy later? or just hold", "score": 1, "replies": [{"body": "I would definitely wait a few more months regardless of your long term outlook of Tesla.  I  have mentioned before when everyone kept talking about Tesla to be 4k by end of 2020 or 10k by end of 2030.  None of those discussion talked about a market downturn.", "score": 4, "replies": [{"body": "So I should just ignore what's happening for a few months and just hold?", "score": 1, "replies": [{"body": "if you already own the stock and has a profit. I can't tell you what to do.  What I can tell you that I'm buying puts on tesla to offset my stock holding as it is going down.  Your other option would be to sell cover calls on the stock you own.  A lot of us here held from the high 386 to the lows of 175 last year.", "score": 2, "replies": [{"body": "Been selling covered calls for a while. Only thing I'm nervous about if it's in the money at expiration. I'll take a loss since my average is well above current market value. ~$656/share", "score": 1, "replies": [{"body": "yes, that's the risk.  best bet is to have a exit point for loss and gains. 10-15% gains, boogie on out.  Not that i'm following my own rules right now.  I'm getting out a bit more around 40-50% but the risk of losing is always present.", "score": 1, "replies": []}]}]}]}]}, {"body": "I asked myself the same question at 850. I decided not to cause I hoped every day the company I loved went down in value. I didn’t like that feeling. So decided to buy/hold for long term. Just my opinion and logic. May not jive with everyone.", "score": 3, "replies": [{"body": "Yeah I was planning to jeep for long term, and you just convinced me to hold. Thanks for the advice!", "score": 3, "replies": []}]}]}, {"body": "See 400$ tesla cabt even guarantee 30B$ in revenue at this point at a profit with all of this stuff going on. Next thing you know, they might even habe to close down factories and deal with massive supply issues if not. I definitely see tesla at 100$ if this gets worse.", "score": -3, "replies": [{"body": "If CA get quarantine and Tesla has to close down shop, you can bet all the tech company in that same general will feel the same impact.", "score": 5, "replies": []}, {"body": "Tesla is producing more Model 3's per week than total cars sold in the year Tesla was last valued at 100$.\nI find that scenario very unlikely, even if the USA factories close for the rest of thrle year, which I also consider highly unlikely.\nThe market can be completely unracional, we saw 180$ last year, but I don't see things developing in that direction, based on how things turned out to go in China.", "score": 3, "replies": [{"body": "Tesla is solely valued on what growth they projected. Any major pushback will have a significant impact on the stockprice. If the company has to shut down for some time, it will cripple their YoY growth and financials badly. The only thing positive at this point is them sitting on enough cash to support RnD and whatever demand is left when corona hits hard. Needless to say, tesla still has the best position in this crisis compared to other  carmanufacturers. ( yeah i know tesla isnt just a car manufacturer!)", "score": 3, "replies": [{"body": "I agree with that, I just don't see the virus hitting so hard that it undoes YoY progress to the point that the company won't be able to resume from where they were before Corona, ever. That is the only scenario I see for it to be valued in the 100$ leves in the future after the virus has been surpressed.", "score": 1, "replies": [{"body": "Dont get me wrong, i myself think tesla is one of the best investments after everything settles. I'd put my entire lifesavings into tsla after we reached the bottom, but their current value is not worth their revenue with that much uncertainty in the market. They are still a young company at the verge of becoming profitable. Anything rocking the boat could leave a big dent and delay their plans by years. I hope elon juggles his pennies as good as he can if things get dark", "score": 1, "replies": []}]}]}]}, {"body": "100? damn I bought 30 shares at 700. I dont wanna sell and time the market. But I understand that this corona thing is just getting started. \nI hope I will be good in the long run.", "score": 2, "replies": [{"body": "Stay calm. If tesla hits 100$, Money will be your last problem comming to your mind", "score": 4, "replies": []}]}]}, {"body": "It will see $4.", "score": -2, "replies": []}]}, {"body": "Know your limits only invest what you can afford to lose. The last two weeks have been an eye opener for investing. Anyways two weeks ago I invested in tsla my reasonings were sound and I believe in them. I made the choice to go long (10 years) sure the short term is poor but long term I can see the benefits. If you want to play the long game no doubt invest short term is a scarey ride.", "score": 1, "replies": []}, {"body": "did you think tesla was going to 500 without the whole economy downturn?", "score": 1, "replies": []}, {"body": "Tesla will never be down on positive news, so there will always be the situation that \"oh its down below 500, but that's because of so and so basis...\"", "score": 1, "replies": []}, {"body": "Some rhetorical questions for you to consider for yourself. How do you determine a company is worth investing in? What research have you done on Tesla? Why do you specifically want to buy Tesla below $500? Is the money you are willing to invest expendable and you are okay with losing it? Under what conditions would you want to sell (read: what is your exit strategy)?\n\nThere's really no wrong answers for these questions, and maybe there are better questions out there to help guide you on what to do. In the end, only you can decide what is right for you.\n\nI'll add that if you have done enough research on Tesla to believe in their future, and you can afford to invest when your criteria is met, then do it and back your decision with having exit criteria so you don't necessarily take a loss.", "score": 1, "replies": []}, {"body": "What’s up ?", "score": 1, "replies": []}, {"body": "Do you believe the share price will be lower in a week?  Two weeks?  If yes, you should probably wait a little bit.  In the long run, if you plan on holding for many years, it might not matter, but it's still nicer to get cheaper shares when you can :)\n\nOn the other hand, if this *really* gets bad, Tesla going backrupt probably isn't *entirely* out of the question.", "score": 1, "replies": [{"body": "Tesla is NOT going bankrupt. No way, no how. Forget Tesla as a company, invest in Elon Musk is a sure bet. The man is far beyond driven. He is a rare visionary that does something unique that I like....He gets shit done!", "score": 4, "replies": [{"body": "If your entire faith in Tesla is based around Musk, then what do you do if, God forbid, something happens to Musk?\n\nI'm not saying I place a high percentage chance of them going bankrupt.  I believe in Tesla too.  I just wouldn't rule the possibility out.  If things get significantly worse, they may not be able to raise capital, etc.", "score": 1, "replies": [{"body": "Fortunately they did their raise when the getting was good.  That's going to help them out a LOT.", "score": 2, "replies": [{"body": "Won't help if sales collapse.", "score": 2, "replies": [{"body": "Covid should be over by June, Q2 will take a hit and the rest will see recovery. TSLA is going to be fine. Me?...I'll wait till $400-450, it is a luxury stock and much better bargains are now available. Look at RCL; it's not sexy, but the potential upside is HUGE.", "score": 1, "replies": [{"body": "Thanks for the tip!", "score": 1, "replies": []}, {"body": "> Covid should be over by June, Q2\n\nhttps://www.cnbc.com/2020/03/06/its-a-false-hope-coronavirus-will-disappear-in-the-summer-like-the-flu-who-says.html\n\n> World leaders should not assume COVID-19 will be seasonal and subside in the summer, like the flu, the World Health Organization said Friday.\n\n> \"We have to assume that the virus will continue to have the capacity to spread,\" Dr. Mike Ryan, executive director of WHO's health emergencies program, said at the agency's headquarters in Geneva. \"It's a false hope to say, yes, that it will disappear like the flu.\"\n\n> \"We hope it does. That would be a godsend,\" he added. \"But we can't make that assumption. **And there is no evidence**.\"", "score": 1, "replies": []}]}]}, {"body": "Yeah, great move from them. I'm mostly just throwing these things out there to play devils advocate so OP can make his own decision. I don't really see any of this being a huge issue for Tesla, but I do believe there's a slim chance, should things get a lot worse, so I figured he should consider it.", "score": 1, "replies": []}]}]}]}]}, {"body": "under 200\n\nall in baby", "score": 0, "replies": []}]}
{"title": "TSLA tendies", "selftext": "Musk man is busy looking for a new gigafactory and he also happened to tweet that he doesn’t think beer virus is a big deal a few days ago. Tsla also only went down 1.7% today, much less than everyone else. Other than the impending insane IV levels, what do we think about buying some puts on daddy Musk? I think I’m looking at TSLA 3/20 $420 P.", "id": "fha8ko", "created_utc": 1583984684.0, "score": 28, "upvote_ratio": 0.8, "num_comments": 54, "comments": [{"body": "Generally, going against papa musk is not a good idea 🙃", "score": 64, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Credit spreads", "score": 3, "replies": []}]}]}, {"body": "Yeah I'm coo, shorted tsla 600p next day fucking jumped to 750", "score": 19, "replies": []}, {"body": "dont fuck with tsla man its not worth it. nothing about that stock makes sense", "score": 31, "replies": [{"body": "Higher market cap then boeing now", "score": 7, "replies": []}, {"body": "I made a lot from tsla it's my go to when I run out of ideas. I play it twice a week on average. It's predictable if you are one that follows it every day.", "score": 3, "replies": []}]}, {"body": "I think I'm way to fucking broke to spend time looking at any options related to Tesla unless they've gone tits up", "score": 8, "replies": []}, {"body": "Closed out my puts today down 6%. Running out of days and no guarantee that TSLA behaves like a normal stock. That said, I’d reload in a heartbeat if the premiums weren’t so damn high. Hard to justify spending on one contract the amount you could spend on a ton more of something with a higher likelihood of falling apart faster.", "score": 7, "replies": [{"body": "buy a put vertical that straddles current price. Doesn't matter IV or time out, it's always a 50/50 bet as long as there isn't heavy put/call skew", "score": 3, "replies": [{"body": "Thought about it. The problem is I have too much else going on so I’ve skipped doing the more complicated trades the last two weeks and instead been just straight put buying. But at some point I need to jump back in the pool.", "score": 1, "replies": []}]}]}, {"body": "I would love to short musk. Gas is cheap as fuck, people are poor as fuck can't afford 40-130k cars. China factory on hold, EU factory on hold. Yea this shit is about to tank. A worker in CA get the virus? They are ultra fucked if they have to close shop.", "score": 12, "replies": [{"body": "Also he's fucked by China because he installex HW2.0 instead of 2.5 as advertised in new model 3", "score": 6, "replies": []}, {"body": "It’s already non profitable, wtf are you shorting.  A non profitable company being less profitable?  You will get burned shorting TSLA.", "score": 7, "replies": [{"body": "The run up was on the expectation of growth. Without China or the EU factories getting online as expected, there is no more hope for relatively soon growth.", "score": 7, "replies": [{"body": "Can someone refute this thesis?", "score": 3, "replies": [{"body": "The answer is Tesla’s valuation bears no relationship to the real world, so going short based on facts on the ground is a fools errand", "score": 8, "replies": [{"body": "Thank you.", "score": 2, "replies": []}]}]}]}, {"body": "I made 3k in two hours shorting tsla yesterday....", "score": 2, "replies": [{"body": "Wow someone thinks he has 300 IQ. Fucking genius if you ask me", "score": 2, "replies": []}]}, {"body": "Debt", "score": 1, "replies": []}]}, {"body": "How long would it take though.", "score": 1, "replies": [{"body": "Thats the thing, you had to have big pockets to do it. I might go with my thesis on one or two 420 4/17 contracts if they have a green day just to see if it pans out lol.", "score": 2, "replies": []}]}, {"body": "The people that buy Tesla’s won’t be affected only poor people", "score": 0, "replies": [{"body": "Last year, the model 3 sold 300k units out of a total of 540k total units they sold. The model 3 is the poor persons tesla, so not everyone buying a tesla is rich. The model 3 starts in the mid-upper 30s, the same as a good optioned camry.", "score": 2, "replies": [{"body": "But everyone buying Tesla stock is Rich...from owning Tesla stock", "score": 3, "replies": []}, {"body": "I live in Canada ... and a model 3 is quite expensive. Not sure how it’s considered a poor persons car🧐\n\n$63k after rebates and tax", "score": 1, "replies": []}, {"body": "Yeah I love the company itself but part of me believes that most of the people in the market for a Tesla.. currently have a Tesla. I could see the stock slumping big until summer", "score": 1, "replies": []}]}]}]}, {"body": "I'm rolling a small Put position week to week in Tesla, but mostly waiting to YOLO puts on the Q1 delivery numbers the first week in April. \nDaddy's bonus is on the line so he hadn't warned about their terrible quarter yet.", "score": 4, "replies": []}, {"body": "thats because anybody who buys tesla stocks doesn't care about fundamentals... or economics... or reality...", "score": 7, "replies": []}, {"body": "Yeah go for it see what happens. Why do people keep thinking it’s a good idea to short TSLA", "score": 5, "replies": [{"body": "Because it’s dropped 300 from highs. I’ve enjoyed put runs on tsla", "score": 5, "replies": [{"body": "positions or ban", "score": 5, "replies": []}, {"body": "Post your positions", "score": 5, "replies": []}]}]}, {"body": "Fuck it lets go! Buying puts!", "score": 3, "replies": [{"body": "I hate to say it but AMD 40p 3/20", "score": 1, "replies": [{"body": "I don’t know anything about AMD except I missed the hype train last year.", "score": 1, "replies": []}]}]}, {"body": "I’m sitting on a pile of puts. This baby is going to tank hard. They are trying to EXPAND in what will be a RECESSION. And they don’t make a profit. This is a losing proposition my friends. We gap down tomorrow", "score": 3, "replies": []}, {"body": "Short the Musk get the tusk, it is known.", "score": 3, "replies": [{"body": "it is known", "score": 2, "replies": []}]}, {"body": "Stop, no way it goes under $500 ever again. Like i literally wont let it", "score": 9, "replies": [{"body": "Thank you, your dedication is appreciated", "score": 6, "replies": []}, {"body": "At the current share price, it only needs to drop ~25% to get under $500/share.", "score": 0, "replies": [{"body": "Yea but im throwing fat support at 500", "score": 1, "replies": [{"body": "Just in time for me to switch from puts to calls. So your the one I should be thanking?", "score": 1, "replies": []}]}]}]}, {"body": "I bought 5 $300p 4/3 exp. it was at $330 in November....", "score": 2, "replies": [{"body": "Holy shit dude didn’t you know they topped Boeing? Bet you would’ve shit yourself had I told you that 4 months ago", "score": 2, "replies": [{"body": "Ok but would that mean calls on Tesla or puts on boeing.", "score": 1, "replies": []}]}]}, {"body": "you won’t", "score": 2, "replies": []}, {"body": "  asd", "score": 1, "replies": []}, {"body": "Probably a good move since I just sold my May $600 puts today.  Now it will finally crash.", "score": 1, "replies": []}, {"body": "Get expiration date after earnings.  They're not going to warn about this quarter (even though they'll probably get sued for it; at the time of their offering they must have known a lot more than they let on about supply chain issues).  I had puts but sold them, 1) because of the high IV and the possibility the market remains delusional for a long time, and 2) because I saw some evidence that they're actually producing and delivering cars (which will make it possible for them to pretend it's a blockbuster quarter, even if they're only able to complete a trickle of cars).", "score": 1, "replies": []}]}
{"title": "Let's talk about how this crash winds down.", "selftext": "# EDIT: as suggested - ignore what I wrote below, let's open a discussion \n\n# \n\nWhat happens when the scare subsides.\n\nThe flight ban from Europe is bullshit, talk about closing the barn doors after the horses are gone.It is about 3 months late. There are already 3000+  cases in the US (1000 known, but judging by the mortality rate of the first cohort, I'd say that number is \\~3000 at least two weeks ago. and possible 10,000+ these days)Containment is long gone.\n\nWhen that becomes clear the flights will resume. what happens then?\n\nLikewise about the virus itself. since for the general population under 60 , the risk factors are very low, rather than quarantine everyone, what if society goes out, but seniors and sick people alone are quarantined ?at some point someone will suggest that mortality rates for healthy people under 50 are very very low, and the economy can resume.----OTOH what will cause a big short term scare? a dead senator? what about a week later when it turns out all the senators under 60 got better?", "id": "fhat7o", "created_utc": 1583987537.0, "score": 15, "upvote_ratio": 0.69, "num_comments": 49, "comments": [{"body": "Tom hanks has the coronavirus. The economy is done.", "score": 82, "replies": [{"body": "“Life is like a box of spreads.. you never know watcha GUH get.” No but really, If Forrest Gump dies, the market dies with him.", "score": 26, "replies": [{"body": "GUHna get", "score": 4, "replies": [{"body": "Corona GUHna give it to ya.", "score": 3, "replies": []}]}]}, {"body": "He said he didnt even know he had it, thought it was just a small cold. Hes more of a man then your wife's boyfriend.", "score": 1, "replies": []}]}, {"body": "Bulls really can't believe an 11 year bull market could actually come to an end, it's okay to be gay right now bro just accept it", "score": 45, "replies": [{"body": "It's the same at the end of every bull run. Disbelief.", "score": 16, "replies": []}, {"body": "Hahah bro they just can not accept it. It’s unbelievable. Hey bulls, look at any 100 year chart of one of the US markets. It’s littered with bear markets. This is nothing new. Natural part of the overall cycle", "score": 4, "replies": []}, {"body": "stonks only go", "score": 3, "replies": [{"body": "right. except in arab places they go left.", "score": 3, "replies": []}]}]}, {"body": "Has anyone thought about what’s gonna happen when the mosquitoes come back out", "score": 14, "replies": [{"body": "Lmfao oh fuck", "score": 7, "replies": []}, {"body": "dude i live in the most bullshit dense moist woods in the US , why you gotta be like dis... lol", "score": 6, "replies": [{"body": "I basically live in the swamp, I got mosquitoes already and i dont have the virus *cough* dont worry about that ive been coughing for months", "score": 1, "replies": []}]}]}, {"body": "You're skipping a step.\n\n1. No actuary prices this shit into premiums. Every single health and life insurance company is going to taste a big furry bear dick coming up behind their uvulas.\n\n2. Politics are gonna go apeshit in totally unpredictable ways, but one predictable thing is a government bailout of health insurance, which is a great reason to invest in small arms before things get better.\n\n3. Shit takes months to go through probate. Layoffs happen faster. JIT supply collapses faster still. Supply shock, then demand shock, then political nightmare.\n\n4. Look out below.", "score": 21, "replies": [{"body": "Small arms like a T-rex?", "score": 6, "replies": [{"body": "Right to bear arms bro. 2a 4 lyfe.", "score": 4, "replies": []}]}, {"body": "Agree", "score": 2, "replies": []}, {"body": "another Interesting bit is seasonality.   \nwhat if there are waves, this hits Canada and northern Europe in may, Australia and Africa in September", "score": 3, "replies": [{"body": "Some say it will be like Spanish Flu. It came, went away in summer and then came back again more fierce.", "score": 7, "replies": [{"body": "That was like 100 years ago tho which is huge in medical tech", "score": 1, "replies": []}]}]}]}, {"body": "Dude, Im buying a flight to Italy. Shits going to cost less than a Big Mac", "score": 10, "replies": [{"body": "Technically, since all flights are outlawed in 2 days, they’re gonna get expensive af cuz of supply demand crushed into those 2 days", "score": 7, "replies": [{"body": "Untapped market detected, buy flights now sell them on craigslist later", "score": 4, "replies": []}]}]}, {"body": "You should have just left your title and not typed anything else.", "score": 8, "replies": []}, {"body": "Bruh most people would prefer not to have people die but ok", "score": 19, "replies": [{"body": "if you quarantine the at-risk populations hospitals can treat the low number of critical patients better.", "score": 5, "replies": [{"body": "Until large scale testing is done to identify clusters inside the country, the virus will spread unchecked. The President didn't give any details about a testing program tonight. Until this is addressed, nothing will get better.", "score": 3, "replies": [{"body": "You mean the we tested 8 people yesterday program?", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Throwing all morals out the window here, but that would actually be kind of a good thing for the climate.", "score": 3, "replies": []}, {"body": "if you look at the numbers from S Korea, where they've tested 200K people.   \nthe CFR is more like 0.5%  \nit only looks like 33% if the denominator is smaller because you don't detect who has it.   \ni expect that as the tests aren't completely random there the number might be even lower", "score": 1, "replies": []}]}, {"body": "Do you really think these precautions will be taken.", "score": 2, "replies": [{"body": "the current state is worse", "score": 3, "replies": []}]}, {"body": "I suppose you could try to lock the boomers in camps but I don't think it would work.", "score": 1, "replies": [{"body": "it can be homes , or even hotels", "score": 1, "replies": []}]}]}]}, {"body": "hey why don't we just accelerate the process and eliminate the upper cohort ourselves? Then we can go back to having eternal economic prosperity and shit", "score": 5, "replies": []}, {"body": "Companies earnings are screwed for a few quarters from this now.  And what happens if it starts all over again in China once the go back to work?  This could last for another 6 months.  Pretty scary.", "score": 3, "replies": []}, {"body": "I doubt you have a quorum with senators under 50.", "score": 3, "replies": []}, {"body": "https://youtu.be/fUFGdXjSf5Q\n\nOk if it only affects boomers why are there kids and young people dying from it in China, Italy, and Iran?\n\nI think we're being lied to because a mass panic and breakdown of society is probably worse than the Covid-19 itself.", "score": 3, "replies": [{"body": "ofc were being lied to, i know it goes without saying but welcome to the USA", "score": 2, "replies": []}]}, {"body": "First of all, it's significantly more likely to result in hospitalization even for people in their 30s and 40s.\n\nIt will raise deaths from other causes and health systems are overwhelmed.\n\nThe full retirement age is 67. People tend to make the most toward the end of their career. These are the high earners who spend the most on leisure because they don't have kids to support.\n\nThe ones who survive won't retire during a crash; they'll put off their retirement. Same thing happened in 2008.\n\nPeople aren't going to just let their parents, aunts, & uncles die.\n\nMillions of people missing several weeks of work because they're sick, and a million or so retirees dying, will have its own major impact on the economy. Municipalities will have a reduction in property tax funds at the same time they need more funding. Vacant housing will double. Municipal funds will default.\n\nRetirees do a lot of shadow work, like taking care of kids. Working parents will become stay-at-home, reducing household income.\n\nThere's too much negative side to just letting it go.", "score": 3, "replies": []}, {"body": "We wait for Wave 2 in October", "score": 2, "replies": []}, {"body": "Heard on the JRE podcast that obese people are likely to die from beer virus, so America is fooked, gonna lose like 10% of its population.", "score": 2, "replies": []}, {"body": "They tested only 8 people nationwide yesterday", "score": 2, "replies": []}, {"body": "Thinkorswim orders are down. 24/5 trading is not working.\n\n'unexpected server error'\n\nAnyone else experiencing this?", "score": 1, "replies": [{"body": "Who places orders through ToS?", "score": 3, "replies": []}, {"body": "Miss out on sweet put tendies because of unfilled RH orders like the rest of us you corncob.", "score": 2, "replies": []}]}, {"body": "KEEP THOSE OLD FUCKS OFF THE ROADS!", "score": 1, "replies": []}]}
{"title": "75k Loss Porn With Just Stock https://imgur.com/wL51uzm", "selftext": "[deleted]", "id": "fhh60m", "created_utc": 1584023311.0, "score": 79, "upvote_ratio": 0.88, "num_comments": 50, "comments": [{"body": "They are stock. Why did you sell?", "score": 62, "replies": [{"body": "Yeah for real. Better to wait a year than eat those losses.", "score": 31, "replies": []}, {"body": "Because I believe this will go even more lower.", "score": 16, "replies": [{"body": "Maybe short term but in a while from now you would have recovered, panic selling is both autistic and a pussy move", "score": 87, "replies": [{"body": "yeh I agree. I am both a pussy and autistic.", "score": 59, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Losing money to make money. The true retard way", "score": 16, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "did u make money though", "score": 1, "replies": []}]}]}]}, {"body": "Just a pussy.\n\nIf you were autistic you’d be stacking gains on puts like the rest of us retards.", "score": 2, "replies": []}, {"body": "Nah, autists make money bub", "score": 1, "replies": []}]}, {"body": "75k loss to not buy puts and get shit karma LMFAO", "score": 0, "replies": []}]}, {"body": "Bruh buy them back right now. You can have you’re money back in a few years", "score": 12, "replies": [{"body": "This will go down even more, the virus has not even effected a lot of US communities yet.", "score": 3, "replies": [{"body": "You’re gonna have to try to time the bottom 🤷‍♂️ Good luck", "score": 7, "replies": [{"body": "Yeh. Will be eating only ramen and low cost food from nowadays.", "score": 3, "replies": [{"body": "Jesus Christ you fucked up", "score": 1, "replies": []}]}]}, {"body": "How many more times will you think you know how to time the market before you quit the idiocy??", "score": 3, "replies": []}, {"body": "Buy the stocks and then hedge with put options if you think it's going lower.", "score": 3, "replies": []}, {"body": "If you’re convinced it’ll go lower why not purchase Puts? They’ll be cheaper than you trying to repurchase the stocks and once you collect your $$ with the Puts roll those gains into shares.", "score": 3, "replies": []}]}]}, {"body": "But all you saved was $500?? How is saving $500 worth losing the chance to recover a much larger portion of your investments in a year or 2?", "score": 2, "replies": []}, {"body": "I'm with you dude, you can buy back in during later at even further reduced prices. Estimates are that all US hospital beds will be full by May 5th, that's my bet for the bottom.", "score": 1, "replies": []}]}]}, {"body": "How do people have this much money to invest but are this retarded?", "score": 30, "replies": [{"body": "because we are not retarded with our professional life :)", "score": 15, "replies": []}, {"body": "Fuck if I had half the money these fucks have I’d have lost 98% of that", "score": 7, "replies": []}]}, {"body": "Came here to fap....not copy paste...", "score": 10, "replies": [{"body": "Glad I could help", "score": 5, "replies": []}]}, {"body": "And.....you didn't average down?", "score": 7, "replies": [{"body": "I did at FSLY and this is the result.", "score": 2, "replies": [{"body": "Damn dude.\n\nWell I dumped my losing stock positions about 2-3 weeks ago and took a 15k loss (which I can afford to lose). However I locked in profits on some other stocks prior to that, so it kinda breaks even in the end. That being said, I didn't gain nor lose much in 2020.\n\nI also kept averaging down my losing positions until I said fuck it....because this market has a long way to go down. Usually CAD works when if it dips and goes back even higher...given that the market outlook is good. But this coronavirus thing is a different beast, the market outlook is BAD and you'll just be throwing in money to break even. I rather take a small loss than going balls deep into this recession. At the very least I can still go back in when it kinda bottoms down even more. Perhaps do some YOLOs later on.\n\nYea dude you can make it all back, but health is way more important than money right now. Be grateful that you're alive and well.", "score": 1, "replies": [{"body": "thanks brother. I hope you all are good healthy and corona free. Based on my luck I will get corona also :)", "score": 1, "replies": []}]}]}]}, {"body": "You sold your stock...in a bear market...thank god you weren't holding options or you'd be down 99%", "score": 5, "replies": [{"body": "yeh.", "score": 1, "replies": []}]}, {"body": "ya fucking virus mate screwed us all.", "score": 4, "replies": [{"body": "yeh and I love Corona Beer :(", "score": 1, "replies": []}]}, {"body": "why would you ever sell stocks you fucking retard\n\nyou aren't buying the price you're buying the share. wait for that shit to recover", "score": 3, "replies": []}, {"body": "Boomers die twice. First their portfolio/401k and then second irl from beerflu", "score": 7, "replies": [{"body": "I am not even a boomer. Lost 2 good years of savings.", "score": 3, "replies": [{"body": "it was only a loss once you sold.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "you will recover!.", "score": 2, "replies": []}]}, {"body": "Sorry brotha. I'm near as hell but you will bounce back.", "score": 1, "replies": []}, {"body": "what's it like living with downs syndrome?", "score": 1, "replies": []}, {"body": "Why didn't you sell covered calls?", "score": 1, "replies": []}, {"body": "I lost $35k gains from last two years. 😔", "score": 1, "replies": []}, {"body": "If you get in at a better price, you can pretend like nothing happened and have more than what you started with", "score": 1, "replies": []}, {"body": "I feel sick and I just started investing this week 🤢", "score": 1, "replies": []}, {"body": "every company out there trading like its bankruptcy.", "score": 1, "replies": []}, {"body": "Did you buy these back during rally? Just curious", "score": 1, "replies": []}]}
{"title": "Why TESLA still has A LOT on its plate and still so much more to lose", "selftext": "TESLA skyrocket on hype and grew by nearly 8x in under a year\n\nlast year they were worth $180 at their lowest\n\nim not bearish on tesla overall i do believe that theyre a great company but they have so much meat on their bones right now and theyre still dipping\n\nI have puts on Tesla right now and its printing\n\nthis market is not going to turn around until mid april and were going to be seeing a lot of volatility\n\nTL;DR Tesla has too much meat on their bones and can drop significantly more, Puts for anything Tesla with exp 4/17 and after\n\nEdit: If puts are too expensive for you buy debit spreads retards", "id": "fhj52w", "created_utc": 1584030912.0, "score": 48, "upvote_ratio": 0.9, "num_comments": 49, "comments": [{"body": "not gonna bet against daddy musk", "score": 62, "replies": [{"body": "imagine if Musk gets the beer flu. that will tank like nothing", "score": 18, "replies": [{"body": "Meh, mortality at 48 years old is like 0.4%, and he has access to high grade health care. He'll be fine.", "score": 7, "replies": [{"body": "He'll be fine but the stock will be at discount.", "score": 11, "replies": []}]}, {"body": "Icing on his cancer cake.", "score": 2, "replies": []}, {"body": "Elon Musk is immune to the 🍺🦠. I’m buying TSLA calls not puts!", "score": 0, "replies": []}]}, {"body": "YUP. You’re more likely to lose money betting against Daddy Enron. He’s a master pumper.", "score": 7, "replies": [{"body": "Tesla is hyped.  Enron was fraud.  There's a *massive* difference.", "score": 1, "replies": [{"body": "> Tesla is hyped. \n\nYou still don’t get it, do you? TSLA is one of the most shorted underlying. Historically, shorts lose money on TSLA. \n\n“Tesla is hyped. “ This is why it has current valuation. There is a huge difference in term of fundamental value and hype. Never go against market sentiment. \n\nEverything is going down so you can make money on TSLA short but it’s more risky than a DIS put. Eron Muskrat can make an announcement that they have multiple cupholders in their Cybertruck and the stock will reach $1,000. It’s a dumb example but TSLA is dumb.", "score": 9, "replies": [{"body": "/u/neocoff said:\n\n> YUP. You’re more likely to lose money betting against Daddy **Enron**. He’s a master pumper.\n\nRe-read what I wrote, and what it was in response to.  \n  \nThrowing Enron shade at Tesla is disingenuous.  Elon Musk is no Ken Lay.", "score": -1, "replies": [{"body": "I’m in the energy sector and is aware of its history. Eron was a play on his name. Eron is a play on how people short will go broke. Eron is also a play on TSLA valuation.", "score": -2, "replies": []}]}]}]}]}, {"body": "you should for now", "score": 1, "replies": []}]}, {"body": "because they never make a profit and never hit a deadline.\n\nThe problem with betting against tesla stock is that the people who buy the stock are morons who don't understand simple fundamentals. Thus they never sell and only buy more.", "score": 24, "replies": [{"body": "$SPCE same boat", "score": 9, "replies": [{"body": "Spce puts are printing hard", "score": 7, "replies": [{"body": "i had space puts and sold too soon\n\nfuck", "score": 1, "replies": [{"body": "Mine are $14 4/17p just printing all day. Already itm and only going to go higher as thins thing tanks further", "score": 1, "replies": []}]}]}]}, {"body": "> The problem with betting against tesla stock is that the people who buy the stock are morons\n\nthats the point, the morons are doing exactly as morons do, selling their tesla stock", "score": 3, "replies": []}, {"body": "Thought that would be SPCE too but the bottom fell out", "score": 1, "replies": []}]}, {"body": "You're betting against the company that has a bio-weapon defense mode in their cars? Watch, in the next year, everyone EXCEPT Tesla owners will have died off from Covid-19.", "score": 10, "replies": []}, {"body": "30 billion deficit in debt?", "score": 5, "replies": [{"body": "how much does GM or Ford Have. What's the debt to cash ratio comparison?", "score": 1, "replies": [{"body": "GM has $100B. Ford has $150B. Both have much worse ratios.", "score": 4, "replies": [{"body": "Their all gonna get fucked again like 2008 lol", "score": 5, "replies": []}]}]}]}, {"body": "You had me at meat.", "score": 6, "replies": []}, {"body": "Q1 deliveries are going to bomb.  Buy 4/3 puts.", "score": 3, "replies": [{"body": "Based on?", "score": -1, "replies": [{"body": "How many people buy $40k toys in the middle of an economic downturn and boomerciding pandemic?", "score": 8, "replies": [{"body": "982k degenerates", "score": 6, "replies": [{"body": "#🤑", "score": 1, "replies": []}]}, {"body": "Downturn in orders I understand. He said deliveries, which I’d imagine are in regards to orders from 2019.", "score": 2, "replies": []}]}]}]}, {"body": "Those premiums... I've never seen so many numbers before the decimal point.", "score": 3, "replies": []}, {"body": "You fool!", "score": 2, "replies": []}, {"body": "420 puts loaded up", "score": 2, "replies": [{"body": "That would’ve sufficed.", "score": 1, "replies": []}]}, {"body": "I don't doubt papa musk. It's one of my fundamental trading rules.", "score": 2, "replies": [{"body": "I dont doubt him in the long run either, but for now puts", "score": 3, "replies": [{"body": "He is going to do something crazy to pump up the stock. YOLO calls", "score": 2, "replies": [{"body": "Boring Company Bazooka incoming", "score": 3, "replies": []}]}]}]}, {"body": "Tesla is rallying bitch", "score": 2, "replies": [{"body": "Only because of FED money retard, give it time", "score": 3, "replies": []}]}, {"body": "strikes are so expensive today though", "score": 1, "replies": []}, {"body": "the graveyard is littered with smart money managers whose only job is to short", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "*meat on the bones*", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "This small rally is a good place to get in on cheaper puts\n\nMoney won’t save the market", "score": 1, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "Real shit-talk, are we gonna hit zero?", "selftext": "The market nor this sub can do this forever.\n\nX bad thing happens followed by autistic screeching, \"bUy MoRe PuTs\". How long can we repeat the chant? $DIS surely is worth more that $20 a share, right? Where the hell is the bottom? $BA loses $20 a share 5 days ago, \"oh that can't happen again\". But here we are and it's happened 5 times!\n\nCan blue chips really get so undervalued that my teriyaki chicken costs more than a share of $NKE???", "id": "fhnggl", "created_utc": 1584046580.0, "score": 33, "upvote_ratio": 0.83, "num_comments": 58, "comments": [{"body": "spy $69 ~~5/15~~ 4/20", "score": 68, "replies": [{"body": "Spy $69 4/20", "score": 15, "replies": [{"body": "Nice", "score": 1, "replies": []}, {"body": "nice", "score": 1, "replies": []}]}, {"body": "Nice", "score": 10, "replies": [{"body": "Nice", "score": 4, "replies": []}]}, {"body": "This is the way", "score": 6, "replies": [{"body": "you know those Disney quotes [aren't aging well](https://img.cinemablend.com/filter:scale/quill/3/3/3/3/1/6/333316f07050150abe3c9abdec2e00e370c14bd6.png?mw=600 \">$150 ---> <$90\"), right?", "score": 2, "replies": []}]}, {"body": "Truth", "score": 4, "replies": []}, {"body": "69 4/20", "score": 3, "replies": []}, {"body": "Noice", "score": 3, "replies": []}]}, {"body": "This is the same question as the one posed before the crash.\n\n\"how can these companies keep valuations which aren't reflected by balance sheets or other fundamentals?\"\n\nit's a balancing act. We are tilted far on the other end right now.\n\nWhere it will tilt next week, I wouldn't be bold enough to say. I'm out as of today with over 380% gains. Coulda been more if I had more balls but I'm happy for now to sit on the sidelines.", "score": 36, "replies": [{"body": "Yeah i have strong conviction either way.", "score": 4, "replies": []}]}, {"body": "Last two crashes after tech bubble and financial crisis were more than 50% peak to trough. This so far is 28%ish?", "score": 27, "replies": [{"body": "Yeah but that 50% was over *months,* not weeks. This is... I don't even know what this is anymore.", "score": 35, "replies": [{"body": "This is the end of donald pump is what it is", "score": 37, "replies": [{"body": "He's about to pump another 1.5T.", "score": 5, "replies": [{"body": "If they injected 500B today and it didn’t do shit, 1.5t will just be a baby cat bounce. Dude needs to make a real plan and accept the fact that the flu destroyed his “great” economy propped up on overvalued companies and popsicle sticks.", "score": 8, "replies": []}, {"body": "When", "score": 2, "replies": [{"body": "Fuck probably tomorrow.  It was in the news 4hrs ago.\n\nhttps://www.cnbc.com/2020/03/12/fed-to-pump-more-than-500-billion-into-short-term-bank-funding-expand-types-of-security-purchases.html\n\nEdit: 500B", "score": 3, "replies": [{"body": "Pump it up so it can crash harder. I like it.", "score": 3, "replies": []}, {"body": "Good idea is to buy puts when they announce they are going to actually do this on whatever day.", "score": 1, "replies": []}]}, {"body": "Already priced in. People will take any pump as an opportunity to dump pisitions", "score": 1, "replies": [{"body": "As long as it dumps and my puts print", "score": 1, "replies": []}]}]}]}]}, {"body": "Those were simpler and slower times back then. Now we have server farms managing 80% of the economy", "score": 11, "replies": []}, {"body": "That's kind of it. For perspective, 28% is nothing for a serious situation as this is shaping up to be. But I've never seen anything like this. Neither the velocity of the decline in the market, or the what's happening in the real world.\n\nThis could blow over in a month or two, or it could be the next great depression.", "score": 7, "replies": []}, {"body": "This is what happens when everybody's on fuckin options and shorting the vix. The exits get crowded fast. If anything its good for bulls because the market is more likely to overreact and create a buying opportunity if anything.", "score": 4, "replies": [{"body": "Not yet", "score": 1, "replies": []}]}, {"body": "It's fast down and (relatively) fast back up", "score": 2, "replies": []}, {"body": "This is algo trading :)", "score": 1, "replies": []}]}, {"body": "This will be worse since it’s multiple events at once", "score": 2, "replies": []}]}, {"body": "negative stonks", "score": 19, "replies": [{"body": "Stonks only go down", "score": 8, "replies": []}, {"body": "how do i buy puts on negative stonks", "score": 1, "replies": []}]}, {"body": "You've got an index fund bubble. People are freaking out because they are close to retirement (and for some reason kept their money in spy instead of shifting for a more stable route), and there are plenty of people who have been told to just buy index funds that have never gone through a bear market. Now they are all selling at once and the market is taking a beating.", "score": 17, "replies": []}, {"body": "Negative stocks. You'd have to pay your brokerage to take those NKE shares out of your account.", "score": 15, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "People don’t seem to fucking care about absolute inflation anymore. They only consider “relative inflation” and as long as all central banks are pumping stocks together (BoJ being the most shameless), relative currency exchange numbers hardly get impacted.", "score": 4, "replies": []}, {"body": "Hyperinflation would cause stock prices to rise", "score": 2, "replies": [{"body": "...and rise they have; now comes the reckoning", "score": 1, "replies": [{"body": "That wasn't hyperinflation though, Venezuela had hyperinflation we do not.", "score": 1, "replies": []}]}]}]}, {"body": "Its called wealth redistribution", "score": 11, "replies": [{"body": "Can you explain? I’ve seen banks like Chase that are making billions off shorting various stocks. Those are the mid-upper class right?", "score": 3, "replies": [{"body": "At the end of this we will have two groups of people.\nThose with financial aptitude and those who don't", "score": 14, "replies": [{"body": "+1 and Amen.", "score": 2, "replies": []}]}]}]}, {"body": "The market? No. You personally? Most likely.", "score": 7, "replies": []}, {"body": "Another year or so of huge drops. I dont know if any of guys remember 2008", "score": 7, "replies": [{"body": "I might just get tired of winning.", "score": 5, "replies": [{"body": "You would think so. But actually no. Fortunately you will be able to find out for yourself.", "score": 3, "replies": []}]}]}, {"body": "Today we wiped out gains from 2016. I see no reason to wipe out gains from 2010.", "score": 5, "replies": []}, {"body": "50% from ath, that's the bottom. We are about halfway from absolute bottom.\n\nLong $nobl", "score": 3, "replies": []}, {"body": "If we do I will buy all the shares and we can start over.", "score": 4, "replies": []}, {"body": "We gonna get paid extra?", "score": 3, "replies": []}, {"body": "SPY 157", "score": 2, "replies": []}, {"body": "You're right. It's gonna be boring when all stocks are sub $10.\n\nThen it will be pennies in front of a steam roller.", "score": 2, "replies": []}, {"body": "in 2009 the crash was believed to be caused by a liquidity crunch.  Since banks were holding toxic assets they were cashing in liquid assets (stocks) to cover cash flow (avoid insolvency) and that forced the market down.  I don't really believe this because it doesn't make very much sense if you think about it.  The banks themselves don't hold very much stock, do they?  Not compared to investor money and institutional money.  I believe there is one half of the equation that is missing.\n\nYou have to look not just at the potential returns, which obviously need to be repriced over the next few years, but also the risk of those returns.  Riskier assets will have a lower price to compensate the asset holder and that is what is happening here.  Since we don't have any idea on how to really reprice those returns, investors don't want to hold the asset.\n\nLike in 2008, while most stocks recovered quickly, many took much longer, and many never recovered fully ever.  How should investors know which is which?  \n\nThat's my take at least.", "score": 2, "replies": []}, {"body": "Real shit-talk, spy 210 at worst.", "score": 1, "replies": []}, {"body": "We're not going to see the bottom until some BBB corporate debt gets defaulted upon.", "score": 1, "replies": []}]}
