{"title": "Dow futures point to a loss of 500 points after Tuesday’s surge", "selftext": "https://www.cnbc.com/2020/03/10/dow-futures-point-to-a-loss-of-more-than-400-points-after-tuesdays-surge.html\n\nAround 7:40 p.m. ET, Dow Jones Industrial Average futures were down about 366 points, indicating a loss of more than 500 points at the open. S&P 500 and Nasdaq 100 futures also pointed to sharp losses.\n\n“Stocks posted impressive headline gains, but more strength needs to be seen beneath the surface to have confidence that the downside momentum in stocks has been broken,” Willie Delwiche, investment strategist at Baird, said in a note. “The weight of the evidence continues to argue for caution in the near term and we recommend that investors remain patient in the face of ongoing market volatility.”", "id": "fgnxgt", "created_utc": 1583885251.0, "score": 91, "upvote_ratio": 0.91, "num_comments": 56, "comments": [{"body": "Let it crash.", "score": 61, "replies": [{"body": "I see r/wallstreetbets has joined the sub", "score": 37, "replies": [{"body": "Roll call", "score": 14, "replies": [{"body": "Present", "score": 12, "replies": [{"body": "Puts reporting for duty", "score": 9, "replies": [{"body": "SQQQ calls reporting for duty", "score": 7, "replies": []}]}]}, {"body": "Just give me a strike price and a date already!", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Never short Our God Tesla!", "score": 0, "replies": []}]}]}]}]}]}, {"body": "With intraday thousand-point swings it doesn’t seem to matter what the market opens at.", "score": 34, "replies": []}, {"body": "It's raining like dead cats.", "score": 36, "replies": []}, {"body": "Its rainin debt!\n\nHalleluja!\n\nIts raining debt...Yeah!", "score": 13, "replies": [{"body": "Money is debt", "score": 2, "replies": [{"body": "Actually, lack of money is debt.", "score": 5, "replies": [{"body": "Go take a look at what is says on a dollar bill.", "score": 6, "replies": []}]}]}]}, {"body": "Was expected.  Tuesday was the dead cat bounce now for the stocks to fall for a few more days.", "score": 14, "replies": [{"body": "Ftse didn't even manage to bounce, dead cat splat of an index...", "score": 4, "replies": []}]}, {"body": "Only true morons felt bullish after today’s dead cat bounce. When you don’t know who the mark at the poker table is, it’s you.", "score": 18, "replies": []}, {"body": "you guys think oxy will come out healthy after the upcoming oil bankruptcies? or should people just invest in xom to pull a jpm after the banks fell?", "score": 3, "replies": []}, {"body": "All of my life I’ve been taught that the fed dictates the economy but in the past month it seems like the media is far more dominant. It’s hard to predict what my next move should be in such a volatile atmosphere.", "score": 3, "replies": [{"body": "Day trade or hide seem to be the main opinions recently. Either get in and get out, or wait for the shit to finish hitting the fan", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "what’s cho", "score": 7, "replies": [{"body": "Cho mama", "score": 30, "replies": [{"body": "Gottem", "score": 4, "replies": []}, {"body": "I heard cho mama is going down hard tomorrow.", "score": 8, "replies": []}]}]}]}, {"body": "Okay, newb question.  If I have stock X @ $100 (at end of trading today).  But after hours shows it currently at $95...\n\nIf I put in a standard sell now for tomorrow's opening is it likely that it will sell pretty close to that $95 mark?\n\nThanks in advance.", "score": 3, "replies": [{"body": "Putting a market order to sell before open can open up risk. You can see where pre market is before open tomorrow and set a limit sell order at a price you are comfortable with. You can always modify the order after the initial bidding if it does not fill.\n\nThe reason for this is depending on your broker and how quickly they execute your trade can vary, and you may not get the best price.", "score": 11, "replies": [{"body": "This is very helpful!  Thanks for this!", "score": 2, "replies": [{"body": "No worries, if you purchased the shares at a price significantly lower than the pre market price, a market order wouldn’t be too bad if you just want to exit the position quickly (and vice versa if you are trying to mitigate loss on shares you bought at a much higher price than pre market) Just be especially careful as volatility is so high right now, prices could change by multiple percentages almost instantly", "score": 2, "replies": []}]}]}, {"body": "No. What you are seeing is the after hours market. That will end. Premarket will then open. Then the regular session. Depending on news, macro factors or anything really, the stock price could change dramatically. If you put in a standard sell it could be dramatically higher or lower than you 95 price. \n\nGood luck in the markets.", "score": 5, "replies": []}, {"body": "It can still fluctuate in premarket. But premarket prices will (mostly) dictate how the stock will open, so it will sell closer to premarket price rather than last day's end of day price.", "score": 3, "replies": [{"body": "That's what I suspected.  Thank you!", "score": 1, "replies": []}]}, {"body": "yes itll sell at whatever price it opens with. So it could be even higher then 95 or even lower", "score": 2, "replies": []}]}, {"body": " 🌈 🐻  has entered the chat", "score": 1, "replies": []}, {"body": "Looks like another big shit show today no bump up from the Biden win or Trump stimulus", "score": 1, "replies": [{"body": "My guess is Biden becoming the nominee had been mostly priced in after last Super Tuesday. The bad news in the US is much worse this week.", "score": 2, "replies": []}]}, {"body": "Dec 2018 levels or lower?", "score": 1, "replies": []}, {"body": "It’s already down way more than 500.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "I suggest you split it up. It could be even lower tomorrow. Or it could be back at record highs tomorrow seriously I have no idea anymore. I feel like this is going to be a while. I have some index mutual funds that I'm tossing a few bucks into every time the market has a spectacularly bad day. You could split up your $10k into ten contributions into the same fund spread out over ten obviously low days. You could split it into 50. They call this cost averaging down. You won't know what it fills for until after close, depending on provider. But If hate for you to throw it all in on one day and then maybe we still have another 5 10 20 percent down to go I have no idea if there even is a bottom. Or how far back up it will eventually go. Stay well and good luck!", "score": 5, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I'd give yourself five to ten minutes though I mean what if your app freezes up or you need to go to the bathroom, but yes, that's what I have been doing each time my mutual fund is filled a little lower than the last one ... as we trod on down ... Most mutual funds are calculated with a specific proprietary formula that changes day to day based in the expertise of their active managers. It is my understanding a S&P index mutual fund like the one you describe typically get close to the actual S&P performance but there may be variations, but that's their goal at least.", "score": 2, "replies": []}, {"body": "I'd give yourself five to ten minutes though I mean what if your app freezes up or you need to go to the bathroom, but yes, that's what I have been doing each time my mutual fund is filled a little lower than the last one ... as we trod on down ... Most mutual funds are calculated with a specific proprietary formula that changes day to day based in the expertise of their active managers. It is my understanding a S&P index mutual fund like the one you describe typically get close to the actual S&P performance but there may be variations, but that's their goal at least.", "score": 1, "replies": []}]}]}, {"body": "No one knows, but my guess is the S&P500 goes much, MUCH lower in the coming weeks.", "score": 2, "replies": []}, {"body": "This volatility wont matter if you are holding long term", "score": 3, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "People try to time the market all the time. The reality is that most of them end up losing out, or losing money entirely. \n\nDay traders also love to time the market. Yet 99% of them lose money. 10% daily swings are not normal anyhow. The bearish market we are trending is not normal in general; hence the huge daily swings. My advise to you, if you do not know what you are doing investing in the market, is to hold off for the next month and spend that time researching instead.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "And what makes you think that if it’s hypothetically down 10% that day, that it won’t continue to tank? Like the other commenter said, if you’re investing long term you shouldn’t be concerning yourself too much with daily swings.", "score": 2, "replies": []}]}]}, {"body": "The problem is it is difficult to time the markets. The people who do and are successful work at it and study it full time.", "score": 1, "replies": []}]}]}, {"body": "Usually you can select to either do it ASAP, do it at the end of day, do it as soon as the market opens, or set a target price meaning buy it when you can buy it for $X.  I usually just tell Fidelity to buy, and it does it some time in the next 15 mins.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Sorry, I'm no expert.  On Fidelity my mutual funds seem to get done quick, but I realize that I buy them late in the day PST, so maybe they just get done at close.  Makes sense as then they can confirm the current value of every stock without them all changing every instant?", "score": 1, "replies": []}, {"body": "MFs get added EOD because you’re not buying a stock on the open market, you’re buying a unit of a fund that has to determine NAV based on what’s inside it. They only can do that once the market is closed.", "score": 1, "replies": []}]}]}, {"body": "Why are u a-holes down voting a guy for asking a question?", "score": 1, "replies": []}]}]}
{"title": "Tesla scouting central US for new factory, Musk says...", "selftext": "", "id": "fgq282", "created_utc": 1583894191.0, "score": 105, "upvote_ratio": 0.97, "num_comments": 52, "comments": [{"body": "[deleted]", "score": 50, "replies": [{"body": "Lmao. Nah. They just Skype and jerk off together.", "score": 6, "replies": [{"body": "Furiously jerk off!", "score": 1, "replies": []}]}]}, {"body": "TESLA ONLY GOES UP", "score": 53, "replies": [{"body": "This is the old WSB I remember", "score": 32, "replies": [{"body": "That was less than a month ago, but it feels like a year ago. I didn’t know autism could distort space-time", "score": 32, "replies": []}, {"body": "We're still here. Waiting for our triumphant moment to strike", "score": 11, "replies": []}, {"body": "Is this nostalgia?", "score": 8, "replies": [{"body": "Feels like it", "score": 6, "replies": []}]}]}]}, {"body": "So does Tesla moon tomorrow? This stock has been known to do that even on a red day lol", "score": 15, "replies": [{"body": "Thank god I bought a call today like an idiot", "score": 9, "replies": [{"body": "Haha same bro I was feeling it", "score": 5, "replies": [{"body": "What are you sitting on? I picked up a $650 4/3", "score": 4, "replies": [{"body": "3/20 1000 🤑", "score": 1, "replies": [{"body": "Yikes. I sold mine on the pump today. Didn’t make a lot, but got out of it", "score": 1, "replies": [{"body": "I'm down about 85% bought last week at and then again monday and again yesterday so my loss is bigger but my cost is down like a full on autist", "score": 2, "replies": [{"body": "Might as well let it expire worthless now", "score": 2, "replies": [{"body": "That's the plan at this point", "score": 2, "replies": [{"body": "If there’s enough residual, cash out and buy a spy put", "score": 1, "replies": [{"body": "What expiration? Strike? Roughly 1200", "score": 2, "replies": [{"body": "Really depends on how everything is set up in the morning, but I’d buy about 30-45days out and as close to strike as you can", "score": 1, "replies": [{"body": "I'll report back if I get into any", "score": 2, "replies": [{"body": "Markets more likely to go down at this point, especially after tonight’s trump talk", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "Expiration, dude!", "score": 1, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Wow you really belong here", "score": 9, "replies": [{"body": "8 calls @800 4/17 \nLevel 9 Autism initiated", "score": 5, "replies": []}]}, {"body": "Absolutely not", "score": 1, "replies": []}, {"body": "Ban", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "Is Musk attempting to manipulate the market again? The timing seems a bit fishy to me. Does anyone else agree or disagree?", "score": 41, "replies": [{"body": "China would be on fire and the stock would go up 20 %", "score": 24, "replies": [{"body": "my wife’s bf has a truck he’ll give you 😏 once he’s done fucking me into the ground with these puts. jesus fuck", "score": 11, "replies": [{"body": "If it’s a Cybertruck, I’m in you motherfucker!", "score": 3, "replies": []}]}]}, {"body": "Agree, apparently he bought shares at the top. \n\nCan he piss off? My whole portfolio is literally just one TSLA 4/17 $600 put that I bought for 2k", "score": 20, "replies": []}, {"body": "I want that truck bbaadddd. Give it to me daddy elon.", "score": 5, "replies": []}, {"body": "Interest rates on nearly everything is low. Perfect time to build. Not fishy", "score": 1, "replies": [{"body": "Interest rates now, which would require they have a location. This process won’t be overnight. I get the sense that Elon / $TSLA is trying to manipulate the market. The stock is waaaaay over-valued.", "score": 1, "replies": [{"body": "Absolutely. He knows fanboys would gladly buy shares on a milligrams of seemingly good news.", "score": 1, "replies": []}]}]}]}, {"body": "Who cares, priced in", "score": 16, "replies": [{"body": "I'm pretty sure a few dozen factories are baked into TSLA valuation already. But, I also thought that before it mooned and cratered. Idk wtf is happening anymore. ¯\\\\\\_(ツ)_/¯", "score": 9, "replies": []}]}, {"body": "Lol. It's the Amazon whoredom pt2. Little Rock about to get a giant boner for Elon.", "score": 4, "replies": [{"body": "Can’t wait to see the competition videos...", "score": 2, "replies": []}]}, {"body": "Texas Texas Texas!", "score": 4, "replies": []}, {"body": "spending billions building new factories and expanding into new countries while the world is collapsing. any other companies in this situation? .. seems obvious tsla gonna be winner of market wealth transfer", "score": 4, "replies": [{"body": "This, When we do bottom out, tesla calls are the way. WsbGod made a good call, buying 1200c on the dip, but executed it to early. (the dip turned out to be a huge sinkhole)\n\nshit this first q are going great for Tesla \n\nThey raised a ton of money on the top of the marked, so they have a ton of cash at hand.\n\nshanghai giga - back online since feb 11, they are looking to get a 2de shift online fast.\n\nModel y - ramp up looks good, deliveries started already\n\nThey have held a lot back to present at the battery investor day.\n\nTesla energy looking good with the fall of oil.\n\nThe competition is in a hard ass transition period, a crisis hurts them. So they have no chance to really compete with tesla in the next 5 years.\n\nTesla stock is holding up quite well in the crash, there still 50% up since the start of 2020.", "score": 1, "replies": [{"body": "Who’s buying cars rn, besides wsbgod? \n\nI’d like to see how many Model Y & Cybertruck cancellations there have been since, and where their current order counts sit compared to 2 months ago.", "score": 2, "replies": []}]}]}, {"body": "I've heard yo mama has plenty of prime real estate", "score": 3, "replies": [{"body": "When she sits around the house she sits *around* the house.", "score": 3, "replies": [{"body": "Dayyum!", "score": 3, "replies": []}]}]}, {"body": "Makes sense though - the heartland will be a key demo for this vehicle", "score": 2, "replies": []}, {"body": "Buy Puts, this is not money well spent.", "score": 4, "replies": []}, {"body": "Damn, this means they are going to miss their 2021 Cybertruck production date. And they just lost one of their lead manufacturing executives....... if they need to build a factory and get it up to full production volume, there is no way that happens in a year in the US. Maybe 2 years with a lot of help from the state. This is bad news spun in a positive light.", "score": 4, "replies": [{"body": "That’s what I was thinking might be happening - the reality distortion field is strong with Elon.", "score": 2, "replies": []}]}]}
{"title": "Want some Nice, Easy Tendies? Look out for NET", "selftext": "If you search Cloudflare right now, all the algo sites are talking about how their lock up ends tomorrow 3/11.\n\nBut if you check their actual SEC filing, the lock up actually already ended on Feb 19.\n\nhttps://www.sec.gov/Archives/edgar/data/1477333/000147733320000004/net202002138k.htm\n\nFeb 19 is when the stock started mooning (11.35 % in one day). Ergo, same thing going to happen tomorrow.\n\nThey have the highest market share (35.7%) of anybody in the CDN space and they are just going to keep improving on that.\n\nhttps://www.datanyze.com/market-share/cdn--10\n\nYou know what happens to companies that beat out Google and Amazon in marketshare? Google and Amazon have a bidding war to buy them out.  Competition is for capitalists, not monopolies like Google and Amazon. Which is why it might be way smarter long term to hold shares as opposed to calls in case of an acquisition.\n\nHowever, in the short term, calls seem especially juicy. Tech stocks have been taking a beating, and for the most part, NET was largely unaffected. When INO finally announces a cure and saves the world, tech will come roaring back, and NET will likely ride the coattails to tendieland. \n\nAlso just to be serious for a moment, one of their cofounders has a disease called Frontotemporal Dementia, as outlined in their S-1.\n\nhttps://www.sec.gov/Archives/edgar/data/1477333/000119312519222176/d735023ds1.htm\n\nFrontotemporal Dementia = FD = 3/20 30$\n\nTLDR: Cloudflare is the backbone of the internet. Buy calls.", "id": "fgq6mx", "created_utc": 1583894741.0, "score": 61, "upvote_ratio": 0.88, "num_comments": 50, "comments": [{"body": "You had me at “if you search”\n\nFuck it I’m in", "score": 59, "replies": [{"body": "He had me at “if”. Nothing like a condition to get me to drop a load.", "score": 4, "replies": []}]}, {"body": "100 percent volatility. No bids.  43 percent until ITM 1 percent chance of profit. This is some autistic shit. I’m in.", "score": 25, "replies": []}, {"body": "You son of a bitch, I'm in", "score": 30, "replies": [{"body": "Yoloing all of my spare cash. Couldn't lose more than I have already", "score": 7, "replies": []}, {"body": "How often, when you say you're in, do you truly go in? Just curious", "score": 4, "replies": [{"body": "When he's in, he's in", "score": 3, "replies": []}]}]}, {"body": "Is this a Wendy's?", "score": 5, "replies": []}, {"body": "Dev here. I'll pass. AWS, Azure, and GCP all offer their own CDNs for free, and if I'm going to pay for another CDN, it'd be Netlify, or if on AWS, maybe Datapath....which might be free, I don't remember. Point is, CDNs are going to be dominated by the biggies or the freebies. There is no need for intermediates, imo.", "score": 22, "replies": [{"body": "I wish you would’ve said intermedies", "score": 24, "replies": [{"body": "Well, shit. Now I do too. I've failed us both.", "score": 12, "replies": [{"body": "Don’t sweat it. It happens", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "This is the best counterpoint I've seen all day.    \n     \nI'm not convinced (because I'm a 🌈🐻 rn), but I'm sure as fuck rooting for ya. Get them tendies, homie.", "score": 3, "replies": []}]}, {"body": "This doesn’t represent CloudFlare accurately. \n\nFirst of all, you don’t need to pay for their service. In fact, the vast majority of their customers are free-tier users. While they don’t directly profit from them, they do get a lot of exposure as a result of those users. \n\nSecond, CloudFlare isn’t solely a CDN provider. They also do other things ranging from VPN services to offering their own public DNS. \n\nThird, a _lot_ of enterprise clients do not use cloud providers like AWS and host their own infrastructure. CloudFlare is a great option for those types of clients and it is where they make a lot of their money.\n\nFourth, those same enterprise clients are bureaucratic hellholes that, if they do use cloud services, can have a mishmash of systems based in AWS, Azure, and GCP. It is pretty easy to manage all of those under CloudFlare and it’s a route that a lot of those customers take.", "score": 3, "replies": [{"body": "Well, first, all the others also have free tiers, as do literally dozens if not hundreds of others. Also, no one makes money giving away the most for free, except GOOG. Cloudflare is hard in that race to the bottom.     \n      \nSecond, I know nothing of their DNS nor VPN offerings. But, I've heard good things from companies we've acquired and moved off Cloudflare.     \n       \nThird, and fourth, can confirm. I lead an dev team for a Fortune 500. We self host, and we use AWS and GCP, and we're currently, constantly reevaluating Azure. My team has evaluated and reevaluated Cloudflare over the years, but they've never even made it past the threshold that would land them on my desk. So.... ¯\\\\\\_(ツ)_/¯ that's really all the DD I need to pass.", "score": 4, "replies": [{"body": "You’re providing anecdotal evidence from your experience at one company. \n\nI could tell you I consult for multiple fortune 500s where we have the inverse experience, or you could read an earnings report. \n\n\nwww.fool.com/amp/earnings/call-transcripts/2020/02/14/cloudflare-inc-net-q4-2019-earnings-call-transcrip.aspx\n\n\nhttps://www.cloudflare.com/press-releases/2020/cloudflare-announces-fourth-quarter-financial-results/", "score": 2, "replies": [{"body": "Are you really so arrogant that you don't recognize how someone gets to lead dev teams at a Fortune 500? I freelanced for a decade and ran a media consulting firm for another decade before landing my corporate gig a few years ago. My ~~evidence~~ informed opinion is not anecdotal. I'd wager it's based on more projects than you've seen in your career (just cause I'm old in this line of work). Now, I'm not claiming to know more about Cloudflare than any other decent dev. I am just saying that my dev leads all agreed, repeatedly, that it was not even worth considering and certainly not worth my time reviewing. Further, these are dev leads who all earn >$250k, not ignorant chumps who just half-ass their work. Now, I'm not saying you are or you do. I'm just suggesting that you need to reconsider how you talk at people. Cheers.    \n    \nEdit: also, you may want to consider rereading those results and do some proper DD on their fundamentals. Best of luck with your calls.", "score": -3, "replies": [{"body": "Holy shit dude if that isn’t the most defensive and egotistical thing I’ve ever read in my life idk what the fuck is. \n\nFirst of all calm the fuck down. No one cares that you lead a dev team. Me too, and so do 1000000 other redditors. \n\nAll I did was link you the earnings report and state I had an inverse experience with CloudFlare. Regardless of what you and your $250k devs think, you don’t decide how markets behave. Your company (or companies, fuck) might not have been a good match for their service but they are not one size fits all, there are plenty of companies that use CloudFlare as evidenced by their earnings. \n\nAlso I don’t know what decades of experience has to do with CloudFlare, a company founded less than 11 years ago, so you’re full of shit. \n\nYou’re the one that needs to reconsider some shit. Dunno who the fuck hurt you but I don’t give a shit either. Eat my fat dick and fuck off.", "score": 5, "replies": [{"body": "Egotistical? Lol. You challenged credentials/experience, dipshit.         \n     \nBut, rereading your comment, you're right. I'm fighting/mocking trolls in r/ politics and brought that attitude your way after misreading your tone. That was my bad.     \n      \nRegarding, \"I don’t know what decades of experience has to do with CloudFlare, a company founded less than 11 years ago, so you’re full of shit.\" 👈 Lmfao. That's some ignorant nonsense. Experience is absolutely relevant here. But, tbf, you're probably getting heated because I was a dick. So, I'll chalk that up to an angry brain fart because you genuinely seem like an intelligent dude.    \n     \nRegarding the last paragraph, lol. I like you. We should cuddle. Hit me up on Grindr 😘", "score": -2, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You'd be right if I were in the Bay area. I'm not. We basically pick up Cali's scraps; myself included.     \n       \nBut, yes, I'm not claiming to be Jobs, Gates, or Bezos, I was just vaccinated a few fewer times than the other dipshit.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Lol. [You blatantly lie](https://aws.amazon.com/cloudfront/) and then claim I don't have experience. Idiot. Then, you seeming intentionally misconstrue my meanings for Netlify and Datapath. [Netlify Edge](https://www.netlify.com/products/edge/) and Datapath's cloud-to-cloud are advancements upon CDNs. I was saying that if you're going to pay for something like Cloudflare, you should be doing something more specific or something better that ties in with AWS, GCP, and Azure CDNs. But, yes you're right there are hundreds like datapath -- just as there are hundreds like Cloudflare. If you're not willing to pay for AWS, GCP, or Azure, it means you're going the cheapest route possible, which might land you with Cloudflare, or much more likely, you'll piece together a bunch of the cheaper services and free services out there to do whatever specific thing you want. From what I can tell, Cloudflare is picking up scraps at best, and is getting squeezed in a race to the bottom.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Me: Big3 offer free CDN services.     \n       \nYou: Cloudflare is free for most use cases (it isn't; it's free for some).       \n      \nAlso you: You're a liar for saying Big3 offer free CDN services.     \n    \n....even though all of them fucking do the same shit as Cloudflare. Free to a point, which is what I said. You're just a hypocrite and a liar. Lol.    \n      \nThe rest of your tirade was pure idiocy. You're arguing points I never made, defining things we already know, and just being a general idiot. Enjoy losing money.", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Users. Indeed. I misquoted you. It's a good thing you pointed out that hugely significant irrelevancy 🙄      \n         \nAWS has a limited free tier, GCP has it built free with the service as does Azure, and so does Netlify (via Fastly behind the scenes).      \n     \nI'm aware Cloudflare is more than a CDN. That has been covered a few times over now. But, they don't do any of that may better than the Big3, and most of their services are offered by others for free/cheap. So, they don't really compete on the low end, and they don't compete on the top for any company that has any expectation to expand into services the Big3 offer that Cloudflare doesn't, of which there are many.     \n     \n> ...which is why they're one of the biggest.    \n     \nAnd I'm saying the bigger ones are better. Your logic proves my point (even tho it's kind of shit logic; it happens to be correct).      \n       \nYou fail to understand all of that, and no, I do not think Netlify is the same, I was saying there are better specific options with overlapping services. Netlify includes the CDN. Therefore, if you want a CDN and need/Want Netlify's services, you don't also need Cloudflare. Or, if you just want a CDN and don't want some other stuff Cloudflare offers, Fastly is there, as are dozens of others. Your failure to understand that, which I've explained clearly three times now, is why you're arguing against points no one made, and IMO, it's also part of what makes you an idiot.     \n       \nLastly, you're partially correct. I've never used Cloudflare, but to claim one can't understand their offerings without having used it is just plain idiocy 👈 which is yet another reason I called you an idiot.    \n     \nIt was fun see that NET dropped 2.5% today. Hopefully you aren't dumb enough to be balls deep in FDs. Lol.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "As the resident autistic witch doctor, I’d like to add to this retards DD by saying Frontal Temporal Dementia is akin to Alzheimer’s disease, and like Alzheimer’s basically breaks down and shrinks you’re brain leaving room for water to build up (ex-vacuohydrocephalus) symptoms include behavioral (like whip your dick out in the dentist office type behavior) and memory changes. NET in neurology also stands for Neuroepinephrine Transporter - which moves neuroepinephrine around and helps get your dick hard. \n\nSo what the science here is saying is that if you get your FD NET, your brain will turn to some jelly, your dick will get hard, and you’ll whip it out in public. \n\nNow as we residents of WSB do all of that anyways; you crazy bastard, I’m in.\n\nTLDR: science says all in", "score": 9, "replies": []}, {"body": "3/11.. worst band ever = worst day ever on the market tomorrow.. got it, puts it is", "score": 11, "replies": [{"body": "This is the DD I sub for 👌", "score": 5, "replies": []}, {"body": "No. It's a good band", "score": 0, "replies": []}]}, {"body": "Okay! In 4/17 30c", "score": 4, "replies": []}, {"body": "Almost had me, then you mentioned $INO.", "score": 2, "replies": []}, {"body": "I’m in for one contract just because I have no reason not to", "score": 3, "replies": []}, {"body": "I wouldn’t buy calls in $SLICEDBREAD right now", "score": 3, "replies": []}, {"body": "Already in. Sitting on 6 calls. I’ll double up tomorrow", "score": 2, "replies": []}, {"body": "Done", "score": 2, "replies": []}, {"body": "I use their 1.1.1.1 Warp+ app on my phone. Count me in.", "score": 1, "replies": []}, {"body": "this is really solid fucking reasoning. . it looks really promising, \n\nyou going April calls or later? I'm thinking 100 buys!", "score": 1, "replies": []}, {"body": "And why do you think the algos dont know about the sec filing?", "score": 1, "replies": []}, {"body": "what if they switch their algo off?", "score": 1, "replies": []}, {"body": "Have 20s and 22.50s xoxo", "score": 1, "replies": []}, {"body": "What do we think, will this run 🏃 up to $30 by next week?", "score": 1, "replies": []}, {"body": "I should have just bought PUTs. 🤣 Thankfully I didn’t YOLO.", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "aww man, I was playing this based on 3/11 lockup expiration....", "score": 1, "replies": []}, {"body": "This is risk management right", "score": 1, "replies": []}, {"body": "Hell yes, I'm in", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "fgs7ye", "created_utc": 1583904690.0, "score": 69, "upvote_ratio": 0.81, "num_comments": 52, "comments": [{"body": "Jesus Christ, give it to me. I’ll turn your 30k into \nforty-five HUNDRED dollars", "score": 211, "replies": [{"body": "That's far more generous than I would've been.", "score": 34, "replies": [{"body": "What can I say, I have a tiny penis", "score": 18, "replies": [{"body": "Me too!!  3 inches, how bout you?", "score": 8, "replies": []}]}]}]}, {"body": "Lmao no u retard just hold till u retire and you'll be fine", "score": 101, "replies": [{"body": "Pretty sure that's what r/investing told his grandpap", "score": 60, "replies": [{"body": "r/investing killed his grandpa", "score": 11, "replies": []}]}, {"body": "Looool", "score": 8, "replies": []}, {"body": "but i could yolo now and die rich instead of, you know, wasting on student loans and beervirus debt", "score": -18, "replies": [{"body": "Wsb has been infiltrated by r/all cucks buy some otm fds and become the next wsbgod it works every fucking time", "score": 38, "replies": [{"body": "It does work every time and anyone who tells you otherwise is the Fed", "score": 3, "replies": []}]}, {"body": "Use ur own money for that u autistic fuck", "score": 20, "replies": []}]}]}, {"body": "Dude options are so easy. You will turn that 30k into 300k in a week max 2.", "score": 29, "replies": [{"body": "Calm down, he went down 20% on just buying stocks lol", "score": 2, "replies": []}]}, {"body": "Late night mod will delete. Thanks for your sacrifice", "score": 22, "replies": []}, {"body": "You buy spy puts. Literally can not lose", "score": 12, "replies": []}, {"body": "Don’t be dumb. Your grandpa got those shares at prices that people would kill each other for.", "score": 10, "replies": []}, {"body": "Forget they exist for 2 years and enjoy your gains", "score": 34, "replies": [{"body": "damn sounds smart too bad im retarded", "score": -12, "replies": [{"body": "If it was 270 shares of $DIS you'd be getting nearly $1000 annually of supplemental income brah. It took a lot of time to build that portfolio. Keep those, put in some more of your own cash over time but keep it cash. Use that to fund your options. If your options hit the right spot, even options without a lot of initial investment can print money.\n\nAnd you'll still have your dividend income along with the market value of all those shares. No sense in giving those all up to play options. You can have the best of both worlds.", "score": 9, "replies": [{"body": "Please, OP, do listen to this comment. Best response you've gotten and spot on.", "score": 3, "replies": []}]}, {"body": "Welcome home!", "score": 5, "replies": []}]}]}, {"body": "rip gramps. At least it was a quick death.\nAnd idk I’m too retarded to give you any real advice", "score": 8, "replies": []}, {"body": "You mean 20k now...", "score": 6, "replies": []}, {"body": "You need to YOLO the fuck out of the 30k your Gramps gave you.  Then lose it all for us, and make sure you tell your mom about it and live stream it so I can feel better about myself.  Thanks.", "score": 6, "replies": []}, {"body": "I’d sell mcdonalds and buy some tesla", "score": 3, "replies": [{"body": "Buy high sell low. This is the way", "score": 2, "replies": []}]}, {"body": "Just sell covered calls and live off of the Theta.", "score": 3, "replies": []}, {"body": "Wait for MSFT to drop to 150. Buy 170 strike June 2022 calls for MSFT. Profit.", "score": 3, "replies": []}, {"body": "Lol. In two weeks gramps will have left you $15k in DIS and MCD.", "score": 3, "replies": []}, {"body": "I'd buy ruger or smith and wesson calls", "score": 2, "replies": []}, {"body": "Def pull them out I just saw an infographic on here earlier that showed you only have to check the box \"puts\" and you instantly gain 250k", "score": 2, "replies": []}, {"body": "Sorry about your grandfather.", "score": 1, "replies": [{"body": "Hey thanks. He was a good man to me. Old age caught up with him and caring for my grandmother just broke him. now its time to blow that boomer stock money on retarded options with my iphone", "score": 6, "replies": [{"body": "If it’s cool with you, I’ll give you a little advice. \n\nI’m not sure what your tax basis is with those stocks. So if you sell just understand the tax consequences. \n\nI’d take a little money maybe like 5k and do options. I’d keep the rest in those stocks. Or convert all of an index. Or cash for now and buy back closer to the bottom. \n\nYou’re young, the money your grandpa gave to you can eventually get to a decent size. Don’t yolo it all. If think McDonald’s is good and it has dividends. You’ll always remember your grandpa when you collect cash. \n\nJust my two cents. There are guys that seriously get dicked playing options. \n\nGood luck!\n\nEdit:   Check this thread. 18 year old YOLO’d to 40k. He was asking for advice. \n\n\nhttps://www.reddit.com/r/wallstreetbets/comments/fg86t0/made_40k_from_800_in_2_months_pretty_good_for_an/fk3312n/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 8, "replies": [{"body": "Hey I never expected such a genuine response, thanks. Ultimately probably not going to touch much of it, even tho disney dropping is scary. Last week I sunk $550 from my tax return to fuck around with. I'll see how good I gamble with that first.", "score": 3, "replies": [{"body": "The guy above you is right. Take a little to play but honestly leave most where it is.. chances are gramps bought those shares a while ago paying a pretty dividend. They will bounce back, dont YOLO it lol im a fan of loss porn like the rest of the degenerates here but you sound genuine enough to give this advice to lol dont blow it!", "score": 1, "replies": []}]}, {"body": "A word about the taxes. In the US, tax basis of inherited assets is the value on the day the decedent died. That's called \"stepped up basis\".\n\nExample: Grandpa buys Disney at $5 per share, Disney goes to $120 per share, Grandpa dies that day. Grandpa's will leaves Disney to Grandson. Grandson's basis is now $120 per share. The whole capital gain that Grandpa was sitting on: never taxed.\n\nI hope your Grandpa and your Grandma had a long and happy life. Live long and prosper.", "score": 2, "replies": []}]}]}, {"body": "BAN", "score": 1, "replies": [{"body": "😂", "score": 1, "replies": []}]}]}, {"body": "Puts on Boomer, long funeral homes", "score": 1, "replies": []}, {"body": "Calls on the McDonald's drive-thru.", "score": 1, "replies": []}, {"body": "Strange one of my good friends Grandpa got real sick with cancer, and just said fuck it because he didn't want to put his family in debt. Ended up leaving 100k worth in stocks to him, and his sister. RIP old man, whoever you are. (shot himself too)", "score": 1, "replies": []}, {"body": "How much money are we talking about here? Why not just play with the dividend? I too bought into CCL puts and lost my ass on it. Maybe your timing will be better.", "score": 1, "replies": []}, {"body": "Puts are expensive now, and a little more risky since stocks are already down 20%. \nIf it were me, I would put 20k in cash, 5k itm puts September strike HSBC. 5k otm puts chipotle 2 months out strike.", "score": 1, "replies": []}, {"body": "Sell\nOptions against it. Premiums are unaffordable except for the retards on this sub that buy them anyways. Almost literally free money", "score": 1, "replies": []}]}
{"title": "Signs that Apple and AMD may be stockpiling right now.", "selftext": "TSMC just posted their monthly earnings for February a 50% increase from last year. They've also cited that the coronavirus will not affect their work. \nhttps://www.tsmc.com/tsmcdotcom/PRListingNewsAction.do?action=detail&newsid=THGOPGPGTH\n \nXiaomi one of TSMC's largest customers has cancelled orders from them because they don't have the demand for their smartphones.\nhttps://www.digitimes.com/news/a20200226VL200.html\n\nHauwei, Apple, AMD, and Nvidia  (from what we know) haven't cancelled any orders or their revunue for February would have been terrible. Most of the Chinese firms were offline during the time so they likely cut orders when they were unable to work which is likely why it wasn't higher. \n\nLogically speaking, from this we can understand why Apple didn't ship as many phones to China even though they have been stockpiling chips from TSMC, they've been unable to get parts from Foxconn which will be online again in late March. \n\nhttps://www.caixinglobal.com/2020-03-10/chinas-smartphone-shipments-nosedive-more-than-50-in-february-101526430.html\n\nThen from what we can also gather is that TSMC will finally be able to mass produce 5nm chips for Apple's and Hauwei's 5g plans by the end of quarter 1 to early quarter 2. Apple is also planning on unveiling a cheap iPhone 9 which will likely a huge success like the 5c. \n\nAMD forsees 20% revunue growth this year. It is likely due to their new work with government which will be also run on TSMC chips. Nvidia will blow further higher with it's data center especially after such strong growth from last year, it's obvious to see why. \n\nIntel has given up even making their own chips to compete with TSMC.\n\nhttps://appuals.com/intel-xe-gpu-flagship-tsmcs-6nm/\n\nWhat does this have to do with anything? Well, strong consumer growth. And you're like even with the coronavirus running around stopping people from going outside? \n\nYes, this is because it seems to be a seasonal thing:\n\nhttps://www.techtimes.com/articles/247916/20200310/new-study-finds-warm-temperatures-could-kill-coronavirus-is-trump-right-in-saying-covid-19-will-subside-in-spring.htm\n\nHotter temperatures is a reality especially because of global warming, the Earth is hotter than it has ever been in recorded history. Because of that we will see a return to successful sales. As Apple begins to be able to stockpile and carry the economy forward. \n\nGDP will take a huge, and I mean huge hit this quarter. This is just from rational deduction. Boeing didn't get a single plane order in January. Boeing makes up a huge part of America's GDP. Supply shock likely hit hard in February. Simply from news going around, about how China had terrible output. \n\nFurthermore, oil clashes between Russia and the Saudis hurt the Saudis far more. Saudi economy is like 80% oil or something crazy like that. They cant afford to sell cheap for too long as Russia is like 30% oil. Meaning that Saudis will likely come back to negotiation table much sooner than we'd suspect. And because they'd rather not take the blame for the affect on the economy, they will likely move to a deal.\n\nAfter this news people go into a selling frenzy and the stock market will be ripe for the picking. Then we'll be able to snatch up nice and cheap tech stocks that will ultimately cause 2nd quarter GDP to rise. Increasing our tendy count. With this news of 1st quarter GDP lose, we will be seeing people flee not realizing that the panic scare is over as likely by then the 737 max will be up and running again and things will be looking to better times.\n\nSo what I'm saying is to hedge against the economy until the terrible GDP report than to sell and buy calls for Boeing, TSM, Apple, AMD, NVDA(essentially any tech stock). Because we'll be heading back into better days.", "id": "fgsivm", "created_utc": 1583906455.0, "score": 55, "upvote_ratio": 0.83, "num_comments": 49, "comments": [{"body": "alrighty", "score": 45, "replies": []}, {"body": ">  the Earth is hotter than it has ever been in recorded history. Because of that we will see a return to successful sales. As Apple begins to be able to stockpile and carry the economy forward. \n\nGlobal warming is now bullish? Mobile phones and airpods will carry the economy forward? Jesus christ, if that's the best bull narrative we can come up with, time to load up on puts.", "score": 80, "replies": [{"body": "Thank you for having some sense!", "score": 15, "replies": [{"body": ">  the Earth is hotter than it has ever been in recorded history\n\n> Because of that\n\n> we will see a return to successful sales.\n\nThis is straight ⬆️⬇️ syndrome", "score": 6, "replies": []}]}, {"body": "This is verifiably untrue. A simple google search will show that the earth has MANY times been hotter than it is today.", "score": 2, "replies": [{"body": "If only all those scientists could have ran a simple google search instead of collecting and analyzing information. Gawd damn.", "score": 2, "replies": []}, {"body": "Yes, once earth even had no land and was all water. \n\nThat was not a good time to be human. Actually no human lived then. \n\nActually under no time when earth was hotter then today did homo sapiens live on this earth. Last time we had as much CO2 in the air was 3 million years ago. Then the sea level was 20 meter higher then today. \n\nSo most of the worlds big cities would be underwater if we humans don't fix it...", "score": 1, "replies": []}]}, {"body": "I mean we are the most dependent on technology that we've ever been and this will continue to grow. I mean if Google started to charge monthly for the use of their search engine, most people would honestly do it. The same can be said about smart phones, if you want to survive in the modern world, you need a smartphone. People depend on Amazon more than they depend on retail, Amazon prime is something they're unwilling to get rid of. This entire 'coronavirus' fear and pandemic may hurt growth for tech companies but because we depend on them so much. It actually won't hurt their profits honestly too much. Supply shock should end by the end of this month. And so if people aren't going to stores to buy stuff, they'll be using Amazon. I wanted just more evidence to say that things should turn around for second quarter GDP", "score": -12, "replies": [{"body": "I can't think of a faster way for alphabet to kill the golden goose than to start charging for searches. Most people would do it? Lol", "score": 16, "replies": [{"body": "What are going to switch to? Baidu? Bing? Yahoo? Google comes with cloud, YouTube, email, search engine, and so much more. If they just said that they'd want $10 a month for all their services, bruh I'd pay that in a heart beat. I can't believe we get all that shit for free.", "score": -2, "replies": [{"body": "My dude, heart to heart, you are seeing this wrong. IF google charges for search, it would race to zero in matter of hours. Google isn’t a search company, it’s an advt company and how do they show ads to people? Yup, you guessed it righ, search.\n\nI agree with tech coming back first though, but we need to see at what valuations. It’s not going to be a crazy numbers who saw earlier. In 2020, I don’t see a scenario where we get frothy market. Disclosure: i know that I know nothing.", "score": 16, "replies": []}, {"body": "Duckduckgo.com", "score": 8, "replies": []}, {"body": "It's not free. Google sells your user and behavioral data to advertisers. You are paying Google by revealing exactly who you are and how you should be marketed to.", "score": 2, "replies": []}]}]}, {"body": "Tech is super important going forward. Mobile phone growth is tapped out though. When car sales peaked, it's like saying GM will carry the economy forward by way of increasing the price of cars in a saturated market.\n\nCompanies involved in automation on the other hand, that's something to get excited about as it has potential to drive efficiencies up and open up new markets that weren't viable in the past.", "score": 4, "replies": []}, {"body": "Amazon has a supply chain too, dude, those warehouses aren't full of replicators.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "This is pure nightmare fuel for my puts.", "score": 4, "replies": []}]}, {"body": "I'm extremely bullish on AMD even amidst this crash. I've been watching their stock and every move down towards 40 has been bought back up pretty quickly. They've reported that beer flu will have little to no effect on their production. I believe their cash on hand has been steadily increasing year on year. Conversely, their long term debt has been decreasing. They've been buying back their stock on each dip as have many other cashed up tech giants. I expect this sector to recover first and recover quickly while energy, airlines and tourism will struggle for at least the next year.", "score": 18, "replies": [{"body": "AMD doesn't do buybacks (yet) tho", "score": 5, "replies": []}]}, {"body": "Putting in a put on AMD today at opening", "score": 8, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Apr 17 spy puts 250. Than after April ends buy far out Boeing and tech calls", "score": 15, "replies": []}, {"body": "GME $8C 3/20", "score": 1, "replies": []}, {"body": "BA Calls 3/13 400$", "score": -3, "replies": []}]}, {"body": "Chinese party line: everything is going to be fine.\nChinese people: it’s fucked. Run!", "score": 6, "replies": []}, {"body": "AMD has a big advantage, modular dies. One lithography process there fuels many products and even if consumer demand slows for Ryzen, they can shift good chips to Epyc for the nuke server and keep the lower binned chips as spare parts for their existing server contracts with Amazon and Twitter based on 1st gen. Ryzen architecture.\nTl;Dr: You put amd, you small pp", "score": 6, "replies": []}, {"body": "Yeah fuckin tard we all know this. The hard part is W H E R E. I S. T H E. B O T T O M.", "score": 4, "replies": []}, {"body": "Can I have a four word summary?", "score": 3, "replies": [{"body": "This bad for MU", "score": 2, "replies": []}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I generally agree with your thesis, like AMD, pissed I missed the boat at $15. I believe B2B spending will be little changed on technology this year, phones it’s hard to say. If people start getting fired if this isn’t just a Q1 issue, consumer spend for the year will dry up quickly.  Like Apple too, just think it will go lower first.", "score": 2, "replies": []}, {"body": "' Hotter temperatures is a reality especially because of global warming, the Earth is hotter than it has ever been in recorded history '\n\nOP is now block'd \n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/All_palaeotemps.svg/2000px-All_palaeotemps.svg.png", "score": 2, "replies": []}, {"body": "For someone who talks so much, you don’t have much to say.", "score": 1, "replies": [{"body": "Lol check my TSM calls from my other post", "score": 1, "replies": [{"body": "The TSM is going to hit $70 by the end of February one?", "score": 2, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/emloct/a_week_ago_i_saw_this_truck_and_put_an_extra_30k/?utm_medium=android_app&utm_source=share", "score": 1, "replies": [{"body": "This literally means nothing. You later said TSM to $70 and I would assume you bought calls...", "score": 1, "replies": []}]}]}]}]}, {"body": "You took the longest possible way to say stonks only go up", "score": 1, "replies": []}, {"body": "Re Intel giving up and using TSMC, that article says they're considering it for their Xe GPU line.    That's one product in a huge business.", "score": 1, "replies": []}, {"body": "My friend runs PROdUcT for Apple and can’t get my a free iPhone like he usually can.\n\nIf he can’t then there is no stock.", "score": 1, "replies": []}, {"body": "AMD was not touched today for some crazy reason.", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Tldr?", "score": 1, "replies": []}, {"body": "This is way too long", "score": 1, "replies": []}, {"body": "Link to scientific article:\nhttps://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.0030151\n\nFor the lazy here is the abstract/summary:\n\nABSTRACT\n\nUsing the guinea pig as a model host, we show that aerosol spread of influenza virus is dependent upon both ambient relative humidity and temperature. Twenty experiments performed at relative humidities from 20% to 80% and 5 °C, 20 °C, or 30 °C indicated that both cold and dry conditions favor transmission. The relationship between transmission via aerosols and relative humidity at 20 °C is similar to that previously reported for the stability of influenza viruses (except at high relative humidity, 80%), implying that the effects of humidity act largely at the level of the virus particle. For infected guinea pigs housed at 5 °C, the duration of peak shedding was approximately 40 h longer than that of animals housed at 20 °C; this increased shedding likely accounts for the enhanced transmission seen at 5 °C. To investigate the mechanism permitting prolonged viral growth, expression levels in the upper respiratory tract of several innate immune mediators were determined. Innate responses proved to be comparable between animals housed at 5 °C and 20 °C, suggesting that cold temperature (5 °C) does not impair the innate immune response in this system. Although the seasonal epidemiology of influenza is well characterized, the underlying reasons for predominant wintertime spread are not clear. We provide direct, experimental evidence to support the role of weather conditions in the dynamics of influenza and thereby address a long-standing question fundamental to the understanding of influenza epidemiology and evolution.", "score": 1, "replies": [{"body": "Now we need the same for SARS and SARS-Cov-2", "score": 2, "replies": [{"body": "Despite media reports to suggest the contrary, SARS was indeed just as vulnerable at high humidity and temp if not more (according to some studies). The key assumption is that this vulnerability can be extrapolated to SARS-Cov-2. There has been **ZERO** *scientific* reports/data presented that suggests we *can’t* extrapolate this consistent vulnerability *among highly related strains of influenza and coronavirus alike*. Put a gun to the head of ANY epidemiologist and ask them if SARS-Cov-2 will become extremely less contagious during high humidity/temp of non-winter season and they would have to answer *’YES’*.", "score": 1, "replies": []}]}]}]}
{"title": "YOLO: 250 contracts of Disney DIS May 15'20 90 PUT. Current value: $135k", "selftext": "Half of it were profits from an earlier position: DIS May 15'20 125 PUT. But then with the USA weak response to Coronavirus, I thought I would double down. There will be a day when Cruise ships stops, Movie theaters are empty, and the theme parks are closed. Their Disney+ will be just fine, but who cares.", "id": "fgy3sh", "created_utc": 1583937370.0, "score": 107, "upvote_ratio": 0.87, "num_comments": 57, "comments": [{"body": "[deleted]", "score": 57, "replies": [{"body": "https://paste.pics/8B59D", "score": 39, "replies": [{"body": "I think this link just gave my phone coronavirus", "score": 93, "replies": [{"body": "Beer fluuuu", "score": 1, "replies": []}]}, {"body": "EWWWWWWWWWWWW", "score": 21, "replies": [{"body": "well, It did have numbers.", "score": 8, "replies": []}]}, {"body": "Ah, fellow ibkr autist", "score": 8, "replies": [{"body": "Holy shit people use that boomer broker here???", "score": 8, "replies": [{"body": "There's nothing better if you're European", "score": 3, "replies": [{"body": "or Canadian", "score": 4, "replies": []}]}, {"body": "better than robinhood...", "score": 2, "replies": []}]}]}]}, {"body": "Fuck the mouse", "score": 3, "replies": []}]}, {"body": "I have 17 $92 3/13", "score": 31, "replies": [{"body": "Parks are like 1 hour from my house... Want me to go buy a ticket and start coughing and sneezing like crazy on everything?", "score": 86, "replies": [{"body": "Yes please. Although I think you won’t have to do that for these to pay", "score": 29, "replies": [{"body": "Eh. It's become my new favorite pastime.", "score": 13, "replies": []}]}, {"body": "I’ll Venmo you the price of a ticket +$20 if you tape yourself walking around coughing mad at the three highest traffic locations. You can blur your face.\n\n\nJkjkjk..... unless?", "score": 20, "replies": [{"body": "Go on, I'm listening.", "score": 10, "replies": []}]}, {"body": "All of you have to do is go out at in the coronavirus sub and comment how Disneyland is so busy still and there are so many sick people and that you left and asked for your money back.", "score": 12, "replies": []}, {"body": "You deserve a commission for such a detestable act", "score": 5, "replies": []}, {"body": "Sneezing isnt a typical symptom.", "score": 1, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Yeah probably", "score": 5, "replies": []}]}]}, {"body": "Yea thatd be great ty, i need to afford my holobunga bunker before shtf thanks", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Depends how I feel", "score": 1, "replies": []}]}, {"body": "Oof", "score": 1, "replies": [{"body": "If it don’t make me money today or tomorrow, it’ll make me money Friday", "score": 2, "replies": []}]}]}, {"body": "i can also claim i am a millionaire you microdick donkey.", "score": 40, "replies": []}, {"body": "I dont think Disney+ is even profitable yet. I read that it wont be until 2021 so smells like tendies.", "score": 15, "replies": [{"body": "How could it not be profitable? Where did you read that?\n\nWhat are the inputs, cloud space? They already made the movies and sell them to the theaters for the %.", "score": 2, "replies": [{"body": "https://www.hollywoodreporter.com/amp/news/disney-hits-265-million-paid-subscribers-launch-1276320\n\nnot where I saw it but pretty much the same information.", "score": 5, "replies": [{"body": "Fuck me. \"The company expects Disney+ to be profitable in 2024 and Hulu to be profitable in 2023 or 2024. \"\n\nThere is a scam somewhere.", "score": 14, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "I'm a netflix engineer, i provide input to the netflix algorithim using realistic† human input\n\n&#x200B;\n\n†all realistic human input is me watching the office over and over again till my eyes bleed", "score": 3, "replies": []}]}]}, {"body": "I mean Disney controls all the inputs in streaming. It’s vastly better business model than Netflix in every way.\n\nIt makes money in multiple ways with streaming and actually people pay to go watch these films in theaters. \n\nIt’s not hard to realize that Disney movies and shows don’t have the same watch ability because you already paid $40 to watch Frozen 2 at the theaters. A new film on Netflix is legit a new film.", "score": 1, "replies": []}]}, {"body": "There's claims that YouTube still isn't profitable.  Want to know why?\n\n* Network egress for streaming media at scale (e.g. Netflix is estimated to be something like 10-15% of global bandwidth)\n* The cost of outrageous amounts of reliable storage systems.\n* Software engineers are fucking expensive\n\nSeriously, 4k content. 8k content coming soon. Hulu, DIS+, NFLX, YouTube... They all have the same cost structure. Running a deficit for 3 or 4 years while their capital cost outlays amortize is completely expected. They also need time to scale their networks to reduce operational costs for storage and bandwidth", "score": 1, "replies": []}]}]}, {"body": "RemindME! 1 month", "score": 7, "replies": [{"body": "I will be messaging you in 1 month on [**2020-04-11 14:39:58 UTC**](http://www.wolframalpha.com/input/?i=2020-04-11%2014:39:58%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fgy3sh/yolo_250_contracts_of_disney_dis_may_1520_90_put/fk7j9ab/?context=3)\n\n[**6 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffgy3sh%2Fyolo_250_contracts_of_disney_dis_may_1520_90_put%2Ffk7j9ab%2F%5D%0A%0ARemindMe%21%202020-04-11%2014%3A39%3A58%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fgy3sh)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Yeah ok and I’m long with my 100 shares of BERK.A", "score": 5, "replies": []}, {"body": "5.45 is kinda pricey but godspeed retard", "score": 3, "replies": []}, {"body": "I got may 15 95p so god speed brother.", "score": 2, "replies": []}, {"body": "I only have 10 4/17 $100 Puts myself, sold at the drop just now for a quick $3K gain before making more moves.  Coronavirus is just getting started in the US, once tests roll out en masse, we should see the real stats.", "score": 2, "replies": [{"body": "I just did the same thing wondering went to re enter tho", "score": 4, "replies": []}, {"body": "Have you re entered?", "score": 1, "replies": [{"body": "Unfortunately, I'm just trading on the side so not paying too close of attention to it.  I'm waiting for a rally before re-entering.", "score": 2, "replies": [{"body": "Okay cool thanks for the input", "score": 2, "replies": [{"body": "That movement upward in the last hour was the small rally I was looking for.  I put in a few more positions at different expirations when it went up to 105-106.", "score": 1, "replies": []}]}]}]}]}, {"body": "RemindME! 2 month", "score": 1, "replies": []}, {"body": "remindme! may/15", "score": 1, "replies": []}, {"body": "Are you riding it till the end or selling after some gains", "score": 1, "replies": [{"body": "I love having my options open. So if things turn, I will close and start a long position in some other stock.", "score": 1, "replies": []}]}, {"body": "Are you rich now", "score": 1, "replies": [{"body": "Not as rich as I imagined I would be. If you see a recent comment I made, I bought a used 2019 Porsche cayenne. I should have bought a new one if things went as I wish", "score": 1, "replies": []}]}, {"body": "Yikes", "score": 1, "replies": [{"body": "I sold with about 10% lost. Made in up in other positions. No yolo", "score": 1, "replies": [{"body": "I’m glad lol", "score": 1, "replies": []}]}]}, {"body": "if disney hits 135 im buying leaps", "score": 1, "replies": []}]}
{"title": "Markets want White House and Congress to move quickly on stimulus to head off a recession", "selftext": "", "id": "fh2zb1", "created_utc": 1583955653.0, "score": 102, "upvote_ratio": 0.94, "num_comments": 56, "comments": [{"body": "One day blip after they \"fix\" the market. They need doctors and scientist not fucking billionaires and company to figure this shit out.  Welcome to the oligarchy state.\n\n&#x200B;\n\n[Its going to get worse.](https://twitter.com/DrDenaGrayson/status/1237754073602015235?s=20)", "score": 112, "replies": [{"body": "Honestly so fucking dumb, rate cut was absolutely useless, hows that fixing logistical/demand issues cause by corona virus.\n\nIf they cut rates again, I may yolo my line of credit", "score": 51, "replies": [{"body": "I just feel like they’re showing their cards before the River. It clearly shows something wrong. The market is as nervous as Steven Paddocks Maid.", "score": 17, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There’s a few I have ;)", "score": 1, "replies": []}]}]}, {"body": "The rationale is that it will keep companies from bankruptcy for atleast a bit so that the vaccine could come and we dont have 60% of businesses bankrupt by then", "score": 1, "replies": []}, {"body": ">  I may yolo my line of credit \n\nOn calls or puts?", "score": -4, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Buy calls. :D", "score": 11, "replies": [{"body": "Ok now what", "score": 1, "replies": [{"body": "Call your mom and tell her you love her.", "score": 1, "replies": []}]}]}]}, {"body": ">\tMarket is scared\n\nIs this a genuine question? If it is, buy calls! Put everything in calls and post the results! I’ll laugh along with everyone else.", "score": 1, "replies": []}]}]}]}, {"body": "Some of the smartest scientists and medical people are calling me, ‘Mister President, we will fully cure The Kung Flu by, probably, perhaps maybe Friday at the earliest’. I say how can this be? You have thousands and thousands of cases, many cruise ships, many air planes, I hear Italy is totally a mess. How can this be? Well, they say Mister TRUMP, your tremendous leadership has cured the Corona...the corona virus. But the Fake News would never tell you that. We have Magic Mike Pence, we have Kellyanne. Remember Kellyanne? Kelly Anne Conway, thank you darling. She’s a fighter. Thank you Kelly. Annnnnd so we have some of the most powerful CEOs of health care companies, of insurance companies, of pharma, you know the drug makers? Pharma. They’re all saying this will be done with so soon, sooner than anyone ever thought. So we’re going to Mar a Lago this weekend, we’re gonna have a good time, right? Have a good day folks.", "score": 119, "replies": [{"body": "Why can’t I tell if this is real or not?", "score": 45, "replies": [{"body": "you cant make this shit up", "score": 15, "replies": []}, {"body": "Because the stupid shit you see here is about as dumb as the shit he says. At least sometimes we make money and don't bankrupt hotels 🤷🏿", "score": 11, "replies": [{"body": "Theres a lot of bankrupt hotels in the future, do t fool yourself.", "score": 2, "replies": []}]}]}, {"body": "I love when the writing is so on point you actually read it in your head in their voice.", "score": 23, "replies": [{"body": "Very cool, thank you!", "score": 9, "replies": []}]}, {"body": "Is it bad that I want him and Pence to get it 🙊 tendies would be pouring out of my 🌈🐻🍑", "score": 17, "replies": []}, {"body": "cerified presidential speech writer here", "score": 2, "replies": []}]}, {"body": "Too late to act, fed already slashing rates, mickey mouse tax cuts... Puts here we go", "score": 30, "replies": [{"body": "Everybody clap your hands", "score": 8, "replies": [{"body": "getting gainz, take em back now yall", "score": 7, "replies": [{"body": "Now it’s time for the depression", "score": 4, "replies": []}]}, {"body": "Clap...Clap...Clap your hands.", "score": 3, "replies": []}]}]}, {"body": "dumbasses have no idea how this shit works. We were due for a recession anyways, and today's drop puts us in bear market.", "score": 18, "replies": [{"body": "Yeah but a 2% rally tommorow could technically take us out of bull market, although futures down almost 5%", "score": 1, "replies": []}]}, {"body": "The only thing I saw reading that was BUY PUTS", "score": 29, "replies": [{"body": "Calls*", "score": -9, "replies": [{"body": "Buy call puts", "score": 8, "replies": [{"body": "Directions unclear. Bought a box spread instead.", "score": 7, "replies": [{"body": "Like a cheese spread?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Buy calls on spxs", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Idk. Market goes down, it goes up. Same for vice versa. You buy a calk on that if you think he market will crash and it reacts 3× harder", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}]}, {"body": "SQQQ & SPXU calls", "score": 1, "replies": []}]}]}, {"body": "Imagine trying to save the economy without dealing with what’s going to kill the economy.", "score": 11, "replies": []}, {"body": "Not markets. The specific people that want hand outs from the government want the money so they can give it to themselves before going bankrupt and moving on like locusts.", "score": 8, "replies": []}, {"body": "Too bad the white house is retarded.\n\nThere's no point in any stimulus package until the virus is over. \n\nWe'll spend wanna spend money when everyone is good and dead", "score": 25, "replies": []}, {"body": "Stimulus will sure solve the virus problem...", "score": 5, "replies": []}, {"body": "For the love of sweet baby jesus i need another pump to enter my leap puts, would be awesome to score an additional 50% profit because of some retarded, short-sighted, and outright irresponsible attempt to pump the stock market by the executive office. \n\nIF THERE IS ANOTHER RATE CUT EVERYONE YOLO THEIR 401k INTO SPY LEAP PUTS ANY STRIKE IT DOESN’T MATTER", "score": 8, "replies": [{"body": "DOESNT EVEN MATTER. IM IN.", "score": 3, "replies": []}]}, {"body": "Can you give a TLDR?", "score": 2, "replies": [{"body": "Situation is still fucked", "score": 19, "replies": [{"body": "Ok thx 🙏", "score": 8, "replies": []}]}, {"body": "Invest in canned food for your basement", "score": 2, "replies": []}, {"body": "Trump wants to destroy the dollar to save the stock market", "score": 1, "replies": []}]}, {"body": "Who is this \"Recession\" and why's *he* getting all the head?", "score": 1, "replies": []}, {"body": "Never thought I’d enjoy being a 🌈🐻until a now widespread pandemic causes major infrastructure issues and death and all due to the fact that I’ll use the tears of the global economy to sauté my tendies", "score": 1, "replies": []}, {"body": "I voted a bunch of cheap calls,  ant wait to sell em 2 hours after market open", "score": 1, "replies": []}, {"body": "Fed cut rates to meet inflation targets and we’re — surprise — still under target. They’re going to cut rates more to avoid going into deflation, there’s potential for 0% interest rates in the U.S. finally.\n\nIt’s like preparing to take a vacation to Europe, but Financially.\n\nPeople saying they cut rates to fight Beer Virus probably think a Bond Market is where they go to buy their BDSM ballgags", "score": 1, "replies": []}, {"body": "**TL;DR  -  BRK.B 4/17 $230c - $0.45/contract**\n\nDaddy Buffet is sitting a pile of cash equivalent to what Trump is pumping in to the market everyday. Berkshire is going to pump money back in soon and these babies are dirt cheap right now. We've all enjoyed the gay bear lifestyle thus far but we're going green soon and now is the time to pivot.", "score": -3, "replies": [{"body": "Unlikely to recover by April, your c will expire worthless", "score": 13, "replies": []}, {"body": "4/17/21 maybe.", "score": 1, "replies": []}]}]}
{"title": "Dow Jones dropped ~5% today this is definitely not stonks", "selftext": "", "id": "fh59qr", "created_utc": 1583964088.0, "score": 160, "upvote_ratio": 0.96, "num_comments": 55, "comments": [{"body": "11 out of 11  times when the market dropped 5% it gained huge the next day. We will see what happens tommorow \n\n(SPY put holder)", "score": 157, "replies": [{"body": "Beervirus gonna kill that streak as well.", "score": 89, "replies": [{"body": "Your argument has completely changed my stance. Chinese aids gonna wreck the S&P next. We shall see more red than rosannes tampon!", "score": 47, "replies": [{"body": "coming here for comments like these is my guilty pleasure", "score": 15, "replies": []}, {"body": "pretty sure there would be no red on her tampon - the healthiest eggs in rosanne's body are from her eight daily egg and cheese mcmuffins", "score": 5, "replies": [{"body": ">eight daily egg and cheese mcmuffins\n\nThat'd make a bloody mess coming out on its own.", "score": 3, "replies": []}]}]}, {"body": "Boomer Remover 19 killin' streaks, Italians, my 401k, and my grandparents.  YOLO!", "score": 5, "replies": []}]}, {"body": "Most likely gain and then big drop like what happened Monday. Hold your puts.", "score": 16, "replies": [{"body": "And if you have cash buy more puts.  2-3 weeks out for guaranteed gains", "score": 11, "replies": [{"body": "Any move up and IV drop is a buy.", "score": 4, "replies": []}]}]}, {"body": "It 100 percent hinges on whether Trump can formulate more than a word salad out of what he's been told to say and whether he says it at 9pm today ET.", "score": 10, "replies": [{"body": "Gonna close the borders.", "score": 9, "replies": [{"body": "You really think so?", "score": 2, "replies": [{"body": "Trump's playbook.", "score": 8, "replies": []}]}]}, {"body": "Willing to bet he's gonna say \"Move along people. Nothing to see. Go about your business.\"", "score": 2, "replies": [{"body": "Na he's tried that one, it was like what. 4 days ago or close to it when he said \"we've got 15 now, I closed the China flights, many people said it was bad, many people. Some even said I was a racist but it turns out it was the right thing to do. And soon we will be 15 to 0.\n\nNow it's pushing like 2k ish and purely due to lack of testing. America is about to be hit *hard* due to Trump, so he's gonna wheel out something amongst the bullshit.", "score": 3, "replies": []}, {"body": "He gon announce cruise industry bailout and tell us to go back to work", "score": 1, "replies": []}]}]}, {"body": "Then what about the day after that?\n\nThat's when I sell puts.", "score": 3, "replies": []}, {"body": "2 of those instances were this week and last week right?", "score": 3, "replies": [{"body": "Ya one on Monday and one today. But I also have never seen a market that changes 1k+ every single day. So who knows what’s gonna happen", "score": 5, "replies": []}]}, {"body": "It’s going down tomorrow too. Futures are way down, asian markets are way down. Maybe see a bounce Friday.", "score": 2, "replies": []}, {"body": "Dow futures already down 1,000 points. There's gonna be blood tomorrow.", "score": 1, "replies": [{"body": "mmmmmmmmmmmmm I love it. Huge gains ahead! But also huge losses in my 401k!", "score": 3, "replies": []}]}, {"body": "I can only pray it goes up AM so that I can buy a fuck ton of long dated puts", "score": 1, "replies": []}, {"body": "Except when trump shuts down the country to Europe.", "score": 1, "replies": []}]}, {"body": "If it moons in the morning I'm doubling down on puts and selling every stock I own at the top. I'm a complete R Tard Meathead but cases are popping up all over. Chicago just shut down their trade floor. Italy is a dumpster fire. Joe Rogan is panicked. NCAA march madness is cancelled. MgM Grand has the Virus. SPY 250P 3/30.", "score": 28, "replies": [{"body": "I wouldn't expect any less from a fellow r/wsb autist", "score": 7, "replies": []}]}, {"body": "what happened with AMD why did it close green?", "score": 32, "replies": [{"body": "Because it’s an irrational meme at this point", "score": 50, "replies": []}, {"body": "I bought puts at close thinking I was big brain but its still green after market :(", "score": 9, "replies": [{"body": "bought puts after open pump, would've been a smart move if it tanked like everything else...\nlets hope on a big drop on the premarket tommorrow. Could'nt find any news that would explain this.", "score": 2, "replies": []}]}, {"body": "Semi slowdown was apparently not as bad as expected. There was a wsb post about TSMC yesterday morning or last night. They basically didn't have any slowdown. IIRC, it had to do with customers stockpiling whatever chips they could get. I was surprised MU wasn't up with AMD since Samsung and SK Hynix were both shut down and and decreased capacity for a while. I'll see if I can find the post.      \n     \nEdit: found it: https://www.reddit.com/r/wallstreetbets/comments/fgsivm/signs_that_apple_and_amd_may_be_stockpiling_right/", "score": 2, "replies": []}]}, {"body": "What puts are even affordable anymore? Premiums are nuts.", "score": 9, "replies": [{"body": "I would love to know as well. SPY was always my main play due to the low IV before all this Corona BS.", "score": 6, "replies": []}, {"body": "Sell calls and collect the premiums from the 🌈🐂", "score": 2, "replies": []}, {"body": "I’m watching SPXS calls when DOW gets a bump up tomorrow", "score": 1, "replies": [{"body": "Bro. Dow will get shot in the face at open and then stumble around and collapse by close.", "score": 5, "replies": [{"body": "bet", "score": 1, "replies": [{"body": "May 15 290P. Still riding.  🤷🏼‍♂️", "score": 3, "replies": [{"body": "lol arguing with me about a 2 month contract no shit it’s going up. i’m talking about tomorrow", "score": 1, "replies": [{"body": "Okay internet guy. I’ll go risk another 50k on weeklies to show you up.", "score": 2, "replies": [{"body": "Don’t ask a question if you’re gonna get all pissy with an answer....lmao", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "stonks go up stanks go down", "score": 8, "replies": []}, {"body": "S N K O T S", "score": 3, "replies": []}, {"body": "I’m guessing bloodbath today followed by a rally courtesy of the plunge protection team.", "score": 2, "replies": []}, {"body": "Stonks only go up", "score": 4, "replies": []}, {"body": "HEY, WAKE THE FUCK UP YOU RETARDS!\n\nThe virus isn't just killing fat old boomers. No one is recovering. It hides in your nervous system and reemerges again when your immune system lets up. It does this again and again, wearing you down and scarring your lungs each time. That's why people are being released only to die later after being \"reinfected\".\n\n\nWE ARE ALL FUCKED, do you understand? If you catch this virus you are absolutely fucked.\n\n\nWHO does not include \"recovered\" in their reports, poorly defined\nhttps://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports\n\nNew: \"Recovered\" drops dead, surge of reinfections\nhttp://archive.is/MF0fv\n\n28-Feb: Israeli \"recovered\" case tests positive again\nhttps://archive.is/TV8DS\n\n28-Feb: South Korea \"recovered\" case reinfected\nhttps://archive.is/Gv1iu\n\n27-Feb: Xuzhou first case reinfected weeks after \"recovery\"\nhttps://archive.is/CuOtr\n\n27-Feb: \"Recovered\" in Japan sick again: reinfected or dormant\nhttps://archive.is/HjykE\n\n26-Feb: 14% of \"recovered\" in Guangdong test positive again\nhttps://archive.is/V6IgT\n\n21-Feb: Patient reinfects himself after \"recovery\"\nhttps://archive.is/8Ppkx\n\n19-Feb: \"There is a likelihood of relapse\", expert says\nhttps://archive.is/ABjjf\n\n14-Feb: Reinfection possible and even deadlier\nhttps://archive.is/Iw58p\n\n31-Jan: Patients can get reinfected, no immunity after \"recovery\"\nhttps://archive.is/W9vNf\n\nVirus hides in neurons, indefinitely escapes recognition\nhttp://archive.is/6NGuH\n\nVirus invades nervous systems\nhttp://archive.is/qmc6U", "score": -19, "replies": [{"body": "Fake and gay", "score": 23, "replies": []}, {"body": "How many posts are you going to copy paste this to. Fear mongering at its finest", "score": 11, "replies": []}, {"body": "Might have a point?", "score": -1, "replies": []}]}]}
{"title": "Buying calls on Call of Duty? Seems like destiny.", "selftext": "[deleted]", "id": "fh5msh", "created_utc": 1583965460.0, "score": 23, "upvote_ratio": 0.72, "num_comments": 51, "comments": [{"body": "Why are you gay?", "score": 36, "replies": [{"body": "I'm gay bear on everything else but ATVI at the moment so this is accurate.", "score": 9, "replies": [{"body": "Same. 4/17 $60. Small bull chub", "score": 4, "replies": []}, {"body": "F.  \n\n-4.1% since you posted.  \n\nONE OF US", "score": 1, "replies": [{"body": "I've held many times for a profit even after red days. We shall see. It's okay to be wrong.", "score": 1, "replies": []}]}]}, {"body": "Asking the real questions", "score": 3, "replies": []}, {"body": "“Yes. You are gay.”", "score": 2, "replies": []}]}, {"body": "Everyone is going to be home and locked down for 30 days. They will see the online numbers/subscriptions/loot crates and premium services skyrocket", "score": 23, "replies": [{"body": "Yea that's another point. Perfect timing.", "score": 5, "replies": []}, {"body": "Can my kid have a red hat, of the fuzzy variety?", "score": 1, "replies": [{"body": "Is he at Shriners?", "score": 2, "replies": []}]}, {"body": "Everyone’s 401k is wiped out and business are losing money to the point they will start firing people but sure parents totally will give their credit card to their kid for hats on a fake game.", "score": 1, "replies": [{"body": "Most wont even care about their credit cards and shit if they feel the world is ending. YOLO CREDIT CARDS", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I looked the other day... It's what I'd do if I was locked in my house for weeks. Pornhub marathon while watching the world burn", "score": 2, "replies": []}]}]}, {"body": "Better off buying puts if it actually does go up. Ive been buying puts on game companies through this stuff. Low ceiling (so minimal losses) but fall with market.", "score": 7, "replies": []}, {"body": "Now is not the time in my opinion, buy long dated calls in a two months.", "score": 6, "replies": []}, {"body": "Hey Siri, save this to my notes under “What not to do”.", "score": 4, "replies": [{"body": "!RemindMe 80 days", "score": 1, "replies": [{"body": "There is a 49.0 minute delay fetching comments.\n\nI will be messaging you in 2 months on [**2020-06-01 03:52:33 UTC**](http://www.wolframalpha.com/input/?i=2020-06-01%2003:52:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fh5msh/buying_calls_on_call_of_duty_seems_like_destiny/fkd92i5/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffh5msh%2Fbuying_calls_on_call_of_duty_seems_like_destiny%2Ffkd92i5%2F%5D%0A%0ARemindMe%21%202020-06-01%2003%3A52%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fh5msh)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "You were wrong. That is all. Goodbye. (Btw I made $7500 on this trade)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Also not the first BR they released.", "score": 2, "replies": [{"body": "First one wasn't free to play. Fortnite model works as explained above.", "score": 1, "replies": [{"body": "Still, the hype is gone. BR is old news. Just my opinion. Also skins on CoD suck, I would never buy one and I don’t know anyone who does. But do you see a lot of noob skins on Fortnite? No, I’ve played with fucking kids who were dead set on spending their monthly allowance on a unicorn bag and a rainbow covered eGirl. \n\nAlso, you can’t see your own character in CoD in-game, which is significant. Plus what do you have besides the character? A parachute? A weapon skin? All pales in comparison to the variety on offer in Fortnite. \n\nThey will make money of course cause it is CoD, but my advice stands. Wait for some skinny dipping then buy long-dated calls.", "score": 2, "replies": [{"body": "Great input and all valid points. Thank you.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is the way. Buying 25 contracts 60c 5/15 at open. Let them tendies print.", "score": 2, "replies": []}, {"body": "is it better to buy shares of sqqq or what options would you buy?", "score": 2, "replies": []}, {"body": "You selling it wrong.\n\nWith schools and colleges closing, where you think they will be? Home and indoors. Doing what? Playing games.\n\nAlso Overwatch 2 is in the works.", "score": 2, "replies": []}, {"body": "Made tendies for me yesterday when I sold to buy puts. 60c 5/15", "score": 1, "replies": []}, {"body": "\"it has views\" jesus christ you sound so uninformed", "score": 1, "replies": [{"body": "You don't know how modern gaming works.", "score": 2, "replies": [{"body": "i actually do, you sound like an old person who hasnt a clue", "score": 1, "replies": [{"body": "What makes me sound like an old person?\n\nHere's actual evidence of a correlation between Twitch views and game sales:\n\n[https://venturebeat.com/2016/07/13/twitchs-research-shows-that-livestreaming-leads-to-better-game-sales/](https://venturebeat.com/2016/07/13/twitchs-research-shows-that-livestreaming-leads-to-better-game-sales/) \n\nEscape from Tarkov has been around for a while now, but when they recently invested in their Twitch community, sales exploded.\n\nYou just sound like a dick.", "score": 2, "replies": [{"body": "im not going to sit here arguing my point stands, the way you write and talk and reference fortnite of all things means you are very unwise to be making such ignorant calls.\n\nactivision already priced in with share holders before COD even launched with the fluke success of the mobile game , you're like 6 months late to the party, like most the \"DD\" posts here \n\nyou're also suggesting buying calls/ stock based off one game,", "score": 1, "replies": [{"body": "As mentioned, Fortnite's revenue was close to $2 billion. While COD may not reach that because their characters aren't in 3rd person, doesn't mean they cannot achieve a billion in revenue which would be a large increase over their 2019 revenue. Making calls is a big risk in this bear market, but it's a risk I'm willing to take. Keep saying I'm unwise. At least I've presented some evidence that has led to my decisions. Best of luck in 2020.", "score": 1, "replies": [{"body": "referencing fortnite over and over again isn't \"evidence\"\nmy \"evidence\" was the investor concerns prior to launch and the extremely successful mobile game launch\nyou have literally no idea what you are talking about and like most DD's on this sub, you are 6+ months late to the party. i'll be fine with my 300% gain picks, you have fun buying calls when literally they just cancelled E3 and pushed back every game release for atleast a year due to new consoles \nat the time of your post and now, you are down 7% on your calls", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Viewership is always high when a game first comes out.", "score": 1, "replies": []}, {"body": "Every college and high school student in the country is about to have shit else to do but sit at home and play video games. This is a perfect time for this release. I'm all puts but calls on ATVI", "score": 1, "replies": []}, {"body": "I would sell you that call because the price isn't going to move much", "score": 1, "replies": []}, {"body": "this is facts I play warzone and I hate battle royale, but its kinda good..", "score": 1, "replies": []}, {"body": "u/OnlineWithLuke", "score": 1, "replies": [{"body": "These calls made me money. Glad to see the stock price is even higher now.", "score": 2, "replies": []}]}, {"body": "They are heavily paying influencers for advertising. This game is insanely buggy and laggy. Eh", "score": 0, "replies": [{"body": "Not any more so than Apex, which I also play.", "score": 0, "replies": [{"body": "And COD is about 30x slower than Apex.  \n\nAll you do is shoot.  Apex at least is a bit different.  \n\nIn Fortnite you can just fucking build your way out of a gun fight, and it's buttery smooth.  \n\nThe best thing ATVI can do is retire COD and take the hit.  Then, in 5 years, bring it back, and watch the fucking stock moon.", "score": 0, "replies": [{"body": "You run slower, and you don’t have abilities propelling you, that’s about the only difference in base game mechanics.", "score": 0, "replies": [{"body": "Yes, that and one is exciting and new while the other is a played out rehash of the same shit we've been playing since 2007.\n\ngreat point you fucking bell end", "score": 0, "replies": [{"body": "Well that’s a good example of opinion. My opinion is that I’m glad somebody has taken the Battle Royale game type and made it not suck for a change. All the others are plagued by terrible servers, lack of optimization, a very polluted loot pool, or just general clunky mechanics.", "score": 0, "replies": []}]}]}]}]}]}]}
