{"title": "$TSLA: Elon Musk over the moon as SpaceX makes history with rocket landing", "selftext": "Elon Musk over the moon as SpaceX makes history with rocket landing\n\nhttp://www.marketwatch.com/story/elon-musk-over-the-moon-as-spacex-makes-history-with-rocket-landing-2015-12-22?dist=beforebell&cb=logged0.15882518864236772", "id": "3xtuae", "created_utc": 1450787730.0, "score": 45, "upvote_ratio": 0.79, "num_comments": 34, "comments": [{"body": "What does a SpaceX achievement have to do with Tesla stock, apart from a common CEO?", "score": 28, "replies": [{"body": "Musk delivers results. Amazing results. This is the difference. ", "score": -1, "replies": []}, {"body": "[deleted]", "score": -14, "replies": [{"body": "[removed]", "score": 5, "replies": []}]}]}, {"body": "I was wondering do you know the numbers?  How much is this rocket style expected to save people on space travel? ", "score": 2, "replies": [{"body": "I think I saw somewhere that it costs 61 million to launch a falcon 9 right now and if the first stage is reusable it will cost 5-7 million.  \n[source](http://www.parabolicarc.com/2014/01/14/shotwell/)", "score": 4, "replies": []}, {"body": "A good analogy is to imagine building a 747 to fly from NY to LA. And you can't reuse the plane after that flight. That's rocket travel. Now we can reuse to 747 as many times as we need.", "score": 3, "replies": []}, {"body": "Too early to say for sure.  The facts are the booster that landed costs 16million to manufacture.  The fuel it expenses costs 20k.  So presumably, a metric shit ton.", "score": -5, "replies": [{"body": "I think you meant $200k per refuel.", "score": 5, "replies": [{"body": "Sources vary, but elon has said in the past the fuel is about 00.3% of the overall cost.  \n\nI can't find a source ATM.  Where's your 200k number from?", "score": 1, "replies": [{"body": "It was from a comment Elon said some years ago.\n\nhttps://youtu.be/xrVD3tcVWTY\n\nhttp://shitelonsays.com/transcript/npc-luncheon-with-elon-musk-2011-09-29\n\n\"...cost of a Falcon 9 rocket. ...it's about $50 to $60 million, but the cost of the fuel, and oxygen and so forth, is only about $200,000.\"", "score": 3, "replies": [{"body": "Thanks bud.  That concurs closely to the 0.3% number.  My numbers must have been from a smaller rocket, grasshopper or the like.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It could be because Musk announced a shortened timeline to autonomous cars. \n\nhttp://www.businessinsider.com/elon-musk-says-his-driverless-car-will-be-here-in-two-years-2015-12?utm_source=feedburner&amp;utm_medium=referral", "score": 2, "replies": []}, {"body": "Tesla is slightly up. Falcon 9 landing shows Elon has the idea what he's doing and a good team of professionals. Sure, he will not isolate them from Tesla projects", "score": 1, "replies": []}, {"body": "TESLA: American company made with American parts and American people, so many anti American douche-bags betting against this.", "score": -4, "replies": [{"body": "Named after a Serbian and founded by a Dutch African. I think his biggest rivals are Americans, specifically ULA.", "score": 6, "replies": [{"body": "ULA is not a Tesla competitor.....", "score": 3, "replies": [{"body": "In cars probably Ford/Google alliance.", "score": 2, "replies": []}]}, {"body": "Elon identifies as an American. ", "score": 5, "replies": []}, {"body": ">  by a Dutch Afr\n\nyou sounds like a racists. Tesla is a great American company. ", "score": 0, "replies": []}, {"body": ">  by a Dutch Afr\n\nyou sounds like a racists. Tesla is a great American company. ", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "I wonder how many billions of dollars elon will save tax payers with reusuable rockets? But let's just ignore that for the sake of your ignorant comment! \n\nEdit: its called investing, and you are on a subreddit for stocks. \n\nStep 1: government uses tax dollars to help fund spacex and send satellites into orbit.\n\nStep 2: tax payers act like whiny bitches towards spacex but are okay spending 10x more with NASA for the same rocket. \n\nStep 3: SpaceX succeeds and will save billions in space flight, making the investment well worth it\n\nStep 4: pretend step 3 doesn't exist and keep being an ignorant douche and thinking elon is just scamming government dollars when literally doesn't give two shits about his bank account. The guy was ready to move in with family and sell everything to keep his companies afloat for the better of humanity. ", "score": 13, "replies": []}]}]}, {"body": "Space-grade alloy metals from spacex are why tesla goes 0-60 in < 2.8 and has a roof that couldn't be crushed.", "score": -4, "replies": []}, {"body": "Bezos completed the same thing with his company a month ago.", "score": -5, "replies": [{"body": "What Elon did was **significantly** more difficult.", "score": 3, "replies": []}, {"body": "According to the article: \n> Last month, Bezos’s Blue Origin beat Musk by successfully sending a test rocket, the New Shepherd, to the edge of space and landing it safely again. But SpaceX went one better, as the Falcon 9 went around the Earth before being brought back — seen as a more difficult task", "score": 1, "replies": [{"body": "yeah, it's not comparable. SpaceX is totally amazing. Is it possible for SpaceX to go on IPO? ", "score": 1, "replies": []}]}]}, {"body": "SpaceX IPO in 2016. Who is buying that?", "score": -2, "replies": [{"body": "I thought Elon said he want taking SpaceX public until the MCT was making regular trips, did something change his mind?", "score": 5, "replies": [{"body": "Looks like you are right. Someone saying the same thing. You have a link by any chance?", "score": 1, "replies": [{"body": "A quick Google search found \n\nhttp://www.usatoday.com/story/money/cars/2015/06/09/elon-musk-mars-spacex/28768361/\n\nBut I remember him saying that a long time ago. It has been something that he has said on several interviews. He likes the freedom of being private, more than anything he doesnt want the shareholders forcing his hand. He created SpaceX for the Human Colozination of Mars. That is his stated goal. And he doesnt want shareholders and quarterly profits keeping him from that goal.", "score": 2, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}]}, {"body": "No IPO until SpaceX is making regular trips to Mars. From Elon himself.", "score": 2, "replies": [{"body": "Wow. Where did you read this?\n", "score": 1, "replies": [{"body": "I don't have article on hand but it should be easily googable. Just type when the spacex IPO is", "score": 1, "replies": []}]}]}]}]}
