{"title": "Timing the Market: 101", "selftext": "Here is my favorite method.\n\nStart with any 'ol stock price shower. Seeking alpha or google will do. AAPL will be our example. So, first Google the price of AAPL ([HERE](https://www.google.com/search?client=safari&rls=en&q=the+price+of+aapl&ie=UTF-8&oe=UTF-8)), then open a timer ([HERE](http://www.timer-tab.com)). Then take the current price of AAPL and take the timer and hit \"start stopwatch\". Then wait until you feel you have reached a time limit, any span of time will work and then hit where it says \"PAUSE\". It will have two vertical lines. Once you've paused the timer, go back to the google page and press the reload button. You have timed the market. Many yachts will follow. Believe me. Want proof? Here is my [private marina](http://www.amber-lounge.com/sites/default/files/styles/content_popup/public/images/news/mys_16_copyright_tomvano_0.jpg?itok=yGGHkD1Z). If I can do it, SO! CAN! YOU!\n\nNote: Timing the market works best when markets are open.", "id": "3vgmk6", "created_utc": 1449262329.0, "score": 35, "upvote_ratio": 0.74, "num_comments": 31, "comments": [{"body": "Next article down. Insider trading: Open up Robinhood INSIDE any building and make a trade, wait for police.", "score": 20, "replies": [{"body": "Christ I can already hear the helicopters", "score": 3, "replies": []}]}, {"body": "\"You cannot time the market you idiot. The market always goes up at 8% per year, no matter what, forever. Past returns = future results. What happened in Japan since 1989 cannot happen in the US, ever.  Buy Vanguard index funds and fuck you.\"\n\n- /r/investing ", "score": 18, "replies": [{"body": "Wasn't it 7%? When did /r/investing get so brash?", "score": 5, "replies": []}, {"body": "8%? What an aggressive claim.", "score": 2, "replies": []}]}, {"body": "My market's times are slow. How can I speed it up?", "score": 6, "replies": [{"body": "If you close your eyes while that stopwatch is running, it will be like time went by extra quick because you didn't see it happen", "score": 4, "replies": []}, {"body": "TBEV sells a great product for that", "score": 5, "replies": [{"body": "Fml. I'm expecting gape from the upcoming 100:1 RS. ", "score": 1, "replies": [{"body": "Freudian slip?:\n\nGape? grape. Jelly. Peanut butter and jelly. Your username.", "score": 1, "replies": [{"body": "[gape](http://www.urbandictionary.com/define.php?term=gape&utm_source=search-action) as in im gonna get fucked in the ass by the reverse split. no freudian slip here. ", "score": 1, "replies": [{"body": "*Here's the Urban Dictionary definition of* [***gape***](http://www.urbandictionary.com/define.php?term=gape) : \n\n---\n\n>The stretched out asshole after being fucked in the ass. A result of [duke](http://www.urbandictionary.com/define.php?term=duke)ing it.\n\n\n---\n\n_After I tore her ass up, she had a huge gape._\n\n\n---\n\n[^(about)](http://www.reddit.com/r/autourbanbot/wiki/index) ^| [^(flag for glitch)](http://www.reddit.com/message/compose?to=/r/autourbanbot&subject=bot%20glitch&message=%0Acontext:https://www.reddit.com/r/wallstreetbets/comments/3vgmk6/timing_the_market_101/cxnvozq) ^| ^(**Summon**: urbanbot, what is something?)", "score": 2, "replies": []}]}]}]}]}, {"body": "You need an AMD CPU.  Take that Intel Core i7 6900k to the garbage and swap it for a smooth AMD K7.", "score": 2, "replies": []}, {"body": "I don't care to speed up, I want to reverse it!", "score": 1, "replies": [{"body": "You'll have to trade 88 shares per hour while holding a Rolex", "score": 3, "replies": [{"body": "But how do I afford a rolex if I can't time-reverse YOLO?", "score": 1, "replies": [{"body": "A knockoff will do for now, it just had to be good enough to fool the spacetime continuum.", "score": 3, "replies": []}]}]}]}, {"body": "Lots of hamsters, lots of wheels", "score": 1, "replies": []}]}, {"body": "i just timed the market but nothing happened\n\nedit: oh i see \n>best when markets are open", "score": 5, "replies": []}, {"body": "Just buy the dip. Borrow money and buy the dip.", "score": 3, "replies": []}, {"body": "Yachts in water? Where are the space yachts? I bet you're really 15! I don't even know if I can trust the information in your writeup!", "score": 1, "replies": []}, {"body": "I think the hardest thing here was searching for that harbor on google images ", "score": 1, "replies": [{"body": "It's Monaco. I am Prince Albert.", "score": 3, "replies": [{"body": "Went to Monaco once. Literally every single person is of the elite %1 oil money class. Those people even have the YOLO class beat.", "score": 1, "replies": [{"body": "You mean, besides the mob of tourist plebs on the designated tourist pleb areas...", "score": 2, "replies": [{"body": "LOL I was a tourist pleb. If those people could've spit on me, they probably wouldve. It's one of the few times I've felt like a disgusting peasant in my life.", "score": 2, "replies": []}]}, {"body": "I've been one time for a day and my mom lived there for a few months. It's really crazy.", "score": 2, "replies": [{"body": "Not unless I had a slip with a yacht or one of those condos, I wouldn't go back if you paid me. It was like some cruel, weird game for rich people to parade you around in the rain and laugh at you while they blow past you in ferraris.", "score": 2, "replies": [{"body": "I didn't see it like that. Sorry you had a bad experience.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Take the gild, bitch.", "score": 1, "replies": [{"body": "Oh, you're too kind!\n\n^^^seriously ^^^thx ^^^though ^^^<3", "score": 1, "replies": []}]}]}
