{"title": "[deleted by user]", "selftext": "[removed]", "id": "fgqru3", "created_utc": 1583897384.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 48, "comments": [{"body": "Recession is defined as a slump with duration. \n\nA slump in GDP, not stock averages. \n\nOver 2 quarters.", "score": 15, "replies": [{"body": "Wow that’s 50 cents", "score": 21, "replies": []}, {"body": "two quarters", "score": 1, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}, {"body": "Right now, half the people I know think corona is the end of the world and the other half think it's the same as a flu/common cold. Really, it falls somewhere in the middle. However, as more places contract the virus and people see local quarantines and business closings, the non-believers could overreact and cause a further drop.\n\nSo far, I've held my portfolio, since they're all Div stocks. I also sold a couple 24 day $90 DIS puts. Other than that, I have some dry powder waiting for the discounts.", "score": 5, "replies": []}, {"body": "China is contracting massively, recession in Japan and Germany is certain.  Those are the other 3 major world economies.  \n\nThere is only so much stimulus we can muster, no question we are hooked on it at this point.  Supply shock causes inflation and that breaks this pony ride.  Hold on.", "score": 10, "replies": [{"body": "Yes sir 👋 I’m leaving reddit now to go to sleep let’s see what happens at 9:30 🤔", "score": -2, "replies": []}]}, {"body": "There will be a recession. But not a crisis like last time where the world was ending. I think the Dow falling below 20,000 is a bit far. But with more cities and countries canceling events and traveling going down, it just make sense to see a contraction of some sorts. A big issue would be how many rate cuts we see because that will impact bank profitability. And we all know from experience that banks matter more than anyone else. If oil prices stay low that may mean layoffs and bankruptcies in that industry which will hurt local economies, but not the macro picture. Sad but true.", "score": 4, "replies": [{"body": "What about the banks that are eyeing up the prospect of these highly leveraged energy companies defaulting on their loans? The banking sector will take a kicking too...I highly doubt Putin will step down from his power move easily. It's as much about recouping market share from the states as it is about sending over a big fuck you to the government for their sanctions of late.", "score": 2, "replies": []}, {"body": "We’ll see in one month all depends on how much more the virus grows, what’s gonna happen with China, and if all of Europe turns into Italy", "score": 1, "replies": []}, {"body": "Well looks like we might actually hit 20 k after all", "score": 1, "replies": [{"body": "Damn. You might be right. Crazy how far and fast this is falling apart.", "score": 1, "replies": [{"body": "The fall is near my boy get ready", "score": 1, "replies": [{"body": "There it went! Below 20,000. This is surreal.", "score": 1, "replies": [{"body": "Yep", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Very likely", "score": 3, "replies": [{"body": "Think again", "score": 1, "replies": []}]}, {"body": "Most likely yes. World economies all over the world are contracting due to the virus. Even with no effect in the US it is likely to lead to a recession in the US. We are only growing at 2% afterall.\n\nWhat we have here is a possible black swan event. If the virus spreads in the US and you have people avoiding going out, traveling, and spending money..... how can GDP not decrease by 5 to 10%? \n\nAlso, you quarantine, virus dwindles, then you open back up, what happens to the virus? Is it gone forever or does it start spreading like wildfire again?\n\nIt seems like the only think that can be done is slow the exposure through quarantine so hospitals don’t get overwhelming and allow the virus to spread at a more manageable place. Also, pray for a vaccine and give time for testing vaccines.", "score": 1, "replies": [{"body": "Unfortunately a vaccine alone would take 1-2 years and I don’t wanna imagine how long it is for a cure and that’s saying if it doesn’t mutate.", "score": 1, "replies": []}]}, {"body": "pretty sure we’re well on the path.", "score": 1, "replies": [{"body": "It looks like we are based on how many people are telling me.", "score": 1, "replies": [{"body": "Prior to December a correction was coming. Economy had been slowing, tarifs only hurting American business, the freaky events in the repo market, the vix, inverted yields, and many more pointed toward an inevitable correction. Even China was reporting slowing growth! \n\nThere of course all those chanting all is well/fake news etc. It really reminds me of the group think rampant in the .Com bubble. \n\nEconomies don't like uncertainty. Trump and Fox claim the pandemic is just a nothing burger, it's a bad cold for 99%... reassuring the listener nothing to see. \n\nChina isn't known for having kid gloves towards its own citizens, etc and this is the Government shut it /ALL/ down. Quarantined hundreds of millions all at an incredible financial cost to the people and the businesses. \nSimply put - I have no idea how to balance this equation. Trump says nothing, a brutal government is freaking out. Both can't be right. \n\nFor me, what I'm hearing and seeing are very diametrical and not reconcilable. Politicizing the government reaction in the states isn't comforting. Gross mismanagement of this global crisis can't have a positive impact.", "score": 1, "replies": [{"body": "Dow futures are down 700 points", "score": 1, "replies": [{"body": "Thanks for pointing that out btw. For something truly frightening take a peak at today’s credit spread starting in dec 2007. Spooky and enxiety inducing. \n\nFull disclosure: I’m short SPY. I’m a bastard actively betting against MAGA and it’s making my stomach churn seeing this. Real people are losing hard and will lose more than just on paper. \n\nIsn’t there a stat of something like 40k jobs lost with each tick in the GDP? \n\nIt’s going down like an Italian fighter pilot!", "score": 1, "replies": [{"body": "I think so and airlines are going to crash tomorrow meaning a slip in oil", "score": 1, "replies": [{"body": "What are you thinking regarding hospitality- hotels. I don’t hear much from the talking heads on that.", "score": 1, "replies": [{"body": "Hospitals are going to over flood we don’t have enough beds.", "score": 1, "replies": [{"body": "Unquestionably. \nIm thinking more about the hospitality industry. I’m going to open a new post...", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "My best guess, in a worst case would be we retest the December 2018 lows around 22,000 on the Dow. A short swift recession will probably happen around election time. This will be just enough to cost Trump the election. Then we are f*cked", "score": 1, "replies": [{"body": "Ok we’re hitting 20k on Dow get ready", "score": 1, "replies": []}]}, {"body": "That was kind of a trick 2 questions when you said you only had 1", "score": 1, "replies": [{"body": "My bad", "score": 3, "replies": []}]}, {"body": "Well lots of people around the world are dying so", "score": 0, "replies": [{"body": "Lots of people die around the world every day and no one cares", "score": -4, "replies": []}]}, {"body": "I say 50/50 for a major one", "score": -1, "replies": [{"body": "Would about just a normal recession", "score": 0, "replies": [{"body": "Thats why i said 50/50", "score": 0, "replies": [{"body": "50/50 I say also. It could be stopped or 40 to 70% of the population could get it. Your guess is as good as mine.", "score": 2, "replies": [{"body": "Your very right we’ll just have to see", "score": 1, "replies": []}]}, {"body": "Ah my dumb ah.", "score": 1, "replies": [{"body": "I deff dont think the dow will go below 20,000", "score": 1, "replies": [{"body": "And if it does then what", "score": 1, "replies": [{"body": "Hold and buy", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Hmmmm more likely worst take a look at Italy", "score": 0, "replies": []}]}, {"body": "Quick question, the stock market went up today because of the stimulus package.\n\nHow long does that effect last?", "score": -6, "replies": [{"body": "Will go down tomorrow since nothing was delivered in the meeting", "score": 8, "replies": []}, {"body": "Looks like it won’t last very long. Go look at futures", "score": 1, "replies": []}]}]}
{"title": "What is everyone doing to protect themselves?", "selftext": "I never like to sell out in a panic, so I'm riding out whatever may happen. I usually buy when there's blood in the streets, but right now there's so much blood I can't see the street. I sold a $90 DIS put because if the market crashes hard enough for that, I don't mind getting paid to buy DIS at below 5 year lows.\n\nFor protection, I bought a couple of SPY APR 3 200 Puts as insurance. It's so far out, it was cheap, and if the market comes down hard, it should balance out some of my losses. I also have some dry powder to buy up the discounts eventually.\n\nWhat about you guys?", "id": "fh1jb6", "created_utc": 1583950267.0, "score": 7, "upvote_ratio": 0.78, "num_comments": 42, "comments": [{"body": "I bought an AR15 recently. \n\nOats \n\nRice \n\nSpam \n\nPulled my kids out of school. \n\nStuff like that.", "score": 25, "replies": [{"body": "That's another form of protection lol", "score": 7, "replies": []}, {"body": "hide yo kids hide yo wife", "score": 4, "replies": []}, {"body": "Don't forget ammo and mags. And, if time permits (if you're a new gun owner), training.", "score": 1, "replies": [{"body": "I shoot IPSC and have some formal training. Been shooting for years. But your response is well received and I appreciate it.", "score": 3, "replies": [{"body": "No toilet paper?", "score": 3, "replies": [{"body": "Couldn't find any.", "score": 2, "replies": []}]}]}]}, {"body": "Bruh. \"pulled my kids out of school\"", "score": 1, "replies": [{"body": "Whats wrong with that?", "score": 1, "replies": [{"body": "Why can't they go to school.", "score": 1, "replies": [{"body": "Because I don't want to go to the ICU.", "score": 2, "replies": [{"body": "There is a low chance your kids will get the Coronavirus (COVID-2019.) They can prevent it by washing their hands.", "score": 2, "replies": [{"body": "Yes. the risk is low. But I'm unhappy with the response, I have lost trust in the officials who are in charge of this. The italy situation is very concerning. \n\nI don't need to take risks. My kindergarteners can color at home instead of at school.", "score": 3, "replies": [{"body": "You have more intelligence than me.", "score": 1, "replies": []}, {"body": "You can keep your kids home.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "He pulled out", "score": 1, "replies": [{"body": "Should I be scared about getting COVID-19. I am a kid.", "score": 1, "replies": []}]}]}]}, {"body": "Markets to volatile for my likings. Have to take a step back before my anxiety gets the better of me. I already bought in on some, probably a mistake, but going to hold while the madness passes. \n\nTL;DR,  Nothing, stocking up on ca$h and TP.", "score": 4, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}, {"body": "I’m early enough in my investing carrier that a job is all the protection I need. What is it to loos 50%, if I have 200+% of my invested capital coming in trough paychecks ever the next few years", "score": 4, "replies": []}, {"body": "Buying more stock", "score": 5, "replies": [{"body": "Not right now wait 10 days and you will see the light", "score": 1, "replies": [{"body": "Irrelevant to me, I have long time horizon", "score": 12, "replies": []}]}]}, {"body": "I feel like it’s gonna be a “dead cat bounce” again tomorrow.", "score": 2, "replies": []}, {"body": "Nothing, I'm trying to get more exposure to the market. I'm leveraging up as much as I can and deploying savings into the market.\n\nIt's a little bizarre to me how people are playing defensive now and not when stocks were extremely overvalued at the start of Feb, but okay.", "score": 2, "replies": []}, {"body": "I remembered to wear a condom", "score": 2, "replies": []}, {"body": "Treasury bond ETFs", "score": 1, "replies": []}, {"body": "If spy hits $200, that's terrible", "score": 1, "replies": [{"body": "A few days like this and more virus worries and it *could* happen. However, I just bought that far out because it's a cheap way to hedge a worst-case scenario.", "score": 1, "replies": [{"body": "SPY to 200 will never happen lol", "score": -1, "replies": [{"body": "Everyone thinks this virus is nothing or the end of the world. There is no in between, so as more people see local quarantines and flip the switch in their thinking, there could be a major crash. However, I do agree with you and I'll likely sell the puts before expiration while uncertainty is still high.", "score": 2, "replies": []}, {"body": "Why not? That would be 40% down which is around the average crash for a recession.", "score": 1, "replies": [{"body": "Oh i thought SPY and S&P500 was the same thing, apparently they aren’t. My bad", "score": 1, "replies": [{"body": "SPY = 1/10 S&P500 price. SPY 200 would be the S&P500 dropping 40% which is not unheard of during a recession/crash.", "score": 1, "replies": [{"body": "Makes sense", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not for my retirement in 20+ years.", "score": 1, "replies": []}]}, {"body": "I bought tvix stock last week.", "score": 1, "replies": []}, {"body": "I'm selling some of my weaker positions to buy short ETFs and puts. Although going to still hold long 80% of my positions.", "score": 1, "replies": []}, {"body": "Silver. Cheap...right now. Most undervalued asset in history. Get some while you can. Keep in your own possession. Wealth insurance. The price rigging ends when the COMEX falls.", "score": 1, "replies": []}, {"body": ">I never like to sell out in a panic\n\nMaybe you should. You worked too hard for your money to waste it based on old fashioned advice. The market will recover but it will take many years to reach this level\n\nI've cut my losses at 11% and will re-enter in 3 months when the S&P is at 1,700", "score": -7, "replies": [{"body": "What has fundamentally changed about this market?\n\nWhat deaths of seniors are going to reduce global production or decrease consumer demand five years from now?", "score": 2, "replies": [{"body": "The whole tourism, manufacturing, leisure, f&b, etc sectors fucked, and the feds printing money like never before are not enough fundamentals changed?", "score": 1, "replies": [{"body": "For my own interest, might you name what a fundamental is?\n\nWhen was the last time the Americans were punished for increasing money supply? Do you remember what happened last time?\n\nI'm still wondering what fundamentals you are assuming are different in five years.", "score": 3, "replies": []}]}]}]}]}
{"title": "Savant Capital Investment Meeting Takeaways", "selftext": "**TLDR at bottom of each section**\n\nThis will likely remain relevant, written on 3/10/2020\n\nALL PERCENTAGES ANNUALIZED\n\n# Long-term (10+ years)\n\n* Bonds will likely rise significantly\n   * Upwards of 6%\n* Small stocks see a 1.9% general growth trend over 50 years\n* Valued stocks see a 3.5% better general performance than small stocks over the same term\n* Interest rates will likely remain as current +- a percent\n* Global GDP will remain stable\n* **Conservative 20-year forecast**\n   * **US Stocks:** \\+8.3%\n   * **International Stocks:** \\+9.6%\n   * **Bonds: +**3.6%\n   * **Commodities, futures, property, etc:** \\+7.1%\n* Oil will grow\n\n**Long term takeaway:**\n\n* Small, value, and international stock diversity yields the highest percentage gain.\n* Commodities and bonds are ass\n* International stocks are cheap and will certainly appreciate in value\n\n# Intermediate-term (current market cycle of 2020s)\n\n* Milsec based stocks will either increase or decrease dramatically based on the election of 2020\n   * Overall, election will result in no major market moves\n* General growth will continue, but at a slower rate than the 1990s and 2000s\n* Likely growth after COVID-19 is contained, sustaining for \\~7-8 years\n* $SPY will grow, but lag 5% behind value stock between \\~Y2-Y9\n* US large growth stock will be the best performers until \\~Y3\n* The US will fall behind international stock value\n* International stocks historically cheap, will certainly grow\n\n**Intermediate term takeaway:**\n\n* International stocks are cheap and will gain value\n* $SPY will lag by 5% of value stock\n* US Large stock are poor performers beyond Y3\n* Economic boom until Y7\n* Energy will return and grow\n\n# Short-term (2020 and a bit further)\n\n* Fed will continue interest cuts until after COVID containment\n* Milsec based stocks will either increase or decrease dramatically based on the election of 2020\n* Logistics and supply chain will be most hurt by COVID as we move further into the pandemic\n* Unprecedented market falls\n   * Record high recovery\n   * Continued volatility\n* China has COVID controlled, Chinese year calls are viable\n* Oil fall results in high renewable energy value\n* Expect a stimulus\n\n**Short term takeaway:**\n\n* COVID will get worse than now\n* Supply and logistics puts are a good short term idea\n* Pricing in WILL NOT happen for a few months while demand builds\n* Stimulus is likely\n* The fed will cut interest to near zero\n* We will likely see record highs after COVID containment\n\n# Other information\n\n**Recession recovery timelines**\n\n* Full crash (20% drop) **<CURRENT IMMINENT STATUS**\n   * 20 month recovery period\n* Imminent Recession (10% drop)\n   * 8 month recovery period\n* Market shift (5% drop)\n   * 2-3 month recovery period\n* Expect a -0.15% growth in global growth during this period\n\n**Presidential Election shit**\n\n* As stated above, Milsec will make the biggest differences\n   * Healthcare will see slight bumps\n* Average of 10% growth between election cycles, consistent with current data\n\n**Brokerage info**\n\n* Robinhood maxed credit line last month, possible increase in premiums\n* TD Ameritrade to merge with Charles Schwab\n   * TD Ameritrade users will not notice a transition\n   * Schwab users will likely experience interruptions in trading and account information/access\n\nSource: [Savant](https://www.savantcapital.com/) datacrunching (it was a private event, I don't have a specific source. Will link resources as I get them)", "id": "fgp72s", "created_utc": 1583890513.0, "score": 93, "upvote_ratio": 0.97, "num_comments": 39, "comments": [{"body": "How much of a rich fuck do you have to be in order to be one of their clients? Also, how accurate are their previous predictions?", "score": 23, "replies": [{"body": "They've been pretty accurate in the past, but they also do very high diversification.", "score": 17, "replies": [{"body": "You didn’t answer the first question", "score": 4, "replies": []}]}]}, {"body": "tf is this. SPY PUTS. TENDIES STRIKE PRICE AND EXP IDIOT", "score": 37, "replies": [{"body": "my fuggin balls 3p 3/17", "score": 21, "replies": [{"body": "You are now his daddy", "score": 7, "replies": []}, {"body": "expiration date too early, won’t drop by then", "score": 3, "replies": [{"body": "Damn got me there", "score": 1, "replies": []}]}]}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 8, "replies": [{"body": "WTF is a MacDonald?  I keep seeing this.", "score": 2, "replies": []}]}, {"body": "Robinhood maxed credit lines. \n\nLooks like we know what caused the \"major outage\".", "score": 6, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "The price of stocks will not adequately represent the value of a company until a few months from now. Currently, surplus supply is keeping companies afloat but with production and logistics shutdowns they will run dry in a few months and the price will reflect it at that time. TLDR don’t worry about buying puts at the bottom because the price of the stock may still go down if it relies on supply logistics", "score": 5, "replies": []}]}, {"body": ">Full crash (20% drop) <CURRENT IMMINENT STATUS\n\nTo clarify, they're stating there is a highly probability of a recession. Is this correct?", "score": 5, "replies": [{"body": "I read that as \"we're already there.\" But I'm too lazy to do the math if we've seen a 20% drop yet.", "score": 2, "replies": [{"body": "Not sure what the calculation would be but SPY ATH was 339. A 20% from that would be - 68 points. So... 339 - 68 = 271.\n\n\nSPY closed today at 288. I'm a bull but I'm sure it gotta go lower than 271.", "score": 3, "replies": []}]}, {"body": "Yes, they figure that an index composite drop of 20% means that there’s a recession inbound. Some composite already show a 20% drop, others don’t", "score": 1, "replies": []}]}, {"body": "Big shit right here", "score": 5, "replies": []}, {"body": "This is pretty great. Gonna re read this in the AM with a fresh mind. Not that it will do any good, but it was very informative.", "score": 4, "replies": []}, {"body": "What are \"Milsec based stocks\"?", "score": 4, "replies": [{"body": "Military sector, so arms manufacturers and supplies", "score": 4, "replies": []}, {"body": "Wondering this too", "score": 2, "replies": []}, {"body": "Halliburton is fuckin steal rn", "score": 2, "replies": []}]}, {"body": "This is the gold nugget info we need.", "score": 5, "replies": []}, {"body": "RemindMe! 40 days", "score": 2, "replies": [{"body": "**Defaulted to one day.**\n\nI will be messaging you on [**2020-03-12 03:34:45 UTC**](http://www.wolframalpha.com/input/?i=2020-03-12%2003:34:45%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fgp72s/savant_capital_investment_meeting_takeaways/fk6b6wu/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffgp72s%2Fsavant_capital_investment_meeting_takeaways%2Ffk6b6wu%2F%5D%0A%0ARemindMe%21%202020-03-12%2003%3A34%3A45%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fgp72s)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Nice share", "score": 2, "replies": []}, {"body": "Good shit my guy", "score": 2, "replies": []}, {"body": "Where was my invite", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "pretty gay", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "My father is afraid of risk", "score": 3, "replies": []}]}, {"body": "Call me retarded, but not only did I not see a ticker in your post, you forgot to include a strike price and date?", "score": 1, "replies": []}, {"body": "\"We will likely see record highs after COVID containment\" - record highs above where we were trading around 19th Feb? Please can you clarify? \n\nI also assume these record highs would not be obtained for the 20 months as outlined in your full crash bit above? \n\nI too have calls in $VIRT and intend to buy more. Interested to know why so far OTM for $DIS? Is that to reduce capital. Im in for 100s. Sorry for so many Qs. Thanks for DD, much appreciated out here in the wild wild west of wsb", "score": 1, "replies": [{"body": "Q1: It would be the highest the US market has ever seen  \nQ2: Yes, it would occur after the recovery  \nQ3: $DIS owns a lot of things, including live sports, Marvel/Star Wars, and obviously their parks.  \nLive sports - No live spectators > lower profits  \nMarvel/Star Wars - Actors are very valuable, so productions will likely slow down and increase in cost  \nParks - With EU travel ban, lots of tourism to the parks end. Ideally they shut them down. Huge profit loss.", "score": 1, "replies": []}]}, {"body": "This is worthless DD and a waste of space on the internet.", "score": -1, "replies": []}]}
{"title": "Unusual Options - T/BAC/DIS/", "selftext": "Today I included the aggressive orders, T seems really aggressive since the orders have come in the last 2 days heavy on puts.\n\nThese options orders are on or above the ask. Many have the same expiry and strike. Also lots  of the orders were sweeps so these ppl were  breaking  down their order to get filled faster.\n\nHere - [https://imgur.com/a/uW2JNFH](https://imgur.com/a/uW2JNFH)\n\nAlso all these orders volume of the contracts exceeded the open  interest in multiple trades so it's most likely not closing positions. Either buy to open orders or sell to open orders and based on the    aggressiveness of the orders one can infer its buy to  open.  Some of these may be hedges and some most likely not.\n\nThe T orders are very aggressive, normally T does not have so many sweeping orders especially all puts. Unsure if their is a dividend date or any news pending but that should be watched.  The NCLH was aggressive but those orders are already right and it's too late to chase. Ppl believe Bac will keep dropping.\n\nThese orders are from morning to now (2:24pm)\n\nDon't just enter YOLO's in positions based on this data alone in most cases. Use  technicals/fundamentals/options data/market feelings all combined instead of just 1 of these.   Use protection like spreads if you worry about losing what u put in and be  smart,  understand the  risks of putting $ into weekly expiry's, consider a longer expiry.\n\nAlso with the market going lower use technicals/fundamentals/options data-flow all combined. Someone said ibb has ads so use an adblocker we are in 2020\n\nWanted to add, People thought the SBUX puts couldn't happen back at this post, now they are raining in tendies. Anything is possible. I checked the prices today and those were 150-300% gainz - [https://www.reddit.com/r/wallstreetbets/comments/fdjwgq/unusual\\_options\\_sbuxfeyenflx/](https://www.reddit.com/r/wallstreetbets/comments/fdjwgq/unusual_options_sbuxfeyenflx/)\n\n&#x200B;\n\nEDIT - Wanted to add, I make these posts a lot with different tickers, when I am most confident I make a whole thread for one ticker. Like I did in the past with MSFT/AAPL/TSLA/DIS, I am saying this because I have different levels of confidence the orders will work out. These orders today are aggressive but not super super aggressive. So the confidence level is lower than something extremely aggressive and unusual like SBUX order flow.", "id": "fh1wev", "created_utc": 1583951655.0, "score": 100, "upvote_ratio": 0.96, "num_comments": 40, "comments": [{"body": "Fcking nerd. But good DD", "score": 45, "replies": []}, {"body": "Ok what do I yolo on though", "score": 20, "replies": [{"body": "Everything. Yolo on everything", "score": 12, "replies": []}]}, {"body": "Use imgur please.", "score": 18, "replies": [{"body": "ok, sorry", "score": 14, "replies": []}]}, {"body": "Where are you scraping this data?", "score": 9, "replies": [{"body": "I def want to know too!", "score": 3, "replies": []}]}, {"body": "Bro you didn’t even talk about DIS 🙃", "score": 6, "replies": [{"body": "Did u see his post yesterday? It was legit all Disney.", "score": 3, "replies": [{"body": "I did not thanks I’ll look!", "score": 3, "replies": []}]}]}, {"body": "Thanks for sharing again and again!", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Big order means MM or someone has inside info. Now, a trade has 2 sides - a buyer & a seller. For example, you see an unusually large volume for MU $90C, it could be MU will spike up or spike down.\n\nUp - Someone bought a shit ton of calls in anticipation of MU going up\n\nDown - Someone selling those calls knowing MU will go down and the contracts will be worthless.", "score": 1, "replies": []}]}]}, {"body": "Amazing DD. You just gained a follower. Teach me da way of tendies.", "score": 4, "replies": [{"body": "Being patient helps. Wait for technical chart levels and fundamentals (if possible), then confirm it with option data. When their is extreme aggressiveness especially", "score": 5, "replies": [{"body": "what kind of option data? like put/call ratios? do you use barchart?", "score": 2, "replies": []}]}]}, {"body": "What is the reason people think BAC will keep free falling?", "score": 3, "replies": [{"body": "Probably because they just got back to pre-09 levels. But now it's back to that with a share float so high.\n\nLow interest environment means they don't make money.", "score": 3, "replies": []}, {"body": "69 Puts  3/20", "score": 3, "replies": [{"body": "42069 --- 69420", "score": 2, "replies": []}]}, {"body": "I don't think it will free fall but it seems the market is going to fall more based on the index technical chart levels as well as those orders.", "score": 3, "replies": []}, {"body": "They’re taking repo money from the feds and lending it out to other banks in other countries. If those other countries get hit hard by corona, they won’t be able to cover what they’ve borrowed and BAC will be fucked", "score": 1, "replies": [{"body": "Is this true ? I thought repo market was for American to American lending .. fuck", "score": 2, "replies": [{"body": "American government to American bank lending. Once the banks have it they’re free to invest in what they want", "score": 3, "replies": [{"body": "Ahhhhh I learned more here then 2 weeks of Wendy’s training", "score": 3, "replies": []}]}]}]}, {"body": "They have so many shares that it’s super easy for the stock to tank. That is why you see other banks near or over $100 a share because they have low float, BAC float is one of the biggest in the industry and why the stock can never make it to $40. So if the markets crash BAC is an easy win as the stock price will probably fall to around $15-$17soon.", "score": 1, "replies": []}, {"body": "I think it’s a combination of a few things..\n\n1) they may have over lended bull marketly and over extended (see repo market) \n2) they are heavily invested in oil companies (see headlines 2 days ago about 25% oil drop) \n3) Bank of America gay \n4) not certain how this works but if they were using oil investments as assets to lend against and those assets dropped in price their lending power may have been reduced with the loans already out - don’t quote me on this one tho because I’m not certain how this works \n\nI’d be super careful tho .. they may get trump pump or some kind of federal something .. there seems to be a lot of open interest", "score": 1, "replies": []}]}, {"body": "As long as there is no market sediment, these posts are always welcome", "score": 4, "replies": []}, {"body": "BAC will have some shit up, an extra 50 billion go ahead to trade on the market. After hours might crash less, banks might go up or stay on average. DIS is a good ticker to buy puts, T, well, not one of the best, still have some good news  to up the trend on them.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "They give bad advice, sorry but they do lots of times. The issue is the orders they give I don't find unusual or aggressive lots of times. They did pretty decent in 2019 but this 2020 for them has been bad so far. The often get on cnbc and announce things that don't fit my criteria for those. They have become more lazy about it. I follow this guy on twitter who tracks every trade they call out and sees if it makes money or looses money. It supports my claim about a horrible horrific 2020 for them.", "score": 7, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "> How We Trade Options Building Wealth, Creating Income, and Reducing Risk\n\nHoly shit, the reviews left for that on Amazon and what not are fucking abysmal", "score": 3, "replies": []}]}]}]}, {"body": "Looks like for T the CEO stepped down\n\nsauce:\nhttps://www.reuters.com/article/us-at-t-xandr-exclusive/exclusive-ceo-of-att-ad-unit-xandr-resigns-source-idUSKBN20Y2PM?feedType=RSS&feedName=technologyNews&utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+reuters%2FtechnologyNews+%28Reuters+Technology+News%29", "score": 2, "replies": [{"body": "This is only Xandr’s CEO, not T which is Randall Stephenson", "score": 2, "replies": []}]}, {"body": "Welp we'll see how these T puts end up. Looks like it hasn't been priced in on options yet. Good catch!", "score": 1, "replies": [{"body": "Jumped on T puts. Think it'll go down significant?", "score": 1, "replies": []}]}, {"body": "why would bac be even on a day like today", "score": 1, "replies": []}, {"body": "Image is too pixelated, I like your DD though", "score": 1, "replies": []}, {"body": "I wonder if this is speculation that their 5G progress is going to be limited due to Coronavirus implications. Might also affect Verizon.", "score": 1, "replies": []}, {"body": "I have leaps on T...", "score": 0, "replies": [{"body": "Bold strategy Cotton, let’s see how this plays out", "score": 1, "replies": []}]}]}
{"title": "Alright, crash is over. Time to buy", "selftext": "", "id": "fh5j0c", "created_utc": 1583965063.0, "score": 14, "upvote_ratio": 0.61, "num_comments": 47, "comments": [{"body": "File this under: Things I won’t be doing", "score": 138, "replies": []}, {"body": "10%?  \n\n\nMommy won't even put gains that pathetic on the fridge :(", "score": 73, "replies": [{"body": "Lol bro I was laughing when I saw that you only need 10% gains to get featured on MarketWatch. \n\nr/investments jizz their pants at the thought of anything over 5%, though.", "score": 31, "replies": [{"body": "5% a year*", "score": 19, "replies": [{"body": "Since joining this sub I went from being hopeless for retirement to now having hope. \n\nMy IRA is up 50% and most of my puts are still April to June. I'll make more over the next two months than investing 'normally' for decades.\n\nEven if aliens come and have a ray gun that changes a bear to a bull, I have learned so much - take profits, momentum trade, follow the autists. \n\nI am truly grateful, whatever happens. More grateful when I 3x my retirement.", "score": 18, "replies": [{"body": "Congrats man, it's always good to hear sucess stories", "score": 6, "replies": [{"body": "Thanks. I'll post after I 3x!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "10% get this gay bullshit out of my sight", "score": 41, "replies": []}, {"body": "“all heck was breaking loose” \n\n“I was struck by a mild sense of anxiety”", "score": 34, "replies": [{"body": "My flipping darn portfolio just cant handle this bull shark of a virus", "score": 20, "replies": [{"body": "Someone get on instabook and see what's goin' on.", "score": 9, "replies": []}, {"body": "Mother trucker I should have sold that gosh darn thingamajig when this all started percolating", "score": 5, "replies": []}]}, {"body": "Yeah, that's putting it mildly", "score": 1, "replies": []}]}, {"body": "wow r/investing gains over there", "score": 26, "replies": []}, {"body": "10% lmao\n\nYou can pick literally any 🌈🐻here and they'll have made way more than 10%.", "score": 15, "replies": [{"body": "704% and I feel like a weakling on this sub", "score": 12, "replies": [{"body": "150% here", "score": 2, "replies": [{"body": "600% and I feel like a right little bitch", "score": 3, "replies": []}]}]}]}, {"body": "Trump hasn't even announced national emergency", "score": 10, "replies": []}, {"body": "HEY, WAKE THE FUCK UP YOU RETARDS!\n\nYou can buy puts in just about anything, it wont matter, you'll make money. We are heading into a depression.\n\nThe virus isn't just killing fat old boomers. No one is recovering. It hides in your nervous system and reemerges again when your immune system lets up. It does this again and again, wearing you down and scarring your lungs each time. That's why people are being released only to die later after being \"reinfected\".\n\n\nWE ARE ALL FUCKED, do you understand? If you catch this virus you are absolutely fucked.\n\n\nWHO does not include \"recovered\" in their reports, poorly defined\nhttps://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports\n\nNew: \"Recovered\" drops dead, surge of reinfections\nhttp://archive.is/MF0fv\n\n28-Feb: Israeli \"recovered\" case tests positive again\nhttps://archive.is/TV8DS\n\n28-Feb: South Korea \"recovered\" case reinfected\nhttps://archive.is/Gv1iu\n\n27-Feb: Xuzhou first case reinfected weeks after \"recovery\"\nhttps://archive.is/CuOtr\n\n27-Feb: \"Recovered\" in Japan sick again: reinfected or dormant\nhttps://archive.is/HjykE\n\n26-Feb: 14% of \"recovered\" in Guangdong test positive again\nhttps://archive.is/V6IgT\n\n21-Feb: Patient reinfects himself after \"recovery\"\nhttps://archive.is/8Ppkx\n\n19-Feb: \"There is a likelihood of relapse\", expert says\nhttps://archive.is/ABjjf\n\n14-Feb: Reinfection possible and even deadlier\nhttps://archive.is/Iw58p\n\n31-Jan: Patients can get reinfected, no immunity after \"recovery\"\nhttps://archive.is/W9vNf\n\nVirus hides in neurons, indefinitely escapes recognition\nhttp://archive.is/6NGuH\n\nVirus invades nervous systems\nhttp://archive.is/qmc6U", "score": 18, "replies": [{"body": "Hell yeah.  Bring it the fuck on.\n\nI can either die a 40 year old degenerate alcoholic or a healthy 33 year old rich man.", "score": 18, "replies": [{"body": "I’m a 33 year old rich degenerate alcoholic it’s kinda tight.", "score": 10, "replies": [{"body": "🙌", "score": 2, "replies": []}]}]}, {"body": "With sources like these, I believe the dude who says that “his family member told him”", "score": 6, "replies": []}, {"body": "ok doomer", "score": 13, "replies": []}, {"body": "Fuck off with your conspiracy bullshit. Better read the AMA over at /r/Coronavirus from today. Has more info", "score": 9, "replies": [{"body": "I posted sources. This is not a conspiracy. This is common knowledge in the medical field and is being reported in reputable peer-reviewed journals like JAMA. Normies haven't caught on yet.", "score": 1, "replies": [{"body": "You post single-case observations and generalize from there. This is exactly what believers in conspiracy theories do. Take a small fact and blow it out of proportion. This is not how science works.", "score": 2, "replies": [{"body": "It is the best available evidence.", "score": 1, "replies": []}]}]}]}, {"body": "Tell my spy puts that they should be green.", "score": 2, "replies": []}, {"body": "Holy shit sir", "score": 1, "replies": []}, {"body": "Puts it is", "score": 0, "replies": []}, {"body": "Yes, more pls", "score": 0, "replies": []}]}, {"body": "I love me a gay bear or three but stop fear mongering. That’s unattractive. This is not the zombie apocalypse. Yet.", "score": 3, "replies": []}, {"body": "Meanwhile his returns from shorting SPY from last year is -20%.", "score": 3, "replies": []}, {"body": "Huh.. This did not date well at all. We've still got ways to go before we hit bottom.", "score": 3, "replies": []}, {"body": "It's only time to buy if SP500 and NASDAQ also falls into bear market", "score": 2, "replies": []}, {"body": "Shut the fuck up.", "score": 2, "replies": []}, {"body": "How's the crash over? We haven't even climaxed yet", "score": 2, "replies": []}, {"body": "BAN", "score": 2, "replies": []}, {"body": "Talk to my 300 percent", "score": 1, "replies": []}, {"body": "Futures down, Nikkei down, we're going to have a red Thursday if things don't change, Nikkei is at 1.7% red, Trump needs a good pump this time.", "score": 1, "replies": []}, {"body": "Paaaaahhhhhhhhhhhhhh", "score": 1, "replies": []}, {"body": "just a dem hoax people, time to buy", "score": 0, "replies": []}]}
