{"title": "r/Stocks Daily Discussion Wednesday - Mar 04, 2020", "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&t=all&restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.", "id": "fd9w98", "created_utc": 1583309248.0, "score": 8, "upvote_ratio": 1.0, "num_comments": 44, "comments": [{"body": "My guess is for an up day.\n\nWall Street Cowboys and small speculators will view Super Tuesday as some repudiation of communism and there haven't been any sensational covid stories overnight.  They'll want to take a ride on the Fed's insane \"emergency\" rate cut.", "score": 8, "replies": [{"body": "Looks like an epic fight on the edge of despair for bull folk. When will the next earnings season start? April? I can‘t stand  the pressure watching my puts not going anywhere 😂", "score": 4, "replies": []}, {"body": "Coronavirus news has been mitigated the last couple days for some reason. Shit is going south very quick and maybe yesterdays interest drop is a hint for today's blowout in the news. I have plays on NOVN and IBIO, I think with IBIOs ties to the chinese govt and considering everything happening. They're going to want companys to act fast using whatever resources to deny the virus anymore affect on the market", "score": 2, "replies": [{"body": "Not sure I follow this.  Are you saying the public health problem is much worse, and that facts are being kept hidden but will come out today?", "score": 5, "replies": [{"body": "I dont know today but yes I think the public health problem is MUCH worse than what we are being told. And it will only be getting worse if all we are doing is containment and not curing. Monday and tuesday showed very minimal news regarding the virus and serious/critical cases as well as deaths can only be hidden for so long. Interest cut is a sign were about to see some real shit happen soon", "score": 4, "replies": [{"body": "Premarket is looking really good right now but it just gives me discount SPY puts", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": []}, {"body": "Just put whatever amount you feel comfortable and add over time. There is no such thing as too little.", "score": 3, "replies": []}, {"body": "Thats 100% enough money to start. ETFs are likely down a bit right now too so a good time to buy. \n\nI bought dividends funds with my first 2 grand (one of many options for funds) and that fund actually buys more units for me without me putting any more money into it. Like I said just one option. You can also focus on growth. Regardless get that money invested.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I’m trickling money in during this current volatility.  Maybe put half in now, see how you feel about It and track the market with an eye towards another purchase in a few weeks.\n\nEither way the key is buy and hold", "score": 2, "replies": []}]}]}]}, {"body": "wouldn't touch the markets with a 10 foot pole- gonna let this coronavirus tank the economy for a few weeks. Then buy.", "score": 4, "replies": [{"body": "Worst case scenario it could extend beyond a few weeks, not saying it will but who knows?  Very worst case, the virus could mutate and rev back up in October as often viruses do.  By then they'll be approaching public vaccinations I assume though.", "score": 1, "replies": [{"body": "Very worst case is 183 million deaths or more based on current numbers, and a drop in industry/transpo so severe that the global average temperature increases by 0.5-1 celsius *within weeks/months* due to loss of aerosol masking effect. Being that we're already at 1.2 over 1800's baseline, this would push us well over 1.5 - you're seriously underestimating here.", "score": 2, "replies": [{"body": "Wait if 200 million people died wouldn’t that be good for environment/climate change what am I missing here?", "score": 1, "replies": [{"body": "loss of aerosol masking effect", "score": 1, "replies": [{"body": "TIL about Global dimming", "score": 1, "replies": [{"body": "You're not supposed to think or know about global dimming. You're not in the minority, you're in the overwhelming majority who don't know what dimming is. Course, world leaders are aware of it, they get cream of the crop intel. We just aren't supposed to think or talk about it. Cause what it equates to is there's no way out of our climate predicament, and with regards to situations like this, that things can get much worse, much faster than people understand (cause they don't know about dimming).\n\nGlobal dimming is actually... quite the red pill if you're honest about it. Why have you never heard about it? Why has barely anyone else? See how many of your friends/family/coworkers know what it is.", "score": 1, "replies": [{"body": "Yeah a very damned if you do and damned if you don’t situation. From very limited reading it seems there are solutions just not the technology to use them in a way that doesn’t cause more harm then good yet.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I’d consider NVAX as they are currently testing coronavirus cures on animals and are moving onto actual patients in May or June (they hope)", "score": 1, "replies": []}, {"body": "or buy GLD", "score": 1, "replies": [{"body": "You mean GILD ?", "score": 1, "replies": []}]}]}, {"body": "Bought IBIO at 2.20, why not buy into the hype?", "score": 2, "replies": [{"body": "Buy that hype!", "score": 1, "replies": []}, {"body": "The hype was last week, now people are just hoping.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Axp moving up, still a bargain in my opinion", "score": 2, "replies": []}]}, {"body": "Which is the better buy? GOOGL or NVDA?", "score": 1, "replies": [{"body": "Nvda", "score": 1, "replies": [{"body": "Why so?", "score": 1, "replies": []}]}, {"body": "For long term? Google/Alphabet", "score": 1, "replies": [{"body": "thx. upvoted!", "score": 1, "replies": []}]}]}, {"body": "Looks like United Airlines is reducing their flight schedule in April, certainly seems like it will impact their stock as they will more than likely see a reduction is earnings for the quarter and year.", "score": 1, "replies": [{"body": "Southwest Airlines looking like they will miss earnings also according to news today.", "score": 1, "replies": []}]}, {"body": "Hk confirms a dog was tested pos for cov19. Things just got interesting.", "score": 1, "replies": [{"body": "Eh, just means that your dog has to wash their paws whenever they get home and cover their mouth when they cough", "score": 1, "replies": []}]}, {"body": "Campbell Soup is up 13% over the past week. I didnt even think about investing in companies that sell food with long shelf lives", "score": 1, "replies": []}, {"body": "Help me understand activist investment groups... how do they have so much power when they only own 1.5% of a company? Are they generally right about their opinions or are they only concerned about short term gains?", "score": 1, "replies": []}, {"body": "Going to pick up some Spirit Airlines when the market opens up. It’s had the biggest drop off of all the airlines iirc. Does anyone have any other airline recommendations or alternatives?\n\nAlso what do you guys think about CCL? I looking to pick some up as well.", "score": 1, "replies": [{"body": "Have you EVER flown spirit airlines?", "score": 6, "replies": [{"body": "No lmao, but there are plenty of stocks I have that I don’t use or purchase. I’m just looking for money making opportunities.", "score": 1, "replies": [{"body": "This is the worst run airline by far.", "score": 2, "replies": []}]}]}, {"body": "Wait until this blows over? Lol", "score": 1, "replies": []}, {"body": "Dude f spirit......trash, hope it never recovers", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "fdalxn", "created_utc": 1583314243.0, "score": 8, "upvote_ratio": 0.68, "num_comments": 41, "comments": [{"body": "These penny stocks are risky af tho", "score": 4, "replies": [{"body": "Of course they are. Pretty much everything is risky right now, including gold. But if you are willing to play a fraction of the available funds there is also a chance they pop again hard.", "score": 0, "replies": [{"body": "Yea true. As a short term spec play, not bad", "score": 3, "replies": []}]}]}, {"body": "The government can be the first buyer of any mask if they want. \n\nProduction is ramping up.", "score": 2, "replies": [{"body": "That's right. The point is demand is high and don't support scalpers.", "score": 1, "replies": [{"body": "I am ok with scalpers. I think they provide a service to those who will pay to reduce their fear. There are two sides to that transaction. A willing buyer and a willing seller agreeing on a price.", "score": -1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Why?", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Read an earlier comment in this subreddit about the generator and tell me what you would do?", "score": 1, "replies": []}, {"body": "Dont be lazy and think a bit.  Wasnt that hard.  Ive made quite a bit off the masks", "score": 1, "replies": []}]}]}]}, {"body": "In my opinion that is incredibly stupid considering the current situation", "score": 1, "replies": [{"body": "In my opinion, you can’t tell people what to do with money. I understand your suggestion. \n\nToday I won’t pay the price they are asking. Tomorrow, who knows. \n\nLet’s say you have a generator that you paid $1000 for 3 years ago. You used it a few times when the power goes out. Life wasn’t comfortable when you used it because it wouldn’t power everything that you want at the same time and it was noisy and consumed a lot of gas. \n\nSo the power goes out again and your parents offer to let you and your family stay at their house. It’s only an hour drive. Your whole family loves your parents so you pack to go there. \n\nYou are checking your mail and you see your neighbor. He asks if you know where to buy a generator because they are sold out. You tell him you don’t know and you are headed to your parents. Oh, and you can use my generator. \n\nHe is not comfortable with that so he offers to buy it at the price you paid so you can buy a new one when they are available. \n\nWhat would you do?", "score": 2, "replies": [{"body": "If hospitals cannot handle the volume, you may be in trouble whether you have masks or not. People can do with their money whatever they want, it's true. But that says nothing about how smart they are.", "score": 2, "replies": [{"body": "That is what happened in Wuhan. They had a huge surge and couldn’t handle the load resulting in a higher percentage death rate. I imagine it was horrible. \n\nI trade stocks and options. I have no idea why people would sell me a stock that I’m convinced will go up. DIS would be an example. It will go back up. Who would sell at this point? Who knows? \n\nI’m having a hard time understanding this market gyrations. Good luck trading.", "score": 2, "replies": [{"body": "Exactly!", "score": 2, "replies": []}]}]}, {"body": "I agree with the other comment and to answer your question, I hoarded some non-professional masks (cheap ones that are washable) and protective glasses, also very cheap and non-medical supply type. The key is to have enough to change and wash them often. The goggles just need to be rinsed with water and soap and they are fine.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I found $APT when it hit $10. My robinhood application was still being reviewed so I couldn’t do anything. \n\nI monitored it pretty well, and when it hit $40 I was jumping up and down. If only I would have placed a call option and sold that option at $40 - i would have been a very happy man. \n\nGood learning experience - but I agree, APT is a good one to look at and at the very least, keep an eye on.", "score": 1, "replies": []}, {"body": "Consider buying alpha pro tech? A small mask making company with a PE of greater than amazon? The same stock that goes parabolic every time there’s an infectious outbreak and then without fail reverts to its true value of $3-4 per share? The one that’s already peaked at $35 and then had multiple days of losing >10%? That one?", "score": 1, "replies": [{"body": "Are you buying anything else?", "score": 1, "replies": [{"body": "Yeah DCA like always. Definitely not buying a hyped mask maker that’s currently priced as a high growth tech company.", "score": 1, "replies": [{"body": "DCA?", "score": 1, "replies": [{"body": "Dollar cost averaging. You’ve done a good job of researching to find APT but in my opinion, the point isn’t to buy overvalued assets. It’s to short them or not touch them. You could make short term cash off of the volatility right now because it’s insane with this stock, but it’s extremely risky. My advice? August puts.", "score": 1, "replies": [{"body": "I sold anything \"global markets\" more than 2 weeks ago, securing all my profits. Not time to start going back imho. I've been playing \"coronavirus\" stocks after that with part of my profits and overall I'm in the green >300% (in my coronavirus plays, even more on the longs I had). I've traded APT from 10(bought) to 29(sold) and bought again at 17 and 21. It is a risk of course but I think it will bounce for reasons I have previously explained.", "score": 1, "replies": [{"body": "Insiders are currently unloading shares", "score": 1, "replies": [{"body": "Exercising options with massive profits. I would have done exactly the same. That's why options are for in companies.", "score": 1, "replies": [{"body": "Also tells you where there head is at. Probably something like this:\n\nCEO: holy shit bro, these retards bid us up to ATHs in like a week!\n\nCFO: wow, what goons. Gotta exercise everything and dump our shares before they realize this is only a temporary demand boost and has done nothing to change our fundamentals\n\nCEO: let’s get some fuckin tendies", "score": 1, "replies": [{"body": "Nice DD. Good stuff. LOL. Sure, that's how it works, at wsb", "score": 1, "replies": []}, {"body": "I challenge you to short it :)", "score": 1, "replies": [{"body": "I caught a couple outs while the shares were $35, recognizing the massive autism going on in the market. I’m doing pretty damn well. Even yesterday when it was up 8% my puts lost 1% of their value because the Greeks are agreeing with me. That stock is going to be a dumpster fire, this time is no different.", "score": 1, "replies": [{"body": "At 35$, yeah it makes sense. At this level? Not right now imho.  But yeah, puts are perhaps a better idea if you are bearish.", "score": 1, "replies": []}, {"body": "Also, imho, the \"recovering\" global markets is the strongest sign of autism rn. There are people buying airlines as we speak ffs.", "score": 1, "replies": [{"body": "Airlines will rebound when the virus is contained, mask makers will do the opposite", "score": 1, "replies": [{"body": "Yeah, pretty much?", "score": 1, "replies": [{"body": "So why would buying APT be worthwhile? You’re buying something that’s like 4x as expensive as it was pre outbreak, whereas with airlines, you’re buying at like 20% off essentially. Yeah, short run, might not be the best move, but if they both revert to their mean once the waters have settled, you’d be fucked if you bought APT, and green if you bought airlines.", "score": 1, "replies": [{"body": "Well I don't see APT necessarily as a very long term investment. It is circumstantial and there is a risk obviously. Airlines I wouldn't touch right now, pps may be down, but their business hasn't seen anywhere near the full effect of the situation yet. For airlines in particular I'll start considering at 40-50% or so, depending on the balance sheet. There are a couple that might not even survive this. Too early, the amounts I play with APT are substantially lower than what I will use to buy the recovery, and for that I'd rather miss the bottom by 10% (and buy on the way up if I think it is a real recovery) than speculate too much.", "score": 1, "replies": [{"body": " \n\n# APT - Alpha Pro Tech, Ltd.\n\n$8.85\n\n\\-2.83 \n\n(-24.23%)", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Also about shorting APT, I wouldn't with 8M float all it takes is one announcement to trap oneself. Probably not for very long but it could cost a lot.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What companies are the facemask/respirator material suppliers  of 3M,HONEYWELL,APT.etc in USA?  I googled but nothing found.", "score": 0, "replies": [{"body": "I think there is a list in the CDC website, I would avoid those that don't produce the masks domestically (US).", "score": 1, "replies": [{"body": "The shortage of mask filtration material in USA would happening soon.\n\nThe facemask/respirator material supplier stocks have performed the best in China.\n\nThe meltblown nonwovens is essential to N95 and surgical mask. It limits the productivity in USA.\n\nI prefer to invest in material stock. Would you be interested?", "score": 1, "replies": [{"body": "Yep. Shoot, i'm listening ;)", "score": 1, "replies": []}]}]}, {"body": "Also let me know if you find anything else interesting :)", "score": 1, "replies": []}]}]}
{"title": "Tesla Insurance Will Dominate & Transform The Insurance Industry", "selftext": "", "id": "fdisqq", "created_utc": 1583352262.0, "score": 129, "upvote_ratio": 0.93, "num_comments": 48, "comments": [{"body": "Asking the real question: \"Is it weird to visit a swingers club with your family?\" @ 7:00 mark. 🤭", "score": 16, "replies": [{"body": "Haha, well spotted. I love trolling with easter eggs.", "score": 10, "replies": [{"body": "Wait, is there one or more in each of your videos?", "score": 3, "replies": [{"body": "If you know where to look, there's plenty to find.", "score": 4, "replies": []}]}]}, {"body": "I accidentally ran into my brother at one of those.  It was a bit awkward. We've never spoken of it.", "score": 7, "replies": [{"body": "So, is it customary to bring your SO in joining these and if so, who were you and your brother with? In other words, tell us more!", "score": 2, "replies": []}]}]}, {"body": "Will this make them billions?", "score": 15, "replies": [{"body": "😂", "score": 9, "replies": []}, {"body": "Customers, Tesla and TSLA investors will make billions from that.", "score": 1, "replies": []}]}, {"body": "Hey guys, this video focuses on Tesla insurance, its potential financial impact to Tesla's business, how ongoing safety improvements tie in and of course, the unique data advantage Tesla has (in-car telemetry) which if utilized, will lead to better risk pricing than anyone else can offer by a long shot. \n\nBetter data = better premiums = total domination.", "score": 23, "replies": [{"body": "If other companies don't have that data and have to charge more for premiums then they make more money, don't they?\n\nOther companies have raised rates over the years because it's been costing them an arm and a leg when someone totals a Tesla.", "score": 6, "replies": [{"body": "Tesla has 2 huge advantages:\n\n- they manufacture parts and don't have to pay premium for them as normal insurers have to\n- they develop default on Emergency Breaking System which is in fact AutoPilot working in shadow mode - it will improve with time and dramatically lower accident rate", "score": 7, "replies": []}, {"body": "If no other company can insure a Tesla as cheap as Tesla themselves, they will get almost NO business. It doesn't matter if their premiums/profits are higher when insuring a Tesla if they're insuring 0.00001% of the fleet.", "score": 11, "replies": []}, {"body": "It's about market share and not profits. If he can make it cheaper and better without compromise then he will start taking out the insurance companies. At least when using a tesla.", "score": 2, "replies": []}, {"body": "Was just thinking the same thing. The premise of the video doesn’t make sense. For all the data tesla has, they will still have the same drivers, some careful and some not, and therefore the average doesn’t change. The data is only helpful to the people who drive safely. The rest would technically see their insurance rates rise higher than other companies. \n\nMy insurance company has no data on me. They don’t have an electronic device in my car. But if I happen to get in an accident, the rates rise. They don’t need to predict if I’ll get in an accident, they get it back after the fact. I feel like this video creates an alternate reality where an insurance company has to be able to predict the future of each driver to make any money. \n\nBut if Tesla charges less for its own insurance, other insurance companies will follow. Don’t need to access the cars CPU to know that.", "score": 1, "replies": []}]}, {"body": "And that matters", "score": 4, "replies": [{"body": ":)", "score": 3, "replies": []}]}, {"body": "I read this in your voice. XD", "score": 2, "replies": [{"body": "😂 This matt-uh...yeah, I'll stop encouraging..", "score": 3, "replies": []}]}]}, {"body": "First of all - I want to say that I love these videos and am a fan of the work you’re doing. Keep up the great work!  One thing I do want to point out is on the section talking about Tesla holding float as an insurance company— I don’t think that’s accurate. Tesla Insurance acts more like a broker of a white-labeled insurance product, and the real insurer is Tesla’s partner, Liberty Mutual, which would hold the float and ultimately be liable for making any insureds whole in the event of a claim. So I think Tesla gets some commission revenue as a broker for bringing the customer to the table, and Liberty Mutual does the heavy lifting of the actual insuring behind the scenes. This arrangement is probably better; insurance is heavily regulated industry and would be difficult for Tesla to comply with all the statutory capital regulations that come with being an insurance company. Better to be a broker to keep things simple for now while also getting the benefit of offering cheaper insurance to customers so that it’s an easier proposition in terms of the prospective monthly cost of ownership for new buyers.", "score": 5, "replies": [{"body": "Yes. 🙂 I edit tight and a lot ends up on the cutting room floor including this. You are right, today it's a non-factor and I agree on your points. My view is that long term, Tesla will vertically integrate insurance  instead of using white label.  At scale, it's another way to drive down costs, thus accelerating Tesla's mission further.", "score": 5, "replies": []}]}, {"body": "Once again I begin watching with the all-important question floating in my mind: *what matters*?", "score": 9, "replies": [{"body": "THIS!", "score": 9, "replies": []}]}, {"body": "I find it absolutely insane that the safest car in the world has the highest insurance cost.", "score": 6, "replies": [{"body": "Super expensive to repair or replace.  Aluminum, Batteries, Tech all over.  Much different than sheet metal, ice, and low tech.", "score": 6, "replies": [{"body": "It might be double the cost to repair. But the chance of crashing is like 1/6 that of a normal car.", "score": 2, "replies": [{"body": "Which is why we need Tesla to start their insurance business in earnest so realistic premiums are possible.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "The hardware is already there, just not enabled. I alluded to this in the video. I'm sure Tesla will offer customers the option of opting in to use internal camera in return for lower premium.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It seems to me that they've intentionally side-lined driver monitoring in order to fast-track full autonomy.  I'm not sure which is the correct option, but it would be nigh pointless to add driver monitoring at this point, when the fleet to date doesn't have the required hardware, and FSD is on our doorstep (right? RIIIIGHT?).\n\nAll in TSLA, and have watch both of those fantastic interviews.  I'll link here for other curious minds.\n\nElon Musk 1 - https://www.youtube.com/watch?v=dEv99vxKjVI\n\nElon Musk 2 - https://www.youtube.com/watch?v=smK9dgdTl40\n\nGeorge Hotz - https://www.youtube.com/watch?v=iwcYp-XT7UI\n\nAll are great!", "score": 2, "replies": []}]}]}, {"body": "The problem is how do you monitor driver behavior when wearing sunglasses?  In many cases it's absolutely necessary to wear them to drive safely.  How on earth do you account for that?", "score": 2, "replies": []}, {"body": "There is no need to do that.\n\nInsurance premium should be calculated on % usage of AutoPilot. More usage the lower cost.", "score": 1, "replies": []}]}, {"body": "Good video, but your example of $2000 pa to insure a Tesla with Tesla insurance is way too high. That's not a competitive price compared to current insurers.", "score": 2, "replies": [{"body": "I've stopped watching his videos mostly because the numbers are inflated to silly levels, taking out a lot of the meaning.", "score": 2, "replies": []}, {"body": "Cheers. When I say \"back of the napkin\", I'm not forecasting what price Tesla insurance is. I'm putting some simple starting points in people's minds to work with :)", "score": 1, "replies": []}]}, {"body": "What do you think about going long on Tesla calls? 1+ years? Current shareholder and subscriber!", "score": 2, "replies": [{"body": "I don't think about going long on Tesla calls.\n\n&#x200B;\n\nBeing long Tesla works fine. I'm a simple man.", "score": 5, "replies": []}]}, {"body": "How much do you guys usually pay in insurance premiums? I'm not an owner but am looking at getting a M3 in a year or so", "score": 2, "replies": []}, {"body": "I can easily see that Tesla insurance could be the cheapest way to insure a Tesla, since they have per-driver data and access to parts at manufacturers cost.\n\nBut what advantages do they have over other companies in insuring non-Teslas?", "score": 2, "replies": [{"body": "Why would they insure non-Tesla vehicles?", "score": 1, "replies": [{"body": "That's my point. Read the thread title. I'm skeptical of its claim.", "score": 1, "replies": []}]}]}, {"body": "I’m not so sure Tesla will use the data to spy on individuals. I rather think Tesla is going towards making every individual the safest driver there is, and therefor lowering the insurance price on the whole pool of cars.", "score": 3, "replies": [{"body": "Who said anything about spying?", "score": 5, "replies": []}, {"body": "Using fleet wide data without singling out people is no where near spying... They would almost definitely make it an opt in option for individuals to lower their rates as most other insurance companies have started doing. Like he said in the video, if you want, they send you a device that plugs into your car that monitors your driving habits in exchange for a typically lower premium. It’s getting to be a very popular option", "score": 1, "replies": []}]}, {"body": "Yup jackpot", "score": 1, "replies": []}, {"body": "THIS MATTERS", "score": 1, "replies": []}, {"body": "Was really bummed when I ordered a M3 for CT and found out Tesla Insurance is only available in CA :/\n\nE - downvoted for a comment as innocuous as this? Never change, Reddit", "score": 0, "replies": [{"body": "In time, in time.", "score": 2, "replies": []}]}]}
{"title": "When will DIS start closing its parks?", "selftext": "Apologies in advance if Park isn't the right word for whatever you call it that kids go to to have fun. Anyways, I see DIS has already crashed a bit in terms of share price and I will buying some shares today(a share is one of the many equal parts a company's capital is divided in).\n\nMy question is, when does Disney announce a nationwide closure of its parks? Is that a possibility or am I expecting too much?\n\nSorry I'm not an options player. Please don't abuse.", "id": "fdan7a", "created_utc": 1583314474.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 46, "comments": [{"body": "They will produce Disney full body costumes that visitors have to buy and wear the whole time in the park to halt possible infection. Selling costumes = more revenue! They might even have gay bear costumes!", "score": 55, "replies": [{"body": ">Looking to add to your Disney character hazmat collection? Check out our latest Disney Princess arrivals! Pair with your magic band so you can get the latest information about park bear flu outbreaks.\n\nMouse is immortal\n\nWHARTON MBA LVL EDIT: This is why Parkman is new CEO. PRICED IN BABY.", "score": 8, "replies": [{"body": "This guy gets it", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Short sentence and yet you managed to get in: put, down and gay bear. You truly must be a big gay bear!", "score": 1, "replies": []}]}, {"body": "Soon we will see everyone at the park in the Monsters Inc CDA costumes", "score": 3, "replies": []}, {"body": "So capitalizing on the furry market", "score": 2, "replies": []}, {"body": "Who knows maybe they will contract $apt since they already make hazmat suits", "score": 1, "replies": []}, {"body": "Ill take a rainbow gay bear, 1 DIS FD, and a lightsaber themed dildo.", "score": 1, "replies": []}]}, {"body": "Not sure if trolling or not, but I'll be nice and answer the question....\n\nDIS has already closed all of their Asian park operations. That's a big deal. \n\nThey have not announced any sort of similar actions here in the US, but if the coronavirus continues spreading, it is a possibility.", "score": 16, "replies": [{"body": "I bet we’ll see one of their low paid employees show up with it.", "score": 3, "replies": []}, {"body": "I'm not trolling. I could have Googled it. But thought I'd post here. I didn't know they have shut down Asian operations.", "score": -8, "replies": [{"body": "Taking your family to a park?  Hit up Typhoon Lagoon, I hear the chlorine kills corona.", "score": 3, "replies": [{"body": "Blizzard Beach do the big slidddddde", "score": 3, "replies": []}]}]}]}, {"body": ">I will buying some shares today\n\n&#x200B;\n\n>when does Disney announce a nationwide closure of its parks? Is that a possibility or am I expecting too much?\n\nHol' up", "score": 30, "replies": [{"body": "Ye a bit of dumb fuckery going on here.  Why anyone would trade DIS right now is beyond me.  Nobody's going to the parks, nobody's going to the movies, and nobody's making those movies.  Seems kinda like the perfect storm to be a 🌈🐻", "score": 1, "replies": []}]}, {"body": "9.3.2020 11:12 EST", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes exactly, today is the 10th of March.", "score": 3, "replies": []}]}]}, {"body": "yeah as soon as florida and california get slammed by the kungflu then theyll shut parks down", "score": 7, "replies": [{"body": "florida already has cases around Disney though.", "score": 1, "replies": []}, {"body": "What you mean?", "score": -4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "He changed his post by editing it. Was something else before", "score": -3, "replies": []}]}, {"body": "They had a cornoavirus patient close to Florida's Disney. It's only a matter of time.", "score": 2, "replies": []}, {"body": "I'm getting thumbs down because the poster above me made a stupid comment and when I asked what you mean he changed his post.", "score": 2, "replies": []}]}]}, {"body": "Waiting for this to happen so I can scoop up super cheap shares.", "score": 6, "replies": [{"body": "Exactly. Let me know too :)", "score": -1, "replies": []}]}, {"body": "Kids go to church to have fun.", "score": 3, "replies": [{"body": "happy birthday", "score": 1, "replies": []}]}, {"body": "I've played Nuka-Cola World extension to Fallout 4 so I have first hand insight on how murican entertainment parks operate - they won't shut down. They will continue to operate and perform research and experiments on visitors while actually getting paid for it. In the end DIS will develop vaccine for coronavirus and make shitload of cash.  \n\n Buy DIS calls while they're cheap.", "score": 3, "replies": []}, {"body": "Did this dude just explain what a share is to us?", "score": 3, "replies": []}, {"body": "I will be going to disney easter weekend so that time latest. Load up on puts will be closed by then", "score": 2, "replies": []}, {"body": "The bottom line is people are still going. So odds are they won’t. I know someone that literally is there today and the parks are still packed. People are dumb", "score": 2, "replies": [{"body": "Or maybe they already paid and aren't getting any refund?\nThe govt could ban public gatherings like these any time which could force Disney to give refunds. Double wammy.", "score": 1, "replies": [{"body": "It’s totally possible. That’s just my opinion. If I was running disneyworld and the government was doing everything it could to downplay coronavirus then I certainly wouldn’t shut down and it wouldn’t be my fault. I could always point to the government and say I’m just acting based on what they’ve told me. \n\nUnless the government changes its approach to this virus then I don’t see it happening", "score": 3, "replies": []}, {"body": "Paris has banned 5000 plus gatherings and their disney park has remained open. Disney wont issue any refunds unless they close the parks, regardless of patron fears.", "score": 1, "replies": []}]}]}, {"body": "They have already shut down some of the Asian parks. So it would take a breakout like you see in China.", "score": 1, "replies": []}, {"body": "Whenever the US government decides it’s time to implement some sort of containment strategy.", "score": 1, "replies": []}, {"body": "Two weeks. Two weeks. Two weeks. Two weeks.", "score": 1, "replies": []}, {"body": "I’ve got 110 put 3/27 and so I’m hoping soon.", "score": 1, "replies": []}, {"body": "Thanks for explaining what a “share” is. I am sure you “bought” a “share”", "score": 1, "replies": []}, {"body": "The virus doesn’t like the warm weather. Disney gets busy when it’s warm. They won’t close", "score": 0, "replies": []}, {"body": "If you're a boomer, just buy and hold it for 10 years. That's the obvious, smart long term move. But around here everybody wants fast money. So this ain't it", "score": -1, "replies": []}, {"body": "why would a theme park shut down over a flu?", "score": -8, "replies": [{"body": "over here, boys. line your dumb questions up here, please.", "score": 11, "replies": [{"body": "Wouldn't washing your hands after taking a shit just push the shit through your skin and into your blood?", "score": 5, "replies": []}]}]}]}
{"title": "Technical update - reverse batman on a fractal basis", "selftext": "Haven't done an update in a while. Too busy making money from the volatility over the past two weeks.\n\n[https://imgur.com/a/UXddSrm](https://imgur.com/a/UXddSrm)\n\nThe reverse batman signal perfectly timed the double bottom on the 28th.\n\n[https://imgur.com/a/sPygT4h](https://imgur.com/a/sPygT4h)\n\nHere, we are seeing another reverse batman signal on the hourly chart. The next move is expected to be explosive upward to the tune of 6-8% up in the next 2-3 days.\n\n&#x200B;\n\n**Update: for those questioning my track record, see profit porn from riding VIX/puts on the way down and calls on the way up**\n\n[https://imgur.com/a/WuhU36O](https://imgur.com/a/WuhU36O)", "id": "fderjg", "created_utc": 1583336445.0, "score": 61, "upvote_ratio": 0.83, "num_comments": 39, "comments": [{"body": "[deleted]", "score": 48, "replies": [{"body": "You forgot - the dark knight rises. Even when he’s upside down", "score": 8, "replies": []}]}, {"body": "Batman, save me gotham puts.", "score": 17, "replies": []}, {"body": "Imagine thinking technicals matter in this market...\n\n*or at all*", "score": 9, "replies": []}, {"body": "This is the same dude that just posted the thread on how L-Cov isn’t as deadly and how the U.S. isn’t about to be a shitshow. \n\nHoly hell, his call bags must be heavy as fuck.", "score": 26, "replies": [{"body": "nope, i already made 150k on the way down, and made about 50k on the way up. Still have 50k in calls", "score": -8, "replies": [{"body": "p r o o f  o r  b a n", "score": 7, "replies": [{"body": "I put it up there", "score": 5, "replies": [{"body": "What are your moves for today?", "score": 5, "replies": [{"body": "From the looks of his moves, probably fucking a trophy wife and drinking a bottle of scotch worth more than my yearly salary.", "score": 1, "replies": []}]}]}]}, {"body": "Do you not think more bad beer flu news will bring back downward momentum?", "score": 1, "replies": [{"body": "Honestly no. It's a bad a cold. I don't think any more news of it is going to cause a downturn. The fatality rate still only like 3% after months of this. And you'e either out of work for a week, or dead. I think people on here just kept focusing on how contagious it was, as opposed to how impactful it actually is. Yeah certain industries are taking a hit in their earnings, but this ridiculously emotionally fueled. \n\nNow people are speculating on the overall impact it's goin to have on future earnings. I think news of stable investments going down will cause a quick downturn cause everyone is on edge, ready to pull their shit, but with the efforts of all the countries throwing stimulus like I throw nickels at toothless strippers, investors aren't goin anywhere just yet.", "score": 2, "replies": []}]}, {"body": "Thanks for the post 🤙🏼", "score": 1, "replies": []}]}]}, {"body": "Is this Australia Batman? Long $ASX", "score": 3, "replies": []}, {"body": "so puts on vxx??", "score": 3, "replies": [{"body": "no, hedge ATM calls with some OTM VIX calls. I am short term bullish (2-3 days), medium term bearish (1-3 months) and long term bullish (6month-5 years)", "score": 11, "replies": [{"body": "whats that term \"years\"? never heard of it", "score": 7, "replies": []}, {"body": "automated teller machine calls??", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "i don't think the virus outlook is improving, i think this is a technical bounce from being classically oversold. I still think there is another 10-15% downside from here and I'll buy back in with all my cash. I was longer term bearish with the virus because i thought real mortality rate would be 5%+ and that would be apocalyptic. I now think its somewhere around 0.5-1%. So i turned longer term bullish.", "score": 7, "replies": [{"body": "New numbers are showing 3.4%.\n\nAny thoughts?", "score": 3, "replies": [{"body": "i think there is a large amount of people who had it who just thought it was a cold", "score": 1, "replies": []}]}, {"body": "Thanks for all the great advice. Your calls have been on point.", "score": 2, "replies": []}]}]}]}]}, {"body": "explosive up or down ? A bear wanted to me ask🐻", "score": 5, "replies": [{"body": "How did you become \"the only straight bear\"?", "score": 4, "replies": [{"body": "I can’t tell you. But I can show you 😉", "score": 4, "replies": []}]}]}, {"body": "Brave man doing straight up VIX. Or just someone with access.\n\nI've been just selling 30% OTM puts for June on big names with high IV.", "score": 2, "replies": []}, {"body": "Everytime the batman shows up I make money. Let's go", "score": 2, "replies": []}, {"body": "Ban", "score": 2, "replies": []}, {"body": "Waiting for the spiderman kiss to show up before calls.", "score": 1, "replies": []}, {"body": "Your positions are from before Feb 28th though?", "score": 1, "replies": []}, {"body": "This group is fckin awesome", "score": 1, "replies": []}, {"body": "aren’t you casually ignoring the fact that the muthafawkin beerflu is abouta feast in the us", "score": 1, "replies": []}, {"body": "Too stupid to understand charts, just tell me what to do", "score": 1, "replies": []}, {"body": "I'm ready coach. Put me in the game.", "score": 1, "replies": []}, {"body": "Looks like batman's face got drawn today. How much more face needs to be drawn before we go to the shoulder ?", "score": 1, "replies": []}, {"body": "This is the DD I need", "score": 1, "replies": []}]}
{"title": "Why this time is different and VIX is here to stay", "selftext": "Historically, massive VIX spikes are not sustained. Usually there is a big event, a massive market fall out, and then volatility while the market tries to figure out the new equilibrium. Sometimes there is an actual economic downturn that can lead to a recession.  \n\nSo usually, long options in a high VIX environment is a sucker’s game because you lose that sweet premium even if you pick the right direction. And sure, there are some bumpy times along the road as companies announce how they are affected by the big event. \n\nBut past VIX spikes have followed single, relatively contained events. Lehman Brothers’ bankruptcy happened at one point in time. The market fall out lasted a long time, but all of the following events could theoretically be predicted by a smart enough person. \n\nThis is different. We have no idea whether coronavirus will be a minor hassle that resolves itself in the next few weeks, or an ongoing nightmare that just picks up momentum. Every day we get a new clue - more cases, less cases, trials, deaths, more countries, etc. The potential economic impact is constantly evolving and we don’t know how long that will last. \n\nI don’t think we can use past charts to predict what happens here. Nobody knows. But I don’t think long options are a bad play right now, despite their cost. I actually think that’s where the real money is. Get the options and wait for the fireworks. Or, if you’re in calls, the lack thereof. \n\nTl;dr: keep doing what you’re doing, retards.\n\nEdit: corrected the terminology", "id": "fdf4n2", "created_utc": 1583337915.0, "score": 84, "upvote_ratio": 0.92, "num_comments": 43, "comments": [{"body": "I've been pumping and dumping TVIX for weeks, jump on board fellas", "score": 57, "replies": [{"body": "By TVIX, do you mean my wife?", "score": 47, "replies": [{"body": "She said you were just roommates...", "score": 23, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "man, when i read shit like that it makes me cringe. Some poor fucking guy is somewhere really having that told to him by his wife.", "score": 0, "replies": [{"body": "he gets back at her by becoming a 🌈🧸", "score": 1, "replies": []}]}]}]}, {"body": "*thumbs up very nice!", "score": 4, "replies": []}]}]}, {"body": ">why this time is different\n\nThat's all the proof I need. Here are my life savings.", "score": 42, "replies": [{"body": "This but unironically", "score": 1, "replies": []}]}, {"body": "Will you people stop calling long puts/calls naked options", "score": 27, "replies": [{"body": "Probably not", "score": 5, "replies": []}, {"body": "I put in my orders with a T-shirt but nothing on below the waist. Naked options it is fam.", "score": 1, "replies": []}]}, {"body": "I bought UVXY when it was around 20. I should have bought more when it was around 13. I know it’s not a good idea to buy into volatility long-term but with so low volatility’s for market so high I’m ok to take that risk. You can buy call ITM call options on VIX but it can’t be for more than 30-45 days out b/c how VIX options are operate. I suggest going long UVXY to play volatility.", "score": 12, "replies": [{"body": "Aren’t you worried about the decay?", "score": 5, "replies": [{"body": "Nope, not right now. That’s for normal market conditions, when leveraged index exposure functions as it should.  This is not and will not be ”normal”. After the fact, analysts will look back and say that it “broke”. *Brokeback* maybe.", "score": 1, "replies": []}, {"body": "My average price is $20. Like I said, I wish I had bought more at $12-$13. I sold 60 shares of UVXY @ $52 this morning. I still have 100 shares left. I’m expecting much turmoil in the market, the decay is the risk I’m willing to take.", "score": 1, "replies": []}]}]}, {"body": "Ugh, price action is horrible, everyone here sounds horrible, market is probably going to slow bleed up and screw everybody with options", "score": 18, "replies": [{"body": "The market is not going up. What we have now is a long overdue correction and accounting for supply chain disruption. When Americans stop traveling and stop going outdoors except for the essentials, and when deaths begin to mount, we will enter a recession. Companies have cash right now compared to 2008, and banks are more robust, but no one is prepared for an absolute halt of most economic activity. I hope you realize this is not just possible but likely.\n\nhttps://www.cnbc.com/2020/03/04/los-angeles-area-officials-declare-local-emergency-confirm-new-coronavirus-cases.html\n\nThis is just the beginning.", "score": 5, "replies": [{"body": "You've just confirmed that the market is going up", "score": 10, "replies": []}]}]}, {"body": "\"keep doing what you're doing\"\n\nloosing money then..", "score": 24, "replies": [{"body": "*Losing", "score": 21, "replies": [{"body": "Losing cause his grip is loosing.  DIAMOND FUCKING HANDS.", "score": 8, "replies": []}]}, {"body": "Why don't the big guys say \"Do something different?\"", "score": 2, "replies": []}]}, {"body": "I’d pump and dump VIX if I had the 25k. Instead, I’m long on it. This Coronavirus stuff is absolutely not priced in, and it’s just going to get worse. The US is not equipped to handle a virus that sends 20% of people to the hospital and requires ICU admission for 6.1% of them. \n\nFrom a recent WHO report: 13.8% have severe disease (dyspnea, respiratory frequency ≥30/minute, blood oxygen saturation ≤93%, PaO2/FiO2 ratio <300, and/or lung infiltrates >50% of the lung field within 24-48 hours) and **6.1%** **are** **critical** (respiratory failure, septic shock, and/or multiple organ dysfunction/failure).\n\nIt’s likely to get so much worse for us, and I hope you’re all prepared.", "score": 22, "replies": [{"body": "I see science terms and numbers.. Son of a bitch Im in on VIX.", "score": 14, "replies": [{"body": "> I see science terms\n\nI see Plague, Inc. mutations.", "score": 1, "replies": []}]}]}, {"body": "\" keep doing what you’re doing \"\n\nJust waiting for your orders Captain Retard", "score": 6, "replies": [{"body": "4/3 SPY naked puts, from $295 to $310 depending on your risk tolerance", "score": 5, "replies": [{"body": "Try $210", "score": 6, "replies": [{"body": "Told you", "score": 1, "replies": [{"body": "Haha yeah i think both were good plays, my $7 $300s are up to like $75", "score": 1, "replies": []}]}]}]}]}, {"body": "I’m riding TVIX like your wife no matter if I see or red or green right now. Doesn’t matter. This is going to be totally illogical, totally breakout of the 2x correlation. After TVIX fully erupts tendies on your wife’s chest, people will be talking about how it was so irrational and ”this is not how it’s supposed to work.” Nope, it’s not. TVIX is supposed to constantly chase zero, but that’s not what’s about to play out.", "score": 3, "replies": []}, {"body": "market will further bleed as the affects of the paranoia and quarantines rape company earnings.", "score": 2, "replies": [{"body": "Exactly. And companies can only afford to pay their employees for so long when they no longer have the revenue to support them.", "score": 5, "replies": []}]}, {"body": "!RemindMe 1 month", "score": 2, "replies": [{"body": "I will be messaging you in 1 month on [**2020-04-04 20:11:48 UTC**](http://www.wolframalpha.com/input/?i=2020-04-04%2020:11:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fdf4n2/why_this_time_is_different_and_vix_is_here_to_stay/fjhplqs/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffdf4n2%2Fwhy_this_time_is_different_and_vix_is_here_to_stay%2Ffjhplqs%2F%5D%0A%0ARemindMe%21%202020-04-04%2020%3A11%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fdf4n2)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "penis penis penis penis penis (suck on this algos) penis penis penis", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "stop predicting, we are at uncharted territory. nobody knows.\n\nso what's the strike and date?", "score": 1, "replies": []}, {"body": "\"The market fall out lasted a long time, but all of the following events could theoretically be predicted by a smart enough person.\"\n\nSomeone give this guy gold....... he's \"smart enough.\"", "score": 1, "replies": [{"body": "I think you might be missing my point. I’m not saying I can predict the upcoming events. I’m saying it’s not possible. Whereas in previous economic downturns, it was theoretically possible for someone with enough information and the ability to synthesize.", "score": 2, "replies": []}]}, {"body": "Strike and date", "score": 1, "replies": [{"body": "FDs on spy you pick direction", "score": 3, "replies": []}]}]}
{"title": "Amd wins deal for nuclear weapons", "selftext": "https://www.google.com/amp/s/finance.yahoo.com/amphtml/news/hpe-amd-win-deal-u-180257486.html #THIS\n\non top of their exposé tomorrow. It's a six hour long show. Please for the love of GOD. Get AMD calls. Fuck Wells Fargo. AMD was my darling until Wells Fargo fucked them. Downgraded them for anyone unaware. Before that AMD was on a hawt streak. Back on track. ---- [my plays](http://imgur.com/a/dAacCBs) only ten because I d k... I'm feeling bitchy. Trying to build my confidence back up. I used to buy 80 calls of a single thing. Learned my lesson. Ow daddy, it hurts. \n\n\n#fuck it edit bought ten more calls http://imgur.com/a/NE0gHAg", "id": "fdj5u5", "created_utc": 1583353690.0, "score": 29, "upvote_ratio": 0.78, "num_comments": 48, "comments": [{"body": "Half of this Reddit has 58,60 calls on amd before Corona came to be.", "score": 49, "replies": [{"body": "60 4/17 for the win", "score": 11, "replies": [{"body": "3/20 $56 MAX TENDIES", "score": 6, "replies": [{"body": "3/20 $55 MAH BRASSA!", "score": 4, "replies": []}]}, {"body": "I'm with you!", "score": 3, "replies": []}]}, {"body": "3/20 $57.5. Bag holding for a while now.", "score": 3, "replies": []}, {"body": "60c 3/27 checking in", "score": 2, "replies": []}]}, {"body": "Still holding my gay ass 3/20 60$ calls from a few weeks ago", "score": 16, "replies": [{"body": "Bro I got plenty of 3/20 $65 calls don’t worry", "score": 6, "replies": []}, {"body": "You'll break even at worst", "score": 5, "replies": []}]}, {"body": "And to hit 70-80s by next month. If you're unaware check the news for amd it just got an upgrade so buy calls, also they have a huge day tomorrow that will catapult the stock get in now before you're too late", "score": 9, "replies": [{"body": "holding AMD 90c 5/15", "score": 7, "replies": [{"body": "I thought I was being cheap buying 7/17 80c", "score": 1, "replies": []}]}, {"body": "Ummm upgrade? I'm aware they were downgraded by Wells Fargo two weeks ago, what's this about an upgrade??? Please source it, my man", "score": 5, "replies": [{"body": "They got another upgrade and tmr is investor day for their nuclear computer shit they are building the most powerful computer in the world", "score": 5, "replies": [{"body": "Mother fucker I just bought ten more calls. I'm going for broke. Pinch me I'm dreaming. I'm in complete ecstasy Right now. I don't even give a fuck if I get a return. This feeling is worth a million dollars.", "score": 10, "replies": [{"body": "Lmao 😂", "score": 6, "replies": []}]}]}]}]}, {"body": "Fuck! Perfect timing as ever. Gotta get out of my puts I bought today.", "score": 9, "replies": [{"body": "I hope it dips so u can get out with a profit. A dip won't affect me. It'll rise again. We can all make tendeez in harmony.", "score": 3, "replies": [{"body": "Appreciate it. If I can get out with a -30% I'd take it. I bought it this morning when it hit over +4% didn't think it would keep mooning like it did. My contacts are already down over 20%. Pure stupidity for trying to play AMD.", "score": 3, "replies": [{"body": "I was close to getting puts on everything. I missed the boat that everything is going green. Bought AMD at like 3:45", "score": 1, "replies": [{"body": "Looks like you'll be making my money tomorrow.  At least it's going to a fellow  autist", "score": 2, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 8, "replies": [{"body": "It's not too late to get in. I am gonna sell at open, because I predict a good old Thursday dip", "score": 5, "replies": []}]}, {"body": "I had $50 3/13 calls that I bought at like 1.30 and got out at 1.80. Now they are like 2.30 and im kicking my ass.", "score": 6, "replies": [{"body": "I've learned... profit is profit", "score": 8, "replies": [{"body": "Good philosophy. Especially since im starting small and every gain counts", "score": 5, "replies": []}]}, {"body": "Man, I lost 30k because I was holding and didn't wanna take a profit. I swear on my life. I don't have any screenshots because it's embarrassing. It literally gave me ptsd. I called everyone I knew and told them I was up 30k... I waited till the next day to tell them I was an \"almost rich loser\"... They didn't get it... *Wait, what happened to the money?*.... In a nut shell, pigs get slaughtered. Edit: the reason I was holding is because I BELIEVED it would reach 50k profit.", "score": 6, "replies": []}]}, {"body": "I have all of this. 3/13, 3/20, 3/27. And then a $42c that I bought at the bottom of the dip with an expiration of 4/3. I might just use that bottom one to buy the 100 shares and hold AMD long term. Anyone have thoughts?", "score": 6, "replies": [{"body": "Long term will make u money, but who even knows if you'll be here long term. None of us are promised tomorrow. Take what u can now.", "score": 5, "replies": [{"body": "Probably will, but man it’s tempting. I hope this shit moons tomorrow.", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 8, "replies": [{"body": "Samesies", "score": 3, "replies": []}, {"body": "One of us 🤷🏿‍♂️", "score": 1, "replies": []}, {"body": "Why puts????", "score": 0, "replies": []}]}, {"body": "Moon", "score": 5, "replies": [{"body": "mooning right now 50.17 after hours, stick to 3/6 54c basically free money", "score": 3, "replies": []}]}, {"body": "3/20 $70 Calls here, bought more at end of today, This shits moving up", "score": 4, "replies": []}, {"body": "all aboard the gravy train to an early retirement, let me here you choo choo!!\n\nAMD 4 x 45c 4/17 club reporting.", "score": 4, "replies": [{"body": "I'm wondering if this news about California having a state of emergency is goin to be detrimental to AMD", "score": 3, "replies": [{"body": "So not a sure bet?", "score": 2, "replies": [{"body": "I can't tell rn. Will have to wait till tomorrow. I plan on selling at open if there's a profit either way.", "score": 1, "replies": []}]}]}]}, {"body": "60 4/17!", "score": 3, "replies": []}, {"body": "Pretty sure this is how Skynet starts 🤷🏻‍♂️", "score": 3, "replies": []}, {"body": "Big money but historically unprofitable to build these systems.\n\nGo lookup Cray Supercomputers to get an idea of how these contracts tend to go.\n\nThis is the sort of quantity over quality approach that correlated with them hitting $2. Details are needed but my first impulse is to call this a desperation move to drum up volume at the expense of margin. Downgrade.", "score": 1, "replies": []}]}
