{"title": "$NFLX ITM debit call spread - Exit options", "selftext": "Hi guys I have a quick question about what I should do with a deep ITM NFLX debit call spread. I bought the Oct 21 94.5/95 spread back when the stock tanked a few weeks ago, and now NFLX is nearing 100 again. Any advice on how to best exit this trade?\n\nLiquidity is obviously terrible due to the strikes being so far itm, so am I better off waiting closer to expiry or maybe trying to leg out by purchasing the short strike, then selling the long?\n\nThanks for any advice/feedback.", "id": "559q50", "created_utc": 1475265124.0, "score": 6, "upvote_ratio": 0.81, "num_comments": 9, "comments": [{"body": "The spread should be worth .50 (x100) at expiration.  If you want to close it sooner, .45 would be a reasonable price to put out there.  You could try .47 first is you want to save a couple more dollars.\n\nWhat you have to figure out is what is the commission's cost of letting it expire in the money.  ( It depends on your commission schedule and how many contracts you have.  Your broker will help you figure it out if you're not sure. )  Sometimes it's cheaper to sell to close the spread, even if you have to give up a couple dollars on the price.", "score": 7, "replies": []}, {"body": "Since your spread wasn't very wide, you didn't stand to make very much and commissions can eat in any profits.\n\nHow much did you pay for the spread?\n", "score": 2, "replies": [{"body": "Ok. It's been trading at ~.3 ever since I bought it (.25), so I paid $375 and have max profit of $375. Sounds like I should just let this ride until expiration comes up and sell to close for .45+. I have TDA, so exercising isn't usually cost effective", "score": 1, "replies": [{"body": "Unless I'm reading this wrong or having a moment, If you paid .25 for it, your max profit is .25 (width of strikes - debit paid)\n\nI'd hold on to it and look to sell it closer to expiration.\n\n", "score": 2, "replies": [{"body": "Haha yeah but I'm a dumbass and bought 15 contracts with dough commissions which means I'm spending minimum $45 round-trip...", "score": 1, "replies": [{"body": "Next time you want to increase your profit potential just widen the strikes instead of increasing the number of contracts\n\nI learned that one the hard way ", "score": 3, "replies": [{"body": "I agree 100%. Fortunately it looks like this one will work out for me either way, but next time I'll definitely widen the strikes, esp on longer dated contracts", "score": 1, "replies": []}, {"body": "This also a statically better move (i.e. Higher probability), not just a reduction of resort fees.  ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Good points. Sounds like wider spreads reduce commissions, but tend to require more attention/moderation. I'm usually a seller, but I couldn't resist the NFLX play given how much they've been bouncing from low-mid 90s since this past earnings", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "55apo2", "created_utc": 1475278298.0, "score": 9, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "maybe", "score": 3, "replies": []}, {"body": "Search one of the other 38833 AMD threads.", "score": 7, "replies": []}, {"body": "yes.\n", "score": 3, "replies": []}, {"body": "No\n", "score": 3, "replies": []}, {"body": "$AMD approx. earnings date Oct 20. Don't forget that Lisa promised to make third quarter profitable", "score": 1, "replies": []}, {"body": "Apple is not using AMD for Mac Book.", "score": 0, "replies": [{"body": "Pretty sure the reliable sources say that the new soon to release 15 inch itteration of the macbooks will feature amd gpus iirc. Correct me if im wrong though. Happens more often than id like to admit :/", "score": 1, "replies": []}, {"body": "It's a rumour the upcoming Zen line of CPU's AMD is releasing may be used in the next MacBook. Check it out [here.](http://www.dailytech.com/AMD+Zen+Processor+might+power+the+upcoming++Apple+MacBook+Pro/article37663.htm)", "score": -1, "replies": [{"body": "That article seems like nothing but speculation. ", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I just commented on the article, not AMD. Settle down ", "score": 1, "replies": []}]}]}, {"body": "That article is written by a moron.\nNext macbooks are using Intel CPU's 100%.", "score": 0, "replies": []}]}]}, {"body": "AMD will be in the teens in 6 months.", "score": -2, "replies": [{"body": "What makes you think that?", "score": 1, "replies": [{"body": "My quantitative analysis.", "score": 1, "replies": [{"body": "Harharharhar", "score": 1, "replies": []}]}]}]}]}
{"title": "Get on his level fag**ts, guy on stocktwits posted his biggest loss on aapl calls", "selftext": "[deleted]", "id": "5565u1", "created_utc": 1475207404.0, "score": 12, "upvote_ratio": 0.66, "num_comments": 10, "comments": [{"body": "Couple of months ago there was a stocktwats poster with a screenshot saying he lost $900,000. Seemed legit, etc. It was paper trading.\n\nThis one is also paper trading.", "score": 21, "replies": []}, {"body": "I just doubt anyone with this kind of money would be this retarded but idk", "score": 10, "replies": []}, {"body": "I swear people on wsb don't know paper accounts exist and that people make huge bets to show off on either side. This sub needs a whole r/thathappened. If you just lost that amount of money youre not of the mood to post it on the internet. Use your fucking brain. ", "score": 8, "replies": []}, {"body": "this is paper trade", "score": 7, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "http://www.stocktwits.com/WSNA?q=WSNA\n\nThere, that's his ST stream. Run thru it, you'll find the information you are looking for. \n", "score": 5, "replies": []}, {"body": "if they post from a broker that has paper trading capabilities and the screenshot is millions of dollars +, just assume its paper trading\n\nno regular joe is that retarded to put that much in options without a hedging strategy", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "The Canadian ", "score": 6, "replies": []}, {"body": "WSB", "score": 2, "replies": []}]}]}]}]}, {"body": "That's \"WSNA\". He posts all his big AAPL plays, sometimes he sticks it to the man and wins big, sometimes he gets it in the ass. He's got some balls that's for sure. If I recall correctly, there was a thread a few weeks back where someone was trolling him for being a stock pumper (which IRL he was found to be and had to pay a big fine or some shit). Whatevs. ", "score": 0, "replies": []}, {"body": "He also doesn't use stops.", "score": 0, "replies": []}]}
{"title": "$BA", "selftext": "[deleted]", "id": "556io2", "created_utc": 1475213956.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 11, "comments": [{"body": "what\n", "score": 6, "replies": [{"body": "🛫", "score": 7, "replies": [{"body": "what", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "what", "score": 5, "replies": [{"body": "Jesus man, get your vision checked. The guy above you is colorblind and still got it", "score": 3, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "To a higher place then it is currently 🛫", "score": -1, "replies": [{"body": "Than", "score": 2, "replies": [{"body": "Sorry English is not my first language", "score": 2, "replies": [{"body": "Then -- when an event occurs after another event\nThan -- when you prefer one option over the other", "score": 2, "replies": []}]}]}]}]}, {"body": "Do not bother suggesting stable, blue-chip, low volatility, large cap stocks to these degenerates. \n\nWe are only interested in securities that belong to one or more of the next category's:\n\n1) price under $3\n2) 3x leveraged\n3) trading at all time high\n4) about to release earnings\n5) on the verge of bankruptcy", "score": 5, "replies": [{"body": "Or if it rhymes with ayy emm pee", "score": 1, "replies": []}]}]}
{"title": "Lets Start a Fund", "selftext": "It can be called WSB on the NYSE consisting of JNUG DUST AMD MAST NVAX SPY CALLS NUGT & Deutsche puts. We can manage it via most upvotes on posts.\n\nLets get started.", "id": "556jyt", "created_utc": 1475214670.0, "score": 19, "upvote_ratio": 0.73, "num_comments": 19, "comments": [{"body": "yeah, and why don't you go fuck yourself?", "score": 45, "replies": [{"body": "I agree, why buy all those shitty stocks when you could go all in AMD. Commy Jew", "score": 12, "replies": []}]}, {"body": "But since this is WSB, shouldn't you be inversing that?", "score": 5, "replies": [{"body": "But since this is WSB, shouldn't you be inversing that?\n\n", "score": 4, "replies": [{"body": "Fuck", "score": 8, "replies": []}]}]}, {"body": "A motif might be more realistic. I'll make one and post the link ", "score": 3, "replies": []}, {"body": "Why not just make an index and track it. Make a Google drive document these updates every day at close. You better price weight that bitch just to make it fucking confusing as shit.", "score": 2, "replies": [{"body": "We'll need to get this sub more popular so it's easier to get iShares to prop up 3x bullish and 3x bearish ETFs that \"Seek to track the performance of the WSB index.\" \n\n", "score": 5, "replies": []}, {"body": "/u/Sithereandthere has a paper trading portfolio on this sub's top picks. I think it's on his Bloomberg terminal as well.", "score": 2, "replies": [{"body": "Never thought any of the faggots on here have enough money to have a Bloomberg terminal", "score": 3, "replies": [{"body": "There are at least a few [here](http://i.imgur.com/R4XaSyp.png) who work on the street.", "score": 3, "replies": []}, {"body": "Didn't a guy here make a mil off biotech?", "score": 1, "replies": []}, {"body": "Think again.", "score": 1, "replies": []}]}, {"body": "Correct", "score": 1, "replies": []}]}]}, {"body": "here it is. \n\nhttps://trader.motifinvesting.com/motifs/wallstreetbets-memefolio-W2ulprqy?#/overview", "score": 1, "replies": []}, {"body": "Yeah don't those require a few 100k in capital?", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "There's a direct negative correlation between people who own yachts and people who frequent WSB", "score": 2, "replies": []}]}]}]}
{"title": "Legally re-entering the Market", "selftext": "finally 18 so can open an account in my own name\n\ngot burned by my amd shorts last time\n\nexcited by DB volaitility\n\nany ideas on hot picks??", "id": "558uvx", "created_utc": 1475254579.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 10, "comments": [{"body": "Your mom is a hot pick.\n\nOwned.", "score": 21, "replies": [{"body": "Savage. ", "score": 5, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "That's why she's a hot pick.", "score": 15, "replies": [{"body": "Some say she's smokin!", "score": 2, "replies": []}]}]}, {"body": "Dude.. I know we all like to have fun here in WSB. But c'mon save the dude some dignity. Can't be burning him that bad.", "score": -1, "replies": []}]}, {"body": "Here's my take. \n\n* Shorting volatility with vxx puts\n* long crm  (calls) \n* long gld  (calls) \n* short apple\n* strangle nflx ", "score": 1, "replies": [{"body": "short aapl <-- good luck ", "score": 1, "replies": [{"body": "My Jan05, 105 puts have been treating me nicely so far. Jumped in at 115spot which was quite a rally for such a short time frame. Will see how it turns out. ", "score": 1, "replies": [{"body": "http://charts.stocktwits.com/production/original_62885522.?1474290523\n\nI am long until January.  We are consolidating for the next leg higher.", "score": 1, "replies": []}]}]}]}]}
{"title": "A safer bet for the holidays", "selftext": "[deleted]", "id": "5598fz", "created_utc": 1475259130.0, "score": 6, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "I don't see anything wrong with this. Just if you are going to take last years pattern and apply it to today's market, then I would take large-scale market climate into perspective. Considering the election and recent instability, the market is doing pretty shitty and that's a perfect time to enter. Now, how Jewish are you trying to get on your entry point? You can do more TA by looking for oversold points via stochastics. Overall, I would highly consider this DD.", "score": 5, "replies": []}, {"body": "You're gonna get railed", "score": 4, "replies": []}, {"body": "I'd do this just with $TQQQ so you can sell a call at your target price.  $RETL's options chain made me throw up in my mouth.", "score": 3, "replies": []}, {"body": "Election year, could screw you...", "score": 2, "replies": []}, {"body": "[redacted]", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Did you daytrade U/DWTI shares in July or play with oil options?", "score": 1, "replies": []}]}]}, {"body": "My concern would be the exit. Theoretically you get out before the Fed hikes rates, but if it looks inevitable for a December hike, perhaps the markets start reversing beforehand?", "score": 2, "replies": []}, {"body": "Ya you", "score": 1, "replies": []}, {"body": "I don't think this is a horrible idea, but I'm a fucking retard. \n\nHow much are you looking to put in? I might try to mimic this. ", "score": 1, "replies": []}, {"body": "So........... when do I buy in?", "score": 1, "replies": []}]}
{"title": "Qualcomm NXP Acquisition DD", "selftext": "Looks like people are saying buy NXPI , could go from the current $100 to $130ish\n\nsidenote ( NVDA may not go any higher)\n\nDD:\n1. I Googled NXP (NXPI)\n2. I Googled Qualcomm (QCOM)\n3. I read an article in the Wall Street Journal that said the stock will go up\n4. Every wireless device pretty much has a Qualcomm chip\n5. I used a microcontroller with an NXP chip with an ARM architecture in college, so ARM = mobile embedded shit (cell phones, dildos, rasberry pi, etc)\n6. Qualcomm is a 100 billion dollar company\n7. NXP is a 33 billion dollar company\n8. EVerything is getting wireless\n9. IoT shit means low power, cheap, high performance chips are needed (AI, PC's, VR will still need AMD and NVDA) but mobile shit with wireless will need this\n10. The future is coming\n11. Skynet\n12. Drones\n13. Mars / Elon Musk\n14. Raspberry Pi\n\nHOWEVER!!!!\n\n15. I don't know which one to buy ", "id": "55apfi", "created_utc": 1475278197.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 12, "comments": [{"body": "buy AMD", "score": 3, "replies": [{"body": "I have AMD, NVDA, but I want more tech. Cause computers, you know, they are the future, they are gonna be everywhere, like inside people, underwater, in churches, on the moon. Go long on computers", "score": 1, "replies": [{"body": "Get rid of NVDA... dead weight\n\nLook for some biotech that uses AMD shit or semi", "score": 0, "replies": [{"body": "Really? you think it's done? Even with this hype of their 512 core GPU for AI in Autonomous Vehicles etc? Also I keep hearing mixed news about what the next MacBook is gonna have in it? AMD? NVDIA? NXP/Quallcomm. So youre saying hold, buy, or sell NVDA?", "score": 1, "replies": [{"body": "I'm saying cover your ass for NVDA crash any time... regardless of good news.\n\nI put my bets on AMD @ 22$ for jan 2017, i put those bets in since  (2015) summer, i'm halfway there. I put those bets in cause i saw NVDA was a faggot company that grew only because they focused on marketing (snake oil sales), and had just enough from a tech, and r&d point of view.\n\nAMD still has huge potential, China facing when it comes to AI... Its just been retarded all along when it comes to marketing and focused on tech/efficiency. Well now that'll pay off. AMD will eat right through NVDA's market.\n\nThen again i haven't looked back at NVDA since i saw how they based their strategy on marketing to dominate AMD last year, although i keep up to date with ML/AI shit and know they're in there somewhere, i also know the AMD tech is more accessible and they have great recent developments... ", "score": 1, "replies": [{"body": "So some people say that Intel and NVDIA are for fanboys and that AMD is the best for CPUs and GPUs when it comes to gaming at least especially when comparing products at the same price point, AMD outperforms.\n\nSo put a nice stop limit on NVDA and keep dumping money to AMD and watch your portfolio grow?", "score": 1, "replies": [{"body": "By puts on NVDA for long term... just put orders in for them really cheap and wait for them to get picked up as NVDA tags along on AMD's back for a bit longer. I think we'll see turnaround by years end.", "score": 1, "replies": []}]}, {"body": "> AMD @ 22$ for jan 2017\n\nLmao", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It may have some legs. I'm not sure about chasing though. I own 50 shares at about 80 but that was due to me diversifying from TSM a bit.", "score": 1, "replies": []}, {"body": "Nxpi is already up a heap but reports are saying it could sell for 130-160. ", "score": 1, "replies": [{"body": "awesome. Buy?", "score": 1, "replies": []}]}, {"body": "Buy high. That means it's definitely trending up.", "score": 1, "replies": []}]}
