{"title": "Morgan Stanley Warns ‘Imminent’ Earnings Recession Will Tank Stocks", "selftext": "", "id": "10kxol2", "created_utc": 1674650319.0, "score": 275, "upvote_ratio": 0.93, "num_comments": 95, "comments": [{"body": "Morgan Stanley 100% has your best interest in mind.", "score": 222, "replies": [{"body": "This is DEFINITELY not market manipulation in any way.", "score": 59, "replies": []}, {"body": "I mean, they can't spell 'FUD' without 'FU' right?", "score": 14, "replies": []}, {"body": "No. They have their best interest in mind.\n\nAnd that is to maintain their credibility.\n\nPeople just ignore them because they want to continue to believe this sucker's rally.", "score": 13, "replies": [{"body": "So every time the market goes up its a \"suckers rally\"? \n\nMarkets go up and down every day and will forever.", "score": 0, "replies": [{"body": "The rally since the beginning of the year.\n\nI'm not talking about one trading day.", "score": 3, "replies": [{"body": "My portfolios been \"rallying\" for 10 years. I've 3xed by portfolio over the last 9.5 years by simply buying and holding good companies. No meme stocks .", "score": 3, "replies": [{"body": "What you like now ?", "score": 1, "replies": [{"body": "Asml cost orly tsla nvda..... aapl etc.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "A quote from Netflix show, Madoff “… You can’t trust Wall street. You can’t trust investment banks. You can’t trust the Wall Street analysts. You can’t trust the rating agencies , and certainly you can’t trust the regulators . “", "score": 104, "replies": [{"body": "It's all the Spiderman pointing meme. \n\nThey're the same people...and when they're not the same people, they're married to the same people....and if they're not married, they're related...and if they're not related, they're best friends.\n\nIt's a massive, interconnected web of capital, and we're all just caught in it.", "score": 47, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "I enjoyed it and it was worth the binge", "score": 12, "replies": []}, {"body": "Yes. Great watch. Will open your eyes to the crime that really happened on Wall Street and continues to happen to this day.", "score": 6, "replies": [{"body": "Along with peer influences and people who take somebody else's opinion as their own.\n\nDo your own research and educate yourself.", "score": 1, "replies": [{"body": "I have, thanks for saying words. They mean so much. lol", "score": 1, "replies": []}]}]}]}, {"body": "Great doc.", "score": 3, "replies": []}, {"body": "You believe everything you hear on Netflix?", "score": 1, "replies": [{"body": "The broad answer is no, but to this documentary, yes. The events came from Bernie Madoff himself.", "score": 5, "replies": []}, {"body": "Well the quote is spot on, and so I believe it", "score": 1, "replies": []}]}]}, {"body": "And you know who will step up and buy the dip, Morgan Stanley. and the other crooks", "score": 130, "replies": [{"body": "How much money do you need in a recession and depression? Enough to pay your basic needs, and enough to buy as many of the best securities at rock bottom prices.", "score": 40, "replies": [{"body": "Preach, TendieTrades, preach.", "score": 14, "replies": [{"body": "It falls on deaf ears and blind eyes. Also the lazy that say, “Tell me what stock to buy.”", "score": 6, "replies": []}]}]}, {"body": "They are telling you what to do.  MS makes their money through wealth management.  They want you to follow them, make $, and then say \"hey that was easy, why don't I pay them to invest my money for the rest of my life.\"", "score": 28, "replies": [{"body": "Microsoft manages wealth?!?", "score": 0, "replies": [{"body": "Microsoft is MSFT. Morgan Stanley is MS. Might want to fix those contracts with this additional information.", "score": 2, "replies": [{"body": "MS paint would like a word", "score": 3, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "I did this first too. Lol", "score": 1, "replies": []}]}]}]}, {"body": "Or not…you know, either or…", "score": 12, "replies": []}, {"body": "Ah yes… as long as we see headlines like this from major players you can bet they will not tank (yet)", "score": 35, "replies": [{"body": "PPT exists for a reason.", "score": 6, "replies": [{"body": "The good ol PPT been a while since I’ve seen that abbreviation", "score": 2, "replies": []}]}]}, {"body": "Morgan Stanley ultimately projects the S&P could tumble as much as 25% to a two-year low of 3,000 points as earnings season ramps up", "score": 20, "replies": [{"body": "It could go up or sideways too", "score": 18, "replies": [{"body": "Definitely one of those three for sure.", "score": 20, "replies": [{"body": "Which two will it be?", "score": 3, "replies": []}, {"body": "Probably. Maybe. Could be.", "score": 3, "replies": []}]}]}]}, {"body": "Why are people still listening to this dude", "score": 12, "replies": [{"body": "He’s been right the entire way down.", "score": 1, "replies": [{"body": "He said January would be a terrible month .... so far he's wrong", "score": 1, "replies": []}]}]}, {"body": "Fuck off morgan you Twat", "score": 5, "replies": []}, {"body": "Bullshit", "score": 4, "replies": []}, {"body": "is there some website that tallies the number of times each analyst has been right and wrong?", "score": 4, "replies": [{"body": "Wilson was wrong in 2021, right in 2022. He has been forecasting a big bear market since around 2018, and 2020 was too V-shaped to fit his forecast.", "score": 1, "replies": []}]}, {"body": "Definitely can't trust any news, especially the ones coming from the shorts !!!", "score": 3, "replies": [{"body": "Except in 2008.", "score": 0, "replies": []}]}, {"body": "Mike Wilson has been adamant about this for the last 12 months. He has consistently called for a market bottom in late Q1/early Q2 of ‘23.\n\nDude has been on point - i don’t know if it will be 3000-3200 like he’s saying, but I think we’re definitely breaking through October lows which everyone wants to believe is the bottom.\n\nHopium is going to quickly fade when 75% of blue chips guide downward for the year over the next 2-3 weeks. More red is on the way.", "score": 16, "replies": [{"body": "I hope you are positioned to make tons of cash of your conviction. If not then then you are full of shit like the rest of the talking heads who don't have a clue where the market is heading.", "score": 18, "replies": [{"body": "I'm up nicely on my 3/31and 4/21 QQQ and SPY puts. so yeah, it's working out so far", "score": 0, "replies": [{"body": "Good on you fren and I really mean this. Happy when retail makes money.", "score": 10, "replies": []}]}, {"body": "Yes because being positioned to profit means that you have greater insight. It means nothing. The market is going to go down fucking obviously.", "score": 0, "replies": [{"body": "If it's so obvious liquidate everything you have and buy June dated puts. Your gains will be unmeasurable.\n\nLooking forward to you being rich.", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 4 weeks", "score": 4, "replies": [{"body": "Accurate sentiment and direction for the last two weeks, but flat on the month.  Earnings wasn’t the trigger, but resilience driving rate estimates higher.  \n\nI have June 30th puts presently ITM, but am certainly not going to wait for 3200-3000 to take a profit.", "score": 3, "replies": []}, {"body": "I will be messaging you in 28 days on [**2023-02-22 16:34:10 UTC**](http://www.wolframalpha.com/input/?i=2023-02-22%2016:34:10%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/10kxol2/morgan_stanley_warns_imminent_earnings_recession/j5u7siu/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2F10kxol2%2Fmorgan_stanley_warns_imminent_earnings_recession%2Fj5u7siu%2F%5D%0A%0ARemindMe%21%202023-02-22%2016%3A34%3A10%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2010kxol2)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "And JPOW will smack the markets on the bottom soon if they continue with this nonsense.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "After April", "score": 1, "replies": []}]}, {"body": "Mike Wilson has been calling for a recession since late 2020. He was very wrong about 2021, but got 2022 right, so his recent track record is not that great. He was also calling for a recession in 2019. He has been acting like a perma bear the last few years.", "score": 1, "replies": [{"body": "which banks did get 2021 right? genuinely curious", "score": 1, "replies": [{"body": "David Kostin (Goldman Sachs, kind of Wilson's equivalent in the corporate ladder) got it right for 2021 but so wrong for 2022 (he was forecasting S&P 500 to reach 5000 in 2022).", "score": 1, "replies": []}]}]}, {"body": "No he hasn't. He said January 2023 would be a terrible month.", "score": 1, "replies": []}]}, {"body": "Road to 410 here we come", "score": 2, "replies": [{"body": "Delusion.", "score": -4, "replies": [{"body": "Keep betting on a recession then. I’m not married to calls or puts. Id rather bet on the current trends than trying to create a trend that isn’t there and hoping for a recession. Its too soon in the year and my money is on an “in may we stay away drop.”", "score": 6, "replies": [{"body": "my trades are currently \\~3% of my entire portfolio. I'm DCA into the market monthly with heavier buys on market down periods.\n\nI'm betting on the market continuing to go down when virtually every company is guiding lower this earnings season", "score": 0, "replies": [{"body": "You still don’t see it do you? Where did you read, “Every company is guiding lower this earnings season.” Track that source and get back to me. It’s NEVER going to be that easy otherwise everyone would be raking it in retail investors included. If you’re so sure, then maybe you should short the market starting now instead of averaging down into a recession like you’re trying to do right now. \n\nEdit: If timing the market is dumb then timing the recession is lunacy", "score": 5, "replies": [{"body": "i guess you missed where i said i'm holding SPY and QQQ puts.\n\nsorry, semantics - every company that drives larger market (top 10 SPY/QQQ holdings) 'will' guide down. or just to make you happy, how about the majority of these, I BET, will guide down for '23.\n\nMSFT was just the start... sit back and enjoy the show, partner", "score": 0, "replies": [{"body": "Fair enough. Good luck", "score": 0, "replies": []}, {"body": "Tsla and lrcx and asml beat on earnings.", "score": 1, "replies": []}]}, {"body": "It's plain as day if you look at it  for example when you see that the entire S&P 500 is laying off employees it's a cyclical action that will show up two quarters from now", "score": 1, "replies": [{"body": "Im not denying recession. Im saying that timing it is a stupid move and the fact that everyone is trying to time it right now and force it is why were going to 410 before 380.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Lol why would Morgan Stanley warn anybody?\nOut of the goodness of their hearts?\nplease...", "score": 2, "replies": []}, {"body": "Good. Thought I missed the bottom.", "score": 2, "replies": []}, {"body": "Stocks will tank but then go back up again. Thanks. Ugh.", "score": 1, "replies": []}, {"body": "Good. I’ve been waiting for this for a year and a half.", "score": 1, "replies": [{"body": "I've been waiting for this all of my life.\n\nI'm the E-Trade baby.", "score": 2, "replies": []}]}, {"body": "Recession is when short money and depression is when loads of money and don't know what stock to buy", "score": 0, "replies": []}, {"body": "Let Cramer speak", "score": 0, "replies": []}, {"body": "I think we all know the scale of the QE, earnings in Q2 will be bad but followed by a pivot", "score": 1, "replies": []}, {"body": "We’re like mid earnings season but thanks for your input Ms", "score": 1, "replies": []}, {"body": "Everyday its \"BUY BUY BUY\" but the next guy comes \"SELL SELL SELL\" SO WHICH IS IT", "score": 1, "replies": []}, {"body": "MS are garbage analysts. only listen to GS analysts.\nand the market already front runs them. by the time MS declare a trend, it is already in reversal mode..", "score": 1, "replies": []}, {"body": "Buy the news", "score": 1, "replies": []}, {"body": "Morgan has been wrong how many times?", "score": 1, "replies": []}, {"body": "Long story short, are you pulling out or holding?", "score": 1, "replies": []}, {"body": "Wait. Stocks are up from the past year? I thought we had been in the tank for a while. At this rate I’ll recover in 2050.", "score": 1, "replies": []}, {"body": "they want their Puts to print!!", "score": 1, "replies": []}, {"body": "I think 3-4 months from now. It will be a good buying opportunity", "score": 1, "replies": []}, {"body": "Looks like someone has a desperate short position!!!", "score": 1, "replies": []}, {"body": "Yeah ... it's \"imminent\" because they will cause it.  Can't say we weren't warned though.", "score": 1, "replies": []}, {"body": "Morgan Stanley doesn't have any experience in the field of recession.", "score": 1, "replies": []}, {"body": "Cramers busy with laying down cow bell tracks and tire screeches.", "score": 1, "replies": []}, {"body": "This is the same guy that says working from home doesn’t work, just like the other out of touch dinosaurs. Now I should listen to him about this too?", "score": 1, "replies": []}, {"body": "I didn't buy enough in the dip, so another dip works for me.\n\nSoz.", "score": 1, "replies": []}]}
