{"title": "What are your main concerns regarding Tesla and the stock at the moment?", "selftext": "Hi everyone,\n\nAfter the Q3 results, the stock has been trading a lot higher, and more stable, than before. A lot of the uncertainties surrounding the production capabilities of Tesla were removed. Everything is looking rosy and the sky appears to be the limit. A lot of bulls are experience squeeze fever as well :)\n\nSo, I consider this the right moment to try and take a step back and look at the risks that are still there and how they might affect Tesla and the stock.\n\nMy main concern at the moment isn't a big one, in the grand scheme of things, but still important: the customer experience regarding deliveries and after sale service seem to be all over the place due to the rapid growth Tesla has experienced the past year. No matter how great the car, if the perception is that service sucks people won't buy.\n\nThere also seems to be a perception of inferior quality in Tesla's, no doubt helped by the insistent trolling over the years, that I've noticed in comments below Dutch/Belgian Tesla news articles. I don't know if that perception is truly there or just more trolling and how widespread that idea truly is.\n\nBesides these I'm having trouble seeing anything else, which I consider a problem, since there must be something/several things of greater risk than the above.\n\nSo below is a list of things that I don't think are of concern, with the hope you'll fill in the blanks in my (lack of) risk assessment.\n\n1. Demand isn't going to be a problem, with European and Chinese deliveries of the (high end) Model 3 starting next quarter and especially with the $35k/Standard Range Model 3 on the horizon (my expectation is end of Q1 limited deliveries).\n2. So I don't consider a recession to be a problem either since demand will continue to outstrip supply. That said it's likely the stock would go down regardless. Or will it stay relatively flat like we've just experienced?\n3. Debt seems covered with ease with the improvement in cash flow due to the new lease deal, the reduction in factory->delivery time and the existing cash they have on hand.\n4. Elon is working more normal (well, for Elon) hours so is behaving more like himself, most of the SEC stuff is behind him/us and the remaining stuff looks weak. Martin Tripp seems to have fled the US and is hiding in Hungary which doesn't paint the picture of a confident man/case and even then seems unlikely to have any large impact.\n5. The Chinese import tariffs are going to be reduced again and will be lower than before, but no clear view on timing. There are signs of first construction/prep work of the China GigaFactory starting this month.\n6. Quality of the Model 3 appears to have improved considerably; when was the last time you heard the words \"panel gap\"? I haven't read about any drivetrain failures recently either, nor of anything else of great importance. Also, let's take a moment and appreciate that the very first Model 3s have been on the road for a year and a half already!\n\nSo, reddit, what am I missing?! What's that thing niggling at the back of your head?\n\n**Edit:**\n\nFirst of all, thanks for the comments, much appreciated.\n\n**Summary of concerns/risks I'm seeing:**\n\n* Demand drop in the US due to the tax credit phase out for both Model 3 and Model S/X.\n* Inability to produce the $35k Model 3 at a profit at all or too late combined with low demand for the available high end trims.\n* Macro events like a war/recession/financial crisis.\n* Political like the Trump/China trade war or taking CFO's/CEO's hostage ;)\n* Cold weather issues with the Model 3.\n\nNotably absent:\n\n* Elon on twitter ;)\n* Debt", "id": "a5l6og", "created_utc": 1544641513.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 87, "comments": [{"body": "Elon flies to China, gets arrested and used as a bargaining chip against the Huawei CFO.\n\nSEC or DOJ announce they are taking action on the Model 3 projections.\n\nNot saying either are likely, but they need to be considered as far as risk mitigation.", "score": 10, "replies": [{"body": "Unlikely.    China needs him to build a gigafactory there.", "score": 7, "replies": [{"body": "Yep he can't leave until he is finished :)", "score": 10, "replies": [{"body": "Lol. But yeah, China seems to really like Tesla and Elon so it seems doubtful anything like the Huawei stuff could happen, but you never know.", "score": 4, "replies": []}, {"body": "Anyone who watched Iron Man would know this is the worst idea ever. \n\nYou saw what he build in a simple cave. Locking him up in a gigafactory would most likely spawn Optimus Prime or something similar.", "score": 2, "replies": []}]}]}]}, {"body": "I’m not necessarily concerned, but rather interested to see if the tax credit phase out starting in Q1 will have an effect on demand for the higher priced and margin model 3s. I.E. will ASP drop in sync with the tax credit? ", "score": 8, "replies": [{"body": "The demand in the US may drop but alot of those higher priced vehicles could be delivered in Europe so i dont expect a drop in ASP", "score": 6, "replies": [{"body": "Europe typically has accounted for about 50% less sales than the US for Tesla.  I agree in Q1 Europe will help keep ASPs up, but I expect demand for the higher trim variants will fade quite quickly there (as they have in the US after only two quarters).  ", "score": 1, "replies": [{"body": "The model 3 also could be more popular in europe than S and X because of its smaller size", "score": 3, "replies": []}]}]}, {"body": "3 thousand dollars isn’t that big of a difference on a 45k+ car.    The model x and a prices have fluctuated more than that without hurting sales.", "score": 5, "replies": []}, {"body": "Here is how I see it.  Currently Tesla sells a version of the Model 3 that has a bigger battery and premium trim for $38,500.  Why exactly do people think demand is going to skyrocket when Tesla starts offering a version of the car with a smaller battery and no premium trim for $35,000?  ", "score": 1, "replies": [{"body": "I think it's a psychology thing.  Starting price vs. rebated price.  Just my opinion though.", "score": 3, "replies": [{"body": "Yep, and not everybody has a tax liability of $7500.\n\nPerception as well. Everybody is moaning about the $35k model but if you take the tax credit into account it already is.\n\nOnce the media reports the $35k Model 3 is finally there they'll draw in new customers.", "score": 3, "replies": [{"body": "> Yep, and not everybody has a tax liability of $7500.\n\nSure, but most people buying $45k cars probably have tax liabilities that exceed that pretty easily.  \n\n> Once the media reports the $35k Model 3 is finally there they'll draw in new customers.\n\nMight just be my impression, but I feel like most people interested in buying a Tesla are pretty familiar with the rebate situation already.  ", "score": 1, "replies": []}]}]}, {"body": "Why is a dollar priced at 99 cents much more in demand than a dollar priced at 101 cents?\n\nFor elastic goods small price changes have a large effect.", "score": 3, "replies": [{"body": "But you are getting an inferior product for a minor change in price.  Tesla is pricing the premium interior at $5k alone.  The larger battery is easily worth another $2-3k. \n\nIn other words, paying 101 cents for a product worth 105 cents might look a lot more attractive than paying 99 cents for something worth 99 cents.  ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Yeah, it's a balancing act that I hope doesn't delay anything for too long. Doesn't look like something that can bring down the company though, as they can lower capex spending if required.", "score": 1, "replies": []}, {"body": "Model Y uses existing production lines...so not that great of CapEx.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Why would that mean new lines?   If it’s basically the same parts as the 3 but with a taller body and longer suspension, they should be able to assemble it in the same line.   \n\nhttps://www.google.com/amp/amp.timeinc.net/thedrive/tech/20094/tesla-model-y-cuv-may-see-november-2019-production-kickoff%3Fsource%3Ddam", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "My bad, I wasn’t sure what GF1 was.   My understanding is that they will build Y in Fremont.   \n\nhttps://www.google.com/amp/s/www.teslarati.com/tesla-model-y-production-november-2019-fremont/amp/", "score": 1, "replies": [{"body": "I don't think the location has been announced, but given what we know about capacity at Fremont, the consensus is that it will be built at the Gigafactory 1", "score": 3, "replies": [{"body": "My assumption is that they’ll start building in Fremont until demand justifies additional production to the gigafactory.    ", "score": 0, "replies": [{"body": "Perhaps, but if history is any indication, demand should outstrip years of production capability the moment pre orders are available.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "By the time the Y is being produced, demand will go down for model 3.    ", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "First time I hear anything about that. Got more info?", "score": 2, "replies": []}, {"body": "I don't think that is accurate.  I haven't seen any reporting to match tat.\n\n&#x200B;\n\nGot a link for me or anything, I may have missed it?", "score": 1, "replies": []}]}]}, {"body": "1) The global economy is slowing down so wont be surprising to see a recession within the next 3-5yrs so hopefully by then Tesla can stockpile some cash and become as recession proof as they can. No matter how well they do tis they will still be hit hard in the next recession. I read somewere ford had $50 billion in cash in 08 and still were almost wiped out in that recession. This combined with the macro environment (trade war) is my biggest worry at the moment.\n\n2) Making the $35k model 3. I would be happy if they could do this within the next 3 months. Will widen the potential customer pool. Also seems to be the last straw shorts are clutching onto. \n\n3) Ramp up of model 3. It seems like were stuck at the 4-5k weekly output for a while now. With the fixed costs Tesla has if they can get this number up to 7k+ then profit should massively increase.\n\n4) Staying above $360 in march. Not too worried about this with the future quarters expected to be good and the model Y reveal coming up next year. Elon has calmed down on twitter and we haven't seen huge stock price spikes since.", "score": 6, "replies": [{"body": "1. But that only impacts Tesla if demand slows down, right? All the incumbents are demand limited already, some are already idling plants. Meanwhile Tesla can't build cars fast enough. So demand would have to drop below what Tesla can produce for it to hurt them. I just don't see that happening. Also, we're all focused on North America/Europe and China but there are more markets that they already operate in and more they can expand to. Granted those are smaller but it's not like they're out of options to expand demand if needed.\n2. Agreed.\n3. Agreed. We'll have to wait and see how many they actually produced in Q4. Visibility has gone down considerably on this compared to last quarter imo.\n4. You mean for the debt due in March?", "score": 1, "replies": [{"body": "Yes for march debt. \nCan’t wait for Q4 to see weekly build rate, model 3 reservation number updates. \nWould be great to see rate of new model 3 orders, but i don’t think tesla will release those. ", "score": 2, "replies": [{"body": "Don't think they will either. Way too easy to twist everything negatively. There is so much they still can/will do to increase demand.\n\nIt's easy to forget all these sales are with zero advertising, high end versions only, no leasing, North American market only etc.", "score": 1, "replies": []}]}]}]}, {"body": "I'd say very little honestly, although if you bought Apple a year after the first IPhone release you would have immediately lost half your investment.", "score": 5, "replies": [{"body": "That was due to the 2008 crisis, right? So your mean concern is a recession?", "score": 1, "replies": [{"body": "Yes, basically I'd say you don't want to be 100% into stocks 10 years into a bull run.  Because if things do fall apart you want to be thinking \"How much should I buy at these levels?\" and not  \"When should I panic?\"", "score": 3, "replies": [{"body": "Tough spot though with where Tesla is going. Though not a recession the global pull back in stocks we're seeing now didn't drop Tesla's stock at all. My expectation is that it would stay relatively flat during a recession as well.\n\nThat said, I'd be ok with just holding my shares during those times.", "score": 1, "replies": [{"body": "It certainly might be that the stock goes up to 600 in the next year and then falls back to 400 as a recession occurs, although I wouldn't expect it to stay flat.\n\nWhat might be a good idea making plans and having a certain % stop lossed.  So like if the stock goes down say 6% if you stop loss 30 percent then you know you have room to buy on the way down and you can just buy back in if it goes up.   Way easier than just holding if you have a huge portion of your assets in one stock.", "score": 2, "replies": [{"body": "Yeah, it's hard to plan things at the moment when the stock could make a big move. I'll probably end up doing what you suggested if it pans out like you describe. Thanks for the advice :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "My biggest concern is if they can produce the SR in time at a profit before they run out of LR And MR\nOrders. Its still roughly 4 months away means another ~80000 of the current versions have to find a customer till then.  If not that'll hurt thrm badly...", "score": 4, "replies": [{"body": "True, China/Europe will buffer any demand slump in the US for Q1/Q2 but if the SR takes them too long it would indeed be a serious problem.\n\nOne distinction that is important to make is that even though the $35k Model 3 is still months away, that doesn't mean the SR is. It's almost a guarantee that the first SR cars will all be with PUP. And if they plan to build an AWD SR, they could sell those first.\n\nThey could also reintroduce the LR RWD if needed, introduce leases etc.", "score": 2, "replies": [{"body": "Question for you.  Would you rather buy an MR version with PUP package for $38,500 today, or an SR version with PUP package for $36,250 next year?  My view is MR and SR orders are essentially the same in the US.  ", "score": 1, "replies": []}]}]}, {"body": "1. Trump administration doing something crazy like starting a war to distract the public’s attention while they cut the mueller investigation. \n2. An overall global financial crisis. \n3. Elon dying.", "score": 8, "replies": [{"body": "Elon dying would actually have me seriously concerned, I think at this point we're at the tail end of where he's critical to the business' success but it's not completely decoupled yet.", "score": 8, "replies": [{"body": "True. It wouldn't bring down the company, imo, but it would obviously have an impact.", "score": 2, "replies": []}]}, {"body": "1. I guess we've all become numb to what Trump is doing but a war would be bad. Are you thinking in terms of lowered demand or the impact on resources, supply lines etc?\n2. I'm assuming you mean lots of people losing their jobs and thus lowered demand?", "score": 2, "replies": []}]}, {"body": "A full-blown recession coming a bit earlier than anticipated is my main concern. In 2 time years I think Tesla will be in a better position than most to weather the storm. If it begins in earnest within the next year, then I don’t know. \n\nSecond big concern would be Trump doing something that fucks up US/China relations so badly that the Chinese factory is put on indefinite hold. No particular reason to think that’s going to happen, but you never know what kind of news you’re going to wake up to with this President.\n\nThere’s a lot of shorter term issues I can see causing a temporary 10-15% drop, for instance I’m expecting leaks from the SEC and DOJ any day now, but I’m in it for the long haul so I’m not particularly worried about that. \n\nI’m not concerned about demand, not long-term. I think it will slow considerably in the US for a little while next year as all the early/early-ish adopters get their cars, but Europe and Asia will fill that gap in the meantime. Outside of California (and Norway), it’s still a big leap for a lot of people to buy a car from a 15yr old ‘Silicon Valley start-up’, and not just any car but an EV, so I am expecting there to be a down period between the ‘fans’ getting their cars and your average car buyer starting to view Tesla as a serious option as they see more around. That can be an overnight process if they actually know someone with one, but for most people I think it’s going to take 6 months to a year. So I don’t expect US sales to wow me in Q1-2, but I think by Q3-4 it’ll be more than back on track.", "score": 3, "replies": [{"body": ">I’m not concerned about demand, not long-term. I think it will slow considerably in the US for a little while next year as all the early/early-ish adopters get their cars, but Europe and Asia will fill that gap in the meantime.\n\nAgreed. That's what I mean as well when I say I'm not concerned about demand. There might be temporary lulls while people wrap their head around the idea that their next car will be a Tesla (EV). Most people don't know yet that their next car will be a Tesla! There's not just brand awareness but EV awareness that needs to grow and spread like a virus. And since the barrier for entry is a lot higher than most other products it is bound to take longer.", "score": 1, "replies": []}]}, {"body": "I’m not sure that Europe/China sales will be able to compensate for the drop of sales due to expiration of the credit. The fact of expiration alone should eat up future demand (rather buy now and get the credit then wait till next year).\nOn top of that, I’m very concerned that Tesla was selling Model 3 rather then leasing it. It should lock a lot of potential buyers for more then standard 2/3 years. So, the replacement cycle will be closer to 4-5 years.", "score": 2, "replies": [{"body": "Once they start leasing the model 3 they should recieve tons of demand especially from europe. In the UK leasing is the hot thing for new cars.", "score": 3, "replies": [{"body": "It’s quite possible UK economy will have issues next couple of years, so I would not bet on them.", "score": 2, "replies": [{"body": "True, but his point still stands. Most of the Dutch/German/Belgian car fleet in this price category is on a (company) lease as well.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "hEy, NiCkNaMe\\_EsCo, JuSt a qUiCk hEaDs-uP:  \n**rEcIeVe** iS AcTuAlLy sPeLlEd **rEcEiVe**. YoU CaN ReMeMbEr iT By **e bEfOrE I**.  \nhAvE A NiCe dAy!\n\n^^^^tHe ^^^^pArEnT ^^^^CoMmEnTeR ^^^^CaN ^^^^RePlY ^^^^WiTh ^^^^'DeLeTe' ^^^^To ^^^^dElEtE ^^^^ThIs ^^^^cOmMeNt.", "score": 0, "replies": []}]}]}, {"body": "I don't consider that a problem but your guess/opinion is as good as mine.\n\nIn my opinion, it's only a 3-4k price increase so any impact on demand will be minimal. But even if it halves the current demand, demand in Europe/China should be able to absorb that. The European market for sedans is twice the size of the US one and China wants all the EVs it can get.\n\nAssume that they're at around 7k/week. And demand in the US drops to 2.5k/week. That leaves 2.5k/week for Europe, 2.5/week for China. Doesn't seem unreasonable.. And they can ship the MR to China/Eu as well if/when needed.\n\nInteresting, so Tesla should offer leases sooner than later. They already mentioned that most people prefer a lease (in the US) anyway.", "score": 2, "replies": [{"body": "Problem is with price increase itself. If you had plans to buy you would rather buy while it cheaper. So, a lot of “buy” was pushed to happened this year.", "score": 2, "replies": [{"body": "Got it, pulling in sales to this year.\n\nI don't know how flexible the buying schedule is for most people in buying new cars. Especially in this price category. I guess a lot of folks are on leases anyway.", "score": 1, "replies": []}]}]}]}, {"body": "Me for the biggest concerns are:  \n\n\n1) Production ramp of TM3, are they at steady 6k to 7k production of the cars without it being a full court press. Sure, you can push and do bursts, but I want steady production where work is in the \"normal\" pace of things  \n\n\n2) Energy/Battery ramp? Where is it at? are they delivering more high margin powerwall and commercial units. Can they build that part of the company and keep growth going.  \n\n\n3) Where is the solar roof? Reports of 24/7 production happening in Buffalo is nice, so when will that backlog of tile roof orders start to happen and what's the margins on that product line.  \n\n\n4) What's 2019 got in store? China production ramp and factory? Model Y release dates? Semi Truck updates?   \n\n\nlots of things to consider ...", "score": 2, "replies": [{"body": "1. Yep, that's the big one isn't it. I'm ok with them still running at 5k for this quarter but expect 7k the next one. Otherwise they're in trouble for the $35k version.\n2. You're the first/only one with Tesla Energy on his mind :) Good point though, PowerWall/Pack is such a great product. Their guidance indicates ever increasing demand so should be ok but they have to deliver.\n3. Good points.\n4. Rumors are they'll postpone the Model Y reveal but not its launch. I hope they don't delay anything, including the Semi!", "score": 2, "replies": [{"body": "On point 2 I'm not the only one, one of the analysts on msnbc was saying the potential of Tesla energy is to be up to half the companies value, around 500 billion, by 2025. The scale of one or two full size gigafactories producing a boatload of batteries has huge upsides. ", "score": 2, "replies": [{"body": "I meant in this thread as a concern :)\n\nJB Straubel/Elon have said they expect Tesla Energy to become bigger than Tesla Automotive so no surprise there. Long way to go though. But I'm positive that now that the worst with Model 3 is behind them, they're ramping PowerWall/Pack production like crazy. Panasonic also stated Tesla asked them to produce as many cells as they possibly can as soon as possible.\n\nI just can't wait to see where they're at in 2025!", "score": 1, "replies": []}]}]}]}, {"body": "Agree that build quality is improving. Elon said they fix things as they find them, with revisions happening monthly. I wish there were some well-documented examples of this happening, but things do appear to be better today than a year ago.\n\nMy biggest concern is the customer experience. Everything from purchasing the car, to delivery, to service appointments. Tesla still seems to really suck at this. It should be an easy thing to fix, not sure why it's not done already. It's like they never planned for their cars being successful.\n\nI also have a minor concern about the cars operating in cold climates, particularly the northeast US/Canada, where icing is common. Not sure how much patience the average \"NE yuppy\" will have when the door won't open. Or the handle snaps. Or they forgot to plug in and used up all their charge pre-heating. These things are being tolerated right now by the fanbois, but can quickly turn to souring attitudes when it happens to normal customers.\n\nPeople will cite that Norway loves their Teslas and therefore there's no issue with cold climate. I think they might be overlooking that Norwegians are a different type of person than a suburban soccer mom in Connecticut.", "score": 2, "replies": [{"body": "I guess the biggest example are the battery pack improvements that Elon talked about.\n\nI think it's something that appears easy from the outside, but is actually harder than we all think. They went from being a small car manufacturer to a medium large on in a single year, even less if you look at the ramp. They should have anticipated better but it is what it is. Agree it's not great.\n\nTrue, but I think the benefits of an EV outweigh those possible drawbacks. I mean, remotely pre-heat your car? How cool is that. Some of the undercarriage snow accumulation doesn't look great though. That body flap tearing etc.\n\nStill, valid concerns alright!", "score": 2, "replies": []}]}, {"body": "I would focus on three priorities, assuming that model 3 demand is a non-issue 2019 even with Tesla churning out 7K a week.\n\n1. Successful refresh of the Model S and X line. We tend to “forget” the 100.000 deliveries each year. It’s Tesla’s flagship vehicles, they need new batteries, engines and interior. We are looking at almost 12 billion $ worth of revenue. A successful upgrade could increase demand beyond the current production restrained 100.000 / year.\n\n2. Successful launch of the solar-roof. I predict that demand for the solar-roof will be high. Combined with power-wall sales I see this as Tesla’s fastest way to 2x revenue.\n\n3. Fast launch of the Model Y. Again the possibility to generate 2x the revenue or more.\n\nFailing to execute on 1 and 3 would be very problematic. 2 is untapped potential that could take the stock to the moon.\n", "score": 2, "replies": [{"body": "1. You're right they can't hold off too long with a (interior) refresh of the S/X. Lots of potential there to improve those cars. Adding the new 2170 cells, increasing energy density and thus range, faster charging in combination with Supercharger V3, increased efficiency with a permanent magnet motor design like the Model 3 increasing range once again. I don't think they would up production on those too much though, maybe 125k or 150k per year?  \nI think they really want to do all of the above but they can't until Model 3 is stable. Fiddling with their cash cows while ramping another product wouldn't have been the smartest move. But 2019 would be the year to do that. Especially in light of some of the competition that is coming, like the Taycan. While I don't see those as a threat from a sales perspective, it would be great for Tesla to stay at the top with the best product.\n2. Yeah Solar Roof is currently flying completely below the radar, especially in terms of revenue but if they can deliver at a good price it's going to be nuts. Why buy a normal roof when you can buy a solar roof, right?!\n3. Looks like it'll be 2020 for the Model Y, along with the Semi and Roadster.", "score": 2, "replies": [{"body": "1 would also illustrate once and for all that VW, Audi etc. brought piss to a shit fight.\n\nI suspect their 2020 offerings like the eTron unfortunately is going to have horrible real-life range. Notice that journalists are test-driving it in warm non-challenging climates like Dubai and range only is provided in WLTP, making it hard to compare to anything currently available? Not a good sign. \n\nIf Tesla introduces new motors and batteries on the model S/X in 2019 - it will become clear that the established played tried to catch up to 2013 technology (and failed). 2019 tech will effectively raise the bar to a whole new level.\n\n", "score": 2, "replies": [{"body": "We'll have to wait and see but it's almost guaranteed that the e-tron will be less efficient. Excluding everything else the aerodynamics will guarantee that.", "score": 2, "replies": []}]}]}]}, {"body": "I'm not certain S/X can hold 100k/year without tax credit and with competitors mostly slotting in directly against them.\n\nI'm not certain the China trade war is going to resolve quietly. China is a big and important market and who knows what kind of authoritarian behavior they may impose on Tesla or it's GF3.\n\nI think Tesla will struggle to make the 35k$ profitably. More importantly, I'm not sure how much more cost they can wring out of the production and 25% overall gross margin for 3 might be a stretch.", "score": 2, "replies": [{"body": "The cool thing about Tesla; the more cars they sell, the more they make on supercharging and parts.  They don’t have to rely on car sales alone.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not currently, because more of the cars have free supercharging.  But eventually it will be.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not sure; but it’s averaged per state.", "score": 1, "replies": []}]}]}]}]}, {"body": ">I think Tesla will struggle to make the 35k$ profitably. \n\nYes, it is a challenge and they are working on it, in the process they should be making the higher spec trims more profitable,\n\nIMO they will not sell it in significant numbers before they can make a slim margin, IMO it is a matter of \"when\" not \"if\", But I can't put a time-frame on \"when\".", "score": 2, "replies": [{"body": "I spent a lot of time guessing at the cost structure and working backwards to the cost of the 35k$ model and came up with a gross margin loss of 3k$, and then Elon said recently it costs 38k$ to make it and I said 'bingo!'. So we are talking 3k$-5k$ in cost savings even though they've had 15 months and quite a bit of scaling already. I suspect that's not easy.", "score": 3, "replies": [{"body": "Yes I guessed that you had probably done that and I'm glad I don't have the job of finding that $3k-5k.\nMy rationale is that the car was designed to be built for $35k, teardowns and thoses estimates show that they are in the right ballpark.\nWhat thay are doing is moving to a new redesigned SR pack, process improvements, scaling hopefully to a consistent 7K per week and renegotiating parts supply.\nSo essentially that is the path, redesign, efficency, scale, negoitation, substitution and it all takes time.", "score": 2, "replies": []}]}, {"body": "Indeed, when not if. We've got two independent tear downs confirming that the car should be (very) profitable at $35k at 10k/week so there don't appear to be fundamental issues, with the car design, that would prevent that. \n\nProduction cost is the main problem and we don't have visibility on that.", "score": 2, "replies": []}]}, {"body": "S/X prices have gone up/down more than $7k over the years so the actual cost doesn't really matter, but the psychological factor might.", "score": 2, "replies": []}, {"body": "Hmm. But they could easily lower the Model S/X price to match the credit and still make a healthy profit. They are still improving margin on those as well. Obviously would lower profit initially.\n\nEverything also points to deliveries outside of the US being a lot lower which indicates more cars being sold now in the US due to the tax credit. That is most likely going to even out again next year, imo.\n\nCompetition is still lacking imo. I don't see anything that can match Model S/X even years from now, except maybe the Porsche Taycan. I'm likely also underestimating brand loyalty.\n\nI think China could do harm but Tesla would be the last to suffer, since we're talking about EVs. But can't rule it out, true.\n\nI agree it will take them a while to get to 25% margin overall on the Model 3 but I'm not concerned in the long term. We've got two independent tear downs saying it's possible at 10k/week and those were the initial design. So taking into consideration the cheaper battery pack design (and cell cost) that's coming, improved car design and further iterations I'm not worried. All depends on how it takes them to get there though, so agreed that there could be impact on the stock.", "score": 1, "replies": []}]}, {"body": "I’m concerned that in 10 years Tesla will be 1/3 the size of Ford and will have a valuation based upon that.  ", "score": 0, "replies": [{"body": "This is similar to the 'Now that they have profits they are measured by P/E' argument. It's wrong. Everything is measured by the sum of future profits and any other metric is a proxy with flaws, including current revenue. ", "score": 5, "replies": [{"body": "I'm personally more concerned about it as an issue in tandem with recession.\n\n&#x200B;\n\nSomething that causes the market as a whole to say \"Okay, all of these valuations have been too high, all of the multiples need to come down\"\n\nwould hurt a lot, even when the P/E thing alone doesn't actually matter.\n\n&#x200B;\n\nI intend to have liquid cash if this happens, so I would see it as a buying opportunity as multiples should almost inevitably improve again, but it is a short term risk during a recession.", "score": 2, "replies": []}]}]}, {"body": "A precipitous decline in US M3 demand before the 35k model. I was just looking at Troy's spreadsheet. Right now, there were only 5 configurations made in the US in December. This is because the 7500 credit is no longer guaranteed. ", "score": -1, "replies": [{"body": "That has more to do with lowered participation with the spreadsheet I think. ", "score": 10, "replies": []}, {"body": "Problem with those spreadsheets is that only fans care and after 100k cars there are less and less of them without one.", "score": 5, "replies": [{"body": "Could be. But there was a stark reduction of configurers in December vs. November", "score": 2, "replies": [{"body": "Who knows why.\n\nUntil the official numbers come out in 3 weeks your guess is as good as mine.", "score": 1, "replies": []}, {"body": "I also think that if a December sale is via matching inventory, the buyer is less likely to update the Spreadsheet.\n\nThe got straight from having nothing to having a car, there is lots to sort out, it is a busy time of the year and they are probably out enjoying their car.\n\nSee my post below, I sort agree that a slight drop off in demand might be possible, but in the grand scheme of things it is only a blip.", "score": 1, "replies": []}]}]}, {"body": ">I was just looking at Troy's spreadsheet. Right now, there were only 5 configurations made in the US in December. This is because the 7500 credit is no longer guaranteed.\n\nI think that is why Tesla wisely stated that they will refund deposits if cars can't be delivered by the end of the year.\n\nBut my impression is that they may have an inventory of LR AWD on hand in many locations and MR production is going well. Hence, production, shipping and delivery are finally sorted, but residual US demand for the available models might be slightly lower than anticipated.\n\nIMO this is a temp thing Q4 deliveries might be slightly lower than ideal, but still good overall.\n\nStarting Q1 2019 they can do the following:-\n\n* Produce cars for Europe (Jan - Mid-feb)\n* Produce different trims for the US including lower priced options.\n* Start Model 3 US leasing for higher spec cars.\n\nI would caution when they are going all out to maximise deliveries, it is hard to know the difference between a motivated delivery push, and a genuine stockpile of inventory.\n\nI also think that to some extent Tesla expected most new orders in December to be via matching inventory cars. Those that have ordered earlier might be still in the pipeline for for December delivery. Any new US orders in Dec 18 - Jan 19 are either matching inventory or looking at a March delivery.\n\nI'm  not at all worried about on going demand for Model 3 especially when they can produce the 35K version.\n\nIMO it is a matter of when not if, but it might not be easy and it may take a bit longer than initially expected.", "score": 2, "replies": [{"body": ">Produce different trims for the US including lower priced options.\n\nI almost always forget that they can/will introduce the LR/MR without the PUP. Some people just prefer cloth seats and are still waiting to see that, even if they end up going with PUP in the end.", "score": 1, "replies": []}, {"body": "> I'm not at all worried about on going demand for Model 3 especially when they can produce the 35K version.\n\nRight now they are selling a version that actually costs people $38,500.  And it is a much better car than the $35k version will be, since it has a bigger battery and premium trim.  So shouldn't we be seeing peak demand in the US right now?\n\n", "score": 0, "replies": [{"body": "Not everyone can get the full tax credit or has the budget for the initial purchase.\nWe don't really know what the peak US demand will be or how many reservation holders have not yet ordered.\nTo keep selling well in the US they will need to slowly grow brand awareness converting friends, family and colleges of the original purchasers. There is some evidence that is happening.\nEuropean demand should be solid for sometime, a slight drop off in US demand after the expiry of the full credit isn't a major surprise.", "score": 2, "replies": []}]}]}]}]}
