{"title": "Airlins Stonks, specifically $AAL", "selftext": " \n\ni think that the airline stonks have a lot more room to go down from here but when do they become a buy? my PT i have drawn out from a fundamental prespective for $AAL is $11. It sounds crazy I know but they will trade at a 2X FE at $11 and I dont think that they can go down much further from there, I dont see airlines going under in this scenario, even if we get worse from here. However, I believe that they have another 15-20% room to run to the downside, even though they have been analed the last 2 weeks.\n\nTLDR: I think airlines will eventually be a buy, but I dont know when, im curious about the opinion of this sub.", "id": "fbie32", "created_utc": 1583007468.0, "score": 36, "upvote_ratio": 0.86, "num_comments": 72, "comments": [{"body": "I have puts on all travel including expedia, up 13k last week, sold alot on friday miday but i held about 15k in aal,ual,luv,rcl,ccl and exp. Trump raised travel warning today to level 4 .. next is restrictions on specific state travel", "score": 19, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I have one DAL buying more AAL Monday", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Not sure. Hard to say at this point, but nevertheless it’s a great buying opportunity. I’m mostly cash at this point, other then PUTs in DAL, UBeR and EWW", "score": 3, "replies": []}]}]}]}]}, {"body": "Berkshire owns AAL, no way it hits $11 if they start loading up the truck on the way down.", "score": 13, "replies": [{"body": "Berkshire also owns $KHC that seems to be working out well! LOL", "score": 9, "replies": [{"body": "One of them is a bad business and one of them isn't.", "score": 5, "replies": [{"body": "Wait which is the good one?", "score": 1, "replies": []}, {"body": "if they ban travel between US and EU what happens to AAL, what price would they be trading at", "score": 1, "replies": [{"body": "Where in Europe and for how long?", "score": 3, "replies": [{"body": "lets say in 2 weeks they put an indeffinate ban until further notice, france cases doubled overnight and italy isnt slowing down, more cases in US and first death, doesnt seem to be letting up any time soon", "score": 1, "replies": [{"body": "Sure, if all travel from the US to Europe is cancelled AAL might hit $11 but if it gets that bad you will be pissed that you were thinking in terms of a single airline.", "score": 2, "replies": [{"body": "What would you recommend in that case then?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "They own about 10%", "score": 1, "replies": []}]}, {"body": "Opinion is they have already taken such a beating and that you’re trying to squeeze the last bit of juice out of that lemon. Find something that has more potential and probably less risky during these very unpredictable times.", "score": 36, "replies": [{"body": "I have been short the last 3 weeks on them and made a killing, however, I think they will eventually become long term investments, full disclosure i do not have a position in them at this time", "score": 9, "replies": [{"body": "You did well! Now find another opportunity. I suggest sticking to ETFs right now, whether you long, short, call, or put. No one has any clue what's going to happen these next few weeks.", "score": 6, "replies": [{"body": "i have been a bear the last few months but in all honesty I hope the market stabilizes because another 08 would really throw this country for a loop. If we go down 20-25% from highs next week it might be a good opp to buy", "score": 4, "replies": [{"body": "No one can pick the bottom, just like nobody can pick the top. It could already be the good opportunity to buy, you just never know.\n\nSince most of us can agree that one year from now things should be back to normal, it doesn't seem crazy to just start buying in small amounts over time starting now, and place stop losses in the event of any more crashes.", "score": 8, "replies": [{"body": "The top was 100% called on this sub with unerringly accurate timing: someone posting Pokimane’s tweet which marked the tippity top", "score": 2, "replies": [{"body": "Ever heard of confirmation bias?", "score": 0, "replies": [{"body": "Ok boomer", "score": 0, "replies": []}]}]}, {"body": "Go to r/investing", "score": 1, "replies": []}]}, {"body": "If we drop Monday, I’m buying leap calls for big name companies", "score": 1, "replies": [{"body": "Pay attention to volatility, leaps might come crashing down if IV is high and then things stabilize.", "score": 3, "replies": []}]}]}]}]}, {"body": "Did you see AAL’s debt? It’s laughable.", "score": 2, "replies": []}, {"body": "I've been looking and not finding those cheap surprise puts!", "score": 1, "replies": [{"body": "I’m wondering if the spread in the popularity of options is affecting marketplace pricing and volatility.", "score": 1, "replies": [{"body": "Could well be the case!", "score": 1, "replies": []}]}]}]}, {"body": "Would not suggest buying and holding anything over night until bottoming support is found.\n\n&#x200B;\n\nI am holding a vertical spread of puts on $AAL and this will for sure print. Check my last couple comments.   \n\n\nShits sad but we knew when the CDC said we should prepare last week.", "score": 10, "replies": [{"body": "is there a chance AAL DAL or UAL could go under, I dont think so but last week was fucking nuts", "score": 3, "replies": [{"body": "No. Buffett or someone would buy them before that could ever happen because they’re not retarded and know that airlines are fine long term", "score": 14, "replies": []}, {"body": "Idk about going under but AAL was already heavy in debt coming out of 2019 and were very vulnerable to feel the weight of things going on.   \n\n\nI do think they will continue to go down however.", "score": 4, "replies": []}]}]}, {"body": "Completely agree with $11. Tbh, longterm, anything -30% is a buy; i.e, Tesla.", "score": 9, "replies": [{"body": "Tesla isn't even back to pre-wsb jizz levels", "score": 14, "replies": [{"body": "It’s never going back to $200 lol too many people are now on the hype train", "score": 4, "replies": [{"body": "Wrooooong", "score": 1, "replies": [{"body": "Found the put bag holder", "score": 1, "replies": []}]}]}]}]}, {"body": "Cruises fucked. 82 showing symptoms in Baltimore.\n\nhttps://www.baltimoresun.com/health/bs-hs-royal-carribean-flu-20200228-ljm5pew5yfbepowttxgmlnej7i-story.html\n\nCruise lines are showing empty travels with passengers all fleeing \n\nhttps://abcnews.go.com/Health/wireStory/cruise-lines-passengers-scramble-respond-coronavirus-69290531", "score": 8, "replies": []}, {"body": "I might just start buying the stonks and not options on them. Unless I can get a good value on long term ones, which I doubt will happen at this point.", "score": 6, "replies": []}, {"body": "With level 4 restriction it’s only a matter of time before the airline stocks come crashing, give it some time", "score": 5, "replies": [{"body": "where id the bottom for AAL in your opinion>", "score": 1, "replies": [{"body": "If we get into a recession can see it go down to less than 10, but for now I think I can see it go down to 13-16 dollars", "score": 2, "replies": [{"body": "so if we ban travel to and from EU we see sub 10 in your opinion?", "score": 1, "replies": [{"body": "Once travel stops from EU I can see it go down significantly, all the tourists spots are in EU and Asia, no one traveling because of virus fears", "score": 2, "replies": []}, {"body": "So yeah I see sub 10", "score": 1, "replies": [{"body": "i think i would take a huge position sub 10$", "score": 2, "replies": []}]}]}]}]}]}, {"body": "If they ban travel between US states it’s literally free money", "score": 4, "replies": [{"body": "if they start banning travel to italy and other EU countries that is where a majority of revs for AAL and DAL come from, UAL more exposed to Asia", "score": 4, "replies": []}]}, {"body": "Travel stocks have gone green a few days this week. That's absolute BS. Any time these shits are green by 2-3% is probably a decent time to buy.", "score": 6, "replies": [{"body": "Hopefully the cruises that I’m currently bagholding finally give in.", "score": 4, "replies": []}]}, {"body": "$AAL going down for sure!", "score": 3, "replies": []}, {"body": "My 3/20 $18 P have had a nice run so far. Wondering how long to hold on to them before being satisfied with the profit.", "score": 3, "replies": [{"body": "seriously same here..", "score": 1, "replies": []}, {"body": "Right there with you. I'm holding until there seems to be a slowdown on tendies", "score": 1, "replies": []}]}, {"body": "I agree airlines are going down more. But I'm looking at DAL. Their hub is Atlanta, which happens to be the busiest airport in the world.", "score": 2, "replies": [{"body": "You.... You know that the airport is the busiest airport in the world because of delta right? It's not like it just so happens that it's a big place for them. They make that airport what it is", "score": 1, "replies": []}]}, {"body": "AAL is having debt problems and if like 30-50% passengers cancel their flight, is may led to cash shortage and potential bankruptcy.", "score": 2, "replies": [{"body": "Say if AAL is delisted, what happens to the option?", "score": 2, "replies": []}]}, {"body": "Dont forget other travel/tourism securities\n\nEasy profit shorting puts on $HST $CZR this past week with little capital", "score": 3, "replies": [{"body": "Open interest in those is very low. Hmm.", "score": 1, "replies": [{"body": "CZR 6/19 $10 puts have 3183 open interest\n\nHST is low but 3/20 or 4/17 is far out it will go up", "score": 1, "replies": [{"body": "Good point. Cheers!", "score": 1, "replies": []}, {"body": "heads up CZR is in agreement to get acquired by ERI which is why there's a bottom on their price.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you in 3 hours on [**2020-02-29 23:25:58 UTC**](http://www.wolframalpha.com/input/?i=2020-02-29%2023:25:58%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fbie32/airlins_stonks_specifically_aal/fj4guub/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffbie32%2Fairlins_stonks_specifically_aal%2Ffj4guub%2F%5D%0A%0ARemindMe%21%202020-02-29%2023%3A25%3A58%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fbie32)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "What are you basing this price target off of? I have just started looking into airline stocks to try to make a long term (Jan 2022 or beyond) call play once the market settles down, whether in a month or a year.", "score": 1, "replies": [{"body": "Looking at forward earnings estimates, there is no TA because they have never been this low it’s only speculation", "score": 1, "replies": [{"body": "Oh yeah I don’t believe in TA for the most part, was just wondering what assumptions you were making and why. I’m trying to look into building a diversified portfolio of long term calls for the recovery whether it’s later this year or next year.", "score": 2, "replies": []}]}]}, {"body": "Never go long on airlines.\n\nhttps://philip.greenspun.com/flying/unions-and-airlines", "score": 1, "replies": []}]}
