{"title": "Sony (SNE) , Undervalued right now?", "selftext": "-They are trading at a P/E of 14.57\n\n- The release of PS5 is coming soon\n\n- High demand for its image processors\n\n-Their image processors are superior to their competions\n\n-Price target: 106.69\n\n-Videogame industry is growing fast\n\n\nDownsides\n\n-Warning for potential downturn in manufacturing in China\n\n-Nitendo beat them in sales last year, the Switch was a bigger success than initially expected.\n\n-Their biggest competitor is Microsoft, but has been unable to beat them in the game console industry", "id": "f5t49r", "created_utc": 1582038408.0, "score": 51, "upvote_ratio": 0.9, "num_comments": 75, "comments": [{"body": "Slight crash today because of the Japan recession news which could effect the company long term? Saying that I am long on it and hoping for the best. I agree on the stats though they all point towards progress and hopefully a bull marker on it", "score": 19, "replies": [{"body": "Japan recession?", "score": 3, "replies": [{"body": "Yep - read the news, it's everywhere: \n\n[https://www.theguardian.com/business/2020/feb/17/japan-economy-heading-for-recession-and-germany-wobbles](https://www.theguardian.com/business/2020/feb/17/japan-economy-heading-for-recession-and-germany-wobbles)", "score": 11, "replies": [{"body": "Oof", "score": 5, "replies": []}]}, {"body": "Around 8-10% of their sales in 2018 were in Japan. So that is something to consider tough, but most of their sales happen in the US and Europe and they look strong tough. I don't think it would make a significant difference.", "score": 6, "replies": []}, {"body": ">coming any time. Unlike US it never came out of the Great Recession. China came out like a bandit. US is doing fine.", "score": 1, "replies": []}]}]}, {"body": "SNE is very very undervalued. \nBUT japan is in trouble. That -6% gdp # was insane. And the virus is spreading there", "score": 4, "replies": []}, {"body": "Reasonably valued. May look undervalued in relation to a pumped up market, but really just reasonable. I've held some for about 2 years and its been fine but not amazing and I would look for it to stay that way.", "score": 6, "replies": [{"body": "Valuations change over time s&p 500 now has a 25.36 P/E ratio it's direct competitors in the industry are MSFT with a P/E of 32,61 (not up for comparison) and NTDOY 31,19. Seeing these valuations as the new standard is a reason to suggest that SNE undervalued. The argument that this isn't undervalued, but the rest of the market is too high is just invalid. The growth prospects and fundamentals look strong and I don't see any major downsides, except possible problems regarding China and higher that expected manufacturing costs.", "score": 2, "replies": [{"body": "Seeing those valuations as the \"new standard\" is a nice way to lose 30 percent when money inevitably gets less cheap and we go closer to the traditional standard.\n\nI like Sony, I have owned Sony for a couple years, but not because it is undervalued. Just fairly valued. I also don't think comparisons with MSFT or Nintendo are apt because those three rely on such different sources for their revenue that they have a lot less in common than, lets say, Apple and Samsung.", "score": 1, "replies": []}, {"body": "Here is some advice, avoid stocks related to video games if you play them. It causes a huge loss of objectivity and a distorted view of the company.\n\nMSFT is not comparable, nor is NTDOY.\n\nMSFT is a software and cloud services company. XBox is not a meaningful portion of their business.\n\nSNE is less than a 3rd a video game company, so not really comparable to NTDOY. \n\nSony’s mfg segment has razor thin margins and it has lost market share in many of its divisions. It lost market share in mobile, imaging devices, music, and other areas. It has huge exposure to China.\n\nIt is also a financial company and that part of the business is very tied to the jp economy. \n\nI am for the company, but I don’t think it is undervalued. I would watch it and maybe buy.", "score": 1, "replies": [{"body": "I literally mentioned that MSFT wasn't up for comparison, should have said that NTDOY wasn't really comparable either. Sony has low margins or even make losses on consoles, because of the recurring revues it creates, sales are what matters. In the event of a recession people will buy less luxury products, but consoles are a substitute for a gaming laptop/pc so it kind of evens out. Consoles actually experienced one of the fastest periods of growth during the last recession, but cumulative sale numbers for console depend a lot on the release dates from consoles. \n\nAs for their \"declining business\"\n\n- Mobile was always a losing a game for them\n\n- Music has seen 40% growth in 2018 YOY\n\n- Game and network services operating income has almost doubled in 2018 YOY.\n\n- Sony’s Imaging Products group latest results – the nine months from March – December  2018, show sales up by 23 percent and operating profit up 14 percent compared to 2017. Sony overtook Canon as market leader.\n\n- Operating revenue for Sony has been growing for at least the past decade.\n\n- The Sony Financial group is quite diversified and its products and services include life insurance, non-life insurance, banking and nursing care. Banking is expected to decline in Japan, but only includes 3% of its revenues. Life insurance businesses are pretty recession proof.", "score": 2, "replies": []}]}]}]}, {"body": "I know it’s nearly negligible, but their music business has been growing quite nicely too!", "score": 2, "replies": []}, {"body": "[https://finance.yahoo.com/news/sony-struggling-playstation-5-price-035030794.html](https://finance.yahoo.com/news/sony-struggling-playstation-5-price-035030794.html) \n\n&#x200B;\n\nI'm not sure it undervalued. seems like they may be having issues regarding the expected release of the PS5", "score": 2, "replies": [{"body": "I don't think the DRAM shortage is a problem long term. Im not sure what suppliers Microsoft have but the next Xbox is very similar to PS5 so the pricing may be very similar and they may have a shortage too but not talking about it. From what I can understand at $450 to make they are not sure whether to sell at a loss at $400-450 like the PS3 to sell more units or $500 for profit like the PS4. But at the end of both generations they had sold more units than the Xbox. Even if they have a slow start the only advantage I see from the Xbox in the future is it's game pass and possible cloud gaming service but seeing how Google Stadia failed it may be too early for that. The PS5 has more developer support and higher quality exclusives. Plus Japan has a very hardcore gaming/anime audience compared to USA unless the recession gets really bad I would still expect decent sales.", "score": 1, "replies": [{"body": "You think buying in now is a good idea? I’ve been mulling it over and just not sure", "score": 1, "replies": [{"body": "If you haven't bought yet I would wait. I believe it will drop a bit more due to the virus and recession news but I expect by the end of the year it should be going back up once the PS5 launches and assuming the outbreak ends this summer. The SARS outbreak took 4 months to go away and this seems to spread faster. It's been about 2 months since it started so I think by end of the summer it should go away. But that is assuming none of these countries drop the ball with their quarantine procedures.", "score": 1, "replies": [{"body": "Hype created around the PS5 is likely to push the price higher before the end of the year, and after a run-up even possibly decline in price after the launch, I think this is more likely to happen. Regarding Coronovirus we have to see what will happen, it is clear that the impact on the economy, because of COVID-19 isn't reflected in the stock market.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nintendo beating them in sales last year means nothing, PlayStation hasn’t released a new gaming system since 2016. Nintendo released the switch in 2017, switch lite in 2019, and are still selling the 3DS/2DS very well. Ofc PlayStation sales will be lower the year before a huge console is supposed to come out. Sales being lower last year if anything should help prove your point of it being undervalued right now since they should skyrocket upon the release of PS4 baring any mishaps.", "score": 2, "replies": [{"body": "I doubt it will skyrocket upon the release of PS5** \n\nThey generally don't profit a ton from consoles so much as games. I think things will just keep going about at the rate they are now. The stock may rise, but I doubt there's a skyrocket in the future of Sony. People have been expecting that since PS2 and that was the last time their stock skyrocketed. 3 Playstations later, what exactly do you think will be different?", "score": 2, "replies": []}]}, {"body": "So when is the best time to buy? I feel like it can still go down a few more bucks before jumping in", "score": 1, "replies": [{"body": "If it is down tomorrow I’m putting my life savings on calls", "score": 3, "replies": [{"body": "I won't recommend it. The impact of Coronavirus is still uncertain for Sony and the same goes for the overall market, Way too big of a risk for your life savings. I usually tell people that they shouldn't try to time the market, but with the market going up, while 10% of the world is in quarantine, in the part of the world that provides 14% of the GDP of the world it would be wise to avoid such plays now more than ever. If you want some risk it much safer to buy gold futures or options for a stock like NEM , very solid player in the gold, copper, silver  mining industry, I diversified after I realized the downturns the Coronavirus could potentially cause especially in this stage of the economic cycle and it has done me good.", "score": 2, "replies": []}, {"body": "Yeah honestly seems like a really good buy but sucks I got my money tied up in other calls lol. But hopefully thursday or Friday I can clear up some cash to go all in", "score": 1, "replies": []}]}, {"body": "Averaging down, is the way to go. Buy the dips", "score": 2, "replies": []}]}, {"body": "damn, i paid $6 more per share. I'm gonna hold for now but should i consider buying more shares considering the price drop? \n\nEDIT: This is a slight long-term investment for me, considering Sony's VR market share, but they have big 'cloud' streaming competition ahead of them via Google, Amazon and Microsoft.", "score": 1, "replies": [{"body": "You could consider averaging down, the bottom shouldn't be much lower than were we are right now. I think a lot of investors will see the current price as a buying opportunity, there are a lot of analysts on this stock and most of them have a strong buy rating.", "score": 1, "replies": []}]}, {"body": "Yeah", "score": 1, "replies": []}, {"body": "They aren't really bringing anything new to the table.  They are essentially good computers, with less functionality, and a smaller market. The new tech isn't really something too useful either. The raytracing buzzword I keep hearing sounds cool but it requires implementation from the actual game companies/devs to work. This is great for AAA studios, but most people want to focus on other dev aspects that aren't fancier light/shadows.  I dont think people who don't know games or machines will hear that the new ps5's gpu can compete with a 2080 and say \"wow now I'm getting a ps5\".", "score": 1, "replies": []}, {"body": "Don't forget about Google Stadia and other upcoming game streaming platform (i.e. Steam, NVIDIA, etc.) that will increase competition in the gaming sector. Gaming hardware (i.e. console) might be outdated soon if streaming services offer similar or better gaming experiences.", "score": 1, "replies": [{"body": "Google stadia was an absolute disaster, streaming games might be the future and it might have been a precursor for it, but it has some major flaws. Steam doesn't make new consoles and neither is Nvidia. Nvidia shield isn't competition for Playstation", "score": 5, "replies": [{"body": "That's the point. Nvidia and Steam are likely to increase investment in streaming platform in the coming years. That said, Sony also has PSN which could be a major player in the streaming services industry. Not sure if PS5 will have that much of an impact. Remember that PS3 was not the success everyone expected after that of the PS2.", "score": 1, "replies": [{"body": "What I meant is that Steam and Nvidia are both focused on PC and not on gaming consoles, it's a different market, making it cheaper and more accessible to game on PC even with lower specs might indeed have an adverse affect on PS4 sales, but gaming consoles aren't going away anytime soon and PS, Xbox, Nitendo are the only worthy players in that field right now and it looks like it is gonna stay that way for now.", "score": 1, "replies": []}]}]}, {"body": "That’s going to be a long time in the making. Not many have the best internet service for game streaming.", "score": 1, "replies": [{"body": "Never underestimate the speed at which technology change happen. Mind that 10 years ago, self-driving car were still a fantasy. 100 years ago, we barely had electricity in every homes. 5G is around the corner, and with it significant shift in technology, including broadband internet access throughout North America.", "score": 1, "replies": [{"body": "5G has a long way to go to become truly viable, especially mmwave.", "score": 1, "replies": []}]}]}]}, {"body": "The price point for the ps5 will be a little high when it releases because of the high cost to produce them. I'm guessing $600, so that may affect the immediate release sales negatively.", "score": 0, "replies": [{"body": "No way they are going to sell the ps5 for $600. They don't want a repeat that was the PS3. Cost of bill and materials is around $450 I read. I predict they will sell it for $500.", "score": 7, "replies": []}, {"body": "Pretty sure it’s been confirmed at 500$, XBOX at 450$", "score": 3, "replies": [{"body": "It costs $450 to manufacture, you think they will sell it with only a $50 margin?\n\nhttps://www.polygon.com/2020/2/14/21137615/ps5-cost-price-point-playstation-5", "score": 2, "replies": [{"body": "50$ a console for 100 million consoles is 5 billion$ in profit. Add in extra controllers which are produced cheaply, monthly/yearly online cost, games they produce. They are more than happy to take 50$ a console.", "score": 9, "replies": []}, {"body": "IIRC they sold PS4 for an even smaller margin. PS3s were sold for losses.", "score": 7, "replies": [{"body": "These are NOT attributes I like in businesses I invest in lol", "score": -1, "replies": [{"body": "They don't need to make money selling the console itself..... Getting people to purchase their console is most important because it locks in the purchaser's business for the next \\~5 years or however long the console's lifespan lasts. That means recurring monthly revenue between $5-10 in PS+, digital game sales, MTX, all accessories (controllers, headsets, other peripherals), and I'm sure I'm missing a good amount. The console is just a means of attracting sticky customers.", "score": 12, "replies": [{"body": "Exactly, the console is merely a gateway to the consumer's wallet.", "score": 7, "replies": [{"body": "Well said. Way more concise", "score": 4, "replies": []}]}]}, {"body": "Kinda like selling iPhones in an attempt to make money off of iCloud, Apple Music, App Store, maps, etc. This is a very common strategy, and with video game consoles has been the case for quite a while... they sell the console at a loss to make money off the related services.", "score": 1, "replies": []}]}]}, {"body": "Is it 450 parts labour and market or without marketing because that can be a huge cost. The parts of an iphone x cost 370 and it sold for 999 apple didnt make 629 profit there can be a huge amount of costs that aren't parts and labour", "score": 1, "replies": []}]}]}, {"body": "I know a ridiculous amount of people who would buy those for 800+. According to Bloomberg the price will be at 500. Earlier rumours said 599. I expect sales to be strong, at these prices. People have been waiting for this a long time, and the confirmed PS5 features are intriguing, here is a article about it: [Link](https://www.eurogamer.net/articles/ps5-specs-features-ssd-ray-tracing-cpu-gpu-6300)", "score": 2, "replies": []}]}, {"body": "Sony is not only walking a thin line with the PS5's release date due to China's Coronavirus (like other companies) you should know console manufacturers outside of Nintendo typically do not make profits with their consoles at launch. They sell at a loss to lower prices and entice more users, whom they hope to earn subtantial revenue from software sales and monthly/yearly subscriptions. Trying to buy into Sony now as the PS4 nears the end of its life and the PS5 begins its own isn't something I'd recommend, especially with aforementioned virus issue. Next year would be a much better date, although there's a chance Sony will simply delay the release of its new console.", "score": 0, "replies": [{"body": "There is no way that Sony won't release it this year. Worst case scenario is that they will have a limited inventory and that they have to disappoint of lot people at the start. Sony is gonna start building hype for the new console right now and people buy especially in times when future prospects are set high. Both their image processors and their console sales are likely to boom this year. I know that they are prepared to sell consoles at a loss, because of the recurrent revenue every console sale creates. It is likely to be the first sale numbers that could push the stock to new highs.", "score": 3, "replies": [{"body": "Why do you think there's no way they won't release it this year? It's already being reported that the [virus might delay both](https://www.businessinsider.com/playstation-5-xbox-series-x-delay-wuhan-coronavirus-2020-2?r=US&IR=T), the PS5 and Series X. In fact, Nintendo already just flat-out announced delays of the Switch already due to the virus.\n\n> It is likely to be the first sale numbers that could push the stock to new highs.\n\nWhy do you think so? Have first-sale numbers ever pushed any stock to new heights? Numbers are usually very predictable, according to most VG Analysts, and there's absolutely no reason why that wouldnt' be priced in already. This is also doubly weird to hear because you claimed you already know that console manufacturers sell at a loss but still contend that simply first sale numbers will push Sony's stock anyway. What's you're reasoning for this?", "score": 1, "replies": [{"body": "It historically does so, I own Disney and if they give us some big numbers (like how popular a movie or subscription is) it gives the stock a boost. look and the chart and the release dates of new consoles from Sony and compare it with the graph. a lot of media coverage will attract retail investors. I don't exactly meant new heights, but more of an minor upwards boost, because of the hype around the console(in this case it will likely be a new high tough). I expect the sale numbers of the PS5 to be off the charts and people will buy more of the stock when that happens. I can totally see how people will sleep in front of the store to get a PS5. If they delay the console and Microsoft doesn't, people will substitute the new Xbox for the PS5. Sony can't have that, it also has been announced that it will get released during the holidays and they got fans waiting for it and they need the holiday sales this year. Otherwise it will be a big disappointment for shareholders. Only way I see that Sony delays their console is if Microsoft does it too. Sony did manufacture PS4s in Japan  for Europe, It is unclear to me if they still do that, but maybe they can get that manufacturing site going for the PS5.\n\n \"The operation schedules for our facilities in China follow the recommendations of the local governments, and we have not received any requests from our customers on the need to resume production earlier\" \n\nA statement from Foxconn their current manufacturer points out that they are working to get manufacturing going and that there are no requests to hurry up. So either Sony gave up already or they have a something else going on.", "score": 1, "replies": [{"body": "You should not trust that too much tough my main point is that they are undervalued right now if you look at up- and down sides", "score": 1, "replies": [{"body": "Interesting statement. I do feel SNE will have the chance for massive upsides later on in the future but I think I'm just a bit more conservative than you on the timeline. Best of luck with it!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The PS5 is actually playing from behind. Similar to the PS3/360 era position for SNE. You have a convergence of software and hardware from MS that nullifies the typical studio advantage that PS has had on top of increased expenditures.", "score": -1, "replies": [{"body": "\"Is actually playing from behind\"  \nWhat do you mean? \n\nPS3 beat Xbox360 in sales kind of breaks your story", "score": 1, "replies": [{"body": "Playing from behind as in the last 3 console winners had better hardware. PS2, Xbox 360, PS4. \n\nIf you ignore context sure. PS3 didn't overtake the 360 until late cycle on an extremely long cycle. It took them 10 years. In a normal situation a refresh would have come forcing sony to refresh thus never gaining the sales lead.", "score": 1, "replies": [{"body": "The PS3 launched one year after the Xbox launched, wich is the main reason why it took them some time to overtake them in sales. We yet have to get some confirmation on the hardware, but it will be better that the past than the console you named", "score": 1, "replies": [{"body": "Launching a year late because of an overly complicated design is the fault of the console maker. It still leaves them as the bag holder.\n\nWe have plenty of information on specs.", "score": 0, "replies": []}]}]}]}]}, {"body": "Your bullish argument is primarily around the consoles so.. Microsoft handily beat them in sales in the previous (PS3,Xbox360) generation, and Sony is doing great this generation but as you said, Nintendo is now beating them with the Switch. Sony’s console dominance is hardly as strong as you think", "score": -7, "replies": [{"body": "Ps3 beat xbox 360 in sales, by a few percent. The Switch beat Playstation last year primarily because it is fairly new compared to PS4. PS5 is very likely to change this starting from its release during the holidays this year. Switch was a better success than I expected tough. Nintendo did a good job, but they aren't releasing a new console this year.", "score": 4, "replies": []}]}, {"body": "Sony will loose the next generation of gaming consoles..", "score": -7, "replies": [{"body": "Nitendo doesn't release anything new this year and is gonna continue pushing the switch and different editions of it. What we now about the new Xbox is that it is gonna have backwards compatibility, so Xbox is likely to retain a lot of the current Xbox owners, PS5 is likely to have this feature too. The other features doesn't seem very discerning compared to what Sony is gonna bring us. Microsoft hasn't said anything about VR, and PS5 is gonna have PSVR. Renowned Game informer Anrew Reiner said PlayStation 5 is stronger than the next Xbox. From what it looks like PS5 is going to be the overall better console, although we miss some key factors from both consoles.", "score": 2, "replies": []}]}, {"body": "SNE has been priced for PS5 since PS4 came out.", "score": -2, "replies": [{"body": "Right.... You are taking the everything is priced-in theory a little too far", "score": 1, "replies": [{"body": "SNE has been priced for PS5 since PS3 came out.", "score": 1, "replies": []}]}]}, {"body": "My very conservative entry price target on SNE is $52 but I could see myself possibly entering at $58 if or when it ever gets to that point.", "score": -2, "replies": [{"body": "i dont know if it will get that low again i bought in at about 58 in October because i thought i was way undervalued. the imagine sensor tech they have is going be very big for them the next few years. even with the corna virus and some downturn in china it wont dip out of the 60's unless things keep alot worse but then the whole market will be tanking to. i am set to buy in more at 63", "score": 1, "replies": [{"body": "It was that low just a few months ago. Look at their history. Can you tell when PS3 and PS4 came out? What makes you think this one will be any different?", "score": 1, "replies": [{"body": "Because while the play station is a big part of who they are they have expanded and have other streams and revenue and technology that will help them grow over the next decade.", "score": 1, "replies": [{"body": "I love how you think Sony has expanded past Playstation, as if they weren't a company before Playstation lol", "score": 0, "replies": [{"body": "I know they were a company before PlayStation. My point that you completely missed was that there revenue has been largely dependent on the playstation in the past but that is changing. If your gonna try to be an arrogant smart ass try to be a little better at it", "score": 1, "replies": [{"body": "What's crazy is what you think I'm not taking into consideration but since you feel the same I'm going to say kisses I love you good luck in everything you do <3", "score": 1, "replies": []}]}]}]}]}]}]}]}
