{"title": "Dow set to drop about 400 points at the open: SPY Puts a safe play for this week?", "selftext": "https://www.cnbc.com/2020/02/24/us-futures-coronavirus-outbreak.html\n\nThings are looking rough.", "id": "f8lvde", "created_utc": 1582518799.0, "score": 94, "upvote_ratio": 0.89, "num_comments": 75, "comments": [{"body": "why does cnbc put things in absolute points\n\nI dont fucking care, give me the % change", "score": 80, "replies": [{"body": "-1% yesterday is more than -1% today, but points are always points.\n\n/s", "score": 23, "replies": [{"body": "What about 400 points from 10 years ago", "score": 9, "replies": [{"body": "Points. Are. Always. Points.\n\nI'll take my job at cnbc as resisdent millennial/meme advisor now.", "score": 17, "replies": [{"body": "Don't bother.  That guy doesn't even point.", "score": 5, "replies": [{"body": "I got points last Friday. Cya later virgins.", "score": 1, "replies": []}]}]}]}, {"body": "And 1 doge...", "score": 1, "replies": []}]}, {"body": "Seriously.\n\nSomeone also explain basis points to me.  I just saw someone say 200 bps.  At that point why not just 2%?", "score": 5, "replies": [{"body": "Basis points are more useful when modifying interest rates. If you have a 2% savings yield that drops 1% , you have a 1.98% savings yield. If it drops 100 basis points, you have a 1% savings yield.", "score": 15, "replies": []}, {"body": "That's 200 beats per second - the heart rate of investors after seeing the drop", "score": 3, "replies": []}, {"body": "Seems you understand fine, and no reason.", "score": -4, "replies": []}]}, {"body": "I usually just use the CNBC app in this case. They show you both on the main page. \n\n\nhttps://imgur.com/gallery/eW7RZNY", "score": 1, "replies": []}, {"body": "Totally agree with you.  It's way more dramatic to say \"1,000\" points.", "score": 1, "replies": []}]}, {"body": "Good play Thursday. Not so good monday", "score": 115, "replies": [{"body": "Things might still slide down further...\n\n\nOr, it might rubber-band rebound after the sell-off Monday AM.", "score": 30, "replies": [{"body": "I’d watch the IV on any puts before buying", "score": 21, "replies": [{"body": "What’s a good place to check the IV before buying?", "score": 3, "replies": [{"body": "[Here](https://www.ivolatility.com/options.j?ticker=spy&R=1). Just compare 52 week high and low with current Implied volatility.", "score": 10, "replies": [{"body": "No don't do that. Highs and lows don't mean a whole lot for IV unless the high or low is *happening right now*. You want to compare it to the average over some amount of time, usually 30 day or yearly, and/or compare it to realized vol. If you have one day in the last 52 weeks that something ridiculous happened it'll make your 52 week high look way inflated and make you think that current levels are great, when in fact they might be elevated relative to the average. \n\nFor example current IV is ~15%. Looking at the highs and lows on your link, that looks like a hell of a deal with the high being ~23%. But the average IV of SPY has been between ~9-12% for the last few years so by comparison it's actually expensive now.", "score": 5, "replies": [{"body": "Thank you for pointing this out. Probably saved me a fuck up. Where did you get the average of spy 9-12% number? I'm asking for science of course.", "score": 1, "replies": [{"body": "Just a guesstimate based on the last few years, I've been trading in and out of SPY puts/calls pretty consistently so I usually keep an eye on it--makes it much more palatable to always be long options. Keep in mind the last few years are kind of an anomaly in their own right because we had an [entire year of like <10%](https://www.reddit.com/r/finance/comments/7wgqlm/this_tiny_hedge_fund_just_made_8600_on_a_vix_bet/du0bkhf/) (2017 I think?). Lots of good info on volatility in [this paper](https://static1.squarespace.com/static/5581f17ee4b01f59c2b1513a/t/59e8a9b0e9bfdfb287faa3d2/1508420022032/Artemis_Volatility+and+the+Alchemy+of+Risk_2017.pdf).", "score": 1, "replies": []}]}]}, {"body": "This is sweet", "score": 1, "replies": []}]}]}, {"body": "IV wont update til mon at open", "score": -1, "replies": [{"body": "VIX already updated. Calls are 300% more to buy than this time last week", "score": 7, "replies": []}]}]}, {"body": "So it could go up or could go down? Interesting.", "score": 37, "replies": [{"body": "One things for sure it will definitely go right", "score": 32, "replies": [{"body": "Only for the chumps without a time machine.", "score": 1, "replies": []}]}, {"body": "Possibly sideways too!", "score": 3, "replies": []}]}]}, {"body": "Why Thursday and not Monday?", "score": 3, "replies": [{"body": "He’s saying you missed the move.", "score": 29, "replies": [{"body": "While a great play was last thursday, I think if you buy in on this mass dip, you'll be gaining all back next week.  So its a smart idea to start buying the dip, and I'd do it right now since its near bottom.", "score": 1, "replies": [{"body": "Or, more bad Corona virus news comes out and it continues to fall. Some people will guess right and some will guess wrong. Then there will confirmation bias going on for the ones that guessed right. I want to make a play too, but do we really know if this will be a bounce back rather than a continued drop at this point?", "score": 2, "replies": [{"body": "Well, the WHO and CDC already mapped the stupid virus, so it'll be a couple of months at the most when a prototype vaccine will be available.  \n\nI'm not in that business, but I would venture a guess that a deadly pandemic as critical as this one will be pushed to the very front of the line and vaccines will start flowing very quickly.", "score": 1, "replies": []}]}, {"body": "Yea he was asking if puts were a good idea. RSI on the hourly showed a 15 reading this morning.", "score": 1, "replies": []}]}]}, {"body": "He's implying last Thursday.", "score": 3, "replies": []}, {"body": "IV", "score": 1, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "No\n\nIt has something to with FOMOing into trying to catch a falling knife. \n\n\nBuying more puts would be a waste of money, why not buy cheap calls slightly OTM and a exp date a few month out", "score": 2, "replies": []}]}]}, {"body": "I literally thought these exact words.", "score": 1, "replies": []}, {"body": "I didn't end up buying SPY puts and after a ton of work today and yesterday I managed to break even after close lmao. Feel like a fucking idiot for not believing in myself.", "score": 1, "replies": []}]}, {"body": "Too late. I’d say SPY Calls are the better play.", "score": 51, "replies": [{"body": "Yup. I'm looking at one or two months out. They're on sale thanks to China.", "score": 15, "replies": [{"body": "Looking at 45 days out, they're a great bargain, you may be on to something...", "score": 2, "replies": []}, {"body": "You buy the dip, and I’ll take your hard earned money. Thank you, come again!", "score": -2, "replies": []}]}]}, {"body": "when i see posts like this i realize i should probably close my puts from friday.\n\nI'll wait to see what Ad - d is before going in on calls though.", "score": 20, "replies": []}, {"body": "with this drop and rise in IV, I might look into selling puts to get into some stocks :P", "score": 9, "replies": [{"body": "My thoughts too. What stocks are near a buying point? I’m tempted on amd or sq but these stocks dropping another 15-20% in the near term wouldn’t be unrealistic", "score": 1, "replies": [{"body": "I didnt look into those 2 too much, so i can't really comment on the ticker. This event could post as a good buying opportunity though.", "score": 1, "replies": []}]}, {"body": "Options dont open til mon so cang you buy with fri IVs", "score": -6, "replies": [{"body": "It will readjust at open, so you can buy then :p", "score": 1, "replies": []}]}]}, {"body": "Usually when media is telling you the direction of the market, it's already too late to play that direction.\n\nI'm buying calls and puts tomorrow.\n\nBut 75%  month out calls and 25% puts weeklies for leverage.\n\nMarket is still bullish. \n\nAnd this whole corona thing is laughable, I'm shocked its affected the market as much as it has. But it was a perfect storm. AMAZING bull run last year and running, big boys are looking for ways to make money off manipulation.", "score": 28, "replies": [{"body": "I think you're underestimating the Corona effect.  Stop looking at what's officially being reported in the news and look at the actual actions.  I'm not saying bio weapons or this was released on purpose but look at what we know for sure.\n\n1. Quarantined ships not allowed to harbor\n2. 10%+ of world's population on lockdown in China. People literally locked in their homes\n3. CO2 production down 25% because of unused Chinese factories.  Supply chains are going to take a large hit.\n4. Land borders being shut by Chinese allies (Russia and NK)\n5. International flights canceled for weeks.  When is the last time you saw a corporation give up profits like that?\n6. Austria just canceled travel to Italy due to 136 officially reported cases.\n\nThere's more but from that list alone should tell you this isn't just the flu.  There is more going on than what is being officially released.", "score": 46, "replies": [{"body": "While the number of infected is a drop in the bucket, it’s spread rate and incubation period are concerning. It’s causing governments to shut down production and initiate quarantines wherever it spreads. It’s going to get worse now with more countries reporting infections.", "score": 16, "replies": [{"body": "> While the number of infected is a drop in the bucket, it’s spread rate and incubation period are concerning. \n\nThat and the fact that's difficult to detect, because the incubation period is symptom free, while still being contagious.", "score": 5, "replies": []}]}, {"body": "Interesting. So, from all that I have extrapolated that the corona virus is a biological tool to force the world to significantly and immediately slow down carbon emissions to help stop this otherwise unstoppable global climate change that happens because nobody wants to be at a disadvantage for doing more than the next guy.  \n\nI don’t really feel that way, but given people’s mistrust in government and desire to believe conspiracies, I bet many folks do. But those type don’t believe climate change is man-made, so the conspiracy would go deeper. Except those conspiracies are often rooted in the east trying to slow down the west so they can catch up. So much for that.", "score": 1, "replies": []}, {"body": "This is just the beginning. Now that other countries getting infected going to put the whole world economy to a stand still", "score": -3, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": []}, {"body": "I would buy calls for the summer, but historically the summer months are choppy and lack directions.", "score": 2, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "How exactly do you suspect they’re going to “manipulate” things?", "score": 1, "replies": []}]}, {"body": "Holding puts since Tuesday", "score": 3, "replies": []}, {"body": "You made a typo. Should read -800*.", "score": 3, "replies": []}, {"body": "Puts were the safe play LAST week", "score": 2, "replies": []}, {"body": "Before I answer:\n\nHow many do you have?\n\nWhat was your trading plan? \n\nIf you are planning on buying...at what level are you buying,strike,expiration?\n\nNotes:Futures tested major support tonight\n\nthe market is frothy but still holding long term trend lines\n\nwhat economic catalyst are dialed up for this week?", "score": 5, "replies": []}, {"body": "NYSE hasn't even open. Expecting it to drop even more", "score": 1, "replies": []}, {"body": "Prove to me since when in the history puts made money based on expected and announced events. The market still can go down, but puts are expensive right now just to fuck us all in the ass. If you buy 3+ months out, yes it could be a safe play. This week? not so much.", "score": 1, "replies": []}, {"body": "Here is the spy chart from this morning. The algos bought the open and then hit yesterdays algo high. from there they sold the whole morning and you see what has happened since.\n\n[Algos Spy](https://imgur.com/jN3KecN)", "score": 1, "replies": []}, {"body": "Obvy it’s calls this week", "score": 1, "replies": []}, {"body": "Looks like today is going to be a -1k day for Dow. I would say puts but don't go crazy.  Still only a few percentage points from the high.", "score": 1, "replies": []}, {"body": "Safe? My SPX hedges shot up this morning, skew is not reflecting it yet. I would stay away from SPY, it could disconnect from the index if liquidity becomes a problem", "score": -2, "replies": [{"body": "Waiting to see if the bottom is in. Went long off naked value area off the weekly and yielded a great trade.PPT stepped in at open obviously. Keep your stops tight and your head in the game", "score": 1, "replies": [{"body": "Ironflies FTW", "score": 1, "replies": []}]}]}]}
{"title": "Chinese Index is up today WTF", "selftext": "[deleted]", "id": "f8vk53", "created_utc": 1582568640.0, "score": 115, "upvote_ratio": 0.9, "num_comments": 74, "comments": [{"body": "Chinese government is the true permabull", "score": 212, "replies": [{"body": "They ate all the dogs so there were only bulls left", "score": 81, "replies": []}]}, {"body": "Or the chinese Gov is pumping cash into their market trying to make it seem like everything is okay", "score": 149, "replies": [{"body": "Plus selling is considered \"market manipulation\". Popo might show up at your house if you make stonks go the wrong way", "score": 83, "replies": [{"body": "That's the most China thing I've ever heard.", "score": 51, "replies": [{"body": "Dicks go up, shark population goes down. You can’t explain that.", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Always buy calls", "score": 10, "replies": []}, {"body": "Saudi Arabia forced their rich citizens to buy and hold Aramco so the precedent has been set.", "score": 6, "replies": [{"body": "A realistic valuation is 700 billion, but they managed to force it to over a trillion by making their own citizens invest. It's fucked.", "score": 8, "replies": [{"body": "Well, if enough people believe it's worth a trillion then it's worth a trillion. And dead people don't have beliefs.", "score": 5, "replies": []}]}]}, {"body": "They don't have shit to buy, there was p2p lending which was offering 10%+ annual returns but that thing collapsed a few years ago.", "score": 3, "replies": []}]}, {"body": "So you're saying we should make a put enforcement militia?", "score": 6, "replies": []}]}, {"body": "This is the answer", "score": 8, "replies": []}, {"body": "well I'm trading in the wrong market then..", "score": 1, "replies": []}]}, {"body": "Bro the Chinese stock market has insider trading just like we do, they just don’t give a fuck about hiding it over there, only diff", "score": 46, "replies": []}, {"body": "Capital injection from the government my friend", "score": 48, "replies": [{"body": "Cool. We should do that before 3/20.", "score": 28, "replies": [{"body": "Tell daddy Powell to lower the interest rate", "score": 8, "replies": [{"body": "I have an appointment to give him hand jibbers today. Will talk about lowering interest rates.", "score": 7, "replies": []}]}, {"body": "We should do that before 2/28 tbh", "score": 2, "replies": []}]}, {"body": "Hot beef injection", "score": 3, "replies": []}]}, {"body": "Anyone still doubting that thing isn't heavily manipulated?", "score": 33, "replies": [{"body": "[deleted]", "score": -29, "replies": [{"body": "[deleted]", "score": 57, "replies": [{"body": "[deleted]", "score": 12, "replies": []}]}]}]}, {"body": "The Chinese stock market is not a free market. It is the CCP:s playground. Don’t compare it to real markets.", "score": 13, "replies": [{"body": "Like NOT QE amirite", "score": 3, "replies": []}]}, {"body": "Are you assuming those numbers aren’t doctored?", "score": 16, "replies": [{"body": "Is our market also not more or less doctored?", "score": 3, "replies": [{"body": "“also not more or less doctored...”\n\nIt’s less doctored.", "score": 9, "replies": [{"body": "If Chinese market is doctored by a bear, then why is it going up? 🤔", "score": 4, "replies": []}]}]}]}, {"body": "Chinese govt and cooking the books are synonymous at this point", "score": 10, "replies": []}, {"body": "Well, the shit already hit the fan there so there's not a lot left to lose. It's everyone else that has a lot to lose.", "score": 5, "replies": [{"body": "If this sub has taught me anything\n\nIt is that there is always something left to lose and it will inevitably be lost.", "score": 14, "replies": [{"body": "Murphy's law", "score": 3, "replies": [{"body": "Quote: Einstein.", "score": 1, "replies": []}]}]}]}, {"body": "They exporting corona virus, sales up bigly", "score": 6, "replies": []}, {"body": "Arbitrage this and buy some ASHR puts. Buy different expiration dates because there's no telling how long they can keep printing money.", "score": 3, "replies": []}, {"body": "Shenzhen market literally closed GREEN", "score": 3, "replies": []}, {"body": "Today's crash is because of Italy. The north of Italy is on lock-down as the virus is spreading like pasta.\n\nWhen the shit hits Europe it gets serious. Before no one gave a shit about China.", "score": 4, "replies": [{"body": "Mama mia!", "score": 3, "replies": []}]}, {"body": "hoping usa pumps cash into market like china so i can break even and dip. ;(", "score": 2, "replies": []}, {"body": "Chinese are the most determined to not be bears", "score": 2, "replies": []}, {"body": "At this point, anything that is Yuan-denominated is a meme. \n\nIf you want to know what the Chinese market really looks like look at BABA. \n\nAlso their shameless market manipulation will come down to bite them in the ass when eventually these artificially pumped monopolies become completely inefficient at making anything (except distributing the BoC freshly printed money to their CEO), but continue to exist because CCP. \n\nA similar argument (but to a lesser extent) could be made about US large caps btw.", "score": 2, "replies": []}, {"body": "brb buying calls for China as soon as I figure out what a call is and how to buy one", "score": 2, "replies": [{"body": "Honestly a good idea.  It ain't going down significantly until china collapses", "score": 2, "replies": []}]}, {"body": "quality stocktwits post", "score": 1, "replies": []}, {"body": "shenzhen index, check the last 2 weeks chart", "score": 1, "replies": []}, {"body": "ROW is about 2-3 weeks behind China WRT coronavirus\\[1\\]. China's market fell 8% on 2/3. 2/3+3 weeks = 2/24. Since then China's market recovered back to prior levels. BUY THE DIP.\n\n\\[1\\] [https://en.wikipedia.org/wiki/2019%E2%80%9320\\_coronavirus\\_outbreak](https://en.wikipedia.org/wiki/2019%E2%80%9320_coronavirus_outbreak)  \n\\[2\\] [https://apnews.com/fa331df3dd912684fe8ead6f9bedc140](https://apnews.com/fa331df3dd912684fe8ead6f9bedc140)", "score": 1, "replies": []}, {"body": "Wonder how long the capital injection will last. Living in China I still see that things are fucked. All I know is I'm not gonna try and short the China market anymore.  That government cash injection thing fucked me in the ass.", "score": 1, "replies": [{"body": "How are you on Reddit when Xinnie is watching over your shoulders?", "score": 1, "replies": [{"body": "Proxy", "score": 1, "replies": []}]}]}, {"body": "Aside from the government pumping money into it, everything I read says they are feeding off the strength of the american markets. \n\nNow that we are finally down let's see how the Asian markets do tonight", "score": 1, "replies": []}, {"body": "China is \"recovering\" and liquidity been injected, that's why", "score": 1, "replies": []}, {"body": "It's got to be manipulation.", "score": 1, "replies": []}, {"body": "HO WE FUK!", "score": 1, "replies": []}, {"body": "Their markets have already been reamed the last few weeks. The damage was priced in.\n\nThe world composite was still chugging along until today, because now it's clear the problem isn't contained to China.", "score": 1, "replies": []}, {"body": "I don’t want to begin to think about what’s going on over there", "score": 1, "replies": []}, {"body": "Le helicopter money.", "score": 1, "replies": []}, {"body": "They banned investors from selling shorts or closing positions. The feds would not have to QE if they follow the CPC.", "score": 1, "replies": []}, {"body": "Newsflash the market is psychological and nobody knows wtf will happen", "score": 1, "replies": []}, {"body": "priced in\n\nshanghai dropped the days we had some random green ass days so today is more of a correction for us and china is kinda just the same ish", "score": 1, "replies": []}, {"body": "The beer virus is under control in China.", "score": 1, "replies": []}, {"body": "I think you’re forgetting when China as a whole index was down 7% already. In one day.", "score": 1, "replies": []}, {"body": "Chinese economy is a lot worse than what it seems. My parents are Chinese and have insider info, so I can tell you for a fact that the government is pumping money to keep it alive. The Chinese economy has a much larger bubble than what we have in the US", "score": 0, "replies": [{"body": "My parents own microsoft. They told me to load up on 3/20 $250c\n\n\nGTFO of here", "score": 8, "replies": [{"body": "Daddies Branson and Musk both told me their companies on Ponzo schemes, but they are going to the moon 🌝 before they get 🚔 caught", "score": 2, "replies": []}, {"body": "Sure they do", "score": -6, "replies": []}]}, {"body": "Government literally gave the exact number of RMB they're pumping into the market, what sort of shitty insider information is this.", "score": 5, "replies": []}, {"body": "The owner of my local Panda Express is also Chinese. Do you think he has insider, secret-Chinese only info as well?", "score": 3, "replies": []}]}, {"body": "they make it impossible to sell your positions over there. and they just pump unlimited money into the market. we havent done that.....yet.", "score": 0, "replies": []}]}
