{"title": "I give up on AAPL... I'm selling at a loss.", "selftext": "I bought 100 shares of AAPL back on Sept 2nd, 2020 for $134. It's been 9 months. The current price is $126.50.\n\nIn the past 9 months, its share price has only gone above $134 only a few times, and it couldn't hold it for more than a couple days.\n\nAt the time I was debating upon whether to put my money into SPY or VIT. Had I done so, I would have seen significant gains, upwards of 19%. Instead, I'm still in the read 9 months later.\n\nYes, I know it's a great company. I love their products. But I can't help but think that that doens't necessarily mean anything for the share price. \n\nLook at their last two earnings reports.... record breaking! and the share price fell afterward. WTF? how is that even possible?\n\nI've decided to sell at a loss of about $900. I'm moving everything into VTI so I don't have to worry about picking the right company... or the wrong company, even when it's an amazing, rock solid company.\n\nIt just makes me think about how much bad advice is given about stocks. Nobody really knows anything. They say \"pick great companies and you got nothing to worry about.\" You can pick a rock solid, amazing company and still end up in the red while everything else gains.", "id": "nxg11m", "created_utc": 1623418228.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 100, "comments": [{"body": "Well when they tell you to \"pick great companies\" they also usually reccomend holding for longer than 9 months too", "score": 76, "replies": []}, {"body": "Wtf is this shit ..... 9 months is nothing", "score": 46, "replies": [{"body": "Are you serious? Look around you. The market has been rallying for the past 9 months and I missed out big time.", "score": -31, "replies": [{"body": "Good luck with your investments you need it", "score": 29, "replies": []}, {"body": "I mean ya not diversifying was dumb but it’s dumber to sell at a loss when it’s fucking Apple lol. Just put some money into VOO or something also.", "score": 9, "replies": [{"body": "It's not my only investment, but it is my largest  which is why it's bothering me so much.", "score": -9, "replies": [{"body": "I mean it seems pretty dumb to sell at such a large loss when it’s such a reliable company, but it sounds like you’ve already decided and just looking for confirmation.", "score": 11, "replies": [{"body": "It seems dumb because it is dumb.", "score": 2, "replies": []}]}]}]}, {"body": "9 months is nothing. Apple is making a fuckin CAR right now and they're waiting for all the EV hype and tech to build up and improve upon. With basically infinite R&D potential you should expect something close to the best auto experience. It will sell like crazy.", "score": 2, "replies": []}]}, {"body": "You’re right. Lolllllllllll", "score": 1, "replies": []}]}, {"body": "You might regret it.", "score": 29, "replies": [{"body": "I already regret it... I've regretted it for the past 9 months!", "score": -15, "replies": [{"body": "Now you get to regret it twice! Double the fun!", "score": 7, "replies": [{"body": "That hurt.", "score": 1, "replies": []}]}]}]}, {"body": "AAPL is definitely a stock you continue to buy on ANY dips. It’s the most valuable company for a reason", "score": 27, "replies": [{"body": "Yeah, but isn't there a point when it gets to be too big? It's a 2T company.\n\n I don't want to get caught in a GE like situation.", "score": 0, "replies": [{"body": "When they continue to pay a dividend, have ALL this cash on hand AND continue to do share buybacks? No. Right now there’s no point where that’ll happen.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Googl is at ATH, rather look at AMZN.", "score": 2, "replies": []}]}]}]}, {"body": "It’s extremely hilarious that your investment horizon for Apple is nine months. What did you think you were buying?", "score": 19, "replies": []}, {"body": "As soon as you click the sell button you will see AAPL 15% gain..", "score": 31, "replies": [{"body": "Please let me know right before you sell, so I can buy.", "score": 4, "replies": []}, {"body": "It happend with SENS yesterday. For no reason whatsoever on 11:55 am it decided to run up almost 40%", "score": 4, "replies": [{"body": "Imagine AAPL running up 40% out of nowhere.", "score": 1, "replies": [{"body": "Not gonna happen. Apple is too big.", "score": 0, "replies": []}]}]}, {"body": "The way she goes.", "score": 2, "replies": []}, {"body": "this actually happened!  LOL", "score": 2, "replies": [{"body": "Lol!! I just looked at the chart too. It's on a climb!", "score": 1, "replies": []}]}, {"body": "Yeah, but I'll be in VTI or VOO maybe, so I'll still get exposure to some of those gains.", "score": -6, "replies": [{"body": "Try not to take this the wrong way but investing is not for everyone. It seems you don’t have the demeanor for trading.", "score": 7, "replies": []}]}]}, {"body": "No one says that if you pick great companies you're guaranteed to gain over 9 months. 9 months is a tiny amount of time when it comes to investing. \n\nIgnore your Apple stock for 10 years and you'll be happy with it.\n\ni just checked and i bought my AAPL on Sep 11 for $110 a share. You just bought high.", "score": 15, "replies": [{"body": "Did you bought a towering amount?", "score": 2, "replies": []}]}, {"body": "What made you buy the stock in the first place? If you believed it was a good investment, why didn’t you add more when the price dropped during this 9 months? What changed about the company that made it not a good investment any more? If FOMO is making all the decisions for you, you’ll find yourself in this exact same position eventually regardless of what you invest in", "score": 12, "replies": [{"body": "Not too mention FOMO will make him more prone to losses.", "score": 2, "replies": []}, {"body": "Thanks for pointing that out.\n\nI love the company, but I sorta came to the idea that since it had trippled in price the previous year, it's run is over.  Just seems far fetched to expect it to grow much more in the next few years. \n\nNot to mention, every time I read the papers, and on reddit, and TV, everyone is screaming that tech is overvalued. So if tech is overvalued, then maybe it needs to come back down before it can grow ?", "score": 1, "replies": []}]}, {"body": "Warren Buffet says: “The stock market is a device for transferring money from the impatient to the patient.”", "score": 20, "replies": []}, {"body": "Bold strategy. Stock has gone from $50 to $126 since July 2019 but yeah let’s complain about it consolidating over the last 10 months.", "score": 11, "replies": [{"body": "That's exactly my point. I think I missed the boat. I got in too late. I bought in at $134 after it had already tripled in price in a year.", "score": -5, "replies": [{"body": "My point is that it’s consolidated and will most likely breakout again.", "score": 3, "replies": []}, {"body": "Or you are just early for the next boat.", "score": 0, "replies": []}]}]}, {"body": "LOL! Losing money on AAPL because you decided to hold only 9 months. 5 years from now, you'll be kicking yourself in the ass.", "score": 10, "replies": []}, {"body": "If you are paper handing apple, just dont invest. Just put your money into a savings account so you will always see green.", "score": 8, "replies": []}, {"body": "Patience is a virtue you clearly do not have.", "score": 7, "replies": []}, {"body": "Thanks for a play by play of you paper handing 👍", "score": 22, "replies": [{"body": "I know right. I'm just want actual gains, not like potential for future gains.", "score": -7, "replies": []}]}, {"body": "f", "score": 7, "replies": []}, {"body": "I always looked at them as a long term hold", "score": 6, "replies": [{"body": "I don't have any aapl, but at the current price it would be a good buy. But then again, I'm not in the market to make quick bucks.", "score": 1, "replies": []}]}, {"body": "Maybe learn how to do your own DD instead of following someone else's advice and then bitching about it after holding for only 9 months and not becoming rich.", "score": 7, "replies": []}, {"body": ">it's been 9 months\n\nlol come on my friend, zoom out", "score": 5, "replies": []}, {"body": "OP really taking \"buy high, sell low\" to heart I see.", "score": 6, "replies": []}, {"body": "9 months is absolutely sod all, investing is a year/decade long process.\n\nIn short you're a muppet.", "score": 12, "replies": []}, {"body": "If you’re in the market with a small amount of money looking for incremental gains over a short period you’re doing it wrong.  Switching from big tech to index funds after a huge run up in the latter is probably not a great idea.  It’s hard to imagine VTI outperforming apple over the next 10 years.\n\nBut you do what you want.  Just don’t blame other people for giving bad advice, blame yourself for accepting bad advice and buying apple when it was clearly overvalued.  It will grow into its valuation, but that takes time.", "score": 5, "replies": [{"body": "If Apple was clearly overvalued 9 months ago, then what does that make it now? Still clearly overvalued. \n\nI actually agree with you... I don't blame anyone but myself which is why I'm taking action and getting the fuck out.", "score": -1, "replies": []}]}, {"body": "I’d never sell AAPL for a loss. I mean almost everyone here always said that it’s a longterm investment, just be patient. With EV, VR and other big announcements in the upcoming years, as someone said earlier - you will regret selling it.", "score": 3, "replies": [{"body": "Look at their last two earnings reports.... record breaking! and the share price fell afterward. WTF? how is that even possible.", "score": 1, "replies": [{"body": "I don’t think I am experienced enough to answer your question, but I am certain there is somebody here who knows better than I do.\n\nThe main thing remains unchanged - APPLE is a multi trillion company with a huge and solid customer base, high quality products, great future insight and influence as well as amazing brand image. This should be the values upon which you choose the investment, not because you invested 10k $ and you expect it to become 20k $ in 9 months.", "score": 2, "replies": []}]}]}, {"body": "Sounds bullish to me! I'll buy your 100 shares!", "score": 3, "replies": []}, {"body": "[removed]", "score": 3, "replies": [{"body": ">Dude, did you not pay attention to the last two earnings reports? Literally record breaking, even for Apple. What happens? Stock dips more. Fundamentals are divorced from this company at least for now.", "score": 3, "replies": []}]}, {"body": "I only own a few shares, but I actually just bought a few more now that it's down.\n\nApple is one of the best long term stocks out there, you will get your money back and more. The company is not going away any time soon.", "score": 2, "replies": []}, {"body": "Ehh, I get some of the argument behind FAANG stocks and index funds being overvalued, but Apple? Has too much cash on hand and brand recognition. Worst case slightly overvalued atm best case could double in value every 5 years or so. Blue Chip either way so safe stock", "score": 2, "replies": [{"body": ">Thanks for your input. Do you think AAPl could be too big though? Like a GE type of situation where everyone thought that it was the best long term investment ever only to watch it slowly bleed out over decades.", "score": 1, "replies": [{"body": "Nah. GE was able to continue to be profitable by emphasizing Foreign Direct Investment, and I think a lot of blue chip companies have plenty of potential to tap into foreign markets that isn't priced in by the market. I believe we will see this over the coming decade where many blue chips will be able to keep pace with historic earnings growth by investing abroad, and Apple has already strengthened their brand overseas.", "score": 1, "replies": []}]}]}, {"body": "When the Gen-Z attention span comes into the market, we profit off them", "score": 2, "replies": []}, {"body": "Can’t fault you for moving to VTI. This is what a lot of investors figure out after a while. It’s hard to beat the market, and an index fund is easy. You don’t have to think about it and the returns have been lucrative.", "score": 2, "replies": []}, {"body": "Another long term investor bites the dust.", "score": 2, "replies": []}, {"body": "Ok, you convinced me. \n\nI'm buying.", "score": 2, "replies": []}, {"body": "I’m in the same boat, didn’t put too much into appl so my loss is like 100$ rn but I’m holding", "score": 2, "replies": []}, {"body": "I love downvoting this dumb shit", "score": 1, "replies": []}, {"body": "Hodl especially now there is extreme volatility in the market across all stocks. The financial system is in a crunch. I say wait it out.... not financial advice", "score": 0, "replies": []}, {"body": "AAPL is a great stock and I will never own it for the exact reason you are basically discussing. This has a massive float and market cap and will be a slow mover forever. It will go up, but I do not buy stocks that cannot 5x in 5 years maximum. This will never 5x. Apple is for the rich or for people who are extremely safe and conservative and scared of their own shadow. You could also use it to hedge a lot of high risk plays. If I had half a million dollars, I would put it into AAPL bc I would be down to make a certain 250k with it in a couple years. I would never put 500 dollars into AAPL because  wtf is the point. However, as a buyer of Apple, you should know this and should not be expecting decent gains (like 35% maybe) for another year. Wait for a FB dip (they come all the time) and buy that instead. FB will 3x in 7 or 8 years. AAPL will not.", "score": 0, "replies": [{"body": "The fact that you run on short term time windows as opposed to DCA and hold long term is why you don’t have 250k and increases the odds that you never will.", "score": 1, "replies": [{"body": "TF r u talking about u goof. I DCA into everything. WTAF r u talking about? I do very well also...thanks.", "score": 0, "replies": [{"body": "You’re literally saying you wouldn’t put 500 dollars because it literally wouldn’t 5x in 5 years. That’s stupid reasoning and is more likely to lead you to blow accounts in the long tun chasing unlikely and unrealistic gains.\n\nDCAing little by little into Apple even if it’s as little as 500 bucks a month is a very solid plan to wealth build.", "score": 0, "replies": [{"body": "There are plenty of stocks that are low risk that can 5x. NVDA and FB for example. Not going to waste my time with AAPL. I stated it perfectly above...if u r scared of making money then buy AAPL or if u r rich, buy AAPL bc 30% of $1mil is 300k. I am not going to trap $1,000 to make 300 in a couple of years. At least go for AMZN if u want to hedge riskier bets. AAPL is fucking stupid unless u r rich or just scared of making money. I did not say shove your life savings into AMC or AITX, but you can live in the NVDA/FB area of the stock world and make great money. At the same time, I definitely wouldn't sell AAPL for a loss...that is a different kind of stupid.", "score": 0, "replies": []}]}]}]}]}, {"body": "You could have bought another stock and converted it tenfold \n\nAAPL is for rookies and boomers, who are afraid of gold", "score": -5, "replies": [{"body": "I'm beginning to think the same way... even if I had just bought SPY I'd be at +20% by now", "score": 1, "replies": [{"body": "The number of losers downvoting me is very puzzling. While these limp dicks wait for Tim apple’s yearly circle jerk, some of us makes 45k in trades across the board for a random week.\n\nWhat a waste of time to park your money on apple and wait. Jesus. Makes me throw up", "score": 0, "replies": []}]}, {"body": "Lol", "score": 1, "replies": []}]}, {"body": "This is why I only own LEAPS for now. I'm new to the market starting last November so this was the best use of funds for me.", "score": 1, "replies": [{"body": "What are leaps?", "score": 1, "replies": [{"body": "[LEAPS](https://www.investopedia.com/terms/l/leaps.asp#:~:text=Long-term%20equity%20anticipation%20securities%20) are options which are long term calls. I use them to lock in a pricepoint when my liquid is allocated to other plays. At the top of the year when AAPL was $120 I couldn't afford to buy 500 shares but I could afford to buy 5 contracts 120c expiring in Jan 2022 which I plan to exercise to secure those 500 shares, giving myself 12 months to raise the capital through other plays.", "score": 1, "replies": [{"body": "Wow! That's really clever! Thanks for explaining", "score": 1, "replies": []}]}]}]}, {"body": "At least wait till next year with selling. Your stock is not going to drop much anyway but the upside potential is there. I'm sure you can at least sell it with some profits within the next 6-8 months. Especially with the traditional events happening in September and sales increasing around Christmas/holidays as well.  Catalysts are coming.  I can get your frustration seeing it trade sideways for 9 months but it is what it is, better accept it for a stock like AAPL than let your emotions dictate what to do.", "score": 1, "replies": []}, {"body": "Bullish sign folks", "score": 1, "replies": []}, {"body": "Sell some options \n\nAnd btw you also collect dividends as well.", "score": 1, "replies": []}, {"body": "If you’d have waited till after the weekend you’d only have been down half as much… closing price is 130.48 today.\n\nI’ve held my AAPL stock for 12 years.", "score": 1, "replies": [{"body": "I didn't sell yet. After the tongue lashing I got, I decided to hold a little longer. But I'll definitely sell once it hits $134.\n\nRegardless, I've been waiting 9 months and have missed out on lots of other profitable opportunities.", "score": 1, "replies": [{"body": "That’s a shame. \n\nAAPL has started running again, don’t miss out.", "score": 1, "replies": []}, {"body": "OK, AAPL has run above $134. Took only a week.\n\nNow that it’s climbing, did you really sell?", "score": 1, "replies": [{"body": "No, it didn't take a week... it took 10 months!\n\nNo, I didn't sell yet. Waiting til it hits $135 instead so I can at least get some profit out of it.", "score": 1, "replies": [{"body": "what a dweeb this guy is", "score": 1, "replies": []}]}]}]}]}, {"body": "Aaaand 291 days later my apple holdings soundly beat my S&P holdings purchased at a similar time by a very large margin. This really hurts to read.\n\nThis should serve as a lesson to both OP and other folks who stumble across this to not make snap investment decisions in a scant 9 months.", "score": 1, "replies": [{"body": "Don't worry. I didn't end up selling at a loss. But I did sell once it reached my cost basis. It has since gone up $43... so if I held, I would have made $4,300 by now. \n\nI ended up putting the money in VTI and Bitcoin. I've made well over $4,300 since then.", "score": 1, "replies": [{"body": "Ah yeah btc would do it.\n\nStill though never buy an asset with a 9 month hold time. Apple is absolutely a great long term investment and will be less volatile than btc long.", "score": 1, "replies": []}]}]}]}
{"title": "What’s the idea behind buying tech stocks at high PE ratios?", "selftext": "I just saw a comment on a post that said that AMZN is currently undervalued. I’ve had AMZN on my watchlist for a while and I’ve been trying to find a decent entry point for some time.\n\nSo, I had a look at AMZN’s valuation and I saw a P/S ratio of 4.03 and a P/E ratio of 63.7, both of which would _usually_ indicate that a stock is very overvalued.\n\nI’m still of the opinion that AMZN might actually still be overvalued, and that we’re still going to have to wait sometime until we see some growth there.\n\nThe situation with AAPL is quite bad too; P/S is 6.49 and P/E is 28.43. GOOGL, V, MA, MSFT and pretty much any kind of large cap tech stock has ridiculously high valuation figures.\n\nSo my question is, why do people continue to think that tech stocks are a great buy with these kinds of figures? To me personally, it appears that a lot of the anticipated growth is already heavily priced in, and that growth in the stock itself will take a long time (that is until the company’s intrinsic value catches up with it’s valuation).", "id": "nxgcj0", "created_utc": 1623419152.0, "score": 46, "upvote_ratio": 0.82, "num_comments": 77, "comments": [{"body": "You’re correct that a lot of that growth is priced in however as they continue to grow that PE/PS ratio will decrease. For example GOOGL has traded historically around PE of 25-30 since 2010 yet their stock has gone from 311 to today’s price of $2,400. The market continues to reward those stocks for that growth.", "score": 59, "replies": [{"body": "Your input is very helpful here, so in the case of GOOGL we can say that if the PE is around 25-30, we can expect some growth in the stock based on it’s previous performance (ie. it’s undervalued for that particular stock)?", "score": 4, "replies": [{"body": "It all depends on market conditions. If the market corrects 20% and GOOGL does as well their PE would be less than their current PE of 30...but that doesn’t change the growth of the company’s revenue/earnings per share growth etc. Based off that historical PE if googl reports a monster quarter the market will eventually reward it and price it at that 25-30 PE ratio. To help elaborate look at Amazon...9/30/2020 it was trading at $3,149 with a PE of 92. It’s now trading at $3,350 with a PE of 64. They’re continuing to grow into their valuation and in my opinion it’s only a matter of time before they breakout and return to that premium between 70-90 PE.", "score": 17, "replies": [{"body": "Ok I see, so 25-30 in that case is sort of a fair valuation zone.\n\nWhere do you find historical PE ratios?", "score": 3, "replies": [{"body": "https://www.macrotrends.net/stocks/charts/GOOGL/alphabet/pe-ratio", "score": 10, "replies": [{"body": "Thanks!", "score": 1, "replies": []}, {"body": "I'm commenting because anything else I do will result in me forgetting to check this out when I have time", "score": 1, "replies": []}]}, {"body": "In the specific case of AMZN I want to bringt to your attention that last year AMZN spent $12bn on Covid related safety measures which would otherwise be pure profit and bringing down the P/E further. Also they had like triple the amount of research and development expenses than e.g. Apple or Facebook just because they are experimenting with new lines of business. So if Amzn really focuses on actually maximizing their earnings their P/E would easily come down to around 20-25. in addition to the huge rev growth the actual price is a bargain imo", "score": 3, "replies": [{"body": "This is why I’m so bullish on Amazon. Not to mention they’re robot using their workforce and eliminating risk from minimum wage hikes.", "score": 2, "replies": []}]}, {"body": "20-30 p/e has been a fair value for growth stocks for a long time.", "score": 1, "replies": []}]}]}, {"body": "It would be starting to be a problem once they actually fail to meet their growth projections. Until then, everything is fine.", "score": 1, "replies": []}]}]}, {"body": "Looking a P/E in a vacuum isn't really a great indicator of being overvalued most of the time.", "score": 22, "replies": []}, {"body": "When most people calculate PE ratios or look through screeners, the PE ratio is usually calculated using current price/last reported earnings (usually YE numbers). \n\nIt’s important to note that people typically buy with the expectation that future cash flows (and profits/ earnings) will grow. That means that the calculation/ valuation of PE mentioned beforehand will only hold true if the company never grows/ remains constant. \n\nThe main reason why growth companies might have a higher PE is that people buy into them with the expectation that future earnings will outpace the PE they bought into. \n\nFor instance, say 20M shares outstanding at $1/ea and $1M was reported from company A’s last annual report. That means the PE you could get is 20. This year they reported $2M, shares outstanding remains at 20M and price remains constant $1. Your PE is now 10. In the real world, the price of this stock probably would have risen if there were no red flags. So if you bought the company “last year” with the PE of 20, your payback period would have essentially halved into the current earnings which probably would have been reflected in capital gains. \n\nThis is just a really basic example and no one should just use one metric to value a company.", "score": 11, "replies": [{"body": "Thanks for your comment", "score": 3, "replies": []}]}, {"body": "The idea is that tech companies are more capable of reinvesting earnings via R&D, improving supply chains, marketing, brand recognition, all things that can be done by competitive companies in any industry, but in tech, these things create a much bigger long term advantage, as tech has barriers to entry, usually in front-loaded research & development costs, that other industries don't have.", "score": 21, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Exactly all of this, and that reinvesting has been beneficial to both investors and consumers. If Amazon's guidance focused on lowering EPS, then we probably wouldn't have AWS, Prime shipping, Prime Video, Audible, wide adoption of E-readers, Alexa, and probably a few other innovations I've missed. I don't own any Amazon shares at the moment, but I hope to get some shares soon before the stock rockets up further.", "score": 4, "replies": []}, {"body": "Especially since dividend earnings are taxed twice anyway, a company might as well keep that money and reinvest it so they can deliver where it really matters, the stock price.", "score": 2, "replies": []}]}, {"body": "Ok, so what you’re saying is that the reason behind the overvaluation is because tech companies are usually good at doing all of the things you mentioned?", "score": 6, "replies": [{"body": "Correct, and reinvestment into one's own operations usually generations exponential returns down the line, the kind that growth investors search for, and will risk stocks with high PE ratio's to get a share of their operations.", "score": 9, "replies": [{"body": "I see. Thanks for your comment!", "score": 3, "replies": []}]}, {"body": "Also tech platforms are highly leverageable. It‘s easy and close to no additional costs for Facebook to increase the price for their ads or increase the actual amount of ads. On the other hand it’s hard for Coca Cola to optimize the costs of goods and bottling process to drive EPS growth.", "score": 1, "replies": []}]}, {"body": "Once AMZN finished lobbying for $15 minimum wages in the retail sector, they will print even more money. Why? Cause they will need less and less workforce in the future due to their automation. They lobby for sth. that their competition will still need in the future (labor), but not them. They are gonna be a true monopoly due to lower cost = lower prices for consumers = higher demand.", "score": 1, "replies": []}, {"body": "This is the kind of \"reinvesting earnings via R&D\" that you are talking about:\n\n[https://killedbygoogle.com/](https://killedbygoogle.com/)\n\nThe market could be blind and irrational, you don't have to be one.", "score": -2, "replies": []}]}, {"body": "You need to account for relative growth, growth consistency, and how long you are willing to wait for returns. Lets assume for a second that prices are frozen at the time of purchase to illustrate what happens over time.\n\nCompany A: PE 15 and 5% E growth.  \nCompany B: PE 18 and 30% E growth.\n\nAfter 1 year...\n\nCompany A: PE 14.2  \nCompany B: PE 13.8\n\nSee whats going on? Despite being more expensive, company B is obviously far more valuable and 18 PE was far too cheap compared to Company A since it only took 1 year to be a better deal. \n\nIn my experience, it seems that investors have different time frames for performance. For me personally, I like to look 3 years ahead when it comes to growth companies, for them to become \"reasonably\" priced compared to peers. Anything more than 3 years and I start to hesitate because I dont know if they can maintain growth for longer. \n\nFor Amazon specifically, they are at PE 60 (or so) but in 3 years, given 30% growth, then in 3 years we are looking at PE 27. Thats not bad and mind you they just came off a 40% earning growth year. Though I dont expect rev to grow that fast, I can definitely see earnings growing 30% for a while given cloud growth and other businesses.\n\nBut I am not all people. Some people, unwisely, seem to be willing to risk waiting 10+ years and are ok assuming crazy levels of growth are maintained the entire time. Tesla stock is an example of this as are many speculative stocks. And thats fine. People are free to have an opinion. You just need to figure out where you land on time frames then decide what PE and growth is ok with you.", "score": 5, "replies": []}, {"body": "Have you done any more “analysis” than just literally looking at the P/E ratio and deciding that it’s high? Honestly, I’m sure there’s more content in a cat’s litter tray than in half the posts on here...", "score": 9, "replies": []}, {"body": "You have to adjust P/E ratios for how quickly the earnings are growing, because P/E just focuses on valuation divided by the past years earnings rate (how many years it would take to earn the valuation of the company at current earnings rate). However, companies that grow fast will grow their earnings faster over time and thus deserve a higher P/E ratio. Tech stocks are some of the fastest growing stocks out there.", "score": 4, "replies": []}, {"body": "P/E ratio is only one metric for evaluating a company. For a lot of companies it’s not a good way to value them at all. “Earnings” (the E) are obfuscated by general accounting principles. Things like depreciation will lower earnings, but not actually lower the cash that a business is generating.\n\nAlso, growing businesses generally have less earnings because they are putting so much of their cash flow back into growth. That is the case for your Amazon example. Amazon generates a ton of cash from their business, but they turn around and use it on growth projects and artificially make the E look lower, and thus the P/E higher. If they ever decided that they’ve grown enough and pulled back the spend on R&D, etc., their earnings would skyrocket. \n\nI’m an Amazon shareholder and I don’t consider them over valued. I barely even look at their P/E ratio because it doesn’t really matter for a company like this. I look at revenue, cash flows, and operating margins. All continue to grow massively year after year.", "score": 7, "replies": [{"body": "Very insightful information, thanks for your comment", "score": 1, "replies": [{"body": "[https://app.koyfin.com/snapshot/s/eq-h8ov0r](https://app.koyfin.com/snapshot/s/eq-h8ov0r)\n\nhere is AMZN historically. there is a box that says \"Valuation\" on the middle right. i prefer to look at EV/EBITDA instead of P/E. you can see that from a historical perspective, AMZN is not all that expensive for both LTM and NTM (last / next twelve months)\n\nwhy? their earnings growth has outpaced the share price which has been stagnant from almost a year now... and before that, it was also stagnant for almost 2 years as well\n\nif you're really feeling cheeky, look at BABA and check at their chart. its my most painful hold right now lmao", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You are only showing how little you know. There are significant non-cash hits to earnings on many balance sheets, and plenty of cash expenses that come after COGS. R&D expense, for example, can be capitalized or expensed depending on the scenario (Amazon expenses a LOT).  And capital equipment is later depreciated—another non-cash hit to earnings. \n\nThere is a ton of nuance to the net income statement and unless you understand it for each company you are investing, P/E is useless.", "score": 7, "replies": [{"body": "i prefer EBITDA or cash flow\n\ni feel like this sub gets reaaaaallly hung up on P/E ratios", "score": 1, "replies": []}]}]}, {"body": "This is a typical example of a smart-sounding but dumb response sounding like on Reddit:\n\n>A company's earnings are, quite simply, its profits. Take a company's revenue from selling something, subtract all the costs to produce that product, and, voila, you have earnings\n\n[https://www.investopedia.com/articles/basics/03/052303.asp#what-are-earnings](https://www.investopedia.com/articles/basics/03/052303.asp#what-are-earnings)\n\nEarnings is measured before they are reinvested into the companies, paying as dividends to investors, etc...", "score": -4, "replies": []}]}, {"body": "Current PEs *are* ridiculous.\n\nHere are (some of) the problems:\n\n1. The Fed pumped a lot of juice into the system over the last year and change.\n\n2. Wealthier households experienced a really high relative savings rate over the last year and change. They were already flush, so the extra cheese went into investments.\n\n3. There isn't anything else attractive to invest in, even for risk-averse investors.\n\n4. FOMO. People see the ridiculous gains over the last year and don't want to miss out. Even people who are 100% up in a single year keep hanging on for more.\n\n5. Bull-market memory. We've been in such a historically long bull market that people can barely conceive of the S&P 500 finishing not only down on the year, but down *hard*.\n\nEventually it will break back to normal range. Always does. There are always a dozen excuses why \"this time, it's different,\" but it never is. But it seems inconceivable. I mean, right now, if we blew off 25-30% of the hot air in the market, we'd still be in peak territory for the Shiller PE, historically.", "score": 9, "replies": [{"body": "Thanks for your comment :)\n\nI feel the same way, but realistically what if it never does and we’re just missing out on the gains in the end? What makes you think that suddenly all of this money that’s been pumped in is going to all rotate out?", "score": 1, "replies": [{"body": "If I could predict that, I'd be a billionaire.  After the fact, there's always some excuse or whipping-boy catalyst to place the blame on, but the underlying cause is the same: it never should've been that high in the first place.\n\nAs far as rotation is concerned, as I've said before, 0% gains in held cash are better than -20% losses in equities.  Other investments will start to look more attractive, or people will sit on cash until the bottom, then run the market right back up to the next peak, and the cycle begins anew.", "score": 3, "replies": [{"body": "Very true. I’m also of the opinion that a crash is on it’s way soon.", "score": 1, "replies": []}, {"body": "> As far as rotation is concerned, as I've said before, 0% gains in held cash are better than -20% losses in equities\n\nI know people who've been saying this since 2018.", "score": 1, "replies": [{"body": "I mean...*technically* when the S&P500 hit 2200 in 2020, it was lower than all of 2018 and most of 2017, so...they were kinda right up until that point, yeah?", "score": 1, "replies": [{"body": "Sure :). Just saying, that 10% gains in equities are better than 0% gains in cash, and I can't really predict the crash, so I learned to stop worrying and just hold broad ETFs.\n\nI'm slowly rotating out of growth stocks tho, because they started to feel more like gamble than investing.", "score": 1, "replies": []}]}]}]}]}, {"body": "Warren Buffett said himself that after a quick boom, there are typical influx of FOMO investors driving the mania going a bit longer.\n\nThen the drop will start when they start realizing that that's not how it works and they pull money out.", "score": 1, "replies": []}]}, {"body": "It's all about expectations. Usually companies that are considered high-growth companies have higher P/E. People don't pay because the stock is undervalued really, they are more paying for that expectation that it'll go up in the future. \n\nTo one person, growth looks already priced in but to another they still see more growth that the stock price isn't indicating. Another thing is (which I'm not sure how heavily it affects) that a lot of these tech companies pay their employees as they get closer to top-level management in stock-based compensation. In this case, the company is able to produce more cash but at the cost of their precious \"earnings.\" \n\nTo be honest, I wouldn't base valuations solely on P/E ratios but I'd consider it as a factor. I know value investors like the oldie Benhamin Graham used this ratio as an absolute measure but it's too narrow-minded to just use P/E. The people buying tech stocks think they're a great buy because of a ton of different metrics but they are most likely growth investors (prefer high P/E ratios and understand superior earnings growth justifies a high ratio)", "score": 2, "replies": [{"body": "Thanks for your input!", "score": 1, "replies": []}]}, {"body": "I dont onow if it is applicable here. \n\nBut For software companies in general, scaling up increases margin much faster. Microsoft can sell more Operating systems with minimal cost of production. Their earnings growth is much easier if they can keep revenue growing.", "score": 2, "replies": []}, {"body": "Companies that operate in software or low cost systems (high automation, supply chain owned internally, etc) often have high P/E. Doesn't mean a lot for tech, IMO, especially if the expectation is that the company continues to grow and take market share", "score": 2, "replies": []}, {"body": "P/E alone tells you absolutely nothing about a company. A P/E of 10 for one company could be expensive, whilst 100 is cheap for another.\n\nIt merely tells you how the market values the business. That may give you an idea of the market’s expectations, but it doesn’t tell you what will happen.\n\nIt all depends on the context in which they are trading - a company with a market cap of $10m has an almost limitless space to grow, whilst another (like Apple) with a $2trn market cap, is so big, and has so much cash, that expanding is a seriously difficult undertaking, irrespective of how innovative it is.\n\nConsider the company’s short- and medium-term growth expectations, as well as the generally market, its market cap, its cash flow, and its stated objectives.", "score": 2, "replies": [{"body": "> a company with a market cap of $10m has an almost limitless space to grow, whilst another (like Apple) with a $2trn market cap, is so big, and has so much cash, that expanding is a seriously difficult undertaking, irrespective of how innovative it is.\n\nThis is true, but kind of besides the point. OP would compare something like an oil giant to a major tech company via PEs and ask which is overvalued of the two, all else held equal. A company that makes entirely new markets for itself to dominate in (iPhone, followed by App store, entire Apple ecosystem, services...), grows and entrenches itself via network effects, and has higher margins is going to command a higher valuation. Also, it assumes that large companies can't keep building on their network effects and compounding their growth. In the absence of trust busting and regulation, that's not a bet I'd make", "score": 1, "replies": []}]}, {"body": "p/e ratio is for amateur...you need to use PEG at the least and better yet disocunted cash flow. a company is valued based on the cash it produces..not some random ratio that some \"anal\" yst derived", "score": 2, "replies": []}, {"body": "Let’s see what happens to some of these tech stocks when interest rates go up. \n\nI really like AMZN too, but to paraphrase Buffett no company is worth an infinite amount of money no matter how good it is.", "score": 2, "replies": []}, {"body": "50 P/E is the new 5 P/E.", "score": 5, "replies": []}, {"body": "If Amazon were to aggressively cut costs like a General Electric, for instance, they could easily get that P/E ratio down 2, 3x.\n\nNo one would want to invest in nor work for an Amazon today that aggressively cuts costs like a GE though..........\n\nIt's kinda ironic, because within the tech industry, Amazon IS the gold standard in cutting costs. I worked with them for two years after college, and they by far had the worst offices (gray office cubicles mostly) and the worst interview lunch (baked ziti in aluminum foil takeout trays) of all the companies I interviewed at.", "score": 2, "replies": [{"body": "AJ Soprano would interview there daily for that fucking baked ziti!", "score": 2, "replies": []}]}, {"body": "You're right - they *are* overvalued. There doesn't seem to be much of an argument against that unless you assume the discount rate will stay at effectively zero for several more years yet.\n\nP/E is a simplistic measurement (PEG tells you more, although again not a great metric to base a valuation on). And while people in this thread are right to point out that the future P/E is lower, that is based on today's price. Meaning, it might seem fairly valued on the next 1/2/3 year's earnings *if the share price stagnated*. That's where you get the phrase 'growth is priced in'.\n\nWe're looking at a scenario where many of these stocks will have to trade flat for 2-3 years in order for earnings to catch up to valuations. Unless there's a correction of course.", "score": 2, "replies": [{"body": "There are so many arguments against that. First, both Schiller and Buffett have talked about PE being relative to the larger economic context. In the developed world, low to zero rates have been the reality for a while for a variety of reasons, and if you factor that in, the stocks are far from overvalued. Money flows to wherever there are largest returns.\n\nAlso, tech companies that make entirely new markets and industries for themselves, function as cross-border monopolies in many cases, and have network effects to entrench themselves command a higher valuation. They have sky high margins and create new problems that they then resolve via demand for their own products -- such as needing a wireless charger if you take a charge port out. Or wireless headphones if no more headphone jack. Those are billion dollar opportunities. This is no oil company with serious outlays required for generating the product and a single product.\n\nStop *italicizing* your argument from two decades ago. Buy AMZN.", "score": 2, "replies": [{"body": ">In the developed world, low to zero rates have been the reality for a while for a variety of reasons, and if you factor that in, the stocks are far from overvalued.\n\nYes I agree, which is why the Schiller ratio is adjusted for the past 10 year's earnings, not the last year. Like I said, if you expect several more years of interest rates at zero, they look fairly valued. Even the historically low rates of the past decade were higher than they are now, with fewer genuine inflation concerns. Though there are people that still believe QE in the form of money sent directly to people (to spend) will produce no more inflation than previous QE in the form of increased bank reserves. We'll see.\n\n>Also, tech companies that make entirely new markets and industries for themselves, function as cross-border monopolies in many cases, and have network effects to entrench themselves command a higher valuation. They have sky high margins and create new problems that they then resolve via demand for their own products -- such as needing a wireless charger if you take a charge port out. Or wireless headphones if no more headphone jack.\n\nYes, I understand all of that. I said it's already priced in. Why else do you think Apple has traded sideways for 10 months now? Amazon still hasn't passed the high it set in early September, while value stocks have soared.\n\n>Stop italicizing your argument from two decades ago. Buy AMZN.\n\nValuations don't matter anymore. *This time it's different!*", "score": 1, "replies": []}]}]}, {"body": "STOP USING PE RATIOS FOR GROWTH COMPANIES. Thank you!", "score": 2, "replies": []}, {"body": "Everything Money Paul claims Amazon is still super overvalued and that he would only consider buying it at about 500$", "score": 1, "replies": [{"body": "If you can get AMZN at $500, I think you’ve got the deal of the century.\n\nI would have been more than happy if I bought at $3,000 personally.", "score": 1, "replies": []}, {"body": "That man should be put in a home.", "score": 0, "replies": []}]}, {"body": "The problem with the PE ratio is that it doesn’t account for growth. Using last year’s earning gives you an historical PE, but the market is pricing in the future. Analyst also use a future PE, using the next year’s estimated earnings.  Companies that are trading at 50 to 1000 PE ratio’s, or don’t have Earnings, are priced at distant future guesses that the company will be first to dominate a new industry. Most notably like Tesla, but they’ve already been around a long time and the competition is at its heals, in fact ahead of it in many ways. If you’re young, have a risk tolerance and some spare cash, no problem with investing in a blue sky futuristic venture, but that’s 180 degree different to investing in a company that already has earnings. Remember, what you’re buying is future earnings.", "score": 1, "replies": []}, {"body": "Tech just Profits and dont producr. Hard to evaluate", "score": 0, "replies": []}, {"body": ">why do people continue to think that tech stocks are a great buy with these kinds of figures? \n\nstupidity", "score": -1, "replies": []}, {"body": "I agree with a lot of the comments here in terms of anticipated  growth, reinvestment, etc. I’m a sense the tech industry mirrors a lot of earlier industries that experienced meteoric growth - after an initial fight for dominance, some winners  start to consolidate their base by buying the competition and then become difficult to depose\n\nI think the other factor here is software and content - apple, Amazon & google are all kings of those two, to lesser and greater extent. Software and content is all profit - there’s no cost of goods sold. So in a traditional business I invest to create a new product, and then each one I build costs me $20, but I sell it for $30 - yay I made $10 profit which I use to recoup my development costs (kind of - really that’s the ROI on my dev / startup costs). Here in software I pay to develop the initial product, and then an awful lot of what I receive is profit. I still need a team to maintain the code - fix bugs, add new features, but if it’s any of the enterprise level software that Amazon and google deal with, the revenue is huge compared to that cost\n\nSo the “e” of p/e needs to be adjusted to account for the lack of COGS", "score": 1, "replies": []}, {"body": "In many cases you don't want to buy in to high multiple stocks, but this way of thinking would have caused you to miss out on one of the best stocks of all time. Amazon's compounding effect was/is underappreciated by value investors.", "score": 1, "replies": [{"body": "It's true.  I bought AMZN at $1,800.  When I did I couldn't believe how much I was spending for a handful of shares.  Lo and behold...", "score": 1, "replies": []}]}, {"body": "First, both Schiller and Buffett have talked about PE being relative to the larger economic context. In the developed world, low to zero rates have been the reality for a while, and if you factor that in, the stocks are far from overvalued. Also, rising productivity has made deflation a concern over the longer term.\n\nAlso, tech companies that make entirely new markets and industries for themselves, function as cross-border monopolies in many cases, and have network effects to entrench themselves command a higher valuation. They have sky high margins and create new problems that they then resolve via demand for their own products -- such as needing a wireless charger if you take a charge port out. Or wireless headphones if no more headphone jack. Those are billion dollar opportunities. This is no oil company with serious outlays required for generating the product and a single product.\n\nBuy Apple, Amazon, Microsoft. Stop abusing a single metric to compare every stock out there. Think of what each company does, how, its size and scale, and value it accordingly.\n\nThere is no better opportunity right now than to buy QQQ and get a slice of the leviathans. They are arguably the greatest companies the world has ever seen and are far from overvalued.", "score": 1, "replies": []}, {"body": "I still sleep better at night holding big tech over ARK funds.", "score": 1, "replies": []}, {"body": "Because don’t over think this for good companies. Not stocks, companies. These are winners that will keep on winning, unless you believe otherwise or are only considering short term effects. Buy and hold these ones for a long time and you won’t go wrong. Choose to wait and you will always be on the sidelines. \n\nIf there’s a market correction and the price becomes more attractive, buy more, but don’t wait to get into a company YOU believe will be a winner for the long term.", "score": 1, "replies": []}, {"body": "V ,amzn and ma are tech ?", "score": 1, "replies": []}, {"body": "The market is at an expensive level.   The market will correct or crash, along with AMZN, but AMZN will be one of the stocks that bounce back and beyond the fastest.", "score": 1, "replies": []}, {"body": "They’re priced so highly because people anticipate they will grow into the valuation and beyond.", "score": 1, "replies": []}, {"body": "I don't think much of PE, I find it more a guessing game on future sales and revenue of the company.  That is all there is to evaluate stock price.", "score": 1, "replies": []}, {"body": "I think that was me..   I was wrong on PE.  But ... Market cap is 1.4T.  They do 400B in revenue and always growing.  To me that is a good value.", "score": 1, "replies": []}]}
{"title": "Finally we’re seeing some respect being put onto NIO. Bloomberg calls NIO a hybrid of Apple with a fan base of Tesla. I don’t care about NIO in USA or even Europe, but I see it absolutely becoming insane in China With 90% of ppl living in apartments so battery swaps are much more reasonable.", "selftext": "", "id": "nx5ybq", "created_utc": 1623381225.0, "score": 651, "upvote_ratio": 0.92, "num_comments": 88, "comments": [{"body": "NIO price is close to explode....", "score": 94, "replies": [{"body": "I think this week we can see it hit $50🤞", "score": 41, "replies": [{"body": "Maybe my average costs of $55 will be saved", "score": 7, "replies": [{"body": "You’ll have no problem long term with $55 buy in… 2-3 years this stock will be $200-300 I’m confident of that", "score": 6, "replies": []}]}]}]}, {"body": "Nio going for good gains longterm atleast $100 EOY. Deliveries look very good.", "score": 34, "replies": []}, {"body": "Nio is 🔥", "score": 29, "replies": []}, {"body": "[deleted]", "score": 38, "replies": [{"body": "My faith is in NIO over the others, so much so that 36.6% of my portfolio is NIO and long term for sure (I think in 2024 it can be ~300-400$/share)", "score": 30, "replies": [{"body": "73% of my portfolio 😂😂✌🏼", "score": 11, "replies": [{"body": "97% of mine", "score": 9, "replies": [{"body": "that’s the way", "score": 3, "replies": []}]}, {"body": "This is….inspiring. Perhaps I shall join you 😬😬", "score": 7, "replies": []}]}, {"body": "95% of mine", "score": 5, "replies": [{"body": "Sitting at 99% currently of nio $60 leaps. Other is 1 share of gme hehe.", "score": 2, "replies": []}]}]}]}, {"body": "Dude this is awesome I literally just dumped $8k into calls on Nio today 😂😂😍😍\n\n*UPDATE:  I bought 40 calls with $42.5 strike expiring 6/25, for an average of $2.04/call.. just sold for a nice profit of $4/call… green never felt so goooooooooood- I love NIO and long term long hard term on it!🔥🚀", "score": 29, "replies": []}, {"body": "I Bought 1000 shares @ 42.00\n\nHolding atleast 2 years, ( or until the ET7 is released in Europe ) \n\n&#x200B;\n\nonly good news, very promising stock", "score": 14, "replies": [{"body": "Smart play!", "score": 3, "replies": []}, {"body": "Buy at $42. Sell at $690.", "score": 1, "replies": []}]}, {"body": "Battery swapping is about the ease of upgrading batteries in the long term instead of purchasing a new car. Thats one way how a company can retain its customer base, through a subscription model.\n\n10 years down the road, if the chinese government mandates evs to have detachable batteries, guess who has the infrastructure in place or at least have 500 battery swap stations by then, or maybe even 5,000.\n\nSwapping as an alternative form of charging \"because most people in china live in apartments\" isnt necessarily the #1 reason why i think nio is going the battery swap route, in my opinion. It's the subscription model which other companies may use in future, a standardized battery pack perhaps.\n\nEdit: \n\nIt's also very shortsighted for those who say battery swapping is:\n\n1) a marketing gimmick\n\n2) pointless when fast charging takes only a couple of minutes", "score": 19, "replies": [{"body": "Yeah no one ever wants to talk about how the faster your fast charger is, the less time your battery could last at top performance", "score": 10, "replies": []}]}, {"body": "NIO bull run baby!!! 🚀🔥🚀🚀", "score": 8, "replies": []}, {"body": "Nio is going to rocket 🚀", "score": 9, "replies": []}, {"body": "I’ve been buying nothing but NIO last 3 months from all the dips it had. It was the most oversold EV imo for its potential value and what it already has. Knew it was a good buy when all of the people on YouTube comments were saying it sucked and that they were going to go down to $15 a share haha", "score": 8, "replies": []}, {"body": "Yessir", "score": 8, "replies": []}, {"body": "We’re literally witnessing the start of a new world Giant!", "score": 5, "replies": [{"body": "Few understand this. And even less will have the patience to hold long term.", "score": 1, "replies": []}]}, {"body": "Were so close to lift off.", "score": 6, "replies": []}, {"body": "NIO - 6k shares holding 🤗", "score": 6, "replies": []}, {"body": "put some respekt on their name!", "score": 5, "replies": []}, {"body": "NIO $50 next week. Institutions loading up too. Not a pump and dump scheme if that’s what you’re looking for", "score": 6, "replies": []}, {"body": "finally wsb is back on it!", "score": 6, "replies": []}, {"body": "Yesss NIO!! FINALLY SOMEONE IS TALKING ABOUT IT", "score": 4, "replies": []}, {"body": "NIO is going to dominate and take no prisoners in the process. Let’s go", "score": 3, "replies": []}, {"body": "Nio.", "score": 4, "replies": []}, {"body": "NICE NIO\n STOCK PROMOTION \nat least your not a bot", "score": 11, "replies": []}, {"body": "Most of all chinese stocks have a very great potential. Unfortunatly they are currently victim of the narraw mindset from the West that beleive that only usa stocks have a value. They forget to tell that usa stocks without asian investments would have much much less value...", "score": 7, "replies": []}, {"body": "we are back on track to the 100s", "score": 3, "replies": []}, {"body": "Nio life: it captures the local hierarchical socioeconomic class sentiments as people want to differentiate and show off (I'm afraid I disagree with that culture, but it's a good business strategy).", "score": 3, "replies": []}, {"body": "I think Nio is so undervalued. The nonstop FUD pisses me off but us true holders know what we own with NIO.", "score": 3, "replies": []}, {"body": "$60 EOY", "score": 2, "replies": [{"body": "$60 EOW* I think you meant", "score": 6, "replies": []}]}, {"body": "Bought in a 33.6, enjoying that nice profit now", "score": 2, "replies": []}, {"body": "Super Long NIO! \n\nHolding NIO since December 2019 and have been adding at every dip. \n\nThe Best EV in the world run by an intelligent CEO.", "score": 2, "replies": []}, {"body": "NIO will have its time like TESLA, I wouldn’t miss the train when there’s no brakes!", "score": 2, "replies": []}, {"body": "$nio 🚀 🌙", "score": 2, "replies": []}, {"body": "This is huge. Acceptance of a Chinese EV into american MSM. Time will tell tho, I suspect fierce barrier of entry in US markets.", "score": 2, "replies": []}, {"body": "And BB QNX / QNX Hypervisor is the RTOS for all these Chinese EVs", "score": 1, "replies": [{"body": "Do you have some source or reference for this statement?", "score": 3, "replies": [{"body": "For 2021 see below ——- \n\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-and-bitech-team-up-to-build-safe-reliable-digital-lcd-instrument-cluster-for-changans-newly-launched-uni-k-suv\n\nMore:\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2021/wm-motor-chooses-blackberry-qnx-to-power-its-w6-all-electric-suv\n\nEven more:\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackBerry-teams-up-with-desay-sv-automotive-to-create-an-immersive-cinematic-driving-experience-for-cherys-tiggo-8-plus-and-jetour-x90-modelsb\n\nAnd more:\n\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberry-expands-partnership-with-baidu-to-power-next-generation-autonomous-driving-technology\n\nJune investor presentation: (has graph of all QNX partners)\n\nhttps://www.blackberry.com/us/en/pdfviewer?file=/content/dam/bbcomv4/blackberry-com/en/company/investors/BBAS-2021-Presentations.pdf", "score": -1, "replies": []}]}]}, {"body": "How we all doin", "score": 1, "replies": []}, {"body": "Still very relevant", "score": 1, "replies": []}, {"body": "I honestly believe there are many undervalued small to midcap innovative Chinese tech companies that could easily be valued at over 25 billion USD and I wouldn't be surprised. There's the country risk that everyone talks about, but that's the whole reason Chinese companies are undervalued in the first place. High risk very high reward. Companies like HUYA, WIMI, ZEPP, DOYU, JKS, JWEL, IFBD, MOMO, BLCT, MKD, etc. A ton of cheap innovation with high gains potential.", "score": 1, "replies": [{"body": "I’ve seen you post this multiple times. Which out of all of these is your highest conviction play", "score": 2, "replies": [{"body": "If I had to choose one, probably JKS. But it's a really tough choice. And yeah I've posted this multiple times.", "score": 2, "replies": []}]}]}, {"body": "Regular folks in China not going to be able to afford NIO.", "score": -3, "replies": [{"body": "Literally the largest middle class in the world is in China. There’s a younger generation saving up to buy a NIO.", "score": 9, "replies": [{"body": "There middle class can not afford Nio.", "score": -4, "replies": []}]}, {"body": "True.\nBut that's why there is BYD ,Li auto,GM and many more selling g cheap EV's.\nNio wants to be like bmw and Mercedes. \nA high e d car company. \nHowever the GEMINI project  NIO is working on.will be have a non swappable battery and a much lower price point.", "score": 0, "replies": []}]}, {"body": "Li Auto also is killing it even more. Huge Profitability head start is now", "score": -8, "replies": [{"body": "Nio > Li", "score": 16, "replies": []}, {"body": "Li is mainly hybrid cars but yes it has a potential", "score": 0, "replies": []}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}, {"body": "NIO is consolidating the $42 price. Sideways for sometime vs another correction round? I don't think it will rise again for now.", "score": -7, "replies": [{"body": "Nio is as much equal to Tesla with a bigger market", "score": 5, "replies": [{"body": "Lol", "score": -1, "replies": []}]}, {"body": "Nio has a larger market than tesla, why do you \"think\" the stock should not grow any further, just bcoz it is chinese ???", "score": 5, "replies": [{"body": "I'm actually long NIO, BABA and BIDU to name some of my big holdings. But yes because it's Chinese. There isn't as much enthusiasm. I'm not saying its not growing or going to grow. Maybe $50-60 again sometime in a few months.. I was just saying it already had a very good run from the low 30s to 42 and it might slow a bit. that's just normal stock behavioral.", "score": 0, "replies": [{"body": "Good, we are on the same page , thanks", "score": 1, "replies": []}]}]}]}, {"body": "here here", "score": 1, "replies": []}, {"body": "Nio’s future is looking awesome!", "score": 1, "replies": []}, {"body": "🌕 soon", "score": 1, "replies": []}, {"body": "My average costs of $55 beg to differ", "score": 1, "replies": []}, {"body": "Nio mün sün", "score": 1, "replies": []}, {"body": "Finally", "score": 1, "replies": []}, {"body": "Imagine investing the next Toyota in the early 80’s, except its an EV company on the cusp of mass producing the next Camry to hundreds of millions of middle class families in China. A gigantic country it should be a continent. The Chinese middle/upper class is ready for family vacations and all the rest of the shit we did in the 80’s and 90’s. Now its Chinas turn and they have sooo many people.", "score": 1, "replies": []}]}
{"title": "The Big Diesel Play - Shaq - BODY", "selftext": "BeachBody going public combined with MYX Fitness (PTON competitor) and OpenFit. Shaq, Lebron, and Arnold are all shareholders. Sounds meme-y, I know. The financials are solid here.\n\n1.1B (est) revenue for 2021, 68% gross margins on that rev (which is better than NFLX, DIS, PTON, etc). Digital subscriptions have 89% margins. 43% YoY revenue increase for Q1. Added literally a million subscribers YoY. 400M free cash on the books upon merger w/ no debt. Also expanding to 10+ countries in the future. Growth company imo. Connected at home fitness will disrupt the gym industry, again imo.\n\nVote to merge concluding in less than two weeks, new ticker will be BODY.\n\nLink to Shaq asking shareholders to vote [here.](https://vimeo.com/561655635)\n\nLatest news: OpenFit partnership [here.](https://finance.yahoo.com/news/openfit-concierge-health-announce-home-120000642.html)", "id": "nxhvj0", "created_utc": 1623423289.0, "score": 240, "upvote_ratio": 0.9, "num_comments": 107, "comments": [{"body": "Most under the radar spac I have seen since draft kings", "score": 66, "replies": [{"body": "I’m betting heavy on July 16 calls but the 9 calls for feb next year I’m thinking will be my big money. Could see this at $45 I think", "score": 7, "replies": [{"body": "Strike for July 16?", "score": 4, "replies": [{"body": "Most are 15$ I’m up 150% on those the rest are 12.50$", "score": 4, "replies": []}, {"body": "Had over 100 may calls that went bust and I’ve got 50 June 18 calls that I shoulda sold 2 days ago that I’ve lost faith in but July looks good should be a full 2 trading weeks after merger is announced and at least one full week after ticker change", "score": 3, "replies": []}]}]}]}, {"body": "Shaq prints.  We all know this", "score": 48, "replies": []}, {"body": "Shaq has never let me down (not counting free throws).", "score": 40, "replies": [{"body": "Nice. This is more of a wide open slam dunk so I got faith", "score": 24, "replies": []}]}, {"body": "Me personally... I like the stock", "score": 38, "replies": []}, {"body": "This is goin to the Minn y'all. Buy buy buy buy buy", "score": 32, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -11, "replies": []}]}, {"body": "LFGGGG", "score": 29, "replies": []}, {"body": "🚀🚀🚀🚀🚀🚀🚀", "score": 30, "replies": []}, {"body": "My body likes the stock", "score": 29, "replies": []}, {"body": "Shaq daddy take us to the promise land", "score": 28, "replies": []}, {"body": "This has better squeeze set up than amc and gme. This is up next", "score": 27, "replies": []}, {"body": "This is eaaarrrllyyy days! Great time to get in!!", "score": 25, "replies": []}, {"body": "JUST BOUGHT JULY CALLS>>  GOOD MOVE?", "score": 26, "replies": []}, {"body": "LETS FUCKING GOOOO ALL IN", "score": 25, "replies": []}, {"body": "Hell yeah, FRX —> BODY gonna be one for the ages", "score": 20, "replies": []}, {"body": "This needs to go after AMC. Merger is this month, its heavily shorted plus I am a holder of the stock", "score": 20, "replies": []}, {"body": "In for 2,100 shares and feb 22 $20 calls", "score": 19, "replies": []}, {"body": "There is so much growth potential here they just signed a deal with Concierge health as well\n\n&#x200B;\n\nhttps://finance.yahoo.com/news/openfit-concierge-health-announce-home-120000642.html", "score": 14, "replies": []}, {"body": "Big people like big stocks", "score": 13, "replies": []}, {"body": "Fuckin free ass money here", "score": 13, "replies": []}, {"body": "Yolod my life savings after just reading the title", "score": 13, "replies": []}, {"body": "Can I not buy this now?", "score": 12, "replies": [{"body": "gotta buy F R X", "score": 10, "replies": []}, {"body": "Merger is set for June 24. Leaps are still cheap", "score": 3, "replies": []}]}, {"body": "Hidden gem all knows what $BODY will do.\n\nSimple maths here\r  \n\r  \n41% insider\r  \n\r  \n30% tutes\r  \n\r  \n21+% shorted\r  \n\r  \nAlmost all float is locked, huge cult behind it from trainers to subscribers we talk about millions, Silicon valley investors, Celebrities with million of followers , Team from Disney and Tik Tok past, and a low floater stock !!!\r  \n\r  \nThis is a ticking bomb and we speak not only for 100% gain but a real squeeze.\r  \n\r  \nPlus company is debt free and clears billy revenue with record after record.\r  \n\r  \nConsierge deal , Myx, Openfit, Nutrition game is huge and big gyms supporting with contracts.\r  \n\r  \nI think $BODY will become the leader fast dont miss it huge DD behind it.\n\nDont miss.", "score": 12, "replies": []}, {"body": "Let’s go baby!! 💯", "score": 11, "replies": []}, {"body": "I like this stock", "score": 10, "replies": []}, {"body": "WHATS THE FKIN TICKER", "score": 11, "replies": [{"body": "FRX", "score": 12, "replies": []}, {"body": "Frx", "score": 11, "replies": []}]}, {"body": "Frx is simply a great buy at the current price! Fireside chat this Friday is going to send the price way up right before the merger effective date!", "score": 11, "replies": []}, {"body": "Isn’t the Shaq attack a thing?", "score": 8, "replies": [{"body": "i don't know what that means but yes", "score": 6, "replies": []}]}, {"body": "Found this stock after doing DD on PTON, and I'm glad I got in early. The fitness industry is growing at an incredible rate, and I believe this tech is the future, so to my mind FRX/BODY doesn't even need a big slice of the market for this to become a double/triple-bagger within a year or less. Best part is, theyre aiming at a different market from PTON. Plenty of room.", "score": 8, "replies": []}, {"body": "[https://vimeo.com/561655635](https://vimeo.com/561655635)\n\nlink to Shaq asking shareholders to vote", "score": 15, "replies": [{"body": "One team one dream!", "score": 11, "replies": []}]}, {"body": "I've voted and can't wait to morph 😉😉", "score": 15, "replies": []}, {"body": "I'm still mad at Shaq after my disappointing Shaqaroni pizza", "score": 14, "replies": []}, {"body": "Shaq playing both sides of the court. PZZA for the fat and BODY for the fit.", "score": 14, "replies": []}, {"body": "https://www.youtube.com/watch?v=YNCzoVUuIIY", "score": 7, "replies": []}, {"body": "First order of business is raising the monthly subscription price. It instantly adds to profit and they can value add with one of their new partners product lines. \n\nThen use the $400 million cash infusion to ramp up production and marketing of the new bike.  Also, they should use social media fitness influencers to get the word out. Cheaper than mass marketing.", "score": 6, "replies": []}, {"body": "i'm all in 2400 shares", "score": 6, "replies": []}, {"body": "Did someone say 25% short interest? When this squeezes it will fly.", "score": 19, "replies": [{"body": "Yeah 25% but that was like a month ago. I’d bet it’s around 30-35% now", "score": 16, "replies": [{"body": "That would be a winning bet.\n\nhttps://fintel.io/so/us/frx", "score": 2, "replies": [{"body": "Institutional and insider ownership is almost 60% however meaning only 10 million shares in the float which is nice", "score": 4, "replies": []}, {"body": "I don’t see short interest just 30% I situation ownership", "score": 1, "replies": []}, {"body": "Now I’m seeing interest at 33% but only 350,000 shares short", "score": 1, "replies": []}]}]}, {"body": "You got that right!", "score": 11, "replies": []}]}, {"body": "1 billion in revenue, zero debt and all for a 2.9b market cap.  Peloton has 1.8b in revenue, less subscribers and a 33b market cap!", "score": 5, "replies": [{"body": "They will also have $400 million in cash after the merger.  It will be used to drive monthly subs to 8-10 million .", "score": 3, "replies": []}]}, {"body": "Will watch closely.  Shifted from Pton to NLS.", "score": 3, "replies": []}, {"body": "Still loading up.. this thing is ready to pop! Upcoming merger vote in 10 days.", "score": 3, "replies": []}, {"body": "ORBCOMM 15$ call 12/17 expiration", "score": -5, "replies": [{"body": "This bot is broken.", "score": 9, "replies": []}, {"body": "I can see the future", "score": -5, "replies": [{"body": "Nice post history. Human bot it is. Be gone.", "score": 7, "replies": [{"body": "You'll regret not buying, once we get enough on the freight train to Pluto", "score": -4, "replies": []}]}]}, {"body": "Negative", "score": -5, "replies": []}]}, {"body": "Isn't this an MLM? (just getting this stupid ass question out of the way)", "score": -10, "replies": [{"body": "lol why would you do this", "score": 12, "replies": [{"body": "Lol. It had to be done.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "It is not a true MLM. In a traditional MLM, \"employees\" purchase inventory and then sell it. Beachbody does not allow this to happen. Coaches can bring on other coaches and sell shakeology, but it is not mandatory.\n\nAll products can be sold direct to consumer without the need for a coach.", "score": 5, "replies": []}, {"body": "Those look like they made money though.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Ok. So this can make money, too? Seems ok to me.", "score": 3, "replies": []}]}]}]}]}]}
{"title": "Hostess (TWNK) is a sleeping giant.", "selftext": "Here's why I link $TWNK\n\n\\- $2B Market Cap, $1B Revenue. Trading at 2X Revenue \n\n\\- Currently trading at 20X Earnings, Tootsie Roll trades at 40X and other peers in the Food&Bev Trade at 30X. Making TWNK underpriced between 50% - 100%, looking at their current business only\n\n**Growth Prospects:**\n\n**-** Their organic growth remains strong and also have a very diverse acquisition pipeline. They recently acquire Voortman Cookies which positions them to enter the USA $6.9Billion Packaged Cookie Markets.\n\n\\-  Voortman cookies are perfectly positions for the demographic and taste shifts happening in America right they. They offer sugar-free and no-sugar added cookies which will be a growing segment as a result of USA.\n\n\\- They are launching new platforms in order to attract younger demographics such as their \"crispy minis\". \n\n\\- Expansion into eCommerce onto platforms like Amazon. Given their shelf-stable products they are well positions to thrive on Amazon\n\n\\- They have many legacy brands which is on-trend to capture recent popularity of Nostalgia Brands.\n\n\\- Convenience & Boutique Grocery have recently hit all-time high market shares. This is important as the economy reopening people will be going to gas stations more, be out of their home more, giving them a great opportunity for continued growth. They are doing so well during the year of \"stay-at-home\" and \"work-from-home\" and has people get back to the office and back on the road this market share will perfectly suit them for growth.\n\n**Leadership:**\n\nCEO Andy Callahan was at Tyson Foods when stock went from $39 - $75 and he’s Former US Navy so he DEF. KNOWS about rocket ships.\n\nThey recently hired a very experience Head of Growth names Andy Callahan. Google him and you'll see he is the perfect guy for the job\n\nTL:DR: $TWNK has a short interest of 20%, is trading at 2x REVENUE with healthy 25% margins. They are well position for growth and I believe they are relatively undervalued. At a $2B market-cap this is an amazing deal and their portfolio of sweet treats and market share is perfectly primed to catapult this company.\n\nDisclosure: I am long $TWNK via options and Stocks.", "id": "nxinqq", "created_utc": 1623425307.0, "score": 276, "upvote_ratio": 0.84, "num_comments": 87, "comments": [{"body": "If one makes a lot of money on TWNK and posts it on WSB, will it be Gayn Porn?", "score": 43, "replies": [{"body": "It would be a creampie or dingdong with a hoho.", "score": 10, "replies": []}]}, {"body": "The meme potential is too great--buy TWNK for Gay Pride Month!", "score": 20, "replies": [{"body": "THIS IS TOP LEVEL ANALYSIS YOU GUYS DONT DESERVE THIS SUB.", "score": 7, "replies": [{"body": "I sense the sarcasm :( I will try harder", "score": 6, "replies": [{"body": "No way man you had me at rocket ships", "score": 6, "replies": []}]}]}]}, {"body": "I realized the same thing after the little outbreak it had along with a few others Tuesday morning.  I am super optimistic this could be a huge play but am surprised it has not gained any traction on this sub yet.  It has the perfect formula for a successful meme stock.", "score": 16, "replies": []}, {"body": "As people continue to shit on TWNK it is STILL going up! This will be over 20$ this month. The meme potential for a quick massive gain is there. Just spread the word so Twinkie and ding dong memes are every where!", "score": 13, "replies": []}, {"body": "This could Snowball", "score": 11, "replies": [{"body": "Jump on the Twinkie train while you can!", "score": 8, "replies": []}, {"body": "I see what you did there...TWNK also makes snoballs. Thankfully that at least one product name that is free and clear of sexual associations.", "score": 5, "replies": []}]}, {"body": "Who the fuck decides the ticker names? \n\nFuckin' Twinkies man", "score": 9, "replies": [{"body": "It’s so good.", "score": 7, "replies": []}, {"body": "Whoever names the products can't missing - nearly every one of the TWNK products is a reference to something sexual...DingDong, HoHos, SnoBalls.", "score": 3, "replies": []}]}, {"body": "We need more cream pie memes in this forum. \n\nAMC, GME, CLOV stuff is getting pretty tame.", "score": 8, "replies": [{"body": "exactly fuck hearing about the SAME STOCKS OVER AND OVER. this month its $twnk next month it’s something new", "score": 3, "replies": []}]}, {"body": "You see that price action at the end of the trading day just now?? Looked very bullish", "score": 8, "replies": [{"body": "Someone going long...", "score": 4, "replies": []}]}, {"body": "LQBTA month & zombieland meme play 🧟‍♂️🍞", "score": 6, "replies": []}, {"body": "Bears love TWNK", "score": 16, "replies": [{"body": "You know why", "score": 5, "replies": []}]}, {"body": "TWNK is the play this month; Im loaded up ready to go🌈🤑", "score": 10, "replies": [{"body": "Lets do it!", "score": 5, "replies": []}]}, {"body": "Am I the only one who loves all these different versions of twinkies and cupcakes? They've really reinvented this company. The little Debbie, hostess choice has gotten more difficult", "score": 5, "replies": [{"body": "I think I ate 8 boxes of Voortman's Holiday Cookies this Christmas.", "score": 5, "replies": [{"body": "Exactly - they own a whole (relatively) healthy snacks brand. There classic stuff continues to print money, while they establish a strong position in growing markets.\n\nMost criticism is totally missing this aspect of the company.", "score": 3, "replies": []}]}, {"body": "They have a whole health foods brand in their with vootmans.\n\nMakes sense that they keep their classic brands - which are printing money - they have 1B in rev a year...and they acquire and built out brands to address emerging health foods trends.", "score": 3, "replies": []}]}, {"body": "Shelf stable. That’s a understatement. Pretty sure that a Twinkie has a shelf life longer than your life expectancy. They are losing shelf space in every grocery store. I have watched them go from six feet to a little stand placed randomly at the end of the aisle. People will always eat chicken, but eating a Twinkie? Hell I don’t know anyone who buys them, hell I can’t remember the last time I ate one. Good luck though.", "score": 4, "replies": [{"body": "1B in sales says otherwise.", "score": 6, "replies": [{"body": "Yeah what’s their high in five years? They are only staying afloat because of buying the real market that is fucting saturated. Oh and sales and profit are three different fingers in your keester.", "score": 3, "replies": [{"body": "Stop - you are turning me on.", "score": 4, "replies": [{"body": "I got room for EBITDA and margins too - work the whole fist in there.", "score": 4, "replies": []}, {"body": "I get it some guys can’t fuct their girl, rather she fuct him and everyone else. Hey babe, while you’re at it throw a Twinkie in there for my bonk stonk. Creampies might be cool on porn hub, but really taking it for a Twinkie? Really?", "score": 1, "replies": [{"body": "sploosh", "score": 3, "replies": []}]}]}]}]}, {"body": "Voortmans cookies are everywhere. They own this brand.", "score": 4, "replies": []}, {"body": "I agree. If this was such a no brainer Coca Cola or Pepsi would’ve bought them already for 3-5 billion. That’s chump change to them. OP is just pumping his own shit.", "score": 1, "replies": []}]}, {"body": "Sounds like a ding dong move", "score": 5, "replies": []}, {"body": "Worth a punt just for their cameo in Zombieland!", "score": 4, "replies": []}, {"body": "I love Twinkies and TWNK I have shares of both", "score": 4, "replies": []}, {"body": "Look at this guy, FDs and TWNK. Mans in paradise.", "score": 4, "replies": []}, {"body": "IN", "score": 6, "replies": []}, {"body": "Bullish on TWNK. Convenience stores are a big part of sales and impulse purchases from travelers are interrelated. I feel it's safe to say road trips are going to continue to increase this year relative to last. In this regard it seems like worse case the ceiling is low, but so is the risk. Lots of institutional holders, I don't see it collapsing or presenting insolvency issues anytime soon.", "score": 5, "replies": []}, {"body": "Twinking is the path to success in life.\n\n Im in.", "score": 8, "replies": [{"body": "I had written up another DD post that had actual financial information, but i kept getting auto-deleted by the mods so I just removed a bunch of things I thought might have been triggering it. If you are actually interested take a look at the financials. It's super impressive. 25% ebitda. Growing. It should be priced higher than 2x sales.", "score": 8, "replies": [{"body": "yeah everything seems to get auto deleted now.", "score": 4, "replies": []}]}]}, {"body": "Good timing on CLOV [https://www.markovchained.com/profiles/view/reddit:freshlymint](https://www.markovchained.com/profiles/view/reddit:freshlymint)", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "How do the warrants work. Is that a better play than the options?", "score": 3, "replies": []}]}, {"body": "But...They produce garbage that the world has absolutely no need for.", "score": 8, "replies": [{"body": "Garbage food that can last a while. Its the apocalyptic food source.", "score": 15, "replies": [{"body": "Exactly - people are living in bubbles thinking the entire work is over-the-top health conscious. They are selling 1B worth of cream pies annually. Plenty of people still want to indulge and Hostess is one of the most iconic brands for that.", "score": 6, "replies": []}]}, {"body": "Then spread the word and make Twinkie memes a thing lol it’d make 2021 so awesome.", "score": 7, "replies": []}, {"body": "Same with Nestle but we still buy overpriced, borderline illegally obtained, and unethically sourced water from them", "score": 13, "replies": [{"body": "i drink deer water", "score": 7, "replies": []}, {"body": "Maybe YOU do. I buy 5-gallon bottles from a local source that reuses all of its containers. Then I fill stainless bottles for personal use. No reason money can't make the world more sustainable AND healthy. Hostess and Nestle are garbage", "score": 2, "replies": []}]}, {"body": "Snack foods are important!", "score": 7, "replies": [{"body": "Sure...Yeah... We all snack. But. This. Is. Not. Food.", "score": 6, "replies": [{"body": "It's raw sexual innuendo with no expiry - even better. DingDongs, HoHos, Twinks...", "score": 3, "replies": []}]}]}, {"body": "So do 99% of the companies on the exchange.", "score": 5, "replies": [{"body": "And I don't give them my money, not even for short gains. Putting your money into products that are shit just legitimizes those products.", "score": -3, "replies": [{"body": "You're in the wrong subreddit my dude. I'd invest in a company that made swastika bedazzled dog collars if I felt like I could buy way otm calls and make money on it.", "score": 10, "replies": [{"body": "How nice for you. I bet using that busted-ass mentality gets you lots of upvotes. Carry on.", "score": -2, "replies": [{"body": "I'm just curious why you're trying to take some moral high ground in a subreddit about making ridiculous bets on the market? Junk food's a bridge too far for you?", "score": 5, "replies": [{"body": "You know what? You're right. I'll just let myself out...", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "https://www.dextools.io/app/uniswap/pair-explorer/0x8d7bed5b25b291c7d76578ac02979ec5ea33c97f this is the right link.", "score": 2, "replies": []}, {"body": "Growth? They had a hundred years to grow. They're as big as they're ever going to get.", "score": 0, "replies": [{"body": "And yet they posted double digit revenue gains...", "score": 4, "replies": [{"body": "good luck to you, but i think you can do better.", "score": -1, "replies": []}]}, {"body": "They just bought Voortmans Cookies which gets them into the 6-B market cookie category. They have the largest market share in convenience vs. their competitors. Demand for Nostalgia Food Brands is very high.   \n\n\nThey have 28.6% market share in convenience growing 14% YOY pushing them to an all time high and their Dollar Store POSD is now 36%.", "score": 2, "replies": [{"body": "And sitting on 200m in cash, which would be sufficient for another decent acquisition sometime soon.", "score": 3, "replies": []}, {"body": "I wish you luck, friend. Im sticking with $WEN  Wendy's as a nutritious part of my portfolio.", "score": 0, "replies": [{"body": "How did stick with WEN go lol? Still dropping as this is rising. Get in for the quick run up over 20$ easy.", "score": 3, "replies": [{"body": "Im up 5% for the week, you're up 2.5%. good luck to you, friend. Suck the cream out of them Twinkies, I'll be eating my tendies!", "score": 2, "replies": [{"body": "Actually I grabbed a couple hundred calls before people started talking about. I’m up 600% (earlier this week in was up (800%) and this hasn’t even started running yet. This isn’t about long term investment this is about the charts and trend ability of this stock. Will be over 20$ this month.", "score": 4, "replies": [{"body": "What turned to to twnk!", "score": 4, "replies": []}, {"body": "Ya! I had a few hundred June 18th thst I boigjt before the pop last week ans sold them and got back in with shares and some later dates (august and Jan) this thing should pop. Lots of reasons to buy it and citadel use short.", "score": 5, "replies": []}, {"body": "Nice! Well it sounds like you know what you're doing! What color Lambo are you looking to get?", "score": 1, "replies": [{"body": "Lol no lambo but I will donate 10% of my winnings, like I always do, in my 7 figure account. Send my kids to college debt free, and continue to live a debt free life style! Probably buy a new gun 🤔", "score": 3, "replies": []}]}]}]}]}, {"body": "What’s with the dip though? I’m holding some shares as well", "score": 2, "replies": [{"body": "I think institutional holders automatically sold when it crossed their price target. Also, retards mistakenly thought it was a ploy by the hedge funds to distract apes from AMC, so that scared a few retail apes out. The story hasnt changed for dumpster handjobs, tendies and redheads and I think theyre poised for growth in the immediate timeline and long term stability.", "score": 3, "replies": [{"body": "Yeah the next day after their run up somebody had downgraded the stock as well, can’t remember who though but that made it drop as well I’m sure.", "score": 4, "replies": []}]}]}]}]}]}]}
{"title": "$WKHS Really Overvalued", "selftext": " Workhorse is a commercial transportation vehicle company that's focuses on sustainable and cost-effective solutions. Their current product line up includes the c-series trucks. Which are essentially electric postal delivery style trucks. They also have a drone business called horsefly, which they claim can help with delivering packages. Finally they also have Metron, an app that can keep track of their trucks and monitor them to help with inefficiencies.\n\n&#x200B;\n\n[Product Lineup](https://preview.redd.it/mq0vm13xfo471.png?width=1195&format=png&auto=webp&s=ed883919f468ff5014bceee5e6405f8fa6b818d6)\n\nIf we take a look at valuation, at $15 we are sitting around $1.85 billion.\n\n[WKHS Daily Chart](https://preview.redd.it/3j76xe2tfo471.png?width=900&format=png&auto=webp&s=5fdf821b66ef9b98b018eb804df1c73df9c076f5)\n\nAs you can see on the chart, they reached a high $43 a share back in early February. However, after failing to gain the USPS contract they fell all the way to $7.25. They became heavily shorted, and are now back on the rise for that reason.\n\nIf we look at their financial position, we easily see they are overvalued.\n\nThey have barely started to regrow sales, but they are still minuscule. They are valued about 1000x their ARR (Annual Rolling Rate) if we take the $500,000 they made in Q1. This is absurd. They have been in business for years and still can't sell their products.\n\n[Revenue](https://preview.redd.it/j1clghhufo471.png?width=841&format=png&auto=webp&s=f807cfa2aab39c1a7a9cd3dcd5a0a8d7da0ddec2)\n\nThe competition in the space is only increasing. Rivian, Lion Electric, Proterra, and Arrival are all joining the fray, except they already have partnerships with delivery giants. Arrival has a [deal](https://www.fleetowner.com/news/article/21121715/ups-takes-stake-in-evmaker-arrival-will-buy-at-least-10000-electric-delivery-vans) with UPS. [Rivian](https://www.theverge.com/2020/10/8/21507495/amazon-electric-delivery-van-rivian-date-specs) and [Lion Electric](https://www.electrive.com/2021/01/11/huge-order-for-lion-electric-trucks-from-amazon/) both have partnerships with Amazon. And all of them seemingly have a better growth ahead, even accounting for the higher valuations compared to Workhorse.\n\nWorkhorse has never made a profit. The only time they had positive earnings is when their invest in Lordstown Motors blew up. Now RIDE is on the down tread. Their balance sheet is relatively healthy, and potentially a turn around could be possible, but unlikely. Back in October they sold 200 million in convertible notes, which are due 2024. They also have various other liabilities that total $204 million, including long-term. They have about $205 million in cash $200 million in Lordstown Motors. This is most of their liquid securities.\n\nOf course they could last a while with that much money right?\n\nMaybe. But things are still not good. In Q1 they lost $5.7 million in just cost of sales alone. This isn't even operating costs. For every dollar of sales, it cost them twelve dollars just to build. Of course this could be improved if they scaled up production, but they aren't receiving nearly enough sales to make a dent. The cashflows aren't looking good. They lost about $36 million in Q1 alone. That could mean they burn through $144 million in cash for 2021. They also have their drone project which continues to burn money as well, even with no potential near term.\n\nThere was hope a few months ago. They could've won USPS, but probably due to their limited manufacturing capabilities, they didn't get and lost it to Oshkosh Corp. This was surprising to some. They seemed like the perfect fit for the new electric government vehicles. Lots of protest rose up over it from some government officials and Workhorse. However nothing has come out of it. I don't see a future where Workhorse gets the contract, unless the House can pass a bill forcing the USPS to go electric, but even then Oshkosh still might keep the contract. Even Cathy Woods sold her stake in Workhorse a few months ago.\n\nPositions:\n\n&#x200B;\n\n[My positions](https://preview.redd.it/w42xo4pffo471.png?width=461&format=png&auto=webp&s=e08dfde646166abf16d397b84da6a5450529b343)\n\nMight add more too if I see a good opportunity.\n\n*Not Financial Advise.*", "id": "nxmcq4", "created_utc": 1623434930.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 98, "comments": [{"body": "Nothing is final yet but supposedly the infrastructure bill has 10 billion for ev funding specifically for the usps.", "score": 28, "replies": [{"body": "They are trying to get that passed, but like you said nothing is final. Even if it does get passed, it would be contested by Oshkosh.", "score": -9, "replies": [{"body": "I don't know why this comment is getting downvoted, USPS is not going with workhorse. Oshkosh has already won the USPS contact. USPS is not going to take away the contract from Oshkosh and give it to someone else, this late, from the time of the announcement. There would be so many lawsuits from Oshkosh", "score": 1, "replies": []}]}]}, {"body": "So basically…Moon? 🚀🚀🚀", "score": 56, "replies": [{"body": "TLDR, but I believe it is an instruction to buy", "score": 24, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "You had me at lambo. I’m in", "score": 3, "replies": []}]}, {"body": "Your free to do what you want... may you have goodluck!", "score": -3, "replies": [{"body": "I don’t think 99% of people actually read your post mate. They think you said “undervalued”. Anyway I have a call that’s up 450% what do? Amc is overvalued more than this one is you gotta admit. Fundamentals ain’t shit.", "score": 20, "replies": [{"body": "I think the momentum is leaving in my opinion. There is one group trying to get it to run on WSB, but whatever. I'm here to make money, and anyone who wants to can read my DD and the 10 other bull DDs here. Then they can decide what to do.", "score": -2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 59, "replies": []}, {"body": "Just some quick facts:\n\n\\-over 52% short float (Ortex)\n\n\\-Low market cap: 1.86B\n\n\\-Borrow: 16%Fee and not much to borrow\n\n\\-WKHS is already popular on WSB, most people are positive about\n\n\\-high up in Mentions\n\nsounds like #lemonsqueezee without lemons", "score": 34, "replies": []}, {"body": "WKHS🚀🦍💪🏻", "score": 48, "replies": []}, {"body": "[deleted]", "score": 29, "replies": [{"body": "This", "score": 7, "replies": []}, {"body": "My counter thesis to that is that the moment is leaving some of these meme stocks. It has strong support at $15, so if it breaks through that then it can fall, but it could also bounce of $15 and rise to $30.\n\nHopefully we both make money.", "score": 11, "replies": [{"body": "I feel like hedge funds are actually loving the fact that everyone is on board with pushing volume on these stocks.\nThey can make money going up,down, and sideways.", "score": 1, "replies": []}]}]}, {"body": "wkhs to the moon booiss", "score": 26, "replies": []}, {"body": "YEAAA TO THE MOOOON", "score": 19, "replies": []}, {"body": "This is what they mean by SUITS INFILTRATION!!  Going AGAINST American companies and going against RETAIL INVESTORS....Not sure which is worse!", "score": 22, "replies": []}, {"body": "GTFO out of here spreading FUD. Half your comments seem to be thrashing WKHS. You absolute sausage", "score": 13, "replies": [{"body": "I was actually right.", "score": 1, "replies": []}]}, {"body": "Workhorse is a great company. This short seller is out of his\\her element. They talk about Arrival! Are you kidding. They don’t have a product for sale yet. Workhorse does. And sells it. They didn’t get the usps contract because Dejoy is a corrupt POS. They have a 10% stake in lordstown. Which I admit is nothing to brag about given their pathetic leadership from Steve burns. But they are able to use the Lordstown factory for the production of the c1000 vehicles. Funding would of kick started that but corruption won....that time. Now it’s our time. Fight the corruption, short sellers and all who oppose. WKHS deserves better!!!!! IMO", "score": 4, "replies": [{"body": "Woah woah, who said anything about using the Lordstown factory? That is not equipped to handle delivery trucks. If Dejoy was corrupt, then sure oust him. But what if its because Workhorse couldn't handle the supply of thousands of vehicles?\n\nWhats your sell price?", "score": 0, "replies": [{"body": "I bought with the intentions of holding for 10 years. maybe 5 if things worked out as they should of. And they are able to use the Lordstowns  factory if needed. But thanks to dejoy that is not the current situation. My opinion was that their growth with the USPS would have sparked the need for that factory. But like everyday analysts. They looked at what they were currently able to do and decided, no. Your not cable of the production needed to move forward. Point being. You can’t expand to that size without the business to warrant such an expansion. Thats all.", "score": 1, "replies": []}]}]}, {"body": "**Obviously you have a SHORT position!  Why the Eff would anyone want to make a profit off an AMERICAN GREEN COMPANY!??!?!?!?  THis is not DD!!  Trying to Destroy AMerican JOBS and AMERICAN COMPANIES???  GREEDY BASTARD**", "score": 17, "replies": [{"body": "It’s a fair point, accusing someone of these things isn’t helping. We all are here to make money. If you disagree with someone, (and I do, small account but I’m holding workhorse), why not point out flaws you see in the argument?", "score": 3, "replies": []}]}, {"body": "Which intern did you make write this?? Y'all probably shitting your absolute pants. The army is growing globally. And we've still got the weekend to multiply. Be very fearful.", "score": 6, "replies": [{"body": "Best of luck to you good sir, I'm not a hedge fund haha. I'm here to make money. I see this as an opportunity.\n\nBeing a hedgefund would make a crap ton of money anyway, I wouldn't need to post this here.", "score": 0, "replies": [{"body": "An opportunity to spread fear so you can cover your shorts? Lmao ur not a hedge fund but acting like one", "score": 5, "replies": []}]}]}, {"body": "I’m gonna go out on a limb and say that low production was heavily influenced by the microchip device shortage. They’ll be pumping out more soon enough. Also, there are some questions about the Oshkosh contract, I think assuming it’s just production would be fine if Oshkosh was delivering more than 10% of the new vehicles as electric (which was part of the guidance to the contract). Lois DeJoy may have had his fingers in the cookie jar, there’s some buy volume of Oshkosh that’s under investigation by the SEC the day before the deal was announced and that might have an impact. The other thing is, there’s another 10 billion on the table for more contracts and the language is more EV specific. Oshkosh doesn’t even have their vehicles safety teste yet so take that as you will.\n\nWhile a current valuation is probably accurate, it doesn’t take into account market speculation and EV popularity. I think people want to get behind EVs, and this is a company that does have safety tests completed and will be ready to roll out vehicles once we are through the microchip device shortage, a key component of all EVs. \n\nNow that that argument is over, let’s say that maybe the technicals aren’t the best. It’s hedge fund hunting season and they’re massively shorted. More people are holding on some principle, and the sheer volume suggests that the effective float is much lower than estimates which could be pushing the percentage sold short effectively much higher than estimates. Do what you will.", "score": 3, "replies": [{"body": "I think your overestimating the microchip shortage, and you can see in the revenue that in the past 3 years it really hasn't done nothing. This was before the microchip shortage. The management said nothing about microchips.\n\nDeJoy this DeJoy that. It is yet to be seen what they will do about the contract. There is only like 2 senators who are trying to turn over the contract. In the mean time, my play it will fall to below 12 dollars in about a month. Thats how my options are priced.\n\nAlso the EV industry is popular, but also saturated. Workhorse has nothing special compared to a lot of EV companies that are better positioned in general.", "score": 0, "replies": [{"body": "The management doesn’t have to, vehicle production nationwide went down. This is a company that is in the ramping up production phase of growth, not in development or safety testing. Which actually sets them which actually does set them apart from the crowd. \n\nAnd you know what, buy the rumor sell the news. Right now the rumor is the Oshkosh deal wasn’t on the up-and-up and there’s another 10 billion on the way to electrify the fleet. The government, to foster competition wouldn’t be amiss picking another competing manufacturer or two.", "score": 2, "replies": []}]}]}, {"body": "You're correct based on it being overvalued even it's price to book ratio is slight over value. However, The company has $400 million dollars worth of cash and cash equivalent and only a liability of 182 million. It might be better to sell covered calls, or short straddle instead. But i wouldn't do that either because there's an ascending triangle pattern right now and it might meet resistance at 15.50 which could be a tell tale sign of another bull run.", "score": 3, "replies": []}, {"body": "Read your past posts...Long GME so basically you go against shorts and happily support a dying company for your benefit but you give two shits about supporting an American Green EV Company...omfg  YOu are a TOOL!!!! LOL....", "score": 7, "replies": [{"body": "There is like 25 other electric vehicle companies better then WKHS. GameStop can actually transform potentially into Chewy. May the best investment win.", "score": -6, "replies": [{"body": "Dude it is all about YOUR GREED, how are you any different than the Suits??  At least we are bringing positive attention to an AMERICAN GREEN EV Company oh yeah, you forgot DRONES!  I will hold WKHS Long term because I LIKE THE STONK!  Also, Dejoy gave OSK only 500 Million of the 6 Billion on the table and he is going to be OUSTED soon enough!  OSK is SHIT, you forgot the DD part that they only can provide 10% EV..lmao.  Maybe do proper DD instead of cutting and pasting and you can have an argument otherwise, you are scared your puts will crash your measly account which is why you only bought 100 LMAO!", "score": 9, "replies": [{"body": "Yeah thats true. Dejoy may be ousted, but he could also be stayed. Biden administration has not stepped in on every political issue. They let the Dakota Access Pipeline stay open.\n\nPart of the contract is providing 10% ev, but they have the ability to do more I imagine.\n\nRemember, this is a short term play for me. If it falls to $10, maybe I'll buy calls. Your free to like it long-term.\n\nWhy are you on WSB if your worried about greed? This isn't a pump and dumb charity. I'll short your house if I think its overvalued.", "score": -1, "replies": []}]}]}]}, {"body": "Dude  Which HF do you work for?", "score": 6, "replies": [{"body": "Myself, and its working out quite well", "score": 1, "replies": []}]}, {"body": "It has 52% short interest. How good the company's futures and financials are aren't that irrelevant to squeezing shorter in the short run. Get your tickets now.", "score": 2, "replies": []}, {"body": "Props for having balls to post this in WSB lol. I somewhat agree with your DD with the caveat that sometimes pure fundamentals misses potential future of a company i.e. think something like Netflix before it got huge or Amazon in very early days. I like Lion Electric because they have more tangible assets.", "score": 2, "replies": [{"body": "I agree. In my opinion, I think every other electric delivery van maker is already in a better position. And if they run out of money... there isn't a future. But either way, its overvalued even if everything goes right. I bought puts cause I don't think its going bankrupt, I think the stock price will go down with any weakness in meme stocks, which there was. I'm up like 20% on the puts so far.", "score": 2, "replies": []}]}, {"body": "Decent calls [https://www.markovchained.com/profiles/view/reddit:SoldierIke](https://www.markovchained.com/profiles/view/reddit:SoldierIke)", "score": 4, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "Wow, much stupid", "score": 2, "replies": []}]}, {"body": "This is the way", "score": 2, "replies": []}, {"body": "Is this a case for puts? I really appreciate the argument. Seems to strongly suggest jumping ship on Workhorse.", "score": 0, "replies": [{"body": "LMAO another SELL OUT!!  You go do you!  We are an army...your lil puts gonna cry soon", "score": 3, "replies": [{"body": "I’ve never done a put. I buy and hold for far too long. I was just asking. Seemed a bearish case: and from my perspective, a compelling one.", "score": 0, "replies": []}]}]}, {"body": "CLNE is a much better play next week", "score": 1, "replies": []}, {"body": "Your an idiot", "score": 0, "replies": []}, {"body": "I think I'll let it go up a little and then buy the puts", "score": -9, "replies": []}, {"body": "Im not going to lie I have calls june 15 strike of $15 (100 contracts) \n\nafter reading this and thinking it logically i might switch sides or close out position completely.", "score": -7, "replies": [{"body": "If you can swing it and you think it'll go down, buy puts that are further out than your calls and closerer to being ITM, then profit off the up and the down instead risking one or both for a loss\n\nMisspelled \"you\"", "score": 2, "replies": [{"body": "lol ill let it ride and close it out and dayam whats up with the downvotes just because i think of his DD logically!", "score": 0, "replies": [{"body": "It happens. Ibe considered puts on wish, wkhs, and ride because all three look like theyll head down", "score": 1, "replies": []}]}]}]}, {"body": "You forgot to mention your short position.", "score": 1, "replies": [{"body": "Nope I mentioned that, clearly you didn't bother reading it.", "score": 1, "replies": [{"body": "You forgot to mention that its the lowest market cap EV company with actual functioning cars on the road that is making ANY sales.  You literally can not get an EV company with cars on the road and sales for 1.5b, it doesn't exist.\n\nAlso Cathy Wood sold less than a month ago, not few months ago. Factually incorrect.\n\nCan it fail? Sure. But it's still arguably very attractive EV stock. There are at least 10 more EV stocks with no sales whatsoever valued at like 5-15b. Including Arrival. Arrival has a contract (not sure if it's legally binding) but it didn't produce or sold anything yet. Remind me their valuation, is it like 12b? Yep. i.e. 10X Workhorse.\n\nSo ye, when saying something overvalued you should compare apples to apples. Pre-revenue company loosing money, no sht. What EV stock is a better value? I am not even talking about massive incoming squeeze.", "score": 4, "replies": [{"body": "I'm going to tell you right now, a lot of EV companies are overvalued. Non of them are bargain bins. Workhorse has essentially zero revenue. They are really having a hard time convincing people to buy their contract. Meanwhile, Arrival, Lion Electric, and more have partnerships and outside investment from huge companies that could benefit from this.\n\nIs it attractive? I don't see how. They aren't unique. They are burning through cash like crazy. They lost contracts. Everyone is selling out of them. Yet they are still valued like non of that is happening. Arrival has a lot more products and partnerships. They are probably overvalued too though.\n\nI don't see how Cathy Wood selling out a month ago changes anything.", "score": 0, "replies": [{"body": "You didn’t answer my question. What Ev company is more attractive in your opinion or is wkhs the best one?\n\nArrival literally doesnt have a Single car on public road and wkhs have almost as much in contracts while being TEN times cheaper. They are burning through cash just like every other pre revenue company.", "score": 1, "replies": [{"body": "Yeah, but so is Workhorse, they are also burning cash.\n\nI like Lion Electric, they got a lot going for them and have a deal with Amazon.\n\nArrival I think is overvalued as well, but they have a lot more vehicles in the works, and huge partnerships as well.\n\nAnother company is lighting e-motors. They don't develop in the same segment, but lighting is planning on expanding to delivery vans, and they have a lower market cap. And they make twice the revenue.\n\nTA is not in favor of WKHS short term either. The MACD is pulling back down, PSAR is also suggest bearish case, and we are starting to see people sell on run-ups, like today where it ran up 7% then slowly started selling off.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "TLDR: Diamond hooves 🐴 lol", "score": 1, "replies": []}, {"body": "Instructions unclear, added more calls🐴🦍", "score": 1, "replies": [{"body": "RIP", "score": 1, "replies": []}]}, {"body": "USA USA USA", "score": 1, "replies": []}, {"body": "Suck my dick hedge fund person", "score": 1, "replies": []}, {"body": "You meant UNDERVALUED...!  How are those puts doin?", "score": 1, "replies": [{"body": "I still stand by my statement that it is overvalued. Even if they manage to do everything right, it is still priced in.\n\nThe puts aren't doing well. Rolled them into longer term.\n\nOverall my portfolio is doing fine though, its a hedge against a bear market. WKHS is definitly a stock I wouldn't want to be holding when every starts leaving the market.", "score": 1, "replies": [{"body": "Well I do admire dying on your sword and not being easily flipped.  While I’m playing the opposite in this ticker I wish you the best of luck.", "score": 1, "replies": [{"body": "You too.", "score": 1, "replies": []}]}]}, {"body": "I ended up being up on my puts! Things turned around fast. I don't have any positions for this company. Goodluck to you.", "score": 1, "replies": []}]}]}
{"title": "Canoo ($GOEV), their Recent Big News, Upcoming Catalysts, and Short Interest", "selftext": "**Recent Movement**\n\nIt's no question that Canoo has been beaten down the last few months. It's down over 50% from it's pre-merger highs and dipped well below it's former NAV of $10. The big question is : why?\n\nThe news of their cancelled deal with Hyundai during their first earnings call is what caused the most recent downward move, but was it really negative news? Why have your engineers work for another car company, helping them develop a car and giving them your valuable IP? It makes more sense to focus on your own products, which will lead to much more revenue over the years. \n\nTheir original CEO, Ulrich Kranz, leaving was also a contributor to this movement. But again, the move makes sense. Ulrich is an iconic engineer and designer. That's where his focus should be. Having him step down and putting a business oriented CEO (Tony Aquila) is the right move. Not every engineer is Elon Musk. Kranz decided not to retain an engineering position with Canoo, leading me to...\n\n **Apple Hires Ulrich Kranz for It's Rebooted Car Project** [see here](https://www.theverge.com/2021/6/10/22528448/apple-ulrich-kranz-canoo-bmw-electric-car-autonomous)\n\nLots of speculations can be made here. If Ulrich had left on bad terms, most speculation would be bad.\n\nHowever, both publicly stated the departure was made on GOOD terms. \n\nAs you know, Apple tried to acquire Canoo in early 2020, which means their technology is the real deal. What do I think they're targeting? Canoo's **Skateboard Platform**\n\n&#x200B;\n\nhttps://preview.redd.it/3vrul6ibmo471.png?width=1500&format=png&auto=webp&s=d6448dc4281f18423835ddb8ac2d068b03e7f9c3\n\nIf Apple had this, it would speed up their creation of the Apple car since they would only have to design the piece that goes on top. And since Apple couldn't buy Canoo, how could they get their hand on this?    Hire Ulrich and have him make one? : No, Canoo has their technology (a.k.a Ulrich's own tech) patented. \n\nI speculate a deal is in the works where Canoo licenses out their skateboard platform to Apple to build a car on in exchange for some royalty they receive for each sale. And hiring Ulrich Kranz helps them because he knows how to build a car on the platform because **HE MADE IT.**\n\nOf course this is highly speculative, but I believe it's the simplest explanation.\n\n**Upcoming Catalysts:**\n\n1. **Investor Day**\n\nCanoo is holding their Investor Day next week on the 17th in Texas where they are actually letting investors attend and see their vehicles. They currently have 3 that we know of : the delivery van, pickup truck, and lifestyle vehicle(a.k.a minivan or BANGBUS). They have teased a sedan model in the past, and it's speculated they will unveil it at this event.\n\n2. **Manufacturing Announcement**\n\nCanoo's CEO said that their contract manufacturer would be announced in Q3, likely during the Q2 earnings call. This is the only thing holding them back right now. Their product is much further developed compared to the other former SPAC EV's, with 3 models that have drive-able prototypes. They may provide an update to us during Investor day.\n\n**Long and Behold: The Short Interest**\n\nOrtex is showing a current short interest rate of 30% of the share float, up 300% from their 10% short interest rate in January. They are betting against Canoo, and there are a few upcoming catalyst that could drastically change the market sentiment and blow them up.\n\n**Disclosure:**\n\nThis post contains highly speculative predictions, and I encourage you to read up on Canoo and do your own research. This is not financial advice.", "id": "nxnw3s", "created_utc": 1623439085.0, "score": 175, "upvote_ratio": 0.86, "num_comments": 111, "comments": [{"body": "You son of a bitch I’m in", "score": 47, "replies": [{"body": "Get it while it's still on sale. I averaged down to around $8.50 a few months back.", "score": 6, "replies": []}]}, {"body": "Let's go GOEV!", "score": 31, "replies": [{"body": "🚀🚀🚀", "score": 10, "replies": []}]}, {"body": "Don't forget the inclusion to the Russell 2000 index EOM. From what I've read/seen 12 million shares will be bought by funds. I think most of the buying happens either on the 25th or 28th.", "score": 30, "replies": []}, {"body": "The shorts will have to cover soon, this one is a good play.  Ive been long in GOEV for awhile now, they don’t violently swing up or down either so relatively safe @ this entry point too.", "score": 25, "replies": []}, {"body": "One thing to point out is that half of the short interest is already under water. They've been short since April and at $9 or under and have been paying a 25% rate. There will be massive covering.", "score": 42, "replies": [{"body": "This.", "score": 20, "replies": [{"body": "That.", "score": 9, "replies": [{"body": "Don't forget weekly options, thanks to ✈ himself.", "score": 6, "replies": [{"body": "Praise be", "score": 3, "replies": [{"body": "My wallet is not on praise after this week's options performance, but hey, now there's next week.", "score": 2, "replies": [{"body": "That's why I just sell em, got tired of losing money buying them", "score": 2, "replies": [{"body": "You've mentioned this, I may have to change strategies here after they margin call me 😎🤣. \n\n🚀🚀🚀", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "When do they have to start covering? Will Monday or Tuesday be too late? :(", "score": 9, "replies": [{"body": "It’s not too late. In fact, buying now (under $10) is less than what Tony Aquila, the current CEO, bought in at. He personally bought $35m worth, and his current compensation is in 100% stock. That’s as bullish as it gets.\n\nHe and the management team have price targets they need to meet in order to unlock their shares. They are $18/$25/$30.", "score": 10, "replies": [{"body": "Plus his Texas Facility is at partial risk too. Tony is helm's balls deep on Canoo. \n\n🚀🚀", "score": 2, "replies": []}, {"body": "Hello again good sir, didn't Tony pay less than $10 for his shares? Correct me if I'm wrong", "score": 1, "replies": []}, {"body": "Awesome! All in on Monday!", "score": 1, "replies": [{"body": "Welcome aboard! Feel free to visit us at r/canoo where we post the latest on what's going on.\n\nIf you plan on buying options, please buy ones with at least a month til expiry. I prefer warrants (ticker is GOEVW) over options since they're like leaps that expire in 2025 and ridiculously cheap at <$3. You can also never go wrong with commons.", "score": 3, "replies": []}]}]}]}, {"body": "The other", "score": 4, "replies": []}, {"body": "Time to Canoo to the moon on short fuel yall", "score": 3, "replies": []}]}, {"body": "I'm in 100 shares 14 contracts let's goooo ⛳", "score": 16, "replies": []}, {"body": "Im excited", "score": 14, "replies": [{"body": "LV pre-ordered!!!\n\n🚀🚀🚀🚀", "score": 10, "replies": []}]}, {"body": "The tendie van will come soon enough for those who wait.", "score": 11, "replies": []}, {"body": "You said “ BANGBUS”...hilarious", "score": 10, "replies": []}, {"body": "They’re like neighbors in Torrance. I mean that’s the DD right there", "score": 10, "replies": []}, {"body": "165 OTM calls and shares checking in 🚀🚀🚀🚀", "score": 8, "replies": []}, {"body": "Tuesday was just the beginning 😤", "score": 8, "replies": []}, {"body": "Great thinking, I am loving the train of thought", "score": 9, "replies": []}, {"body": "Time to increase my July Call position. The dips this week may save some cash in buying more.", "score": 8, "replies": []}, {"body": "fine you convinced me", "score": 8, "replies": []}, {"body": "The short interest does seem like a poorly- thought-out quick hedge.  A little research on this company and one can see a variety of differing catalysts over the next 2 weeks to 2 years. 2 months ago, this was not as clear and that is when the massive short hedging began. \n\nIn my limited experience, these hedged positions are like addicts and will be back for more until the consequences hit them too hard. Further, they don't see those consequences coming because they are too busy riding the high. \n\nWhile no singular event coming up is completely make or break, the potential for built momentum is a sleeping giant when these catalysts are combined.", "score": 10, "replies": [{"body": "The institutions shorting this are not “addicts” they are highly sophisticated investors with risk management teams who could have entered their positions well before the stock price tanked and are already well in the green", "score": 1, "replies": [{"body": "I mean agreed 100, but they do continue to short the hell out of the ticker in a way that appears somewhat reckless given the upcoming catalysts.", "score": 1, "replies": []}]}]}, {"body": "Needs more rockets 🚀🚀🚀🚀", "score": 4, "replies": []}, {"body": "Getting rid of the subscription model is the best thing they could have done.", "score": 3, "replies": [{"body": "Letting apple deal with subscription service is gonna be a cat outta the bag. Can you imagine? “Hey Siri get my canoo to pick me up” LOL", "score": 1, "replies": []}]}, {"body": "Get back to me when there’s an actual Canoo Bangbus", "score": 5, "replies": [{"body": "What do you mean \"actual?\" \n\nThey've built 13 prototypes that are on the roads testing and crash tested over 70 of them.", "score": 12, "replies": [{"body": "I’m talking Canoo branded Bangbus collaboration fleet.  Prove to us that the skateboard frame is a smooth ride.", "score": 10, "replies": [{"body": "Hop in I’ll show you.", "score": 5, "replies": [{"body": "You’re not my stepdad", "score": 5, "replies": [{"body": "I could be your stepbrother though", "score": 5, "replies": []}]}]}]}]}, {"body": "Check em out next Friday yo!", "score": 8, "replies": []}, {"body": "Canoo Fake Taxi Bangbus confirmed", "score": 5, "replies": []}]}, {"body": "In for 1000 shares at $17. Turned this ticker off and was going to just sit on it for 5 years to hope and break even. Now I’m looking at tripling down and picking up 2k more shares.", "score": 2, "replies": []}, {"body": "All I can find is Apple discussed acquisition and investing in them, which means a whole lot of nothing. I am sure Apple has discussions like this with numerous companies when they are looking into a tech they don't have developed yet.\n\nFrankly, a skateboard that is designed for multiple configurations, probably means that it is not ideal for any specific configuration. You save money on development in theory, but you have cars that suffer for it (nevermind any change to the skateboard affects your whole vehicle line up, which means a slower development cycle as you have to figure out how to make the necessary changes to everything you make at once). This runs counter to Apple's vision of making products consumers want versus finding consumers for cool tech. Frankly, Apple will want, if they are serious, a customized platform that makes their car optimal in every way they can. In any case the technology unveiled last night at the Plaid delivery event, just sent Apple's car program back to the drawing board. Apple is going to need a compelling car to put whatever tech they have in and frankly does not seem like they are close.", "score": 1, "replies": [{"body": "except that changes to the skateboard exactly match Apple's SOP...  2023, now you need the iCar/iSkate2, 2024 you need the 3, and so forth.\n\nedit for clarity... this is the portion of the above comment to which I was replying...\n\n>...change to the skateboard affects your whole vehicle line up, which means a slower development cycle as you have to figure out how to make the necessary changes to everything you make at once). This runs counter to Apple's vision...", "score": 3, "replies": [{"body": "No clue what you mean. Apple is planning on multiple vehicles by 2024, when they don't have a single one out yet? And all those vehicles are supposed to conform to a single skateboard? Fascinating. By the way where are those factories to build these cars? Neither GOEV nor Apple has mass produced a single car yet.", "score": -2, "replies": [{"body": "You sound like someone who has no idea what you’re talking about. Maybe leave it at that?\n\nSo Apple is planning on releasing multiple vehicles by 2024. You think these cars will appear out of thin air?\n\nYou think Uli Kranz will be able to conceptualize, design, build, test and mass manufacture multiple cars in 3 years? \n\nWhile it’s speculative, the narrative fits.\n\nThe easiest way for Apple to release multiple cars by 2024 under Kranz is to license or acquire Canoos skateboard platform because then all they have to do is design the top hats.\n\nIf not canoo, then some other company. But it’s much, much easier for Kranz to use Canoos because he designed it.", "score": 5, "replies": [{"body": "If only Canoo had a team designated to churn out designs in a streamlined way like software-development sprints. Oh wait, they do.\n\nRapid Innovation Team:\n\nCanoo’s recently developed Rapid Innovation Team is a cross-disciplinary team that was established to rapidly develop and assess new product concepts for commercial viability and engineering feasibility.  \n\nBefore a major investment of time and capital, a series of quick but thoughtful sprints take a project to what is called the “zero line,” in order to gain human and financial resource support from the rest of the Company and take the idea from potential product to probable viability.\n\n●\tThe process is structured in three-to-six-month sprints, the ultimate output of which is typically a full CAD package and drivable prototype, ready to progress to industrialization and commercialization phases.\n\n●\tEach sprint is structured as a competitive process in which three or more product and design teams separately generate concepts responding to the identified market opportunity, driven by input from our product planning and corporate development teams.\n\n●\tSprints proceed along a process of natural selection, where at pre-defined milestones, teams present to cross-department committees, who then select top ideas, disband resources assigned to losing ideas, and reallocate resources or approve additional capital toward winning concepts to strengthen the teams for the next phases. Losing ideas are archived for future use or application of the underlying intellectual property for other applications that are better suited.\n\nKey phases in the process include:\n(i) product definition; \n(ii) use case development; \n(iii) photoreal visualization; \n(iv) engineering input and early feasibility evaluation; and \n(v) manufacturing, serviceability, quality, and aftermarket diligence.\n\nOur management team, product planning and corporate development functions can each trigger the Rapid Innovation process upon identification of a potential market opportunity. Through our Rapid Innovation Team, we are able to quickly develop new products and vehicle configurations, efficiently create product roadmaps and evaluate feasibility, and redeploy capital efficiently to take advantage of new market opportunities.", "score": 5, "replies": []}]}]}]}]}, {"body": "I'm gonna wait to see actual production going to market to buy. So far they have a prototype and that's it. I need tangible assets to invest in.", "score": 1, "replies": [{"body": "\"I want the stock to double or triple before I consider investing in the company\". Solid strategy.", "score": 4, "replies": [{"body": "I want the company to not be a vaporware scam is my strategy.", "score": 1, "replies": []}]}]}, {"body": "Canoo to the moon and beyond, let’s ho retards 😂", "score": 1, "replies": []}, {"body": "They make fugly vehicles. I'll not be investing.", "score": -12, "replies": [{"body": "You're going to miss out. Ugly or not this technology is going to be a huge step, for this sector.", "score": 13, "replies": [{"body": "Or they will fold. Either way no more weed or electric vehicle start ups for me.", "score": -6, "replies": [{"body": "Are you holding positions now?", "score": 1, "replies": [{"body": "Nope. Hope everyone here gets rich though ❤", "score": 1, "replies": []}]}]}]}, {"body": "Their pickup looks pretty sweet.", "score": 9, "replies": []}, {"body": "You should short the stock instead man.", "score": 3, "replies": [{"body": "I should have shorted it when people on here were yelling buy buy buy at $17....", "score": 4, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Hey man if you think it’s a bullshit company it’s not too late to lock in those gains.", "score": 1, "replies": [{"body": "Haha I don't do shorts at all but it definitely wouldn't be these guys.", "score": 2, "replies": []}]}]}]}, {"body": "Would only agree the Lifestyle Vehicle (Minivan) looks ugly. The rest of their vehicles look really cool imo and will be in demand. \n\nThe point of this company is primarily its skateboard chassis. If you are investing solely based off of what one vehicle looks like you prob havent done much research.", "score": 3, "replies": []}, {"body": "Sorry they're not making the penis-extending vehicles you seem to need.", "score": 5, "replies": [{"body": "Durrrr", "score": -3, "replies": []}]}, {"body": "They actually don’t make shit yet, just prototypes lol", "score": -2, "replies": [{"body": "You do realize that vehicles must go under massive testing and validation, prior to going into production, right? If not, you have vehicles with major recalls and lawsuits that end up costing way more than doing things right the first time around. \n\nWith that being said, as u/BigProfessional1168 said, Canoo has completed over 500k miles testing their vehicles, while other companies like Fisker are still on the drawing board and Lordstown can't build a vehicle that won't catch on fire.", "score": 13, "replies": [{"body": ".... and that just validates my point. They don’t make shit besides a prototype. They’re estimated $171M revenue trading at a $2.3B market cap. \n\nCongrats on the 500k miles though I guess.", "score": -6, "replies": [{"body": "You guess? That’s a massive milestone. No other EV startups has been able to come remotely close. Are you new to manufacturing? 🤦‍♂️\n\nBut hey, anyone can try to poke holes into companies from a 1000 feet away. For example, your PLTR has the same revenue as BB, yet, PLTR has 7x the market cap of BB. 🤷‍♂️", "score": 10, "replies": [{"body": "Sure, but I don’t believe PLTR is trying to break into an industry as competitive and saturated as car manufacturing and EV. Good luck to you with GOEV, \n\nI’m definitely bitter having already lost my ass on calls after the last run up. From USPS, to Apple, to Kia, there always seems to be a pot of gold just on the other side of this turd rainbow that never actually materializes.", "score": -5, "replies": [{"body": "Don’t buy calls dude", "score": 2, "replies": [{"body": "Do you know what sub you’re in?", "score": 1, "replies": []}]}, {"body": "GOEV has a huge moat. Developing a platform can cost north of $1b. This is why Fisker is heavily relying on Magna’s platform, and Lordstown is a partsbin truck cobbled together from previous generation’s Silverado paired with a small Slovenian’s companies hub motors. Canoo engineered everything from the frame to their own motors. Canoo is an IP goldmine.\n\nPLTR on the other hand is just data analytics. They chase government contracts, and deploys data analysts to projects. How is it any different than a staffing company?\n\nLike I said, it’s easy to poke holes in any company. Buy warrants (GOEVW) instead of options. They are like leaps that don’t expire until 12/2025 with a $11.50 strike. They’re less than $3 now.", "score": 1, "replies": [{"body": "What do you think of HCIC?\n\nI prefer their warrants for now, since pretty much guaranteed to hit $3", "score": 0, "replies": [{"body": "I think self-driving technology for heavy trucks will be insanely profitable, that is if they could get regulatory approval for it.", "score": 2, "replies": []}]}, {"body": "GOEV has a huge moat and PLTR is a staffing company.... \n\nRemindMe! 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2022-06-12 03:35:57 UTC**](http://www.wolframalpha.com/input/?i=2022-06-12%2003:35:57%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/nxnw3s/canoo_goev_their_recent_big_news_upcoming/h1hb4r7/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fnxnw3s%2Fcanoo_goev_their_recent_big_news_upcoming%2Fh1hb4r7%2F%5D%0A%0ARemindMe%21%202022-06-12%2003%3A35%3A57%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20nxnw3s)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "How do you buy warrants? (Excuse my ignorance)", "score": 1, "replies": [{"body": "You search for the ticker “GOEVW” and you can buy it just like any other stock. You can’t buy warrants with Robinhood or WeBull, but you can with other brokers like Fidelity, ToS and etc.", "score": 1, "replies": [{"body": "Ah ok, I use RB that’s why I didn’t see it.", "score": 1, "replies": []}, {"body": "So they’re like options but longer?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They have $700MM in the bank and something like $30MM in debt. Tony is also good at raising capital, as he has done it with a car company in the past as talked to it on their last earnings call.\n\nI think their skateboard is an excellent idea to keep costs down and if you want a larger vehicle, you make a larger skateboard after you have every small delivery van, coupe, convertible, pickup, minivan, and suv that can fit on the current chassis.\n\nThey won't have vehicles out until next year. I think they have a good chance of coming up with some good stuff and being acquired by a larger company for a shit-ton of money.", "score": 1, "replies": []}]}]}, {"body": "Last I heard (over a month ago) they had put over 500k miles on their testing vehicles.", "score": 8, "replies": [{"body": "Of the startup group except for Rivian (which is so funded I'd barely count it as one), they have the most test mules and tested miles. Contrast to something like Fisker which has a single prototype out and not many miles on it, Canoo has over 20 test vehicles. And half a million miles was from a while ago, I bet a milly isn't too far.\n\n\nhttps://www.youtube.com/watch?v=y7_4vnt4BLA\n\nhttps://www.facebook.com/watch/?v=1207321959718249", "score": 4, "replies": [{"body": "I love this stock", "score": 4, "replies": []}]}]}]}, {"body": "Oh no. Please. Come back.", "score": 1, "replies": []}]}, {"body": "RIDE is better", "score": -6, "replies": [{"body": "😂😂", "score": 1, "replies": []}]}, {"body": "This is the perfect scenario for max gains", "score": 1, "replies": []}, {"body": "Soo AAPL leaps, got it.", "score": 1, "replies": []}, {"body": "GOEV", "score": 1, "replies": []}]}
