{"title": "What to do with $NVDA?", "selftext": "[deleted]", "id": "3oie2z", "created_utc": 1444689276.0, "score": 15, "upvote_ratio": 1.0, "num_comments": 23, "comments": [{"body": "Hold this forever, this is a homerun long term play.", "score": 7, "replies": [{"body": "Take this advice. You keep buying this yearly. Solid products, good financials, dividend. This is a must own.", "score": 2, "replies": [{"body": ">This is a must own.\n\nGot it, buying puts now", "score": 12, "replies": []}]}, {"body": "would you suggest increasing my position at current price? ", "score": 1, "replies": []}]}, {"body": "With the intro to VR systems first quarter next year I imagine GPUS are going to be in hot demand. Despite what anyone thinks. If you've tried VR, its the real deal.", "score": 3, "replies": [{"body": "I haven't tried it, is it pretty amazing?? \nI hear they're gonna have low costs.", "score": 1, "replies": [{"body": "It honestly throws you into a different world. It's a really fascinating experience. This stock actually might be hot soon because of vr. Never thought of that.", "score": 2, "replies": []}]}, {"body": "All signs point to AMD's gpu architectures being superior to Nvidia's during that all important initial adoption period for VR. In terms of latency they currently have a big advantage. I wouldn't count them out just yet.", "score": 1, "replies": []}, {"body": "it's the software that is going to make or break VR", "score": 1, "replies": []}]}, {"body": " This stock grows 1% a day. If it does so for a month you will have 25% growth within a month. Easy", "score": 2, "replies": []}, {"body": "I like it. ", "score": 1, "replies": []}, {"body": "How do you know there's going to be a dip? What dip?...", "score": 1, "replies": [{"body": "i dont, but indicators like P/E and it breaking the 52week high on a daily basis usually (not always) means some type of correction or sell could happen. ", "score": 1, "replies": [{"body": "Even if NVDA drops it will come back up. It's a great company with a bright future; don't sell. ", "score": 1, "replies": []}]}]}, {"body": "No one can tell you the right answer. You haven't given enough information. Was this a trade for you or a long term investment? How long have you held it? What is your average price? Have you already sold any of it? Stop planning on dips, dips don't = profit. If buying on a dip was how everyone made money we would all be rich. You should set sell points based upon % profit. If you don't have a plan for something, don't buy it. ", "score": 1, "replies": [{"body": "i'm up roughly 25% now, not a huge sum of money. Bought in about 8 months ago and have been a happy camper. \n\nI planned on keeping this for as long as I can, but I want to maximize profits. I would love to be able to sell my current position and buy double back if it dips down", "score": 1, "replies": []}]}, {"body": "This stock grows 1% a day. If it does so for a month you will have 25% growth within a month. Easy.", "score": 1, "replies": []}, {"body": "NVDA strong results but weak guidance will make it plummet and it will be the best time to buy.", "score": 1, "replies": []}, {"body": "I posted a thread similar to this a few days ago: https://www.reddit.com/r/stocks/comments/3oazol/amd_a_good_buy_or_a_foreseeable_company_closure/\n\nUpon reading comments, suggestions and doing more research i think that NVDA would be good long term investment; especially if AMD's new product line launches fail.  AMD also hasn't made a profit in the last 5 years. ", "score": 0, "replies": []}, {"body": "if you think theres better places for your money you can always rebalance, but i wouldnt sell the whole position, maybe skim some off the top.", "score": -4, "replies": [{"body": "Wtf - such vague advice based on no info.\n\nJust random BS.\n", "score": 1, "replies": [{"body": "grr indeed", "score": 1, "replies": []}]}]}]}
