{"title": "Example of The Motley Fool spreading false information on TIPS", "selftext": "I have always been a vocal advocate that the Motley Fool is close to a scam in the world of investment advice. Their recommendations don't work and they window-dress their mutual fund products by closing down underperforming mutual funds (survivorship bias).\n\nIn [this article](https://www.fool.com/investing/dividends-income/2015/03/08/tips-treasury-inflation-protected-securities.aspx), The Motley Fool clearly doesn't understand how Treasury Inflation-Protected Securities (TIPS) work and overstates its protection against inflation to be twice of what it actually is:\n\n> Here's how it works: every month, the government releases the latest reading on the CPI. The Treasury then boosts the principal value of every TIPS issue by that same amount. Interest payments are calculated based on the changing inflation-adjusted principal value. For instance, say inflation **rose 1%** over the course of a given year. A bond initially issued for $1,000 would see its principal amount rise $10 to $1,010. If those bonds pay 1% interest **every six months**, then **the next interest payment would be $10.10** rather than $10, because of the boost from inflation.\n\nI have highlighted the error part. First, there is a minor error that the face value is adjusted by inflation, not the change of inflation. Second, there is a material error that the interest (coupon) payment is actually calculated based on a face value adjusted for the inflation **during the period equal to the payment frequency**, not \"inflation over a given year\". In the example, if inflation is 1% that year, then US Treasury will deem inflation to be only 0.5% for the six month period, and the interest payment will be only $10.05.\n\nI hope all fixed-income traders understand these products correctly and not misinformed by bad people.\n\n-----------------------------------------------------------\n\nEdit: Some good points brought up here by people. This afternoon I asked a specialized in this field for explanation. He told me I'm right and there are indeed some newer fixed income traders who can understand TIPS better. He informed me the US TIPS is just the way it is: semiannual coupon interest payments, and based on semiannual inflation rate.\n\nHe said it is impossible to predict what will the US Treasury do if one day they decide to offer annual pay TIPS or monthly pay TIPS, and therefore it is too bold for me to assume their will use annual and monthly inflation for these hypothetical products that don't exist. He also said he has seen some foreign (non-US) inflation-indexed bonds that have payment intervals in one length and are based on the CPI in the period of a different length.\n\nFor industry practitioners, an example that explains the mechanism of these products can be referenced in your level 1 curriculum volume 5 book's page 327: Exhibit 7 (Lemuria).", "id": "9sw11q", "created_utc": 1540964623.0, "score": 133, "upvote_ratio": 0.87, "num_comments": 38, "comments": [{"body": "[deleted]", "score": 54, "replies": [{"body": "You seem correct", "score": 20, "replies": [{"body": "The best kind of correct.", "score": 20, "replies": []}, {"body": "I don’t know enough about this subject to argue with him. Besides, that’s a lot of writing so he must know what he’s talking about!", "score": 5, "replies": []}]}, {"body": "It looks like in the Fool's example, since that $1,000 face (par) value bond pays a ~$10 semiannual coupon interest payment, its annualized coupon rate is a 2% and semiannual coupon rate is 1%. This we both understand.\n\nMy argument is how the principal ($1,000) is adjusted according to inflation. The Fool incorrectly thinks the principal is adjusted by **annual** inflation (1%), but in fact semiannual TIPS are adjusted for **semiannual** inflation (0.5%) for the calculation of coupon interest payments.", "score": 1, "replies": []}]}, {"body": "I don’t trust any service that consistently makes outlandish claims such as “this stock tips is like buying amazon at $3.45!”... it’s total bullshit and preys on the misinformed.", "score": 18, "replies": [{"body": "You know, a long time ago I thought I liked their website. Then I hated their over-the-top crap where you click forward like 500 times and it still never tells you the stock. \n\nOne time I got so pissed I decided to try to figure out what freakin stock it was without paying them or signing up. I feel like it was in 2014 and by looking at the sector and the chart I discovered it was BOFI.\n\nTHey pretty much doubled after that, then collapsed in half, then tripled. \n\nAre they a scam? idk... Sure they're over the top but they do pick some good winners sometimes. ", "score": 5, "replies": [{"body": "A broken clock is right twice a day. Doesn't mean shit they are simply a scam.", "score": 5, "replies": []}]}, {"body": "A lot of their stuff is click-bait. ", "score": 3, "replies": []}]}, {"body": "I purchased their Stock Advisor series, but I definitely don’t buy all of their recommendations. They recommended StitchFix, lmao.\n\nBut I do my due diligence based on what they recommend because I’m a Buy & HODLer and it’s nice to see when they have for *sell* recommendations, which have definitely saved me money over the years.", "score": 7, "replies": []}, {"body": "Yeah i never read these guys. Every other ad on yahoo finance is a “double down buy alert” from motley. They keep touting their early success with a handful of lucky breaks", "score": 10, "replies": []}, {"body": "Thanks for the post. Still a newbie and appreciate this alot", "score": 9, "replies": [{"body": "Hey, HotCredit, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": -14, "replies": [{"body": "Hey CommonMisspellingBot, just a quick heads up:  \nYour spelling hints are really shitty because they're all essentially \"remember the fucking spelling of the fucking word\".\n\nYou're useless.\n\nHave a nice day!", "score": 16, "replies": [{"body": " I upvoted you but also... you wrote back to a bot. And I thought about doing the same. \n\n... but it’s a fucking bot. Why do we care?\n\nThe world is getting really weird.", "score": 15, "replies": [{"body": "[removed]", "score": 18, "replies": [{"body": "ROBOTS ARE TAKING OVER! *panics in spongebob*", "score": 4, "replies": [{"body": "Am I the only real person on this post?", "score": 2, "replies": []}]}]}, {"body": "That's also a bot. So you're the one talking to a bot. Unless.... You're also a bot? ", "score": 3, "replies": [{"body": "Lmao someone made a bit to follow common misspellings bot around and trash it", "score": 2, "replies": []}]}]}, {"body": "Good bot", "score": 1, "replies": [{"body": "good human", "score": 1, "replies": []}]}]}]}]}, {"body": "I will always hate MF for their terrible clickbait...but David Gardner turned me onto OKTA, SQ, VRNS, TWLO, AYX and MDB way earlier than anyone else would have, and my bank account is forever grateful.", "score": 3, "replies": [{"body": "Damn didn't realize OKTA was doing that well.  I didn't bother investing because I thought their software was a commodity that AWS could easily implement themselves.  TWLO too.\n\nI guess each company has huge mindshare in their respective niches.", "score": 1, "replies": [{"body": "If the market behaves, OKTA should be $100 in a year, TWLO probably $125+. growth is insane. OKTA has been hiring any and all top salesmen in the space over the past 2 years. They are EVERYWHERE right now.", "score": 1, "replies": [{"body": "Their product is so bad tho lol I’m using it right now ", "score": 1, "replies": [{"body": "as was their $BB tout a few months ago", "score": 1, "replies": []}]}]}]}]}, {"body": "This company will be 40X Apple! Of course that would be $40T, or more than the entire US stock market.", "score": 5, "replies": []}, {"body": "I keep seeing their FB adverts saying \"CLICK HERE for rare triple down buy advice\"\n\nAnyone know what that is?", "score": 2, "replies": []}, {"body": "Listen to their podcasts and read their public articles, but don't sign up. Their best stuff is free, their paid stuff is useless and probably only self promoting. ", "score": 2, "replies": [{"body": "Long time subscriber to MF, you are wrong. The paid services are quality stock picking and education services, the free articles are trash and no better than what you could find in online forum, maybe with better disclosure.", "score": 2, "replies": []}]}, {"body": "I tried fool for the last year but I was so turned off by their continuing hyped-up up-sale shit, I got worn out in a few months. Hell if I subscribed to everything they wanted, I’d be paying $500 a month for shitty advise.", "score": 5, "replies": [{"body": "Interesting. I signed up for Stock Advisor when they did a $159 for 3 years \"promo\". It's been about a year and I haven't seen any cross-selling or up-selling emails from them. Could be I'm militant over unsubscribing from emails so maybe one came in an I immediately unsubscribed and forgot all about it.", "score": 3, "replies": [{"body": "Hmmm I only had one email address and while I do have spam filters, this wasn’t spam. Just another opportunity to sign up to the last second privileged information that I only had to pay another $99 a year to be a part of. I don’t know how you missed all of the emails I must’ve had hundreds. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Agreed. I think the Motley Fool intrinsically know anyone who trust them is actually being fooled. xD", "score": 0, "replies": []}]}, {"body": "Boat load of fools heavily short the most transformarive company today. Tesla.", "score": -2, "replies": [{"body": "Do you mean Motley Fool?  It has been a Stock Advisor pick for a long time now.", "score": 3, "replies": []}, {"body": "Anton wahlman is one such fool. Crying foul that tsla's last q is all bunk.", "score": 1, "replies": []}]}, {"body": "You all should just follow my posts on here instead of those useless services. Better than all of them combined.", "score": 0, "replies": []}]}
{"title": "Will Apple be the first FAANG to beat revenue estimates?", "selftext": "[deleted]", "id": "9sxy7o", "created_utc": 1540986429.0, "score": 44, "upvote_ratio": 0.89, "num_comments": 38, "comments": [{"body": "I’m not invested in Apple but I hope they have blowout head-spinning earnings. The tech sector needs it. My Microsoft calls need it. ", "score": 53, "replies": [{"body": "Deleted -- mass edited with redact.dev", "score": 9, "replies": []}]}, {"body": "I think the market might go green into Apple earnings then Apple might miss and kick us back into ressesion", "score": 42, "replies": [{"body": "Like every morning for the last two weeks", "score": 14, "replies": [{"body": "Yea, I think Facebook was the oddball to go up because it had been trading down for so long already. Apple still is very high up. A slight miss will tank it.", "score": 6, "replies": [{"body": "This is what I'm banking on. Of all the big FANG tech companies Apple potentially stand to lose the most from a trade war. Also Apple haven't been affected as badly as other big FANG stocks so far.\n\nFacebook would've needed a hard miss to tank their shares seen as they were already massively down before Oct despite historically strong earnings.", "score": 3, "replies": []}]}]}]}, {"body": "Yes Apple will beat and trade flat because it’s expected\n\nUnless it’s beat was like 700 million iPhone XS max sales in China.", "score": 14, "replies": []}, {"body": "AAPL beats, soars before CC. Tim Cook says the T word and says operating margins will shrink on QoQ basis. AAPL opens flat next day proceeds to drill with rest of market. Trump says vote for me or else stock market is kill. ", "score": 25, "replies": []}, {"body": "Estimates based on averages of selected analysts who usually can't beat bond returns with their recommendations.\nAnd the analysts like to go above companies' guidance and then claim a miss when the company meets its guidance but not their made up numbers.\nFunny game we are all playing.\nP.S. It's about guidance anyway.", "score": 6, "replies": []}, {"body": "If it’s based on iPhone sales I think they’ll miss. I know a bunch of people who used to get every new IPhone and this year they skipped. ", "score": 21, "replies": [{"body": "Great market research u/crazace ", "score": 69, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "I can vouch for him. I also know a lot of iPhone people that haven't upgraded", "score": 4, "replies": []}]}]}, {"body": "What part of china are they from", "score": 23, "replies": []}, {"body": "I just bought two iPhone X Max", "score": 8, "replies": [{"body": "Earnings beat confirmed", "score": 19, "replies": []}]}, {"body": "I have this feeling as well, but I think their margins are going to be significantly higher this year. The new phones aren’t offering any killer new hardware or redesign, which makes more room for profit using parts and production they’ve been using for over a year. \n\nThis isn’t new, every “S” year the story is “Apple is doomed because they don’t innovate, the phone this year is the exact same thing” and the devices sold do fall short but when you’re selling a $1000+ phone and are able to widen your margins even more YOY you’re gonna surprise people. ", "score": 5, "replies": []}, {"body": "Yeah the XS isn't much different than the X.  The only compelling new phone is actually the XR which appeals to a slight lower market segment.", "score": 2, "replies": []}, {"body": "Can confirm. Bought 2 new iPhones and picked both up at the store same day.", "score": 1, "replies": []}, {"body": "Right bc the average American needs to take out a 30 yr mortgage to buy a $1500 phone and mortgage rates keep going up.", "score": 1, "replies": []}]}, {"body": "It’s AAPL tho...\n\nOutlook is key. Please be optimistic Big Tim! ", "score": 4, "replies": []}, {"body": "Interesting to see what iPhone sales were like. The hype was lower for this gen but then again I'm in a bearish position so I'm gonna get fucked somehow", "score": 3, "replies": []}, {"body": "I'm going to sit this one out.  This thing could go any direction with any amount of intensity.  Best case you are praying to Lord Gamblor on this one.", "score": 3, "replies": []}, {"body": "Expectations are pretty high this time round. Apple will need to kick ass to go up. And it’s impossible the tariffs aren’t going to affect their earnings. What proportion of sales do they have in China?", "score": 2, "replies": []}, {"body": "I don't see how they avoid guiding lower. ", "score": 4, "replies": []}, {"body": "Apple is going to have to deliver the greatest earnings since release of the iphone to hold back the storm. They need to crush revenue and essentially claim that guidance for next year will be double what they sold this year.", "score": 2, "replies": [{"body": "No they don't, calm your tits\n\n", "score": 17, "replies": [{"body": "They need to come close. Expectations are huge. I wager they guide lower too. ", "score": 3, "replies": []}]}]}, {"body": "I hope not.. put the last of my tendies fund which is nothing..should have just bought real tendies..into PUTs", "score": 2, "replies": []}, {"body": "Cheers to Apple missing earnings and crashing the market into the ground!\n\n\n\n", "score": 2, "replies": []}, {"body": "Well idiots are going into credit to buy an iPhone xr on the other hand I'm really feeling the T-Mobile stock. \nhttp://imgur.com/gallery/Agxbiof\n\nFor 85$ a month this beats all broadband offers but my house doesn't get service like a 2 street dead zone so I'm taking my ass to Verizon tomorrow", "score": 1, "replies": []}, {"body": "the large tech sector needs to go down another 6-10 percent. apple is strong so far because there are plenty of faith and cash put into it. \ni would buy some puts.", "score": 1, "replies": []}, {"body": "Pls no", "score": 0, "replies": []}, {"body": "I've been trying to buy an apple watch (the new one) for my wife for weeks here in SoCal. They are completely sold out of them (every fucking store in the area) until Mid November. I mean completely. They will beat.", "score": 0, "replies": []}, {"body": "AAPL is not a FANG. Dunno why it's even included as its growth rates are no way near. Regardless, even if they beat, I think they'll guide lower than analysts are expecting", "score": -9, "replies": [{"body": "I mean, it is the A in FANG.  I hear what you are saying about them being a luxury hardware manufacturer and not a software focused tech stock, but actually none of the companies identified in the FANG acronym are all that similar to one another.  Facebook is social media, Google is advertising, Netflix is media, Apple is hardware. ", "score": 2, "replies": [{"body": "FANG has never included apple, even when its growth rate was high 5ish years ago. But they've chucked in into FANG lately because AAPL has been killing it since last year. It really isn't comparable, and if it is then Microsoft should also be included", "score": 2, "replies": [{"body": "Oh my bad, I guess the A was for Amazon.  Woops.  I've always had that wrong.  Its FAANG that includes Apple.  [https://www.investopedia.com/terms/f/faang-stocks.asp](https://www.investopedia.com/terms/f/faang-stocks.asp)\n\n&#x200B;\n\nBut that is kind of stupid.  Its weird to include Apple/Amazon next to companies like Google/Microsoft/Facebook.", "score": 2, "replies": []}]}]}, {"body": "Yep. Either way, buy puts after ER. The ONLY thing that will save this market is an end to the trade war, yet retards on here keep downvoting anyone that says this. ", "score": -2, "replies": []}]}]}
{"title": "$NVDA Calls thank you for the tendies", "selftext": "[deleted]", "id": "9t0wbz", "created_utc": 1541006820.0, "score": 186, "upvote_ratio": 0.96, "num_comments": 40, "comments": [{"body": "wow fuck you dude", "score": 98, "replies": [{"body": "Username checks out ", "score": 68, "replies": [{"body": "I'll break even on my calls if it hits $270 by January", "score": 15, "replies": [{"body": "Wow rip", "score": 6, "replies": [{"body": "If it gets to $250 by end of November, I'll have a shot of breakeven\n\nThey need to post equal results to Apple for the same quarter and I'll be set", "score": 1, "replies": []}]}]}]}]}, {"body": "NVDA calls challenge initiated. ", "score": 21, "replies": []}, {"body": "positions/strikes?", "score": 17, "replies": [{"body": "10 contracts of a 11/2 $215 Call when $NVDA was at $180. Sold this morning @ $210", "score": 41, "replies": [{"body": "Congratz. Good job bro", "score": 12, "replies": [{"body": "Thanks man. Feels good to be green coming out of this deadly month", "score": 26, "replies": [{"body": "I relate so much to this", "score": 5, "replies": []}, {"body": "Let’s be honest this is mostly right place right time .. love to see your positions on October 1 if they exist (I know they don’t and or they’re very small) ", "score": 2, "replies": []}, {"body": "Yeah this month's recession sucked", "score": 1, "replies": []}]}]}, {"body": "Was gonna say hold to assume your dominance, but your just a bitch.", "score": 5, "replies": []}, {"body": "Damn how much was original cost vs sold cost of contracts?", "score": 2, "replies": []}, {"body": "im new to this investing stuff so if this is a dumb question, i apologize.\n\nif you bought contracts for a $215 call option, when you exercise your option wouldn't you have to buy at 215? How could you sell at 210 and make a profit? Could you eli5 what you did", "score": 2, "replies": [{"body": "If the price of the stock is above the strike price, u keep the difference. If the stock is 220 and u exercise ur 215 contract. Then you basically get to buy the stock at 215 and the shares are worth 220. ", "score": 1, "replies": [{"body": "i understand that part, which is why I don't get how OP made profit. If his strike price was $215, how could he sell at $210?", "score": 1, "replies": [{"body": "Oh lol, you can resell the contract on the market. He bought the contract when the price of the stock was around $180, so he basically bought the contract for pennies at a strike of $215. Fortunately, it made a big movement upwards, now his contract is worth 50% more, so he resold back to the market for someone else to buy it at the current price.", "score": 2, "replies": [{"body": "Ahh, I thought you could only resell the contract when it reaches (or exceeds, in the case of a call) the strike price. ", "score": 3, "replies": [{"body": "That would be if you intend to exercise the contract, you can buy/sell whenever before market close & expiration date as long as there is another person on the other side willing to make that trade", "score": 3, "replies": []}]}, {"body": "Thank you for the clarification. Makes sense. ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "what about your graveyard of worthless calls/puts? i have a few wins too, but they don't come close to my current and recent nvda losses", "score": 11, "replies": [{"body": "Bought in when $NVDA was at $180", "score": 8, "replies": []}]}, {"body": "SQ is not my friend anymore\nNvidia is my new daddy now. ", "score": 8, "replies": []}, {"body": "I had some 11/9 calls today too but fuck there was a lot of slippage ", "score": 2, "replies": [{"body": "Did you sell", "score": 3, "replies": [{"body": "Yeah I got a nice little gain I sold like 15 minutes after open ", "score": 6, "replies": [{"body": "Better than a loss", "score": 3, "replies": []}]}]}]}, {"body": "Sigh i sold mine yesterday at 10% gains. If I held :(", "score": 2, "replies": []}, {"body": "I made 50% on the Jan 300 I bought already, might go back for more tomorrow. Not sure what % gain I want to sell them at.", "score": 2, "replies": [{"body": "Listen here, take the damn profits. I went from +50% to -99% on my Jan AMD calls in a week. Don't be greedy.", "score": 2, "replies": []}]}, {"body": "You are very welcome!", "score": 1, "replies": []}, {"body": "wtf is up with nvda and semis in general, amd got rektt", "score": 1, "replies": []}, {"body": "I’m down like 8k but Nvidia just brought me back up like 1k but then one of my calls didn’t sell so now I’m scared of Red Thursday.", "score": 1, "replies": []}, {"body": "Didn't want to take a chance with all the recent negative news grats.", "score": 1, "replies": []}, {"body": "Very nice. Wish my TSLA put looked like that. ", "score": 1, "replies": [{"body": "First profitable quarter and elong is using his nutsack to tweet about driving your Tesla like an RC car with your phone.  Rip your put", "score": 1, "replies": []}]}, {"body": "rookie here, what app is this?", "score": 1, "replies": [{"body": "Robinhood for iOS ", "score": 1, "replies": []}]}]}
{"title": "Is it a good idea to play with a little more money than you're comfortable losing?", "selftext": "Like, here's the thing. I played around with like.. $3,000 last week.. I've been playing with it for a few months in options, but whenever I had a chance to take profit my mentality was like \"ehh.. fuck it. It's only $3k, I'm not that bothered to take profit\", but if I played with a little more money, maybe $5k, I'd have a different mentality. $5k is probably $1k more than I'm comfortable playing around with so I'll be extra careful and take profit when I can. \n\nIs this a good idea? I lost my $3k from a week ago playing with AMZN lol but I had several changes to take profit. ", "id": "9t2rly", "created_utc": 1541018957.0, "score": 14, "upvote_ratio": 0.66, "num_comments": 42, "comments": [{"body": "rule 1: never wager more than you're comfortable losing.\n\n&#x200B;\n\nyeah sounds good man go for it.", "score": 152, "replies": [{"body": "Yes max out your credit cards and student debt so it is someone else's money you are losing.", "score": 27, "replies": [{"body": "And short the market! ", "score": 6, "replies": []}]}, {"body": "4R.-RC]8o.zp#1lwUWs(IV~zJk#r,U!Q#4)4S4ns^U<sbnsfgv)<QMTL285MnLy1eME,eLM0[d+EO$MWP!<fHtPdeKV>", "score": 2, "replies": []}]}, {"body": "No, but any loss will sting no matter what.", "score": 33, "replies": [{"body": "That's not true. I lost $3k last week and I literally felt nothing.", "score": 7, "replies": [{"body": "I hate losing 5 bucks my dude.", "score": 74, "replies": [{"body": "I hate paying my bills every damn month. But my portfolio swings $5k in either direction, it's whatevz.", "score": 20, "replies": []}, {"body": "I hate winning money ", "score": 12, "replies": [{"body": "You came to the right place. ", "score": 3, "replies": []}]}]}, {"body": "That’s cuz you’re in denial. I lost 30k. Didn’t feel like it until the losses were realized lol", "score": 11, "replies": [{"body": "Oh live a little will you. ", "score": 1, "replies": []}]}, {"body": "So losing $3k is nothing ... but a extra grand would make you care a lot and push you over the edge!? If you had said if you lost $500 it’s whatever but if you lost $5k you would care makes more sense. ", "score": 8, "replies": [{"body": "Psychology is weird huh", "score": 0, "replies": []}]}, {"body": "Bullshit", "score": 2, "replies": []}, {"body": "Then there’s your answer. You’re comfortable losing more than 3k. Be smarter next time now go earn tendies ", "score": 1, "replies": []}]}]}, {"body": "no. you won't be more careful, you'll just be more stressed. don't put yourself in a position where your short-term or long-term actions are affected by a loss. I bought back in with margin as AMZN was dropping and thought I was smart to get in at 1632. then it dropped another 8% the next day. bag holding when it's your fun account is one thing. bag holding when it's your life savings is another. bag holding when you're margined out is where you drive yourself to suicide. don't do it.", "score": 23, "replies": []}, {"body": "You should operate with sums of money that doesn't make you super emotional and then develop a trading strategy if you want to be a good trader.\n\nIf you want to have fun being a degenerate gambler you could always amp up your leverage via shorter dated or further otm options and shoot for those big dick gains.", "score": 9, "replies": [{"body": "Just put it all on black", "score": 1, "replies": []}]}, {"body": "[It's okay you'll just get used to it over time](https://en.wikipedia.org/wiki/Boiling_frog)\n\nIt can also help to just not want to buy anything that costs over $1,000", "score": 5, "replies": []}, {"body": "I try do dick around with 2k in my options account. Once it gets over 4K I get emotionally attached and lose it back to 1k. \n\nSo now whenever I get my account above 3k I cash out and take it back to 2k and go from there. ", "score": 6, "replies": []}, {"body": "Rule #1 of WSB: Only wager what you can't afford to lose. You only get to YOLO once", "score": 7, "replies": []}, {"body": "Nah.", "score": 4, "replies": []}, {"body": "Scared money dont make money ", "score": 4, "replies": [{"body": "If I eva go broke, I'ma take yo money! ", "score": 1, "replies": []}]}, {"body": "I see a whole lot of r/personalfinance type shit comments.  The fuck is this place coming to?", "score": 6, "replies": [{"body": "people are asking /r/pf type shit questions. what do you expect. next someone is going to ask if it's ok to dca into a vanguard mutual fund.", "score": 2, "replies": []}]}, {"body": "It's not about what you're comfortable losing, it's about what you can AFFORD to lose. ", "score": 3, "replies": []}, {"body": "Go ahead, but give your shotgun to one family member and the shells to another one. You might be tempted", "score": 3, "replies": []}, {"body": "You had several chances to profit yet still lost it.\n\nHow you think $5k is going to go? You can be as careful as you want but you don’t control the market. You’re still going to be a dumb shit, but a dumb shit with $2k more to lose.", "score": 2, "replies": []}, {"body": "Volatility is a little too high right now and unless you know how to read and see the fake drops and rallies, you need to buy vertical spreads and or sell puts otm or only buy calls/puts after big movement..\n\n  \n\n\nYesterday I saw UVXY rise up to 65-67.. and then I bought 2 $68 puts yesterday evening and then I closed them unfortunately a little too early but made like $350 today just with 2 puts on UVXY becaus I know it always decays down but I waited and watched prices of options and waiting to see how high it would go. Etc..\n\n  \n\n\nSo if that makes sense, only play options on big movements and if the volatility is too high, then sell puts or buy vertical spreads and close everything when you see profit\n\nDon't let the market do what it does every day and take your profit during these volatile times.\n\nUnless you catch something at the bottom or etc..", "score": 6, "replies": [{"body": "I made 30k today ignoring your advice", "score": 2, "replies": [{"body": "What does even mean? You bought calls on volatility??", "score": 1, "replies": []}]}, {"body": "The market does not take your profit, I take your profit", "score": 1, "replies": []}]}, {"body": "No", "score": 1, "replies": []}, {"body": "Straddles", "score": 1, "replies": []}, {"body": "YOLO", "score": 1, "replies": []}, {"body": "Fuck itttt", "score": 1, "replies": []}, {"body": "Try taking 3k and turning it into as much cash as possible like you are broke and that's the only money you have to invest. ", "score": 1, "replies": []}, {"body": "It's a bad idea, because as soon as you're down 10 or 20% you'll want to sell immediately. I'm mostly talking weeklies here, where u can lose 10-20% in a few minutes. If trade doesn't immediately go ur way, you'll sell at a loss so much... Always trade with amounts that you feel cool as a cucumber the whole time, and you'll have a much better healthier time. ", "score": 1, "replies": []}, {"body": "If you play with your rent money you're guaranteed to get awesome returns or get evicted so I think the theory works!", "score": 1, "replies": []}]}
