{"title": "Using VIX For Stocks", "selftext": "Is there a method to transform VIX to be used for stocks? I realize the VIX is market wide, but is there any way to make it work for any individual stock? Can you multiply by the absolute value of beta? I'm looking at doing some historical backtests, but historical IV is expensive and there's no free way I can find.", "id": "fvo3au", "created_utc": 1586130509.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 21, "comments": [{"body": "You know you can see the IV of any option on almost all brokers?", "score": 3, "replies": [{"body": "Yes, but not historically. I need to be able to see the historical IV for the backtest", "score": 2, "replies": [{"body": "Ah. Other than getting the data, I don't think you can. If you have an interesting analysis in mind, you might reach out to tastytrade to see if they have done a piece on it or propose it to them.", "score": 2, "replies": [{"body": "I was looking through the list of market measures videos today... they probably have it lol", "score": 1, "replies": []}, {"body": "Yeah, the data just costs a bunch of money.", "score": 1, "replies": [{"body": "How much and where can I buy it? Might be a good investment for me", "score": 1, "replies": []}]}]}, {"body": "Calculate the IV yourself from the historical data.", "score": 1, "replies": [{"body": "Even getting that data is expensive. I can't find anywhere that has historical option prices for free", "score": 1, "replies": []}]}]}, {"body": "You're right - it looks like OP just wanted historical implied vols. \n\nHowever, the VIX is derived from a constructed variance swap (which in turn is priced off a strip of puts and calls on SPX at different strikes), not a single implied vol from an SPX option. You could create something analogous for stock XYZ instead of the SPX.", "score": 1, "replies": []}]}, {"body": "First of all, the Vix isn't even that great of a stand in for SPX option IV, and SPX options are what the Vix is actually based on. Right now the Vix is at 46.80, but 24-day out SPX ATM options are around 41-43% IV and options that are 10% OTM are at 50%+, so the Vix differs pretty widely even on the ticker that's used to calculate it.\n\nUsing the Vix as a stand in for historical option IV on a different stock would probably be even less accurate for backtesting a strategy. No stock truly follows the SPX identically and a particular stock's options probably follow SPX options even less well.", "score": 2, "replies": [{"body": "VIX isn't meant to estimate IV of SPX options", "score": 1, "replies": [{"body": "Right, that's pretty much the takeaway for OP.", "score": 1, "replies": []}]}]}, {"body": "Yea, there's somewhat of a correlation but the main problem is if you use it for individual stocks, you have to take out the risks associated with each ticker.\n\nFor example, individual earnings wil screw it up if you decide just to use VIX.\n\nI supposed for like March, if you take out all earnings, VIX can sort of be accurate.  It won't be completely accurate as I've seen some historically lower vol stocks move up a lot more in IV than historically higher vol stocks.  However, they all have generally moved up when VIX goes up and down when VIX goes down.  If you can't find any other data, it's not a terrible proxy but it just won't be great results.", "score": 1, "replies": [{"body": "Yeah, atm I'm using straight VIX", "score": 1, "replies": [{"body": "Yea ask your broker to see if they can provide you with some historical IVs for your tickers.  Or I guess you can start tracking now into a database and do this analysis a month from now.", "score": 2, "replies": [{"body": "I've thought of this", "score": 1, "replies": []}]}]}]}, {"body": "Seems like something you might be able see with OnDemand from TOS", "score": 1, "replies": [{"body": "What is OnDemand?", "score": 1, "replies": []}]}, {"body": "This might help:\n\nhttps://www.macroption.com/vix-calculation/\n\nThere's a way to calculate VIX from the premiums of certain SPX options. The process, and thus eqution, seem complex. I'm sure you can do the same with individual stocks but.. good luck. It doesn't sound fun. Maybe you can do some algebra to see if there's a way to incorporate beta for an easier calculation, but it doesn't seem likely.", "score": 1, "replies": []}, {"body": "Just use TOS... This and much more is easily accessible.\n\nIt'd be labor intensive to try and back test because you'd have to retrieve all the data manually.", "score": 1, "replies": [{"body": "Can you download historical implied volatility with them?", "score": 1, "replies": []}]}]}
{"title": "How does gold work?", "selftext": "When gold prices go up do you... :\n1. sell gold and invest it elsewhere while the market is down\n2. sell it as a way to fight inflation and remain your purchasing power\n3. ???\n\nWhat is the purpose of buying gold & how should it be used from an investor’s point of view?", "id": "fvml09", "created_utc": 1586124858.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 20, "comments": [{"body": "You have to store it, and it doesn't pay a dividend, so to speak.  But, over time, it can help protect you from inflation.  \n\nI can remember buying 1 oz gold coins for $300 or so, back around 1990?  Today, everything is more expensive, as is gold.", "score": 6, "replies": [{"body": "That's exactly the wrong sentence...\n\nGold didn't get expensive because gold is only being Produced in low amounts and limited by nature. \n\nThe right sentence would be: Today, my money is worth less than before.\n\nGold doesn't get more expensive or cheaper your money gains or rather loses worth.", "score": 7, "replies": [{"body": "Sure, but you retain value.  It's all relative, right?  The dollar loses its value, and so gold appears to get more expensive.  But really, the gold buys about the same thing, per ounce, and it's the dollar that has been depreciating.  \n\nFrom what they say, you could buy a good man's suit for an ounce of gold back in the 1800s.  Ditto for today.", "score": 2, "replies": []}, {"body": "I don't think it's exactly the wrong sentence. I think it's correct to speak of gold getting more expensive. We're not on a gold standard. People value things in dollars, not gold. They buy things in dollars, not gold. At some point in 2012 gold was about $1800 an ounce. Ten years earlier, in 2002, it was $300 an ounce. Gold was six times as expensive in 2012. Sure, there'd been inflation, and the dollar had lost some if its value, but it hadn't shrunk to a sixth of its former self. People weren't paying six times as much as formerly for their basic goods and services. Gold was more expensive because people (the market) decided to value it more.", "score": 1, "replies": [{"body": "I mean sure gold does get more expensive if demand  becomes higher and supply decreases as we see it now. But that's only a small part to it.\n\nGold standard is a whole other thing.\n\nGold standard would be 1 € is always 1g gold.\nWhat we don't have anymore because it would slow down economic progress. And in certain ways diminish control of the government.\n\nIn order to print more money you would have to buy gold at the same time so value stays the same.", "score": 1, "replies": []}]}]}, {"body": "Wow, very nice. Did it seem like a risky purchase back then that could potentially backfire?", "score": 1, "replies": [{"body": "I mean no it would stabilize the economy in a way nothing else could. But it hinders progress. Banks couldn't just give unlimited amount of loans. Loans which could be used to push economic growth. Because every time a bank wants to give out a loan it has to be backed by gold. But from recent developments I suppose that our new financial system after this crisis is gonna be a mix of gold standard backed by gold silver and in Germany (2022 also platinum) if the law passes and infinite digital money.\n\n\nHave no fkn clue how this is gonna work out and which new traps the will be for there people of the the future, but surely interesting.", "score": 1, "replies": []}]}]}, {"body": "You buy it. Put it in your safe and feel like a pirate for a few years. Occasionally you look at it because it’s gold. Forget you have it again. Give some away as gifts. Forget you have it again. See on tv the price “shot up” by $80 an ounce. Sell the rest. Forget about it. Then freak out thinking you want to have it or need it or it’s just cool and then buy some more. Repeat.", "score": 5, "replies": [{"body": "Makes sense, appreciate your story!", "score": 3, "replies": []}]}, {"body": "What you should do with gold is not selling it.\nKeep it as a last reserve in case you need to sell it to pay bills.\n\nSell when crisis is over and economy starts booming again. Safe call would be right after a currency reform.\n\nThen you invest that money to create more money and slowly buy gold again till new crisis hits. (key is buying gold before everyone else does)\n\nGold loses value while economy is in the booming phase.", "score": 3, "replies": []}, {"body": "Hit up r/silverbugs if you want to find out a little more. Sure, silvers in the name, but it’s a solid community of precious metal collectors, silver, gold, platinum, palladium, etc. I invest in precious metals because I love being able to hold a nice bar in my hand, the artwork put into the coins, the physical, ever growing collection, and knowing that PMs retain their value well in relation to the USD. Of course precious metals are only a relatively small part of my portfolio, but it’s very fun to me to break out the stack and admire it all. I’ve even gotten my 7 year old to invest in some silver, and he gets an ASE from the tooth fairy every time he loses a tooth", "score": 1, "replies": []}, {"body": "Imagine\n\n2€ = 1 bread = 10g gold (simplified) 01.04.2020\n\n500€ =1 bread = 10g gold 01.09.2020\n\nSee what happened to money due to inflation.", "score": 1, "replies": []}, {"body": "Gold can go down but it's pretty independent to the stock market and the value of a dollar. It is great for protecting against inflation and poor stock market performance.", "score": 1, "replies": [{"body": "Well you could also say gold is its own stock that is pretty stable. It has its up and downs yeah but it usually isn't very volatile. Also it tends to go up with yearly inflation. So to speak trend is upwards.", "score": 1, "replies": []}]}, {"body": "I’m assuming it’s better to buy if you think we may go into a recession or inflation but not sure", "score": 1, "replies": [{"body": "It's not that simple but right nevertheless.\n\nIt always depends on what the stock and companies behind it do when a recession hits. \n\n20 dollars was definetly good if people bought it. \n\nBut everything in me tells me it will go lower then 20.\n\nI do not know exactly when, I was hoping for it to be March but I was proven wrong(too early I guess). \n\nThen again wti and brent are etfs so buying into that is less risky in itself. \n\nBut this juggling from Russia and Saudis, makes me feel like they want it. OIL is a Rollercoaster right now because they keep saying we stabilize, no we don't, yes we do, no we don't. \n\nMy feeling tells me they are stretching this until stockpiles are full and that's definetely when oil prices will go below 20.", "score": 2, "replies": [{"body": "Yeah thx for the info", "score": 1, "replies": [{"body": "Did a little research.\n\nThats the death clock for oil.\n\nhttps://news.ihsmarkit.com/prviewer/release_only/slug/2020-03-26-oil-storage-vulnerability-which-countries-have-the-least-capacity-to-spare-as-crude-demand-declines-and-supplies-build-up", "score": 2, "replies": []}]}]}]}, {"body": "Watch  global currencies, watch what the fed is doing, form a game plan, then do the exact opposite.", "score": 1, "replies": []}, {"body": "https://stocktwits.com/symbol/NRZ", "score": 0, "replies": []}]}
{"title": "Airbus", "selftext": "Is airbus a long term buy at 13? This company has already been deemed as too big to fail similar to Boeing. Or are we safer investing in JETS ETF?", "id": "fveciz", "created_utc": 1586096262.0, "score": 12, "upvote_ratio": 0.84, "num_comments": 28, "comments": [{"body": "Imo Airbus is a safer investment right now, seem to have better management to handle this. Boeing was in a mess before covid. Also I expect that, if necessary, Airbus would get a bailout from France+Germany just like Boeing  would get in the United States.", "score": 13, "replies": []}, {"body": "Safer and airlines don't share headspace for me the next few months", "score": 4, "replies": []}, {"body": "It's looking pretty decent.", "score": 1, "replies": []}, {"body": "Theyre still trading at too high of a p/e imo", "score": 1, "replies": []}, {"body": "I happen to think when the dust settles Boeing wins the market share war over airbus. \n\nNot seeing good things in the European news cycle right now relative to the United States.", "score": 1, "replies": [{"body": "How so? Airbus is currently leading in the narrow body market which is arguably the market with more growth potential in the near future. \n\nBoeing hasn't caught a break since the entire 737 MAX debacle and with John Hamilton retiring amid the crisis, I am not confident that their problems will be resolved quickly.", "score": 5, "replies": [{"body": "I’m basically throwing past developments out and making a prediction that the European market that airbus primarily services is gonna be gutted by this pandemic in the next couple weeks.\n\nLook at post ww2 geopolitics as a model maybe. You don’t have to be super strong in the aftermath to succeed.", "score": 1, "replies": [{"body": "Do you really think the European market is getting hit harder than the US market by this pandemic? Post ww2 was a totally different situation. Europe was actually destroyed and America won the war. I don't see a clear winner at the end of this pandemic (except maybe China if their numbers are not fake)\n\nMoreover, most major airlines buy aircrafts from both Boeing and Airbus to ensure that if one aircraft maker messes up (like the 737 Max 8 being grounded) they still have half a fleet operational.", "score": 1, "replies": []}]}]}]}, {"body": "Airbus isnt at 13", "score": 0, "replies": [{"body": "EADSY?", "score": 6, "replies": [{"body": ">EADSY\n\n[**AIR.PA**](https://AIR.PA) :-)", "score": 1, "replies": []}]}]}, {"body": "You’re safer investing in JETS but your return will be less and slower because it contains all the airlines that will fail or get really hurt.", "score": 0, "replies": [{"body": "What's JETS?", "score": 1, "replies": [{"body": "An ETF that contains all or most of the major airlines in the US. You invest in JETS to invest in all airlines just a little amount each.", "score": 1, "replies": []}]}]}, {"body": "Airbus is subject to tariffs that Boeing isn’t. \nBoeing is also an American company and can be bailed out by government. Airbus is not.", "score": -17, "replies": [{"body": "well that was a very us-centric comment", "score": 17, "replies": [{"body": "My point is that we can be pretty confident that Boeing will be bailed out. \nBut absolutely 😅😅", "score": -2, "replies": [{"body": "I think the chances of Airbus going to bankrupcy is slimmer than Airbus', but even if they do I think the EU would bail them out, Airbus is very important to the EU, without it, they would be dependent to the US for aircrafts", "score": 3, "replies": []}]}]}, {"body": "Airbus could be also bailed out by Europ.", "score": 8, "replies": []}, {"body": "Macron has already mentioned two companies are first on his list if they ever needed a bailout: Air France and Airbus. So Airbus is not ever going to go belly-up. Not that Airbus needs a bailout right now. They recently got a new loan and are now sitting on 30 billion euros in liquidities. \n\nBesides, much like the USA had a case running against Airbus for illegal subsidies, the EU also has a case running against Boeing for illegal subsidies. So it is very realistic Boeing will be subject to European tariffs soon enough as well.", "score": 5, "replies": []}, {"body": "A bailout is not a positive for shareholders. Look at GM and AIG circa 2008.", "score": 1, "replies": [{"body": "Not necessarily. \nI’d rather have a bailout than bankruptcy", "score": 0, "replies": [{"body": "At that point either doesn't make much of a difference.", "score": 3, "replies": [{"body": "If they went bankrupt, wouldn’t the stock be worthless? At least with a bailout, the stock would be worth something.", "score": 1, "replies": [{"body": "Losing 99% or losing 100% doesn't make much of a difference.", "score": 1, "replies": [{"body": "Lol they wouldn’t lose 99% lol", "score": 0, "replies": [{"body": "Look at what happened in 2008. GM shareholders lost everything, AIG shareholders lost roughly 95%.\n\nThe GFC bailouts are one of the most misunderstood pieces of the period.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Airbus is in a way better position than boeing. Boeing  may never return to what it was. Airbus cancellations are nowhere near what Boeing's is at this point.  after the economy is turned back on boeing still has a ton if planes that cant fly", "score": 1, "replies": []}]}]}
{"title": "5 Stocks Worth Watching Monday", "selftext": "TSLA- Thursday night was unlike anything I’d seen after hours.  Friday brought us back to reality.  What does Monday bring- another surge to $500+, or more of a sell off from Friday?  Lots of people (myself included) “waiting” to buy in once it gets to $400.  One of the most turbulent stocks out there, and Musk is supremely confident in the brands ability in Q2 and beyond. \n\nFANG- everyone is supremely bullish on them, and I feel like I’ve waited too long, but they’re still well below their 52 week high.  I don’t know much about fracking, other than that it’s extremely controversial.  Floating around $32 right now, is that a good buy in point?\n\nDAL- Buffet’s sell off sent a lot of people into a tizzy, but based on what I’m seeing, the amount he sold was a strategic number to avoid “insider trading rules” of some sort.   They still seem to be a much safer bet than AAL or UA, and they’ve dipped below $20/share.  Is Monday a good time to strike and hold on for the long haul?\n\nDEAC- The parent company of FanDuel has been a big talking point in these forums.  With MGM and ElDorado looking like a marriage about to happen, no one knows which of the two stocks will be more valuable.  PENN is everyone’s favorite courtesy of Dave Portnoy and his corny ass “DaVeY DaY TrAdEr” schtick, but it’s supremely volatile, and I just wait for it to fall under $10 and sell it off later (done that a couple times).  52 week high of $19.20 for DEAC, but it is relatively knee and I only put it on here because of all the discussions I’ve seen around it. \n\nCCL- the cheapest of the big 3 in the cruise industry, they’re down a mind boggling 83% the last three months.  No bailout money, but they’re not alone.  They seem to be the biggest of the 3 despite their low stock price, and cruises are already filling up reservations for 2021. Tie that in with the low price of oil right now (Sidebar- I’m in on XOM because oil just can’t stay this low forever) and they may be a steal under $10.  It’ll be a long row, but even making up 1/2 their losses would be a huge win for investors.  \n\nWould love to hear some thoughts from you all.  \n\nMy portfolio:\nBA\nAAPL\nXOM\nDIS\nMSFT\nCPE\n\n1/15/21  $7.50 call on BLMN @ $2.15", "id": "fvgm45", "created_utc": 1586104430.0, "score": 9, "upvote_ratio": 0.81, "num_comments": 24, "comments": [{"body": "TSLA has done that shit multiple times, huge AH swings happen it seems like quarterly with them.", "score": 7, "replies": [{"body": "The bounce of TSLA after announcing 1st Qtr production of 89,000 units was insane given that 70% of their max 10,000/day  vehicle production capablity is shut down as the Fremont plant is shut down and likely not to come back for months.  It is like the RH guys simply have no clue which I suppose is true.", "score": 1, "replies": [{"body": "imagine thinking day traders on RH had any effect on a commercial equity's price", "score": 3, "replies": []}]}]}, {"body": "How much does Buffet still own in Delta? \n\nThe couple things I’d suggest are that there are very real bankruptcy concerns for all cruise lines and all airlines right now. In fact, I’d bet on several (if not more of them) filing as soon as they’ve officially tripped their debt covenants and defaults are declared. Not all buy low opportunities are steals. Many of them are really on their way to worthless (where they’ll just reorganize with new owners and equity gets left with nothing).", "score": 3, "replies": [{"body": "Thanks for the insight!\n\nRegarding Buffet, I think it’s still about 9% of his portfolio, if I’m reading this correctly:\n\nWarren Buffett's Berkshire Hathaway sold nearly $390 million worth of shares in Delta Air Lines and Southwest Airlines this week, reducing its exposure to an industry being hammered by the coronavirus pandemic.\n\nThe famed investor's conglomerate slashed its roughly 11% stake in Delta by nearly one-fifth, from 71.9 million shares to 58.9 million, according to a Securities and Exchange Commission filing published on Friday.\n\nBerkshire also sold about 2.3 million shares in Southwest, reducing its stake in the airline by just over 4%, another SEC filing showed.", "score": 1, "replies": [{"body": "Ok, so he dipped below ten percent and 5 percent, respectively. In DAL that means he doesn’t have to report transactions within two days under section 16 (unless he’s on the board), so he will have some more freedom to make moves without reporting transactions. He also won’t be subject to short swing anymore. He will still have to file schedule 13s less frequently though, but I don’t know if he’s a D or G filer (which will impact when he’ll have to file amendments to those filings).\n\nIf he’s under 4% in Southwest, he no longer has any filing obligations (again assuming he’s not on the board).\n\nThere is some strategic benefit to not having to report your transactions. But, I think you could make a much stronger argument that he’s fleeing the ship before a bankruptcy filing.\n\nBut, I haven’t really looked into it. And god knows Buffet is a master... so he may be making a strategic play. Who knows.", "score": 2, "replies": []}, {"body": ">Regarding Buffet, I think it’s still about 9% of his portfolio, if I’m reading this correctly:\n\n>[the] conglomerate slashed its roughly 11% stake in Delta by nearly one-fifth, from 71.9 million shares to 58.9 million,\n\nThe 9% refers to outstanding shares of Delta, not the valuation of BRK.B\n\nthe numbers reveal Delta has +/- 630mm shares outstanding. Apply the numbers, see what he did.", "score": 1, "replies": [{"body": "Thanks for the clarity 👍🏻.  Wouldn’t know where to begin however regarding applying numbers to Delta’s outstanding stocks and what the results would be", "score": 1, "replies": [{"body": "11% of 630mm... 9% of 630mm ... Subtract, gee, that's Buffet's transaction!", "score": 1, "replies": []}]}]}, {"body": "Monday the airline are gonna get destroyed. Buffett waited till the end of the day on Friday to sell his shares. It dropped pretty hard after hours but most people only trade during normal hours. Massive short", "score": 0, "replies": []}]}]}, {"body": "If I *had* to buy a US unconventional oil player, I could do worse than Diamondback.  One of the few with reasonable leverage, and they were even upgraded by Moody's in November.\n\nBut it's hard to over-stress how much the current price environment pins US producers to the wall.  It's no secret that the Saudis and Russia want this sector to die (Canada should want it to die too, because its artificial growth screwed us pretty badly; but we're too polite). \n\nStay out unless you can convince yourself that FANG will be around to gather up the husks of the industry.", "score": 3, "replies": [{"body": "November is ancient history, now. And fracking is going into hibernation while the Saudis get their market share back.", "score": 1, "replies": [{"body": "Yes, November is ancient history.  With that said, you can't \"hibernate\" with creditors at your doorstep.  Diamondback has fewer of those.\n\nBut if it's not clear, I still wouldn't invest.  Hence the \"if I *had* to\" qualifier.  Not sure how much more strongly I'm supposed to hedge my statement.", "score": 1, "replies": [{"body": "Okay, I didn't absorb your qualifier. That said, Oil is less likely to reward you in the near or mid term.", "score": 2, "replies": [{"body": "I'm playing because I was already in.  But I'm having to day-trade to stay in the black on these stocks because the volatility is just nonsense.  And I own zero shale because that industry was already dead.\n\nSo... yeah.  Anyone without sector expertise and money to lose should stay away.", "score": 3, "replies": []}]}]}]}, {"body": "Thanks Rag,\n\nI know little to nothing about fracking (EDIT: I know nothing), like I said the only reason I even have them on my watch list is that all I see are bullish viewpoints.  Robinhood (I know, they suck lol) has then at 91% buy with like 37 investors voting. Oil being so cheap makes me think that’ll be the better hold (XOM, CPE)", "score": 1, "replies": [{"body": "Whiting Petroleum is a 30+ year old company that went all-in on shale - they're in Chapter 11 now.  Diamondback is a bit better positioned, but it's really hard to see how they come out of this unscathed since the best we can possibly hope for from the OPEC thing is a return to conditions where only COVID is impacting prospects.  That's still a 30% hit to the market (for comparison, some Canadian oil stocks were down as much as 90% after the one-two punch), so it still means a lot of companies are going to be in trouble.\n\nWith COVID expected to be in play for as much as 18 months, that means bankruptcies are inevitable.  I won't tell you not to buy, but I will tell you that you're playing roulette.  Be honest with yourself about that and play accordingly.", "score": 2, "replies": []}, {"body": "I’m with you on XOM", "score": 1, "replies": []}]}]}, {"body": "I haven't seen a good debate on which cruise stocks are better than others in a while..\n\nIn terms of buisness track record, I'm a big RCL fan.. but I heard they had an employee die recently of Covid-19\n\nNCLH were in the hot seat... there is a class action lawsuit from downplay of the virus.. \n\nCCL also have lawsuits due to covid from the Grand Princess and Diamond Princess ships...And now they added a $6billion loan to their books to last them to next year...\n\nWhich one is handling things the best?", "score": 1, "replies": [{"body": "I feel like the first line was sarcasm LOL...\n\nEasy answer would be to avoid all of these. But the majority of my portfolio is solid long term blue chips. I’d like to try and make bigger returns on one of the other stocks, ie a cruise liner or airlines.  \n\n“Which one is handling things the best” seems like picking the best of the worst at this point lol.  I don’t invest enough to gamble on a lot of RCL since they’re like $28 a share, but who knows.  \n\nTBH, of all those problems, having the one person die might be the easiest to recover from, as awful as that sounds.", "score": 2, "replies": []}]}, {"body": "CCL is currently under investigation by Australian homicide detectives and a possible colonial inquest could be launched, after 10 people died and 100's infected on the Ruby Princess that docked in Sydney.\n\nTread carefully with CCL.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I don’t think there’s anything easy about any of this... hence the long term outlook on some of these. \n\nIf I wasn’t a novice, I don’t think I’d be asking random strangers on reddit for their insight.\n\nI do know enough to see an opportunity on ROI during a low point with our economy.  I’m old enough to remember 2008 and wishing my 21 year old self had any money to invest.  \n\nSo any valuable insight is welcome.  I appreciate you diagnosing me as a 16 year old who thinks this is free easy money tho.", "score": 1, "replies": []}]}, {"body": "https://stocktwits.com/symbol/NRZ\n\nWatch only this one ☝️", "score": 0, "replies": []}, {"body": "Why are you buying stocks right now ? Time to sell.", "score": -3, "replies": []}]}
{"title": "Prophet of God calling for a world-wide fast on April 10 to provide relief from Covid-19, economic recovery, etc", "selftext": "[deleted]", "id": "fv5phy", "created_utc": 1586051295.0, "score": 27, "upvote_ratio": 0.66, "num_comments": 24, "comments": [{"body": "The only prophet I believe is Gordon the Gecko", "score": 83, "replies": [{"body": "I agree", "score": 11, "replies": []}, {"body": "Profits are my prophet", "score": 6, "replies": []}, {"body": "Praise be!", "score": 2, "replies": []}]}, {"body": "No source, just random shitpost. Not even a ticker or strike.\n\nBan.", "score": 22, "replies": []}, {"body": "Dum dum dum!!!", "score": 5, "replies": []}, {"body": "Prophet of God my ass. This guy is a huckster phony bullshit artist, head of a fake “religion” that is actually a Masonic/Satanic cult, swindler of millions of dollars from poor people in Latin America and Utah who pay tithing that goes into $100 billion hedge funds that don’t dole out a penny in charity.", "score": 14, "replies": [{"body": "They don't skimp out on their churches though. I'd be more outraged if they did", "score": 5, "replies": []}, {"body": "someones mad his portfolio is down 80% on puts while mormons are up to 100 billion. inverse WSB it is, and find out whatever the mormons did and copy that.", "score": 5, "replies": [{"body": "On the contrary, I pulled everything out of the market in December and didn’t take the 40% hit like many did. Anyone who couldn’t see this crash coming was blinded by greed and the thought that the market would go up forever.", "score": -3, "replies": []}]}, {"body": "you just jelly", "score": 2, "replies": []}, {"body": "Lol the fuck is a fake religion? Triggered as fuck", "score": 3, "replies": []}, {"body": "Someones triggered", "score": 1, "replies": []}, {"body": "AMEN !", "score": -1, "replies": []}]}, {"body": "Short food, got it.", "score": 3, "replies": []}, {"body": "Happening this Friday. Puts will print until then but after that pour everything into weekly FAR OTM calls.", "score": 2, "replies": []}, {"body": "Coronavirus is canceled. It is dog-gone. Pay attention.\n\n[https://www.youtube.com/watch?v=OSIrQBGfUtw](https://www.youtube.com/watch?v=OSIrQBGfUtw)", "score": 2, "replies": []}, {"body": "It's funny how he's picking April 10th since predicted the predicted peak for NY, LA, and MI is in 6 days\n\ngoing by what Debra told me", "score": 2, "replies": []}, {"body": "What did Allah say? Jihad?", "score": 1, "replies": [{"body": "aloha snackbar", "score": 2, "replies": []}]}, {"body": "That’s the face of a man that knows r/selffuck", "score": 1, "replies": []}]}
{"title": "The largest Stimulus Package in history", "selftext": "After Jerome Powel getting hammered he left the money printer to go brrrr. Right now the best move is to prepare for hyper inflation as the money supply is about to dilute the market. Don't believe me?[https://imgur.com/a/277HeOX](https://imgur.com/a/277HeOX)", "id": "fv75y0", "created_utc": 1586057625.0, "score": 77, "upvote_ratio": 0.79, "num_comments": 30, "comments": [{"body": "[deleted]", "score": 59, "replies": [{"body": "Looks more like some good ole D to me", "score": 11, "replies": [{"body": "DD == Dangling Dongus.", "score": 14, "replies": [{"body": "Aw, my bad.   I stand corrected", "score": 3, "replies": []}]}]}]}, {"body": "Good D, thanks", "score": 15, "replies": []}, {"body": "Came here to make a dick joke, saw it wasn’t needed. Well played sir", "score": 21, "replies": []}, {"body": "I mean the least you could do is flair this properly... As a fundamentals thread. \n\nOr if you’re lucky, futures 😏", "score": 6, "replies": []}, {"body": "For further DD look below\n\n[https://www.youtube.com/watch?v=ynaDOb7XK9c](https://www.youtube.com/watch?v=ynaDOb7XK9c)", "score": 6, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "had to dig through your moms old videos", "score": 33, "replies": [{"body": "Dads old videos", "score": 8, "replies": []}]}]}, {"body": "LOL this meme is hilarious", "score": 3, "replies": []}, {"body": "How did trump find that picture of my wife’s boyfriend?", "score": 3, "replies": []}, {"body": "This is so fucking retarded. Maybe read up on deflation before you worry about dumbass shit like this.", "score": 6, "replies": [{"body": "deleveraging takes time before we can normalize our debts and with this slow down in productivity and money printing yes it can occur look at 1970s monetary policy", "score": 3, "replies": [{"body": "Dont you see distribution of money to the masses, using the printed money to pay off debt, upcoming negative interest rates, and reduced spending as deflationary. Not to mention oil is getting fucked and it's cheap too. Just seems like theres a lot of indicators indicating a strengthening of the dollar kind of like what happened in 08. Sorry about the attitude, I'm a little drunk.", "score": 2, "replies": [{"body": "Peter Schiff followers are just getting excited that after waiting for hyperinflation for 12 years they might actually see some high inflation.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "Wrong Jerome", "score": 2, "replies": [{"body": "\"Right\" Jerome", "score": 1, "replies": []}]}, {"body": "Gayer than all bears combined. Ban.", "score": 2, "replies": [{"body": "you liked it", "score": 5, "replies": []}, {"body": "All at the same time?    \n      \nHave you seen the [Care Bear Stare](https://media.giphy.com/media/IJTCcELAbVgHK/giphy.gif)?", "score": 2, "replies": []}]}, {"body": "ban", "score": 2, "replies": []}, {"body": "Quality big D right here", "score": 1, "replies": []}, {"body": "i've got an inflation device at home. works well. can confirm.", "score": 1, "replies": []}, {"body": "Is that my real father?", "score": 1, "replies": []}, {"body": "Oh :0", "score": 1, "replies": []}, {"body": "Ban", "score": 0, "replies": [{"body": "Ban", "score": -1, "replies": []}]}]}
{"title": "How autistic is your country / state? Google covid location data in table format", "selftext": "Hello my favourite autists. As some of you may already be aware, Google released 'community reports' (see [https://www.google.com/covid19/mobility/](https://www.google.com/covid19/mobility/)) that show how much people in different countries / states are self isolating. The reports are calculated by pulling meta-data from those of us (myself included) who are too lazy or retarded to turn location data off on our smartphones. There are mobility trends for retail, groceries, parks, transit stations, workplaces, and residential.\n\nHere is all the data from the various PDF's scraped, searchable, and table-ized for your viewing pleasure:\n\n[https://docs.google.com/spreadsheets/d/1X9i7hbGkB3TK-wenbOlK47Y3LDOdm\\_Z179un8dtsX0I/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1X9i7hbGkB3TK-wenbOlK47Y3LDOdm_Z179un8dtsX0I/edit?usp=sharing)\n\nFeel free to check how irresponsible your fellow citizens are being and update this thread with your comments.", "id": "fva7w7", "created_utc": 1586073426.0, "score": 110, "upvote_ratio": 0.94, "num_comments": 26, "comments": [{"body": "As expected, Italy, Spain, and France are locked the fuck down... Retail & recreation (Places like restaurants, cafes, shopping centers, theme parks, museums, libraries, and movie theaters) is down by 94%, 94%, and 88% respectively. Holy fuck. \n\nSomeone smarter than me could do a correlation between the data in here and the new cases velocity on [https://www.worldometers.info/coronavirus/](https://www.worldometers.info/coronavirus/) \n\nBe interesting to see how much predictive value this dataset had.", "score": 37, "replies": [{"body": "New Zealand is down 91% but we only have like 60 new cases a day, we're trying a pre-emptive approach instead of waiting til our hospitals explode.", "score": 15, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "There are not enough of them", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Ah yes comrade true freedom.", "score": 1, "replies": []}]}]}, {"body": "Based on their fake numbers?", "score": 7, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Wait for wave 2", "score": 1, "replies": []}]}]}]}, {"body": "That's because New Zealand isn't real", "score": 2, "replies": []}]}, {"body": "Any idea if it’s real time, if not, how delayed?", "score": 2, "replies": [{"body": "It's not real time... Delayed by a few days.", "score": 5, "replies": []}]}]}, {"body": "New Orleans has the highest death rate in the U.S. and is the ground zero epicenter for the distribution of 'Rona yet they're still not locking down like you'd think a metropolitan city with those numbers would be.", "score": 15, "replies": [{"body": "N.O. gives zero fucks. \n\nOn average, I think they live 10 years or so less than the average American. Most common answer? We get more out of our 65 years than the average American would if they lived to be 200! \n\nThey'll get hit hard. Then they'll go right back to the party. Assuming the party even stops long enough to notice.", "score": 17, "replies": [{"body": "https://news.trust.org/item/20200402092110-6rvk1", "score": 6, "replies": [{"body": "They're certainly trying to say it nicely.", "score": 3, "replies": [{"body": "It's surprising to see large Keto & Healthy sections at Rouses in deep coonass country", "score": 4, "replies": []}]}]}, {"body": "George Bush doesn’t care about black people.", "score": 1, "replies": []}]}]}, {"body": "Good share.", "score": 6, "replies": []}, {"body": "germany about - 80% recreation and retail. us - 40% hopefully you get there soon.", "score": 5, "replies": []}, {"body": "Sweden is -24% in retail and recreation, parks +43% so not much self-isolating going on here", "score": 5, "replies": [{"body": "Sweden isn't and hasn't locked down. There was an article about how they may prove all other lockdown efforts stupid and wasteful.", "score": 5, "replies": [{"body": "Sweden & The UK are in the process of admitting their own lack of lockdown efforts were stupid these past few days", "score": 2, "replies": [{"body": "No its the opposite countries like denmark that took extreme populistic and emotional measures are planning to open up the country again very soon", "score": 0, "replies": [{"body": "\"Det er absolut sandsynligt, at vi kigger ind i en gradvis, kontrolleret, stille og rolig genåbning af Danmark.\"\n\n\nYou think this means anything? Really?\nI wasn't ever talking about Denmark, so I'm not sure when it became part of the conversation, but believing this is akin to believing Pence's \"15 days to end the spread\" posters", "score": 1, "replies": []}]}]}]}]}, {"body": "Goes to USA, looks at parks, stonks only go up", "score": 3, "replies": []}, {"body": "Ticker, strike, and expiry retard. \n\nAlso BAN", "score": -8, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}
{"title": "Stop betting against SPY, start betting against a company in the actual index - $AMD", "selftext": "[deleted]", "id": "fvf321", "created_utc": 1586099204.0, "score": 9, "upvote_ratio": 0.62, "num_comments": 28, "comments": [{"body": "Computer sales at record highs.  OP buys puts against AMD.\n\nThis is the retard shit I come here for.", "score": 71, "replies": [{"body": "Not only that, but their newest generation of chipsets are further destroying Intel in terms of cost, efficiency, and performance. They're only going to gain marketshare.", "score": 26, "replies": []}, {"body": "Yup, especially what OP didn’t considered is that Intel has been shitting 14mm for that past 4 generations and is about to release another set of 14++++++++ nm architecture while AMD is destroying Intel with its 7nm  nodes.   \n\nOh yeah, the AMD TDP is 65-95W while Intel is expected that be double that and has less cores and slower IPC.  \n\nOP is a genius retard.", "score": 14, "replies": []}, {"body": "Even with this in consideration, it’s PE is well over 100. And this is why I don’t bet against AMD, it’s got too much meme behind it. It would take the market falling much further for that to come undone.", "score": 3, "replies": []}]}, {"body": "AMD is a leading supplier to cloud computing and data farms and those are doing the opposite of slowing down", "score": 22, "replies": []}, {"body": "AMD maintained earnings guidance dude.\n\nhttps://www.marketwatch.com/story/amd-maintains-guidance-amid-coronavirus-scare-stock-moves-higher-2020-03-05", "score": 15, "replies": []}, {"body": "AMD is such a solid company rn, it may follow the market trends but all it needs is one more product launch for either zen 2 or rdna 2 and they will have insane competitive advantage over intel and nvidia, winning the fight on the cpu and gpu front. Plus they have deals with heaps of cloud computing/server organisations including google which uses amd shit for stadia.", "score": 8, "replies": []}, {"body": "Already inversed this bitch. 19 JUN $50 Calls", "score": 7, "replies": []}, {"body": "This is one of my inverse the consensus plays.  Small position but already in.", "score": 2, "replies": []}, {"body": "Glad I got AMD calls on friday", "score": 2, "replies": []}, {"body": "So calls it is", "score": 1, "replies": []}, {"body": "So calls it is", "score": 1, "replies": []}, {"body": "Cant wait for market to tank some more going all in on calls.", "score": 1, "replies": []}, {"body": "Buying Calls because this duck thinks he can fuck Lisa Su. \n\nSmh, I see no cocaine and strippers in your future", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I have IWM puts therefore I stopped reading after you said the drop is already priced in on IWM", "score": 1, "replies": []}, {"body": "Lazy DD, wrong conclusions, misunderstanding of the market, real money invested.\n\nI love WSB.", "score": 1, "replies": []}, {"body": "aMD supplies nuclear launch computers for nuclear missiles I doubt they’ll ever drop much I tried this it didn’t move at all.", "score": 1, "replies": []}, {"body": "Wow I knew bears were gay, but I had no idea a person could be this gay.", "score": 1, "replies": [{"body": "So gay he's turned straight. Never thought I'd see the day.", "score": 2, "replies": []}]}, {"body": "This is the most retarded thing I read in this subreddit.", "score": 1, "replies": []}, {"body": "Hmm, sir, this is a wendys", "score": 0, "replies": []}]}
{"title": "Zoom Communications and the Chinese Government", "selftext": "I heard this from my wife's boyfriend's daughter's father's boyfriend so you know it's good. He's also Chinese and works closely within the tech space.\n\nZoom's operations in the US is limited to mainly advertising, sales and customer support. There's a light group of software engineers, but those are mostly front end.\n\nThe back end - the real tech - is all developed in China. Why? Because it's cheap and Chinese engineers are actually very good and able to work the schedule. Thus, essentially ZM is like WeBull, but on a way more scary scale because they collect all kinds of data - biometric, business, communications and more.\n\nIn order to get to this size, and being located/closely linked to China, of course the Chinese government is involved. The Chinese government sees this as a golden goose that just dropped into their laps - and conforms with what the Chinese government wants: foreign data (again, biometric, business and communications). The fact that ZM has had so many issues with privacy in recent days is showing cracks in the dyke: Chinese engineers don't care about privacy and thus don't work it into the software, and all this leaked data of course finds its way to the Chinese government.\n\nTLDR: ZM will have its own LK moment or worse as they are implicated with the Chinese government. We just don't know when. ZM $50p Mar 2021. Might as well MSFT $200c Mar 2021 to hedge.", "id": "fvj571", "created_utc": 1586113177.0, "score": 82, "upvote_ratio": 0.86, "num_comments": 25, "comments": [{"body": "So you heard it from your wife’s boyfriend’s boyfriend? Is that you?", "score": 29, "replies": [{"body": "No, because I am not fucking my wife but she keeps getting these nasty STDs.", "score": 18, "replies": [{"body": "My bad bro", "score": 7, "replies": []}, {"body": "Keep the dream alive! The chain can still be close:\n\nWife's boyfriend - could be her father\n\nBoyfriend's daughter - could be the wife\n\nDaughter's father - her father again\n\nFather's boyfriend - you.", "score": 2, "replies": []}]}]}, {"body": "How about you at least glance at the option chain before recommending specific options?\n\nZM doesn’t even have Mar 2021 options dumbass", "score": 22, "replies": []}, {"body": "ZM 50p 5/15, conditional on my work (bank) to stop conferencing/team meetings via ZM", "score": 17, "replies": [{"body": "Just send out some codes to people to zoombomb the conferences. Like free money", "score": 8, "replies": [{"body": "How?", "score": 1, "replies": []}]}]}, {"body": "Zoom is expressly prohibited for use by at least some govt organizations\nI thought it odd that it was forbidden but now I know", "score": 11, "replies": [{"body": "In some govt orgs they have to go through rigorous security checks to get approved to be loaded on networked computers. If it’s developed by a foreign company you can bet your ass it’ll get denied.\n\nThey have emailed people in the past to warn about TikTok and FaceApp and how it could jeopardize people’s security clearance because of the serious security and privacy issues.\n\nSomeone had actually requested a program that tracks all your passwords on the cloud. We had a good laugh about that one when we were looking through a list of denied programs.", "score": 7, "replies": []}]}, {"body": "CIA has entered the chat.", "score": 9, "replies": []}, {"body": "Them premium are thousdands my pp can't handle tho", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "+1 for spreads. Naked call on a hype stock like ZM is not an honorable way to die", "score": 1, "replies": []}]}]}, {"body": "I dunno it kinda sounds retarded but u have a point. I wouldn’t think that ZM would end up like LK in terms of fake profit but very interesting.", "score": 3, "replies": []}, {"body": "*Why? Because it's cheap and Chinese engineers are actually very good and able to work the schedule.*\n\nHalf right....", "score": 7, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "STOP; You had me at \"showing cracks in the Dyke\"", "score": 1, "replies": []}, {"body": "Thats a serious nose dive, I think it’ll go down but damn their 52 Week Low was like 59.94, I don’t see them bottom out that quick. Not 5/15 quick, but I hope so because SPY puts", "score": 1, "replies": []}, {"body": "5/1 100p. Pray for tendies", "score": 1, "replies": []}, {"body": "Police Raid a prayer meeting happening in China, where people were using zoom. Apparently the police were able to see who was online, and where they were, without the participants knowing...\n\nThis is disturbing.\n\n[https://www.express.co.uk/news/world/1268622/china-Christians-arrested-easter-Sunday-church-service-zoom-police-china-news](https://www.express.co.uk/news/world/1268622/china-Christians-arrested-easter-Sunday-church-service-zoom-police-china-news)", "score": 1, "replies": []}]}
{"title": "A look into ITCI", "selftext": "So here's my first attempt at a DD\n\n&#x200B;\n\nIntra-Cellular Therapies Inc (ITCI) is a pharmaceutical company that tries to find new solutions for nueropsychiatric and neurologic disorders. (Yes that means stupids like us).\n\n**Outline:**\n\n1. **Current medicines**\n2. **Upcoming medicines**\n3. **Why now**\n\nNo need to even go to the bottom, **TL;DR SPY 220p 4/20**\n\n&#x200B;\n\nIn December, ITCI got FDA approval for a new drug, Caplyta, for adults with schizophrenia, which became available in pharmacies on March 23. Stock price shot up form $12->$35 as pharma stocks normally due after approvals. Following the trend, it started to decline until there was a stock offering, around $29 for 10,000,000 shares and then it was hit by the CC (corona crash) and is now sitting at $15.81.\n\nTheir, drug, which on the word of my psychiatrist is quite novel, and only has mild side effects. But that is besides the point. Effective drug, mild side effects and 3.5 million adults means some decent sales.[some numbers or something](https://sardaa.org/resources/about-schizophrenia/)\n\n&#x200B;\n\nBut that's not even the best part, they have a few trials in phase three for Biploar depression and Dementia.\n\n&#x200B;\n\nhttps://preview.redd.it/20sdqqpfu1r41.png?width=1226&format=png&auto=webp&s=aa351c357f85d79c66d38c97d14203889ab0b09c\n\n[Image Link](https://www.intracellulartherapies.com/technology-and-pipeline/)\n\n**Yes yes, an FDA approval**, even in phase 3 can take up to three years or more. But here is the saucey part, the same drug that got approved for schizophrenia is the one currently on trial for bipolar and dementia (along with the necessary additions). While this doesn't prove a lot to us, we do know that this drug has already been approved for other disorders, so it seems the safety of it may no longer be on trial, but rather the effectiveness of treating other disorders. Now I'm not well versed on FDA approvals, and I'd ask anyone to read more about it, or ask someone who knows a bit more the process before listening to anything I say here.\n\n&#x200B;\n\n**The last point**, people don't stop buying medicine during a virus, people are still going to need their pills. So while the stock is already priced down because of corona, it might be worth taking a look at investing, because if there earnings is at all good, then the company is probably going to go from being your average pharma stock, to perhaps having a few reasonable treatments on the market.\n\n**EDIT:**\n\nSorry to break whatever order I had when I started, here is a link providing specific information about the drugs currently in trials: [10-Q](https://ir.intracellulartherapies.com/news-releases/news-release-details/intra-cellular-therapies-reports-fourth-quarter-and-full-year-5), or if you don't want to read that:\n\n\" Our global adjunctive bipolar depression Phase 3 trial, Study 402, is ongoing.  We anticipate reporting topline results from this trial in mid-2020. \"\n\nand\n\n\" Subject to the results of Study 402 and our interactions with the FDA regarding our bipolar depression program, in late 2020 we expect to submit a supplemental new drug application (sNDA) to the FDA for regulatory approval for lumateperone for the treatment of bipolar depression. \"\n\nor if you don't know how to read paragraphs:Results for one drug come back mid 2020, the other is submitted late 2020.\n\nSome things to think about:\n\n1. I don't know much and this is my first time doing research on a stock\n2. You'd probably want to know something about the FDA approvals process before investing\n3. I don't know how much of the schizophrenia economic pie they are going to take from existing brands\n4. Before their next drug gets approved, they'll probably start hiring drug reps, to promote the new drug after its approved, you could look at this as an indicator for approvals (I think)\n\nI honestly don't know if I could recommend an options play on this stock because of the timelines, but if you keep it in your back pocket for a couple months and drug gets approved for a different disorder, you could possibly see some nice returns.", "id": "fvjhcg", "created_utc": 1586114296.0, "score": 29, "upvote_ratio": 0.91, "num_comments": 24, "comments": [{"body": "Too long; probably retarded", "score": 15, "replies": []}, {"body": "congrats! now you get to take the training wheels off and lose all your money", "score": 7, "replies": [{"body": "IV already crushed the training wheels, the bike, and me", "score": 6, "replies": []}]}, {"body": "Missed that TR;DL at the end...", "score": 6, "replies": [{"body": "Too retarded ; don’t like ?", "score": 6, "replies": []}, {"body": "whats the TR;DL ?!", "score": 1, "replies": []}]}, {"body": "On mobile so I can’t address all points right now and haven’t delved into the actually company yet but what I will tell you is that hospitals have banned non-essential patients which has brought nearly all clinical trials to a screaming halt. People are unsure when they will start back up again. Even when hospitals do open again for clinical trials they will be giving preference to whoever is paying the most i.e Big Pharma. Clinical trials are cash cows for hospitals and they will be seriously hurting for cash by the time they can open back up. \n\n\n\nYour thesis may be right on the science but I think your timeline for profit is way off. Those Ph3 trials may not restart/read out for a year or more past their previously estimated readout date. The company will continue to burn cash and may even need a secondary offering to stay afloat during that time.", "score": 5, "replies": [{"body": "I absolutely agree that most clinical trials have stopped, but an important aspect of that is many physiological clinical trials are conduct in private practices, (many psychiatrists do both meeting with patients and conduct trials for companies). Granted, I am not sure how many of the trials are done this way. I really appreciate your feedback, though and I think the information about hospitals is certainly a large contributor to their outlook. When you delve into the actual company I'd love to talk more. Thanks for the comment!", "score": 1, "replies": []}]}, {"body": "Good first attempt for DD.", "score": 6, "replies": [{"body": "thanks! got any recommendations on how to improve?", "score": 2, "replies": [{"body": "Tbh I think any in-depth look at a company suffices (preferably a company about to pop off but if we knew how to find those beforehand we'd all be billionaires). If you want to really go for it, I would recommend comparisons with competitors (similar products, larger companies that could potentially crush a smaller one, etc.),and looks at their financial standing and debt.", "score": 2, "replies": [{"body": "I don't have too much experience looking at debt! but I'll try and learn and add that. \n\nAlso, Ill start adding comparisons too tysm!", "score": 1, "replies": []}]}]}]}, {"body": "Well I hope you're right because I'm still bag-holding @ $37 from the day they got that FDA approval. I've sold a few covered calls in the meanwhile but I still need it to reach around $33 or so to sell and break even.", "score": 2, "replies": [{"body": "I know some doctors who bought at 12$ and did not sell at $30 so if thats any additional hope", "score": 3, "replies": [{"body": "Doctors are generally morons when it comes to finance/valuations", "score": 1, "replies": [{"body": "I would agree with this, but I think there is some merit in that they understand what drugs are out there for a particular disease, finance is absolutely a key factor, but in determining the value of a new drug on the market, that's definitely informed by the people prescribing it.", "score": 1, "replies": [{"body": "How many pharma stocks do you think these doctors have bought that went nowhere? Not trying to be a dick but pharma stocks are a notoriously fickle mistress. There are probably 200 out there right now you could write this exact same DD about. Still I appreciate the post", "score": 1, "replies": [{"body": "Absolutely true, I’ll find a better company next time, I wonder what differentiates them, granted they all have a similar pattern, so I see the uselessness, any other sectors you’d say are tough to proper DD?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Fuck that's a lot of words and not a lot of TL;DR\n\nTICKER  ✅ \n\nPRICE  ❌ \n\nDATE  ❌ \n\n# 66% BANNED", "score": 0, "replies": [{"body": "Lmao ok I’ll add it", "score": 1, "replies": []}]}]}
{"title": "Here are all positions commented in the last 24 hours", "selftext": "--------------------\nCALLS\n--------------------\n[SPY 4/17 415c](/r/wallstreetbets/comments/fvfzd9/daily_update_beating_a_dead_horse/fmi5rrz/)\n\n--------------------\nPUTS\n--------------------\n[DIS 75p 4/17](/r/wallstreetbets/comments/fvde7p/let_me_try_this_again_with_more_info_i_apologize/fmhuwiv/)\n\n[SPY 120p 5/1](/r/wallstreetbets/comments/fvdstq/money_printer_go_brrr/fmia8p0/)\n\n[SPY 180p 4/17](/r/wallstreetbets/comments/fvfv95/bears_boomers_and_beer_virus/fmi6fjl/)\n\n[SPY 4/17 150p](/r/wallstreetbets/comments/fvi7sf/the_part_of_lqd_that_is_is_high_yield_part_2_kinda/fmipr42/)\n\n[SPY 4/17 200p](/r/wallstreetbets/comments/fvfv95/bears_boomers_and_beer_virus/fmickdz/)\n\n[ZM $150p 4/17](/r/wallstreetbets/comments/fvfitp/zoom/fmig96e/)\n\n[ZM 4/17 $70p](/r/wallstreetbets/comments/fvfitp/zoom/fmib2ou/)\n\n[ZM 50p 5/15](/r/wallstreetbets/comments/fvj571/zoom_communications_and_the_chinese_government/fmip36b/)\n\nand since im unable to capture all positions, heres some comments that *might* have plays in them:\n\n[.](/r/wallstreetbets/comments/fvjsn4/95_of_you_have_no_idea_what_the_hell_youre/fmisuz5/)\n[.](/r/wallstreetbets/comments/fvj5js/poll_time_monday_april_6/fmion61/)\n[.](/r/wallstreetbets/comments/fvi7sf/the_part_of_lqd_that_is_is_high_yield_part_2_kinda/fmijxv0/)\n[.](/r/wallstreetbets/comments/fvhja0/weekly_theta_gang_thread/fmilbas/)\n[.](/r/wallstreetbets/comments/fvemo5/muh_puts/fmiecxp/)\n[.](/r/wallstreetbets/comments/fvg6dp/first_rule_of_wsb_you_do_not_talk_about_wsb/fmilioy/)\n[.](/r/wallstreetbets/comments/fvg6dp/first_rule_of_wsb_you_do_not_talk_about_wsb/fmidrj2/)\n[.](/r/wallstreetbets/comments/fvfzd9/daily_update_beating_a_dead_horse/fmi5qn8/)\n[.](/r/wallstreetbets/comments/fvfv95/bears_boomers_and_beer_virus/fmic3bk/)\n[.](/r/wallstreetbets/comments/fvfv95/bears_boomers_and_beer_virus/fmi9n7j/)\n[.](/r/wallstreetbets/comments/fvfitp/zoom/fmiqly7/)\n[.](/r/wallstreetbets/comments/fvfitp/zoom/fmiexnk/)\n[.](/r/wallstreetbets/comments/fvfbuq/gushing_losses_9287/fmi8sgx/)\n[.](/r/wallstreetbets/comments/fve3z2/ccl_to_the_ground/fmhvolm/)\n[.](/r/wallstreetbets/comments/fvde7p/let_me_try_this_again_with_more_info_i_apologize/fmit11p/)\n[.](/r/wallstreetbets/comments/fvde7p/let_me_try_this_again_with_more_info_i_apologize/fmipqje/)\n[.](/r/wallstreetbets/comments/fvde7p/let_me_try_this_again_with_more_info_i_apologize/fmi7vlu/)\n[.](/r/wallstreetbets/comments/fvde7p/let_me_try_this_again_with_more_info_i_apologize/fmi3wvy/)\n[.](/r/wallstreetbets/comments/fvde7p/let_me_try_this_again_with_more_info_i_apologize/fmiaj5j/)\n[.](/r/wallstreetbets/comments/fvde7p/let_me_try_this_again_with_more_info_i_apologize/fmib4ot/)\n[.]()", "id": "fvk47p", "created_utc": 1586116483.0, "score": 36, "upvote_ratio": 0.83, "num_comments": 23, "comments": [{"body": "LOL that spy call", "score": 71, "replies": [{"body": "I am honored to be nominated. \n\n[Proof](https://imgur.com/gallery/UrqdOiR)", "score": 33, "replies": [{"body": "Paid $0.01...bold move cotton", "score": 13, "replies": [{"body": "I have to invert the universe for my fellow retards. Necessary sacrifice.", "score": 9, "replies": []}, {"body": "Let’s see if it pays off", "score": 3, "replies": []}]}, {"body": "So how you feeling today??", "score": 1, "replies": [{"body": "Still $0.01. The spike is not enough. Let’s make SPY fly to $350 tomorrow", "score": 1, "replies": []}]}]}, {"body": "Invert WSB tells us that's going to print though. RIP my puts.", "score": 7, "replies": [{"body": "I got calls that strike is just insane tho lmao", "score": 3, "replies": []}]}]}, {"body": "More puts- that means this whole week is green. Rip my puts", "score": 15, "replies": []}, {"body": "So all of these are going to 0, right?", "score": 3, "replies": []}, {"body": "Could you add a filter feature where you can choose the scale of autistic position comments?", "score": 5, "replies": [{"body": "I'd probably have to use AI for something like", "score": 1, "replies": [{"body": "Does AI stand for Autistic Intelligence? \n\nCan someone flair me for the above?", "score": 5, "replies": [{"body": "Lol I've been working on accuracy though, I linked them for context. Unsure how I'd filter them. I'll think", "score": 1, "replies": []}]}]}]}, {"body": "Good bot", "score": 2, "replies": []}, {"body": "SOMEONE WANTS MY DIS $75P 4/17??\n\nThat'll be $1k", "score": 2, "replies": []}, {"body": "SPY April 27 2020 234p", "score": 1, "replies": []}, {"body": "So zm 200 calls?", "score": 1, "replies": []}, {"body": "LVS 45 June", "score": 1, "replies": []}, {"body": "The 50p ZM call is ballsy.", "score": -2, "replies": []}]}
{"title": "UK PM admitted to hospital over virus symptoms", "selftext": "[removed]", "id": "fvmrli", "created_utc": 1586125492.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 22, "comments": [{"body": "[deleted]", "score": 21, "replies": []}, {"body": "Trump is invincible you idiot. I mean look at that hair and skin! The man doesn’t age", "score": 20, "replies": [{"body": "Pump Trump", "score": 8, "replies": [{"body": "Trump the penis pump", "score": 1, "replies": []}, {"body": "$TRMP 271c 3/11", "score": 1, "replies": []}]}]}, {"body": "FTSE100 going green. Please look at futures", "score": 6, "replies": [{"body": "Fuck your future", "score": -1, "replies": []}]}, {"body": "whole homeless arrest waiting imminent overconfident sharp marry growth marble -- mass edited with https://redact.dev/", "score": 5, "replies": []}, {"body": "So 4/10 330C?", "score": 2, "replies": []}, {"body": "Wow thanks for this timely breaking news asshole", "score": 4, "replies": []}, {"body": "Don't fucking dance", "score": 2, "replies": []}, {"body": "This is the third thread on this. \n\nBan", "score": 2, "replies": []}, {"body": "If I get corona, I get corona.", "score": 1, "replies": []}, {"body": "Does anyone think to sort by new and scroll down before posting the same shit that's been posted 50 times", "score": 1, "replies": []}, {"body": "Oh Boris, will my EWU puts finally print?", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "EDIT: it's ok you guys, the queen  made a speech, everything is ok now.", "score": -3, "replies": [{"body": "Thanks for being the hundredth person to post this. Ban", "score": 7, "replies": []}]}, {"body": "[removed]", "score": -11, "replies": [{"body": "Check out this triggered fucktard", "score": 2, "replies": []}, {"body": "Ban", "score": 1, "replies": []}]}]}
