{"title": "Is Apple AAPL the safest investment out there?", "selftext": "With the huge buy back and dividend plan, what can make AAPL not the greatest stock now? I can hear someone from Reddit  yelled “priced in”.....", "id": "8jbdme", "created_utc": 1526295893.0, "score": 40, "upvote_ratio": 0.74, "num_comments": 90, "comments": [{"body": "Potentials for loosing (Edit: losing) their edge over the coming years:\n\n- They don't seem to be on top of the voice assistant game to the same extent as google is, or alexa, and theres google home too which is superior to apples equivalent. This home assistant box is still kind of taking off so it may become a massively missed market for them if the others keep outpacing them. Google home becoming popular could get more switches to android for better integration, becoming a bigger pull away from the apple ecosystem.\n\n- Competitors phones are getting as sleek as the iPhone, and some are managing under screen fingerprint recognition etc. that apple hasn't managed yet. They are catching up to apples design edge. They aren't quite there yet but the gap is closing.\n\n- If apple keep up the higher phone price but still make new phones at the same regularity will people keep upgrading as frequently? I've heard lots of 'the X is a big upgrade, but I cant do this every two years'. ", "score": 70, "replies": [{"body": "I find these very valid points. Looking at their products in an unbiased way (i.e. not as an Apple fanboy with fears of buyer's remorse or identity crisis) can lead to the question of what the future USP is going to be.", "score": 16, "replies": [{"body": "I would add, the line between courageous design and unhelpful idiosyncrasy has been crossed several times recently - no headphone socket/ can't charge and use socket adapter issue with iPhone, the overheating macs with the much disliked programmable touch bar, instead of a touch screen. The notch in the iPhone screen.\n\nMore quirks, more cost, less useful functionality. Can't see how the bandwagon will keep on rolling, myself.", "score": 7, "replies": [{"body": "I'm not sure how many people find all of those to be an issue:\n\n- no headphone socket: people seem to be adopting the airpods or using the adapter provided\n\n- cant charge and have heahphones: personally I've never wanted to do both at once. I imagine it could be frustrating though, but battery life is long enough that there shouldn't be too many overlaps\n\n- overheating macs: haven't heard about this, doesn't sound great\n\n- much disliked touch bar: not heard it that much disliked other than by developers, the feedback i've seen is its not great for those who use lots of shortcuts but is great for average consumer, and that is a big chunk of their market. They have one model without too for those that reallly hate it. But I wouldn't say its 'much disliked'.\n\n- the notch: love/hate, but I think the concensus is that you get used to it, and you can have videos played in the mode that's slightly smaller if you hate it and its not bad due to the bigger screen. Most apps just adjust to it. \n\n- less useful functionality: again this comes down to audience. Imo they are very functional for the average consumer, and the only useable smart phone for the older generation (from personal experience anyway), for more tech savvy there are definite issues, but I wonder how many consumers this really lost apple as its likely they were never consumers from the beginning and apple has done just fine without them, in the phone market. ", "score": 1, "replies": [{"body": "Worst part is apples cycle is every year, not every 2. ", "score": 1, "replies": []}, {"body": "try mobie gaming (fort nite or PubG mobile) drains your battery and you need headphones to be competitive. it would be REALLY nice to be able to charge and play at the same time. \n\nMobile gaming is only going to get bigger. I ordered a splitter so I can do both, but it should be standard", "score": 0, "replies": []}]}, {"body": "Most people don’t care. At this point people are paying for the brand. Having an IPhone is “cool” and if you don’t have an iPhone or Galaxy you probably are different.  ", "score": 1, "replies": [{"body": "Exactly. So no USP beyond brand. Doesn't sound sustainable to me.", "score": 1, "replies": []}]}]}]}, {"body": "I have seen the word lose misspelled as “loose” at least 5 different times today on reddit; not once have I seen it spelled correctly. I was starting to think that I woke up this morning in an alternate universe in which that was actually the correct spelling of the word.\n\nThank you for correcting yourself and allowing me to maintain my sanity. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "This is true for their laptops price to spec but interestingly the new iMac Pro has had people try to build equivalent computers from parts and its ended up more expensive, so if apple continue to make their newer products down that route that could be interesting.\n\nAs for the keyboards, they seem polarising. I love my mechanical keyboard but tried their laptops and they were fine. If you read online, even from developers etc., people seem to say that its something you get used to. It's not amazing but its not the worst keyboard in the world either. ", "score": 1, "replies": []}]}, {"body": "They are growing their services revenue. They aren’t simply an iPhone only company anymore.", "score": 3, "replies": [{"body": "Thats a good point, though iClould is so cheap I'm not sure how much they are actually making from it at the moment, but apple music on top of that is another think people will pay monthly for so you have a good point. In tandem with the new watch which can stream the apple music you have a good incentive to actually get the service now. If they go in this direction that could be really interesting.", "score": 0, "replies": [{"body": "Well google offers unlimited storage for photos so theres that.", "score": 1, "replies": []}]}]}, {"body": "Also something to look for is what happened to Nokia. In the mid 2000s Nokia was doing so amazingly well they didnt give a fuck about any other companies or even follow what they are doing and that's why they lost. This could be something that could happen to apple too.", "score": 1, "replies": []}, {"body": ">loosing ", "score": -3, "replies": [{"body": "oops my bad. I think it's clear from context what I meant though... Have edited anyway. Any thoughts about the actual content though?  \n\nEdit: I’m always confused when people comment just a single spelling correction, like did they think nobody would understand the post? Is the idea to help me lean or something? If I was writing a formal document I’d ofc spell check and reread but on a reddit comment I really don’t think it matters. I don’t believe such comments add anything to the discussion or to the community tbh unless someone says ‘just practicing my English’ or something along those lines then such a comment seems unnecessary unless combined with some actual response to the content. ", "score": 13, "replies": [{"body": "It’s the same as gotcha journalism. This person correcting you has nothing of substance to add, so they have to validate themselves with a “gotcha” typo correction...which wasn’t even a correction, they just pointed out the typo.", "score": 2, "replies": []}]}]}, {"body": "You left out \"developers abandoning the platform in droves\".\n\nI am.  Curiously, after sharing my decision with some other developers, I find I am far from alone.", "score": -1, "replies": []}]}, {"body": "No. US Treasuries are the safest investment out there. Granted, the return is nothing special. ", "score": 43, "replies": [{"body": "If the return is less than inflation you haven’t really won. Sure you did better than holding cash, but not better than holding a commodity, and commodities don’t even have the power of compounding. I also don’t think the risk of default is as low as many people seem to think.", "score": 3, "replies": [{"body": "\n\n>If the return is less than inflation you haven’t really won.\n\nStock returns can also be lower than inflation.", "score": 1, "replies": [{"body": "Correct. Stocks can also have a negative nominal return, and so people tend to more accurately account for risk. With bonds, people look at the virtually guaranteed nominal gains and tend to forget about the potential for real losses despite nominal gains (that you have to pay taxes on).", "score": 2, "replies": []}]}, {"body": "US treasury bonds (TIPS) are inherently adjusted for inflation. That's part of their low risk appeal.", "score": 0, "replies": [{"body": "T-bonds and TIPS are two different things, or rather, TIPS are a type of T-bond, but not usually what everyone thinks of when you say US Treasury Bonds.", "score": 1, "replies": [{"body": "To be even more granular, TIPS aren’t even a type of “t-bond”. T-bonds are specifically coupon paying treasury securities with maturities greater than 10 years. TIPS are a type of bond and can be bought in 5, 10, or 30 year maturities. ", "score": 1, "replies": []}]}]}]}, {"body": "Yeah about that I would rather go for gold than US  treasuries right now. ", "score": 1, "replies": []}]}, {"body": "IMO AAPL is a relatively safe bet but I think they are a poor choice for growth; they have  effectively attained market saturation, so their future stock performance will depend on how well they maintain that, and how well they innovate into new markets. I don’t think they are doing that great of a job on the latter, and there is a lot of competition and threats out there to consider. If you want a “safer” bet, I’d avoid tech altogether and go with something “boring” like JNJ or XOM.", "score": 8, "replies": [{"body": "God I wish I could remember where I read this (and it was a few years ago) but Apple basically only reinvests a small fraction of their revenue back into RnD and innovation where as Samsung (their biggest Asian competitor) invests huge amounts back into innovation. Apples thinking is that they would prefer to stick to their loyal customer base, provide them with a predictable product, and let them drive the change progress from natural demand. ", "score": 3, "replies": [{"body": "The difference is that Nokia had a commodity product Apple employs mass customization through its apps. ", "score": 2, "replies": []}]}]}, {"body": "There is nothing \"safe\" about buying an individual stock and even good companies like Apple will have huge price swings.  I think you mean \"is Apple the safest individual stock out there\".   \n\nTo answer your question though I don't think you could label Apple as \"safe\" given the traditional definition for a safe stock investment:  [https://www.investopedia.com/terms/m/marginofsafety.asp](https://www.investopedia.com/terms/m/marginofsafety.asp)", "score": 15, "replies": [{"body": "even if your saying a safe individual stock i think Berkshire is probably a much better option.  But really that is cheating because they are basically a basket of stocks. ", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "tell that to sears\n\nedit: if anyone thinks that a blue chip cannot go out of business or shrink considerable, then you are just wrong.\n\nEdit2: I am an idiot.", "score": -2, "replies": [{"body": "-----The joke ------>>\n\nYour head", "score": 2, "replies": []}]}]}]}]}, {"body": "BRK.B", "score": 3, "replies": []}, {"body": " Personally I would say visa is the safest stock of the next 5-10 years where you would still get very solid gains from.", "score": 8, "replies": [{"body": "toy merciful fade swim axiomatic label grandfather cake station disgusting\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": -3, "replies": [{"body": "You don't think Visa and Mastercard are spending millions and millions on blockchain related tech as well?", "score": 8, "replies": [{"body": "I'm certain V and MA are worse tech companies than GOOG, AAPL, AMZN, PYPL, SQ, and a few dozen others -- even banks and credit unions are starting to look at that market as penetrable. ", "score": -1, "replies": []}]}, {"body": "I don't understand the down votes. They are definitely preparing for this possibly, but I can very easily see a situation where they are even more of a commodity service then they already are. \n\nIf tech companies continue to own the customer experience, then they will be the winners and Visa will just be a dumb processor. ", "score": 2, "replies": [{"body": "People seem to think V and MA can out innovate the tech companies in the payment processing arena. We'll see soon enough (maybe years, tho). Cheers. ", "score": 2, "replies": []}]}, {"body": "That's a very long shot at the moment, not something I would bet on just yet.", "score": 2, "replies": [{"body": "Absolutely. It's not happening anytime soon. But, the fears of it happening will only increase as tech companies merge into payment processing over the next ~5 years. ", "score": 3, "replies": []}]}]}]}, {"body": "Would say the safest investment is probably Google.   They are better embeded in daily life and have $100B in the bank and continue to innovate.\n\nSo you get safety with better up side.  Self driving cars is just one AI application and worth more than a trillion dollars a year.\n\n\"Waymo forecast to capture 60% of driverless market\"\n\nhttps://www.ft.com/content/3355f5b0-539d-11e8-b24e-cad6aa67e23e\n\nGoogle AI\n\nhttps://www.youtube.com/watch?v=bd1mEm2Fy08", "score": 7, "replies": [{"body": "Def not true. In the space of tech even, the safest investment is a low beta stock with a small, but relatively guaranteed return. Google will not probably do well bit there's no way to know for sure, and that would be risky.", "score": 4, "replies": [{"body": "Google has recurring revenues from multiple monopolies and nothing is safer, imo.   But also there is sizzle on top with Google from AI.\n\nNot following on what will cause Google to not do well?  They are growing at over 20% and we barely have started with AI?", "score": 2, "replies": [{"body": "Hmm you're right, but maybe thats.... Not the point?\n\nDid you see the answer for tbills? It hardly has any return, but it will ALWAYS do well. On a given day, I'm confident it's up, and if it's down,it's marginally down. Google is a company and only measures one company (or parent company) actions. \n\nPeople will say some of this is priced in, and to get a gain with Google we'd have to hold it until there is something in the upcoming year that starts to get priced in. \n\nIs it good company? Yeah\n\nIs it safe investment? Not quite, it's related to a relatively narrow industry compared to the safest company out there. \n\nIf it was the safest, why do many retirement portfolios have companies with 3%+ dividends and low returns?", "score": 1, "replies": [{"body": "Thing is with Google is they own multiple monopolies today but also the best positioned company for the future.\n\nIt is very difficult to get both in one company.", "score": 0, "replies": []}]}]}]}]}, {"body": "If they declared bankruptcy and stopped selling iPhones.  ", "score": 8, "replies": []}, {"body": "Just had a similar conversation on this subject with a friend.  We were debating if Berkshire was the safest stock investment and got into a discussion if it would be better to just purchase brk.b or all of its holdings individually.  We started going through the individual holdings and settled on Apple as the right balance of safety with likelihood of growth. So I wouldn't say it's safe but the risk reward seems good right now for the reasons you mention.", "score": 2, "replies": []}, {"body": "This friday", "score": 2, "replies": []}, {"body": "Other commenters keep talking about AAPL’s core product, iPhone, like it needs to be feature filled and innovative. The truth is, iPhone has never really been the most innovative or feature packed phone. People have their own reasons for buying it, but nothing that has happened in the past 2 years from a functionality standpoint have negatively impacted most of those reasons. iPhone sells because of marketing, and marketing functions because of cash, and AAPL has enough cash.\n\nThis is the core business - cost leadership through cheaper manufacturing costs. Leveraging the volume of iPhone sales to manufacturers allows the iPhone business to keep sourcing costs very low, and margins very high. iPhone has, since its inception, had the highest profit margin per device than any other mobile device on the market.\n\nHowever, the iPhone business is plateauing - most people who want an iPhone have an iPhone.  Sell a great phone this year, you take away from next year’s sales. The opportunity cost in the next 10 years of selling an incremental amount of iPhones for x ROI is greater, because emerging technologies force Apple to expand the business via supporting rods through their existing products. Apple made similar decisions in the past few years with some results better than others - Watch is growing along with its margins, but TV’s value exists mostly in tandem with other products. CarPlay is doing ok, but has a really long payback period - the car business simply can’t sustain Apple’s preferred margin level. \n\nOver the next 5-10 years Apple will have to prove to investors that it can win at emerging technologies in the same way as iPhone and Apple Watch. \n\nIn other words, no single stock is safe. If you want a safe investment, diversify. If you like tech, take a look at SHOP, AYX, SQ, Talend, NVDA, AMZN. Most of those have had better 3-year growth than Apple, and also are benefitting from emerging markets.", "score": 2, "replies": []}, {"body": "nope. S&P500 \n\n\nSPY, VOO", "score": 2, "replies": []}, {"body": "ROFL! i just shorted the shit out of apple", "score": 4, "replies": []}, {"body": "I recently thought about it. If i invest now, will Apple even be a thing in, say, 5 years? The hype in buying a phone every single year has slowed down, tho the iPhone X sold pretty good in China. So maybe China is the new main market for Apple?\n\n5 years ago we had the iPhone 5 and Siri. Now we have Amazon pushing the boundaries, Google having smartphones and smart home equipment. Tech stocks are always more dangerous than other stocks because new trends keep coming.", "score": 2, "replies": []}, {"body": "TBonds", "score": 1, "replies": []}, {"body": "I would recommend fully integrated ground to customer commodity companies with healthy balance sheet and positive free cash flows as a safe investment for this decade", "score": 1, "replies": []}, {"body": "By this metric, any big private company would also be \"safe\" investments. I've had people tell me to just buy WMT, GOOG, MSFT, AAPL, etc....", "score": 1, "replies": []}, {"body": "Their cash pile alone makes them very safe. They can be conservative and then just buy into any new industry they want when the time is right.", "score": 1, "replies": []}, {"body": "In my eyes, Nestle is the safest investment. People do not die without a phone. But they do without food.", "score": 1, "replies": [{"body": " people will always need food but that doesn't guarantee Nestle will be part of that", "score": 1, "replies": [{"body": "So better buy a F&B sector ETF.", "score": 1, "replies": [{"body": "I can't tell if this is sarcastic or not, but the issue with that is that the food incumbents are struggling overall. Whatever ETF is available likely contains many of the old guard, and not the up-and-comers. ", "score": 1, "replies": [{"body": "No, this is not sarcasm. F&B Investments are one of the risk-averse stock investments you can do. And sector ETFs even lower this risk on the unsystematic side. Buy NESN, KO, PEP. Can't be wrong.", "score": 2, "replies": []}]}]}]}]}, {"body": "Them and Microsoft are the safest in tech\n\n\nI would have to assume that Berkshire is the safest company out there", "score": 1, "replies": []}, {"body": "I think they are good as long we dont have another disruptive tech in smartphones. But that could happen in next couple of years through AR/AI and then their number one revenue stream could be hit hard. But they have a sticky customer base and still could ride out rough couple of years as long as they have cash to buy a disruptive company. \n\nBut on the upside I am not sure how much and how fast it can grow considering they are almost a trillion dollar company. So it will be more of a value play than a huge growth play. ", "score": 1, "replies": []}, {"body": "I bought it when there was a big dip. A month or so ago. Wait until Trump do something stupid. It will not take that long. ", "score": 1, "replies": []}, {"body": "Amzn", "score": 1, "replies": []}, {"body": "Wow this thread is full of opinions and feelings about AAPL\n\nRe: Apple performance\n\nGrowth for AAPL doesn’t look like increasing market share, which has slowed and most likely isn’t in the cards with their current product mix.\n\nGrowth for Apple comes from monetization within their ecosystem. ASP is up, wearables including Beats and AirPods make up an interesting revenue source. Apple Music, and other service account for more and more of Apple’s revenue growth. With an install base of 1.2B users there’s a real market to focus on revenue expansion. They have a very enviable user base.\n\nRe: Apple as a safe investment\n\nI don’t think it’s the safest investment out there. Amongst other reasons: their huge market cap, China/trade issues, possible tech correction. Also compared to a balanced portfolio or strategy which would encompass different risk factors, it’s clearly more risky to be 100% anything.\n\nIn a more short term outlook I like AAPL as a stock, and it’s a very safe investment. Today, it has strong institutional backing, strong dividends, cash on hand, stable and competent leadership, strong brand reputation and a walled garden.\n\nUltimately, any investment must be monitored and adjusted based on market factors. But you guys know that.\n\nTl:dr Apple’s business is very strong. This question is dumb?\n\n", "score": 1, "replies": []}, {"body": "MSFT imo", "score": 1, "replies": []}, {"body": "Yes and no.\nNo investments are ever safe.\nThey still have a strong brand, high profits per items etc. Etc.\nThey never try to be fast to market og having the newest tech, but the best tech. And they still seem to manage to do that.\n\n\nBut they're also not very diversified. If they lose the iPhone, they more or less loose the company. \nIf fx. Samsung was to loose the phone line, it wouldn't be fun for them. But they would definitely manage. \n", "score": 1, "replies": [{"body": "> ...the best tech.      \n     \nSiri would like a word....but she has a hard time with words. So, be patient. ", "score": 3, "replies": [{"body": "I don't like apple, and I don't use their products.\nBut you if you set aside personal preferences, it's hard to argue that most of their products - not all, but most.\nWork better, more reliable etc. Than competing products.\n\nThe fact that they don't have cheap products, but only makes the best they can also gives them a stronger brand. ", "score": 0, "replies": [{"body": "I've been an Apple fan boi since the late '90s, and I disagree with most of that. 'ol Timmy has been cheapening Macs (desktops and laptops) for years *and* AAPL has not kept pace with advancements from competitors on many fronts. For example, all small-mid sized video studios used to use Macs and final cut pro. Nowadays, Adobe Premiere and After Affects have decimated that former dominance. Then, Windows 7 and 10 closed the OS quality gap, and the Surface Pro took a stab at both the MacBook and iPad (which imo is pretty awesome). But, AAPL seems to have no intention to make a laptop/tablet combo, nor do MacOS/iOS lend themselves to such ends. Further, iMusic was late to the party -- getting its ass handed to them by Pandora, Spotify, and AMZN. Apple TV missed their chance to beat out Netflix, and again, is now competing with all of the others and GOOG. They're ages behind AMZN, MSFT and GOOG (and others) in cloud. Their iPhones and iPads keep getting more and more models to cater to more low/mid-end buyers -- cutting into that brand dominance, and pushing toward commoditization -- all while GOOG and Samsung have gained bigly. And, things like Google Assistant is going to make Android even more desired while Siri continues to suck for the next few years (at least). Then, Waymo will become the standard and Google will use that to get even more people into GOOG products, which will certainly cut into the iPhone market. Lastly, there's all those Chinese knock offs that will just keep getting better and eventually be let into the US market. ", "score": 1, "replies": []}]}]}]}, {"body": "Wait for the crash.", "score": 1, "replies": [{"body": "Could be waiting years for that. Better off investing and holding or dollar cost averaging.", "score": 3, "replies": [{"body": "The question was: is Apple the safest investment?\n\nA DCA strategy doesn’t excuse poor stock picks.\n The fundamental rule that every intelligent investor should follow is. BUY LOW SELL HIGH.\n\nSo Apple is probably not the safest investment out there.", "score": 3, "replies": [{"body": "I agree that Apple is not the safest investment out there, but your answer did absolutely nothing to address the person's question in the first place. I was simply addressing what I saw as a flaw in your suggested strategy. ", "score": 1, "replies": []}]}]}]}, {"body": "No. If Apple can't keep selling the volume of phones they've been selling at the high prices they command, their stock price will inevitably fall.\n\nThe terms \"safest investment\" and \"stocks\" don't belong in the same sentence. If you're interested in the \"safest stock\", I'd suggest looking at Berkshire Hathaway.", "score": 1, "replies": []}, {"body": "I think it pretty far away from a safe stock. If a downturn hits, overpriced vanity phone market will surely go South. Try stocks like pharmaceuticals, or Coca-Cola.", "score": 1, "replies": []}, {"body": "FB is pretty safe ", "score": -3, "replies": []}, {"body": "I’m up over 200% buying and Hodling so I recommend it. But past performance is no guarantee of future success.", "score": -4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "People only like it when you lose money. Same with /r/wallstreetbets.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "#[WHAT A SOLID BUY!! It’s only been entirely flat for the past 10 YEARS!!](http://i.magaimg.net/img/3bur.png)", "score": 2, "replies": []}]}]}]}]}, {"body": "No? Wtf? ", "score": 0, "replies": []}, {"body": "AAPL is so undervalued.  Google Apple vs Amazon.", "score": -5, "replies": [{"body": "AAPL undervalued based on what?   They are above historic P/E.", "score": 9, "replies": []}, {"body": "Are you trying to say that Amazon is a fairly valued company that you use to determine what stocks are over or under valued?", "score": 1, "replies": []}]}, {"body": "Right now most stocka are overvalued. Maybe wait for a correction .", "score": -8, "replies": [{"body": "How long have you been waiting?", "score": 1, "replies": [{"body": "Since February ", "score": 1, "replies": []}]}]}]}
