{"title": "DOW 25k", "selftext": "", "id": "8jri7v", "created_utc": 1526438156.0, "score": 3535, "upvote_ratio": 0.95, "num_comments": 118, "comments": [{"body": "Long Margin Call memes", "score": 622, "replies": [{"body": "Funny how this sub makes margin call memes, very appropriate.\n\nninja edit: I actually really like the movie, highly recommend it", "score": 170, "replies": [{"body": "Will it make me feel as invincible as the wolf on Wall Street and the big short though?", "score": 72, "replies": [{"body": "If you have 3 monitors you can watch all 3 at once. I have 4 so during the trading day I can watch all 3 movies and trade stonks on the 4th monitor.", "score": 115, "replies": [{"body": "You’re forgetting Wall Street with Michael Douglas and Charlie Sheen", "score": 32, "replies": [{"body": "The sequel is stupid though. Add boiler room to the list", "score": 25, "replies": [{"body": "No love around here for Other Peoples' Money, huh?", "score": 5, "replies": [{"body": "I just watch The Big Short on repeat", "score": 9, "replies": []}, {"body": "\"I'm not your best friend, I'm your *only* friend\"", "score": 1, "replies": []}]}, {"body": "I can't get into boiler room. Never make it past the first 10 minutes without falling asleep.", "score": 1, "replies": []}]}]}, {"body": "Just do some crack with me man", "score": 1, "replies": []}]}]}, {"body": "Name of it?", "score": 2, "replies": [{"body": "Margin Call is the name.", "score": 16, "replies": [{"body": "No, hes asking about the name of the movie", "score": 19, "replies": [{"body": "Better Call Margin", "score": 35, "replies": [{"body": "Holy shit", "score": 1, "replies": []}]}]}]}, {"body": "So earlier this week there was a Margin Call meme with Jeremy Irons and Kevin Spacey (still good actor).  Wife and I watched the movie.  It was mediocre at best and i find this kind of shit interesting.  Worth the 4 bucks on amazon prime", "score": 9, "replies": []}, {"body": "I want to know the name of that movie to!", "score": -2, "replies": [{"body": "The Wolf of Big Call", "score": 14, "replies": [{"body": "It's the sequel, The Big Limitless ", "score": 7, "replies": []}, {"body": "> The Wolf of Big Call\n\nI cannot find a movie with this name.", "score": 1, "replies": []}]}]}]}]}, {"body": "Such a good movie too damn ", "score": 3, "replies": []}, {"body": "Fucking love it ", "score": 2, "replies": []}]}, {"body": "The head shake at 1.6% ally savings got me. Well done ", "score": 359, "replies": [{"body": "1.6%? I’m getting a respectable 1.65%....  This chump is ready to retire in 300 years.  ", "score": 158, "replies": [{"body": "Like my dad said when I got my first job. Only 300 more years of that crap.", "score": 39, "replies": []}, {"body": "accounting for inflation this guy is on the streets in 50 years", "score": 18, "replies": [{"body": "he can just kill himself before then. ezpz", "score": 12, "replies": []}]}]}, {"body": "How can ally be offering such good rates? Is Ally bank a scam???", "score": 65, "replies": [{"body": "it's run by Nigerian princes", "score": 6, "replies": [{"body": "Then I'd expect 1.6% a day", "score": 9, "replies": []}]}, {"body": "Very low cost online-only banking model.", "score": 18, "replies": [{"body": "I don’t think you know the reference", "score": 27, "replies": [{"body": "Oh..I realized it after your comment.", "score": 5, "replies": []}, {"body": "What's the reference?", "score": 4, "replies": [{"body": "Some dumbass posted on /r/personalfinance asking if ally was a scam because he couldn't believe they offered such a high interest rate", "score": 22, "replies": [{"body": "Oh hilarious, I filter that sub because I got banned for suggesting betterment in a thread asking for investment suggestions, then the mods were very clear with me that the ban wouldn't be lifted, kind of felt childish in their response so it made me nervous about getting any kind of financial information from a sub like that.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Damn there’s like 5 memes built into this, well done 9/10 shitpost", "score": 334, "replies": [{"body": "Pffttt.... I give this a 20/10 on margin", "score": 78, "replies": [{"body": "Hopefully you don’t get a margin call.", "score": 10, "replies": []}]}]}, {"body": "Did the no fap Dow guy drop out?", "score": 65, "replies": [{"body": "He ded", "score": 52, "replies": [{"body": "Rip ", "score": 11, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "A", "score": 6, "replies": [{"body": "G", "score": 5, "replies": []}]}]}]}, {"body": "no, he simply ascended into Nirvana", "score": 1, "replies": []}]}]}, {"body": "Lost it at yacht alternatives", "score": 127, "replies": []}, {"body": "What movie is this?", "score": 43, "replies": [{"body": "[Margin Call](https://youtu.be/6pQhIPXIqqQ). Good film! ", "score": 113, "replies": [{"body": "Watching tonight! ", "score": 15, "replies": []}, {"body": "One of my favourites! I watch this film every few months or so.", "score": 8, "replies": []}, {"body": "It’s on Hulu ", "score": 9, "replies": [{"body": "Fuck, I literally just purchased it on iTunes... fuck it, now I have it for plane rides.", "score": 20, "replies": [{"body": "might as well save it now for when you don't have internet", "score": 3, "replies": []}]}, {"body": "You fucker no it’s not", "score": 0, "replies": [{"body": "Umm ya it is. Just looked it up again to be sure. ", "score": 1, "replies": []}]}]}, {"body": "Damn that's good, almost watched half the flick on clips alone. Definitely checking it out.", "score": 3, "replies": []}, {"body": "Is the full movie in youtube", "score": -1, "replies": []}]}, {"body": "Devil Wears Prada", "score": 15, "replies": []}, {"body": "Marley and me. ", "score": 15, "replies": []}]}, {"body": "1.6%? Are we sure this isn't a scam? ", "score": 45, "replies": []}, {"body": "Quality of shitposting is out running DOW now.", "score": 96, "replies": []}, {"body": "Jesus Christ when the hell did this group of autistic children get so good at making fucking gif memes?\n\nI remember the days of when you’d get called a tryhard faggot for using Microsoft paint ", "score": 118, "replies": [{"body": "its not gonna last. wait until this place gets really popular then short the sub", "score": 16, "replies": [{"body": "So we're buying $WSB calls now?", "score": 5, "replies": []}]}]}, {"body": "Is Ben Bernanke doing movies now?", "score": 52, "replies": [{"body": "Is it possible for a former fed chair to be put on a leash? ", "score": 3, "replies": [{"body": "I mean...how much you willing to spend?", "score": 9, "replies": []}]}]}, {"body": "The r/personalfinance dig is icing on the cake.", "score": 31, "replies": [{"body": "1.6% dig.", "score": 15, "replies": []}]}, {"body": "suality qhitpost", "score": 12, "replies": []}, {"body": "> 1.4%\n\nthis is so fake\n\n> 1.6%\n\noh shit...it's real", "score": 10, "replies": []}, {"body": "This is the best shitpost I have seen in this sub.\n\nBravo, just bravo.", "score": 10, "replies": []}, {"body": "“Some people like taking the long way home.... who the f*ck knows, right?”", "score": 8, "replies": []}, {"body": "Tucci Gang Tucci Gang Tucci Gang ", "score": 6, "replies": [{"body": "#[TUCCI GANG](https://www.youtube.com/watch?v=HVjhi7-29_U)", "score": 2, "replies": []}]}, {"body": "Funny chit", "score": 5, "replies": []}, {"body": "Is it on $NFLX?", "score": 6, "replies": [{"body": "No it is on $HULU I believe.", "score": 6, "replies": []}, {"body": "Unfortunately, no.", "score": 2, "replies": []}, {"body": "No, but it's on Showtime Anytime if you have that crap.", "score": 2, "replies": []}]}, {"body": "My god that brunette is a hammer", "score": 4, "replies": [{"body": "Is that a good thing?", "score": 4, "replies": [{"body": "Depends on your personal preference. ", "score": 2, "replies": [{"body": "Fuckin love hammers", "score": 6, "replies": []}]}]}, {"body": "is that Demi Moore??? holy shit\n\nedit: wait no, it's Ashley Williams https://www.imdb.com/title/tt1615147/mediaviewer/rm166848512", "score": 3, "replies": [{"body": "*slide whistle*", "score": 2, "replies": []}]}]}, {"body": "Keep them coming.", "score": 3, "replies": []}, {"body": "I watched this fucking movie 4 days ago and every day since then I've seen memes about it. What the fuck.\n\nGood movie though.", "score": 4, "replies": [{"body": "https://en.wikipedia.org/wiki/List_of_cognitive_biases#Frequency_illusion", "score": 4, "replies": []}, {"body": "Singularity", "score": 2, "replies": []}]}, {"body": "I wanna one up this dude. I promise to no fap until dow reaches 30k ", "score": 3, "replies": []}, {"body": "The facial expressions are perfect... ", "score": 3, "replies": []}, {"body": "1.60 lol", "score": 3, "replies": []}, {"body": "I literally just finished this movie an hour ago, great movie. ", "score": 2, "replies": []}, {"body": "We're not worthy. ", "score": 2, "replies": []}, {"body": "Lost it at 1.6% ", "score": 2, "replies": []}, {"body": "Because posts like this, I am happy to be part of this family, fucking faggots <3 ", "score": 2, "replies": []}, {"body": "Holy fuck thanks for this, op!", "score": 1, "replies": []}, {"body": "Great fucking movie.", "score": 1, "replies": []}, {"body": "Outstanding", "score": 1, "replies": []}, {"body": "Extremely well done!", "score": 1, "replies": []}, {"body": "I was entertained. ", "score": 1, "replies": []}, {"body": "Lol this was just on showtime last night", "score": 1, "replies": []}, {"body": "Gonna need a Yacht, for them blue balls to go anywhere. ", "score": 1, "replies": []}, {"body": "What's the origin or the meaning of the Ally Bank memes?", "score": 1, "replies": [{"body": "Someone on /r/pf asked if Ally Bank was a scam because they offerred a 1.6% yield account.", "score": 2, "replies": []}, {"body": "Those straight shooters over at personal finance, sitting on their residuals while waiting for the bear market (any day now)", "score": 1, "replies": []}]}, {"body": "Legitimately looks like you just turned on CC, the captions, reactions.. the fucking yacht.. it's all spot on.", "score": 1, "replies": []}, {"body": "Does anyone here remember the Fanta Shokata videos with subtitles?", "score": 1, "replies": []}, {"body": "I give it a week before we've exhausted Margin Call memes", "score": 1, "replies": [{"body": "There *is* only so much content I have to use.", "score": 1, "replies": []}]}, {"body": "Ally up to 1.6% just made more than you bums today ", "score": 0, "replies": []}, {"body": "[deleted]", "score": -23, "replies": [{"body": "Please don't procreate", "score": 9, "replies": [{"body": "He's on dragz.", "score": 2, "replies": [{"body": "Drugsarebad mmkay?", "score": 1, "replies": []}]}]}]}]}
{"title": "Anyone paying attention to home prices and home interest rates?", "selftext": "I was going to buy a house and then I said fuck that shit. I'm renting til the next housing bubble pops. Thoughts, my faggots?", "id": "8jupb5", "created_utc": 1526475528.0, "score": 161, "upvote_ratio": 0.97, "num_comments": 442, "comments": [{"body": "One of the largest growth area for banking assets in 2017 was \"non-QM loans\" \n\nAka, home loans to people with not great credit. You might even say they're....*subprime* \n\nNo one learns anything because people are cattle. ", "score": 116, "replies": [{"body": "> non-QM loans\n\nHoly shit. I just looked into these. Wow. Bound to repeat. The housing market is such trash. People are idiots.", "score": 35, "replies": [{"body": "You’re an idiot, non-QM just means they aren’t perfectly standard and can’t be sold to Fannie and Freddie. Plenty of rich people have non-QM mortgages because they want balloons or bullets or whatever. Studies of non QM mortgages shows performance between prime and subprime and either way no one does risk layering anymore like they used to. ", "score": 35, "replies": [{"body": "True, houses over $463,450 don’t qualify as well. The threshold differs in a few areas (like LA I believe) due to much higher average home prices.", "score": 3, "replies": []}, {"body": "The problem is that most of these people can't qualify for conventional mortgages due to debt or not enough for a down payment. They are heavily debt-ridden. While there might be a plan for repayment, it could easily go off the rails if the borrower incurs further unexpected debt. When you couple this with increasing consumer debt, stagnant wages, and inflation, the bottom will eventually give out. ", "score": 3, "replies": [{"body": "No, the problem is not inability to qualify for Conventional loans. The problem is housing values, because most non-QM are Jumbo not sub-prime.", "score": 11, "replies": [{"body": "SFH in my neighborhood start at about 1.1million.  I'm sure very few people with a mortgage at all have conventional loans.", "score": 5, "replies": [{"body": "Who would get an ARM when interest rates are low and rising?", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "So price is possibly artificially inflated. Even in a \"bubble\" you could say? \n\nNothing to see here folks. ", "score": 1, "replies": []}]}, {"body": "What you’re talking about is called risk layering and no one does that anymore. The people with low down payments aren’t the same people with low FICOs and high dti and pti. That was the practice during the bubble but is now effectively dead. ", "score": 5, "replies": []}]}]}]}, {"body": "I heard a report on NPR about *non-prime* loans and decided to wait another year or two to buy a house because this shit is going to crash. Hopefully I can keep making money-making bets and can buy the house outright in 3 years. But that shit doesn't happen so I'm going to be renting for a long time.", "score": 1, "replies": []}]}, {"body": "The big short dude, Eismen, is shorting Canadian banks now.  He said he doesnt think it will be as the bad as the US housing crisis was, but there is definitely a problem brewing with interest rates and home costs.  He seems fairly confident that there will be a large correction to home prices in the coming year or two.\n\nAs a homeowner, Im trying to convince my gf we should sell the house and live in our cars until the bubble pops.", "score": 188, "replies": [{"body": "Yeah man, I just fucking graduated at 34, cause I'm a dumbass, and now I want to buy a house because I got some cash stashed. Fuck, for timing. I guess I need to wait it out.", "score": 64, "replies": [{"body": "The market feels like pre 2008 all over again when everyone had tons of disposable income and chased for profits. I like it.\n\nAfter MU hits $60, I am gonna start cleaning my portfolio and play super conservative. ", "score": 49, "replies": [{"body": "[deleted]", "score": 38, "replies": [{"body": "Hmm \"just graduated at 34 years old\", today is 2018, minus 10 years, carry the 2, multiply by the cos and drop the remaining obtuse angle, he was 24. ", "score": 122, "replies": [{"body": "Look at mr phd in math over here.", "score": 112, "replies": [{"body": "Except he didn't account for day light savings time and leap years. Rookie mistakes. ", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 35, "replies": [{"body": "Oh my bad, I'll head back to r/UnnecessaryBadMath", "score": 31, "replies": []}, {"body": "Believe it or not a lot of us are old as fuck.\n\nAnd yeah it has been feeling like pre 2008 all over again the past 1\\-2 years.\n\nThere's no outright obvious catalyst though...", "score": 8, "replies": [{"body": "I'm \"old\" too. I remember 2008 very well.  This doesn't doesn't feel ANYTHING like it.  I still want to know how old RobinhoodFag is", "score": 7, "replies": [{"body": "I think it feels like it in respect to housing prices. But maybe just because I'm in the west coast so prices have already eclipsed 2008 level.", "score": 7, "replies": [{"body": "Eh, I mean....West Coast prices are just so insanely high because the earnings power of some of the tech centers.  Here in the North East home prices aren't anywhere near where they were in 2008 if its any consolation.  I just bought a house 6 months ago for 27% LESS than what the owners paid in 2008.  They got fucking hosed. I made out like a bandit.  ", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yep.  I remember almost EVERYONE flipping houses like crazy like a game of hot potato. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Wrong fag, fag", "score": 16, "replies": []}]}, {"body": "I was mid 20s in 2008. AMA. ", "score": 1, "replies": [{"body": "I was late 20s young whippa", "score": 2, "replies": []}]}]}, {"body": "> The market feels like pre 2008 all over again when everyone had tons of disposable income and chased for profits. I like it.\n\nNo income verification mortgages are back, and so are no down payments and cash-back refinances.  ", "score": 16, "replies": [{"body": "...yo where can I get one of those no-income loans.\n\nAlso cash-back refis never have a down payment. Cause...you're getting cash back. ", "score": 3, "replies": [{"body": "Two separate things bro.  Hence the comma.  ", "score": 6, "replies": []}, {"body": "A lot of the no income verification loan (aka stated income loans) requires 30%-60% down, as far as I know", "score": 1, "replies": []}]}, {"body": "No they arent. Stop making shit up. ", "score": 1, "replies": [{"body": "no down payment mortgages certianly are. don't know about the others though.", "score": 3, "replies": [{"body": "That's always been the case?  That's what PMI is for.", "score": 1, "replies": []}]}, {"body": "Yeah, I heard it on a radio station here in Dallas.  It can't possibly be true... ", "score": 2, "replies": []}, {"body": "Quick Google search shows tons of ads for stated income loans (aka no income verification). There are [even articles](https://mymortgageinsider.com/stated-income-loans-make-a-comeback-7284/) supporting what OP mentioned. They just require tons of down payment.\n\nIt's how tons of foreign cash buyers are picking up properties in pricey areas in the US. They certainly exist as I was even looking at an application myself awhile ago.", "score": 2, "replies": []}]}, {"body": "Maybe so, but I had just got a mortgage in January and had to jump through income verification hoops until my knees collapsed. YMMV. The 2nd part of your statement is definitely true though. ", "score": 1, "replies": []}]}, {"body": "It is worse. Look up the SP Case Shilling Index for home pricing since 2000. ", "score": 4, "replies": [{"body": "It’s not worse than 2008 just yet. I don’t have any sources, but I did some computations a month or so ago, and the cagr from 1990 to both 2008 and January was nothing too close. I think it is overvalued, but not too too bad just yet. \n\nThe thing that always gets you in a market like this is where wild risks are being taken with little thought or a mangled process. ", "score": 1, "replies": [{"body": "Did you see the case shilling index?", "score": 1, "replies": [{"body": "Yes, that is what I calculated the cagr based upon. Home prices haven’t outpaced gdp growth by very much. ", "score": 1, "replies": []}]}]}]}, {"body": "No you wont", "score": 1, "replies": []}, {"body": "Finally a bear", "score": 1, "replies": []}]}, {"body": "I hear you , gf job is in burbank CA, i'm moving there in a year. we'll be renting for a long ass time.", "score": 6, "replies": [{"body": "You are gonna love burbank. You white?", "score": 6, "replies": [{"body": "i'm white she's asian. from what i've heard perfect fit.", "score": 18, "replies": [{"body": "Any pornos?", "score": 21, "replies": [{"body": "trust me bby you don't want. it's like andy dwyer pre weight loss fucking a shorter heavier lucy lui", "score": 22, "replies": [{"body": "Go on...", "score": 24, "replies": []}, {"body": "I'm sure that's someone's fetish in this god awful  sub.", "score": 25, "replies": []}, {"body": "Won't know if I don't want it if I haven't seen it.", "score": 4, "replies": [{"body": "fair enough. if/when we make a debut. you get the bloopers.", "score": 6, "replies": []}]}]}]}, {"body": "Oh of coooourse. Haha. In that case you guys are good.", "score": 4, "replies": []}]}]}]}, {"body": "Where do you live?\nThat will determine if it's the right time to buy.", "score": 1, "replies": []}]}, {"body": "Sell the house without telling her then squat in it until the pop\n\nOr cash out as much as possible with an equity loan then default after the pop", "score": 36, "replies": [{"body": "find a kid somewhere, it will be almost impossible to get you out of the house if you have a kid.", "score": 12, "replies": [{"body": "Why? I have 3 kids but none of them are very good fighters.", "score": 37, "replies": [{"body": "That is your failure, your legacy", "score": 33, "replies": []}]}, {"body": "/r/unethicallifeprotips", "score": 5, "replies": []}]}, {"body": "name checks out. \n\nsaving comment for later use.", "score": 3, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.7417  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/20503)", "score": 1, "replies": [{"body": "does that make the rates lower?", "score": 1, "replies": []}]}]}, {"body": "They said that about the Canadian market for 8 years now lol. Not going to be a huge correction more like stagnant growth for a long period of time.", "score": 25, "replies": [{"body": "Well, the foreign-investment tax really helped cool off the markets from getting too ridiculous. So that was good. But the problem still remains that lots of young Canadians cant afford to buy homes unless they have help from their parents.\n\nPrices have slipped quite a bit already in the richer home areas though.  The 1.5m+ homes took quite a beating from what Ive heard.\n\nI also heard about a big problem with developments in the richer GTA areas (oakville,burlington) where people took out large mortgages to put down payments on pre-construction homes but in the time it took for the houses to be built, the value of the home dropped and now the banks are saying those mortgage's are too large to cover.  So all of those people who entered contracts with the developers are going to default on their mortgages.  \n\nTheres a class action lawsuit in the works where all of the people who bought in are trying to sue the developer and get them to lower the prices but thats so ridiculous to me that I cant see it working out.\n\n\nEdit:  Link for those interested(i may not have described it perfectly)\n\n https://www.thestar.com/business/2018/04/04/they-bought-their-prebuilt-homes-at-the-markets-peak-now-they-face-financial-ruin.html\n\n\n", "score": 13, "replies": [{"body": "It's not the foreign investment tax that caused the market to soften, it's more so the new mortgage stress test they put in. It basically forced everyone who was just barely able to afford a mortgage before to not be able to afford one now. This means that people buying houses and condos now are over qualified for the motgages they are getting.\n\nEdit: also the Toronto star is a sloppy liberal rag", "score": 8, "replies": []}]}, {"body": "Interest rates only started rising more recently, and you're going to start seeing more mortgages getting renewed at those higher rates. As those interest rates rise further, a larger and larger portion of renewers aren't going to be able to sustain their new payments, and are going to have to sell. If enough people need to do this at the same time, you're going to see prices dropping, causing some people to go underwater. As this accelerates, more and more people are going to have these houses that they owe more on than they're worth, especially if they had mortgages with less than 20% down required.", "score": 1, "replies": [{"body": "They already added a stress test to cool the market. Prices have already come down. New people entering the market with the new stress test are over qualified for the mortgage their are getting.", "score": 1, "replies": []}]}]}, {"body": "Some perspective from a guy who has lived all over the country in the past 10 years (WA, OR, CA, AZ TX, KS, CO, MS, FL, NC, SC), the US is headed right back to where we were in 2008.  \n  \nMy average employee makes $60k per year, the highest paid hourly hand I have made $80k in 2017.  Every single one of those people has purchased a house >$400k in the past 2 years.  At least 5 of those people took out what they're calling a \"97 loan\" or some shit like that, which basically means they only put 3% down.  \n  \nThese are the same people I can't reasonably rely on to show up to work at their scheduled time and place.  Its gonna get ugly again at some point, I just don't know when.", "score": 59, "replies": [{"body": "97 percent loan is smart. It allows them to walk away with min. investment into the housing.\n\nSure you can say the 97 percent loan is stupid, but there is some key differences. 3 percent being a big one. Back in 2005 people put practically zero down and the ones that couldn't even afford the monthly payment had so many lenders come out and give them them ARMs or interest rates nearing zero in the interim.\n\nThink about this. I had a 100,000 loan at 2.8 percent. Just the interest alone on a 15 year payment is only like 180 a month with 600 being principal and the rest being property taxes (fuck you Nebraska). \n\nNow think about some poor fuck in 2005 that had the same thing when rates were maybe closer to 4-6 percent. The banks basically waived that into the interim. So you are talking about banks letting people buy 100,000 houses at 700 a month....on a 15 ARM...for 3 years. Then they just fucking hammered them when the ARMs readjusted and peoples payments went through the roof. \n\nBanks are smarter today though.\n\nBut look at it this way. What is the cost benefit to living somewhere for 3 years? A 2 Bdrm apartment in Omaha in a decent area will be around 800ish - 1000. \n\nSo if you live somewhere for 3 years it amounts to 36,000. If you have a 30 year loan with 3 percent down plus PMI (tax deduction) and you pay 700 a month you still really come out ahead.\n\nI am willing to bet people who walked away from their home in the recession are better off today than those who kept them especially in areas where housing still hasn't recovered back to 2007 prices.", "score": 22, "replies": [{"body": "This is all correct, but just adding emphasis that the REAL evil was the ARMS. \n\nOnly a very small minority of people will take out a loan that they have no chance of supporting financially; the kicker is that responsible people looked at the ARM payment said \"I can make that\", then even looked at the \"reasonable\" adjustment estimates and said \"I can make that, and if I can't, I'll refinance\" and then the rates adjusted waaaay beyond what they expected, couldn't refinance because the lenders we're gone and couldn't make the new payments.\n\nThe thing missed by everyone above is that ARMs are making up a hyper-minority of loans today, and the VAST MAJORITY of home ownership ate on fixed rate mortgages. \n\nNow, you could make the case that they can't afford them (income qualifying on FNMA laloand is very conservative right now, but whatever) but because those loans are a fixed payment in the mail it's of cases, default rates are way way down, and there isn't the same time bomb waiting like there was in '08 with so many ARMs written leading up to the crash.", "score": 20, "replies": [{"body": "It is almost impossible to predict rates. Like when I took 4.75 I thought there is no way housing rates would go lower. NO WAY. Like I would have bet a testicle at 25 back in 2011. The market was at the bottom and the bull market was starting up. Jobs were picking up. Then they tanked in 2012. ", "score": 9, "replies": []}, {"body": "Not even just ARMS, Interest only ARMS, so people were paying for a couple of years and owed the same exact amount", "score": 5, "replies": [{"body": "Wachovia was even doing pick-a-payment loans, where you could pay less than the monthly interest payment and have the balance added to the principal.  Combined with liar loans that had landscapers claiming $150k annual income it was a disaster waiting to happen.", "score": 7, "replies": []}]}, {"body": "> Now, you could make the case that they can't afford them (income qualifying on FNMA laloand is very conservative right now, but whatever) but because those loans are a fixed payment in the mail it's of cases, default rates are way way down, and there isn't the same time bomb waiting like there was in '08 with so many ARMs written leading up to the crash.\n\nThose mortgages were packaged into AAA rated vehicles when they shouldn't have been rated so highly. What are your thoughts on the situation if things were rated properly?", "score": 1, "replies": [{"body": "Well, depends on what we mean by rated properly. ARMs shouldn't have been mixed with fixed rates in CMOs, full stop. It's impossible to rate a composite asset like they did \"properly\": it's a mix up of apples and oranges. So, the risk profiles of those assets were completely wrong, and they were way way way over leveraged, and by all the wrong people (the highly risk averse). As much as it's a cliche: it really was the perfect storm.\n\nSo had they kept those assets confined to different CMOs by class, the market for ARMs would have stayed smaller, and the people investing in them would have been better versed (hopefully) of the risks they posed if the rates shot up. In such a case, the issues might have been confined to a very small portion of the overall market, but there are a lot of \"ifs\" going on there so who knows.", "score": 1, "replies": []}]}]}, {"body": "Strategic defaults usually aren't the best way to go...", "score": 8, "replies": [{"body": "Yea but you are on a subreddit where the main flair is a million dollar yacht. Strategic defaults aren't terrible. Have you talked to someone who did a strategic default?", "score": 5, "replies": [{"body": "I know more than a couple people who executed strategic defaults very well. For the shithole the economy was back then they walked away in much better shape than plenty of other people.", "score": 1, "replies": []}]}, {"body": "Why not? When the house down the street is now selling for $200K less than what you paid and you made a small or no down payment you would be smart to default, live in the house for free for two or three years for the foreclosure to clear, and save a pile of cash in the meantime.  This doesn't work in other countries where mortgages are recourse loans.", "score": 4, "replies": [{"body": "I'm pretty sure only 1/3 of the US is non-recourse, the laws vary from state to state.. and in a recourse state unless you're willing to declare bankruptcy you likely won't be protected from that debt.", "score": 2, "replies": []}]}]}, {"body": "You are a fucking idiot if you think a 97 loan is smart. Youre the exact type of person that put the country in financial straits.", "score": 16, "replies": [{"body": "I bought a home ~2.5x my yearly salary.  I took a 97 because with low interest rates why not?  It gave me more flexibility to keep cash in case more unexpected things came up with the house, or I could invest it and hope or > 4% returns.  Or if it turns out I don't need the extra money, I can just throw it at the mortgage.\n", "score": 16, "replies": [{"body": "indeed they're missing the opportunity cost of the money they'd be putting away upfront and in higher interest rates. perhaps from a broad macro view of economy it's not \"good\" but from an individual perspective it leaves you best off to do what you did. ", "score": 14, "replies": []}]}, {"body": "A 97 loan is very smart if it's non-recourse. When shit hits the fan you just walk away and the bank can't take it out of your ass. But if home prices keep going up somehow you're levered to the max.", "score": 10, "replies": [{"body": "Can i get you a beer. I feel like I am the only realistic anti american.", "score": 7, "replies": [{"body": "Sure, if you could send me a four pack of Heady Topper or Focal Banger that would be great.", "score": 2, "replies": [{"body": "Is that some bitch beer? Never heard of it. Link?", "score": 4, "replies": [{"body": "Heady Topper is an 8% IPA that is ranked #2 beer in the world: https://www.beeradvocate.com/beer/profile/46317/16814/\n\nFocal Banger: https://www.beeradvocate.com/beer/profile/46317/111616/\n\nYou can't buy them outside Vermont", "score": 7, "replies": [{"body": "Heady Topper. My nigga. This dude beers. I spend the majority of my winters at Killington. ", "score": 2, "replies": [{"body": "So jealous right now. Back when I was living in NJ I would try to do 2 weeks up there every winter. Mendon area.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I am telling you there wouldn't be a market without FHA 97 loans or 3 percent down. ", "score": 2, "replies": []}, {"body": "the smallest down payment is best for the individual, interest rates being equal", "score": 1, "replies": []}, {"body": "It is smart, it's called leverage. ", "score": 1, "replies": []}, {"body": ">Youre the exact type of person that put the country in financial straits.\n\nMoral hazard can go both ways.  I would say the people who lent the money at 97% with 3% are the people that put the country in financial straits, not the people who took out said loans.", "score": 1, "replies": [{"body": "Except, lenders are forced to provide loans to people with shit credit based solely on their skin color or some other minority status.  \n  \nFuck off with your moral bullshit, the only reason these loans exist is because the government forced lenders to allow retards that make $30k per year and have a mid 90s Dodge Viper parked in front of their single wide trailer to take out a home loan. ", "score": 1, "replies": [{"body": ">Fuck off with your moral bullshit\n\nWhile the word \"moral\" appears in the term \"moral hazard,\" it is actually an [economics and investment concept](https://www.investopedia.com/ask/answers/09/moral-hazard.asp) not actually a moral or ethical one – so I am talking about economic and investment \"bullshit\" not moral \"bullshit.\"  Additionally it isn't \"bullshit\" as consequences of different moral hazards are what cause most financial crises including the last one.  As such \"moral hazard\" is actually \"significant\" instead of \"bullshit,\" and thus it is \"significant economics\" not \"moral bullshit.\"\n\n>the only reason these loans exist is because the government forced lenders\n\nAlso wrong, while the government did encourage loans to lower income individuals among the regulated lending agencies, basically all of the worst loans were originated from unregulated lending agencies (i.e. ones the government did ask anything of in terms of lending quotas), and these loans were also made to far more impoverished and at-risk individuals the government was asking even the regulated agencies to reach a certain quota on.  [Here is a link to help you catch up with reality on that fact](https://archives.cjr.org/the_audit/the_big_lie_of_the_crisis_call.php) – I can provide you with many more if you would like.\n\nNo what caused the bad loans was that the banks were repackaging them as CDOs and selling those to people who didn't understand them – and these \"bag holders\" or \"chumps\" were also befuddled because the banks paid the credit agencies to stamp AAA (investment grade) creditworthiness upon these CDOs.  The worse and more at risk the home-loans making up the CDOs were, the higher the % yield on the CDOs, and as they were almost all stamped AAA any way, the better they sold.  This created a huge demand by these big banks to get as many home-loans that were as bad as possible so they could repackage them and sell them as CDOs to \"chumps\" and \"bag holders.\"  So with no government involvement the banks and the associated subsidiary loan originators went out of their way to create as many loans that were as terrible possible.  We know the big banks and originators thought these were all crap loans, because all of them tried to sell theme off ASAP to the next individual in the chain so as to not be stuck with them, and then many of these banks subsequently took out massive credit default swaps (speculating heavily in favor of their inevitable failure) on the very CDOs they just sold – they litterally shorted their own shit as soon as they could make and sell it off, before looking for more terrible loan prospects to start the whole process again.\n\nNone of this has anything to do with government involvement, no this is all the free market doing what the free market does best, which is finding chumps to manipulate and fleece.  Just like they found you and related people to be the chumps to run interference for them on their fabricated sob story after they got caught blowing up the world.  Just like they will get more chumps like you to run interference for them when the current sub-prime auto loan bubble (that they themselves purposely created for similar reasons as the sub-prime housing loans previously, again with no government pressure) will inevitably burst and do societal damage.\n", "score": 1, "replies": []}]}]}]}, {"body": "rates went down so arms were the right play... where people got it wrong was buying with interest only loans with baloon payments or specific dates where they had to pay back a large chunk of principal", "score": 2, "replies": [{"body": "I upvoted you but you are right, the arms do get adjusted every year. I meant to say the baloon payment shit. ", "score": 1, "replies": [{"body": "I think they (aka dickheads) would buy a 700k house with an interest only arm, so when the 5 years was up they would have to go based upon an interest and principal payment so their 1200 bucks a month payment on their 700k mcmansion shot up to like 4k a month after 5 years and they couldn't sell because, no equity... and boom", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yea but you are essentially buying more space and you don’t have rent prices that fluctuate. Plus you don’t have any apartment fees that have existed since the end of time. People moved into homes without putting anything down back in the day.", "score": 0, "replies": []}]}, {"body": ">  15 year payment is only like 180 a month with 600 being principal and the rest being property taxes (fuck you Nebraska).\n\nWould you care to explain the 600 being principal part please? Know next to nothing about mortgage myself. What does the principal mean here? So it includes interest payment and everything else?\n\nThanks.", "score": 2, "replies": [{"body": "No principal is the cash paid to the loan amount, interest would be the interest paid per month on the loan, property taxes are escrowed so they are paid monthly to a bank account which is used 3 times a year. Once to pay insurance, and twice to pay taxes. ", "score": 1, "replies": [{"body": "Gotcha, so 600 will be for the loan payment. Then what's the 180 you mentioned before for? Thanks.", "score": 1, "replies": [{"body": "per month I pay 600 toward my loan amount, 180 to the month in interest, like 280 for escrow which is money I would need to pay if I owned my house. For instance if I have no loan I would still have to pay Home Insurance and Taxes 1-2 times a year. ", "score": 1, "replies": [{"body": "Gotcha, thanks a lot!", "score": 1, "replies": []}]}]}, {"body": "Gotcha, thanks a lot!", "score": 1, "replies": []}]}]}, {"body": ".. unless the house prices all drop, and you owe a $400k mortage on a house worth $300k.\n", "score": 1, "replies": [{"body": "Telling you if that happens and you default on the payment in some cases the bank will pay you to leave. ", "score": 1, "replies": []}]}, {"body": "The ARM is the thing that murdered the economy. We are no where near 2008.", "score": 1, "replies": []}, {"body": "A lot of this feels like over-reaction. 2008 was not in response to high home values. It was bad lending coupled with poorly bundled mortgage bonds (and, well, high home values along with other shit). Home values are going to stay fine as long as lending practices don't return to pre-08 degeneracy, and even then there's a lag time while everything blows up. Like you said, getting an ARM now makes very little sense and costs a ton of points so they're virtually off the market at the moment. Lotta fear mongering goin' on. ", "score": 1, "replies": [{"body": "Sure but as interest rates increase your ability to buy X house with X dollars a month goes down. Everyone buys on monthly payment so there might be a small pull back, but not enough to go ahead and pay inflated rents. ", "score": 1, "replies": []}]}, {"body": "Did you calculate pouring money into the gaping pit called home maintenance?", "score": 1, "replies": [{"body": "Considering I have spent 12,000 on repairs in 8 years in my house. New fireplace, new hvac, new roofing insurance claim, 3 appliances and 2 rooms of flooring yea I did. I still come out ahead. ", "score": 2, "replies": []}]}, {"body": "I would do 3% in a non-recourse state, but I live in a Max Recourse state, can't just mail the keys to the bank and have a foreclosure party. ", "score": 1, "replies": []}]}, {"body": "Interesting, I know its anecdotal but it's still telling. I dont live in the US but I have the same speculation that history will repeat itself.  Maybe not to the same magnitude as 2008, but certainly a watered-down version of it.", "score": 7, "replies": [{"body": "It's not telling: it's an anecdote.\n\nJust wrote wall of text on it, but if you're right about history repeating (you might be) then the signal will be a larger percentage of adjustable mortgages written.\n\nRight now there are basically none.", "score": 6, "replies": []}, {"body": "It'll happen in China soon enough.", "score": 2, "replies": []}, {"body": "Yea but how do you feel about $AAPL. If apple increases their value by 12 percent YOY in 15 years they will have like a 3 trillion dollar market cap. Its insane but my numbers are probably wrong. ", "score": 1, "replies": [{"body": "I dont see the connection. But FWIW I hate AAPL so im emotionally short against it which has only cost me money in the past.\n\nI dont even care about the profit, I just wanna see AAPL tank. ", "score": 1, "replies": [{"body": "The point I was trying to make is everyone thinks housing values have peaked but then if you point out the statistic I just mentioned about Apple it seems pretty crazy, yet that didn't stop Buffet. ", "score": 2, "replies": []}, {"body": "Never short a company that understands good design and human factors and has such immense brand recognition, no matter how much you hate their tech.", "score": 1, "replies": []}]}]}]}, {"body": "$60 - 80k a year and a >$400k house? That is insane. I make $120k a year and got a $340k house. I make enough to cover the mortgage but at first I was struggling and ate ramen noodles for months.", "score": 6, "replies": [{"body": "People in my area making 120k a year are buying 600\\-700k homes.\n\nYep.", "score": 10, "replies": [{"body": "Also insane. If they lost their job they'd be homeless in a few months...", "score": 7, "replies": []}, {"body": "Worst part is that won't even afford you a home in some areas.", "score": 3, "replies": [{"body": "Yep. Have MD friends making 220k \\(that's the lower end\\) not being able to buy homes in LA area because they're getting priced out or out\\-bid by cash buyers.", "score": 1, "replies": [{"body": "My neighbour was a resident who's family paid for everything. She went to a posh boarding school in BC for highschool that cost more than both of my degrees. She was very smart but kind of retarded in the real world -- wondered why she didn't get mail when she hadn't shovelled near her mailbox for weeks. \n\nShe moved back to BC, Vancouver actually, but no longer sucking the family teet as strongly. She immediately was complaining on facebook of how she cannot afford the prices within BC... you're a fucking doctor from a mega rich family, that shows there is something wrong. Also it might be that she can't budget as she has no concept of the worth of a dollar and drank $11 bubble teas 9 times a day or something.", "score": 1, "replies": [{"body": ">drank $11 bubble teas 9 times a day or something.\n\nThat's such a West Coast thing.\n\nAlso FWIW the MD friends I mentioned eventually was able to buy with help of $$$ from parents.\n\nAnd yeah it does show something is wrong with home prices when doctors making decent living have to think twice about buying a home \\- even though they come from wealth.\n\nYour friend sounds like mine but the female version. Calls me up about toilet backing up etc. and asked what to do.\n\nBut they've been in school \\+ training for so long that by the time they join the real world there's a big disconnect so I give them a break. Most normal ones catch up quickly when given time.", "score": 1, "replies": []}]}]}]}, {"body": "Holy fuck", "score": 1, "replies": []}]}, {"body": "At 120k a year I would think a 340k home would allow for a very comfortable living.  Good on you for living below your means.  But unless you have really expensive hobbies, that seems like an easy to carry mortgage, no?", "score": 9, "replies": [{"body": "Your forgot his gambling addiction.", "score": 14, "replies": [{"body": "And hookers and cocaine habbit. ", "score": 5, "replies": []}]}, {"body": "Yeah, his mortgage is less than 20&#37; of his income. He shouldn't have any trouble. Then again, he is on this sub...", "score": 3, "replies": []}, {"body": "Maybe he has a 5 year loan", "score": 1, "replies": []}, {"body": "I spend a lot and was broke after buying my house after putting $50k down on it.", "score": 1, "replies": []}]}, {"body": "I made ~120k last year and im looking at a house for 229K, still feels like too much commitment lol", "score": 3, "replies": [{"body": "Same here.  My house in Alabama was bought by me in 04 for 162k.  14 years later, it appraises for 169k.  Suck.  We are selling it and closing is scheduled for Aug 24.  We are finally selling at 142k.  We got hosed on shit built houses, and a market that appreciates very slowly in good times, and falls backward in bad or average times.\n\nI will never buy owned real estate again.  I will rent, and move when I like.  I will devote my equity dollars into savings and investment in paper assets.  They can fall, they can rise.  But I don't have to put a new roof, hvac, and water heater in them.", "score": 1, "replies": []}]}, {"body": "Jesus, my parents bought a 600k house on a 100k/year income. After 12 years, they paid it off. ", "score": 2, "replies": []}]}, {"body": "two people making 60k can easily afford a 400k housw though without other debts", "score": 1, "replies": []}, {"body": "for a bot you have great english.  that bot that corrects mispellings must really be making a difference!  (yes i know)", "score": 1, "replies": []}]}, {"body": "Buy a duplex and rent out half. ", "score": 11, "replies": [{"body": "Bubble is expanding. Rent the duplex and buy on short sale or foreclosure after the pop.", "score": 11, "replies": []}, {"body": "We rent the basement already - best way to make the home affordable.", "score": 1, "replies": [{"body": "Then you gotta live with other wallstreetbet users", "score": 3, "replies": []}]}]}, {"body": "Canadian housing market is puny compared to America's. There is 30 million people living in all of Canada, less than the population of California. Even if the Canadian market goes upside down, the ripple effects in the global economy will be no where close to what happened in 2008-09. Plus the social/liberal economic policies which Canada operates under will most likely help those whose mortgages go under. This is coming from a former Canadian. ", "score": 11, "replies": []}, {"body": "Canada has new housing regulations for home buyers, you have to pass a stress test of your mortgage at 5.34% if you don't have 20% down, so assuming $100000 household income, and only 20k down max you afford is 500k for a home now instead of 1 million", "score": 7, "replies": [{"body": "Which is where it should be! If you can support, I won't use the word afford because you can't, so if you can support $1,000,000 at 1.8% why would you leverage every last dollar so you couldn't support a single interest uptick. \n\nIt's as if the stress test is protecting people from themselves.", "score": 1, "replies": [{"body": "Yah, I know a lot of dumb people that buy things just because they can and not because bit makes sense. That's why I hate this housing market, right now none of it makes sense  avg house hold salary is 76k so at reasonable prices your looking at upper end of 300k to 200k for a home but in today's market that is a price of a condo not a single family condo, mobile homes are going at 120k to 200k  depending on lot location... For a trailer house...", "score": 1, "replies": [{"body": "I understand in scarcity areas. NYC makes sense in that you cannot build outward anymore, you have water in the way. Instead we have Montreal which was reasonable for a long time until now it's getting heated. Ottawa was even reasonable for a long time... now it's all gone to hell everywhere.\n\nVancouver I would argue should be higher simply due to mountains versus ocean, even if it wasn't a speculative wet dream filled with foreign buying. Probably not where it's at today but higher than average. \n\nEverything east of the Rockies should be dirt cheap, there's essentially unlimited land yet Calgary is still high from boomtime (despite high unemployment and excess housing stock).\n\nOntario you could argue there are lakes that act as blockades, but the GTA is the biggest driving issue, again with speculation. \n\nThe Atlantic provinces are cheaper, because the economy there is not great but I would argue home ownership there is still expensive due to property tax. ", "score": 2, "replies": []}]}]}]}, {"body": "Canada is in a predicament for sure. Everyone is leveraged to the dick and spending every last dollars on soaring rents. Wages are ticking up because of the strong employment back drop but between that and oil, inflation is going to tick up. Poloz needs to pray inflation remains in check while he raises rates slowly. ", "score": 6, "replies": []}, {"body": "Yup, I am heavily involved in the real estate industry. All these buy renovate rent refinance fucks are gonna get their assholes inverted in a couple years when it all comes crashing down. Buying in crackhead areas that values never went up for more than $10K in 10 years and now they are cause of a lack of supply. Fools.\n\nCMHC has LESS money to cover defaults than it did a couple years ago and it got smoked pretty hard in 2008 already.\n\nImplosion imminent, stack cash & buy rental properties when it all comes down. ", "score": 5, "replies": [{"body": "Our plan is to wait until the housing market corrects (goal @-30-40%) - buy a second house and rent out top and bottom floors of the one we're in now. \n\nA big crash would be just great - as long as getting the second mortgage isnt too much of an issue.", "score": 3, "replies": []}]}, {"body": "As a Canadian looking for a home in a year or two. I love this, burst baby!", "score": 7, "replies": [{"body": "Haha so many people are eager to BTFD on Canadian homes we might not get the crash that everyone wants.\n\nI really do think timing is important though. Certainly more so now than any time in the past 30 years.\n\nHope your first purchase goes well!", "score": 7, "replies": [{"body": "The other dip are the tons of baby boomers trying to sell their house for a golden parachute retirement, or liquidating those homes as estate when they die and are eaten  by their cats.", "score": 3, "replies": []}]}]}, {"body": "Home prices have already dropped thanks to a foreign buyers tax. They also tightened mortgage rules. \n\nhttp://www.cbc.ca/news/business/april-house-prices-1.4663359\n", "score": 1, "replies": [{"body": "This could get interesting for people who bought in the hot Toronto and Vancouver markets in the last couple of years.", "score": 1, "replies": [{"body": "Yep some people already complaining about buying and their home is worth 100-200k less than purchase price.", "score": 1, "replies": []}]}]}, {"body": "> As a homeowner, Im trying to convince my gf we should sell the house and live in our cars until the bubble pops.\n\nAnd what will you do when interest rates go negative and you're sitting on all this cash?  ", "score": 1, "replies": [{"body": "Yolo on FD's probably.", "score": 2, "replies": []}]}]}, {"body": "Everything is relative.  Prices are actually down where I live in Manhattan. \n\n\nIn all seriousness once you enter the housing market you don't have general housing exposure.  If the market falls off a cliff when you're ready to move, you're selling at a loss but you're also going to be buying in a low market.  Your only actual risk is the arb between the housing market where you live now and where you want to move to as well as the arb between your 1 bedroom jerk off den and your 5 bedroom wank palace.\n\n", "score": 43, "replies": [{"body": "But, if you sell 150K down, and buy something else that is down, you are still down 150K. Right? That home may go up, and you might make up the difference if we re-pump the bubble. Otherwise you are paying off that loss. No? ", "score": 2, "replies": [{"body": "You still have a house. The key in my comment is “once you enter”. The point is it’s a market that once your in, you don’t get out until you die. Hopefully. ", "score": 2, "replies": []}]}, {"body": "Where do you live? Looking to move in two months to like, Murray Hill / Midtown East", "score": 1, "replies": [{"body": "From where? Midtown sucks too crowded", "score": 1, "replies": []}]}]}, {"body": "I am purposely living in an RV because housing prices are retarded for what you get. \n\nSellers saying their house that still has pink shag carpeting from the 70's is worth 400k because the neighborhood makes it worth.  Fuck you.\n\nSaving a grip of cash doh.", "score": 26, "replies": [{"body": "Yea, Id rather sit on my pile of cash playing the market than spending it on an overpriced house with shag nasty shit and a 1980 modeled kitchen.", "score": 13, "replies": [{"body": "Is my standard of a house just shit or are you just looking for a house of literal bullion? ", "score": 1, "replies": []}]}, {"body": "They're not necessarily wrong, though. Location is vastly more important than the state of the house itself in the long term. ", "score": 6, "replies": [{"body": "Meh. I've lived in rich and poor areas in big cities and small.     \n     \nImo, location's overrated. People spend most of their time at work and at home anyway. What's an extra 5-10 minutes on your commute if you're saving ~2x your salary? ", "score": 1, "replies": [{"body": "I'm talking market value, not personal preference.\n\nAlso, here in the Bay Area, an extra 5-10 mins to your commute isn't going to save you that much.", "score": 1, "replies": [{"body": "Sure, but my personal preference is also that of many others. In my area (not SF), prices in the city rise until people decide the burbs are worth the commute, at which point, prices in the city come back to reality. I'm old, and I've seen this happen a few times. ", "score": 1, "replies": [{"body": "Right... location. Like I was saying. ", "score": 1, "replies": [{"body": "Nah, I'm saying that price trumps location because people who have property in decent locations overvalue it. Just because they slap a high price tag on it doesn't mean people are buying. I've seen the homes in nice locations sit on the market for years while homes in other areas sell like hot cakes. Imo, the main driving factor of home sales is no longer location. And, I think that will become even more the case as more people telecommute, take mass transit, and/or drive autonomous autos, which will all only increase in the future. ", "score": 1, "replies": [{"body": "No market is immune to people being overly optimistic and pricing themselves out. Location is still by far the largest factor in home pricing, and will be for the foreseeable future. This really isn't even up for discussion, it's a veritable fact. It's why run down shacks in Palo Alto will sell for $1m+ with no problem, while mansions in Bumfuck, Kansas that cost half as much will sit on the market forever.\n\nMass transit etc. really doesn't change that. You still have to be relatively proximate to the job center. And remote working isn't going to be nearly as prevalent as you think; people still need to be able to meet in person regularly in virtually every industry.", "score": 1, "replies": [{"body": "I'm not saying location doesn't increase price. I'm saying people can't afford the prices, and resultantly, they aren't buying for location as much, hence: price > location, as a determinant for actual sales. ", "score": 1, "replies": [{"body": "Well duh, of course price is going to be the ultimate determining factor in any individual sale. But price isn't a fixed feature of the property, it's purely made up by the seller and can be adjusted at will to meet the market. We're talking about two very different concepts here. I'm talking about what goes into the function that determines a property's value. Price is the output of that function, not a factor. Real-life sales is a different matter, and doesn't really mean anything when evaluating the long-term value prospect of a given property.", "score": 1, "replies": [{"body": "Indeed. I'm with ya on all of that. Cheers. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Skip the middle step and just get a cardboard box in an alley. Does the same thing.", "score": 27, "replies": []}, {"body": "If you love leverage, and I'm sure you do if you're on this sub, mortgages are great. 5x is standard, but you can get up to 33x depending on the lender, amount borrowed, etc. No margin account comes close to that.", "score": 26, "replies": [{"body": "Sure but the ROI on that leverage is crap compared to my FDs", "score": 11, "replies": [{"body": "If a number is big but has a minus sign in front, it's actually smaller than any number without a minus sign in front.", "score": 22, "replies": [{"body": "That doesn't sound right", "score": 3, "replies": [{"body": "[obligatory](http://i0.kym-cdn.com/photos/images/newsfeed/000/922/662/786.png)", "score": 1, "replies": []}]}]}]}, {"body": "Yeah but margin + options + leveraged ETFs. ", "score": 1, "replies": [{"body": "I haven't done the math but I doubt even $SOXL monthlies on margin will get you 33x.", "score": 1, "replies": []}]}]}, {"body": "It's just a little gulley...", "score": 40, "replies": [{"body": "But I would say the sellers are motivated ", "score": 12, "replies": [{"body": "Wow, a lot of people seem really motivated.", "score": 12, "replies": [{"body": "Oh, it’s just the gulley", "score": 9, "replies": [{"body": "I need to talk with my wife... actually I'd like to talk to a mortgage broker, anybody you recommend? ", "score": 3, "replies": [{"body": "Bitch better like me, sent her ass to Cabo", "score": 5, "replies": [{"body": "I focus on immigrants, you know, once they find out they're getting a home they sign where you tell them to sign.", "score": 2, "replies": [{"body": "Fucken idiots ", "score": 1, "replies": []}]}]}]}, {"body": "Just nerves ", "score": 3, "replies": []}]}]}]}]}, {"body": "My sister in law just sold their house for 6k over the ask, and my wife is panicking that we need to buy before the prices go up even more!\n\n", "score": 35, "replies": [{"body": "[deleted]", "score": 73, "replies": [{"body": "I can tell you that I bought my other house in 2007, So ¯\\\\\\_(ツ)_/¯", "score": 36, "replies": [{"body": "[deleted]", "score": 45, "replies": [{"body": "the flair is a joke, not serious.", "score": 8, "replies": [{"body": "Keep telling yourself that", "score": 32, "replies": []}, {"body": "Need a mod to weigh in for clarity sake, just in case.", "score": 5, "replies": [{"body": "# MODS.... MODS... MOOOOOOOOOOOOOOOODS!", "score": 2, "replies": []}]}]}]}, {"body": "make a thread when you buy the new ones pls", "score": 1, "replies": []}]}]}, {"body": "Move to somewhere cheap, problem solved.", "score": 7, "replies": [{"body": "I would rather not live in Gary Indiana", "score": 29, "replies": [{"body": "Exactly, if you’re dead you won’t be saving. ", "score": 4, "replies": []}, {"body": "then don't", "score": 2, "replies": []}, {"body": "which is probably why the houses in the Birmingham, AL metro never appreciate.  Poor investment.  Never again.", "score": 1, "replies": []}]}]}, {"body": "Ask her where she plans to live? Wives are always so short sighted. ", "score": 4, "replies": [{"body": "All over the place. Somewhere different every month. But we need to buy a house.", "score": 6, "replies": [{"body": "Just rent a house and tell her you bought it. ", "score": 7, "replies": []}]}, {"body": "short $wife...?", "score": 3, "replies": []}]}, {"body": "I mean depending on where you live she might be right. If you’re in places like San Fransisco or SoCal and Orange County area the housing prices are going up fast", "score": 4, "replies": [{"body": "....Those the only places most likely be the bubble that OP is worried about.  Look at the High End Luxury in NYC; it's starting to fall off a cliff.  If SF is all too expensive fancy new condos they're going to come down in price relatively soon too. ", "score": 1, "replies": [{"body": "SF might be a bubble (because the tech boom there might be a bubble) but there is no bubble in south LA and Orange County area. ", "score": 2, "replies": []}]}]}, {"body": "They will go up more.  I lucked the fuck out and bought last year at below 3%.", "score": 3, "replies": []}, {"body": "Lmao 6k over ask, I got that bay area life\n\n500k over ask for 1000sqft house LMAO", "score": 3, "replies": [{"body": "So sustainable ", "score": 3, "replies": [{"body": "Dude I have been saying that shit since 2011.\n\nIt's insane, I had to move away because I couldn't hang", "score": 1, "replies": [{"body": "If you had bought in 2011 you'd be singing a different tune. ", "score": 1, "replies": [{"body": "That's the problem, it was still expensive relative to income then", "score": 1, "replies": [{"body": "No it wasn't. You could get a 2bd 1200 sqft SFH for under 400k. That's around 2k/month after taxes and breaks. \n\nEdit: I'll add that rates were 3.75% at the time. I got a mortgage at 3.375 actually. ", "score": 1, "replies": [{"body": "Ok I will give you that in certain areas, but not where I lived.\n\nAnyway, just saw this article on the front page LMAO\n\nhttps://sf.curbed.com/2018/5/16/17361746/salary-needed-buy-home-house-san-francisco-2018-california\n", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}, {"body": "Japantown!  Id never live on the east side. \n\nYea prices are insane now. People are selling stock while it's high.  Also, they seem to be pricing in the upcoming interest rate hikes. ", "score": 2, "replies": [{"body": "Yeah it is, I lived in Santa Clara and now it's insane. 1mil average home price. \n\nMoved to Sacramento and commuted for a year and half before transferring up there. Haven't missed a thing.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "zero down, then yolo your HELOC", "score": 14, "replies": [{"body": "What other options are there tbh ", "score": 2, "replies": []}]}, {"body": "Just bought a sweet house.\n\nFuck you, you renting peasant.", "score": 37, "replies": [{"body": "Same. Plebs. ", "score": 12, "replies": []}, {"body": "Same. Rookies.", "score": 6, "replies": []}, {"body": "Samsies. I now look down on renting pissants. ", "score": 3, "replies": []}, {"body": "I would agree with you, but we will check back in 5-7 years when your roof needs to be replaced or your HVAC system explodes.  Lots more to the cost of a house than the monthly payment.  I can pay 10grand a month for rent, but it leaves me little room for when crap breaks.  I choose to pay 3 grand per month and leave it at that.", "score": 1, "replies": [{"body": "I own a Condo (no roof replacement )and have a 10 year warranty on the HVAC.\n\nYou're getting smoked medium and long term. My mortgage will never go up, and eventually go away. By then, I'll be renting it out.\n\nYour rent will continue to go up FOREVER. Not to mention the appreciation on a leveraged asset. The plain math simply isn't in your favor friendo.\n\n👍😉 ", "score": 2, "replies": []}]}]}, {"body": "Housing prices are not rising anywhere as quickly as we saw pre-2008. As an aggregate we aren't in bubble territory, BUT there are signs of microbubbles in certain cities like LA and Denver. \n\n*Edited for clarity", "score": 24, "replies": [{"body": "IDK where you are getting your data but in Florida we are back to 2006 levels if not higher already.  So I'm saying you are wrong when you are saying housing prices aren't near pre-2008 levels. Where are you getting your data from?", "score": 13, "replies": [{"body": "Sorry I just realized how retardedly I worded my original comment. What I should have said is that the prices aren't rising as quickly as they were pre-2008 and that the median household can still afford the median home.\n[Recent NPR report on the topic](https://www.npr.org/2018/05/11/610315734/rising-home-prices-lead-to-worries-of-another-housing-market-bubble)", "score": 10, "replies": [{"body": "Agreed. And being at the same price that it was 10 years ago means it’s still cheaper when adjusted for inflation. ", "score": 11, "replies": [{"body": "Florida home prices are still very affordable and they are building entire new towns on the gulf coast", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "yeah if you didn't buy before 2014... I feel bad for you. All my friends doubled their money buying apartments. $200k in 2014, just over $420k now (yeah I adjusted the figures to make a weed joke)", "score": 11, "replies": [{"body": "Lol I bought a condo just on the edge of the Denver zip code for $162k in 2016, sold it 11 months later having done zero work on it for $195k without listing. 2014 ain’t shit", "score": 2, "replies": []}]}, {"body": "Wow just checked Zillow, you ain't lie", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "not called mile high for nothing!", "score": 1, "replies": []}, {"body": "And beer. So much good beer. And an actual music scene...and an actual comedy scene..", "score": 1, "replies": [{"body": "yeah i don't care about any of that bs. ", "score": 2, "replies": []}]}, {"body": "mountains make you [long for ROPE, tho](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3114154/)", "score": 1, "replies": []}]}]}]}, {"body": "Depends where you're talking...Prices in Canada have been going up double digits for years.", "score": 3, "replies": [{"body": "Trailer Park Boys has led me to believe I can get a nice trailer in Canada for only $2K. Are you saying this isn't true?", "score": 7, "replies": []}]}, {"body": "Even if we are in bubble territory the housing bubble isn't as dramatic as the stock swings. In certain areas yes housing over night dropped 30 percent, but as a national index it was a slow like 4-8 percent a year drop till 2012.  ", "score": 1, "replies": []}, {"body": "LA checking in. We've blown past 2008 prices about 3 years ago. New highs now and people are just pouring in. Everything is getting super fancy, new bars, restaurants, clubs everywhere. I think LA was too cheap, now it's joining the ranks of SF, NY, Vancouver, Seattle. Tons of foreign money coming in too from China. Given the demographics and population growth I just don't see an end in the near future.", "score": 1, "replies": []}]}, {"body": "It won't be an issue until interest rates rise enough to push prices down. I wouldn't buy right now unless you were living in a cheap area already. ", "score": 22, "replies": [{"body": "The rates are quickly approaching 5 percent. That's just insane, but I guess I don't know what it was like before the housing market crash in 2008.", "score": 13, "replies": [{"body": "People are spoiled by historically cheap interest rates. In the 80s it was 12-13%, and even 4-5% isn't unreasonable. Under 4% was a bargain and inflated housing prices are the result. Hopefully people were smart enough to get fixed rate loans this time around. ", "score": 35, "replies": [{"body": ">Fixed rates\n\nThey were. Overwhelming amount of new loans were fixed. People got burned good last time and lot of them learned the hard way, but learned.\n\nPlus, the yield curve heavily favored the 30-year, so there wasn't really any incentive to take an ARM.", "score": 12, "replies": []}, {"body": "Probably not. Wages aren't going up with housing prices, so people are abusing credit just as much as they were in 2007. ", "score": 7, "replies": [{"body": "All the better for people who don't I guess", "score": 8, "replies": []}, {"body": "The reason why housing prices are going up is because rents are going up. I have a friend that has 3 kids and her rent went from 1000 to 1250 in a year. The landlord basically knew he could get 1250...and he did. The opportunity cost of that is close to 3,000 and it will only go up so people have extreme FOMO. But they don't realize buying at the peak of the market and asset prices, but it probably doesnt matter as much as you think.", "score": 4, "replies": [{"body": "When I last rented (15 years ago, mind you), in Illinois, rent could only be increased by 12% per year. Sucks to be those renters!", "score": 5, "replies": []}, {"body": "Other way around, my dude.  Rents follow home prices.  Land lords need to keep their pricing just under the would-be mortgage of a similar home, else their rents just buy and move out.     \n      \nSource: have been renter and land lord many times. ", "score": 1, "replies": [{"body": "I get what you are saying, but rents go up in a market when there is very little way for people to afford housing. For example if there are no affordable homes to buy or people can't get approved and only rent, landlords can increase their rental pricing. ", "score": 1, "replies": [{"body": "You just paraphrased what I said, which contradicts your previous statement. You're not wrong; ya just said it backwards the first time. Cheers. ", "score": 1, "replies": [{"body": "Either I am confused or autistic.", "score": 1, "replies": [{"body": "The two are not mutually exclusive. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "> That's just insane\n\nwew lad you've got a lot of history to read up on    \n  \n5% ain't shit", "score": 21, "replies": [{"body": "When rates were that high, price was much lower.     \n     \nYou slap 5-10% interest on a mortgage for a $400k+ home (median in my area), the only buyers left would be the Chinese with their funny money. (...cuz China is basically buying Canadain and US cities by subsidizing their peeps).", "score": 2, "replies": [{"body": "So a Chinese economic recession or worse is really what we all should be rooting for?", "score": 1, "replies": []}]}]}, {"body": ">5%\n\nLol, no, that's not insane at all. It's crazy crazy crazy cheap, historically. You can borrow $500k with 3% equity at 5% in some other asset class? \n\nWe've been spoiled with crazy low rates for longer than ever before recently, but don't let the recency bias confuse you: current rates are crazy low.\n\nNow, will they trickle up more quickly than the market can adjust and deflate housing prices? Maybe, but that's a different question.", "score": 16, "replies": []}, {"body": "Was 17 percent in the 80s. Not unreasonable to have these rates go up and not have a crash.\n\nWith that being said we’re gettinng close to the cyclical drop (10-12 years). ", "score": 10, "replies": [{"body": "So you think there will be a pullback in the housing market in the near future?", "score": 1, "replies": [{"body": "Not in the near term. You need to have the market fuck everyone up. People tighten up their belly, then yes shit will repeat.\n\nBut I wonder how the rent is going to be? Will it go down tho?", "score": 4, "replies": [{"body": "Historically, rent goes up in housing crisis since demand goes up.", "score": 4, "replies": [{"body": "And it will again.  bet on that.  Only thing that causes rents to drop is the properties themselves fall out of favor (bad neighborhood, poor condition, etc).  Rents never fall based on macro factors.", "score": 1, "replies": []}]}]}, {"body": "I don’t think so. If it does, the commercial real estate side of things is going to be what drags everything down. Seems like there is a much healthier process in place for getting a mortgage and that investor sentiment is more cautious, which would support that we are less likely to be in a bubble.", "score": 2, "replies": []}]}]}, {"body": "I paid 7% when I bought a house in 2007", "score": 6, "replies": [{"body": "4.5 in 2011 and at 2.8 right now refied in 2012. ", "score": 2, "replies": [{"body": "What are the terms of your loan?", "score": 1, "replies": [{"body": "My house was 136,000 or 133,000 plus closing. I put 34,000 down in 2011 and financed something like 103,000 for 30 years at 4.75 (thought it was 4.5 but I was wrong). My monthly payment was 805. Keep in mind back then my homeowners insurance was like 800 a year (now 1240 and yes I have shopped it) and my property value was 130,000 for tax purposes (now 172,000). \n\nA year later I refied at 2.8 on a 15. My payment went up to 1000 a month. The amount financed then was like 102,300 (thanks 30 year interest!).\n\nMy break even was 13 months. What that means is the interest savings at 2.8 vs 4.75 paid off the cost of the refi (roughly 1300, loan fee of 650, appraisal 400, title insurance 250). \n\nThe loan cost at 103,000 on 30 year without additional principal was 290,000 vs 128,000 for the 15.\n\nI had a low cost broker. But if you follow /r churning advice some people have got loan fees completely waived or got credit card points. Hope I can help.  ", "score": 3, "replies": [{"body": "Yep, I was curious mostly about the term. I thought it was a 15 but it could have been an ARM product. ", "score": 1, "replies": [{"body": "I should have done an ARM but at 4.7 I didn't think rates would have dropped further. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They used to call 'em \"3-6-3\" bankers. Pay interest of 3%, loan it out at 6%, get to the golf course by 3pm. ", "score": 8, "replies": []}, {"body": "Are you 9 years old?", "score": 1, "replies": []}]}]}, {"body": "You ain’t about to time the fucking real estate market bro. You aren’t a genius. The home real estate market is healthy and interest rates are low. The commercial real estate market is arguably due for a correction. I work with a lot of commercial real estate developers and that’s is what they are are telling me.  There has been an overdevelopment of commercial  and apartment properties and a lottttt of vacancies and a lot of landlords refusing to lower their prices because of unrealistic expectations and a refusal to admit that the market is over saturated. The housing market, however, is still in a housing shortage. \n\nRemember, time in the market>market timing. \n\nThe way i see it, you buy a house now if you find one that suits you. Interest rates are low and you probably won’t make an accurate call on timing the market. You will, however, lose more money on 5 years more rent than you will realistically lose if you were to buy high and sell low for some reason. Especially when you factor in lower interest and the fact that you could be delaying your retirement by waiting to buy. ", "score": 8, "replies": [{"body": "That's not how it works. You are ignoring the opportunity costs of deploying capital. Use the NYT calculator.", "score": 1, "replies": [{"body": "I’m from Alabama. I used that calculator. ", "score": 1, "replies": []}]}]}, {"body": "Since every single person in here thinks theres going to be a crash soon, Im going to say were fine for atleast 3 years.", "score": 9, "replies": [{"body": "All economic indicators point to a slow and steady housing boom. Just wait until Trump daddy relaxes some regulation around it. \n\nThere's also baby boomers not willing to leave homes. Once they die off those homes will become available so there's no rush to build an excessive amoutn of homes right now. That's one reason I think there's not a lot of supply or else it would be oversupply", "score": 0, "replies": []}]}, {"body": "Why is everyone ignoring the fact that OP is a Sprint user? \n\nWAKE UP SHEEPLE", "score": 15, "replies": []}, {"body": "Nigga I'm doing the exact same thing. Graduated 3 years ago and I've been praying to God every waking day that other niggas default on their mortgages.", "score": 15, "replies": []}, {"body": "Definitely a sellers market in the South East.", "score": 6, "replies": [{"body": "But contingent on finding good qualified buyers.  The lending is tighter than it was last time the it was a \"sellers market\".", "score": 1, "replies": []}]}, {"body": "I live in the Pacific Northwest and am watching housing pricing explode because this stupid city wants to be San Fran so badly.  So I feel this 100%. I don’t think it can last either so yea, rent that shit till it bursts and every new corner condo is selling for pennies on the dollar. \n  \nThen again, looking at my calls history you might be better off just buying the house. ", "score": 6, "replies": [{"body": "It's likely a bunch of CA expats driving up prices. Silicon Valley is leaking money all over. ", "score": 1, "replies": []}]}, {"body": "i wanted to buy a small house in Key Largo because it has better places to cruise with my boat but a plot with a mobile home is about 250\\-300k. A nice pop would be fantastic for most people.", "score": 4, "replies": [{"body": "Hoping the boomers retire and can't afford their old houses which depresses the market.  I don't see a second 08 but I think a slight correction is likely.", "score": 1, "replies": []}]}, {"body": "Bought a few houses in the crash. So far has been the best investments of my life. I have a fixed mortgage so my payments stay the same. Rents keep going up.  The place I rent goes for double my payments. When I bought I rented for 100 dollars negative. Best part about owning is that payments stay the same. Over time rents should go up in a healthy market and so does equity. Even if equity goes down your payments are the same and you will eventually be better off. My parents for example have been in the same house for 25 years and pay almost nothing in mortgage. If they just rented the whole time they would be fucked. \n\nFind a place you can afford well below your means is my advice. Once you have a house to live in then look for timing the market with your investment house. ", "score": 7, "replies": [{"body": "What if the city you live in has a median house price of $1.5million?", "score": 1, "replies": [{"body": "Probably do what I actually did in that situation, which was move to the burbs. ", "score": 1, "replies": []}]}]}, {"body": "I am graduating from UW in Finance and I have the exact same thought. My wife and I did wan't to buy a house but we are renting until these prices aren't so inflated. ", "score": 3, "replies": [{"body": "wisconsin or washington?", "score": 1, "replies": [{"body": "washington", "score": 2, "replies": [{"body": "go dawgs! it might be a while before these prices drop but if you're patient it will definitely be worthwhile ", "score": 1, "replies": [{"body": "go dawgs! I hope it will be, just have to be patient ", "score": 1, "replies": []}]}]}]}]}, {"body": "My fiance and I got out of buying a home earlier this year due to low inventory and high mortgage rates. Waiting for the next big crash.", "score": 3, "replies": [{"body": "Bold call. We thought about pulling out too. But we stuck in it and stayed ready to pounce until we found a house we loved. Made an offer on a house the first day it hit the market. We just knew.\n\nBut one thing I don’t understand about your comment is you saying rates are too high. Rates are low. Real fucking low. Ask your parents and grandparents. And if you are waiting for a big crash, you may end up waiting 20 years. Crashes like 2008 aren’t that common in the housing market. Best you could reasonably hope for is a correction within the next decade. Yeah buying a house is risky, but if you wait 20 years for the stars to align, you’ll have spent more money on rent and out of investing in a home. And having a mortgage when you’re reaching retirement age can make things hard.  ", "score": 3, "replies": [{"body": "Houses are moving so quick here in northern Indiana we couldn't present offer paperwork fast enough before a deal was already completed under the table. This happened to us five times over the course of our search and leaves a real sour taste in the mouth. Rates are cheap but are climbing. Crash is a bit hyperbole on my part but maybe some market cooling so we can actually have a chance? We are also looking to build up more cash to move into a potentially less frantic price range.", "score": 1, "replies": [{"body": "Damn that didn’t happen to us. Guess we were fortunate. I think what made our offer so attractive to the sellers is that we didn’t have any contingent home sell that we were working on. They told us at closing they picked our offer out of 6 offers. We ended up buying it for $30k less than it is actually worth too. So we couldn’t be happier. \n\nBut yeah that’s an understandable plan. I hope it does cool off. I see a lot of building going on so maybe demand will be met. ", "score": 1, "replies": [{"body": "We don't have a home sale either but this is also a problem in southern Michigan according to some friends. People are paying 6-7K over ask to be the most competitive offer. You can sell most homes here in less than 24 hours.", "score": 1, "replies": [{"body": "Dang. Buy you a plot of land and a single wide trailer and post up. ", "score": 2, "replies": [{"body": "That has actually been discussed hahaha", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Rates are 4.3% bro. You hoping for sub 3?", "score": 1, "replies": [{"body": "They went back down? That's good. It's been a while since I've checked. My quote went from about 3.9 to 5.3% in the span of about three months.", "score": 1, "replies": []}]}]}, {"body": "Look at subprime auto loans!!! short CACC or anyone bag holding toxic sub prime auto loans!  Look at Cacc chart over 10 years no where to go but down and lots of selling off by insiders!", "score": 3, "replies": []}, {"body": "kinda on topic but I fucking hate houses and \"real-estate\" my dad is into it but I hate the extra baggage real estate has vs other investments.\n\nalso, its becoming increasingly hard to find a house where I am (a coastal town close to DC).  Fucking 500sqft shacks on the market for $250,000.  I'm just gonna rent until the next one, if it never happens I just probably have a good laugh and then kill myself tbh.  I'd rather die before paying that much for a pos place.  Worst part is its not even in the city or near it.  All the richfags from the city drive everything else up.", "score": 3, "replies": []}, {"body": "The real housing market correction coming when the baby boomers start to die off (10-15 years from now). All those mc-mansions they own out in suburbia.... who can afford to (or wants to) buy those once they hit the market en masse? $800k - $1.5M wood and vinyl houses in the middle of nowhere.... sign my millennial ass the fuck up!! ", "score": 3, "replies": [{"body": "Damn, that's an excellent point", "score": 1, "replies": []}]}, {"body": "That's genius idea. All major financial decisions should be made based on a gut feeling. In addition to that nobody in the history of the world has ever fucked themselves by trying to time the market. Try and name one person. You can't because it's never happened! If youve seen the big short then you're basically warren greenspan and you know what you're doing. ", "score": 5, "replies": []}, {"body": "Same just hoping my options habbit doesnt drain my down payment savings", "score": 2, "replies": []}, {"body": "i have kids so school district drives options, at this rate, im just going to live where i live now and send to private school or make a majorly aggressive case to move to a lower cost state.", "score": 3, "replies": [{"body": "Why not homeschooling?", "score": 2, "replies": [{"body": "Because homeschooled kids always end up weird", "score": 25, "replies": [{"body": "Would you rather have this:\n\nhttps://www.youtube.com/watch?v=xNOBlyvaPKo\n\n?", "score": 5, "replies": [{"body": ">living in Canada \n\nThere’s your problem", "score": 5, "replies": [{"body": "I don't, I live in China.\n\nBut even then, Canada, US, UK/Europe, even [Aus-fucking-stralia](http://unsafeschools.org/the-american-origins-of-the-safe-schools-concept/). It's all fucked. Even when I was in HS back in '07, they were teaching us about stalinism and how great the \"five-year-plan\" was during \"History\" class, no mention of the 100 million killed by famine, no mention of Gulag. Thankfully, we read \"animal farm\" for our English subject, so we got a jist of how that shit worked. \n\nThey're re-writing history; brainwashing kids into marxism; and grooming them for paedophiles.", "score": 0, "replies": [{"body": "Hey, mattizie, just a quick heads-up:  \n**jist** is actually spelled **gist**. You can remember it by **begins with g-**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": [{"body": "fuck", "score": 1, "replies": []}]}]}]}, {"body": "If I found out that my kids were being taught that I would literally do everything in my power to get the teacher fired and raise fucking hell. There is no fucking way. FUCK. THAT.", "score": 2, "replies": [{"body": "Look around mate. It's already everywhere. You just don't know because they refuse to report about it.\n\nFuck, even AUSTRALIA is fucked at this point:\n\nhttps://unsafeschools.org/\n\n-----------------------------------\n\nThe teachers are no the problem. It's the higher ups, the actual marxists, the paedophiles and other degenerates that infiltrate the education sector under the guise of \"equality\", \"safety\", \"anti-bullying\", etc. One day it's \"you shouldn't bully the gay kid because that's mean\", and the next thing you know, child protection services are taking away your pre-pubescent child because you refuse to pump them full of female hormones. I'm serious, if your 5 year old child decides that they think they're the opposite sex, and you refuse to go along with it, that's now grounds for child abuse.\n\nFind out who is your minister for education, and who works in that department that write the criteria. I guarantee you there resume and name will be associated with all manner of things from marxism/communist organisations to NAMBLA. Like this [sick fuck](http://unsafeschools.org/the-american-origins-of-the-safe-schools-concept/) who was [appointed by Obama in 2009](https://www.cnsnews.com/news/article/obama-s-safe-schools-czar-advocated-queering-elementary-education).\n\n**Don't trust me though. Do your own research. Find out who is running education in your country/state, and who they are associated with.**\n\n------------------------------------------\n\nEither way, I'm living in China with my wife and son, and am going to be a teacher soon (used to be an engineer), so my son is going to be going through the Chinese school system (that doesn't tolerate that bullshit), and being taught by yours truly as well. He is going to have an education with firm foundations in the scientific method, taught to question everything, and always think for himself.", "score": 0, "replies": []}]}]}]}, {"body": "ever met a homeschool kid?", "score": 10, "replies": []}, {"body": "You can funnel 529 money now for private education.", "score": 3, "replies": []}, {"body": "Homeschooling should be a crime. They don’t develop social skills because they don’t have to deal with anyone other than kids hand picked by their parents, and they don’t develop character because everyone needs the shit kicked out of them once in a while ", "score": 1, "replies": [{"body": "I think skipping high school wouldn't be too bad.  I really feel like I got nerfed by going got public high school.\n\nLooking back it accomplished almost nothing, countless hours wasted waiting for the class to be quiet or \"get this problem done\" or hell just literally sitting around doing nothing.\n\nI wish I could have learned a lot more math but I didn't.  Also, I was pretty autistic in high school anyways.  Became un-autistic in college though, worked out alright.", "score": 2, "replies": [{"body": "You didn’t get nerfed by public school. You’re just simply average. Don’t blame the schools for your own laziness. ", "score": 1, "replies": [{"body": ">You didn’t get nerfed by public school. You’re just simply average. Don’t blame the schools for your own laziness.\n\nwhen you do nothing all day and that time could be replaced by actually learning I consider that nerfing lmao ", "score": 1, "replies": [{"body": "I knew smart kids in my school. They didn’t dick around waiting for people to teach them shit. They went after it, and teachers were more than happy to help. \n\nDicking around was your choice. You could’ve studied at home and examed into a better class, but you didn’t ", "score": 1, "replies": [{"body": ">Dicking around was your choice. You could’ve studied at home and examed into a better class, but you didn’t\n\nthis doesn't negate the fact that countless hours are wasted, i.e. getting nerfed.  You might have got nerfed a bit too hard my dude if you don't understand this.", "score": 2, "replies": [{"body": "You’re no different than triggered snowflakes who constantly blame their environment, even though they absolutely had the opportunity to be at a better place had they actually worked for it. ", "score": 1, "replies": [{"body": "lmao, you realize that wasting 8 hours a day objectively limits you right?", "score": 2, "replies": [{"body": ">complains about wasting time \n\n>on wsb\n\nI lost all hope for you 4 comments ago\n", "score": 1, "replies": [{"body": "that's some good goal post shifting right here lmao, whatever makes you feel better", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Both you and u/NADER_THE_GATOR are correct.\n\nIt was on you to take the initiative and learn how to learn on your own. If you have the book, and the solutions, you could study by yourself.\n\nBut that said, some kids need a kick on the arse to get going, or respond much better to assistance than others,: a tutor can really help. I used to tutor a girl at a shitty high-school(HS) that was at the bottom 1/3rd of her class. But she was determined, and did ALL the questions from the book consistently. Really great work ethic. After a few months of 2 hours/week, she pulled off a fucking 100% in her next test, (up from 60%). And held it for as long as I tutored her.\n\nI advised her parents to put her into university to do her final year of HS (the one that counts). Most universities offer such programs to older adults who dropped out of HS a decade ago and want to complete/repeat it. Cost 800 bucks for the year total, she was exposed to real-life earlier, and no more HS drama. And because she was already in their system, she was able to get a spot in their Bachelor of Chemical Engineering before she even sat the final exams. Last I heard she graduated and got an internship somewhere.", "score": 1, "replies": [{"body": "> It was on you to take the initiative and learn how to learn on your own. If you have the book, and the solutions, you could study by yourself.\n\nI never said this wasn't possible.  I'm saying being stuck in a building for 8 hours having to go at a slow pace nerfs your potential.  Unless you peak (some people believe you do but I do not)\n\n>I used to tutor a girl at a shitty high-school(HS) that was at the bottom 1/3rd of her class. But she was determined, and did ALL the questions from the book consistently. Really great work ethic. After a few months of 2 hours/week, she pulled off a fucking 100% in her next test, (up from 60%). And held it for as long as I tutored her.\n\nI imagine she would have done much better and faster if she was able to tutor with you instead of going to school. 100%.\n\n>I advised her parents to put her into university to do her final year of HS (the one that counts). Most universities offer such programs to older adults who dropped out of HS a decade ago and want to complete/repeat it. Cost 800 bucks for the year total, she was exposed to real-life earlier, and no more HS drama. And because she was already in their system, she was able to get a spot in their Bachelor of Chemical Engineering before she even sat the final exams. Last I heard she graduated and got an internship somewhere.\n\nExactly, all I'm trying to say is that 80% or so of high school is just wasting time and limiting kids.  I distinctly remember learning more in my first semester of college than all the years of high school combined.  I like to think that if so much time wasn't wasted in high school I would be better off now.  Its so apparent after you transition that high school moves at a snails pace.\n\n", "score": 1, "replies": [{"body": "I'm not sure how it was where you were studying, but did you get to choose your own subjects?\n\nWhen I was in HS I was FLAT-OUT. When I had an \"easy\" class, I used the time to study my other subjects that were difficult. If the class was disruptive (and yes, that did happen often), I would tell the teacher I was going to leave the class, got up, left the class, and did my own study either at the library, or at a table somewhere else. I'd later catch up with the teacher either at their office, or via email if they were hard to get a hold of, and make sure I didn't miss anything.\n\nAnother thing you do is make friends with any other halfway competent students, and use each other to learn. Have a hierarchy, and if the one above you can't solve the problems, escalate until you reach the smartest kid.\n\nEither way, seems you made it to college and are posting on WSB, so I assume you turned out fine.", "score": 1, "replies": [{"body": "> I used the time to study my other subjects that were difficult. If the class was disruptive (and yes, that did happen often), I would tell the teacher I was going to leave the class, got up, left the class, and did my own study either at the library, or at a table somewhere else. I'd later catch up with the teacher either at their office, or via email if they were hard to get a hold of, and make sure I didn't miss anything.\n\nlol damn, yea that wouldn't have worked at my high school unless they've changed it.  They expected you to just sit in class all day.  No one could leave unless it was for a \"serious\" reason.\n\n*If* I could have done that I probably would have been able to do much more.  I won't say it never happened but I wasn't able to ever really just leave.  I mostly just drew stuff and wrote down things I wanted to learn more about and google when I got home lol\n\n>Another thing you do is make friends with any other halfway competent students, and use each other to learn. Have a hierarchy, and if the one above you can't solve the problems, escalate until you reach the smartest kid.\n\n>Either way, seems you made it to college and are posting on WSB, so I assume you turned out fine.\n\nActually, in the last year they started a special program for \"STEM\" kids or something, I got in that and it was a game changer, just too little too late.  It was about 10 kids that were interested in STEM so they were never really disruptive and we got shit done.  Again though, just too little too late.\n\nI managed college fine and everything, its just I wish all that time could have been used.  Would have made it easier lol", "score": 1, "replies": [{"body": ">lol damn, yea that wouldn't have worked at my high school unless they've changed it. They expected you to just sit in class all day. No one could leave unless it was for a \"serious\" reason.\n\nEver school is like that, including the one I went to.\n\nBut eventually you realise that teachers are just people too. And more often than not, they're very demoralised and depressed because teaching isn't what they thought it would be. When they meet students that are well behaved and eager to learn, that ask questions and are inquisitive, it's a breath of fresh air. They feel needed and useful.\n\nYou can even befriend them, many have lots of really cool stories to tell, which is why they're probably stuck in teaching career instead of a real job.\n\nOnce you're at that stage, they don't worry too much because they know you aren't going to wonder around the school causing trouble, and will bend the rules for you. You'll also be raising their class average, so it's in their best interest to let you study on your own because you'll do better. Of course, you can't just do your own thing.  You need to frame it as, \"I wish I could sit in your class to learn because your tuition is invaluable, but it's just not possible with such a disruptive class, so I've got no choice other than to go somewhere quiet and struggle through it on my own\".\n\nDon't beat yourself up about it though, I only realised after observing another student whi was in the library while her class was supposed to be on. She ended up pulling a perfect score (100% for every test, project and assignment) for one of her subjects, great tits too.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Didn't know they did cuts in youth sports leagues. I thought it was every kid plays that signs up. ", "score": 1, "replies": []}]}, {"body": "not an option at moment, maybe in a few years", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "i am leaning that way.", "score": 1, "replies": []}]}]}]}]}, {"body": "If you're going to do that... move to Bay Area or somewhere that is a huge fucking bubble.  Prices will drop faster and will also increase faster when economy recovers", "score": 3, "replies": [{"body": "Bay Area is always going to be expensive.  I would look at Seattle, fucking retarded right now. ", "score": 4, "replies": [{"body": "Idk, prices did crash in the Great Recession.  Then they literally more than fucking doubled since then.  House I know couldn't sell for 500k went for 1.2M.... and similar story everywhere", "score": 3, "replies": [{"body": "I thought they didn’t drop much in Bay Area?  Even so, it will always \nbe ground zero for tech and desirable. World class city. ", "score": 2, "replies": [{"body": "Nah they dropped a lot in 07-09.  It's in recent years that they've skyrocketed and sell like... instantly.  Houses around me sell for cash and are on the market for < 1 week before the \"Open\" sign comes down and is replaced by \"Sold\".   It's crazy", "score": 3, "replies": [{"body": "Everyone was calling me dumb behind my back when I bought at the \"top of the market\" in 2016 but now similar studios in my area are selling for 30% more compared to what I paid just two years ago. Can't tell if housing bubble or SF techies just have too much money to play with.", "score": 2, "replies": [{"body": "Probably both?  Prices are insane in SF Bay Area", "score": 2, "replies": []}]}, {"body": "I still don’t see how a move from record low rates to still low rates will affect the market there. I imagine many people are paying cash anyway.  It’s going to take an all out housing meltdown and I doubt that will happen again anytime soon. ", "score": 1, "replies": [{"body": "Well OP was hoping for a huge pop and crash. I do agree that it probably won’t happen anytime soon unless banks start giving free loans again", "score": 1, "replies": [{"body": "I think rising rates will matter in smaller feeder markets like where I am looking now. We are paying cash and talking with our neighbor about buying their home when their new home is done being built  and they are giving us a sick deal plus removing any potential realtor commissions because they are worried about rates rising for the rest of the year and having fewer buyers when they might have listed it. ", "score": 1, "replies": []}]}]}, {"body": "Can confirm. Got a house for 340k in 2012... today zestimate is 890k", "score": 1, "replies": []}]}, {"body": "They didn't really drop in the bay area. Maybe they did out in the towns out on the border of the area.  But the houses in the city, peninsula and south bay barely saw any affect.", "score": 2, "replies": [{"body": "That's what I thought.  That says alot about the Bay Area.  Always going to be desirable.  There are tons of people leaving but then you will always have a ton of young blood coming in making huge dollars in tech.   Unlike Seattle you have great weather.   My old neighbors moved to Seattle from the Bay Area and they were already getting fed up with the weather a year in.", "score": 1, "replies": [{"body": "Hey, castle\\_in\\_brooklyn, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": -3, "replies": []}]}]}]}]}, {"body": "From someone that bought in Seattle, yes the prices are ridiculous but with the tech sector driving the prices it means everyone buying can afford it.\n\nYou could hope that the city council drives out Amazon or that people start selling more instead of holding their investment for increased prices later, but a 'bubble' pop in Seattle would be much different than the 2008 one and not nearly as large.", "score": 2, "replies": [{"body": "Good luck. Maybe you bought our house from us last year 😀.  The money to be made is buying where AMZN HQ2 is going. ", "score": 2, "replies": []}]}, {"body": "Seattle is also always going to be expensive. We aren't growing any more land over here", "score": 1, "replies": [{"body": "I did alot of real estate investing around Florida during the last bubble.  They were saying the same thing in Miami in 2006 at the peak, the rest of the country followed a few years later.  Seattle is the barometer for the whole country's market now IMO.   I don't see much change from last year so far in our old hood Capitol Hill.", "score": 2, "replies": [{"body": "fair enough. I disagree, but maybe that's the seattle property owner in me speaking. you expect a housing market collapse in the next few years?", "score": 1, "replies": [{"body": "No, I don't.  I just think Seattle is out of whack. Wouldn't be surprised if prices stay flat for a while.  I can see the eastside as a better bet because Chinese expats will keep moving there and the schools are top notch and you still have all the tech companies there.  We were really getting frustrated with the public school system.    Still love the area either way.  ", "score": 2, "replies": [{"body": "yup, I can attest to the shittyness of the public schools. especially the middle schools, sheesh. were you having specific problems with them or just the general low quality?", "score": 2, "replies": [{"body": "We just felt like no one cares in the school system.  At both of the schools we were at there was a constant revolving door with new and temporary principals.   We also don't have to support our schools with auctions anymore, yay.", "score": 3, "replies": []}]}]}]}, {"body": "Hey, castle\\_in\\_brooklyn, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": -4, "replies": []}]}]}]}, {"body": "The price of entry in this market is absurd. You're competing with Chinese straw buyers who lug the whole thing in cash + 150k for a tiny ass duplex. ", "score": 1, "replies": []}]}, {"body": "Hey question about real estate from a newbie faggot, appealing to the wisdom of WSB. I’m sick of renting and want to own. I’m thinking a condo, but maybe a house. As long as I buy within my budget and get a fixed interest rate, what’s the concern mid-to-long-term? Is it that if this bubble burst that my house/condo’s value will fall? Hypothetically if I plan to live there the rest of my life—hypothetically—then why should I care, right? Would this mostly impact me as a new buyer if I am planning to sell later?\n\nMy concern is that I’ll buy and arrange payments based on my current income and situation but if some shit goes down then my mortgage payments change and fuck up my life. But that can’t happen as long as I get a fixed rate, right?", "score": 3, "replies": [{"body": "Don’t be in a rush to buy a house. Also price out the cost of a new roof, HVAC system or plumbing over haul. Cause that shit is expensive and you don’t have to deal with any of that renting. \n\nAlso factor in property taxes if your state has them. Just cause your PI is fixed does not mean your TI is. \n\nPersonal finance always shits a brick when I say this but I would rent unless you find a really cheap really nice house. Or your girl wants kids. I would also not recommend having kids but the pussy is strong. ", "score": 6, "replies": [{"body": "Home owners insurance. If you buy in the right market where your home is going up 15-30K+ a year that outweighs any of the negatives you brought up. ", "score": 1, "replies": []}]}, {"body": "And watch the monthly HOA fees on a condo. They will fuck you harder than a back alley hooker who hasn’t hit the pipe in two days. ", "score": 5, "replies": [{"body": "watch HOA fees on ANYTHING, they should be outlawed.", "score": 1, "replies": []}, {"body": "I'll never setting for any kind of HOA. FUCK THAT SHIT. I'll MOW MY OWN DAMN LAWN.", "score": 1, "replies": []}]}, {"body": "yeah, get fixed rate. You can get fixed rate loans for under 20% even adjusted for a higher interest rate and then aggressively pay off. You gotta figure our what works for you.\n\nedit: I should say that this becomes an issue in areas like LA etc where people are paying 50% cash and also outbid you.", "score": 4, "replies": [{"body": "Thanks. I’m not coastal so it’s not a highly competitive area in that way. Median income here is like $32k.\n\nI’m hoping to make a 20% down payment—is that what you’re referring to with the 20%? Higher down payment then obviously would mean a better fixed rate for me?", "score": 1, "replies": [{"body": "yeah the down payment.  I'm pretty sure putting down more cash gives you wiggle room to work out a lower interest rate. check out r/realestate or r/mortgages", "score": 1, "replies": [{"body": "I definitely will, thank you", "score": 1, "replies": []}]}]}]}, {"body": "Don't do a condo. It is so much harder to guess with a condo as condos is completely dependent on the area around them. As much as you say \"so is housing\" at least with housing you own the land. \n\nGet a fixed rate. You can get a fixed rate with 3 percent down. Or if you are hell bent in the interim you can get a bridge loan. Meaning you take your housing loan with 3 percent down at 4.5 and then a second loan at 17 percent at 6.5 percent. Some people do this as the rules and regulations have changed on getting PMI erased. \n\nIf you plan to live somewhere the rest of your life you will still end up selling your house but it can be a hedge against 4 things:\n\n1. Living situation in retirement. You will reach a point where you will be too old to upkeep a house but you will have flexibility in when you can sell. For example if your house is paid off the cost of hiring helping hands or blowing suitors can be cheaper than living in an old folks community assuming you can take care of yourself.\n\n2. No capital gains up to 250k and 500k if married. Assuming you make 200k a year with your hot wife you don't have to worry about being picky with selling certain investments. You can cash out of a house and do whatever the fuck you want under these amounts.\n\n3. Income situation - I rented my house to 2 friends for 2 years when I was 25 (32 now). I basically didn't have a mortgage payment for 2 years. Only paid utilities out of my account. This situation can exist if you don't have kids in your early 20s as kids are dumb, and there is always some old dude in his 40s going through divorce that needs a place to rent.\n\n4. Hedge against rent. No inflated prices on rent/dog rent etc. ", "score": 5, "replies": []}, {"body": "why don't you like renting?  Have a townhouse and tbh I like not having to worry about random shit happening.  I pay X per month and that's it, like a giant Netflix.  I've never felt the *need* to have my own house.", "score": 1, "replies": [{"body": "Couple things, mostly personal and quality of life. I want to have a dog (can’t in this apt). Wife wants a yard and to be able to have people over (place is small). If I’m going to pay $XXX per month to live in a place it might as well be going towards an asset.\n\nAt first I figured I’d rent forever and was okay with that. I still don’t want to deal with home ownership. That’s why I want to, for now, get a condo, where the pipes and yard duties and roof repairs (in some cases) are still not my problem, but I’m investing my money into an asset and a place to live rather than into simply having a roof over my head.\n\nI plan to find a place where, after taxes and down payment and whatever, the monthly mortgage payment is similar to or less than my rent\n\nAlso, we want a bigger place in general but we don’t want to move into a bigger place to rent that will invariably be more expensive monthly. The right mortgage could be significantly lower monthly. My moms mortgage is like $200 less than our rent, for example, and the house is big, gotta be like 1500 sq ft compared to my 770 sq ft apartment", "score": 2, "replies": [{"body": "That is true, tbh I guess as long as you have money saved up you should be good.  I have a hard enough time holding onto my shares lmao, can't imagine with a house, maybe one day though.\n\nI feel I might kms if I bought at the top, one huge irreversible trade basically.\n\nI kinda went opposite, went from a house to renting and I like it better not having to deal with the problems a house comes with but I guess one day if I do the family route I probably need to look into it lol", "score": 1, "replies": [{"body": "Yeah we’re trying to save $20k or so for a down payment and it’s fucking hard, because we’ve normally just been pretty loose with our money while putting just a bit in savings each month. \n\nNow after expenses we figure we can save $1k each month if we limit our spending outside of bills to $500 for gas, groceries, and miscellaneous. Slow goings but it’s happening. \n\nWe’re putting that $1k per month in our Schwab account, spread across like 4 safe ETFs and SWPPX index fund, and hope to cash it out for gains either this summer or next and then use it for the down payment.\n\nEven with a possible housing downturn I figure hey, my $100,000 house that I paid like $120,000 for after interest is now worth $50,000 due to real estate market crashing...that sucks. But it’s worth $50,000 more than the apartment I don’t own", "score": 1, "replies": [{"body": "this is true, either way good luck with everything! sure it will all work out, going about it very pragmatically", "score": 1, "replies": [{"body": "Thanks man, I’m an over thinker as you can see in that block of text", "score": 1, "replies": [{"body": "lmao nah man that is perfectly warranted for a house, a place you're going to actually live for awhile should overthought, better than under-thought and then you do the math wrong and end up going in debt.\n\n", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Buy a house with a conservative down payment and fixed interest rate.", "score": 1, "replies": []}]}, {"body": "Depends where you live. In Toronto the prices are starting to correct already. Sales are tanking. The government did something right and it should cool off rather than go full 2008.\n\nHad to get the feds to treat people like the retarded idiots they are and force them to consider that *maybe* if you can't deal with a 1% hike in the rate you shouldn't be taking on that kind of debt. ", "score": 1, "replies": [{"body": "Yeah no they aren’t.  Source - in the Toronto market.\n\nLook at the houses under $1M they have skyrocketed 20%+.  Mongohouse.com will show you the sold prices.\n\nJust watched a one bedroom downtown last summer ask $479k and sell for $660k, and now another (albeit larger) one bedroom ask $719k in the same building.\n\nSmaller dwellings are easily $900-$1k in the core.  There are other parts of the city that are hurting but definitely not as the media portrays.", "score": 5, "replies": [{"body": "I saw some house that was $1m and it was tiny, I thought it was bad here but I cannot even begin to understand wtf is going on there to make that happen.", "score": 1, "replies": []}]}]}, {"body": "yup. houses are selling for well over list price on long island. ", "score": 1, "replies": []}, {"body": "Depends where you live of course.  We are looking at houses and see prices are flat year over year. ", "score": 1, "replies": [{"body": "How is the Midwest and/or Rust Belt these days?", "score": 6, "replies": [{"body": "MN is nuts right now. People are offering on houses without even actually looking at anything more than pictures posted online.", "score": 4, "replies": []}, {"body": "Haha, no idea.  I’m actually in the burbs in Raleigh.  Things are not going up double digits anymore where we are looking. ", "score": 3, "replies": [{"body": "Definitely not the case in Durham ", "score": 1, "replies": [{"body": "Yeah I see Durham and Raleigh proper are still strong. ", "score": 1, "replies": []}]}]}, {"body": "In my neighborhood (small town in rural Illinois), we had some people from Chicago come in, buy a house and fix it up a little. They're trying to flip it now. The asking price is $127k, but there's no way that house in this neighborhood is worth more than $65k. People have such ludicrous expectations.", "score": 3, "replies": [{"body": "Jebus, what are these Midwestern houses made out of that the materials don't even cost $65k? Assuming the land is basically worthless, which I mean...", "score": 5, "replies": [{"body": "You're looking at a neighborhood in a town of 2,500 people, houses are 100 years old or more, small Charleston type houses, less than 2000 square feet. Median family income is low, employment opportunities in the town is low, No grocery stores but good schools. It's typical of what you'll find out here.\n\nMy wife and I have a 1,900 square foot house, built in 1900, with an attached garage and a carriage house in the backyard. Two floors, nice large yard, 3 doors down the street from the house in my earlier comment. We bought for $81,500 in 2013. Our house needed some work but it's nothing like what that other house still needs, plus our house is larger and the property is larger.", "score": 2, "replies": []}]}]}, {"body": "wanna buy my townhouse in the city of chicago?  comes with a nice 14k a year tax bill", "score": 3, "replies": [{"body": "I'm in the CA suburbs, so I'm in for $13k a year myself. Hey at least with this new tax bill, we can still write off the first $10k of that.", "score": 1, "replies": [{"body": "shame I can't write off my 15k a year of mortgage interest or 12k of state income taxes on top of that 14k a year of property taxes though...", "score": 1, "replies": [{"body": "I *think* they left the mortgage interest deduction alone? I remember some back and forth but think it was ultimately left out. We are fukt on the state income though. Hooray.", "score": 1, "replies": [{"body": "They reduced the max from $1M to $750k", "score": 1, "replies": []}]}]}]}]}, {"body": "Here in Des Moines you can buy a castle in a great neighborhood for under 500k. People here think that's retarded expensive though. 250 is \"a lot.\" They have no idea.\n\nHere's like first one I looked at on Zillow https://www.zillow.com/homedetails/794654_zpid/", "score": 2, "replies": []}]}]}, {"body": "Us fed rates will go up once if not twice before the end of the year. It's 2003 all over again.", "score": 1, "replies": [{"body": "Can you elaborate for this dumbfuck. Thanks faggot. ", "score": 1, "replies": [{"body": "https://www.cnbc.com/2018/05/14/market-now-pricing-in-four-interest-rate-hikes-this-year.html", "score": 2, "replies": []}]}]}, {"body": "VNQ calls bruh", "score": 1, "replies": []}, {"body": "Yes. The investment market is still returning larger returns than interest on loans so go for it. Always borrow money when it is cheaper than returns. As a old fuck in the sub, I remember when mortgages where 10&#37; or more in the 80's.  Now the disclaimer, renting is a solid solution, just like owning. All comes down to your current financial status, geography, and stability of income stream. Timing the housing market really doesn't matter until you are liquidating out of multiple positions. Why? because if you buy high and sell low, but you are moving and buying another house/condo/townhome the market is still low. you are just riding the market's waves. ", "score": 1, "replies": []}, {"body": "Rising interest rates generally mean a rise in home prices as well. Higher wages and fewer ppl looking to sell", "score": 1, "replies": []}, {"body": "There is a great divide between landlords and renters. As long as you don't over extend yourself; over 30 years, with the ability to refinance and/or borrow against the house up to your (and anyone on the title) sole discretion, you should come out a little ahead. Just remember property taxes, insurance, and a water heater/ac/slap leak can happen at a moment's notice.\n\n", "score": 1, "replies": []}, {"body": "Does Robinhood have these interest rates you speak of? ", "score": 1, "replies": []}, {"body": "Bought a rental house after the crash and cashed that bitch out last year. ", "score": 1, "replies": []}, {"body": "Buy now and then refinance after rates drop again, fag", "score": 1, "replies": []}, {"body": "Just sold a house, and bought a house.  Sold the first day and then bought the first day listed.  Inventory is super low in good school districts.  \n\nI don’t think it’s a bubble at all.  \n\nUsually dozens of buyers circling any new listing.  Young people want move in ready houses.  Interest rates look to be on the rise. Great time to be a builder or a flipper.", "score": 1, "replies": []}, {"body": "My best friends little brother recently graduated college at 22. No job, no present income, less $5k in cash (graduation presents). Qualified for $130k home loan from 4 different lenders.", "score": 1, "replies": []}, {"body": "2.25% 30yr and assessed this year 15k above what I paid for it 1.5 years ago. BUY", "score": 1, "replies": []}, {"body": "I would pay my mortgage, but things haven't been going so well with my weekly's.", "score": 1, "replies": []}, {"body": "Same here, selling at 25% over market value and holding for a year or two while living with family members, \"I got a bad feeling about this\"", "score": 1, "replies": []}, {"body": "SEC get this nigga", "score": 1, "replies": []}, {"body": "I made the exact same decision. Fuck that shit", "score": 1, "replies": []}, {"body": "renting + investing > big mortgage + being broke\n\nAssuming you are able to invest at least at a market return.\n\nIf your goal is to sit on cash and wait for \"something\" to happen, then you will be fucked", "score": 1, "replies": []}, {"body": "Bro, you ain't ever gonna get rates like the last 3 years.", "score": 1, "replies": []}, {"body": "Both are a lot higher than they were in 2010", "score": 1, "replies": [{"body": "Hey, Un-Scammable, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": []}]}, {"body": "Soft market right now so lose your tendies while you can", "score": 1, "replies": []}, {"body": "Buy a yacht; live in the yacht. ", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "def wait for bubble pop, or buy new construction ", "score": 1, "replies": []}, {"body": "To each his own.  You make great points, but I’ve been hosed on a shit property in a shit location in an absolute shit state.  Never again here.", "score": 1, "replies": []}, {"body": "Interest rates will be high as fuck though ", "score": 1, "replies": []}, {"body": "Well since I live in Cali, Trump's tax reform is gonna fuck me over if I buy a house now. I hope that shit gets repealed", "score": 0, "replies": []}, {"body": "yeah ni🅱️🅱️a ima sell my house and live the van life for a few years till I can afford a nice new place", "score": 0, "replies": []}]}
{"title": "$450K YOLO on $WMT", "selftext": "", "id": "8jz00w", "created_utc": 1526508666.0, "score": 1599, "upvote_ratio": 0.95, "num_comments": 367, "comments": [{"body": "r/personalfinance and r/investing quietly look on in absolute  disgust", "score": 144, "replies": [{"body": "r/financialindependence on suicide watch ", "score": 64, "replies": []}, {"body": "Nah. There is huge difference between this sub and those 2.\n\nPeople from this sub have big heads down there. People from the other 2 subs have big heads up there.", "score": 35, "replies": [{"body": "[deleted]", "score": 24, "replies": []}]}]}, {"body": "You sir, have larger balls than i", "score": 529, "replies": [{"body": "[deleted]", "score": 329, "replies": [{"body": "I wanna be at a place in my life I can YOLO 450k ", "score": 254, "replies": [{"body": "░░░░░░░░░░░░▄▐░░░░░░ ░░░░░░▄▄▄░░▄██▄░░░░░ ░░░░░▐▀█▀▌░░░░▀█▄░░░ ░░░░░▐█▄█▌░░░░░░▀█▄░ ░░░░░░▀▄▀░░░▄▄▄▄▄▀▀░ ░░░░▄▄▄██▀▀▀▀░░░░░░░ ░░░█▀▄▄▄█░▀▀░░░░░░░░ ░░░▌░▄▄▄▐▌▀▀▀░░░░░░░ ▄░▐░░░▄▄░█░▀▀░░░░░░░ ▀█▌░░░▄░▀█▀░▀░░░░░░░ ░░░░░░░▄▄▐▌▄▄░░░░░░░ ░░░░░░░▀███▀█░▄░░░░░ ░░░░░░▐▌▀▄▀▄▀▐▄░░░░░ ░░░░░▐▀░░░░░░▐▌░░░░░ ░░░░░░█░░░░░░░░█░░░░ ░░░░░▐▌░░░░░░░░░█░░░ ░░░░░█░░░░░░░░░░▐▌░░ \n\n", "score": 106, "replies": [{"body": "2spooky", "score": 30, "replies": []}, {"body": "It really is a bull market you guyz", "score": 14, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Idk man. I see accounts down 50% or more all the time. Thered be too many false positives lol", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Or photoshop", "score": 14, "replies": [{"body": "Why photoshop when you can just \"inspect element\". \n\n[See look, you said some dumb shit up there!](https://imgur.com/RXeLCVf)", "score": 37, "replies": [{"body": "TSLA is a great investment tho", "score": 10, "replies": [{"body": "Boo this man", "score": 16, "replies": []}, {"body": "Someone inspect element to make him say something smart.", "score": 1, "replies": [{"body": "ALL IN ON GPRO", "score": 2, "replies": []}]}]}, {"body": "Dam.. I learned something new today... nice trick !  If I do this with my bank account will it work if I add an extra few 0's like you added the TSLA text?  It'll be permanent change right", "score": 1, "replies": [{"body": "[Jesus Christ, Dude!](https://imgur.com/ujBFJsl)", "score": 1, "replies": [{"body": "Fuck you! LOL", "score": 1, "replies": []}]}]}]}, {"body": "Most likely.", "score": 1, "replies": [{"body": "Why", "score": 2, "replies": [{"body": "Why not?", "score": 1, "replies": [{"body": "The price is pretty close and it's not the dumbest thing we've seen", "score": 4, "replies": [{"body": "What would be the dumbest thing we've seen?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "God damn. That's a fucking insane amount for a WMT play, why did you assume it wasn't going to drop more after that acquisition?", "score": 200, "replies": [{"body": "Macys beat", "score": 43, "replies": [{"body": "Macy's chart looked bullish before earnings, this WMT chart looks like grade A shit.  Hope this dude comes out ok.", "score": 34, "replies": [{"body": "Macy hasn't been bullish for the last decade ", "score": 22, "replies": [{"body": "Stock is now up 100% since November tho. ", "score": 21, "replies": [{"body": "short term, just because economy is doing great. as far as I know I don't see any \"modernization\" or push towards an online platform that major brick and mortar retailers like $TGT $WMT $BBY are doing. On top of that, Amazon Fashion is eating their market share. next crash and Macy will hurt even worse than '08", "score": 13, "replies": [{"body": "Okay, so I know none of you basement dwellers care about fashion except gucci suits to go with your yacht but Macy's has actually carved out an interesting niche for the fashion-conscious crowd.\n\nSee, the actual issues with buying clothes online haven't been solved by Amazon or any of the chains you mentioned: First, it's a pain to figure out what size you want, second, returns are complicated, third, the marketplace is fragmented as fuck. Macy's has managed to solve all of these, basically by taking the intensive customer service model used by higher-market department stores like Neimann Marcus or Nordstrom, but bringing it down to a slightly more middle-class, millenial-accesible segment.\n\nLet me break it down for you: \nFirst problem: Macy's has tons of physical stores and unlike a lot of their competitors, their in-store and on-line offerings are pretty in-sync. So I can find a pair of jeans online that I like, then stop by the store to try on a few sizes. Or, conversely, and better to Macy's bottom line, if I try on a pair of jeans when I'm browsing at the mall, then I'll have no problem ordering them off macys.com a few days later when I regret not buying them. \n\nSecond: Macy's can again leverage their physical locations by offering streamlined logistics through making retail locations shipping centers, which has a benefit of making returns simple for customers. Also things like deliver-to-store are nice bonuses.\n\nThird: Macy's carries most mainstream fashion brands. Having that all under one domain linked to a physical store is a lot simpler for shoppers than the nightmare that is Amazon Marketplace or having to juggle multiple brand websites. see: comparison to Nordstrom or NM.\n\nI agree with you that this business model isn't bulletproof, but I don't think it's as dependent on high spending as you think. The real driver here is the fact that wages are stagnant as fuck so there are tons of people willing to smile shit eating grins while ringing up suburban soccer moms and folding t-shirts, and just as many bachelor degree holding aging millenials in need or a steady paycheck that will settle for retail management to drive productivity. Like I said, the model is based on distinguishing the store from the market through the ability to deliver customer service at a level that a certain segment of the market isn't getting anywhere else. They're good until wages start rising and have to face paying stockboys $12/hr nationally. Again, it's about bringing the Nordstrom experience (good brands, easy returns, high quality customer service) to a more middle-class shopper, which is feasible until it's too expensive to do.", "score": 16, "replies": [{"body": "1 and 2 are basically just \"Macy's has figured out omnichannel.\"\n\nNot trying to take away from your points, they're good ones. This is just what it looks like when a retailer cracks that nut. ", "score": 9, "replies": [{"body": "good tldr\n\nI would add that while figuring out omnichannel may work, it can be easily wiped out should any of the other retailers move towards that market. While NM and Nordstrom are more higher-end, should they start selling this niche, Macy is in trouble. also considering the diminishing middle class, that might cause trouble too. \n\nAgain, Macy's great in the short term, I just wouldn't put it in your 401K", "score": 1, "replies": [{"body": "> I just wouldn't put it in your 401K\n\nWell yeah, it's not OTM weekly JNUG calls. ", "score": 1, "replies": []}]}]}]}, {"body": "For whatever reason, once Starboard dropped it's stake in Macy's, the stock has performed better. No fucking clue, unless they actually plan to start using the Real estate to make some dough. ", "score": 1, "replies": [{"body": "Yeah they definitely still have a lot of real estate, even after all these stores they closed", "score": 1, "replies": []}]}]}]}, {"body": "lmfao", "score": 1, "replies": []}]}]}]}, {"body": "priced in my man", "score": 81, "replies": []}]}, {"body": "How does one exit a position this big before expiration? You have the trading desk work the order for you?", "score": 81, "replies": [{"body": "I am assuming that the volume of options for Walmart is high enough that it wouldn’t be a problem\n\nEdit: damn text to speech fucked up", "score": 35, "replies": []}, {"body": "I don't understand the question.  \n  \nYou put in a limit sell, and hit the \"VERIFY\" button.  \n  \nIf only half of them get filled at first, then reset the order and lower your limit for the remaining until gone.  \n  \nOr, be a true Chad and hit that fuckin MARKET button like the alpha you are.", "score": 24, "replies": [{"body": "It's 1/3rd of the open interest on that strike. How do you not get fucked on the execution? Where's the bid gonna come from? ", "score": 8, "replies": [{"body": "Market makers will eat it up if it's on sale, you may have to sell a few pennies lower but they're getting an arbitrage, that's the whole point of why market makers exist. They'll skim the pennies and make money on the total volume of transactions.", "score": 6, "replies": []}]}]}, {"body": "I am also curious to know this. Is it really as simple as just placing a market sell for the options and letting the market take them, or is there more to it?", "score": 20, "replies": [{"body": "god no. You could get absolutely crushed doing a market sell for that many. If there are not enough reasonably priced bids someone could have a bid at $0.01 per contract and it would fill. ", "score": 78, "replies": []}, {"body": "Limit sell, and yea.", "score": 30, "replies": []}, {"body": "ALWAYS USE LIMIT ORDERS.\n\nWhew, now that we got that out of the way. Just be sure not to check the \"fill or kill\" button and you're good. Sell as many as you can in however large of chunks you can and keep repeating til they're gone. With WMT, probably not a problem to sell that many over a day as long as you keep resetting your limit orders based on current prices.\n\n", "score": 13, "replies": []}, {"body": "You do a limit order. There will be enough people to buy them. Walmart has enough volume.", "score": 1, "replies": []}]}]}, {"body": "When did you buy these options?", "score": 154, "replies": [{"body": "June this morning and Sept about 3 days ago.", "score": 213, "replies": [{"body": "You eat iv for breakfast huh? ", "score": 144, "replies": [{"body": "Almost no IV crush at all for June and Sept calls. ", "score": 50, "replies": [{"body": "I dont see why June wouldnt. What other known event between tomorrow and June would drive volatility/premium", "score": 19, "replies": [{"body": "June IV was 27% today compared to May18 66%", "score": 38, "replies": [{"body": "Checking actual important options data instead of just buying wildly otm meme fds? Username does not check out.", "score": 51, "replies": []}]}, {"body": "upgrade or downgrades...  so momentum only ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "NOW THIS and high quality shit posts are what we are here for - miss me with those bullshit screenshots of your $5k robinhood portfolio ", "score": 484, "replies": [{"body": "I love the \"hit a 10 bagger\" posts, except the screenshot is for a fucking $200 gain.", "score": 146, "replies": [{"body": "[deleted]", "score": 98, "replies": [{"body": "Black. All Ive ever known is red. ", "score": 7, "replies": []}]}]}, {"body": "ya but how many retards have that kind of cash", "score": 47, "replies": [{"body": "One less if WMT misses earnings ", "score": 130, "replies": [{"body": "But also one more, the call writer", "score": 33, "replies": [{"body": "How do you know they're all one entity? Could've been a multiple of people filling that order.", "score": 3, "replies": []}]}, {"body": "This", "score": 1, "replies": [{"body": "That.", "score": 1, "replies": [{"body": "Your mother. ", "score": 1, "replies": []}]}]}, {"body": "RIP", "score": 1, "replies": []}]}]}, {"body": "For all we know $450k is like 5% of this guy’s net worth but that $5k rh portfolio could be 100% of that other dude’s\n\nThe degree to which OP’s balls are to the walls matter more than the total amount imo", "score": 2, "replies": []}]}, {"body": "Noice; Good luck, champ!", "score": 108, "replies": [{"body": "Thanks :)", "score": 47, "replies": [{"body": "So basically regardless of how complex these diagrams, charts, and incomprehensible these numbers look, u just gotta guess and bet in small numbers of cash and wait in anticipation to make bank. Cool!\n\nI just need to figure out how to insert the numbers and what blank space means what. ", "score": 20, "replies": [{"body": "the hard part is earning the money for your bets", "score": 17, "replies": []}]}, {"body": "up another 70 cents AH as we speak\n\nget a good macro environment and a decent beat and you should get a nice chance at cashing out on morning spike", "score": 34, "replies": [{"body": "Just need 5% morning spike to get him almost $1MM cash man", "score": 9, "replies": [{"body": "i can’t even imagine making $10k overnight, let alone $1M", "score": 14, "replies": [{"body": "Well you need to start with 450k", "score": 29, "replies": [{"body": "does the @rosebud! cheat code work", "score": 4, "replies": []}]}]}, {"body": "How much is one M&M worth? ", "score": 1, "replies": [{"body": "$7? $10?", "score": 1, "replies": []}]}]}]}, {"body": "Song for your celebration dance!\n\n[Pocket Pool](https://m.youtube.com/watch?v=lk8x4tC62pU)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The price average was $1.77 or so for those calls. The $1.99 was the current bid/ask at close. It would be 200,000 shares not 2,000.", "score": 2, "replies": []}]}]}]}, {"body": "Down $216K after the open...  True WSB material!", "score": 42, "replies": [{"body": "Wanted to check this out today. ", "score": 1, "replies": []}]}, {"body": "National Suicide Prevention Lifeline\n\n1-800-273-8255", "score": 31, "replies": []}, {"body": "I hope you make it, can you explain why you think WMT is under-valued? Because I have a hard time assigning a price over $80 to WMT", "score": 62, "replies": [{"body": "Only real competition to Amazon in the online retail space. Actually have a puncher's chance at carving out legitimate marketshare (not majority, that's still amazon by far. But no other retailer will even be competition besides wal mart).\n", "score": 34, "replies": [{"body": "It really is tough the compete against a company that's not interested in profit.", "score": 14, "replies": []}, {"body": "I don't get Amazon's massive popularity in 2018. It's a solid platform and Prime membership is a way of life for many, but the competition has caught on. I ordered stuff from Target's website, and it came in two days without any membership -- *and* the price was cheaper than Amazon.  Heck, even local businesses are offering better prices than Amazon these days.", "score": 8, "replies": [{"body": "This. Bought something at my local Meijer this weekend. It was 33% cheaper than what Amazon had listed.", "score": 8, "replies": [{"body": "I find that household items especially are often cheaper. The thing is Amazon customers simply do not price shop. Like you said, it's a club. ", "score": 3, "replies": []}, {"body": "Amazon Prime has made people stupid. Looks like a lot of people don't check the competition's prices because they've already paid $100 for the membership. Glad I never bothered getting Prime. ", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "50 dollar Costco membership isn't that sticky. Seniors just like that place for the free samples. It's like an old person's chuck e cheese. ", "score": 18, "replies": [{"body": "Idk about just old people, free is free ", "score": 13, "replies": []}, {"body": "Just picked up a Costco membership this week. Went in and looked around and walked out with $300 of random shit + $120 membership. ", "score": 4, "replies": [{"body": "Probably with a $1.50 hot dog and drink too 👌", "score": 6, "replies": []}]}]}, {"body": "Well they own Sam's Club...", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": ">Sam's is probably the shittiest club though\n\nSpoken like somebody who's never set foot in a BJ's.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Eh, as far as retail is concerned, there are only 3 clubs: Costco, Sam's Club, and BJ's. In descending order of shittiness.\n\nFor what it's worth, it's literally my job to make products for all three of these companies.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">  I'm waiting for my friend webstaurantstore or Bezos to get heavy into foodservice, then we can ~~go bankrupt~~ get bought out for a zillion dollars 😂😂😂", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": " But if we are talking toys, at least we still have toyrus.com.  ", "score": 1, "replies": []}, {"body": "Costco?", "score": 1, "replies": []}]}, {"body": "Sure they made half a fucking trillion dollars last year and they own part of JD (china exposure) and they own most of FlipKart (India and SE Asia exposure). Those two areas of the world are expected to spend **TRILLIONS** online next year. \n", "score": 90, "replies": [{"body": "The way you managed to put that sentence together makes me think you know the difference between profits and revenues, but the content makes me think otherwise.", "score": 18, "replies": [{"body": "Well Walmart has razor-thin profit. Net income was just a little bit over two percent of total revenues last year. But my point is over 500 billion dollars went into their cash registers last year. It's a hell of a lot of money, most in the world in fact for a company.", "score": -1, "replies": [{"body": "Indeed.  They *made* quite a decent chunk of profit on that $500,000,000,000 of revenue.", "score": 6, "replies": []}]}]}, {"body": "12% stake in a 50 billion dollar company is not a reason for WMT to be worth $90+. Judging from your premise, one is better off investing in these companies directly as oppose to WMT as a proxy (which I agree, I picked up JD at $36). Why own WMT over these companies?", "score": 24, "replies": [{"body": "Less risk, recession proof, room for reasonable growth (in business terms), low volatility, dividends, durable competitive advantage, capital, high credit rating", "score": 55, "replies": [{"body": "Good reasons to buy underlying not june calls ", "score": 23, "replies": [{"body": "^^ an important point.. but not relevant to wallstreetbets.\n\nthis is fucking yolo country.  if he owns equity where's the fucking yolo?  ", "score": 20, "replies": []}]}]}, {"body": "If (and this is a major fucking IF) Wal Mart ever gets its act together, they are the only company in America that could give Amazon a run for it's money.  \n  \nIf the BoD ever gets together and collectively says \"you know what, fuck that bald shitstain Bezos, let's put him out of business\", Wal Mart is the only company that could do it.  \n  \nI don't think they will because they don't have the fire lit under their ass, but give it time.", "score": 40, "replies": [{"body": "plus GOOG is helping them fight AMZN", "score": 16, "replies": []}, {"body": "No one is going to put Walmart or Amazon out of business. This isn't a zero sum game. ", "score": 15, "replies": [{"body": "Amazon is destined for monopoly action from the legislators. They will either have to give up some amount of market share in the next 20 years or prepare for the long dick of congress to show up.", "score": 5, "replies": [{"body": "Long flaccid wrinkly dick.", "score": 3, "replies": [{"body": "Definitely agreed, but it doesn't matter what it looks like.  It will slither its way down your gullet regardless.", "score": 3, "replies": []}]}, {"body": "> They will either have to give up some amount of market share in the next 20 years or prepare for the long dick of congress to show up.\n\nProbably around the same time Congress raises taxes on corporations, if I were a betting man.\n\n*actually srs, because that's how this shit works*\n\n", "score": 1, "replies": []}]}]}, {"body": "In Canada, for a brief time a few years ago they had free shipping on every order with no minimum. They got rid of it and blamed shipping cost to remote destinations but since Amazon Prime is complete garbage in Canada, they could have decimated them so easily right then.", "score": 1, "replies": []}]}]}, {"body": "Unfortunately amazon.in is doing much better than Flipkart in India. Flipkart bulked up through acquiring smaller failing internet businesses in India, and then sold the dud to Walmart. ", "score": 1, "replies": []}]}, {"body": "Undervalued in the short term-  perhaps overvalued in the long term due to Amazon. He can make a lot of $$ in the short term. ", "score": 2, "replies": []}, {"body": "97% of Americans step into Walmart at least once a year. There you go. ", "score": 1, "replies": []}, {"body": "Maybe if their push into becoming a Healthcare competitor becomes more tangible it would be reasonable, but until then I agree $80 seems too high.", "score": 1, "replies": []}]}, {"body": "Theres goes ur 450k", "score": 26, "replies": []}, {"body": "Wow you made me feel a lot better about holding my single 6/15 85 call after close. ", "score": 26, "replies": [{"body": "feeling more uneasy about mine now thanks", "score": 3, "replies": [{"body": "Feeling sad about my puts \n\nEdit: not so sad anymore", "score": 5, "replies": []}]}]}, {"body": "Why are you this bullish on $WMT?", "score": 18, "replies": [{"body": "It's tue only place he can afford to shop now that he risked his life on the stock jumping. ", "score": 53, "replies": []}, {"body": "Only company that can directly compete with Amazon", "score": 12, "replies": [{"body": "what about SNAP though hmmmmm?", "score": 7, "replies": []}, {"body": "I guess, I don’t think OP did very well on this trade lol. ", "score": 1, "replies": []}]}]}, {"body": "I feel a lot better about my 5k loss now", "score": 19, "replies": []}, {"body": "Way to risky for me but you’ll probably make a good amount. ", "score": 49, "replies": []}, {"body": "I just never would have thought WMT could have a p/e of 27.", "score": 16, "replies": [{"body": "It’s obviously a growth company", "score": 4, "replies": []}]}, {"body": "morning update\n\njune 15 $87.5 calls trading around $1.5, day gain (-$108,000)      \nsep 21 $90 calls trading around $2.60, day gain (-$2,800)     ", "score": 17, "replies": [{"body": "Those junes are less than a buck already with only 700 traded. Dont think our boy got out", "score": 6, "replies": [{"body": "lol\n\nnow $.90 with 900 traded\n\nedit, now $.75", "score": 3, "replies": [{"body": "More more!  Where's he at now?", "score": 2, "replies": [{"body": "no more free broker assisted quotes", "score": 2, "replies": []}, {"body": "He ded", "score": 1, "replies": []}]}]}]}, {"body": "Can you do another update after last minute's drop?", "score": 3, "replies": [{"body": "june 15 $87.5 calls trading around $.85, day gain (-$238,000)", "score": 7, "replies": [{"body": "Good bot.", "score": 15, "replies": []}]}]}]}, {"body": "What's your account theta?", "score": 31, "replies": []}, {"body": "Jesus Christ. $450K on calls. Major balls there. ", "score": 37, "replies": []}, {"body": "My sept21 97.5 calls are down 80%. Bought back in February.\n\nShould I sell the pop tomorrow or keep holding so it'll expire worthless?", "score": 12, "replies": [{"body": "Recover anything you can. An 80% loss is way better than 100%.", "score": 18, "replies": [{"body": "Not if the fees to sell is more than the cost of the contracts.", "score": 10, "replies": [{"body": "I assumed he was like me and a RH fag.", "score": 1, "replies": []}]}]}, {"body": "My Jan20 100s ain’t doing to hot either,bought right st the god dam top. ", "score": 2, "replies": []}, {"body": "may as well hold ", "score": 1, "replies": []}, {"body": "Isn’t a loss until you sell", "score": 1, "replies": []}, {"body": "> sept21 97.5 calls \n\nim stupid, what does this stuff about sept mean?", "score": 1, "replies": [{"body": "September 21st expiration date", "score": 1, "replies": []}]}]}, {"body": "Damn, I made $200 and sold my calls. ", "score": 13, "replies": [{"body": "You're like a snail on top of a turtle saying \"wow this is wild\"", "score": 42, "replies": [{"body": "And managing my account is a sloth. ", "score": 8, "replies": [{"body": "With Alzheimer", "score": 4, "replies": [{"body": "That developed after the stroke...", "score": 3, "replies": []}, {"body": "Who said that?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Whaaaaa!?", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they're easier for our sausage fingers to click!\n\n\n[Here is link number 1](https://www.investopedia.com/terms/e/europeanoption.asp) - Previous text \"Ikr\"\n\n\n\n----\n^Please ^PM ^/u/eganwall ^with ^issues ^or ^feedback! ^| ^[Delete](https://reddit.com/message/compose/?to=FatFingerHelperBot&subject=delete&message=delete%20dz4j2uh)\n", "score": 2, "replies": []}]}]}, {"body": "Are you retarded? European options can be sold any time prior to expiration. They just can't be exercised. ", "score": 3, "replies": [{"body": "Straight up WSB trader right there. Doesn’t even know he can sell his own options at anytime. REEE.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Big difference between the two. Options are rarely exercised. And, it's not that \"Europeans\" have to wait. There are european style options (typically cash settled, ex. SPX) that can't be exercised until the expiration date. I'm sure there are millions of Europeans trading American style options as well. ", "score": 1, "replies": []}]}]}]}]}, {"body": "RemindMe! 1 month \"suicide watch\"", "score": 10, "replies": []}, {"body": "Jesus Christ what a time to be alive.", "score": 11, "replies": []}, {"body": "Buy WMT puts, DD above.", "score": 10, "replies": []}, {"body": "My idol", "score": 9, "replies": []}, {"body": "RIP", "score": 10, "replies": []}, {"body": "Good night sweet prince. ", "score": 10, "replies": []}, {"body": "RIP your June options", "score": 8, "replies": []}, {"body": "Don't beat yourself up too much. Just remember that it's only money and to value all the other things you still have in your life. ", "score": 9, "replies": [{"body": "Not OP but this comment makes me so warm and fuzzy. Comments like this show that although people on this sub are mainly shooting for $$$, they still care. Hope OP can see this and feel better.", "score": 5, "replies": [{"body": "I was being a dick. If I lost that much money and someone told me that, it would royally piss me off. ", "score": 3, "replies": [{"body": "Wait really? So you were being sarcastic with OP?", "score": 2, "replies": []}]}]}]}, {"body": "Update pls! This is murder!!! ", "score": 9, "replies": [{"body": "No, it's actually suicide.", "score": 5, "replies": []}, {"body": "Hopefully he closed his position yesterday realized profits. ", "score": 1, "replies": [{"body": "Well considering he made this post 2 hours after close yesterday.  Doubt it.", "score": 2, "replies": []}]}]}, {"body": "Good luck my dude!!!", "score": 8, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "About 250k", "score": 8, "replies": [{"body": "Give him some time and he'll be up to about tree fiddy.", "score": 1, "replies": []}]}]}, {"body": "Congrats on the earnings beat!", "score": 8, "replies": []}, {"body": "I hope you double up tomorrow. Good luck mate. ", "score": 7, "replies": []}, {"body": "You can bet your sweet ass this guy has tendies on the reg.", "score": 5, "replies": []}, {"body": "be sure to post update some time today pls", "score": 6, "replies": [{"body": "He's conveniently absent after it took a shit", "score": 1, "replies": []}]}, {"body": "Y I K E S", "score": 7, "replies": []}, {"body": "Things I wish I knew about, YESTERDAY.", "score": 6, "replies": []}, {"body": "You should just double down, in true WSB fashion, after that drop.", "score": 6, "replies": []}, {"body": "Press F to pay respects :(\n\nedit: sorry my dude :c", "score": 6, "replies": [{"body": "F", "score": 9, "replies": []}]}, {"body": "don't worry, there's still time to baghold.  as expected when it comes to FDs, options writers win again!", "score": 5, "replies": []}, {"body": "this poor bastard\n", "score": 5, "replies": []}, {"body": "Buying calls right before Thursday lmao this guy", "score": 6, "replies": []}, {"body": "Sell calls, buy puts.  You guys are doing everything in reverse", "score": 5, "replies": []}, {"body": "RIP", "score": 5, "replies": []}, {"body": "Why not buy deep ITM? The cash you're playing with allows for ample leverage and a safety net. \n\nGood luck brother, rooting for you. Got this far before and blew it. Really hope you pull through and make the firm on the other end of this trade regret their existence :)", "score": 9, "replies": []}, {"body": "It's like all that and on Walmart, I hope you make a lot of money, but why do people actually have some money to do things do this? \n\nYou do know there is a stock called Amazon. Have you heard of it?\n\nHave you heard of Google? Have you heard of Facebook? try putting 200 calls on Amazon and see if you need to trade again for a few years..   You'll be on your yacht traveling and not need to trade again. \n\nbut instead, these people play Walmart..  Godspeed.", "score": 31, "replies": [{"body": "You're basically this sub's crazy uncle who glue traps neighborhood squirrels to taxidermy them, but when you're right, you're right, man", "score": 66, "replies": [{"body": "remember, 100 shares in Ford is better than 1 share in Amazon", "score": 5, "replies": []}]}, {"body": "Have you not seen AMZN go down, FB, GOOGL all went down? They've only recently got out of their correction. If it was as easy as you say we'd all take out huge loans + margin and be fucking rich. Not surprised at all if you read his DD in this thread. ", "score": 10, "replies": [{"body": "You've got to be joking. Yes, stocks go down, but you know what doesn't stay down and never will go down for long?  \n\nFacebook/Google/Amazon/Apple/ etc..\n\nare you for real?\n\nof course stocks have pull back.. and then what happens next there fella?  Go take a look at the chart of Amazon and then read your dumb comment again..\n\nIf you pulled out a house loan and put it all on Amazon just even this year alone, you would be better off, let alone last year etc.\n\nget out of here with that unbelievable stupid comment man. Open your eyes. I usually say stupid things like that, but man.\n\nGo look at Amazon just from January this year alone.\n", "score": -1, "replies": [{"body": "GOOG and FB are still down since Nov.     \n      \nAAPL's only above that peak cuz that sweet Buffett pump juice.     \n     \nAMZN just double topped at that peak and will trend down in the short term (according to TA mumbo-jumbo).", "score": 8, "replies": [{"body": "AAPL is the only solid play in that list of companies. ", "score": 1, "replies": [{"body": "You're adorable. Wrong, but adorable. ", "score": 1, "replies": []}]}, {"body": "So you are telling me somehow by end of year Facebook,Apple,Amazon,Google etc, will not be higher than it is now? \n\nGo sit in a corner and think about that.  \n\nCome on man, they will go higher it just needs the next stepping stone. \n\n", "score": -7, "replies": [{"body": "Could go up, down, or sideways, my dramatic dude. ", "score": 6, "replies": [{"body": "Ok, guess you'll be saying how dumb it was to not buy Amazon or Apple or Google later on just like everybody has said since any point in time. They are growing, getting bigger, taking over more, going to get even more heavy into whatever the next step of advertising is and more. \n\nBut yeah, go ahead and think that those companies will somehow go down further.", "score": 1, "replies": [{"body": "Dood, I'm long all of those companies. Have been for years. If you paid attention to anything in this sub, you'd already know that. It's not as though our wsbetting paths haven't crossed before, ya tardigayboi.", "score": 1, "replies": [{"body": "Yeah that's true, I remember your name.  sorry.", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">Guys look at Amazon after it's huge downfall, it shot back up! Just buy at the bottom guys, it's not that hard\n\nHindsight my man. What if you happen to put your house loan on amazon the day before trump tweets, and it tanks. Are you going to hold through those losses? ", "score": 2, "replies": [{"body": "In that case that is all you can do, but you should try to always buy after dips/events anyway, you shouldn't just jump in randomly. \n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "So it is true the France'$ are selli g NASCAR. ", "score": 4, "replies": []}, {"body": "Goddamnit did you just fuck me over?", "score": 4, "replies": []}, {"body": "Why am I still selling puts", "score": 3, "replies": []}, {"body": "RemindMe!", "score": 3, "replies": []}, {"body": "Daaammnn! And here I am nervous about my $3k on the line. You've got some balls, hope you're right on this. Best of luck man!! ", "score": 4, "replies": [{"body": "Here I am, rattled by 2k in $141 strikes for the VTI expiring tomorrow", "score": 1, "replies": []}]}, {"body": "Wal-Mart beat expectations! Let's see those gainz", "score": 4, "replies": []}, {"body": "Boy I hope you closed at open\n", "score": 4, "replies": []}, {"body": "OP u aliv? ", "score": 4, "replies": [{"body": "I hope he sold at open", "score": 4, "replies": []}]}, {"body": "don't frown, average down", "score": 5, "replies": []}, {"body": "oops", "score": 5, "replies": []}, {"body": "Through earnings godspeed on your way to the yacht store.", "score": 3, "replies": []}, {"body": "Nice Risk/Reward ratio.", "score": 3, "replies": []}, {"body": "Why tho?", "score": 3, "replies": [{"body": "Y tho*", "score": 3, "replies": [{"body": "y ho*", "score": 2, "replies": [{"body": "yo*", "score": 3, "replies": []}]}]}]}, {"body": "How are these looking now? How much was the theta crush on the 87.5?", "score": 3, "replies": [{"body": "Not as much as the stock dropping 1.5% this morning you autist", "score": 5, "replies": [{"body": "You spelled artist wrong.", "score": 5, "replies": []}, {"body": "now 2.5% and falling :(", "score": 1, "replies": []}]}, {"body": "you mean IV crush? ", "score": 1, "replies": [{"body": "They munch", "score": 1, "replies": []}]}]}, {"body": "I was betting on WMT too. Bought shares in the $82 range. Sold in $85-86 range.", "score": 3, "replies": []}, {"body": "oww oof my calls", "score": 3, "replies": []}, {"body": "where were u when /u/POCKET_POOL_CHAMP was kill ? ", "score": 3, "replies": []}, {"body": "Way to go faggot", "score": 3, "replies": []}, {"body": "Is he ded?", "score": 3, "replies": [{"body": "Just gotta move on.", "score": 10, "replies": [{"body": "Not the end of the world. If you could make $440k in the past, so you can again in the future as long as you are still breathing.\n\nBest of luck bro", "score": 3, "replies": []}, {"body": "good time to buy WMT calls!", "score": 2, "replies": []}]}]}, {"body": "and i’m going to lose sleep tonight over my $1.3k yolo calls on WMT\n\nlet’s fuck this pig\n\n4 june 15th 85’s @ 1.87 avg", "score": 4, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "> Did he buy 2.000 Options for $1.99 each for a strike price of $87.50?\n\nYes. \n\n> Which means if WMT stock rises to $95(for example) until June 15, he can purchase 2000 stocks for $87.50 each?\n\nAlso correct, or he can trade out of the options for a profit before they expire.  That is what most people do.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> That means if the option rises to $ 90, 10 days before expiration, he can sell the options to another person? \n\nYes, options are traded just like shares of stock and have their own value.  The value changes with the value of the underlying asset, the amount of time to expiry, the volatility of the underlying, and some other less-important factors.\n\n> If yes, for how much? \n\nDepends on the market, just like shares of stock.  Theoretically the seller can ask whatever they want but a transaction will only occur when a willing buyer steps in at the price the seller is asking.\n\n> How does one set the price?\n\nTypically by looking at the bid/ask spread and pricing the option somewhere in the vicinity of the current market price.\n", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> So if he bought each option for 1.99(for example), he can sell them for $2.50.\n\nYes.\n\n> One last question, did he buy 2.000 options, or 2.000 packets of 100 options each(200.000 options altogether)?\n \nHe bought 2,000 options, which are for 100 shares of the underlying each.  If he exercised all of them, he would own 2,000,000 shares.\n\nEdit: 200,000 shares.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yep, my bad.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "remindme! 3 weeks \"This guy dead?\"", "score": 6, "replies": []}, {"body": "After a quick inspection of the elements of this trade, I'd say that you're fucked ", "score": 4, "replies": []}, {"body": "And you're up after hours! I might have to buy some", "score": 2, "replies": []}, {"body": "nice! in long 12 july 90Cs let's get it!", "score": 2, "replies": []}, {"body": "Information I could have used yesterday!", "score": 2, "replies": []}, {"body": "im long too 800 shares but sold covered calls ", "score": 2, "replies": []}, {"body": "You make me feel so much better in my 5k position. I'm trading Peanuts", "score": 2, "replies": []}, {"body": "I thought I was cool because I went on 1 contract and made 50% with WMT. I feel poor.", "score": 2, "replies": []}, {"body": "nice, pull out at a certain &#37; gain or do you pull on the way down. i normally do the latter cuz on spectrum ", "score": 2, "replies": []}, {"body": "Bro, I wish you the best but just letting you know. You should’ve shorted $WMT instead....\n\nDisclaimer: I shorted 200 shares of $WMT this morning ", "score": 2, "replies": []}, {"body": "Wmt going up right now...im calling bottom at 83.9", "score": 2, "replies": []}, {"body": "any updates?", "score": 2, "replies": [{"body": "Call 1\\-800\\-GOD to find out how he's doing in afterlife. ", "score": 8, "replies": []}, {"body": "I don't think OP can respond right now, he's currently busy swinging from a tree.  WMT down 2%, those June calls are $0.80.  So if he didn't sell, then he's down a quarter-mill.", "score": 1, "replies": []}]}, {"body": "@OP - need an update, did you sell at open? ", "score": 2, "replies": []}, {"body": "Think Jun has been cut in half so far, but it's early.  I'm sure he has an extra 500k to DD (double down)", "score": 2, "replies": []}, {"body": "RemindMe! 1 month \"This guy dead?\"", "score": 2, "replies": []}, {"body": "Oooof", "score": 2, "replies": []}, {"body": "meh only down like 30% in a day...", "score": 2, "replies": [{"body": "try 60%", "score": 2, "replies": []}]}, {"body": "You're getting cucked here mate.", "score": 2, "replies": []}, {"body": "I forgot options come in bundles of 100 for a second, and was thoroughly confused.", "score": 4, "replies": [{"body": "Flair checks out for describing options contracts as “bundles of 100”", "score": 1, "replies": [{"body": "I'll call it what I want. ", "score": 3, "replies": []}]}]}, {"body": " Please stop, I can only get so hard!", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "? WMT beat.", "score": 4, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "That 33% increase in Econ though could help.", "score": 3, "replies": []}, {"body": "its still early, its gonna hit $90 by open.", "score": 4, "replies": [{"body": "Guidance is important and market open. Nice to see some momentum picking up", "score": 3, "replies": []}, {"body": "Lol.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "f ", "score": 1, "replies": []}]}, {"body": "boi", "score": 1, "replies": []}]}]}]}]}, {"body": "Why anyone would YOLO $450k on naked calls is beyond me. \n\n", "score": 2, "replies": [{"body": "\"Naked\" means nothing in the context of being long calls for fucks sake people have at least somewhat of an idea about what you talk about. \n\n\"Just bought a bunch of naked calls on XYZ\" THAT DOESNT FUCKING MEAN ANYTHING YOU WINDOW LICKING FUCKHOLE", "score": 47, "replies": [{"body": "The great thing about window lickers?  They shop at Wal-Mart!", "score": 14, "replies": []}, {"body": "Hahaha so fucking true. ", "score": 5, "replies": []}, {"body": "Alphas only trade literally naked.  Asserts dominance over other traders, especially in the office.", "score": 6, "replies": []}, {"body": "Based", "score": 1, "replies": []}]}, {"body": "Wtf is a long naked call dumbass\n\nEdit: for the pursuit of tendies ", "score": 12, "replies": []}, {"body": "what the fuck is buying a naked call?", "score": 7, "replies": []}, {"body": "Paper trade or photoshop, that's why.", "score": 9, "replies": [{"body": "Some people have money, others make bad decisions. I'd not be so sure its fake. ", "score": 7, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I doubt it is everything he has if real. ", "score": 3, "replies": []}, {"body": "Sometimes it seems the only way to win big is to bet big.  Perhaps this individual has bet big in the past and managed to win.  You know any gamblers?", "score": 5, "replies": []}]}]}]}]}, {"body": "A few things: (1) congrats on the play, you have huge balls and you benefitted from that; (2) risking $450k to gain 15%? I don't have the numbers, like odds of losing it all, etc., but that strategy will only work so many times. \n\nI wish you the best. ", "score": 2, "replies": [{"body": "My thoughts exactly. 15% is nothing for a risk that big. Not really anything to brag about unless the intent was shit posting.", "score": 4, "replies": [{"body": "Ya. Like it's pretty dope he just made enough to buy sweet wheels, but risking 450k for 15% is really risky unless you have inside info haha.", "score": 2, "replies": []}]}]}, {"body": "thats Crazy....Good for you thats alot of CASH", "score": 1, "replies": [{"body": "Hey, TexasTrader32, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 9, "replies": [{"body": "alot", "score": 4, "replies": [{"body": "Don't even think about it.", "score": 9, "replies": []}, {"body": "You cheeky motherfucker... ", "score": 2, "replies": []}]}, {"body": "No it's not you repressed dumb bot. People say alot.  They don't say \"a lot\". The English language evolves. ", "score": 1, "replies": [{"body": "Don't even think about it.", "score": 2, "replies": []}]}]}]}, {"body": "This is gay YOLO on an empire isn’t YOLO Bitch ", "score": 1, "replies": []}, {"body": "Congrats OP. I wish I have that much money to yolo.", "score": 1, "replies": []}, {"body": "Paper trading account??", "score": 1, "replies": []}, {"body": "Shouldve said $401K i think more ppl wouldve beliebed", "score": 1, "replies": []}, {"body": "I would sell most before earnings.", "score": 1, "replies": []}, {"body": "Bold as fuck.", "score": 1, "replies": []}, {"body": "RemindMe! 1 Month", "score": 1, "replies": []}, {"body": "Well WMT does have a low beta, so if your risk adverse, not a bad call ", "score": 1, "replies": []}, {"body": "https://imgur.com/a/YKlB5wK\n\nThis makes me feel better about my 7% loss this Thursday.", "score": 1, "replies": []}, {"body": "You're crazy man, I like you... but chur crazy...", "score": 1, "replies": []}, {"body": "You still have time.", "score": 1, "replies": []}, {"body": "remindme! 1 month", "score": 1, "replies": []}, {"body": "Damn Congrats ", "score": 1, "replies": []}, {"body": "why do you long this bullshit? wal mart? What's next, GE?\n\n\nEvery time i see these plays i realize you don't have to be smart or knowledgable to have a decent size portfolio. any retard can do it", "score": -5, "replies": [{"body": "You can literally see the gains in the screen, and still think it was stupid?\n\nYou're supposed to be ironically retarded, not actually retarded.", "score": 37, "replies": [{"body": "my bad", "score": 7, "replies": []}]}, {"body": "The man just made 50 grand lol ", "score": 18, "replies": [{"body": "Didn't make shit yet haha", "score": 20, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Don't count your chickens before they hatch.\n\nDon't count your unrealized gains as true gains.", "score": 8, "replies": [{"body": "Lmao wtf am I saying I never bought a single stock in my life I'm just here to learn, excuse my stupidity. No, that wasn't sarcasm.", "score": 5, "replies": [{"body": "Do you not know the difference between unrealized and realized gains? I don't mind explaining basic shit for the most part.", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "*you never count your money, when you're sitting at the table, there'll be time enough for counting when the dealings done*", "score": 1, "replies": []}]}]}, {"body": "> I never bought a single stock in my life I'm just here to learn\n\nI've never had a beer before, I'm just here in this biker meth lab to learn. ", "score": 3, "replies": [{"body": "Haha yeah good comparison. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Not enough for a yacht ", "score": 9, "replies": [{"body": "Yeah I was expecting him to get at least a 3 million dollar yacht. ESPECIALLY from WMT. /s (or not, he's up 50k currently)", "score": 3, "replies": []}]}]}]}]}]}, {"body": "it's unfair. i deserve that money", "score": -14, "replies": [{"body": "Negative. ", "score": 6, "replies": []}, {"body": "/r/lsc", "score": 3, "replies": []}, {"body": "Deserve is the wrong word. ", "score": 2, "replies": []}]}]}, {"body": "And how big is your portfolio Mr. Edison?", "score": 3, "replies": [{"body": "very small 22k very small", "score": 1, "replies": []}]}, {"body": "So where's your decent sized portfolio?", "score": 3, "replies": [{"body": "pretty sure it's in the mail", "score": 1, "replies": []}]}]}, {"body": "I know how you feel I have $10k worth of shares.", "score": 0, "replies": []}, {"body": "Why would anyone with that amount of money be fucking around on robinhood? Why not a real brokerage? ", "score": -2, "replies": [{"body": "I don't think that's Robinhoods UI", "score": 6, "replies": [{"body": "Ok your right my bad. ", "score": -2, "replies": []}]}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "You gonna learn today. If you have 1000 dollars and you make 500 dollars. You owe taxes on the 500 dollars. If you lose 500 or more dollars later you will owe nothing. Unless he blows his gains on non-equities like drugs or women he should be fine.", "score": 3, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "This is incorrect. The 3k loss deduction is for total loses above all gains. So you can only deduct 3k loss on taxes but can carry over additional loses to offset gains in years to come. If u make 100 then lose 50 you only pay taxes on the 50. If you make 100 then lose 110 you can deduct 3k on taxes and carry the 7k to the following year. ", "score": 3, "replies": [{"body": "Can u deduct the full 7k the next year or is it 3k a year until you reach 7k?", "score": 1, "replies": [{"body": "There’s a time limit,  but the latter. ", "score": 1, "replies": []}]}]}, {"body": "Jesus Christ I'm trading against people this stupid and still not beating the market. ", "score": 3, "replies": []}, {"body": "Hey, Spicymeataballav2, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": []}]}]}]}]}
