{"title": "Bloomberg's Cory Johnson says that recent earnings reports confirms that its $AMZN, and not $APPL thats the new Innovation king", "selftext": "", "id": "7v8mtk", "created_utc": 1517770158.0, "score": 44, "upvote_ratio": 0.85, "num_comments": 16, "comments": [{"body": "why the fuck didn't I buy amazon.... sigh", "score": 20, "replies": [{"body": "literally bought everything but amzn", "score": 9, "replies": []}, {"body": "have amzn stock but avoided calls. Remember when it went down 150 dollars on earnings..", "score": 6, "replies": [{"body": "This. I've owned amzn stock for 3 years but calls on earnings scare me. Sometimes their stuff isn't received well. It may be a good play to get calls and dump right before release. It always seems to run up before hand. ", "score": 3, "replies": []}]}, {"body": "I sold my Apple holdings after-market on the day of earnings for $167.50. And bought AMZN for $1420.00. But I still own GOOGL. Wondering if I should hold on to GOOGL - that Chromecast Ultra I bought is collecting dust (cannot hold a candle to the Apple TV 4K)", "score": 3, "replies": []}, {"body": "'cause you'd need more than the $653.45 in your RH account", "score": 3, "replies": []}]}, {"body": "AAPL IS KILL", "score": 2, "replies": []}, {"body": "Fuck should i hold onto these march amzn calls or sell and get back in later? Getting real scared off these futures", "score": 1, "replies": [{"body": "March is close, and with earnings past as soon as this volatility calms the premium is going to drop fast. I’d sell at a good exit point and look to get back in. Or hell, options give lots of choices. Sell and roll to a higher strike for June or September.", "score": 1, "replies": []}]}, {"body": "This isn't new. Apple haven't made an innovative product since the iPhone 4", "score": 1, "replies": [{"body": "Yet ER was ~$90B -- beating top and bottom -- with iPhone sales down due to iPhoneX delay. Since it's released, sales have outpaced their expectations. I liked my Pixel, and I liked my S7, but IMO, iPhone is the best phone and iOS is still the best OS. I'll stick with Buffet longing AAPL.      \n     \nI'm long GOOG and AMZN as well.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Indeed. Apparently, mediocre sales and absurd profit margins == record breaking profits (...thanks to their services). Anyway, I still see Apple as an innovator, but I'd agree the advancements have come in small waves since Samsung's blatant ripoff phone. ", "score": 1, "replies": []}]}]}]}, {"body": "Where does that idea come from that Apple ever innovated anything? They had a few original ideas in the 70s and 80s and then with their OS (which is UNIX based..so not original) , they simply take existing tech and redevelop it so it WORKS. When was the last time they were truly innovative? (Apple fan btw, just think it’s stupid to buy apple shares on the basis that you expect innovation from them..) ", "score": 0, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "It was just a Palm Internet Communicator with an integrated phone function and the option to use your fingers rather than a pen, the concept wasn’t new at all. I’m NOT dissing apple here, what I’m highlighting is, that they’re world-best at taking a concept and perfecting it, not coming up with an entirely new concept altogether. The homepod will be a massive success too, wait and see, apple watch will continue to thrive like its nothing. ", "score": -3, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "They already have : in tablets and in wearables. And your quote even says “EXISITING technology”. Apple is not a textbook innovator and doesnt want to be. They have the resources to make any product perfect that they set their eyes on and also have the cash to wait for the market to accept their version of the product", "score": 1, "replies": []}]}]}]}]}]}
{"title": "futures wild opening - red monday in play", "selftext": "barely 5 minutes since futures trading open and dow is down over 160 points...other indices red as well\n\nwho bought puts on Friday? \n\nEDIT: down 220 now", "id": "7vaeta", "created_utc": 1517785621.0, "score": 17, "upvote_ratio": 0.84, "num_comments": 19, "comments": [{"body": "I didn't. I closed puts for a nice gain Friday and switched to calls. I was gambling on the fact the correction was done.\n\nWhoops. ", "score": 13, "replies": [{"body": "hey gains are gains. \n\ntoo bad you just cancelled them out with those calls lol. i'd close those calls immediately at open tbh. stay in puts. this is going to keep bleeding. fed members will be talking all next week, multiple treasury auctions that could reveal bad data...puts is definitely the safer bet. ", "score": 3, "replies": [{"body": "i bought calls at 3pm then sold because i had a meeting and it wouldn't be over til mkt close. \n\ndamn shoulda kept them. coulda paid for my rent with those", "score": 1, "replies": []}]}]}, {"body": "im long uvxy and shorted the fuck out of the nasdaq at around 3:30 Friday\n\nfor the BTFD crowd, this one feels different. proceed with caution", "score": 8, "replies": [{"body": "> shorted the fuck out of the nasdaq \n\nbought 10 slightly OTM puts on friday on QQQ that expire on feb 9th...im thinking i hold all week if this is what it looks like lol. ", "score": 4, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.6893  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/62345)", "score": 1, "replies": []}]}, {"body": "January was a perfect example of a blow off top. This could be a  broootal month.", "score": 7, "replies": []}, {"body": "I think I'm gonna be too scared to hold my msft. I'm not cut out for this place. I may just be watching from the sidelines... ", "score": 1, "replies": [{"body": "msft is pretty resililent buddy, you picked a safer tech company.\n\nwhats your outlook? holding for a long time? then just keep it unless you literally just bought it last week at like mid $90s...", "score": 4, "replies": [{"body": "I bought last week mid 90s. So should I pull out?", "score": 1, "replies": [{"body": "it looks like it wants to go under $90 but how far under $90 it goes is debatable...it has some previous support around the $85-88 level so its up to you .\n\nif you are purely swing trading it, pull out and buy back in a cheaper price...long on it? just hold. you bought at the peak but it will make a new peak eventually\n", "score": 3, "replies": []}]}]}]}, {"body": "I cucked myself by selling before close Friday. Nevermind. ", "score": 1, "replies": []}, {"body": "I should have bought index puts on Friday but I was worried about wash sales with SPX. Turns out I can avoid those issues by buying DIA puts at open tomorrow morning.\n\nI did buy some NFLX puts, and I think buying some AMZN puts tomorrow might not be a bad idea. I want my fucking money back one way or another.", "score": 1, "replies": [{"body": "Went all in vanguard 500 in my 401k. I probably fucked up.", "score": 2, "replies": []}, {"body": "ya DIA puts would prolly net more anyways..that thing is leading the charge in the drop and its beating out the other indices lol.\n\nim holding QQQ puts because my thinking is tech always get hit in the fucking face when a sell off happens...its like everyone rushes to lock in gains in tech/chips first..which make sense since its usually the sector with the biggest gains.", "score": 1, "replies": []}]}, {"body": "I bought puts woo! ", "score": 1, "replies": []}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.1704  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/86891)", "score": 1, "replies": [{"body": "hehe you may say that now but who knows. maybe there is a miracle and my calls will recover?\n\ni got barely 1k worth of puts as hedge...4k worth of calls that are just dead 90+% losses lol.", "score": 1, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.8546  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/13266)", "score": 1, "replies": []}]}]}]}
{"title": "Stock market monday suggestions", "selftext": "I have a ton of stocks in different areas and im wondering how the market will do tomorrow to determine if i should just back out before I live in a cardboard box.\n\nAmazon at 1430 1 share\nMicrosoft at 82.50 47 shares\nVisa 122 13 shares\nApple at 165 3 shares", "id": "7vai4m", "created_utc": 1517786492.0, "score": 7, "upvote_ratio": 0.71, "num_comments": 26, "comments": [{"body": "Dude you're holding shares just ride it out", "score": 18, "replies": [{"body": "not only that there isn't much you can do to hedge when short less than 100 shares of stock", "score": 2, "replies": []}, {"body": "What about TQQQ shares?", "score": 1, "replies": [{"body": "Decay will definitely screw you. Any leveraged ETFs are things to worry about", "score": 3, "replies": []}, {"body": "Market price at open, imo.", "score": 1, "replies": []}]}]}, {"body": "Hold em if you plan to stay in the market for years.\n\nbuy puts on SPY at open though as a hedge if you have some side money. ", "score": 16, "replies": [{"body": "I use robin hood idk what puts are", "score": 5, "replies": [{"body": "k then just chill and let it blow over. you don't need to over think it honestly, it'll be fine in the long run. \n\nyou are an investor, not a trader. \n\nyou are mentally stable it seems, you might not belong here ", "score": 39, "replies": [{"body": "idk why but I get really angry whenever I see people giving constructive feedback here", "score": 13, "replies": []}, {"body": "Okay so hold. It’s gonna hurt as I’ve lost 30k already, but I don’t want to sell if it’s gong to come back up in a month or two. We don’t plan to retire for 10-15. I’ve been going back and forth all weekend. ", "score": 3, "replies": [{"body": "what are you holding??", "score": 1, "replies": [{"body": "I’d only pretty much held AAPL and V for years but decided I should diversify so I was working on that. Not doing very well. I have too many I think, and tech heavy. \n\nStock:\nAAPL, AABV, AMZN, ANTPF, BA, BABA, BAC, CAT, HD, MSCI, MSFT, NFLX, NTDOY, NVAX, NVDA, PYPL, RHT, TCEHY, V, WB\n\nETFs:\nARKW, BOTZ, IEMG, SMH, XAR\n\nI just sold out of WTW, ANET, LMT, SQ, and SHOP last week because I had just bought them and I didn’t want to go negative on new purchases. I was watching some biotech’s for buyouts, as well as watching MGM, WYNN, LVS and MAR. \n\nIt’d be hard to sell it all fast. Just too many. AAPL is 25% and V is about 10%.", "score": 1, "replies": [{"body": "ya fuck that, just hold that shit. those are fine companies and will recover.", "score": 3, "replies": [{"body": "Just hope it doesn’t take forever. And thanks. ", "score": 2, "replies": [{"body": "Mate you're not retiring for 10-15 years. You'll be fine. HOLD THAT SHIT. Put some money aside into an index fund if you're not already", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "SPXS if your a RH faggot :)", "score": 1, "replies": []}]}, {"body": "Which SPY puts are worth targeting?", "score": 1, "replies": [{"body": "a dollar or two OTM if you are just doing a weekly hedge.", "score": 2, "replies": [{"body": "Spxs are also good for puts", "score": 1, "replies": []}]}]}]}, {"body": "Watch how the futures trade tonight.  They might give us an idea of how tomorrow plays out.  Definitely opening red.  \n\nProbably an attempt to rally then close red would be my guess.   ", "score": 4, "replies": [{"body": "ES down ~20 points right now :(", "score": 1, "replies": [{"body": "Would consider that a win if we close at that tomorrow IMHO.  Hoping the worst is over for the most part and we truly bottom Tuesday or Weds.  The worst corrections that freak me out are the ones where we get 3 or 4 drops like Friday in a row!", "score": 0, "replies": []}]}]}, {"body": "Turn off notifications for RH for a couple of weeks. Going to get ugly, I feel we stumbled upon a cub, and momma bear is close by to rip are faces off. ", "score": 2, "replies": []}, {"body": "Nobody cares.", "score": 1, "replies": []}]}
