{"title": "Subprime Autoloans", "selftext": "Who on here has been watching the Subprime auto loan market? I feel like I’m watching the 2008 crash live. Companies like Santander Consumer USA (SA), Ally (ALLY), and Credit Acceptance (CACC) are literally stretched thin and payments are not coming in. These are being bundled into AAA ratings JUST LIKE THE HONE CRISIS. Has anyone taken any positions or have any extensive research on this at all?", "id": "gqmr9o", "created_utc": 1590453094.0, "score": 22, "upvote_ratio": 0.87, "num_comments": 29, "comments": [{"body": "Here’s some good data. \n\n\nhttps://imgur.com/a/8Zyvjkr", "score": 8, "replies": [{"body": "Thanks for sharing", "score": 2, "replies": [{"body": "Sure, there’s so much data on TOS that it’s hard to find what’s relevant without spending a whole day on it, but that’s a start", "score": 2, "replies": []}]}, {"body": "How do I buy calls on this?  ;)", "score": 1, "replies": []}, {"body": "Wow awesome charts.   Shows we're not in too deep right now.... but who knows what's to come", "score": 0, "replies": [{"body": "The time frames vary- if anything I’d argue this is the beginning to an incredibly bad recession. Fed can’t outprint the business cycle, and a vaccine won’t pay debts.\n\nBut, that’s my opinion.", "score": 4, "replies": []}]}]}, {"body": "Following. I’ve been watching auto loan market crashing for years now and it’s getting much worse. They’re doing 84 month loans and soon 96 to get people’s payments down low enough. I couldn’t imagine paying for a car for 8 years lmfao. BUY NOW NO MONEY DOWN NO CREDIT NO PROBLEM😂 lmfao it’s absurd. I don’t know how much longer it can go on for, I remember the beginning of last year I read 6% of all auto loans are in delinquency (90 days late+)", "score": 9, "replies": [{"body": "I can't imagine this going on for much longer. Used car prices are already down and now with Hertz auctioning off a portion of its fleet, I expect prices to go down even further. Not that this matters, as a large chunk of the population probably won't be shopping for cars until they're certain of future employment status.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "The auto loan, auto CDO/CLO market is a hot air balloon full of feces just floating over the financial sector at the moment. I'm not exactly familiar with who holds the final loans, but I doubt they're liquid and I imagine some lobbyist is being paid a ton to get the Fed and Treasury to back them. Ppl would be ok walking away from a depreciating asset such as a car especially if they bought it new; there's probably a ton of negative equity on it. What's the lender going to do? recoup 40% of the balance via an auction that won't happen? \n\nI do not see how the used car and car financing industry makes it out of this crisis looking anything like they used to", "score": 7, "replies": []}, {"body": "This sounds quite interesting. Do you have any recommended websites to check the numbers or to research more?", "score": 5, "replies": []}, {"body": "eh, the subprime auto market is like 1/10 mortgages. It needs to grow quite a bit before it will collapse anything.", "score": 2, "replies": []}, {"body": "This.\n\nThis sector would’ve set of the 2020 financial crisis if Corona didn’t. \n\nBeen waiting a long time.", "score": 2, "replies": []}, {"body": "The spread was too big on CACC for me I wanted 6/19 $360 outs for $27.5 but the bid was $25 and ask was $31 and my order wasn’t getting filled. That spread kept me out, but good luck to you sir", "score": 2, "replies": []}, {"body": "Time to short the shit out of $CACC. All the management are dumping their shares after saying they are delaying their financial report until 25/6. Muddy Waters and Citron are rightly calling the alarm that this company is a zombie in a wedding dress.\n\nhttps://fintel.io/n/us/cacc", "score": 2, "replies": [{"body": "What put positions are you considering.?", "score": 1, "replies": [{"body": "No puts on common stocks in uk. I'm short selling stock.", "score": 1, "replies": []}]}]}, {"body": "Here are some of the sources I have been reading:\n\nhttps://www.marketwatch.com/amp/story/guid/4B61EF18-5366-11EA-9A69-DD6044AC3CC1\n\n\nhttps://www.brookings.edu/blog/the-avenue/2020/05/11/costly-car-loans-may-stall-the-covid-19-economic-recovery/amp/\n\n\nhttps://www.wsj.com/amp/articles/millions-of-americans-skip-credit-card-and-car-payments-11589985381\n\nNow what really gets me is the length of loan now is an average of 52 months on 22k. This is averaging loans up to as man many 84 months and it is insane. Just wonder what other people’s thoughts are. The information is spotty but three weeks ago was when a few media outlets started to shoot up warning signs. 22 million Americans and counting don’t have a job. Over 55 percent are reporting that something is going unpaid in their household. Mortgage or over extended auto loan. I would say the auto loan.", "score": 1, "replies": [{"body": "But are these within the confines of the allowed deferment system, if so, what leads you to believe people aren't deferring all bills available, just because? And, secondly, will it return to normal promptly?", "score": 3, "replies": []}]}, {"body": "Whats stopping the fed from bailing these out too? They swallowed up those Hertz bonds and didn't even blink. \n\n&#x200B;\n\nI'm assuming we would be buying up Puts on those banks?", "score": 1, "replies": [{"body": "Correct puts on the lenders. I am not saying the Fed wouldn’t but it is becoming obvious that predatory lending is taking place and people are biting off way more than they can chew", "score": 1, "replies": [{"body": "Who’s HTZ lender?", "score": 1, "replies": []}]}]}, {"body": "OP Were earnings for CACC priced in? I have no fucking clue how they managed to pull almost $10 EPS. Are you short? I wish you the best of luck tomorrow either way", "score": 1, "replies": [{"body": "Yeah I mean they had to have been. Seems like everything is. I ended up taking no position because what’s rationale hasn’t been as of late. Instead calls on AMC did me well.. AMC $5c 9/22", "score": 2, "replies": []}]}, {"body": "I’m in agreeance!", "score": 1, "replies": []}, {"body": "I thought the Fed had already pledged to buy these if needed.", "score": 1, "replies": []}, {"body": "COF too. But people need cars. If this is your thesis, consumer/personal loans are probably a safer bet - this is the first thing people stop paying in most cases.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "I posted in two? Is that the definition of many?", "score": 8, "replies": [{"body": "Thanks for spreading good info on this mate, we'll keep an eye on this", "score": 3, "replies": []}]}]}]}
{"title": "Market crashes predictions and history", "selftext": "The major and notable stock market crashes throughout history have surprised everyone and for the most part, no one saw it coming. \n\nWhich brings me to my point, everyone is saying the stock is rigged, the economy is deteriorating, and business fundamentals are destroyed. From what I’ve seen on Twitter, Seeking Alpha, YouTube, Reddit, Everyone is calling a coming crash.\n\nThis would mean either we’re all wrong, or for the first time, mass amounts of people predicted a crash. Which is it? What are your thoughts?", "id": "gqrdnc", "created_utc": 1590472708.0, "score": 25, "upvote_ratio": 0.85, "num_comments": 23, "comments": [{"body": "The housing bubble was known in 2006. Several years before a market bottom.", "score": 18, "replies": [{"body": "Known but not predicted. People knew it was going to happen at some point but very few actually knew when. Hence why lots of people lost money.", "score": 11, "replies": [{"body": "In every case, no one knows when. None of us know when it will crash again this time around either.", "score": 3, "replies": []}]}]}, {"body": "Pretty simple, as long as i keep buying puts, the market will go up. Thank me later", "score": 12, "replies": []}, {"body": "Every year some analyst will call a crash incoming. That we were due a recession for years now. If you call it every year, someone is bound to be correct. No one knows when. Trust your own instincts.", "score": 10, "replies": [{"body": "Couldn't it be a bit different when it's others calling it due a pandemic larger than anything we've seen in a hundred years and the resulting economic slowdown? Some quacks always predict nonsense during normal times but this seems a bit more of an educated prediction in times that are anything but normal. And it's not like that last huge drop was hard to predict.\n\nWe keep comparing today's markets to normal times.", "score": 4, "replies": []}]}, {"body": "Interestingly enough, since the 1930s, the market’s biggest gains have happened one year after the lowest employment rates.", "score": 10, "replies": [{"body": "How is that relevant at all when we’re approaching record highs", "score": -13, "replies": [{"body": "lowest employment rates to be read as highest unemployment rates.", "score": 22, "replies": []}]}]}, {"body": "Saying crash is coming is easy. Sure it'll come.\n\nBut when? You will be right but no one there knows and  I bet most of the ones saying crush is coming don't even have any put options or short position.\n\nTalk is cheap.", "score": 16, "replies": []}, {"body": "I wouldn’t say that there are really that many people betting on a crash now. Recently I’ve mainly been seeing the opposite. There is a lot of optimism, and people think that gains are basically guaranteed because the government won’t let it crash.", "score": 7, "replies": []}, {"body": ">The major and notable stock market crashes throughout history have surprised everyone and for the most part, no one saw it coming.\n\nThe yield curve was negative before this started, which has been a very good indicator of recessions. \n\nSo I don't agree with this statement.", "score": 2, "replies": []}, {"body": "here comes the aggressive bulls and equally aggressive bears", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "The crash was was in March IMO.  It was a liquidity crisis and we came real close to a complete meltdown. It might be hard for peeps to truly appreciate what happened March 16, 2020. There were no buyers of anything.  Bond issues and rollovers had to be sold at ANY price or institutions faced total and utter collapse. The virus impact was unpredictable at that time and so was government and central bank responses.  We were within a hair of a total meltdown and knew it.\n\nBut then government stepped in.  Central banks have practically guaranteed they will save the market and buy up whatever is necessary to keep things going.  And we know a lot more about the virus and how to deal with it.\n\nDoom and gloom blogs headlines sell.  The actual news is quite boring and nearly all indicators are positive about the long term now. There will be volatility as surprises hit the market (both positive and negative).  But now more than ever, one can make gigantic gains betting on the daily/weekly swings", "score": 4, "replies": []}, {"body": "On Friday i will begin shorting the markets. Was going to wait another 5 or 6 weeks but things are accelerating so Friday it is. Put your money into the markets now. Don't wait. Go all in on whatever stocks you like because the federal reserve will always help you pump up the prices. Zero risk in this market boys and girls. Don't fight the fed. We are definitely going to all time highs soon. Reality? No no no... that doesn't matter as long as the fed has our backs. How long do you think the fed can continue? Forever!!!!!! Money printer go brrr", "score": 1, "replies": [{"body": "Are the feds pumping today?", "score": 1, "replies": []}, {"body": "Are the feds pumping this week?", "score": 1, "replies": []}]}, {"body": "It’s not going down again. It keeps testing the new high. Here comes the jump. If you don’t live in a red state it’s hard to see the trees when you’re buried in the forest. Everything is 100% back to normal in these states. You better get on board because we’re looking at a full recovery by Christmas.  With how EASY it is for people to invest now, with apps like robinhood etc you’ll have a massive attack on the buying end when there is a whiff that this whole thing is over.  Once the hedge funds are on board which happens in premarket, you won’t be able to get a seat without overpaying on your stock picks. Stop overthinking it because the Dow Jones is going to 50,000 by 2030. Get the F on\n\nEdit: don’t fight the fed. The fed has already stated to have unlimited resources and isn’t even close to running out of ammunition. \n\nRELEASE THE KRAKEN", "score": 0, "replies": [{"body": "The fed is worried. Look at the minutes and the warnings they have put out", "score": 1, "replies": [{"body": "They won’t let 2009 happen again. They have too much skin in the game to let this reverse. DONT FIGHT THE FED", "score": 1, "replies": [{"body": "Okay, but imma fight the Fed tho", "score": 0, "replies": [{"body": "Good luck", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Really? Because most people don’t even notice when they get it.  It doesn’t affect over 95% of people who get it. So go cry in your little hole", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}
{"title": "Individual Stocks or ETF’s?", "selftext": "     First post here! I’m currently 20 years old and have been investing $100 a month for about 6 months now—bad time to start, I know. Anyway, I’m mostly investing for retirement which will probably be decades away, and I’m wondering if I should be putting my monthly $100 into individual stock or ETF’s? Of course, I can usually only buy fractional shares with $100 a month, but still, I’m a college student! Should I be buying Microsoft or VOO, for example? I do have an emergency fund saved up!", "id": "gqsojp", "created_utc": 1590479287.0, "score": 10, "upvote_ratio": 0.69, "num_comments": 21, "comments": [{"body": "might as well look at how to use the search function.", "score": 26, "replies": []}, {"body": "WHAT THE HELL IS THIS FORMAT", "score": 9, "replies": [{"body": "Notepad", "score": 1, "replies": []}]}, {"body": "Blue chips + ETFs", "score": 17, "replies": []}, {"body": "Sensible advice is both. Put 85% into an ETF or managed fund, and “play” with 15% on individual stocks.\n\nThat was is safe, but fun.", "score": 6, "replies": [{"body": "When you say 85% do you mean of your net worth?\n\nWhat is a good rule of thumb to invest? 100% of saved money?", "score": 1, "replies": [{"body": "Keep aside whatever you need as a buffer for bills, fun, whatever. You want that money to be available a accessible.\n\nAny money you have that you won’t need to touch for a while, invest. \n\nFor example, if I had £1500. I would keep £500 in cash in my bank. If I need it, it’s there.\n\nI’d put £800 into a managed global market fund, and £200 in stock (if you can trade stocks without charge like on RobinHood or Trading212).\n\nIf you have to pay frees to trade stocks, which you do normally with more traditional accounts, then just wait and slowly buy stocks in larger amounts. \n\nI use Hargreaves Lansdown, I’m UK based. Trading funds has no admin fee, but it costs to trade stocks, so I use this app for all my fund trading, and only trade stocks once I have a decent sum to invest (costs £12 per trade, pointless investing less than £200 into a stock and the £12 just eats my profits). Apps like RobinHood trade stocks for free, I think, that’s what a lot of Americans on here use. \n\nSo, of the money you can lock away, that you won’t need for a while, invest that. 80ish percent in funds (boring and safe) and 20ish percent in individual stocks (fun, but you have to diligently watch and do research, buy before they go up in price, not buy when they are already shooting up, it’s too late by then)", "score": 2, "replies": [{"body": "So say I want to buy a house in the next few months, let’s say July 15th for example. \n\nShould I sit on my money that would be used as a down payment, or should I invest that into an ETF for the time being?\n\nPersonally I want to put all my money (like 90%) into something like VOO until I purchase a house. \n\nIs this not wise?", "score": 1, "replies": []}]}, {"body": "Also, if investing in something risky, never invest more than you can afford to lose 100% of. That is why we mainly invest in ETFs and funds. \n\nThe funds and etfs are solid income, the risky stocks are just for potential gains, but can lose money, hence why we only invest a smaller percent of our worth in them.\n\nDiversify you portfolio, get funds / etfs that relate to USA and UK and Asia, tech, retail etc. The greater variety of funds you are in, the less risk and exposure you have. Don’t put all your eggs in one country or sector", "score": 1, "replies": []}]}]}, {"body": "ETFs only.  VTI and forget about it.  \n\nWay to start young", "score": 4, "replies": []}, {"body": "The research overwhelmingly says a total stock market etf. \n\nExamples:\nWarren Buffets 1 million dollar bet vs a group of Wall Street hedge fund investors. Buffet had an s&P 500 etf.  Hedge fund guys picked individual stocks. Best total return in 10 years wins 1 million. Buffet won easily.\n\nFidelity wrote a research paper about the people who did the best. Turns out it was people who where dead or forgot about the account.\n\nThere moral of the story is invest in a total market fund and don’t touch, or look, it until retirement.", "score": 3, "replies": []}, {"body": "Right now it's a great time to start. The market will recover and you are buying cheap right now.\n\nI would suggest to do some research into ETFs.\nThey have a number of advantages.\n\nYou can diversify your portfolio and you can easily create saving plans without cost.\n\nYou can set everything up and forget about it.", "score": 6, "replies": []}, {"body": "As a college student the smartest thing you could do is invest that 100/month in yourself, not into stocks. Once you graduate and get a real job with real pay, you'll see how pointless the 100/month was.\n\nFirst year of working I put away $37000 into my portfolio which was x3 as much as I had in it when I graduated(after 5 years of \"investing\"). I realized then how much better it would've been to use that money and buy a good laptop, instead of dealing with my shitty dell laptop from HS. \n\nOr how I could've bought a cheap used car instead of commuting everywhere, let me tell you going grocery shopping by bus for 5 years IS NOT THE RIGHT PLAY. I probably wasted 10 hours a week on average just commuting places.\n\nIf you want to learn the fundamentals, get a paper account. If you really insist on investing your 100/month, I would buy with as much leverage as possible: options and 3x leveraged etfs (tqqq, spxl, soxl, fngu, umdd will keep going up). Other then that I think your 100/month isn't worth investing in the long run and is better to be spend on improving yourself.", "score": 8, "replies": []}, {"body": "That's actually really smart keep at it, my #1 is BAC and PBR", "score": 2, "replies": []}, {"body": "ETF. Single stocks could go boom by the time you retire, yes even big boys like MSFT", "score": 2, "replies": []}, {"body": "If you want to spend a lot of time doing research and managing your funds, then individual stocks. If you want to put your money someplace where it will grow with minimal effort on your part, ETFs are the answer.", "score": 2, "replies": []}, {"body": "Etf untill you know what you are doing", "score": 2, "replies": []}, {"body": "etf.", "score": 1, "replies": []}, {"body": "ETFs. To be honest, the best way to make money on the stock market is to invest early and forget about it. The market trends upward. If you wait 20 years, you will most likely more than double your money no matter what happens in the short-term.", "score": 1, "replies": []}, {"body": "Start with ETFs. If you have the time/skills/personality to pick individual stocks then you can do that later.", "score": 1, "replies": []}, {"body": "Save it for the house 100%. Buying a house is one of the best things you can do.\n\nMarkets may crash again if we get a second spike of COVID, and you may lose money if that happens. Then again, you may make money if markets continue to recover.\n\nThat said, no one can tell you, or predict, if the market will go up or down. If you need the money this year, sit on it - it’s really not worth risking losing a chunk of the deposit for your house. \n\nEverything you need for the house, sit on, categorically and unquestionably hold it. Everything else, chuck into the markets wherever you please, that etf would be fine, the S&P has been a good benchmarker, if not a bit high right now, it’s had a strong recovery thanks to firms such as Amazon and FB pulling in big time this quarter.\n\nYou don’t need to dump thousands into the market straight away. Just small amounts, but often (if you don’t have transaction fees). Every month deposit a couple hundred, on a platform that doesn’t charge to trade each time. I stick to funds as often they do not charge to trade, and the buy/sell prices are always the same as each other, so I can leave whenever without worry.", "score": 1, "replies": []}]}
{"title": "Anyone elses stock tanking this morning?", "selftext": "The DOW is supposedly up but man I am going down, and im pretty well diversified. Will it get better?", "id": "gqxll4", "created_utc": 1590501671.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 29, "comments": [{"body": "what the fuck you holdin'", "score": 35, "replies": [{"body": "Mostly FSLY SPT NVDA CMG and AQST", "score": 2, "replies": [{"body": "cant speak on the others but AQST is going to be a dead fish for a while imo", "score": 1, "replies": [{"body": "Yo why is that? They got their FDA approval though, why did that not bring price up?", "score": 1, "replies": [{"body": "it did for a little bit but everyone pulled out who was in it for the pfuda", "score": 1, "replies": []}]}]}]}, {"body": "My first thought too lmao\n\nEVERYTHING IS GREEN except MSFT which is down .26% because why not", "score": 1, "replies": []}]}, {"body": "Mine are actually way up", "score": 23, "replies": []}, {"body": "Every stock I own and every stock in my watch lists have all gone up this morning.", "score": 9, "replies": [{"body": "Out of curiosity, how much tech stocks do you own and which are on your watchlist?", "score": 1, "replies": []}]}, {"body": "Umm...  No...  Everything here is up.", "score": 9, "replies": []}, {"body": "I'm up around 12% so far", "score": 11, "replies": [{"body": "What’s your portfolio like?", "score": 1, "replies": []}]}, {"body": "I’m up 1%", "score": 5, "replies": []}, {"body": "value stocks up, tech growth stocks down", "score": 3, "replies": []}, {"body": "Nope it’s never going to get better. Sorry", "score": 4, "replies": []}, {"body": "I am up so far as well. Did your companies come out with news bringing them down or do you know why?", "score": 2, "replies": [{"body": "No literally not at all!", "score": 1, "replies": []}]}, {"body": "My Netflix is down around 2% today", "score": 2, "replies": []}, {"body": "Must still be bag holding NAT 😆", "score": 2, "replies": []}, {"body": "Huge profit day for me. Closed out options and moved my options principal into shares. Sitting on options profits for another entry point later this week or early next week. Gonna go shag balls at the range for the rest of the day.", "score": 1, "replies": []}, {"body": "Some up some down. The money shuffle continues.", "score": 1, "replies": []}, {"body": "I’m up .76%\n\nI was rallying in ore marvel then busted", "score": 1, "replies": []}, {"body": "Up 4.27% today", "score": 1, "replies": []}, {"body": "Up 1.48% today, 15.37% since April", "score": 1, "replies": []}, {"body": "I'm up 0.8%. Meant to sell before close, but didn't realize PLAN announced in pre and not AH so lost a bunch of value there. On the bright side, I have 6/19 calls. They beat but gave lower guidance than expected, so hopefully we see a rebound.", "score": 1, "replies": []}, {"body": "If you're down today then I'll just say what everyone else won't--- Your portfolio sucks.", "score": 1, "replies": []}, {"body": "I'm down for the day due to a large % of my portfolio being PayPal", "score": 1, "replies": []}, {"body": "15% up overall since last month.\n\nEdit: worst performers OXY SQ RAD HIMX\nBest performers PK NCLH JETS PVAC\nSince inception", "score": 1, "replies": []}, {"body": "I’m down overall today because a lot of my winners are down a little.", "score": 1, "replies": []}]}
{"title": "MRNA", "selftext": "Since selling one of my pharma positions I decided to buy some MRNA today on the drop, at high 62.xx. What do you guys think about potential of this stock? Do you think PFE or NVAX is a better choice?\n\n&#x200B;\n\nI think PFE is a much less risky option but I think the potential to make money is a lot lower, given the current valuation is pretty high as it is.\n\n&#x200B;\n\nOn the other hand, Moderna aren't really known for stuff other than for their new vaccine trials, so if they succeed, I think they have a lot more potential to grow.\n\n&#x200B;\n\nWhat do you guys think?", "id": "gqy5q8", "created_utc": 1590503659.0, "score": 9, "upvote_ratio": 0.85, "num_comments": 20, "comments": [{"body": "I'm not hyped on Moderna.  It's telling imo that they jumped on an oferring so quickly. They likely know the price was/is unjustified. Even _if_ (big _if_) they are the company to come through with a vaccine, there is a lot of pressure to provide it at a very low cost. Retail investors thinking $10 a pop * 1B+ people are deluding themselves. \n\nAlso telling that much of the money going into it and biotech ETFs right now are retail investors. Instutions don't seem so high on them. I wouldn't touch it, but that doesn't mean there isn't money to be made in the short term.", "score": 5, "replies": []}, {"body": "Someone had adverse effects from testing their vaccine. He had to seek medical attention and fainted in his home. I bought in today after it dropped from 80 last week.", "score": 3, "replies": [{"body": "At the max dosage, which they are discontinuing. Lower doses had no such issues.", "score": 1, "replies": [{"body": "Are lower doses effective though? What would be the point of a max dosage (unless they were simply trying to find what the max was)?", "score": 1, "replies": [{"body": "Yes, very. They all caused an immune response across 45 people by day 15, and of the first 8 they dosed (Which were min and moderate dose), all had vigorous neutralizing antibodies. This is important because neutralizing antibodies lock to the virus AND prevent it from infecting cells. This also means that if that was a consistent effect, you have way less safety risk in phase 3 - some vaccines prime you to get more sick. If the results they saw in phase 1 are consistent over larger range of ages and health conditions, it's a great vaccine, one of the better that has been made. The lower doses had mild effects, the worst of which was pretty significant soreness at injection site.\n\nThere's a ton of moderna hate going on right now, but their vaccine probably works, and it probably works very well. We will know for sure in a few months. And because the doses that work are on the low end, it's more likely we will have a lot of it available quickly. The stock movement right now is retail hype wind-down with all the negative press coverage, and a LOT of effort by what appear to be paid trolls/bots on twiter, stocktwits, etc. But the product has never been more promising, so that can reverse with the right news flow.", "score": 4, "replies": [{"body": "You’re absolutely fantastic mate, that’s a lot of info I never would have come across on my own. Thank you :D\n\nMight actually buy in a bit, fully agree that there’s a lot of wind-down now, would be a good chance to get in low on the potential that they do blow up with Phase 3 testing", "score": 2, "replies": [{"body": "Catalyst dates are either June 2 science event, start of july ahead of promised journal article, or october, for prelim phase 3 results. Would call in those I would think. I'm on June calls at the moment, bought a bunch today.\n\nThe investor relations site has a recording of their call in which they announce phase 1 results, that I just summarized for you. It goes into a lot of detail, and answers a lot of questions. You can compare that to the CanSino journal results, which are actually worse, but are still 'very good'. There's a reason the former FDA director and Fauci are both saying this is looking pretty good.", "score": 1, "replies": []}]}]}, {"body": "One of the main reasons they conduct those clinical trials is so that they can find the correct dosage that provides good immunity while minimizing side effects. You have to test a wide array of dosages to find that level, that guy got one of the higher dosages tested.", "score": 1, "replies": [{"body": "Ahhh, fair enough! Not well versed in vaccine creation, so cheers :)", "score": 1, "replies": []}]}]}]}]}, {"body": "I bought in on MODERNA when it was at about $32per. I’ve been holding it for a while. It shot up into the 80s per then back down into the 60s. I just sold today. Moderna has had a lot of shrouded info around them. The news that comes out concerning MRNA to me doesnt seem like a company that practices much integrity and they’ve kinda taken on this “bag guy of the vaccine companies” business look to me. For that, along with the aggressive dips lately, I got out of my position with them.", "score": 3, "replies": []}, {"body": "I sold moderna on a loss.\nThey are fraud", "score": 5, "replies": [{"body": "I did the same with ino when they were called a fraud and recently they are now the hero. Ive seen them bi the fraud and hero 3x since march. Moderna will have its hero day again soon", "score": 2, "replies": []}]}, {"body": "I own also, it’s a high risk investment and don’t put any $ on it that you can’t lose, ei 50% loss or more. That’s just the nature of biotech investing.\nIt’s hard to do any analysis because they technically don’t have any profit but have an extensive pipeline.\nAt the current price point it’s more of a long term play, might not see any price increase until something gets approved for the market, such as a vaccine.", "score": 2, "replies": []}, {"body": "Been holding MRNA for a long time now, bought when they were in the 40s. As you said, much higher risk than PFE but also much higher [potential] growth considering the vaccine race. It’s really a needle in a haystack with how many are working on a vaccine right now, but I’m betting my cards on MRNA because of their contract with the government + their aggressive ambition to get it done ASAP. Only time will tell but I’m holding. FYI also got some in PFE as part of my long-term diversification. Good luck! 👍🏽", "score": 2, "replies": []}, {"body": "I have MRNA puts. Bought them when it hit 75ish. Going to double my money if it drops about $5 more.", "score": 1, "replies": [{"body": "You're going to put more money into it? I bought st 75 also and currently fighting not to sell", "score": 1, "replies": [{"body": "Puts - a type of option you buy when you think the price will drop.", "score": 1, "replies": []}]}]}, {"body": "another post about this stock, what is up with people and MRNA.", "score": 1, "replies": []}, {"body": "Isn't moderna a fake company? PFE is a real one, thats all I know", "score": 1, "replies": [{"body": "what do you mean by \"fake\" lol.\n\n&#x200B;\n\nPFE is a large pharma company known for doing other things too. MRNA is much smaller and only really got into the spotlight amid covid-19. :P", "score": 1, "replies": []}]}]}
{"title": "What Options Are Everyone Buying?", "selftext": "Now that my portfolio is pretty loaded up on long term stocks (BLMN, DKNG, TSLA, FB, MSFT, AAPL), I want to roll the dice on a Call Option.  Looking to spend $200-500 on the premium.  Some of my thoughts:\n\nDAL\n\nBUD\n\nEVRI (have two contracts already)\n\nRTX (have one contract already)\n\nPLAY\n\nAIR\n\nET\n\nACB\n\nVTIQ (probably too expensive)\n\nEROS\n\n\nWhat’s everyone spending their option $$ on???", "id": "gr12o2", "created_utc": 1590512971.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 23, "comments": [{"body": "You should look at the stocks you own and buy a call in one of those. Much better names. Good luck!", "score": 6, "replies": []}, {"body": "The ones that don't do good. Uncanny ability to make the wrong pick.", "score": 3, "replies": []}, {"body": "I like RTX but I like it as stock better. It's a dividend stock with good upside, why not hold equity?", "score": 2, "replies": [{"body": "I can’t afford to buy that much lol.  My entire bankroll is roughly $12k, I’d have to spend a lot to make those dividends worth my time", "score": 1, "replies": []}]}, {"body": "Puts. On everything. This market doesn't make sense and the recovery won't continue to look like a V in 2 months.", "score": 2, "replies": [{"body": "I can’t afford to lose a put.  Calls or bust", "score": -1, "replies": [{"body": "Bust then?", "score": 3, "replies": []}]}]}, {"body": "10 contracts DAL 25p 5/29", "score": 1, "replies": [{"body": "LATAM bankruptcy doesn’t concern you?  Aren’t they owned by DAL?", "score": 1, "replies": [{"body": "I got puts not calls. It’s one of my yolos for the week. I bought all 10 contracts today when DAL WAS 25.24, I just need it to drop a little bit today or tomorrow and then I’m selling to close. I wouldn’t be buying calls on the way up right now, I’m bearish on everything. The calls would’ve been a really nice grab if you had a month out expiry and you had bought last week. Right now the premium is high and they are all up crazy percentages. I also bought AAL puts", "score": 2, "replies": []}]}]}, {"body": "Vtiq is in the green today up 14% was planing on buying buy hopping it got back down I think it will be good long term", "score": 1, "replies": []}, {"body": "DKNG - $30 C 7/17", "score": 1, "replies": [{"body": "Funny, i was looking at the $35 for the same date", "score": 1, "replies": [{"body": "Yea I bought the $30 one last week. I figured NHL and NBA are right on the cusp of announcing returns. I think NHL May be announcing today at 4:30", "score": 1, "replies": []}]}, {"body": "Holding 6/19 $30 C on DKNG also. Up 30% so far might sell", "score": 1, "replies": []}]}, {"body": "buy SPY call options during the next down day", "score": 1, "replies": []}, {"body": "2 contracts BAC 26c 11/20 up 100%", "score": 1, "replies": []}, {"body": "Sell the put instead.. options expire worthless take advantage of that", "score": 1, "replies": [{"body": "This market is entirely too unpredictable for me to stomach puts", "score": 2, "replies": []}]}, {"body": "You guys need to jump on SOLO.", "score": 1, "replies": [{"body": "Go on", "score": 0, "replies": [{"body": "Only day traders know this!", "score": 2, "replies": []}]}]}, {"body": "Take a look at COTY, they are expected to bounce back to their fair share price of around 6.30 within a few weeks, they might be worth a gamble", "score": 1, "replies": []}]}
{"title": "Regretting selling my stocks out of pandemic fear...", "selftext": "In February I bought stocks that dropped due  to covid-19 fears. When the pandemic hit the US in mid March I got scared and dumped them at a loss. I bought Apple for $298/share and amazon at $1700/share and sold them for a loss totaling about $1200. Now amazon is $2423/share and Apple is $318/share. I wish I had bigger balls...", "id": "gr4a2e", "created_utc": 1590522787.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 24, "comments": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Yup. Similar events happened back in 2019 September, October, November. My positions dropped hard; only to double in December. \n\nFrom that point on, you learn to remove emotions from investment. \n\nHopefully this is your learning curve. Don’t ever mix emotions with investing. You will sell at a loss every. single. time.", "score": 6, "replies": [{"body": "Yes sir. Thank you for your encouragement. I’ll learn from this and come back stronger...hopefully.", "score": 5, "replies": [{"body": "Just remember, you could always have made this mistake with $40k down the line. Pretty cheap lesson if you look at it from the long run. Next time things crash, your head will be in the right place - either sell early and buy low, or hold through it", "score": 6, "replies": [{"body": "Very good advice and much appreciated. I will consider it the price of learning. And like you said it’s a cheap lesson. I hope I can learn from this lesson and make more in the future.", "score": 4, "replies": [{"body": "For sure! My first real crash as well, so I’ve had a few moments like this where I had to sit back like “now that was fucking stupid, you tool. Why did you do that?”", "score": 3, "replies": []}]}]}]}]}, {"body": "You’re right. Gonna get back in the market and leave it in regardless. Just waiting for the right time.", "score": 1, "replies": []}]}, {"body": "I'll be honest, I wish I started trades sooner, but I've learned so much thanks to my mistakes and this community", "score": 3, "replies": []}, {"body": "You’re not alone dude. A lot of people thought this was the end of the world. The news feeds on fear and despair. You were told that things would never be the same. Maybe you saw the same videos I did from China months ago of people banging their heads in to the asphalt and screaming. People dropping dead in the street. \nIt was a perfectly normal reaction. If it was true at least you had some cash. Also if it was true, it wouldn’t help you. You’d be better off learning how to shoot and make fire. \nI think we’ve all learned some valuable lessons.  Be prepared. Don’t knee jerk react to those who benefit from your actions. Think for yourself. Average down.", "score": 3, "replies": [{"body": "I definitely thought it was the end. Like everyone else I didn’t know what would happen. The media made it seem much worse than it was and seeing all of the empty store shelves was terrifying. \n\nI’m sure I’m not the only one, but it’s comforting to hear it from other investors. I definitely learned a lot from this pandemic as did everyone else.", "score": 2, "replies": []}]}, {"body": "Be greedy when others are fearful.", "score": 4, "replies": [{"body": "You’re right", "score": 1, "replies": [{"body": "Every loss hurts when you’re new. You’ll get used to it. \n\nLosses are just the cost of doing business. I took a $1,300 loss on BIDU a while back because I was not impressed with the earnings call and decided it’s a broken company. \n\nWe all make mistakes. What’s important is how quickly you correct them.", "score": 2, "replies": [{"body": "Cost of doing business is a great way to look at it. I’m hoping to learn from it for sure!", "score": 2, "replies": [{"body": "That’s what matters. Mistakes cost you a couple bucks now. But hopefully it’ll make you a better investor.", "score": 2, "replies": [{"body": "Thank you! I hope so!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Buy high sell low.", "score": 2, "replies": []}, {"body": "I sold TSLA around $250 back in the day. It happens", "score": 2, "replies": []}, {"body": "at least you only lost 1200. Don't do that next time :)", "score": 1, "replies": [{"body": "I won’t. Next time I put money in it’s for at least 5 years", "score": 1, "replies": []}, {"body": "Very true.", "score": 1, "replies": []}]}, {"body": "So you're whining about $1200 loss?", "score": 1, "replies": [{"body": "Yeah. Sad I know", "score": 2, "replies": []}]}, {"body": "You did the right thing. Another crash is coming and whole stock market and economy is going down for decades. Lots of people will be homeless, people will lose their house, cars, jobs, marriage bla bla bla. There will be no food to eat, no flight, no cruise, no casinos, gas will be 2 cents a gallons but people will not buy because they will have no cars. Bears said.", "score": 0, "replies": [{"body": "I heard that from my other friend and I thought it would crash. But the markets seem good. I’m tempted to go back in because I don’t want to get left out if things go up. \n\nI had one share of amazon and it went up $700 from my original purchase price. I sold it at a loss", "score": 1, "replies": []}]}]}
{"title": "(probably) Selling my first CSP tomorrow, tell me why this is a bad idea.", "selftext": "Looking at either 6/19 (\\~$65/contract at Friday close) or 7/17 (\\~$120/c) CCL 12.50s.  I would happily buy CCL at $12.50 as I'm already long on CCL and have no issues adding to my position at $12.50.\n\nIf the share price doesn't crash, but stays steady or increases, should I plan to close out my initial put and sell another one at a further out?  For example, if I buy the 6/19 tomorrow -- if I can buy it back for $25 in a week and half -- is that the move? Buy it back and resell it further out?\n\nedit: Is assignment the worst case scenario here?  I don't see CCL going out of business in the next few weeks and barring \"cruising cancelled for 10 months,\" the worst news of the next 4 weeks is already in.", "id": "gqpv1v", "created_utc": 1590465667.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 20, "comments": [{"body": "I was looking into CCL too. Mainly because boomers and Saudis will keep it up. Was looking at 7/17 10-12.5p or even some long term calls. When they announce they will continue operations, the stock will skyrocket.", "score": 4, "replies": [{"body": "Carnival, Royal and Norwegian are all really driving hard at resuming some schedules in the beginning of August.  I believe Carnival is attempting to get 8 of 26 ships sailing in August.  They still haven't acquired permission from any ports to do so at this point.\n\nThe 4-6 weeks after that will be telling.  If any of them come up with another Diamond Princess then they all might get shut right back down.  I've looked at what they are doing for safety and cleanliness and it could be effective.  However, won't change anything if Joe Rona coughs on you while you are waiting in line for the dining room.\n\nEdit: I am confident the cruise industry returns -- I am long on the big three and bought LEAPS on CCL as well.", "score": 2, "replies": []}]}, {"body": "Idk about CCL man.. sure, it might not be the *worst* stock out there, but do you think it's the *best*?\n\nIf you're confident in the trade then go for it, but a CSP isn't like a credit spread that you can throw on in anything. Underlying selection is one of the most important factors for this strategy, so just keep that in mind", "score": 2, "replies": [{"body": "Best, no.  However I've done a lot of research on the cruise industry and the big three and I comfortable with them and.feel.like I understand the sector at some level.\n\nI picked CCL as I was already looking at possibly adding to my position.", "score": 2, "replies": []}]}, {"body": "Worst case scenario is CCL announcing bankruptcy, which means CCL stock WILL go to zero and you will be assigned at 12.50 for a $0 stock.  Or some variation of that, like USO reverse-split.\n\nIf you're comfortable with that, my opinion is you should have a plan before you enter.  \n\nDo you want to feed at the trough multiple times? Then the plan could be to close the contract when 50% of the credit has decayed and immediately open another one.  If you want to be a less frequent trader, wait for 80%.  \n\nIf you believe that CCL is at a historically low price and will not hit this low level for another decade, then go as far out as you can.  For example, Jan2022 (605 DTE) $12.5 mark is $5.3.  That's 40%/24% annualized.\n\nSome suggestions. Happy trading!", "score": 2, "replies": []}, {"body": "Good luck. CCL...whew. If you're up for a thrill, you're on your way.", "score": 2, "replies": []}, {"body": "Just sell the put first then decide whether you wanna buyback later, you counting chickens before they even hatch.", "score": 1, "replies": [{"body": "Yeah, thanks.  That was more a hypothetical...if you are in a position to buy back, what's the catalyst to buy back and sell a new put.", "score": 1, "replies": []}]}, {"body": "I usually go in with some goal for how much I want to make in a set period of time. For instance, if I make 50% in a day there's a 99% chance I'm closing that position and likely doing it all over again at either a different strike or different expiration date.\n\nThis ultimately depends on your risk tolerance and personal goals. Make up something that works for you. Test it out. Adjust it as necessary. \n\nIn general though, I would advocate for taking gains when you can get them and turning them right back around for compound gains.", "score": 1, "replies": []}, {"body": "RCL has a bit better debt position than CCL I believe.  Do you have the BP to sell a CSP for RCL?", "score": 1, "replies": [{"body": "I'll look at RCL as well.  I liked CCL because it is a small outlay for the CSP.  RCL will be 3x, but it is within scope.", "score": 1, "replies": [{"body": "I know all the cruise lines will make it through these rough seas, but they will all be drowning in debt, despite (or because of, I guess) all the life preservers Jpow and the fed have thrown out.  RCL seems like one of the few that isn’t just rearranging deck chairs on the titanic, in terms of keeping the cost of their debt as close to sea level as possible.  Regardless, the best way to get your feet wet with CSP’s is to just dive right in!", "score": 4, "replies": [{"body": "Lol... nice poetry there man!", "score": 1, "replies": [{"body": "It’s hard to pass up solid dad joke opportunities.", "score": 2, "replies": []}]}]}]}, {"body": "I understood what you were asking, but on second look -- what does BP stand for?  I assume you were asking if I had enough cash to write the CSP for RCL, but can't decipher the acronym.", "score": 1, "replies": [{"body": "BP - Buying Power", "score": 2, "replies": [{"body": "thanks", "score": 2, "replies": [{"body": "Apologies for perpetuating the acronym soup!  I’m still pretty much a noob at this as well so I should have known better.", "score": 1, "replies": []}]}]}]}]}, {"body": "If you already have 100 shares of CCL you can also sell a strangle (sell a cash secured put and a covered call). This will give you more premium, but limit your gain in case the stock starts to rally.", "score": 1, "replies": [{"body": "Yep.  The June -12.5P/-16.5C gives 1.33 in premium.  17.83 breakeven gives lots of room to run to the upside; more if you roll up the put.", "score": 1, "replies": []}]}]}
{"title": "$SPY Credit Call Spread Learning Moment to Share", "selftext": "Hi all. Apologies for the long post - I have learned some lessons with this credit call spread that I thought valuable to share with the community.\n\nI opened up a 275/285 5/15 $SPY credit call spread in early April... this was tested, breached, and is underwater. My thesis is that the magnitude of the recovery post-crash has been unfounded, even with infinite QE from the Fed... and I have constantly been proven wrong as we go up and up and up...\n\nI have been bag-holding for a while on this but during a down day in late April or early May, I rolled the 5/15 contracts to 6/19 at no cost - realize loss later - give me more time to be right about a regression.\n\nLast Monday when we had the $SPY 9-10 point green day, I thought (and still think) that these gains are still unsustainable. I wanted to capture some more intrinsic value before the market begins to regress again, so I rolled the 285 to 290, capturing additional premium and increasing my risk slightly.\n\nWe are now \\~25 days DTE with another very strong green day today... and I am feeling pretty jaded about bearish positions on $SPY but I am still bag-holding. I am trying to figure out how to improve my breakeven and reduce my max loss outcome (ie collect more premium). My initial thought was to add a put spread create an inverted condor (overlap between short strikes). I looked around tastytrade for info on this - found this article  [https://www.tastytrade.com/tt/shows/everyday-trader/episodes/why-we-dont-invert-defined-risk-09-26-2017](https://www.tastytrade.com/tt/shows/everyday-trader/episodes/why-we-dont-invert-defined-risk-09-26-2017) .\n\nI think the outcome for now is to wait out today... and then on a red day later in the week, turn my call spread into an iron fly 6/19 260/275-275/290. This will increase my credit-taken while still maintaining my max risk. It will soften the blow of whether or not to close the position for a loss at 21 days, hang onto it because I'm near-ish max loss, or manage it in a different way.\n\nThanks. Happy trading.", "id": "gr237r", "created_utc": 1590516137.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 28, "comments": [{"body": "There comes a point where closing a trade and accepting your loss is better than rolling, and I think you're already there", "score": 13, "replies": [{"body": "Agreed. I am near there, unfortunately. I think that turning the credit spread into an iron fly reduces my loss and makes me feel a bit better. I am prepared to take the max loss if I need to.\n\nAs I said in my post - it's a learning moment for me that I thought would be meaningful to share.", "score": 3, "replies": [{"body": "\\> makes me feel a bit better\n\nI'm in the early stages of learning options trading and recently heard general advice that, \"the decision that makes you feel better almost always hurts you\".  From this video specifically:  [https://www.youtube.com/watch?v=MmryR1iu9dA&t=2s](https://www.youtube.com/watch?v=MmryR1iu9dA&t=2s)\n\n&#x200B;\n\nDon't have a deep enough understanding to provide any input on your setup here, but do wish you luck!", "score": 3, "replies": []}, {"body": "I totally get that, in fact I had a similar 5/15 SPY credit call spread, but worse. I thought about rolling but decided against it. I find it hard to justify rolling in situations that would increase my max loss. For sure was a good learning moment, i'm glad you shared yours.", "score": 1, "replies": []}, {"body": "I think this might be my answer to an EBAY trade I have that has not once been in my favor.", "score": 1, "replies": []}]}, {"body": "Quite a bit past \"there,\" imo.", "score": 3, "replies": []}]}, {"body": "Don't sell calls on the major indexes and don't take advice from anyone who tells you to do so.", "score": 6, "replies": [{"body": "Maybe dont roll your defined loss.i have a 100% success rate on spx condors friend.", "score": 2, "replies": []}, {"body": "why?", "score": 1, "replies": [{"body": "Call premium on the indexes is very low and the indexes are constantly manipulated upwards with the futures market.", "score": 3, "replies": [{"body": "should one sell puts then?", "score": 1, "replies": [{"body": "Yeah, selling puts is one of the best options strategies. I prefer to sell them on stocks, which have higher implied volatility and higher price movements. Sell puts on solid stocks have have been trending down for the last week or so.\n\nFor instance, Netflix is beginning to look attractive for put selling. I always recommend doing a put credit spread instead of naked put if your goal is not to own the stock.", "score": 1, "replies": []}]}, {"body": " > constantly manipulated upwards with the futures market\n\ndoes that mean buying calls there always print?", "score": 1, "replies": [{"body": "More often than not. There was an article on Nasdaq showing that buying calls has been very profitable since 2018 -- more profitable than any other strategy tested, which included buy and hold, short strangles, and short puts.", "score": 2, "replies": [{"body": "haha the hard question is what happens going forward though\n\nI think not just since 2018, rolling long calls since 2009 would have easily beaten many other 'strategies' simply due to SPY and many stonks just keep rising", "score": 1, "replies": [{"body": "I understand rolling short options but how can you roll a long call?", "score": 1, "replies": [{"body": "1. buy a long call\n2. long call prints\n3. use all 'house' $ to buy more long calls, pocket principal to survive a wipe out\n\nrinse and repeat", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "To me, \"rolling\" a position that is at max loss to another position that is also at max loss seems like a bad move.\nRemember, this kind of \"rolling\" is actually \"closing the position, locking in the losses\", followed by \"opening a new position that is similar to the one just closed\". \nIf you were starting fresh, is this new position the one you would take? Or are you just fooling yourself? Is it worth tying up that capital for months, just so you can point to it and say \"look, I was down 400 on this but I ended up closing it out for a $2 profit!\"... After 6 months of fighting it? How much could that capital have made if it was invested in better positions?", "score": 4, "replies": [{"body": "I’m not capital limited right now... and if you’re not capital limited, rolling a position that’s at max loss to a later date that is also at max loos is exactly what you should be doing... you have nothing to lose and everything to gain.", "score": 0, "replies": [{"body": "What you meant to say is you're locking in max loss for time passed, then doubling down on the same position for the future. You were wrong once, is this going to be the one time the market acts rationally and you'll be right?\n\nBeing capital limited has nothing to do with it. Everyone is capital limited when viewing things at the right angle.", "score": 1, "replies": [{"body": "I’m not doubling down at all... doubling down is to say that I am willing to double my risk based on the same exact thesis.  \n  \nI am giving my position, rolled at no cost, more time to be correct. That’s basic options management - if you can roll losers at no cost without risk of more loss... you’re a fool not to do it. As I said in my previous message - there’s nothing to lose and everything to gain.  \n  \nPerhaps you and I have different options trading philosophy and approach.", "score": 1, "replies": [{"body": "Doubling down wasn't the right term. \n\nIf you're saying you're rolling at no cost, no harm no foel. Well technically you lost time value but hey, if time value is all you ever lose then you're doing allright. I read it as you lost all premiums and are trying again from scratch", "score": 1, "replies": []}]}]}]}]}, {"body": "How much did you get for rolling your 285 to 290? At this point that looks like it would increase your max loss by $500?", "score": 1, "replies": [{"body": "I think I got $3.85 last Monday.", "score": 1, "replies": [{"body": "I know Option Alpha advises against rolling where you increase risk/max loss and I suspect that's sound advice.\n\nThe other roll you did at no cost to 6/19 looks like a well timed and advantageous move though!\n\nSelling a put credit spread when the timing is good should be a good plan to reduce losses.", "score": 1, "replies": [{"body": "Yeah... still hoping for my thesis to be fulfilled - likely foolishly. A good learning lesson. Just focusing on managing the position I have rather than beating myself up for having the position in the first place.", "score": 2, "replies": []}]}]}]}, {"body": "All you have to do is walk into a game-stop to realize why investing in them is an awful, awful idea.", "score": 0, "replies": [{"body": "Yet here we are. That zombie corp just keeps on trading.", "score": 1, "replies": []}]}]}
{"title": "Every body if you want to make Tendies LONG THE DOW / SPY AND NASDAQ NOW!!", "selftext": "This is set up for a Rocket launch, the base has been made and now the rocket is getting ready, this is a Move we all want to catch because NASDAQ is close to smashing ALL time highs, and when the NASDAQ gets over 10k+ the DOW is gonna SPIKE hard.  \n\n\nThis is the start of the big boy pump, not the pussy shit we been witnessing for the past 8 weeks. NOW IS THE TIME TO BUY !!!", "id": "gqnzpm", "created_utc": 1590457913.0, "score": 8, "upvote_ratio": 0.57, "num_comments": 28, "comments": [{"body": "Jesus... if this doesn’t mark the top then I really don’t know", "score": 81, "replies": [{"body": "Tops aren't like bottoms. Tops keep going but bottoms only last once. 💦", "score": 8, "replies": [{"body": "Opposite of true but ok", "score": 15, "replies": []}, {"body": "That’s not how gay sex works. Bottoms can take multiple loads, tops need a break after finishing.", "score": 1, "replies": []}, {"body": "That’s assuming the bottom does not recover and then dig deeper. When allocated over time there are multiple bottoms as well as tops. The true bottom happened before the market began, the top will only be reached when all trading ceases permanently.\n\n\nThink of it like a gay bar, there are many tops and bottoms you bring to your orgy, but only one of each is a true top or bottom in the specified instance. The top of your orgy might be a self described bottom.", "score": -1, "replies": [{"body": "I read the whole thing and it hurt my brain. Let me get this straight. “It ain’t over till it’s over?” Is that what I read?", "score": 6, "replies": [{"body": "Congratulations, if anything I said makes sense I suggest you seek immediate medical attention for a potential stroke. Or OD", "score": 1, "replies": []}]}]}]}, {"body": "trust me dude  i am the greatest tRaDeR on the earth niga, if you listened to me 2 hours ago you would be in nice profit. dont worry smelly bear, its not too late to buy, the show is just beginning", "score": -8, "replies": []}]}, {"body": "*autism intensifies..*", "score": 27, "replies": [{"body": "AHHHH! BuuYyy!! ERrrR NOOWW!! HHMMMMYYEEAAAAA!!!!!!", "score": 11, "replies": []}]}, {"body": "Ah the old' buy high sell low strategy. You really belong here!", "score": 18, "replies": []}, {"body": "Puts it is..", "score": 9, "replies": []}, {"body": "tendies or FDs?\n\n\nbut yeah we going to 3-3.2k spx to get that sweet sweet retail fomo, then we dumping like crazy", "score": 5, "replies": [{"body": "I have low life drug addict high school friends who never made anything with their lives reposting their 2 week old RH account codes on Facebook, talking about how they made money on SPY.\n\nRetail FOMO is in. \n\nBut I don’t doubt they can push this higher.", "score": 5, "replies": []}]}, {"body": "Thanks for the free puts", "score": 4, "replies": []}, {"body": "let's see vix down to 20-25 first", "score": 4, "replies": [{"body": "They're not gonna understand that. Just say bears r fuk and then proceed to buy puts.", "score": 1, "replies": []}]}, {"body": "bullgang we eatin", "score": 3, "replies": [{"body": "we really out here unlike them smelly  retard bears", "score": 1, "replies": []}]}, {"body": "Thanks", "score": 2, "replies": [{"body": "you are welcome", "score": 1, "replies": []}]}, {"body": "Ok NOW has to be the real top everyone was hoping for.", "score": 2, "replies": [{"body": "NOT yet dude, we have only just begun, look at the Daily chart on all charts, we have broken out. the golden cross, the golden set up. LONG AND ONLY LONG. BIG GREEN CANDLES COMING EVERY HOUR", "score": 1, "replies": []}]}, {"body": "Strangle dem balls", "score": 1, "replies": []}, {"body": "Why today? +500 morning?", "score": 1, "replies": []}, {"body": "I'm calling top now give me fallatio. Kevin hart said buy hold and Kevin hart is the funniest comedian ever xD so im with kev fuck my brokers opinions. He knows Dave Chappelle.", "score": 1, "replies": []}, {"body": "Spell it out for me...", "score": 0, "replies": []}]}
{"title": "Lol dow up 500 pts pre market. Back to pre covid levels over literally nothing. Laughable 🌈🐻", "selftext": "", "id": "gqvonp", "created_utc": 1590494369.0, "score": 9, "upvote_ratio": 0.92, "num_comments": 20, "comments": [{"body": "Puts about to expire worthless huh?", "score": 14, "replies": [{"body": "Puts looking a bit better now going into this week", "score": 1, "replies": []}, {"body": "Oof", "score": 1, "replies": []}, {"body": "Bears hate money.", "score": 0, "replies": []}]}, {"body": "Literally nothing... except unprecedented and massive economic policy reform, bond buy ups, 0% interest and economic stimulus", "score": 5, "replies": [{"body": "That’s priced in \n\nWhen demand doesn’t come back for goods and services you can print as much money as you want. Businesses will still fail", "score": 3, "replies": [{"body": "Correct, but no one will believe it until it happens. You are not wrong, you’re just early. Short term calls, long term puts. Play the game, don’t pick a side", "score": 3, "replies": [{"body": "> You are not wrong, you’re just early.\n\nThe Gay Bear's prayer.", "score": 2, "replies": []}]}, {"body": "Having seen Florida beaches this weekend, I think once we hit phase 2 it will all be back.", "score": 1, "replies": [{"body": "It’s scary out here b", "score": 3, "replies": []}]}]}, {"body": "Proped up", "score": 2, "replies": []}]}, {"body": "Yeah, the virus is a complete nothingburger to productive members of society, so this entire dip had been literally over nothing, you called it.", "score": 4, "replies": []}, {"body": "Sentiment is a market mover when there is uncertainty.\n\nJust as bearish sentiment made the market fall 30%, bullish sentiment can make it run up 30%.", "score": 2, "replies": []}, {"body": "Take a look at the IBB ten year chart.  A beautiful 10 year double top right here at 135.  Sold to you bulls.  \n\n\"Sell 1000 IBB at 135\"- Yelled in my best Dan Ackroyd voice", "score": 2, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "How can you say nothing happened when JPOW just printed more money in 3 months than we did during 2 years of QE.\n\nWe just witnessed the greatest \"fuck poor people\" fiscal policy move that America has ever seen and it's not even close. \n\nWant to buy a house, better have 20% otherwise we will just sell it to the corps we just have 1/3 of all time us debt so they can buy it instead for more than it's worth because after few more months of brrrt they will be green and your net worth goes to the buying power of $20 which is good for you because you can now double your worth from your knees in a back alley.", "score": -1, "replies": [{"body": "Idiot nothing happened over the weekend. All that shit helped prop up a badly damaged economy. It didn’t bring any of those 40 million jobs back", "score": 1, "replies": []}]}, {"body": "It’s still almost 20% below pre-COVID levels, but m’kay", "score": -2, "replies": [{"body": "Not very good at math huh son", "score": 2, "replies": [{"body": "It was at about 29,600\n\nIt’s not even at 25,000 right now\n\nIt’s needs an 18% gain from where it is right now", "score": 0, "replies": []}]}]}]}
{"title": "100k if it hits says DIS is going down", "selftext": "[deleted]", "id": "gqxjdk", "created_utc": 1590501454.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 20, "comments": [{"body": "You don’t short the mouse chief", "score": 15, "replies": [{"body": "learned first hand in march. got molested", "score": 2, "replies": []}]}, {"body": "Never, ever bet against the mouse.", "score": 10, "replies": []}, {"body": "The mouse will rise on pure hatred after seeing this.", "score": 6, "replies": []}, {"body": "325 for commission..... HAAAAAA GHAAAAY", "score": 5, "replies": []}, {"body": "What about the DIS and NBA rumors?\n\nWhy are you confident to be buying 100k puts with the market being so bullish?", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Well isn't all that shit priced in too?", "score": 1, "replies": []}]}, {"body": "Cause he’s autistic and probably doesn’t follow sports", "score": 1, "replies": []}]}, {"body": "Right around the time they reopen parks... yeah good one", "score": 3, "replies": [{"body": "Sell the news retard", "score": 5, "replies": []}]}, {"body": "That commission though", "score": 3, "replies": [{"body": "Pretty low", "score": 1, "replies": []}]}, {"body": "I’m up on my 155 strike calls 😂😂\n\nBut yah I’m gonna take my profit this week 🐻🌈", "score": 2, "replies": [{"body": "The fuck with this calls.... lol", "score": 3, "replies": [{"body": "Literally Disney Magic.", "score": 1, "replies": []}, {"body": "Bought them a while ago. Was looking for a home run. I’ll take my $125 profit though", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/jestlovetendies the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": " Fordern Sie die Maus heraus?", "score": 1, "replies": []}, {"body": "Looks like a futur suicide case to me", "score": 0, "replies": []}, {"body": "6/5\n\nBye bye 100k", "score": 0, "replies": []}]}
{"title": "TSLA DD", "selftext": "Alright so TSLA is a story stock. Here's the developing stories right now:\n\n1. China-US Cold War: doesn't affect it. No longer exporting to China. Even if they do, only parts and some batteries. China is heavily invested in TSLA, no rug pull for the foreseeable future. Zero impact\n2. Demand: strong. However, Q2 is shot. I'm expecting 70k-72k deliveries worldwide. Remember TSLA barely eeked out a profit last Q on 88k deliveries? Subtract maybe $150M of gross profit from the lower sales. Then add expenses for the opening and closing of factories. Then add some expenses for the PPE and donation all around for good wills. Then subtract $150M for loss of ZEV/FCAU pool credits due to TSLA did not start making EU cars until 5/18. The only way TSLA can be profitable this Q is for it to realize all $140M accrued ZEV credit and a crazy amount of FSD revenue. I don't see it happening.\n3. Battery day: priced in. V2G, cheaper battery, faster to produce. All cool. Take a while to show up on the financials, though. The point is TSLA is too big for this kind of reveal to build hype. The rumor is powerful with longs and gamblers piling in for months. Now that it's pushed to end of June, possibly July, those people are disappointed. What's there to wait for in the mean time? Elon is a show man. Don't expect any sooner on virtual. Has to be face to face. Not to mention large capex in the mean time to build up battery making lines. Tesla will post huge gains given a year for this battery tech to materialize. For now, lurking mode.\n\nTSLA has not underperformed the NASDAQ for no good reason. The fact is you have a tech company being slowed down by COVID in its transition to a bona fide techy. For now, it's primarily a manufacturer. It trades too frothy for a manufacturer. TSLA bulls however are some of the most resilient that's why it doesn't sell off. It's not displaying irrational exuberance either like it did in February. Consider this: back in February, there was no growth in the market. TSLA had growth. So it was a good gamble. Now, its growth has slowed down. Ecommerce, pot, vaccines, airlines, oil, etc... ironically became \\*growth\\* relatively to the March low. So, nobody is gambling on TSLA anymore. Don't apply the same mindset \"900/1000 here we go\". As stupid as the market is, it needs catalysts. TSLA has no catalysts for the next 3 - 6 months. IV went from 100%+ to 70%. And for good reasons. It's not going anywhere. It's just a boring, cash rich, cool product automaker. And that doesn't capture investors' imagination in these shitty times.  \nMMs were bleeding out of their asses for 4 months from 10/2019 to 2/2020 on calls. Now, they take revenge. Don't fight MMs, not when you're alone. Look at the volume.  \n\n\nPosition: weekly short 800p if cash gang, short 850c if bull gang.Short term play: 6/19 900c next Friday. China's May sales coming out early June provides some boost. Will not be enough to turn a profit so sell it quickly.", "id": "gqy5p1", "created_utc": 1590503656.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 29, "comments": [{"body": "I've been thinking of doing weekly credit put spreads, maybe even call spreads at super high strikes with tesla", "score": 5, "replies": [{"body": "good luck dude. If you hold shares, I'd only do call spreads. If cash, I'd do about 1 put spread for every $40k of capital and ready to buy the shares if it crashes. TSLA is a good company but I got fucked by the TSLA stock is too high dumb tweet. Had I held only puts, I could easily roll it out to the week after and avoid the loss. When I lost $9k on put spread, it was immediately locked in.", "score": 2, "replies": []}]}, {"body": "Why are you selling calls if you're bull gang? Why not put credit spreads or call debit spreads?", "score": 3, "replies": [{"body": "I don't do credit spread on TSLA anymore. Only puts/calls because it's trading in a range. You can easily roll up/down and out when it moves against you if you do puts/calls. If you do spread, you can get seriously hurt by some tweets. I'm a bulls but this thing doesn't look like it's going anywhere. I've been holding since $250 and this is mid 2019 all over again.", "score": 2, "replies": []}]}, {"body": "I agree with most of your points, but I wouldn't say TSLA is boring right now, and I think there might be a sleeping catalyst you may be forgetting. SpaceX will launch the first Americans on an American rocket in ages - that takes place on the 27th. I think there's reason to believe that good news for SpaceX translates to good news for TSLA. The two are not entirely unrelated; for example, Papa Elon's rockets do use Tesla motors in various capacities, I know this is at least true for Starship, which also uses Tesla battery packs. So the argument could be made that Tesla is much more than just an automaker. Various Tesla components are going up into space. Not many (if any) other automakers can say that.\n\nI believe Tesla is going somewhere. Up if the launch on the 27th is successful, down if it goes up in flames. I believe it will be successful.", "score": 2, "replies": [{"body": "2 months ago I would agree with you but now volume is so low that MMs will be able to easily squat the SpaceX hype. Good luck on your calls!", "score": 1, "replies": []}, {"body": "Buy calls, it’ll fucking rocket", "score": 1, "replies": []}, {"body": "June 27?", "score": 0, "replies": [{"body": "tomorrow", "score": 2, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/dannylez4l don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "So you think it will stay between 800 and 850 this week which is why youre saying to short weekly 800p and 850c? But you have 6/19 900c so you expect to see it leave this range by then?", "score": 1, "replies": [{"body": "No I'm saying buy 6/19 900c on Friday next week and sell on China's May sales data.", "score": 1, "replies": [{"body": "Ah I see. I may make this a theta play, short the 6/19 800p and buy to close on the China May sales data", "score": 1, "replies": []}]}]}, {"body": "Ok, so they will miss earnings? If so, the stock will go up as the fed buys it. Calls on ER.", "score": 1, "replies": [{"body": "I don't know what the WS consensus on earnings (loss) maybe so can't say if they're going to beat or miss. Honestly Q2 is going to be so shitty so I don't expect big movement on either beat or miss, unless huge. Tesla is going up huge in August if we have July's data showing things are back to normal. Expecting 120k - 150k delivery in Q3 if true. Big if. From now to July I'm definitely saying range bound. Earnings only matter to the extent they delay SP inclusion. So we have tranches that push it to Q3, Q4, or beyond. Anything within the tranches for Q2 isn't going to affect stock price unless it push the inclusion day back to the next Q. Most people expect Q3. That's a given. Right now we are about $120M up Q4 + Q1, now, if Q3 is back to normal I'm thinking $350M profit. If Q2 loss is, say, more than $500M, it's going to TANK. $200M? Meh, doesn't matter.", "score": 1, "replies": []}]}, {"body": "All this DD and not a single mention of interest rates. It’s like $5-10k cheaper to lease a Tesla now than it was a few months ago. Once Trump really needs to get the economy going again he will keep following the Obama playbook and start giving tax credits for auto purchases and you know the Dems will weasel in some green credit on top of it. \n\nTLDR: 10/16 $1500c", "score": 1, "replies": [{"body": "except leasing hurts the bottom line. Every P&D that comes out people take a sigh of relief when lease % is low. TSLA's customers have good credit. Wasn't rare to be able to get 1.99% before. 0% changes very little. Trump getting the economy going again is exactly the reason it doesn't help Tesla. All emission regulations are on the verge of being scrapped. I'm not counting on the Dems to get anything done for TSLA. The 3T bill that got rejected only asked for credits for renewable energy. No mention of EVs. In general I expect no help from the administration as long as Trump is still president. I haven't talked to any bulls who do, either.", "score": 1, "replies": [{"body": "The auto tax credit didn’t happen immediately in 09 either. Trump is also going to SpaceX flight launch tmrw. He’s got a new friend in Trump.\n\nAlso low interest rates help people who were considering a Prius versus a Model 3  sure the wealthy folk who were already buying doesn’t make much of a difference but next wave of real growth in the bottom line comes from Model 3s selling in large volume.", "score": 1, "replies": [{"body": "Trump is only in it for the optic dude. OIC doesn't help anyone. He can turn on TSLA just as quickly as when he turned on GM for the vent deal fiasco. TSLA would be best distancing itself from Trump. Trump helps nobody. He can't even help his voter base.", "score": 2, "replies": [{"body": "Nah, Musk was cheering on the reopening so he made Trump look good.", "score": 1, "replies": []}]}]}, {"body": "Just want to say go fuck yourself I bought those and retired now", "score": 1, "replies": [{"body": "I don't get why you're mad. Never said buying calls was a bad idea. You said lease was big. Lease % turned out to be low. You said Trump is going to subsidize car purchases. He never did. I made over $200k on TSLA myself the last 2 months so...", "score": 1, "replies": []}]}]}]}, {"body": "Just bought lotto 20x 1800c 19/6 let’s fucking go to moon", "score": -2, "replies": [{"body": "What u on homie?", "score": 5, "replies": [{"body": "If TSLA goes to 1k it will go from 23 cents to 5 quid", "score": 2, "replies": [{"body": "No way 5 quid, more like $200 from $23\nAnd hope someone will buy those options that need a 50% increase in the underlying from an ATH within a week, to make it worthwhile at all", "score": 1, "replies": [{"body": "Lol you have no clue how tsla OTM lottos function", "score": 3, "replies": [{"body": "Care to explain based on past experiences?", "score": 1, "replies": []}]}]}]}]}, {"body": "What month is 19?", "score": 1, "replies": []}]}]}
{"title": "$MU back to $60?", "selftext": "$MU is cyclical, we all know that. Most chip companies are doing well like Nvidia, Marvel etc and this might run up to earnings. MU Options are super cheap right now with IV around 50%. I am thinking of buying some and see how it goes. What you all think?", "id": "gqzftv", "created_utc": 1590507848.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 22, "comments": [{"body": "Here we go again", "score": 10, "replies": [{"body": "How can we leave MU out of this meme market, MU is the original one!", "score": 5, "replies": []}]}, {"body": "2018 called and wants its meme stock back.", "score": 5, "replies": []}, {"body": "MU is long term free money. Hands down the best play if you're betting on 5G phones exploding in the next 18 months..", "score": 4, "replies": [{"body": "Why", "score": 2, "replies": [{"body": "They require higher amounts of NAND which MU is the leading global manufacturer of.", "score": 2, "replies": []}]}]}, {"body": "i absolutely love MU, hold it as stock and previously had options etc. In my opinion this stock os so under appreciated in the market. Should be trading at minimum over 50 for me.", "score": 3, "replies": [{"body": "> i absolutely love MU\n\naww I <3 mu too, u/zahara22", "score": 3, "replies": []}]}, {"body": "I am in!", "score": 2, "replies": []}, {"body": "Thanks bro. Got calls, sold the pop!", "score": 2, "replies": [{"body": "grats!", "score": 2, "replies": []}]}, {"body": "My man!!!", "score": 2, "replies": [{"body": "got lucky on cake day :D", "score": 2, "replies": []}]}, {"body": "Nah maybe $50c", "score": 2, "replies": [{"body": "Even if it run upto $50 I am sure the super OTM calls will get some benefit too... especially with IV going up as it comes closer to earnings. Off-course $50 is much safer to play.", "score": 2, "replies": [{"body": "Amd can’t break thru to all time highs so don’t like MU chances. I’d take an MU 7/17 50c with IV low and then sell before earnings if MU is at $50-55", "score": 2, "replies": []}]}]}, {"body": "can someone just tell me if AMD will ever go up again", "score": 1, "replies": [{"body": "Not this year", "score": 1, "replies": []}]}, {"body": "No\nYou are welcome", "score": 1, "replies": []}, {"body": "Well now, this is one nightmare that won't go away.", "score": 1, "replies": []}, {"body": "Down today lol", "score": 1, "replies": []}]}
{"title": "Cloud stocks down", "selftext": "Why are all cloud and tech stocks down? OKTA? ZS? CRM? DOCU? PD?", "id": "gr2f8v", "created_utc": 1590517166.0, "score": 7, "upvote_ratio": 0.68, "num_comments": 20, "comments": [{"body": "Virus is cancelled, nobody will work from home ever again idiot", "score": 43, "replies": [{"body": "Lol", "score": 4, "replies": []}, {"body": "$PTON was down like 7% too. fucked my calls hard so i doubled down", "score": 1, "replies": []}]}, {"body": "They've had a good run up with everything closed and now they inverse the market? Idk", "score": 7, "replies": [{"body": "You mean buy the dip. Got it.", "score": 2, "replies": [{"body": "Yeah instead of buying puts on spy buy calls on cloud", "score": 3, "replies": []}]}]}, {"body": "Because you had calls", "score": 7, "replies": [{"body": "Should I buy the dip or cut my losses?", "score": 1, "replies": [{"body": "a lot of WSB is still bullish on clouds. It always takes us autists an extra week of pain/loss before jumping ship. Therefore this week will be painful, but if EOW clouds are down, jump ship next week for return of tendies", "score": 3, "replies": []}]}]}, {"body": "holding my ZEN calls for the investor meeting in 30 minutes. blindly following that dd that was posted late last week.", "score": 5, "replies": []}, {"body": "What are you smoking? $BOX is up.", "score": 3, "replies": [{"body": "sell before earnings tomorrow?", "score": 1, "replies": [{"body": "I’m gonna hold for a green dildo then sell.", "score": 1, "replies": []}]}]}, {"body": "May had correlation with $PLAN stock plummeting after its earnings call.", "score": 3, "replies": [{"body": "I'm up 40% on my 6/19 $50c I bought today. Kicking myself for not buying more contracts. IV is way down and the earnings were *good*", "score": 1, "replies": []}]}, {"body": "Market openings -= money will be spent elsewhere.", "score": 1, "replies": []}, {"body": "These products are less valuable the more people return to work.", "score": 1, "replies": []}, {"body": "Not $ESTC, hopefully that bodes well", "score": 1, "replies": []}, {"body": "Folks are taking profit in those stocks to rotate into other sectors that will grow much faster because of the reopenings.", "score": 1, "replies": []}, {"body": "Sector rotation. I am buying the dip.", "score": 0, "replies": []}]}
{"title": "KR breakout going to happen", "selftext": "I think there is potentially a play in KR coming up in the next few weeks.  All common sense says groceries stores should be insulated from 🍺🦠. It also says they are not the most exciting stonks to play normally.\n\nSo my thought is KR saw upgrades or PT increases from Wells Fargo and JP.  Then proceeded to fall even father an a day when market went way up.  Most likely due to people pulling money from a safe play to get in on the exciting plays.  Think in terms of bots trading and rate of change. \n\nBesides the upgrades there is also a Zacks article on value and earnings pitting KR vs WMT in which KR wins. \n\nAll this leads to believe KR will correct for drop today regardless of markets in near future. This upward correction will compound with positive news to build enough momentum for the rate of change bots to jump on board and run this baby up past the $33 resistance and into the $34-$38 range where it may form new base.\n\nMaybe it doesn't happen exactly like this but 7/17 34c are less then $1 and I have a hard time believing KR isn't going up at least 10% in the next month and a half. \n\nTl;dr KR 7/17 34c because meat and potatoes can't go tits up.", "id": "gr56s6", "created_utc": 1590525648.0, "score": 28, "upvote_ratio": 0.91, "num_comments": 27, "comments": [{"body": "Hope youre right, man! My 6/19 32.5 calls took a beating today.\n\nHolding on tight for earnings.\n\nObligatory \n##GroceryGang\n\nEdit: a letter.", "score": 7, "replies": [{"body": "same position \n\n GroceryGang", "score": 2, "replies": [{"body": "Fucking GroceryGang! Up 53% just today I bet there are a few people on here that got close to 100% up for today. $34-38 range here we come!", "score": 3, "replies": []}]}]}, {"body": "I got the inside scoop from r/kroger.  The employees hate the place but they say sales are up https://www.reddit.com/r/kroger/comments/gr7unh/hows_kroger_doing_financially", "score": 5, "replies": []}, {"body": "KR moves like molasses, but screw it -- why not.", "score": 3, "replies": [{"body": "Sounds like a great opportunity to sell weekly credit spreads, esp with all this hype for earnings!", "score": 3, "replies": []}]}, {"body": "I've been contemplating going in on calls on this one as well and dumping before ER. Tits and Ass indicators show Kr could drop to about 28-29 for next support level before bouncing.", "score": 2, "replies": [{"body": "Yeah, don't recommend expiration dates before earnings.  Might get cheaper calls if you wait a little longer but pricing around $33-$34 6/26 or later seems decent. I plan to add 33c if it falls more.", "score": 1, "replies": []}, {"body": "Tits and Ass indicators hahaahah i'm dying :D", "score": 1, "replies": []}]}, {"body": "I would be bored to death holding this.", "score": 2, "replies": [{"body": "Meh, 10% of my tendies sitting here for a month.  Less stressful then holding my COTY and SPWH", "score": 1, "replies": []}]}, {"body": "You forgot to add Kroger owns Home Chef meal kits, of which many meals have been back ordered due to demand. Plus, they stocked the shit out of their stores with Impossible meat thanks to the beef shortage. I've got a handful of 6/26 $36 calls (earnings 6/18 I believe.) Low volume/OI, but it's slowly building.", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/BiBoi-se don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "KR moves so slow not sold yet", "score": 1, "replies": []}, {"body": "Kr sucks for options", "score": 1, "replies": []}, {"body": "I got in Friday and am losing my ass so far.", "score": 1, "replies": [{"body": "Sorry you fell for this BS", "score": 1, "replies": []}]}, {"body": "Got in this morning and already up 40% on my calls. Should i sell tomorrow by open and buy back in on a pullback?", "score": 1, "replies": [{"body": "Hard to say, I bought in a little early so I went down 20% and now sitting up 20% so I'm not selling for that.  I think this thing is just getting warmed up for the next few weeks.", "score": 1, "replies": [{"body": "Made 100% on BJ’s if KR continues like this i might have to actually go shop there", "score": 1, "replies": []}, {"body": "Even though it’s at ATH? I’m holding, but my 6/19 $35 are turning a little profit today after a week of being down. Tempted to sell but fuck it, Q1 could be something crazy.", "score": 1, "replies": []}]}]}, {"body": "Wtf is happening?? Why is Kroger dropping?", "score": 1, "replies": [{"body": "Round 1 was won by that ~$33 resistance appearantly.  I think your really waiting to see if it can get thru into the $34+ range.", "score": 1, "replies": [{"body": "Do we double down or what", "score": 1, "replies": [{"body": "I'm just back to where I started now. Missed opportunity to sell up 75% and buy back in low.  I think I'm just riding this out until earnings gets closer.", "score": 2, "replies": []}, {"body": "Back up 3% after hours so far", "score": 1, "replies": []}]}]}, {"body": "The whole market fell. I’d be worried if it was only KR", "score": 1, "replies": []}]}]}
{"title": "Serious discussion. After all these years why hasn’t Apple expanded to cloud services market? Servers, databases, cloud computing, etc. Similar to GOOG and MSFT?", "selftext": "I feel like Apple has been so complacent with their products. Really the only cool product they’ve released in the last several years has been their AirPods and AirPods Pro. Phones? Same shit different year, people will buy the phones regardless of the specs and the features. Same goes for their line of MacBooks. \n\nApple has had so much time and so much extra cash they could have easily expanded their cloud infrastructure to become competitors with GOOG, MSFT, and even AMZN on e-commerce. What the fuck is Tim Cuck doing?", "id": "gr8laa", "created_utc": 1590537112.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 22, "comments": [{"body": "because apple only gives a fuck about the aesthetic... no reason to make a bunch of pretty server boxes that are going to sit in a dark room with some guy with a ponytail jerking off near them...", "score": 51, "replies": [{"body": "My guy! Upvote secured. 10/10.", "score": 0, "replies": []}]}, {"body": "Because they’re a consumer tech company and not geared towards serving enterprises. It doesnt fit their core competencies. Their products primarily succeed because of the ecosystem they’ve created and the brand image. These advantages wouldnt exist for them in the corporate setting", "score": 15, "replies": [{"body": "This. iTunes is one of the largest streaming services. I dropped Comcast years ago & just use Apple TV. I pay around $50 a month on buying media on iTunes which is way more than I spend on Netflix or Prime combined", "score": 2, "replies": []}]}, {"body": "I work for one of the top tech companies in the \"cloud computing\" field (and others). Apple is one of our customers. They re a brilliant consumer product and marketing company. They have no desire to enter enterprise, it is an entirely different market.", "score": 3, "replies": []}, {"body": "Redhat mostly.", "score": 2, "replies": []}, {"body": "Apple gay", "score": 2, "replies": []}, {"body": "They stopped Innovating in 04. That was before the cloud boom.", "score": 3, "replies": []}, {"body": "Airpods aren't even innovative though haha. But yes, a very popular product. It did well and still does.\n\nThey are trying to make their own chips.\n\nI think they are trying to become product, hardware and wearable company.\n\nBut also push out services like apple music, TV and app store.\n\nMaybe some other things in the works.", "score": 1, "replies": [{"body": "I didn’t think I would like the AirPods Pro, but I got them and they are amazing. Haven’t worn my beats since.", "score": 2, "replies": [{"body": "I am not saying they aren't worth it or nice.\n\nJust saying, they are wireless/bluetooth headphones basically. They didn't invent the wheel lol.\n\nDefinitely a successful product for sure.\n\nNot sure what else they can branch into.\n\nAll I know is their own chips and don't they have some self driving too?", "score": 2, "replies": []}]}]}, {"body": "They are a consumer electronics company right down to their DNA and they are probably the best at it in the world.\n\nThey have had very little success in enterprise.  Also, trying to enter an industry with brilliantly executing titans with massive leads would be a very dumb thing to do.", "score": 1, "replies": []}, {"body": "B/c their customer demographic are women who giggle on livestream apps  ( aka facetime), boomers who can't use tech, and artistes who are full of themselves.", "score": 1, "replies": []}, {"body": "so the question is: why would they want to just keep taking the endless stream of easy money when they could be making a huge investment to pick a fight with two or three monstrously powerful cutthroat monopolies?", "score": 1, "replies": []}, {"body": "Yall seen them new Brapple ePads? Brapple stonks gonna moon son.", "score": 1, "replies": []}, {"body": "this is dum", "score": 1, "replies": []}, {"body": "Maybe this is a good reason to GUH 50k on puts?", "score": 1, "replies": []}, {"body": "Weird how they suck at innovation but are still high valued in the market, i think the Fed and PPT does a good job of pumping that stock especially now, their sales are done for on a go forward basis, less traffic less sales, you'll see in next quarter earnings.", "score": 0, "replies": [{"body": "I don’t agree with that. Their product is superb and will provide them with billions in sales until someone knocks them off their throne.\n\nI also think the people who aren’t buying now due to covid or losing their job, will start buying products again once they get a new job and economy gets rolling. People can only hold off on upgrading a phone for so long.", "score": 1, "replies": [{"body": "No one will buy new product with their money they need to survive, they will be paying rent and mortgage and credit card bills. They will not be buying the latest and greatest iPhone every release lol.", "score": 1, "replies": []}]}, {"body": "The fed doesn’t pump apple? Do you know how the fed works. Also apple has been buying their own shares for years.", "score": 1, "replies": [{"body": "Do you know how the Fed works? Yes share buy backs are pretty much to blame too. Still their products are subpar and inferior to Samsung.  Also they took loans to pay dividends, great company, that Apple.", "score": 0, "replies": []}]}]}]}
