{"title": "TESLA going back to 300+ (november calls), change my mind", "selftext": "Things (likely) happening before nov expiry:\n\n\\-earnings (first week of nov)\n\n\\-deliveries (first week of oct)\n\n\\-China production online (they will lie if neccesary because its chinese pride to get that factory up fast)\n\n\\-News of new line in Cali\n\n\\-Truck reveal?\n\n\\-Insurance posted in quarterly earnings, possibly larger rollout (I think this is huge and not well priced in, wallstreet fucking loves continuous revenue)\n\n\\-Just in general the atmosphere has shifted over last few months, bears are getting quiet about how tesla is going bankrupt... largely due to volume probably. (I get they are still posting losses, but wallstreet cares more about growth and revenue than profits afaik)\n\n&#x200B;\n\n\\-sry for no DD links on the above, tbh im kinda lazy and don't feel like linking all this shit. \\*I may add links if this post gains traction to spur conversation\\*\n\n\\-I have been holding the 250s for a few weeks, but am feeling the momentum play after the last few days that the trading range may be shifting (has been stuck in 200-250 for a while)\n\n&#x200B;\n\nMy position: (20k exp Nov 15, 7 @250, 13 @300)\n\n[https://imgur.com/a/e8hbmgJ](https://imgur.com/a/e8hbmgJ)\n\n&#x200B;\n\nEdit 1: 9/17/2019 - In case anyone is following this trade, I am going to be stepping out of this position tonight and will re-position after the fed.  imo it is a binary event that has way more potential downside than upside for this trade.\n\n&#x200B;\n\nEdit 2: 9/24/2019 - Pulled my position today for a 5k loss on the 20k position.  Kinda thought there would be some form of pumping or leaking relating to numbers that would be pushing it higher, but it seems to be radio silence.  Sorry to anyone that followed this trade.", "id": "d2t4xq", "created_utc": 1568220530.0, "score": 72, "upvote_ratio": 0.93, "num_comments": 93, "comments": [{"body": "I've been holding 400 shares @ 254 avg. price for a while now, I think the stock has room to run but I've also played this game before with Tesla. Guess we will see", "score": 37, "replies": [{"body": "Idk the whole 420 fiasco shook a lot of people I think... I mean dropping from 365 to 175 will do that to even the strongest of hands.  That being said, they never stopped making cars that people like and I genuinely think that they may be able to sort profitability soon (between insurance and international shipping efficiencies).  This is also the first time in a while that I genuinely don't care about whether or not they make autopilot progress, as it really isn't neccesary for them to get back to 300.", "score": 22, "replies": [{"body": "Uhh it bounced right back after the whole \"funding secured\" thing (12/12/18 it was at 376, higher than it was before funding secured). It dropped to 175 because they lost a shitload of money in 1Q 2019 and then had to tap the debt markets.\n\nThey might sniff 300 again towards the end of Sept/beginning of Oct, but the margins they make on their vehicles (really fucking bad) will once again destroy any upwards momentum once earnings come out.\n\nedit: There's also a significant amount of risk with the 100+ lawsuits they are currently facing, including the two big ones: the investor lawsuit regarding SCTY and the Wal-Mart one, but those probably won't materially effect Q3 numbers (40+ workers rights cases, 40+ securities lawsuits, 15+ for deposit theft, 20+ vendor non-payment)", "score": 3, "replies": [{"body": "Walmart and amazon have already settled outside of court with Tesla and are continuing to implement Tesla panels on all of their buildings.", "score": 2, "replies": []}]}, {"body": "Tsla making insurance as a profit center? Lmao. Margins are paper thin in insurance and tsla is hideously managed.", "score": 1, "replies": [{"body": "You have no idea what you are talking about.", "score": 4, "replies": []}]}]}, {"body": "What the fuck are shares", "score": 12, "replies": [{"body": "It’s these things that you build out of popsicle sticks like a house of cards and if you collect all ten matching sticks for one company they send you a pony with a key inside. When the horse dies or if you just .. well anyway the key opens a safety deposit box that could or could not be holding any tendies (rare form of substandard substance) .... Hence why it’s called a share .. duh", "score": 4, "replies": []}]}, {"body": "I’m at 410 shares down from 470. Been selling 20 shares every 5% gain from least consecutive sell... collect profit when you can... it won’t go up forever. But back shares if it falls.", "score": 3, "replies": [{"body": "I think it could rally in a few weeks with earnings and other announcements. Might be a wise time to punch", "score": 1, "replies": []}]}, {"body": "I think Tesla has become such a big company now with so much innovation that it's only a matter of time before the stock will do really well. Having said that, I think it's a good stock to play options with because of how volatile it is, people just don't know how long it will take them be adopted by the mass, so they like to make waves out of the stock. Until you see Tesla charging stations at gas stations, investing will be the slower way to make money, but a safer way for sure.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Fool me once, shame on you, fool me twice...a fool can’t get fooled again.", "score": 2, "replies": []}, {"body": "Honestly no one can say anything against that haha", "score": 1, "replies": []}]}, {"body": "So your not exiting at break-even if you get the chance?", "score": 1, "replies": [{"body": "Held this long. I’m looking for a 10% return", "score": 3, "replies": []}]}, {"body": "Oh you poor bastard.\n\nTSLA is systemically fucked. The company has massive issues. It is only over $100 because of the cult of musk.", "score": -3, "replies": [{"body": "Lol", "score": 5, "replies": [{"body": "heh", "score": 1, "replies": []}]}, {"body": "No comment.", "score": 1, "replies": []}]}]}, {"body": "I'm not a big trader, but I love this subreddit.  I got in on Tesla around 192, and just sold my 22 shares today. It did me well. I hope your right, but I also want it to crash below 200 again so I can put even more into it. Good luck. I think it's worth north of 300.", "score": 24, "replies": [{"body": "Gratz on the gain! \n\n...ya, today I was thinking about selling off my 250s and taking the gain, but idk just got a feeling... so instead up upleveraged", "score": 8, "replies": [{"body": "Fuck your feelings.  Bird in hand mofo.  At least take some off the table.", "score": 1, "replies": []}]}, {"body": "I think it is worth south of $100.", "score": 3, "replies": [{"body": "For sure it is somewhere northeast of 0 and 420", "score": 2, "replies": []}]}]}, {"body": "I’m holding shares. Wanted to sell today, but actually changed my mind, will wait longer. I believe Tesla has room to grow", "score": 8, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "If there is one thing that I have learned, its that giving a single fuck about general market trends and Trump none-sense is counterproductive to trading Tesla.   idk I get that there is irony is stopping listening to all the clamor about the market crashing, because it will inevitably... just tired of it all.", "score": 10, "replies": []}]}, {"body": "I should have bought some calls as soon as Porsche released the numbers on their pathetic attempt at an electric car", "score": 6, "replies": []}, {"body": "Let’s hope so, I’m still waiting for my shares I bought at $292 to recover", "score": 11, "replies": [{"body": "F", "score": 15, "replies": []}, {"body": "Sell covered calls if you can.", "score": 3, "replies": []}, {"body": "I would feel confident in your shoes.", "score": 2, "replies": []}]}, {"body": "In Nevada...   \n\n\nTesla is considering building housing out near the Gigafactory here. They want to charge employees a discounted rate. They are adding \\~50-100 new employees every 2 weeks causing the market here in NorNev to be just stupid.. Rent's have risen by 50% here in the last 2 years. If they get approval from the county board on this thing.. it could be huge.   \n\n\nThe housing market in Nor Nev is 98% capacity atm.", "score": 8, "replies": [{"body": "NorNev? I lived there for five years. Who the fuck says NorNev?", "score": 5, "replies": [{"body": "autists like me who just moved here?", "score": 5, "replies": [{"body": "Fair enough. Please stop. It's absolutely fucking terrible.", "score": 11, "replies": [{"body": "Nevada is already a shithole so eh", "score": 1, "replies": []}]}]}]}, {"body": "That's because northern nevada is a fucking barren desert with nothing there. It's at housing capacity because there is no housing because nobody wants to be there.", "score": -1, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3AYOLO). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "WTF is VTI doing in a WSB screenshot?", "score": 3, "replies": [{"body": "> WTF is VTI doing in a WSB screenshot?\n\nOP is only half retard. He joined WSB so that he can go full retard.", "score": 4, "replies": []}, {"body": "I may or may not keep my money in VTI when I do not have an active option play (ie kinda like holding cash, but still with a spritz of fomo)", "score": 1, "replies": []}]}, {"body": "I was just thinking about this today without any DD, just based on the trend itself. I don't know about $300, but I'm definitely interested in some of them $280c for November.", "score": 3, "replies": []}, {"body": "X looks like a fat Prius and 3 looks like a Honda Accord. Change my mind.", "score": 8, "replies": []}, {"body": "Your calls are doing well. Sell now before the actual data comes out and is underwhelming as it always is", "score": 2, "replies": []}, {"body": "Am I the only one who is finding the model S design tired and overdue for a refresh? It’s dragging down the model 3 I think, as I’m tired of looking at that thing as well. \n\nI like Tesla, but their cars need a redesign and I don’t see Elon having the capital to get that done anytime soon.", "score": 3, "replies": [{"body": "Seriously? I think the Model S is beautiful, but the X, 3, and Y are kinda ugly in my opinion. \n\nA used S is an incredible value right now in my book.", "score": 5, "replies": [{"body": "Until something goes wrong with it.", "score": -1, "replies": []}]}, {"body": "they are pushing out a S refresh, not sure of the timeline but design released sometime this year", "score": 4, "replies": [{"body": "He said on Twitter there is no refresh planned for S\nThey have Raven coming which they are using now for track times", "score": 3, "replies": []}]}, {"body": "It’s ancient.\n\nReal ballas (not me) are going to wait for their taycan.", "score": 3, "replies": []}]}, {"body": "Remind me! 40 days", "score": 1, "replies": []}, {"body": "On the technical side it's completely possible too. We might get a market crash someday too (autumn is the season).", "score": 1, "replies": []}, {"body": "If you actually think you know where and when this is going you're probably wrong, but yes definitely", "score": 1, "replies": []}, {"body": "Stock will get hammered on earnings.  Selling into the rally is by far the most prudent move", "score": 1, "replies": []}, {"body": "The 9/13 $250 call made me over 1000% tendies yesterday for a causal day trade. This is my DD for supporting this thread idea", "score": 1, "replies": []}, {"body": "Elon challenged to race the Model S against the Porsche Taycan on the Nurburgring. If Tesla wins then it will moon.", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3AYOLO). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Tesla to the moon lets go I'm with you ! this week should be a good week !", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3Ayolo&restrict_sr=on&t=da). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "FFFFFFFFF", "score": 1, "replies": [{"body": "F indeed.  Alas, I did not have the hands I needed for this one.", "score": 1, "replies": []}]}, {"body": "I hate TSLA!  :)\n\nScalp traded it today and only got out with peanuts. \n\nIt could have been a +13k profit trade...(+500% profit)", "score": 1, "replies": [{"body": "lmao, I lose money or break even almost every time I try to day trade it, but ops with some time on them seem to do me pretty well.", "score": 1, "replies": []}]}, {"body": "OP is one musky toke tweet from ruin.", "score": 1, "replies": []}, {"body": "puts it is", "score": 1, "replies": []}, {"body": "I mean it's up today but I doubt its a solid trend that'll hold. Even if it gets back to 300, it's not staying there. We gotta wait for Elon to hit up some random ass youtuber and watch the price drop.", "score": 1, "replies": []}, {"body": "I m speculating Apple will buy 50% of Tesla AV taxi business", "score": 1, "replies": []}, {"body": "Still waiting for that Saudi buyout", "score": 0, "replies": [{"body": "Still waiting fo a “Tesla killer”", "score": 10, "replies": [{"body": "Go read the reviews on the Porsche. Now we see what a real car company can make when it makes an EV.", "score": -7, "replies": [{"body": "Totally yes, I think that I would also spend an extra 70 k on a car just because it’s Porsche, gtfo of here, this thing isn’t a Tesla killer", "score": 5, "replies": [{"body": "Taycan is absolutely a competitor to the model S. And it's a far superior car. More money, so what, that doesn't preclude tesla killer status.", "score": -1, "replies": [{"body": "The Taycan will have a $151,000 *starting* price. That's not competing with the Model S. It's literally TWICE the price of the entry-level Model S.", "score": 8, "replies": [{"body": "Ssshhhh facts aren’t accepted in the TSLAQ community", "score": 4, "replies": [{"body": "Here's a fact.\n\n0%.\n50%\n\nOne of them is TSLA's gain in the past five years, one of them is the S&P 500.\n\nbtw musk literally asked for these two cars to compete at the ring, so you mustn't argue with your prophet. He thinks they are competitors.", "score": 0, "replies": [{"body": "Bro, you realize that you're making an argument to invest in TSLA right? 5 years ago TSLA had a concept and low volume luxury brand. Compare that to what they are today and you'll see how jaded the market has become on pricing this company. I'm positive this company is going to reach critical mass in the next year or two. You'll look back and think about missing a once in a lifetime opportunity.", "score": 3, "replies": []}, {"body": "Just wait, i will remember this conversation when Tesla is profitable af and I will remind you that you thought Tesla was fail", "score": 1, "replies": []}]}]}, {"body": "How much is the most expensive model s?", "score": 1, "replies": [{"body": "Most expensive performance S is 99k right now. Taycan Turbo S is 184k....\n\nIt's competing but not really", "score": 3, "replies": []}, {"body": "Less than $110,000 if I recall correctly.", "score": 1, "replies": []}]}]}]}]}, {"body": "Were you dropped on the head repeatedly?", "score": 3, "replies": [{"body": "I forgive you.\n\nMost of your posts are in the tesla investors club. It must be truly agonizing to be at the same point now that TSLA was five years ago, while lay people who can't even remember the password to their 401k account are up 50% in their S&P index funds.", "score": -4, "replies": [{"body": "How come you think I hold a position for 5 years? I am up quite a bit, at a much higher rate yearly than the S&P500. Not that it matters in the short term, just saying. \n\nHow does it feel to be so angry at everything and kicking things just because you can't help yourself?", "score": 1, "replies": [{"body": "> How does it feel to be so angry at everything and kicking things just because you can't help yourself?\n\nIronic.", "score": -1, "replies": [{"body": "I don't think you know what that word means.", "score": 3, "replies": [{"body": "Really, that's what you come back with? Are you even legal drinking age yet?", "score": -1, "replies": [{"body": "You should google it.", "score": 2, "replies": [{"body": "The Porsche is 50% more expensive than the Model S that i competes against with worse stats. I'm pretty sure that's base price, so you'll likely come close to paying double the price.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "$200,000. Lol", "score": 2, "replies": []}, {"body": "C'mon, the taycan is a beautiful car sure, but it plays in a different price range and isn't really comparable...", "score": 1, "replies": []}]}]}]}, {"body": "Bro, they are selling the same amount of cars as last quarter at a lower price and a worse mix. This will run up into ER and completely tank. That's if SolarCity doesn't tank them first", "score": -2, "replies": []}]}
