{"title": "$TSLA Daily Investor Discussion - September 09, 2019", "selftext": "AutoModerator appears to be MIA...", "id": "d1phxs", "created_utc": 1568027729.0, "score": 19, "upvote_ratio": 0.95, "num_comments": 91, "comments": [{"body": "once again, Norwegian data from today is showing that the LR AWD Model 3 is being delivered more than the SR+ _at the moment_\n\nyou can check individual numbers of each day here: https://teslastats.no/\n\nor you can get more of an aggregated view here: \nhttps://eu-evs.com/\n\nOn eu-evs, you can see that the LR AWD bounce back is also starting to happen in the Netherlands.  The effect is currently more outspoken in Norway though but it'll be interesting to see how this plays our for the rest of the month.  Edit: same effect can also be observed in Spain btw.\n\nShould be pretty good news for ASP's this quarter.", "score": 18, "replies": [{"body": "Last quarter 83.84% of all Model 3s delivered in Norway, the Netherlands and Spain were LR AWD, while 9.22% were performance models.  So far this quarter 45.37% have been LR AWD and 4.63% have been performance.  While these numbers are not as bad as the August figures, going from a product mix that was ~15% RWD to ~50% RWD won't be \"good news\" for ASPs.", "score": -4, "replies": [{"body": "Yeah well, that percentage appears to be changing on a day-to-day basis.  Neither you nor I will know where we'll end up at the end of the month.  But the odds are pointing towards it not being as bad as the picture some bears were trying to paint up until last week.", "score": 3, "replies": [{"body": "Not as bad /= good.", "score": -4, "replies": [{"body": "Still better than the dramatic picture some people have been trying to paint 🤷‍♂️", "score": 2, "replies": []}]}]}]}]}, {"body": "Anyone notice how when Tesla stock is up, the FUD becomes more intense? If you google \"Tesla Stock\" right now the only headline articles I saw were negative. Nothing about the china Gigafactory, European sales, Elon meeting with transportation minister in china, etc.", "score": 17, "replies": [{"body": "Yeah, headlines were both aggressive and comically specious this morning. A Forbes headline was just \"Tesla breaks yet another promise\" ... Yeah, as if I'll click on a no-substance headline like that...", "score": 5, "replies": [{"body": "TipRanks for the article writer aint so hot: https://www.tipranks.com/bloggers/david-trainer", "score": 2, "replies": [{"body": "Yeah he's just another guy that somehow makes a living spraying bad opinions everywhere. The whole business of catering to the retail investor for subscription money or clicks is scammy and unprofessional. Plus I know this guy from NFLX where he has perpetually had a sell rating forever (the stock is 6x higher than his first sell rec).", "score": 1, "replies": []}, {"body": "Nice find :)", "score": 1, "replies": []}]}]}, {"body": "I’m so mixed on it. On the one side I hate it. On the other, I’m so happy my average cost basis is like 230 or less", "score": 4, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "The thing is, that while a lot of people might know these articles are BS the person it happens to be working against quite effectively is Elon.  A lot of my friends have very negative views on Elon - they wouldn't be able to tell you why outside of maybe Thai diver incident or the funding secured tweet - most just have a general dislike of this person who is attempting to do meaningful change in stagnant industries.   Even when they praise him they say something like \"Even though he's a bad guy, Elon Musk is a good example of someone who is trying to disrupt that space\".  It's annoying as they don't know a thing about him.  The smear campaign against Tesla isn't working here in California, but the smear campaign against Elon definitely is.  It's very annoying since the two are so intertwined.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I would say the people I’m referring to are Gen X and Millennials but on the older spectrum of the millennial range.  I don’t know what to say, I have a lot of people saying things to the tune of “Elon Musk is a con man” and when I point out everything he’s accomplished they don’t want to hear it - the crazy part is a lot of these people are super liberal types.", "score": 3, "replies": []}]}]}, {"body": "Yeah true, at the last investors conference a man asked Elon about what to do about FUD and he was at a loss for words. I think you’re right though that most people know by know that it’s exaggerated. (Also the Chinese don’t get US press so that means no FUD for them?)", "score": 1, "replies": []}]}]}, {"body": "Any reason why TSLA is going so well today (so far)?", "score": 15, "replies": [{"body": "Pick-up announcement date for November?", "score": 8, "replies": []}, {"body": "My theory is a combination of the following setting into investors minds over the weekend and now being priced in:\n\n1) $TSLA shares are stupidly underpriced as it is \n2) Million-mile-battery news\n3) Underwhelming Tycan launch. Still no legit direct competitor. \n4) Chinese Tax Break and manufacturing kickoff \n5) Insurance program kickoff \n6) Sales going well in a number of new countries \n7) Elon has been pretty chill and not giving the shorts much ammo\n\nThus: accumulation", "score": 24, "replies": [{"body": "Why would you conclude these shares are “stupidly” underpriced?", "score": 1, "replies": []}]}, {"body": "It's undervalued. Slow correction in progress.", "score": 11, "replies": []}, {"body": "Seconded - I cant find any news that would seem to warrant this much of a move upward?", "score": 5, "replies": [{"body": "Could just be a run-up towards delivery/production numbers being release in a month.  We usually see the stock going upwards in the weeks before the end of a quarter", "score": 5, "replies": []}, {"body": "Million mile battery details, that's HUGE, should cost oil reserve companies to lose 20% of their reserve value on the news. Elon Musk hinted this battery a few times in the past, shorts thought that's just BS. They are wrong. Tesla is definitely planning to reach 2TWh battery. It implies $5000 share price is still possible.\n\nPickup Truck news. Although BI tries to spin this as a delay, it's not. The firm date was never announced, now it seems imminent.\n\nSales, it seems Q3 demand is secured, even Q4 is secured.\n\nGF3 expansion seems started. This is huge, because this indicates Tesla sees strong sustained demand. Think about it, without demand info, Tesla would wait after phase one ramp before looking into phase 2.\n\nThere are tons of potential reasons, in the end stocks move randomly, better to do long term approach.\n\nShorts are wrong on this stock from long term view. What longs need to do is to save cash and slowly add shares. I don't think shorts want to get out now, and I don't shorts will be able to get out in the future. All Tesla need to do is keep giving bad news, forces shorts to stay short. Slowly cook the frogs.", "score": 5, "replies": []}, {"body": "Heh...maybe Iceland ordering opened!", "score": 1, "replies": []}]}, {"body": "The battery longevity news from this weekend maybe?", "score": 2, "replies": []}]}, {"body": " [https://docs.google.com/spreadsheets/d/10Uh\\_GSkShwPPlrE5mOJcrkZ-T3NmLkLnTo6xqbdtaOI/htmlview](https://docs.google.com/spreadsheets/d/10Uh_GSkShwPPlrE5mOJcrkZ-T3NmLkLnTo6xqbdtaOI/htmlview) \n\nShip on phili port is loading. If everything works out, there will be totally 13 ships during Q3. If tesla manage 25000+ delivery Sep in NA, total delivery number probably going to be around 101000-105000", "score": 15, "replies": []}, {"body": "[BMW & Co Are Losing Their Allure, and That’s Got Germany Worried](https://www.bloomberg.com/news/articles/2019-09-09/bmw-co-are-losing-their-allure-and-that-s-got-germany-worried)", "score": 14, "replies": [{"body": "I love my Audis. And though I still maintain the interiors are better on most of the German premium vehicles, test-driving a Tesla was kind of a come-to-Jesus moment for me, which forced me to examine what really matters in an automobile. \n\nNow I’m asking myself, “How could anyone who can afford a Tesla, and cares about price-to-performance metrics, seriously consider anything else?” ICE cars suddenly seem like slow, stupid relics of an earlier era of human civilization. Soon they’ll be “so retro.”", "score": 31, "replies": [{"body": "Right?! I mean when the iPhone came out you could have looked at it and say:\n\n\\- waaaay too expensive in order to win over significant market share\n\n\\- ridiculously short battery life compared to a nokia or blackberry\n\n\\- too big to fit in your pocket compared to a nokia\n\n\\- screen breaks easily when dropped\n\n\\- worse readability in direct sunlight compared to nokia phones\n\n\\- no physical keyboard makes typing whout looking impossible\n\nbut once you had an iPhone for about a week you could not imagine to go back", "score": 12, "replies": []}]}, {"body": "Wonder if they are kicking themselves not taking Tesla seriously 10 years ago.", "score": 12, "replies": [{"body": "I bet the $50 billion in profits they have made over that decade is a decent consolation.", "score": 2, "replies": [{"body": "Since you like to worry about Tesla's debt so much, what is your professional opinion on VW's 200 billion debt?\n\nI'm sure you've already read it, but just in case, here it is again: https://www.bloomberg.com/opinion/articles/2018-12-24/volkswagen-is-the-debt-market-s-200-billion-gorilla", "score": 1, "replies": [{"body": "I don't see how that is at all related?  But since you asked, VW's total liabilities divided by total equity is 3.09x; Tesla's ratio is 4.33x.  VW's operating income divided by interest expense last quarter was 11.9x; Tesla's ratio was __-__0.26x.  So yes, VW has a lot of debt, but that is not really concerning since they have even more assets and generates a ton of operating profit to service that debt.  Tesla has more debt on a relative basis but doesn't make operating profits to service it.\n\nEdit: The debt situation at some other OEMs is a bit more concerning than VW.", "score": 5, "replies": [{"body": "Care to go into more detail on those other OEMs?", "score": 1, "replies": [{"body": "Ford's total liabilities / equity is 6.26x.  They are obviously a lot more profitable than Tesla, but their reliance on F-series sales in the US plus their leverage does not paint a pretty picture.  \n\nI don't think Tesla is a real threat to them, but RAM is depressing their sales right now.", "score": 2, "replies": []}]}, {"body": "You assume VW will continue to sell 10\\~11 million ICE vehicles a year with healthy margin?\n\nI think switching to EV will be at such a speed that ICE will become a money losing industry. Then suddenly VW's debt becomes a problem.", "score": 1, "replies": [{"body": "You assume VW isn't going to sell more EVs than Tesla in the next few years.  Tesla doesn't have nearly the financial resources necessary to keep up with VW's expansion, because they lose money while VW can reinvest the billions it earns on its legacy business.", "score": 1, "replies": [{"body": "If I were VW CEO, I would be worried. I know he is worried. I don't understand why some people think it's easy to compete with Tesla, very little chance. \n\nThey plan to take the EV market that Tesla is not covering. VW would have to compete with Chinese EV brands, that's not going to be easy.", "score": 1, "replies": [{"body": "> If I were VW CEO, I would be worried. I know he is worried. I don't understand why some people think it's easy to compete with Tesla, very little chance.\n\nThe E-Tron is selling fine, and has been crushing Model X sales in Europe this year.  They just announced the ID.3 which has more range than than the Model 3 and costs about $10k less.  VW's profitability will take a hit as they are forced to shift to EVs, but they aren't going to have trouble pushing sales.  \n\n> They plan to take the EV market that Tesla is not covering.\n\nTo me it seems the E-Tron is aimed at the Model X, the Taycan is aimed at the Model S, the ID.3 is aimed at the Model 3 and the ID Crozz (or whatever they actually call it) will be aimed at the Model Y.  I agree they are not pushing US sales heavily now, but that is driven by the regulatory environment.  \n\n> VW would have to compete with Chinese EV brands, that's not going to be easy.\n\nSo will Tesla....", "score": 1, "replies": [{"body": ">They just announced the ID.3 which has more range than than the Model 3 and costs about $10k less.\n\nThe cheapest ID.3 will be 30k Euro. About 33k dollars. If this is the version you are referring to, it has WLTP range 205, I would be surprised if they can reach EPA 180 miles. Model 3 SR+ has 30% more range.\n\nModel 3 SR+ with a 50 kWh battery has better highway range than the most expensive version of the ID.3 with a 77 kWh battery. There is major technology gap between the two.", "score": 1, "replies": [{"body": "The launch ID.3 has a WLTP range of 420 kms, while the SR+ only has a WLTP range of 409 kms (per Tesla's website).\n\nAs for pricing, the launch version will be under 40k euros.  The SR+ price varies quite a bit in Europe, I was looking at the Netherlands where it costs 48,980 euros.  However, I see that in some jurisdictions it is only a few thousand euros more than the ID.3.", "score": 1, "replies": [{"body": "If hou happen to mean Norway: they don’t require VAT on EVs and I think they don’t have tariffs either. Not entirely sure about the tariffs but Norway is not a member of the EU so I think they can go their own way there. In any case, not having VAT on EVs makes them far cheaper over there than in the rest of Europe.", "score": 1, "replies": [{"body": "Even within the rest of Europe the SR+ pricing varies quite a bit.  In Italy it is 48,500, in France it is 42,600....", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Doubtful. I don't have charts on hand, but I wouldn't be surprised if consumers are just buying foreign ICEs.", "score": -6, "replies": []}]}, {"body": "This trend will continue", "score": 9, "replies": []}]}, {"body": "Bjorn did a new range test on the EQC (this time, it didn't have a faulty battery module).  It actually did better than the e-tron and i-pace, while being cheaper than both of them.  It's not gonna be as fast to charge as the e-tron but efficiency wise, you get more range for less money.\n\nQuick screenie of the EQC vs e-tron and i-pace numbers: https://imgur.com/a/reUjTw0\n\nVideo can be found here: https://youtu.be/zuPjYEh9VXU", "score": 9, "replies": [{"body": "420 range secured.", "score": 6, "replies": [{"body": "It certainly is a magic number...", "score": 1, "replies": []}]}, {"body": "Was there a build-quality problem with the battery module on the EQC?", "score": 2, "replies": [{"body": "Bjorn always uses press-cars for his tests... the previous press-car he got from Mercedes ended up having a defective battery module.  I'm gonna assume it's just a case of bad luck, but I agree it's certainly not a good look.  I would assume press cars have gotten extra QC to make sure a stupid mistake or problem doesn't cause a youtube review to go viral.  That didn't happen in this cause though.  His range test had to be aborted prematurely, and that's about it.  I didn't see a single article about so clearly nobody cared.\n\nHaving said that.... I am pretty sure that if a similar thing would've happened during the rollout of a new Tesla model, it would've blown up into a huge story ;)", "score": 6, "replies": [{"body": "Press cars are a bit of a double edged sword, they generally represent the best the car can get, but they're also driven much harder than a car would normally be.", "score": 1, "replies": []}]}]}, {"body": "Looks good. I would definitely take one of these over an IPace or E-tron and probably a Model X if I am being honest. \n\nPrices starts at £65k here in the UK. For comparison a Model X starts at £82k although you do get substantially more range and performance for the extra money plus the option of more than 5 seats.", "score": 4, "replies": [{"body": "It does look good.. so far, the only legit criticism I've seen/read about it is the fact that the central display is just slightly out of the average person's arm-reach.  \n\nMaybe the charging speed thing will be a valid point of concern, but I'm looking forward to the next video about that.  Regardless, that's an issue that bothers you only during the vacations where you take your car or if you're frequently doing roadtrips.  Those are really the only times where the practical rate of fast charging will have an impact on you and it doesn't really have an impact if it's your daily driver where you're probably not doing 200 miles a day.", "score": 3, "replies": [{"body": "I've got long arms like a monkey so the display shouldn't be a problem for me. Looks like Bjorn has posted the charge speed video. 45 minutes from 10-90% on an Ionity charger which is ok. \n\nhttps://youtu.be/q19kSp7kwhI", "score": 2, "replies": []}]}]}]}, {"body": "VW ID3 will be getting 3 battery sizes, 45kWh, 58kWh, and 77kWh, the 58kWh and 77kWh cars rated at more or less the same range as the SR+ and LR Model 3 WLTP ranges (ID3 330km/420km/550km, Model 3 410km/560km). \n\nThe short range car starts at €30k, pricing doesn't seem to be announced yet for the bigger battery cars.\n\nNote this car in particular is important to VW not because of the car itself, but because it's the first car on their new MEB platform, which will be the basis for their other electric cars, like the upcoming ID Cross and Q4 e-Tron.", "score": 10, "replies": [{"body": "It is actually a nice looking car with a decent pricing, my guess it would be more popular than Model 3 in Europe. They love hatchbags, and they dig the Golf design. Competition is finally coming! \n\nWell, unless they repeat the Taycan storyline with overpricing and spec underdelivery.", "score": 8, "replies": []}, {"body": "Also a Summer 2020 target for deliveries for I believe just Europe. This should be a pretty important launch for the category of electric vehicles. I'm really disappointed in the rate of adoption in the US at least where Tesla is pretty much the only source of growth (and even that's no longer true Y/Y). The effort of other manufacturers to compete will create a lot of press coverage and a sense of inevitability that might currently be lacking for this segment.", "score": 8, "replies": [{"body": ">Also a Summer 2020 target for deliveries for I believe just Europe.\n\nShould be noted their will be no US launch at all, the US is getting the ID Cross instead.\n\n(VW has already pulled most versions of the Golf out of the US)", "score": 4, "replies": []}, {"body": "EV adoption rate is almost entirely a function of regulation and incentives.  Selling EVs isn't profitable, so other OEMs only sell them in jurisdictions where the regulatory environment makes it attractive or necessary.  Why bother trying to compete with Tesla in the US?  To see who can lose the most money?", "score": 1, "replies": [{"body": "That's a pretty simplified model of reality. EV adoption is related to a lot of things, the historically higher price is one of them as is charging infrastructure, awareness of the tech and pros and cons, limited choices and so forth.\nComplex entities don't just decide 'now the business is ready for easy profits', they have to dig in and learn how to create that business and win consumer mindshare. Surviving disruption is hard and not cheap. The myopia you promote here leaves them perpetually behind. Sure they have a little extra cash on hand by not playing in the early game, but not enough to make that the smart decision. Most of these companies that have been sitting on their thumbs will regret it.\nBut part of being a Tesla bear is this assumption that Tesla's products will be easily matched by the 'big boys'. That's fine. Ends up an empirical question.", "score": 1, "replies": [{"body": "Selling EVs is not profitable; the only thing other OEMs are \"falling behind\" on is losing money.  There is a reason EV sales in the US are stagnant while they are accelerating in Europe and China.  If you strip Tesla out of the sales data the driving force behind EVs becomes crystal clear.", "score": 1, "replies": []}]}]}]}, {"body": "What's with the 'up to XXX miles' stuff. I betcha these ranges aren't close to real world. The car is actually heavier than the model 3 and has worse cd and likely has a less efficient powertrain (although maybe lower horsepower helps).", "score": 3, "replies": [{"body": "They claim the ranges are under WLTP testing, which is the same as Tesla's reported figures....", "score": 1, "replies": []}]}]}, {"body": "Weapons that incumbents and fossil fuel industry are using to slowdown Tesla:\n\n* Mainstream media FUD. They love their advertisement money from ICE vehicle makers.\n* State level lobbyists to legislate against Tesla \n* Short sellers to keep the stock price down to slow down the capital raises\n* Social media trolls to diminish the brand and scare the consumers away \n\nWeapons Tesla have to fight the above:\n\n* Satisfied customers \n* Social media activists to debunk the FUD and educate people", "score": 14, "replies": []}, {"body": "Plans for another assembly line in Fremont? a GA5:  [https://finance.yahoo.com/news/tesla-permit-application-hints-another-225110397.html](https://finance.yahoo.com/news/tesla-permit-application-hints-another-225110397.html) \n\nScreenshot of permit:  [https://teslamotorsclub.com/tmc/attachments/upload\\_2019-9-5\\_22-16-4-png.451159/](https://teslamotorsclub.com/tmc/attachments/upload_2019-9-5_22-16-4-png.451159/)", "score": 6, "replies": [{"body": " But Y?", "score": 10, "replies": []}]}, {"body": "Reminder that there are still 40 million shares sold short. 6 days to cover... hasn't been that high all year", "score": 10, "replies": [{"body": "Betting on short squeeze on TSLA will likely cost you money. The chance is very low.\n\nI'm super bullish long term, but short term there are always things that could go wrong and lead to problems. I will sit until it reaches 5 digits.", "score": 6, "replies": [{"body": "Not \"betting\" on anything. A lot of people seem to think short interest is only a useful statistic if you are \"betting\" on the chance the stock will go up 50% in a day as everyone covers. It isn't binary like that. It is still interesting to know, even for a long term investor like me, that the current price is reflective of 40 million shares sold that will need to be bought back in the future. In general, there are a lot of shares the need to be bought as the price goes up, making a drift upwards more likely.", "score": 3, "replies": [{"body": "Lots of people bet with margin or options when they think a short squeeze is in the card. That can hurt them a lot.\n\nIn the long run the company's valuation is determined by it's cashflow. Short shares only increases the volatility. I agree if the shorts try to cover, while a stock swings to it's true value, the covering could help amplify the swing by a lot.", "score": 1, "replies": []}]}]}, {"body": "What happens in 6 days?", "score": 3, "replies": [{"body": "considering the average volume of the stock, that is the time needed to cover all the shorts if they decide to act all at the same time.", "score": 4, "replies": []}, {"body": "Coverage", "score": 2, "replies": [{"body": "For a stock like Tesla, give short at least 3 months to cover.", "score": 1, "replies": []}]}]}]}, {"body": "50 Day MA @ 232.67", "score": 5, "replies": [{"body": "Broke strongly above the 100 day today. After the 50 day, the next MA is the 200 @ 268. 50/100 MACD only recently turned bullish after being negative since the end of July", "score": 5, "replies": []}]}, {"body": "We doing good so far. Please keep up the momentum.", "score": 4, "replies": []}, {"body": "Hmm. Main sub has been having issues with Automod too. Must be a site wide issue...", "score": 2, "replies": [{"body": "A few other subs I follow are also noting that auto mod is MIA.", "score": 1, "replies": []}]}, {"body": "It’s going to fade now, don’t be fooled", "score": 2, "replies": [{"body": "I wish we could give you some kind of official batman flair on this sub.  We probably can, but people are gonna have to tell me how :p", "score": 10, "replies": [{"body": "I don't get the joke :-/", "score": 2, "replies": [{"body": "That's good though, as soon as everyone's in on it, it reverses the effect", "score": 3, "replies": [{"body": "Power hour 🌝 incoming", "score": 1, "replies": []}]}]}]}, {"body": "Ugh. I’m so mad that this comment is accurate.", "score": 10, "replies": [{"body": "Me too lol", "score": 5, "replies": []}, {"body": "Yeah, I flipped my calls to puts at noon EST, but pussied out shortly after, so back to my calls again, lost the gains I made on the flip, but overall up 4%", "score": 1, "replies": []}]}]}, {"body": "some tweets are saying that Tesla v10 is widely released.", "score": 0, "replies": [{"body": "At most it's a QA release internally.", "score": 5, "replies": []}, {"body": "Got a source? My twitter feed is about as pro-Tesla as it gets, and I didn't see anything about this... even /r/teslamotors doesn't have a thread on this yet", "score": 6, "replies": [{"body": "U can search for “tesla summon”. This feature comes with v10. Musk also said that it could be released this week.", "score": 1, "replies": []}, {"body": "I found that there’s only 1 tweet about that in the past 24 hours. It could be better to see if he/she uploads a video tomorrow. In the meantime, I think we can only say that just more customers join the Early Access Program\nhttps://electrek.co/2019/09/08/tesla-early-access-elon-musk-v10-software/", "score": 1, "replies": []}]}]}]}
