{"title": "Yesterday WishfulTrading made a comment about picking up CMG as a dead cat bounce.  I made a snap comment about stocks dropping 20% in a day never stops there.  Turns out I was both right and wrong.", "selftext": "I went back and did some research.  Using all S&P stocks, with price > $10, there had been 260 cases of 20% 1 day drop in the past 10 years.  Over the next 1, 3 and 6 months, they have moved both higher and lower.  Here are the average return(%):\n\n    1mlow   1mhigh  1mClose 3mlow   3mhigh 1mClose 6mlow   6mhigh  1mClose\n    -15.92  30.18   9.15    -26.39\t44.69   9.44    -33.89  56.82   19.82\n\nHere's the raw data if anyone is interested: http://dropcanvas.com/93sb9\n\nOne observation to make is this includes the drop caused by the Oct 2008 crash, so take it as you will.\n\nEdit: Added close column.\n", "id": "wxhr4", "created_utc": 1342891923.0, "score": 8, "upvote_ratio": 0.79, "num_comments": 20, "comments": [{"body": "[deleted]", "score": 2, "replies": [{"body": "And the username is relevant..", "score": 2, "replies": []}]}, {"body": "But what percentage moved higher/lower?", "score": 1, "replies": [{"body": "Check out the raw data: http://dropcanvas.com/93sb9\n", "score": 1, "replies": [{"body": "I don't really feel like figuring it out.  Just seems like its more interesting to know if there is a bias as opposed to a bunch of means.  These numbers don't really tell me anything.  Your original post was that when things go down 20% they continue.  But this data summarized this way doesn't really tell the story either way.\n\nEDIT: So I did look at the data.  Two things I wouldn't do if I were you.  1) I wouldn't take percents and multiple them by 100.  You would be better off formatting the cells as percents and setting an accuracy point.  For something simple like this it doesn't matter but as your add more calculations you will be constantly converting *100 and /100.  Also for the love of god =AVERAGE()  The fact that you calculated you average by SUM()/260 is crazy.  That's just looking to make a mistake.  Sorry if that seems nitpicky, just trying to be helpful.  Consistency in spreadsheets is important and a habit developed over time.", "score": 1, "replies": []}]}]}, {"body": "What is the 1-3-6 month returns though? high/lows are pretty useless...\n\nAlso does this include delisted stocks? I imagine that when dealing with 20% 1-day drops survivorship bias can be a very serious issue.", "score": 1, "replies": [{"body": "Not include delisted stock since I don't have that information.  It's a valid concern though.  I added close information for your viewing pleasure.  The returns are positive.\n", "score": 1, "replies": []}]}, {"body": "Wow, great job! Where did you get all of that data?", "score": 1, "replies": [{"body": "Yahoo finance.\n", "score": 1, "replies": []}]}, {"body": "Okay, even though I said I didn't wanna figure it out.  Your question interested me.  So I tried to look at your data and I couldn't draw any meaningful conclusions from it.  That doesn't mean there aren't but I didn't see any.  So how I interpret your question is, \"In the event of a 20% drop, should we expect a positive bounce, and to what magnitude?\"\n\nQuickly looking at your sheet it appeared that AIG had a lot of volatility so it was a prime candidate.  I sampled 9/2/2008 to the last trading day, on a daily basis.  I choose this date because it removed a lot of the run down to government take over, but there is still some bias.\n\nSo looking at the daily returns there were 15 such days.  I then looked at 3 things.  What was the average of the next day return, the next 10 days returns, and what percent was the next day positive.  1 day returns averaged 1.79%, 10 days, 1.22% and the next day after a -20% move were positive 60% of the time.\n\nNow obviously this is only AIG, this sort of analysis would need to be done on say, all the S&P.  But that is how I would address your question.  I hope you find this helpful.\n\nhttp://dropcanvas.com/8v9l1", "score": 1, "replies": [{"body": "Interesting way to look at it.  Here's the result for all S&P: http://dropcanvas.com/dwdmk\n\nLooks like AIG was pretty representative.\n\n1 day avg return is 3.1%, up 57% of the time.\n10 day avg return is 6.3%, up 60% of the time.\n", "score": 1, "replies": [{"body": "how did you export just those returns?", "score": 1, "replies": [{"body": "What do you mean?\n", "score": 1, "replies": [{"body": "your sheet has 1day return and 10day return as a column.  how did you directly export that from yahoo?", "score": 1, "replies": [{"body": "I didn't.  The excel sheet is the result of my program.\n", "score": 1, "replies": [{"body": "ah. good I was like holy hell I've wasted a lot of time sussing out data from yahoo if I can just create variables and directly export.\n\nwhat program you using?", "score": 1, "replies": [{"body": "Just something I wrote to look into this problem.\n", "score": 1, "replies": [{"body": "Very cool!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Good stuff econleech, thanks for the followup. I was going to respond to your comment yesterday but I didn't have the time to actually do the research myself.", "score": 1, "replies": []}, {"body": "This is surprising and interesting.  I would've guessed they keep dropping after a big 1 day selloff like this as well, in the short term.  The 1m close is the most surprising figure to me.", "score": 1, "replies": [{"body": "Yup, I was surprised as well.  Even though most of them do drop a little more, they mostly bounce back pretty nicely.  CMG dropped more today, perhaps I should buy some :)\n", "score": 1, "replies": []}]}]}
