{"title": "DOW plunges 1.55%. Are we in the bear market?", "selftext": "Guys, what's going on on the market? I though after FED's decision  we're supposed to see the opposite result. How can you explain it? How far may DOW plunge to the end of the year?", "id": "3lykhg", "created_utc": 1442942985.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Of course, it is not. But if you look at DJIA you will see that it is down more than 10% wise from 2015 highs ", "score": -1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "and by the time people get that confirmation, they have lost 20% of their money.  Honestly,  who the hell came up with such an arbitrary percent value and apply it to something as volatile as a real bear market.", "score": 0, "replies": []}]}]}]}, {"body": "I remember when Companies began to move Operations to other Countries people crying out \"When we have no jobs who will buy your Products?\" \nThey were right,we have arrived at that point.", "score": 1, "replies": [{"body": "Source for this conclusion?", "score": 2, "replies": [{"body": "Am unemployed", "score": 1, "replies": []}]}]}, {"body": "I bet you watch Jim Kramer.  \"SELL SELL SELL\"", "score": 1, "replies": []}, {"body": "I would hardly call 1.55% a \"plunge\"\n\nSo, in short: No, no we're not.", "score": 0, "replies": []}, {"body": "didnt it go up yesterday by a high percent? its the flux", "score": 0, "replies": []}, {"body": "If you bet the Colts last night you'd be down 100%. A -1.55% day is nothing in the market. Can't be positive every day of the year, people still reacting to the news.", "score": 0, "replies": []}, {"body": "$DJIA shorts getting ready to cover tomorrow. Epic celebration rally for suprise China beat on pmi. World econmomy is fine", "score": 0, "replies": []}, {"body": "what happened Aug 19th... Hint go look up old fed minutes... ", "score": -1, "replies": []}]}
{"title": "This gentleman buys rights to aids drugs and ups it 5000 percent. Is this better than buying stocks?", "selftext": "Looks like the [unicorn](http://news.yahoo.com/young-gentleman-buys-rights-aids-191020569.html) is for real!", "id": "3lzhp4", "created_utc": 1442956368.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 10, "comments": [{"body": "If you want the entire world to fucking hate you", "score": 5, "replies": [{"body": "he sure did make a killing. 'Merica , land of unregulated capitalism and land of greed. Maybe I should post under /r/americangreed ", "score": -2, "replies": [{"body": "Did he? I don't think he has sold any yet.", "score": 1, "replies": [{"body": "He hasn't", "score": 2, "replies": []}]}]}]}, {"body": "Just on CNBC: will be lowering the price because of public outrage.", "score": 1, "replies": [{"body": "he already made a killing ;)", "score": -2, "replies": []}]}, {"body": "The government will probably introduce legislation to either control the price of drugs or to allow for more competition following this. This was an outrageous abuse of laws with good intentions, and it showed that there are flaws that need to be fixed. ", "score": 1, "replies": [{"body": "I thought this was 'merica - Land of Greed ?", "score": -2, "replies": []}]}, {"body": "He literally did nothing wrong. He took advantage of the situation. It's called business. The outrage on him is stupid. \n\nIt's like blaming the player for abusing a broken game instead of the dev's for fixing the bugged game.", "score": -4, "replies": [{"body": "Yea, this is the \"LAND OF GREED\" , what the fuck is wrong with that????? I'm with TRUMP! YEA!", "score": -1, "replies": []}]}]}
{"title": "Cut losses on AMD or yolo more?", "selftext": "Had a limit buy for 300 at 1.80. Now down to 1.74", "id": "3ly7di", "created_utc": 1442937739.0, "score": 6, "upvote_ratio": 0.87, "num_comments": 11, "comments": [{"body": "Devastating loss bro.", "score": 24, "replies": [{"body": "Like 30 bucks. Do you know how many kids in Africa I could feed with that. \nGod damn inhumane piece of shit", "score": 10, "replies": [{"body": "Answer to your question is if 300 shares are 3 percent or less of your overall portfolio then adding to 5 and eventually 7 percent isn't a terrible idea. If it's any more than that I'd consider selling a portion of it and leave the rest or just hold it all. 30 dollars isn't eve n a loss by African standards.", "score": 2, "replies": [{"body": "Let's be honest, would you rather have thirty bucks or a pack of African kids?", "score": 1, "replies": []}]}]}]}, {"body": ">Had a limit buy for 300 at 1.80. Now down to 1.74\n\nHoly shit sell now before you have to take out a second mortgage to pay for food. ", "score": 7, "replies": []}, {"body": "Cut and short. The only way this is going up is if someone buys them and that's unlikely because of AMD's massive debt.", "score": 2, "replies": []}, {"body": "Commissions are going to ruin you trading that small.  ", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Ah, yes I have. I should move some of my cash over to it.", "score": 1, "replies": [{"body": "Not if you want speed executions and accurate prices buys/sells.", "score": 1, "replies": []}]}]}]}, {"body": "Yolo more. It seems to be a knee-jerk reaction by retail investors. Removing old blood from R&D is not always considered a bad thing. \n\nDisclosure - 115 long @ 1.83 (for about over a month)", "score": 1, "replies": []}, {"body": "go back to r/investing", "score": -1, "replies": []}]}
{"title": "Well boys its been a good run.", "selftext": "[deleted]", "id": "3lya9v", "created_utc": 1442938915.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "Honestly if you can bounce back from a felony you can bounce back from a 13% drop due to a hillary clinton tweet.", "score": 5, "replies": []}, {"body": "Thanks for sharing, this is a great example of why diversification is crucial. Putting 25% of your portfolio in one stock is simply too much. I don't think the lesson learned should be to open a Twitter account or even doing more research. It should be reducing your position size and avoiding concentrated risk.", "score": 2, "replies": []}, {"body": "i lost some money today too I feel like i keep fucking up and get to greedy up 10% then down 5% fuck me ", "score": 2, "replies": []}, {"body": "What felony did you do? If you can't say, was it a white collar felony? (Insider trading etc) or some gangbanger bullshit?", "score": 1, "replies": [{"body": "I used to get hammered on the weekends and talk mad shit to people at the bar and fight them. I blacked out one night and broke a guys jaw, and when the first bouncer tried to break it up, I broke his arm. So no, it wasnt white collar (white collar crimes are not somehow better). I quit drinking after that though, and have been sober over 2 years, and have not gotten into a fist fight since.", "score": 1, "replies": [{"body": "> (white collar crimes are not somehow better\n\nYeah i know that but if you got busted for insider trading/stock pumping etc, mad props from me to you :D. Anyways get well bro. ", "score": 2, "replies": [{"body": "My bad for misinterpreting :) I did meet a guy while locked up who was there for swindling over a million from the company he worked for.", "score": 1, "replies": []}]}, {"body": "Congrats on two years.", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}, {"body": ">and another $5000 of AIG at 5-6$ right after the collapse\n\nThe stock had two different 1/20 splits though, you didnt make shit off AIG.\n\n\n", "score": 1, "replies": []}]}
{"title": "CNAT", "selftext": "Time to sell some AMD and NBG and buy some CNAT\n\nPhase 2 - 9/30\nAnother Phase 2 -12/31\nHeavy $5 and $7.5 call volume\nLow float\nWainwright PT $15\n\nI am long on calls\n\nOnly posting to take credit in a few weeks. And if JBEM picks it, I picked it first. ", "id": "3lybvs", "created_utc": 1442939562.0, "score": 5, "upvote_ratio": 0.85, "num_comments": 10, "comments": [{"body": "I cnat even", "score": 5, "replies": []}, {"body": "1st post ever.", "score": 2, "replies": [{"body": "first time posting for free. up 20% on no news this week. looks like hedges are accumulating. waiting for 100% gains on SP (500% on my calls) before taking credit and starting an email list. ", "score": 1, "replies": []}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/wallstreetbets] [CNAT - positive phase II, halted until 4:30PM. You're welcome.](https://np.reddit.com/r/wallstreetbets/comments/3m3yrw/cnat_positive_phase_ii_halted_until_430pm_youre/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "score": 2, "replies": []}, {"body": "What do the books look like? Float? ", "score": 1, "replies": []}, {"body": "why was it halted?\n", "score": 1, "replies": []}, {"body": "Well fuck. I am out of funds. This is already at $8. Could have been easy money.", "score": 1, "replies": [{"body": "Only if you were shorting.  This sucker is dropping like an anchor.", "score": 1, "replies": []}]}, {"body": "Clearly a pumper, no one would ever sell AMD", "score": 1, "replies": []}, {"body": "good call", "score": 1, "replies": []}]}
