{"title": "Market Rally around the corner", "selftext": "On Sept 24th I was looking for a nice bounce based on the 60 min time frame and the market gave us that and a nice follow through day. But now we have another interesting set up, one that I am calling for a decent rally starting tomorrow. I am not looking to call size but would not be surprised to see a candle that mirrors the one we had on August 26th after the corrective move. \n\nHere are some things to look at:\n\nEnd of the quarter\nEnd of Sept (Historically very bad)\nBeginning of a historically bullish 4th quarter\n\nTime Frames: Daily and 60 minute have cycled down and are both oversold.\n\nNot to forget the Carl Icahn video warning of a market meltdown.\n\nThanks Uncle Carl that just might have been the icing on the cake.\n\nand the biggest factor in my opinion is the amount of bearishness in the markets right now, specifically the amount of chatter from traders and market followers that we are going to take out August 24th lows. This is basically right here now and seems so easy to do...right.  Of course this could play out to the downside but I think to much focus is on that right now  and at one point tomorrow we get the rally and a decent one. This video goes into some stocks to watch also FB, WMT, HP, XOM  and more.\n\nTomorrow should be a fun day to both trade and watch \n\nsee you on the show www.daytradingradio.com\n", "id": "3mw8tm", "created_utc": 1443567768.0, "score": 20, "upvote_ratio": 0.86, "num_comments": 18, "comments": [{"body": "Exactly what I was thinking although I'm a bit more aggressive and sold some puts. We got within 4 points of that August 25th low and rocketed off of it which is a good sign for a rally tomorrow. ", "score": 3, "replies": []}, {"body": "I'm still bearish. I take this from game theory and my conspiracy theory :). Market markets are positive everyone is getting ready to buy and is seeing a golden opportunity. This is great and all- but what if they could get it for lower? They win.", "score": 3, "replies": [{"body": "And what if they realize we all know that and try to reverse reverse reverse reverse psychology us? The cycle is endless. I say BTFD, just be willing to size into positions over time since we may not bounce right away ", "score": 1, "replies": [{"body": "I dont disagree with that :) just want to play devils advocate\n", "score": 1, "replies": []}]}]}, {"body": "Day Trader here. Decided to get out of all my puts after that 3pm break down cha ching. For the past 2 weeks I've had a pretty bearish strategy, but I also have to agree that this market is about to rally big time.\n\nOther Thing to think about, I see this down move as the A portion of the A,B,C Eliott Wave, the B wave is incoming soon. I do still think that on the mid term scale we are still bearish though, atleast until the C wave completes... But for this week and probably next week too, I think this market is about to turn bullish.\n", "score": 3, "replies": []}, {"body": "You're all delusional! Technical analysis is a fantasy!\n\nI only take positions that profit either way the market goes or, importantly, if it stands still.", "score": 2, "replies": [{"body": "So you make money no matter what? You should be a hedge fund manager.", "score": 2, "replies": []}, {"body": "We need you over at /r/wallstreetbets.", "score": 1, "replies": []}]}, {"body": "well u mean bounce, very difficult for it to cross 1900 short term, lets see", "score": 1, "replies": [{"body": "2000 you mean?? cause we cut through 1900 like butter. You could see the shift in buyers on the 60 min stochastics", "score": 1, "replies": [{"body": "just a week away from a 100 plus point move lower", "score": 1, "replies": [{"body": "Maybe.. I like the Spy Puts up here but expecting a further squeeze higher early next week. But either way ready for the next pullback soon. You have an data that backs up your 1 week away call?", "score": 1, "replies": []}]}]}]}, {"body": "Well i could just say  the call worked out perfect and the follow through call worked out too based on technicals, you have to see the true value in the stochastics it has shown most of the reversals over the past 2 years and the way i follow them with the divergence it is naive to discard what works so perfect over most time frames.. ", "score": 1, "replies": []}, {"body": "I think I am going to stay bearish a little longer.", "score": -1, "replies": [{"body": "fwiw.. Still see some upside tomorrow but would look to start hedging with a index short at one point tomorrow", "score": 1, "replies": [{"body": "Touche nice call. I am not understanding the market at the moment, especially with that huge rebound after the job miss. I think I am going to sideline for now, except for a few  specific earnings call trades. ", "score": 0, "replies": []}]}]}, {"body": "Yup. I'm long biotech and bullish in the short term here. Rally incoming imo. \n\nDo your balls hang low do they wobble to and frooooo? ", "score": 0, "replies": []}]}
{"title": "I'm calling it now: reversal.", "selftext": "Asian markets are taking such a huge shit right now that the chi-coms are going to go nucrear with intervention and the Fed is going to announce QE4 within 10 days. \n\nDow 25,000 by EoY. ", "id": "3ms6dd", "created_utc": 1443493007.0, "score": 9, "upvote_ratio": 0.77, "num_comments": 18, "comments": [{"body": "RemindMe! December 31, 2015", "score": 6, "replies": [{"body": "Messaging you on [**2015-12-31 04:05:49 UTC**](http://www.wolframalpha.com/input/?i=2015-12-31 04:05:49 UTC To Local Time) to remind you of [**this.**](https://www.reddit.com/r/wallstreetbets/comments/3ms6dd/im_calling_it_now_reversal/cvhr0uq)\n\n[**CLICK THIS LINK**](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/3ms6dd/im_calling_it_now_reversal/cvhr0uq]%0A%0ARemindMe!  December 31, 2015) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! cvhr16s)\n\n_____\n\n|[^([FAQs])](http://www.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^([Custom])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^([Your Reminders])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^([Feedback])](http://www.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^([Code])](https://github.com/SIlver--/remindmebot-reddit)\n|-|-|-|-|-|", "score": 3, "replies": []}, {"body": "And ouch, 17500", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm actually thinking 2250.  \n\n1. Everyone is shitting themselves over the Chinese economy, but consumer spending is really starting to spin up. \n\n2. 'Murica is probably gonna go to war, which historically means a roid rage for the markets (excepting the whole Iraq 2.0 fiasco) and it'll have a nice secondary effect of increased ME uncertainty which often manifests itself into higher oil prices.\n\n3.  I'm pretty sure Indians are buying a lot of shit\n\n4. Why the fuck not?", "score": 4, "replies": [{"body": "2263 is my January 15 target. Been buying Spy calls for Jan Mar Jun on red days for the last month. Taking profits from shorts and accumulating nothing but SPY and few AAPL chunks. Planning to be 100% SPY and AAPL calls by mid October where I see the rally begin to form once earnings roll in. \n\nIf we get to 2250 by Jan 1, I will be up about $150,00-200,000. If we go beyond between then and March, I'ma make it fuckin rain errday. This is it boys, YOLO to the hilt. Shoulder deep in that ass.", "score": 7, "replies": [{"body": "How's doing?", "score": 1, "replies": []}]}, {"body": "But seriously, when is Indian going to step up its global game? Who else can we count on to drive the next wave? ", "score": 1, "replies": [{"body": "Africa is the next China in my opinion, and I think China has already made some sizable investments in that area so they'll probably reap the benefits big time.", "score": 3, "replies": [{"body": "Who is the next Africa?", "score": 1, "replies": []}]}]}]}, {"body": "You were pretty close, I'm thinking by late Feb we see 2100 then a sharp down turn all the way down. Where it stops? Nobody knows.", "score": 1, "replies": []}]}, {"body": "No way, not in the name of the biggest Yacht in the sea.", "score": 2, "replies": []}, {"body": "[In this thread](http://m.memegen.com/9chjna.jpg)", "score": 2, "replies": []}, {"body": "I'm actually long CHU. RIP.", "score": 1, "replies": []}, {"body": "I see a moderate reversal if any. S&P500 closes this year down 1%. ", "score": 1, "replies": []}, {"body": "buy some /es if youre so confident brah", "score": 1, "replies": []}, {"body": "Dow at 25000 by year end not outside possibility.  However, we could see 15200's first.  ", "score": 1, "replies": [{"body": "13500 is also a possibility. ", "score": 2, "replies": []}]}, {"body": "Anythings possible...", "score": 1, "replies": []}]}
{"title": "Raided by Amazon", "selftext": "[removed]", "id": "3mw83e", "created_utc": 1443567447.0, "score": 23, "upvote_ratio": 0.81, "num_comments": 9, "comments": [{"body": "OP we want the full story of how Amazon.com raided you", "score": 10, "replies": []}, {"body": "omg is this SEC printing guy? LOL", "score": 5, "replies": []}, {"body": "I'm autist, what's the reference? ", "score": 4, "replies": []}, {"body": "What?", "score": 10, "replies": [{"body": "[removed]", "score": 14, "replies": [{"body": "Yeah I'm a native to the Amazon. Stop cutting down my trees", "score": 41, "replies": [{"body": "but muh lumber liquidators stock tho", "score": 32, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "The deck of your yacht?", "score": 1, "replies": []}]}]}]}]}, {"body": "Sorry bro, I had to tip off the feds.", "score": 3, "replies": []}, {"body": "Who would want to work for an overvalued company like that.\nALL ABOARD THE VVUS YACHT", "score": 2, "replies": []}]}
{"title": "Quick, everybody long AMZN! Go Go Go!", "selftext": "[deleted]", "id": "3mwe4g", "created_utc": 1443570144.0, "score": 23, "upvote_ratio": 0.79, "num_comments": 16, "comments": [{"body": "Used Amazon Prime Now a few times out in the Dallas area. Still have to tip the driver and such. Stopped using it since I could wait the usual 2 days prime shipping.", "score": 6, "replies": [{"body": "> Still have to tip the driver and such\n\nWait what? Do they tell you to tip on the website? ", "score": 4, "replies": [{"body": "It's defaulted when you aren't there. 7 bucks or something like that. Still a great deal to get something to you same day.", "score": 2, "replies": []}]}]}, {"body": "Whooooops your package went missing. Guess someone took it after I delivered it to you. I definitely did NOT just keep your MacBook Pro that you had delivered via Amazon Flex. ", "score": 7, "replies": [{"body": "I think Amazon would know pretty well who to reprimand for a missing product when it disappears after going to the courier.", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "That's only ok if you work for the government. ", "score": 3, "replies": []}, {"body": "you can always drink as long as you don't get caught", "score": 1, "replies": []}]}, {"body": "Wait, is a CDL required, or is Amazon aiming at broke college students like me?", "score": 2, "replies": [{"body": "Not the case for uber/lyft, don't see why this is different. Don't need a CDL for fedex delivery driver.", "score": 3, "replies": []}]}, {"body": "Long AMZN?  Why, because we like labor-intensive businesses (like local delivery) that have NEVER proven to be profitable?", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Amazon is one of those companies I don't really understand and can't take a long-term position one way or the other, either long or short. It used to be they made money by dodging taxes (state taxes), and was just going to be a matter of time before they became unprofitable; not sure what the situation is now, though it looks like they've had negative net income for at least a couple of the last few years. I've also heard (from a few years ago again) they dumped tons of money into R&D which cut their bottom line to just barely profitable, so if things get bad they can tone back some other projects. Not sure how that's going now, but looking at the latest 10-Q they made $1.8B (net sales, at an operating cost of ~ $1.4B, so ~$400M profit) from AWS so at least some of those projects have worked out.  \n\nBezos seems like a smart business man, but I can not decide if Amazon will stick around for another 10 years.", "score": 6, "replies": [{"body": "Are you fucking kidding me? Of course it will.", "score": 3, "replies": []}, {"body": "sigh....What is AMZN worth? Lets look at the fundamentals \"but looking at the latest 10-Q they made $1.8B (net sales, at an operating cost of ~ $1.4B, so ~$400M profit) 5x earnings evaluation? Would that be fair? \n\nSo lets add all that up real quick...Wait..never mind lets not. So what is AMZN worth....WHATEVER THE FUCK SOMEONE IS WILLING TO PAY. God damn its that easy, supply and demand. What is Shit in a box worth? Whatever the fuck you are willing to buy it at. But if you so chose to stay on the sidelines and keep saying over and over \"I don't understand why it keeps going up...my math is right but...but...\" Math is logical it's great makes the world go around...However 95% of the market is based off...who the fuck knows, You can not use logic and market in same sentence. \n\nSorry not trying bitch at you buddy, just hoping shine some light on the subject.\n\nHappy Hunting\n\nJ ", "score": -1, "replies": [{"body": "eh, not so concerned with valuing the company, it's more a question of \"is this business model sustainable?\"", "score": 1, "replies": []}]}]}]}, {"body": "Yes? http://imgur.com/k5JoEyj\n\nAm i doing it wrong?", "score": 1, "replies": []}]}, {"body": "I've always loved Amazon as a company. This seals the \"package\" for me. They're innovative as hell. $25 an hour isn't too shabby for a side gig.", "score": 1, "replies": []}]}
