{"title": "Is it smart to buy TSLA options expiring in more than 3 months to benefit from the IV spike before earnings?", "selftext": "Title", "id": "f4p283", "created_utc": 1581849619.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 23, "comments": [{"body": "Which options though?  TSLA could easily be 100 higher or lower by then.  That's going to outpace any IV bump.", "score": 14, "replies": [{"body": "What about buying a straddle then?", "score": 1, "replies": [{"body": "The last time I looked at the IV for TSLA it was over 100%. (not the rank, the IV itself).  That's an expensive straddle to buy but who knows?", "score": 5, "replies": [{"body": "True I guess I was thinking in OP's case where he says IV will spike", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "What's SV? And what is priced in? The IV spike 3 months away for the ER?", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Ah ok, my bible is Options as a Strategic Investment: Fifth Edition.\n\nYa I just wanted to specify what exactly you were saying was being priced in. \nHow do you price it in? Like what are you pricing it in to?", "score": 2, "replies": []}, {"body": "**Cox–Ingersoll–Ross model**\n\nIn mathematical finance, the Cox–Ingersoll–Ross (CIR) model describes the evolution of interest rates. It is a type of \"one factor model\" (short rate model) as it describes interest rate movements as driven by only one source of market risk. The model can be used in the valuation of interest rate derivatives. It was introduced in 1985 by John C. Cox, Jonathan E. Ingersoll and Stephen A. Ross as an extension of the Vasicek model.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/options/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Isn't TSLA option IV already high enough for you?", "score": 5, "replies": []}, {"body": "You can delta hedge but there will still be theta decay working against you. Also, vol might also drop due to other unforeseen events so that’s something to consider as well but your main cost is going to be theta.", "score": 4, "replies": [{"body": "If i buy a long term option wont theta decay be low bc it enanches towards expiration?", "score": 1, "replies": [{"body": "Yes, it’ll be low but still present. The best way to do this would be to delta hedge a put contract to participate in the vol expansion as hedging a call by shorting shares will result in additional interest as another factor working against you. \nSomething you need to understand is that TSLA can easily announce positive news and drop the current vol sharply, and as that’s your main PnL driver due to hedged delta, you can experience a quick loss to your position from the IV drop.", "score": 2, "replies": []}]}]}, {"body": "Buy it during a time where the stock is quiet and consolidating. You risk the stock moving against you though. 3 months may be too long.", "score": 3, "replies": []}, {"body": "Big fan of this strategy but IV doesn’t always run up like you expect it to and then you can’t flip the position. Just make it a small position, you don’t want to be stuck in a huge position heading into earnings", "score": 3, "replies": []}, {"body": "No, I just learned and made this mistake. Similar to buying stocks low and selling them high. You want to purchase options with low IV and sell them for high IV.", "score": 9, "replies": [{"body": "Isn't that what they were saying that the IV would spike prior to earnings?\n\nThat being said, with all the hype, the IV is probably still relatively high now.", "score": 15, "replies": []}, {"body": ">\tYou want to purchase options with low IV and sell them for high IV.\n\nThis is precisely what OP is trying to achieve.", "score": 3, "replies": []}]}, {"body": "You TSLA could have an even higher IV spike?", "score": 2, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "I’m new here but been trading for a while. I have learnt that one of the best ways to take advantage of the pre earnings IV run up is to sell a well OTM short weekly position in the last hour or two before trading on a highly liquid high IVR or IV% stock then buy it back immediately on the first the market opening after the earnings announcement when IV usually falls very rapidly. This is generally known as the post Earnings Volatility Crush. The short position can be directional or neutral but should be designed to be well outside the Expected Move. Last week for example I sold a very wide IC on BABA for 96c. BABA’s Expected Move was   + or - 4%. My IC short legs were at + and - 7%. Pre market the stock went down about 3%. I had pre entered a limit order buy back at $0. 24c - 25% of Credit earned. This order executed within 45 seconds of the market opening - 75% of premium I had received was gross profit which contributed to a Return on Capital Risked of 16.5% after commissions in less than 19 hours. Earlier in the month I had 16.5% and 15.5 % on GOOGL and YUM respectively. I used this general strategy intermittently for 6 months a year ago. I won 80 % of the time but the losses neutralized the wins and adjustment is difficult given the weekly options. I was  less discriminating then on stock selection and accepted narrower condors to get decent premium. This was a mistake. I have refined the strategy having learnt thru experience that VERY high IV, very liquid, big name stocks can SOMETIMES  allow you to sell very wide short positions with attractive premium which will only get breached if the actual move after earnings is around double the expected move. Do these trades when the market offers these conditions and ONLY when. If only I remember that!\n\nBy the way regarding the discussion in the posts above  about buying premium when IV is low and selling when it is high I believe one must be careful to think on a relative basis. Sure buying premium if IV is 80 three months out and might go to 100 immediately pre Earnings’s might be considered consistent with the maxim of buy low sell high. I would argue however that IV should ONLY  be considered low if it doesn’t have much room to go lower, not because it could still go higher. As some of you have pointed out TSLA IV is high and might go higher pre earnings but it  could fall a long way after buying premium for any number of reasons. The “volatility crush “ strategy of selling high and buying back low is the less risky strategy and much more capital efficient. I will try this on TSLA Earnings if conditions dictate and report back on the outcome.", "score": 1, "replies": []}]}
{"title": "Tesla Steps Into The Utility Space With New Grid Controller Patent", "selftext": "", "id": "f4qkx3", "created_utc": 1581859346.0, "score": 118, "upvote_ratio": 0.98, "num_comments": 24, "comments": [{"body": "The way I see it Tesla will:\n\n1. Install as many solar systems/solar roofs + Powerwalls as they can\n2. Launch \"Tesla Power Company\"\n3. Get all their solar (+ Powerwall) customers to sign up by undercutting the competition\n4. Buy wholesale electricity (or use solar + Gigapacks) to offset whatever their customers' systems don't produce\n5. Profit(?!)", "score": 36, "replies": [{"body": "I think you are greatly missing the point. \n\nTesla will add all their products (cars, batteries, solar) to a virtual power plant. The reaction time is way faster than any peaker plant out there! They will make tons of money from \"frequency regulation\". They already showed what is possible in Australia. The 129MWh battery takes about 80% of the money from frequency trading with just 2% of power capacity (100MW).\n\nKeep in mind they not only pay for producing electricity but also taking electricity from the grid if there is too much. Guess who's cars don't give a shit if they charge at 10pm or 2am.", "score": 22, "replies": [{"body": "A virtual power plant is what I'm describing.\n\nThe car batteries don't change much, people do this already (Tesla will simply streamline the process).\n\nFrequency regulation doesn't generate an infinite amount of money and since utilities are already buying batteries for this exact reason the market won't be as big as you think.\n\nHowever, if Tesla's a utility they can get 100% of the money people pay for power, trade/resell the excess electricity some people produce (that Powerwalls can't store), offset smaller systems some customers may have (even for free), etc.\n\nThis leads to Tesla having almost no powerplants of their own (their customers are paying for the (now virtual) power plants) and almost no overhead (they already have people managing sales and solar+powerwalls).\n\nLastly, they have Superchargers (often with batteries) that can deal with the duck-curve (and relevant fees).", "score": 5, "replies": [{"body": "I agree they will do this as well, but grid services is where the money is at.\n\nAlso cars will probably become a huge factor. I think we will see V2G (vehicle to grid) as soon as they have the 1 Million mile batteries implemented.", "score": 3, "replies": [{"body": "It's a possibility but I don't think Tesla will bother with V2G when they can sell Powerwalls instead or use the energy themselves (and paying very little for it).", "score": 2, "replies": [{"body": "True that, but for backup V2G would be nice either way.", "score": 1, "replies": []}]}]}]}]}, {"body": "Curious on how this works since I’m not well-versed in the electrical grid system. How would Tesla be able to launch their own power company? Doesn’t the existing utility company control the grid? Would Tesla have to pay rent to deliver power through the grid?", "score": 1, "replies": [{"body": "Unfortunately there are a thousand answers to this depending on your location (possibly different laws per city/county/state/country).\n\nIn Tesla's case, let's say you get your electricity from a local PG&E power plant through wires owned by PG&E but you switch to Tesla Utility.\n\nYou will still get the same electricity from the same power plant over the same cables but now Tesla will owe PG&E as much electricity as you consume plus rent and fees for their wires your keep using.\n\nAnd this is where Tesla makes or loses money.\n\nSince they have to \"give that electricity back\" they'd have to build a power plant of their own and produce that electricity but since they have thousands of customers with solar and powerwalls they don't have to build anything, they simply use 5% of your powerwall's capacity, 10% of your neighbor's etc to store some electricity that was produced for free by the solar panels and send it back to PG&E when they ask for it.\n\nNow Tesla doesn't owe any electricity to PG&E but they still owe them rent/fees for all the cables and substations. This money simply comes from you and all the other customers who now get the monthly bill from Tesla instead of PG&E and from the reduced overhead as Tesla doesn't have to pay all those employees PG&E has (Tesla already has employees that do similar things), doesn't have to pay management, marketing, customer acquisition, etc.\n\nIf you are familiar with Tesla Insurance (Tesla buys wholesale and doesn't spend money on ads, agents, etc) Tesla Utility will be similar.\n\nOf course it's not as easy as it sounds but with enough customers and good enough batteries they can pull it off.\n\nAlso, NVNOs do something very similar in case you are familiar with the concept.", "score": 3, "replies": [{"body": "Thanks! That’s the answer I was looking for :)", "score": 1, "replies": []}]}]}]}, {"body": "Im hoping to see tesla strike deals with HOAs for micro grids", "score": 7, "replies": [{"body": "Im hoping to see tesla strike ~~deals with~~ HOAs ~~for micro grids~~ with interplanetary missiles.", "score": 18, "replies": [{"body": "HOAs aren’t that bad if you have a townhouse.  I like that I don’t have to look at POS non-running vehicle’s and completely ignored lawns.  Plus they maintain and insure the exterior, which is the majority of their cost even though ppl act like they are stealing money.", "score": 2, "replies": [{"body": "Sure, not all HOAs are bad but more often than not they are too anal (unless there are laws to force their hand).", "score": 3, "replies": []}, {"body": "The things you say could apply for things other than townhouses. \n\nCrappy HOAs can exist for condos, townhouses, apartments, or anything.", "score": 4, "replies": []}]}]}]}, {"body": "How exactly would this work if you tried to work in so many states? I think Duke, which is the largest power company in the US, operates in only 8 or 9 states.", "score": 3, "replies": [{"body": "Think insurance. Tesla's overheads will be tiny due to the virtual nature of their powerplants.", "score": 2, "replies": [{"body": "If they are sending utility levels of power through the lines, they will need to rent the power lines from other power companies as well. It is not as simple as saying ‘here is the power we get all the money, but you maintain the lines’. There is a lot of overhead, but with micro-grids as you mentioned in another comment, they can minimize the overhead and target smaller neighborhoods or localized utility zones.", "score": 1, "replies": [{"body": "They will outsource grid maintenance, there's no point doing this themselves.", "score": 0, "replies": []}]}]}, {"body": "Even that Duke is a holding company, comprising many regulated utilities and independent power producers.  Power is important to our way of life so states have highly regulated the industry.  \n\nThere are various players in the generation, distribution, and transmission systems.  Even some NGOs at play in the transmission world.", "score": 1, "replies": []}]}, {"body": ">Creating a standardized communication protocol to allow utilities to have bi-directional communication with appliances in the homes of customers is a game changer for homeowners and utilities\n\nIEEE 2030.5 already seeks to address that.  It needs to be widely adopted in the industry by multiple utilities and OEMs to make a difference.  The future possibilities are amazing but its also scary with regards to cyber security.  If someone hacked the tesla network or say LG network and was messing with powerwall and car rapid charge/discharge cycling it could do some serious damage to the grid.", "score": 2, "replies": [{"body": "Honestly, anyone could get hacked but a new Tesla product worries me less than a hodgepodge of antique transformers and substations.", "score": 2, "replies": []}, {"body": "Does the standard allow for communicating anticipated demand?", "score": 1, "replies": [{"body": "It's a two way communication path with scheduling so I presume so. My exposure to it is on the distributed generation side - the scheduling and operation modes that can be done.", "score": 1, "replies": []}]}]}, {"body": "Tesla should become a small scale until its provider and help reduce energy prices in. Ali form is. Energy is way too expensive there", "score": 1, "replies": []}]}
{"title": "German court orders Tesla to stop felling trees for Gigafactory", "selftext": "[deleted]", "id": "f4x9ta", "created_utc": 1581887264.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 20, "comments": [{"body": "Isn’t this a commercial forest planted for use as paper products (e.g. cropland)?  Didn’t Tesla commit to planting 3x the number of trees?  It’s too bad the article doesn’t add that context.", "score": 7, "replies": [{"body": "Not sure about the commercial forest part, but yes on the trees", "score": 1, "replies": [{"body": "“ This is different from the pine trees currently inhabiting the Giga Berlin complex, which are intended to be used for commercial cardboard production.”\n\nsource:  https://www.teslarati.com/tesla-finds-giga-berlin-tree-replanting-area/amp/", "score": 3, "replies": []}]}]}, {"body": "Misleading title, it is ordered to stop, until they get full permission to begin.\n\nEssentially they had an agreement to begin early to minimize damage and finish construction before the growth season on the condition that if they were refused permission they would cover the costs of replacing the cleared nature.\n\n>the state environmental office gave a green light to clear 92 hectares (227 acres) of forest for the plant.\n\nIgnorant tree huggers made a fuss and politicians pandered to them. There is no real reason they won't be given permission in due proccess, meaning because of the tree huggers they may still be clearing in growth season causing far more damage than if the tree huggers had done nothing.\n\n\" the court said it had issued the order to stop the tree-felling because it would have only taken three more days to complete the work. Otherwise the clearance would have been completed before judges made a final decision on the complaint brought by a local environmentalist group called the Grüne Liga Brandenburg (Green League of Brandenburg). \"\n\nThis implies it was litterally just spite as the damage is already done for the most part and they forced Tesla to stop simply to claim it as a victory and cash in brownie points.", "score": 11, "replies": [{"body": "I don't understand why this is misleading. They have been ordered to stop temporarily, and if the court doesn't work things out and growing season comes around, they might have to wait until winter to cut the rest of the trees. \n\nI don't think these loser activists have a chance but the question is how long it will take. That's what I'm worried about, and it's quite possible the market will be worried until things are resolved as well. Just trying to be realistic. Each new gigafactory is incredibly important for Tesla, and Giga Shanghai has set a pretty high bar that may be tough to meet in other regions.", "score": 2, "replies": [{"body": "Being ordered to stop and being ordered to stop temporarily are very different things an carry huge implications.\n\nI think the difference between cancelling a factory and postponing is a pretty important distinction.", "score": 2, "replies": [{"body": "I guess maybe I just assume that all court orders are temporary since they do so much stupid crap hah.\n\nAnyways makes sense thanks.", "score": 1, "replies": []}]}]}, {"body": "Copy and pasted the article title. Don't think it's too misleading though, sounds like any other sensational piece.\n\nGood write-up, thanks for the tldr for everyone.", "score": 1, "replies": []}]}, {"body": "Sounds like Tesla should have chosen Poland for the EuroGiga???", "score": 7, "replies": [{"body": "Yeah, bullshit Reuters article syndicated by the anti-EV Guardian, which \"forgets\" to mention that:\n\n- the stay was almost automatic and was justified due to rapid progress and the weekend filing: the objections were filed on a Friday evening to force this outcome,\n- that the Brandenburg ministry of environment (who issues environmental permits) is on Tesla's side,\n- that the court gave the ministry and Tesla until Tuesday to present their arguments - i.e. super accelerated court proceedings,\n- that the real deadline for tree felling is mid-March, i.e. plenty of time,\n- that the objecting groups are two unknown entities possibly acting as shells to file bogus complaints,\n- that the state local government coalition member green party is supporting Tesla too.\n\nI expect this to be resolved by the ~middle of next week.", "score": 13, "replies": []}, {"body": "I doubt this will be anything material. Probably get thrown out within the week.", "score": 4, "replies": [{"body": "Might not be material.  But if it’s a sign of what’s to come, maybe Germany is more trouble than it is worth?  \n\nI’m just thinking out loud here.  I thought Germany was a good choice, partly because they’ll need the jobs if Tesla damages their incumbent car companies too.  I thought that would garner strong support for Tesla.\n\nBut if they are going to have to fight at every step of the way, they aren’t going to be finishing the Gigafactory in Europe in 10 months like in Shanghai...", "score": 1, "replies": [{"body": "There is a lot to gain. Manufacturing equipment is Germany's bread and butter. Additionally like you commented the human capital is there. And as Tesla has said the real win is encouraging other people to build electric so hopefully it's a step in the right direction.", "score": 7, "replies": [{"body": "I imagined Tesla moving into battery production of their own technology (from Maxwell acquisition) and partnerships to supply batteries to German car companies too.\n\nBut I have also heard arguments for Poland as a place to get more done for less money.  And the people there seem to be able to build just about anything.\n\nI’m just curious how it could all play out, for either argument", "score": 1, "replies": [{"body": "So my argument for the less with more money is that Tesla is going for automation. They will be top heavy rather then bottom heavy. Meaning more engineers (on average) then manufacturing labor compared to ice. So the delta in how much they can save might be minimal. That is not to say the supply chain might have benefits but I am not familiar enough with the eu market to say.", "score": 2, "replies": [{"body": "This does seem to make sense to me.  Especially if they are going to be getting heavily involved in battery production at the Cell level.  That will definitely be a highly automated and needs extremely high output to supply needs for increasing EV demand", "score": 2, "replies": []}]}]}]}, {"body": "They never said 10 months. They said July 2021, I believe. 1.5 years.", "score": 1, "replies": []}, {"body": "Europe is not China. We don't build like they do. A 10 month Gigafactory is not possible here. I expect it to be built in around 18 months if not more. Every European would agree with me on this point. Expect complications.", "score": 1, "replies": []}]}]}, {"body": "You don’t run away every time a few confused hippies show up. Tesla bought the land already and they got the deal to plant like 3times more trees. What more can they possibly offer?", "score": 2, "replies": []}]}, {"body": "Please stop with the tree huggers and hippies comments. Most tree huggers and many hippies are on our side. Plus, these German groups agenda may simply be anti-tesla.", "score": 2, "replies": []}]}
