{"title": "Good time to buy calls?", "selftext": "I know the market is down pretty hard with virus fear. But i just got some money to buy some calls and was wondering should i do so and how far out for expiration. Im looking at amd since ive traded it before and currenty have calls on it. All advice welcomed. Thanks.", "id": "fama4g", "created_utc": 1582851197.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Called it", "score": -6, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "True, but given that we could get a bunch of short covering plus with expiry today there's likely to be a ton of unwinding of hedges and other positions.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "A lot have shorted or bought puts.  They will unwind those positions today if they have options expiring or want to take profits before the weekend.   Unwinding those positions affects hedges by MM.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You don't understand hedging do you?   MM will hedge their positions with stock or other options.\n\nWhen you buy an option, they're short and will either buy other options or the stock itself to stay delta neutral.\n\nWhen you buy puts, the MM will short the stock or other positions to hedge their delta.\n\nIf there's huge volume on everybody selling their puts, the MM has to start buying shares or calls to offset the delta.\n\nMy point here is you could see big swings all day with people unwinding positions.\n\nFeel confident all you want-- I'm just saying what MIGHT happen today.", "score": 1, "replies": []}]}]}]}]}, {"body": "I hope you got crushed on the SWING UP from the LOW like I said there’d be you fucking gay bear eat shit\n\nEdit your not dumb took out the dumb part", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good I’m glad you weren’t a retarded gay bear just a gay bear\n\nStill though you tried to say it would just go straight down yet you heeded my advice about it bouncing from the low", "score": 1, "replies": []}]}]}, {"body": "Lol if ur short I hope ur crushed tomorrow", "score": -3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Okay I don’t doubt that I’m just saying tmr will most likely see a bounce off lows idk about what’s gonna happen on Monday I just worry about what’s right in front of me\n\nEdit: 6pm 2/28 I called it jackass", "score": 0, "replies": []}]}]}]}, {"body": "have you seen a green friday anytime lately? nope. i read ur first sentence. then i stopped. sir this is a wendys", "score": 1, "replies": [{"body": "Yeah today as it tracked up 600 points in 5min from the lows as all the gay bears covered", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "0 growth for the year? Might be 21s tbh", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ya I think we are around a 20x pe right now? Over priced if 0% growth.  You wanna be name picking companies with good balance sheets. Ie cash. The ones carrying debt gonna struggle cuz the debt was based on growth", "score": 1, "replies": []}]}]}]}, {"body": "No calls until at least next week. Tomorrow might open up, most see a close down.  Next week depends on the weekend news.", "score": 1, "replies": []}, {"body": "ATM leap spy call?", "score": 1, "replies": []}, {"body": "Futures are pretty red again... I would only buy calls for at *least* a week out, and only if they’re literally dirt cheap. Hard to find truly cheap calls with IV so high though.", "score": 1, "replies": []}, {"body": "Who the hell knows.  Not this week, if anything next week or after that.  Until we get some decent news on corona, it's anybody's guess if we rally or keep dropping.", "score": 1, "replies": []}]}
{"title": "Do I suck or am I just unlucky?", "selftext": "[deleted]", "id": "fapl5n", "created_utc": 1582866517.0, "score": 4, "upvote_ratio": 0.76, "num_comments": 18, "comments": [{"body": "This is not a bullish moment.  \nDid you have intended exits planned for a  maximum loss?   \n\nI think you're partially suffering from lack of position management.   \nIt is good these are risk limited positions, as spreads.  \nThere are actions you could have taken to ride the stock down to reduce your losses. \n\nYour positions: \n\nSPY short call 247 / 350 exp Mar 20   \nAAPL short call 355 / 365  Mar 20  \n*GS short put 215 / 210 Mar 20  \n*GS short put 220 / 210 Mar 20  \n*AMD short put 45 / 42 Mar 20  \n*SPY short put 324 / 320 Mar 27  \n* in the money\n\nAll of your credit put spreads are under water.  \n\nYou could roll these out in time *for a net credit* (debit to close, greater credit to open) as the expiration nears.  \n\nOn the way down, you could have added credit call spreads,  \nto all of the put spreads, to follow the underlying down, and reduce the losses. \n\nSimilarly, you could have rolled the existing call credit spreads down at the same expiration, to follow the underlying down for additional gain.  The AAPL and SPY call spreads can be exited already, and rolled downward at the same expiration.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Things you can do:   \n\nDaily test the positions, to see if you can roll for a net credit.  \nThis may get easier as extrinsic value declines on the \"old\" positions.  \nI did not check...perhaps with the high IV int the market right now, it may be easier to run the extrinsic value on the positions down, by waiting until expiration is closer. \nI try not to roll farther out than 60 days.   \nIf you can at the same time, roll downward the puts a few strikes, take the opportunity to do so, again for a net credit. \n\nLook at rolling the call credit spreads downward for additional credit with the same expiration, March 20. They are now so far out of the money, they may already be near maximum gain, I imagine.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Right, you would like the extrinsic value to go down,  generally, before rolling: that makes closing the old position cheaper usually.  \n\nYou can test whether rolling for a credit (net) works each day. \n\nThe spread takes care of the instrinsic values, by subtracting one against the other (and thus maximum loss at expiration).  \n\nTOS shows values in per share amounts.  \nMultiply by 100 for the cash amount.    \nThe net is one strike of the spread minus the other.\n\n(You can change the width of the columns to be readable, by mouse-click-hold-dragging on the vertical title line-bars between the columns.)", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I have not really experimented.   \n\nGenerally speaking:  \nThe extrinsic values have not decayed away, and when they do, you will be at max loss when the entire spread is in the money.  The two leg's extrinsic value netted against each other adjust the net loss that is basically fixed in the intrinsic value side of the position. \n\nThe position may not be at max loss yet, and that makes it worthwhile to test daily on whether an advantageous net credit position (not \"too far\" out in time) can be arranged.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "a few comments from a successful spread trader (+~1% a month average):\n\nDon't trade spreads the \"tastytrade\" way. The tastytrade way, however that is actually defined, is for a delta-hedged short option portfolio, using span or portfolio margin. It's great for managing naked short options, with some regular schedule of delta hedging. The tastytrade way boils down to reverse gamma scalping and closing out your gamma tail earlier than expiry. If you churn spreads, you will make your broker very rich and *at best* break even.\n\nDo:\n\n* Wider spreads are more interesting than more units of a narrower spread.\n\n* Trade around a core position. are you long equities? long bonds? short something? Do that with most of your \"investment\" money, and then trade spreads that make sense around that.\n\n* Be systematic about your spreads. every one of your spreads should be the same thing. I have a spread width and a credit that I target for nearly all my trades. example: 5 strikes wide for $1.50. avoid: pretty much what you did, spreads of every kind all over. \n\n* leave your spreads on until expiry. don't \"roll\" up, down, or out - you still get paid for the days you are underwater. the implied vol you traded at when you put on the position takes into account the position getting challenged. If you aren't pricing your own options, you can (mostly) trust the market makers are pricing in appropriate premium.\n\n* keep a large portion of your buying power in cash or cash-equivalent during low vol periods. Having cash on hand is great for when VIX goes 30+.\n\nother notes: \n\n* you still get paid for the time decay underwater positions - your portfolio theta might be \"negative\" when you're underwater, but if (when) the spreads come back to you, you still get to keep the premium. buying back underwater spreads (read: rolling = buying back & selling another) is the WORST deal in the history of trade deals, maybe ever.\n\n* Everybody's puts are underwater right now. you get paid to sell garbage when times are good, to offset the hit when times are bad (like this week thru now). All the market makers that are underwater as f on their puts will be trying to tease the short-term pricing upwards to get out from underneath them.  \n\n* all of my put spreads are underwater right now too. No big deal. I trade puts against short stock, the short stock is doing great. \n\n* options spreads, by design, should be a trade you enter into comfortable with losing the max loss. It sounds like you are not comfortable with the max loss; you are trading too big.\n\n* options do not price \"alien invasion\" risk very well. I hate to sound too much like NNT but we can't price the risk we don't understand. Spreads are your friend for this reason, but nothing in life is free: spreads have a built-in drag to the position. Just hold the good ones to expiry; that was the deal you made when you put the trade on.", "score": 3, "replies": [{"body": "This is a great summary. Well said.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I do something similar-ish.\n\nI price my own options; i don't \"log in\" and look around and then say \" ya this looks good **puts on trade** \". Before the market even opens (usually the day before) i submit my orders based on my pricing model. \n\nI tend to put on trades with an expected profit % of about 75% and try to collect 30-35% of the spread in credit. \n\nWhat's more important than strikes this or % that, is consistency across all your trades. If some are 5 strikes for $1, 3 for $0.25, and 4 for $1.25 you ability to record data and derive useful trends is basically zero.", "score": 1, "replies": []}]}, {"body": "I watched a bunch of videos and spent hours researching tastytrade's material (amongst others). I understand their theory and it does make sense but I'm also not naive and understand the strategies they recommend are biased towards their interests. They roll their trades left right and centre. They probably don't pay commissions (or don't care - it is their company) and are trading with play money so I take what they choose to do with a grain of salt. I've taken their material as a guide and to learn and in that respect, it's been quite useful to build a foundation of knowledge. \n\nI do believe what we've witnessed in the recent market is highly abnormal as in it doesn't happen often so shouldn't have a major effect on a long term strategy unless you're over-leveraged or extended. \n\nAs a relative beginner to options trading, I'm only invested with about 2% of what I'm willing to risk. And of that 2%, only 30% are slightly under water right now. Most of those positions are put credit spreads which have expirations from 30-55days. So I've got time to play them out and I'm hoping theta will work in my favour and bring them  into profit. If they're blown out, I'm ok with that as I'm learning, have little invested and am in market situation that I couldn't have predicted. \n\nRegarding my strategy, I'm trying not to chase trades but instead find them. I've started to develop a method that seeks decent probabilities of profit, with a good profit/loss ratio and then I use something similar to Kelly's criterion to determine if the amount I'm staking is justified given the odds of the equation. Even then I'm trying to keep any single trade under 5% of my account unless probabilities are heavily stacked in my favour. \n\nI'm trying to resist the urge to YOLO like the guys over at WSB . I see massive gains but I have the experience to know that generally they are extremely risky plays and will fail far more often than not. They're essentially betting and not trading. Also, for every monster gain post we see I know there are 1000 people who have lost big. \n\nI'm going to take it easy and not rush in, continue to learn, hone my strategy and understand the options market first. As I get more comfortable and experianced I'll start to commit more capital in an effort to have success long term.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not from tastytrade. Generally, it's a basic 'betting' equation that can be used to calculate amount of capital to stake given specific odds and desired risk profile. \n\nI've tweaked it slightly and use it a bit differently. I use it to check that a particular trade is actually profitable given its odds AND the way I plan to play it. If the amount to stake comes up really high, I have yet another confirmation that it is worth the risk. If the number comes out lower than what I would have staked or zero or even negative I'd stay away.\n\nI don't actually change my staking directly based on its output number. It's merely another tool I use to check the odds of a trade. \n\nYou can Google it, there's tons of info on it.", "score": 2, "replies": []}]}]}]}, {"body": "I've been seeing the same. I posted something similar a few days ago. You can do as much analysis and studying of the numbers as you like (e.g. prob. of profit, strikes, dates,  max profit/loss ratio etc) but unless your assumption of the movement of the underlying is close to being right, it's difficult to get an edge. \n\nYou're only way of increasing long term probabilities in your favour is to properly and actively manage your trades and have clear profit taking and risk mitigation (loss limit) strategies.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "r/wallstreetbets", "score": -1, "replies": [{"body": "Nobody on WSB sells premium", "score": 1, "replies": [{"body": "Theta gang?", "score": 3, "replies": []}]}]}]}, {"body": "maybe because those were narrow spreads. can roll forward the narrow side that is more OTM? you have time to roll it.", "score": 2, "replies": []}, {"body": "You aren't unlucky, you are learning. It appears that you didn't  have an exit plan for any of these positions. It also looks like you are allowing for a max loss of almost $1500 per position, on average. Unless your account is quite large I would say that this is too much money on the table at any given point. I think the info you need (other than the terrific suggestions below) is to learn and practice better risk management. Being a net seller can be a successful long term strategy. Keep with it and learn from your mistakes.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Your trades may be too big, and they are concentrated on a few underlyings.  Consider having no more than 40% of your account in options, and no one underlying at more than 5% of your account. \n\nThis will make it easier to exit, for a smaller loss, and the original trades are not too big.", "score": 1, "replies": []}]}]}, {"body": "You neither suck or are unlucky.  We're in a period of an unprecedented market correction, so most everyone is showing red.  I know I am.\n\nDo you think this will continue and not recover?  I don't think anyone thinks there will not be a vaccine or some other abatement of the virus and if this happens the market will likely move back up.  How much and how quickly?  No one knows.\n\nYour max risk amount is fairly high with some having what looks like too many contracts, but we don't know the amount of capital you are working with.  For example, if the AAPL position is 5% or less of your account then you should be fine.\n\nYou've gotten some good feedback below, and I won't tell you what to do but will tell you what I am doing.  I am not panicking or losing any sleep while this plays out and recommend you do not either as it is out of your control.  Once the scope and scale of the virus are fully understood, and whatever cure or vaccine is developed then things will settle down and perhaps the market may have some recovery to help all of our positions.  This may happen as soon as next week and you have a good amount of time until these expire, so reacting now may make matters worse.\n\nThis goes to show that no one can predict the market and is why risk management is so critical to your trading plan.  Whatever you do think through it slowly and carefully as by reacting from emotion you may likely make things worse.  \n\nYou can't control the market, but you can and need to control your max risk amounts so if all of these positions result in significant losses it will not wipe out your account . . .", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I get it, I make $40 on a trade and celebrate.  Over dozens of trades like this it adds up to some real profit, and when few to none of the trades are losers these really do add up.  It is tempting to bump up the number of contracts but getting burned will help temper that feeling in the future.  We can't control the market and no one will know when it will come back, but since it is healthy except for the virus panic all we can do is roll and wait . . .", "score": 1, "replies": []}]}]}]}
{"title": "Puts on VXX after this weeks spike.", "selftext": "Puts on VXX For a month from now?\n\nWhat is the downside. The VIX will go down eventually. Does the IV kill it? never done it but i want to recover some unrealized loss from this week by buying ATM puts on the VIX.", "id": "fb13x2", "created_utc": 1582921972.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 26, "comments": [{"body": "A month from now is dangerous, April or June is safer.\n\nYou can also buy some leap put which almost certainly will print but the upside is very limited", "score": 4, "replies": [{"body": "yeah those leaps were pricey", "score": 1, "replies": [{"body": "I got some leap put with 11 strike for 90 cents.", "score": 1, "replies": [{"body": "Oh those are way out. Does the contract price rise even if it doesn’t hit 11 lets say like 15?", "score": 1, "replies": [{"body": "For sure, if vxx drops to 20 next week, I expect the 11 leap to be priced at at least 1.2-1.5.\nAgain, the upside is very limited comparing to near term put but it's a much safer bet as well", "score": 1, "replies": []}]}, {"body": "Got the may 15 11 strike for 10 cents x 10... wish me luck i hear the first ones free.", "score": 1, "replies": []}]}]}]}, {"body": "Just noticing the IV on VXX is about \n100 for April 17, and  about 115 for March 27.", "score": 2, "replies": [{"body": "what does that tell you", "score": 1, "replies": [{"body": "Calls and puts are expensive, and selling call credit spreads,  \n maybe in the money, may be the way to go.", "score": 2, "replies": []}, {"body": "IV on Calls is at the moment higher than puts on VXX. \n\nVXX via Market Chameleon   \nhttps://marketchameleon.com/Overview/VXX/VolatilitySkew/", "score": 2, "replies": []}]}]}, {"body": "I think it might be too early. COVID-19 has hardly affected the US, and it appears that we have a lot of new cases being reported over the weekend. I expect the market to continue to fall.", "score": 2, "replies": []}, {"body": "Thanks for the advice.", "score": 1, "replies": []}, {"body": "Bought VIX May 20 put 20 at 2 bucks", "score": 1, "replies": []}, {"body": "What’s the benefit of you buying an more ATM put vs me down at 11 but with 10 of them?", "score": 1, "replies": [{"body": "Since his puts are closer to the money, his probability is higher, making his place safer. Your play is further out making it riskier and less probable, however, you have 10 meaning you multiplied your capital at risk by 10. \n\nYour play is a far bigger gamble than other buddy’s.", "score": 2, "replies": []}]}, {"body": "I figured it was 100 on black which is my go to amount i’m willing to loose in a casino. When i click on price quotes it already shows i’m up 66% off of VXX going down a dollar. Would VXX plummeting next week and selling do well? or should i hold it until april/may to reap more\nprofits or does time decay eat away at it", "score": 1, "replies": [{"body": "VXX tends to ease down after highs. \nIt can take a few weeks. \nBest to not have your option expire while VXX is still high.", "score": 1, "replies": [{"body": "not til may 15", "score": 1, "replies": []}]}]}, {"body": "I’m wreckless but I’m jacked to the tits in UVXY puts", "score": 1, "replies": [{"body": "When the market opens monday if it’s green are you going to sell your puts immediately? i don’t know if it will be better to cash in early or wait until expiration after the volatility settles since it’s a volatility thing. or would that just make the price of the option worthless", "score": 1, "replies": [{"body": "It it opens and I’m 50% or more up on my 3k position I’ll close two thirds and let a few ride\n\nEdit: last week I sold 14 uvxy 11$ calls for a 150% profit I got them near 1.20 my biggest fomo is if I held till today they would have been 15$ each", "score": 1, "replies": [{"body": "Right on, at market close my contract quote was up 66% already so i’m not sure if i let it ride til may it would be up thousands or go down due to low volatility", "score": 1, "replies": [{"body": "Ya one contract is hard call like I said I’m [jacked to the tits](https://imgur.com/a/1kIa8IK)", "score": 1, "replies": [{"body": "I have 10, but yeah that looks nice", "score": 1, "replies": [{"body": "Cover cost and let a few ride", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Still don’t understand what that means for my puts", "score": 1, "replies": []}]}
{"title": "Is now a good time to invest for long-term gains", "selftext": "Hi Everyone, I'm fairly new to the actual trading world but have been using different websites for real-time trading. I just never really had the gut to invest in. I am a young college grad who was majoring in Finance and Accounting( and I'm not even good at Investing Finance). I have worked my tail off(7 days a week) since 15. I saved up a good chunk of money to buy a Mustang which is my dream car but I decided not to when I have enough money for it. Now that I see the market's been doing pretty badly I put in 90%(30,000) of what I have saved into Robinhood and the funds will be available next week. I personally think the market is going to go down until next week.\n\nI will be investing in ETFs and blue-chip stock and I plan to hold them for at least the next 5 years(I want to invest in property so I can finally stop paying rent and pay mortgages haha). I will provide all of my favorite stocks below, please let me know your thoughts\n\nStocks: APPL, MSFT, DSN, BRK.B, S(sprint), JPM (these are the \"risky\" investment of my portfolio 40% of total investment)\n\nETFs: VOO, SPY, VTI (these are my \"safer\" investment because I would not have to actively manage any of them) I also consider FNILX\n\nThe main reason why I pick these ETFs is that I just want bigger gains from the \"top 10 holdings\" of these ETF (if this makes any sense)", "id": "fanyu7", "created_utc": 1582858745.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 25, "comments": [{"body": "Maybe enter very slowly", "score": 3, "replies": [{"body": "Yes I’ve thought of it. The reason why I transferred the full amount I wish to invest is in because I can just invest and not having to wait another week to transfer more money to Robinhood. Can always transfer it back to my bank if I decide not to buy 😬", "score": 0, "replies": [{"body": "It can sit on Robin hood as cash and you slowly buy as it dips or whatever", "score": 1, "replies": [{"body": "Thank you for sharing", "score": 1, "replies": []}]}]}]}, {"body": "I do it weekly", "score": 3, "replies": [{"body": "Btw, what brokerage do you use ?", "score": 1, "replies": []}]}, {"body": "I'd ignore Sprint and JPM, personally. \n\nFrankly the smart thing is to just buy the S&P 500 index ETF and walk away. 90% of people underperform the S&P, and that includes billionaire money managers.\n\nThen just read a few ***good*** blogs like Calculated Risk or Bonddad, to learn about economic indicators and markets.", "score": 3, "replies": [{"body": "Thank you for sharing your thoughts and thanks for the advice", "score": 1, "replies": []}]}, {"body": "It’s also a good time time to buy if your long, it’s about time in the market", "score": 2, "replies": [{"body": "I wouldn’t be surprised if the price continues to drop after I make my purchase but I believe it is an unrealized loss and it should be fine for long term. Obviously 5 years is a long time from now and anything could happen. Thank you for sharing your thoughts", "score": 1, "replies": [{"body": "You can do some dollar coast averaging as well if you think it’s going down still. That’s what I do", "score": 3, "replies": [{"body": "Is that advisable in a volatile market?", "score": 1, "replies": [{"body": "I put in the same amount each week since I get paid monthly so I don’t have a whole lot", "score": 2, "replies": []}]}, {"body": "Whats your investing period ? Daily or weekly ?", "score": 1, "replies": []}]}]}]}, {"body": "You have 30k you want to invest and hold for 5 years. At a time like this, use a strategy like dollar cost averaging. Think about how many shares you want of each equity and then buy them at different intervals (days, weeks, etc.). This will reduce the overall impact of volatility on the price of the target asset; as the price will likely vary each time one of the periodic investments is made, the investment is not as highly subject to volatility. Also, you will avoid making the mistake of making one lump-sum investment that is poorly timed.", "score": 1, "replies": [{"body": "This. I was the moron who got in last month. I could still pull out but at this point I’ll just ride the wave.", "score": 3, "replies": [{"body": "I bought some last week. Although it was bad timing but I think I will be fine for the long run or at least break even haha", "score": 1, "replies": []}]}, {"body": "Thank you so much for sharing. I plan to invest all the 30k in the course of 2 months lets see how thats going to turn out", "score": 2, "replies": []}]}, {"body": "Dont buy till it drops another 20%>. then starts DCA every week!", "score": 1, "replies": [{"body": "I will monitor the market for the next week. Thank you for sharing", "score": 1, "replies": []}]}, {"body": "Unless there is a very clear sign that the decline has stopped, better to wait until the market recovers completely. If we get back to old prices before the recent drop, and a little higher, likely the bull market will continue. For now there's no reason to think it can't go much lower.", "score": 1, "replies": [{"body": "Thank you for sharing and I believe it will go even lower next week", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Can I ask you why ? Thank you for sharing your thoughts", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I said funds won’t be available in my account till next week because Robinhood takes roughly 6-7 days to transfer your funds. I can always just transfer it back if I decide not to buy anything by next week 😬", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Thanks for sharing your thoughts", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Why wouldn’t people just buy Amazon or Apple stocks now?", "selftext": "[deleted]", "id": "fanv4c", "created_utc": 1582858277.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 21, "comments": [{"body": "Yea but why not wait a little longer since it’s expected to keep going down.", "score": 11, "replies": [{"body": "Lol I hope not I went 4x margin on a triple leveraged etf with 20% of my portfolio at close today.", "score": 1, "replies": [{"body": "!remindMe 24hours", "score": 1, "replies": [{"body": "I will be messaging you in 1 day on [**2020-02-29 03:22:06 UTC**](http://www.wolframalpha.com/input/?i=2020-02-29%2003:22:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/fanv4c/why_wouldnt_people_just_buy_amazon_or_apple/fizdk2n/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Ffanv4c%2Fwhy_wouldnt_people_just_buy_amazon_or_apple%2Ffizdk2n%2F%5D%0A%0ARemindMe%21%202020-02-29%2003%3A22%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fanv4c)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "I made money TQQQ was bought with 4x margin at close then again with another 10% of portfolio at 69.01 after selling of losses All sold at 76.53.", "score": 2, "replies": [{"body": "Good stuff", "score": 1, "replies": [{"body": "Mostly luck that I made money on the market close stuff because my trail stop is what made the sale just short of the peak so far too.", "score": 1, "replies": []}]}]}]}, {"body": "Stay away from windows and high places.", "score": 1, "replies": [{"body": "Lol I’ve been fucked so far. People are playing off this coronavirus fear too much. They’re going to sell themselves into a full recession. My mentor who has been at it for 34 years said he’s never seen investors be this stupid in his life.", "score": 1, "replies": [{"body": "I don't think it's merely people. It may be ETF sales driving everything down in unision.\n\nPeople cash out of SPX or QQQ in the morning open and the ETFs don't execute until near closing. That drives fear over to the next day.\n\nThe stock exchange are making a bundle and we are screwed as the computers all sell in unison rather than spreading it over the whole day.\n\nWait until the $VIX recovers to do anything bullish.", "score": 1, "replies": [{"body": "I day trade I specialize in index and etf day trading. I’ve just been making bad calls because I’m always adverse to making inverse plays.", "score": 1, "replies": [{"body": "Day trading is brutal right now.", "score": 1, "replies": [{"body": "It’s always brutal. Some of my friends who are big in options have made 60k-150k just this week. Given they are working with at least 1 million dollars. I’m just working with $200k. I’ve lost $22k this week.", "score": 1, "replies": [{"body": "In 2008, I made $20k in one day buying $20k of GE at the bottom and watching it bounce 100%. No leverage.\n\nBut overall I didn't net a gain. I'm not willing to bother.", "score": 1, "replies": [{"body": "I only count losses or gains at sell, so portfolio changes are pointless.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "You could but it's impossible to time the market so a better, safer option would be to dollar cost average on the way down. Buy a little bit every week until the market recovers.", "score": 0, "replies": []}]}, {"body": "If you have a bunch of cash then nibble on the way down. If you're willing to take more risk for bigger profits then wait.", "score": 4, "replies": []}, {"body": "Wait for confirmation that it is rising. A dead cat bounce has tricked me a time or two.", "score": 3, "replies": [{"body": "I bet heavy on those. I played the early market positive oscillation on Wednesday 4x margin with triple leveraged etfs for sizeable gains.", "score": 1, "replies": []}]}, {"body": "Maybe.", "score": 1, "replies": []}, {"body": "Uhhh no, haven’t you heard it’s the end of the world?", "score": 1, "replies": []}]}
{"title": "Why are most motor vehicle company's at such a low price right now?", "selftext": "No seriously, take a look at Ford (F). It's current price is 6.97$, It's .05¢ away from being at it's yearly low. Someone help me understand this. They make cars yet they have such low stock value. Meanwhile General Motors (GM) makers of Chevy vehicles. Also appear to be in a Bear market right now. Is the competition with companies like Tesla really that damaging to them or am I missing something?", "id": "fap52o", "created_utc": 1582864282.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 21, "comments": [{"body": "Right, it's odd. I would think of them as powerhouse companies, a staple of American trade.  \n\nBut the price has little value right?  The price listed is just an indication of what the stock traded at most recently.  Maybe it's not that sought after, so it's a low amount?  Idk man... I'd like to know as well", "score": 6, "replies": [{"body": "Ford has a Dividend of 6.45% and that's only about 44¢ a stock right now. I think I would place something like for more as a long term investment when I have the money for at least 10 stocks. Now that I take a closer look the Dividend seems to be the real focus of this stock.", "score": 3, "replies": [{"body": "Try 12 cents", "score": -1, "replies": [{"body": "Wow must of really screwed up my math there sorry about that one.", "score": 1, "replies": [{"body": "It's 12c a stock every payment but annually it is 44c.", "score": 3, "replies": [{"body": "You can use the [NASDAQ website](https://www.nasdaq.com/market-activity/stocks/f/dividend-history) to check the dividend histories of specific stocks. Since Q1 2015, Ford's dividend has been $0.15 per share per quarter, which is $0.60 per share annual. The latest dividend payment is $0.15 which was announced on Jan 8, went ex on Jan 29, and will be paid on Mar 2.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "All the car makers have been sucking for many, many years. \n\nTheir product is expensive in a world where many jobs have been changed for decent, well paid, with benefits, to shitty McJobs with employee-purchased health premiums, and smaller disposable income.  \n\nThere's also a couple of generations growing up to not give a damn about cars.  They can get an Uber ride in minutes and ride in chauffeured comfort without ever having to experience the brutal depreciation and headaches of car ownership.  A car is no longer an automatic aspiration.  \n\nEven for people with the need of money for a vehicle, they're keeping them longer and just getting them repeated.  And the affluent are looking at the idea of buying a gasoline car and thinking they'll just wait for electric or the wildly overhyped \"self driving\" cars to be more available.\n\nAutomakers are death to your portfolio.", "score": 6, "replies": [{"body": "https://www.statista.com/statistics/199974/us-car-sales-since-1951/\n\nThought you’d be wrong but damn, falling for years.", "score": 3, "replies": []}, {"body": "I agree , I know a little about cars and the last good cars were made in the 90s imo. The more I think about making more money the more I think about moving to a city in Europe and just getting a nice road bike , and catching cabs or Uber because if I wanted an older a car it’s just gonna be a bitch to get it fixed unless I know how to do it myself", "score": 1, "replies": [{"body": "While anecdotally \"they don't make things like they used to\" sounds sensible.  But actually modern vehicles are being kept longer and longer these days.  You can search and see the statistics.  That's also why the stocks of companies that supply do-it-yourself and corner garage mechanics have been exploding in recent years.", "score": 2, "replies": []}]}]}, {"body": "Read consumer reports. They are both rated pretty low. They spend a lot of money on recalls / class action lawsuits, etc.. maybe that has something to do with it ?", "score": 3, "replies": []}, {"body": "Ford and GM are essentially truck and muscle car companies now, which while now that's fine, it's very high risk long term strategy. People are already stretched thin buying them, and we're in pretty good economic times currently with obscenely cheap gas prices. Plus their bread and butter product limits them to the North American market. Car's in general long term outlook is bad, as people can't afford new ones anymore, they're getting increasingly expensive, (and I don't see any signs of consumer purchasing power increasing long term), plus demand is going down for cultural reasons (they're horrible for the environment) and the fact that cars last longer now too so even if there were a level need for cars, demand would still go down anyway.\n\n\nLooking at stocks as a long term investment, buyers are interested in companies they have faith will exist and be flourishing for decades to come. The Detroit auto industry, while doing ok now, does not have a bright future. Not to say it will cease to exist, but I believe it will continue to shrink, and wise people don't place long term investments on shrinking companies. \n\n\nThis is why Tesla is so popular. Whether you like them or not, their future is significantly brighter than Detroit's. Their brand cachet is extremely high, and they have global appeal.", "score": 3, "replies": []}, {"body": "Damnit Scotty Kilmer!", "score": 2, "replies": []}, {"body": "its*", "score": 1, "replies": []}, {"body": "New Auto purchases continue to decline (especially around a pandemic threat) while costs and pricing increase.  Combine that with a highly competitive international space.  Also, F is making huge investments to the tune of 11 billion (I think) in the autonomous related space.  As you have noticed, F has not rolled out anything groundbreaking or ahead of the curve.", "score": 1, "replies": [{"body": "What about the Mach-E or the Bronco that will be coming soon?  I'd say these are ground breaking for Ford.", "score": 1, "replies": []}]}, {"body": "Ford cars are shit, maybe that's why their stock is low?", "score": 0, "replies": []}, {"body": "Beer virus did some poo poo", "score": -2, "replies": [{"body": "Well I don't think it's just because if the Coronavirus, if you look at a stock price chart for Ford in the past year you will see that this had been going on for way longer.", "score": 3, "replies": []}]}, {"body": "He said tesla 😂😂😂🤦🏻‍♂️", "score": -5, "replies": []}]}
{"title": "Dow set to drop 600 points after Thursday’s massive tumble amid coronavirus fears", "selftext": "https://www.cnbc.com/2020/02/27/dow-futures-fall-100-points-after-another-massive-rout-amid-coronavirus-fears.html\n\nThis is getting ridiculous now.", "id": "faqxep", "created_utc": 1582873977.0, "score": 86, "upvote_ratio": 0.9, "num_comments": 24, "comments": [{"body": "The train is obvious and coming and all of you are holding on.\n\nGodspeed", "score": 41, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "A rough ride indeed brother.", "score": 1, "replies": []}]}]}, {"body": "Stop talking in points !", "score": 24, "replies": [{"body": "but it’s all a game, if i turn off robinhood those points don’t matter anymore", "score": 5, "replies": []}, {"body": "Also the Dow is just a bad metric. So many more useful ones out there.", "score": 5, "replies": []}]}, {"body": "Stocks are on a fire sale. Next year you'll be wishing you bought at this price.", "score": 11, "replies": [{"body": "We're having a FIRE! Sale!", "score": 4, "replies": []}, {"body": "Next year we'll all be dead, so it's actually our descendants who will be wishing we bought.", "score": -3, "replies": [{"body": "What is the cause of death? Alien invasion?", "score": 2, "replies": []}, {"body": "Ah I forgot about that", "score": 1, "replies": [{"body": "It's one of two things that are certain.", "score": 1, "replies": []}]}]}]}, {"body": "> This is getting ridiculous\n\nOut of curiosity, what makes you say that?", "score": 4, "replies": []}, {"body": "Woohoo alrdy bought my Puts. Free money!", "score": 2, "replies": [{"body": "What did you do?", "score": 1, "replies": []}]}, {"body": "People panic in the stock market when they should take advantage of this drop", "score": 2, "replies": [{"body": "Not if it’s gonna fall 30% more lol", "score": 3, "replies": []}]}, {"body": "Given how high volatility I'm thinking of selling covered calls against my portfolio but after 6 red days it might rally next week which would mean I get all the downside and no upside. \n\nA weekly call 10% above the current price is worth 0.2% on QQQ.\nOn AMD a weekly OTM call 14% above the current price gives over 1% weekly.\nWith these high premiums why not sell options against your portfolio instead of just holding", "score": 1, "replies": []}, {"body": "As a beginner in canada, wheres a place I can buy without a 1000$ minimum requirement? Looking to start with 100$ or so. I'm seeing this massive drop and it's a good opportunity, but I dont want to dump 1000 rn.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ty.", "score": 1, "replies": []}, {"body": "It actually does not allow accounts from outside the states, is there another option?", "score": 1, "replies": [{"body": "Fidelity or Charles Schwab are also good Brokerages.", "score": 2, "replies": []}]}]}]}, {"body": "all fake too \n\njust to wipe away money from average investor 401ks", "score": -15, "replies": [{"body": "Lol", "score": 5, "replies": []}, {"body": "But they'll never get my buried gold! eheheheeheh", "score": 2, "replies": []}]}]}
{"title": "Trump’s ego could cost us a recession", "selftext": "If this Coronavirus impact divulges into an economic panic and recession, the Fed will have zero tools left to fight it. At Trump’s command, the Fed has spent its biggest resource doing “not QE” and rate cuts to pump the already-inflated markets to make him look good.\n\n\n\nApologies if this is getting too political for this sub. I just think this type of recklessness for the sake of image is really dangerous.", "id": "faweyq", "created_utc": 1582903981.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 22, "comments": [{"body": "How are your 409k's doing?", "score": 6, "replies": [{"body": "well, I’ve tripled my portfolio since this dip started so i’m doin alright\n\n\nand that’s a moot point, my whole argument is he’s spent the biggest recession-fighting resource on pumping the market. *of course* things have gone up (till last week). that’s my whole point?", "score": -6, "replies": []}]}, {"body": "I looked at Sanders tax plan..... Probably not going to vote for him.\n\nNot going to pay for someone to get a degree in something that's useless.", "score": 3, "replies": []}, {"body": "A reminder to everyone, please focus on how this is going to affect a specific stock or the stock market in general.\n\nIf your comment is pushing political agendas, memes, insults, trolling, etc then your comment is going to get removed and/or get you banned.\n\nIf you *have* to discuss just the politics, then post this topic to r/PoliticalDiscussion without linking back to r/stocks, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "QE has been happening since 2011", "score": 1, "replies": [{"body": "not to this level it has not", "score": 1, "replies": [{"body": "QE1, QE2, QE3, QE infinity", "score": 1, "replies": []}]}]}, {"body": "I'm not going to lie, I am definitely left on the political spectrum. But I do feel Trump is treated unfairly by the masses and media.\n\nHowever.... in this case, I don't like how he is acting and handling this. People are losing their minds. And he:\n\n\\- appointed Mike Pence to handle this. I don't trust this man regarding anything to do with science or health.\n\n\\- He and others are already blaming potential democrat candidates for this fall. Which makes no sense, imo. They have been in contention for years and the market hasn't fell like this. This downfall is 99% because of a combination of the virus and people at the end of a 10 year bull-run wanting a reason to cash out ( can't blame them).\n\n\\- I watched his response to the virus last Wednesday and he used it as a chance to take jabs at Democrats like Pelosi. I don't like Pelosi tbh. But that was not the time. He keeps saying \"We are on the same team for this\" but then insults them. Ok bud. You're not helping.\n\n\\- He was basically telling us this is going to be ok and it will end eventually. But fails to realize this is global.\n\n&#x200B;\n\nI bought a ticket overseas this summer. And I might have to cancel because it's growing in Europe.\n\nI stopped ordering products online because they are probably made in China.\n\nI'm sure millions of other Americans are doing the same. This will affect the economy and market for the next few months if it is not stopped.", "score": 2, "replies": [{"body": "> - He and others are already blaming potential democrat candidates for this fall. Which makes no sense, imo. They have been in contention for years and the market hasn't fell like this. This downfall is 99% because of a combination of the virus and people at the end of a 10 year bull-run wanting a reason to cash out ( can't blame them).\n\nExcept that healthcare stocks are falling faster than the broader market. That doesn't make any real sense if this drop is driven by coronavirus. It makes perfect sense if the drop is a combination of coronavirus and worries about a left wing Democrat winning.", "score": 1, "replies": []}, {"body": "Oh I agree he’s been treated unfairly, and often I’ll actually *read* sensationalized anti-trump news pieces and realize they’re dumb and unfair.\n\n\nHowever, I feel like his aggressiveness with rate cuts can easily turn around to bite him, and it’s only purpose was to pump markets and make himself look good. Am I wrong? (genuine question, i’m pretty new to all this)", "score": 0, "replies": []}]}, {"body": " I blame the President Trump because if he did what he said about bringing all the jobs back from China back to the USA like he promised, our stocks wouldn't be heading south.. Trump high economy might be the lowest we have seen because of Bad Promises and Lies.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "I’m not saying I agree with he and his supporter’s agendas of “burn the rich”. I’m just commenting on what I think has been [happening](https://markets.businessinsider.com/amp/news/trump-it-would-be-great-fed-slashed-rates-dollar-tweet-2019-12-1028769616) under Trump.\n\n\n\nI will say though, I don’t think any politician, regardless of party, is going to destroy the 401Ks and retirement accounts of millions lol. That’s just fear-mongering. \n\n\nI don’t think raising wealthy and corporate taxes (something which many billionaires openly support), is synonymous with destroying the stock market. In fact, fixing the wealth gap will give millions of people more capital to spend and more access to the market, increasing economic productivity", "score": 2, "replies": []}, {"body": "I'd be willing to give up some market returns for some social safety nets", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I am in no way a sanders supporter and think Medicare for all right of the pat is a really bad idea.  but the answer to this question is actually big Yes.\n\n\nMedicare has an overhead of 1% compared to 20% insurance industry have, car insurance on the other hand only have a 4% overhead. This huge overhead does nothing but waste everybodies time pushing papers denying claims, then pushing more papers appealing said denials. On the whole Medicare pays for about 50% of the care provided in the US and it does so with half the price the insurance companies do. My gripe with the idea of Medicare for all as sanders/warren puts it is that they are not being realistic about were the funding comes from or distributed. My hopes are on Bezos Amazoncare experience to disrupt the health care delivery system. \n\nRegarding social security, this program is actually doing amazingly well considering what it does. It is a freaking miracle it is still alive. This program was started at a time where the US population was growing and people would retire at 65 and die at 70. Now people retire at 65 then go on to live 20+ years, and the US population stopped growing, which means less worker to fund it. So yah it should have run out of money decades ago.", "score": 0, "replies": []}, {"body": "No, but fucking it up is better than it not existing at all", "score": -1, "replies": []}]}]}, {"body": "Less than 50% of Americans have a 401k.", "score": 1, "replies": [{"body": "yeah but haven’t you heard the message? as long as *you* have one, fuck em!\n\n/s", "score": 1, "replies": []}]}]}, {"body": "What do you mean zero tools? They have the same tools they had last recession. There's a lot more buying they can do before it enters complete meltdown-mode, which I don't think will happen btw.", "score": -1, "replies": [{"body": "The biggest tool is rate cuts. We need at least a ~5% cut to fight a recession\n\n\nThink we should go negative?", "score": 3, "replies": [{"body": "They will cut rates, that's already a given because the market is clearly showing \"signs of weakness\" now. They will also launch another QE with more to pump up the market again.\n\nUS and a few other countries are probably the best ones to combat an upcoming recession if it actually happens. The ones that should fear it are Asia and Europe, it doesn't mean US will just sit there and wait it out.. but they will be able to MANAGE it better.", "score": 0, "replies": [{"body": "Problem is it’s a supply shock. Fed can only control nominal rates to affect demand shocks and what not. We are already planning 3-4 cuts from the 1.5% we are at right now", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": -6, "replies": [{"body": "This has nothing to do with trump so idk what you’re talking about", "score": 5, "replies": []}]}]}
{"title": "MSFT will Rise Again", "selftext": "[deleted]", "id": "fayxw6", "created_utc": 1582913535.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 20, "comments": [{"body": "Wait wait wait....what????\n\n“Corona has no connection to stocks”...tf is this? 🤣\n\nBruh. Corona has brought China to a screeching halt. Guess who has a LARGE chick of their supply chain in China? 2/5-4/5 companies in the S&P. Guess who’s going to feel it? Wall those companies. \n\nGuess what will happen to companies that feel it? Stocks drop.", "score": 16, "replies": [{"body": "Microsoft has zero of their supply chain affected by China.  \n\nAnd for companies they sell to, if company XYZ was convinced in Dec 2019 that they needed to buy MSFT software, then they still need to now.  Even if travel or virus priorities mean company XYZ has to pause whatever their Microsoft-related project is, they'll be resuming it soon.  That's *not* the case with say cruise lines.  If they cancel cruises, they're not making that revenue back, ever.  And if the cruise line isn't buying fuel, that's never being made back either.  Microsoft's revenue isn't going away.  Worst case it's shifted to make next quarter bigger.", "score": -2, "replies": [{"body": "Guess who sells to companies effected by the China slow down? Guess who’s going to be effected? ATM, I’m shorting tf out of everything. You keep DCAing. We’ll see the greater percentage in 4 months. Want to throw a remind me on it...feel free", "score": 3, "replies": [{"body": "I don't follow people who make 3rd grade spelling errors and who are so anti-reading they think I've ever endorsed DCA.  I could go on and point out that Microsoft doesn't sell much into China, but considering who I'm addressing, things like facts and data mean as much to you as diamonds mean to a dog.\n\nBye child.", "score": 1, "replies": [{"body": "If your best comeback is to point out the difference between affect and effect...you’re not going far in life\n\nHave fun with your portfolio over the next couple weeks\n\nEdited", "score": 1, "replies": [{"body": "> If **you’re** best comeback \n\nIt just illustrates you're as illiterate as you are ignorant as you are socially stunted as you are subject matter impaired.", "score": 1, "replies": [{"body": "Autocorrect. Good catch. None the less. If your beat comeback is spelling. God help you", "score": 1, "replies": [{"body": "> Autocorrect. Good catch. None the less. If your **beat** comeback is spelling. God help you\n\nThis just confirms you're an insecure liar, in addition to your other collection of crippling defects.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not true. Microsoft already announced they would miss on computer sales. Most of their consumer devices are manufactured in China.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They haven't said so.  I'm actually unphased by that as consoles are usually a loss leading business and I question whether either they or Sony even need to be rushing into a next generation console so quickly anyway. Usually consoles are profitable in the mature end of their life span, so you want to stretch out that tail anyway. \n\nUnless the new console has some revolutionary benefit to MSFT's bottom line that I haven't heard about, then a console launch delay might give them a\nlonger soak in the profitable portion of their current console life span.", "score": 1, "replies": []}]}, {"body": "> Microsoft has zero of their supply chain affected by China.\n\nThey just warned of a guidance miss in their Windows segment related to the effects of OEM factories shutting down. This is technically customers of theirs, not their internal supply chain, but still.", "score": 1, "replies": [{"body": "It's the opposite of their supply chain, it's demand side.  But it's something that just defer the revenue, not cut it.\n\nIt's much like Home Depot, when a late spring hurts their Q1 and the stock gets hit, I buy more because every dollar of those sales just comes in when the snow melts in Q2.  Nothing's lost, just shifted.  I think MSFT will get those Windows payments after a short delay.  I kind of think they might be sandbagging or just getting out in front of news that will be obvious by the next ER anyway.", "score": 1, "replies": []}]}, {"body": "It would be better if you read the news before wormy anything stupid like this. Microsoft is already gonna miss the earnings expectation because of the virus. I guess it's just coincedence. Right?", "score": 1, "replies": [{"body": "> It would be better if you read the news before wormy anything stupid like this. \n\nStupidity plus irony equals you.", "score": 1, "replies": []}]}]}]}, {"body": "It's worth nothing that even though you (and I, to a certain extent) say that Microsoft isn't connected to corona virus, they issued a statement disagreeing.  They said they're going to be hurt by delays with other companies.  \n\nIt's also worth noting that for much of last year, all buyers and sellers were mostly in agreement that MSFT was worth $140.\n\nMy argument is that since the days when $140 was the well established fair value, we've learned that azure is performing well.  So the question becomes what the premium should be for that piece of information.  $10/share?  $18/share?  $60/share?", "score": 5, "replies": []}, {"body": "msft at 160 was a great deal.  It's even lower now.", "score": 4, "replies": [{"body": "Yup, jumped in on 151. It even was 143 yesterday, but timimg the market and such..", "score": 1, "replies": []}]}, {"body": "Cept everything isn’t on sale yet.", "score": 6, "replies": []}, {"body": "Sold mine today thinking i can get in lower, right or wrong im not sure yet but i was green anyways.", "score": -3, "replies": []}]}
{"title": "College Freshman With ~3-4k To Invest", "selftext": "I have a total of around ~8k. I'm attending University with quite little cost because my parents are helping me pay some, along with grants and scholarships. I'm planning on moving off campus next semester with some friends, which would make the bill for University $0 when taking out the dorm and meal plan costs. \n\nI say 3-4k, because I plan to split the remaining 3-4k for 1) Emergency fund of around 2k. 2) 2k for casual spending and rent for next year. In the summer I'm planning to get a job and earn another 5k, and I'm about to get a job really soon as well in the next 2 weeks, hopefully earn 1-2k before the summer starts. If I need additional financial assistance, my parents who live in Boston will be able to provide for me as well although Im trying my best to not rely on them.\n\nAnyways I've had that money for a while now and I haven't thrown a single penny into the market, as for the past few months, everything has been rising and I kept having the mindset of buying in low and selling high and wasn't thinking about investing for the long term. Pretty lucky since the coronavirus virus thing happened and now everything is dropping. I finally decided that I'm going to invest for the long term, as in around 10 years, or longer.\n\nI'm not a big spender and don't really need this 3-4k, so I was thinking about investing this for the long term. I'm planning to spend around 60% of the money on index funds like SPY or VOO, but I'm struggling trying to decide how the rest of my portfolio should be. I know since it's for the long term, I should probably invest in large stable companies that are going to survive this Coronavirus situation and possibly an upcoming recession. However 3-4k really isn't that much, so I'm hoping for some guidance.\n\nI believe the markets going to continue dropping, so I was thinking of \"riding the wave\" , investing in 1/3 of my money at a time and then another 1/3 when it drops a bit lower. I've never actually invested and only really got interested in the world of investing the past few months.\n\nAny help is appreciated! THANK YOU!\n\nEdit: Thanks for all the replies and advice! I read them all and will surely take them into consideration when picking my stocks this week. Still just a noob and learning every step of the way.", "id": "fb1fqq", "created_utc": 1582923265.0, "score": 9, "upvote_ratio": 0.84, "num_comments": 22, "comments": [{"body": "Wait until they start picking up bodies on the street", "score": 23, "replies": []}, {"body": "I like that you’re planning to put 60% in SP500 ETFs, that’s always a solid investment.\n\nFor the rest, I recommend stocking up on some tech companies while they’re low. Microsoft, Apple, Google etc. AMD and Nvidia are personal favorites of mine.", "score": 8, "replies": [{"body": "Yes, these were some of the companies I was thinking of putting money in, I just wasn't quite sure. Thank you for helping me set my mind.", "score": 2, "replies": []}, {"body": "This is smart advice. \n\nMSFT, AAPL, V, QQQ, GOOGL, AMZN are my favorites.\n\nbut VOO and VTI are great choices too!", "score": 3, "replies": [{"body": "VTI usually outperforms VOO", "score": 2, "replies": [{"body": "i love both haha, i usually split them like 50/50, i like large caps a bit more", "score": 2, "replies": []}]}, {"body": "I'm still a noob and only learned of the ETFs like SPY and VOO, everyone's talking about VTI which I haven't looked into yet. Looks like I have a bit more digging to do. Thank you!", "score": 1, "replies": [{"body": "SPY and VOO are similar since they both track S&P500\n\nVTI tracks the whole US stock market\n\nThey move in similar directions and you wont go wrong with any of these", "score": 1, "replies": []}]}]}, {"body": "Or just VGT", "score": 1, "replies": []}]}, {"body": " Invest in long term 5-10 years, think about the company, does it have grow potential or do you want only get dividend? My strategy is to buy many stocks as possible and then forget and wait for grow. lol", "score": 3, "replies": []}, {"body": "All tesla calls.", "score": 5, "replies": [{"body": "100%%", "score": 1, "replies": []}]}, {"body": "QQQ", "score": 2, "replies": []}, {"body": "man screw a portfolio. i’m a senior started trading options with 5k. check my posts on WSB, Make puts on the S&P500 for the next two weeks and you’ll have 20k in no time.", "score": 2, "replies": [{"body": "This is him Officer", "score": 5, "replies": []}, {"body": "Lol", "score": 1, "replies": []}]}, {"body": "It’s a good time to get into [VDIGX](https://www.morningstar.com/funds/xnas/vdigx/quote). Set it and forget it.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "No.", "score": 2, "replies": []}]}, {"body": "I’m not even going to read this because the answer will always be the same.\n\nVTI", "score": -1, "replies": [{"body": "VTI is like +40% in 5 years. You can do sooooo much better very easily with barely any risk.", "score": 1, "replies": [{"body": "How’s that?", "score": 1, "replies": []}]}]}]}
{"title": "What about AAPL and MSFT", "selftext": "With AAPL I am at +70% (I was 105% before the drop) so no plan to sell.\nMSFT jumped back to the price I bought them.\nWhat shall I do with them?", "id": "fb1pdh", "created_utc": 1582924287.0, "score": 13, "upvote_ratio": 0.84, "num_comments": 21, "comments": [{"body": "MSFT is a great company, hold onto it.\n\nThe way things are going for Azure I could see them continuing to go up a lot more in the long term.", "score": 6, "replies": []}, {"body": "Hold it... feds stepped in to save the market those companies will rally", "score": 21, "replies": [{"body": "Source?", "score": 5, "replies": [{"body": "Personally, I can't see why everyone is taking this so positively when it seems like it's just the Fed saying \"maybe\" but it could be that there is more to it.\n\n[https://www.politico.com/news/2020/02/28/interest-rate-cut-federal-reserve-118207](https://www.politico.com/news/2020/02/28/interest-rate-cut-federal-reserve-118207)", "score": 6, "replies": [{"body": "We’ve got like 2% more in drops before feds run out of QE cash. This is like 8 cuts in total. If this cut brings the market out, we’re G2G. If not, we have a few more pumps before we’re really 2008 SOL", "score": 3, "replies": []}, {"body": "I think this just shows a lot of people are on the sideline waiting for that ‘bottom’ to buy back in", "score": 5, "replies": [{"body": "It’s almost like investors have come to depend on the Fed put to set the bottom.", "score": 1, "replies": [{"body": "Yes, I think they believe the current government will try to do anything or their best to keep the market up for the re-election coming up this year.", "score": 2, "replies": [{"body": "They are probably correct. I miss the days when smart investors were rewarded for accurately pricing equities.", "score": 1, "replies": []}]}]}]}]}, {"body": "I don’t know exactly where but it was an article that stated feds will intervene to prevent a market crash", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "They’ve done it before", "score": 1, "replies": []}]}]}, {"body": "hold, or buy more if you've available funds, June and July would be when market normalizes itself...", "score": 4, "replies": []}, {"body": "If you don't need the money right now, I don't see a point of selling.", "score": 9, "replies": [{"body": "Could try to cut out the bottom?", "score": 1, "replies": []}]}, {"body": "Personally see those companies as long term investments. I would hold on to them for 5, 10, 20 years etc... it’s a down turn right now for sure but you’re still in the green.", "score": 3, "replies": []}, {"body": "Anyone’s input on buying them now? \n\nI’m waiting for a things to dip farther.", "score": 2, "replies": [{"body": "I bought a tiny bit of AAPL (5 shares) and I'm actively monitoring the dip to see if I can buy more", "score": 2, "replies": []}]}, {"body": "Definitely hold thru on AAPL, you have nothing to worry about if you're 70 percent up on your investment. MSFT, if you're holding more than 2 years is definitely worth holding, and buying more in a month or two. Or buy a little at a time on the way down or up. This is a great time for investors to readjust their portfolios", "score": 1, "replies": []}, {"body": "AAPL bought in Jan 2019, one year ago, MSFT bought in Jan 2020. For MSFT I am 5% up, not that much.\nBut I am worried about APL (Alpha Pro Tech). Bought at 20 Eur and yesterday I missed the sell because of work. At evening now they were at 19. I hope on Monday they go up at least at 25 to sell them", "score": 1, "replies": []}, {"body": "Keep it. Sell 70% of apple to keep profit and dump into microsoft, or just do nothing as it was /is a correction and will eventually return to normal when the coronavirus isn’t in the news anymore.", "score": -7, "replies": [{"body": "My idea is to keep both of them..\nI think the will return to run after virus \n\n\nmissed today the peak of APL at 40Eur because of work, now it crashed. Hope for a small peak on Monday", "score": 3, "replies": []}]}]}
{"title": "Death of a 🌈🐻 retail trader (irony inside)", "selftext": "Disclaimer: i am completely aware all of this is the result of my own personal mental deficiencies. Fuck off in advance.  \n\nSo i started trading options when i found WSB’s back in 2018 by promptly downloading RH and buying a call at the top of IQ back when it was the meme of the day. Since then i’ve gotten really into trading in general and put in countless hours of learning TA, different types of strategies, the market nuances, listening to podcasts, watching videos and winning and losing. Going from individual memes like NFLX, AMD, and even boomer shit like PFE and BA. \n\nAnd before you neckbeards and prepubescents knock TA i’m talking about support, resistance, trendlines and shit that’s relevant. Not the voodoo magic some of you refer to. \n\nI graduated into just playing the ETF’s like SPY, IWM, SMH and so on. I was basically a permabear veteran during the tradewar of 2019 and took a bear last stand at $304 on this last breakout and got blown up. I slowly built my account back up after licking my wounds and accepting that daddy jpow took the wheel. I was still a 🌈🐻, but hiding amongst you. Waiting for my triumphant correction to finally get that 10 bagger and the PTD minimum in my account. \n\nI started getting into futures and futures options. Shit like commodities and overall just spreading my autistic wings. Playing oil, silver, gold, T-bills. Taking wins and losses. \n\nFast forward to last month i had a couple strangles when the beer virus news broke. Played the dip we had a few weeks ago and went and got my bear suit back on. I bought monthly and weekly SPY puts, only to have china pooh bear execute market rescue 2020. I averaged down, rolled, and ended up with 6x 300, x2 298, x2 309, x1 323 puts. This basically almost bled me completely dry but i started trading the micro futures and got bent on those. With $100 left in cash and only $69 in net liquidity on my puts I revenge traded some ES 0 day options and got enough back for an M2k contract. The only ones still in play by the beginning of this week were the 309, and 323 puts and enough margin for an m2k. I shorted at the last minute of futures last friday. Market open Monday i closed my puts because IV was so high and didn’t wanna roll, also was in and out of some MES contracts. It was an $800 day for me. \n\nHere’s where the irony starts:\n\nThinking that a 100 point down day was excessive. I fucking went long. And it even gets more autistic - i went long an MES AND an M2k contract. With 0 downside protection, and no stops expecting a bounce and didn’t want to get stop hunt over night. SUREly the bulls would not allow such heresy of a -100 point day. Plus, we have qe that’s not QE, and all the other fuckery that was going on the past 15 weeks. \n\nThis was my moment. The moment i’ve been waiting for.\n\nHAHA SURPRISE. JOKES ON ME. Sure as fuck i wake up, only $10 underwater, ok. Fucking fell back asleep (i’m on the west coast). Wake up to half my account being fucking evaporated. Down another 100 fucking points. Surely we’ll bounce here i told myself. Two -100 point days in a row? Noooooo. Can’t be. Spoiler - there was no fucking bounce. \n\nSure as fuck, we have the fastest correction in US stock market history THE ONE FUCKING TIME I GO LONG on a bounce. I’ve literally waited over a year for this moment, and i fucking longed and got burned. TW’s liquidated my account this morning. Thankfully i’m only -181 with them. But i’m out. I got laid off last week from my job and was excited to be able to trade actively and can’t afford to put anything else in for the time being. \n\n15 weeks of gains lopped off in 7 days. Multiple trillions dollars of value wiped out. No resistance. No bounce. This was fucking insane. At least i got rekt on something historical. Even though i should have been rolling in tendies right now shopping for yachts and negotiating with JP Morgan about getting in on their next cocaine shipment. \n\nThe worst part is i can’t even afford decent booze or things you commonly do while drinking good booze. \n\nTiMe In ThE mArKeT iS mOrE iMpOrTaNt ThAn TiMiNg ThE mArKeT. \n\nTL;DR: get fucked. Use stops. Hedge your positions.", "id": "falnzs", "created_utc": 1582848556.0, "score": 42, "upvote_ratio": 0.92, "num_comments": 26, "comments": [{"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 34, "replies": [{"body": "Good bot", "score": 8, "replies": []}, {"body": "Maam, this is a Wendy", "score": 3, "replies": []}]}, {"body": "You need to fully embrace your 🌈🐻 pussy", "score": 9, "replies": []}, {"body": "Sell the house, go short.", "score": 9, "replies": [{"body": "I fucking rent.", "score": 6, "replies": [{"body": "You shud ve trusted the gay in u", "score": 8, "replies": []}]}]}, {"body": "Real talk how much did you lose?", "score": 6, "replies": [{"body": "Not as much as some of the others around here. But trading was like my hobby. Something i spent like majority of my free time on. Kept me out of trouble. At the beginning of the year i started with $500 after taking a lick on end of year volatility. P/L YTD is -2100", "score": 4, "replies": [{"body": "Oh Jesus I thought it was much more. You're fine brother. You will rebuild.", "score": 6, "replies": [{"body": "Nah, i lost way more on my last stand at $304 back in the fall. And then lost an equally retarded amount going long on 10 yr t-bill futures after that (check the 10 yr t bill chart now) and then again on 2 yr t-bills which in hindsight i was only 1.5 weeks early on. Habitually too early. The problem is i can’t reload my account to get back into the game and i think the irony of this L deserved an F from the autist community.", "score": 1, "replies": []}]}]}]}, {"body": "I’ll pay like $10 for a pic of your feet", "score": 8, "replies": [{"body": "OP I suggest you take his offer. That’s like a six pack of Mike’s Hard Lemonade", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Thanks bb", "score": 1, "replies": []}]}, {"body": "F", "score": 3, "replies": []}, {"body": "You don’t need good booze right now. What you need is a handle of JW Black. Finish it within 2 days. Rinse and repeat until you get your head back on straight and figure out the next step. Also post pics.", "score": 2, "replies": [{"body": "The advice and support i really need.", "score": 0, "replies": []}]}, {"body": "You were holding out for a correction you were too retarded to notice until it was a 100-foot flagpole up your ass. Excellent work.", "score": 2, "replies": [{"body": "I mean yea, exactly. But how often do we have an entire market wide correction in 4 days? Hint: not in our lifetimes.", "score": 1, "replies": []}]}, {"body": "RIP always sad to see a brother 🌈 🐻 go down.", "score": 2, "replies": []}, {"body": "🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈", "score": 2, "replies": []}, {"body": "Ill stick to voodoo magic i guess", "score": 1, "replies": []}, {"body": "I did similar. 2018 fall fresh plus trade war in 2019 so when we rallied oct to feb I disnt trust much. Got out of positions quick didnt hold. I made a lot but could have made a lot more. Then 2 weeks ago i do some of my biggest plays and say ill hold like i usually dont at the first sign of reverse, i said only thing that can hurt me is a correction, and here we are. I also usually hedge but didnt for some reason. Unlike you i live to fight another day, didn't lose everything. Actually still up for the year, but it hurt. So i learned to just trust my method, fast in fast out", "score": 1, "replies": [{"body": "Just another expensive learning lesson. I’ll be back eventually. Just with the circumstances i’m on a mandatory hiatus until i get another job.", "score": 1, "replies": []}]}, {"body": "If all you fucking retards load the put we can get this market pumping again", "score": 1, "replies": []}]}
{"title": "R POLITICS USER PREDICTS RECESSION! DD INSIDE", "selftext": "[removed]", "id": "fam179", "created_utc": 1582850124.0, "score": 13, "upvote_ratio": 0.81, "num_comments": 16, "comments": [{"body": "ok", "score": 9, "replies": [{"body": "ok", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": []}, {"body": "ok", "score": 3, "replies": []}, {"body": "ok", "score": 3, "replies": [{"body": "Oooootaaaaay", "score": 1, "replies": []}]}]}]}, {"body": "Recession officially cancelled, we will now back to regularly scheduled bull run, DOW 30,000 next week", "score": 5, "replies": []}, {"body": "Lol enjoy your losses", "score": 2, "replies": [{"body": "Gay 🐻 talk right there.", "score": 1, "replies": []}]}, {"body": "Some guy on here said he'd eat a cum sock for SPCE but he didn't", "score": 2, "replies": []}, {"body": "The general idea I agree with. I think the summer will be bullish as Corona is dealt with and the fed pumps to make everyone try to feel better and think everything is good again.\n\n\n\n\nNot sue what long calls are a great idea right now tho", "score": 2, "replies": []}, {"body": "Buying $VIX puts ASAP", "score": 1, "replies": []}, {"body": "🌈 🐻 gang.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Do u retards think people read all this crap", "score": 1, "replies": []}, {"body": "You’re an idiot; this is not going away in summer.  You ever been to Singapore homes?  If that shit can last in Singapore (hotter than balls and up against what is widely regarded as the best healthcare in the world) then it’s gonna fucking laugh at our northern summer.\n\nAlso, my DD post got deleted by mods so I’ll hijack your post to get 2-3 upvotes here instead.  \n\nDD = EXPE is going to $0.  \n\nShort version: with up to 27 day incubation, viral load peak 3-5 days after infection (ie, while many still don’t have symptoms) and, the real kicker, R0 2.2-6.4.  The markets reaction so far isn’t even close to the gravity of what’s about to happen.  Consider how everyone cites 2% mortality but consider that 20% of cases requiring a hospital - your nearest hospital probably only has 100 extra beds (on its best day) once this hits a city and we see 10,000 infected, your 20% “severe” becomes a de facto 20% CFR (means you die).  This is 100x more deadly and (nearly) 6x more contagious than the flu.\n\nThis isn’t the end of civilization, and of course is not the first time the world has seen a pandemic.  However, it is the first pandemic we’ve seen since this crazy new global economy where a company thats only product is booking flights and vacations is worth $14B... this part is new.  And dude when this shit takes hold in earnest, and we start seeing major metropolitan areas under quarantine, and more horror stories about groups of tourists being locked down in their hotels because so-and-so who was there 3 days ago tested positive, etc NOBODY will be booking ANYTHING.  I mean, shit, all the big companies are already “postponing” travel; families are already cancelling existing trips without refunds (eg, AMA), etc and this hadn’t even hit yet.  Fuck, I am not even sure flying will be a legal option in 2 months.  \n\nQ1 earnings (4/30) will be desperate; Q2 will be downright hilarious.  I’m telling you, shit is going to $0 by Q4.  Buy some deep puts and feast with me on these delicious trendies; trendy trendies.", "score": 1, "replies": []}]}
{"title": "Corona Virus is just the needle to pop the debt bubble", "selftext": "[deleted]", "id": "fan9kh", "created_utc": 1582855596.0, "score": 47, "upvote_ratio": 0.91, "num_comments": 20, "comments": [{"body": "Everyone is fully aware of this. Didn't need a Bloomberg article.", "score": 51, "replies": []}, {"body": "[deleted]", "score": 39, "replies": [{"body": "You said so little but you said so much. \n\nBrilliant.", "score": 9, "replies": []}, {"body": "That's the smartest thing I have heard all day.", "score": 1, "replies": []}, {"body": "(•_•)\n\nThe stock market is just...\n\n( •_•)>⌐■-■ \n\nout of stock\n\n(⌐■_■)\n\nFTFY", "score": 1, "replies": []}, {"body": "someone give this wizard an award", "score": 1, "replies": []}]}, {"body": "Wow 8 paragraphs, fucking Michael Burry over here, get a load of this guy", "score": 29, "replies": []}, {"body": "Tl:dr I didnt read this but it probably just is a fancy way of saying buy puts", "score": 8, "replies": [{"body": "I didn’t read it either but I’ll buy calls on this", "score": 2, "replies": []}]}, {"body": ">\tWSB was a perfect example of the over-exuberance in the past few weeks as \"just buy calls, you can't lose\"\n\nHey fuck you and your big words guy.", "score": 6, "replies": [{"body": "I seriously hate big words, so hard to read them.", "score": 1, "replies": []}]}, {"body": "This but unironically. Ride the correction down", "score": 10, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "It seems authentic and you inverse everything on this subreddit", "score": 5, "replies": []}]}]}, {"body": "Mods are just riding the high pumping this sub for subs. Now its hundreds of thousands of rats on an ounce of cheese. We used to chase yachts now were just using gay bear emojis and wishing each other happy cake day.\n\nHope this shit pops hard, and the last 500,000 idiots to download Robinhood and join this sub with $20 go permared.\n\nMaybe then we'll go back to losing real money and doing nice shit DD not bitching about how you dont know the difference between calls and ETFs. \n\nBet yall have girlfriends and shit lol", "score": 2, "replies": []}, {"body": "TL;DR IAMA bear", "score": 1, "replies": []}, {"body": "Just buy puts, you can’t lose.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Man CODX making me rich, 2K at a time", "score": 1, "replies": []}, {"body": "If you've rode it up then time to diversify, they always crash as fast as they climbed", "score": 1, "replies": []}]}, {"body": "So buy strangles cause shits either gonna go wildly up or wildly down and make mad tendies. Got it.", "score": 1, "replies": []}, {"body": "Can you explain why gold has been tanking last several days?", "score": 1, "replies": []}, {"body": "12-36 months? I was thinking the virus will be gone and we won't even remember it after summer.", "score": 1, "replies": []}]}
{"title": "Thailand is next - get them puts ready. DD inside", "selftext": "[deleted]", "id": "fanrxk", "created_utc": 1582857883.0, "score": 25, "upvote_ratio": 0.94, "num_comments": 26, "comments": [{"body": "SHIIIIIIIIET PIMP IMA FUCK WITCHA", "score": 22, "replies": [{"body": "My G 💪🏿", "score": 1, "replies": []}]}, {"body": "I bought my THD puts weeks ago.  3/20 75P and 3/20 80P.  Already up 300%  \n\nEven without coronavirus they are so economically linked to China and tourism that their economy is getting buttfucked", "score": 7, "replies": [{"body": "Been on ewj the same. Have some up 20x lol best hit I ever had. Same scenario but economy is well fucked too. If they cancel the Olympics my July's will print lol. Wierd thing is this shit doesn't totally move with soy or nikkia. I dunno I'm a retard but puts on anything been fire last two weeks", "score": 3, "replies": [{"body": "I see the weird movement too.  It is based on MSCI japan index though which is partly why.  I also think it is moving based on Japanese index futures which is why you see significant moves in a day", "score": 1, "replies": [{"body": "Ah I see Toyota or Mitsubishi as the too holding can't remember. Two weeks ago it underperformed spy pretty heavily, now it's over preforming. Almost like it's making up for it lol. Wish I'd known, Ida sold Monday but holding to expiry now most likely.", "score": 1, "replies": [{"body": "You kind of have to hold till expiry with these.   The volatility is so low you get punished big for not holding", "score": 2, "replies": []}]}]}]}]}, {"body": "I see $THD and a link. Im in right away", "score": 3, "replies": []}, {"body": "Too many words, ticker, strike and exp...", "score": 5, "replies": []}, {"body": "THD has no option volume though \n\nCurrent price is $70.99 and the $70p only had 14 contracts sell all day", "score": 3, "replies": [{"body": "It finally does today but the premiums are way overpriced compared to EWJ.", "score": 1, "replies": []}]}, {"body": "Are people actually making money off country etf puts or are individual stock puts printing more", "score": 2, "replies": [{"body": "I bought EWG and made 112% today, but my TQQQ made way more and volume is way higher, so less scary.", "score": 8, "replies": [{"body": "I sold my EWG right at close and i’m kicking myself. Thinking about jumping back in tomorrow. Are you holding over the weekend?", "score": 2, "replies": [{"body": "I sold EWG today for 112% right before the jump and went all-in on TQQQ puts which closed my portfolio at 137% for the day. Not holding anything over the weekend, just too risky right now. I think tomorrow will be very red again and get me another +100% and then I'm out until Monday at least.", "score": 1, "replies": []}]}]}, {"body": "lmao I made nearly a grand on EWY (Korea ETF) just today man. Individual stocks are extremely risky right now because no one knows how they gonna look tomorrow. Technical analysis doesn't work no more and neither do earning calls.", "score": 5, "replies": [{"body": "Hope you kept some EWY. Korea looks like it’s in the midst of its worst trading day yet", "score": 2, "replies": []}, {"body": "TA never worked.", "score": 2, "replies": []}]}, {"body": "I've made money on them and they started printing before US stocks .  But honestly US stocks had way further to fall.  While asian markets lost 10% and rebounded 5%, we lost 3% and rebounded 10%.", "score": 1, "replies": []}, {"body": "Bought ewj Japan few weeks ago and overall better than spy, but last week the two spy puts I bought printed. Hold some July ewj for if they cancel Olympics. Will be quick flipping soy   only now tho till it bites me think bottoms a ways out yet", "score": 1, "replies": []}]}, {"body": "No volume, buddy", "score": 2, "replies": []}, {"body": "here's the link to a much better scholarly article, probably lots of words you won't understand but the graphs in it actually have all have the data points labeled. He references it in the PDF OP linked.\n\nhttps://www.medrxiv.org/content/10.1101/2020.02.04.20020495v2.full.pdf", "score": 1, "replies": [{"body": "What’s the TL;DR", "score": 1, "replies": []}]}, {"body": "So my trip to Thailand for a thing just got cheaper?", "score": 1, "replies": [{"body": "“For a thing” this man was gonna go see his ladyboy 🌈 “friend”", "score": 1, "replies": []}]}, {"body": "A pdf lmao", "score": 1, "replies": []}]}
{"title": "Do you guys think $NFLX will actually moon during this whole thing?", "selftext": "I've seen it mentioned several times already, about people will stay indoors cuz booze virus bad and they will watch netflix, thus driving the stocks up? What the fuck? A pandemic is not going to suddenly get people to be interested in getting a netflix subscription, people will just do more of their usual hobbies like reading, painting, shitposting or whatever, it literally make 0 sense that netflix will get more than 100 subs out of this shit. If you still don't believe me, let me put it this way: would you buy VZ and CMCSA calls because people will stay indoors and they'll need to use the internet, therefore buy ISP stocks?\n\nTLDR: buy NFLX puts", "id": "faoebh", "created_utc": 1582860711.0, "score": 33, "upvote_ratio": 0.91, "num_comments": 22, "comments": [{"body": "Why read, paint, shitpost, when you can watch netflix tho", "score": 25, "replies": [{"body": "Netflix doesn’t make money when current subscribers binge watch. Only when they get new subs. \n\nEveryone’s girlfriends boyfriend already has a sub. \n\nBUY PUTS", "score": 12, "replies": []}]}, {"body": "I agree lol", "score": 10, "replies": []}, {"body": "Agreed. \n\nWhy do you think Netflix asks “are you still watching?” After you’ve masterbated yourself to sleep to reruns of fixer upper. \n\nBecause they LOSE MONEY when their current users binge watch. \n\nPUTS ON $NFLX FFS", "score": 7, "replies": [{"body": "They pay very little to stream.\n\nBut I think they're capping either way.", "score": 3, "replies": []}, {"body": "Can confirm. Fan of Joanna’s 🤷🏻‍♂️", "score": 2, "replies": []}]}, {"body": "I got puts on nflx. If market drops itll drop, even if delayed reaction.", "score": 5, "replies": []}, {"body": "If everyone is quarantined there will be a baby boom in approximately 10-11 months, those kids will be kicked out at 18 in the post apocalyptic economy of scarce resources.\n\nThen they will all get Netflix. Netflix calls 2038 ez money.", "score": 5, "replies": []}, {"body": "I really want to buy puts but they are soo expensive still!", "score": 3, "replies": [{"body": "How does on tell this?  Serious question", "score": 1, "replies": []}]}, {"body": "I would. I need two wifis to handle the data overload from exotic porn for 3 months\n\nI'm funding netflix to supply this as well", "score": 2, "replies": []}, {"body": "for any fundamental reason? fucking of course not. no fundamentals in this casino anyway, wtf are you doing. if netflix moons it will be because scared traders try to crowd in on some nonsense momentum under logic that falls apart in a second. once they do that then logic doesn't matter.\n\nbut no, netflix isn't mooning", "score": 2, "replies": []}, {"body": "Netflix doesn’t make more money the more you watch it. A few temporary new subs (if they don’t just share logins) really doesn’t warrant the risk imo. Would rather risk it on FB", "score": 2, "replies": []}, {"body": "Check the insider selling dates.  CEO sells so much fucking stock shit drops like 5% every time too. Datacenters and hardware  are prime time with exception of semi's. We need datacenters to do all the algo work to kill your tendies.", "score": 2, "replies": []}, {"body": "Potential Stay-At-Home stocks are expected to benefit slightly.\n\nInternet sales are actually up.", "score": 1, "replies": []}, {"body": "Bank accounts probably close within 2 months of death? Not sure.  I'd say buy calls then puts", "score": 1, "replies": []}, {"body": "Listen you fuck wits, the Iran Ambassador to the Vatican just died to the corno virus. The Pope is currently sick and not travelling with a 'severe illness'.\n\nHigh ranking public figures are going down. Strap in you fucking autist 🌈🐻's, this is going to be a fast descent.", "score": 1, "replies": []}, {"body": "That sounds logical but Netflix is an SP500 component. That means it can be hit by ETF outflows.", "score": 1, "replies": []}]}
{"title": "Re: Re: Recession by 2020", "selftext": "[removed]", "id": "faokrc", "created_utc": 1582861531.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 21, "comments": [{"body": "Ban already", "score": 23, "replies": [{"body": "Bet you buy TSLA @ 421", "score": 5, "replies": [{"body": "Mods where are Ya!", "score": 2, "replies": [{"body": "Buying @ 420 obviously, wtf? @Mods can someone delete this guy? Smh.", "score": 4, "replies": []}]}]}]}, {"body": "Strike prices and exp dates", "score": 5, "replies": [{"body": "Are irrelevant. S&P Puts. Like what doesn’t make sense I’m that statement?! Foolproof moonship right there", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "*bends over* okay.. I’m ready.", "score": 1, "replies": []}]}, {"body": "No positions = BAN", "score": 7, "replies": [{"body": "Punishment fits the crime.", "score": -1, "replies": [{"body": "/u/J_Powell_ate_my_ass", "score": 1, "replies": [{"body": "u/FloydMayweather", "score": 1, "replies": []}]}]}]}, {"body": "This is so try hard it's cringe", "score": 3, "replies": [{"body": "I woke up and didn’t even jerk off; what did you expect? Gotta unleash the retards somewhere.", "score": -2, "replies": []}]}, {"body": "No position = Ban", "score": 2, "replies": []}, {"body": "Ban this loser", "score": 2, "replies": []}, {"body": "Instructions unclear. Longing GFS tomorrow", "score": 1, "replies": []}, {"body": "Here I’ll give you some more down votes for your time.", "score": 1, "replies": [{"body": "Thank you. You’re furthering my perpetual karma death. I respect your commitment.", "score": 1, "replies": []}]}, {"body": "You seriously deserve a ban for this post. No. One. Cares.", "score": 0, "replies": [{"body": "I’m a mammal that cares", "score": 1, "replies": []}]}]}
{"title": "Gay During Recession", "selftext": "Okay I'm just as autistic as the rest of you, (check my comment history for proof)\n\nBut if you haven't already come out of the closet as a 🌈🐻 then you're not going to be making tendies anytime soon", "id": "faq5fn", "created_utc": 1582869541.0, "score": 16, "upvote_ratio": 0.9, "num_comments": 24, "comments": [{"body": "I only have 20 cent buying power", "score": 19, "replies": [{"body": "What about leverage", "score": 5, "replies": [{"body": ".40 cents", "score": 13, "replies": []}]}, {"body": "20 cents buying power and 1000 0.1 cent MSFT bags", "score": 3, "replies": []}]}, {"body": "I just turned gay. Told my girlfriend this morning that I bought puts on basically everything. \n\nShe told me it’s fine, I could still bang her in her ass", "score": 5, "replies": [{"body": "bullshit, your girlfriend has a fat cock", "score": 2, "replies": [{"body": "True. I just sucked it in our new gay Porsche", "score": 1, "replies": []}]}]}, {"body": "how can I short the Catholic Church? The Pope is going down like a priest on an alter boy.", "score": 9, "replies": [{"body": "EWI Puts", "score": 1, "replies": []}, {"body": "Wasn't it the other way around?", "score": 1, "replies": [{"body": "Hmm good point. In that case go long catholic church", "score": 1, "replies": [{"body": "I think that's what got them in trouble", "score": 1, "replies": []}]}]}, {"body": "Ngl but that girl grabbing him did seem to enjoy a good bowl of BATsoup #WuhanStyle", "score": 1, "replies": []}]}, {"body": "Just tell me what to buy", "score": 4, "replies": [{"body": "Long term growth: $DFS, $CRM, $MSFT\n\nShort term: $SPXU (you're not gay if you're buying calls)", "score": 1, "replies": [{"body": "If I gotta be gay I'll be gay for pay", "score": 3, "replies": [{"body": "I’ll give you $5 for a quickie", "score": 1, "replies": []}]}]}]}, {"body": "I've been a bear since the 2000's", "score": 3, "replies": [{"body": "Then you’ve been a broke bear", "score": 5, "replies": [{"body": "To be fair I did put most of my money in CD's before the crash. I had 5-6 percent returns for a good strech. Plus I'm the most frugal guy you'll ever met. I don't spend more than $10k a year.", "score": 1, "replies": [{"body": "This guy uses toilet paper twice, livin large", "score": 7, "replies": [{"body": "As a broke bull I recently discovered that toilet paper has TWO sides", "score": 2, "replies": []}]}]}]}]}, {"body": "Idc, YOLO’ing 20k in SPY puts today in the morning was the best choice ever, already up 113%, and with the drop happening rn? Puts will print.", "score": 1, "replies": []}, {"body": "Can we just admit that you are now a gay bull if you keep buying the dip...", "score": 1, "replies": []}]}
{"title": "CNN Cuts Speaker Off At Press Conference As He Explains Vaccine Is At Least 1 Year Away", "selftext": "Did anyone else notice yesterday on CNN's broadcast of the White House coronavirus press conference that the third speaker after Dr. Pence was cut off as he was explaining how long it would take to release a vaccine?\n\nTo be clear, I went back and listened to the full statement where he says [it will be 1 to 1.5 years before we will have a vaccine](https://youtu.be/83Jv8ILl0Tw?t=1221)\n\nI know it's not new news, but it came as more of a shock that they cut him off mid sentence as if to deliberately stifle the announcement.\n\nHe also stated that [their testing process is no where near conclusive of determining if patients in fact have the Coronavirus](https://youtu.be/aKSPKUB2fYk?t=2766)\n\nBy the way, this is Dr. Anthony Fauci, the national director of the National Institute of Allergy and Infectious Diseases (NIAID).\n\nI know CNN had to get over to their town halls broadcasts and not cause a public panic, but come on. \n\nTl;dr - Vaccine confirmed 1 to 1.5 years away. Bull market fucked. Buy SPY/QQQ/TQQQ puts, SQQ calls.", "id": "faqdjb", "created_utc": 1582870759.0, "score": 55, "upvote_ratio": 0.9, "num_comments": 25, "comments": [{"body": "I didnt notice it because I was watching it on the Yahoo Finance channel like a real trader.", "score": 5, "replies": [{"body": "Real trader. Wall Street Bets. Hah. Good one.", "score": 5, "replies": [{"body": "he said \"like\". it's good to have role models", "score": 3, "replies": []}]}]}, {"body": "Priced in", "score": 8, "replies": [{"body": "Nice try NSA.", "score": 12, "replies": []}, {"body": "People has been saying priced in since Monday, Tuesday, and Wednesday.", "score": 2, "replies": []}]}, {"body": "Great DD my friend. MRNA puts?", "score": 10, "replies": [{"body": "Thanks. Gotta keep your ears open. Maybe, I'm holding TQQQ puts.", "score": 5, "replies": []}]}, {"body": "I was listening to this on the Washington post yt channel and they didn’t cut it off.\nHmmm, our mass media at work.", "score": 5, "replies": [{"body": "Yeah I was like, holy shit.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Yeah I just happened to be at someone's house who had it on.", "score": 1, "replies": []}]}, {"body": "Leading researcher in his field. Cut off. Yeah we’re getting cucked on this drop already. Let the market crash. We gon’ be rich baby!", "score": 2, "replies": [{"body": "Burn baby burn!", "score": 2, "replies": []}]}, {"body": "A vaccine and an antiviral medication are VERY different.", "score": 1, "replies": [{"body": "Cool, so what's the time on an effective anti-viral drug?", "score": 1, "replies": [{"body": "Drugs have already begun testing, so it could be short, bit it could be long, we don't know enough yet.\n\nThe point is, people hear \"it's a year away\" and freak out and they don't even know what that means. A vaccine won't treat infected people anyways.", "score": 2, "replies": []}]}]}, {"body": "Fuck a vaccine. Long GILD.", "score": 1, "replies": []}, {"body": "Man fuck cnn", "score": -1, "replies": [{"body": "Yeah just happened to be on at a friends house", "score": -1, "replies": []}]}, {"body": "That's not shocking. Vaccines usually can't be rushed into market.", "score": 0, "replies": [{"body": "I didn't say it was. I said the shocking part was that they cut him off mid sentance as he was explaining the time frame.", "score": 1, "replies": [{"body": "Wouldn't expect anything less from CNN. Probably reporting on some other meaningless BS.", "score": -1, "replies": [{"body": "They had to cut to a town hall with Michael Bloomberg apparantly.", "score": 1, "replies": [{"body": "Figures. Jews run the media.", "score": -1, "replies": []}]}]}]}]}, {"body": "Fuck me, you really are a retard. CNN is fake news. They have the vaccine. You think the 1% are going to die from a beer virus??? Wake up and smell the coffee. $SPCE 02/28 50c 🚀🚀", "score": -1, "replies": []}]}
{"title": "DIS $100 puts 03/06", "selftext": "Who the in fuck is going to disney world still? Do you want a Corona ridden fuck to sneeze right on you Mickey mouse ear wearing mfs? Seriously this shit needs to go down. I need to get these tendies before they shut down all the stores.\n\nEdit: I'm an autistic so misspelled.", "id": "faqkh9", "created_utc": 1582871841.0, "score": 24, "upvote_ratio": 0.83, "num_comments": 28, "comments": [{"body": "I’m in Disneyland now chump. I say I’ve seen maybe 20 masks. Place is busy, money is flowing.\n\nThat being said, I just don’t think it’s been really understood yet. If this blows up, you’re right, if not you’re fucked.\n\nSide note- Disney + subs would go up if more people are staying home", "score": 27, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yah let’s measure a service that is 6 months old vs one older than your great mammies tits.\n\nAny other googling you’d like to do?", "score": 12, "replies": [{"body": "I'd like to Google some of your great mammies mammaries.", "score": 4, "replies": [{"body": "You’d be disappointed", "score": 2, "replies": [{"body": "How low can they go?", "score": 3, "replies": [{"body": "Until they become balls", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "this is probably when i'd go to disney world just to avoid the lines lmao", "score": 35, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "i mean if we're all broke and dying from the virus might as well have a last tendie and dew party before the end.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Maybe we can all pitch in and rent a trailer.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tourists.\n\nEveryone around the area isn’t going.\n\nBut my family from out of the country just went.\n\nI wouldn’t.", "score": 5, "replies": []}, {"body": "Disney in Japan closed!! news announced earlier", "score": 3, "replies": []}, {"body": "[Tokyo Disneyland ](https://twitter.com/wsbconsensus/status/1233240656883179521?s=21) will be closed from Saturday until March 15th", "score": 3, "replies": []}, {"body": "[https://www.channelnewsasia.com/news/asia/coronavirus-japan-tokyo-disneyland-disneysea-closing-two-weeks-12479658](https://www.channelnewsasia.com/news/asia/coronavirus-japan-tokyo-disneyland-disneysea-closing-two-weeks-12479658)", "score": 2, "replies": [{"body": "Westward Ho! Next stop Anaheim!", "score": 2, "replies": []}]}, {"body": "Hard for Disney to see $100. But nothing’s impossible. New CEO at a time like this is just a fuck up move, not to downplay the CEO as I’m sure he is a smart guy", "score": 2, "replies": [{"body": "Did they announced who's the new Ceo?", "score": 0, "replies": [{"body": "Yeah lol. Robert Chapek who was chairman", "score": 3, "replies": []}, {"body": "Yep, Iger moves to a creative role and oversees the transition until 2021.\n\nHow does anyone make money in this sub without reading news ?", "score": 1, "replies": [{"body": "Cuz all I read is Disney change CEO and I all in DIS puts the next days, because the headline is what the markets reacts to anyway", "score": 1, "replies": []}]}, {"body": "Some jew", "score": 1, "replies": []}]}]}, {"body": "Yeah but what if this makes Disney+ subscriptions explode?\n\nThat’s enough of a growth catalyst to keep investors bullish even if parks close down imo\n\nI can see it fall but under $100? Might be a tough ask", "score": 2, "replies": [{"body": "you’re new here", "score": 7, "replies": []}]}, {"body": "Tokyo Disney is going to be shut down for two weeks. Definitely going to be a major hit. Time to buy puts.", "score": 1, "replies": []}, {"body": "china and japan Disney parks are shut down.  just have to wait and see if they will close socal and florida also", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Oh sorry, last time I check this was WSB not wall street let me analyze and make rational decisions based on logic and numbers.", "score": 1, "replies": []}]}]}
{"title": "Boeing 777 returning back after cracked cockpit window", "selftext": "It is carrying 200 passengers and is being forced to return back to Moscow’s airport.\n\nSource : https://www.mirror.co.uk/news/world-news/breaking-boeing-plane-200-people-21595004", "id": "farbfj", "created_utc": 1582876391.0, "score": 34, "upvote_ratio": 0.86, "num_comments": 19, "comments": [{"body": "I guess pilot heard about corona in Thailand.  Pilot is a hero from saving the passengers from the BEER", "score": 23, "replies": []}, {"body": "Government can't even prop up the whole market anymore let alone BA. Down to 200 she goes.", "score": 30, "replies": [{"body": "this stock is fucking done.", "score": 13, "replies": [{"body": "Imagine being a plane company that can't even design planes anymore.", "score": 23, "replies": [{"body": "being the BIGGEST plane company...", "score": 9, "replies": [{"body": "Complacent and stupid. I'm happy to see them burn. Maybe they'll let engineers run the company again instead of stupid corporate stooges", "score": 10, "replies": []}, {"body": "Hey now I work for them", "score": -2, "replies": [{"body": "Probably not for long with the coming layoffs...", "score": 4, "replies": [{"body": "And the thing is.. I'm not the one afraid of it", "score": 1, "replies": []}]}, {"body": "quit you retard", "score": 0, "replies": []}]}]}, {"body": "imagine being a FED that can't even prop up the economy anymore", "score": 1, "replies": []}]}]}]}, {"body": "BA got +20% when they reported revenue to go down by a third.   \nYou might see a +10% surge here because most people expected them to crash and die and they managed just fine.", "score": 14, "replies": []}, {"body": "Priced in", "score": 26, "replies": [{"body": "Strong windows seem like a real winner in the coming fiscal events of the near or far future", "score": 4, "replies": []}]}, {"body": "Dogs hit company lol", "score": 3, "replies": []}, {"body": "Down BA to the 200 point", "score": 4, "replies": []}, {"body": "If you look at BA's weekly chart, it looks like it's giving us the middle finger.", "score": 3, "replies": []}, {"body": "YeSh!", "score": 1, "replies": []}, {"body": "Damn and I was going to buy puts in the morning..", "score": 1, "replies": []}]}
{"title": "OK Mooner, How high can VIX go?", "selftext": "[removed]", "id": "farvod", "created_utc": 1582879974.0, "score": 14, "upvote_ratio": 0.81, "num_comments": 25, "comments": [{"body": "Probably could get high maybe stay the same, maybe lower, but I’m no expert.", "score": 23, "replies": [{"body": "Thanks for the advice, bought puts and calls and selling puts and calls", "score": 10, "replies": [{"body": "Iron Condor it", "score": 1, "replies": []}]}, {"body": "Damn! Autistic trade guy right on the money again! Is there anything this mam can't do?", "score": 4, "replies": [{"body": "I just can’t seem to miss man. Ever since that day I kissed Kramer on the penis I haven’t been wrong.", "score": 4, "replies": []}, {"body": "Wall Street hates him.", "score": 3, "replies": []}]}, {"body": "Ah yes, spot on advice.", "score": 2, "replies": []}]}, {"body": "There is no theoretical limit. It might get funny.", "score": 3, "replies": []}, {"body": "Bought 03/03 calls @35, 37.5 and 40 at the opening Wednesday morning. Around +400% right now, they should print more during that crazy weekend ahead.", "score": 5, "replies": []}, {"body": "This thing exists?! I missed out on 60% gains!", "score": 2, "replies": [{"body": "I bought some in similar things. I wish I would have bought more.", "score": 1, "replies": []}]}, {"body": "You know it'll be bad when WSB is posting this late into the night/morning.    \n      \nI wonder how wide a bull butthole can stretch. It must be really wide to get the horns out when they birth more bulls.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It never went to 44,000 and I hope you’re joking", "score": 2, "replies": []}]}, {"body": "All in TVIX", "score": 1, "replies": []}, {"body": "So it's not too late for VXX calls? I'm soo fucking mad I didn't come across this but it looks like it can go much higher. Thinking about buying $25-$26c for end of march", "score": 1, "replies": []}, {"body": "Yes", "score": 0, "replies": [{"body": "Between 69 and 420.", "score": 2, "replies": [{"body": "Nice", "score": 1, "replies": []}]}]}, {"body": "Look at the fucking chart you god damned plebian. Fuck.", "score": -2, "replies": [{"body": "I did look at the chart you asshole. You asshole, my question is a valid one and relates to future potential rather than historical performance.", "score": 3, "replies": [{"body": "Derka derk", "score": 1, "replies": []}, {"body": "Jesus fuck. Whatever you do don’t buy spy puts. Just calls. SPOILER. IT CAN GO MUCK FUCKING HIGHER. EVEN NEW ATH HIGHER. Watch the bond market. Bonds go down volatility goes down. Bonds at records.. \n\nAnd if you actually looked at the chart you understand the historicals you rucking autist.", "score": -1, "replies": []}]}]}]}
{"title": "08/16/2018 $WMT 19,000 Short Position UPDATE!", "selftext": "[deleted]", "id": "faw50j", "created_utc": 1582902861.0, "score": 20, "upvote_ratio": 0.88, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 19, "replies": [{"body": "sure........but this required pressing a couple buttons instead of working 40 hours a week", "score": 5, "replies": []}]}, {"body": "i bought a single egg today", "score": 4, "replies": [{"body": "More stable asset than SPY. I’m in for 3/20 EGG calls.", "score": 1, "replies": []}]}, {"body": "Yeah,  small money but wasn't sure to bet against wall mart (love that place) but thought fuck it.\n\nhttps://imgur.com/a/fA2qP0x", "score": 3, "replies": [{"body": "Should have held but profit is profit. Well done.", "score": 3, "replies": [{"body": "Yeah you are completely right, 1,000% was pretty sweet though.  I have a few other sketchy options (High risk but crazy profit potential) expiring today and currently going the wrong fucking way. So wanted to at least not lose money if the others go wrong.", "score": 2, "replies": [{"body": "I sold yesterday too. Paper hands...", "score": 1, "replies": [{"body": "Pretty new to this so but paper hands are def softer on my skin at the moment.", "score": 2, "replies": []}]}]}]}, {"body": "Did you make any more $WMT plays? The printer is still running son.", "score": 1, "replies": []}]}, {"body": "congrats I guess", "score": 2, "replies": []}, {"body": "You can shop at TGT now", "score": 2, "replies": []}, {"body": "Did you close position?", "score": 2, "replies": [{"body": "Yes I did. I held one out of 66 just for good measure.", "score": 1, "replies": []}]}, {"body": "I called it 2 days ago. Less waiting... lol \n\n&#x200B;\n\n[WMT Put's](https://www.reddit.com/r/wallstreetbets/comments/f98o73/daily_discussion_thread_february_25_2020/firc6il/?context=3)", "score": 1, "replies": []}, {"body": "Dude you made 20k on a two year play? Half the retards here made twice as much today in the span of jerking off to sexy covid", "score": 1, "replies": [{"body": "I'm just here for the upvotes fam. Who cares about the money", "score": 1, "replies": []}]}, {"body": "\"this was a pretty dumb YOLO\"\n\nlmao dude smart yolos dont exist...thats why theyre called yolos", "score": 1, "replies": [{"body": "Yeah, the smart thing to do is to sell spreads. Works until it doesn't!", "score": 2, "replies": []}]}, {"body": "You know the rule boys, good enough to screen shot means good enough to close!", "score": 1, "replies": []}]}
{"title": "$MMM could have a jump", "selftext": "It is pretty obvious now that the beer flu will be affecting the US. We have all been waiting to see the first couple reports to pop up here and the time is now. It’s common knowledge around reddit that N95 mask have been sold out through vendors and price gouging has been happening for weeks now. 3M produces the majority of N95 masks for the US and has been ramping up production of these masks over the past month. Their Q1 earnings call is set to happen on 4/28, and I could only assume they will beat earnings and will have nothing but positivity to spread for their impact on fighting off the beer flu. ATH is 219.75 and is currently trading at 151. $Lake just shot up +50% and I can see the same happening for 3M. They have manufacturing plants all over the world so they won’t be fully affected by the supply disruption and even if the shares don’t go to the moon, it won’t be scuba diving in 2020 unless the beer flu mutates into the everclear knocked the fuck out turned zombie flu that wipes out the world.\n3M has been posted here but with recent reports of the virus in the US I was curious. Of course the 3M N95 masks contribute to a small portion of the company but you never really know til it happens.\n\nTDLR: inverse me to make money. However this is not a suggestion nor is it good financial advice. Just wanted to spark conversation amidst all the same buy puts and biotech calls posts.", "id": "faw5a3", "created_utc": 1582902894.0, "score": 6, "upvote_ratio": 0.69, "num_comments": 26, "comments": [{"body": "[deleted]", "score": 6, "replies": [{"body": "175c 3/20", "score": 2, "replies": []}]}, {"body": "They're not a pure mask company. Maybe only a small percentage of their revenue is masks.", "score": 3, "replies": [{"body": "They’re one of the global leaders of masks though. So even if the masks previously only made up a small percentage, they’ve since increased operations on them, and are not experiencing shortages. They’ll likely be the company who benefits most from this, and the upcoming ER will have more than a small percentage of their revenue from masks", "score": 1, "replies": [{"body": "Masks cost half a buck to make and make a few dollars at most.  Masks aren't going to be a fashion piece that everyone has to have like in China unless this virus stays with us.  Let's hope it does not.", "score": 2, "replies": [{"body": "Bro N95 masks are like $12.95 a pop and cost almost nothing to produce. The U.S. is saying they need an additional 270 *million* masks.", "score": 1, "replies": [{"body": "Lol, you think they are going to be selling at 12.95 to the government...\n\nThey will sell at wholesale under $2.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah for sure, but volatility is low and it can have a boost with earnings in April and also the upcoming beer flu headlines", "score": 0, "replies": [{"body": "3M has a fuckload of liability and lawsuits against it. \n\nThat is why it has been stagnant for years.", "score": 2, "replies": []}]}]}, {"body": "3m has their hands in a lot of random ass medical shit.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Why?", "score": 1, "replies": []}]}, {"body": "APT is the one really going bonkers", "score": 2, "replies": [{"body": "Yeah because news broke that they had 14m in orders for the mask, that won’t be fulfilled until q2. What happens to 3M when they also release a statement after the outbreak in the US that they will be fulfilling their orders, they already announced a month back that they are ramping up production for the masks.", "score": 0, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I yoloed as well", "score": 1, "replies": []}, {"body": "yolo all in", "score": 1, "replies": [{"body": "If you do , should get later dates anything past April cause earnings is late April, and u’d be banking on a run up from premium or hoping we have more deaths from beer flu here in America.", "score": 1, "replies": [{"body": "What do you think of a 7/17 195 call..  was cheap..  already holding", "score": 1, "replies": []}]}]}, {"body": "Well look like she chose to jump off a cliff", "score": 1, "replies": [{"body": "Remind me! 2 months we’ll see", "score": 2, "replies": [{"body": "Realistically I think it has alot of potential and I'm balls deep in it", "score": 1, "replies": []}, {"body": "**Willkillshill**, your reminder arrives in **2 months** on [**2020-04-28 15:50:32Z**](https://www.reminddit.com/time?dt=2020-04-28 15:50:32Z&reminder_id=304378d8bd154d1db16cc7da1387814b&subreddit=wallstreetbets). Next time, remember to use my default callsign **kminder**.\n\n> [**r/wallstreetbets: Mmm_could_have_a_jump**](/r/wallstreetbets/comments/faw5a3/mmm_could_have_a_jump/fj0pei3/?context=3)\n\n> kminder 2 months\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-04-28T15%3A50%3A32%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Ffaw5a3%2Fmmm_could_have_a_jump%2Ffj0pei3%2F) to also be reminded. Thread has 1 reminder and 1/3 confirmation comments.\n\n^(OP can )[^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%20304378d8bd154d1db16cc7da1387814b) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%20304378d8bd154d1db16cc7da1387814b) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/304378d8bd154d1db16cc7da1387814b) ^(·) [^(Update Time)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Time&message=updateReminderTime%21%20304378d8bd154d1db16cc7da1387814b%0A2%20months%0A%0A%2AReplace%20reminder%20time%20above%20with%20new%20time%20or%20time%20from%20created%20date%2A) ^(·) [^(Update Message)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Message&message=updateReminderMessage%21%20304378d8bd154d1db16cc7da1387814b%20%0Akminder%202%20months%0A%0A%2AMessage%20is%20on%20second%20line.%20Message%20should%20be%20one%20line%2A) ^(·) [^(**Add Timezone**)](https://www.reminddit.com/user/setTimezone?source=reddit&username=Willkillshill) ^(·) [^(**Add Email**)](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%20304378d8bd154d1db16cc7da1387814b%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A)\n\n**Protip!** We have a subreddit at r/kzreminderbot for announcements and discussions!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20KZReminderBot%20from%20Willkillshill)", "score": 1, "replies": []}, {"body": "Ring Ring u/Willkillshill cc u/BoomerAnnihilator69! ⏰ Here's your reminder from **2 months ago** on [**2020-02-28 15:50:32Z**](https://www.reminddit.com/time?dt=2020-02-28 15:50:32Z&reminder_id=304378d8bd154d1db16cc7da1387814b&subreddit=wallstreetbets). Thread has 1 reminder.. Next time, remember to use my default callsign **kminder**.\n\n> [**r/wallstreetbets: Mmm_could_have_a_jump**](/r/wallstreetbets/comments/faw5a3/mmm_could_have_a_jump/fj0pei3/?context=3)\n\n> kminder 2 months\n\n\nIf you have thoughts to improve experience, [*let us know*](https://reddit.com/message/compose/?to=remindditbot&subject=FeedbackAfterNotify%21%20Reminddit%20Reminder%20%23304378d8bd154d1db16cc7da1387814b).\n\n\n\n^(OP can )[^(**Repeat Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Repeat%20Reminder&message=kminder%202%20months%20%0Akminder%202%20months%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0Aaction%21%20RepeatReminder%0Areminder_id%21%20304378d8bd154d1db16cc7da1387814b%0A) ^(·) [^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%20304378d8bd154d1db16cc7da1387814b) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%20304378d8bd154d1db16cc7da1387814b) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/304378d8bd154d1db16cc7da1387814b)\n\n**Protip!** You can use the same reminderbot by email at bot[@]bot.reminddit.com. Send a reminder to email to get started!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20Willkillshill)", "score": 1, "replies": []}]}]}, {"body": "OMI is a better buy.", "score": 1, "replies": [{"body": "Why", "score": 1, "replies": []}]}, {"body": "[https://markets.businessinsider.com/news/stocks/trump-3m-coronavirus-pandemic-mask-order-billion-sales-boost-profit-2020-3-1028956217](https://markets.businessinsider.com/news/stocks/trump-3m-coronavirus-pandemic-mask-order-billion-sales-boost-profit-2020-3-1028956217)", "score": 1, "replies": []}]}
{"title": "$NVDA DD: Why it's not going down right now", "selftext": "[removed]", "id": "fawsu0", "created_utc": 1582905499.0, "score": 9, "upvote_ratio": 0.68, "num_comments": 21, "comments": [{"body": "Let's all listen to the guy with no money and no market stake!", "score": 10, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "The edit is even gayer than the original post.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I bet your penis is bigger too, care to share?", "score": 1, "replies": []}]}]}]}]}, {"body": "Shitpost", "score": 7, "replies": []}, {"body": "But China supply chain gon be fucked up fam.", "score": 2, "replies": []}, {"body": "staying at home buying 1000 dollar GFX cards? that will be hard if people end up being quarantined at home and cant work.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "East as in Middle.", "score": 1, "replies": []}]}]}, {"body": "if u got no money then u papertradin bro??", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "the “lost my account” part doesn’t make me very confident ¯\\_(ツ)_/¯ never said anythin about buildin it back", "score": 2, "replies": []}]}]}, {"body": "relax bro it’s just a morning rally, it correct in the afternoon or open lower Monday\n\nBut if it doesn’t well then kiss your gay bear tendies good bye", "score": 1, "replies": []}, {"body": "fuck it im in", "score": 1, "replies": []}, {"body": "This DD is Doo Doo.", "score": 1, "replies": []}, {"body": "Then why is amd down with superior graphics cards at cheaper prices", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Sure but amd is being used in every next gen console. Amd you can get graphics just as good as nvidia but cheaper.", "score": 1, "replies": []}]}, {"body": "You are a full retard", "score": 1, "replies": [{"body": "Explain....their stock didnt go from 2$ to 60 because they are shit", "score": 1, "replies": [{"body": "Because how will they manufacture their graphics cards when their factories are shut, this aint going up until the rest of the market does, puts or nothing", "score": 1, "replies": [{"body": "Now yes, because of corona, but why did amd go to 60 from 2 if amd is so shit lol.", "score": 1, "replies": []}]}]}]}]}, {"body": "This post will be removed soon", "score": 0, "replies": []}]}
{"title": "Kill the Mouse short $DIS", "selftext": "[removed]", "id": "fay44s", "created_utc": 1582910458.0, "score": 18, "upvote_ratio": 1.0, "num_comments": 20, "comments": [{"body": "TLDR was enough for me.", "score": 6, "replies": []}, {"body": "It’s actually closer to 56% of total profit, Tokyo Disney is most profitable.", "score": 3, "replies": [{"body": "I just did a quick look in the 10-Q at their revenue break down. Regardless parks are going to get closed and their going to get pounded.", "score": 2, "replies": [{"body": "Yup exactly", "score": 2, "replies": []}]}]}, {"body": "Didn’t read this but post looks short so I question the DD. Also OP didn’t insult me so maybe their position isn’t that strong. Still, You son of a bitch, I’m in", "score": 3, "replies": []}, {"body": "I’m in.", "score": 3, "replies": []}, {"body": ">Disneyland parks and park revenue is approximately 37% of total revenue\n\nYou have to also consider that they now don't have to pay any of their workers and utilities if they close it so the loss is slightly lower. Also, Disney has a ton of reserves to pump up their stocks and can afford to close a few theme parks.", "score": 4, "replies": [{"body": "I’m betting on an over reaction when the CNN headlines are announcing Disneyland being shut down. \n\nI’m actually pretty bullish long term on dis especially with the new ceo and how they’re cleaning up espn and their Hulu deals.", "score": 3, "replies": [{"body": "Agreed. I actually sold some of my PUT options this morning.", "score": 1, "replies": []}, {"body": "Yeah I don't see how Disney can fail long term. But it does seem like they are fucked at least this quarter and maybe next.", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "RSI of 18, Disney has really been getting kicked in the nads lately.", "score": 1, "replies": []}, {"body": "Disney anti piracy team will make up the difference.", "score": 1, "replies": []}, {"body": "I have never won on DIS. Promised to never touch it again", "score": 1, "replies": []}, {"body": "I tried to buy some puts after hours last night and expected it to be fulfilled this morning. They were not fulfilled and are now more than double of what they were last night. RIP my tendies", "score": 1, "replies": []}, {"body": "This is kinda good DD. Liquid enough, and IVs really aren't that high for a beer virus play.", "score": 1, "replies": []}, {"body": "You're literally retarded for saying this 6 days late", "score": 1, "replies": [{"body": "6 days ago I was getting ass fucked by my nvda calls. Better late than never.", "score": 1, "replies": []}]}, {"body": "My man. Already up 100$. Short the fucking mouse.", "score": 1, "replies": [{"body": "Nice! I picked mine up at the low today so I’m down on the newly minted ones but it’s just a matter of time before the virus shuts down a park and we see a nice big swing", "score": 1, "replies": []}]}]}
{"title": "$DIS", "selftext": "[removed]", "id": "fayz9i", "created_utc": 1582913679.0, "score": 6, "upvote_ratio": 0.81, "num_comments": 22, "comments": [{"body": "Ask yourself what will happen if the parks in US shut down?", "score": 13, "replies": [{"body": "Happiness? Disney is a joke and it's a way to convince small peepee people to keep up with what their peers do for their kids", "score": 3, "replies": [{"body": "Have you ever been? It’s fucking blast. Worth every penny.", "score": 2, "replies": [{"body": "I have when I was a cute babysarus in the 1990's. It's more people  spending money the don't have to keep up with others that sucks.", "score": 1, "replies": [{"body": "It’s a lot of fun as an adult. Epcot is like a drunk tank for 21+. Animal kingdom has cool attractions. The hotels have some great restaurants (flying fish, California Grill). They also don’t cut corners on service. Its easily my favorite vacation spot.", "score": 1, "replies": []}]}]}]}]}, {"body": "All of that is priced in. The next big drop is when beer virus has confirmed community spread. Then when parks close here.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "They will report community spread within a week. Disney is a good buy. I play safe with $110 3/20 puts", "score": 1, "replies": []}]}, {"body": "Makes sense, thx for feedback.", "score": 1, "replies": []}, {"body": "Organic case was confirmed in California this week lol", "score": 1, "replies": []}]}, {"body": "I just went in on $100 puts for 4/17. I figure if this shit gets out of control in California then Disneyland will shut down too, and with 8400 people under quarantine in California we'll probably see a shitshow in 14 days when the incubation is up.\n\nAbout a third of Disney's revenue is parks, then another third are movies. And nobody is going to be going to movie theaters during a coronavirus outbreak either. So that's 2/3rds of revenue hit badly.", "score": 2, "replies": [{"body": "You have a good point, I read that 40% is from the parks, and with the most busy one in the world (Tokyo) shut down they're sure to drop", "score": 2, "replies": []}, {"body": "It's the reason I got out Monday- theatres and parks, and their cruise lines, are going to be damaged this quarter", "score": 1, "replies": []}]}, {"body": "I bought some 3/20 $95p today", "score": 2, "replies": [{"body": "3/27 $90p here", "score": 2, "replies": []}]}, {"body": "Also Disney+ has been a failure. Rumor is an insane amount of account closures already this year. CEO resigning was a real shock, some speculated indecency but the timing of it makes me think Iger is trying to cash out while he still can", "score": 4, "replies": [{"body": "What does D+ even offer outside of nostalgia, Mando, and a bunch of shitty preteen kid shows that barely last a month on Disney Channel? I'm surprised it carried them this long, honestly.", "score": 1, "replies": []}, {"body": "Yeah it's pretty obviously a failure since everyone basically watched the Mandalorian then canceled their sub. That's what I did.\n\nAll they have are the folks who bought a full year for their kids to watch cartoons.", "score": 1, "replies": []}]}, {"body": "Still has a lot of space to go down, esp as they have no huge movies (SW, Marvel, etc) coming out atm for revenue outside of Corona exposure heavy enterprises", "score": 1, "replies": [{"body": "My thought was to buy puts before the weekend (crazy I know), as im expecting to hear about how the virus is spreading over the weekend. Especially with colleges having spring break over the next few weeks", "score": 2, "replies": []}]}, {"body": "too late for puts.", "score": 1, "replies": []}, {"body": "To hell with it, I'm in.", "score": 1, "replies": []}, {"body": "Wouldn’t buy yet. Buy the time of next ER if Beervirus finally takes it in the butt they could have good recovery and forward looking guidance", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "faz5it", "created_utc": 1582914363.0, "score": 16, "upvote_ratio": 0.9, "num_comments": 22, "comments": [{"body": "I got burned on $MSFT 3/20 200c but when the market EVENTUALLY bottoms out im going deep on LEAPS", "score": 13, "replies": [{"body": "It’s not over yet we still have a chance have some faith you fucking degenerate", "score": 3, "replies": [{"body": "I genuinely appreciate your tenacity\n\nBut, get ready for some 🌈🐻🍆", "score": 3, "replies": [{"body": "Eat shit, 🐃💰 all day", "score": 1, "replies": []}]}]}, {"body": "How do leaps work? Are they just long term options?", "score": 2, "replies": [{"body": "Yep", "score": 3, "replies": []}]}]}, {"body": "Bill let's him down.   \n\n*Always sunny theme*", "score": 6, "replies": [{"body": "The gang learns what a pandemic is", "score": 9, "replies": []}]}, {"body": "BHAHAHAHA THIS GUY TRUST CORPORATE RATINGS", "score": 13, "replies": [{"body": "I thought everyone here watched the big short", "score": 2, "replies": []}]}, {"body": "I got burned with $MSFT $200 C 03/20. Once this shit tanks, I’m buying 2021 leap calls. In Daddy Nutella we trust.", "score": 6, "replies": []}, {"body": "Diamond hands on my 220c 7/17 & 9/18. Up 50% and 20% today but still -60% all time. Next ER guidance will rely on Azure taking market share from gay boy Jeffrey, And Xbox ramp up. Nutella looks like like shit but taste like tendies.", "score": 3, "replies": []}, {"body": "They were trying to launch their split surface tablet and now they can’t get components from China fast enough, same with their Xbox Series X. They’re fucked this year and they know it", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "dumbass", "score": 1, "replies": []}, {"body": "Strike?!? Date?", "score": 1, "replies": [{"body": "220c 5/15 ez tendies", "score": 4, "replies": [{"body": "I might be slightly stupid, but I’m not going full retard. 200c Jan 2021 even looking sus.", "score": 3, "replies": [{"body": "It’s $36 per contract. Are you gonna miss out on tendies over $36? I think not", "score": 3, "replies": [{"body": "This might be a coincidence but I actually have 71 buying power left. Can someone venmo me 1 dollar. [I'm in](https://imgur.com/a/wH5baPm). can't wait till I'm rich", "score": 3, "replies": [{"body": "Retarded", "score": 2, "replies": []}]}]}]}, {"body": "Yikes", "score": 2, "replies": []}]}]}]}
{"title": "MSFT + JEDI = Bezos BTFO!", "selftext": "[removed]", "id": "fazcba", "created_utc": 1582915066.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 26, "comments": [{"body": "No articles, no links, no reference? My kinda DD!", "score": 15, "replies": [{"body": "Updated stupid Reddit app didn't submit link", "score": 5, "replies": []}]}, {"body": "If you're actually still holding MSFT 3/20...god speed. 17 cents down from, what, 5+?", "score": 12, "replies": [{"body": "Time to buy 🤞", "score": 3, "replies": []}, {"body": "Mine are worth 0.01 :D", "score": 1, "replies": [{"body": "Same !", "score": 1, "replies": []}]}, {"body": "I’m in the same but,  let us pray thy", "score": 1, "replies": []}, {"body": "Lol I mean might as well go down with the ship at this point. I have 5/15 $195 so not nearly as fucked but boy oh boy is that an ugly thing to look at being down like 80%", "score": 1, "replies": [{"body": "Yeah I've got LEAPS that are down like 40% or so and I'm buying more in this so...we'll see how dumb we all are at the end of the year.", "score": 1, "replies": []}]}, {"body": "They’ve actually gained money today for me, holding old calls that way my butt everyday but today wasn’t too bad", "score": 1, "replies": []}, {"body": "If the dismissal does go through, Corona be damned this fucker is shooting past $200!", "score": 0, "replies": []}]}, {"body": "Msft is FUCKED their holiday plans are done with the shortage of components in China. They won’t be able to make all of the units they planned and with the rest of the world about to get beer virus they won’t have the money to even upgrade to the next gen in numbers that matter for a console launch. Only the hardcore will get them. They’ll be sitting on shelves as people stick with their current system until the plague dies down. Doubly so for the folding surface tablet. After Motorola’s shit folding phone people won’t trust the tech and Msft won’t even have the product volume anyways.", "score": 6, "replies": [{"body": "Their Xbox division is only a side gig for them. Their bread and butter will always be office and cloud services.", "score": 5, "replies": [{"body": "That side gig is about to blow up in user traffic. Those who are bunkered down are having full 24/7 meat cranking session on PH and passing time on Xbox Live", "score": 1, "replies": []}]}]}, {"body": "Bought 04/17 calls this yesterday morning. Cashed out 100%  waiting for dip", "score": 5, "replies": []}, {"body": "If people are stuck inside they’re going to a need a computer for all the excessive amounts of porn they’ll be watching. \n\nLong MSFT and AAPL!", "score": 3, "replies": [{"body": "like everyone doesn't already have a phone to watch porn on pfft", "score": 2, "replies": [{"body": "So, long AAPL still?", "score": 1, "replies": []}]}]}, {"body": "First time in WEEKS I see my 3/20s going up", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah, more of a diamond bag at this point.", "score": 1, "replies": []}]}, {"body": "So when will they be making the final decision?", "score": 1, "replies": []}, {"body": "I have 12/18/20 230c and 220c. As you would expect they are rather red but hopefully time is nice to me.", "score": 1, "replies": []}, {"body": "My 4/17 $200 have hope still..\n\nStocks only GO UP BITCHES\n\n💎🙌🏽", "score": 1, "replies": [{"body": "Are you up over the last 2 months ? Following up my DD from many threads ago", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "fazom3", "created_utc": 1582916379.0, "score": 8, "upvote_ratio": 0.7, "num_comments": 28, "comments": [{"body": "That's now how manufacturing works, but okay.", "score": 20, "replies": [{"body": "Like you know anymore than him?\n\n&#x200B;\n\nWe're filling out a BAR exam with crayon here, helpful advice only.", "score": 1, "replies": []}]}, {"body": "Lmao we might already be in a recession but retail doesn't know yet", "score": 8, "replies": []}, {"body": "You still holding ALLY and MSFT calls bro?", "score": 7, "replies": [{"body": "^(yes)", "score": 2, "replies": []}, {"body": "hey cut it out, that hurts", "score": 1, "replies": []}, {"body": "> holding MSFT calls  \n\nYou're goddamn right", "score": 1, "replies": []}, {"body": "3/27 MSFT 190C are gonna fucking print, just wait", "score": 1, "replies": [{"body": "I have 3/27 200C and I am still holding on them :)", "score": 1, "replies": [{"body": "Might as well hold, Im sure as fuck not selling for a 50% loss", "score": 1, "replies": [{"body": "I got diamond hands. Been holding stupid EWY since monday and it kept going up. Finally its down and i am printing TNEDIESSS", "score": 2, "replies": []}]}]}]}, {"body": "I'm still holding MSFT, shares tho not calls. Brace yourself my fellow autist, a storm is coming. If I had options it would've been puts", "score": 1, "replies": []}]}, {"body": "You won't know we're in a recession until it's been happening for awhile", "score": 6, "replies": [{"body": "like knocking up your side piece", "score": 2, "replies": [{"body": "Hahaha", "score": 2, "replies": []}]}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.5082  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/69996)", "score": 3, "replies": [{"body": "Yus", "score": 1, "replies": []}]}, {"body": "Pretty sure if you were getting a refund, you would have gotten it as soon as possible. People now are the ones that are delaying having to make their payments due", "score": 2, "replies": []}, {"body": "How many more kids are going to come in here proving they don't know jack shit about the world supply chain?", "score": 2, "replies": []}, {"body": "Are we holding these puts over the weekend? How about shares? I'm in $SQQQ and $SPXU", "score": 2, "replies": []}, {"body": "Dow under 20k before end of March", "score": 2, "replies": []}, {"body": "The entire world is walking on egg shells at the moment. It doesn’t matter.  \n  \nJust like before when people were crying about valuation and how could stock ABC be as high as it is, we’re in a situation now where people are gonna be paranoid as fuck and generally bearish *even if* anyone provides proof of why we shouldn’t worry.", "score": 2, "replies": []}, {"body": "The inverted yield curve has predated every recession since the 60s. The coronavirus wasn’t the only driver of the future recession, it’s just going to exacerbate it.\n\nGood luck, all in. You’re gonna need it.", "score": 2, "replies": []}, {"body": "It depends how bad the virus fear gets. \n\nJapan, they shut down Disneyland and China travel money stopped coming in\n\nUS may eventually do so. They may not. \n\nI think that’s where we have a huge divide. \n\nThat said, market was bullishly retarded a month ago. We were all just running at anything. Fundamentals didn’t matter.  People that were never interested in stocks were all of a sudden experts telling people to buy Dow Jones Index.", "score": 2, "replies": []}, {"body": "Well I got puts so I want world to go in recession please", "score": 1, "replies": []}]}
{"title": "Bought my first stock MSFT @ 158", "selftext": "[removed]", "id": "fazw4g", "created_utc": 1582917202.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 24, "comments": [{"body": "[deleted]", "score": 11, "replies": [{"body": "I'm fatherless and I want to hear your joke", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Heart attack when I was 7.", "score": 1, "replies": []}]}, {"body": "Found Bruce Wayne's throwaway account.", "score": 1, "replies": []}]}, {"body": "Sad thing is, it’s not :(", "score": 1, "replies": []}]}, {"body": "Fuck is wrong with you", "score": 6, "replies": [{"body": "The emotional toll of a dead father", "score": 0, "replies": []}]}, {"body": "You didn't have to be that specific man..", "score": 5, "replies": [{"body": "Oh sorry, too much for wsb?", "score": 0, "replies": []}]}, {"body": "Nobody tell him\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 10, "replies": []}, {"body": "Sir this is a whataburger", "score": 5, "replies": []}, {"body": "Welcome to good burger home of the good burger may I take your order.", "score": 4, "replies": []}, {"body": "Oh great r/all is leaking back in again", "score": 4, "replies": []}, {"body": "Judging by your post history you also recently got scammed by some crackhead on craigslist while trying to buy PSVR. You probably shouldn't be anywhere near the market.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "How did you just now respond to this on a 2 month old, deleted post?", "score": 1, "replies": []}]}, {"body": "Wow with those analytical skills you must be up a crazy amount", "score": -2, "replies": []}]}, {"body": "Why not a call?", "score": 2, "replies": []}, {"body": "RIP in more ways than one", "score": 2, "replies": []}, {"body": "Wrong sub.", "score": 2, "replies": []}, {"body": "JFC, the shit people will post for post karma...", "score": 2, "replies": []}, {"body": "Now's the time to hoard some puts. Market's crashing faster than the flat-earther who just killed himself 2 days ago.", "score": 2, "replies": []}, {"body": "how are these retarded are able to make shitposts, while when I wanted to make a legit loss porn post yesterday with screenshot it was being denied. Mods are gay", "score": 2, "replies": []}, {"body": "Bruh wtf", "score": 1, "replies": []}]}
{"title": "Aggressive/Unusual Options - WMT/T/JBLU/GE", "selftext": "Today    I included the aggressive  orders that I see, many of them instead of     just a few into one picture.  Today I didn't color code the  calls/puts     but did color code the  companies.\n\nThese    options orders  are on or above the ask. Many have the same expiry  and   strike. Also lots  of the orders were sweeps so these ppl were   breaking  down their order  to get filled faster.\n\nAlso    all  these orders volume of the contracts exceeded the open interest   in   multiple trades so it's most likely not closing positions. Either    buy     to  open orders or sell to open orders and based on the    aggressiveness  of the orders one can infer its buy to open. Some of     these may be    hedges  and some most likely not.\n\nData is here - [https://ibb.co/sQDqDX8](https://ibb.co/sQDqDX8)\n\nThis is just some of today's orders, i know it is late in the day but I am doing the best I can do right now to post these.\n\nThe WMT-JBLU puts are most likely virus related from the virus fears as well as Disney. As for At&T i am unsure why all the $ on puts.\n\nI   will say this, don't just enter YOLO's in positions based on this data        alone in most cases. Use  technicals/fundamentals/options     data-flow/market  sediment all combined  instead of just 1 of these. Use        protection like  spreads if you worry  about losing what u put in     and    be  smart,  understand the risks of putting  $ into weekly     expiry's, consider a longer expiry.\n\nAlso with the market going lower use technicals/fundamentals/options   data-flow/market  sediment all combined.\n\n&#x200B;\n\nI wanted to add, 50 Cent VIX trader ruffer llp (or whatever) is still holding most of their vix calls.", "id": "fb15no", "created_utc": 1582922160.0, "score": 26, "upvote_ratio": 0.9, "num_comments": 26, "comments": [{"body": "I had a stroke trying to read this", "score": 30, "replies": [{"body": "op was using a typewriter.", "score": 8, "replies": [{"body": "Sorry about that, I was getting pegged by a gay bear cub and couldn't type properly", "score": 6, "replies": []}]}, {"body": "do you smell toast?", "score": 3, "replies": []}, {"body": "Oh no buddy, Hang in there", "score": 5, "replies": []}]}, {"body": "Too late, yolo'd my whole retirement", "score": 8, "replies": []}, {"body": "Market will go lower. More cases will be announced. More panic to come. \nAnd then... sooner rather than later.... it will go higher. When? We don't know. \nWhat do you think of this:\nI'm buying long dated 2022 call options in blue chips that have suffered.  \nI like BlackRock BLK today. \nBLK Jan 21 '22 $680 call to open. \n\nThoughts?", "score": 4, "replies": [{"body": "Would wait for VIX to chill the fuck out before buying any long dated premium. Or do a spread", "score": 4, "replies": []}, {"body": "I like buying long term 2022 calls on bluechips but they need to drop a lot more i think before that for me atleast. I am trying to figure out where to get my strike at. I have read that deep ITM would be better as its less extrinsic value risk. So less time risk and less iV risk i think. But an ATM or OTM call would yield a higher % possibly.\n\n&#x200B;\n\nThe vix is at extremes so going deep itm might help that more, unless waiting for it to drop some", "score": 1, "replies": []}]}, {"body": "|market sediment\n\nIs that when we hit bottom and start digging?", "score": 6, "replies": []}, {"body": "Tldr; JBLU 15p 4/17", "score": 5, "replies": []}, {"body": "I think you drooled on the space bar too much", "score": 3, "replies": []}, {"body": "I wanted to add, 50 Cent VIX trader ruffer llp (or whatever) is still holding most of their vix calls.", "score": 3, "replies": [{"body": "What price are his calls?  \n\nI’ve got some 3/20 $18.50 puts that are already feeling good.", "score": 2, "replies": [{"body": "3/20 24 Calls", "score": 1, "replies": []}]}, {"body": "Any idea how much he's up atm?", "score": 1, "replies": []}]}, {"body": "Gay bear action", "score": 2, "replies": []}, {"body": "Wrong sub. Yolo all your retirement money or go home", "score": 2, "replies": []}, {"body": "What does this mean in retard terms", "score": 2, "replies": []}, {"body": "Ban\n\nThis smells like r/investing", "score": 0, "replies": [{"body": "Ban you for being a small penis gay boi", "score": 3, "replies": [{"body": "There you go fellow autist.\n\nYou son of a bitch, I'm in.", "score": 2, "replies": [{"body": "Your in? I am holding a pegging party where the gay cubs fuck the big penis bulls with pegging", "score": 1, "replies": []}]}]}]}]}
{"title": "Anyone see that massive buying into the close? Recession cancelled virus cured confirmed", "selftext": "[removed]", "id": "fb1m2z", "created_utc": 1582923936.0, "score": 12, "upvote_ratio": 0.93, "num_comments": 25, "comments": [{"body": "People are going to regret that shit Monday morning when futures are down 5%", "score": 18, "replies": [{"body": "Man I hope so", "score": 0, "replies": []}, {"body": "Tell that to the Fed and all the boomers. If coronavirus doesn't start spreading like wildfire in the U.S. we gucci", "score": -1, "replies": [{"body": "Gucci Gang!", "score": 1, "replies": []}, {"body": "We’re not even capable of testing well enough for it.  Probably already spread, we just don’t know", "score": 1, "replies": [{"body": "I didn't buy more into markets that could be affected by corona but I held my previous positions.", "score": 1, "replies": []}]}]}]}, {"body": "FED pump. Watch for any bad news over the weekend because Monday could be blood.", "score": 9, "replies": []}, {"body": "Fake close above 25k pump. Pain is the boomer forcast monday. Bloody monday coming.", "score": 5, "replies": []}, {"body": "That was fucking insane amount of buying. Did the fed just buy 2,000,000 SPX futures contracts?", "score": 5, "replies": [{"body": "I think they just dumped 100 bil into SPX minimum", "score": 2, "replies": []}]}, {"body": "Everyone buying last minute for the weekend?", "score": 4, "replies": [{"body": "Opened a put position late afternoon so fuck this", "score": 7, "replies": []}]}, {"body": "Portfolio managers rebalancing end of month. Their % of stocks was too low after the drop this week, so they bought up to meet their target numbers.", "score": 2, "replies": []}, {"body": "The bears had fun this week. The bulls that sold have small balls. My diamond hands are about to pay off in May.  USA, USA, USA.", "score": 2, "replies": []}, {"body": "Because Trump knows his only chance in November is to boost the market.  Weekend gives the mousewheel in his head a chance to come up with a \"genius\" idea", "score": 1, "replies": []}, {"body": "Same thing happened to tqqq. My puts are screwed now", "score": 1, "replies": []}, {"body": "I don't understand how that has any grounds. It fluctuated all day, no doubt in my mind it's fed pumping. With all the fears, no way 10 minutes would have enough volume to surge the Dow +700 points?\n \nSee you guys on Monday! Bloody", "score": 1, "replies": []}, {"body": "Pence announced a global prayer day. /s", "score": 1, "replies": []}, {"body": "No shit, look what GE did just prior to the close", "score": 1, "replies": []}, {"body": "I doubled my PUT position before market close, I’ll be thanking myself Monday. (🤞)\n\nLet’s be real here. The corona virus is just now gaining momentum outside of China. I hope to god this shit gets under control soon, but short term looks bleak. \nMarkets may have rebounded a bit today, but my retarded ass recommends to hold off on closing bearish PUTS, and def hold off on bullish CALLS.", "score": 1, "replies": []}, {"body": "It was all a ruse", "score": 1, "replies": [{"body": "Yep. \n\nThis weekend won't bring any good news on the beer virus and everyone will panic sell next week. \n\nMonday, Market will open -400, close at -800 at least.", "score": 3, "replies": [{"body": "No, I mean the whole beervirus is a ruse. And Taylor swift", "score": 1, "replies": []}]}]}, {"body": "If we can get back to 330 by 3/20 that would be swell.", "score": 1, "replies": []}]}
