{"title": "Fed’s Bullard Says Falling Money Supply a Good Sign on Inflation", "selftext": "", "id": "104p3l5", "created_utc": 1672994325.0, "score": 61, "upvote_ratio": 0.92, "num_comments": 28, "comments": [{"body": "Where did the money go? Did someone dump it into a volcano? Shoot it into space?", "score": 18, "replies": [{"body": "Most of it disappeared, being that it was credit.", "score": 17, "replies": []}, {"body": "A ton of the money in our economy is made up. Banks loans 90% of person A’s cash in savings account to person B. When people stop taking loans, this made up money amount reduces", "score": 12, "replies": [{"body": "So it is all an illusion.", "score": 5, "replies": [{"body": "Not really. Money’s job is facilitating trade, not hold value. You want as much of out there as possible, but you don’t want it to be based on nothing (this is why responsible lending is key, and irresponsible lending like subprime mortgages can make it collapse). \n\nThink of money as a pipeline moving water from one location to another. The water is value, pipes are money. You want to take all the pipes sitting idle doing nothing to be moved somewhere where they are needed. That’s what loans are.", "score": 11, "replies": []}]}, {"body": "Actually, they used to lend 90%, apparently now they’ve been lending money that doesn’t even exist as a percentage anywhere since March 26th of 2020 : https://www.federalreserve.gov/monetarypolicy/reservereq.htm", "score": 4, "replies": [{"body": "Correct, and I believe you can lend made up money like 9 times, which makes the theoretical max money created 10x the deposit.\n\nIt’s called the money multiplier = 1 / reserve requirement. If 10% -> 1/0.1 = 10", "score": 6, "replies": []}]}]}, {"body": "No it went in to large companies, all that covid money had to be given to the right people.", "score": 15, "replies": [{"body": "Ppp loans that were forgiven", "score": 1, "replies": []}]}, {"body": ">Where did the money go?\n\nThat's what investors in BBBY are asking.", "score": 2, "replies": []}]}, {"body": "Decreasing money supply is good for inflation, but at the cost of recession which will be painful.\n\nIdeally fed should target a stable money supply to match gdp and let the extra money printing work it's way into the system. Once money was out of the lamp, can't put genie back in the bottle\n\nMiners, silver, uranium, wheel strategy tqqq", "score": 9, "replies": []}, {"body": "Say that to food inflation, and energy inflation. Sure gasoline prices have come down, but my electrical rates haven't changed since they were readjusted upwards recently. All basic necessities continues to inflate further upwards even after the New Years (I swear I saw eggs/cheese just went up another 5-10%). Sure used cars have deflated or have come down, but I can't eat a used car with 100k miles on it.", "score": 21, "replies": [{"body": "Takes time to trickle its way throughout the entire systems. Many transactions occur for the money printer (or in this case shredder) to the end consumer.", "score": 3, "replies": []}, {"body": "“I swear I saw” doesn’t sound very convincing", "score": 7, "replies": [{"body": "Agreed, please use the appropriate phrasing, \"I tawt I taw a \\_\\_\\_\\_\"", "score": 13, "replies": []}]}, {"body": "Motherfuckin eggs were $8 the other day. My wife does most of the shopping so this caught be way off guard. They were like $1.70 pre-covid...\n\nI make 40% more than I did in 2019, but definitely not feeling like it.", "score": 8, "replies": [{"body": "There is a bird flu that caused millions of chickens to die, so there is a egg shortage.", "score": 4, "replies": []}, {"body": "Egg prices are really region specific. With the avian flu killing millions of chickens across the US eggs are short supply, yet you can find local farmers with normal egg prices still- I just got 60 eggs for $6 last week (or $1.20 a dozen) which is about the same I was paying in 2019 iirc", "score": 3, "replies": []}]}, {"body": "17 months is how long rates take to work through markets.  With less money food and energy demand will reduce.  Cars will get cheaper.\n\nAt minimum thing will stop going up.", "score": 2, "replies": []}, {"body": "Funny, now bulls are embracing what Bullard is saying cuz it bolsters their case, but he has been the most hawkish Fed member and bulls hated him. Also, he is no longer a voting member, not that it really matters cuz the Fed is all JP.", "score": 1, "replies": []}]}, {"body": "Duh, growing money supply causes inflation. Welcome to economics 101, I’ll be your professor today.", "score": 4, "replies": [{"body": "So in economics 102 is it explained it's not only about money supply, and there are different types of inflation?", "score": -1, "replies": [{"body": "You’re correct.  Friedman is always and everywhere misinterpreted.", "score": 2, "replies": []}]}]}, {"body": "Just look at the fed balance sheet.\n\nFrom Mar 2020 - Apr 2022 Feds balance sheet went up 4.7 trillion.\n\nFrom Apr 2022 - until now its gone down just 500 ~~million~~ billion (after QT announced)\n\nTheres still a ton of hot money floating around.", "score": 6, "replies": [{"body": "I think you mean 500 Billion QT?", "score": 5, "replies": [{"body": "yes 500 billion!", "score": 5, "replies": []}]}]}, {"body": "what do u think raising rates does to the money supply.........causes it to increase because interest is higher........so funny", "score": 0, "replies": []}, {"body": "Inflation peaked in April", "score": 1, "replies": []}]}
{"title": "Overview of the Lithium Market - production, location and main producers", "selftext": "*Hello Investors! I am presenting you with this sector research that i did for the Lithium Market. Have a nice reading session!* \n\n# Table of Contents\n\n* Introduction\n* Lithium Locations\n* Top Lithium Reserves Currently known\n* How Lithium is produced\n* Top Producers of Lithium\n* Prices in China\n* Lithium Price Drivers\n* Important points to consider for the lithium market.\n* Criticism to Lithium Extractions\n\n# Introduction\n\nIn the late 1980s, the discovery of Lithium’s efficiency in the storage of energy for the construction of electric batteries helped to increase the demand of this precious metal in the last decades, even today the demand is not ceding. Compared to other materials, Lithium can store lots of energy in a tiny space, making it ideal for consumer electronics and EVs.\n\nWorldwide production in 2021 increased by 21% to approximately 100,000 tons from 82,500 tons in 2020 in response to strong demand from the consumer electronics market due to the Covid-19 pandemic’s lockdowns and increased prices of lithium. Global consumption in 2021 was estimated to be 93,000 tons, a 33% increase from 70,000 tons in 2020.\n\nThe metal’s global end-use is conveyed as follow:\n\n* 74% batteries;\n* 4% ceramics and glass;\n* 3% lubricating greases;\n* 2% continuous casting mold flux powders;\n* 2% polymer production;\n* 1% air treatment;\n* 4% and other uses.\n\nLithium consumption for batteries has increased significantly in recent years because rechargeable lithium batteries are used extensively in the growing market for electric vehicles and portable electronic devices, increasingly used in electric tools, and grid storage applications. Lithium is extracted from:\n\n* Lithium oxide and hydroxide\n* Lithium carbonate\n* Lithium-cobalt oxide\n* Lithium-nickel-cobalt-aluminum oxide\n\n# Lithium Locations\n\nFour mineral operations in Australia, two brine operations each in Argentina and Chile, and two brine and one mineral operation in China accounted for the majority of world lithium production. Additionally, smaller operations in Brazil, China, Portugal, the United States, and Zimbabwe also contributed to world production of this strategic resource.\n\nLithium supply security has become a top priority for technology companies’ strategic alliances and joint ventures among tech firms and exploration companies continued to be established to ensure a reliable, diversified supply of lithium for battery suppliers and vehicle manufacturers. Substitution for lithium compounds is possible in batteries, ceramics, greases, and manufactured glass. Examples are calcium, magnesium, mercury, and zinc as anode material in primary batteries; calcium and aluminum soaps as substitutes for stearates in greases; and sodic and potassic fluxes in ceramics and glass manufacture.\n\n|**Brine Base Lithium Sources**|**Mineral Base Lithium Sources**|**Lithium Clay Source**|**Searlesite Sources**|\n|:-|:-|:-|:-|\n|Argentina, Bolivia, Chile, China, and the United States|Australia, Austria, Brazil, Canada, China, Congo (Kinshasa), Czechia, Finland, Germany, Mali, Namibia, Peru, Portugal, Serbia, Spain, the United States, and Zimbabwe|Australia, Austria, Brazil, Canada, China, Congo (Kinshasa), Czechia, Finland, Germany, Mali, Namibia, Peru, Portugal, Serbia, Spain, the United States, and Zimbabwe Mexico and the United States|United States|\n\n# Top Lithium Reserves Currently known:\n\n1. Chile:   9,200,000 MT\n2. Australia:  3,800,000 MT\n3. Argentina:  2,200,000 MT\n4. China:   1,500,000 MT\n5. United States:  750,000 MT\n6. Zimbabwe:  220,000 MT\n7. Brazil:   95,000 MT\n8. Portugal:  60,000 MT\n\nChile has the most reserve of economically extractable lithium in the world, estimating for around a 37% of global reserves. SQM (NSYE:SQM) is a key lithium producer in Chile’s Salar de Atacama, and in 2018 it finally reached a long-awaited agreement with Corfo, the country’s development agency, over royalties. Albemarle (NYSE:ALB) is another top lithium producer in Chile.\n\n# How Lithium is produced\n\nPut simply, lithium from Australia comes from ore mining, while in Chile and Argentina, lithium comes from salt deserts, so-called salars. The extraction of raw materials from salars functions as follows: lithium-containing saltwater from underground lakes is brought to the surface and evaporates in large basins. The remaining saline solution is further processed in several stages until the lithium is suitable for use in batteries.\n\n# Top Producers of Lithium\n\n1. **Jiangxi Ganfeng Lithium Co. Ltd (SHE:002460).** The company has acquisitions in Mexico, Ireland and Australia. Founded by Li Liangbin, an expert in the lithium business.\n2. **Albemarle Corporation (NYSE:ALB)** is the biggest American lithium producer. It is also engaged in the production of other chemicals and has a leading position in lithium production. It is the largest provider of lithium for electric vehicles with a recorded revenue of $3.33 billion in 2021.\n3. **Tianqi Lithium (SHE:002466)**. A Sichuan mining and manufacturing company. It controls one of the largest percentage of worldwide production with its lithium hydroxide procution plant in Kwinana Industrial Area, Australia.\n4. **Mineral Resources Limited (ASX:MIN)**. An australian mining company focused in extractions of various resources including lithium with headquarters in Perth and listed on the Australian Stock Exchange\n5. **Sociedad Química y Minera de Chile S.A. (NYSE:SQM)**. It is a Chilean chemical company and one of the largest lithium producers in the world. Their main facilities are based in the Atacama Desert in Tarapaca as well as the Antofagasta regions. It delivered revenues of $2.86 billion in 2021.\n6. **Sichuan Yahua Industrial Group Co. Ltd (SHE:002497)**. It is one of the leding lithium and explosive producer in China.\n7. **Livent Corporation (NYSE:LTHM)**. Operating for six decades, it is an important supplier of lithium to electric vehicle manufacturers and mobile devices.\n8. **Lithium Americas Corp. (NYSE:LAC)**. Recently raised capital and debt for at least 1 $1 billion, it is expanding its business and targeting an initial 40,000 tpa lithium carbonate capacity at Thacker Pass and Cauchari-Olaroz, where its already planning to increase capacity by at least 20,000 tpa.\n9. **Pilbara Minerals (ASX:PLS)**. With a recording revenue of $176 million in 2021, it is one of the leaders in lithium production in Asutralia.\n10. **Allkem Ltd (ASX:AKE)**. Previously known as Orocobre Ltd, Allkem is the fusion of the former with Galaxy Resources Ltd. It has several operations and projects including a hard-rock mine in Western Australia, a hard-rock spodumene project in Canada, and a brine project in Argentina. It is still working to develop its flagship project in Sal de Vida, Argentina.\n11. **Bacanora Lithium (private)**. It is focusing on building a 35,000 tonnes per annum battery grade lithium operation at Sonara in Mexico. The completed feasibility study revealed a net present value of $1.25 billion at an IRR of 26%. The company claims that its costs of $4,000 per tonne are among the lowest in the industry.\n12. **Savannah Resources (LON:SAV)**. It is the biggest lithium producer in the United Kingdom and aims to be a leading supplier of lithium in Europe. It produces lithium from its Barroso Lithium Project in Portugal. The company says that this mine has Europe’s most significant resource of hard rock spodumene lithium and can produce enough lithium to supply 500K electric vehicles per year.\n13. **Piedmont Lithium Inc. (NASDAQ:PLL)**. It was recently selected by the United States Department of Energy for Tennessee Lithium Project, receiving a grant worth $141.7 million. The company aims to build a lithium supply chain in the United States that will support the electric vehicle manufacturing industry.\n14. **Grupo Mota, Felmica (Private)**. Felmica operates the biggest lithium mine in Europe. This mine is expected to produce lithium for the next 30 years.\n\n# Prices in China\n\nChina is a dominant force in lithium pricing, representing 50% of global chemical output and use, which should grow while compounds are increasingly exported internationally.\n\nLithium carbonate was at $7,000 in january, trading for $26,200 in November 2022\n\nLithium hydroxide prices increased from $9,000 per ton in january 2022 to $27,400 in November 2022. Spodumene, a lithium source gemstone, was selling for $450 per ton in january 2022 to about $2,300 in November 2022. Lithium metal was selling for $77,000 per ton in China to 97,000 per ton in July 2022.\n\n# Lithium Price Drivers\n\nThe lithium market is changing and the battery boom is the primary driver of this. The way physical market participants price lithium is evolving, with increased monitoring of spot-based price movements having an evermore profound impact on contract negotiations.\n\nLithium pricing trends are deeply rooted in the transportation segment’s ongoing shift toward electrification. In recent years, accommodative government policy, declining costs, consumer preference, and technological improvement have supported rapidly increasing adoption of electric vehicles. So far lithium supply have not kept pace with the surge in demand. It is expected for the lithium market to enter a supply deficit state for several years, presenting opportunities for the mining companies that dictate supply.\n\nSurging demand for EVs and the inelastic nature of lithium supply are the primary drivers behind the increase in lithium prices in 2022.\n\nSupply is unlikely to grow in lockstep with demand through the first half of the decade, likely generating deficits that could support elevated lithium pricing. Elevated lithium pricing has generally translated into strong results for lithium miners in recent quarters, including Albemarle, SQM, and Ganfeng.\n\nLithium prices have surged more than 120% year-to-date and are up as much as 10x versus historical levels, according to the Benchmark Minerals Intelligence lithium price index.\n\nMiners are hesitant to boost production, fearing that flooding the market with supply could push the prices down. For example, this scenario occurred between 2015 and 2018 when miners hiked lithium production in anticipation of rapid EV sales growth in the immediate term. This speculation turned out to be premature, leading to lithium price volatility during that period.\n\n# Important points to consider for the lithium market.\n\n* Lithium oversupply and slow downstream demand are weighing on lithium prices in China after material supply grew faster than demand.\n* During periods of high price volatility, producers and consumers negotiate more regularly to control the price risks of procuring lithium\n* Some consumers are procuring part of their material as a long-term contract as well as on spot to control the price risk.\n* Global lithium prices should follow China’s spot market.\n\n# Criticism to Lithium Extractions\n\nThere are critical reports on the extraction of lithium from salars: locals complain about increasing droughts, which threatens livestock farming or crops failures. It is still unclear to what extent the drought is actually related to lithium mining even though no drinking water is needed for the lithium production itself. What is disputed, on the other hand, is the extent to which the extraction of saltwater leads to an influx of fresh water and thus influences the groundwater at the edge of the salars.\n\nWhat do you think? What are tour positions on Lithium? Are you Bullish or Bearish?", "id": "1055z8t", "created_utc": 1673040249.0, "score": 55, "upvote_ratio": 0.92, "num_comments": 31, "comments": [{"body": "I remember reading that Lithium supply is coming online much faster than other important metals, like copper.\n\n> Analysts at Fastmarkets NewGen estimate global lithium production surged by 36% year-on-year in 2021 and expect total supply will rise from 540,400 tonnes of LCE in 2021 to more than three million tonnes by 2030.\n\n> There are as many calculations as there are forecasters out there, but the scale of investment in new lithium capacity is immense and set to grow further as the United States and the European Union actively try to nurture domestic supply chains.\n\n> The problem is that greenfield projects for any industrial mineral are prone to over-run, the potential for missed time-lines accentuated in the case of lithium by the need to certify chemical purity with customers.\n> \n> Moreover, much of lithium's supply growth is coming from new sources such as China's lepidolite deposits which come with their own new disruption potential.\n\n[Source](https://www.reuters.com/markets/commodities/lithium-still-super-charged-supply-chases-after-demand-2022-12-15/)\n\n[Another article](https://www.kitco.com/news/2022-12-30/Global-lithium-production-expected-to-nearly-double-by-2025-but-risks-of-persistent-supply-shortages-remain.html)\n\nSeems like we're going to have a lot of oversupply or balanced markets. [Graphic](https://i.imgur.com/ZUrZF5M.png) from October 2019 and another showing the [pace of new supply](https://i.imgur.com/6YBeeDF.png) by country. [The supply imbalance will shrink by this year](https://i.imgur.com/wTFhPsT.png).\n\n I think copper has a much bigger short fall in supply coming online. [I read a nice report about it here from Goldman Sachs](https://www.goldmansachs.com/insights/pages/copper-is-the-new-oil.html). Especially since the physical amount of copper needed is just enormous per electric vehicle.\n\n/u/jdinvestments I think you said something similar about lithium oversupply.", "score": 8, "replies": [{"body": "Yeah, that's my general thought. Lithium peaked at around $60,000/ton, from $10,000 from 2018-2020. Goldman Sachs is the most bearish. They forecast something like $16k if memory serves me right. But even the more bullish investment banks still project lower prices. Not that lithium can't be a profitable venture on, say $30k, but with the supply increases coming up, it won't be nearly as tight a market.\n\n>Analysts at Fastmarkets NewGen estimate global lithium production surged by 36% year-on-year in 2021 and expect total supply will rise from 540,400 tonnes of LCE in 2021 to more than three million tonnes by 2030.\n\nContrast this with copper, that will likely see *decreased* supply over the next decade.\n\nCopper nickel and zinc are my bread and butter, and to a lesser extent graphite. Copper specifically will unquestionably be facing severe shortages in the next few years *without* added \"green\" projects like EVs. Which you touched on succinctly.\n\nSo at the end of the day, lithium could very well be a good investment on its own, but if you're looking to play energy metals, why mess with the one with the strongest supply side when there's a half dozen other metals that will be impossible to adequately source?", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There's nothing pure play that excites me at the moment, but some ones I'm watching. I like NextSource and their Molo graphite project in Madagascar, but management has been terrible, and can't seem to make timely, meaningful progress towards actually getting a mine built and operational. They've been in various feasibility studies for years, and keep missing deadlines for new reports. If they show actual progress, they'd be top of my list.\n\nSyrah Resources has a good mine in Mozambique, and are much more competent. But they have to keep shutting down production due to ongoing regional militant conflicts. They'd be ideal if they could just operate in peace without interruption.", "score": 2, "replies": []}]}, {"body": "Tell us more about copper.", "score": 1, "replies": [{"body": "All you have to know is that if you took away solar, wind, and electric vehicles, any one of which consumes copper in record quantities, there would still be a global shortage within the next two years.\n\nIt's like selling water bottles to a group running a marathon in the Sahara.", "score": 1, "replies": [{"body": "Any positions?", "score": 1, "replies": [{"body": "Personally I own a good bit of micro cap exploration companies that probably aren't suitable for most people just looking for casual copper exposure. Ivanhoe and Teck Resources are both good names though for larger companies. I highly recommend the ETF COPX, as you also get exposure to Vedanta and Zijin, which are hard to own directly for western investors.", "score": 2, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}, {"body": "Would you give us your thoughts on the Jetti technology to solve the Copper issue? Apparently several big players are investing in it (BHP, Freeport, Teck, BMW).", "score": 1, "replies": [{"body": "It's an interesting technology. Basically an expansion of conventional heap leaching. I'm sure you're already familiar with the process, but to quickly recap for anyone who may stumble across this in the future, bear with me.\n\nThere's a hundred different variables that make a mine economic. Some high grade mines are poor operators due to external expenses, and some low grade mines can still mint a fortune. But generally speaking, a good rule of thumb is that anything beyond a 1% grade begins to enter into \"big boy\" territory. Leaching was a game changer because it allows the economic processing of ore down to 0.1%, 0.2%. The drawback has always been that its only viable for certain types of deposits, namely secondary sulfides.\n\nSupposedly, Jetti has found a way to leach primary sulfides, and is claiming they can double or triple the amount of ore that can be extracted. If that's true, then it's the next revolutionary development in copper mining, and will bring online a lot of new copper that was otherwise discarded as waste.\n\nI am, I don't want to say skeptical, but maybe more reserved in my outlook on the technology. Consider that traditional leaching, while common, isn't universally adopted, and the technology has been around since the 60s. Supposedly Jetti hooks in to pre-existing leach pads, so that needs to be set up before they can come in. Forgive me if my numbers are off, it's been a minute since I've spent time on them, but they claim their TAM is something like a third of total global supply by 2050. Which on paper is a huge, game changing amount. In practice, we know they won't hit 100% TAM. And more importantly, that's 25 years away. We're short today.\n\nRight now they only have the feasibility project with Capstone, which will take a few years for proof of concept. Then a larger roll out if other mines want to adopt the technology. I guess, I'm optimistic. If the tech is there, it's a major discovery for the copper industry. But it does little to move the needle for this decade. \n\nFWIW, Rio Tinto also has their own similar tech, which they offer to juniors who join their network. Rio is a minor partner with BHP at the Escondida copper project, which is a major, major copper mine. They and Jetti are both trying to get their tech into the mine. That will be a major point of progress, for whoever gets that project, assuming it works.", "score": 1, "replies": [{"body": "Thanks a ton for your time :)", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">>Analysts at Fastmarkets NewGen estimate global lithium production surged by 36% year-on-year in 2021 and expect total supply will rise from 540,400 tonnes of LCE in 2021 to more than three million tonnes by 2030.\n\nThree million is very optimistic. But if you take optimistic EV car sales, the demand for LCE would still surpass supply in 2030.\n\n>Seems like we're going to have a lot of oversupply or balanced markets.\n>The supply imbalance will shrink by this year.\n\nWeird that you use this as a source of a coming oversupply when it shows a projected deficit.", "score": 2, "replies": []}]}, {"body": "ive taken a beating on LAC", "score": 7, "replies": []}, {"body": "Great information. thank you.\nI'm bullish but in the long run. 10 years plus. Demand will rise if we can't find another technology.\nI saw an interesting video about that recently. The content had nothing to do with investments but more the technology and science. But still you could get many Infos.", "score": 6, "replies": []}, {"body": "Anyone interested in this space should check out Joe Lowry - imo the single best point of information\n\n\nThere is a comment above somewhere on goldmans being the most bearish - you have to keep in mind the conflicts of interest with the the big banks, GS need to satisfy their clients. Bearish reports have helped lithium stocks move lower, all whilst goldmans have doubled their lithium exposure. Food for thought maybe.\n\nDisclaimer i am bullish", "score": 5, "replies": []}, {"body": "Thank you for the information, and well put together in a piece. Lithium would be vital, given the push towards electrification in transport and energy storage solutions at least for the next decade. People have said that batteries will be a bigger thing than AI, in terms of dollars (i do not have the numbers now). \n\nI have been buying LIT which has held some of these companies mentioned here. Is there a better ETF you guys are buying?\n\nHydrogen has elicited attention but mostly driven by government funding.", "score": 2, "replies": []}, {"body": "Standard Lithium. SLI is on the move.  Volume and price up.  Supposed to be announcing plans progress in Feb but nothing released yet.  Not sure the cause but something is making this stock a buy.  Check it out.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I'm so happy I got in when I did. Already up $3.5k on it just after the NASDAQ news", "score": 1, "replies": []}]}, {"body": "how can we not mention the one company... that ex tesla man ryan melsert is building..", "score": 1, "replies": [{"body": "lol", "score": -1, "replies": []}]}, {"body": "Recent lithium price increases have been driven mostly by EVs. ALB is on my watchlist but I’m too afraid to invest for the long term in case another battery or power storage/generation technology emerges. That space is ripe for disruption from hydrogen fuel cells, graphene supercapacitors and even miniaturized molten salt nuclear reactors. I could easily see tractor trailers powered by thorium reactors in my lifetime.", "score": 0, "replies": []}, {"body": "You should check out Critical Elements (CRE-V). They are one of the few fully permitted names in North America albeit not in production yet.", "score": 0, "replies": []}, {"body": "Gonna leave this here. I posted this almost 2 years ago and I think the conclusions are still true. \n\nhttps://www.reddit.com/r/SecurityAnalysis/comments/ld7fuv/coal_miner_pivoting_to_miner_for_hire_nc_to/", "score": 1, "replies": []}, {"body": "ALB has been in downtrend for some time. Any hope it will get back to its high", "score": 1, "replies": []}, {"body": "Question, I came across your post and clearly you are very knowledgeable in the Lithium mining sector. During some research I came across a company called Arcadia Minerals, a small-cap lithium miner. They are listed on the Australian stock exchange. I am in Canada and am looking to gain exposure in their company but I am unable to do so on my normal broker... was wondering if you may have an idea of a broker that I could use, or how I can find out what brokers they are listed on. Thanks in advance.", "score": 1, "replies": []}]}
{"title": "Job advertisements at Tesla: Former soldiers and secret service agents wanted for German factory", "selftext": "", "id": "104s0ch", "created_utc": 1673004945.0, "score": 56, "upvote_ratio": 0.95, "num_comments": 25, "comments": [{"body": "The ex secret service / special investigator angle is interesting.  Supposedly to protect IP and other company secrets.", "score": 14, "replies": [{"body": "[removed]", "score": 14, "replies": [{"body": "[removed]", "score": -1, "replies": []}, {"body": "[removed]", "score": -1, "replies": []}]}, {"body": "It may also be that they are about to develop some kind of vehicle/device for war (based on Cybertruck?) and they need talent for that.", "score": 2, "replies": [{"body": "Cybertank, with FSD ![img](emote|t5_n9evv|3981)", "score": 5, "replies": []}, {"body": "I think Musk said something before about not wanting to design stuff made for war", "score": 4, "replies": [{"body": "That was before there was a popular war happening.", "score": 3, "replies": []}, {"body": "It may be something for the MCRN ;)", "score": 2, "replies": []}]}]}]}, {"body": "Americans and American companies are consistently proud of specifically targeting hiring veterans. Does German culture today feel different? I don’t have any German friends to ask.", "score": 9, "replies": [{"body": "I live in Germany and know a few veterans. It is not appreciated here like it is in the US.", "score": 9, "replies": []}, {"body": "No one gives a f in Europe if you're a vet or not. I would say it's not in your favor because they're more prone to having PTSS or  being a looney tune in general. \n\nI am sure there are some branches where it's a plus but I have never heard of it.", "score": 3, "replies": [{"body": "I would say discipline in some European countries is not necessarily high. So a manager looking for discipline would appreciate a vet.", "score": -1, "replies": [{"body": "Pretty sure Germans are generally regarded as well-disciplined on a cultural level, they're notorious for their efficiency, attention to detail, and getting up at 6 am on holiday to reserve sunloungers next to the hotel pool by placing their towels on them.\n\nIt's definitely a weird request unless it's specifically for security/counter corporate-espionage work, which would make sense.", "score": 2, "replies": [{"body": "I wasn’t thinking specifically of Germans… but now you mention it there could be an east-west cultural divide wrt work-ethic.", "score": 1, "replies": [{"body": "I'm not so sure, there are many Western European countries that have a reputation for low work ethic (e.g. Spain), and many Eastern that have one for a good work ethic (e.g.Poland).\n\nBut I made my comment with the assumption that Tesla would almost certainly be hiring Germans, it's not uncommon for Europeans to work all over Europe, but for the most part, one of the reasons that factories are allowed to be built in a specific area is the promise of job creation for the local community.\n\nIt may be the European hub for Tesla, but it's almost entirely staffed by Germans.", "score": 3, "replies": [{"body": "I don’t know much about East Germans, but I do know that Tesla is already the largest manufacturing employer in the region, and I have a feeling that eg polish feel they have something to prove wherever they go, whereas East Germans might tend to rest on their German laurels.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "No company is explicitly proud or showing off that in advertising but it is also not special for a german company to look for veterans.", "score": 1, "replies": []}, {"body": "No. Not at all. \n\nThe interesting thing here is that they put this position with their normal job offers. Normally you would secretly hire a head hunter to find someone to spy on the employees. Here it appears to be a scare tactic against leakers. \n\nNot a good sign for corporate climate.", "score": -3, "replies": [{"body": "This is hilarious. Security is a big part of any job and Tesla and SpaceX has always listed these positions in the past.", "score": 8, "replies": []}]}]}, {"body": "No clue what Tesla wants to do with them but not too uncommon. I worked for a large, globally known consumer brand and they had former FBI agents on staff to try to slow down leaks, sample theft, etc.", "score": 1, "replies": [{"body": "Yep, standard physical security stuff. It is now getting more and more integrated to 'one' security function (IT security and physical security).", "score": 1, "replies": []}]}, {"body": "Model T (for Tank) incoming", "score": 1, "replies": []}]}
{"title": "First port is down -57%. Should I just liquidate it to do purely thetagang strategies?", "selftext": "For context, I (24M) got into the stock market because of the GME fiasco, got into options without knowing better and now at a loss of 9k USD. 6.7k in value is left in the port in some SPY & VOO shares (-5% & -15%) and an INTC LEAPS (-60%)\n\nI've essentially treated the port as a lost cause, haven't funded it in months and started to build a new one instead. I've been practing paper trading CSPs and wheeling. I live in Singapore, so capital gain tax does not apply for me (to my knowledge). I intend to stick to CSPs, wheeling, SPX credit spreads and keep the INTC LEAPS if I were to go ahead with this plan.\n\nIs there anything else that I will need to know before I were to liquidate the account?", "id": "104skzq", "created_utc": 1673006859.0, "score": 2, "upvote_ratio": 0.57, "num_comments": 22, "comments": [{"body": "You went in to option without knowledge and you only lost 57%? You need to know how lucky you are that you still have such a sizable portion of your portfolio left. \n\nYou are on the right track now though, continue paper trading until you find suitable strategies that you can execute profitably and consistently and build up your protfolio again.", "score": 19, "replies": [{"body": "Haha thanks, its mostly due to me being too stubborn to sell the SPY/VOO shares. My 2nd port is coming up nicely as I continue to DCA into it, and as I continue practicing on the paper account, I was thinking might as well apply that for my first port", "score": 5, "replies": [{"body": "Don’t sell your indexes; they’re gonna bounce back. Might take a few years. You could consider writing some covered calls against your cost basis for both your index positions and your LEAPS.", "score": 1, "replies": []}]}]}, {"body": "Do you have other income to help build the other account? \n\nI personally don’t see a ton of value of a 24 year old liquidating that small of voo and spy position. 6.7k isn’t a lot of capital to make meaningful consistent returns, especially wheeling. I would just let that cook until you have a good trading plan. I think having around $30k-50k is where you can really diversify your trades and make money selling options.\n\nThese are just my opinions and not financial advice, as there are many on this sub who trade small accounts, and some may make good returns. You’re 24, no need to rush any of this.", "score": 3, "replies": [{"body": "I got a job that I set aside a portion of the salary for the other account. The plan for the 6.7k account would purely be for selling options to at least recuperate some of the losses no matter how slow it takes, otherwise its just gonna sit there and collect like $4 in dividends only", "score": 2, "replies": []}]}, {"body": "Stop calling your portfolio “port”", "score": 1, "replies": []}, {"body": "Switch to non-time based charts (fixed size brick bars)\nTrade trend momentum inflection points undistorted/unwarped by time based charts using sub-$1 near-dated 25-50 delta (occassionally 5-20 delta) options - key here is clear signals on trend inception/reversal inflection points for asymmetric R:Rw setups. Do this all day long compounding high probability gains, low stress, instant feedback loop. \n\nSignals are key, rest is just:\n\nnon-time based charts - do not warp/distort price action\neasy trend inception/reversal inflection point identification\nmoney mgmt, position sizing, scaling/pyramiding method\n---------------------------------------------------------------------------------------------\n= positive expectancy\n\nDo not lose hope - intraday swing is literally a cash register upward sloping ratcheting up equity run curve, I do 25-50 bps ROE daily (annualizes to 62-125%), with -27 bps max drawdown using btwn half and couple % of my total equity - such is the power of cap utility efficiency. High double-low/mid triple % ROIs when catching trend momo run on short term low delta options explode multiple fold. Weapons of choice any liquid single names/broad mkt & narrow sector ETFs/index, futures options. 50-100 bps daily if feeling extra frisky.\n\nOn the small acct challenge routinely start w/ $500-1k, avging 4-5 % daily ROE trading cheap options to keep within PDT cash acct available funds framework, nettingng $40-50 on $1k acct base, continuously adjusting daily % goals for compounding) to multiply into 5 figures for fun\n\nTrack projected vs actual schedule in Excel for discipline/structure/accountability\n\nKISS - very few moving parts, clear PnL attribution (all spot/delta driven), exponentially recover/grow your acct, then taper down to more passive resilient income theta spread trading. Never gonna grow your small acct aggressively w/ 20-30% annual return.", "score": -2, "replies": [{"body": "r/okbuddyretard", "score": 1, "replies": [{"body": "Here's a sneak peek of /r/okbuddyretard using the [top posts](https://np.reddit.com/r/okbuddyretard/top/?sort=top&t=year) of the year!\n\n\\#1: [G](https://i.redd.it/uy5cdd0mnkp91.jpg) | [197 comments](https://np.reddit.com/r/okbuddyretard/comments/xls181/g/)  \n\\#2: [Thank you all for being so helpful :) I love the positivity in this community. Here's the screenshot as promised](https://i.redd.it/b1gd5xc7t9291.jpg) | [268 comments](https://np.reddit.com/r/okbuddyretard/comments/uzup85/thank_you_all_for_being_so_helpful_i_love_the/)  \n\\#3: [Lets go unretarded for a second. My fucking school put this shit up. I'm being 100% serious this this in all the classes of the school](https://i.redd.it/8uvuolwddfc81.jpg) | [846 comments](https://np.reddit.com/r/okbuddyretard/comments/s6un9x/lets_go_unretarded_for_a_second_my_fucking_school/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)", "score": 1, "replies": []}]}, {"body": "I actually love what you're saying. So many in Theta Gang are so risk averse they might well just buy and hold an ETF. I just wish you could eli5 your points. As a beginner it's pretty hard to understand what you're saying. Following you now.", "score": 1, "replies": []}]}, {"body": "Op, idk options too well but my brother is heavy into them. I joined this sub hoping to sponge knowledge etc while listening to my brother's advice etc. I just lurk and read but since you mentioned Gme as a fiasco have to take a risk and comment regardless of any downvotes or negatively. The latest on \"meme\" stocks is blood red but I certainly wouldn't tap out atm. Now is when you need to average down for position. Gme isn't about fundamentals same as a few other tickers. MM or SHF play on basic human emotions for you to feel this way. Me personally I've done a few cc's on memes but always nervous and prefer to average down and hold. \nThe comments so far are gold and I wish I could relate to the knowledge but again this play isn't pure fundamental. Obviously nfa", "score": -1, "replies": [{"body": "I bought GME at the very peak lol. And only owned like 14 shares. It was very foolish of me who knew nothing at the time. \n\nI did not completely abandon meme stocks though, with GME being at ~17 I can afford to do CSPs to collect premium and wheel it on assignment if I proceed with my plan", "score": 2, "replies": [{"body": "I'm not sure the solution to getting roasted by GME is more GME.\n\n\nYou can do spreads with a small account on better stocks if you are desperate to make plays to keep position size small.", "score": 4, "replies": []}, {"body": "I completely abandoned memes selling CSP on AMC and GME. I suggest you do the same to save you the time and money. Sell strangles on low IV etfs like XLF or CSPs on stocks that are low-medium IV that are profitable. The premium is significantly less for a good reason. GME can go to 12 much quicker than you think.", "score": 1, "replies": []}]}]}, {"body": "Can you explain that more..”I got into the stock market because of the GME fiasco”? Are you in the stock market through a retirement plan or anything or is this literally your only stock investments? Once you answer their I will give my cents on what you should do.", "score": 1, "replies": [{"body": "When GME blew up, that's when I got more interested in investing. So I made a Saxo account and bought only shares at first as I did not know about options at the time. I bought popular tickers like GME, NVDA and AMD at the time when they were overpriced.  I learned about options a few months later and lost a lot of money because I didn't do my research before jumping in, and ended up selling my tech shares at a significant loss (couldn't do CCs because I only owned like 7-12 shares of each)\n\nNow I have a new 2nd portfolio that I'm slowly building for my own retirement and future. The first port is still there, but I barely touched it aside from the INTC LEAPS and am wondering if I should liquidate it for Thetagang trades", "score": 1, "replies": []}]}, {"body": "You can do credit spreads, you don’t need a lot of money to do credit spreads. You can start with $100, but the bigger the account the easier it is.", "score": 1, "replies": []}, {"body": "I have only 3k account tried selling puts it need à lot of monney,  non I am learning crédit call spread", "score": 1, "replies": []}, {"body": "\"For context, I (24M)\" bruh age and gender really had nothing to add here... just saying", "score": 1, "replies": [{"body": "I don't think he was really looking for someone to coach his writing...just saying.", "score": 1, "replies": []}]}, {"body": "Better to learn that lesson now than later with more sums of money. I did something similar and now stay away from meme and cult stocks. Most blue chips are down 30-35 percent so stick with profitable and moderate IV companies if you're selling CSP. \n\nDo your analysis and prepare to own the stock if we get another downturn. I buy and hold indexes from employer contributions and sell options on trading portfolio. Develop a new strategy and derisk. It's gonna take me at least 4-5 years to break even but the years will go by and invest in your career. I lost 1 year of salary but the good news is if you stay working you can make the money back. Take your losses and move on.", "score": 1, "replies": []}, {"body": "Keep the shares, dump the leaps.", "score": 1, "replies": []}]}
{"title": "\"Insider\" info?? Passed around 10 trucks loaded with Tesla cars, direction from Austria to Germany. Makes no sense, or it actually does!?", "selftext": "[removed]", "id": "104sw7e", "created_utc": 1673007847.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|3 months ago\n**Total Comments**|154|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Being in a tunnel doesn’t make it insider info", "score": 15, "replies": [{"body": "lool!! Technically, it does... an insider info with two holes on both sides.", "score": 1, "replies": [{"body": "How did you call your mom?!", "score": 3, "replies": []}]}]}, {"body": "thats not how it works because cars build for different markets have different features because of the local laws - storytime:\n\nWhen I bought my new Audi I could pick it up from the factory and got a guided tour(Ingolstadt Germany) and I saw many cars with ugly orange lights(not the indicators) in the front but mine didnt have them.  I asked my guide and he told me it's the american version those light's are required by law there. He was also showing me a button in the trunk and I was confused why would you need a button inside the trunk? Appearently it's to open it from the inside incase of kidnapping they have that in american cars lol.", "score": 3, "replies": [{"body": "Well, you are right there! But I guess at Tesla, not more than just a matter of a right software installation...", "score": 2, "replies": []}]}, {"body": "Moving vehicles on transport trucks costs a lot of money - especially in europe where fuel, road charges and wages are high.\n\nAs a car manufacturer/dealer, you want as few km as possible for your vehicles on those trucks.\n\nWhich makes me think this is just some random event(testing, recalls, who knows) as if they were moving cars from China to Europe it would be done by car transporter ship.\n\nMight of just been a local delivery even, and it took a wrong turn and so is appearing to go 'the wrong way' as they get back on track.", "score": 2, "replies": [{"body": "The trucks mostly had Bulgarian registrations, some of them from Italy. Which would kind of make sense, since the shortest sea route from China to the EU (Germany) would be the Suez channel. But the costs of such transport must be ridiculously high, even for a costumer like Tesla!", "score": -1, "replies": [{"body": "Ah, interesting. Probably are Chinese Teslas then! Good spotting.", "score": 2, "replies": [{"body": "Most likely! Nothing else does make any better sense here.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Those are hitting direction Germany. Since Giga Berlin (also in Germany), this delivery makes no other sense but, Tesla his huge struggle (costs of this transport...) to sell Shanghai cars in the China. And since this is a Walstreetbets and not Teslafans, such info may matter quite a lot...", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[Now, do I ??](https://www.cnbc.com/2023/01/06/tesla-suppliers-jump-as-ev-maker-cuts-prices-for-some-models-in-china.html)  No company goes and trow money for senseless transport around the globe! Seems like Tesla CANT sell the Shanghai cars, and where production capacity dropped already to 80%. If these are actually a Shanghai cars, then this could be a damn strong signal right there!", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I get it now, you are all in at Tesla.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">Price cutting isn't new information. That's been on the cards for monts as had the reduction in Shanghai output.\n\n???", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "OP = Tesla bag holder ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 2, "replies": [{"body": "You seriously need to drop the drugs! They are obviously disturbing your perception of the reality....", "score": 0, "replies": [{"body": "Says the bagholder posting a tunnel photo of some tesla cars calling it \"insider info\"\n\nSure buddy im the one on drugs ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Op ist ein aluhut Träger", "score": 1, "replies": [{"body": "And there goes another one...", "score": 1, "replies": []}]}]}]}, {"body": ">This is most likely just a one-time event and not indicative of anything larger. China has been cracking down on luxury imports in recent years, so it's possible that these cars were part of a shipment that was seized by authorities.", "score": 1, "replies": []}, {"body": " This guy films a truck loaded with 7 Tesla and claims an inside story with ties to China.  👍  👍  👍", "score": 1, "replies": [{"body": "And this man is too stupid to get the bigger picture! What are you doing on Wallstreetbets??? If you are a trader than hell, you must be broke by now!!", "score": 0, "replies": []}]}]}
{"title": "Tesla Isn't Apple. Elon Isn't Steve Jobs. EVs Aren't the Next iPhone.", "selftext": "", "id": "104ui9c", "created_utc": 1673012551.0, "score": 65, "upvote_ratio": 0.74, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|8 months ago\n**Total Comments**|95|**Previous Best DD**|\n**Account Age**|8 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "Yeah no shit", "score": 19, "replies": []}, {"body": "Tweeter is not Apple Maps", "score": 9, "replies": []}, {"body": "Yeah, Jobs was much better at stealing and repurposing then self branding to hide how evil he was. Dude managed to stay popular until he died and people finally started realizing the level of abuse he put the people in his life through. I’m glad the moron thought he could cure his cancer with crystals.", "score": 2, "replies": [{"body": "The secret of being a CEO is to not publicly state your divisive opinions. Literally just keep them to yourself.", "score": 9, "replies": []}, {"body": "The salt is real", "score": 5, "replies": [{"body": "Dude smelled like shit, abused his children  and wife, and put his employees through hell. Fuck him.", "score": 2, "replies": [{"body": "Are you the “GUH” guy who got smoked on his AAPL calls way back when? ![img](emote|t5_2th52|4271)", "score": 0, "replies": [{"body": "Nah I just think he’s a cunt.", "score": 1, "replies": []}]}, {"body": "Chemotherapy makes you smell like shite. Just saying.", "score": 1, "replies": [{"body": "He didn’t do chemo. He just didn’t shower. He used alternative medicine like crystal healing. Thats why he died.", "score": 4, "replies": []}]}]}]}, {"body": "Yup, I’m with you here. Jobs was also a crazy asshole, but also a visionary who could see things that could change the world too. Musk helped the transitions to EVs and that is getting lost amid all the drama. Did he personally engineer all this? No, no more than Jobs created the iPhone. But sometimes you need a visionary and money to make progress and in that sense they are alike.", "score": 3, "replies": [{"body": "At least Jobs created *something*. Musk is just a glorified hype man buying companies, forcing out the founders, and calling himself an engineer when he couldn’t engineer his way out of a wet paper bag.", "score": 3, "replies": []}]}]}, {"body": "But Tesla a cool “Self Driving Car”.", "score": -1, "replies": [{"body": "Next year", "score": 4, "replies": [{"body": "Always next year.", "score": 3, "replies": []}, {"body": "2 weeks bro", "score": 1, "replies": []}]}]}, {"body": "You're right.   \n\n\nTesla makes a better product.  \nElon is smarter than Steve Jobs.  \nEVs are the direction of automobiles, not phones.", "score": -9, "replies": []}, {"body": "![img](emote|t5_2th52|18630)", "score": 1, "replies": []}, {"body": "Hot dogs are not burgers", "score": 1, "replies": []}, {"body": "BusinessInsider isn't WSJ", "score": 1, "replies": []}, {"body": "Or is it?", "score": 1, "replies": []}]}
{"title": "sentiment shenanigans and more trading theory", "selftext": "As some of you may know, when sentiment is overly biased on a single asset, such as the SPY or QQQ, brokers like to harvest the return to equilibrium. This happens all the time in the stock market. People call it stop hunting or \"pulling the rug\" on inexperienced traders. Today was particularly bloody for anyone that was short today, in this case, the majority.\n\n**Why am I always getting f\\*\\*\\*\\*\\*\\* by the market exactly when I buy anything?**\n\nWell, first of all. The data centers that run all U.S. markets, located in the Northeast, are built and operated by some *really smart motherfuckers.* They can literally see everything about you in real-time. When you have your trading terminal open, what tickers you are watching, how much you have in your account, where your mouse and keyboard are pointing, and your historical trading patterns. It's not one dude spying on you, it's a huge array of supercomputers that have enough power to predict what you are going to do and if it would be profitable or not to trade against you. This is why we hear the old saying, \"always bet against the crowd.\"\n\n**How do I beat these so-called master algorithms?**\n\nYou don't need to beat the computers. You just need to beat the crowd. If you think like everyone else, you will lose more money. You need to be patient and buy when markets are sinking. Sell when markets are strong. Pay attention to the overall trend. Right now, the Federal Banks are trying to restrict spending. This means that over the year, the stock market is going to stay flat or keep going down, with the exception of some sectors. Yes, there will be ups and downs, but basic Dow theory states that up-days will be smaller and occur less frequently than down-days in a downtrend.\n\n**How do I grow my capital wicked fast?**\n\nIf you really want to grow peanuts, you need to be aggressive. A good 2-3% day on the QQQ will net you multiples of two to three with short-dated options contracts. You want to be fighting the short-term price action, like what happened today, and riding lower lows. If you're afraid of trading that hard, then you really are a poor sucker. Losing a couple grand is not going to have a major effect on your life. Otherwise, you are wasting time and should just get a job.\n\n**What is good inversing?**\n\nInversing is when you hear or see an idea that makes sense, but still take the opposing view. It's actually a useful social skill, beautiful women do it all of the time because of the bullshit they have to deal with. Anyways, if you see this sub getting overly excited about being short or long, the following session will more than likely move the other way. This has to do with cascading information. We can always assume that the worst traders, people like us, are last to the party. If we know that we are likely to be wrong, it's smart to deny the first impulse that comes to mind. This is how all good traders think. If you are worried about a position, that's a good thing. If you think that a trade is free money, you're going to lose.\n\n**What's the poop desk up to?**\n\nI work at a poop desk, which means that I get to work with swanky, sweaty, try-hard traders. They think that a recession is going to happen. Not only that, but the war could get worse too. That's a double whammy for anyone that isn't long bonds. It's going to be a slow year for small-caps and growth stocks. Be careful with DOOM calls and 0DTEs. Today was a big exception, I missed the run-up but was able to get a good position with weekly puts on the QQQ. We treat money like a videogame. None of us are attached to the value of our trading accounts. All we care about is learning how to improve and being right about future events and prices. If you want to become a professional, do not stop trading. Every trade you take makes you a better trader. If you blow up, that's fine. You will earn it back through time.", "id": "1056nsp", "created_utc": 1673041860.0, "score": 45, "upvote_ratio": 0.87, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|3 months ago\n**Total Comments**|189|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)\n>TL;DR: 1. The market is manipulated by computers that can see everything you do.", "score": 1, "replies": []}, {"body": ">I'm sorry, but I have to disagree with you on a few points. First of all, the stock market is not run by computers. There are humans involved in making decisions about what trades to make and when to make them. Second, you can't just \"bet against the crowd\" and expect to win every time. The markets are complex and ever-changing, so there will always be times when the majority is right and you're wrong. Finally, growing your capital wicked fast is not necessarily a good thing. Yes, it might net you more money in the short term, but if you're taking too much risk then you could also lose everything just as quickly.", "score": 45, "replies": [{"body": "VM going truth mode", "score": 15, "replies": []}, {"body": "Wow.  VM just fucked your wife", "score": 25, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 7, "replies": []}]}, {"body": "Half right. Humans tell the computers which direction to move and they handle the rest.", "score": 4, "replies": []}, {"body": ">![img](emote|t5_2th52|27189)", "score": 3, "replies": []}]}, {"body": "least schizophrenic WSB user", "score": 15, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 6, "replies": []}]}, {"body": "Too many words to say “it may go up or down, I don’t know, be careful “", "score": 12, "replies": [{"body": "He's basically saying always go against the trend. Also seeming to say long term bear for the year until inflation cools to 2 percent", "score": 5, "replies": [{"body": "He also said go into bonds. But I think he just meant hold 2-yr until valuations are better and the fed actually pivots.", "score": 1, "replies": []}]}]}, {"body": "Needed this 🫂", "score": 6, "replies": []}, {"body": "Tldr; the George Costanza method.", "score": 3, "replies": []}, {"body": "TLDR; Idiotic opinions and conspiracy  theories.", "score": 6, "replies": []}, {"body": "VM just made you deep throat his virtual bbc", "score": 2, "replies": []}, {"body": "Too shallow", "score": 1, "replies": []}, {"body": "Weekly puts on QQQ. Not afraid of good CPI figures which would be yet again an excuse for the markets to rally?", "score": 1, "replies": []}, {"body": "you are like insanely off-base. the market up went because the ten-yr yield fell in response to lower wage and price inflation. this is what an 'inflationary market' looks like in fact, we are not in the old market regime yet. yields have to come down to match cpi thus pumping the stock market. earnings means nothing to the bond-market, multiples just expand to match. it's just about stocks vs. bonds as asset classes.", "score": 1, "replies": []}, {"body": "So inverse this guys and buy calls? Got it! Based on Friday’s Price action, we are starting a new bear market rally, that could essentially run us up to the 400 or more by eow of next week.", "score": 1, "replies": []}, {"body": "Do you think it was a bit risky getting weekly puts today, when events like CPI are taking place this week that could shoot this up? (A run up to CPI as is common) I'm in puts myself, but I wanted to hear your reasoning.", "score": 1, "replies": [{"body": "I try not to overthink too much when I make a trade. It's usually simple logic that prevails, especially when the crowd and the media are biased. My firm does extremely large data mining and is bearish across the board for 2023. So, the play is a strong up day before significant data is released, which is a perfect time to start a short position. We don't worry about the noise, what matters is where our AI thinks prices will be in the future. If you're bearish for the entirety of 2023, then the likelihood of a weekly run-up is simply much lower. This is what should give you confidence to hold through price improvement and not get immediately stopped out.", "score": 3, "replies": []}]}, {"body": "👍", "score": 1, "replies": []}]}
{"title": "ISM New Orders Service Sector shows crazy drop (not seen other than during the lockdown). Recession confirmed, but go ahead buy the dip", "selftext": "", "id": "1059akw", "created_utc": 1673048116.0, "score": 62, "upvote_ratio": 0.87, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|0|**First Seen In WSB**|11 months ago\n**Total Comments**|738|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 1, "replies": []}, {"body": "It is clear that the service sector is in a state of decline. This is evident from the ISM New Orders Service Sector index, which has seen its biggest one-month drop in history (outside of lockdowns). The index currently stands at 70, down from 80 just last month. This paints a very bleak picture for the economy and suggests that we are heading into another recession.\n\n ^^[**Discord**](http://discord.gg/wsbverse) ^^[BanBets](https://www.reddit.com/r/wallstreetbets/wiki/banbets/)  ^^VoteBot ^^[FAQ](https://www.reddit.com/r/wallstreetbets/wiki/votebot/) ^^[Leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard/) ^^- ^^[**Keep_VM_Alive**](https://www.patreon.com/visualmod)", "score": 18, "replies": [{"body": "My dick's in a recession", "score": 27, "replies": [{"body": "My dick was like Nikkei 1989 but now it's like Nikkei 2022.", "score": 1, "replies": []}]}]}, {"body": "I'm pretty good about confirmation bias, I only use it after a trade 😂😂", "score": 8, "replies": []}, {"body": "[deleted]", "score": 30, "replies": [{"body": "No, I found it, it was me, I, who found the chart time machine!", "score": 25, "replies": []}, {"body": "That’s like when I found the graph about your moms tits", "score": 5, "replies": [{"body": "2 penumbra s", "score": 1, "replies": []}]}]}, {"body": "From my personal experience I have seen the biggest inflation in restaurants they are extremely expensive so it does not surprise me that the service section would be hurt. I am avoiding them and eating home more. I also am on a diet but that is probably a contributor.", "score": 6, "replies": []}, {"body": "That's because everyone has been serviced already (behind the Wendy's dumpster) and are spending on goods, which is why the manufacturing index is not flashing recession.", "score": 3, "replies": []}, {"body": "Hmm...I wonder what comes next.", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|18630)", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|27421)", "score": 7, "replies": []}]}, {"body": "Ho ahead and sell Dumbo", "score": 1, "replies": []}, {"body": "If you look at any previous dip/ recession the recovery started at or before the worst. So if that chart is correct and does not dip much more or already bottomed out then the market would already be recovering.", "score": -4, "replies": [{"body": "How do you “remind me in 3 months” to test your theory?", "score": 2, "replies": [{"body": "!remindme 3 months", "score": 3, "replies": [{"body": "I will be messaging you in 3 months on [**2023-04-07 12:07:39 UTC**](http://www.wolframalpha.com/input/?i=2023-04-07%2012:07:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1059akw/ism_new_orders_service_sector_shows_crazy_drop/j3bphi7/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1059akw%2Fism_new_orders_service_sector_shows_crazy_drop%2Fj3bphi7%2F%5D%0A%0ARemindMe%21%202023-04-07%2012%3A07%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201059akw)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "It’s not even a theory. Look at your chart and take 08 crash for example. That chart bottomed out in 09 when the market started recovering. The problem is there is no way to know when the worst has actually occurred.", "score": 2, "replies": [{"body": "Accurate but this would also be the shallowest drop and the first \"normal\" recession that did a v recovery in this index.", "score": 1, "replies": []}]}]}]}, {"body": "Will do. If I had bought most anytime during the dip in previous downturns I would be stinking rich but I didn’t and held back because people said don’t buy.", "score": 1, "replies": []}]}
