{"title": "JPM trading interface blows", "selftext": "Displaying -100% as if it expired worthless with a month to go. Tried selling during this morning's opening dip and couldn't trade it. After being passed around customer service to talk with advanced trading support, he said he was showing a slight gain on his end (which, by the time I spoke with him, this had moved from $307 to $312).\n\nAny suggestions for better brokers? What's the general consensus? Suggesting RH gets you banned from all of Reddit and a 14 day ban from the entire internet.", "id": "13osbcl", "created_utc": 1684765312.0, "score": 291, "upvote_ratio": 0.95, "num_comments": 98, "comments": [{"body": "This is not a JP Morgan issue. Fidelity does this too if you look at option values before the market opens. Also, if your options aren't filling you're likely using old market data.", "score": 61, "replies": [{"body": "yeah man trying to sell a contract with no volume? at the open? shocking!", "score": 7, "replies": []}, {"body": "The problem was this was 14 minutes into open, and persisted for an hour before I contacted customer support. I thought they made some sort of fuckery decisions on my behalf in this time.\n\nBut ty for the feedback on Fidelity. Does that still hold true if you consider this BS was displayed for an entire hour into trading?", "score": 10, "replies": [{"body": "Fidelity behaves the exact same way, at 9:45AM I start seeing 9:30AM data. What's odd is that the \"current value\" is usually current, but the \"last price\" is almost always delayed by 15 minutes. At the start of a new day, all of my options show 100% gain or loss depending on whether I bought or sell and stay that way until 9:45AM.\n\nI use Robinhood and TD Ameritrade to get my quotes and then make my trades in Fidelity.", "score": 6, "replies": [{"body": "thats why i only trade options on robinhood, fidelity is my retirement and actual real stocks i invest in. i do all my gambling on robinhood. never seen or had an issue with robinhood, everyone hates it but the platform is seamless", "score": -7, "replies": [{"body": "Robinhood is pure dog shit. If you use them for anything other than stats you’ll eventually pay the Piper.", "score": 17, "replies": [{"body": "I'm personally banning every person who suggests trading with RH. I haven't gotten my Reddit admin credentials emailed to me yet, but you better believe, once I log in I've got at least 3 accounts on my lifetime ban list that'll find all attempts at ever posting again to be futile.", "score": -5, "replies": [{"body": "Your Reddit admin credentials? Lmao what are you on about?", "score": -2, "replies": [{"body": "I mentioned earlier that I'm banning anybody who suggests using RH to trade.", "score": -5, "replies": [{"body": "Admin credentials aren’t a thing lmfao.", "score": -2, "replies": [{"body": "That's kinda what makes it a joke", "score": 11, "replies": [{"body": "Not funny anymore once you explain it", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "It is garbage. Try using better data from somewhere else. I like using WeBull. I pay an extra $3 a month for live option chain data on WeBull to see real prices. Also, don't have to open the chase app to check, so it's much quicker. Data is unreliable , slow to update on Chase but it obviously won't be possible to fill with the bad data displayed. You'll get the real price if you do execute a trade.\n\nTLDR; Ignore Chase data and find an alternative data source.", "score": 1, "replies": []}]}, {"body": "it is strange to see. I thrashed to 3 different places before settling on tradestation.\n\nI did find if your day trade is super fast, it can be delayed o final number. I had 75 dollars hanging for four days before added to my live account. ..that is 6 ticks i think.\n\nIt was 3 about minutes total trade time...and clicked it manually, not a set gain/loss.\n\nit did come through though..", "score": 0, "replies": []}]}, {"body": "I find TDA on iPad to be the best for option trading.  Their web interface is mediocre and I still prefer TDA over TOS for fast trades.  I’ve tried Schwab, Robinhood, webull, JPM chase, …", "score": 19, "replies": [{"body": "I'll see if my TDA account is still valid, ty. But I'm not an iOS person, so my mileage may vary?", "score": 3, "replies": [{"body": "I have an Android phone and the ToS app is fine, but you should be using the desktop platform whenever possible.  No mobile app can compare to a desktop platform.", "score": 5, "replies": [{"body": "I use ToS on desktop, but when I am scalping I find the TDA app on iPad is fastest (from a user interface usability perspective) at executing trades while watching the price.\nMore complex trades or watching longer term price actions etc, 100% ToS is objectively superior.", "score": 1, "replies": []}]}, {"body": "i hate TDA", "score": -8, "replies": []}, {"body": "I'm not sure what their android tablet apps are like.  I just know the iPad one is extremely fast and easy to trade and see live pricing as I am placing the trade.  It's the only interface, other than ToS, that I have found to do that.  It makes scalping easier for sure.", "score": 1, "replies": [{"body": "Ohhh you just brought back awful memories of refresh refresh refresh refresh... Thanks, didn't even consider that downfall of basically every interface I've used thus far.", "score": 1, "replies": []}]}]}]}, {"body": "I'm using Fidelity.\n\nDid TDAmeritrade but they had fees for everything sheesh. TOS was good though.\n\nFidelity desktop is like super old school, I can see people getting use to it. I don't care for it just use the website. The option greeks are like kinda hidden and takes several clicks to get to on the website.\n\nThey're beta testing the website often and am updating the mobile app often enough.", "score": 7, "replies": [{"body": "I really like to see options chains when deciding strikes vs expirations, would you say that's cumbersome?", "score": 1, "replies": [{"body": "Fidelity desktop will show you strike in the middle column, an indicator for in and out of the money, calls and puts in columns to the left and right, bid and ask, delta, volume and OI all associated with their particular option at a given strike at any expiration you desire. It's really nice for combing a list and setting up a delta based trade with a quick glance.", "score": 2, "replies": [{"body": "Reminds me of what I liked about E-Trade. JPM is pure dogshit in that regard.", "score": 1, "replies": []}, {"body": "Fidelity is horrible for options. Yea you can see the chain but the order ticket is ridiculous. Unless we’re talking about their desktop trader app…forget the name now, but even that’s pretty bad when compared to TD or IB.", "score": 0, "replies": [{"body": "Depends on what you're doing. In my experience, it's fine. The Schwab active trader pro has more info and is live, but most of the time, my minimum expiry is a week, max is 30-45 days and the wildest thing I do is an iron condor on occasion, so fidelity lends itself well. At the most it's 4 legs, a few contracts per, with some quick and dirty math to get 5-10 delta on either wing and I'm good. Fidelity's website is fine for that, especially because it forces open a new window every time you click on something.", "score": 1, "replies": []}]}]}, {"body": "Yes it's cumbersome, if you want to see the greeks too it isn't on the same tab.\n\nThe option chain on the website is basic, you filter by dates, call or put, and the date timeline show earning/dividend markers.\n\nIf you want greeks you have to go to another tab and that is hella cumbersome. You click that tab and then you have to add what option you want in a popup and that popup will update the tab.\nToo many clicks to get the greeks info and the information are spread out in separate tabs.\n\nI have a separate spreadsheet I got from here or thetagang to keep track of my trades for money management and risk management/adjustment.", "score": 1, "replies": []}]}, {"body": "TD and TOS are the same company, what “hidden fees”? They disclose all of their fees on the fees page", "score": 1, "replies": []}]}, {"body": "If you are trading options, you should be trading off an OptionChain period. \n\nOptions do not open until 9:30am Eastern, and may take a few mins to go live, (Spy is usually always active). \n\nTos or Tastytrade, Tos has charts, both should have good data.", "score": 7, "replies": []}, {"body": "Yes.  It sucks ass.  Don't use it.  It's a buy and hold type of interface.\n\nI work for them too.  And it blows major ass.  Takes like 12 clicks to exit a position.", "score": 6, "replies": []}, {"body": "I personally like Fidelity. It’s not fancy but perfectly serviceable. The desktop app is also solid.", "score": 9, "replies": [{"body": "I have had TDA, E-Trade, and JPM. The ease and speed of transferring funds from a JPM checking account to investment account is what drew me towards using that primarily but I'm really hating their platform.\n\nThe one big player I never used is Fidelity, so definitely need to look into it.\n\nFrom comments here, it's seeming like I need to take another look at my old TDA account and potentially open a Fidelity account.", "score": 1, "replies": [{"body": "why didn't you like etrade? i find etrade being the best so far. power etrade is made specifically for options trading.", "score": 1, "replies": [{"body": "I liked JPM's transfer from checking to investing being seconds compared to overnight to E-Trade, shouldn't be a deciding factor, for sure, but it's something I liked.\n\nI don't like E-Trade's interface as a whole. I got to learn it and understand it pretty well, but just underwhelmed by the U.I.\n\nHonestly can't think of a single real performance issue to complain about.", "score": 2, "replies": [{"body": "i can buy back a contract today, and move the money to my checking account within 10 minutes. no need to wait overnight from my experience. etrade interface may not be for you, but its 100 times better than what you showed of JPM for options trading. old pic: https://imgur.com/s6ckwCm.png", "score": 0, "replies": [{"body": "Congrats you have a margin account.", "score": 1, "replies": []}]}]}]}, {"body": "Same. Reliable overnight transfer. Time in the market is the best prediction of performance", "score": 1, "replies": []}]}]}, {"body": "This is asked multiple times a week - [https://www.reddit.com/r/options/search/?q=best%20broker](https://www.reddit.com/r/options/search/?q=best%20broker)", "score": 3, "replies": [{"body": "Use your link, it's not asked very often at all (best broker, sort/filter by time), and things do change, meaning this question a year ago will likely have different answers than asked today.\n\nAlso, I'm already getting good feedback about my problem with JPM being prevalent in other platforms.", "score": -2, "replies": []}]}, {"body": "I've tried em all over the years. Fidelity sucks,RH really! sucks. Webull is ok. Think or Swim is the best hands down,no question about it.", "score": 3, "replies": [{"body": "After all the responses here, TDA/ToS seems to be the clear winner. Ty", "score": 2, "replies": [{"body": "You can use the app on your phone or on your PC but I recommend DL the desktop version for your PC.\nTheres a bunch of tutorials from TD and individuals on YT. \nIt's really the best imo.", "score": 2, "replies": []}]}]}, {"body": "ThinkOrSwim", "score": 3, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Ban.", "score": 4, "replies": [{"body": "Honestly since you haven't even cared to read a brokage review page Robinhood might be the best option for you.  It really makes things easy to understand for a novice.", "score": 3, "replies": [{"body": "#BAN.", "score": -2, "replies": []}]}]}]}, {"body": "I am in Canada and I have been happy with IBKR. I am not affiliated or anything...  They will let you do anything providing you have enough liquidity to back it up.", "score": 2, "replies": [{"body": "Me too. They have been the most transaparent of all brokerages I have used in terms of their fees and cash interest.\n\nHave you tried buying their T-bills though? I find the fees on those wiping out any interest given.", "score": 1, "replies": [{"body": "I haven't I mostly trade options on Non-TFSA...", "score": 1, "replies": []}]}]}, {"body": "JPM used to be okay during the height of the bull market, but they decided to really hate on the GME doge coin crowd by dumbing down their app tremendously. Instead of adding features they are taking away features, instead of trading faster it trades slower, it's laggy and full of errors that cost you big in a high stakes instantaneous market. The big boys deal with none of these inconveniences or barriers and that's why they stay rich and that's JPM.", "score": 2, "replies": []}, {"body": "TDA is great", "score": 2, "replies": []}, {"body": "use webull or tos", "score": 2, "replies": []}, {"body": "100% How the fuck does the bigger bank in America have such a piece of shit banking interface.", "score": 2, "replies": [{"body": "Oh boy do I have some stories for you. But allegedly they are hunkering down on tech upgrades over the next couple years.", "score": 1, "replies": []}]}, {"body": "EDIT: Oops, Morgan Stanley bought Etrade, not JPM.\n\nJPM bought Etrade. Why not just use Power Etrade? Way prettier than that. It might be very easy to move a JPM brokerage account to Etrade. Or maybe you can just use Power directly on your existing JPM account?\n\nhttps://us.etrade.com/platforms/power-etrade", "score": 2, "replies": [{"body": "I'll check it out, I had an old E-Trade account I stopped using a while back. Didn't Morgan Stanley buy E-Trade? Not J.P. Morgan?\n\nMorgan Stanley ≠ JP Morgan, zero affiliation as far as I'm aware.", "score": 3, "replies": [{"body": "Oops, my bad. All this time I thought it was JPM, but you are right, it is Morgan Stanley.", "score": 1, "replies": []}]}, {"body": "JPMorgan didn't buy it, Morgan Stanley bought E*Trade", "score": 3, "replies": [{"body": "You are right. All this time I thought it was JPM.", "score": 1, "replies": [{"body": "Too many Morgans", "score": 1, "replies": []}]}]}]}, {"body": "FYI I closed position this morning when share price was $299", "score": 1, "replies": []}, {"body": "I have Schwab and I couldn't get into my account today & missed some awesome trades. Also they weren't answering their phones. I have never had this happen to me but on a day that's very volatile I need to get into my account. I was thinking of moving to JP Morgan since they are offering $700 for a new account.", "score": 1, "replies": [{"body": "Honestly, E*Trade was the most reliable but their platform sucks. Navigating to the trade I want was always dicey. I'd get what I needed but always had to double and triple check the page before moving on to the next.", "score": 1, "replies": []}]}, {"body": "How much are you currently spending and are willing to spend to get quality data?", "score": 1, "replies": [{"body": "Current spend: fees associated with trading\n\nWilling to spend: fees associated with trading", "score": 2, "replies": []}]}, {"body": "whaat, you bet against nvidia after it tanked to $100? i wish i didnt sell my shares at $200 because of that little profit. I would be careful betting against the largest most successful companies in the world", "score": 1, "replies": [{"body": "What? I just opened this position late last week, it has tripled in price with dog shit earnings (lower margins being the biggest issue, surplus of inventory an indicator they ain't supply chain constrained but instead dealing with tapering demand, web services taking a hit as their biggest customers are scaling down, Google is making their own chips to handle Bard).", "score": 2, "replies": [{"body": "they announce earnings in 2 days and the stock price hasnt tripled in price, but it has increased ~$80 per share since their last earnings.  are you talking about the option value? tripled in price since when? just a little confused. analysts seem to be expecting a beat too", "score": 1, "replies": [{"body": "Oct 2022 -> May 2023, nearly tripled in 6mo on \"forward-looking\" speculation and AI ^((AI AI AI AI AI)^) hype. Valuation nearing $1 trillion with what exactly for revenue? And slimming profits?\n\nThis thing is one little AI regulation announcement from tanking, they're beating lowered and lowered expectations.", "score": 2, "replies": [{"body": "AI makes everything automatically better, more productive, more profitable.  Whatever your business is, if your revenue is $1 you can spend 30 cents on \"AI stuff\" and increase that $1 to $2, which is what every company will be doing.  There will be more GPUs on fire in data centers than people walking on Earth, upgraded annually and just humming away making all lives and profits better.\n\nNVidia to $60T in 2 years, unquestionably.\n\n/s", "score": 2, "replies": [{"body": ">NVidia to $60T in 2 years, unquestionably.\n\nWhat is this, a valuation for ants???", "score": 3, "replies": []}]}]}, {"body": "Sold my puts, closed out position for +23%", "score": 1, "replies": [{"body": "Premium seller, yep tastytrade is the right place for you.\n\nhttps://start.tastytrade.com/#/login?referralCode=JSN6DD8M7H", "score": 1, "replies": []}]}]}]}]}, {"body": "IBKR", "score": 1, "replies": []}, {"body": "I enjoy my E*TRADE for options.", "score": 1, "replies": []}, {"body": "That screenshot doesn't show a bid and ask. Is this something as simple as for JPM the current value is always showing the bid? If so, it isn't unusual for an option bid to be at zero in the early part of the day.  That way the market makers aren't hinting at the fair value. If somebody is naive and assumes fair value is half way between zero and the ask, chances are they will overpay. Any given strike can take awhile to come alive. The flaw in the broker is in not showing a bid and ask, but you'll likely find every bank-based trading platform is the same. Schwab doesn't show a bid and ask unless you begin to place an order or have an already-open one to look at. IBKR shows bid and ask right away, but it could be stale junk if you aren't paying for market data.", "score": 1, "replies": []}, {"body": "By default options market data is delayed. Chase would have to pay extra for real-time and often it isn’t insignificant cost though other platforms do provide it. You would also have to likely agree to terms and conditions.", "score": 1, "replies": [{"body": "Man it lasted for over an hour.", "score": 1, "replies": []}]}, {"body": "They really don’t give a rip.  They don’t have to", "score": 1, "replies": []}, {"body": "ThinkOrSwim", "score": 1, "replies": []}, {"body": "TD or Interactive Brokers.", "score": 1, "replies": []}, {"body": "Same goes for bofa and wells", "score": 1, "replies": []}, {"body": "They should buy Robinhood for $100 a share.", "score": 1, "replies": []}, {"body": "Its not the interface - its your trading that blows", "score": 1, "replies": [{"body": "Either you will be correct by this Friday or you'll be an insufferable a-hole full of jealousy. We shall see. But regardless, you're still a worthless human being.", "score": 1, "replies": []}]}, {"body": "Take it to zero nothing like a good dip and rip", "score": 1, "replies": [{"body": "I sold for +23% before earnings\n\nEdit: bought $300 strike when trading at $312, then sold somewhere between $301-299 on the decline. It bottomed at like $298 and then crept up to $301-303 leading up to market close, then we all know what happened AH 🌝", "score": 1, "replies": [{"body": "Well done 💥", "score": 1, "replies": [{"body": "Not so well done on the puts that went -75% prior, when you open puts and they steadily decline in value from day 1 and you hope for just one sudden drop to exit but it just keeps fkn climbing...", "score": 1, "replies": []}]}]}]}, {"body": "I use E*trade but I know very little and am probably making a bad choice", "score": 1, "replies": []}, {"body": "If you care about mostly options trading and you understand options. \nTastytrade is my recommendation. And here’s a referral link.   Their platform is built specifically for options traders. \nhttps://start.tastytrade.com/#/login?referralCode=JSN6DD8M7H", "score": 1, "replies": []}, {"body": "Public is decent", "score": 1, "replies": []}, {"body": "Lol I use Hood and I love it", "score": 1, "replies": []}, {"body": "Webull would’ve filled it LOL", "score": 1, "replies": []}, {"body": "Never buy at the market. Place limit orders only so that that way, the only person fucking you, is you! lol", "score": 1, "replies": []}, {"body": "JPM sucks so bad. Try MooMoo! 3am - 7pm cst trading. They allow comments on stocks which I will admit more than once I got a better TP on swing trades from. And I find the web app to be super user friendly. It also allows for trading on the Hong Kong and Chinese market if you have any interest in doing so!", "score": 1, "replies": []}]}
