{"title": "[deleted by user]", "selftext": "[removed]", "id": "13fhxkm", "created_utc": 1683889520.0, "score": 46, "upvote_ratio": 0.72, "num_comments": 93, "comments": [{"body": "Because they don't make any money currently", "score": 121, "replies": [{"body": "[deleted]", "score": 42, "replies": [{"body": "They do really need to tighten up that market share.", "score": 18, "replies": []}, {"body": "The CEO is also fudging numbers so it’s a double no-no", "score": 1, "replies": []}]}]}, {"body": "The foundry business is becoming more expensive, which is not a good thing for profits.\n\nHere's what I mean:\n\nTSMC\n\n||CFO|Capex|FCF|\n|:-|:-|:-|:-|\n|2018|574|322|252|\n|2019|615|470|145|\n|2020|822|517|305|\n|2021|1110|848|262|\n|2022|1610|1090|520|\n\nINTC\n\n||CFO|Capex|FCF|\n|:-|:-|:-|:-|\n|2018|29|15|14|\n|2019|33|16|17|\n|2020|35|14|21|\n|2021|30|20|10|\n|2022|15|25|\\-10|\n\nWith capex requirements growing by double digits every year, it becomes incredibly hard to be profitable.\n\nRedditors often point to their high capex aka building new fabs as a reason to be bullish, but it's the opposite.\n\nCompanies like Visa spends less than 10% of their cash flow on capex, and they've achieved double digit revenue growth - which converts nicely to profit growth.\n\nCompanies like Micron, Samsung and Intel need to spend a huge % on capex which is a weaker business to be in. They can't afford to NOT do it, as they need to keep up with competitors and replace ageing capital; but the increasing capex requirements means increasing revenue required to be profitable. \n\nThe good side is that there won't be any new competitors - no one wants to enter a business where they need to spend tens of billions and multiple years to build a facility that quickly becomes outdated. \n\nThe bad side is Intel's competitors have vast resources and are critical to their nation's economies. Samsung is indispensable to Korea and TSMC is indispensable to Taiwan. \n\nEssentially, Intel's higher capex (which is bad for profits) is matched/exceeded by their competitors - it's a race where they all lose.\n\nIf Intel manages to achieve 80bn sales (their peak), at 50% gross margin (long term target), so 40bn gross profit, subtract 5bn+ in operating expenses, 25bn in capex, 1-2bn in interest expense (going up)... they're left with less than 5bn profits.\n\nThey need TSM and Samsung need to fumble in order to become a great investment.\n\nScenario is different if they get the tech lead, then their gross margins and revenues will go up hugely. For example, if we change the numbers above to 90bn sales and 60% gross margins, then profits go above 20bn.", "score": 68, "replies": [{"body": "I think this is under appreciated.  The semiconductor industry is incredibly brutal.  It’s filled with tons of money and tons of specialized technology to the point that it’s essentially magic.  Because it’s so specialized and so necessary to todays society, it’s a huge rat race.  These companies are sprinting to develop these technologies on nearly every aspect of the industry.  Technology that is 10 years old is already aged and non-competitive.", "score": 20, "replies": []}, {"body": "I think we will see some very aggressive poaching/sanctions of talent to get more quality chipmakers in the US since they're such a strategic asset with AI, but will they be working for intel? I dont know. US chipmakers will definitely have growth though", "score": 7, "replies": [{"body": "IMO it'll be like the aerospace industry, INTC will get propped up by the government regardless of profitability because \"we need an American chip maker\".", "score": 6, "replies": []}]}, {"body": "u/jayarlington", "score": 2, "replies": [{"body": "Yep.\n\nThe real issue here is that Intel messed up on 10nm so bad that it cost them leadership.  \n\nIntel has to spend on CapEx to match Samsung/TSMC while spending enough on R&D to compete with AMD/NVDA/Hyperscalers/QCOM (Nuvia).\n\n**You can be a leading edge chip designer or you can be a leading edge foundry but you can't be both.**", "score": 3, "replies": []}]}, {"body": "Chart should be adjusted to be in USD only", "score": 1, "replies": []}]}, {"body": "Because they didn't say AI enough", "score": 53, "replies": [{"body": "NVDA has entered the chat", "score": 3, "replies": []}, {"body": "This", "score": 6, "replies": []}]}, {"body": "INTC is the #1 value trap stock pick on /r/stocks.\n\nAll it needs is for the chips act to pump billions into INTC and for China to invade Taiwan and the turnaround is a done deal, literally can’t go tits up.", "score": 58, "replies": [{"body": "That's the problem of semiconductors: throwing money at the problem doesn't save you. Intel has been throwing endless amounts of billions into their 10nm node and it never became good despite a decade of investments.", "score": 27, "replies": [{"body": "I am absolutely sick and tired of Intel Chips always running hot.", "score": 9, "replies": []}, {"body": "This is an underappreciated comment.\n\nIntel fucked up years ago (10nm).  They are STILL paying that price today.", "score": 2, "replies": []}]}, {"body": "TSMC is also trying to diversify its fabrication plants geographically\n\nif China invades Taiwan then chances are we're going into WW3 with nukes on both sides, so I don't see the point of betting on that to make money", "score": 8, "replies": [{"body": "Naw, US will do some naval war stuff. We might lose some ships, most of the killing and dying will be Asians fighting Asians (China vs US puppets). It'll hurt global trade big time though.", "score": 1, "replies": [{"body": "\"Do some naval war stuff\" is exactly what the Generals in the War Room will pitch as the Operations Plan.", "score": 2, "replies": []}]}]}]}, {"body": "They're throwing a Hail Mary by building a bunch of fabs for their new Intel Foundry Services. They will be licensing out their fabrication technology to build chips for other companies, something Intel has never done before. This will likely eventually become their main source of revenue as demand for their own x86 chips falls.\n\nIt is uncertain what kind of customers they will be able to attract (other than the Department of Defence, the main reason for the CHIPs act). Their fabs are not as advanced as TSMC, and not as economical as Global Foundries. It may be difficult for them to compete.", "score": 9, "replies": [{"body": "They say they’re building new fabs with most sophisticated technology", "score": 2, "replies": [{"body": "And if I said I was grilling fresh burgers with the all the trendiest grill accessories, does that automatically make my burger good?", "score": 10, "replies": [{"body": "$18 burgers bro, no side or drink included. Served on a wood plank.", "score": 5, "replies": []}, {"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "Trouble with intel doing a foundry service is many companies that see intel as a competitor would not want to use them. \nThe would still have many customers, but likely a smaller base than a pure play foundry.", "score": 1, "replies": []}]}, {"body": "Let's forget about financial and focus on tech.\n\nIntel's major source of revenue is x86 CPUs.\n\nThat architecture is slowly dying a very slow IBM/Oracle-like but certain death. ARM and RISC-V architectures are immensely more power efficient which is what matters where revenue is: mobile, data centers and super computers. Nowadays 1 in 4 servers sold in Europe is ARM powered, this would've been a crazy thought just 10 years ago.\n\nWhy is x86 dying a slow death? Essentially speaking every CPU has a set of instructions they can carry (type of calculations they can make). x86 is an architecture that has *a lot* of those. All of those instructions require specific hardware. This means that x86 CPUs are able to accelerate specific types of computations, but at the price of being much less power efficient and bulkier.\n\nARM CPUs have only a small set of instructions this makes them much smaller/compact and power efficient. You may say \"yeah but what about those other calculations x86 excels at\". Well, you can still do them in suboptimal ways on ARM, and you still have more cores to carry them. On top of that an ARM soc can combine specific computation units for those calculations (e.g. Apple socs have dedicated units to accelerate those specific algorithms). Essentially x86 lacks the flexibility and while being faster overall and supporting more calculations this is at the end of the day an advantage only in specific case, the same cases where ARM socs can add a dedicated unit.\n\nThen we have manufacturing. Intel has lost its manufacturing edge around 2015.\n\nEven Samsung is nowadays a better manufacturer.\n\nChinese's SMIC was also on road to beat Intel on their manufacturing game, till in 2018 US banned ASML exports to China. ASML is a dutch company that produces the lasers pretty much all foundries use and China cannot get them.\n\nNow, here's another problem. AMD has nowadays nailed with Ryzen a chiplet architecture that has proven to scale very well and which has been only improved year after year on all aspects. AMD is eating Intel's market share on x86 front quarter after quarter, especially the most profitable ones (data centers and supercomputers, with AMD powering both the most powerful supercomputer and the third one).\n\nOn top of that Intel has made several other mistakes: they got cornered into being an x86 company by stopping investing or selling their other ventures such as networking and memory, all fronts on which they were quite competitive. And all of its attempts to get a good mobile CPU have failed.\n\nIntel imho is more promising than CPU enthusiasts realize on the GPU front, but those GPUs are still produced by TSMC, because Intel does not have the manufacturing capability to make them.\n\nEssentially when you're looking at Intel in 2023 there's very little that promises well. AMD will create better x86 processors leveraging whoever has the best manufacturing and without requiring the insane risks and investments Intel needs.\n\nPeople say \"yeah but governments could give Intel lots of money\" bla bla. Sure, that would help financial and the bottom line, but this doesn't change that much the long term scenario for Intel. Semiconductors are a very competitive market, one in which throwing money at the problem is not enough as Intel has found with the 10nm node.\n\nI think Intel *could* be an attractive bet and a potential milk cow for decades, don't get me wrong. But it is still not priced as one and that's not the current road Intel's management is pursuing (albeit they opened to manufacture third party chips, which is one step towards it).", "score": 23, "replies": [{"body": "This is exactly why I wouldn't buy Intel stock.  Even forgetting all the bad management mistakes, their core technology is uncompetitive - most especially against ARM and similar architectures, but even against AMD's x86 offering, and I don't see either of those facts changing in a meaningful way.", "score": 6, "replies": []}, {"body": "Does increasing demand for chips (even lower quality chips) mitigate the competition issues for Intel? Or would the more advanced chipmakers just be able to fill the demand by increasing production?", "score": 3, "replies": [{"body": "Yes, you don't need bleeding edge chips everywhere. Global Foundries (former AMD foundries) are still stuck on 14nm process and their revenues have increased in the years.\n\nIntel is on a much more competitive 7nm node. So they can create many tens of billions of revenue on their current nodes potentially.\n\nRobotics, cars, your microwave or your alexa or whatever, there's a ton of stuff that needs chips which don't need to be bleeding edge.\n\nBut that's still a very nasty business with more competitors and lower margins. It can add a lot to the bottom line, but Intel is not priced as such a company, it's priced more (imho).\n\nFor Intel to be Intel they need to be competitive on their own products, not to become a fab for third parties. That only adds to the revenue, but it's a business with comparatively low growth and less revenue.", "score": 9, "replies": [{"body": "Okay so their foundry business will be stable but real growth (which is partly priced in) will have to come from developing more competitive technology", "score": 5, "replies": [{"body": "That's my 2 cents on that.", "score": 3, "replies": []}]}]}]}, {"body": "All true, but x86 has had the inferior ISA for almost 45 years, and Intel is still chugging along. I bought my first 68k computer forty years ago. It had a 32-bit address unsegmented address space which took Intel years to catch up with, and my first SPARC in 1988. Intel made crap compared to those two, but those are dead and Intel still going. I wouldn't bet against them. It's easy to recognize that one product is better than another, but harder to pick which one the market will buy.", "score": 5, "replies": []}, {"body": "Now China doesn’t need ASML. China has already developed its own lithographic machine.  I guess they stole the secrets from ASML", "score": -3, "replies": [{"body": "Just because you developed something doesn't mean it's as good. ASML has plenty of competitors and yet, if you want the bleeding edge you go for ASML.\n\nYou can't just throw money at stuff and be like \"oh now we have lithographic machine too, we don't need a 240B capped company to make them for us\".\n\nEven admitting that some Chinese company could compete on that, it's still no recipe for success as Intel/Samsung/GF or anybody else who has both access and money to all it wants still shows you can be many many years behind the competition.", "score": 4, "replies": []}]}]}, {"body": "Hemorrhaging money, non innovative, and their CEO made over 150m last year.", "score": 8, "replies": []}, {"body": "AMD beat them in server chips and they go toe to toe in desktop chips especially considering performance per Watt of powerconsumption", "score": 9, "replies": [{"body": "Yup", "score": 5, "replies": []}]}, {"body": "I'd say 75% is because of the shitty management and 25% because of the shitty CEO", "score": 23, "replies": [{"body": "So 100% shitty management?", "score": 26, "replies": []}]}, {"body": "Boomer stock, same thing happened with IBM and GE, they were filled with old boomers who were too incompetent to adapt", "score": 19, "replies": []}, {"body": "Intel is making a move on TSM, hoping to wrest a larger portion of advanced manufacturing from them. This takes time and capital but can result in them being well off for in-house and third-party production if they can pull it off. \n\nThey will bleed in the meantime. If geopolitical events escalate, and/or domestic funding from the government pumps in extra funding, the bleed will be stemmed to a degree.\n\nI'm a fan at these prices.", "score": 18, "replies": [{"body": ">. If geopolitical events escalate,\n\nIf I were to invest in Intel at current price this would be the main reason. A conflict shuts down the Taiwan portion of TSMC which is the majority of the chip production, even if AZ factories start up, unless things continue to evolve in the future.\n\nOtherwise, if they are valued as a contract manufacturer like GlobalFoundries for less advanced nodes, I would be willing to invest if Intel is half its price. These are all back of the napkin kind of estimation.\n\nI haven't really looked into the numbers, simply because qualitatively it's losing on both fronts of its business right now - the manufacturing side and the processor side.", "score": 4, "replies": []}]}, {"body": "I wouldn’t bet on Intels ability to become a foundry.  I quit a few years back but I worked there for 22 years.  Their glory days are past.", "score": 3, "replies": []}, {"body": "intel are assholes. i used to tell the sales people that being assholes only works when you have no competition. now AMD is eating their lunch and all the customers they pissed off are coming back to say no thanks intel, our AMD EPYCs run rings around your shitty xeons anyway.\n\nmy last DC build i bought all EPYC and told the intel salesdroid to basically fuck off.", "score": 3, "replies": []}, {"body": "My opinion. Intel has poor leadership. They still wct like they are the kings tgat they are not", "score": 2, "replies": []}, {"body": "Intel processors use to be the gold standard for pcs and macs.\n\nApple have there own chips now that have surpassed Intel.\n\nAMD chips have caught up to Intel, giving PC manufacturers and consumers another viable option for fast processing.\n\nIntel doesn't have a moat anymore.", "score": 2, "replies": []}, {"body": "I'm not a finance expert, but I do know a thing or two about tech.  Fundamentally, Intel monetized [Moore's Law](https://en.wikipedia.org/wiki/Moore%27s_law) for everything it's worth.  But all growth eventually slows.  Always.  It has to, for the same reason pyramid schemes must fall apart: eventually the limit is hit and exponential growth must stop.\n\nComputers have *looked like* an exception, because the exponential growth continued *way* longer than any such boom ever has before .  But it's finally running out of gas.  We're close to the fundamental limits that mean we can't keep shrinking transistors for much longer.  More to the point, it's become much more expensive to get each new smaller transistor process to market (to keep pace with Moore's Law).  Intel has for years struggled to keep delivering Smaller Faster Better Stronger. So R&D costs balloon, spending more for diminishing returns.\n\nEventually CPUs will be like washing machines.  Nobody says \"Your washing machine is so 5 years old, just buy a new one.\"  Intel for decades has been based around the idea that their products get replaced every couple of years because they really are obsolete by then.  That is still true, but getting less so month after month.\n\nIn other words, the party is winding down.  Semiconductors will still be big business, of course, but a dramatic sea change is upon us.  I predict Intel will continue to struggle, but be able to stay the course for awhile; but then they'll have to pivot because the struggles they are having are driven by the underlying reality that the end of the trend they've been riding is approaching.", "score": 2, "replies": [{"body": "Good analysis", "score": 1, "replies": []}]}, {"body": "Because AMD competes directly with Intel. AMD produces a server processor that is nearly twice as powerful as Intel's best processor at half the power consumption with the same price tag. Intel is pretty much over, the server segment is where all the money is and there is no way for Intel to compete. I can guarantee you no one is currently buying Intel server processors for their businesses, and if they do they don't know AMDs product line and they just made a huge mistake.", "score": 3, "replies": []}, {"body": "smartphones don't use intel, apple computers don't use intel, videogame systems are moving away from intel. Even desktop PCs are pretty off intel.  \n\n&#x200B;\n\nThey are a big company and doing fine, but pretty much everything technology is going with \"not intel\" as their pick.", "score": 1, "replies": [{"body": ">videogame systems are moving away from intel. Even desktop PCs are pretty off intel.\n\nThis is false. Steam survey is clearly showing that Intel is still strong there.", "score": 3, "replies": [{"body": "Eh, it's near exact 33% AMD to 66% intel. That is definitely intel winning, but it used to be like 95/5 not that long ago.", "score": 7, "replies": [{"body": "Yeah, no doubt AMD took some share of market when they clearly had superior product, especially in terms of performance/dollar. But in the last few lineups that's not exactly the case, Intel had some competitive top and mid tier CPUs, and an extremely good value picks too. Their PC products are worth it for consumers right now.", "score": 6, "replies": [{"body": "I guess the point is intel doesn't have a solid lock on any sector, they are far from out of business and are still super successful but aren't beyond competition anymore like the old days.", "score": 1, "replies": []}]}]}]}, {"body": "Enterprise segment is still pretty much Intel though (laptops and servers)\nMTL is going to compete very well with M2 and AMD as well. It's going to be interesting.", "score": 1, "replies": []}]}, {"body": "Intc could cut their net income in half, and it'd still be double amds net income, despite them having a very similar market cap. Intc also pays a dividend. Be careful around amd, a company trading for 150bil that made 2 bil in net profit last year seems eh to me. I do own both amd and intc.", "score": 1, "replies": [{"body": "Wait cmon man, intel is bleeeeeding money. Begging for companies to buy their products with no profit margin because of amd and I should be worried about AMD????", "score": 17, "replies": [{"body": "So youd rather own a company than made 2bil net profit and sells for 156billion, than a company that made 8bil net profit and sells for 120bil? I mean if you're expecting their numbers to quadruple sure, but otherwise seems eh. I don't mean worried as in anythings going to happen or you'll lose alot, it just might not grow as expected due to it being priced substantially high considering the amount of profit they generate.", "score": -2, "replies": [{"body": "Intel did not make money this quarter so I dont know what numbers youre referring to here.", "score": 11, "replies": [{"body": "2022 net profit for both companies if you got to 2021 it's even more in intc favor, I'm not saying these are the only numbers that matter just that I'm hesitant to believe amd is being valued correctly as they also have less assets than intc.", "score": -1, "replies": [{"body": "AMD will continue to eat all of intels lunch until the numbers you just said flip flop. Just wait until these new data center chips come out and intel can't play the desperate 0 profit margin game anymore.", "score": 6, "replies": [{"body": "My money is where my mouth is, a 3 way split for semi sector in txn, amd, intc.", "score": 1, "replies": [{"body": "Stop letting intel ruin your big days like today brodie.", "score": 1, "replies": [{"body": "It's not ruining my day, you inherently seem very concerned with the short term, day to day, even month to month movement, means very little for a public company.", "score": 1, "replies": [{"body": "You're right bro I'm not looking far enough down the line. I didn't mean to seem rude but I was, my bad...", "score": 2, "replies": [{"body": "Just some good banter, have ya have a good day friend", "score": 1, "replies": []}]}]}, {"body": "What you thinking after recent moves and news? Supposedly sapphire rapids beating out Geneva, but ofc well have to wait till they actually out to know for sure.", "score": 1, "replies": [{"body": "I'll be honest I just don't believe their cherry picked results. They pull this type of comparison every time. Its still way too early for them to catch up. Did you watch the AMD AI presentation?", "score": 2, "replies": [{"body": "I did! I'm actually very excited about amds ability to compete with nvda on gpus and ai acceleraters. I'm actually really in Intel for the fledging foundry side tbh, as otherwise I'd just be in amd if intc had no foundry expansion plans.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "40% growth = doubling every 2 years…", "score": 0, "replies": [{"body": "Aye baby I own it too, but we both know the next decade ain't gonna be 40% every year and I'm in it for the long run. More than a decade.", "score": 1, "replies": []}]}]}]}, {"body": "the fact that they cut their dividend speaks volumes though", "score": 5, "replies": [{"body": "It really just says that individual stocks are extremely volatile and when your share price falls so much you're paying a 6% dividend you have to cut it. But ofc it's bad, it's never good when you plummet, but for an individual that wasn't holding intc till 28$ish, you're kinda pumped about it", "score": 0, "replies": []}]}, {"body": "AMD produces a server processor that is nearly twice as powerful as Intel's best processor at half the power consumption with the same price tag. Intel is pretty much over, the server segment is where all the money is and there is no way for Intel to compete. I can guarantee you no one is currently buying Intel server processors for their businesses, and if they do, they don't know AMDs product line, and they  made a huge mistake.", "score": 9, "replies": [{"body": "Man this is a wild take, you're right sort of. The part you can't comprehend is that a decade ago no one bought amd server processors, but now you're acting like because they beat intc on a handful of generations, that Intel will never again beat amd lmfao.", "score": -1, "replies": [{"body": "It sounds funny right, until you realize the person that made Intel who they are today (Jim Keller) - (lead architect of the AMD K8 microarchitecture, which also included designing the x86-64 instruction set and HyperTransport, Prior chief architect of Broadcom,Prior  Vice President of Engineering at P.A. Semi, where he went to design the Apple A4 and A5 system-on-a-chip mobile processors. Prior Vice President of Autopilot Hardware Engineering for Tesla Inc.) left Intel for not agreeing with how the company was running. He went to be lead  developer of AMD to design a new architecture called Zen which would later lead to Intel's downfall. Pretty cool right.", "score": 3, "replies": [{"body": "Bruh suck him off why don't ya. I'd credit Lisa su for who amd is today.", "score": -2, "replies": [{"body": "Yeah momma su is great 👍 suck my dick", "score": 2, "replies": [{"body": "Aye I won't argue that amd is fucking intc, only that thelly come back one day. Have a good one mate", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You don’t seem to have a good understanding of the x86 chip market as you never once mentioned AMD or DCs. They are the main reason for the bleeding", "score": 1, "replies": []}, {"body": "lmao busy now, but popped in for a laugh.  INTC was an /r/stocks darling for awhile from idiots who've never been in the industry.", "score": 0, "replies": []}, {"body": "Their are plenty of pc purchases . Businesses buy them every few years.\n\nThe real issue ia that amd caught up in terms of spinning ed and performance and pc makers started switching.", "score": -1, "replies": []}, {"body": "Same people who made it successful in the 80s are still there. They aged and the company aged.\n\nThat what happens when companies worry only about retention of the older folks.", "score": 0, "replies": []}, {"body": "[removed]", "score": -2, "replies": [{"body": "Agreed, Intel needs to take steps to improve its financial situation in order to improve its stock price. Possible measures to improve the financial situation include cutting expenses, cutting employee compensation, reducing purchases of new equipment, and issuing shares and convertible bonds to raise funds. If Intel can take effective action to improve its financial situation and boost its revenue, the stock could see a turnaround.", "score": 1, "replies": []}]}, {"body": "What goes up, must come down. \n\nNo company will stay at the top forever, especially if they are lazy and lack of innovation.", "score": 1, "replies": []}, {"body": "Part of that 12 month revenue ending 03/2023, is approximately 12 to 15 billion dollars govt handout paid by taxpayers(Intel 1 of 5 US chip manufacturers who received a govt handout of more than 76 billions dollars).Supposedly that money was to reduce consumer prices within the following 6 months. Haven't seen any price depreciations and no one call this scummy company a welfare queen yet.", "score": 1, "replies": []}, {"body": "Because they aren't profitable, and losing market share.", "score": 1, "replies": []}, {"body": "Their market share and profit margin in servers continues to srhink due to AMD offering a better product AND mega-cap server companies continued shift towards custom silicon. Foundries are getting more and more expensive which means it will be harder and harder for Intel to catch up with Samsung let alone TSMC.\n\nIntel needs to execute flawlessly over the next 10 years and also needs one of Samsung or TSMC to falter (like Intel did last decade). Only by regaining a node advantage can they outcompete AMD in the server sector and win significant amount of 3rd party clients for the foundry business.", "score": 1, "replies": []}]}
{"title": "$PYPL (PayPal) - Q1 2018 VS Q1 2023", "selftext": "*Disclosure: I have a small position in PayPal which I opened last year at a BEP of $88, and I'm considering to invest significantly more at this current price of $64.*\n\nLooking back 5 years ago in 2018 when PayPal released their Q1 earnings report at the time, the business was valued slightly more (\\~$80B) than what it's valued at today (\\~$71B) after their 2023 Q1 earnings report.\n\nHowever, the numbers tell a story of a completely different business.\n\n**Revenue**: $3.69B VS $7.04B (\\~90%+)\n\n**TPV**: $132B VS $354B (\\~168%+)\n\n**FCF**: $737M VS $1B (\\~35%+)\n\n**OM**: Flat on Non-GAAP and GAAP\n\n**EPS**: $0.57 VS $1.17 (\\~105%+ Non-GAAP) | $0.42 VS $0.7 (\\~66%+ GAAP)\n\nThe business is guiding for lower top-line quarter on quarter at 7-8% now VS 16-18% 5 years ago.\n\nFundamentally though, how is it possible for this business to be so punished by the market? Am I missing something or should I be unloading big bucks on PayPal? Based on their EPS forecast of $4.95 this year (up 20% from the year before), it now trades at a forward price-to-earnings (P/E) ratio of **13**...\n\nIs it that PayPal was so disgustingly overvalued in 2018 that the valuation is now normalised? Or is the market pricing in an imminent top/bottom line decline (which is contradicting to PayPal's guidance)?\n\nI just don't see it. I see a market that is punishing a strong performing company for not being sexy or milking the term \"AI\".\n\n*Sources:*\n\n[*https://s201.q4cdn.com/231198771/files/doc\\_financials/2018/q1/PYPL\\_News\\_2018\\_4\\_25\\_General\\_Releases.pdf*](https://s201.q4cdn.com/231198771/files/doc_financials/2018/q1/PYPL_News_2018_4_25_General_Releases.pdf)\n\n[*https://s201.q4cdn.com/231198771/files/doc\\_financials/2023/q1/Q1-23-PayPal-Earnings-Release.pdf*](https://s201.q4cdn.com/231198771/files/doc_financials/2023/q1/Q1-23-PayPal-Earnings-Release.pdf)\n\n&#x200B;", "id": "13fmsz4", "created_utc": 1683901802.0, "score": 118, "upvote_ratio": 0.9, "num_comments": 94, "comments": [{"body": "I'm blown away by the beat down that it's getting. This is a $100 stock all day long. Holding. Buying more at $60", "score": 21, "replies": [{"body": "This. The amount of downgrades after that earnings is screaming the institutions want in cheap, and plan to go loooooooong....", "score": 10, "replies": []}, {"body": "Still buying?", "score": 2, "replies": [{"body": "Yup. Selling ATM CCs everytime it pops. I've made thousands on PayPal this year.", "score": 2, "replies": []}]}]}, {"body": "I'd say it is more likely that it was drastically overvalued then as opposed to undervalued now. \n\nIPOs tend to be expensive, and 2018 was in the boom times. \n\nAlso, what multiple would be suitable for PayPal? It's a payment processor with high single digit growth. There's a lot of payment processors out there trading in the low teens. AXP, CASS, are two that I can think of in the same range. \n\nMaybe that's their big problem: what is PayPal? I think it's hard to make the case that they are in the level of V or MA. Those are juggernaut companies. So maybe a low to mid teens multiple is suitable for pypl? If they really find a way to monetize Venmo, I could see the argument for more. \n\nThat all said, I think it's probably oversold right now and we're seeing peak PYPL hate, so if you think it's a good company, this is probably the time to buy. I could easily see the case it outperforms from here.", "score": 83, "replies": [{"body": "AXP is in the teens because it holds the debt of its card holders. They're not comparable.", "score": 30, "replies": [{"body": "It's a valid point. I just can't think of a better comp. AXP also has higher ROE, pays a dividend, and has a history of lowering it's share count. So there's both sides.", "score": 8, "replies": [{"body": "ROE is pretty dangerous. Think about it mathematically, all you need to do to “improve” ROE is to just take on more debt (reduce denominator). ROTCE is pretty much only a good metric for banks since deposits are effectively an input for their loans and they are being paid to arbitrage the difference, like how AXP does. PayPal has been pretty prudent with their stock buybacks. When their stock was high during the pandemic, they purchased other companies with a combination of cash and stock, now that stock has dropped so low, they’re dedicating 4 billion of their FCF to buybacks. Pretty prudent decisions by management all things considered.", "score": 9, "replies": [{"body": "Those are all fair points. I don't think any one specific number is all telling. I was more looking to find something similar to compare PYPL to. AXP is stronger in some areas, and has weaknesses that PYPL does not. Generally, they are payment processors and generally should see similar multiples. \n\nYou can make arguments that one is better than the other, and that's fun too, but they will probably be valued similarly. Saying PayPal deserves a 30x while AXP deserves a 12x would be silly, or vice versa.", "score": 4, "replies": [{"body": "I don’t even think they should be valued similarly tbh, they sit at completely different parts of the payment stack. PayPal is primarily a payment gateway/acquiring processor (via PayPal and Braintree) with some SAAS offerings for merchants and consumers (via Honey). AXP is an issuing bank and card network. So AXP should be valued as a hybrid between a bank and a network pure play like V or MA. While paypal should be viewed as some hybrid between SAAS and payment gateway.", "score": 6, "replies": [{"body": "That's a fair and interesting take on it! I can't say your wrong, they're all valid points. I hope it works out for you if you own PayPal!", "score": 2, "replies": [{"body": "Thanks! I actually just entered a position today. If you are short, congrats so far.", "score": 2, "replies": [{"body": "I am not. I don't short. Good luck to you, I hope I'm wrong!", "score": 1, "replies": []}]}]}, {"body": "Maybe SQ or WU as a comparison.", "score": 1, "replies": []}]}]}]}, {"body": "Lmao this is one of the best troll posts I’ve ever seen. It probably won’t get any recognition, but well done", "score": -1, "replies": [{"body": "Thanks?", "score": 2, "replies": []}]}]}]}]}, {"body": "I felt this way about Meta at 100.  Didnt pull the trigger.  Seems like a good buy IMO.", "score": 11, "replies": [{"body": "I felt the same with INTC at $40 after reading so many posts here on it being a value stock and don't go down further.  It then proceeded to drop to $25.  Not saying PYPL is INTC but it also isn't META.  So that by itself shouldn't be the reason you decide to buy PYPL.", "score": 3, "replies": [{"body": "To be fair, Intel is literally a cyclical stock in a cyclical industry. \n\nPayPal is primarily exposed to economic recession and lower spending. But so is Intel and Meta", "score": 3, "replies": []}, {"body": "To be fair, Intel is literally a cyclical stock in a cyclical industry. \n\nPayPal is primarily exposed to economic recession and lower spending. But so is Intel and Meta", "score": 2, "replies": []}, {"body": "To be fair, Intel is literally a cyclical stock in a cyclical industry. \n\nPayPal is primarily exposed to economic recession and lower spending. But so is Intel and Meta", "score": 2, "replies": []}]}]}, {"body": "I like the PayPal ecosystem. Their branded Mastercard (offered through Synchrony) has become much better now that they offer 3% cashback on all purchases made online via PayPal. However, there's a lot of competition out there for mobile payments. That said, I still like receiving payments through PayPal and have been using them for nearly 13 years. No complaints here as a customer. \n\nI think PayPal is fairly valued at this point, it's probably not going to move very much, its business is very mature.", "score": 21, "replies": [{"body": "AI cost savings potential could lead to more growth on bottom line.", "score": -2, "replies": []}]}, {"body": "They need to insert he code word “ AI” into their earnings call. Otherwise, it will be just paypal🤷", "score": 24, "replies": [{"body": "Rebranding to “pAiPal” stock +40%", "score": 29, "replies": []}, {"body": "give their conference call a try, Schullman managed to mention AI 5 times in span of 2 minutes from the beginning", "score": 2, "replies": []}]}, {"body": "I agree, the current low price just doesn't make any sense.", "score": 11, "replies": []}, {"body": "Watching this post", "score": 21, "replies": [{"body": "What have you found", "score": 27, "replies": [{"body": "Gamble", "score": 3, "replies": [{"body": "This is his fight with PYPL", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": 5, "replies": []}, {"body": "PYPL lost its first to market advantage and now must compete on pricing and features. Current economic conditions are creating headwinds on multiple fronts, internally and externally.", "score": 4, "replies": []}, {"body": "I own a small position in PYPL, I probably won’t sell it at this level but I probably won’t buy more either. The company is cheap for a reason, I don’t know how much they will grow into the future, but this company wouldn’t be a bad zombie company. The problem with financial companies is there is very little margin because there is hyper competition and low barrier to entry. \n\nWhen I bought PYPL over a year ago I viewed it as PayPal is the company that you use for online shopping when you don’t want to give your credit card out to every website. I did not see Apple Pay coming as a competitor in this aspect, today I see pay with credit card, pay with PayPal, pay with Apple Pay. Both will satisfy this security concern and I don’t see any advantage to paying with PayPal vs Apple Pay. \n\nThe reason I still hold it is that I don’t think they will decline revenues/profit, they just won’t grow like they used to and a 14 P/FCF isn’t a bad price to pay for them. Plus from what I have heard PayPal charges a high payment processing fee, it’s a good position to be in where the buyer chooses the method and the seller pays the fee, if the seller gets a lot of purchases through PayPal they may be hesitant to switch to a cheaper option. I expect this to go down eventually as competition picks up, but for now and the next couple years they can have the higher premium.", "score": 5, "replies": []}, {"body": "I guess we'll see what happens when PayPal sends out tax forms next year to private sellers.\n\nAs a consumer, PayPal offers great payment plans that many of the end users find attractive, but now that private sellers will see sells as taxable income, a chunk of the market that actually pays fees for PayPal service will disappear. Many have already moved away from the service, and others will most likely do so after the first tax form hits the mail.", "score": 10, "replies": [{"body": "Can you explain this more? Which Paypal service are you talking about - is it the POS business? And \"sells\" are referring to purchases made on the POS by their customers?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ah, this is the IRS $600 Reporting Rule. Does not seem unique to Paypal, I guess every platform will have to send this out. Where are the sellers moving to avoid this tax form?", "score": 1, "replies": []}]}]}, {"body": "I'm also interested in this, could you elaborate and provided some sources on the implications of this? Thank you.", "score": 3, "replies": [{"body": "I don't have any sources off the top of my head, but PayPal received a lot of backlash from the private selling community when they initially announced that personal sells using their goods and service feature would be taxed as income if a total of $600 is received within a year. Before, I believe the threshold was $20,000. The plan was announced a year or two ago, but after the backslash, the company decided to postpone the new policy. However, as of January 2023, the policy is now in effect, and I believe it's the 1099 forms that will be sent out to anyone who matches the description.\n\nI have been using PayPal for many years because I buy and collect swords. Part of the collecting process is occasionally selling items I no longer want to fund future purchases. Now that these items will be taxed, the process of hobby buying and selling has become more complicated and expensive. I'm not trying to run a business where I need to keep track of profits or losses, so finding other methods for selling transactions is necessary. Unfortunately, many people trust PayPal because of buyer protection, and it can be difficult to convince potential buyers to use other methods of online payment systems. I am slowly moving away from accepting PayPal as a payment system, and hopefully, the sword community jumps on board to keep the IRS out of our private sales.", "score": 4, "replies": [{"body": "The new rule wasn’t set by PayPal. It was a decision Biden made to lower that threshold. It applies to all online payments/sales, whether it’s PayPal, eBay, Etsy.. as long as the payment is classified as Goods& services.  \n\nTruth be told, yes there is more paperwork now but if you’re a small time seller it shouldn’t discourage you from selling online. If you aren’t making money on a sale you don’t owe taxes on it and as a 1099 you can deduct other expenses from your income. If you have an office you use for your eBay business you can deduct that portion of your mortgage payment to lower your tax liability. Similarly.. portions of your Internet, phone, etc.", "score": 21, "replies": [{"body": "Thank you for the clarification.\n\nI will look into this further to utilize the deductions.", "score": 5, "replies": [{"body": "Yes for sure. My wife isn’t currently working but we are opening an eBay store in her name to sell off household items and hope to put that money into a roth or personal 401k. If you’re tax savvy there are tons of ways to prep for retirement even with the new threshold.", "score": 3, "replies": []}, {"body": "The cost you paid for the items is deductable, as are you shipping costs, storage costs, etc. As are your PayPal fees.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "PYPL really looks oversold to me after earnings call. Can‘t explain to me this huge over reaction of the market. Since June 22 the market seems to load up it‘s pockets and after a good earnings call the market dumps it. WHY?! Paypal is huge in Europe and people used it many years so there is a lot of trust. In my opinion trust in the financial industry is a crucial factor like in the case of MasterCard or Visa. I think PYPL came to stay and will grow constantly. Especially the new CEO can be Important factor for PYPL. I‘m loading up on PYPL on this levels feels like a steel for me.", "score": 3, "replies": [{"body": "It’s pretty huge in other countries like Brazil too", "score": 2, "replies": []}]}, {"body": "Pushed bard to make a best guess on where the stock is headed:\n\nMy best guess is that PayPal stock will go up in the long term. The company is well-positioned to benefit from the continued growth of e-commerce and mobile payments. PayPal is also investing heavily in new growth areas, such as cryptocurrency and BNPL, which could help the company to maintain its competitive edge.\nHowever, there are some risks that could affect PayPal's stock price in the short term. The company is facing increasing competition from other payment providers, and it is also seeing slower growth in its core e-commerce business. Additionally, PayPal is investing heavily in new growth areas, which could weigh on the company's profitability in the near term.\nOverall, I believe that PayPal is a good long-term investment. The company has a strong track record of innovation and growth, and it is well-positioned to benefit from the continued growth of e-commerce and mobile payments. However, investors should be aware of the risks that could affect the company's stock price in the short term.", "score": 2, "replies": [{"body": "And here’s her best guess for an acquisition:\n\nMy best guess is that the most likely company to acquire PayPal is Amazon. Amazon is a tech giant with a strong focus on e-commerce. PayPal's payment processing capabilities would allow Amazon to expand its e-commerce offerings and reach new customers. Additionally, PayPal's strong brand and customer base would give Amazon a competitive edge in the global payments market.\n\nHere are some reasons why Amazon might be interested in acquiring PayPal:\n\n* PayPal is a leading player in the global payments market, with over 392 million active accounts. Acquiring PayPal would give Amazon a significant increase in market share.\n* PayPal has a strong customer base of over 392 million active accounts. Acquiring PayPal would give Amazon access to a large and loyal customer base.\n* PayPal operates in over 200 countries and territories. Acquiring PayPal would give Amazon a global reach.\n* PayPal is a profitable company with a strong track record of growth. Acquiring PayPal would improve Amazon's financial performance.\n\nOf course, there are also some risks associated with acquiring PayPal. These risks include:\n\n* High price tag: PayPal is a valuable company, and its acquisition would likely be expensive.\n* Integration challenges: Integrating PayPal's operations and systems could be challenging.\n* Regulatory scrutiny: Acquiring PayPal could attract regulatory scrutiny.\n\nOverall, the decision of whether or not to acquire PayPal is a complex one. There are both potential benefits and risks associated with the acquisition. Amazon should carefully consider all of these factors before making a decision.", "score": 2, "replies": [{"body": "Amazon already has global reach. Why would it need PayPal ? I don’t think Amazon would even consider it. May be a best for eBay.", "score": 1, "replies": []}]}]}, {"body": "Stocks are forward facing, that's the fundamental nature of them. PayPal is seen as the next victim of megatech (along with reduction in spending and other things)", "score": 3, "replies": []}, {"body": "It was valued at substantial growth, probably assuming the vast majority of all internet payments in the future would be through PayPal. Now internet payment companies are a dime a dozen with zero moat.", "score": 1, "replies": []}, {"body": "Before Paypal was valued like a tech company, however it is dinosaur company. There’s a ton of competition, companies do their own payment methods now. They don’t offer something special anymore.", "score": 1, "replies": []}, {"body": "PayPal losing its exclusivity with ebay cost them soooooo dearly", "score": 1, "replies": []}, {"body": "What is their moat? As a customer, what is my incentive to use or stay with PYPL? \n\nFirst and foremost, the growth has just slowed. You’re showing revenue and EPS numbers from 2018, but market is forward looking. 1% user growth and 6% revenue growth? That’s slow for a “growth” company. What’s actually happened is this stock is in limbo. It’s not growing fast enough for growth investors, not cheap enough for value investors. It’s maturing, and it’s usual investors don’t like that. \n\nThe markets concern is that the business getting commoditized. Go to any online check out, you have a credit card option, PayPal, Apple Pay, Google pay, Amazon pay, Square, Afterpay, Zelle…etc etc. So many players (not to mention massive players) in this space offer the exact same thing, with no tangible advantage. In fact, Apple Pay is easiest and the one most people use now. Instead of logging into my PayPal account, I can pay by clicking my lock button twice and using FaceID. As more and more commerce is done on mobile, they are relying on people using their competitors hardware (AAPL and GOOG) to use their product. Not a good position to be in and not an environment you can grow your margins in.", "score": 1, "replies": []}, {"body": "Stripe is direct competitor for Paypal and that two with much much better Developer API and nearly half the transaction fees. \n\nI am a developer and I wouldn’t touch Paypal from miles away. I will just integrate Stripe and let Stripe handle all kinds of payments", "score": 0, "replies": []}, {"body": "It needs to fall 66% more to be in the deep fucking value point that Meta was at a fe months ago", "score": -2, "replies": [{"body": "Why's that? \n\nMeta was 15 forward P/E in October 2022 with investments of $30 billion into cash burning money pits. Simply cutting those investments has boosted the stock. \n\nPayPal is at 18 forward P/E with net $12 billion cash and flat investment growth. \n\nPayPal could simply use all its FCF over the next 4 years to pay back every shareholder completely. If the company earns profit in 2027, I pocket the profit.", "score": 7, "replies": []}]}, {"body": "Put", "score": 0, "replies": []}, {"body": "I dunno.  Bought some Weds at $64.22 and decided this morning at $63.70 the market is gonna do what the market gonna do, I have no idea, but don’t want to be on the ride with this one.  \n\nThe chart has the classic super hump thru Covid that a lot of companies do.  Granted these prices go way back to 2017 so it appears cheap at face value. But it’s future growth prospects were a lot higher back then.  \n\nPersonally I never used PayPal.  Perhaps part of the story is a market reaching a higher level  of saturation.  I have no idea but eesh catching falling knives is hard.  Sometimes it pays but often you get cut.  \n\nIf I heard correctly they even said AI and finding cost efficiencies (layoffs?) in the conference call which have been the two magical words and that didn’t even help.  Seems like a trap.  Dunno", "score": -7, "replies": [{"body": "Two days and a 50 cent decrease made you change your mind? You should probably be doing more due diligence before buying stocks, if that’s the case. You shouldn’t 180 that quickly over nothing, it’s a waste of resources.", "score": 11, "replies": [{"body": "If it holds  $64 caught the falling knife about 3 days after earnings and things should/could settle out.  Loses $64 I was wrong.   Looks like a test $60 now.  Not gonna bet if it holds or not.\n\nEdit:  this was Friday. Tuesday closing price $60.80.", "score": -11, "replies": []}]}, {"body": "It's going to cost money to integrate machine learning. It might take a while before those investments bear fruit.", "score": 1, "replies": []}]}, {"body": "I'd say you're missing the fact that PayPal sucks and is a dying company. Most people don't use it or want to use it anymore, basically in the last 5 years I've noticed nobody caring for it and using many other platforms instead. I'd personally take that loss and be pleased it was only so ...", "score": -1, "replies": [{"body": "Except active users have increased YoY.", "score": 3, "replies": [{"body": "So have active Twitter accounts, but most of those are just bots.", "score": -1, "replies": []}]}, {"body": "man, do i remember people preaching about \"no one use Facebook anymore\"....", "score": 1, "replies": [{"body": "I don't personally, other than the marketplace once every few months ...", "score": 0, "replies": []}]}]}, {"body": "Payment processing is going to get a lot of competition from crypto in the coming years.", "score": -17, "replies": [{"body": "No it's not, I've been hearing this for almost a decade.", "score": 14, "replies": [{"body": "Its already happening, because you don't know about it does not mean it does not exist.", "score": -3, "replies": [{"body": "Just because you believe it, doesn’t actually make it true.", "score": 5, "replies": [{"body": "I’m not a ruthless crypto advocate and don’t currently hold any, but he is right. Payment services like Strike, Shakepay (in Canada), etc, are absolutely picking up steam.\n\nI won’t say it’ll ever displace the traditional payments industry, but crypto payments and self-custody is growing dramatically in use.", "score": -1, "replies": []}, {"body": "So if I wanna buy something, ask the store owner for his wallet adress and send him his desired amount in whatever shitcoin. That is not a payment process?", "score": -1, "replies": []}]}]}]}, {"body": "How? Crypto is literally a much slower and more expensive, unreliable payment system. \n\nNo one is using crypto to make payments (outside of paying ransomware).", "score": 6, "replies": [{"body": "There are small use cases now in countries with extremely high inflation on their currency. I’ve heard of crypto being used for payments in Venezuela on multiple different occasions. But wide-spread use? I don’t see it yet", "score": -2, "replies": [{"body": "I mean they can convert their local currency to USD if they’re concerned with inflation. \n\nConverting to a highly volatile asset is not a very smart idea.", "score": 2, "replies": [{"body": "You’re assuming that local vendors accept USD. Not always the case.", "score": -1, "replies": [{"body": "They don't accept USD but they accept crypto?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/litecoin/comments/13anmdd/i_paid_at_the_supermarket_directly_with_litecoin/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1\n\nLooks like I misremembered, but according to this guy’s comments a lot of Venezualans are accepting of crypto because of how badly bolivares have burned them.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Fun fact: Bitcoin is older than the iPad. THE IPAD. Bitcoin was here first. And still nobody uses it for shit. Except money laundering. And even that is getting less effective. But I for one welcome the crypto scam because it keeps a lot of guys money out of the stock market, making quality companies cheaper for me.", "score": 8, "replies": []}]}, {"body": "There are better businesses trading at better multiples and there are better investment options paying out cash returns\n\nIsn’t a single situation where I’d recommend PayPal to any of my clients", "score": -8, "replies": [{"body": "I'd love to know what businesses \n\nPayPal is priced like Intel & Meta in October 2022. \n\nIntel fumbled miserably while also investing more to gain government subsidies. Meta cut investments and refocused their business on AI-assisted ads. \n\nPayPal could follow either path. But I would note that Intel is up 30% this year and Meta up 100%. Sure Intel turned out way worse and is flat overall, but it's not drilling a massive hole either... Because it's cheap as hell already", "score": 5, "replies": [{"body": "Intel is not up 30% this year they closed at 26.43 to end last year and closed at 28.95 Friday. They are down 33% compared to 1 year ago from today.", "score": 1, "replies": []}]}, {"body": "Which bussinesses?", "score": 5, "replies": []}]}, {"body": "Unless PayPal’s price is shot so bad that it becomes a valuation play, I am not interested. There are significantly better opportunities in my opinion and I don’t think the investment thesis on PYPL is compelling enough.", "score": -2, "replies": []}, {"body": "People who have used PayPal know why the company is done. It’s just a bunch of scammers sending you fake invoices", "score": -2, "replies": []}, {"body": "Eps forecast 4.95$ non gaap and 2.9$ gaap so p/e forward 22 for gaap is not so much cheap", "score": -3, "replies": [{"body": "Tells me 18 Forward GAAP P/E \n\nThat's where Meta was in December 2022.", "score": 4, "replies": []}]}, {"body": "Too many competition", "score": -4, "replies": []}, {"body": "Not sure you can compare those two snapshots given the drastic change in the fintech space over the past 5 years.\n\nI don't think PYPL was particularly overvalued in Q1 2018 - just look at the financials & share price until COVID hit in Q1 2020.\n\nI do think it's a bit oversold now and could have a slight rebound. But, the macro economic conditions and much more competitive landscape now limits the upside to a much lower P/E relative to 2018 (would not expect a return to $90 for quite some time).", "score": 1, "replies": []}, {"body": "The story about competition is nothing that changed with the earnings call and comes up just because it's down. It has to be the lower guidance and fear of reduced future performance. It's probably an overreaction since PYPL often lowers guidance and beats it afterwards.  \n\nThat being said, if a recession hits PYPL will suffer, if not or only mildly, it's a good investment.", "score": 1, "replies": []}, {"body": "Paypal has a lower pe ratio than wastemangment,best buy, IBM and many other who are growing revenues at 2 3 % and earning at 5%. I am long on paypal bought at $110 I still dnt understand why it's trading at 12 times earning with the earning growth of double digit. Even if they hold on to market share and buy back stocks and with 3 4% inflation it will still grow revenues at 4 % and even if you give the multiple of 13 for this year it should be at @65", "score": 1, "replies": []}, {"body": "Fuck pypal just let them die", "score": 1, "replies": []}]}
{"title": "Leaked Freedom of Information Act (FOIA) Request - Microvast DOE Grant Application - Oshkosh USPS NGDV Confirmed?", "selftext": " TL;DR: Oshkosh confirms Microvast is supplying batteries and separators for NGDV for USPS in leaked FOIA FOIA DOE grant application with GM. This is the beginning of the next leg up, get in now and fill your bags before the news is released. \n\nNow the details..  \n\nGM and Microvast recently won a grant from the Department of Energy (DOE) as part of the Inflation Reduction Act, which rewarded 200 million dollars to Microvast to build a factory in the US with GM support, to produce an advanced separator using IP from both GM and Microvast.  See here for more details: [https://news.gm.com/newsroom.detail.html/Pages/news/us/en/2022/nov/1102-microvast.html](https://news.gm.com/newsroom.detail.html/Pages/news/us/en/2022/nov/1102-microvast.html)\n\nRecently Microvast had a great earnings, beat expectations on margin quarter, raised guidance, enhanced margin.  This led to a more then 50% gain in one day, and a bit of a short squeeze as many many people and institutions have been shorting Microvast into the ground and were caught off guard by the quarter's results.  Check out the chart and volume last 2 days.  Based on the limited move, there are still many shorts that have yet to cover, and interest is way up.\n\nI believe I've identified some leaked information that will light the fuse on this rocket now considering the context that it finds itself right now.\n\nThis fuse is a leaked Freedom of Information Act (FOIA) dump that is the redacted joint application with General Motors and Microvast for the grant for their new factory to build advanced battery separator technology.\n\nIn this 240-page leaked redacted grant application to the Department of Energy (DOE) there is a boatload of very material information that has never been seen about the separator and the technology and the company.\n\nIn addition, there are several letters in support of Microvast applications from companies that have committed to purchasing the separators and other batteries from Microvast.  One of these letters appears to confirm that Oshkosh is in fact using Microvast batteries and separators for the USPS NGDV.\n\nWhile you can read through the entire thing here:  [https://file.io/Xl1g1p2oqi7K](https://file.io/Xl1g1p2oqi7K)\n\nI will focus this post on the Oshkosh / USPS / NGDV confirmation.\n\nFirst here is a screenshot of the letter (page 149) in the leaked FOIA DOE grant application (please read the whole thing but notice the language circled in red):\n\n[Leaked DOE application - with letter of support from Oshkosh including confirmed contract order](https://preview.redd.it/lwc7ariuzbza1.png?width=755&format=png&auto=webp&s=ea4c0a49942775015d66c93d9ff660abe5e0f801)\n\nNow let's take a look at the Oshkosh website here: [https://www.oshkoshcorp.com/en/brands-innovations](https://www.oshkoshcorp.com/en/brands-innovations)\n\n&#x200B;\n\n[Same Language - Fill in Oshkosh where redacted in DOE letter - same exact language](https://preview.redd.it/rpk8hudw0cza1.png?width=1898&format=png&auto=webp&s=ca3c8ba223561a49ad548d99138809681c6d6460)\n\n&#x200B;\n\nNow, there are several other letters that show confirmed orders and are interesting as well, and these are right around the same page numbers.  You can also see lot's of other really amazing stuff, not meant to be seen by us mere mortals.\n\nWe have a chance here to get in before this information is confirmed and made public. On the recent quarterly call, the company alluded that they will be released from their NDA shortly, and will be making several contract announcements.  When this one is released it should launch this party.", "id": "13fbfie", "created_utc": 1683867881.0, "score": 92, "upvote_ratio": 0.87, "num_comments": 92, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|1 year ago\n**Total Comments**|123|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/pvx3zv/microvast_public_free_float_dd/) [x](https://www.reddit.com/r/wallstreetbets/comments/qtu3rs/microvast_mvst_earnings_setup_for_tomorrow_monday/) [x](https://www.reddit.com/r/wallstreetbets/comments/p26jiu/oshkosh_plane_flew_into_clarksville_tennessee/) [x](https://www.reddit.com/r/wallstreetbets/comments/poitwd/microvast_mvst_dd_oshkosh_and_usps_win_workhorse/) [x](https://www.reddit.com/r/wallstreetbets/comments/r9zd8l/new_silicon_ssb_lithium_metal_battery/) [x](https://www.reddit.com/r/wallstreetbets/comments/13fbfie/leaked_freedom_of_information_act_foia_request/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\nHey /u/SCHNiiiiKEN, **positions or ban.** Reply to this with a screenshot of your entry/exit.\n>TL;DR: Oshkosh confirms Microvast is supplying batteries and separators for NGDV for USPS in leaked FOIA FOIA DOE grant application with GM.  This is the beginning of the next leg up, get in now and fill your bags before the news is released.", "score": 1, "replies": [{"body": "Here are my positions\n\nhttps://preview.redd.it/p119gudmkdza1.png?width=1100&format=png&auto=webp&s=333db01594330d50d8b55a2fdacf0311eb8fc196", "score": 2, "replies": []}]}, {"body": "I’m down 99.9% on MVST. I was like 5 years too early", "score": 32, "replies": [{"body": "Thcb gang here", "score": 7, "replies": []}, {"body": "This is the way ![img](emote|t5_2th52|30641)", "score": 7, "replies": []}]}, {"body": "I am beyond balls deep in Microvast, there are so many other hidden nuggets scattered across the internet of what’s to come. This company will be worth tens of billions of dollars before 2030", "score": 29, "replies": [{"body": "2 leaps and 850 shares hope you're right", "score": 13, "replies": []}, {"body": "Yes!!!!!", "score": 6, "replies": []}, {"body": "Would love to see some of those tidbits if you have links.", "score": 3, "replies": [{"body": "Check out the Mvst board on stocktwits, so much good info there if you sort through the bots", "score": 6, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}]}, {"body": " \"Leaked\" FOIA?", "score": 19, "replies": []}, {"body": "Holding 12,000 shares @ $2.92...\n\nThen again, remember the WKHS rumors?", "score": 17, "replies": [{"body": "What are those rumors?", "score": 3, "replies": [{"body": "These rumors drove workhorse up significantly because it was rumored they were going to get this contract like two years ago.  They didn’t and Oshkosh won instead.  Workhorse crashed after that from somewhere like 30 bucks a share to 5 or below (off the top of my head not actual numbers).  Workhorse sued the US government after that, and lost, actually just gave up / pulled out.", "score": 2, "replies": []}]}]}, {"body": "I want to follow this play, but it’s up 75% in the past 5d already. 🤔 I remember this ticker the last time it was played though (about a year ago) and was punching the air for missing out.", "score": 14, "replies": [{"body": "Up 75% because it had a stupidly low valuation. The cap was almost less than their cash on hand", "score": 13, "replies": []}, {"body": "Not anymore. Down huge since yesterday lol", "score": 3, "replies": [{"body": "Did you even look at the chart?  It’s still up 85% from less then a week ago.  You call a healthy pullback after a 75% run “down huge”? Wha?", "score": 2, "replies": []}]}, {"body": "If you want to be cautious wait for a pullback and load the boat.", "score": 2, "replies": []}]}, {"body": ">I'm not sure what you're talking about. I don't invest in companies that produce things, I only invest in myself.", "score": 21, "replies": [{"body": "Good bot", "score": 6, "replies": []}, {"body": "Chad bot", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "It seems like it's a private community now?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks, wasn't aware of that.", "score": 1, "replies": []}]}]}]}, {"body": "Fuck oshkosh, better tell them how order backlog grew 3x in a year", "score": 9, "replies": [{"body": "I’ve posted more detailed stuff in the past.  The average reader here can’t read past the first two sentences, so try to post something a bit engaging and keep it focused. But yeah.. there is so much more to this company, technology, real revenue, partnerships, customers, patents, R&D.. anyone who’s interested in learning more can find it with a little effort.", "score": 2, "replies": []}]}, {"body": "hey FOIA my balls", "score": 8, "replies": [{"body": "If you have any balls, get in tomorrow.", "score": 8, "replies": [{"body": "I have both my nuts in Powells asshole and hes screaming BRRRRRRRRRRRRRRRRRRRRRRRRRRRR", "score": 2, "replies": []}, {"body": "What's the strike and date? Or we just holding shares and LEAPs.\n\nEdit: nvm just saw your comment", "score": 2, "replies": [{"body": "My positions are posted in reply to the auto mod comment on me above.", "score": 3, "replies": []}]}]}]}, {"body": "I’m so happy", "score": 6, "replies": [{"body": "Awesome", "score": 3, "replies": []}]}, {"body": "Already all in, but I will put all my vacation money and salary also in it this month, maybe selling some stuff I have, its such an easy 5x play", "score": 8, "replies": [{"body": "Sounds like an interesting plan", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I was wondering this too. Looks like they are texas based and they are trying to pass lots of anti Russian and Chinese legislation here. Especially about owning land and businesses. Honestly seems super illegal and racist, but it's Texas so....", "score": -4, "replies": []}]}, {"body": "Something about these comments feel off", "score": 11, "replies": [{"body": "Yes this is such a powerful comment.  The other comment chains on WSB are just so insightful and intelligent.. not “off” at all like this one.", "score": 2, "replies": []}, {"body": "Preminiscent", "score": 2, "replies": []}]}, {"body": "LFG🚀", "score": 6, "replies": [{"body": "Yes I agree!", "score": 2, "replies": [{"body": "Hey man LFG it's Bryan 🤣🤣🤣🚀🚀🚀", "score": 3, "replies": []}]}]}, {"body": "Great info!!!\nThanks", "score": 4, "replies": [{"body": "You are welcome!", "score": 1, "replies": []}]}, {"body": "Would calls be good here or should I just stick to equity?", "score": 5, "replies": [{"body": "Equity", "score": 3, "replies": []}]}, {"body": "Long time holder, first time cheerer. I'm already up to my dick in shares and jan '25 1.50 calls. I almost lost faith when it dipped under a dollar and didn't buy more down there", "score": 4, "replies": [{"body": "I bought 2000@.98 to avg down my position...glad I did", "score": 6, "replies": []}]}, {"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 7, "replies": [{"body": "Never understood this.  Who would want their nuts squeezed.  Ow.", "score": 1, "replies": []}]}, {"body": "Anybody think Quantumscape (QS) is worth a squat? Holding bags of both.", "score": 3, "replies": []}, {"body": "\"The interest is up and the stock markets down and you only get mugged if you go down town\"", "score": 3, "replies": [{"body": "Word to your mother", "score": 2, "replies": [{"body": "She sends her regards", "score": 1, "replies": [{"body": "Aw!  She’s so sweet.", "score": 2, "replies": []}]}]}]}, {"body": "Dang dude, the bagels must have been extra fresh. Nice DD.", "score": 5, "replies": [{"body": "Yum yum", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Aw.. that’s good for you.. thanks for sharing your feelings with us all..", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "That’s fair.  I hear what your saying.  I obviously don’t agree on this one though.  Maybe all the rest, but not on this one.", "score": 2, "replies": [{"body": "Dame mate MVIS did exactly what these bag holder stocks always do, hope you got out with some profits when it was running.", "score": 1, "replies": []}]}]}]}]}, {"body": "This isn’t new. They were awarded the grant last year 🤦🏻‍♂️", "score": 2, "replies": [{"body": "The post is not about the grant.  I understand not reading the whole thing.. but you couldn’t even read the TLDR?", "score": 2, "replies": []}]}, {"body": "Signs of a terrible horrible no good bagholder trying to get rid of baggage\n\n- \"get in now while you can\"\n- a random comment saying \"this is good daily dues\" for a post that does not have good daily dues. No info on microvast, anything related to microvast, why it's worth so much, etc\n- an entire sub dedicated to the stock like r/amc with a random member that conveniently goes into the comments and says \"come join us\" \n\n\nThis post is just way way too sus", "score": 2, "replies": [{"body": "This sounds like the average WSB post. But ok", "score": 2, "replies": []}]}, {"body": "Dude that $200M from the DOE is about to get yanked back, and it fucking should. The US government should in no way be subsidizing Chinese companies. I’m not anti-Chinese by any means, I love almost all the Chinese people I’ve ever met. But sending US tax dollars to a company that could be manipulated (or coerced) by the CCP is ridiculous.\n\nhttps://science.house.gov/2023/3/lucas-continues-to-press-for-answers-on-200-million-energy-award-to-company-with-chinese-communist-party-ties", "score": -5, "replies": [{"body": "I’m glad to see you love Chinese people.  The company is headquartered in Texas and founded by a Chinese American.", "score": 1, "replies": []}, {"body": "You are using Reddit dude . If you hate the CCP that much you probably wouldn’t be using this platform", "score": 1, "replies": []}, {"body": "How did you know?", "score": 1, "replies": [{"body": "Read the tea leaves. AI chip bans to China were a tell, for sure.", "score": 1, "replies": []}]}]}, {"body": "Certain as fuck not workhorse", "score": 1, "replies": [{"body": "Yes certain as fuck for sure", "score": 2, "replies": []}]}, {"body": "https://www.indeed.com/m/jobs?q=microvast&l=Clarksville%2C%20TN&from=searchOnHP\n\nNote the Vice President level job listing.  That's not encouraging they're not further along.  But I just don't get the low valuation.  Their equipment and real estate would be worth more than market cap.\n\nEdit:. This also suggests that a US supplier being used is the goal especially for US Government or government adjacent organizations.  \n\nhttps://www.reuters.com/business/energy/largest-ever-us-solar-factory-shows-rapid-pivot-american-made-2023-05-11/?utm_source=reddit.com", "score": 1, "replies": [{"body": "Not understanding how this is relevant?  Companies hire VPs all the time?  Even the most mature largest companies.. Apple.. Microsoft.. amazon.. they are hiring VPs everyday.  So what are you taking about here?", "score": 1, "replies": [{"body": "VP for Construction and Industrial Design.  There was one for KY and one for TN.  That suggests they're not as far along in even the planning for these plants.  It is specifically what this person dies and what they're responsible for (see the job posting) and they're \"urgently\" looking to get them.  If it was VP of human resources I wouldn't be as concerned.  And Apple MSFT etc are likely replacing someone and the new person will take over where the old one left off.  Not sure that'd be the case in a new company for a new plant making a new product.  I'm long on this stock but earlier commented that I wonder if talent acquisition is slowing them down.  They don't need the thousands of laid off coders or banking bros.  There are lots of concerns and I think this one is fair and frankly your analysis that it \"happens all the time at established companies\" seems a bit weak.  But to each their own.", "score": 1, "replies": [{"body": "Ok I hear ya.  Their going to need more, so that they can expand these and the KY is brand new / hasn’t started yet so that makes sense a bit.  Not sure how their titles are structured but there could be multiple VPs with same title.  The TN one is pretty far along (they update continuously) but the KY is very early / pre-construction etc.", "score": 2, "replies": [{"body": "I'm quite aware.  And you can't make anything until you've constructed you're partially, or fully, automated assembly lines which this role obviously includes (by way of the job description).  They also have ten openings for workers to maintain said equipment.  For that region these are very high paid jobs.  You might find this funny, or not.  The reason I looked into this was to counter the claims of obvious shorts who were saying it wasn't even real.  Boy if not they went to excessive detail.  They've also been covered by their local media as one would expect.  Your argument holds water here that someone could have poached someone from their team already in this position.  But mine is just broader that talented whiye and blue collar workers may be hard to find in this economy.....ORRR...if there is a recession could it be perfect timing.  I think it is worth discussing although not worth o sending over.  45k long....let us pray...lol.", "score": 1, "replies": []}]}]}]}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "The pivot is part of a link to a world class news organization.  Bad bot.", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "Oshkosh invested $25 million in Microvast.  I'm not aware of any other battery company investments they made. [https://investors.oshkoshcorp.com/news/news-details/2021/Oshkosh-Corporation-partners-with-Microvast-to-strengthen-electrification-capabilities/default.aspx](https://investors.oshkoshcorp.com/news/news-details/2021/Oshkosh-Corporation-partners-with-Microvast-to-strengthen-electrification-capabilities/default.aspx)", "score": 1, "replies": []}]}
{"title": "Paypal $PYPL Share Price vs P/E. P/E Is At An All Time Low. Trap or Opportunity?", "selftext": "", "id": "13fvhjf", "created_utc": 1683921835.0, "score": 88, "upvote_ratio": 0.91, "num_comments": 101, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|3 months ago\n**Total Comments**|36|**Previous Best DD**|\n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "when i asked if it's time to catch the falling knife on tsla at $109, the regards here said no and gave so many reasons, so naturally this will be no as well, dont buy the dip bro, it's never going back up, going to 0, no cap", "score": 41, "replies": [{"body": "Same thing happened with NVIDIA. It was about $100 less than a year ago.", "score": 22, "replies": [{"body": "META also at $90", "score": 19, "replies": []}, {"body": "i hope you held on to some of that lol", "score": 2, "replies": []}]}, {"body": "You can rationalize anything out. Are all these companies going to be the best ever forever? Maybe not, but really all that matters is price action. I'd buy the dip.\n\nSPY dips a few dollars and the regards say the market is crashing.", "score": 8, "replies": []}, {"body": "They always just confirm the current price action.\n\nGoes up = oh yeah it's obvious, why would anybody think differently, it will certainly go up forever!!! (META, NVDA)\n\nGoes down = oh yeah, it's obvious it went down, this company sucks, goes to 0!!!", "score": 7, "replies": []}, {"body": "So a couple of guys got lucky gambling on the dip, but Tesla is still very overvalued and it looks like their nasty downtrend is still perfectly intact. \n\nI sure hope people realize it’s a swing trade at best.", "score": 2, "replies": []}, {"body": "Tesla is currently $280... Lfg", "score": 1, "replies": []}]}, {"body": "Trap.\n\nThere are too many person to person money transfer apps out there, along with Apple announcing a while back they were getting involved also. PayPal is a pioneer, but they haven’t innovated or changed.", "score": 83, "replies": [{"body": "i dont know its huge in e-commerce. people like to pay with paypal. at least in europe. we're not that much into credit cards. there are new player like klarna but paypal still numba one in payment methods for online shopping. there is one click payment and you dont even have to enter your address. what do you want to innovate if you have literally one click and it comes to your door.", "score": 35, "replies": [{"body": "I’m in Europe, and I only use PayPal when it looks like a shady website or if the webshop only supports PayPal,", "score": 19, "replies": []}, {"body": "I use PayPal but it still goes through a debit card and Visa or MasterCard takes their cut", "score": 5, "replies": [{"body": "Most people I know just link their bank account to PayPal and that’s it.", "score": 8, "replies": []}]}]}, {"body": "Valuation is very attractive right now though. \n\n&#x200B;\n\nRisk is if the company will significantly lose market share moving forward.", "score": 5, "replies": [{"body": "It isn’t even that attractive", "score": 7, "replies": [{"body": ">Spins13\n\nWhy is 12x P/E not attractive for a company that is estimated to keep on growing for the next years?", "score": 1, "replies": [{"body": "You do a DCF. Mine says PayPal is slightly undervalued. However this is definitely not enough with the risks associated", "score": 8, "replies": [{"body": "Have you considered the massive stock buy backs? They authorized 15B last August and did 4.2B of that 15B in 2022. They have a huge free cash flow yield of 7.5% right now.", "score": 2, "replies": []}, {"body": "How about the opportunity in multiple expansion?", "score": 1, "replies": [{"body": "How do you see it growing?  Only people I know that still use it keep it around for eBay and eBay alone.  Haven’t heard word one about it since 2000’s", "score": 6, "replies": [{"body": "PayPal did 1.36T in total payment volume in 2022. eBay did 73.9B in gross merchandise volume. eBay isn't even a blip on the radar for PayPal anymore.", "score": 2, "replies": []}, {"body": "Uhh....AI?", "score": 2, "replies": [{"body": "Rename PayPal to PayPAI and P/E will go from 12 to 80!", "score": 9, "replies": [{"body": "PAiPal dude it was right there...", "score": 5, "replies": []}]}]}]}, {"body": "Expand to where?\n\n\nAs other have pointed out, they haven't innovated much and they are already common around the world.\n\n\nJust because it's a tech company doesn't automatically mean it is a growth company.", "score": 3, "replies": [{"body": "I was referring to the opportunity in P/E multiple expansion.   \n\n\nCurrently it is at all time lows and when market sentiment improves, there's a good probability that the market will start paying a higher P/E multiple again on $PYPL.  \n\n\nIMO, opportunity in Paypal is earnings growth + multiple expansion.", "score": 3, "replies": []}]}]}]}, {"body": "They have no moat, so those estimates could easily evaporate.  SVB and First Republic had great estimates too (not saying that is the path for PayPal).", "score": 0, "replies": []}]}]}, {"body": "Yea they’re losing market share like crazy. Valuation may be high, but I wouldn’t buy a share, or even use the damn app lol.", "score": -3, "replies": []}]}, {"body": "Costco has not innovated in a while and it’s doing pretty well.\n\nI also think it’s a trap but the reason is more that their moat is not strong enough", "score": 5, "replies": []}, {"body": "PayPal owns a money transfer app, the problem is that it's the bad one. Venmo my ass; Cashapp is the only one people actually use.", "score": -10, "replies": []}]}, {"body": "Those who say is a trap reminds me the same redditors who declared META, TSLA and NVDA were dead at the end of last year. \n\nHere in Europe, PayPal is the preferred solution for paying online besides credit cards (which usage is not comparable to US). \n\n(No positions held but I’m thinking to enter)", "score": 28, "replies": [{"body": "Price drives the narrative", "score": 7, "replies": []}]}, {"body": "Definitely a good time to buy in my opinion. Hasn't been this low in years and even with competition, PayPal is still cash-earning.", "score": 15, "replies": [{"body": "Great point. Yes it still generates lots of free cash flow and it is estimated to keep on growing", "score": 3, "replies": []}, {"body": "-22% on 5 year chart", "score": 3, "replies": []}]}, {"body": "You're obviously not as rich or intelligent as me, so I don't really see why you're even trying to have a conversation with me. You should just go back to your poor little life and leave people like me alone.", "score": 36, "replies": [{"body": "https://preview.redd.it/jb20rkrobiza1.jpeg?width=733&format=pjpg&auto=webp&s=d30425a46b0f68b2c79a749f3aa78b4d1afec907", "score": 15, "replies": []}]}, {"body": "Go All In.", "score": 8, "replies": []}, {"body": "Opportunity for a trap.", "score": 8, "replies": []}, {"body": "You buy PYPL now and hold it for a long time, if you lose money, I'll give you my Rolls Royce", "score": 16, "replies": [{"body": "Sounds like a once in a lifetime deal!", "score": 6, "replies": [{"body": "PYPL will rebound in the short term You can buy low and sell high to earn the spread", "score": 3, "replies": [{"body": "So.. what you are saying is that he should if possible buy shares for less than he sells them for? \n\n\\#buffet", "score": 13, "replies": []}]}]}]}, {"body": "Bag holder will say Opportunity and a true Regard will say Trap", "score": 5, "replies": [{"body": "What does a regarded bag holder say?", "score": 3, "replies": [{"body": "They can’t talk because their mouths are stuffed with cockmeat sandwiches.", "score": 2, "replies": [{"body": "Regarded bag holder here and all I have to say is, Mmphh Mmphh MmmMmmphh", "score": 2, "replies": []}]}]}]}, {"body": "I got shares today at $61 ish and plan to get some leaps around $65 to $70… just thinking to do a trade in a possible rebound. I believe it’s over beaten", "score": 8, "replies": [{"body": "Did you sell?  Im still hodling", "score": 2, "replies": [{"body": "Sold it and repositioned with other stocks", "score": 1, "replies": [{"body": "I am still holding, funally paying off!", "score": 2, "replies": []}]}]}, {"body": "Did u buy?", "score": 1, "replies": [{"body": "I have the shares but did not buy the leaps yet. Maybe next week !!!", "score": 1, "replies": []}]}]}, {"body": "Not sure about the stock, but I know PayPal is losing out on all the medium sized businesses because they steal money. With PayPal, it's either household brand names that get 1-1 service or your average mom and pop shop that they don't give shit about. The second they get more than 5-10k a day coming in, they will:\n1. Block you from transfering out for \"verification\"\n2. After a week or so, they will completely shut down your account and all the money inside for 180-360 days for further \" verification\"\n3. Deduct a majority of your balance for \"fees\"\n\nThey've had 2 class action lawsuits over theft of funds and you guys can search up horror stories on Reddit. \n\nIf they steal one week of revenue, they earn more than they would have if they continued servicing the account for approx. 2 years. It definitely makes sense for them to take your money since most new business don't stay afloat for that long.", "score": 8, "replies": [{"body": "It is a nightmare to use paypal as a buyer or seller. They are willing to screw anyone over even if you have a clean record and a bunch of transactions. Stopped using paypal because their fees using cc are fking horrible and I'm not gonna use bank funds when their buyer protection is a coinflip.", "score": 1, "replies": []}]}, {"body": "Better be an opportunity because I have a 67 call on that ending this month.", "score": 2, "replies": [{"body": "Still holding?", "score": 2, "replies": [{"body": "Bro, don't get me started hahah", "score": 1, "replies": []}]}]}, {"body": "I like the R/R I got $7k in September leaps. Up 56% right now. Looking for a red day or two to add to my position.", "score": 2, "replies": []}, {"body": "Opportunity", "score": 2, "replies": []}, {"body": "stock is being manipulated to death by the scumbag market makers. i just keep buying every time it goes down two dollars dollar cost averaging into a long position. I can wait.", "score": 4, "replies": [{"body": "If you’ve been doing that since 2021 you’ve bought shares on well over 100 occasions", "score": 3, "replies": [{"body": "no i just started my position after the most recent earnings.", "score": 1, "replies": [{"body": "Careful man, their earnings have been decreasing ever quarter for awhile. That's why they are down.  A fair value at this point would be $20 per share and that's still 10X price to earnings.", "score": 1, "replies": [{"body": "Their earning are actually up this year. And that they couldnt hold their COVID-Valuation is Common Sense.", "score": 3, "replies": []}]}]}]}]}, {"body": "Why is it at an all time low?", "score": 4, "replies": [{"body": "It's all time low is $30 you regard.", "score": 1, "replies": []}]}, {"body": "PayPal is boss!", "score": 2, "replies": []}, {"body": "Up to 3.2% of the float has been shorted and whatever today's short volume is. Anybody have any clue if this drop  is synthetic?", "score": 2, "replies": []}, {"body": "PYPL is a trash company with trash products. They can’t even design a proper UI. They sat on a goldmine and instead of mining gold they thought it was a good idea to implement a social feed in venmo. Fuuuuuuck PayPal homie.", "score": 1, "replies": []}, {"body": "Wait till the CEO is gone. He isn’t done burning down the house yet.", "score": 1, "replies": []}, {"body": "I am bullish on this ticker, this stock is grossly oversold selling some putties will definitely work !", "score": 1, "replies": [{"body": "*60% of the time*, it works ***every*** *time*", "score": 1, "replies": []}]}, {"body": "With the massive amounts of downgrades.....it feels like institutions want it cheap and plan to hold loooong. I'm gonna wait till they do their magic and deploy some cash....", "score": 0, "replies": []}, {"body": "PYPL is so 2018, that train has left the station.", "score": -2, "replies": []}, {"body": "Lot of short volume lot of retail buying. Not sure whats going on, but im sure their is an algo somewhere that knows exactly what the game plan is with pypl\n\nhttps://preview.redd.it/73zhxgr7miza1.jpeg?width=1080&format=pjpg&auto=webp&s=52945e7e6dacac3857f177379e37d821864cb5ef", "score": 1, "replies": []}, {"body": "wouldn't buy it through another earnings", "score": 1, "replies": []}, {"body": "Momentum doesn't care about P/E", "score": 1, "replies": []}, {"body": "Here’s my post on a related thread ([link](https://www.reddit.com/r/wallstreetbets/comments/13duw5t/why_paypal_tanked_on_good_earnings_dd_analysis_or/jjnvgrs/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3)). The company is still growing. However that growth is coming from Braintree which is a lower margin business than the legacy PayPal payment method. \n\nThanks for the valuation info. My concern is that there are too many public payments stocks and it’ll be tough for any of them to catch a bid due to competition. For example, gpn is a nice 10-15% per year earnings grower that’s trading below where it was back in 2018.", "score": 1, "replies": []}, {"body": "How did you get that chart for the PE ratio over time? What’s do you calm that indicator?", "score": 1, "replies": []}, {"body": "Trapportunity", "score": 1, "replies": []}, {"body": "The popularity of venmo blows my mind.  Could be some growth opportunity there.", "score": 1, "replies": []}, {"body": "Didn't we just hear what Cramer had to say?", "score": 1, "replies": []}, {"body": "Earnings per share were continually growing and have now reversed and are less than half their peak.", "score": 1, "replies": []}, {"body": "Trap. It's undervalued but risky af", "score": 1, "replies": []}]}
