{"title": "[deleted by user]", "selftext": "[removed]", "id": "r8hhb8", "created_utc": 1638592017.0, "score": 88, "upvote_ratio": 0.87, "num_comments": 58, "comments": [{"body": "Nice DD and I don’t mean your wife’s", "score": 19, "replies": []}, {"body": "I read this one yesterday. Why'd it get removed?", "score": 10, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "Smart move. I actually really appreciate the effort put into this. I'll probably do my own DD this weekend and see if I want to throw some cash in it.", "score": 11, "replies": []}]}, {"body": "Don't you know? There's this guy, he's a WSB mod and he... *sits on the board of Pfizer.*", "score": 21, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I just wanted to say that I appreciate all of the effort you put into this post.", "score": 9, "replies": []}]}, {"body": "What", "score": 1, "replies": []}]}]}, {"body": "I am literally a scientist...and also a retard.  Let mw explain why you are wrong.  I have made a bunch of money off of this company from when they 4 dollars a share with only their flu vaccine candidate.  \n\nThe science behind this companies vaccines is legit, they have now made it over several crucial checkpoints and clinical trials.  There flu vaccine trials even looked great and should (should) lead to future approvals. \n\nThere is a huge (simple) problem that explains all your conspiracy theory BS however in your thesis. THE MANAGEMENT IS THE WORST I HAVE EVER SEEN!!!!\n\nThe management of this company is absolutely horrendous.  They are slow as hell for everything. Their PR campaign is a joke and they never respond to anything in a sufficient manner.  They dont include in any way why their science is better in any PR.  They are typically behind the curve in every aspect that matters for their stock price. Couple that with managements ability to make STUPID statements and this thing can fly and crash within days.  \n\nThey stated the other day they are working on a vaccine for \"OmIcRoN\", ready by January. They dont even have the necessary approvals for their original vax against COVID yet. Thats been 18 months.  Lol", "score": 17, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Incredible idea!", "score": 3, "replies": []}]}, {"body": "There are a lot of really bad CEO's in the biotech world. They have no idea how to run a company, but they start a new biotech company that will hemorrhage cash for years before possibly creating a viable product (or not).", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "In biotech, you have to trade on the way up before the final approval. Most \"sell the news\" includes final approval. After the final approval it's way too late, at that point risk versus reward is just not good enough.", "score": 2, "replies": []}]}]}, {"body": "About management, you're not wrong.  They are a life-long clinical research company that has NEVER been able to actually commercialize anything, mostly because they've never had anything this close to being approvable.  \n\nPre-covid, their flu vaccine was the closest, but without any strong 'commercialization' professionals in the company, they have suffered greatly.", "score": 1, "replies": []}]}, {"body": "Did you know they were few weeks from delisting before they got crazy amount of Trump covid money that saved their arse?", "score": 8, "replies": []}, {"body": "This aged like milk turning into world class cheese. Nice DD.", "score": 6, "replies": []}, {"body": "This is the 2nd largest in my porfolio. My entry was much higher, bought in quite some time ago and keep buying more at lows. I am -18% atm. I believe that this would go to 300+ in 1 month or 2 after an EUA approval and even much higher. But when I saw the news about Evergrande today... Gosh, the market might crash next week. Anyway, I am still long with NVAX.", "score": 5, "replies": []}, {"body": "1. Delta is the most common variant as far as I’m aware\n2. I can’t take a point seriously that says “endless short attacks probably by the hedgies provided money by Pfizer.\n\nYou make some okay points about the company, but posting ape nonsense like that ruins the point imo", "score": 4, "replies": []}, {"body": "Great work. Seems like an absolute no brainer. Stranger things have happened however", "score": 4, "replies": []}, {"body": "Thanks for taking the time to do the DD!  It is reasonable and balanced.", "score": 4, "replies": []}, {"body": "I read \"conspiracy theory\" and \"hedgies\" and I am in.", "score": 3, "replies": []}, {"body": "Well articulated DD, logic seems solid. But looking at the longer term chart, can't help but think the ship has sailed, can you imagine buying at $5 in JAN 2020.", "score": 7, "replies": []}, {"body": "I remember when that article came out against NVAX. I made like $3,000 that day  off the recovery lol!", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4270)", "score": 2, "replies": []}, {"body": "I’m sorry for your losses that day…", "score": 2, "replies": []}]}]}, {"body": "1 call option is like 1500 wayyyyy OTM that’s going to be a no for me dog", "score": 6, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|11 months ago\n**Total Comments**|80|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/r8ajo3/bullish_thesis_on_novavax_and_conspiracy_theory/) [x](https://www.reddit.com/r/wallstreetbets/comments/r8hhb8/bullish_thesis_on_novavax_and_conspiracy_theory/) \n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r8hhb8)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r8hhb8)", "score": 2, "replies": []}, {"body": "You sir are a true member of WSB, completely retarded", "score": 2, "replies": []}, {"body": "Alpha beta effectiveness. Is it also effective agsinst the spanish flu?  Long live omicron. While i dont believe in it i will buy calls", "score": 2, "replies": []}, {"body": "South Africa clinical study is telling a different story.\nhttps://youtu.be/1Paq17X6ucQ", "score": 2, "replies": []}, {"body": "Late to see this post, but very very astute. \n\nIs it possible that there's institutional investors shorting the stock? Like they dump the stock on the market, drop the price, and buy it back?\n\nI've invested about 1/3 of my net worth in this one at a dollar cost average of about $155. This stock will either make me work until I'm 70, or retire in the next two years.", "score": 2, "replies": []}, {"body": "I love these DD posts because they show me great *method* for doing DD, what type of info to look at, what kinds of trends to pay attention to, what aspects of a company to keep an eye on, etc. I really appreciate the work you put into this, it's clearly a labor of love. I can tell you're personally invested, and not just financially. I'm a poor person so I'll probably miss this train like I missed all the other ones but I'll watch the stock and wave as you skyrocket into Buffethood.", "score": 4, "replies": []}, {"body": "Why would you expect it within 90 days? Didnt they just start P3 so it would be longer?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I dont think earnings will be the big deal. Phase 3 recruiting is happening and hopefully BTD. Theres a lotnof catalysts coming but they dont do earnings calls all the time", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Why would they get approved that fast though? If they just started P3 it should take a few months before fda says OK instead of the year or so it would take for a normal drug?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Ah thanks any diea how long ema takes too accept usually", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Might do some spreads on it then for EoM or end of Jan", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Vanguard are a main owner of everything in an index. They’re an index manager. Plot twist though, Vanguard is owned by those invested in Vanguard funds.", "score": 2, "replies": []}]}, {"body": "Nah, with the anti vax protests going on almost in every country, people are pretty much finished with more vaccines and lock downs.  By the time this stuff hits market, ready to roll out in billions of quantities, the theater seats will be empty.", "score": 1, "replies": []}, {"body": "Man those NVAX bags are heavy huh? Look at Ocugen to find out whats going to happen with NVAX. It's not about how good your science is its about who you know and how many palms you can grease (looking at you PFE/MRNA).\n\nNVAX is 10 months too late. The Vaccine stock game is over minus a few delusional shareholders who think NVAX/MRNA is going to be the same price this time next year", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "\"pre-sold\", and how much income have they made off that? ZERO\n\nJust look at what happened with OCGN.\n\nThe Covid Vaccine trades are DOA now. NVAX is too late. NVAX going to 50 dollars by end of q1 2022", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Im sorry for the heavy bags bro but I can't carry them for you and neither can your wifes boyfriend.", "score": 0, "replies": []}]}]}]}, {"body": "seem to be right yeah", "score": 1, "replies": []}]}, {"body": "So are we buying Teslas dip or not?", "score": 1, "replies": []}, {"body": "Since when other vaccines can make you sick of covid?", "score": -1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}, {"body": "Down 13% just today, nice write up!", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "The real rise will come when the EU approves the vaccine. There is a meeting on the subject on December 16. The vaccine could get a recommendation to be approved on that day and gets the full approval shortly later. Then, Novavax just needs to say something like \"no delivery troubles\" and the price will go to the moon.", "score": 2, "replies": []}]}, {"body": "Solid DD. I've been long on this since February and buying every dip. I'm even deeper than you on $NVAX.", "score": 1, "replies": []}, {"body": "👍", "score": 1, "replies": []}]}
