{"title": "Palantir Technologies (PLTR): What's it worth? \"Warren B\" Analysis", "selftext": "Happy Holidays Friends! Here's my analysis on one of the most discussed and misunderstood companies over the last year. As one of the [Paypal Mafia](https://en.wikipedia.org/wiki/PayPal_Mafia)'s creations, Palantir Technologies (\"Palantir\", \"PLTR\" or the \"Company\") originated from fighting fraud at Paypal using in-house analytical tools and human analysts to interpret big data. Paypal Mafia companies have performed well to say the least, including Tesla, LinkedIn, Yelp, YouTube, and others. Hopefully this post will help you determine whether you think PLTR will end up in the same conversation.\n\n**Company Overview**\n\nPalantir Technologies, Inc. builds software platforms for institutions. The Company operates through two segments, Commercial and Government. The Company has built two software platforms, Palantir Gotham and Palantir Foundry. The Gotham software platform is constructed for analysts at defense and intelligences agencies. It enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, and helps the United States and allied military personnel. The Foundry software platform creates a central operating system for organization’s data where individual users can integrate and analyze the data. \n\n*Palantir analyzes big data and uses software to gather and process information that can identify connections, patterns, and trends. The main purpose is for organizations to make better decisions.*\n\n[Summary of software platforms](https://imgur.com/a/EITlahN)\n\n[Go-To-Market Strategy & Select Customers](https://imgur.com/a/PBbxckm)\n\n[Financial Snapshot](https://imgur.com/a/T4OqJgH)\n\n**Key Management**\n\nAlexander Karp, CEO/Co-Founder\n\nPeter Thiel, Chairman/Co-Founder\n\nStephen Cohen, President/Co-Founder\n\nShyam Sankar, COO\n\n**History**\n\n* Paypal dealt with credit card fraud and created software to identify suspicious activity on their platform\n* Peter Thiel challenged Alexander Karp and Stephen Cohen to engineer a system to identify terrorist networks and financial fraud\n* The Company believes their software can stop terrorist attacks, discover new medicines, gain an edge in financial markets, etc.\n* In 2020, Palantir went public via a direct listing at a $16.0B valuation\n* The Company plans to continue its growth domestically and internationally, but also across segments into the commercial space\n\n**Total Addressable Market**\n\nPalantir believes its total addressable market (TAM) to be approximately $119.0B, accounting for all countries and companies where it is willing to sell its software. This estimate is arrived at by multiplying the number of potential customers ($56B, 6,000 commercial companies with over $500MM in revenue) and Government agencies that align with liberal democracies ($63B)\n\n**Preliminary Risks**\n\n* Security risks related to Government customers and information leaks that could damage the Company’s reputation\n* Customer concentrations: The top 20 customers represented 61% of 2020 revenue; The top 3 customers accounted for 25% of 2020 revenue. Existing customers account for a large portion of revenue and therefore any termination of contracts may have a substantial impact on revenue\n* AI and Big Data are relatively new industries with intense competition\n* Customer contract terms and agreements. The majority of contracts may be terminated by the customer at any time\n* Potential decline in US or other Government budgets, spending, priorities that may cause delays or unrealized value of customer contracts\n* High revenue growth trajectory may be unsustainable given sales efforts and seasonality in projects or budgets\n\n**Q3 Results & Commentary**\n\n* Revenue increased by $102.8 million, or 36%, for the three months ended September 30, 2021 compared to the three months ended September 30, 2020\n* Revenue from Government increased by 34% and Commercial increased by 37% from Q3 2020\n* Cost of Revenue decreased by 42% for Q3 2021 compared to Q3 2020\n* Sales & Marketing expenses decreased by 54% and R&D expenses decreased by 70% from Q3 2020\n* Palantir continues to see high growth, expecting 30%+ revenue growth for 2021 and the next four years through 2025\n\n**Income Statement Projections / Assumptions** [(here)](https://imgur.com/a/rFsBecz)\n\n* Sales: 30-40% growth per year 2021E - 2024E, 10-20% growth per year 2025E - 2030E\n\n*Additional Commentary:*\n\n1. Conservative estimates based on the Company’s 2021 Revenue Guidance of 30%+ through the next four years\n2. Average customer revenue was $7.9MM in 2020 and $7.0MM in LTM 9/30/21 Palantir benefited from increases in Government budgeting and spending, and growth in commercial customers\n3. Covid-19 resulted in more contracts in healthcare, including a contract with the Centers for Disease Control and Prevention\n\n* Gross Margin: 77.5% - 82.0% as a % of Sales 2021 - 2030\n* EBITDA Margin: Expansion from (28.4%) - 52.8% as a % of Sales  2021 - 2030\n* Depreciation & Amortization: In line with historicals\n* Interest Expense and Other: Palantir paid down its debt in 2021\n\n**Discounted Cash Flow Analysis** [(here)](https://imgur.com/a/3LEjm6t)\n\nPLTR doesn’t have any debt as of 9/30/2021\n\n* Estimated Equity Value based on 9/30/2021 10-Q Balance Sheet\n* Weighted Average Cost of Capital based on conservative estimates for cost of equity given the uncertainty of cash flows and industry risks\n* Cost of Equity: 10.0%\n* Terminal Value Growth Rate: 3.0% based on US GDP estimates\n* Enterprise Value: $30,130.7MM\n* Equity Value: $32,613.8MM\n* Share Outstanding (in millions): 1,906.59\n* ANALYST ”Street”  CONSENSUS ESTIMATED SHARE PRICE: $25.00\n* BASE CASE ESTIMATED SHARE PRICE:  **$17.11** \n\n**Outlook & Final Thoughts**\n\nBased on these growth expectations and dilutive effects of stock based compensation, Palantir is **slightly overvalued/fairly valued** at **$18.93 as of 12/23/21 close**. This may change  in the future given the variance in the Company’s cash flows, growth prospects, research & development, new products, average revenue per customer, compensation structures, and overall industry growth. \n\nI personally like PLTR as a long term portfolio hold because of **two main reasons**. First, I believe in **Alexander Karp as a founder and his vision**. You can see his passion for the company and its product. Palantir doesn't have a sales team and solely relies on developing world-class products to attract customers. Secondly, the **total addressable market size is massive**. Although Palantir is a B2B model, I believe they can eventually compete with companies like that of salesforce or other enterprise platform systems. Lastly, I will add that the #1 risk to equity holders is the dilution of shareholders through stock based compensation; however, it is likely to diminish in future years and should be treated as an \"expense\" for acquiring talented employees. I'd recommend watching Alex Karp interviews and Palantir's YouTube videos for more information.\n\n*Sources:  Palantir Technologies, Inc. 2020 10-K Annual Report (SEC Website), Palantir Technologies, Inc. 3rd Qtr 2021 10-Q and Investor Presentations, Palantir Technologies, Inc. 2020 Annual 10-K and Investor Presentations, Palantir Technologies, Inc. Company Website, including events and presentation, Financial Data sourced from Google Finance, Yahoo Finance, WeBull Desktop Platform*\n\n*Disclaimer: All information is expressed as my own thoughts and opinions. Please do your own research and invest safely!*", "id": "rpcfni", "created_utc": 1640572375.0, "score": 68, "upvote_ratio": 0.67, "num_comments": 75, "comments": [{"body": "[deleted]", "score": 78, "replies": [{"body": "Warren Boffet, distant cousin.", "score": 85, "replies": [{"body": "Warraine le Bouffant, comte de Omaha, his French cousin.", "score": 7, "replies": []}]}, {"body": "TAM can be the most overrated bull analysis - might as well put an infinite symbol beside it", "score": 8, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "They'll do well when the Apocalypse comes.", "score": 2, "replies": []}]}]}, {"body": "All fair points. I'm truly a fan of Buffett & Munger, but added to the title as clickbait.", "score": -91, "replies": []}]}, {"body": "_Tell me you are a bag holder in a 500-word essay_", "score": 124, "replies": []}, {"body": "That’s a lot of work to say tree fiddy", "score": 40, "replies": []}, {"body": "OP is a baghholder. His other DD is CRSR, another hype stock that saw its share price cut by half", "score": 30, "replies": [{"body": "Another is BFLY on July 1st (though the content of the post is deleted) with title \"BFLY - Close to Flying Higher - Fundamental/Technical Analysis\" and it is 50% down since then.", "score": 7, "replies": []}]}, {"body": "I am slowly amassing a sizable number of shares with a 20-year horizon.", "score": 27, "replies": [{"body": "you gotta pump those number up! I'm a bagholder for 50 years", "score": 1, "replies": []}]}, {"body": "Palantir is the CIAs baby, it will only go up!", "score": 34, "replies": [{"body": "Haha, this is also a point I overlooked. It is like the Boeing of software.", "score": 6, "replies": [{"body": "hahaha. exactly. 1 or 2 contracts not getting renewed or a software flaw or hack could bring a sudden hard crash at any time.", "score": 3, "replies": []}]}, {"body": "Bullish. Idk those secret gov contracts are easily won by large incumbents so I think they will keep doing well.", "score": 1, "replies": []}, {"body": "I’m not as sure about that. I feel Palantir was always about getting the data. It’s been heavily diluted and military contracting is a cut throat game. Plus it has very questionable human rights practices and questionable motives \n\nhttps://www.trtworld.com/magazine/israel-linked-cia-funded-palantir-goes-public-making-espionage-mainstream-40230\n\nhttps://www.bloomberg.com/features/2018-palantir-peter-thiel/", "score": -6, "replies": [{"body": "Questionable human rights sounds like a great indicator for being repeatedly contracted by the US governmwnt", "score": 23, "replies": [{"body": "Bullish.", "score": 8, "replies": []}]}]}]}, {"body": "Palantir is a 2020 speculative trash play. Invest in a real companies (mutual fund or blue chips) and not these Ark-ish garbage plays.", "score": 17, "replies": []}, {"body": "Tell me you are a bag Holder without telling me you are a bag Holder.", "score": 9, "replies": [{"body": "I don't think bag holders would be saying a price of $18/share is fair valued when they likely bought in at 30+.", "score": 15, "replies": []}]}, {"body": "I'm a little dumbfounded... you took the time to write this up while not knowing Palantir is an In-Q-tel company? Or mentioning it? Your write up makes it sound like it was somehow a spinoff of Paypal.\n\nThey also have a large sales team now...\n\nI mean im bullish on Palantir, its one of my core holdings, but if you're going to write something up... Do your DD o.o?", "score": 13, "replies": []}, {"body": "@OP that’s not entirely correct they do have a sales team go on the career portal.\n\nThey are hiring for US/international commercial sales and also hiring content creators to market for them domestically and internationally\n\nThey now have ads on YouTube/Twitter and continuing to aggressively send out marketing materials everywhere.\n\nI’m a shareholder.", "score": 6, "replies": []}, {"body": "Thoughts on stock dilution?", "score": 5, "replies": []}, {"body": "This kind of analysts like the OPs do well on WSB not here. How come Palatir doesn't have a sales force when they only have multi milion dollar contracts ? I can only imagine the CIO of a bank calling up their contact line and asking for somebody to come take their money. Own a bit of their stock myself as I bought into the hype, then I realized no vendor that hasn't got a strong technical community behind it has ever succeded in the market. There are many products in the development, DBs, cloud space that are pretty good but almost nobody is using so companies are struggling.", "score": 11, "replies": [{"body": "Just read Peter Thiel’s book Zero to One and he says the contract value is so high, customers basically want to talk to the CEO, not to some sales guy. Although I kind of agree with you, seems like it would be better to support the CEO in that function.\n\nTo your other point, that is fair. I’m a developer myself and the other company I most naturally compare PLTR to is Snowflake which is a sort of data warehouse solution. As a developer, I better understand buying Snowflake. However, using Snowflake presupposes technical expertise and a data engineering team to support the infrastructure for data analysis and science. And also an environment conducive to hiring all that talent. For technical startups, snowflake probably makes more sense. They are presumably technically competitive and can hire the necessary talent. Where PLTR makes sense to me is when I look at more “backwards” companies or government agencies who are very unlikely to compete for the technical talent needed to catch them up to being able to participate in the modern tech / data ecosystem. And this seems to be exactly what PLTR offers. Super expensive, full service data infrastructure to government agencies and enterprise companies.", "score": 2, "replies": [{"body": "What do you think PLTR will be worth in 5-10 years ? Do you think it is worth at least 30 billion ? I'm thinking about going in heavily if it reaches below $10 per share but i can't seem to build enough conviction to go in just yet. I have been compiling a list of comments and posts from people like yourself who work in the industry to help me get a better picture. just saved yours. Thanks.", "score": 1, "replies": [{"body": "Honestly I haven’t done the work to put a number on it. I have a small piece to catch some upside. And my main reason for holding is that PLTR is supposed to be peter thiel’s single largest public position.", "score": 3, "replies": []}]}]}, {"body": "By technical community do you mean a developer community?  Palantir's business model and product design seems to be such that there isn't and can't be a very strong technical community around it.  And yes I think this will limit them significantly.\n\nTheir primary source of revenue is consulting to build literally everything around the product that is needed to customize it for a use case and enable the customer to use it and get value out of it.  The customer team is meant to be analysts, not engineers.  Palantir provides the engineers.\n\nTo put it in Palantir's own words, they don't sell tools, they sell business outcomes.", "score": -1, "replies": [{"body": "The tech community is made out of individuals that poses hands-on knowledge in that specific technology and can act as evangelists by solving real company problems using it. Not only developers make the community as this is not an open source project, I consider anyone who knows it well enough and have used a technology to be part of it's community. To respond to someone who mentioned Snowflake, if you look it up on DB engine rankings you will see it doesn't even make it in top 10, yet the company grows like crazy. What makes it a success is that there is an active pool of tech guys working with it for more and more use cases. Meanwhile something like IBM DB2, no 7 in the rankings doesn't have anyone to keep expanding it, besides the banks and insurance guys working on legacy systems. When the fat contracts on mainframe will dry out, perfectly good tech will die out because nobody wants to get themselves locked in.", "score": 1, "replies": []}]}, {"body": "They do have a sales force. OP did very weak DD", "score": 1, "replies": []}, {"body": "Hiring 1000 sales reps now \nThis is going to be one huge year for Palantir", "score": 1, "replies": []}]}, {"body": "I'm long Palantir. Here are two caveats to the above.\n\n&#x200B;\n\n>Palantir doesn't have a sales team.\n\nPalantir uses embedded engineers. That is a sales team by proxy. As a shareholder, I don't mind.\n\n&#x200B;\n\n>Total addressable market size is massive.\n\nI don't disagree with this point but I'd like to see some independent / third-party views on this. Everyone's TAM is massive by their own account.\n\nFor myself, I see Palantir as a long bet on the government's inertia and conservatism when it comes to its contractors, especially those that are defence or intelligence adjacent and where the buyers are not as savvy with the complex product as the sellers might be. That is the one moat I see.", "score": 2, "replies": []}, {"body": "Nice read, but my biggest problem is Karp.  After their very first earnings release, his ranting in the Colorado snow turned me off.   I like seeing executive interview as it gives me a chance to gauge their honesty  and thoughtfulness.  I just did not get a comfortable feeling - he reminded me of hybrid of Jeff Immelt and Dennis Kozlowski - one destroyed GE and the other is in prison today.\n\nI will not invest unless it is near the IPO price \\~$8.", "score": 3, "replies": [{"body": "Just saw that 2020 call [https://www.youtube.com/watch?v=m1NcY\\_o8Xo0](https://www.youtube.com/watch?v=m1NcY_o8Xo0) 12mins in.\n\nI see what you mean....", "score": 3, "replies": [{"body": "There was another one after this on CNBC when they asked him about customer acquisition costs (they have been escalating) and he was all over the place.  He should have simple stated yes - we increased our sales force to get more customers but it was bad is all I remember.\n\nStill waiting until it hits $8 or he is gone before I review again.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Did not realize he got paroled, but it does not surprise me.  I still remember seeing him give a talk.  I was just starting my career in business development and went to seminar with a work colleague.  I was excited to see a Jersey street kid become successful.  After his talk, I still remember telling my work colleagu,  he was slimy.  My  worker colleague use to rib me about it until he as arrested.\n\nOn Immelt, shortly after 9-11, I saw a CNBC interview and they went over their head kissing his ass and saying how great he is handling the aftermath - patting himself on the back.  Luckily, shortly after, I sold  my GE stock.", "score": 2, "replies": []}]}, {"body": "Watch it again", "score": 1, "replies": [{"body": "Why", "score": 1, "replies": [{"body": "https://youtu.be/ZrUVF67-C_A\n$28 fair value", "score": 0, "replies": []}, {"body": "Karp is an acquired taste. It takes a while to get use to it", "score": 1, "replies": [{"body": "Not for me - i will stay away until he is gone", "score": 1, "replies": []}]}]}]}]}, {"body": "Very good read. Thanks alot. Am buying more before end of 2021 & will check it out @ 2025.", "score": 2, "replies": [{"body": "Appreciate it. I'm also DCA'ing into it over the next few months-years unless anything material changes.", "score": -4, "replies": [{"body": "Solid write-up and DCF analysis. Assuming cash flows come as expected, you are accepting the discount rate as your return (10%). Is that adequate compensation for the risk you are taking in your opinion?", "score": 2, "replies": [{"body": "It's an assumption I make for most of my models. I think its fairly conservative given the stage of the company and the risk free rate.", "score": 1, "replies": [{"body": "I didn’t question the assumption. The 10% discount rate is how you got to your fair value. Regardless of its accuracy, the implication of a stock being at or near fair value using that assumption is that if the cash flows materialize as expected, that is all the investor will earn as a return. So given your conclusion that the stock is near fair value using this 10% discount rate assumption, my question is whether you feel the 10% is adequate compensation for the risk?", "score": 1, "replies": [{"body": "I think 10% is adequate. I will say, that the company's main risk is its growth of customers and average revenue per customer. The growth assumptions here are high (shown in projection model image). If I were to adjust values to a downside case, PLTR would be worth closer to $12-$15/share.", "score": 1, "replies": [{"body": "Fair enough. I bought it last year when it was oscillating around $10 and sold in the low 20s during its meteoric rise. I can’t justify the valuation personally given the risk but cash flows could surprise to the upside and generate decent returns over the next 5 years. Good luck with the position!\n\nEdit to clarify: I personally would use a higher discount rate given the higher than average uncertainty in future cash flows", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "IMHO $22", "score": 1, "replies": []}, {"body": "All good but the stock is cursed. No matter how many good news there is about PLTR it reacts by dipping more. \n\nSource: I own more than I want to admit in PLTR and it's always been in the red for me. Would make for some good lossporn over att WSB.", "score": 1, "replies": [{"body": "I mean, it more that doubled in a year and you are still not happy. Patience", "score": 5, "replies": []}]}, {"body": "The only thing you forgot to mention is PLTRs crypto platform coming soon near a screen near you.", "score": 0, "replies": []}, {"body": "Warren B is a tool. Just as corrupt as any Wall Street Big bank / HF.\n\nThat being said, I like PLTR and I hope they do well.", "score": -23, "replies": []}, {"body": "Pltr is too complicated and too many people talk about it. While gotham and foundry sound super interesting i just dont know enough about it or where their moat is  so ill always avoid this one", "score": 1, "replies": []}, {"body": "The market has a love-hate relationship with Palantir. Just like Tesla. Remove all the noise and focus on growth. PLTR should see upward move this year in the range of 25-27. If it moves below, could go down to 11 before rebound.", "score": 1, "replies": [{"body": "This post was spot on", "score": 1, "replies": []}]}, {"body": "Honestly pltr below $20 sounds like a fair price to me", "score": 1, "replies": [{"body": "Why - at that price it's still about 40bln - **at 26 times revenue**.  Now, lets say it grows revenue without any recession or otherwise for the next 5 years at 30%. It  will still be - after 5 years - **at about 10 x revenue** \\- i.e.e still highly overvalued. You may say but the margins are so huge at 30% that it will be only on a 30 PE.  Whats the real margin, if staff where paid with money rather than printed shares?  All this boils down to say, at present - on the companies own 30% growth projections - the stock is looking very overvalued and could indeed half from here to $8 and still be very expensive!\n\nOne more thing...\n\nThere has been a LOT of money printed. Corporations and Government have been flush and LOVE spending money on ALL SORTS OF tech projects when the money is flowing and budgets have to get rid of the money. Shocking fact; Most companies are run for the benefit of management not shareholders! I remember 7 million being spent on a useless website called 'color' back in the '00 bubble for a insurance company - that literally was a webpage with colors on it and some corporate marketing BS which a kiddy could do in a day.  INSANE but perfectly sane to get some of the free money circulating on a useless project sanctioned which would benefit staff and waste the marketing budget.  Many here have not experianced a proper recession (Elon Musk predicts recession by 2023). Recessions hit tech companies ***SUPER-HARD***. The FIRST thing out the door is IT.  Consultants, projects, even good ones are ruthlessly axed and got rid off. You get the **inverse** of the proir overspending insanity as the pendulum overswings the other way. All those high $140k salaries goto ZERO. There is a flood of unemployed IT workers which swamp the market. Contracts are renegociated downwards.  It's so horrific to live through its's unbelieveable. I doubt PLTR shares will be unscathed if that occurs. \n\n'Scott McNealy was the CEO of Sun Microsystems, one of the darlings of that bubble. *At its peak his stock hit valuation of ten-times revenues. A couple of years afterward he had this to say about that time (via Bloomberg):*  \nAt **10 times revenues**, to give you a 10-year payback, I have to pay you 100% of revenues for 10 straight years in dividends. That assumes I can get that by my shareholders. That assumes I have zero cost of goods sold, which is very hard for a computer company. That assumes zero expenses, which is really hard with 39,000 employees. That assumes I pay no taxes, which is very hard. And that assumes you pay no taxes on your dividends, which is kind of illegal. And that assumes with zero R&D for the next 10 years, I can maintain the current revenue run rate. Now, having done that, would any of you like to buy my stock at $64? Do you realize how ridiculous those basic assumptions are? You don’t need any transparency. You don’t need any footnotes. **What were you thinking?**'", "score": 1, "replies": [{"body": "Do uk the saying when you want the answer to something on the internet you post the wrong answer? \n\nYeap i got it thanks,had been bear on pltr due to its share printing and pretty bad ebita", "score": 1, "replies": []}, {"body": "What is a solid valuation/PE based on your experience ? 5 time revenue or better? What companies today fit your criteria for good valuation. I'm genuinely curious because im a fairly new investor.", "score": 1, "replies": [{"body": "Do what Einstein did - a thought experiment - Think of buying a candy shop. It has 1 store and makes 1 million in sales and 300k profit (30%). Would you pay 10 million it?  (A p/s of 10) If you did Thats a TINY below inflation 3% profit to you at 10 times sales. Even though it's making a fantastic profit margin of 30% on sales. Notice the business is great, but the valuation is terrible! They are two seperate things!  \n\nFor nearly all of the SP500 history a P/S of about 2 was the average for a average company. Now it's about 3. P/S varies between sectors - growth gets a higher multiple, cyclicals like mining companies get lower multiples.\n\nGrowth gets a higher valuation due to compounding growth but like the example in my earlier post there are limits...  \n\nContinuing the thought experiment... you add inflation - you say to the seller, are you mad - inflation is 7% - so I want a return of 10% you say.... A P/S of 3.. Ultimately inflation crushes stock prices....", "score": 1, "replies": []}]}]}]}, {"body": "Worst crap I read in a while.", "score": 1, "replies": []}, {"body": "$28 share base value", "score": 1, "replies": []}]}
{"title": "Be Greedy When Others are Fearful, and be Fearful when Others are Greedy", "selftext": "This is one of the most common quotes that people re-iterate throughout the stock market today. So why is it that virtually no one in this sub follows these tenants in the stocks they like. With companies that are high fliers, pushing insane valuations, and everyone is greedy, ex. NVDA, AMD, TSLA, etc. these are some of the most common names for what investors want to buy. Doing the opposite of this quote that we can all agree throughout history has proven to be true. \n\nOn the other end, with stocks like BABA, INTC, etc. everyone in this sub fucking hates them and wouldn't touch them with a 20 foot stick, even when everyone is being fearful. \n\nReally makes you wonder how so many people can preach this saying and constantly remind others of it but not follow it themselves.", "id": "rpgp7q", "created_utc": 1640585988.0, "score": 19, "upvote_ratio": 0.59, "num_comments": 78, "comments": [{"body": "Many know it, and spread it, but very few are capable of applying it on their specific context. And that is the reason why this quote is so powerful and so true.", "score": 30, "replies": [{"body": "The quote means nothing.  It can be retroactively applied to any situation at any time anywhere.  It is simply a manifestation of investors’ anxiety.  It’s not very helpful to be constantly second guessing yourself.  More money is made on strong hands than from weak hands.  Conviction is a more important tool than constant self-doubt.", "score": 15, "replies": []}]}, {"body": "The quote doesn't mean to blindly go against the grain like an idiot.", "score": 77, "replies": [{"body": "I fell personally attacked.", "score": 9, "replies": []}, {"body": "This quote is like a horoscope. You see what you want to see. You will always find people being greedy at the same time people are fearful. It's supposed to be about seeing through irrationality, and there are plenty of rational reasons these stocks are selling off.", "score": 11, "replies": []}, {"body": "Yea otherwise people would've bought NKLA @20 lol, which I'm sure some idiots did.", "score": 1, "replies": [{"body": "there's a different between companies like NKLA and companies like INTC and BABA, kinda a shit comparison ngl", "score": 2, "replies": [{"body": "Dumb dumb, it was not a comparison to BABA, it was a response to the commenter above. The point you made about buying when the fear is high should not be blindly used when people legitimately avoid certain dogshit companies like NKLA for example... Get your head out your ass and lossen the grip of those bags your holding. Taking offense when I'm not even talking to you lol", "score": 8, "replies": []}, {"body": "And there's a difference between INTC and BABA. One of them is a company located in a dictatorship where the government could just decide to pull everything out of the US market at any time. So I'm not even sure why they are bundled together.", "score": 2, "replies": []}]}]}]}, {"body": "Be fearful when your portfolio is down 60%", "score": 35, "replies": [{"body": "i'mma be greedy when your portfolio is down 60%", "score": 15, "replies": []}]}, {"body": "Cause it's easy, buying the things everyone else buys. Being Greedy when others are fearful is insanely difficult. It goes against our emotions our instinct. It makes us nauseous to go against the grain. In the past being an outsider meant death, and if you are a portfolio manager it often means death in the industry. \n\nBuying the \"unliked\" companies is hard when you an individual investor and even harder when you are an institutional one. It can take years for your strategy to work out in which you either are left without a job, or have thrown the towel yourself. So yeah. It's just to hard.", "score": 10, "replies": [{"body": "If you understand fundamentals and get WHY that stock is down 40 percent , you would alleviate that fear and do one of two things - sell because the fundamentals are awful and not much hope of a recovery OR you will be grateful because your stock went on sale and buy more.  It really isn’t difficult.  A simple example are the cruise stocks.  When country shit down for covid, RCL dropped from over $100 to\nI think $19.  Did anyone really believe the world was coming to an end? That the cruise industry would never recover ?  I doubt it - but panic ensued.  Everyone ran to the exits.  Airline stocks etc plummeted .  Unless you were foolish enough to trade stocks using margin you couldn’t cover, it was a great op to pick up some quality stock at cheap, cheap prices.  Fortunes were made and lost.  The impatient were the losers , they usually are.", "score": 1, "replies": []}]}, {"body": "Will people learn how to valuate a stock and realize that AMDs PEG is 1.2. Intel's trading at a 11 PE because its not growing (actually shrinking). AMDs is at a 50 PE but its PEG is still cheaper than Intels. Yeah... AMD is growing EPS at over 100 percent forward and Intel is projecting a loss. Just stop. I can go on and on... AMD growing cash flow at 96 percent and Intel at 6 percent.\n\nChinese companies have taken a haircut because their valuations incorporate the CCP and the upcoming standoff when Chinese companies need full transparency of their books or get delisted.\n\nThere is no fear, these companies are poor investments. Plain and simple.", "score": 23, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "> Hell no, chip shortage will eventually ease and supply will outpace a cooling demand, wich will bring prices down.\n\nCooling demand for semiconductors in this day and age? Umm.... not so sure about that Tommy boy.", "score": -1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Hasn't this shortage been restraining growth as opposed to boosting it?", "score": 0, "replies": []}]}]}]}, {"body": "Well its much easier to grow when you got very little revenue, INTC has 80 Bn of revenue meanwhile AMD has 18 Bn, AMD is growing very fast but the question is if they can keep growing at that speed when they start reaching 70-80 Bn of revenue. Remember these two companies are basically valued the same...\n\nAnd dont get me started with profits, INTC has steady profits of 23 B while AMD has 3 BN, they would need to double their profits for 4 years straight to match INTC. That is no easy task to do.", "score": 4, "replies": [{"body": "How much did Apple and Microsoft grow revenue this year? The argument that trees can't grow to the sky is being proven wrong. You would think with more financial resources, Intel should have the leading R&D... Intel has under performed the entire semiconductor industry. Not just in metrics, but in tech. Intel hasn't executed and will remain dead money.", "score": 2, "replies": []}]}, {"body": "For comparison what do you consider a good investment at current prices, if anything?", "score": 1, "replies": [{"body": "Google, Facebook, Builders FirstSource, Scotts MiracleGro, Crocs, AMD, Diamondback. If you are actually looking for \"value\" stocks, id goto healthcare. Abbvie broke out to a 5 year high recently. I haven't bought anything new since May. Ive added in October to positions. I will add again when the market has a correction in q1.", "score": 3, "replies": []}]}]}, {"body": "People like to quote these things then do the opposite when it involves their own money. Some of these stocks do like a bounce in the past such as AMD. So if you have spare cash then buy on the bounce which is how I usually enter a position.", "score": 3, "replies": []}, {"body": "Nvidia is poised to do what Intel and Cisco did in 2000. It's not their fault, great company, just terribly overvalued. Who buys a mature pure-play semi stock for 110x 2021 earnings? Top line growth is only expected to be 15% for the coming 5 years. Bulls will be holding the bags on this one for years to come, and it'll be mostly retail stuck with their $325 nvidia shares. It's a shame but people only buy stories these days.", "score": 16, "replies": [{"body": "How much of the stock market is numbers and how much is sentiment? If there's one thing I've learned it's that the market is irrational. A stock could stay overvalued for so long that if you waited for it to come down to it's fair value to buy it you would miss out on huge gains.", "score": 2, "replies": [{"body": "Then you're relying on an everlasting bullmarket to increase marketwide irrationallity which is a terrible way to invest. Furthermore, nvidia isnt \"just\" overvalued, it could drop by 50% and still would be overvalued.", "score": 1, "replies": [{"body": "I'm not relying on anything. I'm just looking at the whole situation and then I do what I think will make me money. Buying Nvidia at this price should be carefully considered based on your own risk tolerance. Sure, it could drop 50% but it could also make 10% returns in a week. If your risk tolerance is low, then just avoid it.\n\nYou are assuming that everybody here is an investor. This is r/stocks, not r/investing. So you will find investors but also day traders and swing traders and even people doing a little bit of everything. And everybody will have different risk tolerance.", "score": 1, "replies": []}]}]}, {"body": "exactly, every time I even speak about my hatred for the STOCK, not company, people get so mad and viciously attack me. Ridiculously overvalued.", "score": 6, "replies": [{"body": "Forward P/E of 57.   Given growth and profit margins and there market dominance, hard to hate it too much.", "score": 3, "replies": []}, {"body": "I'm in the same boat own and use their products and love them. Would reccomend the product all day. Just not the stock.", "score": 1, "replies": []}]}, {"body": "Well you're gonna be wrong. If anything, the market has consistently underpriced high growth tech for the past 10 years.", "score": 2, "replies": [{"body": ">.\n\nyou mean the largest bull market of all time the happened in the last 10 years?", "score": 0, "replies": [{"body": "Everyone spouts this line without actually thinking about the cause and effect at play here.\n\nDid the bull market cause tech to flourish? \n\nOr did tech flourishing result in the bull market? \n\nI do think it was a bit of both, but mostly the second point.", "score": 2, "replies": []}]}]}, {"body": "People like you said the same thing in 2016, yet it’s up 10-fold since then. Nvidia’s traded at a premium for this long for a reason.\n\nAlso citing growth estimates for 5 years from now is extremely foolish. Markets only look forward one year for a reason.", "score": 2, "replies": []}, {"body": "Absolutely agree with you. I'd be interested in Nvidia if it ever dropped to $130(ish) though.", "score": -3, "replies": [{"body": "Won't happen unless the whole market crashes hard or they make another split.\n\nCompany that's literally expanding into more fields while also dominating the GPU market (90%+ market share) literally selling all they can produce at ridiculous prices (and scalpers re-selling their shit for twice as much or more and finding buyers anyways)? Yeah, they're gonna keep growing.\n\nTech is growing, there's a lot of market to take, GPU sales are at record numbers and will only keep growing (more and more things are using them), gaming is gonna keep growing, and it's not just GPUs...", "score": 1, "replies": [{"body": "Yeah, but this is the issue.  We know they are doing well, we know they are getting good margins, and expanding as well…\n\nBut they are already pretty mature, and you are paying $100 per $1 of earnings today.  Even at a good expansion, Nvidia may not make those earnings back in your investment lifetime(30-40 years).    Now, that a not a metric that matters, and the business could be more powerful in 40 years anyways, but it’s a different way to think about it.  You wouldn’t open a pizza shop on the corner if you only regained your initial capital after 40 years.  That’s a high valuation.", "score": 2, "replies": []}]}]}, {"body": "Yeah. Mamma Cathie sold it all in her funds. Very overvalued but a great company.", "score": -7, "replies": [{"body": "NVDA P/E was in the 60's last year.  So waiting to buy you would have missed so huge gains.  That company has some of the best growth profit metrics there is.", "score": 5, "replies": []}, {"body": "Yeah because she certainly cares about valuation.", "score": 4, "replies": []}]}]}, {"body": "I stay away from NVDA, AMD and TSLA because they are overpriced and I am not willing to jump in just to hold bags. The companies are great, the stocks are far from it.\n\nBABA is more risk than it is worth. I rather bet my money on company's fundamentals than on the CCP's mood.\n\nI am invested in INTC as it is extremely underpriced right now.\n\nBut that quote doesn't mean to blindingly jump out of stocks where people are greedy or into stocks where people.are fearful, there are reasons for both.\n\nI invest in INTC because of the DD I've done and not because people are fearful.", "score": 4, "replies": []}, {"body": "I never read that quote as applying to a particular stock or company but rather to the market broadly. I don’t think it works at the individual stock level.", "score": 4, "replies": []}, {"body": "I’ve always thought of this quote in context of the market in general, not specific stocks", "score": 2, "replies": []}, {"body": "Talking about the overall market , like 3 days ago when the market was fearful and now when it’s greedy pushing ath again", "score": 2, "replies": []}, {"body": "Tbf about you listing $BABA as a stock everyone hates, that’s one I wouldn’t touch with a barge pole anyway because the CCP has too much control over it", "score": 2, "replies": []}, {"body": "That's why i hold Baba, Tencent and Meta. You got to do your dd and invest your money where the opportunity is. When everyone rushes to get out is when you should be looking to get in. There is a smaller chance of Baba being delisted than it is of Tesla stock crashing down in the next few months/years", "score": 3, "replies": [{"body": "Hahahahaha. I can assure you this will not age well", "score": 1, "replies": [{"body": "Sure. We'll see in 10 years", "score": 5, "replies": []}, {"body": "Cuz ccp bad and usa good right? Reddit is so patriotic for stocks its fucking weird. Everyone lost money on chinese stocks and then decided its the worst investment ever.", "score": 1, "replies": []}]}]}, {"body": "Buy quality companies when others are fearful. Don’t buy shit companies or unquantifiable risk just because the price is beaten down. \n\nIf you’re buying BABA you’re in the casino. You cannot quantify the likelihood of CCP intervention destroying the value of your investment one way or another. \n\nIf you’re buying Intel, I don’t think people are ‘fearful’, the stock is probably fairly valued right now.", "score": 2, "replies": []}, {"body": "AAPL, MSFT, GOOGL, AMZN, TSLA, FB: how many do you know who don't want to currently invest it these companies?\nThey are considered safe heavens.\n\nWhy? Minimal capital required, max earnings and monopolist.\n\nThis only politics can end.\n\nThose are the most popular, first then NVDA comes at 8. (Aramco I left out..)", "score": 1, "replies": [{"body": "TSLA safe haven...", "score": 5, "replies": []}, {"body": "Minus FB", "score": 2, "replies": []}, {"body": "I see your point, but I wouldn’t put TSLA in the same category as the others.", "score": 2, "replies": [{"body": "I just took the largest market cap companies. They are all profitable and monopolistic (\"meat\").", "score": 1, "replies": []}]}]}, {"body": "Intel chips are old school. Its ARM chips from now on. I would not invest in Intel at this point. Baba may be. But I hate Chinese stocks.", "score": -1, "replies": [{"body": "Have you actually done DD on Intel? I suggest you go and do some homework about Meteor Lake and what it will contain in rumored Q2 2023 release.", "score": 3, "replies": [{"body": "I can bet my money on it. I will short it and you can go long. Lets see….", "score": 1, "replies": [{"body": "Go for it. I am already going long.", "score": 1, "replies": []}]}, {"body": "Conveniently ignoring intel has had delays for damn near everything they've done recently. While also missing estimates. Amd what does it say about management that they were so woefully unprepared for this economy when they came from a position of power in the industry.", "score": 1, "replies": [{"body": "For everything they've done recently? Like what? Alder Lake released exactly on time, Alchemist will release on time as it is ready and only thing being worked on now are the drivers.\n\nName one thing Intel delayed since Pat Gelsinger. On top of that, all products are ahead of schedule according to him in the last earnings call.\n\nWhat estimates were missed? You mean revenue? By 100mil out of $18.1B quarterly revenue? You've got to be joking. They constantly beat EPS estimates, last quarter they beat the estimates by freaking 54%.\n\nIntel is unprepared? Intel might release about 500k Alchemist GPUs at launch. You really need to do some DD as well, you seem to think previous management is currently management.", "score": 2, "replies": []}]}]}]}, {"body": "Well those two companies are shit. Baba you dont know what will china do to them and Intel is lagging behind.", "score": 0, "replies": []}, {"body": "Shut up u fat lard", "score": -2, "replies": []}, {"body": "Because it s not true", "score": 1, "replies": []}, {"body": "I always see people quote that shit when we are at an ATH, and a small group of people see a correction. The others the quote is talking about isn't the minority. It's all those FOMOers that pump a stock to an ATH. \n\nThat quote has only been relevant once these past 10 years. (When sticks dropped at the start of the pandemic)", "score": 1, "replies": []}, {"body": "NVDA is expanding its gpu applications into several segments. DataCenters being the latest. AI/ML requires gpu...so this will continue strengthening their share of revenue. Bitcoin miners use gpu, so do gamers...which brings us to what is fair value for this stock. I believe its below 200 and mostly around 190. Lets see what next year brings in terms of revenue growth.", "score": 1, "replies": []}, {"body": "I followed the advice, buying AEROMEX a Mexican Flights Company that it’s going bankrupt I bought shares at 1 MXM and now it cost 3 MXN literally 200% Gain", "score": 1, "replies": []}, {"body": "this quote only works on stocks people have conviction in\n\nWarren Buffett, Ron Baron, Cathie Wood and others know how to do the proper research to have conviction on a stock. Probably 0.1% of people on r/stocks has actual conviction on a stock.", "score": 1, "replies": []}, {"body": "It's general advice no different from \"buy low sell high\". That is it say, context matters and general advice like that can't help you in specific situations.", "score": 1, "replies": []}, {"body": "The people that post here represent the crowd.  Also, our current market is overwhelmed with liquidity because of the Fed. Prices are detached from reality, so momentum and hype really are what you should have been doing for the last 4-5 years.", "score": 1, "replies": []}, {"body": "The quote is mainly implied when most fundamentals are still intact but the price is going down. BABA and etc you listed, tell me if the fundamentals are intact. Confidence in a company is huge, and Chinese stocks suffer from the hands of the CCP. Prior to the covid correction, their P/E ratio has always been lower than any company in the sector even though their financials are insane. So you just have the understand this quote before you think it’s just blindly applied to everything. \n\nIf your mechanic says your car needs an oil change everytime you hear a squeal doesn’t necessarily mean you tell people that when their car is squealing it needs an oil change. You need to understand just more than what you’re told. Understand the scenario and context. Watch a couple of buffet’s seminars, and you’ll understand why people aren’t touching those stocks.", "score": 1, "replies": []}, {"body": "People take these quotes too literal and therefore out of context. Employing this strategy literally over the last 7 years would have been the worst strategy possible, as it would have meant not being invested in Big Tech. \n\nI interpret the quote as *'Be greedy in a stock you truly believe in when others are fearful for reasons that do not impact the underlying business and its fundamentals, and be fearful when others are greedy in a stock that you don't believe in'.*", "score": 1, "replies": []}, {"body": "I follow the “kids @ on stock twits and Reddit now.  For whatever reason, fundamentals don’t not seem to matter to a lot of them .  I have solid core positions but I must say there is $ to made short term by watching the meme stocks.  In the long run, they will lose.", "score": 1, "replies": []}, {"body": "It’s not just as simple as whether or not a stock is expensive/cheap based on fundamentals alone.  If we’re gonna throw around quotes like they are truisms, then here’s another quote: “Never invest in companies that you don’t understand.”  There’s a reason that INTC and BABA are cheat right now.", "score": 1, "replies": []}]}
{"title": "Puts on TSLA - What's your long-term strategy for when the Master Con Artist gets dethroned?", "selftext": "Are you holding puts on TSLA for the long term?With TSLA once more skyrocketing, I wonder what's the best strategy for holding puts and minimizing costs in the long term (I'm thinking of gambling 30k in puts over 3 years period)Do you buy near-expiration cheap puts and let them turn to dust?Or buy long-term puts, and roll them as TSLA increases and theta eats the put's value?\n\nPS: if you don't believe Musk is a conman, and will soon fall, there are some interesting articles which might change your mind:[https://www.dailymail.co.uk/sciencetech/article-9347989/Leaked-emails-Tesla-says-Self-Driving-beta-remain-largely-unchanged.html](https://www.dailymail.co.uk/sciencetech/article-9347989/Leaked-emails-Tesla-says-Self-Driving-beta-remain-largely-unchanged.html)[https://mansionengineer.com/2019/02/04/elon-musk-tesla-and-the-solar-roof-tile-fraud-update/](https://mansionengineer.com/2019/02/04/elon-musk-tesla-and-the-solar-roof-tile-fraud-update/)[https://www.youtube.com/watch?v=-eS4p-14l2I](https://www.youtube.com/watch?v=-eS4p-14l2I)", "id": "rpuymn", "created_utc": 1640632750.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 85, "comments": [{"body": "First seen: 36 seconds ago", "score": 24, "replies": []}, {"body": "Burry is that u bro?", "score": 59, "replies": [{"body": "He didn’t even call Musk a fraud just called the stock overvalued, which Musk also did lol.", "score": 12, "replies": [{"body": "Ok", "score": 0, "replies": []}]}]}, {"body": "Just a reminder- nikola and Tesla are not the same company, you may have them confused", "score": 19, "replies": [{"body": "But they were the same person?", "score": 6, "replies": []}]}, {"body": "Never bet against Elon. Learn from the other hedge funds/institutions who lost billions. Good luck!", "score": 33, "replies": [{"body": "Don’t hold $Tsla myself but I sure wouldn’t bet against it. That’s pure gambling buying puts. Listen to this guy.", "score": 5, "replies": [{"body": "The stock literally has a life of its own and will break out and impale you.  note well: NFA", "score": 4, "replies": []}]}, {"body": "So you’re saying if Elon musk were to die tomorrow then the stock would tank? \nSounds like a very bad investment", "score": 1, "replies": []}]}, {"body": "You get your info from the Daily Mail?  You belong here", "score": 29, "replies": []}, {"body": "Not even Nancy Pelosi buys puts on Tesla.", "score": 42, "replies": []}, {"body": "I can save you 3 years of work, just send me the 30k", "score": 21, "replies": []}, {"body": "Damn did Elon hurt you that bad🥺", "score": 29, "replies": [{"body": "He got buttrape", "score": 2, "replies": []}]}, {"body": "2 things you shouldn’t do. Jerk off in public and bet against Elon.", "score": 21, "replies": [{"body": "I disagree with some of that statement", "score": 17, "replies": [{"body": "I don’t bet Elon either", "score": 1, "replies": []}]}, {"body": "Even the first one is a better idea.", "score": 2, "replies": []}]}, {"body": "When will women and rappers realize that diamonds are just rocks?\n\nSame concept.", "score": 18, "replies": [{"body": "Or that tulips are just flowers? Same co.. Oh, wait", "score": 1, "replies": [{"body": "Gonna be hilarious in 10 years reading this in the history books. \"At one point TSLA had over 50% of the auto market cap while having less than 2% of the sales. The founder sold 20% of his shares and even that barely put a damper on things.\"", "score": 1, "replies": [{"body": "\"people back then were total retards but now we know much better of course\" 😅 we'll see.. Or elon becomes world emperor and justifies that value eventually", "score": 1, "replies": [{"body": "My valuation for TSLA if they gain a monopoly on global car sales is around 2500... sooo yeah we're pretty close to that.", "score": 2, "replies": []}]}]}]}]}, {"body": "Bros only source was the daily mail which is one of the only newspapers Wikipedia won’t let you use as a source because it’s full of shit", "score": 6, "replies": [{"body": "Don't be ridiculous, he also cited a youtube video!", "score": 2, "replies": [{"body": "I didn’t see the YouTube video. Damn, maybe he does have a point!", "score": 1, "replies": []}]}]}, {"body": "Seen too many posts like this on TSLA and others to count.\n\nYou are confusing your ideas of what is ‘right’ with what makes a good trade. Same as people who buy puts on AAPL because they think iPhones suck. It doesn’t work. When the stock acts weak, bet against it. Until then it’s just 💰 and 🔥", "score": 15, "replies": [{"body": "No one thinks iPhones suck. That was in 2007 and they were blackberry users.", "score": -2, "replies": [{"body": "I think they're horribly unintuitive. It's one of the few pieces of electronics I have to Google how to do basic functions when I received one for a work phone. Also, it's laughable the 'features' they come out with that other phones have had over a decade; pop up screen, split screen, a back button at the bottom (iPhone yet to release this feature 😅), so on. Even setting an alarm on an iPhone is stupid; why do you have to spin the dumb dials without the ability to type the time in lmao. It's so many little things like this, and large problems like safari being a horrid phone browser, than make the iPhone a POS to me.\n\nThat being said, AAPL to the moon.", "score": 4, "replies": [{"body": "It’s because there are literally hundreds of functions. \nI’ll bet you also have to google things about windows, or chrome, or what the error code on your dishwasher means. \nOut of all the smart phones on the market, the iPhone is by far the most superior", "score": 1, "replies": [{"body": "Yeah but an error code on a fridge or washing machine isn't designed to be easily understood or manipulated by the end user. A phone is.\n\n\nI should clarify then. I mean absolutely basic function, like how to access a basic menu or setting that would just be a top level menu under the universal settings gear icon on Android for example. Or I didn't know for months that doing a pinch drag (top towards middle and bottom towards middle at the same time) opened up a different menu on iphones, and I only learned it because some basic function I needed I couldn't find, had to Google, and found it was in that menu. Why would core functions be inside a screen movement that is effectively hidden. And I promise I'm not a boomer 50 year old who just got my first smart phone.\n\nIt's probably the only device that has been so unintuitive to me, and there only one other piece of modern electronics that is supposed to be easy to use that I had to Google how to function.\n\n\nJust my experience.", "score": 0, "replies": [{"body": "I agree. Some of the swipe options on the new iPhones are ridiculous. \nIt took me a while to figure them out. They did a few stupid things, but I still think the phone is the best on the market for performance overall", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Lmao tell me you got burned by Tesla without telling me you got burned…. \n\nPs teslas are very fun to drive 😏", "score": 7, "replies": []}, {"body": "There are no articles written about Elon Musk or TSLA that are going to change anyone's mind.  Either you are a fanboy and won't listen or you are a hater and won't listen.  Kind of like Dems and Republicans - but worse.", "score": 4, "replies": []}, {"body": "3 years out Tesla 100P", "score": 5, "replies": []}, {"body": "This con artist owns space ships. Might want to rethink your strategy.", "score": 3, "replies": []}, {"body": "This guy posting dailymail as DD. He truly is retarded", "score": 6, "replies": []}, {"body": "I mean he is building spaceships….😳", "score": 3, "replies": []}, {"body": "Op’s thinking he will be the first one to successfully stop the wind with their hands", "score": 3, "replies": []}, {"body": "Is that you Pocahontas?", "score": 6, "replies": []}, {"body": "Another pathetic “trust me bro” post. Fuck off.", "score": 5, "replies": []}, {"body": "How much did Elizabeth Warren pay you to write this?", "score": 7, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|36 seconds ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|9 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rpuymn)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rpuymn)", "score": 1, "replies": []}, {"body": "u/Practical_Echidna959\n\n>Are you holding puts on TSLA for the long term?With TSLA once more skyrocketing, I wonder what's the best strategy for holding puts and minimizing costs in the long term (I'm thinking of gambling 30k in puts over 3 years period)Do you buy near-expiration cheap puts and let them turn to dust?Or buy long-term puts, and roll them as TSLA increases and theta eats the put's value?\n\n>PS: if you don't believe Musk is a conman, and will soon fall, there are some interesting articles which might change your mind:https://www.dailymail.co.uk/sciencetech/article-9347989/Leaked-emails-Tesla-says-Self-Driving-beta-remain-largely-unchanged.htmlhttps://mansionengineer.com/2019/02/04/elon-musk-tesla-and-the-solar-roof-tile-fraud-update/https://www.youtube.com/watch?v=-eS4p-14l2I\n\n!RemindMe 2 years", "score": 2, "replies": [{"body": "I will be messaging you in 2 years on [**2023-12-28 01:14:16 UTC**](http://www.wolframalpha.com/input/?i=2023-12-28%2001:14:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/rpuymn/puts_on_tsla_whats_your_longterm_strategy_for/hq7wx5p/?context=3)\n\n[**4 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Frpuymn%2Fputs_on_tsla_whats_your_longterm_strategy_for%2Fhq7wx5p%2F%5D%0A%0ARemindMe%21%202023-12-28%2001%3A14%3A16%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20rpuymn)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Just wait until Lucid can get close to Teslas monthly delivery numbers- they make a much better version of the same kind of car. No way anyone will be pumping LCID to a $1 trillion mc anytime soon, so most will be able to see that TSLA is legitimately overvalued at that type of valuation. Could see it sharply pull back to $300 billion mc for example", "score": 2, "replies": []}, {"body": "Send me the 30k instead of blowing It on puts", "score": 2, "replies": []}, {"body": "I don’t see Tesla getting “dethroned” anytime soon. They are a decade plus ahead of the “competition” already.", "score": 6, "replies": [{"body": "Not really. Only in Software, and whether that is a good idea in the end… having your car partly controlled by software in our time is ridiculous software security. \nThe rest is pretty underwhelming. \nHowever, I only bet one time against musk. Won’t do it again especially in a market where other really shitty companies are completely overvalued, yet still they don’t go down as they should. \nThe crash that is coming inevitably will be so brutal, that the 2000 crash will look like a minor hiccup.", "score": -3, "replies": [{"body": "Frankly, their software isn’t that far ahead either. There are other automatic cruise control systems that are better than Tesla.", "score": 3, "replies": [{"body": "Got downvoted. Nice. You get an upvote from me for understanding that Tesla not really had any edge, apart from being the first mover.", "score": 2, "replies": []}]}]}]}, {"body": "Here’s the deal, I think Elon is a compulsive liar. At the very least, he severely misleads people by consistently missing deadlines.\n\nUnfortunately, none of us have the balls to put our money where our mouths are because he will just make some shit up and the stock price will go up.", "score": 5, "replies": []}, {"body": "Tesla at $250B market cap is beautiful. Tesla at $1T is a meme. \nIf anyone can explain to me how news of a $4b contract with Hertz can move the stock up by $100b and not be a meme stock then i would love to hear it.", "score": 4, "replies": [{"body": "Here is the benefit to Tesla from the Hertz deal.  \n1. a few analysts still think Tesla has a demand problem, this shuts them up. though Tesla did not need Hertz and made Hertz order the cars the same way as everyone else. 1 at a time.\n2. Hertz is paying to advertise Tesla. \n3. Millions till try out driving Tesla for the first time by renting one and will lead to more demand.\n4. Uber using Tesla, more people riding in Tesla.\n5. Other car rental companies will need to follow Hertz, the only EV maker that can make EVs at volume is Tesla. \n\nDoes the Hertz deal alone make Tesla worth $100b more in market cap? No, the sales of cars to Hertz should have no effect on the market cap. But the reasons listed above DO have value. \n\nA meme stock is one that people buy but there is no justifiably way to make it worth the market cap, like AMC and GME. Tesla current value CAN be argued based on expectations on just vehicle deliveries and keeping margins 30% margin. \n\n$250 million market cap would be a P/E of 8.17\nIf you mean $250B market cap, that is a P/E of 81.7\nForward earnings per share for 2022 is 8.25 (many think it will be higher) which makes forward P/E of 133 from today's stock price. \n\nThe rate of growth that Tesla is expected to have gives 100 P/E a fair value, so Tesla could be seen as over valued by analysts expectations.  But Tesla keeps beating their expectations. \n\nThere are better options to buy puts on, Lucid and Rivian are 2 good companies to buy puts on.", "score": 6, "replies": [{"body": "Meh, sub par explanation. Advertising and potential for more sales is not a reason to move the needle by 100b. Seriously. It’s utterly ridiculous. \nThe reason is, Tesla was dropping from their ATH and then news of hertz broke and everyone re-upped and pushed the stock back to ATH. \nThe pandemic proved the markets are easily manipulated.", "score": 0, "replies": []}]}]}, {"body": "Lmaoooooooooo...  Go ahead bro.  Buy some puts.", "score": 1, "replies": []}, {"body": "BuT iM tOo CoOl rOlLInG cOaL", "score": -1, "replies": []}, {"body": "Lmao this is gonna get alot of hate", "score": 1, "replies": []}, {"body": "Post the 30K position.", "score": 1, "replies": []}, {"body": "Its too early. There need to be sales target misses first (at least twice in a row). Watch norwegian ev sales closely, those indicate future market share of EV companies.", "score": 1, "replies": []}, {"body": "Show me on this picture where the bad man touched you.", "score": 1, "replies": []}, {"body": "RIP", "score": 1, "replies": []}, {"body": "I made money before with Tesla puts but most of the time it’s highly likely you will get your ass kicked.", "score": 1, "replies": []}, {"body": "Buy them man, they will definitely work but please don't sue me when they don't.", "score": 1, "replies": []}, {"body": "Why buy puts on a top s&p stock? Everyone’s money is automatically going into it if you like it or not.", "score": 1, "replies": []}, {"body": "Trash article. Says Elon promised FSD in 2021. Pretty sure he said it was easy and here in a few years in 2016.\n\n\"FSD is a scam\" has been know since 2018 and still moons. Careful with them puts.", "score": 1, "replies": []}, {"body": "Reference is Daily Mail   \nNo chance m8 :D", "score": 1, "replies": []}, {"body": "makes perfect sense. buy 60k in puts and post your position, so I can watch you... ummm, *win*", "score": 1, "replies": []}, {"body": "Tesla worth more than F,. GM,. DODGE, TOYOTA COMBINED 100% STUPIDITY", "score": 1, "replies": []}, {"body": "SHORT SELL TESLA!", "score": 1, "replies": []}, {"body": "RIP", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "The links are outdated and there are lots of positive things have happened since then!", "score": 1, "replies": []}, {"body": "Elon is the biggest scamer since Elizabeth", "score": 1, "replies": []}]}
