{"title": "JPMorgan Says Investors Are Too Bearish, No Selloff In Sight", "selftext": "There’s little reason to fear that the rally that catapulted U.S. stocks to successive records this year will end soon, according to JPMorgan Chase & Co. strategists. In fact, it may get broader. “Conditions for a large selloff are not in place right now given already low investor positioning, record buybacks, limited systematic amplifiers, and positive January seasonals,” the strategists led by Dubravko Lakos-Bujas wrote in a note to clients. “Investor positioning is too bearish -- the market has taken the hawkish central bank and bearish omicron narratives too far.” \n\nWhile the S&P 500 climbed toward yet another record on Monday, the rally has recently been driven by a narrow group of mega-cap companies, which is reminiscent of the bubble in tech stocks at the turn of the century. With the economic rebound following the pandemic-induced slump now past its peak, some fund managers have warned that the next stage in the cycle is a correction, as central banks and governments wind down stimulus measures to tame surging inflation.\n\nThe bullish outlook echoes the one of Goldman Sachs Group Inc. strategists, who also said earlier this month that the narrowing rally doesn’t point to an imminent major drawdown. “Rising concentration is not a reliable indicator for market peaks,” JPMorgan strategists said. “The largest S&P 500 companies currently have proven track record of delivering organic growth, higher pricing power, and superior capital return.”\n\n**Link to the complete article-** [https://www.bloomberg.com/news/articles/2021-12-27/jpmorgan-says-investors-too-bearish-doesn-t-see-stock-selloff](https://www.bloomberg.com/news/articles/2021-12-27/jpmorgan-says-investors-too-bearish-doesn-t-see-stock-selloff)", "id": "rqa7dj", "created_utc": 1640677154.0, "score": 130, "upvote_ratio": 0.91, "num_comments": 82, "comments": [{"body": "[deleted]", "score": 90, "replies": [{"body": "Price to sales ratio increase makes sense with low interest rates and tech stocks. Don’t know what the actual value should be tho", "score": 6, "replies": [{"body": "Tech stocks have been dominant for longer than a year now, as well as interest rates being low much longer than a year. What caused P/S to go up 50% since 2020?", "score": 4, "replies": [{"body": "Extreme margin increases too.\nGoogle etc all had their best years ever due to covid.", "score": 2, "replies": []}, {"body": "The money printer", "score": 1, "replies": []}]}]}, {"body": "Means they need you to stay in a little longer,  few more bags to dump on you", "score": 10, "replies": []}]}, {"body": "Hey guys don’t sell before we do!", "score": 180, "replies": [{"body": "lol...they will let us know after they've sold", "score": 33, "replies": []}, {"body": "They always looking out for others", "score": 13, "replies": []}]}, {"body": "Sell off in sight", "score": 85, "replies": [{"body": "“Hey stupid retail investors, please dump in your money now so we can rug pull you”", "score": 13, "replies": []}, {"body": "Fuuuck I was not worried a single bit, until seeing JPMorgan saying shit like this.", "score": 2, "replies": []}]}, {"body": "Be bearish. Got it.", "score": 65, "replies": []}, {"body": "“Rising concentration is not a reliable indicator for market peaks,” JPMorgan strategists said.\n\nAre they lying or just stupid?", "score": 26, "replies": [{"body": "Both", "score": 6, "replies": []}]}, {"body": "I like how the market currently sits at all time highs but reddits sentiment is bearish. Typically my investing strategy of doing the exact opposite of the Reddit consensus has paid off so maybe now is a good time to throw some extra cash into the market.", "score": 36, "replies": [{"body": "Reddit sentiment is so not bearish. This sub is downright hostile to bears (doesn't help we have a few annoying permabears). Heck as a swing trader I make money even when the market trades sideways and my usually neutral sentiment gets a lot of hostility. The only time this sub is bearish is *after* they lose their money.", "score": 34, "replies": [{"body": "Really? Seems like daily I see a post about comparing this market to the tops of other cycles and Everytime I go into random market chat rooms aka stock twits people are going on and on about the crash , inflation, china, Biden, evergrande, any other reason we could be at a top. To me this is a solid indicator that a lot of people are currently betting against the market which actually keeps us from hitting an insane top.", "score": 6, "replies": [{"body": "chat rooms buying power is like $2, which is why its not a reliable way of measuring market sentiment. also, only bears are talking because 'hurr durr where is the crash ive been waiting since january' while bulls just... buy. and everyone complaining about how its a top, we are gonna crash has been saying this since november 2020 and we are at ATHs again for like the 200th time this year", "score": 1, "replies": []}]}, {"body": "This subreddit is super bearish, quite obvious from comment votes.", "score": -1, "replies": []}, {"body": "What do you swing trade?", "score": 1, "replies": [{"body": "Lots of stuff, usually bluechips these days. MA/V, AMZN, FB, TSM are all recent ones.", "score": 1, "replies": [{"body": "> TSM\n\nI've held this for most of the year and can only imagine the killing you've made from it's ups and downs. As soon as I pass the year mark holding I am cashing out on the next run-up in Q2 2022. Sooo tired of the TSM rollercoaster.", "score": 1, "replies": [{"body": "12k according to etrade. 110 -> 117 or some such. Yeah I can't imagine holding that for a year that'd drive me nuts.", "score": 1, "replies": []}]}]}]}, {"body": "The sentiment has been bearish for months, every day is filled with low effort is this the crash posts.", "score": 1, "replies": []}]}, {"body": "I always felt the big drop in stocks following the December Fed meeting was overdone or it was because of other reasons. I started buying two days after the fall and added to my long positions last week. Traders in this forum have been bearish for a while and though I read their views, I do what I have to", "score": 7, "replies": []}, {"body": "You must be stupid if you think reddit sentiment is bearish lmao", "score": 0, "replies": []}]}, {"body": "Didn't these fuckers just predict a 10% drop for next year? Or was that some other oracle?", "score": 12, "replies": [{"body": "pretty sure that was Morgan", "score": 7, "replies": []}, {"body": "Every random chuckle tuck that works JPM gets called JPM for these articles", "score": 4, "replies": []}, {"body": "JPM literally employs hundreds of equity research analysts across a myriad of commodities, equities, industrial sectors, and geographic areas sitting in offices across six continents. They are quite literally the biggest full service financial institution on planet earth ffs....\n\nIt's not like Jamie Dimond sends an email every morning to the JPMorgan Global distribution list saying \"OK guys, here's our official take on the entire market for 2022 for today. Now get to shilling!\"\n\nDifferent people have different views on which way the market is heading. Just like you and the rest of reddit. Who woulda reckoned that?", "score": 10, "replies": [{"body": "None of that matters if they are lying.", "score": -4, "replies": [{"body": "\"I don't understand how the financial or regulatory systems work and I'm too lazy to learn. So I'll just indignantly assume crime to protect my fragile ego\"", "score": 5, "replies": [{"body": "Is lying a crime?\n\n  \nAnyways, your a tool. I recommend you follow all Major banks & MSM tips from now on; youll do just fine", "score": -7, "replies": [{"body": "ah, you're a teenager. got it, that additional piece of context helps.", "score": 6, "replies": []}]}]}]}]}, {"body": "They change their opinion about everything every three weeks, can't be bothered with these fellas, they don't know. No one does, and if they claim to do so they're liars.", "score": 5, "replies": [{"body": "you most likely think this as JP GS MS have multiple talking heads, sometimes with opposite views. It's the classic Motley Fool thing where their 50 contributors cover each eventuality.", "score": 8, "replies": []}]}]}, {"body": "The main risk is the Fed raising rates. Otherwise, there is no real catalyst on the horizon for a major sell-off. I doubt we return 25% again or anything like that, but I don't expect a -15%+ year.", "score": 6, "replies": [{"body": "Everything was fine with rates back in January 2020. Economy and market were awesome and good growth prospects moving forward. \nCovid hits and scares everyone so fed reduced rates and bought up bonds to keep things going. Now covid has been vaccinated and new omicron is more contagious but symptoms  are more like a cold so we’re effectively past covid. Rate hikes and tapering at worst put monetary policy back to where they were in January 2020. Literally nothing has changed for the overall picture of the economic outlook on a 10 year time frame. It just got smoothed out including the upcoming rate hikes that will put things back to expected norm. \nGoing back to the Expected norm for interest rates in an economy that’s chugging along as expected would not be a real risk. Media likes to pretend it is since fear sells but reality is it’s a non issue at this point. Only real risk related to all this would be a strain that’s actually really bad for mutations for lethality. But viruses tend to evolve the way covid has been where it becomes more transmissible and less potent over time. \nFed raising rates = better for the economy and stocks in the long run.", "score": 4, "replies": [{"body": "I agree\n\nThe vast amounts of stimulus have led to inflation, which as long as it isn't persistent and extremely high, can be a boon. As is more money in consumers' hands", "score": 0, "replies": []}]}, {"body": "Prompt-month futures for crude are currently [~$75/bbl for WTI](https://www.cmegroup.com/markets/energy/crude-oil/west-texas-intermediate-wti-crude-oil-calendar-swap-futures.settlements.html#tradeDate=12%2F27%2F2021) and gas futures are at [~$4.00/mcf](https://www.cmegroup.com/markets/energy/natural-gas/natural-gas.settlements.html#tradeDate=12%2F27%2F2021)......what happens if demand keeps going up? \n\nHow much more do aggregate prices rise if in March we're looking at a domestic commodity price environment of $100/bbl and $5/mcf?\n\nWhat happens if this happens **after** the fed raises interest rates, restricting capital in an inflationary macro environment?", "score": 2, "replies": []}]}, {"body": "Invest in gold, got it", "score": 12, "replies": [{"body": "Jp Morgan shorts gold.", "score": 4, "replies": []}]}, {"body": "Of course, and at the next pullback everyone will panic and the bears will say \"told you\", then another bull run to new ATH, rinse and repeat. Bull market will not end in 2022, we will have less gains, but a 7-10% on SP is almost sure. We will have no rate hikes until the second quarter (and we don't know how many during the year, 3 is the prevision, could be less) and earnings are perfectly fine at the moment.", "score": 17, "replies": [{"body": "How can you say something so controversial yet so brave?", "score": 12, "replies": [{"body": "Balls of steel", "score": 2, "replies": []}, {"body": "Magic", "score": 1, "replies": []}]}, {"body": "!remindme 1 year (just for funsies)", "score": 3, "replies": [{"body": "I will be messaging you in 1 year on [**2022-12-28 13:44:33 UTC**](http://www.wolframalpha.com/input/?i=2022-12-28%2013:44:33%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/rqa7dj/jpmorgan_says_investors_are_too_bearish_no/hq9y93d/?context=3)\n\n[**5 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Frqa7dj%2Fjpmorgan_says_investors_are_too_bearish_no%2Fhq9y93d%2F%5D%0A%0ARemindMe%21%202022-12-28%2013%3A44%3A33%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20rqa7dj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}, {"body": "I will", "score": 0, "replies": []}]}, {"body": "Earnings of what are perfectly fine? The P/E average of the S&P was only higher at two other times ever, and that was 2000 and 2008.", "score": 1, "replies": []}]}, {"body": "It’s interesting how for a few months it was “rising interest rates are bad for tech and growth” and now interest rates are going up and it’s “oh yeah, everything we told you was a lie, thanks for dumping your tech”", "score": 7, "replies": [{"body": "Im on their side they got my some tech cheap, way to go JPM shaking out scared investors so i can get. Discount,", "score": 1, "replies": []}]}, {"body": "Everyone calls sinister motives with these…\n\nOk… how much of such a bank’s assets are tied to prop-trading holdings/investments?\n\nOr is it that the mutual funds/ETFs they run want to dump but don’t want to lower prices?", "score": 2, "replies": []}, {"body": "It is so much easier to be negative and nitpick everything under the sun so it's no different with stocks. We are clearly in a bull run so everyone and their mother is predicting doom and gloom while others think this will last forever. The truth is somewhere in the middle. There will definitely be a correction  but short of a catastrophic event, the market won't completely tank.", "score": 2, "replies": []}, {"body": "There's still too much money on the sidelines. Won't be surprised if the S&P crosses 5,000 before a meaningful pullback occurs.", "score": 2, "replies": [{"body": "Or higher... Pre-christmas sentiments we're mixed due to inflation, omicron and assumed tepid consumer spending. It's now winter and Christmas shopping is over, inflation actually makes investors more likely to move capital into equities.\n\nEverything is right for a bull run to continue through Q1. Only JPow could ruin this now.", "score": 5, "replies": []}]}, {"body": "The bearish sentiment of this subreddit is laughable. So many bitter people who sold.", "score": 2, "replies": []}, {"body": "First talks of a squeeze into january then another too bearish nobody gonna sell.....JP looking to pump and dump us all", "score": 2, "replies": []}, {"body": "put your money in so we can take it before the upcoming bear market", "score": 0, "replies": [{"body": "Or just invest in long enough time horizons that market cycles will pass you by.", "score": 2, "replies": []}]}, {"body": "So, 1/3 $469P… got it", "score": 1, "replies": [{"body": "Save that for Q2. The correction will start when JPow turns off the money supply.", "score": 2, "replies": []}]}, {"body": "So, there'll be a dump in the next 30-60 days. SPY puts it is.", "score": 1, "replies": []}, {"body": "To quote an honest Wallstreet banker, we can all trust: “Fairy dust. It doesn't exist. It's never landed. It is no matter. It's not on the elemental chart. It's not fucking real. Right?”", "score": 1, "replies": []}, {"body": "\"Party like the party will never end.\" -- JPM", "score": 1, "replies": []}, {"body": "Run!!!", "score": 1, "replies": []}, {"body": "\"They're too bearish; nobody is selling.\"\n\nSounds like Yogi Berra is working as an investment banker now...", "score": 1, "replies": []}]}
{"title": "$U United we make tendies, Unity software DD 🚀🚀🌕🌕", "selftext": "**TLDR;** Unity is the only possible option to directly invest in 3D gaming engines with physics which are essential for creating Metaverse and VR games as other possible option Unreal engine (Owned by Epic Games) is not publically traded. Unity Software Inc. is a true FD.\n\n[Remember the logo from ur Fav childhood games ??](https://preview.redd.it/vg3ts1l3n7881.png?width=275&format=png&auto=webp&s=d7fb82c85beb7e8aa1ab75cbaf711fcc4f3273a6)\n\nUnity is a cross-platform game engine developed by Unity Software Inc., ($U), first announced and released in June 2005 at Apple Inc.'s ($AAPL) Worldwide Developers Conference as a Mac OS X-exclusive game engine. The engine has since been gradually extended to support a variety of desktop, mobile, console, and virtual reality platforms. It is particularly popular for iOS and Android mobile game development and used for games such as Pokémon Go, Monument Valley, Call of Duty: Mobile, Beat Saber, and Cuphead. It is considered easy to use for beginner developers and is popular for indie game development. The engine can be used to create three-dimensional (3D) and two-dimensional (2D) games, as well as interactive simulations and other experiences.\n\nI can give you insight as a VR/AR engineer who uses Meta's Oculus to $MSFT's Holo lense to develop games in 3D. Unity is much easier and has fewer bugs compared to the Unreal engine. Unity provides a free trial of their pro version to students making them a choice among future VR engineers.\n\n&#x200B;\n\n* **Now, let's get into some financials**,\n\nThe revenue growth shows a steady increase over the past three years,\n\n[Past three years' revenue increase](https://preview.redd.it/opqmv0p7o7881.png?width=864&format=png&auto=webp&s=478e8c22551bca065bf5562fa4cee15703b19a40)\n\nCompany beats Wall street's expectations in last quarterly results by 7.49%\n\n&#x200B;\n\n[Last quarterly result](https://preview.redd.it/n0vs3is2s7881.png?width=828&format=png&auto=webp&s=17dd56cf15af329f558229897c50f3c11c927a8f)\n\nNo wonder king of Metaverse Mark wanted to get all of its action by trying to acquire it back in 2019[(Link)](https://techcrunch.com/2019/02/13/facebook-mulled-multi-billion-dollar-acquisition-of-unity-book-claims/).  Zuck saw something that we did not? Right now, the company is burning cash like never before to keep their crown of the top choice by giving away a taste of their software for free to students with cheap tech support. (Excellent customer experience gets you, lifelong customers)\n\nHere is the current and next year's expectations\n\n&#x200B;\n\nhttps://preview.redd.it/2ry4eg8ls7881.png?width=415&format=png&auto=webp&s=e2db9b0b1a8ee17415056672f57751ec3df3f823\n\n&#x200B;\n\n[Company burning cash like never before](https://preview.redd.it/4ww9x50pq7881.png?width=925&format=png&auto=webp&s=d69cf91590ac797f1144b786b0ee2bb25b10f8a2)\n\nRight now, the operating expense is around 140% of the revenue for 2021\n\nThe goal of Unity is not to generate profits but to exile their competition to make them a SOLE PROVIDER of the software tools for Metaverse.\n\nTo make the Metaverse more realistic, the recent acquisition of Weta (I know, Meta with a W) might suggest improvement of some ART or NFT in Metaverse.\n\n&#x200B;\n\n* **Technical Analysis:**\n\n[$U on daily](https://preview.redd.it/5dgwspv3u7881.png?width=1791&format=png&auto=webp&s=f2a175488d0c459b23118c8bcae7b1644b00112f)\n\nThe stock has just seen MACD bullish crossover and RSI is in the mid-buy range. The stock has a good 1D moving average as support and is kinda right time to buy. With 150, 160, and 174.5$ as current substantial resistances while 128$ as a reliable support.\n\nCurrent Position: Just 5 Shares at 148.30$ want to add more but looking at market's sentiment.", "id": "rq7i8c", "created_utc": 1640668185.0, "score": 69, "upvote_ratio": 0.85, "num_comments": 82, "comments": [{"body": "United we lose money 🤝\n\nIronyman: \"We'll lose money. You know that right?\"\n\nCaptain Retard: \"And we'll do that together too. Apes strong together. 🦍🦍🦍\"\n\nAvengers: Age of Autists coming to an AMC near you 👊", "score": 23, "replies": [{"body": "Or, we all can feed this UnityCorn bread gains to fuel GME and AMC positions.", "score": 1, "replies": [{"body": "Nice. I just wanted to do that bit for the lulz. Already got a small position of 7 shares. 👍I'm also trying to gauge market sentiment right now.", "score": 2, "replies": []}]}]}, {"body": "Unity is used by nintendo for their games too, iirc, every wiiu game was made with it", "score": 7, "replies": [{"body": "The most recent Pokémon games (Brilliant Diamond/Shining Pearl) were made using Unity iirc", "score": 4, "replies": []}]}, {"body": "Just buy Facebook. It’s actually cash and net income positive and has the lowest PE ratio out of all the FAANG and 50% of S&P500", "score": 12, "replies": [{"body": "Yeah, but going straight up FAANG is not the true WSB retard way to invest.", "score": 7, "replies": [{"body": "No. Losing money is", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Just joining the party?", "score": 2, "replies": []}]}]}, {"body": "What are your current plays on FB?", "score": 2, "replies": []}]}, {"body": "I’m in!", "score": 5, "replies": [{"body": "See you on Moon !!🚀🚀🚀", "score": 4, "replies": [{"body": "On the moon with 5 shares? What’s your PT? Or is there a diner named the moon down the street from your house. Time to DCA into this one for a year and then wait another. Then you’ll see the light of the moon in the night sky and yell FUCK YES!!!!", "score": 2, "replies": [{"body": "This DD was to get more about understanding the market sentiment on the stock, will add more ShArEs not calls late", "score": 2, "replies": []}]}]}]}, {"body": "I long in U too! what do you think of ADSK & PTC?", "score": 4, "replies": [{"body": "Big fan of ADSK", "score": 3, "replies": []}, {"body": "Autodesk is cool, have used their software, but it is for Mechanical cad work, nothing related to metaverse, while no stand on PTC, \nAutodesk has good tools for engineering and they are not providing free softwares generously like $U and matlab or solidworks, but there are companies buying their software as they were in business earlier than others", "score": 1, "replies": [{"body": "Don’t they own Maya?", "score": 7, "replies": []}, {"body": "I wouldn't say nothing to do with metaverse. You use Autodesk files as 3d assets in unity. You don't have to use Autodesk to make it, but is does need to be a .fbx. kind of the whole core of modeling in unity.", "score": 4, "replies": []}, {"body": "Whoa whoa whoa,  you should take a closer look at the portfolio of products autodesk offers.  I have a Matterport camera,  I'm about to get a unity pro license,  and my company is an autodesk house, these can work together really well especially to create a BIM application. But also to do 3d modeling and simulation of most things.", "score": 3, "replies": []}]}]}, {"body": "got u op", "score": 7, "replies": [{"body": "Thank maaaaan !!", "score": 1, "replies": []}]}, {"body": "$U and $MTTR are two of my favorites for a potential shift into realistic virtual spaces becoming more and more prevalent.", "score": 5, "replies": [{"body": "True, MTTR is also a good one, but it is not having physics in simulations like Unity does", "score": 2, "replies": [{"body": "Oh yeah, I almost see them as more of two halves of a whole really. $U provides the physics and bones for which $MTTR renders over.", "score": 3, "replies": [{"body": "But which one provides the boner? That's the stock I plan to invest in.", "score": 6, "replies": [{"body": "$U have to provide the boner yourself.", "score": 7, "replies": []}]}]}, {"body": "I am surprised people not mentioning unity more compared to roblox as a metaverse play", "score": 2, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|20|**First Seen In WSB**|5 months ago\n**Total Comments**|53|**Previous DD**|\n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rq7i8c)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rq7i8c)", "score": 1, "replies": []}, {"body": "U & MTTR to the moonnn 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 3, "replies": []}, {"body": "ARK sold 60K shares of U yesterday", "score": 3, "replies": [{"body": "Cathie sold. Bullish.", "score": 4, "replies": []}, {"body": "She sold a bunch of other stocks too. Read the “note” in the email at the top. They did as part of raising cash for some 2021 ETF event.", "score": 2, "replies": []}, {"body": "True, but the share value did not plummet", "score": 1, "replies": []}]}, {"body": "Bought 5 shares", "score": 3, "replies": []}, {"body": "Algos are set up to auto short any stock mentioned on WSB, gonna have to wait on this one lol", "score": 3, "replies": []}, {"body": "What now? Good time to buy? Why drop?", "score": 3, "replies": [{"body": "Good question, it's been dropping since I put it on this reddit\n\nI guess, the wait for some news on the Metaverse.", "score": 2, "replies": []}]}, {"body": "Any developer will tell you that Unity is the way to go. They dominate AR and VR, there really is no legit competition. I've traded this, but will always keep going back.", "score": 6, "replies": [{"body": "Going back to what fellow ape ?", "score": 1, "replies": [{"body": "Back to owning U", "score": 3, "replies": []}]}]}, {"body": "$U is shit. Everyone in the industry talks bad about it. Half baked technologies and they simple don't care. For that reason I'm out...", "score": 3, "replies": [{"body": "This is the unfortunate truth.", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4553)![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "Weibo(wb) to the game", "score": 2, "replies": []}, {"body": "To the moon or what", "score": 2, "replies": []}, {"body": "Who is their competitor?  \nWhat kind of DD is this LOL.  \nU was lovely at IPO.  \nnot now, with a rising interest rates.  \nTheir reputation arent going up too because they arent focusing on making their engine better.  \nIf they arent careful, unreal might even steal their niche.", "score": 2, "replies": []}, {"body": "I love the company. The stock valuation, not so much. I'd be much more comfortable going in in the 70's", "score": 2, "replies": []}, {"body": "I'm going balls deep In this one. United together", "score": 2, "replies": []}, {"body": "my childhood games were made in 80s and were stored on 5\" floppy disks...", "score": 2, "replies": []}, {"body": "Where can I buy unity ?", "score": 2, "replies": [{"body": "First buy loyalty, then ask for unity.", "score": 0, "replies": [{"body": "Stfu", "score": 2, "replies": []}]}]}, {"body": "Ahh shit", "score": 2, "replies": []}, {"body": "U is a bloated pig just like PLTR. very high chance of becoming a bag holder, imo\n\n$1B rev with $42B in cap. top line growth likely to slow to 30% range.\n\ni dont like the odds, just based on the simple screen above", "score": 4, "replies": [{"body": "Jesus christ I think I found my new short", "score": 2, "replies": []}]}, {"body": "Unreal Engine is years ahead of Unity. You probably just can’t use it properly bc you are retarded.", "score": 4, "replies": [{"body": "Lol, Unity is widely used in Mobile gaming and is lite as well, Zuck wants everyone to be in Metaverse and Unity being a lighter engine for same applications compared to unreal, I belive it has a broader market.", "score": 4, "replies": [{"body": "It’s lighter weight because it’s less powerful, when I’m in the metaverse, I want to feel immersed like I am in another world, not a Minecraft game.", "score": -3, "replies": [{"body": "Ever played beat saber ?", "score": 1, "replies": [{"body": "Yeah, it sucks.", "score": -2, "replies": []}]}]}]}, {"body": "Unity has way more market share in games than unreal.", "score": 3, "replies": [{"body": "Unreal has the market share in the games that count though.", "score": -1, "replies": [{"body": "No, unity has more large revenue projects as well.", "score": 4, "replies": [{"body": "That’s not true.\n\nhttps://www.reddit.com/r/gamedev/comments/8s20qp/i_researched_the_market_share_of_game_engines_on/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 1, "replies": [{"body": "Your numbers are missing extremely large portions of the market entirely. Unity has significantly more large revenue projects than unreal. Like positive integral multiple more, where lifetime revenue >10MM", "score": 3, "replies": [{"body": "Name a single blockbuster game made with unity. There isn’t one, only shitty indie and mobile games.", "score": 1, "replies": [{"body": "You don't seem to understand the business of games.", "score": 3, "replies": [{"body": "Please explain to me how unskilled developers are making more money than games like fortnite and warzone", "score": 1, "replies": []}]}, {"body": "Check Genshin Impact revenue", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I like unity, had it in the 90's earlier this year. Too expensive now, it'll be a good buy after the markets drop.", "score": 2, "replies": []}]}
{"title": "HIMX YOLO Update -- Up around $100,000 in a month. Riding these until $30 share price. Reminds me of early days AMD.", "selftext": "", "id": "rqh5g8", "created_utc": 1640701910.0, "score": 183, "upvote_ratio": 0.84, "num_comments": 74, "comments": [{"body": "Excuse me but 1300% Y/Y net income?", "score": 22, "replies": [{"body": "Izint that very good?", "score": 6, "replies": []}]}, {"body": "love this stock 😍😍😍\n\nStill have some cost basis in the $6's", "score": 18, "replies": []}, {"body": "Himax has good Financials. I wouldn't  compare it to AMD though.", "score": 14, "replies": []}, {"body": "Don't understand the hate you're getting. Thanks for putting this on my radar", "score": 17, "replies": []}, {"body": "Gonna fomo into this, great find OP", "score": 6, "replies": [{"body": "Semi’s have been a play for a while. Just unloved stock.", "score": 4, "replies": []}]}, {"body": "Bummer, had 100 contracts for 1/22/22 16C. Sold after it just traded dead ass sideways for weeks. Would be 400% up if I had still. Good gains OP, nice work.", "score": 10, "replies": []}, {"body": "This stock is to famous in wsb, people go all in PUT", "score": 4, "replies": [{"body": "Oh how come?", "score": 1, "replies": []}]}, {"body": "Clever you bought 2023 calls... Gg", "score": 5, "replies": []}, {"body": "Nice gains op. U r braver then I and deserve better returns. My most aggressive option is the Jan 2023 $10 calls", "score": 3, "replies": []}, {"body": "people who have 80 grand to throw at random options in the first place, wont notice any losses and gains have minimal impact.\n\nAs such, I dont give a fucking shit about this.", "score": 34, "replies": [{"body": "Fuck you and your friends for ruining this sub with your poor mentality. Assholes", "score": 28, "replies": [{"body": "R/antiwork is leaking. Good god I post a 130k gain in one month after several people have pointed out HIMX is undervalued and everyone is angry because I had 80k to spend.", "score": 25, "replies": []}]}, {"body": "Sucks to be poor hey? Keep playing it safe retard!", "score": 9, "replies": []}, {"body": "![gif](emote|free_emotes_pack|sob)", "score": 2, "replies": []}, {"body": "Not random at all lil man. Did a deep dive into this company. 80k isn't even that much you're just poor.", "score": -83, "replies": [{"body": "And you're a cunt.", "score": 32, "replies": [{"body": "Cunt > poor", "score": -29, "replies": [{"body": "Anything > OP", "score": 9, "replies": [{"body": "Except poor people.", "score": 0, "replies": []}]}]}]}, {"body": "You're the type of guy when u have money u feel like God, and when bank goes to zero you can't even spell your name. Good gains btw", "score": 45, "replies": [{"body": "Jealous bitches in wsb. What are we coming to. Being whiny someone has money should be bannable.", "score": 10, "replies": [{"body": "Putting people down cause they don't have money should be bannable, every time out there will be someone who has less or more than you, just be humble, dont be a dickhead. Peace", "score": -1, "replies": [{"body": "No it shouldn’t. Being poor is a sin. \n\nTake your own advice and get back to work earning that hourly pay.", "score": 0, "replies": [{"body": "My dick understand better than your head", "score": -2, "replies": [{"body": "Weak.", "score": 0, "replies": []}]}]}]}]}, {"body": "I've felt like god when I was dirt poor and can't spell my name now. Way off.", "score": -68, "replies": []}]}, {"body": "Lil man? This ape be feeling himself. Please post again when you lose it all, it'll be good therapy for all involved.", "score": 24, "replies": [{"body": "Jeez salty group. I posted a month ago, you could have followed the play. Ill keep you updated on the next one.", "score": -10, "replies": [{"body": "Brush it off bro. \n\n\nPeople hate when others win.", "score": 5, "replies": []}, {"body": "This is how dfv started dude.  Hang in there.", "score": 7, "replies": [{"body": "Ain’t that the truth", "score": 4, "replies": []}]}, {"body": "Please do. I saw it. Didn't follow. Got semi worried about Taiwan... Oops", "score": 3, "replies": []}, {"body": "How's that HIMX treating you lately?", "score": 1, "replies": []}]}, {"body": "What are your gains?", "score": 0, "replies": []}]}, {"body": "Okay. I respect the gains. But you’re being a dick do no reason. 80k is a fucking huge amount of money.", "score": 1, "replies": [{"body": "I'm just reacting to his ridiculous comment and everyone took it personally.", "score": 6, "replies": []}]}]}]}, {"body": "But why though?\nThis crap crashes out every freaking year", "score": 6, "replies": [{"body": "If you're truly interested check out their last earnings report. Their highest margin sector is taking off right now and they've had steady growth the past 3 years. Healthy financials too and Q4 is looking juicy. I truly believe it will be above $25 by end of 2022.", "score": 8, "replies": [{"body": "Why 25?", "score": 2, "replies": [{"body": "If earnings stayed flat which I doubt and it hit 25 then At that time it’s pe would be a whopping 7.8125. Not hard to imagine", "score": 2, "replies": [{"body": "Crazy", "score": 3, "replies": []}]}, {"body": "Rookie numbers on this bracket", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It doesn’t matter much. Often big banks hold for their own mutual funds etc.", "score": 2, "replies": []}]}, {"body": "Weary it’s an ADR", "score": 2, "replies": [{"body": "It’s Taiwan. It’s fine.", "score": 4, "replies": []}]}, {"body": "I’m up another 9.6k today so I’m assuming OP is up quadruple that at least", "score": 2, "replies": [{"body": "Yessir let's go.", "score": 2, "replies": []}]}, {"body": "I'm in ![img](emote|t5_2th52|4258)", "score": 2, "replies": []}, {"body": "APE goes 📉", "score": 3, "replies": [{"body": "burrrnnnn", "score": -4, "replies": []}]}, {"body": "CRSR next", "score": -2, "replies": [{"body": "CRSR sucks man. Tiny niche company with a massive overhang in eagletree.", "score": 3, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|15|**First Seen In WSB**|1 year ago\n**Total Comments**|330|**Previous DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rqh5g8)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rqh5g8)", "score": 1, "replies": []}, {"body": "Thanks for the heads up.", "score": 1, "replies": []}, {"body": "Be my bf and teach me your ways sir", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "OP rolled these or still holding or sold already? It's getting beaten down.", "score": 1, "replies": [{"body": "Why would I roll a 2023 lol? I trimmed a little tho.", "score": 1, "replies": [{"body": "Nevermind didnt see the year. Any more insights before er?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yep. Plus a likely fat dividend. Three years of sustained growth with guidance of double digit growth this year. This is the last time it's gonna trade under 2 billion mc imo.", "score": 2, "replies": []}]}, {"body": "Time to eat up 👏🏼🤌🤌🔥🔥", "score": 1, "replies": []}, {"body": "You go girl! \nhttps://youtu.be/UJmzFjwMRXY", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sold on the way down in tranches. Made about 150% net. Def left some on the table.\n\nJust opened a huge position for June calls (1000 calls) and 10K shares.", "score": 1, "replies": []}]}]}
