{"title": "Entry points on blue chip tech stocks?", "selftext": "[deleted]", "id": "6laeou", "created_utc": 1499209953.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 20, "comments": [{"body": "Fuck FB hold all the other 3 and you'll be good to go. \n\nTo be clear you'll probably be alright with FB as well. I just hate Facebook in general. ", "score": 4, "replies": []}, {"body": "Can't really give you an answer unless we know how long you plan on holding these stocks and what % profit you're looking to gain off these holds. ", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "If your going to be in these for 10-20 years your entry point really doesn't matter. ", "score": 8, "replies": [{"body": "This times 100 ^^^ ", "score": 2, "replies": []}, {"body": "Thanks. Not OP, but this enhanced my determination to hold these.", "score": 1, "replies": []}, {"body": "Why is that?  If you can squeeze an extra couple points out of it early on, wouldn't that be better than buying these a month ago?  ", "score": 1, "replies": []}]}]}]}, {"body": "My heart is bleeding just looking at these numbers. Learned what if feels like to catch the falling knife.", "score": 1, "replies": []}, {"body": "To be honest with you I'm fairly confident we'll see another market collapse within the next 10-20 years so I would personally just wait until that happens and buy in during the collapse. That's just me though.", "score": -4, "replies": [{"body": "You got it chief, will wait 20 years, just in case!", "score": 10, "replies": [{"body": "My 20 year estimate is me just being safe. I personally believe we'll see another market collapse within the next 5-7 years. People will say I'm crazy but I truly believe the collapse will be due in part to a large scale war (wouldn't completely collapse the market, would just shift stock importance) or the tech bubble popping. ", "score": 1, "replies": [{"body": "Why do you believe a large scale war will happen?", "score": 1, "replies": [{"body": "Well I'll give you one of my theories:  In the last 30 years we have almost doubled the worlds population. If we continue at this rate the Earth will reach its maximum capacity in another 10-15 years. I think it's likely that a large scale war or some sort of mass event that limits the population will occur before we reach maximum capacity. Why do I think this? Well, as you cram more and more people into a finite space over an extended period of time, living conditions will inevitably decline, a fight over resources will occur, and on a global scale political tensions are bound to increase.  In my opinion the only way we avoid these issues is through some serious technological advances over the next 10 years, which I personally don't think we as a race will be able to achieve. Just my 2 cents though.\n", "score": 0, "replies": [{"body": "In 500 years maybe", "score": 1, "replies": [{"body": "We've had 2 world wars in the last 100 years and you want to tell me it's not feasible we'll have another one for more 500 years? With logic like that I may as well be talking to a rock. ", "score": 0, "replies": [{"body": "I don't think it's feasible that Earth reaches maximum capacity in 10-15 years. That's ridiculous. Not only that but you said you expect a full scale world war BEFORE then. That gives us a decade. Your 2 cents sounds more akin to a low budget science fiction film than an economic theory that'll apply in our lifetimes.\n\n\nedit: looking through your post history and some of the stocks you've been in recently. $RAD, shorting $SNAP, $DCTH? You're gambling, not investing. No wonder you're a sneaker head, your brain is made of rubber.", "score": 1, "replies": [{"body": "Literally all you have to do is look at our population growth (as of right now we're at more than a 2:1 birth:death ratio) I can personally guarantee we will reach Earth's maximum capacity in the next 30 years. My 10-15 year guess may have been a bit of a scare tactic but we are growing at a rate of approximately 1 billion new people every 10 years. Estimates show that unless people stop eating meat and agree to share resources (which we both know will never happen) the Earth's maximum capacity as far as food is concerned is just under 10 billion. I'll leave you with that, not going to get into my investments with you but I notice you only listed the risky stocks I've been discussing recently. ", "score": 1, "replies": []}, {"body": "LOL Elon musk just came out with an article today that's titled \"The world's population is accelerating quickly towards collapse and nobody cares about it\" You believe me now that I've got daddy Elon on my side or you still in denial?", "score": 1, "replies": [{"body": "First of all, it isn't his article you moron, he was quoting from an article that someone else wrote. \n\nThe article title included the year 2076. 60 years away. Certainly more that the 10-15 years you originally said, and double that of your second timeframe. You aren't right, Musk isn't on \"your\" side. Just because someone shares the same broad idea as you doesn't mean you're on the same page. No one is denying that the world will eventually reach max population, I was simply pointing out that your theories' timeframe is way too soon. \n\nOh and I wasn't cherry picking your gambling stocks, I literally just looked at your last few posts and the stocks you mentioned were penny stocks and r/wallstreetbets style hype stocks.", "score": 1, "replies": [{"body": "Who makes the most money? People playing blue chip 10% per year safe stock picks or those of us with enough balls to all in penny stocks and high risk high reward Wall Street bet stocks?  🤔🤔🤔 you sir will not be invited to the yacht party. Enjoy your miserable future. ", "score": 1, "replies": [{"body": "\nAre you legit retarded or just 15 years old? Have fun going broke by gambling all your min wage job $ away on money pits like $DCTH and $RAD. How about you post up your huge penny stock gains or admit you lost this argument, broke boy?\n\nYou didn't even respond back to my Elon comment because you know I was right. Keep gambling on penny stocks and you'll never have a yacht. \n\nShit, at this rate you won't even be financially afloat by 30.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}
{"title": "What do I do with my TSLA calls?", "selftext": "July 21 expiry, do i trade it for rope or hang onto it until it expires worthless like my MU calls?", "id": "6l8urd", "created_utc": 1499193432.0, "score": 35, "upvote_ratio": 0.91, "num_comments": 24, "comments": [{"body": "Hope people realize Weekly/Monthly Calls are supposed to be traded and you as an individual need to be able to exit it in a timely (Whether thats a mental stop loss with Fundamental changes/ Tech downward momentum or whether its a stop loss of your choice in %) . \n\nIf you are bullish on Tesla Long Term, ITM Calls months out would have been a far better move. Paying for that extra premium will offset the massive losses ", "score": 30, "replies": [{"body": "That was a hard lesson that I learned about my monthly calls. I didn't exit them and watched them bleed .... a lot. ", "score": 10, "replies": [{"body": "watched them bleed .... a lot -- I am increasingly becoming accustomed to this phenomenon, although mine are outright stock buys..", "score": 4, "replies": [{"body": "Welcome to WSB", "score": 1, "replies": []}]}]}]}, {"body": "Sell them at open tomorrow and buy $CUCK leaps.", "score": 9, "replies": []}, {"body": "OP pls respond. are ya still alive and breathin?", "score": 5, "replies": [{"body": "i got fucking rekt end of story , quitting options for a good while", "score": 5, "replies": [{"body": "Gonna cut your dick off now?", "score": 2, "replies": [{"body": "hard to cut whats so small after that loss", "score": 5, "replies": [{"body": "laser removal surgery", "score": 1, "replies": []}, {"body": "shit dude you sold them?....I would have held. Have more faith man. You got in for a reason.", "score": 1, "replies": []}]}]}, {"body": "well this answers my question lmao", "score": 1, "replies": []}]}, {"body": "He ded", "score": 3, "replies": []}]}, {"body": "Watch them go to zero...", "score": 9, "replies": []}, {"body": "How much did you pay for them? And how much are they worth now? ", "score": 3, "replies": [{"body": "If OP is posting this kinda post they are going to be wayyy OTM and now probably down 75%+", "score": 8, "replies": []}]}, {"body": "You either sell them high (for a profit) or you let them bleed long enough to be worthless.. sorry, I don't know what I am trying to say..", "score": 2, "replies": []}, {"body": "Depends on how bloody you think tomorrow will be, imo. You will undoubtedly be best selling them when IV premiums are highest, aka at open", "score": 1, "replies": [{"body": "can it be green? ", "score": 0, "replies": [{"body": "I mean, the only green you can reasonably expect is the $1 you will receive for selling them asap", "score": 2, "replies": []}]}]}, {"body": "did you get rid of them? brutal drop this morning", "score": 1, "replies": []}, {"body": "Hold or die", "score": 0, "replies": []}]}
{"title": "Mental Math on SD Levels based on VIX", "selftext": "I'm trying to do the math that u/living_granger and u/uberbotman have been kindly posting for all of us here in my head.\n\nSay .INX (SPX) closed on Monday at 2429.01, and VIX, which is a blend of options between 23 and 37 days out (avg 30, interpolated), is at 11.22, and say we can take this number to be a proxy for IV, or annualized SD. \n\nGiven this information, one should be able to quickly calculate what 1SD is for tomorrow, Wednesday. I think an easier way to do this would be to think of the 11.22 as something that needs to be compared against the magic number 16 (256^0.5 , assuming roughly 256 working days in a year). \n\nSo 11.22 /16 is roughly 0.75, and 0.75% of the SPX sets our value at roughly 18. The interesting thing is, if VIX is at 16, 1SD is 1% of SPX (24.29). At 8, it's 0.5% (12.1), and so on. \n\nI'm hoping this makes things easier for people who like making snap judgements with some rough math in their head. I think it's valuable because those levels aren't ever exact, and one should be able to form a reasonably accurate estimate of levels quickly based on a chart.\n\nCritique of technique welcome, especially from u/living_granger and u/uberbotman.", "id": "6lajb1", "created_utc": 1499211600.0, "score": 24, "upvote_ratio": 0.89, "num_comments": 22, "comments": [{"body": "Why not just use the IV from the current month's futures contract which is provided on platform?  It is specific to the contract. \n\nMaybe I missed something but your method seems overly convoluted. ", "score": 3, "replies": [{"body": "Would be the same thing, effectively, no? I'm thinking most of those will show you the same annualized SD. I just find looking at SPX and VIX the first thing on the am is easier. YMMV.", "score": 1, "replies": [{"body": "No \n\n\nVIX is the square root of implied variance of the whole expiration. That means we're taking into account all the OTM options that trade on a much higher vol. I would say ATM vol is more accurate than VIX in determining the market's expectation for daily moves. Most accurate would be the closest expiring ATM option. VIX is usually around the same vol of a 30delta put. ", "score": 3, "replies": [{"body": "Thanks for the tip, I'll Mary to backrest this for support / resistance.", "score": 1, "replies": [{"body": "> Thanks for the tip, I'll Mary to backrest this for support / resistance.\n\nDoesn't Mary have enough on her back already?\n", "score": 2, "replies": [{"body": "Gah, typing on a phone... ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "https://youtu.be/LbYZZHGkDio", "score": 5, "replies": [{"body": "- VIX is the ticker symbol for the Volatility Index, which shows the market's expectation of 30-day volatility. It is constructed using the implied volatilities of a wide range of both calls and puts on S&P options\n\n\n- Standard deviation is a statistical term that measures the amount of variability or dispersion around an average\n\nVIX represents the annualized magnitude of a 1 standard deviation move (1% of SPX).\n\nVIX is at 11.22 today that means 1 standard deviation move in the SPX will be +- 11.22% one year from today.\n\nThere are 256 market days in a year,\n\n    11.22 / sqrt(256)\n    11.22/16 = 0.70% // Not sure how OP is getting 0.75 \n    0.70% move in 1 day\n\nwhen VIX is at 11.22, 1 SD = 0.70%\n", "score": 8, "replies": [{"body": "> VIX represents the annualized magnitude of a 1 standard deviation move ~~(1% of SPX).~~\n\nFTFY.\n\n> 11.22/16 = 0.70% // Not sure how OP is getting 0.75 \n\nGood catch. I'm doing this in my head as 12/16 or slightly under .75. All the calculations are meant to be done almost instinctively, so the simplification. Possibly over simplified a bit.\n\n\n", "score": 3, "replies": [{"body": "I see.\n\nI just remember 9/16 is 56. Then add +6 for every +1 on VIX. \n\n10/16 is 56 + 6 = 62\n\n11/16 is 62 + 6 = 68 etc", "score": 2, "replies": [{"body": "Yup!", "score": 2, "replies": []}]}]}]}, {"body": "I didn't do a great job of explaining the method, but u/uberbotman did [here.](http://reddit.com/r/wallstreetbets/comments/6jitm2/come_one_come_all_standard_deviations_for_all/)", "score": 3, "replies": []}]}, {"body": "Yep, this is pretty much how you should be doing it when considering which options are cheap or expensive intraday", "score": 3, "replies": [{"body": "It's also a good tool to look at the IV for an option and think of what kind of price percentage move it reflects. \n\n> Ooh, MU options for July have an IV of 40%? They're pricing in a 2/3 probability of the price staying within +/- 2.5%.\n\nEdit: meant to start with *I just realized...*", "score": 1, "replies": [{"body": "How do you guesstimate the price movement percentage? Just the weekly highs and low?", "score": 2, "replies": [{"body": "No guessing involved. IV is another way of saying % move. IV is basically the square root of the variance of a stock from its mean over an annual period. Once you know IV, you can calculate the variance of a stock over a day (annual / number of days in year), take its square root to get the day's standard deviation (a dollar amount by which the price may vary). At this point, it should be a no brainer to get % from this number.", "score": 1, "replies": [{"body": "Ah I see I see. So IV is SD. Fuck this makes more sense then, no wonder some stock options have huge premiums. ", "score": 1, "replies": []}]}]}]}]}, {"body": "VIX does not follow standard deviations. It follows $GS.", "score": 3, "replies": [{"body": "Tru dat. And King Cheeto's tweets.", "score": 7, "replies": []}]}, {"body": "Noob here. What is SD? Thanks.", "score": 1, "replies": [{"body": "Standard Deviation.", "score": 1, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}]}
